{"status": "ok", "totalResults": 54, "articles": [{"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "A massive asteroid, size of a ship, near Earth today! - HT Tech", "description": "Asteroid just made a close pass to Earth today on February 22, 2022 at 2:54 a.m. EST (07:54 UTC). It was clearly visible with a telescope.", "url": "https://tech.hindustantimes.com/tech/news/a-massive-asteroid-size-of-a-ship-near-earth-today-71645503779244.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/02/22/1600x900/SPACE-EXPLORATION-ASTEROID-0_1644002463059_1645503897543.JPG", "publishedAt": "2022-02-22T04:26:22Z", "content": "A giant space rock named Asteroid 1999 VF22 just passed Earth today, February 22, 2022. The asteroid was closest to Earth at 2:54 a.m. EST (07:54 UTC) on February 22. It was just 3.3 million miles (5… [+1588 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "Cosmic Rewiring: Scientists Detect Signs of Changes in Astronauts' Brains After Long Spaceflights | The Weather Channel - Articles from The Weather Channel | weather.com - The Weather Channel", "description": "The team compared before and after impacts of spaceflights and carried out eight follow-up scans seven months after spaceflight - Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/space/news/2022-02-22-scientists-detect-signs-of-changes-in-astronauts-brains", "urlToImage": "https://s.w-x.co/in-mars%20astronauts.jpg", "publishedAt": "2022-02-22T04:08:18Z", "content": "Space travel is the next big thing in the story of modern human progress. Rusty world Mars is one such top destination for space travel in the coming decades. However, using current technologies woul… [+2979 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "NASA-ESA's solar orbiter captures largest 'solar prominence eruption' ever observed - ANI News", "description": "Paris [France], February 22 (ANI): The Solar Orbiter spacecraft, a joint project of the American National Aeronautics and Space Administration (NASA) and the European Space Agency (ESA) has captured the largest solar prominence eruption ever observed in a sin…", "url": "https://www.aninews.in/news/world/others/nasa-esas-solar-orbiter-captures-largest-solar-prominence-eruption-ever-observed20220222092547", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/FL3bX3gXddMAAS5L_2022022202441820220222035413-thumbnail-154x87-70.jpg", "publishedAt": "2022-02-22T03:58:04Z", "content": "Paris [France], February 22 (ANI): The Solar Orbiter spacecraft, a joint project of the American National Aeronautics and Space Administration (NASA) and the European Space Agency (ESA) has captured … [+1716 chars]"}, {"source": {"id": null, "name": "EurekAlert"}, "author": null, "title": "Carbon-negative platform turns waste gases into valuable chemicals - EurekAlert", "description": "A team of scientists from LanzaTech, Northwestern University and the Department of Energy’s Oak Ridge National Laboratory have developed carbon capture technology that harnesses emissions from industrial processes to produce acetone and isopropanol, known as …", "url": "https://www.eurekalert.org/news-releases/944027", "urlToImage": "https://earimediaprodweb.azurewebsites.net/Api/v1/Multimedia/f14e9bdd-fd03-4e49-9f6b-2b13af40d36a/Rendition/thumbnail/Content/Public", "publishedAt": "2022-02-22T02:01:11Z", "content": "image: Scientists from LanzaTech, Northwestern University and Oak Ridge National Laboratory engineered a microbe, shown in light blue, to convert molecules of industrial waste gases, such as carbon d… [+6947 chars]"}, {"source": {"id": null, "name": "Balkantravellers.com"}, "author": "Izer", "title": "Astrophysicists say that \"planetary intelligence\" exists...but the Earth has no intelligence - Balkan Travellers", "description": "We tend to think of intelligence as something that describes only one individual. But all kinds of groups can be described as intelligent, too - whether", "url": "https://www.balkantravellers.com/astrophysicists-say-that-planetary-intelligence-exists-but-the-earth-has-no-intelligence/", "urlToImage": null, "publishedAt": "2022-02-22T01:38:53Z", "content": "We tend to think of intelligence as something that describes only one individual. But all kinds of groups can be described as intelligent, too – whether we’re talking about social groups of humans, p… [+3832 chars]"}, {"source": {"id": null, "name": "Earth.com"}, "author": null, "title": "Greenland Ice Sheet is the world's largest \"dam\" - Earth.com", "description": "Greenland Ice Sheet is the world’s largest \"dam\" • Earth.com", "url": "https://www.earth.com/news/greenland-ice-sheet-is-the-worlds-largest-dam/", "urlToImage": "https://cff2.earth.com/uploads/2022/02/21115555/Greenland-Ice-Sheet-scaled.jpg", "publishedAt": "2022-02-21T20:23:19Z", "content": "A new study led by the University of Cambridge has discovered extremely high rates of melting at the bottom of the Greenland Ice Sheet, caused by the huge quantities of meltwater falling from the sur… [+2544 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Elizabeth Howell", "title": "James Webb Space Telescope will study Milky Way's flaring supermassive black hole - Space.com", "description": "Sagittarius A* flickers every hour, making it a challenging target for telescopes.", "url": "https://www.space.com/webb-flaring-milky-way-black-hole", "urlToImage": "https://cdn.mos.cms.futurecdn.net/FPDHNm5Vm5CqtdsKwWj9dP-1200-80.png", "publishedAt": "2022-02-21T18:19:25Z", "content": "The James Webb Space Telescope will study the weirdly flickering black hole at the heart of our galaxy, the Milky Way, which has proved elusive for existing telescopes to explore. \r\nWebb will join th… [+2779 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Free-fall flights prove the feasibility of producing oxygen on the Moon and Mars | Research - BollyInside", "description": "Now, a team led by Mark Symes at the University of Glasgow, UK, have conducted water electrolysis experiments within this range for the first time. They", "url": "https://www.bollyinside.com/news/free-fall-flights-prove-the-feasibility-of-producing-oxygen-on-the-moon-and-mars-research", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2021/12/Elon-Musk-rejects-mounting-criticism-that-his-satellites-are-obstructing.png", "publishedAt": "2022-02-21T18:18:23Z", "content": "Now, a team led by Mark Symes at the University of Glasgow, UK, have conducted water electrolysis experiments within this range for the first time. They used a centrifuge system on board freefall fli… [+2555 chars]"}, {"source": {"id": null, "name": "AiThority"}, "author": "Sudipto Ghosh", "title": "DrivenData and HeroX Announce New Crowdsourcing Challenge for Mars Exploration - AiThority", "description": "HeroX is Supporting a New Crowdsourcing Challenge that Provides Context for Exploring the Conditions Necessary for Life on Mars in the Past using Data ScienceDrivenData, in collaboration with HeroX, have announced their newest crowdsourcing competiti", "url": "https://aithority.com/technology/big-data/drivendata-and-herox-announce-new-crowdsourcing-challenge-for-mars-exploration/", "urlToImage": "https://aithority.com/wp-content/uploads/2022/02/Six-Must-Dos-to-Win-Over-Your-Customers-Brain-2.png", "publishedAt": "2022-02-21T18:01:47Z", "content": "HeroX is Supporting a New Crowdsourcing Challenge that Provides Context for Exploring the Conditions Necessary for Life on Mars in the Past using Data Science\r\nDrivenData, in collaboration with HeroX… [+4779 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "PTI", "title": "What are asteroids made of? Solar System's building blocks revealed! - HT Tech", "description": "What are asteroids made of? A sample returned to Earth reveals the Solar System's building blocks", "url": "https://tech.hindustantimes.com/tech/news/what-are-asteroids-made-of-solar-system-s-building-blocks-revealed-71645464293066.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/02/21/1600x900/SPACE-EXPLORATION-ASTEROID-0_1645465402232_1645465444615.JPG", "publishedAt": "2022-02-21T17:52:08Z", "content": "Just over 12 months ago, we were sitting at Woomera, in the Australian outback, waiting for a streak of light in the sky to testify that the Hayabusa2 spacecraft had returned from its voyage to colle… [+6112 chars]"}, {"source": {"id": null, "name": "Balkantravellers.com"}, "author": "Izer", "title": "Liquid gems may rain from the sky on this hot exoplanet - Balkan Travellers", "description": "A massive gas giant orbiting a star about 855 light-years from Earth, WASP-121b may contain mineral clouds and rain made of liquid gemstones, according to", "url": "https://www.balkantravellers.com/liquid-gems-may-rain-from-the-sky-on-this-hot-exoplanet/", "urlToImage": "", "publishedAt": "2022-02-21T17:37:39Z", "content": "A massive gas giant orbiting a star about 855 light-years from Earth, WASP-121b may contain mineral clouds and rain made of liquid gemstones, according to new research. First discovered in 2015, the … [+3628 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "The formation of the West Antarctic Ice Sheet was very different than previously believed - Phys.org", "description": "Roughly 35 million years ago, Earth cooled rapidly. At roughly the same time, the Drake Passage formed between South America and the Antarctic, paving the way for the Antarctic Circumpolar Current. Thanks to these two factors, Antarctica was soon completely c…", "url": "https://phys.org/news/2022-02-formation-west-antarctic-ice-sheet.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/the-formation-of-the-w.jpg", "publishedAt": "2022-02-21T17:24:44Z", "content": "Roughly 35 million years ago, Earth cooled rapidly. At roughly the same time, the Drake Passage formed between South America and the Antarctic, paving the way for the Antarctic Circumpolar Current. T… [+5264 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Nikhil Khattar", "title": "SpaceX Launch 4 Dozens Of Satellites To Space Through Falcon 9 Today - Watch Video - India.com", "description": "You can watch it live at Space.com, courtesy of SpaceX or directly via the company. Reportedly, SpaceX planned to launch the satellites on Sunday, but had to cancel because of the bad weather. Watch this video to know about the launch by SpaceX in detail.", "url": "https://www.india.com/video-gallery/spacex-launch-4-dozens-of-satellites-to-space-through-falcon-9-today-watch-video-5251116/", "urlToImage": "https://static.india.com/wp-content/uploads/2022/02/spacex.jpg", "publishedAt": "2022-02-21T17:06:00Z", "content": "For breaking news and live news updates, like us on Facebook or follow us on Twitter and Instagram. Read more on Latest News on India.com. \r\nTopics:falcon 9spacexSpaceX latest newsSpaceX Satelliteste… [+88 chars]"}, {"source": {"id": null, "name": "The Tribune India"}, "author": "The Tribune India", "title": "Mars Ingenuity helicopter still going strong: Report - The Tribune", "description": "Even after 19 Red Planet flights under its belt in a year, NASA's Mars helicopter Ingenuity is not done yet.", "url": "https://www.tribuneindia.com/news/schools/mars-ingenuity-helicopter-still-going-strong-report-371846", "urlToImage": "https://englishtribuneimages.blob.core.windows.net/gallary-content/2022/2/2022_2$largeimg_599593054.jpg", "publishedAt": "2022-02-21T14:58:00Z", "content": "Washington, February 21\r\nEven after 19 Red Planet flights under its belt in a year, NASA's Mars helicopter Ingenuity is not done yet.\r\nThe little chopper landed with NASA's Perseverance rover on the … [+1863 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Metal mix and match: An unexpected discovery could improve the crystallinity of coordination nanosheets - Science Daily", "description": "Coordination nanosheets are emerging 2D materials with a wide range of applications. However, highly crystalline nanosheets are difficult to synthesize through solution-based approaches. In a recent study, scientists found a simple strategy to improve the str…", "url": "https://www.sciencedaily.com/releases/2022/02/220221085731.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-02-21T14:04:17Z", "content": "Coordination nanosheets are a new and emerging class of two-dimensional materials, rapidly gaining importance in the field of nanomaterials. They consist of metal ions and organic ligand molecules, l… [+4264 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Sam Tonkin", "title": "Universe's largest known galaxy is discovered measuring around 16.3 MILLION light-years long - Daily Mail", "description": "Alcyoneus, which is 3 billion light-years away from Earth, may help shed light on how radio galaxies form and why they are so big, according to experts led by Leiden Observatory in the Netherlands.", "url": "https://www.dailymail.co.uk/sciencetech/article-10534831/Universes-largest-known-galaxy-discovered-measuring-16-3-MILLION-light-years-long.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/02/21/13/54459441-0-image-a-19_1645448449261.jpg", "publishedAt": "2022-02-21T13:22:26Z", "content": "The largest known galaxy has been discovered by astronomers  measuring in at a whopping 153 times the size of our own Milky Way.\r\nNamed Alcyoneus, the galaxy is around 3 billion light-years away from… [+6702 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": "Agence France-Presse", "title": "China denies making space junk set to crash into Moon on 4 March - Firstpost", "description": "The space junk is believed to be the booster for the Change 5-T1, launched in 2014 as part of the Chinese space agencys lunar exploration programme", "url": "https://www.firstpost.com/world/china-denies-making-space-junk-set-to-crash-into-moon-on-4-march-10396011.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2022/01/china-flag.jpg", "publishedAt": "2022-02-21T13:14:45Z", "content": "China on Monday denied responsibility for a rocket set to slam into the Moon, after experts said the piece of space junk likely came from Beijing's lunar exploration programme.\r\nAstronomers initially… [+1151 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "'Wide-Eyed' Parker Solar Probe Captures Stunning, First-of-Their-Kind Images of Venus's Surface in Visible Light | The Weather Channel - Articles from The Weather Channel | weather.com - The Weather Channel", "description": "The credit belongs to the spacecraft's Wide-Field Imager or WISPR, which managed to capture surface features of the planet’s nightside. - Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/space/news/2022-02-21-parker-solar-probe-captures-stunning-images-of-venuss-surface", "urlToImage": "https://s.w-x.co/in-venus_flyby.gif", "publishedAt": "2022-02-21T13:13:27Z", "content": "The US space agency NASAs Parker Solar Probe is a high achiever. Launched in August 2018, this small car-sized probe is revolutionising our understanding of the Sun. Its the first human-made object t… [+2809 chars]"}, {"source": {"id": null, "name": "TASS"}, "author": "TASS", "title": "Cygnus cargo spacecraft docks with ISS — NASA - TASS", "description": "The spacecraft delivered over 3.7 tonnes of various cargo to the Space Station - food, spare parts and scientific equipment, including for research of skin aging in zero gravity and medications’ effect on tumors, as well as a new plant growing system", "url": "https://tass.com/science/1407129", "urlToImage": "https://tass.com/img/blocks/common/tass_logo_share_ru.png", "publishedAt": "2022-02-21T12:55:04Z", "content": "NEW YORK, February 21. /TASS/. The US-made Cygnus cargo spacecraft docked the International Space Station Monday, according to a livestream at the NASA website.\r\nThe docking happened at 15:02 Moscow … [+837 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Hubble captures image of three galaxies merging 681 million light years away - The Indian Express", "description": "When galaxies merge, the clouds of gas and dust that are part of galaxies collide with each other, sometimes resulting in the formation of new stars.", "url": "https://indianexpress.com/article/technology/science/hubble-captures-image-of-three-galaxies-merging-681-million-light-years-away-7784048/", "urlToImage": "https://images.indianexpress.com/2022/02/HubbleGalaxyMerger2.jpg", "publishedAt": "2022-02-21T12:28:07Z", "content": "The Hubble Space Telescope has captured an image of the galaxy merger IC 2431, which is happening over 618 million light years away from the Earth in the constellation Cancer, according to the Europe… [+1234 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Astronauts to grow plants without soil in space, NASA shares video - Mint", "description": "Northrop Grumman's Cygnus spacecraft was launched Saturday after on an Antares rocket from NASA’s Wallops Flight Facility in Virginia.", "url": "https://www.livemint.com/science/news/astronauts-to-grow-plants-without-soil-in-space-nasa-shares-video-11645443171021.html", "urlToImage": "https://images.livemint.com/img/2022/02/21/600x338/Cygnus_spacecraft_1645444527769_1645444527963.jpg", "publishedAt": "2022-02-21T12:02:27Z", "content": "Cygnus spacecraft, which is carrying a fresh supply of 8,300 pounds of scientific investigations and cargo, has reached International Space Station on Monday, less than two days after it was launched… [+896 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": null, "title": "Widest ever separation of brown dwarf pair discovered by scientists - ThePrint", "description": "California [US], February 21 (ANI): A brown dwarf is an astronomical object that is an intermediate between a planet and a star. Brown dwarfs usually have a mass less than 0.075 that of the Sun or roughly 75 times that of Jupiter. A team of astronomers has di…", "url": "https://theprint.in/science/widest-ever-separation-of-brown-dwarf-pair-discovered-by-scientists/840934/", "urlToImage": null, "publishedAt": "2022-02-21T12:00:19Z", "content": "California [US], February 21 (ANI): A brown dwarf is an astronomical object that is an intermediate between a planet and a star. Brown dwarfs usually have a mass less than 0.075 that of the Sun or ro… [+4144 chars]"}, {"source": {"id": null, "name": "Daily Record"}, "author": "Graeme Murray, Hannah Mackenzie Wood", "title": "93-million-year-old crocodile uncovered with baby dinosaur in its belly - Daily Record", "description": "Experts have dubbed the creature Confractosuchus Sauroktonos or 'broken crocodile dinosaur killer', with its last meal of a prehistoric baby still in the belly.", "url": "https://www.dailyrecord.co.uk/news/uk-world-news/93-million-year-old-crocodile-26288016", "urlToImage": "https://i2-prod.dailyrecord.co.uk/incoming/article26287779.ece/ALTERNATES/s1200/4_TO-GO-WITH-AFP-STORY-PHILIPPINES-ENVIRONjpeg.jpg", "publishedAt": "2022-02-21T11:36:35Z", "content": "A 93-million-year-old crocodile has been discovered by scientists - with an infant dinosaur found in its stomach. \r\nExperts have dubbed the creature Confractosuchus Sauroktonos or \"broken crocodile d… [+2967 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "James Webb Space Telescope's mirrors align 1st starlight in a hexagon, reveals NASA - Republic World", "description": "The James Webb Space Telescope has brought the 18 unfocused images of a star into a hexagonal formation by moving each of its 18 primary mirror segments.", "url": "https://www.republicworld.com/science/space/james-webb-space-telescopes-mirrors-align-1st-starlight-in-a-hexagon-reveals-nasa-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/1ccwxlwfuegluqio_1645438660.jpeg", "publishedAt": "2022-02-21T10:25:00Z", "content": "Engineers handling the James Webb Space Telescope have achieved another milestone as they recently completed the Segment Image Identification phase of mirror alignment. With the completion of the fir… [+2490 chars]"}, {"source": {"id": null, "name": "Newsnetnebraska.org"}, "author": "Karen Hines", "title": "Gentlemen, we figured out how to get to Mars in a few days - News Net Nebraska", "description": "Space, time, technology and many other complex things to manage keep us at inhuman distances...", "url": "https://www.newsnetnebraska.org/gentlemen-we-figured-out-how-to-get-to-mars-in-a-few-days/", "urlToImage": "https://www.newsnetnebraska.org/wp-content/uploads/2022/02/Gentlemen-we-figured-out-how-to-get-to-Mars-in.jpg", "publishedAt": "2022-02-21T10:00:35Z", "content": "Space, time, technology and many other complex things to manage keep us at inhuman distances from other stars. If we want to reach another star system on a journey that does not last for several huma… [+1669 chars]"}, {"source": {"id": null, "name": "Techbullion.com"}, "author": "Angela Scott-Briggs, TechBullion", "title": "Using Satellite Cameras to Reveal the Ocean’s Acidity from Space - TechBullion", "description": "Satellites cameras are vital to our understanding of Earth and its ecosystems. As the effects of climate change intensify and become more obvious, satellite technology and Earth observation tools become more and more important. Using a satellite camera in spa…", "url": "https://techbullion.com/using-satellite-cameras-to-reveal-the-oceans-acidity-from-space/", "urlToImage": "https://techbullion.com/wp-content/uploads/2022/02/Satellite-Cameras.jpg", "publishedAt": "2022-02-21T09:51:55Z", "content": "Satellites cameras are vital to our understanding of Earth and its ecosystems. As the effects of climate change intensify and become more obvious, satellite technology and Earth observation tools bec… [+4891 chars]"}, {"source": {"id": null, "name": "Thehansindia.com"}, "author": "Susmita Modak", "title": "Species Of Armless Dinosour Found In Argentina - The Hans India", "description": "The dinosaur, called Guemesia ochoai and discovered from a single skull, is likely to be a member of ...", "url": "https://www.thehansindia.com/offbeat/species-of-armless-dinosour-found-in-argentina-730232", "urlToImage": "https://assets.thehansindia.com/h-upload/2022/02/21/1277978-dinosaur.jpg", "publishedAt": "2022-02-21T09:45:27Z", "content": "Paleontologists in Argentina have discovered a new dinosaur species with forearms that were so weak that it would make the Tyrannosaurus rex appear like Popeye.\r\nThe dinosaur, called Guemesia ochoai … [+2346 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Dynamic origin of the dwarf planet Ceres - BollyInside", "description": "The captured bodies have a 70% probability to have a semimajor axis between 2.5 and 3 au, a 33% probability to have an eccentricity smaller than 0.2 and a", "url": "https://www.bollyinside.com/news/dynamic-origin-of-the-dwarf-planet-ceres", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2021/12/Elon-Musk-rejects-mounting-criticism-that-his-satellites-are-obstructing.png", "publishedAt": "2022-02-21T09:18:23Z", "content": "The captured bodies have a 70% probability to have a semimajor axis between 2.5 and 3 au, a 33% probability to have an eccentricity smaller than 0.2 and a 45% probability to have an orbital inclinati… [+1319 chars]"}, {"source": {"id": null, "name": "TweakTown"}, "author": "Jak Connor", "title": "NASA Mars rover films clouds drifting across the Martian sky - TweakTown", "description": "NASA has published a short movie of clouds drifting high in the sky above one of its Mars rovers, showing clouds do exist on Mars.", "url": "https://www.tweaktown.com/news/84681/nasa-mars-rover-films-clouds-drifting-across-the-martian-sky/index.html", "urlToImage": "https://static.tweaktown.com/news/8/4/84681_01_nasa-mars-rover_full.jpg", "publishedAt": "2022-02-21T09:17:02Z", "content": "NASA has published a short movie shot by one of its Mars rovers of Martian clouds drifting high sky, allowing scientists to understand the planet more.\r\nIf you have ever wondered if there are clouds … [+732 chars]"}, {"source": {"id": null, "name": "Voonze.com"}, "author": "https://www.facebook.com/TheDeepLines", "title": "Scientists achieve DNA analysis in record time, to speed up clinical diagnoses - InTallaght", "description": "An in-depth genetic analysis can contribute to the issuance of a timely clinical diagnosis, to focus treatment on the specific condition being faced.A task that usually takes up to two weeks was reduced to just over five hours, thanks to an artificial intelli…", "url": "https://voonze.com/scientists-achieve-dna-analysis-in-record-time-to-speed-up-clinical-diagnoses/", "urlToImage": "https://i0.wp.com/voonze.com/wp-content/uploads/2022/02/captura20.jpg?fit=1123%2C632&ssl=1", "publishedAt": "2022-02-21T07:25:09Z", "content": "An in-depth genetic analysis can contribute to the issuance of a timely clinical diagnosis, to focus treatment on the specific condition being faced.\r\nA task that usually takes up to two weeks was re… [+2781 chars]"}, {"source": {"id": null, "name": "Inquirer.net"}, "author": null, "title": "SpaceX loses 40 Starlink satellites due to geomagnetic storms - INQUIRER.net", "description": "When a SpaceX rocket launched 49 satellites to join Starlink last February 3, 40 of those satellites were hit by a geomagnetic storm just a day later.", "url": "https://pop.inquirer.net/119968/spacex-loses-40-starlink-satellites-due-to-geomagnetic-storms", "urlToImage": "https://pop.inquirer.net/files/2022/02/000_8VA6NZ-620x861-1.jpg", "publishedAt": "2022-02-21T06:48:32Z", "content": "On the 3rd of February, SpaceX (Elon Musks aerospace company) launched 49 satellites to add to their Starlink internet mega constellation. A day later, 40 of those newly launched satellites were doom… [+2355 chars]"}, {"source": {"id": null, "name": "Pro-gamer.co.uk"}, "author": "Nicola Dixon", "title": "NASA’s Swift Observatory is again to observing gamma-ray bursts - ProGamer", "description": "NASA’s Swift Observatory, which investigates high-energy phenomena like gamma-ray bursts, has returned to operations following a problem which pressured it ... Read moreNASA’s Swift Observatory is again to observing gamma-ray bursts", "url": "https://www.pro-gamer.co.uk/nasas-swift-observatory-is-again-to-observing-gamma-ray-bursts/", "urlToImage": "https://icdn.digitaltrends.com/image/digitaltrends/swift1-720x720.jpg", "publishedAt": "2022-02-21T04:18:42Z", "content": "NASAs Swift Observatory, which investigates high-energy phenomena like gamma-ray bursts, has returned to operations following a problem which pressured it into secure mode final month.\r\nNASAs Neil Ge… [+2242 chars]"}, {"source": {"id": null, "name": "BBC Focus Magazine"}, "author": "Colin Stuart", "title": "Why is the ISS being retired and what will happen to it? - BBC Science Focus Magazine", "description": "NASA has set out a timeline for the last decade of the ageing space station's life that includes private occupants, movies and a watery grave.", "url": "https://www.sciencefocus.com/news/why-is-the-iss-being-retired-and-what-will-happen-to-it/", "urlToImage": "https://images.immediate.co.uk/production/volatile/sites/4/2022/02/ocs_iss_0-b6b64ce.jpeg?quality=45&resize=960,413", "publishedAt": "2022-02-21T04:00:00Z", "content": "It is one of the most iconic pieces of space hardware in history, but the days of the International Space Station are now officially numbered. NASA has announced that the curtain will finally fall on… [+4752 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": null, "title": "Scientists discover the third rocks around the alien sun - The Times Hub", "description": "Home » Technology » Scientists discover the third rocks around the alien sun February 21, 2022 Astronomers have found evidence of a third planet around the star closest to the sun, bolstering the idea that planets are common around galactic stars, even some o…", "url": "https://thetimeshub.in/scientists-discover-the-third-rocks-around-the-alien-sun", "urlToImage": "https://thetimeshub.in/wp-content/uploads/2022/02/7bcb7292f00e078c4c87913e1fc4e997.jpg", "publishedAt": "2022-02-21T01:30:05Z", "content": "Home » Technology » Scientists discover the third rocks around the alien sun February 21, 2022 \r\nAstronomers have found evidence of a third planet around the star closest to the sun, bolstering the i… [+4580 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "WATCH: Fireball Streaks Across Colorado Friday Evening - CBS Denver", "description": "Did you happen to see a fireball streak across Colorado's skies on Friday night? The American Meteor Society says they received 30 reports of the celestial e...", "url": "https://www.youtube.com/watch?v=kms9MEFVSvQ", "urlToImage": "https://i.ytimg.com/vi/kms9MEFVSvQ/maxresdefault.jpg", "publishedAt": "2022-02-21T00:59:47Z", "content": null}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Lake County News,California – Space News: New missions to the Sun to help NASA better understand the Earth-Sun environment - BollyInside", "description": "These missions will provide deeper insights into our universe and offer critical information to help protect astronauts, satellites, and communications", "url": "https://www.bollyinside.com/news/lake-county-newscalifornia-space-news-new-missions-to-the-sun-to-help-nasa-better-understand-the-earth-sun-environment", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2021/12/Elon-Musk-rejects-mounting-criticism-that-his-satellites-are-obstructing.png", "publishedAt": "2022-02-20T23:18:25Z", "content": "These missions will provide deeper insights into our universe and offer critical information to help protect astronauts, satellites, and communications signals such as GPS. MUSE and HelioSwarm will p… [+3126 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Fighting Fire With Fire: New International Space Station Experiments Study Flames in Space - SciTechDaily", "description": "Americans can feel safer in their homes now than decades ago thanks to studies and standards that have removed highly flammable materials in clothing, beds, and furniture. NASA relies on similar studies and standards to protect astronauts when selecting mater…", "url": "https://scitechdaily.com/fighting-fire-with-fire-new-international-space-station-experiments-study-flames-in-space/", "urlToImage": "https://scitechdaily.com/images/Fire-Experiment-Space-Station.gif", "publishedAt": "2022-02-20T22:27:07Z", "content": "Americans can feel safer in their homes now than decades ago thanks to studies and standards that have removed highly flammable materials in clothing, beds, and furniture. NASA relies on similar stud… [+4447 chars]"}, {"source": {"id": null, "name": "Overtells.com"}, "author": "Arzu", "title": "Scientists suggest injecting living microbes into galaxies with the help of laser impulses - OverTells Gaming", "description": "Published: February 20, 2022 21:29 GMT Experts plan to use a small semiconductor probe with a margin to protect it from radiation during work. A team of", "url": "https://overtells.com/scientists-suggest-injecting-living-microbes-into-galaxies-with-the-help-of-laser-impulses/", "urlToImage": "https://cdni.rt.com/actualidad/public_images/2022.02/article/6211749c59bf5b37543cfa62.jpg", "publishedAt": "2022-02-20T21:29:00Z", "content": "Experts plan to use a small semiconductor probe with a margin to protect it from radiation during work.\r\n A team of scientists is proposing to launch microbes living in miniature ‘ships’ into galaxy … [+2287 chars]"}, {"source": {"id": null, "name": "SlashGear"}, "author": "Brittany Roston", "title": "New ISS Science Projects Target Skin Aging, Tumors, And Gardening In Space - SlashGear", "description": "The latest ISS cargo launch went smoothly and now 8,300 pounds of supplies are on their way to the space station. Among the cargo are several new experiments.", "url": "https://www.slashgear.com/774427/new-iss-science-projects-target-skin-aging-tumors-and-gardening-in-space/", "urlToImage": "https://www.slashgear.com/img/gallery/new-iss-science-projects-target-skin-aging-tumors-and-gardening-in-space/l-intro-1645391319.jpg", "publishedAt": "2022-02-20T21:11:00Z", "content": "Astronauts on the ISS dedicate their time to conducting various experiments, among other things, that provide valuable data on everything from growing food in space to microgravity's effects on human… [+1564 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Starlink surprises NASA as rivals seek FCC protection of ~30000 satellites - BollyInside", "description": "This application, which was filed last year is facing criticism from both competitors and government agencies, with the complaints ranging from the number", "url": "https://www.bollyinside.com/news/starlink-surprises-nasa-as-rivals-seek-fcc-protection-of-30000-satellites", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2021/12/Elon-Musk-rejects-mounting-criticism-that-his-satellites-are-obstructing.png", "publishedAt": "2022-02-20T20:58:25Z", "content": "This application, which was filed last year is facing criticism from both competitors and government agencies, with the complaints ranging from the number of satellites that Starlink aims to put in o… [+3902 chars]"}, {"source": {"id": null, "name": "Fiorreports.com"}, "author": "Becca Roberts", "title": "This Reddit thread of mind-blowing science is the craziest thing you'll read this week - Fior Reports", "description": "Science is full of weird and crazy things.  From how our bodies work to the way light moves through space, there is much that can surprise and fascinate us.  Now a bunch of users on Reddit have started a massive thread full of mind-blowing scien", "url": "https://fiorreports.com/this-reddit-thread-of-mind-blowing-science-is-the-craziest-thing-youll-read-this-week/", "urlToImage": "https://i0.wp.com/fior-reports.s3.amazonaws.com/wp-content/uploads/2022/02/20150021/bgrpic-copy-11.jpg?fit=800%2C511&ssl=1", "publishedAt": "2022-02-20T20:00:26Z", "content": "Science is full of weird and crazy things. From how our bodies work to the way light moves through space, there is much that can surprise and fascinate us. Now a bunch of users on Reddit have started… [+2436 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "SpaceX takes the lead in space tourism - BollyInside", "description": "One year later, The Washington Post is reporting Isaacman just reserved three more flights with SpaceX — two more Falcon 9/Crew Dragon combos, to be", "url": "https://www.bollyinside.com/news/spacex-takes-the-lead-in-space-tourism", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2021/12/Elon-Musk-rejects-mounting-criticism-that-his-satellites-are-obstructing.png", "publishedAt": "2022-02-20T16:18:24Z", "content": "One year later, The Washington Post is reporting Isaacman just reserved three more flights with SpaceX two more Falcon 9/Crew Dragon combos, to be followed by a privately crewed mission that will tak… [+2587 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "The Day John Glenn Made American History: 60th Anniversary - NASA Johnson", "description": "Where were you in ’62?  On Feb. 20 of that year, U.S. Marine Lt. Col. John Glenn became the first American to orbit the Earth, piloting Friendship 7 three ti...", "url": "https://www.youtube.com/watch?v=9Ar0y6tIx74", "urlToImage": "https://i.ytimg.com/vi/9Ar0y6tIx74/maxresdefault.jpg", "publishedAt": "2022-02-20T16:00:04Z", "content": null}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "ANI", "title": "How does Venus flytrap snap shut? Scientists reveal the secret! - The Siasat Daily", "description": "California: Venus flytrap is a carnivorous plant that catches its prey (chiefly insects and arachnids) with a trapping structure formed by the terminal portion of each of the plant's leaves. How this happens is a question that has often plagued people. Now, s…", "url": "https://www.siasat.com/how-does-venus-flytrap-snap-shut-scientists-reveal-the-secret-2279170/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2022/02/venus_feb20.jpg", "publishedAt": "2022-02-20T13:44:00Z", "content": "California: Venus flytrap is a carnivorous plant that catches its prey (chiefly insects and arachnids) with a trapping structure formed by the terminal portion of each of the plant’s leaves. How this… [+4765 chars]"}, {"source": {"id": null, "name": "Thebharatexpressnews.com"}, "author": null, "title": "Ancient Virus From The Age Of Dinosaurs Found Lurking Inside Every Human - The bharat express news", "description": "An ancient virus, dating back to the age of the dinosaurs, has been spotted by scientists in an unexpected location. \"It's kind of hidden in plain sight", "url": "https://www.thebharatexpressnews.com/ancient-virus-from-the-age-of-dinosaurs-found-lurking-inside-every-human/", "urlToImage": "https://i2-prod.dailystar.co.uk/incoming/article26281656.ece/ALTERNATES/s615b/0_Tyrannosaurus-Rex-or-T-Rex-dinosaur-in-woods.jpg", "publishedAt": "2022-02-20T13:35:57Z", "content": "An ancient virus, dating back to the age of the dinosaurs, has been spotted by scientists in an unexpected location.\r\n“It’s kind of hidden in plain sight in the human genome,” says Aris Katzourakis o… [+1979 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Space Missions To Watch: A Lunar Return, a Jupiter Moon, and the Most Powerful Rocket Ever Built - SciTechDaily", "description": "Space travel is all about momentum. Rockets turn their fuel into momentum that carries people, satellites, and science itself forward into space. 2021 was a year full of records for space programs around the world, and that momentum is carrying forward into 2…", "url": "https://scitechdaily.com/space-missions-to-watch-a-lunar-return-a-jupiter-moon-and-the-most-powerful-rocket-ever-built/", "urlToImage": "https://scitechdaily.com/images/SpaceX-Starship-Lunar-Colony-scaled.jpg", "publishedAt": "2022-02-20T13:03:33Z", "content": "Artist’s rendering of a SpaceX Starship leaving a lunar colony. Credit: SpaceX\r\nSpace travel is all about momentum.\r\nRockets turn their fuel into momentum that carries people, satellites, and science… [+6737 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Patrick Pester", "title": "Are there any giant animals humans haven't discovered yet? - Livescience.com", "description": "Don't hold your breath on Bigfoot.", "url": "https://www.livescience.com/giant-animals-humans-have-not-discovered", "urlToImage": "https://cdn.mos.cms.futurecdn.net/tnkEznDD9PR2rtzpXMNcDH-1200-80.jpg", "publishedAt": "2022-02-20T12:00:00Z", "content": "In 2020, researchers saw for the first time what may be the longest animal ever\r\n. The creature, spotted in a deep-sea canyon off Australia, was a roughly 150-foot-long (45 meters) siphonophore. Each… [+6010 chars]"}, {"source": {"id": null, "name": "See.news"}, "author": "Rana Atef", "title": "Chinese Chang'e-4 Rover Discovers 2 Glass Globules on Moon's Far Side - See", "description": "The Chinese lunar rover Chang'e-4 has discovered two tiny glass globules on the far side of the moon during an", "url": "https://see.news/chinese-change-4-rover-discovers-2-glass-globules-on-moon/", "urlToImage": "https://see.news/wp-content/uploads/2022/02/ChangE-4_-_PCAM.png", "publishedAt": "2022-02-20T11:00:03Z", "content": "The Chinese lunar rover Chang’e-4 has discovered two tiny glass globules on the far side of the moon during an exploratory mission, media agencies reported on Sunday.\r\nA study published in Science Bu… [+1467 chars]"}, {"source": {"id": null, "name": "MENAFN.COM"}, "author": "MENAFN", "title": "James Webb Telescope images star twinkling 18 times - MENAFN.COM", "description": "<a href =https://menafn.com/updates/pr/2022-02/20/I_b1a4eefe-f_Image_In_Body.jpg target=_blank><br/><img src='https://menafn.com/updates/pr/2022-", "url": "https://menafn.com/1103730180/James-Webb-Telescope-images-star-twinkling-18-times", "urlToImage": "https://menafn.com/updates/pr/2022-02/20/I_ac46fimage_story.jpg", "publishedAt": "2022-02-20T10:15:44Z", "content": "(MENAFN- IANS) \r\nWashington, Feb 20 (IANS) The James Webb Space Telescope is nearing completion of the first phase of the months-long process of aligning the observatory's 18-segmented primary mirror… [+2845 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Rohit Ranjan", "title": "NASA says Tonga volcanic eruption made world's tallest ash plume ever seen by satellites - Republic World", "description": "NASA stated that the Tonga volcano eruption in the Pacific in January that blasted into the atmosphere was the tallest ash plume ever observed by satellites.", "url": "https://www.republicworld.com/world-news/rest-of-the-world-news/nasa-says-tonga-volcanic-eruption-made-worlds-tallest-ash-plume-ever-seen-by-satellites-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/khiv37qfjlxvvjvi_1645345209.jpeg", "publishedAt": "2022-02-20T08:58:00Z", "content": "NASA stated that the Tonga volcano eruption in the Pacific in January that blasted into the atmosphere was the tallest ash plume ever observed by satellites. As per the reports of Insider, two weathe… [+2315 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Chaotic features present the ultimate visual spectacle on Mars - BollyInside", "description": "This time, it’s not the dunes that take center stage, but large mounds of light-toned deposits. By large, scientists mean features that are miles thick,", "url": "https://www.bollyinside.com/news/chaotic-features-present-the-ultimate-visual-spectacle-on-mars", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2021/12/Elon-Musk-rejects-mounting-criticism-that-his-satellites-are-obstructing.png", "publishedAt": "2022-02-20T07:38:23Z", "content": "This time, its not the dunes that take center stage, but large mounds of light-toned deposits. By large, scientists mean features that are miles thick, and by deposits, they generally mean a chaotic … [+1073 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Science News | Researchers Identify Sudden Evolutionary Change in Flowers - LatestLY", "description": "Get latest articles and stories on Science at LatestLY. Evolution is defined as the change in the characteristics of a species over several generations and relies on the process of natural selection. A recent study by researchers has identified an unexpected …", "url": "https://www.latestly.com/agency-news/science-news-researchers-identify-sudden-evolutionary-change-in-flowers-3385523.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2020/10/news-default-img-784x441.jpg", "publishedAt": "2022-02-20T06:00:26Z", "content": "California [US], February 20 (ANI): Evolution is defined as the change in the characteristics of a species over several generations and relies on the process of natural selection. A recent study by r… [+8886 chars]"}, {"source": {"id": null, "name": "physicsworld.com"}, "author": null, "title": "Gravitational time dilation measured on centimetre and millimetre scales in atomic clocks – Physics World - Medical Physics Web", "description": "Experiments could lead to \"relativistic geodesy\"", "url": "https://physicsworld.com/a/gravitational-time-dilation-measured-on-centimetre-and-millimetre-scales-in-atomic-clocks/", "urlToImage": "https://physicsworld.com/wp-content/uploads/2022/02/Tim-Wogan-atomic-slock-small.jpg", "publishedAt": "2022-02-20T04:28:04Z", "content": "Changing times: JILA researchers measured time dilation within this tiny cloud of strontium atoms. (Courtesy: R Jacobson/NIST)\r\nTwo independent teams of researchers in the US have used differential m… [+6077 chars]"}, {"source": {"id": null, "name": "TASS"}, "author": "TASS", "title": "Soyuz-2.1a rocket carrying Progress spacecraft blasts off from Baikonur - TASS", "description": "It is scheduled to dock with the International Space Station (ISS) at 10:08 am Moscow time on February 17", "url": "https://tass.com/science/1403255", "urlToImage": "https://phototass1.cdnvideo.ru/width/1200_4ce85301/tass/m2/en/uploads/i/20220215/1347991.jpg", "publishedAt": "2022-02-15T04:53:39Z", "content": "MOSCOW, February 15. /TASS/. A Soyuz-2.1 rocket carrying the Progress cargo spacecraft has blasted off from Site 31 at the Baikonur spaceport, according to a live broadcast on the website of Russia’s… [+1215 chars]"}]}