{"status": "ok", "totalResults": 56, "articles": [{"source": {"id": null, "name": "Deccan Herald"}, "author": "AFP", "title": "Mysterious object in Milky Way 'spooks' astronomers - Deccan Herald", "description": "Australian researchers have discovered a strange spinning object in the Milky Way, which, they say, is unlike anything astronomers have ever seen. The object, first spotted by a university student working on his undergraduate thesis, releases a huge burst of …", "url": "https://www.deccanherald.com/science-and-environment/mysterious-object-in-milky-way-spooks-astronomers-1075113.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/01/27/043569-01-02-1-1075113-1643253481.jpg", "publishedAt": "2022-01-27T03:10:01Z", "content": "Australian researchers have discovered a strange spinning object in the Milky Way, which, they say, is unlike anything astronomers have ever seen.\r\nThe object, first spotted by a university student w… [+2405 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "International Space Station Flies 260 Miles Above Denver - CBS Denver", "description": "What does the Mile High City look like from 260 miles up? The International Space Station passed over Denver just after 10 p.m. MST on Tuesday.", "url": "https://www.youtube.com/watch?v=3eRzCub1MVE", "urlToImage": "https://i.ytimg.com/vi/3eRzCub1MVE/maxresdefault.jpg", "publishedAt": "2022-01-27T02:24:13Z", "content": null}, {"source": {"id": null, "name": "LatestLY"}, "author": "Team Latestly", "title": "Before the Desert That Stands Today, Liquid Water Flowed on the Surface of Mars Longer a ... - Latest Tweet - LatestLY", "description": "The latest Tweet by NASA states, 'Before the desert that stands today, liquid water flowed on the surface of Mars longer a lot more recently than previously thought — by about a billion years! Data from @NASAJPL’s Mars Reconnaissance Orbiter tells us more. Di…", "url": "https://www.latestly.com/socially/technology/science/before-the-desert-that-stands-today-liquid-water-flowed-on-the-surface-of-mars-longer-a-latest-tweet-by-nasa-3296995.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2021/04/nasa-784x441.jpg", "publishedAt": "2022-01-27T01:40:25Z", "content": "Before the desert that stands today, liquid water flowed on the surface of Mars longer a lot more recently than previously thought by about a billion years! Data from @NASAJPLs Mars Reconnaissance Or… [+633 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "SpaceX Rocket Junk Will Crash Into Moon In March, Say Experts - NDTV", "description": "A chunk of a SpaceX rocket that blasted off seven years ago and was abandoned in space after completing its mission will crash into the Moon in March, experts say.", "url": "https://www.ndtv.com/world-news/space-news-spacex-recklessly-abandoned-spacex-rocket-junk-will-soon-crash-into-the-moon-2731847", "urlToImage": "https://c.ndtvimg.com/2021-04/kcqsg3m8_super-moon-nasa_625x300_27_April_21.jpg", "publishedAt": "2022-01-26T23:41:53Z", "content": "A chunk of a SpaceX rocket that was abandoned in space will crash into the Moon in March.\r\nWashington: A chunk of a SpaceX rocket that blasted off seven years ago and was abandoned in space after com… [+3415 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "When light loses symmetry, it can hold particles - Phys.org", "description": "Optical tweezers use light to immobilize microscopic particles as small as a single atom in 3D space. The basic principle behind optical tweezers is the momentum transfer between light and the object being held. Analogous to the water pushing on a dam that bl…", "url": "https://phys.org/news/2022-01-symmetry-particles.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/when-light-loses-symme.jpg", "publishedAt": "2022-01-26T20:59:03Z", "content": "Optical tweezers use light to immobilize microscopic particles as small as a single atom in 3D space. The basic principle behind optical tweezers is the momentum transfer between light and the object… [+2302 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Fourth signature of the superconducting transition in cuprates: The results cap 15 years of detective work aimed at understanding how these materials transition into a superconducting state where they can conduct electricity with no loss. - Science Daily", "description": "Superconductors have four classic traits, including conducting electric current without loss and levitating magnets. Now the discovery of the fourth and final trait caps 15 years of detective work.", "url": "https://www.sciencedaily.com/releases/2022/01/220126122419.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-26T20:41:46Z", "content": "When an exciting and unconventional new class of superconducting materials was discovered 35 years ago, researchers cheered.Like other superconductors, these materials, known as copper oxides or cupr… [+5255 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "SpaceX Navy Deploys for Back-to-Back Italian Radar Satellite, Starlink Launches - BollyInside", "description": "Instead, the rare back-to-back alignment of two commercial missions that will both allow SpaceX to perform return-to-launch-site (RTLS) Falcon 9 booster", "url": "https://www.bollyinside.com/news/spacex-navy-deploys-for-back-to-back-italian-radar-satellite-starlink-launches", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2021/12/Elon-Musk-rejects-mounting-criticism-that-his-satellites-are-obstructing.png", "publishedAt": "2022-01-26T20:38:21Z", "content": "Instead, the rare back-to-back alignment of two commercial missions that will both allow SpaceX to perform return-to-launch-site (RTLS) Falcon 9 booster landings will only require the deployment of o… [+2283 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "NASA's Day of Remembrance: Paying Tribute to Fallen Heroes - SciTechDaily", "description": "NASA will honor members of the NASA family who lost their lives while furthering the cause of exploration and discovery, including the crews of Apollo 1 and space shuttles Challenger and Columbia, during the agency's annual Day of Remembrance Thursday, Januar…", "url": "https://scitechdaily.com/nasas-day-of-remembrance-paying-tribute-to-fallen-heroes/", "urlToImage": "https://scitechdaily.com/images/Graves-of-Apollo-1-Crew-Members.jpg", "publishedAt": "2022-01-26T20:11:00Z", "content": "BySciTechDailyJanuary 26, 2022\r\nThe graves of Apollo 1 crew members Virgil Grissom and Roger Chaffee seen during a wreath-laying ceremony as part of NASA’s 2018 Day of Remembrance at Arlington Nation… [+3765 chars]"}, {"source": {"id": null, "name": "Toysmatrix.com"}, "author": "Eli Pacheco", "title": "Machine learning points to prime Antarctica spots to find meteorites - Toys Matrix", "description": "The hunt for meteorites may have just gotten some new leads. A powerful new machine learning algorithm has identified over 600 hot spots in Antarctica where scientists are likely to find a bounty of the fallen alien rocks, researchers report Janu", "url": "https://toysmatrix.com/machine-learning-points-to-prime-antarctica-spots-to-find-meteorites/", "urlToImage": "https://www.sciencenews.org/wp-content/uploads/2022/01/012622_cg_antarctica-meteorites_feat.jpg", "publishedAt": "2022-01-26T19:35:04Z", "content": "The hunt for meteorites may have just gotten some new leads. A powerful new machine learning algorithm has identified over 600 hot spots in Antarctica where scientists are likely to find a bounty of … [+2630 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Kate Blackwood", "title": "Binary black hole spin behavior revealed using novel techniques - Phys.org", "description": "Research done at Cornell University has uncovered from gravitation wave data the first potential signs of spin-orbit resonances in binary black holes, a step toward understanding the mechanisms of supernovas and other big questions in astrophysics.", "url": "https://phys.org/news/2022-01-binary-black-hole-behavior-revealed.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/binary-black-hole-spin.jpg", "publishedAt": "2022-01-26T19:28:31Z", "content": "Research done at Cornell University has uncovered from gravitation wave data the first potential signs of spin-orbit resonances in binary black holes, a step toward understanding the mechanisms of su… [+5535 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "NASA's Oceans Melting Greenland – Mission Complete - NASA Jet Propulsion Laboratory", "description": "NASA's Oceans Melting Greenland (OMG) mission recently concluded a six-year field campaign in Greenland to measure how much the ocean is contributing to glob...", "url": "https://www.youtube.com/watch?v=PwGGN-DIvuM", "urlToImage": "https://i.ytimg.com/vi/PwGGN-DIvuM/maxresdefault.jpg", "publishedAt": "2022-01-26T19:04:07Z", "content": null}, {"source": {"id": null, "name": "Theregister.com"}, "author": "Richard Speed", "title": "ESA's Solar Orbiter sneaks in bonus science by choking on the dust of a comet tail (again) - The Register", "description": "Plucky probe due to make closest pass to the Sun in March", "url": "https://www.theregister.com/2022/01/26/solo_comet/", "urlToImage": "https://regmedia.co.uk/2020/02/10/solo_lift_off.jpg", "publishedAt": "2022-01-26T17:59:00Z", "content": "The European Space Agency's Solar Orbiter followed up its whizz past Earth as 2021 drew to a close by passing through the tail of a comet. Again.\r\nWhile eyes were turned to French Guiana and the impe… [+2131 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Harry Baker", "title": "Bizarre sea worm with regenerative butts named after Godzilla's monstrous nemesis - Livescience.com", "description": "The unusual invertebrate spends most of its life living inside a sponge.", "url": "https://www.livescience.com/new-king-ghidorah-worm-discovered", "urlToImage": "https://cdn.mos.cms.futurecdn.net/pdu6BnRHQ7srFuh9JVYB45-1200-80.jpg", "publishedAt": "2022-01-26T17:35:32Z", "content": "The newly discovered branched sea worm Ramisyllis kingghidorahi. In this image, worms single head (left) and asymmetrical posterior branches (right) are clearly visible.  (Image credit: M Aguado)\r\nA … [+3588 chars]"}, {"source": {"id": null, "name": "Space.com"}, "author": "Chelsea Gohd", "title": "Could a spacecraft 'catch up' to interstellar visitor 'Oumuamua in just 26 years? - Space.com", "description": "Could we send a spacecraft to the giant, cigar-shaped interstellar interloper 'Oumuamua? Should we?", "url": "https://www.space.com/oumuamua-space-rock-interstellar-asteroid-comet-spacecraft", "urlToImage": "https://cdn.mos.cms.futurecdn.net/zgSZKKvVtpBRYub6YdWTpU-1200-80.jpg", "publishedAt": "2022-01-26T17:00:36Z", "content": "Could we send a spacecraft to the giant, cigar-shaped interstellar interloper 'Oumuamua? Should we?\r\nIn 2017, astronomers detected a space rock from another solar system whizzing through our cosmic n… [+3070 chars]"}, {"source": {"id": "national-geographic", "name": "National Geographic"}, "author": "Michael Greshko", "title": "World’s brightest x-rays reveal COVID-19’s damage to the body - National Geographic", "description": "A new scanning technique delivers exquisitely detailed images—and could revolutionize the study of human anatomy.", "url": "https://www.nationalgeographic.com/science/article/worlds-brightest-x-rays-reveal-covid-19-damage-to-the-body", "urlToImage": "https://i.natgeofe.com/n/4ee52452-dbb1-48e5-9d7f-5b9343ceaace/MM9847_211214_0295_16x9.jpg?w=1200", "publishedAt": "2022-01-26T16:29:17Z", "content": "When Paul Tafforeau saw his first experimental scans of a COVID-19 victims lung, he thought he had failed. A paleontologist by training, Tafforeau had been laboring with a team strewn across Europe f… [+14722 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "ANI", "title": "Researchers discover extraordinary black hole in neighbouring galaxy - The Siasat Daily", "description": "Utah: Recently, astronomers have discovered a black hole unlike any other. At one hundred thousand solar masses, it is smaller than the black holes found at the centres of galaxies, but bigger than the black holes that are born when stars explode, making made…", "url": "https://www.siasat.com/researchers-discover-extraordinary-black-hole-in-neighbouring-galaxy-2264979/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2021/07/Black-Hole.jpg", "publishedAt": "2022-01-26T15:55:00Z", "content": "Utah: Recently, astronomers have discovered a black hole unlike any other. At one hundred thousand solar masses, it is smaller than the black holes found at the centres of galaxies, but bigger than t… [+4709 chars]"}, {"source": {"id": null, "name": "Theubj.com"}, "author": "Hitesh Rane", "title": "NASA's 'Psyche' Spacecraft Has The Mission To Orbit World! - The UBJ", "description": "NASA has said that its Psyche spacecraft will orbit the world we can scarcely pinpoint from Earth. Clarifying further on", "url": "https://theubj.com/tech/28279/nasas-psyche-spacecraft-has-the-mission-to-orbit-world/", "urlToImage": "https://i0.wp.com/theubj.com/wp-content/uploads/2022/01/pia24473-psyche-spacecraft-16.jpg?fit=1600%2C900&ssl=1", "publishedAt": "2022-01-26T15:30:00Z", "content": "NASA has said that its Psyche spacecraft will orbit the world we can scarcely pinpoint from Earth. Clarifying further on its bounteously vaunted mission, the space connection said that the spacecraft… [+1446 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Amanda Morris", "title": "Nearly 1,000 mysterious strands revealed in Milky Way's center - Phys.org", "description": "An unprecedented new telescope image of the Milky Way galaxy's turbulent center has revealed nearly 1,000 mysterious strands, inexplicably dangling in space.", "url": "https://phys.org/news/2022-01-mysterious-strands-revealed-milky-center.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/nearly-1000-mysterious.jpg", "publishedAt": "2022-01-26T15:17:32Z", "content": "An unprecedented new telescope image of the Milky Way galaxy's turbulent center has revealed nearly 1,000 mysterious strands, inexplicably dangling in space.\r\nStretching up to 150 light years long, t… [+7291 chars]"}, {"source": {"id": null, "name": "Core77.com"}, "author": null, "title": "NASA Design Competition Seeks Ideas for Managing Garbage, Human Waste During Mars Journey - Core77.com", "description": "As nomadic tribes knew, horses are the perfect closed-loop transportation system. Their fuel is grass, and their waste product is fertilizer. Given an appropriate climate and a route that includes sources of water, you can travel indefinitely. The rider only …", "url": "https://www.core77.com/posts/111814/NASA-Design-Competition-Seeks-Ideas-for-Managing-Garbage-Human-Waste-During-Mars-Journey", "urlToImage": "https://s3files.core77.com/blog/images/lead_n_spotlight/1233123_lead_400_111814_.jpg", "publishedAt": "2022-01-26T15:00:12Z", "content": "As nomadic tribes knew, horses are the perfect closed-loop transportation system. Their fuel is grass, and their waste product is fertilizer. Given an appropriate climate and a route that includes so… [+2932 chars]"}, {"source": {"id": null, "name": "Live Science"}, "author": "Elizabeth Howell", "title": "Eta Carinae's epic supernova explosion comes to life in new visualization - Livescience.com", "description": "Data from three space telescopes help tell the story of the impending supernova.", "url": "https://www.livescience.com/eta-carinae-supernova-visualization", "urlToImage": "https://cdn.mos.cms.futurecdn.net/TiaB8VoZ2LqRzxDCM4XCc7-1200-80.jpeg", "publishedAt": "2022-01-26T13:26:54Z", "content": "A new visualization shows the power of an epic star explosion erupting in deep space.\r\nThe video shows the famous explosion in the Eta Carinae star system that briefly made it the brightest object in… [+2717 chars]"}, {"source": {"id": null, "name": "Nanowerk"}, "author": null, "title": "Silicon fluorescence shines through microcracks in cement, revealing early signs of damage - Nanowerk", "description": "Researchers discovered by chance that common Portland cement contains nanocrystals of silicon that emit near-infrared fluorescence when illuminated with visible light.", "url": "https://www.nanowerk.com/nanotechnology-news2/newsid=59625.php", "urlToImage": "https://www.nanowerk.com/nanotechnology-news2/id59625.jpg", "publishedAt": "2022-01-26T12:03:29Z", "content": "Nanowerk Newsletter\r\nGet our daily Nanotechnology News to your inbox!"}, {"source": {"id": null, "name": "Republic World"}, "author": "Harsh Vardhan", "title": "NASA completes Artemis 1 countdown test; steps closer to 2022 launch - Republic World", "description": "NASA said that no issues were reported during the test, which is one of the final ones ahead of the uncrewed Artemis 1 mission to the Moon.", "url": "https://www.republicworld.com/science/space/nasa-completes-artemis-1-countdown-test-steps-closer-to-2022-launch-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/9yond9ubzu3agdsl_1643195090.jpeg", "publishedAt": "2022-01-26T11:41:00Z", "content": "NASA engineers have successfully completed the second countdown sequencing test of its Space Launch System (SLS) rocket, taking the preparations for the first lunar mission to its next stage. In a bl… [+1823 chars]"}, {"source": {"id": null, "name": "Design Products & Applications"}, "author": "", "title": "- Robotic grippers are delicate enough to lift egg yolks - Design Products & Applications", "description": "Engineering researchers from North Carolina State University have demonstrated a new type of flexible, robotic grippers that are able to lift delicate egg yolks without breaking them, and that are precise enough to lift a human hair.", "url": "https://www.dpaonthenet.net/article/189079/Robotic-grippers-are-delicate-enough-to-lift-egg-yolks.aspx", "urlToImage": "http://www.dpaonthenet.net/global/showimage.ashx?Type=Article&ID=200224&Min=200", "publishedAt": "2022-01-26T11:29:25Z", "content": "26 January 2022\r\nEngineering researchers from North Carolina State University have demonstrated a new type of flexible, robotic grippers that are able to lift delicate egg yolks without breaking them… [+3004 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "A Million Miles Away From Earth, What Next For James Webb Space Telescope? - News18", "description": "At 2PM EST on Monday, the James Webb Telescope slipped into orbit around the Earth-sun Lagrange Point 2, a gravitationally stable spot in space about 930,000 miles (1.5 million kilometers) from our planet.", "url": "https://www.news18.com/news/tech/a-million-miles-away-from-earth-what-next-for-james-webb-space-telescope-4701044.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/01/james-webb-164135813516x9.png", "publishedAt": "2022-01-26T11:19:09Z", "content": "NASA’s next-generation James Webb telescope, which travelled about 1 million miles from Earth, has reached its final destination. But, the science operations are expected to begin only in late June o… [+2469 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "Cleaning your car may not protect you from this carcinogen - Medical Xpress", "description": "It is unlikely that a cancer-causing chemical inside your car can be dusted or wiped way, according to new UC Riverside research.", "url": "https://medicalxpress.com/news/2022-01-car-carcinogen.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/cleaning-your-car-may.jpg", "publishedAt": "2022-01-26T10:55:37Z", "content": "It is unlikely that a cancer-causing chemical inside your car can be dusted or wiped way, according to new UC Riverside research.\r\nThis finding has now been published in the journal Environmental Res… [+3120 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": null, "title": "Mars rover Perseverance showed on video how they managed to fix a jammed drill - The Times Hub", "description": "Perseverance rover drill/NASA/JPL-Caltech The NASA Perseverance rover team reported that they were able to repair the carousel of the drilling rig, where soil samples taken from the Martian surface were stored. Some parts of the rock got stuck in the installa…", "url": "https://thetimeshub.in/mars-rover-perseverance-showed-on-video-how-they-managed-to-fix-a-jammed-drill", "urlToImage": "https://thetimeshub.in/wp-content/uploads/2022/01/marsohod-perseverance-pokazal-na-video-kak-udalos-pochinit-zaklinivshij-bur-d71b215.jpg", "publishedAt": "2022-01-26T10:30:05Z", "content": "Perseverance rover drill/NASA/JPL-Caltech\r\n The NASA Perseverance rover team reported that they were able to repair the carousel of the drilling rig, where soil samples taken from the Martian surface… [+1901 chars]"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "New Research Strengthens Link Between Glaciers and Earth's Puzzling “Great Unconformity” - SciTechDaily", "description": "Ice action seems responsible for ancient erosion of rock across the planet. New research provides further evidence that rocks representing up to a billion years of geological time were carved away by ancient glaciers during the planet’s “Snowball Earth” perio…", "url": "https://scitechdaily.com/new-research-strengthens-link-between-glaciers-and-earths-puzzling-great-unconformity/", "urlToImage": "https://scitechdaily.com/images/Great-Unconformity-Study-Sites-Map.png", "publishedAt": "2022-01-26T09:46:07Z", "content": "Researchers used thermochronometric data from four North American locations to determine the cause of the “Great Unconformity”—a massive loss of rock about 700 million years ago. Credit: Figure by Ka… [+7519 chars]"}, {"source": {"id": null, "name": "Technology Networks"}, "author": "Technology Networks", "title": "AI Reveals Secrets of Post-Big Bang Plasma - Technology Networks", "description": "Can machine learning be used to uncover the secrets of the early universe? Yes - but only with sophisticated new methods.<br /><br />", "url": "https://www.technologynetworks.com/informatics/news/ai-reveals-secrets-of-post-big-bang-plasma-357903", "urlToImage": "https://assets.technologynetworks.com/production/dynamic/images/content/357903/ai-reveals-secrets-of-post-big-bang-plasma-357903-640x360.jpg?cb=20220126", "publishedAt": "2022-01-26T09:42:16Z", "content": "Can machine learning be used to uncover the secrets of the early universe? Yes - but only with sophisticated new methods.\r\nIt could hardly be more complicated: tiny particles whir around wildly with … [+4499 chars]"}, {"source": {"id": null, "name": "ScienceAlert"}, "author": "David Nield", "title": "Wild New Paper Suggests Earth's Tectonic Activity Has an Unseen Source - ScienceAlert", "description": "Earth is far from a solid mass of rock. The outer layer of our planet – known as the lithosphere – is made up of more than 20 tectonic plates; as these gargantuan slates glide about the face of the planet, we get the movement of continents, and", "url": "https://www.sciencealert.com/the-pull-of-the-sun-and-moon-could-be-affecting-plate-motion", "urlToImage": "https://www.sciencealert.com/images/2022-01/processed/DeepCrackInCooledLavaFieldCloseUp_1024.jpg", "publishedAt": "2022-01-26T09:30:30Z", "content": "Earth is far from a solid mass of rock. The outer layer of our planet known as the lithosphere  is made up of more than 20 tectonic plates; as these gargantuan slates glide about the face of the plan… [+4087 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA fight against asteroids dangerous to Earth just got a massive boost - HT Tech", "description": "NASA has developed a new system to track hazardous asteroids that could hit Earth.", "url": "https://tech.hindustantimes.com/tech/news/nasa-fight-against-asteroids-dangerous-to-earth-just-got-a-massive-boost-71643184038485.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/01/26/1600x900/1_orbital-diagram-1041_1643184217708_1643184231895.jpg", "publishedAt": "2022-01-26T08:05:48Z", "content": "In what will come as a big relief, NASA has upgraded its asteroids warning system. The US space agency has upgraded its software that assess the hazardous asteroids that could bring significant chang… [+2363 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "HT Tech", "title": "NASA says giant asteroid just flew past Earth - HT Tech", "description": "A large asteroid namely, Asteroid 2017 XC62 shot past Earth at 9,500 miles per hour on January 24.", "url": "https://tech.hindustantimes.com/tech/news/nasa-says-giant-asteroid-just-flew-past-earth-71643183504986.html", "urlToImage": "https://images.hindustantimes.com/tech/img/2022/01/26/1600x900/Psyche_Asteroid_1643183861297_1643183879410.jpg", "publishedAt": "2022-01-26T07:59:13Z", "content": "A huge asteroid shot past Earth from a very close distance on Monday, January 24. Named Asteroid 2017 XC62, the near-earth asteroid (NEA) is about 623 feet wide, says NASA - over twice the size of th… [+2187 chars]"}, {"source": {"id": null, "name": "BBC Focus Magazine"}, "author": "Stuart Clark", "title": "NASA's Lunar Gateway: The plans for a permanent space station that will orbit the Moon - BBC Science Focus Magazine", "description": "2022 will see NASA, with help from its international partners, take the first major step on humanity’s journey back to the Moon, and the start of a mission to establish an outpost alongside Earth’s natural satellite.", "url": "https://www.sciencefocus.com/space/nasa-lunar-gateway/", "urlToImage": "https://images.immediate.co.uk/production/volatile/sites/4/2022/01/Lunar-Gateway-hero-5821333.jpg?quality=90&resize=960,413", "publishedAt": "2022-01-26T04:00:14Z", "content": "If all goes to plan, sometime in 2022 NASAs Space Launch System rocket (SLS) will blast off from Cape Canaveral, Florida, for its maiden flight. The giant SLS rocket, fully 111.25m tall, is set to la… [+11085 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Raghavendra Gadagkar", "title": "More Fun Than Fun: EO Wilson's Love of Ants – and All Things Living - The Wire Science", "description": "The American myrmecologist, naturalist and writer Edward Osborne Wilson passed away on December 26, 2021.", "url": "https://science.thewire.in/environment/remembering-edward-osborne-wilson-naturalist-raghavendra-gadagkar/", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2022/01/25122954/Image-1.jpg", "publishedAt": "2022-01-26T02:34:22Z", "content": "Edward Osborne Wilson (1929-2021). Photo: Jim Harrison, CC BY 2.5\r\n<ul><li>The American myrmecologist, naturalist and writer Edward Osborne Wilson passed away on December 26, 2021.</li><li>Wilsons ph… [+23431 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Three newly discovered planets will be swallowed by stars - BollyInside", "description": "The three giant gas planets were first detected by the NASA Transiting Exoplanet Survey Satellite Mission After these planets were discovered by TESS, the", "url": "https://www.bollyinside.com/news/three-newly-discovered-planets-will-be-swallowed-by-stars", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2021/12/Elon-Musk-rejects-mounting-criticism-that-his-satellites-are-obstructing.png", "publishedAt": "2022-01-26T01:58:22Z", "content": "The three giant gas planets were first detected by the NASA Transiting Exoplanet Survey Satellite MissionAfter these planets were discovered by TESS, the researchers used the W. M. Keck Observatory o… [+3671 chars]"}, {"source": {"id": null, "name": "Pnas.org"}, "author": null, "title": "Green plant genomes: What we know in an era of rapidly expanding opportunities - pnas.org", "description": "Green plants play a fundamental role in ecosystems, human health, and agriculture. As de novo genomes are being generated for all known eukaryotic species as advocated by the Earth BioGenome Project, increasing genomic information on green land plants is esse…", "url": "https://www.pnas.org/content/119/4/e2115640118", "urlToImage": "https://www.pnas.org/content/119/4/e2115640118/F1.large.jpg", "publishedAt": "2022-01-25T23:49:19Z", "content": "Abstract\r\nGreen plants play a fundamental role in ecosystems, human health, and agriculture. As de novo genomes are being generated for all known eukaryotic species as advocated by the Earth BioGenom… [+42280 chars]"}, {"source": {"id": null, "name": "Hithardnews.com"}, "author": null, "title": "New Study says Eating Meat is Overrated in Human Evolution - HitHard News", "description": "According to new research, superior human characteristics like huge brains first appeared in Homo erectus roughly 2 million years ago. An increase in", "url": "https://hithardnews.com/2022/01/25/new-study-says-eating-meat-was-overrated-in-human-evolution/", "urlToImage": "https://hithardnews.com/wp-content/uploads/2022/01/human_evolutionc0146466.webp", "publishedAt": "2022-01-25T23:01:40Z", "content": "According to new research, superior human characteristics like huge brains first appeared in Homo erectus roughly 2 million years ago. An increase in meat-eating is often believed to be related to th… [+3655 chars]"}, {"source": {"id": null, "name": "Sci-News.com"}, "author": null, "title": "Physicists Detect Exotic Particles in Quark-Gluon Plasma - Sci-News.com", "description": "Physicists from the CMS (Compact Muon Solenoid) Collaboration at CERN’s Large Hadron Collider have detected about 100 particles of a type known as X(3872) in quark-gluon plasma, an environment that they hope will illuminate the particles’ as-yet unknown struc…", "url": "http://www.sci-news.com/physics/x-3872-particles-quark-gluon-plasma-10488.html", "urlToImage": "http://cdn.sci-news.com/images/2022/01/image_10488f-X3872.jpg", "publishedAt": "2022-01-25T22:58:01Z", "content": "Physicists from the CMS (Compact Muon Solenoid) Collaboration at CERNs Large Hadron Collider have detected about 100 particles of a type known as X(3872) in quark-gluon plasma, an environment that th… [+3980 chars]"}, {"source": {"id": null, "name": "Medium"}, "author": "Will Lockett", "title": "Did NASA Just Find Life On Mars?. NASA's Curiosity has seen something… | by Will Lockett | Predict | Jan, 2022 - Medium", "description": "For millennia we have stared up at the Red Planet and dreamed of life flourishing on its tarnished surface. We have spent billions of dollars understanding this alluring planet and whether life has…", "url": "https://medium.com/predict/did-nasa-just-find-life-on-mars-47282195bed8", "urlToImage": "https://miro.medium.com/max/1200/1*ovKcsRwsW9sATOWPsQpr2A.jpeg", "publishedAt": "2022-01-25T20:00:45Z", "content": "For millennia we have stared up at the Red Planet and dreamed of life flourishing on its tarnished surface. We have spent billions of dollars understanding this alluring planet and whether life has e… [+120 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Study probes the planet's turbulent past to explain where oceans came from - Phys.org", "description": "The origin of water on our planet is a hot question: Water has immense implications for plate tectonics, climate, the origin of life on Earth, and potential habitability of other Earth-like planets. In a recent study in Physical Review Letters, a Skoltech pro…", "url": "https://phys.org/news/2022-01-probes-planet-turbulent-oceans.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/1-planet.jpg", "publishedAt": "2022-01-25T19:14:37Z", "content": "The origin of water on our planet is a hot question: Water has immense implications for plate tectonics, climate, the origin of life on Earth, and potential habitability of other Earth-like planets. … [+6304 chars]"}, {"source": {"id": null, "name": "MENAFN.COM"}, "author": "MENAFN", "title": "Making smartphone data anonymous no longer enough: study - MENAFN.COM", "description": "<p>Privacy measures that are meant to preserve the anonymity of smartphone users are no longer suitable for the digital age, a study suggested on Tue", "url": "https://menafn.com/1103592703/Making-smartphone-data-anonymous-no-longer-enough-study", "urlToImage": "https://menafn.com/updates/pr/2022-01/25/AFP_521efimage_story.jpg", "publishedAt": "2022-01-25T18:26:42Z", "content": "(MENAFN- AFP) \r\nPrivacy measures that are meant to preserve the anonymity of smartphone users are no longer suitable for the digital age, a study suggested on Tuesday. \r\nVast quantities of data are s… [+2680 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Physicist solves century old problem of radiation reaction - Phys.org", "description": "A Lancaster physicist has proposed a radical solution to the question of how a charged particle, such as an electron, responded to its own electromagnetic field.", "url": "https://phys.org/news/2022-01-physicist-century-problem-reaction.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/physicist-solves-centu.jpg", "publishedAt": "2022-01-25T18:17:15Z", "content": "A Lancaster physicist has proposed a radical solution to the question of how a charged particle, such as an electron, responded to its own electromagnetic field.\r\nThis question has challenged physici… [+3533 chars]"}, {"source": {"id": null, "name": "Thetimeshub.in"}, "author": null, "title": "The Dragon capsule returned safely from the International Space Station - The Times Hub", "description": "Home » Technology » The Dragon capsule returned safely from the International Space Station January 25, 2022 Posted on Tuesday, January 25, 2022 at 10:42 p.m. Through Sudinfo with Belga The Dragon cargo ship returned safely from the International Space Statio…", "url": "https://thetimeshub.in/the-dragon-capsule-returned-safely-from-the-international-space-station", "urlToImage": "https://thetimeshub.in/wp-content/uploads/2022/01/3069f688b1c97caf3968cc4db41ca1e3.jpg", "publishedAt": "2022-01-25T17:12:00Z", "content": "Home » Technology » The Dragon capsule returned safely from the International Space Station January 25, 2022 \r\n Posted on Tuesday, January 25, 2022 at 10:42 p.m. \r\n Through Sudinfo with Belga \r\nThe D… [+901 chars]"}, {"source": {"id": null, "name": "Sci-News.com"}, "author": null, "title": "Astronomers Observe Pair of Colliding Spiral Galaxies - Sci-News.com", "description": "ESO astronomers have released an absolutely beautiful photo taken by the FOcal Reducer and low dispersion Spectrograph 2 (FORS2) instrument on ESO’s Very Large Telescope (VLT) of an eye-catching pair of colliding unbarred spiral galaxies: NGC 4567 and NGC 456…", "url": "http://www.sci-news.com/astronomy/butterfly-galaxies-10487.html", "urlToImage": "http://cdn.sci-news.com/images/2022/01/image_10487-Butterfly-Galaxies.jpg", "publishedAt": "2022-01-25T16:56:14Z", "content": "ESO astronomers have released an absolutely beautiful photo taken by the FOcal Reducer and low dispersion Spectrograph 2 (FORS2) instrument on ESOs Very Large Telescope (VLT) of an eye-catching pair … [+2142 chars]"}, {"source": {"id": null, "name": "Interesting Engineering"}, "author": "Chris Young", "title": "Here's Why There Are an Enormous Number of Black Holes in the Universe - Interesting Engineering", "description": "There are 3 million black holes in a megaparsec and the number of black holes in the universe is roughly six times the number of grains of sand on Earth.", "url": "https://interestingengineering.com/heres-why-there-are-an-enormous-number-of-black-holes-in-the-universe", "urlToImage": "https://inteng-storage.s3.amazonaws.com/img/iea/ypwqvz9LON/sizes/black-hole_md.jpg", "publishedAt": "2022-01-25T16:16:50Z", "content": "Astronomers used a new method to estimate the number of black holes in the observable universe, and as you can imagine, the number is almost brain-numbingly large.\r\nThe researchers, from institutions… [+2657 chars]"}, {"source": {"id": null, "name": "Editorials24.com"}, "author": null, "title": "Nasa reveals NEW plan to stop 'doomsday asteroid' from wiping out humanity - Editorials 24", "description": "NASA has upgraded its asteroid hazard software with some key changes that should help it better detect potentially dangerous space rocks. The US space agency’s Jet Propulsion Laboratory (JPL) uses a special type of software to assess potentially hazardous ast…", "url": "https://editorials24.com/2022/01/nasa-reveals-new-plan-to-stop-doomsday-asteroid-from-wiping-out-humanity/", "urlToImage": "https://editorials24.com/wp-content/uploads/2022/01/NINTCHDBPICT000706616962.jpg", "publishedAt": "2022-01-25T15:20:14Z", "content": "NASA has upgraded its asteroid hazard software with some key changes that should help it better detect potentially dangerous space rocks.\r\nThe US space agency’s Jet Propulsion Laboratory (JPL) uses a… [+2375 chars]"}, {"source": {"id": null, "name": "Phys.Org"}, "author": "Science X staff", "title": "Asymmetry is key to creating more stable blue perovskite LEDs - Phys.org", "description": "Researchers from the Okinawa Institute of Science and Technology Graduate University (OIST) have developed blue LEDs based on a material called metal halide perovskite, that, for the first time, uses asymmetrical bridges to hold the layers of perovskite toget…", "url": "https://phys.org/news/2022-01-asymmetry-key-stable-blue-perovskite.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/2022/asymmetry-is-key-to-cr.jpg", "publishedAt": "2022-01-25T14:24:25Z", "content": "Researchers from the Okinawa Institute of Science and Technology Graduate University (OIST) have developed blue LEDs based on a material called metal halide perovskite, that, for the first time, uses… [+5020 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": "DNA  Web Team", "title": "Moon's 50-year-old 'magnetic mystery' solved? New study says THIS - DNA India", "description": "The US study proposes a new explanation for the mystery attached to the Moon since the Apollo landings.", "url": "https://www.dnaindia.com/science/report-moon-s-50-year-old-magnetic-mystery-solved-new-study-says-this-2930276", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/01/25/1016649-moon.jpg", "publishedAt": "2022-01-25T14:23:39Z", "content": "Ever since rocks were brought back from the Moon to the Earth, during NASA`s Apollo program from 1968 to 1972, an enduring mystery continued to baffle scientists: the Moon`s magnetic field - one that… [+5749 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Expedition 66 Space Station Astronauts Answer California Student Questions - Jan. 24, 2022 - NASA Video", "description": "Aboard the International Space Station, NASA Expedition 66 Flight Engineers Mark Vande Hei and Kayla Barron of NASA answered pre-recorded questions about lif...", "url": "https://www.youtube.com/watch?v=vw30Wpu285Q", "urlToImage": "https://i.ytimg.com/vi/vw30Wpu285Q/maxresdefault.jpg", "publishedAt": "2022-01-25T14:21:05Z", "content": null}, {"source": {"id": null, "name": "ExtremeTech"}, "author": "Ryan Whitwam", "title": "NASA's First Solar Sail Will Hitch a Ride on Artemis I - ExtremeTech", "description": "After hitching a ride on NASA's new mega-rocket, NEA Scout will use a first-of-its-kind solar sail to visit asteroid 2020 GE.", "url": "https://www.extremetech.com/?p=330883", "urlToImage": "https://www.extremetech.com/wp-content/uploads/2022/01/1_triptych-nea-scout-640x360.jpg", "publishedAt": "2022-01-25T12:30:00Z", "content": "There is a tiny asteroid in our solar system known simply as 2020 GE. Astronomers discovered it in 2020, but it’s spent billions of lonely years drifting through space. It’s about to get some company… [+2391 chars]"}, {"source": {"id": null, "name": "OI Canadian"}, "author": "TAMMY SEWELL", "title": "The interior of the Earth is cooling faster than previously thought - OI Canadian", "description": "Enzo Campetella 8 hours ago 6 minutes The history of our planet is ultimately the history of its internal cooling process. The evolution of our planet Earth is actually the story of its own inexorable", "url": "https://oicanadian.com/the-interior-of-the-earth-is-cooling-faster-than-previously-thought/", "urlToImage": "https://services.meteored.com/img/article/el-interior-de-la-tierra-se-enfria-mas-rapido-de-lo-pensado-1643108285842_1280.jpg", "publishedAt": "2022-01-25T12:07:21Z", "content": "Enzo Campetella \r\n8 hours ago\r\n6 minutes\r\nThe history of our planet is ultimately the history of its internal cooling process. \r\nThe evolution of our planet Earth is actually the story of its own ine… [+3944 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "1,000-light-year wide bubble surrounding Earth is source of all nearby, young stars: Study - ANI News", "description": "Cambridge (Massachusetts) [US], January 25 (ANI): Tens of thousands of twinkling stars surround the Earth as it sits in a 1,000-light-year-wide void surrounded by thousands of young stars. But questions often arise as to how those stars formed?", "url": "https://www.aninews.in/news/science/1000-light-year-wide-bubble-surrounding-earth-is-source-of-all-nearby-young-stars-study20220125164209", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/stars2022012510413320220125111158-thumbnail-154x87-70.jpg", "publishedAt": "2022-01-25T11:12:00Z", "content": "ANI | Updated: Jan 25, 2022 16:42 IST\r\nCambridge (Massachusetts) [US], January 25 (ANI): Tens of thousands of twinkling stars surround the Earth as it sits in a 1,000-light-year-wide void surrounded … [+4288 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Michael J. Benton", "title": "Fish bones and water lilies help pin down the month the dinosaurs died - The Conversation UK", "description": "A recent study provides additional evidence that the dinosaurs died in June.", "url": "https://theconversation.com/fish-bones-and-water-lilies-help-pin-down-the-month-the-dinosaurs-died-175459", "urlToImage": "https://images.theconversation.com/files/442223/original/file-20220124-25-18u4jou.jpg?ixlib=rb-1.1.0&rect=0%2C17%2C5953%2C2976&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2022-01-25T10:53:21Z", "content": "The dinosaurs were killed by a meteorite impact on the Earth some 66 million years ago in what has become known as the Cretaceous-Paleogene extinction event. At what time of the year this occurred ha… [+4778 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Tokyo Institute of Technology: Scientists Observe Record High Hydride Ion Conductivity Using Modified Lanthanum Trihydride - India Education Diary", "description": "Fossil fuels such as coal, oil, and natural gas cannot last forever. Therefore, gradually decreasing our dependency on fossil fuels seems critical. Whereas alternative sources of energy such as solar or tidal energy can fill in the gap to some extent", "url": "https://indiaeducationdiary.in/tokyo-institute-of-technology-scientists-observe-record-high-hydride-ion-conductivity-using-modified-lanthanum-trihydride/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/02/download-9-1.jpg", "publishedAt": "2022-01-25T10:18:49Z", "content": "Fossil fuels such as coal, oil, and natural gas cannot last forever. Therefore, gradually decreasing our dependency on fossil fuels seems critical. Whereas alternative sources of energy such as solar… [+3242 chars]"}, {"source": {"id": null, "name": "Indiaherald.com"}, "author": "G.GOWTHAM", "title": "Mars is ALIVE - Movements spotted by Scientists - ఏపిహెరాల్ద్.కామ్ - unit of India Herald Group Publishers [P] LIMITED", "description": "breaking : Images of Curiosity s and the Endurance rover s tracks on Mars serve as a reminder of human creativity on a world that has been untouched f", "url": "https://www.indiaherald.com/Breaking/Read/994470343/Mars-is-ALIVE-Movements-spotted-by-Scientists", "urlToImage": "https://www.indiaherald.com/imagestore/images/breaking/134/mars-is-alive-movements-spotted-by-scientistsc455ee5c-19fe-4e91-af42-2832b1d5fc0d-415x250-IndiaHerald.jpg", "publishedAt": "2022-01-25T09:35:16Z", "content": "Images of Curiosity's and the Endurance rover's tracks on Mars serve as a reminder of human creativity on a world that has been untouched for millennia. The two rovers, though, are not the only entit… [+1223 chars]"}, {"source": {"id": null, "name": "Eletimes.com"}, "author": "https://www.facebook.com/eletimes", "title": "Demonstration of a Molecular Electronics Sensors on a Semiconductor Chip - ELE Times", "description": "The first molecular electronics chip has been developed, realizing a 50-year-old goal of integrating single molecules into circuits", "url": "https://www.eletimes.com/demonstration-of-a-molecular-electronics-sensors-on-a-semiconductor-chip", "urlToImage": "https://www.eletimes.com/wp-content/uploads/2022/01/semiconductor-chip.jpg", "publishedAt": "2022-01-25T09:15:36Z", "content": "The first molecular electronics chip has been developed, realizing a 50-year-old goal of integrating single molecules into circuits to achieve the ultimate scaling limits of Moore’s Law. Developed by… [+3973 chars]"}, {"source": {"id": null, "name": "SpaceWatch.Global"}, "author": "Viktoria Urban", "title": "Israeli astronaut to carry out 35 experiments on ISS - SpaceWatch.Global", "description": "Edinburgh, 25 January 2022. - Former fighter jet pilot, Eytan Stibbe, is scheduled to become the second Israeli astronaut and the first to go to the International Space Station (ISS) in March this yea", "url": "https://spacewatch.global/2022/01/israeli-astronaut-to-carry-out-35-experiments-on-iss/", "urlToImage": "https://spacewatch.global/wp-content/uploads/2022/01/20_l.jpeg", "publishedAt": "2022-01-25T08:38:02Z", "content": "Stibbe tests out the CRISPR experiment in a lab. Credit: PR\r\nEdinburgh, 25 January 2022. – Former fighter jet pilot, Eytan Stibbe, is scheduled to become the second Israeli astronaut and the first to… [+1324 chars]"}]}