{"status": "ok", "totalResults": 86, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Paul LeBlanc, CNN", "title": "Here's everything we've learned from the January 6 committee hearings so far", "description": "The House select committee investigating the January 6, 2021, US Capitol attack has gone to great lengths to present the findings of its sprawling investigation in a succinct, digestible way. Here's everything we've learned from the panel's public hearings so…", "url": "https://www.cnn.com/2022/06/16/politics/jan-6-committee-hearings-so-far-what-matters/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220616151047-01-jan-6-hearing-061622-super-tease.jpg", "publishedAt": "2022-06-16T22:49:13Z", "content": "A version of this story appears in CNN's What Matters newsletter. To get it in your inbox, sign up for free here.\r\nWashington (CNN)The House select committee investigating the January 6, 2021, US Cap… [+9546 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Priscilla Alvarez", "title": "US Customs and Border Protection investigating an unofficial challenge coin depicting Haitian migrant incident", "description": "An unofficial challenge coin depicting the infamous image of an agent on horseback confronting a Haitian migrant is being investigated by US Customs and Border Protection's Office of Professional Responsibility, according to agency spokesperson Luis Miranda.", "url": "https://www.cnn.com/2022/06/16/politics/unofficial-challenge-coin-haitian-migrant-incident-investigation-cbp/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210920175651-04-migrants-del-rio-0919.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-06-16T22:16:08Z", "content": "An unofficial challenge coin depicting the infamous image of an agent on horseback confronting a Haitian migrant is being investigated by US Customs and Border Protections Office of Professional Resp… [+1249 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Katherine Yao and Megan L. Ranney", "title": "The danger of period-tracking apps in post-Roe world", "description": "Katherine Yao and Megan Ranney write that consumers and privacy experts alike are concerned that data gathered by period-tracking and other digital health apps could be used to prosecute women who seek or have abortions in the event that Roe v. Wade is overtu…", "url": "https://www.cnn.com/2022/06/16/opinions/period-trackers-app-roe-abortion-ranney-yao/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220616122204-period-tracker-app-stock-super-tease.jpg", "publishedAt": "2022-06-16T21:51:44Z", "content": "Katherine Yao is a writer who studies molecular biochemistry and English at Yale University. Megan Ranney, MD, MPH, is a professor of emergency medicine and academic dean at the School of Public Heal… [+7634 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Steve Almasy, CNN", "title": "WNBA legend Sue Bird to retire after this season", "description": "Sue Bird, one of the winningest basketball players ever, will retire from the WNBA after this season, the Seattle Storm guard announced Thursday.", "url": "https://www.cnn.com/2022/06/16/sport/sue-bird-wnba-retirement-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220616155607-sue-bird-220520-super-tease.jpg", "publishedAt": "2022-06-16T21:47:07Z", "content": "(CNN)Sue Bird, one of the winningest basketball players ever, will retire from the WNBA after this season, the Seattle Storm guard announced Thursday.\r\nBird, the league's career assists leader broke … [+2435 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Crypto is collapsing. Mortgage rates are soaring. Here's what it all means", "description": "You have seen the headlines: mortgage rates and inflation are spiking, crypto is collapsing, and bears are back on Wall Street. But what does it all mean? \"Nightcap\" host Jon Sarlin talks with CNN Business experts about what on earth is going on in the econom…", "url": "https://www.cnn.com/videos/business/2022/06/16/nightcap-interest-rates-fed-tesla-crypto-full-orig.cnn-business", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220616142355-nightcap-061622-16x9-logo-super-tease.jpg", "publishedAt": "2022-06-16T21:46:43Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julian Zelizer", "title": "Opinion: Democrats shouldn't be so quick to throw Biden overboard", "description": "Should President Joe Biden run for reelection? It's a question that is now circulating in the media, with ongoing stories about Democrats who are considering whether another candidate might be better positioned to win in 2024, writes Julian Zelizer.", "url": "https://www.cnn.com/2022/06/16/opinions/biden-reelection-2024-democrats-zelizer/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220614113827-02-biden-speech-economy-0614.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-06-16T21:40:21Z", "content": "Editors Note: Julian Zelizer, a CNN political analyst, is a professor of history and public affairs at Princeton University. He is the author and editor of 24 books, including, The Presidency of Dona… [+5960 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ariane de Vogue, CNN Supreme Court Reporter", "title": "Sonia Sotomayor says she and Clarence Thomas share a 'common understanding about people and kindness'", "description": "As the Supreme Court prepares for the end of the most tumultuous term in decades, and the justices race to issue opinions on highly divisive issues, Justice Sonia Sotomayor appeared before a liberal audience in Washington on Thursday and discussed her relatio…", "url": "https://www.cnn.com/2022/06/16/politics/sonia-sotomayor-supreme-court-clarence-thomas/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210910125227-01-sonia-sotomayor-super-tease.jpg", "publishedAt": "2022-06-16T21:26:03Z", "content": "(CNN)As the Supreme Court prepares for the end of the most tumultuous term in decades, and the justices race to issue opinions on highly divisive issues, Justice Sonia Sotomayor appeared before a lib… [+5232 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chris Cillizza", "title": "The 16 most compelling lines from today's January 6 committee hearing", "description": "The third public hearing of the January 6 committee this month is in the books. It was heavily focused on the pressure campaign that Donald Trump brought to bear on Mike Pence to overturn the Electoral College results in advance of January 6, 2021.", "url": "https://www.cnn.com/2022/06/16/politics/january-6-committee-hearing-day-3-key-lines-mike-pence/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220616152314-19-january-6-hearings-0616-pence.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-06-16T21:16:08Z", "content": "The third public hearing of the January 6 committee this month is in the books. It was heavily focused on the pressure campaign that Donald Trump brought to bear on Mike Pence to overturn the Elector… [+6083 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Shawna Mizelle and Tierney Sneed, CNN", "title": "Jan. 6 panel sends request to Ginni Thomas after she says she looks 'forward to talking'", "description": "House January 6 committee Chair Bennie Thompson on Thursday said the panel investigating the US Capitol attack has sent a letter to Virginia \"Ginni\" Thomas asking her to speak with them about her role in the effort to overturn the 2020 electoral results.", "url": "https://www.cnn.com/2022/06/16/politics/ginni-thomas-january-6-committee/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210206031134-ginni-thomas-file-2017-super-tease.jpg", "publishedAt": "2022-06-16T21:04:44Z", "content": "Washington (CNN)House January 6 committee Chair Bennie Thompson on Thursday said the panel investigating the US Capitol attack has sent a letter to Virginia \"Ginni\" Thomas asking her to speak with th… [+3326 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tierney Sneed", "title": "What to know about Ginni Thomas' connection to 2020 election reversal gambits", "description": "The drip-drip-drip of revelations concerning Supreme Court spouse Virginia \"Ginni\" Thomas' support of former President Donald Trump's election reversal gambits have created an unrelenting ethics scandal around the court.", "url": "https://www.cnn.com/2022/06/16/politics/ginni-thomas-january-6-supreme-court/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220616155607-ginni-thomas-201026-file-super-tease.jpg", "publishedAt": "2022-06-16T21:02:30Z", "content": "(CNN)The drip-drip-drip of revelations concerning Supreme Court spouse Virginia \"Ginni\" Thomas' support of former President DonaldTrump's election reversal gambits have created an unrelenting ethics … [+10647 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeanne Sahadi, CNN Business", "title": "Walgreens Boots Alliance CEO on her storied career: 'I took steps down to get up'", "description": "Walgreens Boots Alliance CEO Rosalind Brewer is one of the most successful business leaders in corporate America and a leading voice for the Black community at work, in the boardroom and in the healthcare industry. But, as she notes, her rise wasn't a straigh…", "url": "https://www.cnn.com/2022/06/16/success/black-leadership-juneteenth/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220616161850-rosalind-brewer-walgreens-headshot-super-tease.jpg", "publishedAt": "2022-06-16T20:49:42Z", "content": "Walgreens Boots Alliance CEO Rosalind Brewer is one of the most successful business leaders in corporate America and a leading voice for the Black community at work, in the boardroom and in the healt… [+5536 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kara Scannell", "title": "Michael Avenatti pleads guilty to stealing millions of dollars from clients", "description": "Disgraced attorney Michael Avenatti pleaded guilty Thursday to embezzling millions of dollars from four of his clients, taking another step closer toward resolving a flurry of federal charges against him.", "url": "https://www.cnn.com/2022/06/16/politics/michael-avenatti-guilty-plea/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220612215954-01-michael-avenatti-file-super-tease.jpg", "publishedAt": "2022-06-16T20:49:07Z", "content": "(CNN)Disgraced attorney Michael Avenatti pleaded guilty Thursday to embezzling millions of dollars from four of his clients, taking another step closer toward resolving a flurry of federal charges ag… [+2756 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Steve Contorno, CNN", "title": "DeSantis defends Florida's decision to be only state not to preorder Covid vaccines for kids under 5", "description": "Florida Gov. Ron DeSantis on Thursday defended his state's decision not to preorder Covid-19 vaccines for children under 5 years old ahead of federal vaccine regulators' long-awaited, expected authorization.", "url": "https://www.cnn.com/2022/06/16/politics/desantis-covid-vaccines-children-under-5/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220616133530-desantis-presser-0616-super-tease.jpg", "publishedAt": "2022-06-16T19:55:37Z", "content": "(CNN)Florida Gov. Ron DeSantis on Thursday defended his state's decision not to preorder Covid-19 vaccines for children under 5 years old ahead of federal vaccine regulators' long-awaited, expected a… [+3253 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Barbara Starr", "title": "Russia warned US it was going to conduct airstrikes on fighters in Syria", "description": "Russia warned the US military earlier this week that it was going to conduct airstrikes against local fighters allied with the US in southeastern Syria, according to two US defense officials.", "url": "https://www.cnn.com/2022/06/16/politics/russia-syria-warning/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/200608165352-usa-russia-flags.jpg?q=x_2,y_8,h_898,w_1596,c_crop/w_800", "publishedAt": "2022-06-16T19:52:00Z", "content": "Russia warned the US military earlier this week that it was going to conduct airstrikes against local fighters allied with the US in southeastern Syria, according to two US defense officials.\r\nThat l… [+3088 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Marianne Garvey", "title": "Kim Kardashian did not damage Marilyn Monroe's dress, according to Ripley's", "description": "Kim Kardashian did not ruin Marilyn Monroe's iconic dress at the Met Gala.", "url": "https://www.cnn.com/style/article/kim-kardashian-marilyn-monroe-dress/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220518213747-panorama-kim-kardashian-vestido-marilyn-monroe-super-tease.jpg", "publishedAt": "2022-06-16T19:47:43Z", "content": "Kim Kardashian did not ruin Marilyn Monroe's iconic dress at the Met Gala.\r\nRipley's Believe It Or Not!, the company which owns Monroe's dress and lent it to Kardashian for the May event, said in a s… [+1118 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jack Bantock, CNN", "title": "US Open: McIlroy slams club into sand after bunker-to-bunker nightmare but miraculously saves par", "description": "For a few brief moments, Rory McIlroy looked relatable to the average golfer. Then, the Northern Irishman served a reminder of why he is a four-time major winner.", "url": "https://www.cnn.com/2022/06/16/golf/us-open-rory-mcilroy-golf-bunker-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220616131313-01-mcilroy-us-open-061622-super-tease.jpg", "publishedAt": "2022-06-16T19:15:06Z", "content": "(CNN)For a few brief moments, Rory McIlroy looked relatable to the average golfer. Then, the Northern Irishman served a reminder of why he is a four-time major winner.\r\nEnjoying a fast start at the 1… [+2671 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeremy Herb, Marshall Cohen and Zachary Cohen, CNN", "title": "3 takeaways from the January 6 hearings day 3", "description": "The House select committee investigating the Capitol insurrection on Thursday detailed how former President Donald Trump tried to pressure his vice president to join in his scheme to overturn the presidential election -- and how Pence's refusal put his life i…", "url": "https://www.cnn.com/2022/06/16/politics/january-6-hearing-day-3-takeaways/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220616135112-13-january-6-hearings-0616-super-tease.jpg", "publishedAt": "2022-06-16T19:00:44Z", "content": "(CNN)The House select committee investigating the Capitol insurrection on Thursday detailed how former President Donald Trump tried to pressure his vice president to join in his scheme to overturn th… [+5180 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Ramirez, Brandon Miller", "title": "Drought tightened its grip on Southwest this week even as parts of the Northwest flooded", "description": "Drought conditions persisted in the Southwest, where water is desperately needed to replenish the country's largest reservoirs relied on by tens of millions of people.", "url": "https://www.cnn.com/2022/06/16/us/southwest-drought-flooding-climate/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220616140432-new-mexico-drought-0602.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-06-16T18:50:48Z", "content": "The West saw an aspect of the climate crisis play out this week that scientists have warned of for years. \r\nIn the middle of a prolonged, water shortage-inducing megadrought, one area, Yellowstone, w… [+3166 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by David A. Andelman", "title": "Opinion: Is there a limit to the West's appetite for defeating Putin?", "description": "As European leaders Emmanuel Macron, Olaf Scholz and Mario Draghi arrive in Kyiv for a meeting with Ukrainian President Volodymyr Zelensky on Thursday, David Andelman asks whether we are about to reach a point where Ukraine's needs outstrip the West's will to…", "url": "https://www.cnn.com/2022/06/16/opinions/ukraine-war-putin-eu-biden-cost-andelman/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220616125231-zelensky-macron-olaf-mario-super-tease.jpg", "publishedAt": "2022-06-16T18:20:12Z", "content": "David A. Andelman, a contributor to CNN, twice winner of the Deadline Club Award, is a chevalier of the French Legion of Honor, author of \"A Red Line in the Sand: Diplomacy, Strategy, and the History… [+7162 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Stefano Pozzebon, CNN", "title": "Who is Colombia's 'Old Man of TikTok' that could become the next president?", "description": "When Colombia's presidential campaign race started back in January, few expected that Rodolfo Hernandez would reach the final lap. But the septuagenarian real estate magnate-turned-politician has a chance of becoming the country's next president if he wins th…", "url": "https://www.cnn.com/2022/06/16/americas/rodolfo-hernandez-colombia-presidential-election-profile-intl-latam/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220615222519-rodolfo-hernandez-candidato-pueblo-super-tease.jpg", "publishedAt": "2022-06-16T18:08:36Z", "content": "Bogota, Colombia (CNN)When Colombia's presidential campaign race started back in January, few expected that Rodolfo Hernandez would reach the final lap. But the septuagenarian real estate magnate-tur… [+5298 chars]"}]}