{"status": "ok", "totalResults": 125, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "David Goldman", "title": "Want to make money in stocks this year? You'll probably have to sell your soul", "description": "People are selling stocks, selling bonds, selling crypto, selling their failed hedge funds ... and putting cash in Under the Mattress Savings and Loan Corp.", "url": "https://www.cnn.com/2022/05/19/investing/market-meltdown-stocks-nightcap/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220516100416-nyse-0509-restricted.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-19T14:21:02Z", "content": "Editors Note: This story is part of CNN Business Nightcap newsletter. To get it in your inbox, sign up for free, here.\r\nPeople are selling stocks, selling bonds, selling crypto, selling their failed … [+3025 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marianne Garvey", "title": "'The Kardashians' shows how Kim Kardashian helped save Julius Jones from death row. But there's more to the story", "description": "Family and advocates for former death row inmate Julius Jones, who was granted clemency last year mere hours before he was scheduled to be executed for a 1999 murder he says he did not commit, share how Kim Kardashian is helping them seek justice.", "url": "https://www.cnn.com/2022/05/19/entertainment/kim-kardashian-julius-jones/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220518211744-04-kim-kardashian-julius-jones-super-tease.jpg", "publishedAt": "2022-05-19T14:19:39Z", "content": "(CNN)One of the first times Antoinette Jones, the sister of former death row inmate Julius Jones, who was granted clemency last year mere hours before he was scheduled to be executed for a 1999 murde… [+8168 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eric Levenson", "title": "Buffalo shooting suspect expected in court for felony hearing today", "description": "The 18-year-old White man suspected of carrying out a racist mass shooting Saturday in a Buffalo, New York, supermarket is expected to appear in court Thursday morning for a felony hearing that could provide new details on the massacre.", "url": "https://www.cnn.com/2022/05/19/us/buffalo-supermarket-shooting-court/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220519022703-tops-buffalo-vigil-0517.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-19T14:05:19Z", "content": "The 18-year-old White man suspected of carrying out a racist mass shooting Saturday in a Buffalo, New York, supermarket is expected to appear in court Thursday morning for a felony hearing that could… [+4322 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sean Lyngaas, CNN", "title": "Pro-Russia online operatives falsely claimed Zelensky committed suicide in an effort to sway public opinion, cybersecurity firms says", "description": "Pro-Russia online operatives falsely claimed weeks into Moscow's war against Ukraine that Ukrainian President Volodymyr Zelensky had committed suicide, as part of an aggressive effort to dent public morale and undermine the Ukrainian government, US cybersecur…", "url": "https://www.cnn.com/2022/05/19/politics/pro-russia-disinformation-report/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/181217084838-20181217-russia-social-media-super-tease.jpg", "publishedAt": "2022-05-19T14:00:20Z", "content": "Washington (CNN)Pro-Russia online operatives falsely claimed weeks into Moscow's war against Ukraine that Ukrainian President Volodymyr Zelensky had committed suicide, as part of an aggressive effort… [+3360 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "Review: 'Angelyne' dresses up Emmy Rossum in a two-dimensional look at the 'billboard queen'", "description": "\"Angelyne\" approximates its subject in the wrong ways: It's big, attention-getting and has all the depth of a billboard. Emmy Rossum stars and produced this limited series, which doesn't profess to be truth but rather a facsimile of it. In a year that's alrea…", "url": "https://www.cnn.com/2022/05/19/entertainment/angelyne-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220517153039-01-angelyne-series-super-tease.jpg", "publishedAt": "2022-05-19T13:18:56Z", "content": "(CNN)\"Angelyne\" approximates its subject in the wrong ways: It's big, attention-getting and has all the depth of a billboard. Emmy Rossum stars and produced this limited series, which doesn't profess… [+2287 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lisa Respers France", "title": "Carmen Electra joins OnlyFans to take control of her image", "description": "Carmen Electra, the former \"Baywatch\" star, told People it was a \"no brainer\" for her to join the OnlyFans subscription service, which is known for its adult content.", "url": "https://www.cnn.com/2022/05/19/entertainment/carmen-electra-onlyfans/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220519081745-carmen-electra-0322.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-19T13:16:17Z", "content": "Carmen Electra has entered the world of OnlyFans.\r\nThe former Baywatch star told People it was a no brainer for her to join the subscription service thats known for its adult content.\r\nI, for once, h… [+1091 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Natasha Bertrand, Alex Marquardt and Kevin Liptak, CNN", "title": "White House working towards first presidential meeting with Saudi Arabia, which Biden had vowed to make a 'pariah'", "description": "President Joe Biden and Saudi Arabia's de facto ruler, crown prince Mohammed bin Salman, could meet for the first time as soon as next month, multiple sources told CNN. A meeting would come after months of diplomatic heavy lifting and represent a turnabout fo…", "url": "https://www.cnn.com/2022/05/19/politics/joe-biden-mohammed-bin-salman/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210217134304-biden-bin-salman-split-super-tease.jpg", "publishedAt": "2022-05-19T13:01:27Z", "content": "Washington (CNN)President Joe Biden and Saudi Arabia's de facto ruler, crown prince Mohammed bin Salman, could meet for the first time as soon as next month, multiple sources told CNN. A meeting woul… [+7541 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Horowitz, CNN Business", "title": "Retailers just sounded an alarm on inflation. It's worth heeding", "description": "Shares of retailers were pummeled on Wednesday as investors dug through the latest earnings results from Target and Walmart, which were flush with signs that the economy is entering a period of deep uncertainty.", "url": "https://www.cnn.com/2022/05/19/investing/premarket-stocks-trading/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220519123820-target-bell-051922-super-tease.jpg", "publishedAt": "2022-05-19T12:35:21Z", "content": "A version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here. You can listen to an audio version of the newsletter by clicking the … [+7262 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jordan Valinsky", "title": "Taco Bell's Mexican Pizza finally returns to menus", "description": "Taco Bell's highly anticipated Mexican Pizza finally returns to menus Thursday following a roughly two-year hiatus.", "url": "https://www.cnn.com/2022/05/19/business/taco-bell-mexican-pizza-return/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220417084721-taco-bell-mexican-pizza.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-19T12:06:20Z", "content": "Taco Bells highly anticipated Mexican Pizza finally returns to menus Thursday following a roughly two-year hiatus.\r\nThe beloved menu item was eliminated in November 2020 as part of a broader culling … [+1636 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": null, "description": "everybody in the industry understands what the whole country is going through in terms of the visibility toward next year, in terms of supply-chain issues that we are still dealing with because of Covid,\" Paramount Global's head of US ad sales Jo Ann Ross tol…", "url": "https://view.newsletters.cnn.com/messages/16529289334047284e3a42e5f/raw", "urlToImage": null, "publishedAt": "2022-05-19T11:55:17Z", "content": "Brian Stelter here at 10:48pm ET on Wednesday, May 18. Here's the latest on Elon Musk, Nina Jankowicz, Recurrent Ventures, the CBC, the NYT, Taylor Swift, Dick Wolf, \"Top Gun,\" and so much more...\r\nT… [+4252 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Leah Dolan, CNN", "title": "Adriana Lima shows off baby bump on Cannes red carpet", "description": "At the Cannes film festival premiere of Joseph Kosinski's \"Top Gun: Maverick\" on Wednesday, former Victoria's Secret model Adriana Lima became the latest celebrity to turn maternity fashion on its head.", "url": "https://www.cnn.com/style/article/adriana-lima-cannes-red-carpet-pregnant-bump/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220519114701-adriana-lima-cannes-2-super-tease.jpg", "publishedAt": "2022-05-19T11:40:11Z", "content": "Now in its 75th year, the Cannes red carpet is one of the most revered fashion events on the calendar. Scroll through the gallery to see the best looks from each day of the festival. Deepika Padukone… [+162 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lianne Kolirin, CNN", "title": "British Prime Minister Boris Johnson faces no further action over 'Partygate' scandal", "description": "British Prime Minister Boris Johnson will face no further action over breaches of lockdown regulations after the Metropolitan Police concluded its investigation of the \"Partygate\" scandal, Downing Street said Thursday.", "url": "https://www.cnn.com/2022/05/19/uk/uk-boris-johnson-partygate-gbr-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220228164509-boris-johnson-0224-super-tease.jpg", "publishedAt": "2022-05-19T11:35:40Z", "content": "London (CNN)British Prime Minister Boris Johnson will face no further action over breaches of lockdown regulations after the Metropolitan Police concluded its investigation of the \"Partygate\" scandal… [+3294 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marshall Cohen, CNN", "title": "Clinton campaign lawyer charged in Durham probe seeks mistrial", "description": "The Hillary Clinton campaign lawyer currently on trial as part of special counsel John Durham's investigation requested a mistrial in a late-night filing Wednesday, though the judge overseeing the case has already said he is skeptical of his arguments.", "url": "https://www.cnn.com/2022/05/19/politics/michael-sussmann-john-durham-mistrial-request/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220519064341-michael-sussmann-0517-super-tease.jpg", "publishedAt": "2022-05-19T11:26:10Z", "content": "(CNN)The Hillary Clinton campaign lawyer currently on trial as part of special counsel John Durham's investigation requested a mistrial in a late-night filing Wednesday, though the judge overseeing t… [+2107 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacopo Prisco, CNN", "title": "The restaurant where real Italian mothers rule the kitchen", "description": "The premise is simple: real Italian mothers and grandmothers are recruited from one of Italy's 20 regions. They then move to London for a three-month residency, showcasing their own traditional recipes based around their local cuisine.", "url": "https://www.cnn.com/travel/article/the-restaurant-where-real-italian-mothers-rule-the-kitchen/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220518093650-01-italian-mother-restaurant-top-super-tease.jpg", "publishedAt": "2022-05-19T11:24:57Z", "content": "Editor's Note Forget what you think you know about British food. This Sunday at 8 p.m. ET \"Searching for Italy,\" Stanley Tucci explores how Italian immigration has transformed the food scene in his a… [+4357 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jen Christensen, CNN", "title": "CDC's independent vaccine advisers will meet to discuss Covid-19 boosters for kids", "description": "The US Centers for Disease Control and Prevention's independent Advisory Committee on Immunization Practices (ACIP) will meet Thursday to discuss updates on Covid-19 vaccine safety and effectiveness for children ages 5-11 years, CDC guidance on boosters for t…", "url": "https://www.cnn.com/2022/05/19/health/covid-19-kid-boosters-acip-meeting/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220209163215-covid-vaccine-kids-california-0119-super-tease.jpg", "publishedAt": "2022-05-19T11:23:12Z", "content": "(CNN)The US Centers for Disease Control and Prevention's independent Advisory Committee on Immunization Practices (ACIP) will meet Thursday to discuss updates on Covid-19 vaccine safety and effective… [+2633 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Frankie de la Cretaz", "title": "Opinion: Sports Illustrated's swimsuit issue is a step back in time. And not in a good way", "description": "Sports Illustrated rolled out its annual swimsuit iIssue with messaging this year highlighting body diversity and using buzzwords like \"inclusive.\" While  including a variety of body types and gender orientations could be seen as a step forward, the esthetics…", "url": "https://www.cnn.com/2022/05/19/opinions/women-basketball-wnba-sports-illustrated-swimsuit-cretaz/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220519070041-si-swimsuit-wnba-cover.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-19T11:04:43Z", "content": "Editors Note: Editors note: Frankie de la Cretaz is an independent journalist whose writing sits at the intersection of sports and gender. They are the co-author of Hail Mary: The Rise and Fall of th… [+7851 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Dr. Kee B. Park", "title": "Opinion: Why North Korea's Covid-19 outbreak could shock the world", "description": "Without immediate help, North Korea's Covid-19 death toll could be unprecedented, warns Dr. Kee B. Park, who has worked alongside surgeons in Pyongyang and witnessed firsthand the resourcefulness of staff in stretched hospitals.", "url": "https://www.cnn.com/2022/05/19/opinions/north-korea-covid-19-outbreak-deaths-park/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220519051325-north-korea-covid-0516-super-tease.jpg", "publishedAt": "2022-05-19T10:56:39Z", "content": "Dr. Kee B. Park (@keepark) is director of the Korea Health Policy Project at Harvard Medical School. He has worked alongside North Korean doctors during more than 20 visits to North Korea and is a me… [+6024 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacqueline Howard", "title": "Ukrainians seeking shelter in US must have TB screenings and certain vaccinations", "description": "The United States is preparing to welcome more displaced Ukrainians now that the Biden administration has approved the first group to enter through the new Uniting for Ukraine program. Ukrainians began arriving through the program this month.", "url": "https://www.cnn.com/2022/05/19/health/ukraine-vaccines-tuberculosis-screening/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220315152836-ukraine-vaccinations-file-110921.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-19T10:48:32Z", "content": "The United States is preparing to welcome more displaced Ukrainians now that the Biden administration has approved the first group to enter through the new Uniting for Ukraine program. Ukrainians beg… [+4467 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alexandra Meeks, CNN", "title": "5 things to know for May 19: Ukraine, Buffalo shooting, Stocks, Baby formula, Soccer", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2022/05/19/us/five-things-may-19-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220518140700-01-us-embassy-kyiv-reopen-0518-super-tease.jpg", "publishedAt": "2022-05-19T10:27:15Z", "content": "(CNN)Many Americans say life has at least partially returned to a pre-pandemic normal, but experts warn that when it comes to Covid-19, the US is not out of the woods yet. A third of people in the US… [+6867 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lauren Fox and Daniella Diaz, CNN", "title": "Democrats intensify efforts to stop implementation of draft New York congressional map that pits incumbents against each other", "description": "The Democratic Congressional Campaign Committee is intensifying efforts to stop the implementation of a draft congressional map that would pit several Democratic incumbents against one another in the midterms and has exacerbated sensitive divisions in the cau…", "url": "https://www.cnn.com/2022/05/19/politics/new-york-democrats-congressional-map/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220105214540-sean-patrick-maloney-file-11162021-restricted-super-tease.jpg", "publishedAt": "2022-05-19T10:25:27Z", "content": "The thinly veiled racism here is profoundly disappointing. \r\nA black man is ideologically ill suited to represent a Westchester County District that he represents presently and won decisively in 2020… [+86 chars]"}]}