{"status": "ok", "totalResults": 85, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Elizabeth Wolfe and Hannah Sarisohn, CNN", "title": "Officials ask for public's help as they search for suspect in Moriah Wilson's killing. Here's what evidence has revealed", "description": "Just days before she was to begin a 157-mile race in Austin, Texas, earlier this month, competitive cyclist Anna Moriah \"Mo\" Wilson was shot and killed, shaking the growing community of gravel racing.", "url": "https://www.cnn.com/2022/05/24/us/mo-wilson-death-suspect-search-tuesday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220524013246-mo-wilson-instagram-dupe-super-tease.jpg", "publishedAt": "2022-05-24T08:06:01Z", "content": "(CNN)Just days before she was to begin a 157-mile race in Austin, Texas, earlier this month, competitive cyclist Anna Moriah \"Mo\" Wilson was shot and killed, shaking the growing community of gravel r… [+6552 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Megan Marples", "title": "People will likely lose up to 58 hours of sleep by 2099, study suggests", "description": "Researchers showed that humans living in warmer temperatures do not adapt to heat as well as those living where it's cold. The world's average temperature continues to rise due to global warming, so people can expect their sleep loss to worsen, experts say.", "url": "https://www.cnn.com/2022/05/24/health/sleep-loss-global-warming-study-wellness/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220520021514-02-sleep-loss-global-warming.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-24T08:00:42Z", "content": "People around the world are likely to lose 50 to 58 hours of sleep a year by 2099 due to global warming, a new study revealed.\r\nResearchers used wristbands with internal accelerometers to measure sle… [+4111 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Ronald Brownstein", "title": "Election deniers want to control the 2024 election. And they're getting closer", "description": "Proponents of Donald Trump's discredited lie about rampant fraud in 2020 are running for positions of authority over election administration in virtually every state expected to decide the 2024 presidential race, an explosive trend dramatically underscored by…", "url": "https://www.cnn.com/2022/05/24/politics/midterm-election-2022-georgia-false-claims-trump/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220523175128-perdue-hice-split-super-tease.jpg", "publishedAt": "2022-05-24T04:05:49Z", "content": "To see candidates running on a platform of lies and conspiracy theories about our elections as a campaign position, to see a former president getting involved in endorsing in down ballot races at the… [+257 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/travis-caldwell\">Travis Caldwell</a> and Seán Federico-O'Murchú, CNN", "title": "Russia's war in Ukraine", "description": "President Joe Biden told the Quad Summit in Tokyo the world is \"navigating a dark hour in our shared history\" and that President Vladimir Putin is \"trying to extinguish a culture,\" pointing to Russia's targeting of schools, churches and museums.", "url": "https://www.cnn.com/europe/live-news/russia-ukraine-war-news-05-24-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220523113935-ukraine-cnn-052222-super-tease.jpg", "publishedAt": "2022-05-24T04:00:55Z", "content": "A 20-year veteran of Russia's diplomatic service announced his resignation Monday in protest of his country's war on Ukraine, multiple media outlets reported.  \r\nIn a rare public protest by a Russian… [+3904 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": null, "description": "The online attack campaign against Heard is an important part of the story, but as with so many of these campaigns, it is devilishly hard to trace. \"A years-long campaign of misinformation and online attacks seeded the playing field\" for the trial, Puck's Mat…", "url": "https://view.newsletters.cnn.com/messages/16533612462974388b1f6cddf/raw", "urlToImage": null, "publishedAt": "2022-05-24T04:00:02Z", "content": "\"It's like the O.J. Simpson trial but with technology.\"\r\nThat's what Autumn Witbeck, a stay-at-home mother in Utah, told the WSJ's Rory Satran while \"attempting to explain the fervent interest in the… [+5272 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Theresa Waldrop, CNN", "title": "Here's what we know about the report that says Southern Baptist Convention leaders mishandled sexual abuse allegations", "description": "An independent investigation into the Southern Baptist Convention found its leaders mishandled allegations of sexual abuse, intimidated victims and resisted attempts at reform over the course of two decades.", "url": "https://www.cnn.com/2022/05/23/us/southern-baptist-sexual-abuse-report-explainer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220523181216-southern-baptist-convention-report-sexual-abuse-allegations-super-tease.jpg", "publishedAt": "2022-05-24T02:14:35Z", "content": "(CNN)An independent investigation into the Southern Baptist Convention found its leaders mishandled allegations of sexual abuse, intimidated victims and resisted attempts at reform over the course of… [+8026 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ann Binlot, CNN", "title": "Tired of being 'fetishized and invisible,' Asian artists are changing the narrative", "description": "In much of Western art, Asian women have often appeared as one-dimensional characters -- sometimes seen as meek and docile, and at other times hypersexualized and exoticized. But a new exhibition seeks to counter stereotypical portrayals.", "url": "https://www.cnn.com/style/article/wonder-women-exhibition-ny-asian-artists/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220520000703-celestial-women-swim-in-gold-2022-chelsea-ryoko-wong-super-tease.jpg", "publishedAt": "2022-05-24T01:52:46Z", "content": "arts\r\nIn much of Western art, Asian women have often appeared as one-dimensional characters -- sometimes seen as meek and docile, and at other times hypersexualized and exoticized. But such portrayal… [+5131 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Annie Grayer and Manu Raju, CNN", "title": "Jackson may have violated federal law by using campaign funds to pay for private dining club, report finds", "description": "GOP Rep. Ronny Jackson may have violated federal law by using campaign funds to pay for \"unlimited access\" to a private dining club in Texas, according to a review by a House advisory panel, referring the matter for further investigation.", "url": "https://www.cnn.com/2022/05/23/politics/ronny-jackson-ethics-committee-referral/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200713172720-02-ronny-jackson-super-tease.jpg", "publishedAt": "2022-05-24T01:16:32Z", "content": "(CNN)GOP Rep. Ronny Jackson may have violated federal law by using campaign funds to pay for \"unlimited access\" to a private dining club in Texas, according to a review by a House advisory panel, ref… [+3240 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul LeBlanc, CNN", "title": "Trevor Reed vows to campaign against any lawmakers who slow legislation to help detained Americans", "description": "Trevor Reed, an American citizen and former Marine recently freed after two years imprisoned in Russia, has vowed to campaign against any lawmakers that slow legislation aimed at helping detained Americans.", "url": "https://www.cnn.com/2022/05/23/politics/trevor-reed-republicans-detained-americans-legislation-cnntv/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220523163502-trevor-reed-cnn-interview-super-tease.jpg", "publishedAt": "2022-05-24T01:11:18Z", "content": "Washington (CNN)Trevor Reed, an American citizen and former Marine recently freed after two years imprisoned in Russia, has vowed to campaign against any lawmakers that slow legislation aimed at help… [+2753 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Why luxury property executive believes deflation is coming to Europe", "description": "Hussain Sajwani, chairman of the Dubai-based luxury property development company DAMAC, explains why he thinks people will refrain from buying property, and why deflation is a possibility.", "url": "https://www.cnn.com/videos/business/2022/05/23/deflation-europe-recession-damac-chairman-davos-2022-qmb-vpx.cnnbusiness", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220523170031-damac-chairman-hussain-sajwani-super-tease.jpg", "publishedAt": "2022-05-24T01:04:40Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amir Vera and Jamiel Lynch, CNN", "title": "Prosecutor rules six Atlanta officers were justified while arresting college students during the 2020 protests", "description": "The report says the students arrested violated curfew and did not adhere to demands from officers..", "url": "https://www.cnn.com/2022/05/23/us/atlanta-police-protest-justified-use-of-force/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200601035641-atlanta-police-department-super-tease.jpg", "publishedAt": "2022-05-24T00:48:19Z", "content": "(CNN)A prosecutor found that six Atlanta police officers -- who were scrutinized over the violent arrest of two college students -- were justified in their actions, according to a news release.\r\nThe … [+3217 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Gregory Krieg and Eva McKend, CNN", "title": "Stacey Abrams' playbook faces a new test in second run for Georgia governor", "description": "When Stacey Abrams acknowledged defeat to Republican Brian Kemp in her 2018 campaign for governor of Georgia, she refused to call it a \"concession.\" Four years later, the man she once described as an \"architect of voter suppression\" is the incumbent -- and th…", "url": "https://www.cnn.com/2022/05/23/politics/stacey-abrams-georgia-governor-democratic-primary/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220520183045-02-stacey-abrams-file-restricted-031422-super-tease.jpg", "publishedAt": "2022-05-24T00:46:09Z", "content": "(CNN)When Stacey Abrams acknowledged defeat to Republican Brian Kemp in her 2018 campaign for governor of Georgia, she refused to call it a \"concession.\" Four years later, the man she once described … [+9212 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/jessie-yeung\">Jessie Yeung</a> and <a href=\"/profiles/steve-george\">Steve George</a>, CNN", "title": "Quad leaders meet in Tokyo", "description": "The leaders of the United States, India, Japan and Australia are meeting on Tuesday for a summit in Tokyo where tensions regarding China and Ukraine loom large. Follow for live updates.", "url": "https://www.cnn.com/asia/live-news/biden-asia-trip-quad-summit-05-24-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220523005306-quad-meeting-09242021-super-tease.jpg", "publishedAt": "2022-05-24T00:42:32Z", "content": "President Joe Biden is set to wrap up his final stop on his first visit to Asia with a summit that's aimed at countering Beijing's expanding influence, a day after saying the United States would be w… [+2285 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jessie Yeung", "title": "Ukraine war, North Korea's nukes, China's rise: What's on the agenda as Biden meets Quad leaders in Tokyo", "description": "US President Joe Biden is scheduled to meet the leaders of India, Australia and Japan in Tokyo on Tuesday for a summit of the \"Quad\" nations.", "url": "https://www.cnn.com/2022/05/23/asia/the-quad-tokyo-summit-explainer-intl-hnk/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220511061307-quad-summit-2021.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-24T00:12:25Z", "content": "US President Joe Biden is scheduled to meet the leaders of India, Australia and Japan in Tokyo on Tuesday for a summit of the Quad nations.\r\nThe meeting comes at the end of Bidens first trip to Asia … [+8634 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Niamh Kennedy, CNN", "title": "Nazanin Zaghari-Ratcliffe says Iranian authorities forced her to sign false confession as condition of release", "description": "Nazanin Zaghari-Ratcliffe, the dual British-Iranian citizen detained by Iran for nearly 6 years, said Iranian authorities forced her to sign a false confession as a condition of her release.", "url": "https://www.cnn.com/2022/05/23/europe/nazanin-zaghari-ratcliffe-forced-confession-uk-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220316094554-nazanin-zaghari-ratclife-plane-super-tease.jpg", "publishedAt": "2022-05-24T00:10:27Z", "content": "London (CNN)Nazanin Zaghari-Ratcliffe, the dual British-Iranian citizen detained by Iran for nearly 6 years, said Iranian authorities forced her to sign a false confession as a condition of her relea… [+2913 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maegan Vazquez, CNN", "title": "Biden's Taiwan comment hangs over summit with leaders of Japan, India and Australia on final day of Asia trip", "description": "President Joe Biden is set to wrap up his final stop on his first visit to Asia with a summit that's aimed at countering Beijing's expanding influence, a day after saying the United States would be willing to defend Taiwan militarily if China attacks.", "url": "https://www.cnn.com/2022/05/23/politics/joe-biden-japan-tuesday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220523082439-01-biden-asia-trip-0523-super-tease.jpg", "publishedAt": "2022-05-24T00:04:46Z", "content": "(CNN)President Joe Biden is set to wrap up his final stop on his first visit to Asia with a summit that's aimed at countering Beijing's expanding influence, a day after saying the United States would… [+5151 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jen Christensen, CNN", "title": "Anyone can get monkeypox, but CDC warns LGBTQ community about 'greater chance' of exposure now", "description": "Anyone can get or spread monkeypox, but a \"notable fraction of cases\" in the latest global outbreak are happening among gay and bisexual men, the US Centers for Disease Control and Prevention said Monday.", "url": "https://www.cnn.com/2022/05/23/health/monkeypox-lgbtq/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220519121645-01-monkeypox-explainer-super-tease.jpg", "publishedAt": "2022-05-23T23:50:49Z", "content": "(CNN)Anyone can get or spread monkeypox, but a \"notable fraction of cases\" in the latest global outbreak are happening among gay and bisexual men, the US Centers for Disease Control and Prevention sa… [+6635 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rishi Iyengar", "title": "Group of Activision Blizzard employees votes to form the company's first union", "description": "Some workers at Activision Blizzard have officially unionized, marking the company's first union and the video game industry's most high-profile successful organizing effort.", "url": "https://www.cnn.com/2022/05/23/tech/raven-software-union-vote-activision-blizzard/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220523153613-raven-software.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-23T23:33:19Z", "content": "Some workers at Activision Blizzard have officially unionized, marking the companys first union and the video game industrys most high-profile successful organizing effort. \r\nA group of quality assur… [+2769 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kelly Mena", "title": "Georgia early voting is surging as voters deal with new laws", "description": "Early voting has surged in the Georgia primary, with a record-number ballots cast ahead of Tuesday's contests.", "url": "https://www.cnn.com/2022/05/23/politics/georgia-early-voting-turnout/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220523151622-primary-voting-file-050622.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-23T23:17:06Z", "content": "Early voting has surged in the Georgia primary, with a record-number ballots cast ahead of Tuesdays contests. \r\nWhile Republicans have claimed victory after more than a year of Democrats and others s… [+4323 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Dotson", "title": "MLB suspends Yankees third baseman Josh Donaldson for 'inappropriate comments' toward Black player", "description": "Major League Baseball has issued a one-game suspension and undisclosed fine to New York Yankees third baseman Josh Donaldson for what the league calls \"inappropriate comments\" to Chicago White Sox shortstop Tim Anderson during Saturday's game.", "url": "https://www.cnn.com/2022/05/23/sport/yankees-josh-donaldson-suspended-disrespectful-remark-spt/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220522214435-josh-donaldson-yankees-tim-anderson-jackie-racismo-deportes-00002704.png?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-23T23:00:37Z", "content": "Major League Baseball has issued a one-game suspension and undisclosed fine to New York Yankees third baseman Josh Donaldson for what the league calls inappropriate comments to Chicago White Sox shor… [+2801 chars]"}]}