{"status": "ok", "totalResults": 93, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Melanie Radzicki McManus, CNN", "title": "Rock climbing brings unexpected benefits", "description": "Rock climbing may seem like a niche sport, possibly one fraught with danger. After all, it involves scaling the side of a cliff or simulated rock wall. But experts say it offers participants a wide variety of physical and mental health benefits that are not a…", "url": "https://www.cnn.com/2022/05/05/health/rock-climbing-benefits-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220421201315-01-rock-climber-file-072221-super-tease.jpg", "publishedAt": "2022-05-05T08:20:50Z", "content": "(CNN)Rock climbing may seem like a niche sport, possibly one fraught with danger. After all, it involves scaling the side of a cliff or simulated rock wall. But experts say it offers participants a w… [+6279 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Jacopo Prisco, CNN", "title": "This solar-powered plane could stay in the air for months", "description": "Solar Impulse 2 circumnavigated the Earth without using a drop of fuel. Now, Skydweller Aero aims to use the plane to create the world's first commercially viable \"pseudo-satellite.\"", "url": "https://www.cnn.com/travel/article/skydweller-solar-powered-plane-solar-impulse-climate-scn-spc-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220504141537-restricted-02-skydweller-solar-impulse-story-card-super-tease.jpg", "publishedAt": "2022-05-05T07:49:15Z", "content": "(CNN) In 2016, a bizarre-looking plane, covered with more than 17,000 solar panels, showed the world a glimpse of the future of flight. With the wingspan of a Boeing 747, but weighing only as much as… [+5707 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacqui Palumbo, CNN", "title": "The internet's famous dancing baby from 1996 is getting a new look", "description": "If you were born before 1990, you may remember the 3D graphic of an almost-naked baby that danced on a loop to become one of the internet's earliest viral phenomenons. The strange-yet-sassy \"Dancing Baby\" began spreading via forwarded email chains in 1996 bef…", "url": "https://www.cnn.com/style/article/dancing-baby-meme-nft/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220504125439-01-dancing-baby-remix-super-tease.jpg", "publishedAt": "2022-05-05T07:32:34Z", "content": "arts\r\nIf you were born before 1990, you may remember the 3D graphic ofan almost-naked baby that danced on a loop to become one of the internet's earliest viral phenomenons. The strange-yet-sassy \"Dan… [+5815 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Elizabeth Wolfe, Amara Walker and Jade Gordon, CNN", "title": "Search for Alabama corrections officer and inmate enters 7th day as officials piece together why they disappeared", "description": "Investigators are pleading for Alabama corrections official Vicky White to turn herself in as the search for her and the inmate she disappeared, Casey White, with enters its seventh day.", "url": "https://www.cnn.com/2022/05/05/us/alabama-vicky-white-casey-white-search-thursday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220501071557-vicki-white-casey-white-super-tease.jpg", "publishedAt": "2022-05-05T07:14:08Z", "content": "(CNN)Investigators are pleading for Alabama corrections official Vicky White to turn herself in as the search for her and the inmate she disappeared with enters its seventh day. \r\n\"Vicky, you've been… [+6562 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jackie Wattles, CNN Business", "title": "SpaceX's jam-packed schedule continues with another astronaut return", "description": "Three NASA astronauts and a European astronaut are returning home from the International Space Station, capping off their six-month mission during which they worked alongside Russian cosmonauts and hosted the first all-private crew to visit the orbiting outpo…", "url": "https://www.cnn.com/2022/05/05/tech/spacex-crew-3-nasa-undock-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220505012300-01-spacex-crew3-undock-0505-super-tease.jpg", "publishedAt": "2022-05-05T05:29:13Z", "content": "New York (CNN Business)Three NASA astronauts and a European astronaut are returning home from the International Space Station, capping off their six-month mission during which they worked alongside R… [+7271 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "CNN speaks to the Ukrainian oligarch helping fund fight against Putin", "description": "CNN's Nic Robertson speaks to Ukrainian oligarch Dmitry Firtash, a major contributor to the war effort against Russia, who is facing extradition to the US.", "url": "https://www.cnn.com/videos/business/2022/05/05/ukrainian-oligarch-dmitry-firtash-robertson-pkg-ovn-intl-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220505003801-dmitry-firtash-thumb-robertson-pkg-vpx-super-tease.jpg", "publishedAt": "2022-05-05T05:03:44Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/helen-regan\">Helen Regan</a> and <a href=\"/profiles/andrew-raine\">Andrew Raine</a>, CNN", "title": "Russia's war in Ukraine", "description": "A Ukrainian commander at the Azovstal steel plant said there are \"bloody battles\" unfolding with Russian forces inside the complex after they breached the perimeter. Follow here for live updates.", "url": "https://www.cnn.com/europe/live-news/russia-ukraine-war-news-05-05-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220504143212-azovstal-mariupol-ukraine-steel-plant-blurred-super-tease.jpg", "publishedAt": "2022-05-05T04:03:15Z", "content": "A Ukrainian commander at the Azovstal steel plant in Mariupol said there are \"bloody battles\" unfolding with Russian forces inside the complex after they breached the perimeter, even as Russia said i… [+2017 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Mary Kay Mallonee", "title": "Cawthorn addresses video released by opposition group showing him naked in bed 'being crass'", "description": "An opposition group that is actively campaigning against Rep. Madison Cawthorn has released a video clip appearing to show the North Carolina Republican naked in bed and, as Cawthorn described it, \"being crass with a friend\" and \"acting foolish.\"", "url": "https://www.cnn.com/2022/05/04/politics/cawthorn-response-opposition-group-video/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220504224551-03-cawthorn-response.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-05T03:27:03Z", "content": "An opposition group that is actively campaigning against Rep. Madison Cawthorn has released a video clip appearing to show the North Carolina Republican naked in bed and, as Cawthorn described it, be… [+3281 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Text by Lilit Marcus, CNN; Video by Max Burnell, CNN", "title": "How to build a runway out of solid ice", "description": "Just about everything that supports human life on Antarctica must be brought in from elsewhere, usually by aircraft. And in order for that aircraft to have a place to land somebody has to construct a runway out of solid ice.", "url": "https://www.cnn.com/travel/article/ice-runway-antarctica-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220404092705-wolfs-fang-runway-super-tease.jpg", "publishedAt": "2022-05-05T02:27:48Z", "content": "Text by Lilit Marcus, CNN; Video by Max Burnell, CNNPublished 5th May 2022\r\n(CNN) Just about everything that supports human life on Antarctica must be brought in from elsewhere, usually by aircraft. … [+7207 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dakin Andone", "title": "Some abortion clinics are preparing for more out-of-state patients if Roe v. Wade is overturned", "description": "Abortion clinics in states likely to maintain access to the procedure are preparing for a potential influx of out-of-state patients following the report of a leaked draft of a Supreme Court majority opinion that would overturn Roe v. Wade.", "url": "https://www.cnn.com/2022/05/04/us/abortion-out-of-state-patients-roe-v-wade/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220504130235-01-jackson-womens-health-organization-0503.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-05T01:05:21Z", "content": "Abortion clinics in states likely to maintain access to the procedure are preparing for a potential influx of out-of-state patients following the report of a leaked draft of a Supreme Court majority … [+6701 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Alice Stewart", "title": "Opinion: Conservatives held our noses and voted for Trump. Reversing Roe would be our reward", "description": "\"As a pro-life social conservative, I received my fair share of criticism for supporting Donald Trump for president,\" writes commentator Alice Stewart. \"But I focused on the value of lifetime appointments to the high court that would elevate jurists who belie…", "url": "https://www.cnn.com/2022/05/04/opinions/supreme-court-abortion-conservatives-roe-stewart/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220221215729-march-for-life-closeup-file-01202022-super-tease.jpg", "publishedAt": "2022-05-05T00:08:07Z", "content": "Alice Stewart is a CNN Political Commentator and board member at the John F. Kennedy Institute of Politics at Harvard University. The views expressed in this commentary are her own. Read more opinion… [+4687 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Raja Razek, CNN", "title": "Alabama church known for role in voting rights movement is on the list of most endangered historic places", "description": "A Selma, Alabama, church with historic ties to the 1960s voting rights movement has landed on the 2022 Most Endangered Places list -- because of termites.", "url": "https://www.cnn.com/2022/05/04/us/selma-alabama-church-most-endangered-historic-places-list/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220504150051-01-brown-chapel-african-methodist-episcopal-church-super-tease.jpg", "publishedAt": "2022-05-05T00:07:35Z", "content": "(CNN)A Selma, Alabama, church with historic ties to the 1960s voting rights movement has landed on the 2022 Most Endangered Places list -- because of termites.\r\nBrown Chapel African Methodist Episcop… [+1993 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Fung, CNN", "title": "New York City pension funds sue Activision Blizzard, seeking records on CEO Bobby Kotick", "description": "New York City pension fund officials sued Activision Blizzard late last month in a bid to force the company to disclose records that may uncover whether CEO Bobby Kotick breached his fiduciary duty to investors, according to a newly released copy of the compl…", "url": "https://www.cnn.com/2022/05/04/tech/activision-blizzard-lawsuit-kotick-new-york/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220504194620-bobby-kotick-file-070621-super-tease.jpg", "publishedAt": "2022-05-04T23:56:20Z", "content": "(CNN Business)New York City pension fund officials sued Activision Blizzard late last month in a bid to force the company to disclose records that may uncover whether CEO Bobby Kotick breached his fi… [+2627 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Holmes Lybrand and Hannah Rabinowitz, CNN", "title": "Two men accused of attacking DC Officer Michael Fanone on Jan. 6 set to enter into plea agreements this week", "description": "Two of the alleged assailants of former DC police Officer Michael Fanone have plea agreement hearings scheduled before the DC District Court this week, bringing a partial close to one of the most high-profile assault cases of the January 6, 2021, US Capitol r…", "url": "https://www.cnn.com/2022/05/04/politics/michael-fanone-case-assault-plea-agreements/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210617121330-0617-officerfanone-super-tease.jpg", "publishedAt": "2022-05-04T23:23:19Z", "content": "(CNN)Two of the alleged assailants of former DC police Officer Michael Fanone have plea agreement hearings scheduled before the DC District Court this week, bringing a partial close to one of the mos… [+2465 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Natasha Bertrand and Paul LeBlanc, CNN", "title": "Biden asks Congress to help provide Afghan refugees a pathway to become US residents", "description": "President Joe Biden has asked Congress to provide tens of thousands of Afghan refugees with a pathway to become legal permanent residents of the United States, according to a proposal included in the supplemental budget request he sent to lawmakers last week.", "url": "https://www.cnn.com/2022/05/04/politics/white-house-afghan-refugees-ukraine-aid-bill/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220504174853-joe-biden-050422-super-tease.jpg", "publishedAt": "2022-05-04T22:41:15Z", "content": "Washington (CNN)President Joe Biden has asked Congress to provide tens of thousands of Afghan refugees with a pathway to become legal permanent residents of the United States, according to a proposal… [+2562 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nimi Princewill, CNN", "title": "'The world has not forgotten us': Nigeria's Buhari thankful for UN chief's visit amid war in Ukraine", "description": "Nigeria's President Muhammadu Buhari has thanked UN Secretary-General Antonio Guterres for his visit to the country, saying that he is grateful the West African nation hasn't been forgotten amid the Russia-Ukraine conflict.", "url": "https://www.cnn.com/2022/05/04/africa/un-guterres-first-visit-nigeria-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220504133001-buhari-guterres-0504-super-tease.jpg", "publishedAt": "2022-05-04T22:05:36Z", "content": "Abuja, Nigeria (CNN)Nigeria's President Muhammadu Buhari has thanked UN Secretary-General Antonio Guterres for his visit to the country, saying that he is grateful the West African nation hasn't been… [+3677 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hannah Rabinowitz, Holmes Lybrand and Katelyn Polantz, CNN", "title": "Top Oath Keepers member says he overheard extremist group's leader trying to connect with Trump after US Capitol riot", "description": "A top member of the Oath Keepers said in court on Wednesday that he overheard the leader of the group, Stewart Rhodes, trying and failing to get in touch with then-President Donald Trump after the January 6, 2021, attack on the US Capitol.", "url": "https://www.cnn.com/2022/05/04/politics/oath-keepers-wilson-rhodes/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220504155710-01-us-capitol-breech-file-010621-super-tease.jpg", "publishedAt": "2022-05-04T21:43:53Z", "content": "(CNN)A top member of the Oath Keepers said in court on Wednesday that he overheard the leader of the group, Stewart Rhodes, trying and failing to get in touch with then-President Donald Trump after t… [+3715 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sharif Paget, CNN", "title": "Multiple people trapped and injured at scene of a partial building collapse at a former power plant in South Boston", "description": "One person has sustained life-threatening injuries and multiple people are trapped following a partial building collapse at the Edison Power Plant building in South Boston, Police Department spokesman Andre Watson said Wednesday.", "url": "https://www.cnn.com/2022/05/04/us/boston-power-plant-site-collapse/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220504160727-01-boston-power-plant-floor-collapse-super-tease.jpg", "publishedAt": "2022-05-04T21:15:35Z", "content": "(CNN)One person has sustained life-threatening injuries and multiple people are trapped following a partial building collapse at the Edison Power Plant building in South Boston, Police Department spo… [+546 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Stephanie Elam, CNN", "title": "Officials worry Southern California won't have enough water to get through summer without unprecedented cuts", "description": "\"I don't want anybody to turn on the faucet and not have water,\" said one Southern California water manager.", "url": "https://www.cnn.com/2022/05/04/us/california-drought-water-restrictions-climate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220504162227-01-california-drought-water-restrictions-climate-super-tease.jpg", "publishedAt": "2022-05-04T20:54:58Z", "content": "Why the Great American Lawn is terrible for the West's water crisis\r\nLake Powell officials face an impossible choice in the West's megadrought: Water or electricity\r\nLake Mead plummets to unfathomabl… [+290 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Clare Foran and Melanie Zanona, CNN", "title": "New audio: McCarthy said 25th Amendment 'takes too long' and wanted to reach out to Biden after January 6 attack", "description": "House Republican leader Kevin McCarthy discussed the 25th Amendment on a call with GOP leadership days after the January 6, 2021, attack on the Capitol and said the process \"takes too long,\" according to an audio recording obtained by two New York Times repor…", "url": "https://www.cnn.com/2022/05/04/politics/mccarthy-audio-25th-amendment-biden/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220426160656-kevin-mccarthy-0121-file-super-tease.jpg", "publishedAt": "2022-05-04T20:49:14Z", "content": "(CNN)House Republican leader Kevin McCarthy discussed the 25th Amendment on a call with GOP leadership days after the January 6, 2021, attack on the Capitol and said the process \"takes too long,\" acc… [+4938 chars]"}]}