{"status": "ok", "totalResults": 59, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Sara Stewart", "title": "Opinion: Emma Thompson's new film captures the truth about sex", "description": "'Good Luck To You, Leo Grande' is a marvel and a rarity, writes Sara Stewart, because its gentle honesty about the wide spectrum of human sexuality stands in direct opposition to so much of what we see depicted in movies as 'normal' sex -- particularly women'…", "url": "https://www.cnn.com/2022/06/19/opinions/emma-thompson-leo-grande-sex-stewart/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220617153616-01-good-luck-to-you-leo-grande-super-tease.jpg", "publishedAt": "2022-06-19T12:47:02Z", "content": "Sara Stewart is a film and culture writer who lives in western Pennsylvania. The views expressed here are solely the author's own. View more opinion articles on CNN.\r\n (CNN)If you wrote up a list of … [+6265 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Jonathan Reckford and Lisa Rice for CNN Business Perspectives", "title": "Opinion: The Black-White homeownership gap is wider than it was in the '60s. Here's how to close it", "description": "Elected officials and affordable housing advocates must act boldly and decisively to ensure the dream of American homeownership does not remain an empty promise for yet another generation of Black and Latino families.", "url": "https://www.cnn.com/2022/06/19/perspectives/homeownership-gap-juneteenth/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220617135357-american-dream-homeownership-gap-super-tease.jpg", "publishedAt": "2022-06-19T12:25:31Z", "content": "Jonathan Reckford is CEO of Habitat for Humanity International. Lisa Rice is CEO of National Fair Housing Alliance. The opinions expressed in this commentary are their own. \r\nIt is ironic and fitting… [+6267 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Melanie Zanona, CNN", "title": "GOP impeachment backers wrestle with their own political survival after Tom Rice's loss", "description": "After Rep. Tom Rice became the first electoral victim of Donald Trump's revenge campaign against the Republicans who voted to impeach him, a GOP colleague who had also backed the former President's impeachment reached out to the South Carolina lawmaker and at…", "url": "https://www.cnn.com/2022/06/19/politics/house-impeachment-republicans-tom-rice/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220610211323-tom-rice-file-031722-super-tease.jpg", "publishedAt": "2022-06-19T12:19:53Z", "content": "(CNN)After Rep. Tom Rice became the first electoral victim of Donald Trump's revenge campaign against the Republicans who voted to impeach him, a GOP colleague who had also backed the former Presiden… [+7336 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "France votes, with Macron facing tough battle for control of parliament", "description": "Voting was underway in France on Sunday in a parliamentary election that could deprive newly re-elected centrist President Emmanuel Macron of the absolute majority he needs to govern with a free hand.", "url": "https://www.cnn.com/2022/06/19/europe/france-parliamentary-election-macron-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220619123715-01-french-parliamentary-election-2022-super-tease.jpeg", "publishedAt": "2022-06-19T12:19:42Z", "content": "(Reuters)Voting was underway in France on Sunday in a parliamentary election that could deprive newly re-elected centrist President Emmanuel Macron of the absolute majority he needs to govern with a … [+3594 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Richard Galant, CNN", "title": "Opinion: Echoes of history stalk Biden and Trump", "description": "President Joe Biden's challenges resemble those that faced Jimmy Carter, as his Oval Office interview with the AP suggested, and they've helped provoke a debate among Democrats about whether he should run again in 2024. But it wasn't only Biden who contended …", "url": "https://www.cnn.com/2022/06/19/opinions/biden-trump-history-column-galant/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220617115941-president-joe-biden-washington-060822-restricted-super-tease.jpg", "publishedAt": "2022-06-19T12:14:54Z", "content": "Sign up to get this weekly column as a newsletter. We're looking back at the strongest, smartest opinion takes of the week from CNN and other outlets.\r\n (CNN)In the summer of 1979, with inflation sur… [+16499 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tami Luhby", "title": "Last summer, this school district served kids 36,000 meals a week. This summer, it will be lucky to serve 600 a week. Here's why.", "description": "Summer meals programs around the country are drastically shrinking this year because Congress did not extend Covid-19 pandemic waivers that provided school districts with much more freedom to distribute food to kids during the break.", "url": "https://www.cnn.com/2022/06/19/politics/covid-pandemic-summer-lunch-waiver-expires/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220615154734-01-summer-meals-2021.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-06-19T12:00:59Z", "content": "Last summer, Shenae Rowe was able to provide 36,000 meals a week to hungry kids throughout Warrick County in rural southwest Indiana. Parents could pick up a weeks worth of food in one trip to take h… [+7888 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristen Rogers, CNN", "title": "There are dads worse than you -- in the animal kingdom", "description": "Worrying that you're going to fail as a parent is normal, and you will mess up. But dads should know there are some fathers much worse than them -- in the animal kingdom.", "url": "https://www.cnn.com/2022/06/19/world/bad-animal-dads-fathers-day-wellness-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220617154619-02-bad-animal-dads-restricted-super-tease.jpg", "publishedAt": "2022-06-19T10:01:56Z", "content": "(CNN)If you're a father, you probably have experienced endless anxieties about whether you're doing enough for your kids while they're growing up. \r\nWhat if your children inherit your negative habits… [+4045 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tim Lister, Denis Lapin and Julia Kesaieva, CNN", "title": "Western support for Kyiv must not cease, say NATO chief and British Prime Minister", "description": "The West must prepare for a long war in Ukraine as Russia makes incremental gains in a furious battle to control the country's east, the NATO Secretary General Jens Stoltenberg and British Prime Minister Boris Johnson have both said.", "url": "https://www.cnn.com/2022/06/19/europe/ukraine-russia-war-stoltenberg-johnson-intl-gbr/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220619043144-04-ukraine-russia-war-super-tease.jpg", "publishedAt": "2022-06-19T09:29:05Z", "content": "(CNN)The West must prepare for a long war in Ukraine as Russia makes incremental gains in a furious battle to control the country's east, the NATO Secretary General Jens Stoltenberg and British Prime… [+6632 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Barbie Latza Nadeau with Hada Messia, CNN", "title": "E-scooters were supposed to fix travel in Rome. Then they became 'death traps'", "description": "Introduced as a transport solution during Covid, e-scooters have become a scourge in Italy's capital, blamed for deaths, injuries and damage to historic landmarks.", "url": "https://www.cnn.com/travel/article/rome-scooter-problems/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220619101031-rome-scattered-scooters-super-tease.jpg", "publishedAt": "2022-06-19T09:11:21Z", "content": "Barbie Latza Nadeau with Hada Messia, CNNPublished 19th June 2022\r\nRome (CNN) Rome, the eternal city, has been invaded, conquered and pillaged countless times since its founding nearly 2,800 years ag… [+5346 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Emmy Abbassi, CNN", "title": "The 'Scooby-Doo' Mystery Machine was listed on Airbnb and sold out fast", "description": "To celebrate the 20-year anniversary of the \"Scooby-Doo\" live-action film, Warner Bros. and Airbnb offered an overnight stay in the Mystery Machine.", "url": "https://www.cnn.com/travel/article/scooby-doo-mystery-machine-airbnb-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220618115459-01-mystery-machine-airbnb-super-tease.jpg", "publishedAt": "2022-06-19T09:02:19Z", "content": "(CNN) To celebrate the 20-year anniversary of the \"Scooby-Doo\" live-action film, Warner Bros. and Airbnb offered an overnight stay in the Mystery Machine.\r\nActor Matthew Lillard, who played Shaggy in… [+1197 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Holly Yan, CNN", "title": "These children lost young parents to Covid-19. Here's what they want other kids -- and adults -- to know", "description": "A kindergartener just finished his first day of school when he watched his young mother collapse and take her final breaths. Suddenly, he was orphaned by Covid-19. A 13-year-old girl has suffered panic attacks since her dad's death -- but must stay strong to …", "url": "https://www.cnn.com/2022/06/19/us/young-parents-covid-deaths/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220616001444-02-katherine-klosterman-family-orphans-of-covid-super-tease.jpeg", "publishedAt": "2022-06-19T08:02:55Z", "content": "(CNN)A 5-year-old had just finished his first day of kindergarten when he watched his young mother collapse and take her final breaths. A 13-year-old has suffered panic attacks since her dad's death.… [+11479 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Heather Chen, CNN", "title": "Proud to be back: Singapore's Pink Dot rally makes colorful return", "description": "After two years of virtual rallies due to the pandemic, Singapore's biggest queer pride event returned on Saturday to Hong Lim Park.", "url": "https://www.cnn.com/2022/06/19/asia/singapore-pink-dot-pride-gay-queer-lesbian-rights-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220618223519-05-singapore-pink-dot-061822-super-tease.jpg", "publishedAt": "2022-06-19T07:48:51Z", "content": "Singapore (CNN)In a sea of thousands decked out in rainbow and pink, Dawn Lim, a full-time officer doing mandatory military service in the Singapore army, was not as flamboyantly dressed as many of h… [+3483 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Faith Karimi, CNN", "title": "He's a 'proud dad' to 3 million people", "description": "Every week, he sits down to dinner and a chat with them. He looks into the camera and asks them how their day was. He tells them he's proud of them. Some days, he prays with them.", "url": "https://www.cnn.com/2022/06/19/us/tiktok-dad-fathers-day-cec/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220616124232-02-tiktok-proud-dad-summer-clayton-cec-super-tease.jpg", "publishedAt": "2022-06-19T07:01:40Z", "content": "(CNN)Summer Clayton may not have children in real life, but he's a \"proud dad\" to 2.8 million people on TikTok. \r\nEvery week, he sits down to dinner and a virtual chat with his \"kids.\" He looks into … [+8407 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Yenny Sanchez, CNN", "title": "The New York Public Library is giving away 500,000 books this summer", "description": "The New York Public Library (NYPL) has announced that it will give away 500,000 books to city residents to keep as part of its \"Summer at the Library Program.\" Its goal is to help kids, teens and adults build their home libraries, as well as keep youth produc…", "url": "https://www.cnn.com/2022/06/19/us/new-york-public-library-free-books-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220618140247-new-york-public-library-free-books-super-tease.jpg", "publishedAt": "2022-06-19T06:01:33Z", "content": "(CNN)The New York Public Library (NYPL) has announced that it will give away 500,000 books to city residents to keep as part of its \"Summer at the Library Program.\" Its goal is to help kids, teens an… [+1316 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Andy Rose", "title": "Police are searching for a suspect who allegedly punched the mayor of Louisville, Kentucky, officials say", "description": "Police in Louisville, Kentucky, are searching for a suspect they believe punched the city's mayor at a popular downtown event complex Saturday.", "url": "https://www.cnn.com/2022/06/19/us/louisville-kentucky-mayor-punched/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220618234005-01-louisville-kentucky-mayor-punched.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-06-19T04:19:18Z", "content": "Police in Louisville, Kentucky, are searching for a suspect they believe punched the citys mayor at a popular downtown event complex Saturday.\r\nEarlier this evening, while at Fourth Street Live, Mayo… [+1403 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Margaret Zulver", "title": "Analysis: Colombia needs a leader who'll implement the peace accord. For women, it's a matter of life and death", "description": "Today, Colombians will return to the polls to vote in the second round of the country's presidential elections. Six years after the peace deal between the government of Colombia and the Revolutionary Armed Forces of Colombia (FARC) brought five decades of con…", "url": "https://www.cnn.com/2022/06/19/americas/colombia-elections-peace-accord-women-as-equals-intl-cmd/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220615111549-10-colombian-presidential-election.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-06-19T04:09:16Z", "content": "Editors Note: This story is part of As Equals, CNNs ongoing series on gender inequality. For information about how the series is funded and more, check out our FAQs.\r\nToday, Colombians will return to… [+10542 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Internet Explorer's final resting place: as a 'world-class joke' in South Korea", "description": "For Jung Ki-young, a South Korean software engineer, Microsoft's decision to retire its Internet Explorer web browser marked the end of a quarter-century love-hate relationship with the technology.", "url": "https://www.cnn.com/2022/06/18/asia/internet-explorer-gravestone-viral-south-korea-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220618224304-internet-explorer-gravestone-viral-south-korea-intl-hnk-super-tease.jpg", "publishedAt": "2022-06-19T02:54:38Z", "content": "SeoulFor Jung Ki-young, a South Korean software engineer, Microsoft's decision to retire its Internet Explorer web browser marked the end of a quarter-century love-hate relationship with the technolo… [+1780 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Stelter and Nicole Goodkind, CNN", "title": "Mark Shields, political analyst on CNN and PBS 'NewsHour,' dies", "description": "Mark Shields, the political sage and longtime analyst for CNN and PBS, died Saturday morning at the age of 85, the anchor of PBS NewsHour confirmed.", "url": "https://www.cnn.com/2022/06/18/media/mark-shields-obit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220618131753-02-mark-shields-obit-super-tease.jpg", "publishedAt": "2022-06-19T00:20:27Z", "content": "New York (CNN Business)Mark Shields, the political sage and longtime analyst for CNN and PBS, died Saturday morning at the age of 85, the anchor of PBS NewsHour confirmed.\r\nShields was well known for… [+3357 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Paul Begala", "title": "Opinion: Mark Shields' invaluable advice", "description": "Paul Begala writes, \"Many years ago, when I was young, cocky and lucky enough to run into early success, something wonderful and rare happened to me: I had the gift of being Mark Shields' friend and the beneficiary of his hard-won wisdom.\"", "url": "https://www.cnn.com/2022/06/18/opinions/mark-shields-tribute-invaluable-advice-begala/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220618131753-02-mark-shields-obit-super-tease.jpg", "publishedAt": "2022-06-18T23:41:50Z", "content": "Paul Begala, a Democratic strategist and CNN political commentator, was a political consultant for Bill Clinton's presidential campaign in 1992 and served as a counselor to Clinton in the White House… [+4068 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nicole Goodkind, CNN Business", "title": "The most popular air travel day this year was a mess. That won't change anytime soon", "description": "Americans gained a new federal holiday last year: Juneteenth. This year the holiday, which commemorates of the end of slavery in the United States, falls on Sunday but it will be observed in many places on Monday, June 20.", "url": "https://www.cnn.com/2022/06/18/economy/air-travel-summer-junteenth/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220618093006-san-francisco-airport-0613-restricted-super-tease.jpg", "publishedAt": "2022-06-18T21:38:28Z", "content": "New York (CNN Business)Americans gained a new federal holiday last year: Juneteenth. This year the holiday, which commemorates of the end of slavery in the United States, falls on Sunday but it will … [+3548 chars]"}]}