{"status": "ok", "totalResults": 104, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Marshall Cohen, CNN", "title": "Durham prosecutors detail criminal probe into tech executive who worked on Trump-Russia back channel claims", "description": "Special counsel John Durham has an active and ongoing criminal probe into a tech executive who worked with a Hillary Clinton 2016 campaign lawyer to share claims of a cyber back channel between Donald Trump and Russia, prosecutors said in court Wednesday.", "url": "https://www.cnn.com/2022/04/27/politics/john-durham-criminal-probe-rodney-joffe/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220215172717-john-durham-super-tease.jpg", "publishedAt": "2022-04-28T01:28:32Z", "content": "Washington (CNN)Special counsel John Durham has an active and ongoing criminal probe into a tech executive who worked with a Hillary Clinton 2016 campaign lawyer to share claims of a cyber back chann… [+4794 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Conlon, CNN", "title": "Judge in Nikolas Cruz sentencing reverses course on jury selection", "description": "The judge presiding over the Nikolas Cruz sentencing reversed course Wednesday, deciding against starting over with jury selection -- something she said two days earlier would happen at the prosecution's request.", "url": "https://www.cnn.com/2022/04/27/us/nikolas-cruz-judge-jury-selection-decision/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220427162707-nikolas-cruz-enters-court-0427-super-tease.jpg", "publishedAt": "2022-04-28T01:07:39Z", "content": "(CNN)The judge presiding over the Nikolas Cruz sentencing reversed course Wednesday, deciding against starting over with jury selection -- something she said two days earlier would happen at the pros… [+2158 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paula Reid, Annie Grayer, Ryan Nobles and Zachary Cohen, CNN", "title": "Rudy Giuliani expected to appear before January 6 committee next month", "description": "Rudy Giuliani is expected to appear next month before the House select committee investigating the January 6, 2021, insurrection, according to sources familiar with the matter.", "url": "https://www.cnn.com/2022/04/27/politics/rudy-giuliani-january-6-committee-next-month/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203094624-01-rudy-giuliani-file-super-tease.jpg", "publishedAt": "2022-04-28T00:07:22Z", "content": "(CNN)Rudy Giuliani is expected to appear next month before the House select committee investigating the January 6, 2021, insurrection, according to sources familiar with the matter.\r\nThe expected app… [+2502 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Steve Contorno, CNN", "title": "DeSantis amplifies 2024 chatter with trip to Nevada to campaign for Senate candidate Laxalt", "description": "Coming off a showdown with Disney and a month of headlines for waging fights over hot-button social issues, Florida Gov. Ron DeSantis will introduce himself to Republican primary voters in Nevada on Wednesday when he campaigns for US Senate candidate Adam Lax…", "url": "https://www.cnn.com/2022/04/27/politics/ron-desantis-2024-nevada-laxalt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220427152529-desantis-abortion-bill-signing-april-14-super-tease.jpg", "publishedAt": "2022-04-27T23:59:31Z", "content": "Las Vegas (CNN)Coming off a showdown with Disney and a month of headlines for waging fights over hot-button social issues, Florida Gov. Ron DeSantis will introduce himself to Republican primary voter… [+7851 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/aditi-sandal\">Aditi Sangal</a>, Maureen Chowdhury, <a href=\"/profiles/jessie-yeung\">Jessie Yeung</a>, Seán Federico O'Murchú, Ben Morse, Jeevan Ravindran and Ed Upright, CNN", "title": "Catch up on what you need to know", "description": "Civilians are fleeing the southern Ukrainian city of Kherson, which has fallen to Russian control and is expected to stage what Ukrainian leaders have called a sham referendum. Follow here for live news updates.", "url": "https://edition.cnn.com/europe/live-news/russia-ukraine-war-news-04-27-22/index.html", "urlToImage": "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/cb721166-f644-40fb-862a-7aa3eaf1d136.jpg", "publishedAt": "2022-04-27T23:30:00Z", "content": "At least six different Kremlin-linked hacking groups have conducted nearly 240 cyber operations against Ukrainian targets, Microsoft said Wednesday, in data that reveals a broader scope of alleged Ru… [+4123 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brad Lendon", "title": "Russia's tanks in Ukraine have a 'jack-in-the-box' design flaw. And the West has known about it since the Gulf war", "description": "Russian tanks with their tops blown off are just the latest sign that Russia's invasion of Ukraine isn't going to plan.", "url": "https://www.cnn.com/2022/04/27/europe/russia-tanks-blown-turrets-intl-hnk-ml/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220420210714-04-destroyed-russian-tank-file-restricted-041522.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-27T23:18:12Z", "content": "Russian tanks with their tops blown off are just the latest sign that Russias invasion of Ukraine isnt going to plan.\r\nHundreds of Russian tanks are thought to have been destroyed since Moscow launch… [+5197 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jen Christensen, CNN", "title": "Ban on menthol cigarettes and flavored cigars could save hundreds of thousands of lives, experts say", "description": "The US Food and Drug Administration is expected to announce a proposed rule this week to ban menthol from cigarettes, as well as to ban flavored cigars. It's a step that public health officials say is essential to protect public health.", "url": "https://www.cnn.com/2022/04/27/health/proposed-menthol-ban/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220223172721-03-adolescent-smoking-super-tease.jpeg", "publishedAt": "2022-04-27T23:12:34Z", "content": "(CNN)The US Food and Drug Administration is expected to announce a proposed rule this week to ban menthol from cigarettes, as well as to ban flavored cigars. It's a step that public health officials … [+10459 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "MJ Lee and Kevin Liptak, CNN", "title": "Biden will visit South Korea and Japan next month as he works to keep focus on Asia", "description": "President Joe Biden will make his first trip to Asia as president next month, visiting South Korea and Japan from May 20 to May 24, White House officials told CNN, underscoring his commitment to the region even as international attention is directed toward th…", "url": "https://www.cnn.com/2022/04/27/politics/biden-trip-asia-south-korea-japan/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220427154041-biden-boards-af1-file-super-tease.jpg", "publishedAt": "2022-04-27T23:01:02Z", "content": "(CNN)President Joe Biden will make his first trip to Asia as president next month, visiting South Korea and Japan from May 20 to May 24, White House officials told CNN, underscoring his commitment to… [+5171 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Harry Enten", "title": "It's not just Latinos and younger voters. Democrats are slipping among Black voters too.", "description": "Black voters form the core of the Democratic Party base. They cast ballots for Democrats in greater proportions than almost any other demographic group. But recent polling suggests the advantage Democrats have had with Black voters may be slipping, at least a…", "url": "https://www.cnn.com/2022/04/27/politics/democrats-biden-black-voters-midterms/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220426095650-01-black-voters-matter-march.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-27T22:55:19Z", "content": "Black voters form the core of the Democratic Party base. They cast ballots for Democrats in greater proportions than pretty much any other demographic group. Without the massive backing of Black vote… [+4780 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chris Isidore, CNN Business", "title": "Ford just reported a $3.1 billion loss. Blame Rivian", "description": "In the days after its November IPO, electric truck maker Rivian was briefly one of the world's most valuable automakers despite not yet having reported a single sale. But its stock has been sliding steadily since then, which just resulted in a big loss for...…", "url": "https://www.cnn.com/2022/04/27/business/ford-loss-rivian/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211111085842-01-rivian-truck-1110-super-tease.jpg", "publishedAt": "2022-04-27T22:54:30Z", "content": "New York (CNN Business)In the days after its November IPO, electric truck maker Rivian was briefly one of the world's most valuable automakers despite not yet having reported a single sale. But its s… [+3684 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chloe Melas", "title": "Hailey Bieber says she underwent procedure to close hole in her heart after mini-stroke", "description": "Hailey Bieber is finally telling fans what led to her hospitalization in March.", "url": "https://www.cnn.com/2022/04/27/entertainment/hailey-bieber-stroke-hole-in-heart/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220427180058-hailey-bieber-screengrab.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-27T22:26:34Z", "content": "Hailey Bieber is finally telling fans what led to her hospitalization in March.\r\nThe model, who is married to musician Justin Bieber, posted a video to her YouTube channel on Wednesday explaining tha… [+1062 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amir Vera, Rebekah Riess", "title": "Wisconsin DA says 14-year-old boy is the suspect in the death of 10-year-old Lily Peters", "description": "The juvenile defendant is facing three charges, including first degree intentional homicide, first degree sexual assault, and first degree sexual assault of a child under age 13.", "url": "https://www.cnn.com/2022/04/27/us/lily-peters-wisconsin-juvenile-suspect-bond-hearing/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220425173737-lily-peters.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-27T22:23:42Z", "content": "The suspect in the death of 10-year-old Lily Peters in Chippewa County, Wisconsin, is a 14-year-old eighth-grader, prosecutors said Wednesday.\r\nHe is facing three charges: first-degree intentional ho… [+3175 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Hansler", "title": "Paul Whelan, an American detained in Russia, wonders why he was left behind", "description": "Paul Whelan, a US citizen who remains imprisoned in Russia, is questioning why he was left behind in the prisoner swap that freed fellow American Trevor Reed.", "url": "https://www.cnn.com/2022/04/27/politics/paul-whelan-left-behind-statement/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/200615092214-01-paul-whelan-trial-0615.jpg?q=x_168,y_112,h_1436,w_2551,c_crop/w_800", "publishedAt": "2022-04-27T22:22:40Z", "content": "Paul Whelan, a US citizen who remains imprisoned in Russia, is questioning why he was left behind in the prisoner swap that freed fellow American Trevor Reed.\r\nWhy was I left behind? While I am pleas… [+3756 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nicole Chavez, CNN", "title": "Texas residents are suing their county after books were removed from public libraries", "description": "Seven residents in Llano County, Texas, are suing county officials, claiming their First and 14th Amendment rights were violated when books deemed inappropriate by some people in the community and Republican lawmakers were removed from public libraries or acc…", "url": "https://www.cnn.com/2022/04/27/us/llano-county-book-removal-lawsuit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220427153056-texas-library-books-file-042622-super-tease.jpg", "publishedAt": "2022-04-27T22:08:45Z", "content": "(CNN)Seven residents in Llano County, Texas, are suing county officials, claiming their First and 14th Amendment rights were violated when books deemed inappropriateby some people in the community an… [+5882 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Reuters", "title": "Judge rules for Elon Musk in $13 billion lawsuit over Tesla-SolarCity deal", "description": "Tesla Chief Executive Officer Elon Musk did not unjustly enrich himself when he guided the electric vehicle maker in 2016 to acquire SolarCity Corp, where Musk was chairman and the largest shareholder, a Delaware judge ruled on Wednesday.", "url": "https://www.cnn.com/2022/04/27/tech/elon-musk-tesla-solarcity/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220427175743-elon-musk-file-021022-super-tease.jpg", "publishedAt": "2022-04-27T22:06:47Z", "content": "Tesla Chief Executive Officer Elon Musk did not unjustly enrich himself when he guided the electric vehicle maker in 2016 to acquire SolarCity Corp, where Musk was chairman and the largest shareholde… [+1554 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brenda Goodman, CNN", "title": "Wisconsin investigating 4 cases of unusual hepatitis in children, including one death", "description": "Health officials in Wisconsin are investigating four cases of children with significant unexplained liver damage, including one child who needed a liver transplant and one who died. If the death is confirmed to be linked to the illness, it would be the first …", "url": "https://www.cnn.com/2022/04/27/health/wisconsin-child-hepatitis/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/181220071605-sick-child-stock-super-tease.jpg", "publishedAt": "2022-04-27T21:49:47Z", "content": "(CNN)Health officials in Wisconsin are investigating four cases of children with significant unexplained liver damage, including one child who needed a liver transplant and one who died. If the death… [+2409 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kara Scannell", "title": "Trump's appraiser was 'not consistent' in adhering to internal quality controls, judge says", "description": "The Trump Organization's long-time appraiser inconsistently applied its internal quality-control practices when valuing properties for former President Donald Trump's real estate business, a state judge said Wednesday.", "url": "https://www.cnn.com/2022/04/27/politics/trump-appraiser-cushman-wakefield/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220427172241-cushman-and-wakefield-logo-file-restricted-082320-super-tease.jpg", "publishedAt": "2022-04-27T21:28:56Z", "content": "(CNN)The Trump Organization's long-time appraiser inconsistently applied its internal quality-control practices when valuing properties for former President Donald Trump's real estate business, a sta… [+4011 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Stephanie Elam, CNN", "title": "This water intake valve at Lake Mead is exposed for the first time amid historic drought", "description": "Lake Mead's plummeting water level has exposed one of the reservoir's original water intake valves for the first time, officials say.", "url": "https://www.cnn.com/2022/04/27/us/water-intake-exposed-lake-mead-drought-climate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220427160759-03-lake-mead-intake-valve-above-water-super-tease.jpg", "publishedAt": "2022-04-27T21:17:53Z", "content": "(CNN)The plummeting water level of Lake Mead has exposed one of the reservoir's original water intake valves for the first time, officials say. \r\nAmid the West's climate change-fueled megadrought, La… [+2604 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ellie Kaufman", "title": "First on CNN: US left behind $7 billion of military equipment in Afghanistan after 2021 withdrawal, Pentagon report says", "description": "Approximately $7 billion of military equipment the US transferred to the Afghan government over the course of 16 years was left behind in Afghanistan after the US completed its withdrawal from the country in August, according to a congressionally mandated rep…", "url": "https://www.cnn.com/2022/04/27/politics/afghan-weapons-left-behind/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220427161910-afghanistan-us-equipment-file-restricted-083121-super-tease.jpg", "publishedAt": "2022-04-27T21:10:13Z", "content": "Washington (CNN)Approximately $7 billion of military equipment the US transferred to the Afghan government over the course of 16 years was left behind in Afghanistan after the US completed its withdr… [+4891 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Clare Foran, Ali Zaslav and Ted Barrett, CNN", "title": "Senate confirms batch of US attorney and US marshal nominations after Cotton lifts long-standing holds", "description": "The Senate confirmed a batch of US attorney and US marshal nominations on Wednesday after GOP Sen. Tom Cotton of Arkansas lifted long-standing holds he had put in place to raise concerns about the treatment by the Justice Department of several deputy US marsh…", "url": "https://www.cnn.com/2022/04/27/politics/senate-nominations-attorney-marshal-cotton/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210629200612-tom-cotton-chuck-grassley-iowa-trip-super-tease.jpg", "publishedAt": "2022-04-27T21:08:36Z", "content": "(CNN)The Senate confirmed a batch of US attorney and US marshal nominations on Wednesday after GOP Sen. Tom Cotton of Arkansas lifted long-standing holds he had put in place to raise concerns about t… [+1960 chars]"}]}