{"status": "ok", "totalResults": 87, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Jessie Yeung, CNN", "title": "In Hong Kong, memories of China's Tiananmen Square massacre are being erased", "description": "For decades it was a symbol of freedom on Chinese controlled soil: every June 4, come rain or shine, tens of thousands of people would descend on Victoria Park in Hong Kong to commemorate the victims of the 1989 Tiananmen Square massacre.", "url": "https://www.cnn.com/2022/06/03/asia/hong-kong-june-4-tiananmen-nsl-intl-mic-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/180605100316-tiananmen-4-super-tease.jpg", "publishedAt": "2022-06-03T04:28:18Z", "content": "A version of this story appeared in CNN's Meanwhile in China newsletter, a three-times-a-week update exploring what you need to know about the country's rise and how it impacts the world. Sign up her… [+10333 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/rhea-mogul\">Rhea Mogul</a>, CNN", "title": "Russia's war in Ukraine", "description": "After 100 days of war, Ukrainian President Volodymyr Zelensky said that Russia now controls 20% of his country, and the Donbas region is \"almost entirely destroyed.\" Follow news updates here.", "url": "https://www.cnn.com/europe/live-news/russia-ukraine-war-news-06-03-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220602105552-severodonetsk-ukraine-0602-super-tease.jpg", "publishedAt": "2022-06-03T04:00:24Z", "content": "Around 800 people are hiding in several bomb shelters underneath the Azot chemical factory in Severodonetsk, which has been targeted by Russian missile attacks, said Serhiy Hayday, the head of Luhans… [+1544 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Amid criticism, North Korea takes over as UN disarmament president", "description": "North Korea, which is under sanctions for developing nuclear weapons in defiance of United Nations Security Council Resolutions, has taken over as head of a UN body aimed at striking disarmament deals amid scorn from critics.", "url": "https://www.cnn.com/2022/06/02/asia/north-korea-un-disarmament-president-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220602220815-north-korea-missile-test-220525-super-tease.jpg", "publishedAt": "2022-06-03T02:59:04Z", "content": "GenevaNorth Korea, which is under sanctions for developing nuclear weapons in defiance of United Nations Security Council Resolutions, has taken over as head of a UN body aimed at striking disarmamen… [+1966 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte", "title": "At 99, iconic producer Norman Lear doesn't want to quit working. Can work help us all live longer?", "description": "Iconic television and movie producer Norman Lear is approaching his 100th birthday. Does his personal prescription for a long, productive work life translate to all of us?", "url": "https://www.cnn.com/2022/06/02/health/work-and-aging-life-itself-wellness/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220516111416-norman-lear-2020-file.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-06-03T02:57:31Z", "content": "American producer, writer and director Norman Lear, creator of such iconic 1970s television characters as the bigoted blowhard Archie Bunker in the sitcom All in the Family, turns 100 in July. \r\nOn T… [+6709 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Zachary B. Wolf, CNN", "title": "Key moments: Biden calls the country to action on guns", "description": "President Joe Biden tried to turn a string of horrific mass shootings into momentum Thursday night, imploring 10 Republican senators to join Democrats on some -- any -- new gun-related legislation.", "url": "https://www.cnn.com/2022/06/02/politics/key-moments-from-biden-gun-speech/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220602194538-04-biden-gun-violence-remarks-060222-super-tease.jpg", "publishedAt": "2022-06-03T02:18:38Z", "content": "(CNN)President Joe Biden tried to turn a string of horrific mass shootings into momentum Thursday night, imploring 10 Republican senators to join Democrats on some -- any -- new gun-related legislati… [+8625 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Merlin Delcid, Karol Suarez and Kara Fox, CNN", "title": "Salvadoran authorities are committing 'massive' human rights violations, with nearly 2% of the country detained, Amnesty alleges", "description": "Salvadoran authorities have committed \"massive\" human rights violations, including thousands of arbitrary detentions and violations of due process, torture, and ill-treatment, according to a new report from Amnesty International.", "url": "https://www.cnn.com/2022/06/02/americas/el-salvador-human-rights-violations-amnesty-report-intl-latam/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220602183734-el-salvador-prision-estado-emergencia-super-tease.jpg", "publishedAt": "2022-06-03T01:49:55Z", "content": "(CNN)Salvadoran authorities have committed \"massive\" human rights violations, including thousands of arbitrary detentions and violations of due process, torture, and ill-treatment, according to a new… [+4987 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sonia Moghe, CNN", "title": "Massachusetts agrees to settlement for thousands of people who were wrongfully convicted of drug charges", "description": "The Commonwealth of Massachusetts has agreed to a settlement that would pay back fees associated with legal cases, probation and fines for tens of thousands of people who were wrongfully convicted of drug charges, according to court documents.", "url": "https://www.cnn.com/2022/06/02/us/massachusetts-settlement-people-wrongfully-convicted-of-drug-charges/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220602175444-massachusetts-state-house-file-restricted-050422-super-tease.jpg", "publishedAt": "2022-06-03T01:34:19Z", "content": "(CNN)The Commonwealth of Massachusetts has agreed to a settlement that would pay back fees associated with legal cases, probation and fines for tens of thousands of people who were wrongfully convict… [+3078 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte, CNN", "title": "The 'Benjamin Button' effect: Scientists can reverse aging in mice. The goal is to do the same for humans", "description": "Scientists around the world are scurrying to reverse the hands of time. Here's a look at one lab's search for the fountain of youth, where old mice have grown young again.", "url": "https://www.cnn.com/2022/06/02/health/reverse-aging-life-itself-scn-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220527142801-reverse-aging-life-itself-super-tease.jpg", "publishedAt": "2022-06-03T01:22:58Z", "content": "By Sandee LaMotte, CNN\r\nUpdated 9:22 PM ET, Thu June 2, 2022\r\n (CNN)In molecular biologist David Sinclair's lab at Harvard Medical School, old mice are growing young again. \r\nUsing proteins that can … [+12182 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "'A big change': Bash reacts to Biden's shift in response to recent mass shootings", "description": "CNN's Dana Bash breaks down President Biden's remarks calling for Congress to \"do something\" on gun control legislation, following recent mass shootings in Buffalo, New York, Uvalde, Texas, and Tulsa, Oklahoma.", "url": "https://www.cnn.com/videos/politics/2022/06/02/biden-gun-control-speech-bash-analysis-ebof-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211201132338-dana-bash-december-1-2021-01-super-tease.jpg", "publishedAt": "2022-06-03T01:06:31Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Shawna Mizelle, CNN", "title": "Biden recognizes June as Black Music Appreciation Month", "description": "President Joe Biden issued a proclamation this week recognizing June as Black Music Appreciation Month, celebrating the music as \"intricately woven into the tapestry of our Nation.\"", "url": "https://www.cnn.com/2022/06/02/politics/black-music-appreciation-month-june-biden-proclamation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220602172750-joe-biden-file-053122-super-tease.jpg", "publishedAt": "2022-06-03T00:26:13Z", "content": "Washington (CNN)President Joe Biden issued a proclamation this week recognizing June as Black Music Appreciation Month, celebrating the music as \"intricately woven into the tapestry of our Nation.\"\r\n… [+2035 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Art Acevedo", "title": "Opinion: The tragic failures of Uvalde, as seen by a veteran police chief", "description": "My colleagues in our profession —  retired and active police chiefs and officers —  have spent a lot of time talking about the terrible shooting in Uvalde.", "url": "https://www.cnn.com/2022/06/02/opinions/shooting-uvalde-guns-texas-police-acevedo/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220530002649-uvalde-texas-elementary-school-shooting-monday.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-06-02T22:45:38Z", "content": "Editors Note: Art Acevedo is a CNN law enforcement analyst. He served as police chief in Austin, Houston and Miami, during a career in law enforcement spanning three and a half decades. Acevedo has b… [+9180 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Gabriel Kinder, CNN", "title": "TikTok star shares her breastfeeding journey and excess milk to help others during the baby formula shortage", "description": "Inspired by her TikTok and Instagram followers, Lucie Fink is donating her breast milk for babies in need.", "url": "https://www.cnn.com/2022/06/02/us/formula-shortage-instagram-tiktok-lucie-fink-cnnheroes/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220602171036-lucie-fink-baby-milo-super-tease.jpg", "publishedAt": "2022-06-02T21:59:44Z", "content": "(CNN)With no end in sight to the baby formula shortage, lifestyle content creator and new mom Lucie Fink is stepping up to help babies in need. She's donating her excess breast milk, and she credits … [+2216 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Manu Raju", "title": "'Prepared for failure': Democrats confront reality on gun talks as senators search for 'incremental' deal with GOP", "description": "Senate Democrats are ready to drop some of their most pressing demands to restrict access to guns amid the nationwide onslaught of massacres. But even that may not be enough to reach a deal with Republicans.", "url": "https://www.cnn.com/2022/06/02/politics/senate-democrats-gun-control-negotiations/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/200630213305-senator-chris-murphy-0630.jpg?q=x_0,y_0,h_1125,w_1999,c_fill/w_800", "publishedAt": "2022-06-02T21:25:12Z", "content": "Senate Democrats are ready to drop some of their most pressing demands to restrict access to guns amid the nationwide onslaught of massacres. But even that may not be enough to reach a deal with Repu… [+8144 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Asha Rangappa", "title": "Opinion: What Ronald Reagan could teach Congress about passing gun reform measures", "description": "Asha Rangappa writes that if Congress wants to pass meaningful gun reform -- and with only 50 votes in the Senate -- it should take a page out of former President Ronald Reagan's 1984 playbook and condition federal funding to states based on their compliance …", "url": "https://www.cnn.com/2022/06/02/opinions/gun-reform-backdoor-congress-solution-rangappa/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220525114808-02-gun-store-california-0421-super-tease.jpg", "publishedAt": "2022-06-02T21:22:02Z", "content": "Asha Rangappa is a senior lecturer at Yale's Jackson Institute for Global Affairs. She is a former special agent in the FBI, specializing in counterintelligence investigations. Follow her @AshaRangap… [+6638 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry", "title": "'The Boys' still looks pretty super in its savagely satirical third season", "description": "\"The Boys\" serves notice immediately that its third season will be as ferociously gory and savagely satirical as the preceding two, racing through story at something approaching super-speed. While obviously not intended for every taste, the Amazon series rema…", "url": "https://www.cnn.com/2022/06/02/entertainment/the-boys-season-3-review/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220531130925-01-the-boys-ssn-3.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-06-02T21:11:40Z", "content": "The Boys serves notice immediately that its third season will be as ferociously gory and savagely satirical as the preceding two, racing through story at something approaching super-speed. While obvi… [+3585 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oliver Darcy, CNN Business", "title": "Right-wing conspiracy outlet Infowars moves to exit bankruptcy", "description": "Three companies tied to the far-right conspiracy theorist Alex Jones, including the fringe media organization Infowars, are moving to exit bankruptcy.", "url": "https://www.cnn.com/2022/06/02/media/infowars-sandy-hook-alex-jones/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210204165159-alex-jones-0106-super-tease.jpg", "publishedAt": "2022-06-02T21:04:49Z", "content": "New York (CNN)Three companies tied to the far-right conspiracy theorist Alex Jones, including the fringe media organization Infowars, are moving to exit bankruptcy, according to a Wednesday court doc… [+1374 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Jennifer Henderson and Paradise Afshar, CNN", "title": "Las Vegas wedding chapels receive Elvis cease-and-desist letters", "description": "Some wedding chapels in Las Vegas are receiving cease-and-desist letters demanding they stop using Elvis' image and likeness in their operations, according to two letters obtained by CNN.", "url": "https://www.cnn.com/travel/article/vegas-wedding-chapels-elvis-impersonators/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220602153537-vegas-elvis-wedding-super-tease.jpg", "publishedAt": "2022-06-02T21:02:23Z", "content": "(CNN) Some wedding chapels in Las Vegas are receiving cease-and-desist letters demanding they stop using Elvis' image and likeness in their operations, according to two letters obtained by CNN. \r\nIn … [+4241 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Zachary B. Wolf", "title": "A crash course in student loan debt forgiveness", "description": "On Wednesday, the Biden administration made the largest single effort to help Americans pay down their student debt. But recent moves have also sharpened a debate on whether the rising cost of higher education is an undue burden for young adults.", "url": "https://www.cnn.com/2022/06/02/politics/student-loan-debt-forgiveness-what-matters/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220527183336-college-graduates-cap-file-051422.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-06-02T20:58:00Z", "content": "A version of this story appeared in CNNs What Matters newsletter. To get it in your inbox, sign up for free here.\r\nWhen the Department of Educationannounced massive loan forgiveness for formerstudent… [+6272 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Phil Mattingly, CNN", "title": "White House rapid response director departs for Treasury as Biden's messaging operation transitions", "description": "President Joe Biden's director of rapid response will soon depart the White House for the Treasury Department, becoming the latest West Wing aide to shift to a more senior role in another part of the administration.", "url": "https://www.cnn.com/2022/06/02/politics/mike-gwin-leaving-the-west-wing/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220602121526-mike-gwin-super-tease.jpg", "publishedAt": "2022-06-02T20:44:12Z", "content": "(CNN)President Joe Biden's director of rapid response will soon depart the White House for the Treasury Department, becoming the latest West Wing aide to shift to a more senior role in another part o… [+2665 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacqueline Howard and Michael Nedelman, CNN", "title": "Silent spread of monkeypox may be a wakeup call for the world", "description": "A monkeypox outbreak continues to grow in countries where the virus isn't normally found, putting global health officials on high alert.", "url": "https://www.cnn.com/2022/06/02/health/monkeypox-endemic-silent-spread/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220529191557-monkeypox-microscope-file-super-tease.jpg", "publishedAt": "2022-06-02T20:25:53Z", "content": "By Jacqueline Howard and Michael Nedelman, CNN\r\nUpdated 4:25 PM ET, Thu June 2, 2022\r\n (CNN)A monkeypox outbreak continues to grow in countries where the virus isn't normally found, putting global he… [+10231 chars]"}]}