{"status": "ok", "totalResults": 87, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/helen-regan\">Helen Regan</a> and <a href=\"/profiles/andrew-raine\">Andrew Raine</a>, CNN", "title": "Russia's war in Ukraine", "description": "A Ukrainian commander at the Azovstal steel plant said there are \"bloody battles\" unfolding with Russian forces inside the complex after they breached the perimeter. Follow here for live updates.", "url": "https://www.cnn.com/europe/live-news/russia-ukraine-war-news-05-05-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220504143212-azovstal-mariupol-ukraine-steel-plant-blurred-super-tease.jpg", "publishedAt": "2022-05-05T04:03:15Z", "content": "A Ukrainian commander at the Azovstal steel plant in Mariupol said there are \"bloody battles\" unfolding with Russian forces inside the complex after they breached the perimeter, even as Russia said i… [+2017 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Mary Kay Mallonee", "title": "Cawthorn addresses video released by opposition group showing him naked in bed 'being crass'", "description": "An opposition group that is actively campaigning against Rep. Madison Cawthorn has released a video clip appearing to show the North Carolina Republican naked in bed and, as Cawthorn described it, \"being crass with a friend\" and \"acting foolish.\"", "url": "https://www.cnn.com/2022/05/04/politics/cawthorn-response-opposition-group-video/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220504224551-03-cawthorn-response.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-05T03:27:03Z", "content": "An opposition group that is actively campaigning against Rep. Madison Cawthorn has released a video clip appearing to show the North Carolina Republican naked in bed and, as Cawthorn described it, be… [+3281 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Text by Lilit Marcus, CNN; Video by Max Burnell, CNN", "title": "How to build a runway out of solid ice", "description": "Just about everything that supports human life on Antarctica must be brought in from elsewhere, usually by aircraft. And in order for that aircraft to have a place to land somebody has to construct a runway out of solid ice.", "url": "https://www.cnn.com/travel/article/ice-runway-antarctica-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220404092705-wolfs-fang-runway-super-tease.jpg", "publishedAt": "2022-05-05T02:27:48Z", "content": "Text by Lilit Marcus, CNN; Video by Max Burnell, CNNPublished 5th May 2022\r\n(CNN) Just about everything that supports human life on Antarctica must be brought in from elsewhere, usually by aircraft. … [+7207 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dakin Andone", "title": "Some abortion clinics are preparing for more out-of-state patients if Roe v. Wade is overturned", "description": "Abortion clinics in states likely to maintain access to the procedure are preparing for a potential influx of out-of-state patients following the report of a leaked draft of a Supreme Court majority opinion that would overturn Roe v. Wade.", "url": "https://www.cnn.com/2022/05/04/us/abortion-out-of-state-patients-roe-v-wade/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220504130235-01-jackson-womens-health-organization-0503.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-05T01:05:21Z", "content": "Abortion clinics in states likely to maintain access to the procedure are preparing for a potential influx of out-of-state patients following the report of a leaked draft of a Supreme Court majority … [+6701 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Alice Stewart", "title": "Opinion: Conservatives held our noses and voted for Trump. Reversing Roe would be our reward", "description": "\"As a pro-life social conservative, I received my fair share of criticism for supporting Donald Trump for president,\" writes commentator Alice Stewart. \"But I focused on the value of lifetime appointments to the high court that would elevate jurists who belie…", "url": "https://www.cnn.com/2022/05/04/opinions/supreme-court-abortion-conservatives-roe-stewart/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220221215729-march-for-life-closeup-file-01202022-super-tease.jpg", "publishedAt": "2022-05-05T00:08:07Z", "content": "Alice Stewart is a CNN Political Commentator and board member at the John F. Kennedy Institute of Politics at Harvard University. The views expressed in this commentary are her own. Read more opinion… [+4687 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Raja Razek, CNN", "title": "Alabama church known for role in voting rights movement is on the list of most endangered historic places", "description": "A Selma, Alabama, church with historic ties to the 1960s voting rights movement has landed on the 2022 Most Endangered Places list -- because of termites.", "url": "https://www.cnn.com/2022/05/04/us/selma-alabama-church-most-endangered-historic-places-list/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220504150051-01-brown-chapel-african-methodist-episcopal-church-super-tease.jpg", "publishedAt": "2022-05-05T00:07:35Z", "content": "(CNN)A Selma, Alabama, church with historic ties to the 1960s voting rights movement has landed on the 2022 Most Endangered Places list -- because of termites.\r\nBrown Chapel African Methodist Episcop… [+1993 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Fung, CNN", "title": "New York City pension funds sue Activision Blizzard, seeking records on CEO Bobby Kotick", "description": "New York City pension fund officials sued Activision Blizzard late last month in a bid to force the company to disclose records that may uncover whether CEO Bobby Kotick breached his fiduciary duty to investors, according to a newly released copy of the compl…", "url": "https://www.cnn.com/2022/05/04/tech/activision-blizzard-lawsuit-kotick-new-york/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220504194620-bobby-kotick-file-070621-super-tease.jpg", "publishedAt": "2022-05-04T23:56:20Z", "content": "(CNN Business)New York City pension fund officials sued Activision Blizzard late last month in a bid to force the company to disclose records that may uncover whether CEO Bobby Kotick breached his fi… [+2627 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Holmes Lybrand and Hannah Rabinowitz, CNN", "title": "Two men accused of attacking DC Officer Michael Fanone on Jan. 6 set to enter into plea agreements this week", "description": "Two of the alleged assailants of former DC police Officer Michael Fanone have plea agreement hearings scheduled before the DC District Court this week, bringing a partial close to one of the most high-profile assault cases of the January 6, 2021, US Capitol r…", "url": "https://www.cnn.com/2022/05/04/politics/michael-fanone-case-assault-plea-agreements/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210617121330-0617-officerfanone-super-tease.jpg", "publishedAt": "2022-05-04T23:23:19Z", "content": "(CNN)Two of the alleged assailants of former DC police Officer Michael Fanone have plea agreement hearings scheduled before the DC District Court this week, bringing a partial close to one of the mos… [+2465 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Natasha Bertrand and Paul LeBlanc, CNN", "title": "Biden asks Congress to help provide Afghan refugees a pathway to become US residents", "description": "President Joe Biden has asked Congress to provide tens of thousands of Afghan refugees with a pathway to become legal permanent residents of the United States, according to a proposal included in the supplemental budget request he sent to lawmakers last week.", "url": "https://www.cnn.com/2022/05/04/politics/white-house-afghan-refugees-ukraine-aid-bill/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220504174853-joe-biden-050422-super-tease.jpg", "publishedAt": "2022-05-04T22:41:15Z", "content": "Washington (CNN)President Joe Biden has asked Congress to provide tens of thousands of Afghan refugees with a pathway to become legal permanent residents of the United States, according to a proposal… [+2562 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nimi Princewill, CNN", "title": "'The world has not forgotten us': Nigeria's Buhari thankful for UN chief's visit amid war in Ukraine", "description": "Nigeria's President Muhammadu Buhari has thanked UN Secretary-General Antonio Guterres for his visit to the country, saying that he is grateful the West African nation hasn't been forgotten amid the Russia-Ukraine conflict.", "url": "https://www.cnn.com/2022/05/04/africa/un-guterres-first-visit-nigeria-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220504133001-buhari-guterres-0504-super-tease.jpg", "publishedAt": "2022-05-04T22:05:36Z", "content": "Abuja, Nigeria (CNN)Nigeria's President Muhammadu Buhari has thanked UN Secretary-General Antonio Guterres for his visit to the country, saying that he is grateful the West African nation hasn't been… [+3677 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hannah Rabinowitz, Holmes Lybrand and Katelyn Polantz, CNN", "title": "Top Oath Keepers member says he overheard extremist group's leader trying to connect with Trump after US Capitol riot", "description": "A top member of the Oath Keepers said in court on Wednesday that he overheard the leader of the group, Stewart Rhodes, trying and failing to get in touch with then-President Donald Trump after the January 6, 2021, attack on the US Capitol.", "url": "https://www.cnn.com/2022/05/04/politics/oath-keepers-wilson-rhodes/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220504155710-01-us-capitol-breech-file-010621-super-tease.jpg", "publishedAt": "2022-05-04T21:43:53Z", "content": "(CNN)A top member of the Oath Keepers said in court on Wednesday that he overheard the leader of the group, Stewart Rhodes, trying and failing to get in touch with then-President Donald Trump after t… [+3715 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sharif Paget, CNN", "title": "Multiple people trapped and injured at scene of a partial building collapse at a former power plant in South Boston", "description": "One person has sustained life-threatening injuries and multiple people are trapped following a partial building collapse at the Edison Power Plant building in South Boston, Police Department spokesman Andre Watson said Wednesday.", "url": "https://www.cnn.com/2022/05/04/us/boston-power-plant-site-collapse/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220504160727-01-boston-power-plant-floor-collapse-super-tease.jpg", "publishedAt": "2022-05-04T21:15:35Z", "content": "(CNN)One person has sustained life-threatening injuries and multiple people are trapped following a partial building collapse at the Edison Power Plant building in South Boston, Police Department spo… [+546 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Stephanie Elam, CNN", "title": "Officials worry Southern California won't have enough water to get through summer without unprecedented cuts", "description": "\"I don't want anybody to turn on the faucet and not have water,\" said one Southern California water manager.", "url": "https://www.cnn.com/2022/05/04/us/california-drought-water-restrictions-climate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220504162227-01-california-drought-water-restrictions-climate-super-tease.jpg", "publishedAt": "2022-05-04T20:54:58Z", "content": "Why the Great American Lawn is terrible for the West's water crisis\r\nLake Powell officials face an impossible choice in the West's megadrought: Water or electricity\r\nLake Mead plummets to unfathomabl… [+290 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Clare Foran and Melanie Zanona, CNN", "title": "New audio: McCarthy said 25th Amendment 'takes too long' and wanted to reach out to Biden after January 6 attack", "description": "House Republican leader Kevin McCarthy discussed the 25th Amendment on a call with GOP leadership days after the January 6, 2021, attack on the Capitol and said the process \"takes too long,\" according to an audio recording obtained by two New York Times repor…", "url": "https://www.cnn.com/2022/05/04/politics/mccarthy-audio-25th-amendment-biden/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220426160656-kevin-mccarthy-0121-file-super-tease.jpg", "publishedAt": "2022-05-04T20:49:14Z", "content": "(CNN)House Republican leader Kevin McCarthy discussed the 25th Amendment on a call with GOP leadership days after the January 6, 2021, attack on the Capitol and said the process \"takes too long,\" acc… [+4938 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ryan Nobles, Annie Grayer and Zachary Cohen, CNN", "title": "Donald Trump Jr. met with the House January 6 committee on Tuesday", "description": "Donald Trump Jr., the son of former President Donald Trump, met on Tuesday with the House select committee investigating the January 6 insurrection, according to two sources familiar with the meeting.", "url": "https://www.cnn.com/2022/05/04/politics/donald-trump-jr-january-6-committee/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220411154647-donald-trump-jr-0227-super-tease.jpg", "publishedAt": "2022-05-04T20:34:52Z", "content": "(CNN)Donald Trump Jr., the son of former President Donald Trump, met on Tuesday with the House select committee investigating the January 6 insurrection, according to two sources familiar with the me… [+1408 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'Moon Knight' took Marvel in a different orbit, but it didn't rise to the occasion", "description": "Despite the show's ambition and visual flair, \"Moon Knight\" felt like a creative misfire.", "url": "https://www.cnn.com/2022/05/04/entertainment/moon-knight-finale-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220329084335-02-moon-knight-handout-super-tease.jpeg", "publishedAt": "2022-05-04T20:29:28Z", "content": "The following contains spoilers about the \"Moon Knight\" finale.\r\n (CNN)After four series featuring characters seen in the \"Avengers\" franchise, \"Moon Knight\" marked Marvel's first attempt at a true o… [+2905 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ivana Kottasová, Petro Zadorozhnyy and Lauren Said-Moorhouse, CNN", "title": "Russia's attacks on Ukraine's supply lines are intensifying. Ukraine's national railway hasn't buckled", "description": "The smell of burnt wire and rubber still lingered in the air around the railway power station on the outskirts of Lviv Wednesday morning, hours after the blaze was extinguished. A group of investigators was collecting debris from the Russian rockets that stru…", "url": "https://www.cnn.com/2022/05/04/europe/ukraine-russia-railways-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220504154141-02-lviv-railways-power-station-super-tease.jpg", "publishedAt": "2022-05-04T20:27:59Z", "content": "Lviv, Ukraine (CNN)The smell of burnt wire and rubber still lingered in the air around the railway power station on the outskirts of Lviv Wednesday morning, hours after the blaze was extinguished. A … [+5331 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Peter Bergen, CNN National Security Analyst", "title": "Retired US major general: What it will take for the Ukrainians to win", "description": "Peter Bergen interviews former commander of the US Special Operations Command in Europe, retired US Army Maj. Gen. Mike Repass, who says the international community has to greatly increase its support for Ukraine if the embattled nation is ever going to be ab…", "url": "https://www.cnn.com/2022/05/04/opinions/bergen-repass-ukraine-interview/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220422111820-01-mariupol-042122-super-tease.jpg", "publishedAt": "2022-05-04T20:20:15Z", "content": "Peter Bergen is CNN's national security analyst, a vice president at New America and a professor of practice at Arizona State University. His forthcoming paperback is \"The Cost of Chaos: The Trump Ad… [+11696 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland, CNN", "title": "Largest known North American cave art remained hidden for more than 1,000 years", "description": "Massive Native American drawings, unseen in an Alabama cave for more than 1,000 years, have been revealed thanks to 3D imaging. It's the largest known cave art ever discovered in North America.", "url": "https://www.cnn.com/style/article/largest-native-american-cave-art-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220504111409-04-largest-native-american-cave-art-super-tease.jpg", "publishedAt": "2022-05-04T20:18:57Z", "content": "arts\r\nMassive Native American drawings -- which remained unseen in an Alabama cave for more than 1,000 years -- have been unveiled by a team of scientists. It's the largest known cave art ever discov… [+6966 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Agiesta, Ariel Edwards-Levy", "title": "CNN Poll: Most Americans have a dismal view of the US economy", "description": "The US public's view of the nation's economy is the worst it's been in a decade, a new CNN Poll conducted by SSRS finds, with many Americans also saying they feel financial strain in their own lives.", "url": "https://www.cnn.com/2022/05/04/politics/cnn-poll-economy-biden-approval/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220504154726-inflation-shopping-file.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-04T20:00:12Z", "content": "The US publics view of the nations economy is the worst its been in a decade, a new CNN Poll conducted by SSRS finds, with many Americans also saying they feel financial strain in their own lives.\r\nT… [+6942 chars]"}]}