{"status": "ok", "totalResults": 104, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Chris Boyette, CNN", "title": "Alaska schoolchildren were served floor sealant instead of milk at a child care program, school district says", "description": "Twelve elementary school children drank floor sealant believing it was milk after it was served to students at a childcare program in Juneau, Alaska, on Tuesday, according to the school district.", "url": "https://www.cnn.com/2022/06/16/us/alaska-students-floor-sealant-milk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220616094003-school-children-floor-sealant-super-tease.jpg", "publishedAt": "2022-06-16T08:47:13Z", "content": "(CNN)Twelve elementary school children drank floor sealant believing it was milk after it was served to students at a childcare program in Juneau, Alaska, on Tuesday, according to the school district… [+1952 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Tommy O'Callaghan, CNN", "title": "Lightyear 0 solar-assisted car will go into production this year", "description": "Dutch company Lightyear has announced that this fall it will start making the world's first production car fitted with solar panels.", "url": "https://www.cnn.com/travel/article/lightyear-0-solar-assisted-car-spc-c2e-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220615155540-lightyear-0-side-back-story-card-restricted-super-tease.jpg", "publishedAt": "2022-06-16T08:33:30Z", "content": "(CNN) Dutch company Lightyear has announced that this fall it will start making the world's first production car fitted with solar panels. \r\nThe Lightyear 0 will have curved solar panels in its roof,… [+2916 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ben Church", "title": "Australian star Nick Kyrgios in heated argument with umpire during comeback win", "description": "Tennis star Nick Kyrgios was involved in a fiery exchange with the umpire during his comeback win against Stefanos Tsitsipas at TP 500 Halle Open Wednesday.", "url": "https://www.cnn.com/2022/06/16/tennis/nick-kyrgios-australia-umpire-argument-spt-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220616090958-kyrgios-angry.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-06-16T08:31:02Z", "content": "Tennis star Nick Kyrgios was involved in a fiery exchange with the umpire during his comeback win against Stefanos Tsitsipas at TP 500 Halle Open Wednesday.\r\nKyrgios, 27, had smashed his racquet afte… [+1307 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Devon M. Sayers and Aya Elamroussi, CNN", "title": "4 arrested and charged in connection to shooting that killed an 80-year-old after a New Orleans high school graduation ceremony, police say", "description": "Four people were arrested and charged in connection to last month's shooting that claimed the life of an 80-year-old woman at a high school graduation ceremony in New Orleans, police said Wednesday.", "url": "https://www.cnn.com/2022/06/16/us/xavier-university-shooting-new-orleans-suspects-arrested/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220616015843-04-xavier-university-shooting-super-tease.jpg", "publishedAt": "2022-06-16T07:24:19Z", "content": "(CNN)Four people were arrested and charged in connection to last month's shooting that claimed the life of an 80-year-old woman at a high school graduation ceremony in New Orleans, police said Wednes… [+1643 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matias Grez, CNN", "title": "American, Canadian and Mexican 2026 World Cup host cities set to be announced", "description": "Cities that have applied to host matches at the 2026 men's World Cup, the first edition to feature 48 teams and the first to be staged in three countries, will find out on Thursday whether their bids have been successful.", "url": "https://www.cnn.com/2022/06/16/football/host-cities-2026-fifa-world-cup/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211121141525-copa-del-mundo-2022-deportes-cnn-super-tease.jpg", "publishedAt": "2022-06-16T07:19:02Z", "content": "(CNN)Cities that have applied to host matches at the 2026 men's World Cup, the first edition to feature 48 teams and the first to be staged in three countries, will find out on Thursday whether their… [+1876 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kathleen Magramo", "title": "Dead little blue penguins keep washing ashore in New Zealand. Experts say climate change may be to blame", "description": "The bodies of hundreds of little blue penguins have washed up on the beaches of New Zealand's northern coast in recent weeks, according to conservationists, who fear climate change is starving the birds to death.", "url": "https://www.cnn.com/2022/06/16/world/new-zealand-dead-little-blue-penguins-climate-intl-hnk-scn/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220615211744-new-zealand-dead-blue-penguins-intl-hnk.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-06-16T06:48:40Z", "content": "The bodies of hundreds of little blue penguins have washed up on the beaches of New Zealands northern coast in recent weeks, according to conservationists, who fear climate change is starving the bir… [+3317 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/helen-regan\">Helen Regan</a>, CNN", "title": "Russia's war in Ukraine", "description": "French President Emmanuel Macron, German Chancellor Olaf Scholz and Italian Prime Minister Mario Draghi are en route to the Ukrainian capital Kyiv, the Elysee Palace confirmed on Thursday.", "url": "https://www.cnn.com/europe/live-news/russia-ukraine-war-news-06-16-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220614163315-02-ukraine-war-donbas-0612-super-tease.jpg", "publishedAt": "2022-06-16T06:06:00Z", "content": "Two Americans fighting alongside Ukrainian forces north of Kharkiv in Ukraine have been missing for nearly a week and there are fears that they may have been captured by Russian forces, according to … [+2005 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "North Korea expands work at nuclear test site to second tunnel, report says", "description": "North Korea appears to be expanding work at its nuclear test site to include a second tunnel, a US-based think tank said on Thursday, as South Korean and US officials say North Korea might conduct a nuclear test any day.", "url": "https://www.cnn.com/2022/06/16/asia/north-korea-expands-nuclear-test-site-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220616011758-01-north-korea-expands-nuclear-test-site-file-super-tease.jpg", "publishedAt": "2022-06-16T05:37:32Z", "content": "(CNN)North Korea appears to be expanding work at its nuclear test site to include a second tunnel, a US-based think tank said on Thursday, as South Korean and US officials say North Korea might condu… [+2515 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Elizabeth Wolfe and Claudia Dominguez, CNN", "title": "Parts of Yellowstone may reopen to tourists on Monday, but flooding has been a disaster for neighboring towns", "description": "Yellowstone National Park could partially reopen as early as Monday as officials continue to assess the damage caused by historic flooding, which now threatens to hamper the peak of the summer tourist season.", "url": "https://www.cnn.com/2022/06/16/weather/yellowstone-national-park-flooding-closed-thursday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220615192943-03-yellowstone-national-park-montana-flooding-wednesday-super-tease.jpg", "publishedAt": "2022-06-16T05:01:25Z", "content": "(CNN)Yellowstone National Park could partially reopen as early as Monday as officials continue to assess the damage caused by historic flooding, which now threatens to hamper the peak of the summer t… [+6032 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Laura He", "title": "Asian markets mostly rise after Fed's rate hike; Hong Kong slips", "description": "Asian stocks mostly rose Thursday after the Fed got tough on inflation with its biggest rate hike since 1994. But the Hong Kong market slipped after the city hiked its interest rates following the Fed's move.", "url": "https://www.cnn.com/2022/06/15/investing/global-markets-fed-rate-hike/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220615233356-hong-kong-global-markets.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-06-16T03:53:55Z", "content": "Asian stocks mostly rose Thursday after the Fed got tough on inflation with its biggest rate hike since 1994. But the Hong Kong market slipped after the city hiked its interest rates following the Fe… [+2163 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jamie Gumbrecht", "title": "Formula production at Abbott's Michigan plant delayed after flooding from severe storms", "description": "Abbott has stopped production of EleCare formula in its Sturgis, Michigan, plant after severe storms led to flooding inside the plant, the company said, probably delaying production of new formula for a few weeks.", "url": "https://www.cnn.com/2022/06/15/health/abbott-formula-plant-flood-delay/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220519115542-abbott-manufacturing-0513-sturgis.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-06-16T03:16:14Z", "content": "Abbott has stopped production of EleCare formula in its Sturgis, Michigan, plant after severe storms led to flooding inside the plant, the company said, probably delaying production of new formula fo… [+4637 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Andy Rose", "title": "Several homes damaged after a tornado rips through Monroe County, Wisconsin, officials say", "description": "Several homes were damaged Wednesday by a tornado near Tomah, Wisconsin, officials said.", "url": "https://www.cnn.com/2022/06/15/weather/monroe-county-wisconsin-tornado/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/150325082132-social-gfx-breaking-news.jpg?q=x_2,y_0,h_898,w_1596,c_crop/w_800", "publishedAt": "2022-06-16T03:01:40Z", "content": "Several homes were damaged Wednesday by a tornado near Tomah, Wisconsin, officials said.\r\nThe tornado appears to have moved northeast through Monroe County for about 15 miles, according to the county… [+191 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Simone McCarthy, CNN", "title": "China will support Russia on security, Xi tells Putin in birthday call", "description": "Chinese leader Xi Jinping reiterated his support for Moscow on \"sovereignty and security\" matters in a call with counterpart Vladimir Putin on Wednesday, upholding his backing for the countries' partnership despite the global backlash against Russia's invasio…", "url": "https://www.cnn.com/2022/06/15/asia/china-support-russia-security-xi-birthday-putin-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220615204804-xi-putin-call-china-russia-intl-hnk-super-tease.jpg", "publishedAt": "2022-06-16T02:50:45Z", "content": "Hong Kong (CNN)Chinese leader Xi Jinping reiterated his support for Moscow on \"sovereignty and security\" matters in a call with counterpart Vladimir Putin on Wednesday, upholding his backing for the … [+2519 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Mark Morales, CNN", "title": "Man who allegedly shot and killed Goldman Sachs employee on NYC subway indicted on murder charge", "description": "The alleged armed gunman who shot and killed a Goldman Sachs employee while riding the subway in May has been indicted on a second-degree murder charge and two counts of criminal possession of a weapon in the second degree, according to a Wednesday statement …", "url": "https://www.cnn.com/2022/06/15/us/new-york-subway-murder-indictment/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220615200030-nyc-subway-high-alert-file-052422-super-tease.jpg", "publishedAt": "2022-06-16T02:30:15Z", "content": "(CNN)The alleged armed gunman who shot and killed a Goldman Sachs employee while riding the subway in May has been indicted on a second-degree murder charge and two counts of criminal possession of a… [+1865 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Andy Rose", "title": "Republican legislator vows to end capital punishment in Oklahoma if state kills death row inmate, citing new investigation into case", "description": "Findings from an independent investigation into the conviction of an Oklahoma death row inmate have at least one Republican legislator calling for the end of the state's use of capital punishment if the man is put to death.", "url": "https://www.cnn.com/2022/06/15/us/richard-glossip-oklahoma-death-row-inmate-prosecution-commission/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220615212729-01-richard-glossip-oklahoma-death-row.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-06-16T02:28:10Z", "content": "Findings from an independent investigation into the conviction of an Oklahoma death row inmate have at least one Republican legislator calling for the end of the states use of capital punishment if t… [+2796 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ryan Nobles, Zachary Cohen, Annie Grayer, Katelyn Polantz", "title": "January 6 committee has emails between Ginni Thomas and John Eastman", "description": "The House select committee investigating the January 6, 2021, US Capitol attack is in possession of email correspondence between conservative attorney John Eastman and Virginia \"Ginni\" Thomas, a conservative activist who's the wife of Supreme Court Justice Cl…", "url": "https://www.cnn.com/2022/06/15/politics/ginni-thomas-john-eastman-emails-january-6-committee/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210206031134-ginni-thomas-file-2017.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-06-16T01:40:45Z", "content": "The House select committee investigating the January 6, 2021, US Capitol attack is in possession of email correspondence between conservative attorney John Eastman and Virginia Ginni Thomas, a conser… [+3672 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Camilo Rocha, Rodrigo Pedroso", "title": "One suspect admitted killing Dom Phillips and Bruno Pereira in Brazilian Amazon, authorities say", "description": "The first suspect arrested in the disappearance of a British journalist and Brazilian indigenous affairs expert in a remote region of the Amazon has admitted to killing the pair, Brazilian authorities said during a press conference Wednesday.", "url": "https://www.cnn.com/2022/06/15/americas/missing-journalist-brazil-dom-phillips-bruno-perira-dead-intl-latam/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220611085538-dom-phillips-and-bruno-pereira-split.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-06-16T00:08:48Z", "content": "The first suspect arrested in the disappearance of a British journalist and Brazilian indigenous affairs expert in a remote region of the Amazon has admitted to killing the pair, Brazilian authoritie… [+2560 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brenda Goodman, CNN", "title": "Paxlovid loses luster in people who aren't at high risk from Covid-19, Pfizer study finds", "description": "The antiviral medication Paxlovid appears to be most effective in people whose age or underlying health puts them at high risk for becoming severely ill with Covid-19, but it appears to be less effective for average-risk adults, drugmaker Pfizer reported.", "url": "https://www.cnn.com/2022/06/15/health/paxlovid-average-risk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220425113541-paxlovid-production-1121-super-tease.jpg", "publishedAt": "2022-06-15T22:03:38Z", "content": "(CNN)The antiviral medication Paxlovid appears to be most effective in people whose age or underlying health puts them at high risk for becoming severely ill with Covid-19, but it appears to be less … [+5048 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Hansler", "title": "Latvian Foreign Minister says European leaders should not fear provoking Putin and must not push Ukraine to make concessions", "description": "Latvian Foreign Minister Edgars Rinkēvičs on Wednesday said European leaders must not be deterred by a fear of provoking Russian President Vladimir Putin and the international community must not pressure Ukraine into making concessions to end the war.", "url": "https://www.cnn.com/2022/06/15/politics/latvian-foreign-minister-interview/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220615173537-edgars-rinkevics-file-042922.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-06-15T21:59:37Z", "content": "Latvian Foreign Minister Edgars Rinkvis on Wednesday said European leaders must not be deterred by a fear of provoking Russian President Vladimir Putin and the international community must not pressu… [+4003 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brandon Miller, Rachel Ramirez", "title": "What caused Yellowstone's 'unprecedented' flooding? Scientists saw it coming", "description": "Flash flooding in Yellowstone National Park early this week washed out roads and bridges and caused \"significant\" damage to the town of Gardiner, Montana.", "url": "https://www.cnn.com/2022/06/15/us/what-caused-yellowstone-flooding-climate/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220615172206-yellowstone-flooding-file-061322.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-06-15T21:52:46Z", "content": "Extreme rainfall rates and rapid snowmelt prompted the flash flooding in Yellowstone National Park early this week, washing out roads and bridges in the park and causing significant damage to the tow… [+3213 chars]"}]}