{"status": "ok", "totalResults": 68, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Shawna Mizelle, CNN", "title": "Who is Brad Raffensperger, Georgia's Republican secretary of state?", "description": "Georgia Secretary of State Brad Raffensperger is being swept into another sensitive political matter, the latest in a series of headline-grabbing incidents for an official whose day-to-day duties typically render the position obscure.", "url": "https://www.cnn.com/2022/05/06/politics/who-is-brad-raffensperger-georgia-secretary-of-state/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220506160120-brad-raffensperger-file-restricted-050422-super-tease.jpg", "publishedAt": "2022-05-07T00:15:01Z", "content": "Washington (CNN)Georgia Secretary of State Brad Raffensperger is being swept into another sensitive political matter, the latest in a series of headline-grabbing incidents for an official whose day-t… [+5573 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ariel Edwards-Levy, CNN", "title": "Americans' views on abortion diverge along more than just partisan lines", "description": "Americans' views on abortion are sharply divided across partisan lines, CNN's latest polling shows: An overwhelming 88% of Democrats want to see Roe vs. Wade upheld, while a smaller 63% majority of Republicans want to see it overturned. But neither party is e…", "url": "https://www.cnn.com/2022/05/06/politics/partisan-divides-abortion-cnn-poll/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220504102651-roe-wade-protest-0503-texas-super-tease.jpg", "publishedAt": "2022-05-07T00:01:21Z", "content": "(CNN)Americans' views on abortion are sharply divided across partisan lines, CNN's latest polling shows: An overwhelming 88% of Democrats want to see Roe vs. Wade upheld, while a smaller 63% majority… [+3936 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Cheri Mossburg and Taylor Romine, CNN", "title": "Widower of Black woman who died hours after childbirth files civil rights lawsuit against Cedars-Sinai", "description": "The widower of a Black woman who died shortly after giving birth to the couple's second son is taking aim at Cedars-Sinai Medical Center and its parent health system for a second time by filing a civil rights lawsuit alleging she received inferior care becaus…", "url": "https://www.cnn.com/2022/05/06/us/california-civil-rights-lawsuit-cedars-sinai/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200221005825-04-fathers-maternal-mortality-super-tease.jpg", "publishedAt": "2022-05-06T23:22:20Z", "content": "(CNN)The widower of a Black woman who died shortly after giving birth to the couple's second son is taking aim at Cedars-Sinai Medical Center and its parent health system for a second time by filing … [+4690 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Fung, CNN", "title": "Judge dismisses Trump lawsuit against Twitter over ban", "description": "A federal judge in San Francisco has dismissed former President Donald Trump's lawsuit against Twitter that sought to reinstate his banned account on the platform, according to a court filing.", "url": "https://www.cnn.com/2022/05/06/tech/trump-twitter-lawsuit-dismissed/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220506175103-donald-trump-file-050122-super-tease.jpg", "publishedAt": "2022-05-06T22:16:54Z", "content": "(CNN Business)A federal judge in San Francisco has dismissed former President Donald Trump's lawsuit against Twitter that sought to reinstate his banned account on the platform, according to a court … [+1370 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Bo Lillis, Jeremy Herb, Zachary Cohen", "title": "White House walks a fine line with intelligence sharing in Ukraine", "description": "Two months into Russia's war in Ukraine, the Biden administration has increased the amount of intelligence it shares with Kyiv, contributing to successful strikes against senior Russian leaders and the Russian Navy's flagship, the Moskva, sources familiar wit…", "url": "https://www.cnn.com/2022/05/06/politics/white-house-intelligence-sharing-ukraine-red-line-russia/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220418131404-moska-fire-0418.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-06T22:02:39Z", "content": "Two months into Russias war in Ukraine, the Biden administration has increased the amount of intelligence it shares with Kyiv, contributing to successful strikes against senior Russian leaders and th… [+5958 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Helen Regan and Yasmin Coles, CNN\nPhotographs by Veejay Villafranca for CNN", "title": "Son of dictator poised for the presidency as the Philippines goes to the polls", "description": "Almost 40 years since the Marcos dictatorship in the Philippines ended in a mass uprising, Marcos Sr's son and namesake, Ferdinand Marcos Jr is frontrunner to become the country's next President when Filipinos vote in general elections on May 9, replacing Pre…", "url": "https://www.cnn.com/2022/05/06/asia/philippines-election-presidency-marcos-profile-dst-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220504233640-01-philippines-election-feature-super-tease.jpg", "publishedAt": "2022-05-06T21:55:38Z", "content": "(CNN)Six years after losing the race for vice president, the son of Philippines' dictator Ferdinand Marcos is taking on his old rival Leni Robredo -- and this time they're both aiming for the preside… [+12758 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oren Liebermann, Henry Klapper", "title": "Sailors on Navy aircraft carrier outline bleak living conditions and leadership failures following series of suicides", "description": "The commanding officer stood before the sailors of the USS George Washington's security team. One of their own, Xavier Sandor, had taken his life a few weeks earlier in mid-April, and the captain had come down to speak with the 110 or so young men and women w…", "url": "https://www.cnn.com/2022/05/06/politics/uss-george-washington-conditions/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220505163259-uss-george-washington-0505.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-06T21:50:46Z", "content": "Newport News, VirginiaCNN\r\n  — \r\nThe commanding officer stood before the sailors of the USS George Washingtons security team. One of their own, Xavier Sandor, had taken his life a few weeks earlier i… [+9948 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Megan Thomas", "title": "Mike Hagerty, 'Friends' and 'Somebody Somewhere' actor, has died", "description": "Mike Hagerty, a character actor known for his roles in shows like \"Friends\" and films like \"Overboard,\" has passed away, Bridget Everett, his costar in HBO's \"Somebody Somewhere,\" said in an Instagram post.", "url": "https://www.cnn.com/2022/05/06/entertainment/mike-hagerty-dead/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220506170132-01-mike-hagerty.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-06T21:11:01Z", "content": "Mike Hagerty, a character actor known for his roles in shows like Friends and films like Overboard, has passed away, Bridget Everett, his costar in HBOs Somebody Somewhere, said in an Instagram post.… [+1136 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Fung, CNN", "title": "Nvidia misled investors about impact of crypto mining on its business, SEC alleges", "description": "For years, video gamers have blamed shortages of PC graphics cards on cryptocurrency enthusiasts, who have snapped up growing numbers of the devices to generate digital coins. The pandemic, along with the Trump administration's tariffs on Chinese imports, hav…", "url": "https://www.cnn.com/2022/05/06/tech/nvidia-sec-settlement-crypto-mining/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220506151416-nvidia-sec-settlement-super-tease.jpg", "publishedAt": "2022-05-06T21:08:30Z", "content": "(CNN Business)For years, video gamers have blamed shortages of PC graphics cards on cryptocurrency enthusiasts, who have snapped up growing numbers of the devices to generate digital coins. The pande… [+3127 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Reuters", "title": "Musk's $44 billion Twitter buyout challenged in shareholder lawsuit", "description": "Elon Musk and Twitter were sued on Friday by a Florida pension fund seeking to stop Musk from quickly completing his planned $44 billion takeover of the social media company.", "url": "https://www.cnn.com/2022/05/06/tech/twitter-shareholder-lawsuit-elon-musk/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220506161318-elon-musk-file-0502.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-06T20:24:00Z", "content": "Elon Musk and Twitter\r\n(TWTR) were sued on Friday by a Florida pension fund seeking to stop Musk from quickly completing his planned $44 billion takeover of the social media company.\r\nIn a complaint … [+802 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Agiesta and Ariel Edwards-Levy, CNN", "title": "CNN Poll: Most Americans want Roe v. Wade to stay, but draft abortion opinion hasn't shaken the midterm landscape", "description": "Americans remain broadly opposed to overturning the Roe v. Wade decision that legalized abortion nationwide, according to a new CNN poll conducted by SSRS, following the leak of a draft Supreme Court opinion that would strike down the landmark ruling.", "url": "https://www.cnn.com/2022/05/06/politics/cnn-poll-abortion-midterms-roe-v-wade/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220505184633-01c-week-in-photos-0505-super-tease.jpg", "publishedAt": "2022-05-06T20:01:40Z", "content": "(CNN)Americans remain broadly opposed to overturning the Roe v. Wade decision that legalized abortion nationwide, according to a new CNN poll conducted by SSRS, following the leak of a draft Supreme … [+7704 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Julian Zelizer, CNN Political Analyst", "title": "Opinion: Why Jill Biden's trip in Eastern Europe matters", "description": "Julian Zelizer writes that First Lady Jill Biden's trip to Eastern Europe over Mother's Day weekend is an opportunity to demonstrate America's ongoing commitment to Ukraine. But it also follows a tradition of first ladies playing an important role in shaping …", "url": "https://www.cnn.com/2022/05/06/opinions/jill-biden-first-lady-overseas-trip-zelizer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220506115818-01-jill-biden-romania-0506-super-tease.jpg", "publishedAt": "2022-05-06T19:37:18Z", "content": "Julian Zelizer, a CNN political analyst, is a professor of history and public affairs at Princeton University and author of the forthcoming book \"The Presidency of Donald J. Trump: A First Historical… [+5811 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marshall Cohen", "title": "Rep. Marjorie Taylor Greene shouldn't be disqualified over January 6, judge recommends", "description": "Rep. Marjorie Taylor Greene, the conspiracy-peddling Georgia Republican, shouldn't be disqualified over her role in the January 6 insurrection, a judge said Friday in a significant legal blow to the voters and advocacy groups who tried to throw her off the ba…", "url": "https://www.cnn.com/2022/05/06/politics/marjorie-taylor-greene-ballot/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220425111653-08-marjorie-taylor-greene-atlanta-hearing-0422.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-06T19:11:12Z", "content": "Rep. Marjorie Taylor Greene, the conspiracy-peddling Georgia Republican, shouldnt be disqualified over her role in the January 6 insurrection, a judge said Friday in a significant legal blow to the v… [+2212 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amanda Watts", "title": "Second body recovered after three children went missing in Mississippi River", "description": "The body of a 14-year-old girl was found in the Mississippi River, the second body recovered after three children went missing in the water last month, according to the New Orleans mayor.", "url": "https://www.cnn.com/2022/05/06/us/mississippi-river-teen-girl-body-found/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220503172720-new-orleans-body-found.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-06T19:05:32Z", "content": "The body of a 14-year-old girl was found in the Mississippi River, the second body recovered after three children went missing inthe water last month, according to the New Orleans mayor.\r\nLast nights… [+999 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Alaa Elassar and Derrick Hinds, CNN", "title": "The search for the missing Alabama inmate and corrections officer", "description": "US Marshals have found a car associated with Vicky White and Casey White, the missing former Alabama corrections officer and inmate. Follow here for the latest.", "url": "https://www.cnn.com/us/live-news/alabama-manhunt-casey-vicky-white-presser-05-06-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220501071557-vicki-white-casey-white-super-tease.jpg", "publishedAt": "2022-05-06T18:37:27Z", "content": "Officials are expected to hold a 3 p.m. ET news conference as the search continues for Vicky White and Casey White, the former Alabama corrections officer and inmate who have been on the run since la… [+981 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Gabby Orr, Michael Warren", "title": "Peter Thiel plans to wind down his involvement in 2022 after Vance's victory in Ohio", "description": "Billionaire tech mogul Peter Thiel won big when his longtime friend J.D. Vance succeeded in Tuesday's Ohio Senate GOP primary, surging to victory in the final days of the race after a last-minute endorsement from former President Donald Trump and a seven-figu…", "url": "https://www.cnn.com/2022/05/06/politics/peter-thiel-jd-vance-ohio-gop/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220506125216-02-peter-thiel-0407-file-restricted.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-06T18:23:11Z", "content": "Billionaire tech mogul Peter Thiel won big when his longtime friend J.D. Vance succeeded in Tuesdays Ohio Senate GOP primary, surging to victory in the final days of the race after a last-minute endo… [+7990 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Holmes Lybrand", "title": "Son of a New York judge who participated in January 6 riot in costume receives 8-month sentence", "description": "The son of a New York judge was sentenced to eight months behind bars Friday for civil disorder and stealing police equipment during the January 6, 2021 US Capitol attack.", "url": "https://www.cnn.com/2022/05/06/politics/mostofsky-son-of-new-york-judge-rioter-caveman-sentenced/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220506133238-aaron-mostofsky-capitol-january-6.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-06T17:52:38Z", "content": "The son of a New York judge was sentenced to eight months behind bars Friday for civil disorder and stealing police equipment during the January 6, 2021 US Capitol attack.\r\nDuring the riot, Aaron Mos… [+2651 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Justin Gamble, CNN", "title": "Majority-Black town reaches agreement with Tennessee to avoid state takeover", "description": "The town of Mason, Tennessee, and the NAACP reached an agreement this week with the Tennessee Comptroller's Office to settle a lawsuit filed after the state attempted to gain financial control of the majority-Black town.", "url": "https://www.cnn.com/2022/05/06/us/majority-black-town-reaches-agreement-tennessee/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220324195314-01-mason-tennessee-black-majority-town-super-tease.jpg", "publishedAt": "2022-05-06T17:43:31Z", "content": "(CNN)The town of Mason, Tennessee, and the NAACP reached an agreement this week with the Tennessee Comptroller's Office to settle a lawsuit filed after the state attempted to gain financial control o… [+2200 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oscar Holland, CNN and Gawon Bae, CNN", "title": "You've heard of K-pop, now it's time for K-drill", "description": "A new generation of South Korean rappers are taking drill from Chicago and London to the streets of Seoul, adapting the hard-hitting genre to address the harsher realities of life in their home country.", "url": "https://www.cnn.com/style/article/south-korea-kdrill-nomad/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220505204131-01-korean-drill-blase-super-tease.jpg", "publishedAt": "2022-05-06T17:29:21Z", "content": "arts\r\nIf the lurking bass and syncopated beat of Silkybois' recent hit \"Bomaye\" sound familiar to fans of drill music, the pair's lyrical content might not. Flitting between English and their native … [+7819 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/adrienne-vogt\">Adrienne Vogt</a>, <a href=\"/profiles/aditi-sandal\">Aditi Sangal</a>, Melissa Macaya and <a href=\"/profiles/meg-wagner\">Meg Wagner</a>, CNN", "title": "At least 4 dead after explosion destroys Havana hotel", "description": "Police and fire rescuers are combing through rubble for survivors after an explosion late Friday morning destroyed a hotel in Havana, Cuba. Follow here for live news updates.", "url": "https://www.cnn.com/world/live-news/havana-cuba-explosion-hotel-sarotoga/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220506114552-01-cuba-hotel-explosion-0506-super-tease.jpg", "publishedAt": "2022-05-06T17:05:10Z", "content": "At least four people have been killed following a huge explosion at the Hotel Saratoga in Havana, Cuba on Friday, according to the Cuban presidency.\r\n\"The First Secretary of the Party in Havana, Luis… [+210 chars]"}]}