{"status": "ok", "totalResults": 52, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Melanie Zanona, Zachary Cohen, Ryan Nobles", "title": "Trump mobilizing his MAGA army to defend him ahead of January 6 hearings", "description": "Former President Donald Trump has made it clear he is looking for cover from his closest allies around the upcoming public hearings by the House select committee investigating the January 6 insurrection -- and some prominent names in Congress and the Republic…", "url": "https://www.cnn.com/2022/06/05/politics/donald-trump-preparations-january-6-hearing/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220603164820-stefanik-trump-split.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-06-05T12:18:52Z", "content": "Former President Donald Trump has made it clear he is looking for cover from his closest allies around the upcoming public hearings by the House select committee investigating the January 6 insurrect… [+8464 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Liam Reilly, CNN", "title": "Queens man indicted for allegedly raping teen he met through Snapchat in New York playground", "description": "A 30-year-old Queens man was indicted Friday for allegedly raping a 13-year-old girl he connected with on Snapchat, according to a news release from the Suffolk County, New York, District Attorney's Office.", "url": "https://www.cnn.com/2022/06/05/us/queens-man-teen-snapchat/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200619112329-01-snapchat-app---stock-super-tease.jpg", "publishedAt": "2022-06-05T12:15:54Z", "content": "(CNN)A 30-year-old Queens man was indicted Friday for allegedly raping a 13-year-old girl he connected with on Snapchat, according to a news release from the Suffolk County, New York, District Attorn… [+1647 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Gabby Orr and Gloria Borger, CNN", "title": "Kemp allies and other Georgia Republicans look to keep Trump from interfering in governor's race", "description": "Allies of Gov. Brian Kemp and top Republicans in Georgia have recently approached Donald Trump advisers to see if the former President can be persuaded to go easy on the incumbent GOP governor as he fights for reelection, sources told CNN.", "url": "https://www.cnn.com/2022/06/05/politics/georgia-trump-kemp/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201205150620-02-trump-kemp-split-super-tease.jpg", "publishedAt": "2022-06-05T11:54:02Z", "content": "(CNN)Allies of Gov. Brian Kemp and top Republicans in Georgia have recently approached Donald Trump advisers to see if the former President can be persuaded to go easy on the incumbent GOP governor a… [+8833 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Richard Galant, CNN", "title": "Opinion: The false choice on stopping school shootings", "description": "What can be done to prevent mass shootings in America's schools? Democratic and Republican officials offer differing and often conflicting takes. Limiting access to guns, which faces determined opposition from the right, holds the greatest promise of making a…", "url": "https://www.cnn.com/2022/06/05/opinions/school-shooting-solutions-column-galant/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210416201632-01-mass-shootings-covid-personal-freedoms-super-tease.jpg", "publishedAt": "2022-06-05T10:44:43Z", "content": "Sign up to get this weekly column as a newsletter. We're looking back at the strongest, smartest opinion takes of the week from CNN and other outlets.\r\n (CNN)What can be done to prevent mass shooting… [+15527 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ariane de Vogue, CNN Supreme Court Reporter", "title": "Supreme Court has 33 opinions remaining in one-month sprint to end controversial term", "description": "As the Supreme Court rounds the final weeks of the term it has yet to decide an unusually high number of cases including disputes over abortion, gun rights, religious liberty, immigration and the environment -- issues that deeply divide the public and exacerb…", "url": "https://www.cnn.com/2022/06/05/politics/supreme-court-june-opinions/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211201160248-09-supreme-court-abortion-1201-super-tease.jpg", "publishedAt": "2022-06-05T10:14:11Z", "content": "(CNN)As the Supreme Court rounds the final weeks of the term it has yet to decide an unusually high number of cases including disputes over abortion, gun rights, religious liberty, immigration and th… [+8670 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Danielle Wiener-Bronner", "title": "The buzzy new drinking trend: Alcohol-free booze", "description": "Non-alcoholic alternatives to booze have been around for a while. But recently, the sector has been booming.", "url": "https://www.cnn.com/2022/06/05/business/non-alcoholic-trend/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220602085704-na-martini.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-06-05T09:55:01Z", "content": "Non-alcoholic alternatives to booze have been around for a while. But recently, the sector has been booming. \r\nFor a long time you had near beer, which was kind of a joke, said Duane Stanford, editor… [+6341 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sophie Jeong, Teele Rebane", "title": "Fire tears through Bangladesh container depot killing 37 and injuring hundreds", "description": "At least 37 people were killed and more than 300 injured as a fire tore through a container depot and caused explosions in southeastern Bangladesh, the country's state-run news agency reported.", "url": "https://www.cnn.com/2022/06/05/asia/bangladesh-sitakunda-container-depot-fire-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220605034707-02-bangladesh-sitakunda-container-depot-fire.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-06-05T09:21:36Z", "content": "At least 37 people were killed and more than 300 injured as a fire tore through a container depot and caused explosions in southeastern Bangladesh, the countrys state-run news agency reported.\r\nThe f… [+862 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Haley Brink", "title": "Tropical Storm Alex forms in the Atlantic after the system drenched South Florida with flooding rain", "description": "Tropical Storm Alex formed early Sunday after bringing heavy rain and flooding to South Florida a day prior, becoming the first named storm of this year's Atlantic hurricane season.", "url": "https://www.cnn.com/2022/06/05/us/tropical-storm-alex-sunday/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220605044125-01-tropical-storm-alex-sunday.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-06-05T09:00:31Z", "content": "Tropical Storm Alex formed early Sunday after bringing heavy rain and flooding to South Florida a day prior, becoming the first named storm of this years Atlantic hurricane season. \r\nAlex was moving … [+982 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "As officials push for answers in Uvalde school shooting nearly 2 weeks after the massacre, families are still burying their children", "description": "Jacklyn Cazares' father used to tell the 9-year-old who loved making TikTok videos with her friends not to be loud in the house. Now, he wishes he could hear her voice filling their home again after she was killed by a gunman at Robb Elementary School in Uval…", "url": "https://www.cnn.com/2022/06/05/us/uvalde-texas-elementary-school-shooting-sunday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220605004144-02-uvalde-texas-elementary-school-shooting-sunday-super-tease.jpg", "publishedAt": "2022-06-05T08:36:00Z", "content": "(CNN)Jacklyn Cazares' father used to tell the 9-year-old who loved making TikTok videos with her friends not to be loud in the house. Now, he wishes he could hear her voice filling their home again a… [+5697 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Ramirez, CNN\nPhotographs by Ryan Christopher Jones for CNN", "title": "As California's big cities fail to rein in their water use, rural communities are already tapped out", "description": "Rural Californians live with the daily worry that they won't have enough water to bathe with or drink.", "url": "https://www.cnn.com/2022/06/05/us/california-rural-groundwater-crisis-climate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220603153448-01-south-valley-drought-super-tease.jpg", "publishedAt": "2022-06-05T08:01:49Z", "content": "This state's two largest reservoirs are already at 'critically low levels' and the dry season is just starting\r\nCalifornia is in a water crisis, yet usage is way up. Officials are focused on the wron… [+329 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Zoe Sottile, CNN", "title": "Federal officials agree to update Florida manatees' protected habitat for the first time in 50 years", "description": "The US Fish and Wildlife Service (FWS) will update its manatee critical habitat protections for the first time since 1976, due to a settlement reached on Wednesday between several nonprofits and the service.", "url": "https://www.cnn.com/2022/06/05/us/florida-manatee-habitat-expansion-scn-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220602101445-florida-manatee-file-super-tease.jpg", "publishedAt": "2022-06-05T06:01:13Z", "content": "(CNN)The US Fish and Wildlife Service (FWS) will update its manatee critical habitat protections for the first time since 1976, due to a settlement reached on Wednesday between several nonprofits and… [+3538 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brad Lendon, CNN", "title": "Chinese fighter jet 'chaffs' Australian plane near South China Sea, Canberra alleges", "description": "A Chinese fighter jet's aggressive maneuvers endangered the crew of an Australian reconnaissance plane as it patrolled in the vicinity of the South China Sea, Australia's Defense Ministry claimed Sunday.", "url": "https://www.cnn.com/2022/06/05/australia/australia-china-plane-intercept-intl-hnk-ml/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220604235724-chinese-j-16-fighter-jet-super-tease.jpg", "publishedAt": "2022-06-05T05:47:50Z", "content": "Seoul, South Korea (CNN)A Chinese fighter jet's aggressive maneuvers endangered the crew of an Australian reconnaissance plane as it patrolled in the vicinity of the South China Sea, Australia's Defe… [+3936 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Harry Enten, CNN", "title": "A die-hard diet soda drinker investigates the zero sugar trend", "description": "About a year ago or so, I was hanging out at my favorite haunt in New York. I'm such a regular that the staff kept my favorite soda, which is often very difficult to find in a can, on hand for me. (Seriously, there are pictures of me drinking it online.)", "url": "https://www.cnn.com/2022/06/05/health/diet-soda-vs-zero-sugar-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220603100351-harry-enten-diet-soda-wellness-1-super-tease.jpg", "publishedAt": "2022-06-05T04:01:10Z", "content": "(CNN)About a year ago or so, I was hanging out at my favorite haunt in New York. I'm such a regular that the staff kept my favorite soda, which is often very difficult to find in a can, on hand for m… [+3851 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/helen-regan\">Helen Regan</a> and <a href=\"/profiles/andrew-raine\">Andrew Raine</a>, CNN", "title": "Russia's war in Ukraine", "description": "Five civilians have died in multiple explosions near the city of Donetsk, while hundreds of people are fleeing the eastern city of Sloviansk daily. Follow news updates here.", "url": "https://www.cnn.com/europe/live-news/russia-ukraine-war-news-06-05-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220604045202-03-ukraine-severodonetsk-060222-super-tease.jpg", "publishedAt": "2022-06-05T04:00:29Z", "content": "The Russian army is \"throwing all its reserves into\" capturing the city of Severodonetsk in the eastern Luhansk region, according to Serhiy Hayday, the head of the regional military administration. \r… [+2165 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Helen Regan, Yong Xiong", "title": "China launches third crewed mission to new space station", "description": "China launched another manned mission to its new space station on Sunday, carrying three astronauts who will continue construction of the station for six months.", "url": "https://www.cnn.com/2022/06/04/china/space-mission-shenzhou-14-crewed-launch-intl-hnk-scn/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220604213904-01-china-shenzhou-14.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-06-05T03:02:22Z", "content": "China launched another manned mission to its new space station on Sunday, sending three astronauts who will continue construction work for six months. \r\nThe astronauts lifted off on the Shenzhou-14 s… [+3278 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nectar Gan, CNN", "title": "Six arrested as Hong Kong snuffs out Tiananmen vigil, but memories live on", "description": "The football pitches sat empty and silent under the cold glare of floodlights, barricaded off on all sides. Nearby, hundreds of police patrolled the grounds, stopping and searching passersby and sealing off entrances to the park.", "url": "https://www.cnn.com/2022/06/04/china/hong-kong-june-4-2022-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220604181422-04-hk-vigil-220604-super-tease.jpg", "publishedAt": "2022-06-05T02:51:42Z", "content": "Hong Kong (CNN)The football pitches sat empty and silent under the cold glare of floodlights, barricaded off on all sides. Nearby, hundreds of police patrolled the grounds, stopping and searching pas… [+4820 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rebekah Riess and Christina Maxouris, CNN", "title": "Original Gerber Baby Ann Turner Cook, the familiar face on thousands of baby products, dies at 95", "description": "Ann Turner Cook, the original Gerber Baby whose familiar face has been printed on thousands of products over generations, has died, the company announced on Instagram. Cook was 95.", "url": "https://www.cnn.com/2022/06/04/us/ann-turner-cook-original-gerber-baby-dies/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220604183058-01-ann-turner-cook-original-gerber-baby-dies-super-tease.jpg", "publishedAt": "2022-06-04T22:57:16Z", "content": "(CNN)Ann Turner Cook, the original Gerber Baby whose familiar face has been printed on thousands of products over generations, has died, the company announced on Instagram. Cook was 95.\r\n\"Many years … [+1519 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ray Sanchez and Christina Maxouris, CNN", "title": "Slain Texas students and their grandfather remembered as 'bright, shining stars'", "description": "Hundreds of mourners filled a baseball diamond about 30 miles south of downtown Houston Friday to remember Mark Collins and his four grandsons -- \"bright, shinning stars\" in the words of a family friend.", "url": "https://www.cnn.com/2022/06/04/us/collins-family-killed-texas-gonzalo-lopez/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220604135655-01-collins-family-victims-texas-super-tease.jpg", "publishedAt": "2022-06-04T20:45:25Z", "content": "(CNN)Hundreds of mourners filled a baseball diamond about 30 miles south of downtown Houston Friday to remember Mark Collins and his four grandsons -- \"bright, shinning stars\" in the words of a famil… [+3627 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maeve Reston, CNN", "title": "Billionaire mayoral candidate Rick Caruso casts himself as LA's fixer amid unease about homelessness and crime", "description": "At a moment when Angelenos are unnerved by the rise in violent crime and car break-ins, eager to reclaim their trash-strewn parks and public spaces and exhausted by the stressors of the pandemic, shopping mall magnate Rick Caruso has surged to the top of the …", "url": "https://www.cnn.com/2022/06/04/politics/los-angeles-mayors-race-rick-caruso/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220603125011-rick-caruso-debate-super-tease.jpg", "publishedAt": "2022-06-04T20:17:08Z", "content": "Los Angeles (CNN)Over coffee at Siren's Java &amp; Tea after a walking tour of the San Pedro neighborhood near the Port of Los Angeles, billionaire real estate developer Rick Caruso couldn't stop mar… [+16192 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Carolyn Chen", "title": "Opinion: Why 'do what you love' is the worst graduation advice", "description": "In the past month, millions of college students have been graduating and entering the American workforce. Steve Jobs' well-known advice to the Stanford class of 2005, \"find what you love ... and love what you do,\" has now become the accepted gospel among the …", "url": "https://www.cnn.com/2022/06/04/opinions/graduation-advice-commencement-speeches-chen/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220524162058-graduates-stock-super-tease.jpeg", "publishedAt": "2022-06-04T19:32:32Z", "content": "Carolyn Chen is an associate professor of ethnic studies at the University of California, Berkeley, and a co-director of the Berkeley Center for the Study of Religion. She is the author of the recent… [+5521 chars]"}]}