{"status": "ok", "totalResults": 116, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "Mark Esper was asked if Trump was a threat to democracy. Here's what he said.", "description": "Former Secretary of Defense Mark Esper was asked a very simple question by Fox's Bret Baier on Monday: \"Do you think Donald Trump was a threat to democracy?\"", "url": "https://www.cnn.com/2022/05/10/politics/donald-trump-mark-esper-democracy-threat/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220509145415-trump-0507-super-tease.jpg", "publishedAt": "2022-05-10T14:33:16Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Fung, CNN", "title": "Tinder parent Match Group sues Google, alleging anticompetitive app store behavior", "description": "The dating-app company behind Tinder, OkCupid and Match.com sued Google on Monday, alleging that the technology giant runs an illegal monopoly in the Google Play Store and that its in-app payment policies, including its 30% cut of some in-app purchases, are a…", "url": "https://www.cnn.com/2022/05/10/tech/match-group-google-lawsuit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220510081145-google-sign-file-restricted-super-tease.jpg", "publishedAt": "2022-05-10T14:29:12Z", "content": "Washington (CNN Business)The dating-app company behind Tinder, OkCupid and Match.com sued Google on Monday, alleging that the technology giant runs an illegal monopoly in the Google Play Store and th… [+2976 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Beth Braverman", "title": "Big purchases need major planning. Here's where to start", "description": "It can be exciting to think about making a big purchase -- like putting a down payment on a house, throwing your dream wedding reception, buying a new car or taking a bucket-list vacation. Less exciting: thinking about how to save up for it.", "url": "https://www.cnn.com/2022/05/10/success/save-for-a-big-purchase/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220509123014-desk-calculator-stock-super-tease.jpg", "publishedAt": "2022-05-10T14:26:28Z", "content": "It can be exciting to think about making a big purchase -- like putting a down payment on a house, throwing your dream wedding reception, buying a new car or taking a bucket-list vacation. Less excit… [+3612 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Adrienne Vogt, Mike Hayes, <a href=\"/profiles/aditi-sandal\">Aditi Sangal</a> and Melissa Macaya, CNN", "title": "The latest on the Alabama fugitive case", "description": "Former Alabama corrections officer Vicky White died from injuries after she and escaped inmate Casey White were arrested in Indiana earlier Monday, officials say. Follow here for the latest news updates.", "url": "https://www.cnn.com/us/live-news/alabama-manhunt-vicky-white-casey-white-05-10-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220509223513-vicki-casey-white-split-for-video-super-tease.jpg", "publishedAt": "2022-05-10T13:48:22Z", "content": "Vanderburgh County Sheriff Dave Wedding shared new details Tuesday morning about the capture of an inmate on the run with an Alabama corrections officer, who authorities believe died by suicide.\r\nThe… [+2334 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Meta sued in Kenya over exploitation and poor working conditions", "description": "A former moderator working for Facebook owner Meta Platforms Inc (FB.O) on Tuesday filed a lawsuit alleging that poor working conditions for contracted content moderators violate the Kenyan constitution.", "url": "https://www.cnn.com/2022/05/10/tech/meta-sued-in-kenya-lgs-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220407223710-facebook-meta-phone-stock.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-10T13:41:54Z", "content": "A former moderator working for Facebook owner Meta Platforms Inc (FB.O) on Tuesday filed a lawsuit alleging that poor working conditions for contracted content moderators violate the Kenyan constitut… [+3624 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jen Rose Smith, CNN", "title": "Why do sleeping dogs look like they're running? Experts weigh in", "description": "Do our dogs really dream when they sleep? They certainly look like it. Animals' sleeping lives have sparked human curiosity for thousands of years, but clear answers have been elusive.", "url": "https://www.cnn.com/2022/05/10/health/dog-sleep-dreams-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220506152559-dog-sleep-wellness-stock-super-tease.jpg", "publishedAt": "2022-05-10T13:27:10Z", "content": "(CNN)June seems to dream of pursuit. After the long-haired German shepherd settles down for a nap, her floofy, low-slung limbs often begin to twitch and kick. To her owners, she appears to be on the … [+7165 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lisa Respers France", "title": "'American Song Contest' winner is...", "description": "The winner of the inaugural \"American Song Contest\" was announced Monday.", "url": "https://www.cnn.com/2022/05/10/entertainment/american-song-contest-winner/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220510081715-01-american-song-contest-final.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-10T13:14:24Z", "content": "This story contains spoilers for the finale of American Song Contest. \r\nThe winner of the inaugural American Song Contest was announced Monday.\r\nKelly Clarkson and Snoop Dogg hosted the reality compe… [+674 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kate Sullivan, CNN", "title": "More than 100 mayors back Biden's ATF nominee Steve Dettelbach", "description": "A bipartisan group of more than 100 mayors on Tuesday endorsed President Joe Biden's nominee to run the Bureau of Alcohol, Tobacco, Firearms and Explosives as the White House races to garner enough support to get Steve Dettelbach confirmed by the Senate.", "url": "https://www.cnn.com/2022/05/10/politics/mayors-back-steve-dettelbach-atf-nominee/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220411152843-biden-dettelbach-0411-super-tease.jpg", "publishedAt": "2022-05-10T12:01:47Z", "content": "(CNN)A bipartisan group of more than 100 mayors on Tuesday endorsed President Joe Biden's nominee to run the Bureau of Alcohol, Tobacco, Firearms and Explosives as the White House races to garner eno… [+2962 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Daniel Dale, CNN", "title": "Fact check: Tennessee didn't ban Plan B morning-after pill", "description": "A former Democratic congressional candidate went viral on Twitter over the weekend with a false claim that Tennessee has banned Plan B, a pregnancy-preventing emergency contraceptive known as a \"morning-after pill.\"", "url": "https://www.cnn.com/2022/05/10/politics/fact-check-tennessee-plan-b/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220509213109-pam-keith-file-restricted-082017-super-tease.jpg", "publishedAt": "2022-05-10T12:01:16Z", "content": "Washington (CNN)A former Democratic congressional candidate went viral on Twitter over the weekend with a false claim that Tennessee has banned Plan B, a pregnancy-preventing emergency contraceptive … [+4458 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kaitlan Collins, CNN", "title": "US mulls what Putin's end game might look like as war in Ukraine grinds on", "description": "US officials found Russian President Vladimir Putin muted and subdued when he delivered his Victory Day address on Monday, further obscuring their attempts to ascertain the Russian leader's ultimate objectives in Ukraine.", "url": "https://www.cnn.com/2022/05/10/politics/putin-end-game-biden-administration/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220316153117-102-biden-putin-split-super-tease.jpg", "publishedAt": "2022-05-10T12:00:12Z", "content": "(CNN)US officials found Russian President Vladimir Putin muted and subdued when he delivered his Victory Day address on Monday, further obscuring their attempts to ascertain the Russian leader's ulti… [+4170 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jen Christensen, CNN", "title": "Why Covid-19 vaccine boosters may be more important than ever", "description": "With waning immunity and a coronavirus that seems to become more infectious with each new variant, the Biden administration predicts that up to 100 million more people could get Covid-19 in the fall and winter. That estimate makes it crucial that as many peop…", "url": "https://www.cnn.com/2022/05/10/health/covid-19-fourth-vaccine-dose-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220506225454-02-white-house-covid-fall-wave-super-tease.jpg", "publishedAt": "2022-05-10T11:56:53Z", "content": "(CNN)With waning immunity and a coronavirus that seems to become more infectious with each new variant, the Biden administration predicts that up to 100 million more people could get Covid-19 in the … [+7969 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hannah Ryan, CNN", "title": "There's a 50:50 chance the planet will pass the 1.5C warming threshold in the next 5 years", "description": "There's now a 50:50 chance that the world will surpass a critical threshold of 1.5 degrees Celsius of global warming in the next five years, a new World Meteorological Organization report shows, warning of heating that could have devastating impacts on system…", "url": "https://www.cnn.com/2022/05/10/world/climate-warming-warning-wmo-intl-scli/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220510104511-06-climate-change-1-5-degrees-super-tease.jpg", "publishedAt": "2022-05-10T11:48:30Z", "content": "(CNN)There's now a 50:50 chance that the world will surpass a critical threshold of 1.5 degrees Celsius of global warming in the next five years, a new World Meteorological Organization report shows,… [+4848 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Reuters", "title": "Philip Morris could buy Zyn-maker Swedish Match", "description": "Shares in Swedish Match soared 25% in mid-morning trade on Tuesday after US rival Philip Morris International said it was in talks to buy the Stockholm-based tobacco products company, betting on a growing market for alternatives to cigarettes.", "url": "https://www.cnn.com/2022/05/10/business/philip-morris-swedish-match-merger/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220510074311-01-swedish-match-file-super-tease.jpg", "publishedAt": "2022-05-10T11:46:41Z", "content": "StockholmShares in Swedish Match(SWMAF) soared 25% in mid-morning trade on Tuesday after US rival Philip Morris International(PM) said it was in talks to buy the Stockholm-based tobacco products comp… [+1415 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Prince Charles delivers Queen's Speech for the first time", "description": "Britain's heir-to-the-throne Prince Charles and Prince William took center stage at the opening of parliament on Tuesday, replacing the 96-year-old Queen Elizabeth who missed the grand set-piece event for the first time in almost six decades.", "url": "https://www.cnn.com/2022/05/10/uk/prince-charles-first-queens-speech-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220510113730-01-prince-charles-speech-051022.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-10T11:03:00Z", "content": "Britains heir-to-the-throne Prince Charles and Prince William took center stage at the opening of parliament on Tuesday, replacing the 96-year-old Queen Elizabeth who missed the grand set-piece event… [+1409 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sean Lyngaas and Zachary Cohen, CNN", "title": "First on CNN: White House bolsters cyber office with hires from Microsoft and CIA", "description": "The Biden administration is building out a nascent White House office for strengthening federal cybersecurity policy and strategy by hiring a prominent Microsoft executive and a former CIA official, multiple people familiar with the matter told CNN.", "url": "https://www.cnn.com/2022/05/10/politics/white-house-cyber-office-kemba-walden/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220509220519-white-house-file-071821-super-tease.jpg", "publishedAt": "2022-05-10T11:00:55Z", "content": "(CNN)The Biden administration is building out a nascent White House office for strengthening federal cybersecurity policy and strategy by hiring a prominent Microsoft executive and a former CIA offic… [+2060 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alexandra Meeks", "title": "5 things to know for May 10: Ukraine, Manhunt, Philippines, Stocks, Resort deaths", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2022/05/10/us/five-things-may-10-trnd/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220510090911-01-odesa-aftermath-051022.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-10T10:28:06Z", "content": "High winds and extreme heat are fueling dangerous wildfires across the Southwest. Four states New Mexico, Arizona, Colorado and Texas are battling a dozen large fires that have already burned more th… [+6243 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kylie Atwood", "title": "US to provide more than $800M in new humanitarian assistance to Syria", "description": "The US is providing more than $800 million in new humanitarian assistance to the Syrian people to continue helping those impacted by the Syrian war, US Ambassador to the United Nations Linda Thomas-Greenfield announced while speaking in Brussels at a conferen…", "url": "https://www.cnn.com/2022/05/10/politics/us-assistance-syria/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220510105410-us-assistance-syria.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-10T10:12:23Z", "content": "The US is providing more than $800 million in new humanitarian assistance to the Syrian people to continue helping those impacted by the Syrian war, US Ambassador to the United Nations Linda Thomas-G… [+2873 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lisa Morrow, CNN", "title": "Mardin: Turkey's ancient treasure trove", "description": "Donkeys meander through narrow streets past doorways and through low arches, suddenly braying around corners at startled tourists while residents continue on their way, unperturbed.", "url": "https://www.cnn.com/travel/article/turkey-mardin/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220505110026-mardin-turkey-card-super-tease.jpg", "publishedAt": "2022-05-10T09:45:45Z", "content": "Editor's Note This CNN Travel series is, or was, sponsored by the country it highlights. CNN retains full editorial control over subject matter, reporting and frequency of the articles and videos wit… [+7502 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Mark Morales", "title": "Woman who accused celebrity chef Mario Batali of groping her testifies in criminal trial", "description": "A woman who says she was sexually assaulted by celebrity chef Mario Batali took the stand Monday on the first day of his criminal trial in Boston, testifying that he groped her during an impromptu selfie session in 2017.", "url": "https://www.cnn.com/2022/05/10/us/mario-batali-trial-boston-tuesday/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220509213926-mario-batali-trial-050922.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-10T09:38:45Z", "content": "A woman who says she was sexually assaulted by celebrity chef Mario Batali took the stand Monday on the first day of his criminal trial in Boston, testifying that he groped her during an impromptu se… [+6634 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Shohei Ohtani hits first grand slam as a professional", "description": "From one magnificent feat to another, Shohei Ohtani is having a season to remember.", "url": "https://www.cnn.com/2022/05/10/sport/shohei-ohtani-grand-slam-debut-spt-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220510100332-02-shohei-ohtani-grand-slam.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-10T09:25:49Z", "content": "From one magnificent feat to another, Shohei Ohtani is having a season to remember. \r\nOn Monday, the Los Angeles Angels star achieved his first grand slam as a professional as he helped his side to a… [+1459 chars]"}]}