{"status": "ok", "totalResults": 73, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Douglas Heye", "title": "Opinion: Republicans, look across the pond and take note. Now's the time to dump Trump", "description": "That the Tories dumping Johnson went from an unthinkable idea to an inevitable outcome should be a lesson to Republicans here in America. They, too, can bypass more political chaos by dumping Donald Trump, once and for all, writes Douglas Heye.", "url": "https://www.cnn.com/2022/07/08/opinions/boris-johnson-resignation-republicans-dump-trump-heye/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220707025716-01-boris-johnson-trump-file.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-08T21:46:45Z", "content": "Editors Note: Douglas Heye is the ex-deputy chief of staff to former House Majority Leader Eric Cantor, a GOP strategist and a CNN political commentator. Follow him on Twitter @dougheye. The opinions… [+4271 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lauren del Valle, CNN", "title": "Ghislaine Maxwell's attorneys appeal her federal conviction and sentence", "description": "Attorneys for Ghislaine Maxwell have appealed her conviction and 20-year federal prison sentence for carrying out a yearslong scheme with her longtime confidante Jeffrey Epstein to groom and sexually abuse underage girls.", "url": "https://www.cnn.com/2022/07/08/us/ghislaine-maxwell-appeal/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200814010616-ghislaine-maxwell-file-super-tease.jpg", "publishedAt": "2022-07-08T21:42:33Z", "content": "New York (CNN)Attorneys for Ghislaine Maxwell have appealed her conviction and 20-year federal prison sentence for carrying out a yearslong scheme with her longtime confidante Jeffrey Epstein to groo… [+2722 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Casey Tolan and Daniel A. Medina, CNN", "title": "Highland Park gunman's family was in turmoil for years leading up to parade shooting", "description": "When Bob's Pantry and Deli opened for business in the Chicago suburb of Highland Park in 2008, loyal customers lined up in the snow at 4 a.m. to support Bob Crimo, who was striking out on his own after years running a convenience store franchise. Photos from …", "url": "https://www.cnn.com/2022/07/08/us/highland-park-suspect-family-turmoil-invs/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220708094328-robert-crimo-jr-highland-park-shooter-father-super-tease.jpeg", "publishedAt": "2022-07-08T21:32:43Z", "content": "(CNN)When Bob's Pantry and Deli opened for business in the Chicago suburb of Highland Park in 2008, loyal customers lined up in the snow at 4 a.m. to support Bob Crimo, who was striking out on his ow… [+15870 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Clare Duffy", "title": "Elon Musk tells Twitter he wants out of his deal to buy it", "description": "Elon Musk wants to terminate his $44 billion deal to buy Twitter — the latest in a whirlwind process in which he became the company's biggest shareholder, turned down a board seat, agreed to buy the social media platform and then started raising doubts about …", "url": "https://www.cnn.com/2022/07/08/tech/elon-musk-twitter-deal-exit/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220706225156-02-elon-musk-file-070622.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-08T21:32:17Z", "content": "Elon Musk wants to terminate his $44 billion deal to buy Twitter the latest in a whirlwind process in which he became the companys biggest shareholder, turned down a board seat, agreed to buy the soc… [+711 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sara Ashley O'Brien, CNN Business", "title": "End of a chapter at Theranos: What's next for former top two executives", "description": "In January, Elizabeth Holmes became the rare Silicon Valley founder convicted of fraud stemming from her time as CEO of her failed blood-testing startup, Theranos. On Thursday, her ex-boyfriend and former second-in-command, Ramesh \"Sunny\" Balwani, was also fo…", "url": "https://www.cnn.com/2022/07/08/tech/elizabeth-holmes-sunny-balwani-theranos-sentencing/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220708155814-03-elizabeth-holmes-sunny-balwani-split-super-tease.jpg", "publishedAt": "2022-07-08T21:00:41Z", "content": "(CNN Business)In January, Elizabeth Holmes became the rare Silicon Valley founder convicted of fraud stemming from her time as CEO of her failed blood-testing startup, Theranos. On Thursday, her ex-b… [+4651 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Frida Ghitis", "title": "Opinion: Abe's assassination came like a thunderbolt", "description": "The news that former Japanese Prime Minister Shinzo Abe was assassinated Friday, at the age of 67, during a campaign rally came like a thunderbolt. If it was shocking to people around the world, it was devastating in Japan, where gun violence is essentially n…", "url": "https://www.cnn.com/2022/07/08/opinions/abe-assassination-world-in-crisis-ghitis/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/211201004634-shinzo-abe-file-12242020-restricted.jpg?q=x_174,y_158,h_1652,w_2937,c_crop/w_800", "publishedAt": "2022-07-08T20:37:41Z", "content": "Editors Note: Frida Ghitis, (@fridaghitis), a former CNN producer and correspondent, is a world affairs columnist. She is a weekly opinion contributor to CNN, a contributing columnist to The Washingt… [+5679 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Evan Perez, Hannah Rabinowitz", "title": "FBI Director Wray tells CNN there are 'way, way too many people' acting violently on political grievances", "description": "The FBI director traveled to London this week to meet with Ken McCallum, director general of MI5, to highlight close coordination on everything from counterterrorism to cyber attacks, and Russian and Chinese espionage", "url": "https://www.cnn.com/2022/07/08/politics/fbi-chris-wray-mi5-ken-mccallum-interview/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220708152811-fbi-chris-wray-cnn.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-08T20:13:24Z", "content": "Hours after the assassination of former Japanese Prime Minister Shinzo Abe on Friday, top US and British law enforcement leaders decried threats facing public figures around the globe in an exclusive… [+4152 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matt McFarland, CNN Business", "title": "Ford and VW-backed self-driving company shuts down DC operations", "description": "Argo AI, the self-driving company backed by Ford and Volkswagen, is shutting down its Washington, DC operation as part of a broader round of layoffs impacting about 150 people across the company.", "url": "https://www.cnn.com/2022/07/08/business/argo-ai-ford-vw-layoffs/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220708115526-ford-argo-ai-car-washington-d-c-file-restricted-super-tease.jpg", "publishedAt": "2022-07-08T20:06:32Z", "content": "Washington, DC (CNN)Argo AI, the self-driving company backed by Ford and Volkswagen, is shutting down its Washington, DC operation as part of a broader round of layoffs impacting about 150 people acr… [+3073 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Megan Thomas, CNN", "title": "Larry Storch, 'F Troop' actor, dead at 99", "description": "Larry Storch, a television actor best known for his role in the '60s sitcom \"F Troop,\" died Thursday, according to a statement shared by his family on Facebook. He was 99.", "url": "https://www.cnn.com/2022/07/08/entertainment/larry-storch-obit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220708140439-larry-storch-f-troop-restricted-super-tease.jpg", "publishedAt": "2022-07-08T20:01:09Z", "content": "(CNN)Larry Storch, a television actor best known for his role in the '60s sitcom \"F Troop,\" died Thursday, according to a statement shared by his family on Facebook. He was 99.\r\n\"It is with the heavi… [+714 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeremy Herb, Barbara Starr and Ellie Kaufman, CNN", "title": "Army seeking to recoup nearly $40,000 from Michael Flynn for foreign payments", "description": "The Army is seeking to recoup nearly $40,000 from former President Donald Trump's first national security adviser, Michael Flynn, accusing the retired three-star general of violating the Emoluments Clause by accepting foreign payments without disclosing them.", "url": "https://www.cnn.com/2022/07/08/politics/army-michael-flynn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201207174535-01-michael-flynn-lead-image-super-tease.jpg", "publishedAt": "2022-07-08T19:21:44Z", "content": "(CNN)The Army is seeking to recoup nearly $40,000 from former President Donald Trump's first national security adviser, Michael Flynn, accusing the retired three-star general of violating the Emolume… [+2526 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jasmine Wright and Maegan Vazquez, CNN", "title": "White House says Americans should be 'really careful' about using period tracker apps", "description": "The White House is warning individuals to be \"really careful\" when using phone apps that track users' menstrual cycles over fears that the data could be used against them if they seek abortions following the Supreme Court's decision to overturn Roe v. Wade.", "url": "https://www.cnn.com/2022/07/08/politics/white-house-period-tracker-apps/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220616122204-period-tracker-app-stock-super-tease.jpg", "publishedAt": "2022-07-08T19:19:51Z", "content": "(CNN)The White House is warning individuals to be \"really careful\" when using phone apps that track users' menstrual cycles over fears that the data could be used against them if they seek abortions … [+3685 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Raja Razek, CNN", "title": "Oklahoma governor calls for public schools audit for potential mishandling of public funds and teaching CRT", "description": "Oklahoma Gov. Kevin Stitt announced in a video message Thursday that he is calling for a special audit of Tulsa Public Schools (TPS) for potential mishandling of public funds and said he is \"also ​concerned that TPS may have violated state law, specifically H…", "url": "https://www.cnn.com/2022/07/08/us/oklahoma-governor-tulsa-schools-audit-crt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220708133507-01-kevin-stitt-0624-super-tease.jpg", "publishedAt": "2022-07-08T19:09:33Z", "content": "(CNN)Oklahoma Gov. Kevin Stitt announced in a video message Thursday that he is calling for a special audit of Tulsa Public Schools (TPS) for potential mishandling of public funds and said he is \"als… [+3228 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Jessica Calarco", "title": "Opinion: If women are encouraged to breastfeed for two years, they need much more support", "description": "According to the American Academy of Pediatric's new guidelines, women are encouraged to breastfeed for up to two years. But although the AAP calls on employers and policymakers to do more to give women the flexibility to breastfeed, these calls to action do …", "url": "https://www.cnn.com/2022/07/08/opinions/aap-breastfeeding-recommendations-calarco/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/150126105108-breastfeeding-stock-super-tease.jpg", "publishedAt": "2022-07-08T18:57:44Z", "content": "Jessica Calarco is an associate professor of sociology at Indiana University. She is the author of \"Qualitative Literacy,\" \"A Field Guide to Grad School\" and \"Negotiating Opportunities.\" Follow her o… [+8740 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Peter Valdes-Dapena", "title": "You're much more likely to buy an EV if you've ever had a ride in one", "description": "The percentage of Americans who say they would \"definitely buy\" an electric vehicle has more than tripled over the past two years, according to a new survey. That's a little less impressive than it seems at first glance: It went from just 4% of Americans in 2…", "url": "https://www.cnn.com/2022/07/08/business/consumer-reports-electric-car-survey/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210301154136-01-2022-chevrolet-bolt-euv.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-08T18:24:17Z", "content": "The percentage of Americans who say they would definitely buy an electric vehicle has more than tripled over the past two years, according to a new survey. Thats a little less impressive than it seem… [+4715 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Shimon Prokupecz, Matthew J. Friedman", "title": "Grieving Uvalde families condemn responding officers as 'cowards'", "description": "The officers who failed to tackle a shooter at Robb Elementary in Uvalde, Texas, for more than an hour should all lose their badges, relatives of some of the 21 people killed tell CNN.", "url": "https://www.cnn.com/2022/07/08/us/uvalde-families-call-officers-cowards/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220708124617-05-grieving-uvalde-families.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-08T17:58:24Z", "content": "Every new piece of information about the way officers responded to a school gunman in Uvalde, Texas, is adding to the pain of losing their loved ones, relatives told CNN. \r\nIt was just like putting s… [+5114 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte, CNN", "title": "Diet showdown: Keto versus Mediterranean. Which won?", "description": "People with diabetes or prediabetes followed a healthy keto diet and then a traditional Mediterranean diet for three months. How did each diet affect their health? The answer might surprise you.", "url": "https://www.cnn.com/2022/07/08/health/keto-mediterranean-diet-showdown/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220218170041-vegetables-cooking-stock-super-tease.jpg", "publishedAt": "2022-07-08T17:56:37Z", "content": "(CNN)In one corner: the medically renowned Mediterranean diet, a perennial favorite among nutritionists. The contender: the popular keto diet, known for restricting carbohydrates to a precious few pe… [+5747 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Priscilla Alvarez, CNN", "title": "Border Patrol agents on horseback used 'unnecessary' force in Del Rio incident but investigation found no evidence they struck migrants with reins, CBP report states", "description": "Four Border Patrol agents involved in an aggressive confrontation with Haitian migrants last year near Del Rio, Texas, were referred for discipline and are on administrative duties after a months-long investigation, senior US Customs and Border Protection off…", "url": "https://www.cnn.com/2022/07/08/politics/border-patrol-del-rio-horse-investigation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210921093307-mexico-us-border-haiti-092921-file-super-tease.jpg", "publishedAt": "2022-07-08T17:31:26Z", "content": "(CNN)Four Border Patrol agents involved in an aggressive confrontation with Haitian migrants last year near Del Rio, Texas, were referred for discipline and are on administrative duties after a month… [+2437 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland", "title": "Largest parrot colony in the world lives in Patagonia's crumbling cliffs", "description": "Burrowing parrots live inside cliffs along the northern tip of Patagonia's desert coast in Argentina. But the world's largest parrot colony, full of chatty and colorful birds, is declining.", "url": "https://www.cnn.com/2022/07/08/world/patagonia-burrowing-parrots-scn/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220628125402-burrowing-parrots-patagonia-desert-coast-origseriesfilms-00012405.png?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-08T16:50:32Z", "content": "The new docuseries Patagonia: Life on the Edge of the World explores one of the wildest places on Earth. The series premieres at 9 p.m. ET/PT Sunday on CNN.\r\nAt the northern tip of Patagonias desert … [+4332 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Clare Duffy, CNN Business", "title": "Twitter is laying off a third of its talent acquisition team", "description": "Twitter is laying off a portion of its recruiting team after previously saying it would pause most hiring. The move comes as Twitter continues to await a pending acquisition by Elon Musk, a process that has been marked by confusion and contention between the …", "url": "https://www.cnn.com/2022/07/08/tech/twitter-recruiting-layoffs-elon-musk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220427125940-twitter-headquarters-san-francisco-0426-super-tease.jpg", "publishedAt": "2022-07-08T16:39:01Z", "content": "New York (CNN Business)Twitter is laying off a portion of its recruiting team after previously saying it would pause most hiring. The move comes as Twitter continues to await a pending acquisition by… [+2510 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Nicole Hemmer", "title": "Opinion: Comey and McCabe tax audits raise red flags", "description": "If it turns out the former president did play a role in the audits of James Comey and Andrew McCabe, writes Nicole Hemmer, it would come as no great shock -- not only because of Donald Trump's words and actions, but also because presidents have long availed t…", "url": "https://www.cnn.com/2022/07/08/opinions/irs-audit-comey-and-mccabe-weaponizing-administrative-state-hemmer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220707074017-mccabe-comey-split-super-tease.jpg", "publishedAt": "2022-07-08T16:14:25Z", "content": "Nicole Hemmer is an associate research scholar at Columbia University with the Obama Presidency Oral History Project and the author of \"Messengers of the Right: Conservative Media and the Transformat… [+6504 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Max Foster, Lauren Said-Moorhouse", "title": "How Camilla is making the royal role her own", "description": "Perched on a bench in the garden, a pair of shears and a basket of flowers in hand, the Duchess of Cornwall appears at ease as the forthcoming cover star of a national magazine.", "url": "https://www.cnn.com/2022/07/08/uk/royal-news-newsletter-07-08-22-scli-gbr-cmd-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220708091950-07-royal-newsletter-0708.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-08T16:03:14Z", "content": "A version of this story appeared in the July 8 edition of CNNs Royal News, a weekly dispatch bringing you the inside track on Britains royal family. Sign up here. \r\nPerched on a bench in the garden, … [+8675 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kate Sullivan, CNN", "title": "Here's what's in Biden's executive order on abortion rights", "description": "President Joe Biden on Friday is signing an executive order aimed at protecting access to reproductive health services in the wake of the Supreme Court overturning Roe v. Wade and eliminating the constitutional right to an abortion.", "url": "https://www.cnn.com/2022/07/08/politics/what-is-in-biden-abortion-executive-order/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220706153940-01-joe-biden-cleveland-070622-super-tease.jpg", "publishedAt": "2022-07-08T15:04:14Z", "content": "(CNN)President Joe Biden on Friday is signing an executive order aimed at protecting access to reproductive health services in the wake of the Supreme Court overturning Roe v. Wade and eliminating th… [+4330 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marianne Garvey", "title": "Martha Stewart discusses her crushes with Chelsea Handler", "description": "Martha Stewart has a few crushes, one on a married man she knows.", "url": "https://www.cnn.com/2022/07/08/entertainment/martha-stewart-chelsea-handler/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220708104146-01-martha-stewart-file-0430-super-tease.jpg", "publishedAt": "2022-07-08T14:48:37Z", "content": "(CNN)Martha Stewart has a few crushes, one on a married man she knows. \r\nBut there's no scandal here. Stewart has assured Chelsea Handler she's no homewrecker, even though she's had the opportunity. … [+915 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Daniel Dale", "title": "Fact check: Anti-Biden commentators spread false claim that he affixed a Medal of Honor 'backwards'", "description": "A false claim that President Joe Biden placed a Medal of Honor \"backwards\" around the neck of a Vietnam War hero has gone viral on social media -- with some conservatives citing the invented tale as supposed evidence of Biden experiencing mental decline.", "url": "https://www.cnn.com/2022/07/08/politics/fact-check-biden-medal-of-honor-backwards/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220705121523-03-birdwell-medal-of-honor-0705.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-08T14:33:12Z", "content": "A false claim that President Joe Biden placed a Medal of Honor backwards around the neck of a Vietnam War hero has gone viral on social media with some conservatives citing the invented tale as suppo… [+2729 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sarah El Sirgany and Lina El Wardani, CNN", "title": "'It's getting scary.' How the war in Ukraine plunged this Middle East nation into crisis", "description": "Egyptian households of all income levels are seeing their spending power erode fast. The economic crisis raises prospects of unrest in a country where a regime was overthrown just a decade ago in an uprising calling for \"bread, freedom and social justice.\"", "url": "https://www.cnn.com/2022/07/08/business/egypt-economy-inflation-mime-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220708033953-mime-egypt-economy-restricted-super-tease.jpg", "publishedAt": "2022-07-08T14:06:41Z", "content": "A version of this story first appeared in CNN's Meanwhile in the Middle East newsletter, a three-times-a-week look inside the region's biggest stories. Sign up here.\r\nCairo and Abu Dhabi (CNN)There a… [+14337 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Danielle Wiener-Bronner, CNN Business", "title": "Gen Z isn't that into dining out. Here's how restaurants are chasing them", "description": "Restaurants have had a tough couple of years, with the pandemic, soaring ingredient prices and labor shortages. Now they have another problem: Gen Z isn't all that interested in dining out.", "url": "https://www.cnn.com/2022/07/08/business-food/gen-z-restaurants/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220707120138-us-customers-generations-habits-dining-out-file-restricted-super-tease.jpg", "publishedAt": "2022-07-08T14:01:48Z", "content": "New York (CNN Business)Restaurants have had a tough couple of years, with the pandemic, soaring ingredient prices and labor shortages. Now they have another problem: Gen Z isn't all that interested i… [+5502 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Brian Lowry, CNN", "title": "Marvel's churning out series for Disney+. Is that diluting the 'Thunder' from its movies?", "description": "If Marvel Studios has problems, they're clearly of the high-class variety. Its last sequel, featuring Doctor Strange, amassed more than $950 million worldwide, and the latest, \"Thor: Love and Thunder,\" also looks destined to make it rain, financially speaking.", "url": "https://www.cnn.com/2022/07/08/entertainment/thor-love-and-thunder-preview/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220627142533-01-thor-love-and-thunder-super-tease.jpg", "publishedAt": "2022-07-08T13:51:38Z", "content": "(CNN)If Marvel Studios has problems, they're clearly of the high-class variety. Its last sequel, featuring Doctor Strange, amassed more than $950 million worldwide, and the latest, \"Thor: Love and Th… [+3728 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Holly Yan", "title": "The woman who planned her synagogue's funerals was killed in the Highland Park massacre. Now a friend embarks on an unimaginable task", "description": "At first, the grief-stricken congregation didn't know who would take the reins from Jacki Sundheim and plan her synagogue funeral with the same tenacity and care that she always bestowed onto others.", "url": "https://www.cnn.com/2022/07/08/us/jacki-sundheim-funeral-director/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220707000948-02-jamie-greenebaum-highland-park.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-08T13:49:07Z", "content": "Anytime there was a major life event at her synagogue, Jacki Sundheim was on top of it. \r\nThe 63-year-old meticulously planned virtually every bar mitzvah, bat mitzvah, wedding and funeral at North S… [+2758 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Fiona Sinclair Scott, CNN", "title": "Paris Haute Couture Week: Clothes for the 1%, thrills for everyone else", "description": "For the super rich, couture fashion is a chance to indulge, to splurge, to flex. For the rest of the world, it's an opportunity to watch the spectacle, escape into another world and ogle at the excess of it all.", "url": "https://www.cnn.com/style/article/paris-haute-couture-week-july-2022/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220708133255-19-paris-fashion-week-couture-schiap-frow-super-tease.jpg", "publishedAt": "2022-07-08T13:19:11Z", "content": "Paris Haute Couture Week: Clothes for the 1%, thrills for everyone else\r\nFor the super rich, couture fashion is a chance to indulge, to splurge, to flex. For the rest of the world, it's an opportunit… [+4928 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte, CNN", "title": "She saved her husband's life with an experimental virus treatment after all antibiotics failed", "description": "With her husband near death from an antibiotic-resistant superbug, a scientist found a cure no one had used in the US -- intravenous injections of viruses called phages -- and convinced the medical system to save his life.", "url": "https://www.cnn.com/2022/07/08/health/phage-superbug-killer-life-itself-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220617150818-04-phage-superbug-killer-wellness-super-tease.jpg", "publishedAt": "2022-07-08T13:16:14Z", "content": "(CNN)In February 2016, infectious disease epidemiologist Steffanie Strathdee was holding her dying husband's hand, watching him lose an exhausting fight against a deadly superbug infection. \r\nAfter m… [+11859 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chloe Melas", "title": "Paul Rudd FaceTimes 12-year-old boy after classmates refuse to sign his yearbook", "description": "Paul Rudd showed a young fan some much-deserved kindness.", "url": "https://www.cnn.com/2022/07/08/entertainment/paul-rudd-facetimes-boy-yearbook/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220708071055-01-paul-rudd-file.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-08T12:53:48Z", "content": "Paul Rudd showed a young fan some much-deserved kindness.\r\nThe actor reached out to a Brody Ridder, 12, after learning the boy was being alienated at his middle school.\r\nRidder made headlines in his … [+1026 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ella Nilsen", "title": "The federal office focused on health impacts of climate crisis has no permanent staff or funding", "description": "President Joe Biden's first sweeping executive orders on climate included launching an entirely new office within the Department of Health and Human Services with an important mandate: dealing with the public health impacts of climate change.", "url": "https://www.cnn.com/2022/07/08/politics/hhs-climate-office-funding/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220706160212-02-office-of-climate-change-hhs.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-08T12:39:51Z", "content": "President Joe Bidens first sweeping executive orders on climate included launching an entirely new office within the Department of Health and Human Services with an important mandate: dealing with th… [+6720 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Gunman's uncle asked if he would have signed gun ID card. Hear his reply", "description": "Paul Crimo, the uncle of Robert E. Crimo III, talks with CNN's John Berman about his nephew, who admitted to authorities that he was responsible for the shooting at a Fourth of July parade in Highland Park, Illinois, that left seven people dead.", "url": "https://www.cnn.com/videos/us/2022/07/08/highland-park-parade-shooting-crimo-uncle-intv-newday-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220708075735-paul-crimo-john-berman-split-super-tease.jpg", "publishedAt": "2022-07-08T12:36:12Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Christine Romans", "title": "US will plunge into recession — but it didn't have to, former IMF chief economist says", "description": "It's \"almost impossible\" for the Fed to tamp down inflation without tipping the US economy into a recession, says Former IMF Chief Economist Ken Rogoff.", "url": "https://www.cnn.com/2022/07/08/economy/inflation-fed-recession/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220629103827-us-consumption-grocery-shoppers-file.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-08T12:31:04Z", "content": "Its almost impossible for the Fed to tamp down inflation without tipping the US economy into a recession, says Former IMF Chief Economist Ken Rogoff.\r\n[The Fed] would have to be very lucky, Rogoff to… [+972 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Korn", "title": "Period-tracking apps are trying to make women feel safer about their data after the end of Roe v. Wade", "description": "In the wake of the Supreme Court decision to overturn Roe v. Wade, women living in states that criminalize abortion are grappling with the possibility that their phones could now hold incriminating information about their travel, search history and menstrual …", "url": "https://www.cnn.com/2022/07/08/tech/period-tracking-apps-data-privacy/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220706154726-01-woman-phone-stock-super-tease.jpg", "publishedAt": "2022-07-08T12:20:35Z", "content": "New York (CNN Business)In the wake of the Supreme Court decision to overturn Roe v. Wade, women living in states that criminalize abortion are grappling with the possibility that their phones could n… [+5663 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chris Isidore", "title": "GameStop fires its CFO and looks to cut staff", "description": "GameStop has fired its chief financial officer and is preparing to make cuts to its staff.", "url": "https://www.cnn.com/2022/07/08/investing/gamestop-cfo-fired-job-cuts/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220708074104-gamestop-store-0127-file.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-08T12:10:45Z", "content": "GameStop has fired its chief financial officer and is preparing to make cuts to its staff.\r\nShares of the companys volatile stock fell 5% in premarket trading Friday. The stock rose 15% Thursday afte… [+2922 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "In pictures: The life and career of Japan's former PM", "description": "Former Japanese Prime Minister Shinzo Abe was assassinated Friday while giving a campaign speech on a street in Nara, Japan. Abe, 67, was Japan's longest-serving prime minister, holding office from 2006 to 2007 and again from 2012 to 2020.", "url": "https://www.cnn.com/2022/07/08/asia/gallery/shinzo-abe/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220708063309-38-japan-shinzo-abe-obit-super-tease.jpg", "publishedAt": "2022-07-08T11:48:20Z", "content": "Then-Japanese Prime Minister Shinzo Abe addresses the media during a news conference in 2014.\r\nUpdated 7:48 AM ET, Fri July 8, 2022\r\nThen-Japanese Prime Minister Shinzo Abe addresses the media during… [+785 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Issy Ronald, CNN", "title": "Megan Rapinoe pays tribute to Brittney Griner while receiving Presidential Medal of Freedom", "description": "As she received the Presidential Medal of Freedom -- the highest civilian honor in the United States -- Megan Rapinoe paid tribute to detained WNBA star Brittney Griner, wearing a cream blazer with the initials 'BG' and a bunch of flowers embroidered onto the…", "url": "https://www.cnn.com/2022/07/08/sport/megan-rapinoe-presidential-medal-brittney-griner-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220708115020-01-megan-rapinoe-presidential-medal-super-tease.jpg", "publishedAt": "2022-07-08T11:44:07Z", "content": "(CNN)As she received the Presidential Medal of Freedom -- the highest civilian honor in the United States -- Megan Rapinoe paid tribute to detained WNBA star Brittney Griner, wearing a cream blazer w… [+2488 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Daniel Dale, CNN", "title": "Fact check: Liberal website changes headline that falsely said DeSantis signed a bill that forces students to register their political views", "description": "The liberal website Salon has changed a headline that had falsely said a bill signed by Republican Gov. Ron DeSantis forces Florida's students and professors to register their political views with the state.", "url": "https://www.cnn.com/2022/07/08/politics/fact-check-desantis-florida-students-professors-political-views/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220625100924-smr-desantis-super-tease.jpg", "publishedAt": "2022-07-08T11:30:29Z", "content": "Washington (CNN)The liberal website Salon has changed a headline that had falsely said a bill signed by Republican Gov. Ron DeSantis forces Florida's students and professors to register their politic… [+4838 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Art critic Jerry Saltz on DALL-E 2: 'This is pretty crapola illustration'", "description": "AI and DALL-E 2 is cropping up across Twitter feeds, but is it art? New York Magazine's Senior Art Critic Jerry Saltz tells \"Nightcap's\" Jon Sarlin he believes some AI art has no imagination or creativity. To get the day's business headlines sent directly to …", "url": "https://www.cnn.com/videos/business/2022/07/07/nightcap-ai-dall-e-2-art-clip-orig.cnn-business", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220707174524-nightcap-dall-e-2-16x9-thumb-super-tease.jpg", "publishedAt": "2022-07-08T11:27:15Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Hear former Abe adviser's reaction to assassination", "description": "Akihisa Shiozaki, a former senior adviser to former Japanese Prime Minister Abe, talks with CNN's John Berman about his former boss. Japan's former Prime Minister Shinzo Abe has died at the age of 67 after being shot during a campaign speech in Nara, Japan, a…", "url": "https://www.cnn.com/videos/world/2022/07/08/japan-former-pm-shinzo-abe-dead-reaction-intl-hnk-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220707210753-shinzo-abe-speaks-in-nara-0708-super-tease.jpg", "publishedAt": "2022-07-08T11:23:30Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "George Ramsay, CNN", "title": "Tunisia's 'Minister of Happiness' Ons Jabeur aims to make more history at Wimbledon", "description": "Whenever Ons Jabeur steps onto a tennis court, she never plays solely for herself, but for the future generations she hopes to inspire.", "url": "https://www.cnn.com/2022/07/08/tennis/ons-jabeur-elena-rybakina-wimbledon-final-preview-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220708083431-ons-jabeur-super-tease.jpg", "publishedAt": "2022-07-08T11:10:12Z", "content": "(CNN)Whenever Ons Jabeur steps onto a tennis court, she never plays solely for herself, but for the future generations she hopes to inspire.\r\nThis Saturday will be no different as Jabeur attempts to … [+4671 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Andrew Kaczynski and Em Steck, CNN", "title": "Herschel Walker partnered in 2012 with arm of energy company accused by multiple states of deceptive practices", "description": "Georgia Republican Senate nominee Herschel Walker was once a \"partner\" and \"spokesman\" for a subsidiary of an energy company, Just Energy, which was repeatedly targeted by states' attorneys general and utility agencies over allegedly deceptive practices.", "url": "https://www.cnn.com/2022/07/08/politics/kfile-herschel-walker-business-partner-energy-company-deceptive-practices/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220707161807-herschel-walker-file-052322-super-tease.jpg", "publishedAt": "2022-07-08T11:00:25Z", "content": "(CNN)Georgia Republican Senate nominee Herschel Walker was once a \"partner\" and \"spokesman\" for a subsidiary of an energy company, Just Energy, which was repeatedly targeted by states' attorneys gene… [+4980 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alexandra Meeks, CNN", "title": "5 things to know for July 8: Shinzo Abe, Parade shooting, Brittney Griner, Covid, Heat", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2022/07/08/us/five-things-july-8-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220708095812-abe-5-things-super-tease.jpg", "publishedAt": "2022-07-08T10:43:07Z", "content": "(CNN)Summer travel is heating up, but understaffed airlines are struggling to avoid melting down. American Airlines this week agreed to pay its pilots triple their normal rate after thousands of flig… [+7308 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alicia Wallace", "title": "Friday's jobs report could be telling as recession worries mount", "description": "Economic uncertainty and recession fears have yet to take the shine off a robust labor market, but investors and Federal Reserve officials will be carefully parsing the details of Friday's jobs report for any sign of softening.", "url": "https://www.cnn.com/2022/07/08/economy/june-jobs-report-final/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220707140121-career-fair-california-220603.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-08T10:39:39Z", "content": "MinneapolisCNN Business\r\n  — \r\nEconomic uncertainty and recession fears have yet to take the shine off a robust labor market, but investors and Federal Reserve officials will be carefully parsing the… [+3570 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "W. Kamau Bell", "title": "W. Kamau Bell: What you need to know about the 'woke war'", "description": "Everywhere you look someone is worried that America has gotten too woke, writes W. Kamau Bell. For the premiere episode of the new season of 'United Shades of America,' Bell delves into the war on 'woke' in the state he refers as 'desert Florida.'", "url": "https://www.cnn.com/2022/07/08/opinions/woke-war-united-shades-of-america-kamau-bell/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220707121656-w-kamau-bell-united-shades-critical-race-theory-origseriesfilms-newsroom-00012504.png?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-08T10:29:10Z", "content": "Editors Note: W. Kamau Bell is a sociopolitical comedian and author who hosts and executive produces the CNN Original Series United Shades of America. With Kate Schatz, he is the co-writer of the new… [+8626 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Michelle Toh, CNN Business", "title": "Hollywood won't budge for Chinese censors anymore. Here's what changed", "description": "Hollywood has long bent over backwards to give Chinese censors what they want. Not anymore.", "url": "https://www.cnn.com/2022/07/08/media/hollywood-china-censors-box-office-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220707111453-cinema-masks-super-tease.jpg", "publishedAt": "2022-07-08T10:21:16Z", "content": "Analysis by Michelle Toh, CNN Business\r\nUpdated 6:21 AM ET, Fri July 8, 2022\r\nHollywood has long bent over backwards to give Chinese censors what they want. Not anymore. \r\nOver the past year, produce… [+12426 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Luke McGee", "title": "Boris Johnson has left a hellish task for his successor. But British Conservatives are delirious with relief", "description": "Conservative members of the British Parliament woke up on Friday morning with one hell of a hangover. Following a week of chaos and misery, as Prime Minister Boris Johnson refused to leave Downing Street despite it being abundantly clear to virtually everyone…", "url": "https://www.cnn.com/2022/07/08/uk/what-next-after-boris-johnson-analysis-intl-gbr-cmd/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220707125520-05-boris-johnson-resignation-0707.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-08T09:54:52Z", "content": "Conservative members of the British Parliament woke up on Friday morning with one hell of a hangover. \r\nFollowing a week of chaos and misery, as Prime Minister Boris Johnson refused to leave Downing … [+5446 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Issy Ronald, CNN", "title": "USWNT qualifies for 2023 FIFA Women's World Cup", "description": "On July 7, 2019, the US Women's National Team (USWNT) won a record fourth World Cup title, confirming its dominance over the women's game.", "url": "https://www.cnn.com/2022/07/08/football/us-women-soccer-qualify-world-cup-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220708043410-03-us-women-soccer-qualify-world-cup-restricted-super-tease.jpg", "publishedAt": "2022-07-08T09:53:33Z", "content": "(CNN)On July 7, 2019, the US Women's National Team (USWNT) won a record fourth World Cup title, confirming its dominance over the women's game.\r\nThree years later, on July 7, 2022, the USA took its f… [+1972 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Nicola Chilton, CNN", "title": "What it's like to land on the world's shortest commercial runway", "description": "Thanks to steep cliffs and steep slops, flying into the tiny Caribbean island of Saba isn't for the faint hearted. But Juancho E. Yrausquin Airport, clinging to Saba's only bit of flat land, is proof that it can be done.", "url": "https://www.cnn.com/travel/article/saba-airport-shortest-commercial-runway/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220706130157-09-saba-juancho-e-yrausquin-airport-super-tease.jpg", "publishedAt": "2022-07-08T09:35:50Z", "content": "(CNN) Flying into Saba isn't for the faint hearted. The vertiginous slopes and sea cliffs of this five-square-mile island in the Caribbean don't leave much space to land a plane. But Juancho E. Yraus… [+7311 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul Adepoju", "title": "Africa's next big thing will be its tech startups, says prolific investor", "description": "Serial entrepreneur and investor Akintoye Akindele believes Africa's tech sector can compete on the global stage.", "url": "https://www.cnn.com/2022/07/08/africa/akintoye-akindele-tech-industry-intl-cmd/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220708103654-02-akintoye-akindele-card-2.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-08T09:33:35Z", "content": "Akintoye Akindele is a man on a mission to build a new Africa and he is not afraid to fail to get there.\r\nChanging the continents narrative will entail solving old problems while also harnessing the … [+5218 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeremy Diamond, CNN", "title": "White House 'shocked and saddened' over Abe shooting", "description": "The White House is \"shocked and saddened to hear about the violent attack against former Japanese Prime Minister Shinzo Abe,\" a White House spokesperson tells CNN.", "url": "https://www.cnn.com/2022/07/08/politics/white-house-shinzo-abe/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211201004634-shinzo-abe-file-12242020-restricted-super-tease.jpg", "publishedAt": "2022-07-08T09:31:42Z", "content": "Washington (CNN)The White House is \"shocked and saddened to hear about the violent attack against former Japanese Prime Minister Shinzo Abe,\" a White House spokesperson tells CNN.\r\n\"We are closely mo… [+250 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Former Japanese Prime Minister Shinzo Abe dead at 67", "description": "Japan's former Prime Minister Shinzo Abe has died after being shot during a campaign speech Friday in Nara, central Japan. He was 67.", "url": "https://www.cnn.com/2022/07/08/asia/shinzo-abe-former-japan-pm-death-intl-hnk/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220707231111-04-shinzo-abe-070722-file.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-08T09:15:23Z", "content": "Japans former Prime Minister Shinzo Abe has died after being shot during a campaign speech Friday in Nara, public broadcaster NHK reported, quoting sources within the ruling Liberal Democratic Party … [+6236 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Annie Grayer, Zachary Cohen and Ryan Nobles, CNN", "title": "Pat Cipollone to meet with January 6 committee behind closed doors Friday", "description": "The House select committee investigating the January 6, 2021, insurrection is expected to ask Trump White House Counsel Pat Cipollone during a closed-door interview on Friday about what he witnessed in the waning days of Donald Trump's administration when the…", "url": "https://www.cnn.com/2022/07/08/politics/pat-cipollone-january-6-committee/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220629185458-pat-cipollone-file-032920-super-tease.jpg", "publishedAt": "2022-07-08T09:12:57Z", "content": "(CNN)The House select committee investigating the January 6, 2021, insurrection is expected to ask Trump White House Counsel Pat Cipollone during a closed-door interview on Friday about what he witne… [+6309 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Helen Regan And Junko Ogura", "title": "Former Japanese Prime Minister Shinzo Abe dies following shooting, public broadcaster says", "description": "Former Japanese Prime Minister Shinzo Abe died on Friday after being shot while giving a campaign speech on a street in central Japan, public broadcaster NHK reported, citing ruling Liberal Democratic Party sources.", "url": "https://www.cnn.com/2022/07/08/asia/japan-shinzo-abe-dies-shooting-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220707210753-shinzo-abe-speaks-in-nara-0708-super-tease.jpg", "publishedAt": "2022-07-08T09:04:53Z", "content": "Tokyo (CNN)Former Japanese Prime Minister Shinzo Abe died on Friday after being shot while giving a campaign speech on a street in central Japan, public broadcaster NHK reported, citing ruling Libera… [+67 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi", "title": "California to make its own low-cost insulin, governor says", "description": "California will begin making its own low-cost insulin in an effort to make it more financially accessible amid soaring prices for the life-saving medication, Gov. Gavin Newsom announced Thursday.", "url": "https://www.cnn.com/2022/07/08/us/california-makes-own-insulin/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220708041443-01-california-makes-own-insulin-file.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-08T08:50:49Z", "content": "California will begin making its own low-cost insulin in an effort to make it more financially accessible amid soaring prices for the life-saving medication, Gov. Gavin Newsom announced Thursday.\r\nTh… [+1290 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/helen-regan\">Helen Regan</a>, CNN", "title": "Russia's war in Ukraine", "description": "Ukrainian President Zelensky told CNN that Ukraine is unwilling to cede any of its land to Russia, standing firm that a concession of Ukrainian territory won't be part of any diplomatic negotiations to end the war. Follow here for live updates. Ukrain", "url": "https://www.cnn.com/europe/live-news/russia-ukraine-war-news-07-08-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220707090328-01-kramatorsk-ukraine-missile-strike-0707-super-tease.jpg", "publishedAt": "2022-07-08T07:58:06Z", "content": "The release of a Russian ship allegedly carrying stolen Ukrainian grain from Turkish waters is \"unacceptable,\" the Ukrainian Foreign Ministry said.\r\nTurkey ignored a request to arrest the vessel and … [+2268 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nectar Gan", "title": "Japan's strict gun laws make shootings rare", "description": "The shooting of former Japanese Prime Minister Shinzo Abe has shocked Japan, a country with one of the world's lowest rates of gun crime due to its strict laws on gun ownership.", "url": "https://www.cnn.com/2022/07/08/asia/japan-gun-laws-abe-shooting-intl-hnk/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220708062848-09-abe-shooting-gallery.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-08T07:38:07Z", "content": "The shooting of former Japanese Prime Minister Shinzo Abe has shocked Japan, a country with one of the worlds lowest rates of gun crime due to its strict laws on gun ownership.\r\nAbe was shot on Frida… [+2952 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Brad Lendon, CNN", "title": "China is relentlessly trying to peel away Japan's resolve in disputed islands", "description": "For all the speculation of quick military action by China to achieve its foreign policy goals, Beijing's track record has been more akin to peeling an onion, slowly and deliberately pulling back layers to reach a goal at the center.", "url": "https://www.cnn.com/2022/07/08/asia/japan-china-senkaku-islands-ships-intl-hnk-mic-ml/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220707214747-01-japan-china-senkaku-islands-ships-super-tease.jpg", "publishedAt": "2022-07-08T07:24:31Z", "content": "Editor's Note: A version of this story appeared in CNN's Meanwhile in China newsletter, a three-times-a-week update exploring what you need to know about the country's rise and how it impacts the wor… [+6774 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, Josh Campbell and Yon Pomrenze, CNN", "title": "Highland Park shooter's rooftop position made it difficult for officers to find him quickly as parade turned into chaos, police chief says", "description": "New details have emerged describing a scene filled with fear and chaos as a 21-year-old gunman opened fire during a Fourth of July parade in a Chicago suburb, where seven people were killed and dozens of others wounded.", "url": "https://www.cnn.com/2022/07/08/us/highland-park-illinois-shooting-july-fourth-parade-friday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220708021150-01-highland-park-illinois-shooting-july-fourth-parade-friday-restricted-super-tease.jpg", "publishedAt": "2022-07-08T07:00:19Z", "content": "Highland Park, Illinois (CNN)New details have emerged describing a scene filled with fear and chaos as a 21-year-old gunman opened fire during a Fourth of July parade in a Chicago suburb, where seven… [+6516 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Megan C. Hills, CNN", "title": "'Leisure, pleasure and good taste': How nautical fashion captivated the world", "description": "The image of Britain's Prince Louis dressed in a miniature sailor suit was one of the standout moments of the recent Platinum Jubilee celebrations. Photographed screaming with his hands pressed over his ears as fighter jets roared above the Buckingham Palace …", "url": "https://www.cnn.com/style/article/nautical-fashion-history/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220615112224-03-nautical-fashion-super-tease.jpg", "publishedAt": "2022-07-08T06:24:21Z", "content": "The image of Britain's Prince Louis dressed in a miniature sailor suit was one of the standout moments of the recent Platinum Jubilee celebrations. Photographed screaming with his hands pressed over … [+7861 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "In photos: Former Japanese Prime Minister Shinzo Abe shot", "description": "Former Japanese Prime Minister Shinzo Abe has been rushed to hospital after he was shot in the chest during a speech in Nara, Japan, public broadcaster NHK reported, citing an official of the Liberal Democratic Party. Abe was conscious and responsive while be…", "url": "https://www.cnn.com/2022/07/08/world/gallery/shinzo-abe-shot/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220708053105-01-abe-shooting-gallery-super-tease.jpg", "publishedAt": "2022-07-08T05:45:46Z", "content": "Former Prime Minister Shinzo Abe speaks moments before being shot in front of Yamatosaidaiji Station in Nara, Japan, on July 8.\r\nUpdated 1:45 AM ET, Fri July 8, 2022\r\nFormer Prime Minister Shinzo Abe… [+476 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Emiko Jozuka, CNN", "title": "Kazuki Takahashi, creator of hit manga 'Yu-Gi-Oh!', dies age 60", "description": "Kazuki Takahashi, the creator of the international hit manga series and trading card game Yu-Gi-Oh!, was found dead on Wednesday. Takahashi's body was recovered off the coast of Okinawa in southern Japan, a coast guard official in the city of Nago told CNN.", "url": "https://www.cnn.com/style/article/kazuki-takahashi-obit-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220707224809-01-kazuki-takahashi-obit-file-restricted-super-tease.jpg", "publishedAt": "2022-07-08T04:26:44Z", "content": "arts\r\nKazuki Takahashi, the creator of the international hit manga series and trading card game \"Yu-Gi-Oh!\", was found dead on Wednesday. He was 60.\r\nTakahashi's body was recovered off the coast of O… [+2439 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Raja Razek, CNN", "title": "Woman accused of killing elite cyclist used passport that belonged to someone 'closely associated' with her to flee to Costa Rica, authorities say", "description": "The woman who fled to Costa Rica after allegedly killing an elite cyclist in Texas used several aliases and a passport that belongs to someone \"closely associated with her,\" a spokesperson for the US Marshals Service said Thursday.", "url": "https://www.cnn.com/2022/07/08/us/kaitlin-armstrong-investigation-passport/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220707215605-02-kaitlin-armstrong-screengrab-super-tease.jpg", "publishedAt": "2022-07-08T04:18:49Z", "content": "(CNN)The woman who fled to Costa Rica after allegedly killing an elite cyclist in Texas used several aliases and a passport that belongs to someone \"closely associated with her,\" a spokesperson for t… [+3163 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/jessie-yeung\">Jessie Yeung</a> and <a href=\"/profiles/helen-regan\">Helen Regan</a>, CNN", "title": "Former Japanese PM Shinzo Abe hospitalized after possible shooting", "description": "Shinzo Abe, the former Prime Minister of Japan, was rushed to the hospital on Friday afternoon after a possible shooting during a speech in the city of Nara, according to public broadcaster NHK.", "url": "https://www.cnn.com/asia/live-news/shinzo-abe-japan-pm-collapses-nara-07-08-22-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220707201524-05-shinzo-abe-070722-file-super-tease.jpg", "publishedAt": "2022-07-08T03:29:29Z", "content": "Shinzo Abe, the former Prime Minister of Japan, was rushed to the hospital on Friday afternoon after a possible shooting during a speech in the city of Nara, according to public broadcaster NHK.\r\nNar… [+108 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Helen Regan, CNN", "title": "Former Japanese Prime Minister Shinzo Abe rushed to hospital after possible shooting, NHK reports", "description": "Former Japanese Prime Minister Shinzo Abe has been rushed to hospital following a possible shooting during a speech in Nara, Japan, public broadcaster NHK reports.", "url": "https://www.cnn.com/2022/07/07/asia/shinzo-abe-japan-nara-shooting-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220707225323-01-shinzo-abe-070722-file-restricted-super-tease.jpg", "publishedAt": "2022-07-08T03:16:13Z", "content": "(CNN)Former Japanese Prime Minister Shinzo Abe has been rushed to hospital following a possible shooting during a speech in Nara, Japan, public broadcaster NHK reports.\r\nThis is a breaking story more… [+10 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Taylor Romine, CNN", "title": "Boudin opponent named to replace him as San Francisco district attorney", "description": "Brooke Jenkins, a former prosecutor in the San Francisco District Attorney's Office and a vocal opponent of Chesa Boudin, has been named as the new district attorney to replace him.", "url": "https://www.cnn.com/2022/07/07/politics/san-francisco-district-attorney-chesa-boudin-brooke-jenkins/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220707190616-brooke-jenkins-0707-super-tease.jpg", "publishedAt": "2022-07-08T02:14:58Z", "content": "(CNN)Brooke Jenkins, a former prosecutor in the San Francisco District Attorney's Office and a vocal opponent of Chesa Boudin, has been named as the new district attorney to replace him. \r\nBoudin was… [+2955 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Liam Reilly, CNN", "title": "Officer who fatally shot Tamir Rice sworn in and resigned from new law enforcement position in the same week, official says", "description": "Timothy Loehmann, the former Cleveland, Ohio, police officer who fatally shot 12-year-old Tamir Rice in 2014, resigned from his law enforcement position in Tioga Borough, Pennsylvania, days after he was sworn in, a borough official told CNN Thursday.", "url": "https://www.cnn.com/2022/07/07/us/tamir-rice-officer-resigns-law-enforcement-position/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201229203045-tamir-rice-file-super-tease.jpg", "publishedAt": "2022-07-08T02:04:03Z", "content": "(CNN)Timothy Loehmann, the former Cleveland, Ohio, police officer who fatally shot 12-year-old Tamir Rice in 2014, resigned from his law enforcement position in Tioga Borough, Pennsylvania, days afte… [+2147 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hilary Whiteman, CNN", "title": "How a dirty flip-flop could cause catastrophe in Australia", "description": "It's winter in Australia and for the first time in three years thousands of residents are flying to the Indonesian island of Bali to spend the July school holidays basking in the sun.", "url": "https://www.cnn.com/2022/07/07/australia/australia-indonesia-foot-and-mouth-disease-intl-hnk-dst/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220707144650-tourists-sandals-file-restricted-050622-super-tease.jpg", "publishedAt": "2022-07-08T01:34:53Z", "content": "Brisbane, Australia (CNN)It's winter in Australia and for the first time in three years thousands of residents are flying to the Indonesian island of Bali to spend the July school holidays basking in… [+7980 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Lilit Marcus, CNN", "title": "Why this woman recreates the journeys of history's greatest female explorers", "description": "Elise Wortley follows in the footsteps of celebrated women explorers of the past century, wearing the clothes they once wore to help highlight their achievements despite the hardships and obstacles they faced.", "url": "https://www.cnn.com/travel/article/elise-wortley-woman-with-altitude-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220705084628-02-body-elise-wortley-mountain-climber-super-tease.jpg", "publishedAt": "2022-07-08T01:11:01Z", "content": "Editor's Note Monthly Ticket is a CNN Travel series that spotlights some of the most fascinating topics in the travel world. In July, we're hitting the trails to explore the world's greatest hikes.\r\n… [+5405 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacob Lev, CNN", "title": "Las Vegas Raiders hire Sandra Douglass Morgan as first Black female president in NFL history", "description": "The Las Vegas Raiders have hired Sandra Douglass Morgan as team president, making her the first Black woman in that position for an NFL team.", "url": "https://www.cnn.com/2022/07/07/sport/nfl-raiders-president-first-black-woman-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220707203937-01-sandra-douglass-morgan-070722-super-tease.jpg", "publishedAt": "2022-07-08T00:56:11Z", "content": "(CNN)The Las Vegas Raiders have hired Sandra Douglass Morgan as team president, making her the first Black woman in that position for an NFL team.\r\nIn a news conference at Allegiant Stadium in Las Ve… [+3305 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Samantha Beech and Zenebou Sylla, CNN", "title": "Connecticut officials announce reforms after Randy Cox was partially paralyzed in a police van", "description": "After Randy Cox suffered an injury in the back of a New Haven police van that left him partially paralyzed, officials in the Connecticut city have announced a series of reforms and police training requirements that include mandating the use of seatbelts in pr…", "url": "https://www.cnn.com/2022/07/07/us/connecticut-randy-cox-reforms-police-vans/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220629144819-randy-cox-inside-police-van-super-tease.jpg", "publishedAt": "2022-07-08T00:50:00Z", "content": "(CNN)After Randy Cox suffered an injury in the back of a New Haven police van that left him partially paralyzed, officials in the Connecticut city have announced a series of reforms and police traini… [+4906 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Joshua A. Douglas", "title": "Opinion: The dangerous election theory the Supreme Court may be poised to endorse", "description": "The US Supreme Court is poised to take up a case with the potential to profoundly reshape American life -- this time at the ballot box. The case, Moore v. Harper, could make it easier for political incumbents to entrench themselves in office and could even pu…", "url": "https://www.cnn.com/2022/07/07/opinions/supreme-court-2024-elections-north-carolina-douglas/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220520094415-us-supreme-court-building-0503-super-tease.jpg", "publishedAt": "2022-07-08T00:34:16Z", "content": "Joshua A. Douglas is a professor at the University of Kentucky J. David Rosenberg College of Law. He is the author of Vote for US: How to Take Back Our Elections and Change the Future of Voting. Foll… [+7782 chars]"}]}