{"status": "ok", "totalResults": 91, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Hamdi Alkhshali, Aqeel Najim, Obaida Nafaa, Alex Stambaugh, Ivana Kottasová", "title": "Dozens injured in clashes around Baghdad's Green Zone as demonstrators storm Iraq's parliament", "description": "Dozens of people have been injured in Baghdad on Saturday after protesters rallying against the nomination of a new prime minister managed to breach the Iraqi capital's heavily fortified Green Zone for the second time this week.", "url": "https://www.cnn.com/2022/07/30/middleeast/iraq-protests-baghdad-parliament-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220730070221-02-iraq-parliament-protest-0730.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-30T12:19:18Z", "content": "Dozens of people have been injured in Baghdad on Saturday after protesters rallying against the nomination of a new prime minister managed to breach the Iraqi capitals heavily fortified Green Zone fo… [+2804 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nouran Salahieh, Zoe Sottile and Renée Rigdon, CNN", "title": "See where shark attacks are happening across the US", "description": "In the last 30 years, global unprovoked shark attacks have on average trended upward.", "url": "https://www.cnn.com/2022/07/30/us/map-where-are-shark-attacks-us/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220729162927-hp-only-20220729-shark-regional-map-hp-super-tease.png", "publishedAt": "2022-07-30T12:05:04Z", "content": "By Nouran Salahieh, Zoe Sottile and Renée Rigdon, CNN\r\nUpdated 8:05 AM ET, Sat July 30, 2022\r\n (CNN)When it comes to shark attacks, Florida typically tops global charts. But recently, New York has be… [+6817 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Allison Morrow, CNN Business", "title": "Why some people actually want a recession (and others say that's crazy)", "description": "The US economy is on a knife's edge, potentially already in a recession after a second quarter of shrinking activity. But indicators are mixed, fueling uncertainty about the way forward.", "url": "https://www.cnn.com/2022/07/30/economy/inflation-or-recession-economy/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220725104423-us-consumer-spending-0716-restricted-super-tease.jpg", "publishedAt": "2022-07-30T11:09:41Z", "content": "New York (CNN Business)The US economy is on a knife's edge, potentially already in a recession after a second quarter of shrinking activity. But indicators are mixed, fueling uncertainty about the wa… [+5852 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Scottie Andrew, CNN", "title": "12 Black queer icons that inspired Beyoncé on 'Renaissance'", "description": "Beyoncé's newest album, \"Renaissance,\" is a musical triumph that signals the next great phase of the superstar's career -- and she's taking the Black queer icons who pioneered house music with her.", "url": "https://www.cnn.com/2022/07/30/entertainment/beyonce-renaissance-black-queer-influences-cec/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220729135337-beyonce-0327-file-super-tease.jpg", "publishedAt": "2022-07-30T10:07:41Z", "content": "(CNN)Beyoncé's newest album, \"Renaissance,\" is a musical triumph that signals the next great phase of the superstar's career -- and she's taking the Black queer icons who pioneered house music with h… [+8978 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Veronica Stracqualursi, CNN", "title": "These are the next states that could call special sessions to limit abortion rights", "description": "The overturning of Roe v. Wade gives the green light to Republican-led states to pass stricter abortion laws, and several legislatures, rather than wait for the traditional legislative season to begin in the fall, are calling extraordinary sessions this summe…", "url": "https://www.cnn.com/2022/07/30/politics/abortion-special-session-states/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220729114650-01-indiana-abortion-protests-super-tease.jpg", "publishedAt": "2022-07-30T10:02:40Z", "content": "(CNN)The overturning of Roe v. Wade gives the green light to Republican-led states to pass stricter abortion laws, and several legislatures, rather than wait for the traditional legislative season to… [+5259 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Maureen O'Hare, CNN", "title": "Travel news: Close encounters with sharks, monk seals and jellyfish", "description": "In travel news this week, Spain is offering free train journeys, Southwest Airlines is making its vouchers valid forever, and we take a look at the world's greatest hiking trails and Iceland's best bathing spots.", "url": "https://www.cnn.com/travel/article/pandemic-travel-news-greatest-hikes-iceland-bathing/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220726065633-video-thumbnail-israel-jellyfish-1-super-tease.jpg", "publishedAt": "2022-07-30T09:35:32Z", "content": "(CNN) In travel news this week, Spain is offering free train journeys, Southwest Airlines is making its vouchers valid forever, and we take a look at the world's greatest hiking trails and Iceland's … [+3408 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi and Andy Rose, CNN", "title": "Death toll from Kentucky flooding 'could potentially double' as people in stricken areas remain hard to reach, governor says", "description": "After days of fatal flooding washed away parts of eastern Kentucky and claimed the lives of at least 16 people, first responders will continue working Saturday to account for missing residents, the state's governor said.", "url": "https://www.cnn.com/2022/07/30/weather/kentucky-appalachia-flooding-saturday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220730012154-02-kentucky-flooding-saturday-restricted-super-tease.jpg", "publishedAt": "2022-07-30T08:45:04Z", "content": "(CNN)After days of fatal flooding washed away parts of eastern Kentucky and claimed the lives of at least 16 people, first responders will continue working Saturday to account for missing residents, … [+5424 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte, CNN", "title": "This doctor reversed heart disease. Now he wants to do it for Alzheimer's", "description": "Using a strict vegan diet, exercise, stress reduction and social support, Dr. Dean Ornish reversed heart disease in a 1990 clinical trial. Today he's trying to use the same approach on dementia.", "url": "https://www.cnn.com/2022/07/30/health/dean-ornish-lifestyle-study-alzheimers-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220516142927-01-reversing-alzheimers-life-itself-wellness-super-tease.jpg", "publishedAt": "2022-07-30T07:04:27Z", "content": "(CNN)In 1990, internal medicine specialist Dr. Dean Ornish did what no other doctor had been able to do: He published results of a randomized clinical trial that used advanced imagery scans to show c… [+7275 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Zoe Sottile, CNN", "title": "This Ivy League school will welcome its first female president after more than 250 years", "description": "Dartmouth College, one of the oldest and most prestigious universities in the United States, is set to welcome its first-ever female president: Sian Leah Beilock, the current president of Barnard College.", "url": "https://www.cnn.com/2022/07/30/us/sian-beilock-dartmouth-new-president-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220728141359-sian-beilock-super-tease.jpg", "publishedAt": "2022-07-30T06:03:23Z", "content": "(CNN)Dartmouth College, one of the oldest and most prestigious universitiesin the United States, is set to welcome its first-ever female president: SianLeah Beilock, the current president of Barnard … [+1673 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Faith Karimi", "title": "Chris Rock jokes he was 'smacked by Suge Smith' after Will Smith apology video", "description": "Chris Rock is still not saying how he feels about getting slapped by Will Smith, but he is still making passing jokes about the incident.", "url": "https://www.cnn.com/2022/07/29/entertainment/chris-rock-will-smith-apology-cec/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220729115000-will-smith-oscars-slap-comments-restricted.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-30T02:54:38Z", "content": "Chris Rock is still not saying how he feels about getting slapped by Will Smith, but he is still making passing jokes about the incident.\r\nThe comedian was on stage in Atlanta on Friday night as part… [+2463 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nick Valencia, CNN", "title": "First on CNN: Louisiana prosecutor in Ronald Greene case gets case file from federal investigators", "description": "The local Louisiana district attorney with jurisdiction over the town where Ronald Greene died following an interaction with state troopers said he has now received the federal case file and has begun reviewing their investigative reports.", "url": "https://www.cnn.com/2022/07/29/us/ronald-greene-louisiana-da-case-file/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220729220351-01-ronald-greene-louisiana-da-case-file-super-tease.jpg", "publishedAt": "2022-07-30T02:13:22Z", "content": "(CNN)The local Louisiana district attorney with jurisdiction over the town where Ronald Greene died following an interaction with state troopers said he has now received the federal case file and has… [+2644 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Spain reports first monkeypox-related death in Europe", "description": "Spain reported its first monkeypox-related death on Friday, in what is thought to be Europe's first death from the disease and only the second outside Africa in the current outbreak.", "url": "https://www.cnn.com/2022/07/29/europe/spain-first-monkeypox-death-europe-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220729211914-monkeypox-spain-file-060122-super-tease.jpg", "publishedAt": "2022-07-30T01:56:03Z", "content": "Madrid, Spain (Reuters)Spain reported its first monkeypox-related death on Friday, in what is thought to be Europe's first fatality from the disease and only the second outside Africa in the current … [+729 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eric Cheung, CNN", "title": "What does Taiwan think about the possibility of a visit by Nancy Pelosi?", "description": "Reports that US House Speaker Nancy Pelosi is planning a visit to Taiwan have sparked tense exchanges between the United States and China -- but the island itself has been far less vocal.", "url": "https://www.cnn.com/2022/07/29/china/pelosi-visit-what-taiwan-thinks-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220729115045-05-pelosi-visit-taiwan-super-tease.jpg", "publishedAt": "2022-07-30T01:17:40Z", "content": "Taipei, Taiwan (CNN)Reports that US House Speaker Nancy Pelosi is planning a visit to Taiwan have sparked tense exchanges between the United States and China -- and growing speculation over how Beiji… [+6081 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Caroll Alvarado, Sharif Paget and Christina Maxouris, CNN", "title": "A 17-year-old swam out of her flooded home with her dog and waited for hours on a roof to be rescued", "description": "Early Thursday morning, 17-year-old Chloe Adams woke up to a nightmare. Rushing waters were coming out of the bathroom drains, bubbling up through the kitchen tiles and quickly surrounding her home.", "url": "https://www.cnn.com/2022/07/29/us/kentucky-floods-teenager-roof-rescue/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220729154750-chloe-adams-super-tease.jpg", "publishedAt": "2022-07-30T00:56:29Z", "content": "(CNN)Early Thursday morning, 17-year-old Chloe Adams woke up to a nightmare. Rushing waters were coming out of the bathroom drains, bubbling up through the kitchen tiles and quickly surrounding her h… [+2478 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oliver Darcy, CNN Business", "title": "Alex Jones' company files for bankruptcy amid Texas trial to award damages to Sandy Hook families - CNN", "description": "Right-wing conspiracy theorist Alex Jones' primary company filed for bankruptcy protection on Friday, an unexpected move that comes as a trial is underway in Texas to determine how much in damages he will have to pay the families of two Sandy Hook victims who…", "url": "https://www.cnn.com/2022/07/29/media/alex-jones-free-speech-systems-bankruptcy/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220729191335-alex-jones-file-072822-super-tease.jpg", "publishedAt": "2022-07-30T00:12:00Z", "content": "New York (CNN Business)Right-wing conspiracy theorist Alex Jones' primary company filed for bankruptcy protection on Friday, an unexpected move that comes as a trial is underway in Texas to determine… [+3437 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Wayne Chang, CNN", "title": "Lessons from Ukraine prompt top Taiwan museum to conduct 'wartime response' exercises", "description": "Taiwan's National Palace Museum, which boasts one of the world's finest collections of Chinese imperial relics, is actively considering how it would protect its treasures if Beijing launched an attack.", "url": "https://www.cnn.com/style/article/taiwan-national-palace-museum-exercise-artifacts-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220728095112-01-taiwan-national-palace-museum-restricted-super-tease.jpg", "publishedAt": "2022-07-29T23:57:58Z", "content": "arts\r\nIn March, amid growing fears of a Russian attack on Ukraine's cultural capital Lviv, staff at the city's National Museum frantically packed up and hid thousands of its treasures. \r\nNow, more th… [+6380 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jen Christensen, CNN", "title": "Frustration builds in LGBTQ community over government response to monkeypox", "description": "When Samuel Garrett-Pate went to get a monkeypox vaccine a couple of weeks ago, it took hours in line, filling out paperwork, running home to get more paperwork and standing in line again at the Los Angeles County Public Health Department. In total, he says, …", "url": "https://www.cnn.com/2022/07/29/health/monkeypox-lgbtq-slow-response/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220721142208-monkeypox-vaccine-los-angeles-0720-super-tease.jpg", "publishedAt": "2022-07-29T23:21:17Z", "content": "(CNN)When Samuel Garrett-Pate went to get a monkeypox vaccine a couple of weeks ago, it took hours in line, filling out paperwork, running home to get more paperwork and standing in line again atthe … [+12683 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Fredreka Schouten", "title": "Wisconsin activist says he committed voter fraud to expose potential voter fraud", "description": "The Wisconsin Elections Commission plans to meet next week to consider making a criminal referral against a Racine County man who has admitted ordering absentee ballots in the names of other voters in what he says was an effort to expose vulnerabilities in th…", "url": "https://www.cnn.com/2022/07/29/politics/wisconsin-voter-fraud-harry-wait/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220729154752-harry-wait.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-29T23:06:57Z", "content": "The Wisconsin Elections Commission plans to meet next week to consider making a criminal referral against a Racine County man who ordered absentee ballots in the names of a top state lawmaker and oth… [+1999 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Justin Gamble, CNN", "title": "Oklahoma's board of education downgrades school district's accreditation over complaint that training shamed White people", "description": "Just weeks after Oklahoma's governor called for a special audit of Tulsa Public Schools (TPS), the State Board of Education voted to downgrade the district's accreditation status for violating a law that restricts teachings on race and gender.", "url": "https://www.cnn.com/2022/07/29/us/crt-tulsa-school-accreditation-status-downgrade-reaj/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220729155015-tulsa-school-downgraded-crt-super-tease.jpg", "publishedAt": "2022-07-29T23:06:12Z", "content": "(CNN)Just weeks after Oklahoma's governor called for a special audit of Tulsa Public Schools (TPS), the State Board of Education voted to downgrade the district's accreditation status for violating a… [+4187 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tierney Sneed and Holmes Lybrand, CNN", "title": "Man arrested after alleged bomb threat against Arizona election official", "description": "A Massachusetts man was arrested Friday after being indicted by a grand jury for allegedly making a bomb threat last year towards an election official in the Arizona's Secretary of State office.", "url": "https://www.cnn.com/2022/07/29/politics/arizona-election-bomb-threat/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210311172423-01-arizona-voting-election-day-2020-super-tease.jpg", "publishedAt": "2022-07-29T21:24:14Z", "content": "(CNN)A Massachusetts man was arrested Friday after being indicted by a grand jury for allegedly making a bomb threat last year towards an election official in the Arizona's Secretary of State office.… [+3422 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rob Frehse, CNN", "title": "Four dead, including three children, and eight children injured in tractor accident in Pennsylvania", "description": "Four people are dead, including three children, after a tractor towing a flatbed-type utility trailer carrying 12 people rolled over Friday morning in southeastern Pennsylvania, state police said.", "url": "https://www.cnn.com/2022/07/29/us/four-dead-three-children-dead-tractor-accident-pennsylvania/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220729133652-pa-tractor-accident-super-tease.jpg", "publishedAt": "2022-07-29T21:18:26Z", "content": "(CNN)Four people are dead, including three children, after a tractor towing a flatbed-type utility trailer carrying 12 people rolled over Friday morning in southeastern Pennsylvania, state police sai… [+1170 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jasmine Wright", "title": "Kamala Harris' director of public engagement is leaving his role", "description": "Vice President Kamala Harris' director of public engagement and intergovernmental affairs is leaving his position, a White House official told CNN.", "url": "https://www.cnn.com/2022/07/29/politics/michael-collins-kamala-harris/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220316151345-01-kamala-harris-covid-file.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-29T21:14:29Z", "content": "Vice President Kamala Harris director of public engagement and intergovernmental affairs is leaving his position, a White House official told CNN.\r\nMichael Collins announced his departure in a letter… [+649 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeremy Diamond, CNN", "title": "Kushner recounts Jeff Sessions' attempts to block Trump's landmark criminal justice reform bill", "description": "Recounting his year-long effort to pass the First Step Act, Jared Kushner in his forthcoming memoir describes the numerous and ultimately unsuccessful efforts by then-Attorney General Jeff Sessions to thwart the landmark criminal justice reform legislation.", "url": "https://www.cnn.com/2022/07/29/politics/jeff-sessions-jared-kushner-criminal-justice-reform/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220729154232-jeff-sessions-2018-file-super-tease.jpg", "publishedAt": "2022-07-29T20:04:08Z", "content": "(CNN)Recounting his year-long effort to pass the First Step Act, Jared Kushner in his forthcoming memoir describes the numerous and ultimately unsuccessful efforts by then-Attorney General Jeff Sessi… [+2578 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Whitney Wild, Zachary Cohen, Jeremy Herb, Priscilla Alvarez", "title": "Exclusive: DHS inspector general knew of missing Secret Service texts months earlier than previously known", "description": "The embattled inspector general for the Department of Homeland Security first learned of missing Secret Service text messages in May 2021 -- months earlier than previously known and more than a year before he alerted the House select committee investigating J…", "url": "https://www.cnn.com/2022/07/29/politics/secret-service-missing-texts-january-6-dhs-inspector-general/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220720083538-01-us-secret-service-january-6-2021.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-29T20:01:03Z", "content": "The embattled inspector general for the Department of Homeland Security first learned of missing Secret Service text messages in May 2021 months earlier than previously known and more than a year bef… [+10271 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Raja Razek, CNN", "title": "Former NFL player indicted for murder of his girlfriend, Harris County DA says", "description": "Former NFL player Kevin Ware has been indicted on charges of murder and tampering with evidence, specifically a corpse, in the death of his girlfriend, Taylor Pomaski, who disappeared in 2021, according to a news release from the Harris County District Attorn…", "url": "https://www.cnn.com/2022/07/29/us/kevin-ware-indicted-murder-girlfriend/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220729123632-kevin-ware-montgomery-county-sheriffs-office-super-tease.jpg", "publishedAt": "2022-07-29T19:49:14Z", "content": "(CNN)Former NFL player Kevin Ware has been indicted on charges of murder and tampering with evidence, specifically a corpse, in the death of his girlfriend, Taylor Pomaski, who disappeared in 2021, a… [+1467 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oliver Darcy, CNN Business", "title": "Bill Barr subpoenaed by voting tech company Smartmatic in company's defamation lawsuit against Fox News", "description": "Voting technology company Smartmatic on Thursday subpoenaed former Attorney General Bill Barr in its $2.7 billion defamation lawsuit against Fox News, demanding he turn over any communications with the right-wing television channel's personalities, executives…", "url": "https://www.cnn.com/2022/07/29/media/bill-barr-smartmatic-subpoena/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220729150522-william-barr-file-restricted-super-tease.jpg", "publishedAt": "2022-07-29T19:14:54Z", "content": "New York (CNN Business)Voting technology company Smartmatic on Thursday subpoenaed former Attorney General Bill Barr in its $2.7 billion defamation lawsuit against Fox News, demanding he turn over an… [+1639 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Payton Major and Judson Jones, CNN", "title": "Extreme heat, flash drought and more flash flooding are all on tap this weekend. See if you're affected", "description": "Heat alerts are extended through Sunday in the Pacific Northwest, flash-drought conditions will worsen across the southern Plains, and the Mid-South is bracing for more weekend rainfall following days of devastating floods.", "url": "https://www.cnn.com/2022/07/29/weather/weekend-forecast-heat-drought-floods/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220729083753-01-pacific-northwest-heat-0728-super-tease.jpg", "publishedAt": "2022-07-29T19:02:08Z", "content": "Drought often doesn't fall neatly into a region.\r\nFlash drought is hitting all of OK and large parts of KS, MO, TX, AR. Western KY/TN too.\r\nThis area has deteriorated extraordinarily fast, even for f… [+155 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Natasha Bertrand and Frederik Pleitgen, CNN", "title": "CNN Exclusive: Russian officials requested adding convicted murderer to Griner/Whelan prisoner swap", "description": "Russian government officials requested that a former colonel from the country's domestic spy agency who was convicted of murder in Germany last year be added to the US' proposed swap of a notorious arms dealer for Brittney Griner and Paul Whelan, multiple sou…", "url": "https://www.cnn.com/2022/07/29/politics/griner-whelan-russia-murderer-request/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220727120745-whelan-griner-split-super-tease.jpg", "publishedAt": "2022-07-29T19:00:23Z", "content": "(CNN)Russian government officials requested that a former colonel from the country's domestic spy agency who was convicted of murder in Germany last year be added to the US' proposed swap of a notori… [+3718 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tierney Sneed and Holmes Lybrand, CNN", "title": "Russian accused of influencing US political groups to interfere in elections is indicted", "description": "The Justice Department unveiled on Friday a conspiracy charge against a Russian national accused of working with FSB agents and using unnamed political groups in the US as foreign agents of Russia.", "url": "https://www.cnn.com/2022/07/29/politics/russian-influence-separatist-groups-charges/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220707132209-department-of-justice-building-super-tease.jpg", "publishedAt": "2022-07-29T18:34:47Z", "content": "(CNN)The Justice Department unveiled on Friday a conspiracy charge against a Russian national accused of working with FSB agents and using unnamed political groups in the US as foreign agents of Russ… [+4578 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "See what's streaming in August", "description": "A look at some of the shows and movies streaming on Netflix, Amazon, Hulu and Disney+ in August.", "url": "https://www.cnn.com/2022/07/29/entertainment/gallery/new-august-streaming-2022/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220722160534-23-house-of-the-dragon-super-tease.jpg", "publishedAt": "2022-07-29T18:34:00Z", "content": "Updated 2:34 PM ET, Fri July 29, 2022"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Colby Hentges, CNN", "title": "Must-watch videos of the week", "description": "Close encounters in the ocean, red glowing lights, and \"Harbingers of doom.\" These are the must-watch videos of the week.", "url": "https://www.cnn.com/2022/07/29/app-news-section/videos-of-the-week-mobile-july-29/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220724065345-great-white-shark-shark-week-discovery-super-tease.jpg", "publishedAt": "2022-07-29T18:15:33Z", "content": "(CNN)Close encounters in the ocean, red glowing lights, and \"Harbingers of doom.\" These are the must-watch videos of the week. \r\nClose encounter of the shark kind \r\nJeff Kurr, producer and director o… [+370 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Hansler, CNN", "title": "Blinken says he had 'frank' discussion with Russian foreign minister in first call since Ukraine war began", "description": "US Secretary of State Antony Blinken spoke with Russian Foreign Minister Sergey Lavrov on Friday, the top US diplomat said at a press conference.", "url": "https://www.cnn.com/2022/07/29/politics/blinken-lavrov-call/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210519120914-blinken-lavrov-split-super-tease.jpg", "publishedAt": "2022-07-29T17:15:47Z", "content": "Washington (CNN)US Secretary of State Antony Blinken spoke with Russian Foreign Minister Sergey Lavrov on Friday, the top US diplomat said at a press conference.\r\nHe said it was \"a frank and direct c… [+792 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eva McKend, Michael Warren", "title": "Warnock puts pressure on Walker to agree to debate in Georgia Senate race", "description": "Democratic Sen. Raphael Warnock of Georgia is turning up the heat on Herschel Walker, calling out his Republican opponent for so far refusing to agree to public debates before this fall's election.", "url": "https://www.cnn.com/2022/07/29/politics/raphael-warnock-herschel-walker-debates/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220729121533-warnock-walker-split.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-29T17:15:10Z", "content": "Democratic Sen. Raphael Warnock of Georgia is turning up the heat on Herschel Walker, calling out his Republican opponent for so far refusing to agree to public debates before this falls election.\r\nW… [+4824 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "How this tech giant is developing a more digital Africa", "description": "For Ola Williams, Microsoft Country Manager for Nigeria and Ghana, empowering women through tech training is furthering digital infrastructure development across the continent.", "url": "https://www.cnn.com/videos/business/2022/07/29/marketplace-africa-microsoft-ola-williams-nigeria-ghana-spc.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220729125033-marketplace-africa-microsoft-ola-williams-nigeria-ghana-spc-00003006-super-tease.png", "publishedAt": "2022-07-29T16:56:46Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Kara Alaimo", "title": "Opinion: While Oz is stoking fear, Fetterman is making us laugh", "description": "Pennsylvania Lt. Gov. John Fetterman has successfully shaped and controlled the narrative, even when he's been off the campaign trail for two months due to a life-threatening stroke, writes Kara Alaimo. It's an inspired approach, and she hopes other Democrats…", "url": "https://www.cnn.com/2022/07/29/opinions/fetterman-pennsylvania-twitter-strategy-alaimo/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220715114649-fetterman-oz-split-pennsylvania-senate-super-tease.jpg", "publishedAt": "2022-07-29T16:54:15Z", "content": "Kara Alaimo, an associate professor in the Lawrence Herbert School of Communication at Hofstra University, writes about issues affecting women and social media. She was spokeswoman for international … [+6319 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alicia Wallace, CNN Business", "title": "It's not just food and fuel: Inflation is impacting the cost of almost everything", "description": "In Queens, New York, Audra Fordin has seen some customers patch up and ride out a punctured tire only to be sideswiped by costlier repairs later.", "url": "https://www.cnn.com/2022/07/29/economy/us-inflation-prices-higher-everywhere/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220725121444-01-great-bear-auto-repair-flushing-queens-restricted-super-tease.jpeg", "publishedAt": "2022-07-29T16:51:48Z", "content": "By Alicia Wallace, CNN Business\r\nUpdated 12:51 PM ET, Fri July 29, 2022\r\nMinneapolis (CNN Business)Inflation has crept into practically every corner of Americans' lives.\r\nIn Queens, New York, auto re… [+8962 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Stefano Pozzebon, CNN", "title": "UK court rules in favor of Venezuelan opposition leader Juan Guaidó in battle for country's gold", "description": "London's High Court has ruled in favor of Venezuelan opposition leader Juan Guaidó in a battle for the control of gold reserves worth almost $2 billion held in the Bank of England, in a blow to Venezuela's authoritarian President, Nicolas Maduro.", "url": "https://www.cnn.com/2022/07/29/world/venezuelan-leader-juan-guaido-sovereign-gold-dispute-intl-scli/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220729104817-juan-guaido-0614-super-tease.jpg", "publishedAt": "2022-07-29T16:50:17Z", "content": "(CNN)London's High Court has ruled in favor of Venezuelan opposition leader Juan Guaidó in a battle for the control of gold reserves worth almost $2 billion held in the Bank of England, in a blow to … [+1571 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ariane de Vogue and Betsy Klein, CNN", "title": "Biden nominates lawyer who represented Mississippi abortion clinic at Supreme Court in Dobbs case for federal judgeship", "description": "President Joe Biden on Friday nominated Julie Rikelman, who argued the case for the Mississippi clinic before the Supreme Court in the case that led to the overturning of the landmark Roe v. Wade ruling, for a post on an US appeals court.", "url": "https://www.cnn.com/2022/07/29/politics/julie-rikelman-nomination-dobbs/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220729113650-julie-rikelman-1221-super-tease.jpg", "publishedAt": "2022-07-29T16:45:56Z", "content": "(CNN)President Joe Biden on Friday nominated Julie Rikelman, who argued the case for the Mississippi clinic before the Supreme Court in the case that led to the overturning of the landmark Roe v. Wad… [+1102 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ryan Nobles, CNN", "title": "Former acting DHS Secretary Chad Wolf has been interviewed by House January 6 committee", "description": "Chad Wolf, an acting secretary of the Department of Homeland Security during the Trump administration, has been interviewed by the House select committee investigating the January 6, 2021, insurrection, a source familiar with his deposition tells CNN.", "url": "https://www.cnn.com/2022/07/29/politics/chad-wolf-january-6-committee-meeting/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200921105907-02-chad-wolf-file-super-tease.jpg", "publishedAt": "2022-07-29T16:41:53Z", "content": "(CNN)Chad Wolf, an acting secretary of the Department of Homeland Security during the Trump administration, has been interviewed by the House select committee investigating the January 6, 2021, insur… [+991 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nadeen Ebrahim", "title": "Turkey's leader has unfinished business in Syria. What is he waiting for?", "description": "Turkish President Recep Tayyip Erdogan wants to launch yet another military incursion into northeast Syria. But what is he waiting for?", "url": "https://www.cnn.com/2022/07/29/middleeast/turkey-syria-incursion-mime-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220729024945-mime-turkey-russia-syria.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-29T16:33:35Z", "content": "Editors Note: A version of this story first appeared in CNNs Meanwhile in the Middle East newsletter, a three-times-a-week look inside the regions biggest stories. Sign up here.\r\nTurkish President Re… [+13862 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Naomi Thomas, CNN", "title": "Updated Covid-19 booster shots could be available in early fall", "description": "Moderna and Pfizer booster shots updated to target new coronavirus variants are expected to be available in early fall, the US Department of Health and Human Services said Friday.", "url": "https://www.cnn.com/2022/07/29/health/updated-covid-boosters-fall/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220729074216-covid-booster-vaccine-0505-super-tease.jpg", "publishedAt": "2022-07-29T16:25:54Z", "content": "(CNN)Moderna and Pfizer booster shots updated to target Omicron subvariants could be available in early fall, pending sign off by federal health agencies, the US Department of Health and Human Servic… [+2665 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Judson Jones, CNN", "title": "Track the flooding in Kentucky as more rain is expected in the area", "description": "Record flash flooding along the North Fork Kentucky River this week is now surging into the Kentucky River, raising river levels.", "url": "https://www.cnn.com/2022/07/29/weather/kentucky-flood-tracker/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220729010515-01-kentucky-appalachia-flooding-friday-super-tease.jpg", "publishedAt": "2022-07-29T16:07:52Z", "content": "(CNN)Record flash flooding along the North Fork Kentucky River is surging into the Kentucky River, raising river levels.\r\nThe North Fork Kentucky River and the creeks that feed into it in eastern Ken… [+1286 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Stephanie Mansour, CNN", "title": "Maximize your walk routine with mindful movement in nature", "description": "With summer weather and the sun shining, getting outside for some fresh air is highly appealing right now. Whether you head out in the morning to get energized for a busy day or in the evening to wind down, you can use this time to engage both body and mind.", "url": "https://www.cnn.com/2022/07/29/health/meditate-outside-walking-summer-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220712175256-outdoor-mediation-walking-super-tease.jpg", "publishedAt": "2022-07-29T15:44:24Z", "content": "Sign up for CNN's Fitness, But Better newsletter series. Our seven-part guide up will help you ease into a healthy routine, backed by experts.\r\n (CNN)With summer weather and the sun shining, getting … [+3922 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marianne Garvey", "title": "Whoopi Goldberg apologizes for her statements on 'The View' about the organization Turning Point USA", "description": "Whoopi Goldberg has apologized for her statements on \"The View\" about the conservative organization Turning Point USA.", "url": "https://www.cnn.com/2022/07/29/entertainment/the-view-whoopi-goldberg-turning-point-usa-/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/200204192633-whoopi-goldberg-file.jpg?q=x_34,y_118,h_1368,w_2432,c_crop/w_800", "publishedAt": "2022-07-29T15:31:43Z", "content": "Whoopi Goldberg has apologized for her statements on The View about the conservative organization Turning Point USA.\r\nOn Mondays episode of The View, the recent Turning Point USA Student Action Summi… [+1076 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Peter Valdes-Dapena", "title": "Electric cars don't need better batteries. America needs better charging networks", "description": "With electric cars, people often talk about \"range anxiety,\" and how cars with bigger batteries and longer driving ranges will alleviate that. I just drove an electric car from New York City to Atlanta, a distance of about 950 miles, and it taught me somethin…", "url": "https://www.cnn.com/2022/07/29/business/mercedes-eqs-road-trip/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220728165800-01-mercedes-eqs-road-trip.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-29T15:24:28Z", "content": "With electric cars, people often talk about range anxiety, and how cars with bigger batteries and longer driving ranges will alleviate that. I just drove an electric car from New York City to Atlanta… [+7593 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Daniella Diaz and Annie Grayer, CNN", "title": "House to vote on assault-style weapons ban Friday", "description": "The House will vote on a ban of assault-style weapons Friday, separating packages on gun control and policing laws that had been entwined, House Speaker Nancy Pelosi announced Friday.", "url": "https://www.cnn.com/2022/07/29/politics/house-vote-assault-weapons-ban/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220520155446-05-nancy-pelosi-file-super-tease.jpg", "publishedAt": "2022-07-29T15:16:33Z", "content": "(CNN)The House will vote on a ban of assault-style weapons Friday, separating packages on gun control and policing laws that had been entwined, House Speaker Nancy Pelosi announced Friday.\r\nWhile the… [+3182 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Julian Zelizer, CNN Political Analyst", "title": "Opinion: Why the Manchin-Schumer deal is a huge breakthrough", "description": "With the passage of the CHIPS Act to boost US production of semiconductors and the announcement of a deal among Senate Democrats on a bill addressing climate change, health care and taxes, President Joe Biden is on the verge of a huge political victory.", "url": "https://www.cnn.com/2022/07/29/opinions/manchin-schumer-biden-breakthrough-zelizer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220729081853-schumer-on-steps-super-tease.jpg", "publishedAt": "2022-07-29T15:13:03Z", "content": "Julian Zelizer, a CNN political analyst, is a professor of history and public affairs at Princeton University. He is the author and editor of 24 books, including, \"The Presidency of Donald J. Trump: … [+5222 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Daniella Diaz, CNN", "title": "Democratic Rep. Dean Phillips says he doesn't want Biden to run in 2024", "description": "Democratic Rep. Dean Phillips of Minnesota said in a radio interview Thursday he doesn't want President Joe Biden to run for president in 2024, the strongest public comments yet from a lawmaker within his own party to oppose Biden running for a second term.", "url": "https://www.cnn.com/2022/07/29/politics/dean-phillips-joe-biden-2024/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220729102217-phillips-biden-split-super-tease.jpg", "publishedAt": "2022-07-29T14:40:09Z", "content": "(CNN)Democratic Rep. Dean Phillips of Minnesota said in a radio interview Thursday he doesn't want President Joe Biden to run for president in 2024, the strongest public comments yet from a lawmaker … [+1114 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tim Lister, Victoria Butenko, Gul Tuysuz", "title": "Ukraine detains Russian-owned ship loaded with grain at Black Sea port", "description": "Ukrainian authorities have detained a ship carrying grain at one of the ports where shipments are expected to resume through the Black Sea after asserting the vessel is owned by a Russian company.", "url": "https://www.cnn.com/2022/07/29/europe/ukraine-detains-russian-ship-grain-black-sea-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220728195712-chornomorsk-file-restricted-110321.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-29T14:24:35Z", "content": "Ukrainian authorities have detained a ship at one of the ports where grain shipments are expected to resume through the Black Sea this week asserting the vessel is owned by a Russian company. \r\nThe s… [+4785 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul R. La Monica, CNN Business", "title": "HOOD-winked? Investors not celebrating one year after Robinhood's IPO", "description": "It's been one year since Robinhood went public. And to say that the online broker's performance has been disastrous would be a massive understatement. If someone were to write a kids' book about it, they could title it \"Robinhood and the Terrible, Horrible, N…", "url": "https://www.cnn.com/2022/07/29/investing/robinhood-ipo-stock-anniversary/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220728143434-robinhood-ipo-072921-file-restricted-super-tease.jpg", "publishedAt": "2022-07-29T14:18:32Z", "content": "New York (CNN Business)It's been one year since Robinhood went public. And to say that the online broker's performance has been disastrous would be a massive understatement. If someone were to write … [+3029 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'Not Okay' warns when it comes to fame, be careful what you wish for", "description": "The burning desire for fame, and the way people seize upon \"causes\" often without doing their due diligence, give a meaty foundation to \"Not Okay,\" a dark comedy about a lie that brings unexpected benefits before, inevitably, spiraling out of control. Bearing…", "url": "https://www.cnn.com/2022/07/29/entertainment/not-okay-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220727111455-02-not-okay-super-tease.jpg", "publishedAt": "2022-07-29T14:12:06Z", "content": "(CNN)The burning desire for fame, and the way people seize upon \"causes\" often without doing their due diligence, give a meaty foundation to \"Not Okay,\" a dark comedy about a lie that brings unexpect… [+2531 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Will McGough, CNN", "title": "Why this Colorado valley is the West's next must-visit destination", "description": "Colorado's iconic destinations have seemingly been around forever, and we know their names by heart: Vail, Aspen and Breckenridge, to name a few, along with Denver, a city that has exploded in the past decade.", "url": "https://www.cnn.com/travel/article/colorado-palisade-grand-valley/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220726122640-colorado-grand-valley-bookcliffs-super-tease.jpg", "publishedAt": "2022-07-29T14:10:51Z", "content": "Palisade, Colorado (CNN) Colorado's iconic destinations have seemingly been around forever, and we know their names by heart: Vail, Aspen and Breckenridge, to name a few, along with Denver, a city th… [+11005 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Bill Carter for CNN Business Perspectives", "title": "Opinion: The January 6 hearings will have a bigger impact than Watergate", "description": "During the Watergate investigation, the fundamentals of American democracy had not been shaken to their foundations yet; they held strong because the public seemed to grasp the ultimate gravity of being led by a lawless president.", "url": "https://www.cnn.com/2022/07/29/perspectives/january-6-hearings-watergate/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220720141645-24-jan-6-hearings-0621-restricted.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-29T14:03:07Z", "content": "Editors Note: Bill Carter, a media analyst for CNN, covered the television industry for The New York Times for 25 years, and has written four books on TV, including The Late Shift and The War for Lat… [+5240 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'Uncoupled' features Neil Patrick Harris in show with 'Sex and the City' vibes", "description": "Different sex, same city in \"Uncoupled,\" original \"Sex and the City\" producer Darren Star's look at gay life and love in very upper-crust New York, where the most decadent porn is of the pricey Manhattan real-estate variety. Mostly, the Netflix comedy serves …", "url": "https://www.cnn.com/2022/07/29/entertainment/uncoupled-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220726192448-uncoupled-netflix-super-tease.jpg", "publishedAt": "2022-07-29T14:01:32Z", "content": "(CNN)Different sex, same city in \"Uncoupled,\" original \"Sex and the City\" producer Darren Star's look at gay life and love in very upper-crust New York, where the most decadent porn is of the pricey … [+3065 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Nima Elbagir, Barbara Arvanitidis, Tamara Qiblawi, Gianluca Mezzofiore, Mohammed Abo Al Gheit and Darya Tarasova, CNN\nVideo by Alex Platt and Mark Baron, CNN \nGraphics by Sarah-Grace Mankarious, Marco Chacón, Natalie Croker and Henrik Pettersson, CNN", "title": "Russia is plundering gold in Sudan to boost Putin's war effort in Ukraine", "description": "Multiple interviews with high-level Sudanese and US officials and troves of documents reviewed by CNN paint a picture of an elaborate Russian scheme to plunder Sudan's riches in a bid to fortify Russia against increasingly robust Western sanctions and to butt…", "url": "https://www.cnn.com/2022/07/29/africa/sudan-russia-gold-investigation-cmd-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220726094726-20220726-sudan-gold-russia-illustration-super-tease.jpg", "publishedAt": "2022-07-29T14:00:27Z", "content": "By Nima Elbagir, Barbara Arvanitidis, Tamara Qiblawi, Gianluca Mezzofiore, Mohammed Abo Al Gheit and Darya Tarasova, CNNVideo by Alex Platt and Mark Baron, CNN Graphics by Sarah-Grace Mankarious, Mar… [+17764 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Melanie Zanona, CNN", "title": "Kellyanne Conway meets with House Republicans in McCarthy's office", "description": "Kellyanne Conway, a former adviser to Donald Trump, had a breakfast meeting Friday morning with a group of House Republicans in House GOP Leader Kevin McCarthy's office, multiple GOP sources told CNN.", "url": "https://www.cnn.com/2022/07/29/politics/kellyanne-conway-house-republicans-meeting/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220729095008-conway-mccarthy-split-super-tease.jpg", "publishedAt": "2022-07-29T13:56:19Z", "content": "(CNN)Kellyanne Conway, a former adviser to Donald Trump, had a breakfast meeting Friday morning with a group of House Republicans in House GOP Leader Kevin McCarthy's office, multiple GOP sources tol… [+1644 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'Paper Girls' wants to be another 'Stranger Things' but doesn't quite deliver", "description": "The latest graphic novel from Brian K. Vaughan to make the leap to the screen, \"Paper Girls\" possesses a \"Stranger Things\"-wannabe vibe, blending coming-of-age elements, time travel, nostalgia and science fiction.", "url": "https://www.cnn.com/2022/07/29/entertainment/paper-girls-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220629155926-01-paper-girls-amazon-prime-super-tease.jpg", "publishedAt": "2022-07-29T13:55:35Z", "content": "(CNN)The latest graphic novel from Brian K. Vaughan to make the leap to the screen, \"Paper Girls\" possesses a \"Stranger Things\"-wannabe vibe, blending coming-of-age elements, time travel, nostalgia a… [+2542 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Leah Dolan, CNN", "title": "Look of the Week: Julia Fox takes the low-rise trend to new extremes", "description": "Last Friday, Fox caused a sartorial stir once again in a pelvic bone-skimming centaur-inspired  look.", "url": "https://www.cnn.com/style/article/julia-fox-low-rise-leather-pants-ltw/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220727114949-julia-fox-low-rise-pants-restricted-super-tease.jpg", "publishedAt": "2022-07-29T13:55:22Z", "content": "Featuring the good, the bad and the ugly, 'Look of the Week' is a regular series dedicated to unpacking the most talked about outfit of the last seven days.\r\nSince rising to fame in 2021 after a brie… [+2288 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kaitlan Collins, CNN", "title": "Jared Kushner details West Wing 'war' with 'toxic' Bannon in new book", "description": "Jared Kushner details his clashes with Steve Bannon in his new book, describing a \"toxic\" West Wing presence who accused him of \"undermining the President's agenda\" and threatened to break him \"in half\" if Kushner turned on him.", "url": "https://www.cnn.com/2022/07/29/politics/jared-kushner-steve-bannon-west-wing/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220729074941-jared-kushner-steve-bannon-washington-0612-super-tease.jpg", "publishedAt": "2022-07-29T13:43:56Z", "content": "(CNN)Jared Kushner details his clashes with Steve Bannon in his new book, describing a \"toxic\" West Wing presence who accused him of \"undermining the President's agenda\" and threatened to break him \"… [+3836 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tami Luhby, CNN", "title": "Workers' wages continue to climb, but not as fast as inflation", "description": "Employers continued hiking workers' pay, but the increases still weren't enough to compensate for the even faster rise in inflation.", "url": "https://www.cnn.com/2022/07/29/economy/worker-wages-inflation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220729082310-us-worker-wages-benefits-inflation-super-tease.jpg", "publishedAt": "2022-07-29T13:34:49Z", "content": "New York (CNN Business)Employers continued hiking workers' pay, but the increases still weren't enough to compensate for the even faster rise in inflation.\r\nWages and salaries for civilian workers in… [+2188 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/adrienne-vogt\">Adrienne Vogt</a> and <a href=\"/profiles/veronica-rocha\">Veronica Rocha</a>, CNN", "title": "Deadly flooding in eastern Kentucky", "description": "At least 15 people have died due to flooding in eastern Kentucky, with the death toll expected to rise, according to Gov. Andy Beshear. Follow here for live news updates.", "url": "https://www.cnn.com/us/live-news/eastern-kentucky-flooding-07-29-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220729010518-02-kentucky-appalachia-flooding-friday-super-tease.jpg", "publishedAt": "2022-07-29T13:21:53Z", "content": "Kentucky Gov. Andy Beshear told CNN on Wednesday that 15 people have died due to flooding in the eastern part of his state, and that number is expected to double. \r\nHe said the toll includes children… [+1235 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Lakshman Achuthan and Anirvan Banerji for CNN Business Perspectives", "title": "Opinion: The types of jobs to look for (and avoid) during a recession", "description": "The key is to avoid employers that offer products and services that cautious customers might elect to forgo or postpone.", "url": "https://www.cnn.com/2022/07/29/perspectives/jobs-recession-hiring-gdp/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220728110542-02-us-jobs-hiring-healthcare-super-tease.jpg", "publishedAt": "2022-07-29T12:31:40Z", "content": "Lakshman Achuthan and Anirvan Banerji are co-founders of the Economic Cycle Research Institute (ECRI), which determines recession dates for 22 economies around the world. The opinions expressed in th… [+4397 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Liptak, CNN", "title": "Pelosi departing for Asia on Friday, but Taiwan stop still uncertain", "description": "House Speaker Nancy Pelosi plans to depart Friday for a tour of Asia, though whether she stops in Taiwan remains uncertain, a person familiar with the plans said.", "url": "https://www.cnn.com/2022/07/29/politics/nancy-pelosi-asia-trip-taiwan/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220729115045-05-pelosi-visit-taiwan-super-tease.jpg", "publishedAt": "2022-07-29T12:11:55Z", "content": "Washington (CNN)House Speaker Nancy Pelosi plans to depart Friday for a tour of Asia, though whether she stops in Taiwan remains uncertain, a person familiar with the plans said. \r\nPelosi's trip incl… [+1134 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dianne Gallagher and  Jacquelyne Germain, CNN", "title": "North Carolina town's entire police department quits after town hires Black city manager", "description": "The mass exodus of an entire police department after the hiring of a Black city manager in North Carolina has opened a conversation about public safety and race relations in a small town of just over 1,500 residents.", "url": "https://www.cnn.com/2022/07/29/us/north-carolina-police-resign-black-city-manager-reaj/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220728130557-kenly-nc-street-super-tease.jpg", "publishedAt": "2022-07-29T12:05:42Z", "content": "Kenly, North Carolina (CNN)The mass exodus of an entire police department after the hiring of a Black city manager in North Carolina has opened a conversation about public safety and race relations i… [+5549 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lisa Respers France", "title": "Beyoncé's 'Renaissance' release: What you need to know", "description": "You should know by now that a Beyoncé album release is a whole event.", "url": "https://www.cnn.com/2022/07/29/entertainment/beyonce-renaissance/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220701151018-beyonce.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-29T12:05:13Z", "content": "You should know by now that a Beyoncé album release is a whole event.\r\nRenaissance is that, of course, and the Grammy winners eagerly awaited seventh album doesnt disappoint, if social media is to be… [+3666 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": null, "description": "Conversely, advertising businesses at The slowdown is hitting some companies much more than others: Spotify and Amazon posted strong growth in Q2. Roku \"warned investors about a 'significant slowdown in TV advertising spend' as it reported its second-quarter …", "url": "https://view.newsletters.cnn.com/messages/165906588362918ff6bd800d8/raw", "urlToImage": null, "publishedAt": "2022-07-29T11:30:02Z", "content": "A sampling of what we have learned from recent earnings reports across the tech and media industries:\r\n -- \"Uncertainty\" is the word of the moment: It shows up in this week's news stories about Alpha… [+2384 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Are we in a recession? Does it even matter?", "description": "The US economy contracted for a second quarter. Is the dreaded recession upon us? Nela Richardson, chief economist at ADP and Zach Carter, consultant at the Hewlett Foundation, tell \"Nightcap's\" Jon Sarlin where the economy is heading. To get the day's busine…", "url": "https://www.cnn.com/videos/business/2022/07/28/nightcap-gdp-numbers-recession-clip-orig-mb.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220728164933-nightcap-clip-revised-economy-16x9-super-tease.jpg", "publishedAt": "2022-07-29T11:19:32Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dan Merica", "title": "'What happens if they actually do win?': Democrats grapple with efforts to prop up far right candidates", "description": "Efforts by Democratic campaigns, committees and outside groups to tilt the playing field in their favor by supporting extremist Republican primary candidates are sparking backlash as other Democrats warn the tactic risks putting conspiracy theorists and elect…", "url": "https://www.cnn.com/2022/07/29/politics/democrats-propping-up-republican-candidates/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220727203002-gibbs-mastriano-cox-split.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-29T11:01:28Z", "content": "Efforts by Democratic campaigns, committees and outside groups to tilt the playing field in their favor by supporting extremist Republican primary candidates are sparking backlash as other Democrats … [+5514 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Silvia Marchetti, CNN", "title": "Their job is saving lives. But can these Argentinian doctors revive a whole Italian village?", "description": "The Sicilian town of Mussomeli gained worldwide attention when it began selling dilapidated buildings for one euro each. Now it's tackling a doctor shortage by attracting medics from Argentina. Here's what the new arrivals think of their adopted home.", "url": "https://www.cnn.com/travel/article/mussomeli-sicily-argentinian-doctors-community/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220727140926-06-body-mussomeli-argentinian-doctors-super-tease.jpg", "publishedAt": "2022-07-29T10:47:35Z", "content": "Editor's Note Sign up to CNN Travel's free nine-part Unlocking Italy newsletter for insider intel on Italy's best loved destinations and lesser-known regions to plan your ultimate trip. Plus, we'll g… [+6754 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ben Church, CNN", "title": "UEFA opens investigation after Fenerbahce fans sing Vladimir Putin's name in match against Dynamo Kyiv", "description": "European soccer's governing body UEFA has opened an investigation after Fenerbahce fans were heard singing Russian President Vladimir Putin's name during a Champions League qualifier against Dynamo Kyiv.", "url": "https://www.cnn.com/2022/07/29/football/fenerbahce-fans-vladimir-putins-dynamo-kyiv-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220729110624-04-fenerbahce-dynamo-kyiv-super-tease.jpg", "publishedAt": "2022-07-29T10:33:34Z", "content": "(CNN)European soccer's governing body UEFA has opened an investigation after Fenerbahce fans were heard singing Russian President Vladimir Putin's name during a Champions League qualifier against Dyn… [+647 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ben Morse, CNN", "title": "Arizona Cardinals remove 'independent study' clause from star QB Kyler Murray contract as he calls questions about work ethic 'disrespectful'", "description": "The Arizona Cardinals announced on Thursday that they have removed the \"independent study\" clause from star quarterback Kyler Murray's contract after he called questions about his work ethic \"disrespectful.\"", "url": "https://www.cnn.com/2022/07/29/sport/kyler-murray-contract-arizona-cardinals-nfl-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220729093114-02-kyler-murray-contract-super-tease.jpg", "publishedAt": "2022-07-29T10:30:40Z", "content": "(CNN)The Arizona Cardinals announced on Thursday that they have removed the \"independent study\" clause from star quarterback Kyler Murray's contract after he called questions about his work ethic \"di… [+3499 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Elizabeth Wells", "title": "Lebanon's national basketball team gives crisis-stricken country a glimmer of hope", "description": "The people of Lebanon were given a much-needed reason to smile this week after the Cedars -- Lebanon's national basketball team -- fought their way to the finals of the International Basketball Federation (FIBA) Asia Cup.", "url": "https://www.cnn.com/2022/07/29/sport/lebanon-basketball-hope-nation-spt-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220728134412-01-lebanon-basketball.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-29T09:50:06Z", "content": "The people of Lebanon were given a much-needed reason to smile this week after the Cedars Lebanons national basketball team fought their way to the finals of the International Basketball Federation (… [+3760 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nicole Goodkind, Tal Yellin", "title": "So are we in a recession, or not?", "description": "• Analysis: Who determines when we're in a recession\n• Mortgage rates fall as fears about the US economy loom\n• Steak is having a moment", "url": "https://www.cnn.com/2022/07/29/economy/gdp-recession-fed/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220725084341-02-us-recession-economy-perception.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-29T09:20:10Z", "content": "If youre confused about whether the US economy is in a recession, youre not alone.\r\nOn one hand, gross domestic product, a key measure of economic output, shrank for the second straight quarter this … [+4974 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "'WAGatha Christie' libel trial verdict due", "description": "Coleen Rooney, the wife of former England soccer captain Wayne, and Rebekah Vardy, the spouse of one of his ex-teammates, will discover who has come out on top in their high-profile libel tussle, a battle that has gripped the public and the media.", "url": "https://www.cnn.com/2022/07/29/uk/wagatha-christie-verdict-rooney-vardy-intl-scli/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220729044454-01-coleen-rooney-rebekah-vardy-split-super-tease.jpg", "publishedAt": "2022-07-29T09:16:21Z", "content": "Coleen Rooney, the wife of former England soccer captain Wayne, and Rebekah Vardy, the spouse of one of his ex-teammates, will discover who has come out on top in their high-profile libel tussle, a b… [+2867 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ariane de Vogue, CNN Supreme Court Reporter", "title": "Justices worry about the future of the Supreme Court -- and point fingers as to who's to blame", "description": "Limping away from one of the most significant terms in decades, justices are sending out flares expressing concern not only for the future of the Supreme Court but the country as a whole as institutional norms dissolve, tensions rise, and the court pivots rig…", "url": "https://www.cnn.com/2022/07/29/politics/supreme-court-kagan-sotomayor-barrett-roberts-thomas/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211201160248-09-supreme-court-abortion-1201-super-tease.jpg", "publishedAt": "2022-07-29T09:00:55Z", "content": "(CNN)Limping away from one of the most significant terms in decades, justices are sending out flares expressing concern not only for the future of the Supreme Court but the country as a whole as inst… [+8039 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi and Amanda Jackson, CNN", "title": "St. Louis reels from another round of dangerous floodwaters that damaged homes", "description": "Amid record-breaking rainfall, St. Louis resident Margaret Shellert is facing the full brunt of devastating back-to-back flooding this week.", "url": "https://www.cnn.com/2022/07/29/weather/st-louis-flooding-friday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220729014911-02-st-louis-flooding-friday-super-tease.jpg", "publishedAt": "2022-07-29T08:34:25Z", "content": "(CNN)Amid record-breaking rainfall, St. Louis resident Margaret Shellert is facing the full brunt of devastating back-to-back flooding this week.\r\nAfter the region was hit with torrential rains on Mo… [+3435 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rochelle Beighton, CNN", "title": "Through intimate family portraits, Marcellina Akpojotor advocates for girls' education in Nigeria", "description": "Using acrylics and leftover Ankara fabric that she sources from local fashion houses, Marcellina Akpojotor's portraits tell a story of family, femininity, and female empowerment in contemporary African society.", "url": "https://www.cnn.com/style/article/marcellina-akpojotor-girls-education-nigeria-spc-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220728154036-marcellina-akpojotor-daughter-of-esan-story-restricted-super-tease.jpg", "publishedAt": "2022-07-29T08:32:26Z", "content": "arts\r\nOnly 10 countries in the world have a bigger gender gap than Nigeria when it comes to education, with around 70% of boys in the country attending primary school, compared to only 58% of girls. … [+4502 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tara Subramaniam, CNN", "title": "Giant screen hits dancers for boy band Mirror during Hong Kong concert", "description": "A back-up dancer for the Cantopop boy band Mirror is in intensive care after being hit by a giant video panel that fell from the ceiling during a concert in Hong Kong.", "url": "https://www.cnn.com/2022/07/29/asia/hong-kong-mirror-group-concert-accident-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220729023938-hong-kong-mirror-concert-fair-use-screengrab-super-tease.jpg", "publishedAt": "2022-07-29T07:45:30Z", "content": "Hong Kong (CNN)A back-up dancer for the Cantopop boy band Mirror is in intensive care after being hit by a giant video panel that fell from the ceiling during a concert in Hong Kong.\r\nFive people wer… [+2144 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tara Subramaniam, CNN", "title": "Unmarried woman loses bid to freeze her eggs -- and sparks a gender equality debate in China", "description": "In the first case of its kind, a Chinese court ruled Friday against an unmarried woman who wanted to freeze her eggs. Several posts on Chinese social media platform Weibo noted that the ruling underscores an existing double standard regarding access to reprod…", "url": "https://www.cnn.com/2022/07/29/china/china-egg-freezing-gender-equality-intl-hnk-mic/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220726015404-china-egg-freezing-court-case-double-standard-intl-hnk-super-tease.jpg", "publishedAt": "2022-07-29T07:13:20Z", "content": "A version of this story appeared in CNN's Meanwhile in China newsletter, a three-times-a-week update exploring what you need to know about the country's rise and how it impacts the world. Sign up her… [+4170 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/jessie-yeung\">Jessie Yeung</a>, CNN", "title": "Russia's war in Ukraine", "description": "Ukraine claims Russian troops can no longer carry heavy weapons across a key bridge in the southern Kherson region after it was repeatedly struck by long-range Ukrainian artillery. Follow live news updates here.", "url": "https://www.cnn.com/europe/live-news/russia-ukraine-war-news-07-29-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220727181232-ukrainian-military-truck-super-tease.jpg", "publishedAt": "2022-07-29T06:41:27Z", "content": "Russian Foreign Minister Sergey Lavrov will \"pay attention\" to the US State Department's request to speak with Secretary of State Antony Blinken when \"time permits,\" a Russian Foreign Ministry spokes… [+2208 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Elizabeth Wolfe, CNN", "title": "At least 8 people are dead after Kentucky's catastrophic flooding, and the death toll is expected to rise", "description": "Hundreds of homes are ruined and at least eight people are dead after catastrophic flooding in Kentucky on Thursday, and the death toll is expected to keep rising as storms continue Friday and rescuers work around the clock to reach difficult-to-access areas,…", "url": "https://www.cnn.com/2022/07/29/weather/kentucky-appalachia-flooding-friday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220729010518-02-kentucky-appalachia-flooding-friday-super-tease.jpg", "publishedAt": "2022-07-29T06:08:39Z", "content": "(CNN)At least eight people are dead and hundreds of homes ruined following catastrophic flooding in eastern Kentucky on Thursday, and as rescuers work around the clock to reach difficult-to-access ar… [+6820 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jamiel Lynch, CNN", "title": "Jackpot for Friday's Mega Millions now $1.1 billion, second-largest jackpot in game history", "description": "The Mega Millions jackpot for Friday has risen to $1.1 billion, the second-largest in the 20-year history of the game, according to a news release.", "url": "https://www.cnn.com/2022/07/29/us/mega-millions-lottery-jackpot-friday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220728150530-mega-millions-0726-super-tease.jpg", "publishedAt": "2022-07-29T04:02:44Z", "content": "(CNN)The Mega Millions jackpot for Friday has risen to $1.1 billion, the second-largest in the 20-year history of the game, according to a news release.\r\nThe cash value option of Friday's jackpot is … [+501 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oscar Holland, CNN", "title": "Dior accused of 'culturally appropriating' centuries-old Chinese skirt", "description": "Dior is facing accusations of cultural appropriation after Chinese social media users -- and protesters outside one of the label's Paris stores -- claimed that a $3,800 skirt was inspired by a centuries-old traditional garment.", "url": "https://www.cnn.com/style/article/dior-cultural-appropriation-accusations-chinese-skirt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220728104529-01-dior-extra-super-tease.jpg", "publishedAt": "2022-07-29T03:40:51Z", "content": "Dior is facing accusations of cultural appropriation after Chinese social media users -- and protesters outside one of the label's Paris stores -- claimed that a $3,800 skirt was inspired by a centur… [+3615 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Annie Grayer, CNN", "title": "January 6 committee intends to share 20 transcripts with the Justice Department", "description": "The House select committee investigating the January 6, 2021, attack on the US Capitol intends to share 20 transcripts with the Justice Department, a select committee spokesperson told CNN.", "url": "https://www.cnn.com/2022/07/28/politics/janaury-6-committee-justice-department-share-20-transcripts/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220603072143-january-6-committee-super-tease.jpg", "publishedAt": "2022-07-29T03:31:28Z", "content": "(CNN)The House select committee investigating the January 6, 2021, attack on the US Capitol intends to share 20 transcripts with the Justice Department, a select committee spokesperson told CNN. \r\n\"T… [+1181 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rosa Flores and Amir Vera, CNN", "title": "Robb Elementary school principal allowed to return to work after brief suspension, attorney says", "description": "Mandy Gutierrez return to work July 28, 2022 in an administrative capacity, according to a letter form the superintendent.", "url": "https://www.cnn.com/2022/07/28/us/uvalde-robb-elementary-principal-return-to-work/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220727211654-uvalde-principal-mandy-gutierrez-super-tease.jpg", "publishedAt": "2022-07-29T02:58:41Z", "content": "(CNN)Mandy Gutierrez, the Robb Elementary School principal who was suspended with pay earlier this week has been informed that she may return to work, according to her attorney Ricardo Cedillo.\r\nGuti… [+2125 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Josh Campbell", "title": "A former Marine linked to neo-Nazis plotted attacks on Jewish targets, prosecutors say", "description": "A former US Marine planned to attack a New York synagogue and engage in \"widespread homicide and sexual assault\" targeting minorities, federal prosecutors argue in court documents obtained by CNN.", "url": "https://www.cnn.com/2022/07/28/us/former-marine-plotted-attacks-jewish-targets/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210209035327-doj-seal.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-29T02:03:50Z", "content": "A former US Marine planned to attack a New York synagogue and engage in widespread homicide and sexual assault targeting minorities, federal prosecutors argue in court documents obtained by CNN. \r\nMa… [+3362 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Mark Morales, CNN", "title": "Alleged attacker of Rep. Lee Zeldin held in custody following federal court hearing", "description": "The man accused of attempting to stab New York gubernatorial nominee Rep. Lee Zeldin on stage at a campaign event will not yet be released from custody, a judge determined on Thursday, according to a Department of Justice spokesperson.", "url": "https://www.cnn.com/2022/07/28/politics/lee-zeldin-david-jakubonis-held-federal-court-hearing/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220728210951-david-jakubonis-file-072122-super-tease.jpg", "publishedAt": "2022-07-29T02:00:25Z", "content": "(CNN)The man accused of attempting to stab New York gubernatorial nominee Rep. Lee Zeldin on stage at a campaign event will not yet be released from custody, a judge determined on Thursday, according… [+1446 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sharif Paget, CNN", "title": "She awoke by a flash flood warning. In less than an hour, her family's home was washed away", "description": "Belinda Asher was sleeping in her eastern Kentucky home when she was abruptly awoken a little after 1 a.m. Thursday by a flash flood alert on her phone.", "url": "https://www.cnn.com/2022/07/28/us/eastern-kentucky-flood-family-home-lost/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220728201239-01-belinda-asher-super-tease.jpg", "publishedAt": "2022-07-29T01:12:44Z", "content": "(CNN)Belinda Asher was sleeping in her eastern Kentucky home when she was abruptly awoken a little after 1 a.m. Thursday by a flash flood alert on her phone. \r\n\"By 2 a.m., everything I had was comple… [+1507 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Taylor Romine, Rob Frehse, Katherine Dillinger", "title": "With no federal emergency declaration, San Francisco and New York sound alarm on monkeypox", "description": "While federal officials weigh a nationwide public health emergency declaration around the monkeypox outbreak, San Francisco and New York state began sounding the alarm Thursday.", "url": "https://www.cnn.com/2022/07/28/health/monkeypox-emergency-jurisdictions/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220719142010-monkeypox-nyc-health-commissioner.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-29T00:35:18Z", "content": "While federal officials weigh a nationwide public health emergency declaration around the monkeypox outbreak, San Francisco and New York state began sounding the alarm Thursday.\r\nSan Francisco became… [+3711 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Gavin Smith", "title": "Opinion: Republicans have to make a fateful choice on what kind of party they want to be", "description": "Republicans pride themselves as being a \"big tent\" party focused on family values, writes Gavin J. Smith, who  says we're now about to find out just how fundamental its family values really are. With the Senate poised to hold a vote soon on a measure to ensur…", "url": "https://www.cnn.com/2022/07/28/opinions/republicans-gays-respect-for-marriage-act-senate-smith/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/150124111424-republican-gop-logo-elephant.png?q=x_2,y_0,h_1078,w_1915,c_crop/w_800", "publishedAt": "2022-07-29T00:28:01Z", "content": "Editors Note: Gavin Smith is a public relations professional and political strategist. He is CEO of Gavin James Public Affairs, a public relations and marketing consulting firm in Lexington, South Ca… [+4995 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Allison Morrow, CNN Business", "title": "Are we in a recession? Yes. No. Maybe.", "description": "Here's the Big Thing to know today: The US economy shrank in the second quarter of the year, and that does indeed meet the unofficial criteria for being in a recession. But, as you probably noticed, we're not rolling out the R-word in any definitive way yet (…", "url": "https://www.cnn.com/2022/07/28/business/nightcap-recession-jetblue-spirit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220727174003-02-us-gdp-second-quarter-super-tease.jpg", "publishedAt": "2022-07-29T00:00:50Z", "content": "This story is part of CNN Business' Nightcap newsletter. To get it in your inbox, sign up for free, here.\r\nNew York (CNN Business)Here's the Big Thing to know today: The US economy shrank in the seco… [+6563 chars]"}]}