{"status": "ok", "totalResults": 73, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Holmes Lybrand, Hannah Rabinowitz", "title": "Proud Boys member who nearly came face-to-face with Schumer on Jan. 6 pleads guilty", "description": "Josh Pruitt, a member of the Proud Boys who then-Senate Minority Leader Chuck Schumer and his team ran from during the US Capitol riot, pleaded guilty Friday to a felony charge of obstructing an official proceeding on January 6, 2021.", "url": "https://www.cnn.com/2022/06/03/politics/josh-pruitt-proud-boys-schumer-january-6/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220603202022-josh-pruitt-proud-boys-schumer-january-6.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-06-04T00:31:12Z", "content": "Josh Pruitt, a member of the Proud Boys who then-Senate Minority Leader Chuck Schumer and his team ran from during the US Capitol riot, pleaded guilty Friday to a felony charge of obstructing an offi… [+1825 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "CNN", "title": "How law enforcement's narrative of the Uvalde massacre has changed - CNN", "description": "<ol><li>How law enforcement's narrative of the Uvalde massacre has changed  CNN\r\n</li><li>School police chief didn't have his radio during Uvalde school shooting, State senator says  WFAA\r\n</li><li>Uvalde teacher had made peace with idea she was going to die,…", "url": "https://www.cnn.com/interactive/2022/06/us/uvalde-police-narratives-texas-shooting/index.html", "urlToImage": "https://www.cnn.com/interactive/uploads/20220603-uvalde-police-narratives-texas-shooting.jpg", "publishedAt": "2022-06-03T23:23:42Z", "content": "Then He engaged with a school police officer \r\nAuthorities initially said that after the gunman shot his grandmother and crashed a truck in a ditch near Robb Elementary School, a school resource offi… [+1456 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eric Bradner, CNN", "title": "Dave McCormick concedes Pennsylvania Senate GOP primary to Trump-backed Mehmet Oz", "description": "Dave McCormick announced at a campaign event Friday evening that he had conceded Pennsylvania's Republican Senate primary to Dr. Mehmet Oz, the celebrity heart surgeon endorsed by former President Donald Trump.", "url": "https://www.cnn.com/2022/06/03/politics/dave-mccormick-concedes-mehmet-oz-pennsylvania-senate-republican-primary/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220406141455-mccormick-pennsylvania-0125-super-tease.jpg", "publishedAt": "2022-06-03T23:12:38Z", "content": "(CNN)Dave McCormick announced at a campaign event Friday evening that he had conceded Pennsylvania's Republican Senate primary to Dr. Mehmet Oz, the celebrity heart surgeon endorsed by former Preside… [+60 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Dotson and Jacqueline Rose, CNN", "title": "Brittney Griner is receiving written correspondence from friends and family while she's detained in Russia, her agent says", "description": "Brittney Griner has been able to receive written correspondence from friends and family during her detention in Russia, where she has been held for over 100 days, her agent tells CNN -- but the WNBA star has not been able to speak with her loved ones back hom…", "url": "https://www.cnn.com/2022/06/03/sport/brittney-griner-written-correspondence-russia-detainment-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220310103000-01-brittney-griner-file-083121-super-tease.jpg", "publishedAt": "2022-06-03T23:06:06Z", "content": "(CNN)Brittney Griner has been able to receive written correspondence from friends and family during her detention in Russia, where she has been held for over 100 days, her agent tells CNN -- but the … [+1375 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "In pictures: The Watergate scandal", "description": "Fifty years ago, five men were arrested after breaking into the Washington headquarters of the Democratic National Committee. The ensuing scandal would eventually lead to the resignation of President Richard Nixon.", "url": "https://www.cnn.com/2022/06/03/politics/gallery/watergate-history/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220603131910-01a-watergate-history-super-tease.jpg", "publishedAt": "2022-06-03T22:29:39Z", "content": "Richard Nixon flashes his trademark V signs before boarding Marine One and leaving the White House grounds on August 9, 1974. The night before, he had announced that he would resign as president beca… [+797 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Veronica Stracqualursi, CNN", "title": "White House to be lit orange for gun violence awareness", "description": "The White House will be illuminated in orange Friday night in honor of National Gun Violence Awareness Day, as the nation has been shaken by a recent string of deadly mass shootings.", "url": "https://www.cnn.com/2022/06/03/politics/white-house-orange-gun-violence-awareness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220514133832-white-house-0514-super-tease.jpg", "publishedAt": "2022-06-03T21:44:38Z", "content": "(CNN)The White House will be illuminated in orange Friday night in honor of National Gun Violence Awareness Day, as the nation has been shaken by a recent string of deadly mass shootings. \r\nThe White… [+1651 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Shawn Nottingham, Chuck Johnston and Emma Tucker, CNN", "title": "South Carolina law enforcement officials will exhume housekeeper's body in death investigation", "description": "South Carolina law enforcement officials announced on Friday that they sought and received permission from the family of Gloria Satterfield, a former housekeeper for suspended attorney Alex Murdaugh, to exhume her remains.", "url": "https://www.cnn.com/2022/06/03/us/south-carolina-officials-to-exhume-housekeeper-body/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210916105812-gloria-satterfield-super-tease.jpg", "publishedAt": "2022-06-03T21:22:34Z", "content": "(CNN)South Carolina law enforcement officials announced on Friday that they sought and received permission from the family of Gloria Satterfield, a former housekeeper for suspended attorney Alex Murd… [+2694 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacqueline Howard", "title": "US has rolled out 1,200 vaccines for monkeypox in response to outbreak", "description": "As the number of monkeypox cases climbs amid an ongoing global outbreak, US health officials said Friday that they are ramping up testing and contact tracing and expanding access to vaccines and treatments.", "url": "https://www.cnn.com/2022/06/03/health/monkeypox-vaccine-outbreak-cdc/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220520183005-02-monkeypox-handout.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-06-03T21:18:00Z", "content": "As the number of monkeypox cases climbs amid an ongoing global outbreak, US health officials said Friday that they are ramping up testing and contact tracing and expanding access to vaccines and trea… [+6972 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Julian Zelizer, CNN Political Analyst", "title": "Opinion: How Biden can avoid Carter's one-term presidential fate", "description": "If the current trajectory continues, Biden could end up ushering in a new era marked by the radicalized GOP, headed by Trump or a more polished -- and politically savvy -- version in the form of Florida Gov. Ron DeSantis, warns Julian Zelizer.", "url": "https://www.cnn.com/2022/06/03/opinions/biden-mounting-crisis-carter-fate-zelizer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220602195752-joe-biden-gun-violence-address-june-2-2022-2-super-tease.jpeg", "publishedAt": "2022-06-03T21:11:21Z", "content": "Julian Zelizer, a CNN political analyst, is a professor of history and public affairs at Princeton University. He is the author and editor of 24 books, including, \"The Presidency of Donald J. Trump: … [+7343 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Peter Valdes-Dapena, CNN Business", "title": "Stellantis US arm pleads guilty to fraud and conspiracy in diesel emissions investigation", "description": "The Michigan-based arm of the international automaker Stellantis has pleaded guilty and agreed to pay $300 million in penalties to settle an investigation into alleged cheating on emissions tests for some of its diesel-powered vehicles.", "url": "https://www.cnn.com/2022/06/03/business/stellantis-us-guilty-diesel-emissions/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220603151959-2014-jeep-grand-cherokee-super-tease.jpg", "publishedAt": "2022-06-03T21:08:27Z", "content": "(CNN)The Michigan-based arm of the international automaker Stellantis has pleaded guilty and agreed to pay $300 million in penalties to settle an investigation into alleged cheating on emissions test… [+2322 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ryan Nobles, CNN", "title": "Buffalo-area GOP congressman declines to run again after calling for assault weapons ban", "description": "Republican Rep. Chris Jacobs of New York announced Friday he will not run again for Congress, after he lost the support of conservatives following comments that he would support a ban of AR-15s and raising the age of gun ownership to 21.", "url": "https://www.cnn.com/2022/06/03/politics/chris-jacobs-new-york-wont-run-reelection-congress/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220603164006-chris-jacobs-file-restricted-061721-super-tease.jpg", "publishedAt": "2022-06-03T20:46:27Z", "content": "(CNN)Republican Rep. Chris Jacobs of New York announced Friday he will not run again for Congress, after he lost the support of conservatives following comments that he would support a ban of AR-15s … [+246 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dan Merica, CNN", "title": "Fetterman's cardiologist says Democrat, who had stroke, suffers from atrial fibrillation and cardiomyopathy", "description": "John Fetterman's cardiologist said Friday that the Democratic Senate candidate suffers from both atrial fibrillation and cardiomyopathy, issuing a statement that provides more insight into what caused the Pennsylvania lieutenant governor's stroke in May.", "url": "https://www.cnn.com/2022/06/03/politics/john-fetterman-health/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220515154138-01-john-fetterman-0515-super-tease.jpg", "publishedAt": "2022-06-03T19:51:46Z", "content": "(CNN)John Fetterman's cardiologist said Friday that the Democratic Senate candidate suffers from both atrial fibrillation and cardiomyopathy, issuing a statement that provides more insight into what … [+4875 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Gloria Borger, CNN Chief Political Analyst", "title": "For Bennie Thompson, chairing January 6 investigation brings full circle a career spent on voting rights", "description": "For Bennie Thompson, the invasion of the US Capitol on January 6th, 2021 was a significant moment of déjà vu. From his perch in the House gallery above the chamber that day, he couldn't quite tell what was going on, until his wife phoned him to let him know w…", "url": "https://www.cnn.com/2022/06/03/politics/bennie-thompson-chair-january-6-investigation-voting-rights/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220603120638-03-bennie-thompson-super-tease.jpg", "publishedAt": "2022-06-03T19:40:19Z", "content": "Washington (CNN)For Bennie Thompson, the invasion of the US Capitol on January 6, 2021, was a significant moment of déjà vu. From his perch in the House gallery above the chamber that day, he couldn'… [+5017 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by David Goldman, CNN Business", "title": "The economy is going into the toilet. Let's hope no one flushes it!", "description": "JPMorgan Chase CEO Jamie Dimon says an economic hurricane is coming. Tesla's Elon Musk says he has a \"super bad feeling\" about a recession. Companies are downgrading their earnings forecasts. Oh, and we're in the midst of an energy and inflation crisis, and s…", "url": "https://www.cnn.com/2022/06/03/economy/economy-jobs/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220526132648-01-us-recession-risk-super-tease.jpg", "publishedAt": "2022-06-03T19:07:33Z", "content": "New York (CNN Business)JPMorgan Chase CEO Jamie Dimon says an economic hurricane is coming. Tesla's Elon Musk says he has a \"super bad feeling\" about a recession. Companies are downgrading their earn… [+6755 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Forrest Brown, CNN", "title": "Cruise ship Mardi Gras rescues 16 people stranded at sea, Carnival Cruise Line says", "description": "While cruising in waters off the coast on Cuba on Friday morning, crew members of the cruise ship Mardi Gras spotted what had to be a chilling sight: a small vessel in rough seas stirred up by a tropical weather system.", "url": "https://www.cnn.com/travel/article/carnival-cruise-mardi-gras-rescues-stranded-passengers/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220603123747-carnival-mardi-gras-rescue-restricted-super-tease.jpg", "publishedAt": "2022-06-03T18:54:03Z", "content": "Top image: People gather on a fishing pier to watch the Carnival Cruise Line ship Mardi Gras as it departed on its maiden voyage, a seven-day cruise to the Caribbean from Port Canaveral, Florida, on … [+103 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Natasha Bertrand, Katie Bo Lillis, Barbara Starr, Jeremy Herb", "title": "Western allies meeting regularly to game out potential framework for Ukraine ceasefire as war hits 100th day", "description": "Staring down the prospect of an extended stalemate in Ukraine, the US and its allies are placing a renewed emphasis on the need for a negotiated settlement to end the war as the conflict grinds into its 100th day with no clear victory in sight for either side.", "url": "https://www.cnn.com/2022/06/03/politics/ukraine-100-days-western-allies-regular-meetings-potential-ceasefire/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220602105552-severodonetsk-ukraine-0602.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-06-03T18:51:14Z", "content": "Staring down the prospect of an extended stalemate in Ukraine, the US and its allies are placing a renewed emphasis on the need for a negotiated settlement to end the war as the conflict grinds into … [+9198 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Whitney Wild", "title": "Former police officer arrested outside US Capitol with ammunition, fake badge and body armor", "description": "The US Capitol Police on Friday charged a retired New York police officer with unlawful possession of high-capacity magazines and unregistered ammunition, according to the agency.", "url": "https://www.cnn.com/2022/06/03/politics/capitol-police-arrest-man/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220603141030-capitol-arrest-jerome-felipe-060322-super-tease.jpg", "publishedAt": "2022-06-03T18:50:50Z", "content": "(CNN)The US Capitol Police on Friday charged a retired New York police officer with unlawful possession of high-capacity magazines and unregistered ammunition, according to the agency. \r\nOfficers arr… [+572 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Dotson", "title": "Philadelphia Phillies fire manager Joe Girardi", "description": "The Philadelphia Phillies have fired manager Joe Girardi after the team started the season with a 22-29 record, the club's President of Baseball Operations David Dombrowski announced Friday.", "url": "https://www.cnn.com/2022/06/03/sport/joe-girardi-philadelphia-phillies-manager-fired/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220603134155-joe-girardi-0510.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-06-03T18:49:56Z", "content": "The Philadelphia Phillies have fired manager Joe Girardi after the team started the season with a 22-29 record, the clubs President of Baseball Operations David Dombrowski announced Friday.\r\nBench co… [+1007 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kara Scannell", "title": "Trump's lawyer says they left voicemails for former executive assistants in attempt to satisfy civil contempt issue", "description": "Lawyers for former President Donald Trump said they made one phone call to most of his former executive assistants in their effort to try to contact them as part of the New York attorney general's investigation into the Trump Organization's finances.", "url": "https://www.cnn.com/2022/06/03/politics/trump-contempt-reply/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220525173627-donald-trump-220514-texas.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-06-03T18:48:21Z", "content": "Lawyers for former President Donald Trump said they made one phone call to most of his former executive assistants in their effort to try to contact them as part of the New York attorney generals inv… [+2098 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chandelis Duster, CNN", "title": "Labor Secretary doesn't rule out possibility of economic 'hurricane'", "description": "Labor Secretary Marty Walsh on Friday told CNN there is \"no question\" an economic \"hurricane\" is possible.", "url": "https://www.cnn.com/2022/06/03/politics/marty-walsh-economic-hurricane-cnntv/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220603130755-marty-walsh-0422-file-super-tease.jpg", "publishedAt": "2022-06-03T18:30:01Z", "content": "(CNN)Labor Secretary Marty Walsh on Friday told CNN there is \"no question\" an economic \"hurricane\" is possible.\r\nAsked if the Biden administration agrees with JPMorgan Chase CEO Jamie Dimon's recent … [+2042 chars]"}]}