{"status": "ok", "totalResults": 112, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Rhea Mogul, CNN | Esha Mitra, CNN and Manveena Suri, CNN", "title": "India's latest box office smash 'The Kashmir Files' exposes deepening religious divides", "description": "A new movie based on the mass exodus of Kashmiri Pandits in the 1990s has sparked huge debate in India, with critics arguing that its graphic violence and religious stereotyping may exacerbate tensions between the country's Hindus and Muslims.", "url": "https://www.cnn.com/style/article/india-kashmir-files-controversy-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220412054840-06-kashmir-files-super-tease.jpg", "publishedAt": "2022-04-28T04:35:52Z", "content": "artsPublished 28th April 2022\r\n\"If you don't leave from here, we will burn your houses,\" a bearded Muslim man in a traditional skullcap cries as he rallies against Kashmir's minority Hindus. \r\nThe pa… [+14225 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Eleven in Indian religious procession die after freak electrocution", "description": "A freak electrocution in southern India killed at least 11 people, including two children, when their vehicle snagged overhead transmission lines and burst into flames as they rode in a religious procession, authorities said on Wednesday.", "url": "https://www.cnn.com/2022/04/28/asia/india-electrocution-religious-procession-intl-hnk/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220427234641-01-electrocution-india-0427.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-28T04:07:01Z", "content": "A freak electrocution in southern India killed at least 11 people, including two children, when their vehicle snagged overhead transmission lines and burst into flames as they rode in a religious pro… [+793 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/andrew-raine\">Andrew Raine</a> and Sean Federico-OMurchu", "title": "Russia's war in Ukraine", "description": "Russian President Vladimir Putin has warned that any country interfering in Ukraine would be met with a \"lightning-fast\" response from Moscow. Meanwhile, heavy fighting continues in the eastern regions of Ukraine. Follow here for live updates.", "url": "https://www.cnn.com/europe/live-news/russia-ukraine-war-news-04-28-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220427110448-01-ukraine-luhansk-super-tease.jpg", "publishedAt": "2022-04-28T04:01:02Z", "content": "Ukrainian officials have been talking about the risk of another front in the conflict with Russia opening up along the border with Moldova in the southwest.\r\nPart of the Moldovan border region is con… [+2149 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Stephen Collinson", "title": "Analysis: How the widening war in Ukraine will cost the world", "description": "The vicious epicenter of the war in Ukraine now rests in the scorched cities of the east and the south. But the conflict's reverberations are widening in a way that will leave few people on Earth -- from small-town America to poverty-stricken Africa -- untouc…", "url": "https://www.cnn.com/2022/04/28/politics/ukraine-war-world-costs-analysis/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220427203857-borodianka-destruction-0425.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-28T04:00:17Z", "content": "The vicious epicenter of the war in Ukraine now rests in the scorched cities of the east and the south. But the conflicts reverberations are widening in a way that will leave few people on Earth from… [+8855 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Philippines pulls Hollywood action flick from cinemas over South China Sea map", "description": "The Philippines has pulled the plug on all domestic screenings of a Hollywood film called \"Uncharted,\" over a scene showing a disputed map of the South China Sea, the Foreign Ministry said on Wednesday.", "url": "https://www.cnn.com/2022/04/27/asia/philippines-uncharted-film-china-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220427230749-uncharted-movie-still-map-super-tease.jpg", "publishedAt": "2022-04-28T03:59:07Z", "content": "(Reuters)The Philippines has pulled the plug on all domestic screenings of a Hollywood film called \"Uncharted,\" over a scene showing a disputed map of the South China Sea, the Foreign Ministry said o… [+1320 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amir Vera and Paul Vercammen, CNN", "title": "Family of victim in 'Rust' shooting demands sheriff's office remove graphic video of her dying after being shot, attorney letter says", "description": "The family of Halyna Hutchins is demanding the Santa Fe County Sheriff's Office remove video it released of her \"dying on the church floor\" in the moments after she was shot on the set of the movie \"Rust\" last year, according to a letter written by the family…", "url": "https://www.cnn.com/2022/04/27/entertainment/rust-shooting-halyna-hutchins-family-letter/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220426003021-balwin-rust-shooting-super-tease.jpg", "publishedAt": "2022-04-28T03:29:45Z", "content": "(CNN)The family of Halyna Hutchins is demanding the Santa Fe County Sheriff's Office remove video it released of her \"dying on the church floor\" in the moments after she was shot on the set of the mo… [+2805 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Hafsa Khalil", "title": "9 of the world's best wellness retreats", "description": "Whether you're looking for deep cleanses amid the snowy peaks of New Zealand, massages in the Maldives and Saint Lucia, or spa therapy in Saint Lucia, here are some of the best rejuvenation hotspots the world has to offer.", "url": "https://www.cnn.com/travel/article/best-wellness-retreats-luxury-resorts-vacation-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220428100235-10-worlds-best-wellness-retreats-promo-super-tease.jpg", "publishedAt": "2022-04-28T03:25:59Z", "content": "(CNN) Being pummeled by strangers, soaked in aromatic waters, or encouraged to throw yoga shapes in beautiful surroundings isn't going to erase the problems of the past two years.\r\nBut for those of u… [+7567 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": null, "description": "(view.newsletters.cnn.com)", "url": "https://view.newsletters.cnn.com/messages/165111365150866c3543b3227/raw", "urlToImage": null, "publishedAt": "2022-04-28T03:15:03Z", "content": "&gt;&gt; The Washington Post placed Musk's behavior on Page One of Thursday's paper, noting that \"the targeting of employees by Musk's massive Twitter megaphone is a major concern for workers...\"\r\n &… [+2778 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marshall Cohen, CNN", "title": "Durham prosecutors detail criminal probe into tech executive who worked on Trump-Russia back channel claims", "description": "Special counsel John Durham has an active and ongoing criminal probe into a tech executive who worked with a Hillary Clinton 2016 campaign lawyer to share claims of a cyber back channel between Donald Trump and Russia, prosecutors said in court Wednesday.", "url": "https://www.cnn.com/2022/04/27/politics/john-durham-criminal-probe-rodney-joffe/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220215172717-john-durham-super-tease.jpg", "publishedAt": "2022-04-28T01:28:32Z", "content": "Washington (CNN)Special counsel John Durham has an active and ongoing criminal probe into a tech executive who worked with a Hillary Clinton 2016 campaign lawyer to share claims of a cyber back chann… [+4794 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Conlon, CNN", "title": "Judge in Nikolas Cruz sentencing reverses course on jury selection", "description": "The judge presiding over the Nikolas Cruz sentencing reversed course Wednesday, deciding against starting over with jury selection -- something she said two days earlier would happen at the prosecution's request.", "url": "https://www.cnn.com/2022/04/27/us/nikolas-cruz-judge-jury-selection-decision/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220427162707-nikolas-cruz-enters-court-0427-super-tease.jpg", "publishedAt": "2022-04-28T01:07:39Z", "content": "(CNN)The judge presiding over the Nikolas Cruz sentencing reversed course Wednesday, deciding against starting over with jury selection -- something she said two days earlier would happen at the pros… [+2158 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paula Reid, Annie Grayer, Ryan Nobles and Zachary Cohen, CNN", "title": "Rudy Giuliani expected to appear before January 6 committee next month", "description": "Rudy Giuliani is expected to appear next month before the House select committee investigating the January 6, 2021, insurrection, according to sources familiar with the matter.", "url": "https://www.cnn.com/2022/04/27/politics/rudy-giuliani-january-6-committee-next-month/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220203094624-01-rudy-giuliani-file-super-tease.jpg", "publishedAt": "2022-04-28T00:07:22Z", "content": "(CNN)Rudy Giuliani is expected to appear next month before the House select committee investigating the January 6, 2021, insurrection, according to sources familiar with the matter.\r\nThe expected app… [+2502 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Steve Contorno, CNN", "title": "DeSantis amplifies 2024 chatter with trip to Nevada to campaign for Senate candidate Laxalt", "description": "Coming off a showdown with Disney and a month of headlines for waging fights over hot-button social issues, Florida Gov. Ron DeSantis will introduce himself to Republican primary voters in Nevada on Wednesday when he campaigns for US Senate candidate Adam Lax…", "url": "https://www.cnn.com/2022/04/27/politics/ron-desantis-2024-nevada-laxalt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220427152529-desantis-abortion-bill-signing-april-14-super-tease.jpg", "publishedAt": "2022-04-27T23:59:31Z", "content": "Las Vegas (CNN)Coming off a showdown with Disney and a month of headlines for waging fights over hot-button social issues, Florida Gov. Ron DeSantis will introduce himself to Republican primary voter… [+7851 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/aditi-sandal\">Aditi Sangal</a>, Maureen Chowdhury, <a href=\"/profiles/jessie-yeung\">Jessie Yeung</a>, Seán Federico O'Murchú, Ben Morse, Jeevan Ravindran and Ed Upright, CNN", "title": "Catch up on what you need to know", "description": "Civilians are fleeing the southern Ukrainian city of Kherson, which has fallen to Russian control and is expected to stage what Ukrainian leaders have called a sham referendum. Follow here for live news updates.", "url": "https://edition.cnn.com/europe/live-news/russia-ukraine-war-news-04-27-22/index.html", "urlToImage": "https://dynaimage.cdn.cnn.com/cnn/digital-images/org/cb721166-f644-40fb-862a-7aa3eaf1d136.jpg", "publishedAt": "2022-04-27T23:30:00Z", "content": "At least six different Kremlin-linked hacking groups have conducted nearly 240 cyber operations against Ukrainian targets, Microsoft said Wednesday, in data that reveals a broader scope of alleged Ru… [+4123 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brad Lendon", "title": "Russia's tanks in Ukraine have a 'jack-in-the-box' design flaw. And the West has known about it since the Gulf war", "description": "Russian tanks with their tops blown off are just the latest sign that Russia's invasion of Ukraine isn't going to plan.", "url": "https://www.cnn.com/2022/04/27/europe/russia-tanks-blown-turrets-intl-hnk-ml/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220420210714-04-destroyed-russian-tank-file-restricted-041522.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-27T23:18:12Z", "content": "Russian tanks with their tops blown off are just the latest sign that Russias invasion of Ukraine isnt going to plan.\r\nHundreds of Russian tanks are thought to have been destroyed since Moscow launch… [+5197 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jen Christensen, CNN", "title": "Ban on menthol cigarettes and flavored cigars could save hundreds of thousands of lives, experts say", "description": "The US Food and Drug Administration is expected to announce a proposed rule this week to ban menthol from cigarettes, as well as to ban flavored cigars. It's a step that public health officials say is essential to protect public health.", "url": "https://www.cnn.com/2022/04/27/health/proposed-menthol-ban/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220223172721-03-adolescent-smoking-super-tease.jpeg", "publishedAt": "2022-04-27T23:12:34Z", "content": "(CNN)The US Food and Drug Administration is expected to announce a proposed rule this week to ban menthol from cigarettes, as well as to ban flavored cigars. It's a step that public health officials … [+10459 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "MJ Lee and Kevin Liptak, CNN", "title": "Biden will visit South Korea and Japan next month as he works to keep focus on Asia", "description": "President Joe Biden will make his first trip to Asia as president next month, visiting South Korea and Japan from May 20 to May 24, White House officials told CNN, underscoring his commitment to the region even as international attention is directed toward th…", "url": "https://www.cnn.com/2022/04/27/politics/biden-trip-asia-south-korea-japan/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220427154041-biden-boards-af1-file-super-tease.jpg", "publishedAt": "2022-04-27T23:01:02Z", "content": "(CNN)President Joe Biden will make his first trip to Asia as president next month, visiting South Korea and Japan from May 20 to May 24, White House officials told CNN, underscoring his commitment to… [+5171 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Harry Enten", "title": "It's not just Latinos and younger voters. Democrats are slipping among Black voters too.", "description": "Black voters form the core of the Democratic Party base. They cast ballots for Democrats in greater proportions than almost any other demographic group. But recent polling suggests the advantage Democrats have had with Black voters may be slipping, at least a…", "url": "https://www.cnn.com/2022/04/27/politics/democrats-biden-black-voters-midterms/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220426095650-01-black-voters-matter-march.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-27T22:55:19Z", "content": "Black voters form the core of the Democratic Party base. They cast ballots for Democrats in greater proportions than pretty much any other demographic group. Without the massive backing of Black vote… [+4780 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chris Isidore, CNN Business", "title": "Ford just reported a $3.1 billion loss. Blame Rivian", "description": "In the days after its November IPO, electric truck maker Rivian was briefly one of the world's most valuable automakers despite not yet having reported a single sale. But its stock has been sliding steadily since then, which just resulted in a big loss for...…", "url": "https://www.cnn.com/2022/04/27/business/ford-loss-rivian/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211111085842-01-rivian-truck-1110-super-tease.jpg", "publishedAt": "2022-04-27T22:54:30Z", "content": "New York (CNN Business)In the days after its November IPO, electric truck maker Rivian was briefly one of the world's most valuable automakers despite not yet having reported a single sale. But its s… [+3684 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chloe Melas", "title": "Hailey Bieber says she underwent procedure to close hole in her heart after mini-stroke", "description": "Hailey Bieber is finally telling fans what led to her hospitalization in March.", "url": "https://www.cnn.com/2022/04/27/entertainment/hailey-bieber-stroke-hole-in-heart/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220427180058-hailey-bieber-screengrab.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-27T22:26:34Z", "content": "Hailey Bieber is finally telling fans what led to her hospitalization in March.\r\nThe model, who is married to musician Justin Bieber, posted a video to her YouTube channel on Wednesday explaining tha… [+1062 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amir Vera, Rebekah Riess", "title": "Wisconsin DA says 14-year-old boy is the suspect in the death of 10-year-old Lily Peters", "description": "The juvenile defendant is facing three charges, including first degree intentional homicide, first degree sexual assault, and first degree sexual assault of a child under age 13.", "url": "https://www.cnn.com/2022/04/27/us/lily-peters-wisconsin-juvenile-suspect-bond-hearing/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220425173737-lily-peters.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-27T22:23:42Z", "content": "The suspect in the death of 10-year-old Lily Peters in Chippewa County, Wisconsin, is a 14-year-old eighth-grader, prosecutors said Wednesday.\r\nHe is facing three charges: first-degree intentional ho… [+3175 chars]"}]}