{"status": "ok", "totalResults": 147, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Mary Katharine Ham", "title": "Opinion: Democrats' support for school closings comes back to bite", "description": "Mary Katharine Ham writes the high academic and social costs of remote learning and closed schools are now indisputable, but there is also a political cost -- one that Democrats have already paid in several recent elections and may just pay again this Novembe…", "url": "https://www.cnn.com/2022/05/12/opinions/democrats-problem-parent-voters-education-midterms-ham/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220512134233-01-us-education-during-covid.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-12T22:06:25Z", "content": "Editors Note: Mary Katharine Ham is a CNN commentator, author and host of the Getting Hammered podcast. The views expressed in this commentary are her own. View more opinion on CNN.\r\nSometimes, peopl… [+8757 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marshall Cohen", "title": "Opposition research firm hired by Hillary Clinton's campaign must turn over emails to special counsel Durham, judge rules", "description": "A judge ruled Thursday that Fusion GPS, the opposition research firm hired to dig up dirt about Donald Trump's ties to Russia for Hillary Clinton's 2016 campaign, must turn over 22 internal emails to special counsel John Durham, who is investigating the FBI's…", "url": "https://www.cnn.com/2022/05/12/politics/fusion-gps-judge-ruling/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220217130326-john-durham-michael-sussmann-split-super-tease.jpg", "publishedAt": "2022-05-12T21:15:02Z", "content": "(CNN)A judge ruled Thursday that Fusion GPS, the opposition research firm hired to dig up dirt about Donald Trump's ties to Russia for Hillary Clinton's 2016 campaign, must turn over 22 internal emai… [+2153 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hadas Gold", "title": "WaPo: Israeli ​soldiers' guns confiscated as part of investigation after Al-Jazeera journalist's killing​, says Israeli military official", "description": "Israeli military investigators have taken guns away from some Israel Defense Forces troops as part of an investigation into shooting incidents in Jenin on the day Al Jazeera journalist Shireen Abu Akleh was killed there, the Washington Post reported Thursday,…", "url": "https://www.cnn.com/2022/05/12/middleeast/shireen-abu-akleh-idf-investigation-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220512131800-01-shireen-abu-akleh-file.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-12T21:00:18Z", "content": "Israeli military investigators have taken guns away from some Israel Defense Forces troops as part of an investigation into shooting incidents in Jenin on the day Al Jazeera journalist Shireen Abu Ak… [+1042 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Peter Valdes-Dapena, CNN Business", "title": "Mercedes issues 'Do not drive' advisory for 292,000 SUVs", "description": "Mercedes-Benz is recalling 292,287 SUVs from the 2006 through 2012 model years. The luxury automaker is also advising owners of the affected vehicles to stop driving them until the potential problem, which could cause the power brake system to fail, is fixed.", "url": "https://www.cnn.com/2022/05/12/business/mercedes-suv-recall/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220512152830-mercedes-ml--file-restricted-super-tease.jpg", "publishedAt": "2022-05-12T20:20:57Z", "content": "(CNN Business)Mercedes-Benz is recalling292,000 SUVs and advising owners of the vehicles to stop driving them until a potential problem, which could cause the power brake system to fail, can be fixed… [+2018 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ali Zaslav and Ted Barrett, CNN", "title": "Rand Paul: Senator blocks bipartisan effort to swiftly pass Ukraine aid", "description": "In a rare showing of public unity, Senate Majority Leader Chuck Schumer and Republican Leader Mitch McConnell took to the Senate floor to press for quick passage of a $40 billion aid bill for Ukraine but were blocked by GOP Sen. Rand Paul of Kentucky who is d…", "url": "https://www.cnn.com/2022/05/12/politics/rand-paul-blocks-ukraine-aid/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220512114237-rand-paul-kentucky-super-tease.jpg", "publishedAt": "2022-05-12T20:19:16Z", "content": "(CNN)In a rare showing of public unity, Senate Majority Leader Chuck Schumer and Republican Leader Mitch McConnell took to the Senate floor to press for quick passage of a $40 billion aid bill for Uk… [+3099 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Omar Jimenez, CNN", "title": "An off-duty officer put his knee on a 12-year-old girl's neck to break up a fight. The girl is now being charged", "description": "Back in March, an off-duty police officer was seen on video putting his knee on the neck of a 12-year-old girl in Kenosha, Wisconsin, for more than 20 seconds in an attempt to break up a school fight.", "url": "https://www.cnn.com/2022/05/12/us/kenosha-wisconsin-12-year-old-charged/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220427151047-lincoln-middle-school-kenosha-file-super-tease.jpg", "publishedAt": "2022-05-12T19:57:01Z", "content": "(CNN)Back in March, an off-duty police officer was seen on video putting his knee on the neck of a 12-year-old girl in Kenosha, Wisconsin, for more than 20 seconds in an attempt to break up a school … [+4140 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Gabe Cohen", "title": "US farmers under pressure and on the front lines of food inflation amid price spikes", "description": "Climate impacts like droughts are among the many points of stress on US farmers. They're also facing skyrocketing costs for labor, fuel, seed and fertilizer -- factors that are driving up food prices.", "url": "https://www.cnn.com/2022/05/12/politics/us-farmers-drought-food-prices-inflation/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220512132545-us-farmers-inflation-price-spikes-restricted.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-12T19:52:57Z", "content": "Just six weeks from his winter wheat harvest, Brian Brooks feels defeated. \r\nHes staring down 4,000 acres of barren soil across his farm in southeast Colorado, dried out by a brutal drought that coul… [+3700 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Natalia Mehlman Petrzela", "title": "Opinion: The right and left could agree on one thing about schools", "description": "The far-right demonization of social emotional learning (as of a piece with critical race theory and comprehensive sex education) reflects a long history of poliical conflicts about values and emotions in the classroom, says Natalia Petrzela -- but the curren…", "url": "https://www.cnn.com/2022/05/12/opinions/social-emotional-learning-petrzela/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220512131217-01-boston-public-school-1974-super-tease.jpg", "publishedAt": "2022-05-12T19:45:33Z", "content": "Natalia Mehlman Petrzela (@nataliapetrzela) is an associate professor of history at The New School and the author of the book \"Classroom Wars: Language, Sex, and the Making of Modern Political Cultur… [+12561 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sam Fossum, CNN", "title": "Biden administration announces more than $250 million in new grants to redevelop contaminated sites across America", "description": "The Biden administration announced Thursday that more than $254 million will be allocated to 265 communities to clean up and redevelop contaminated areas, known as brownfield sites, which contain hazardous substances or other pollutants like asbestos, lead an…", "url": "https://www.cnn.com/2022/05/12/politics/epa-brownfield-sites/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220512152920-brownfield-site-file-020822-super-tease.jpg", "publishedAt": "2022-05-12T19:34:09Z", "content": "(CNN)The Biden administration announced Thursday that more than $254 million will be allocated to 265 communities to clean up and redevelop contaminated areas, known as brownfield sites, which contai… [+2543 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Dotson, CNN", "title": "Kentucky Derby winner Rich Strike won't run the Preakness Stakes", "description": "Fresh off his victory at the 148th Kentucky Derby, Rich Strike will not race at the upcoming Preakness Stakes -- the second leg of the horse racing's triple crown, the horse's owner Rick Dawson said in a statement Thursday.", "url": "https://www.cnn.com/2022/05/12/sport/rich-strike-preakness-stakes/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220512141211-rich-strike-kentucky-derby-super-tease.jpg", "publishedAt": "2022-05-12T19:23:06Z", "content": "(CNN)Fresh off his victory at the 148th Kentucky Derby, Rich Strike will not race at the upcoming Preakness Stakes -- the second leg of the horse racing's triple crown, the horse's owner Rick Dawson … [+1134 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ella Nilsen, Maegan Vazquez", "title": "Interior Department cancels offshore oil and gas leases in Alaska and the Gulf of Mexico", "description": "The Biden administration announced Wednesday it would cancel three upcoming offshore oil and gas leases -- two in the Gulf of Mexico and one in Alaska -- over a lack of interest and delays.", "url": "https://www.cnn.com/2022/05/12/politics/interior-gas-leases-canceled-alaska-gulf/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220402133254-02-deb-haaland-2021-file.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-12T19:00:20Z", "content": "The Biden administration announced Wednesday it would cancel three upcoming offshore oil and gas leases two in the Gulf of Mexico and one in Alaska over a lack of interest and delays. \r\nThe cancellat… [+3890 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "EXCLUSIVE by Nima Elbagir, Barbara Arvanitidis, Gianluca Mezzofiore, Katie Polglase, Tamara Qiblawi, Alex Platt, Victoria Butenko and Darya Tarasova \nGraphics by Henrik Petterrson and Connie Chen, Video editing by Oscar Featherstone", "title": "Russian general who oversaw atrocities in Syria led cluster bomb attacks on civilians in Ukraine", "description": "CNN has identified the rocket artillery brigade that launched the cluster munitions attack in residential districts of Ukraine's second city, Kharkiv. The Russian general who led the attacks also oversaw the siege of Syria's eastern Aleppo and the ratcheting …", "url": "https://www.cnn.com/2022/05/12/world/russia-general-ukraine-syria-cluster-bombs-intl-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220502143406-01-kharkiv-platt-super-tease.jpg", "publishedAt": "2022-05-12T18:44:17Z", "content": "CNN verified and analyzed social media videos that show multiple explosions in line with the use of 300mm Smerch cluster munition rockets in Saltivka and other residential areas of Kharkiv. Both Huma… [+830 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Veronica Stracqualursi, CNN", "title": "Leading anti-abortion groups urge state lawmakers not to pass bills criminalizing women for abortions", "description": "Some of the largest anti-abortion organizations in the US are urging state lawmakers to reject legislation that would criminalize women for having abortions, saying \"turning women who have abortions into criminals is not the way.\"", "url": "https://www.cnn.com/2022/05/12/politics/anti-abortion-groups-letter-criminalizing-women/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220512100624-01-anti-abortion-activists-0511-super-tease.jpg", "publishedAt": "2022-05-12T18:32:41Z", "content": "Washington (CNN)Some of the largest anti-abortion organizations in the US are urging state lawmakers to reject legislation that would criminalize women for having abortions, saying \"turning women who… [+3141 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Hunt, CNN", "title": "Tonga volcanic eruption was the most powerful in more than a century", "description": "Scientists have begun to piece together what happened during the January 15 eruption of the undersea volcano about 65 kilometers (40 miles) north of Tonga. The eruption has defied easy explanation and upended scientists' understanding of volcanoes.", "url": "https://www.cnn.com/2022/05/12/asia/tonga-eruption-biggest-in-more-a-century-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220511143355-tonga-volcanic-eruption-screengrab-super-tease.jpg", "publishedAt": "2022-05-12T18:00:26Z", "content": "(CNN)The volcanic eruption on an island near Tonga in January was as powerful as the 1883 Krakatoa eruption in Indonesia, one of the deadliest and most destructive volcanic events on record.\r\nScienti… [+5515 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alisha Ebrahimji, CNN", "title": "Prize payments for an $86 million Mega Millions jackpot suspended after error", "description": "We all make mistakes, but for a host of the Mega Millions lottery, it's a potentially costly one: Prize payments for all Mega Millions tickets have been temporarily suspended after host John Crow incorrectly read the Mega Ball number during Tuesday's lottery …", "url": "https://www.cnn.com/2022/05/12/us/mega-millions-wrong-number-announced/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220512114909-01-mega-millions-paper-ticket-file-super-tease.jpg", "publishedAt": "2022-05-12T17:52:09Z", "content": "(CNN)We all make mistakes, but for a host of the Mega Millions lottery, it's a potentially costly one: Prize payments for all Mega Millions tickets have been temporarily suspended after host John Cro… [+1143 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul R. La Monica, CNN Business", "title": "Meme mania returns. GameStop and AMC soar", "description": "Apes of Reddit, rejoice! Shares of meme stock darling GameStop soared more than 20% at one point in midday trading Thursday and were halted several times for volatility. But there was no news to justify or explain the big pop.", "url": "https://www.cnn.com/2022/05/12/investing/gamestop-amc-meme-stocks/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220512111724-game-stop-store-0208-restricted-super-tease.jpg", "publishedAt": "2022-05-12T17:25:53Z", "content": "New York (CNN Business)Apes of Reddit, rejoice! Shares of meme stock darling GameStop(GME) soared more than 20% in midday trading Thursday, prompting trades to be halted several times due to volatili… [+2941 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tierney Sneed", "title": "Republicans call for DOJ to enforce law that would bar abortion rights demonstrators from protesting at justices' homes", "description": "Republicans in Congress and governors' mansions are calling on Attorney General Merrick Garland to enforce a 1950 federal law that makes it illegal to hold protests outside the homes of judges in order to influence their decisions.", "url": "https://www.cnn.com/2022/05/12/politics/supreme-court-justices-abortion-protests-garland/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220509221900-04-reproductive-rights-vigil-050922.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-12T17:22:02Z", "content": "Republicans in Congress and governors mansions are calling on Attorney General Merrick Garland to enforce a 1950 federal law that makes it illegal to hold protests outside the homes of judges in orde… [+6428 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Parija Kavilanz, Danielle Wiener-Bronner", "title": "Coronavirus committee: Meat companies lied about impending shortage and put workers at risk", "description": "At the height of the pandemic, as the coronavirus infected tens of thousands of meat industry workers and caused hundreds to die, executives at the nation's largest meat producers were aware of the transmission risk in their plants and successfully lobbied th…", "url": "https://www.cnn.com/2022/05/12/business/meat-companies-investigation-covid-response/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220511175136-01-meat-processors-covid.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-12T17:22:01Z", "content": "At the height of the pandemic, as the coronavirus infected tens of thousands of meat industry workers and caused hundreds to die, executives at the nations largest meat producers were aware of the tr… [+9047 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Video: First image of Milky Way's supermassive black hole revealed - CNN Video", "description": "Lia Medeiros, co-lead of the EHT Gravitational Physics Working Group, talks to CNN about capturing the first image of the massive black hole at the center of the Milky Way galaxy.", "url": "https://www.cnn.com/videos/tech/2022/05/12/milky-way-black-hole-first-images-lia-medeiros-ctw-intl-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220512094832-04-milky-way-galaxy-discovery-super-tease.jpg", "publishedAt": "2022-05-12T17:18:28Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brandon Tensley", "title": "Why the assaults on abortion rights and voting rights go hand in hand", "description": "While abortion rights might not always rank among voters' top political priorities, there has long been a tendency to isolate the issue from the matter of voting rights. That impulse couldn't be more wrong,  Melissa Murray, a law professor at New York Univers…", "url": "https://www.cnn.com/2022/05/12/politics/voter-suppression-abortion-rights-race-deconstructed-newsletter/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220506170313-pro-choice-demonstrators-file-050522.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-12T17:16:20Z", "content": "A version of this story appeared in CNNs Race Deconstructed newsletter. To get it in your inbox every week, sign up for free here.\r\nOne takeaway from Justice Samuel Alitos leaked draft opinion that w… [+8155 chars]"}]}