{"status": "ok", "totalResults": 87, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Henderson, CNN", "title": "Kaitlin Armstrong pleads not guilty in connection with death of elite cyclist Mo Wilson", "description": "Kaitlin Marie Armstrong, the woman who authorities say fled to Costa Rica after allegedly killing elite professional cyclist Mo Wilson and was missing for more than 40 days, pleaded not guilty to first-degree murder in a Texas court Wednesday, according to CN…", "url": "https://www.cnn.com/2022/07/20/us/kaitlin-armstrong-plea-not-guilty/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220707215605-02-kaitlin-armstrong-screengrab-super-tease.jpg", "publishedAt": "2022-07-20T23:32:19Z", "content": "(CNN)Kaitlin Marie Armstrong, the woman who authorities say fled to Costa Rica after allegedly killing an elite professional cyclist and was missing for more than 40 days, pleaded not guilty to first… [+2978 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Fredreka Schouten", "title": "Democratic super PAC sues FEC for inaction as Donald Trump teases 2024 bid", "description": "A Democratic super PAC on Wednesday filed a lawsuit against the Federal Election Commission in a bid to force the agency to take action against former President Donald Trump for, in their view, essentially running for president without formally declaring hims…", "url": "https://www.cnn.com/2022/07/20/politics/democratic-lawsuit-potential-trump-2024-campaign/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220720153706-trump-rally-0709.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-20T23:08:59Z", "content": "A Democratic super PAC on Wednesday filed a lawsuit against the Federal Election Commission in a bid to force the agency to take action against former President Donald Trump for, in their view, essen… [+2377 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sonia Moghe, CNN", "title": "New York police investigating if retired judge's son killed mother before jumping to his own death", "description": "New York police are investigating whether the son of a retired New York state judge killed his mother in the family's Manhattan apartment before jumping to his own death, a law enforcement source told CNN on Wednesday.", "url": "https://www.cnn.com/2022/07/20/us/new-york-police-investigate-murder-suicide-retired-judge-son-wife-mother/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/150325082016-social-gfx-just-in-super-169.jpg", "publishedAt": "2022-07-20T22:58:47Z", "content": "New York (CNN)New York police are investigating whether the son of a retired New York state judge killed his mother in the family's Manhattan apartment before jumping to his own death, a law enforcem… [+1238 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nouran Salahieh, CNN", "title": "A Georgia school logo has sparked outrage over similarities to a Nazi symbol", "description": "An elementary school in Marietta, Georgia, is halting the rollout of a new logo after an uproar from parents who pointed out its similarities to a Nazi symbol.", "url": "https://www.cnn.com/2022/07/20/us/georgia-school-logo-outrage/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220720144907-cobb-county-georgia-school-logo-sparks-outrage-super-tease.jpg", "publishedAt": "2022-07-20T22:57:53Z", "content": "(CNN)An elementary school in Marietta, Georgia, is halting the rollout of a new logo after an uproar from parents who pointed out its similarities to a Nazi symbol.\r\nEast Side Elementary School, loca… [+5804 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Zachary B. Wolf", "title": "What's in the bipartisan plan to stop insurrection 2.0", "description": "A bipartisan group of senators has a plan to fix presidential elections. It would try to close the loopholes that allies of former President Donald Trump tried to exploit in their effort to overturn the 2020 election results. This news out of the normally par…", "url": "https://www.cnn.com/2022/07/20/politics/electoral-count-act-what-matters/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220720143335-manchin-collins-0608.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-20T22:53:44Z", "content": "A version of this story appears in CNNs What Matters newsletter. To get it in your inbox, sign up for free here.\r\nA bipartisan (yes, bipartisan!) group of senators has a plan to fix presidential elec… [+5725 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kacey Cherry", "title": "The rightful owners of Bruce's Beach finally get the official deed 98 years later", "description": "In a celebratory and historic ceremony, Bruce's Beach, an oceanfront property was formally returned to the descendants of a Black couple in Southern California on Wednesday, nearly a century after being wrongfully stripped of the land.", "url": "https://www.cnn.com/2022/07/20/us/bruces-beach-deed-transfer-california-reaj/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220720153612-bruces-beach-deed-return-0720.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-20T22:36:28Z", "content": "In a celebratory and historic ceremony, Bruces Beach, an oceanfront property was formally returned to the descendants of a Black couple in Southern California on Wednesday, nearly a century after bei… [+1996 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Hansler, CNN", "title": "Families of Americans detained abroad unveil mural of loved ones and call on country not to forget them", "description": "Dozens of family members of Americans detained abroad gathered in Washington on Wednesday to unveil a mural of their loved ones, to urge the country not to forget about them and again call for the US government to act decisively to bring them home.", "url": "https://www.cnn.com/2022/07/20/politics/us-detainee-mural-unveiling/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220720162149-02-detainee-mural-super-tease.jpg", "publishedAt": "2022-07-20T22:22:12Z", "content": "Washington (CNN)Dozens of family members of Americans detained abroad gathered in Washington on Wednesday to unveil a mural of their loved ones, to urge the country not to forget about them and again… [+3218 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Michael Warren, Dan Merica", "title": "Risks abound for both parties in uncertain Senate races", "description": "In the fight to control the Senate, Democrats and Republicans are staring at equally uncertain, yet markedly different, paths to the majority.", "url": "https://www.cnn.com/2022/07/20/politics/senate-races-landscape/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220720174440-mehmet-oz-file-restricted-060922.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-20T22:18:56Z", "content": "In the fight to control the Senate, Democrats and Republicans are staring at equally uncertain, yet markedly different, paths to the majority.\r\nRepublican candidates are enjoying a favorable politica… [+13758 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Van Jones", "title": "Opinion: Why Black voters are frustrated with Biden -- and what he can do about it", "description": "Van Jones writes that recent poll numbers, showing President Joe Biden's waning approval among Black voters, reflect their heartbreak, frustration and disappointment with the current administration. But there are steps Biden can take to win back Black voters …", "url": "https://www.cnn.com/2022/07/20/opinions/black-voters-frustration-biden-solutions-jones/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220426095650-01-black-voters-matter-march-super-tease.jpg", "publishedAt": "2022-07-20T22:15:32Z", "content": "CNN host Van Jones is the founder and a board member at Dream Corps, a national nonprofit organization working at the intersection of criminal justice reform, green economics and tech equity. The vie… [+8480 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ali Zaslav, Manu Raju, Ted Barrett, Morgan Rimmer, Jessica Dean and Kristin Wilson, CNN", "title": "CNN asked all 50 GOP senators if they will support the same-sex marriage bill. Here's where they stand.", "description": "CNN asked all 50 Republicans where they stand on legislation that will to codify same-sex marriage into federal law.", "url": "https://www.cnn.com/2022/07/20/politics/gop-senators-same-sex-marriage/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220701112212-us-capitol-0629-super-tease.jpg", "publishedAt": "2022-07-20T21:47:28Z", "content": "By Ali Zaslav, Manu Raju, Ted Barrett, Morgan Rimmer, Jessica Dean and Kristin Wilson, CNN\r\nUpdated 5:47 PM ET, Wed July 20, 2022\r\n (CNN)Ten GOP senators are needed to join all 50 Democrats in order … [+9249 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "'Striking:' Top American CEOs earn this much more than their their employees", "description": "Chief executives at top US companies are earning a lot more, millions more, than their employees. CNN's Vanessa Yurkevich reports.", "url": "https://www.cnn.com/videos/business/2022/07/20/ceo-salary-and-employee-pay-gap-top-companies-amazon-yurkevich-the-lead-vpx.cnnbusiness", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220712102233-euro-dollar-super-tease.jpg", "publishedAt": "2022-07-20T21:45:31Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Evan Perez and Kara Scannell, CNN", "title": "Federal investigation of Hunter Biden reaches critical juncture, sources say", "description": "The federal investigation into Hunter Biden's business activities is nearing a critical juncture as investigators weigh possible charges and prosecutors confront Justice Department guidelines to generally avoid bringing politically sensitive cases close to an…", "url": "https://www.cnn.com/2022/07/20/politics/hunter-biden-investigation-critical-juncture/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220720105426-hunter-biden-0707-restricted-super-tease.jpg", "publishedAt": "2022-07-20T21:07:45Z", "content": "Washington (CNN)The federal investigation into Hunter Biden's business activities is nearing a critical juncture as investigators weigh possible charges and prosecutors confront Justice Department gu… [+5714 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Josh Campbell and Hannah Rabinowitz, CNN", "title": "ATF strike forces seized nearly 8,000 illegal weapons in the past year", "description": "Specialized strike forces from the Bureau of Alcohol, Tobacco, Firearms and Explosives targeting gun traffickers seized more than 7,700 guns and silencers associated with crimes in the past year in Chicago, Los Angeles, Washington, DC, New York and San Franci…", "url": "https://www.cnn.com/2022/07/20/politics/atf-guns/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220512194450-guns-for-sale-ny-file-092520-super-tease.jpg", "publishedAt": "2022-07-20T20:55:18Z", "content": "(CNN)Specialized strike forces from the Bureau of Alcohol, Tobacco, Firearms and Explosives targeting gun traffickers seized more than 7,700 guns and silencers associated with crimes in the past year… [+1885 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Veronica Stracqualursi", "title": "Federal appeals court allows Georgia's six-week abortion ban to take effect this summer", "description": "Georgia's law banning abortions at about six weeks of pregnancy will be allowed to go into effect later this summer, a federal appeals court ruled Wednesday.", "url": "https://www.cnn.com/2022/07/20/politics/georgia-six-week-abortion-law/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220720155043-georgia-state-capitol-roe-vs-wade-file-062622.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-20T20:08:29Z", "content": "Georgias law banning abortions at about six weeks of pregnancy will be allowed to go into effect later this summer, a federal appeals court ruled Wednesday. \r\nA federal district court in 2020 had blo… [+1198 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marika Gerken, CNN", "title": "6 inexpensive ways to eat healthy at home", "description": "Eating nutrient-dense, balanced meals is one of the most important things you can do for your physical and mental health, according to experts. Here are six ways you can eat healthier without spending your entire paycheck at the grocery store.", "url": "https://www.cnn.com/2022/07/20/health/healthy-eating-inexpensive-meals-at-home/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220719164934-01-inexpensive-food-healthy-stock-super-tease.jpeg", "publishedAt": "2022-07-20T20:00:41Z", "content": "(CNN)The Monday evening dinner dilemma: You're adding up all the money you spent on food over the weekend and thinking, \"I should really cook tonight.\" But that will require grocery shopping and clea… [+7122 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matt Mcfarland Business", "title": "US Postal Service increases its electric vehicle order", "description": "The US Postal Service said Wednesday that at least 40% of its new delivery vehicles will be electric, up from the 10% it had once committed to, following a backlash from the Biden administration and others.", "url": "https://www.cnn.com/2022/07/20/business/usps-electric-vehicle/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220720125207-02-usps-new-truck-super-tease.jpg", "publishedAt": "2022-07-20T19:38:59Z", "content": "Washington, DC (CNN)The US Postal Service said Wednesday that at least 40% of its new delivery vehicles will be electric, up from the 10% it had once committed to, following a backlash from the Biden… [+1927 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marshall Cohen and Hannah Rabinowitz, CNN", "title": "Former Trump White House aide who met with January 6 panel attacks witnesses, lawmakers in profane and sexist rant", "description": "A former Trump White House aide who met with the January 6 committee earlier this week went on a profane and sexist rant on a livestream after his testimony, where he railed against the lawmakers and attacked other witnesses, according to audio posted to his …", "url": "https://www.cnn.com/2022/07/20/politics/garrett-ziegler-rant/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220719105722-garrett-ziegler-super-tease.jpg", "publishedAt": "2022-07-20T19:32:49Z", "content": "(CNN)A former Trump White House aide who met with the January 6 committee earlier this week went on a profane and sexist rant on a livestream after his testimony, where he railed against the lawmaker… [+2256 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katherine Dillinger and Virginia Langmaid, CNN", "title": "FDA commissioner announces review of food and tobacco programs amid criticism", "description": "US Food and Drug Administration Commissioner Dr. Robert Califf announced Tuesday that he has commissioned reviews of the agency's food and tobacco programs. Both have been subject of recent criticism amid the nationwide infant formula shortage and the debate …", "url": "https://www.cnn.com/2022/07/20/health/fda-commissioner-review-food-tobacco-programs/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220720085221-01-robert-califf-file-super-tease.jpg", "publishedAt": "2022-07-20T19:24:36Z", "content": "(CNN)US Food and Drug Administration Commissioner Dr. Robert Califf announced Tuesday that he has commissioned reviews of the agency's food and tobacco programs. Both have been subject of recent crit… [+3912 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Elizabeth Cohen", "title": "In some states, doctors weigh 'ruinous' litigation against proper care for women who have miscarriages", "description": "When Marlena Stell had a miscarriage, she says she begged her doctor for help but instead was forced to walk around for at least two weeks with fetal remains inside her because of strict anti-abortion laws.", "url": "https://www.cnn.com/2022/07/20/health/doctors-weigh-litigation-miscarriage-care/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220720114539-marlena-stell-super-tease.jpg", "publishedAt": "2022-07-20T19:15:06Z", "content": "(CNN)When Marlena Stell had a miscarriage, she says she begged her doctor for help but instead was forced to walk around for at least two weeks with fetal remains inside her because of strict anti-ab… [+9891 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ariel Edwards-Levy", "title": "CNN Poll: Most Americans believe that government and society can take action on preventing mass shootings", "description": "Americans' belief that society and government can do something about mass shootings is at a new high, according to a CNN poll conducted by SSRS. Most of the public favors stricter gun laws, the survey finds, with more than 4 in 10 saying that recently enacted…", "url": "https://www.cnn.com/2022/07/20/politics/cnn-poll-gun-policy/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220720124827-enough-sign-0720.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-20T18:01:51Z", "content": "Americans belief that society and government can do something about mass shootings is at a new high, according to a CNN poll conducted by SSRS. Most of the public favors stricter gun laws, the survey… [+5516 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ted Barrett, Manu Raju", "title": "Senators expect GOP support to grow for same-sex marriage bill in bid to overcome filibuster", "description": "Republican and Democratic senators said Wednesday they expect a bill to codify same-sex marriage to eventually win the 60 votes needed to break a filibuster, a sign of growing public acceptance and a sea change over an issue that had once badly divided the tw…", "url": "https://www.cnn.com/2022/07/20/politics/same-sex-marriage-republican-senators/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/201003172050-05-trump-covid-circle-thom-tillis.jpg?q=x_2,y_8,h_1157,w_2056,c_crop/w_800", "publishedAt": "2022-07-20T18:01:39Z", "content": "Republican and Democratic senators said Wednesday they expect a bill to codify same-sex marriage to eventually win the 60 votes needed to break a filibuster, a sign of growing public acceptance and a… [+5461 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "A January 6 committee witness was just censured by the Arizona Republican Party", "description": "Rusty Bowers' testimony before the January 6 committee was stirring.", "url": "https://www.cnn.com/2022/07/20/politics/rusty-bowers-censure-arizona-republican-party-jan-6/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220621191044-02-rusty-bowers-062122-super-tease.jpg", "publishedAt": "2022-07-20T17:37:35Z", "content": "THE POINT -- NOW ON YOUTUBE! \r\nIn each episode of his weekly YouTube show, Chris Cillizza will delve a little deeper into the surreal world of politics. Click to subscribe!"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lisa Respers France, CNN", "title": "Nolan Neal, 'The Voice' and 'America's Got Talent' contestant, dead at 41", "description": "Nolan Neal, who won a standing ovation on \"America's Got Talent\" with a song he wrote about getting sober, has died, according to multiple media reports and tweets from \"The Voice,\" on which he also performed.", "url": "https://www.cnn.com/2022/07/20/entertainment/nolan-neal-dead/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220720112338-america-got-talent-nolan-neal-file-restricted-super-tease.jpg", "publishedAt": "2022-07-20T17:27:34Z", "content": "(CNN)Nolan Neal, who won a standing ovation on \"America's Got Talent\" with a song he wrote about getting sober, has died, according to multiple media reports and tweets from \"The Voice,\" on which he … [+1587 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul LeBlanc, CNN", "title": "Wisconsin assembly speaker says Trump called him this month to decertify 2020 election", "description": "Wisconsin Assembly Speaker Robin Vos said former President Donald Trump called him last week as part of a fresh effort to decertify the state's 2020 presidential election results.", "url": "https://www.cnn.com/2022/07/20/politics/donald-trump-wisconsin-2020-presidential-election/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220720121523-donald-trump-0625-super-tease.jpg", "publishedAt": "2022-07-20T17:19:34Z", "content": "Washington (CNN)Wisconsin Assembly Speaker Robin Vos said former President Donald Trump called him last week as part of a fresh effort to decertify the state's 2020 presidential election results. \r\n\"… [+2802 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Manu Raju and Clare Foran, CNN", "title": "Bipartisan group of senators cuts deal to change election laws in response to January 6 attack", "description": "A bipartisan group of senators reached a deal to make it harder to overturn a certified presidential election, marking the most significant response by Congress to former President Donald Trump's relentless pressure campaign to overturn the results of the 202…", "url": "https://www.cnn.com/2022/07/20/politics/electoral-count-act-reform-january-6-response/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/181005164858-01-collins-manchin-split-super-tease.jpg", "publishedAt": "2022-07-20T17:17:32Z", "content": "(CNN)A bipartisan group of senators reached a deal to make it harder to overturn a certified presidential election, marking the most significant response by Congress to former President Donald Trump'… [+3266 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eric Bradner and Rachel Janfaza, CNN", "title": "Glenn Ivey defeats Donna Edwards in Democratic primary for Maryland's 4th District, CNN projects", "description": "Glenn Ivey, former Prince George's County state's attorney, will win the Democratic nomination in Maryland's 4th Congressional District, CNN projects, defeating former Rep. Donna Edwards, who previously represented the district.", "url": "https://www.cnn.com/2022/07/20/politics/glenn-ivey-maryland-4th-district/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220720115042-glenn-ivey-maryland-0719-restricted-super-tease.jpg", "publishedAt": "2022-07-20T17:02:18Z", "content": "(CNN)Glenn Ivey, former Prince George's County state's attorney, will win the Democratic nomination in Maryland's 4th Congressional District,CNN projects, defeating former Rep. Donna Edwards, who pre… [+1206 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Korn, CNN Business", "title": "This airline is launching electronic bag tags to try to speed up the airport check-in process", "description": "Alaska Airlines is rolling out electronic bag tags in an effort to speed up the airport check-in process for customers, the company said Tuesday.", "url": "https://www.cnn.com/2022/07/20/business/electronic-bag-tags/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220720094833-20220720--alaska-airlines-bag-tag-super-tease.jpeg", "publishedAt": "2022-07-20T16:58:52Z", "content": "New York (CNN Business)Alaska Airlines is rolling out electronic bag tags in an effort to speed up the airport check-in process for customers, the company said Tuesday. \r\nThe new option, which Alaska… [+2000 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ashley Strickland", "title": "NASA targets late summer launch for Artemis mega moon rocket", "description": "The mega Artemis I rocket may be launching on its trip to the moon on August 29, September 2 or September 5, according to NASA officials.", "url": "https://www.cnn.com/2022/07/20/world/artemis-i-launch-preparations-scn/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220617141050-artemis-moon-rocket-file-060622.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-20T16:42:37Z", "content": "Sign up for CNNs Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more.\r\nPrepare for a potential liftoff to the moon at the end… [+3332 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Melanie Zanona", "title": "Republican lawmakers thank Pence for his actions on January 6 and encourage him to run in 2024", "description": "Members of the conservative Republican Study Committee thanked former Vice President Mike Pence for his actions on January 6 and encouraged him to run for President during a private meeting on Wednesday near the US Capitol in Washington, according to multiple…", "url": "https://www.cnn.com/2022/07/20/politics/mike-pence-washington-visit-capitol-hill/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220720123824-pence-january-6-restricted.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-20T16:41:54Z", "content": "Members of the conservative Republican Study Committee thanked former Vice President Mike Pence for his actions on January 6 and encouraged him to run for President during a private meeting on Wednes… [+3563 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ellie Kaufman, CNN", "title": "Guantanamo detainee cleared for release after 20 years of detention without trial", "description": "Guantanamo detainee Khalid Ahmed Qasim has been cleared for release from the US detention facility in Cuba after being held for 20 years without a trial, according to documents from the Department of Defense.", "url": "https://www.cnn.com/2022/07/20/politics/guantanamo-detainee-cleared-for-release/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220720120738-khalid-ahmed-qasim-headshot-super-tease.jpg", "publishedAt": "2022-07-20T16:28:34Z", "content": "(CNN)Guantanamo detainee Khalid Ahmed Qasim has been cleared for release from the US detention facility in Cuba after being held for 20 years without a trial, according to documents from the Departme… [+2368 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Scottie Andrew, CNN", "title": "Quidditch is changing its name to quadball to cut ties with J.K. Rowling", "description": "Quidditch, the real-life sport inspired by the airborne game played by young wizards in \"Harry Potter,\" is ditching its whimsical name. Now, athletes will mount broomsticks to play quadball.", "url": "https://www.cnn.com/2022/07/20/us/quidditch-name-change-quadball-cec/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220720113510-01-major-league-quidditch-super-tease.jpg", "publishedAt": "2022-07-20T16:27:53Z", "content": "(CNN)Quidditch, the real-life sport inspired by the airborne game played by young wizards in \"Harry Potter,\" is ditching its whimsical name. Now, athletes will mount broomsticks to play quadball. \r\nU… [+1988 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Shimon Prokupecz, Eric Levenson, Rosa Flores and Rebekah Riess, CNN", "title": "Uvalde superintendent recommends school police chief Pete Arredondo be fired", "description": "The Uvalde, Texas, schools superintendent has recommended the firing of Pete Arredondo, the school police chief who oversaw the response to May's mass shooting at Robb Elementary School, according to a Board of Education meeting agenda.", "url": "https://www.cnn.com/2022/07/20/us/pete-arredondo-uvalde-police-terminated/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220719123703-arredondo-file-super-tease.jpg", "publishedAt": "2022-07-20T16:05:59Z", "content": "(CNN)The Uvalde, Texas, schools superintendent has recommended the firing of Pete Arredondo, the school police chief who oversaw the response to May's mass shooting at Robb Elementary School, accordi… [+4166 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Radina Gigova and Sana Noor Haq, CNN", "title": "Lavrov says Russia's objectives in Ukraine now extend beyond eastern Donbas region", "description": "Russia's objectives in Ukraine now extend beyond the eastern Donbas region into the country's south, a senior government minister has said.", "url": "https://www.cnn.com/2022/07/20/europe/russia-ukraine-military-objective-east-donbas-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220504082855-sergei-lavrov-0324-super-tease.jpg", "publishedAt": "2022-07-20T16:04:36Z", "content": "(CNN)Russia's objectives in Ukraine now extend beyond the eastern Donbas region into the country's south, a senior government minister has said. \r\nAs the war in Ukraine approaches its fifth month, Ru… [+2329 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rebekah Riess, CNN", "title": "Texas grand jury declines to indict man accused of killing 9-year-old girl while shooting at armed robber", "description": "A grand jury in Harris County, Texas, on Tuesday declined to indict a man who allegedly killed 9-year-old Arlene Alvarez while shooting at an armed robber in February, Harris County District Attorney Kim Ogg said.", "url": "https://www.cnn.com/2022/07/20/us/arlene-alvarez-9-year-old-shooting/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220720104331-arlene-alvarez-parents-0216-super-tease.jpg", "publishedAt": "2022-07-20T15:53:04Z", "content": "(CNN)A grand jury in Harris County, Texas, on Tuesday declined to indict a man who allegedly killed 9-year-old Arlene Alvarez while shooting at an armed robber in February, Harris County District Att… [+2593 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jason Morris and Sara Murray, CNN", "title": "Rudy Giuliani ordered to testify before Georgia grand jury investigating Trump on August 9", "description": "The grand jury is investigating Donald Trump's attempts to undermine the 2020 election", "url": "https://www.cnn.com/2022/07/20/politics/rudy-giuliani-fulton-county-georgia/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220411171047-rudy-giuliani-super-tease.jpg", "publishedAt": "2022-07-20T15:22:47Z", "content": "(CNN)A New York judge has ordered Rudy Giuliani to testify next month as a witness before the Fulton County, Georgia, grand jury that's investigating Donald Trump's attempts to undermine the 2020 ele… [+2475 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Luke McGee", "title": "Rishi Sunak and Liz Truss are final candidates in race to succeed Boris Johnson as UK Prime Minister", "description": "Boris Johnson will be succeeded as prime minister of the United Kingdom by either Rishi Sunak or Liz Truss after the Conservative Party leadership race was on Wednesday narrowed down to the final two candidates.", "url": "https://www.cnn.com/2022/07/20/uk/conservative-party-leader-final-two-intl-gbr/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220720105944-sunak-truss-split.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-20T15:09:52Z", "content": "Boris Johnson will be succeeded as prime minister of the United Kingdom by either Rishi Sunak or Liz Truss after the Conservative Party leadership race was on Wednesday narrowed down to the final two… [+529 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nadeen Ebrahim, CNN", "title": "Iran and Russia's friendship is more complicated than it seems", "description": "Russia and Iran say they are now closer than ever as the West clamps down on both states. But some observers say the two countries' highly publicized friendship has both a tumultuous past and a difficult future ahead.", "url": "https://www.cnn.com/2022/07/20/middleeast/russia-iran-friendship-mime-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220720101244-middle-east-nl-0720-mime-putin-iran-meeting-super-tease.jpg", "publishedAt": "2022-07-20T14:51:05Z", "content": "A version of this story first appeared in CNN's Meanwhile in the Middle East newsletter, a three-times-a-week look inside the region's biggest stories. Sign up here.\r\nAbu Dhabi, UAE (CNN)One image di… [+12275 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Horowitz, CNN Business", "title": "Europe's economy is in dire straits. This week presents a crucial test", "description": "Europe's economy, which accounts for almost a fifth of the world's output, is facing its toughest test since the pandemic erupted more than two years ago. A cocktail of risks threatens to throw growth into reverse at a moment of deep uncertainty.", "url": "https://www.cnn.com/2022/07/20/economy/europe-recession-risk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220720091344-01-europe-economy-crucial-week-restricted-super-tease.jpg", "publishedAt": "2022-07-20T14:43:25Z", "content": "London (CNN Business)Europe's economy, which accounts for almost a fifth of the world's output, is facing its toughest test since the pandemic erupted more than two years ago. A cocktail of risks thr… [+7462 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chris Cillizza", "title": "Maryland Republicans just nominated an election denier for governor", "description": "Even as the January 6 committee prepares for a primetime hearing Thursday night, Republican voters in Maryland chose a prominent 2020 election denier as the party's nominee for governor.", "url": "https://www.cnn.com/2022/07/20/politics/dan-cox-maryland-republican-governor-election/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220720103318-03-dan-cox-maryland-071922.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-20T14:37:54Z", "content": "Even as the January 6 committee prepares for a prime-time hearing Thursday night, Republican voters in Maryland selected a prominent 2020 election denier as the partys nominee for governor, CNN proje… [+3980 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Mark Zandi for CNN Business Perspectives", "title": "Opinion: Painful market selloff should end soon", "description": "The stock market is having a rough go. Since hitting an all-time high on the first trading day of the year, stock prices have fallen by more than 20%. Known as a bear market, the losses have been financially painful. Trillions of dollars in stock wealth has e…", "url": "https://www.cnn.com/2022/07/20/perspectives/stock-market-fed-inflation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220715164116-01-nyse-0714-restricted-super-tease.jpg", "publishedAt": "2022-07-20T14:34:54Z", "content": "Mark Zandi is chief economist of Moody's Analytics. The opinions expressed in this commentary are his own. \r\nThe stock market is having a rough go. Since hitting an all-time high on the first trading… [+4423 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Devan Cole, Paul LeBlanc and Jason Carroll, CNN", "title": "Ivana Trump to be mourned at New York funeral", "description": "Ivana Trump, a longtime businessperson and an ex-wife of former President Donald Trump, will be mourned Wednesday in New York.", "url": "https://www.cnn.com/2022/07/20/politics/ivana-trump-funeral/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220714155255-ivana-trump-file-restricted-112918-super-tease.jpg", "publishedAt": "2022-07-20T14:32:07Z", "content": "Washington (CNN)Ivana Trump, a longtime businessperson and an ex-wife of former President Donald Trump, will be mourned Wednesday in New York.\r\nMourners, including the former President, will gather a… [+2862 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Maureen O'Hare, CNN", "title": "A380 superjumbo to test experimental engine", "description": "The world's largest passenger plane, the Airbus A380, has been recruited as a flight test demonstator to trial new open fan engine architecture which could cut CO2 emissions by 20%, compared to today's most efficient engines.", "url": "https://www.cnn.com/travel/article/airbus-cfm-a380-propulsion-demonstrator/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220720152021-a380pgt-super-tease.jpg", "publishedAt": "2022-07-20T14:30:32Z", "content": "(CNN) Take a closer look at the plane on the top of this story. Notice anything different about the front set of engines? \r\nThis Airbus A380, the world's largest passenger jet, has been recruited as … [+2329 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dakin Andone, CNN", "title": "Alex Murdaugh pleads not guilty to murders of his wife and son", "description": "Disgraced South Carolina attorney Alex Murdaugh pleaded not guilty Wednesday to the 2021 murders of his wife and son.", "url": "https://www.cnn.com/2022/07/20/us/alex-murdaugh-pleads-not-guilty/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220720152722-alex-murdaugh-super-tease.jpg", "publishedAt": "2022-07-20T14:18:16Z", "content": "(CNN)Disgraced South Carolina attorney Alex Murdaugh pleaded not guilty Wednesday to the 2021 murders of his wife and son. \r\nThe plea comes nearly a week after Murdaugh was indicted by a Colleton Cou… [+932 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Anna Bahney", "title": "Home prices hit all-time high even as sales slow", "description": "Home prices hit a new all-time high in June, even as home sales declined for the fifth straight month as lack of affordability continues to push buyers out of the market.", "url": "https://www.cnn.com/2022/07/20/homes/existing-home-sales-nar-june-2022/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220715093906-us-home-prices-file.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-20T14:13:43Z", "content": "Home prices hit a new all-time high in June, even as home sales declined for the fifth straight month as lack of affordability continues to push buyers out of the market. \r\nThe median home price was … [+862 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Watch police horse pursue robbery suspect down New York street", "description": "A man who allegedly robbed a sunglass vendor near Times Square was arrested July 16 with the help of a NYPD Special Operations officer on horseback, according to the NYPD. 34-year-old Ignacio Lewis was charged with first-degree robbery, second-degree menacing…", "url": "https://www.cnn.com/videos/us/2022/07/20/nypd-horseback-chase-new-day-sot-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220720091544-nypd-horseback-chase-super-tease.jpg", "publishedAt": "2022-07-20T13:55:03Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Wayne Sterling, CNN", "title": "Swedish golfer Henrik Stenson stripped of Ryder Cup Europe captaincy amid LIV Golf reports", "description": "Swedish professional golfer Henrik Stenson has been stripped of his Ryder Cup Europe captaincy, officials confirmed Wednesday.", "url": "https://www.cnn.com/2022/07/20/sport/henrik-stenson-liv-golf-ryder-cup-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220720143746-henrik-stenson-liv-golf-super-tease.jpg", "publishedAt": "2022-07-20T13:48:20Z", "content": "(CNN)Swedish professional golfer Henrik Stenson has been stripped of his Ryder Cup Europe captaincy, officials confirmed Wednesday.\r\nAccording to multiple reports, Stenson, ranked No. 171 in the worl… [+1031 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Ramirez, CNN", "title": "US cities are taking an unprecedented step", "description": "When Jane Gilbert was appointed last summer as Miami-Dade County's first \"chief heat officer\" — and the first in the country — she was charged with a seemingly impossible task: raise the public's awareness about the dangers of extreme heat to the same level a…", "url": "https://www.cnn.com/2022/07/20/weather/deadly-heat-waves-chief-heat-officers-climate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220609142501-atlanta-thermal-cityscape-super-tease.jpg", "publishedAt": "2022-07-20T13:39:54Z", "content": "Hot records are outpacing cool by more than 10-to-1 this year\r\nState leaders in New York have urged residents to stay indoors in the coming days\r\nUK records its hottest day ever\r\nExtreme heat is bad … [+89 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'Dickie V.' is a sentimental tribute to ESPN's Dick Vitale that's not quite awesome, baby", "description": "There's an understandably strong sentimental streak running through \"Dickie V.,\" a documentary tribute to ESPN analyst Dick Vitale, as he deals with his mortality after being sidelined by cancer. Yet the lack of depth about Vitale's influence over how college…", "url": "https://www.cnn.com/2022/07/20/entertainment/dickie-v-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220719111006-01-dick-vitale-file-2021-super-tease.jpg", "publishedAt": "2022-07-20T13:32:09Z", "content": "(CNN)There's an understandably strong sentimental streak running through \"Dickie V.,\" a documentary tribute to ESPN analyst Dick Vitale, as he deals with his mortality after being sidelined by cancer… [+2889 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eliza Mackintosh, Hafsa Khalil", "title": "Covid. Vacation. Covid.", "description": "Escalating cases in the US and Europe are a reminder of past summer waves, and a warning for the future.", "url": "https://www.cnn.com/2022/07/20/world/coronavirus-newsletter-intl-07-20-22/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/200130165125-corona-virus-cdc-image.jpg?q=x_2,y_0,h_898,w_1596,c_crop/w_800", "publishedAt": "2022-07-20T13:26:12Z", "content": "This is the weekly edition of CNNs coronavirus newsletter. Look out for your roundup every Wednesday. If you havent subscribed yet, sign up here.\r\nWeve got Covid, then a wedding, then Covid, then a v… [+11214 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/tierney-sneed\">Tierney Sneed</a>, <a href=\"/profiles/katelyn-polantz-profile\">Katelyn Polantz</a>, Mike Hayes, <a href=\"/profiles/aditi-sandal\">Aditi Sangal</a> and Maureen Chowdhury, CNN", "title": "Steve Bannon's contempt of Congress trial", "description": "Former Trump aide Steve Bannon is on trial on contempt of Congress charges for his failure to comply with Jan. 6 House committee subpoenas last year. Follow here for live news updates.", "url": "https://www.cnn.com/politics/live-news/steve-bannon-trial-contempt-congress-07-20-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220719100440-02-steve-bannon-0718-super-tease.jpg", "publishedAt": "2022-07-20T12:30:42Z", "content": "Steve Bannon is on trial on two criminal charges for his failure to comply with the House's Jan. 6, 2021, investigation 10 months after receiving subpoenas from the select committee.\r\nThe polarizing … [+3402 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rosa Prince", "title": "Opinion: In melting Britain, a kind of madness takes over", "description": "Welcome to Britain, where this week urban fires spontaneously erupted, the Queen's guards melted under bearskins, trains ground to a halt and Members of Parliament -- grudgingly -- removed their jackets, writes Rosa Prince.", "url": "https://www.cnn.com/2022/07/20/opinions/uk-britain-heatwave-hot-weather-prince/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220720111215-01-uk-heatwave-cultural.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-20T12:25:31Z", "content": "Editors Note: Rosa Prince is editor of The House magazine. She is the former assistant political editor of The Daily Telegraph and author of the books Theresa May: The Enigmatic Prime Minister and Co… [+4647 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Horowitz, CNN Business", "title": "Netflix finally told investors what they want to hear. Now comes the hard part", "description": "It wasn't long ago that Wall Street would have bristled at such grim news out of Netflix: Between April and June, the company lost 970,000 subscribers.", "url": "https://www.cnn.com/2022/07/20/investing/premarket-stocks-trading/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220720073624-01-netflix-on-tablet-file-super-tease.jpg", "publishedAt": "2022-07-20T12:18:47Z", "content": "A version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here. You can listen to an audio version of the newsletter by clicking the … [+6882 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Peter Valdes-Dapena", "title": "First on CNN: Goodyear developing airless metal tires for GM's moon buggy", "description": "General Motors and Lockheed Martin are working together on a new Lunar Rover. but it needs tires. So, Goodyear is now joining the team.", "url": "https://www.cnn.com/2022/07/20/business/goodyear-lunar-rover-tire/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220719084113-goodyear-lunar-rover-new-tires-rendering.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-20T12:17:49Z", "content": "General Motors and Lockheed Martin are working together on a new Lunar Rover. but it needs tires. So, Goodyear is now joining the team.\r\nGM\r\n(GM) and Goodyear\r\n(GT) have been over this dry, dusty gro… [+4014 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Leah Dolan, CNN", "title": "Look of the week: Brad Pitt's breezy linen skirt", "description": "The movie star turned up to the film premier of \"Bullet Train\" in a chocolate brown linen skirt and jacket -- but this isn't the first time Pitt has gone viral for a leggy look.", "url": "https://www.cnn.com/style/article/brad-pitt-skirt-red-carpet-ltw/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220720120927-brad-pitt-skirt-red-carpet-2-super-tease.jpg", "publishedAt": "2022-07-20T12:04:14Z", "content": "This week, many of us have been dealing with the record-breaking temperatures beating down across Europe and parts of America. While the worrying heat may have you wishing you could draw the blinds, … [+2065 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eliott C. McLaughlin", "title": "Google honors slain Uvalde youngster's wish: 'I want the world to see my art'", "description": "Before she was gunned down with her classmates, 10-year-old Alithia Haven Ramirez, of Uvalde, Texas, wanted to be an artist who shared her creations with the world.", "url": "https://www.cnn.com/2022/07/20/us/uvalde-victim-google-doodle/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220719120624-alithia-haven-ramirez-google-doodle.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-20T11:53:04Z", "content": "Before she was gunned down with her classmates, 10-year-old Alithia Haven Ramirez, of Uvalde, Texas, wanted to be an artist who shared her creations with the world. \r\nGoogle is obliging. \r\nEarlier th… [+3260 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Michelle Toh, CNN Business", "title": "Next 'Squid Game?' Big ratings on Netflix boosts hope for next Korean hit", "description": "A new show about a young female attorney has become another South Korean hit on Netflix, giving investors hope that the producer may have another \"Squid Game\"-like success on its hands.", "url": "https://www.cnn.com/2022/07/20/media/extraordinary-attorney-woo-netflix-stock-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220720104021-korea-netflix-extraordinary-attorney-woo-super-tease.jpeg", "publishedAt": "2022-07-20T11:51:36Z", "content": "London (CNN Business)A new show about a young female attorney has become another South Korean hit on Netflix, giving investors hope that the producer may have another \"Squid Game\"-like success on its… [+1620 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nimi Princewill, CNN", "title": "Chinese man charged with child trafficking in Malawi following racist video allegations", "description": "Police in Malawi have charged a Chinese man with child trafficking after a BBC documentary accused him of filming children chanting racist phrases mocking themselves in Chinese, according to authorities in the southeast African country.", "url": "https://www.cnn.com/2022/07/20/africa/chinese-national-malawi-children-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220719150410-01-chinese-national-arrested-malawi-viral-video-super-tease.jpg", "publishedAt": "2022-07-20T11:47:22Z", "content": "(CNN)Police in Malawi have charged a Chinese man with child trafficking after a BBC documentary accused him of filming children chanting racist phrases mocking themselves in Chinese, according to aut… [+1143 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kent Sepkowitz", "title": "Opinion: Covid-19 continues to surprise us", "description": "The million-dollar question is not whether BA.5 will cause a major uptick in infection across the country -- it has, and it will -- but rather whether anyone, including those who have been vaccinated or have developed infection or both, is safe from its vorac…", "url": "https://www.cnn.com/2022/07/20/opinions/covid-ba-5-vaccines-sepkowitz/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220715203352-covid-19-testing.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-20T11:40:57Z", "content": "Editors Note: Kent Sepkowitz is a physician and infectious disease expert at Memorial Sloan Kettering Cancer Center in New York. The views expressed in this commentary are his own. View more opinion … [+5505 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rob Picheta, CNN", "title": "Europe is burning as record-breaking heat wave moves east and brings blazes to Greece, Italy and France", "description": "Millions of people across Europe were sweltering in yet more extreme heat on Wednesday, as raging wildfires tore through the countryside and exposed just how unprepared some of Europe's biggest cities are for the climate crisis.", "url": "https://www.cnn.com/2022/07/20/europe/europe-heat-wave-wednesday-wildfires-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220720114329-01-europe-heatwave-super-tease.jpg", "publishedAt": "2022-07-20T11:39:37Z", "content": "London (CNN)Millions of people across Europe were sweltering in yet more extreme heat on Wednesday, as raging wildfires tore through the countryside, forcing thousands from their homes and blanketing… [+5174 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amy Woodyatt, CNN", "title": "Jake Wightman bags 1,500m win as his commentator father narrates", "description": "All eyes were on Great Britain's Jake Wightman as he took the gold in the men's 1,500m final -- but one spectator at this year's World Athletics Championships was certainly more delighted than most.", "url": "https://www.cnn.com/2022/07/20/sport/jake-wightman-win-father-commentor-intl-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220720113118-jake-wightman-super-tease.jpg", "publishedAt": "2022-07-20T11:11:13Z", "content": "(CNN)All eyes were on Great Britain's Jake Wightman as he took the gold in the men's 1,500m final -- but one spectator at this year's World Athletics Championships was certainly more delighted than m… [+1353 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alex Rogers, CNN", "title": "Trump-backed Arizona Senate candidate escalates election fears ahead of GOP primary", "description": "Arizona Republican Blake Masters, who earned Donald Trump's endorsement for the Senate race by embracing the former President's lies that he won the 2020 election, has turned to questioning whether the 2022 midterm election will be legitimate, as he tries to …", "url": "https://www.cnn.com/2022/07/20/politics/blake-masters-arizona-senate-primary-election-fears/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220719210708-blake-masters-file-070122-super-tease.jpg", "publishedAt": "2022-07-20T11:02:59Z", "content": "(CNN)Arizona Republican Blake Masters, who earned Donald Trump's endorsement for the Senate race by embracing the former President's lies that he won the 2020 election, has turned to questioning whet… [+6965 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alexandra Meeks, CNN", "title": "5 things to know for July 20: Trump, Mall shooting, Sri Lanka, Heat, Marriage equality", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2022/07/20/us/five-things-july-20-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211223213345-donald-trump-file-09252021-super-tease.jpg", "publishedAt": "2022-07-20T10:50:14Z", "content": "(CNN)America's CEOs made 324 times more than the workers at their companies last year, according to a new report from one of the nation's top union groups. S&amp;P 500 CEOs on average got a roughly 1… [+6650 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Neeraj G. Patel, CNN", "title": "How is monkeypox treated?", "description": "As the monkeypox outbreak continues to grow around the world, many people who have gotten sick with the virus have had mild symptoms and were able to recover without any monkeypox-specific treatment.", "url": "https://www.cnn.com/2022/07/20/health/monkeypox-treatment/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220714153026-monkeypox-questions-update-super-tease.jpg", "publishedAt": "2022-07-20T10:45:50Z", "content": "(CNN)As the monkeypox outbreak continues to grow around the world, many people who have gotten sick with the virus have had mild symptoms and were able to recover without any monkeypox-specific treat… [+9155 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sam Whitehead, Kaiser Health News", "title": "A new tool monitoring the spread of HIV raises privacy concerns", "description": "Robert Suttle has seen firsthand the legal risks of having HIV.", "url": "https://www.cnn.com/2022/07/20/health/hiv-tool-privacy-concerns-khn/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220719142149-hiv-red-ribbon-stock.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-20T10:36:21Z", "content": "Robert Suttle has seen firsthand the legal risks of having HIV.\r\nIn 2008, Suttle said, a former partner accused him of not disclosing he was HIV-positive. He was charged under Louisiana law with inte… [+8468 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Issy Ronald, CNN", "title": "Thousands sign petition to allow Novak Djokovic to play at the US Open", "description": "More than 12,000 people have signed an online petition on change.org calling for the United States Tennis Association (USTA) and the US government to allow Novak Djokovic to compete in the US Open.", "url": "https://www.cnn.com/2022/07/20/tennis/novak-djokovic-us-open-petition-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220720041958-02-novak-djokovic-us-open-petition-file-super-tease.jpg", "publishedAt": "2022-07-20T10:04:41Z", "content": "(CNN)More than 12,000 people have signed an online petition on change.org calling for the United States Tennis Association (USTA) and the US government to allow Novak Djokovic to compete in the US Op… [+808 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amy Woodyatt, CNN", "title": "Cameraman accidentally becomes obstacle in World Athletics Championship race", "description": "A cameraman became an unwitting star of this week's 3,000m steeplechase at the World Athletics Championships -- by stepping out into the track as competitors dashed past.", "url": "https://www.cnn.com/2022/07/20/sport/camera-man-steeplechase-obstacle-intl-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220720042726-01-cameraman-intl-spt-super-tease.jpg", "publishedAt": "2022-07-20T09:49:03Z", "content": "(CNN)A cameraman became an unwitting star of this week's 3,000m steeplechase at the World Athletics Championships -- by stepping out into the track as competitors dashed past. \r\nThe 15 athletes were … [+1140 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ben Morse, CNN", "title": "Robert Lewandowski signs for Barcelona as Bayern boss Julian Nagelsmann hits out", "description": "Robert Lewandowski's transfer to Barcelona was announced on Tuesday, and it's fair to say Bayern Munich boss Julian Nagelsmann is baffled by it.", "url": "https://www.cnn.com/2022/07/20/football/robert-lewandowski-barcelona-bayern-julian-nagelsmann-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220720092538-01-robert-lewandowski-barca-super-tease.jpg", "publishedAt": "2022-07-20T09:39:46Z", "content": "(CNN)Robert Lewandowski's transfer to Barcelona was announced on Tuesday, and it's fair to say Bayern Munich boss Julian Nagelsmann is baffled by it. \r\nThe 33-year-old joined the Spanish giant from B… [+2435 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jessie Yeung and Junko Ogura, CNN", "title": "Japanese city hunts for wild monkey following spate of attacks", "description": "A wild monkey is terrorizing a small city in southwestern Japan, breaking into homes to bite and claw residents amid an ongoing hunt for the animal, officials said.", "url": "https://www.cnn.com/2022/07/20/asia/japan-ogori-yamaguchi-monkey-attack-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220720084602-origi-japan-monkey-attack-map-super-tease.jpg", "publishedAt": "2022-07-20T09:06:26Z", "content": "Tokyo (CNN)A wild monkey is terrorizing a small city in southwestern Japan, breaking into homes to bite and claw residents amid an ongoing hunt for the animal, officials said.\r\nSome 20 people in the … [+1357 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Silvia Marchetti, CNN", "title": "Sardinia's '100 Towers Path,' one of Italy's most stunning coastal hikes", "description": "Made up of over 1,000 kilometers of mostly oceanfront trails, the 'Cammino 100 Torri' -- or 100 Towers Path -- circumnavigates Italy's second-largest island region. This epic round-trip journey is filled with ancient architecture and stunning beaches.", "url": "https://www.cnn.com/travel/article/sardinia-coastal-hike-italy-100-towers-path-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220708120907-12-sardinia-100-towers-path-sinis-super-tease.jpg", "publishedAt": "2022-07-20T09:03:04Z", "content": "Editor's Note Monthly Ticket is a CNN Travel series that spotlights some of the most fascinating topics in the travel world. In July, we're hitting the trails to explore the world's greatest hikes.\r\n… [+7413 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Devan Cole", "title": "60% of Americans approved of the Supreme Court last July. Now, it's 38%, according to a new poll", "description": "Americans' approval of the Supreme Court has fallen again, according to a new poll released Wednesday, with just 38% of the country saying it approves of the nation's highest court after it overturned Roe v. Wade", "url": "https://www.cnn.com/2022/07/20/politics/supreme-court-job-approval-marquette-poll/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220624114738-11-roe-wade-overturned-0624.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-20T09:03:00Z", "content": "Americans approval of the Supreme Court has fallen again, according to a new poll released Wednesday, with just 38% of the country saying it approves of the nations highest court after it overturned … [+3054 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Liptak, CNN", "title": "Biden will unveil new steps to confront extreme heat and boost wind power in remarks at Massachusetts plant", "description": "President Joe Biden plans to announce new funding for communities facing extreme heat and steps to boost the offshore wind industry when he speaks Wednesday at a defunct coal power plant.", "url": "https://www.cnn.com/2022/07/20/politics/climate-extreme-heat-wind-power-biden-massachusetts-speech/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220719074130-01-biden-cop26-file-super-tease.jpg", "publishedAt": "2022-07-20T09:01:33Z", "content": "(CNN)President Joe Biden plans to announce new funding for communities facing extreme heat and steps to boost the offshore wind industry when he speaks Wednesday at a defunct coal power plant. \r\nA Wh… [+1691 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sarah Molano, CNN", "title": "These are the signs that you're in a toxic work environment", "description": "Micromanaging bosses and little-to-no work-life balance are a couple of characteristics of a toxic work environment. Experts share how to handle it and thrive in your career.", "url": "https://www.cnn.com/2022/07/20/health/toxic-workplace-signs-solutions-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220718165439-frustrated-employee-stock-super-tease.jpg", "publishedAt": "2022-07-20T09:01:27Z", "content": "(CNN)With labor unionization efforts underway at Amazon and Starbucks, people quitting in record numbers and continued delays in returning to the office, workers appear to be putting their foot down … [+5451 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Liam Reilly, Artemis Moshtaghian", "title": "Boston police unions sue city officials for restricting use of tear gas and other non-lethal policing tactics", "description": "Two Boston police unions have sued city officials, accusing them of interfering with police procedures by barring the use of \"non-lethal tools,\" including pepper spray.", "url": "https://www.cnn.com/2022/07/20/us/boston-police-unions-sue-over-non-lethal-force-ban/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220720030051-01-boston-police-unions-sue-restricted.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-20T08:44:16Z", "content": "Two Boston police unions have sued city officials, accusing them of interfering with police procedures by barring the use of non-lethal tools, including pepper spray. \r\nThe complaint filed Monday in … [+2593 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Sasha Dovzhyk", "title": "Opinion: Secret diary of a Ukrainian 'fixer'", "description": "Two days after Russia launched its invasion, Sasha Dovzhyk got a call from a Ukrainian friend who was leaving her film job in Paris. 'A French radio crew is coming to Lviv,' she said. 'Would you like to work with them as a fixer?' Dovzhyk is now one of many U…", "url": "https://www.cnn.com/2022/07/20/opinions/ukraine-fixer-war-foreign-journalists-dovzhyk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220719143222-02-ukraine-fixer-super-tease.jpg", "publishedAt": "2022-07-20T07:33:55Z", "content": "Sasha Dovzhyk is a special projects curator at the Ukrainian Institute London and has a PhD in English and Comparative Literature from Birkbeck, University of London. She divides her time between the… [+7493 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alex Rogers, Annie Grayer, Kristin Wilson, Nectar Gan", "title": "China warns US of 'forceful measures' if Nancy Pelosi visits Taiwan", "description": "China warned Tuesday it would take \"resolute and forceful measures\" if US House of Representatives Speaker Nancy Pelosi visits Taiwan, in what would be the highest-level delegation from the United States to the self-governing island in 25 years.", "url": "https://www.cnn.com/2022/07/20/china/china-warns-pelosi-taiwan-visit-intl-hnk/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220720001043-02-china-warns-pelosi-taiwan-visit.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-20T07:11:41Z", "content": "China warned Tuesday it would take resolute and forceful measures if US House of Representatives Speaker Nancy Pelosi visits Taiwan, in what would be the highest-level delegation from the United Stat… [+2538 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jessie Yeung", "title": "Russia's war in Ukraine", "description": "Russian forces are renewing efforts to break through Ukrainian defenses in eastern Ukraine and stepping up missile strikes in the south of the country.  Follow here for live news updates.", "url": "https://www.cnn.com/europe/live-news/russia-ukraine-war-news-07-20-22/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220719133206-kharkiv.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-20T07:00:35Z", "content": "Russian President Vladimir Putin arrived in Iran on Tuesday for his first international trip beyond the borders of the former Soviet Union since launching his invasion of Ukraine, which effectively r… [+1561 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Taylor Romine, CNN", "title": "Charlotte Hornets' Miles Bridges charged with felony domestic and child abuse after alleged assault on partner", "description": "Charlotte Hornets forward Miles Bridges was charged with felony domestic and child abuse stemming from an alleged assault on his partner that happened in front of their children, Los Angeles prosecutors said Tuesday.", "url": "https://www.cnn.com/2022/07/20/sport/nba-miles-bridges-charged-domestic-child-abuse-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220720013112-01-nba-player-miles-bridges-restricted-super-tease.jpg", "publishedAt": "2022-07-20T06:38:28Z", "content": "(CNN)Charlotte Hornets forward Miles Bridges was charged with felony domestic and child abuse stemming from an alleged assault on his partner that happened in front of their children, Los Angeles pro… [+2170 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brad Lendon, CNN", "title": "US Navy destroyer enters Chinese-claimed waters for third time in a week", "description": "A US Navy warship sailed through the Taiwan Strait on Tuesday, the third time in a week the vessel has entered waters claimed by China, heightening tensions between Washington and Beijing.", "url": "https://www.cnn.com/2022/07/20/asia/us-navy-destroyer-taiwan-strait-intl-hnk-ml/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220719214800-01-us-navy-destroyer-taiwan-strait-super-tease.jpeg", "publishedAt": "2022-07-20T06:05:50Z", "content": "Seoul, South Korea (CNN)A US Navy warship sailed through the Taiwan Strait on Tuesday, the third time in a week the vessel has entered waters claimed by China, heightening tensions between Washington… [+2986 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nectar Gan, CNN", "title": "China endures summer of extreme weather as record rainfall and scorching heat wave cause havoc", "description": "Since the start of summer, scenes of devastation and misery have emerged from across China, as the world's most populous nation grapples with an unrelenting torrent of extreme weather emergencies.", "url": "https://www.cnn.com/2022/07/20/china/china-summer-extreme-weather-climate-change-intl-hnk-mic/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220719231839-jiangxi-flood-2022-super-tease.jpg", "publishedAt": "2022-07-20T04:26:10Z", "content": "A version of this story appeared in CNN's Meanwhile in China newsletter, a three-times-a-week update exploring what you need to know about the country's rise and how it impacts the world. Sign up her… [+7582 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Stephen Collinson, CNN", "title": "Biden is running out of time to lead on climate", "description": "The Northern Hemisphere is sweltering in a miserable vision of future life seared by climate change, just at the moment when political momentum for aggressive, world-leading action by the United States has gone cold.", "url": "https://www.cnn.com/2022/07/20/politics/biden-climate-leadership-analysis/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220719231307-biden-climate-leadership-analysis-super-tease.jpg", "publishedAt": "2022-07-20T04:19:32Z", "content": "(CNN)The Northern Hemisphere is sweltering in a miserable vision of future life seared by climate change, just at the moment when political momentum for aggressive, world-leading action by the United… [+8830 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "K-Pop star J-Hope to make music history at Chicago's Lollapalooza festival", "description": "K-Pop star J-Hope of the boy band sensation BTS will perform this month as the finale act at Chicago's annual Lollapalooza show, becoming the first South Korean artist to headline a major US musical festival, organizers said on Tuesday.", "url": "https://www.cnn.com/2022/07/20/entertainment/bts-singer-j-hope-lollapalooza-history-intl-hnk/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220719234947-02-bts-singer-j-hope-lollapalooza-history.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-20T04:14:30Z", "content": "K-Pop star J-Hope of the boy band sensation BTS will perform this month as the finale act at Chicagos annual Lollapalooza show, becoming the first South Korean artist to headline a major US musical f… [+1769 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brad Lendon, Yoonjung Seo", "title": "South Korea joins supersonic fighter club as KF-21 jet takes to skies", "description": "South Korea's homegrown KF-21 Boramae fighter jet flew for the first time on Tuesday, putting the country among the few nations to have developed and flown an advanced supersonic fighter.", "url": "https://www.cnn.com/2022/07/19/asia/south-korea-kf-21-fighter-jet-first-flight-intl-hnk-ml/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220719195424-01-south-korea-kf-21-fighter-jet-first-flight-intl-hnk-ml.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-20T03:48:59Z", "content": "South Koreas homegrown KF-21 Boramae fighter jet flew for the first time on Tuesday, putting the country among the few nations to have developed and flown an advanced supersonic fighter.\r\nThe prototy… [+3511 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jamie Gangel, CNN", "title": "Secret Service provided a single text exchange to IG after request for many records", "description": "The Secret Service was only able to provide a single text exchange to the DHS inspector general who had requested a month's worth of records for 24 Secret Service personnel, according to a letter to the House select committee investigating January 6, 2021, an…", "url": "https://www.cnn.com/2022/07/19/politics/secret-service-text-messages-january-6-inspector-general/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220715225413-01-january-6-secret-service-james-murray-file-super-tease.jpg", "publishedAt": "2022-07-20T03:20:41Z", "content": "(CNN)The Secret Service was only able to provide a single text exchange to the DHS inspector general who had requested a month's worth of records for 24 Secret Service personnel, according to a lette… [+1211 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "Mega Millions jackpot soars to $555 million ahead of latest drawing", "description": "The Mega Millions jackpot climbed to $555 million ahead of Tuesday's drawing, making it the fifth largest in the lottery's history.", "url": "https://www.cnn.com/2022/07/19/us/mega-millions-jackpot-tuesday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220719224956-mega-millions-jackpot-fifth-largest-super-tease.jpg", "publishedAt": "2022-07-20T03:18:40Z", "content": "(CNN)The Mega Millions jackpot climbed to $555 million ahead of Tuesday's drawing, making it the fifth largest in the lottery's history. \r\nStrong ticket sales helped push the prize to its historical … [+742 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Naomi Thomas", "title": "NYC monkeypox numbers are 'definitively' not the full picture, health official says", "description": "New York City's monkeypox case numbers don't show the full picture of how bad the outbreak is, and demand for vaccines in the city is outstripping supply, city Health Commissioner Dr. Ashwin Vasan said Tuesday.", "url": "https://www.cnn.com/2022/07/19/health/nyc-health-commissioner-monkeypox/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220719142010-monkeypox-nyc-health-commissioner.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-20T01:27:24Z", "content": "New York Citys monkeypox case numbers dont show the full picture of how bad the outbreak is, and demand for vaccines in the city is outstripping supply, city Health Commissioner Dr. Ashwin Vasan said… [+3747 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Barbara Starr and Ellie Kaufman, CNN", "title": "US Army to likely miss recruiting goal of new troops by nearly 40,000 over the next 2 years", "description": "The US Army is now projecting that for the next two years it will massively fail to recruit as many troops as it hoped, falling short by nearly 40,000 new recruits, according to the latest estimates and testimony from the Army's second highest leader.", "url": "https://www.cnn.com/2022/07/19/politics/us-army-recruiting-numbers-fall/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220719171301-us-army-recruitment-super-tease.jpg", "publishedAt": "2022-07-20T01:07:46Z", "content": "(CNN)The US Army is now projecting that for the next two years it will massively fail to recruit as many troops as it hoped, falling short by nearly 40,000 new recruits, according to the latest estim… [+2197 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Andrew Kaczynski, CNN", "title": "Top spokeswoman for Nevada Republican Senate nominee marched on Jan. 6 with Oath Keepers, including one charged with sedition", "description": "The new communications director for the Republican Senate nominee in Nevada -- a key state that could determine control in Washington -- marched to the US Capitol on January 6, 2021, with two members of the far-right extremist group the Oath Keepers including…", "url": "https://www.cnn.com/2022/07/19/politics/courtney-holland-january-6-oath-keepers-kfile/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220719142911-01-courtney-holland-parler-screengrab-super-tease.jpg", "publishedAt": "2022-07-20T00:14:41Z", "content": "(CNN)The new communications director for the Republican Senate nominee in Nevada -- a key state that could determine control in Washington -- marched to the US Capitol on January 6, 2021, with two me… [+7597 chars]"}]}