{"status": "ok", "totalResults": 101, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Radina Gigova, Tara John and Anna Chernova, CNN", "title": "Belarus jails student a year after forcing down the airliner she was traveling on", "description": "Sofia Sapega, a Russian law student arrested with her Belarusian dissident boyfriend last year when Belarus forced a Ryanair airliner to land, was sentenced Friday to six years in prison for inciting social hatred, Russian state news agency TASS reports.", "url": "https://www.cnn.com/2022/05/06/europe/belarus-ryanair-sentence-sofia-sapega-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220506082155-sofia-sapega-hearing-0506-super-tease.jpg", "publishedAt": "2022-05-06T14:33:42Z", "content": "(CNN)Sofia Sapega, a Russian law student arrested with her Belarusian dissident boyfriend last year when Belarus forced a Ryanair airliner to land, was sentenced Friday to six years in prison for inc… [+2448 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marianne Garvey", "title": "Kim Cattrall has moved on from 'Sex and the City' and is doing just fine", "description": "Kim Cattrall has moved on from her days in \"Sex in the City,\" but Samantha Jones is still with her.", "url": "https://www.cnn.com/2022/05/06/entertainment/kim-cattrall-variety-power-of-women-speech/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/171023131516-kim-cattrall-super-tease.jpg", "publishedAt": "2022-05-06T14:09:40Z", "content": "(CNN)Kim Cattrall has moved on from her days in \"Sex in the City,\" but Samantha Jones is still with her.\r\nCattrall, who played the sex-positive, powerful publicist Samantha in \"Sex and the City\" for … [+1592 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matias Grez", "title": "Rafael Nadal says injuries leave him in pain 'every single day'", "description": "An interaction with a reporter laid bare the toll a 21-year career has taken on Rafael Nadal's body, as the Spanish tennis star said he endures pain \"every single day.\"", "url": "https://www.cnn.com/2022/05/06/tennis/rafael-nadal-suffering-chronic-injury-spt-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220506144534-nadal-injury.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-06T13:53:01Z", "content": "An interaction with a reporter laid bare the toll a 21-year career has taken on Rafael Nadals body, as the Spanish tennis star said he endures pain every single day.\r\nAfter his round of 16 win over D… [+1682 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Laura Beers", "title": "Opinion: George Orwell is exactly the right voice for our time", "description": "\"1984\" -- which has recently returned to bestseller lists -- and the term \"Orwellian\" have been used (and abused) for decades, argues historian Laura Beers, but our current moment arguably IS genuinely \"Orwellian.\"", "url": "https://www.cnn.com/2022/05/06/opinions/george-orwell-1984-beers/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220505222006-george-orwell-mural-super-tease.jpg", "publishedAt": "2022-05-06T13:45:33Z", "content": "Laura Beers is a professor of history at American University, where she teaches a seminar on George Orwell and the making of the modern world. She is the author of \"Your Britain: Media and the Making… [+7867 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Lowry, CNN", "title": "'Doctor Strange' enters the multiverse, in what might be the most insanely Marvel movie yet", "description": "\"Doctor Strange in the Multiverse of Madness\" might be the most insanely Marvel movie ever, for good and ill. Unleashing the infinite possibilities of the multiverse throws open the studio's toy chest, but the anything-goes aspects of that can be alternately …", "url": "https://www.cnn.com/2022/05/06/entertainment/doctor-strange-multiverse-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211222135706-01-doctor-strange-trailer-release-122221-super-tease.jpg", "publishedAt": "2022-05-06T13:24:01Z", "content": "(CNN)\"Doctor Strange in the Multiverse of Madness\" might be the most insanely Marvel movie ever, for good and ill. Unleashing the infinite possibilities of the multiverse throws open the studio's toy… [+3401 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jessica DuLong", "title": "Who profits from our humiliation? Cathy O'Neil sheds new light on what she calls 'weaponized' shame", "description": "Shame has existed since the first humans walked the Earth, according to mathematician and journalist Cathy O'Neil. But lately its evolutionary function -- to encourage pro-social behavior by enforcing norms that help sustain societies -- has been hijacked by …", "url": "https://www.cnn.com/2022/05/06/health/shame-machine-cathy-oneil-wellness/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220504131413-20220504-weaponized-shame.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-06T13:11:35Z", "content": "Shame has existed since the first humans walked the Earth, according to mathematician and journalist Cathy ONeil. But lately its evolutionary function to encourage pro-social behavior by enforcing no… [+8371 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nadeen Ebrahim", "title": "Why US politicians are trying to break the world's oil cartel now", "description": "A decades-old, failed effort by United States politicians to break the chokehold of a select few countries on the oil market has found new life as the war in Ukraine raised prices to an almost 14-year high.", "url": "https://www.cnn.com/2022/05/06/business/nopec-us-oil-mime-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220506104656-02-mideast-newsletter-opec.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-06T13:01:24Z", "content": "Editors Note: A version of this story first appeared in CNNs Meanwhile in the Middle East newsletter, a three-times-a-week look inside the regions biggest stories. Sign up here.\r\nA decades-old, faile… [+12281 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Daniella Diaz, CNN", "title": "Pelosi announces House will vote on bill next week that would allow staffers to unionize", "description": "House Speaker Nancy Pelosi announced in a letter to her colleagues Friday morning the chamber will vote on legislation that would allow Capitol Hill staffers to unionize next week, a major development for labor activists who have pushed for the option for yea…", "url": "https://www.cnn.com/2022/05/06/politics/nancy-pelosi-house-staffers-union/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211120202312-nancy-pelosi-file-102121-super-tease.jpg", "publishedAt": "2022-05-06T12:38:31Z", "content": "(CNN)House Speaker Nancy Pelosi announced in a letter to her colleagues Friday morning the chamber will vote on legislation that would allow Capitol Hill staffers to unionize next week, a major devel… [+1241 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Maureen O'Hare, CNN", "title": "We have the technology to end the airport liquid ban, so why is it still in place?", "description": "CT scans offering 3D images of passenger bags can eliminate the need for 100-milieter restrictions on airplane hand luggage and speed up security checks. Some airports already have the tech, indicating changes could be on the way after years of intensified lu…", "url": "https://www.cnn.com/travel/article/when-will-100-ml-liquid-rule-end/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220506125611-snn-security-screening-2-super-tease.jpg", "publishedAt": "2022-05-06T12:25:10Z", "content": "(CNN) A quiet revolution is underway in how we transit airport security -- but most of us won't even have noticed. \r\nThe requirement to put liquids into 100-milliliter containers and take electronics… [+6640 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sam Fossum, CNN", "title": "Biden to announce voluntary 3D printing initiative during trip to Ohio", "description": "President Joe Biden will announce the launch of a new voluntary initiative to boost the use of 3D printing in domestic supply chains during his trip to Ohio on Friday, according to two senior administration officials and a White House fact sheet touting the a…", "url": "https://www.cnn.com/2022/05/06/politics/joe-biden-manufacturers-3d-printing-initiative/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220505205850-joe-biden-file-050422-super-tease.jpg", "publishedAt": "2022-05-06T11:57:57Z", "content": "(CNN)President Joe Biden will announce the launch of a new voluntary initiative to boost the use of 3D printing in domestic supply chains during his trip to Ohio on Friday, according to two senior ad… [+2254 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ben Church", "title": "2022 Kentucky Derby: Everything you need to know about the 'Greatest Two Minutes in Sports'", "description": "The 148th edition of the Kentucky Derby is set to take place on Saturday as the iconic race looks to move on from last year's controversy.", "url": "https://www.cnn.com/2022/05/06/sport/kentucky-derby-2022-preview-spt-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220505145434-derby-trophy.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-06T11:42:57Z", "content": "The 148th edition of the Kentucky Derby is set to take place on Saturday as the iconic race looks to move on from last years controversy. \r\nMedina Spirit crossed the line first in 2021, but the horse… [+2307 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jen Christensen, CNN", "title": "Children get long Covid, too, and it can show up in unexpected ways", "description": "November 10 is a day Kim Ford remembers too well. It was the day last year when her 9-year-old son, Jack, was scheduled to get his Covid-19 vaccine at the school clinic. They were excited that he'd finally have some protection, but on November 9, he had the s…", "url": "https://www.cnn.com/2022/05/06/health/children-long-covid-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220504220627-01-kid-long-covid-super-tease.jpeg", "publishedAt": "2022-05-06T11:21:43Z", "content": "(CNN)November 10 is a day Kim Ford remembers too well. It was the day last year when her 9-year-old son, Jack, was scheduled to get his Covid-19 vaccine at the school clinic. They were excited that h… [+8714 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ella Nilsen, CNN", "title": "Solar energy projects are grinding to a halt in the US amid investigation into parts from China", "description": "The solar energy industry has been thrown into a panic and projects are grinding to a halt after the Biden administration launched an investigation that some solar CEOs worry could tank the industry.", "url": "https://www.cnn.com/2022/05/06/politics/solar-energy-china-investigation-climate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220504201844-05-biden-solar-energy-china-commerce-investigation-super-tease.jpg", "publishedAt": "2022-05-06T11:10:48Z", "content": "'The sound of money': Wind energy is booming in deep-red Republican states\r\nSolar energy has the potential to power 40% of US electricity by 2035\r\nWind energy in the US hit a major milestone in early… [+241 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alexandra Meeks", "title": "5 things to know for May 6: Ukraine, Roe v. Wade, Covid-19, Wildfires, Immigration", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2022/05/06/us/five-things-may-6-trnd/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220506070801-azovstal-050522.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-06T11:08:45Z", "content": "Mother Nature is cooking up a historic heat wave for Mothers Day weekend. Hot temperatures will bake much of Texas, the Plains and the Midwest tomorrow and into early next week with some areas feelin… [+7119 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Parija Kavilanz, CNN Business", "title": "Ukrainian startup is bringing school to displaced students", "description": "Russia's continuing assault in Ukraine has devastated the country and the lives of millions of its citizens. The youngest among them — Ukraine's children — have been robbed of the ability to attend school and learn in a classroom, sitting next to their peers …", "url": "https://www.cnn.com/2022/05/06/business/ukraine-startup-keiki/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220505173839-01-ukrainian-startup-keiki-super-tease.jpg", "publishedAt": "2022-05-06T11:05:42Z", "content": "New York (CNNBusiness)Russia's continuing assault in Ukraine has devastated the country and the lives of millions of its citizens. The youngest among them Ukraine's children have been robbed of the a… [+4010 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Luke McGee, CNN", "title": "Economic pressure: Putin's reputed girlfriend Alina Kabaeva included in proposed EU sanctions list, sources say", "description": "Alina Kabaeva, a woman who has previously been romantically linked to Russian President Vladimir Putin, is included in the sixth proposed package of European Union sanctions against Russia over its invasion of Ukraine, according to two European diplomatic sou…", "url": "https://www.cnn.com/2022/05/06/europe/putins-reputed-girlfriend-alina-kabaeva-eu-sanctions-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220506054733-alina-kabaeva-file-09272011-super-tease.jpg", "publishedAt": "2022-05-06T10:44:19Z", "content": "(CNN)Alina Kabaeva, a woman who has previously been romantically linked to Russian President Vladimir Putin, is included in the sixth proposed package of European Union sanctions against Russia over … [+1477 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Anneken Tappe, CNN Business", "title": "America's job growth is starting to slow", "description": "The days of millions of job gains per month are behind us, and the US labor market recovery has now moved into a new phase, complete with new challenges: It's not that companies don't want to hire, it's that there were nearly two available positions for every…", "url": "https://www.cnn.com/2022/05/06/economy/april-jobs-report/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220505153611-april-jobs-report-file-restricted-super-tease.jpg", "publishedAt": "2022-05-06T10:37:15Z", "content": "New York (CNN Business)The days of millions of job gains per month are behind us, and theUSlabor market recovery has now moved into a new phase, complete with new challenges: It's not that companies … [+3022 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Fiona Sinclair Scott, CNN | Illustrations by Leanza Abucayan", "title": "Style Guide: How to dress for the office", "description": "If the thought of retiring your comfortable sweats and choosing a new outfit to leave the house in each morning is an intimidating prospect, you're in good company. For the better part of the pandemic, I've lived in a pair of stretchy, soft wool trousers in t…", "url": "https://www.cnn.com/style/article/how-to-dress-for-the-office-styleguide/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220428144706-20220428-cnnstyle-dress-for-the-office-uniform-super-tease.jpg", "publishedAt": "2022-05-06T10:24:34Z", "content": "Fiona Sinclair Scott is CNN Style's global editor. \r\nIf the thought of retiring your comfortable sweats and choosing a new outfit to leave the house in each morning is an intimidating prospect, you'r… [+12856 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Kocha Olarn, CNN", "title": "Man arrested after rampage at Bangkok airport", "description": "A man who allegedly went on an armed rampage at Thailand's biggest airport is now facing charges, one of which could be eligible for the death penalty.", "url": "https://www.cnn.com/travel/article/suvanabhumi-airport-bangkok-arrest/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220506044648-bkk-airport-0326-restricted-super-tease.jpg", "publishedAt": "2022-05-06T09:48:06Z", "content": "Bangkok (CNN) A man who allegedly went on an armed rampage at Thailand's biggest airport is now facing charges, one of which could be eligible for the death penalty.\r\nThe man, identified as 34-year-o… [+1637 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Jack Bantock, CNN", "title": "Golf on safari: animals roam the greens at Africa's only PGA-accredited course", "description": "At Africa's only PGA-accredited golf course, zebras, giraffes and monkeys walk freely around the grounds.", "url": "https://www.cnn.com/travel/article/vipingo-ridge-kenya-golf-animals-pga-spt-spc-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220505125801-giraffe-green-vipingo-ridge-story-card-super-tease.jpg", "publishedAt": "2022-05-06T08:40:57Z", "content": "(CNN) The hole six feet ahead of him, a golfer lines up his putt. Six feet behind him, a giraffe strolls idly by.\r\nFrom birdies and eagles to guest appearances from deer and alligators, golf has long… [+3862 chars]"}]}