{"status": "ok", "totalResults": 100, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Liptak, CNN", "title": "An off-script Biden works to bury Trump's legacy in Asia", "description": "When President Joe Biden stated unequivocally Monday he was willing to intervene militarily to defend Taiwan against a Chinese attack, it was not the first time this city has seen a US president catch his national security aides off guard.", "url": "https://www.cnn.com/2022/05/24/politics/joe-biden-donald-trump-asia-legacy/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220523123902-01-biden-abroad-japan-0523-super-tease.jpg", "publishedAt": "2022-05-24T12:33:52Z", "content": "Tokyo (CNN)When President Joe Biden stated unequivocally Monday he was willing to intervene militarily to defend Taiwan against a Chinese attack, it was not the first time this city has seen a US pre… [+6412 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Evan Perez, Whitney Wild and Kaitlan Collins, CNN", "title": "DOJ requires officers to intervene if they see another use excessive force as part of broader reform effort", "description": "The Justice Department will require its agents and law enforcement officers to intervene and render aid if they see another officer use excessive force against a detainee -- a policy change in tandem with a series of police reform measures that the Biden admi…", "url": "https://www.cnn.com/2022/05/24/politics/justice-department-excessive-force/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220505122422-doj-seal-file-restricted-super-tease.jpg", "publishedAt": "2022-05-24T12:30:47Z", "content": "Washington (CNN)The Justice Department will require its agents and law enforcement officers to intervene and render aid if they see another officer use excessive force against a detainee -- a policy … [+2178 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amanda Davies, Matias Grez", "title": "Paris Saint-Germain chief promises 'a lot of changes' to create 'new era' at the club", "description": "After managing to hold onto his star player when it looked likely he would depart for Real Madrid, Paris Saint-Germain President Nasser Al-Khelaifi has promised \"a lot of changes\" in order to \"create a new era\" at the club.", "url": "https://www.cnn.com/2022/05/24/football/paris-saint-germain-nasser-al-khelaifi-promises-changes-spt-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220524083810-mbappe-khelaifi.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-24T12:22:16Z", "content": "After managing to hold onto his star player when it looked likely he would depart for Real Madrid, Paris Saint-Germain President Nasser Al-Khelaifi has promised a lot of changes in order to create a … [+6041 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Maureen Chowdhury, <a href=\"/profiles/aditi-sandal\">Aditi Sangal</a>, Melissa Macaya and Mike Hayes, CNN", "title": "Georgia, Alabama, Arkansas, Texas and Minnesota elections", "description": "Voters are heading to the polls in Georgia, Texas, Alabama, Arkansas and Minnesota in another round of primary contests that will test former President Trump's endorsement power. Follow here for the latest news updates, results and analysis.", "url": "https://www.cnn.com/politics/live-news/primary-election-results-georiga-alabama-2022/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220518045254-north-carolina-primary-voting-0517-super-tease.jpg", "publishedAt": "2022-05-24T12:07:33Z", "content": "Georgia will host competitive senate and governor elections in November, but the most competitive primaries will be Republican contests for governor and secretary of state and the Democratic primary … [+3391 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by David A. Andelman", "title": "Biden shouldn't confuse Taiwan with Ukraine", "description": "Taiwan is not Ukraine. China, in that part of the world especially, is not Russia. Still, in his off-the-cuff remarks that the United States will come directly to Taiwan's rescue if Beijing chooses to take the self-governing island by force, President Joe Bid…", "url": "https://www.cnn.com/2022/05/24/opinions/biden-china-taiwan-andelman/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220523082745-03-biden-asia-trip-0523-super-tease.jpg", "publishedAt": "2022-05-24T11:36:48Z", "content": "David A. Andelman, a contributor to CNN and twice winner of the Deadline Club Award, is a chevalier of the French Legion of Honor, author of \"A Red Line in the Sand: Diplomacy, Strategy, and the Hist… [+6978 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Metz", "title": "Google's new Street View camera is more portable (and looks weirdly cute)", "description": "Since launching in five US cities in 2007, Google's Street View cars have been circling the globe, using roof-mounted cameras to map more than 10 million miles of imagery — pictures that have been stitched together to build a visual map of much of the world.", "url": "https://www.cnn.com/2022/05/24/tech/google-street-view-new-camera/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220523152000-embargoed-google-street-view-new-camera-prototype.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-24T11:05:28Z", "content": "Since launching in five US cities in 2007, Googles Street View cars have been circling the globe, using roof-mounted cameras to map more than 10 million miles of imagery pictures that have been stitc… [+2984 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Metz, CNN Business", "title": "She thought a dark moment in her past was forgotten. Then she scanned her face online", "description": "Cher Scarlett, a software engineer, has a history of being misidentified by face-scanning technology, including one instance that may have surfaced a distant ancestor in a photo. So when she was introduced to an online facial-recognition tool she hadn't heard…", "url": "https://www.cnn.com/2022/05/24/tech/cher-scarlett-facial-recognition-trauma/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220517160555-cher-scarlett-super-tease.jpg", "publishedAt": "2022-05-24T11:02:26Z", "content": "(CNN Business)Cher Scarlett, a software engineer, has a history of being misidentified by face-scanning technology, including one instance that may have surfaced a distant ancestor in a photo. So whe… [+15738 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rob Picheta, Radina Gigova", "title": "Boris Johnson under more pressure over new lockdown 'Partygate' photos", "description": "Britain's beleaguered Prime Minister Boris Johnson is facing accusations he misled lawmakers and is staring down fresh calls to resign, after new images were published appearing to show him raising a glass with colleagues at a social gathering inside Downing …", "url": "https://www.cnn.com/2022/05/24/uk/boris-johnson-partygate-new-pictures-gbr-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220523213531-01-boris-johnson-lockdown-party.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-24T11:02:04Z", "content": "Britains beleaguered Prime Minister Boris Johnson is facing accusations he misled lawmakers and is staring down fresh calls to resign, after new images were published appearing to show him raising a … [+3629 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Priscilla Alvarez, CNN", "title": "Keeping Title 42 in place won't slow US-Mexico border crossings, officials say", "description": "A court ruling blocking the termination of a Trump-era pandemic restriction at the US-Mexico border is unlikely to slow border crossings, Biden administration officials say, as migration in the Western hemisphere reaches new highs.", "url": "https://www.cnn.com/2022/05/24/politics/title-42-border-crossings/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220505154054-asylum-seekers-mexico-border-file-032122-super-tease.jpg", "publishedAt": "2022-05-24T11:01:33Z", "content": "(CNN)A court ruling blocking the termination of a Trump-era pandemic restriction at the US-Mexico border is unlikely to slow border crossings, Biden administration officials say, as migration in the … [+4830 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Barry Neild, CNN", "title": "Elizabeth line: Huge new underground railway opens deep beneath London", "description": "A huge new subterranean railway whisked fare-paying passengers deep beneath the streets of London for the first time on Tuesday as the UK capital opened a $25 billion new metro line that will transform travel across the city.", "url": "https://www.cnn.com/travel/article/elizabeth-line-london-opening/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220524105130-crossrail-tunnel-super-tease.jpg", "publishedAt": "2022-05-24T10:40:17Z", "content": "Barry Neild, CNNPublished 24th May 2022\r\nEditor's Note Monthly Ticket is a new CNN Travel series that spotlights some of the most fascinating topics in the travel world. In May, we're riding the rail… [+3755 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Silvia Marchetti, CNN", "title": "How American-style cheesecake was born in ancient Rome", "description": "Toga clad Romans loved snacking on Savilium cheesecake made from goat milk and honey. Their recipes evolved over time and distance to become American cheesecake, which is now a big hit back in Italy.", "url": "https://www.cnn.com/travel/article/american-cheesecake-ancient-rome/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220523170621-wild-fruits-and-strawberry-italian-cheesecake-made-by-simona--super-tease.jpg", "publishedAt": "2022-05-24T10:28:04Z", "content": "Editor's Note Sign up to CNN Travel's Unlocking Italy newsletter for insider intel on Italy's best loved destinations and lesser-known regions to plan your ultimate trip. Plus, we'll get you in the m… [+7546 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jessie Yeung, Nectar Gan and Steven Jiang, CNN", "title": "What you need to know about China-Taiwan tensions", "description": "US President Joe Biden's warning the US would defend Taiwan against Chinese aggression has made headlines around the world -- and put growing tensions between the small democratic island and its neighboring autocratic superpower back under the spotlight.", "url": "https://www.cnn.com/2022/05/24/china/china-taiwan-conflict-explainer-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220524032125-taiwan-navy-exercise-0107-restricted-super-tease.jpg", "publishedAt": "2022-05-24T10:20:49Z", "content": "Hong Kong (CNN)US President Joe Biden's warning the US would defend Taiwan against Chinese aggression has made headlines around the world -- and put growing tensions between the small democratic isla… [+9310 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": null, "description": "The online attack campaign against Heard is an important part of the story, but as with so many of these campaigns, it is devilishly hard to trace. \"A years-long campaign of misinformation and online attacks seeded the playing field\" for the trial, Puck's Mat…", "url": "https://view.newsletters.cnn.com/messages/1653361291425fdce0c14b35a/raw", "urlToImage": null, "publishedAt": "2022-05-24T10:15:18Z", "content": "\"It's like the O.J. Simpson trial but with technology.\"\r\nThat's what Autumn Witbeck, a stay-at-home mother in Utah, told the WSJ's Rory Satran while \"attempting to explain the fervent interest in the… [+5272 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amy Woodyatt, CNN", "title": "Novak Djokovic criticizes Wimbledon's 'lose-lose' ban on Russian and Belarusian players", "description": "Wimbledon's decision to ban Russian and Belarusian players from this year's tournament following Russia's invasion of Ukraine is \"wrong,\" world number one Novak Djokovic said on Monday.", "url": "https://www.cnn.com/2022/05/24/tennis/djokovic-wimbledon-russia-ukraine-intl-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220523213535-novak-djokovic-220523-restricted-super-tease.jpg", "publishedAt": "2022-05-24T09:44:27Z", "content": "(CNN)Wimbledon's decision to ban Russian and Belarusian players from this year's tournament following Russia's invasion of Ukraine is \"wrong,\" world number one Novak Djokovic said on Monday.\r\nWimbled… [+3519 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Priscilla Alvarez, CNN", "title": "Biden administration scrambles to avoid embarrassing boycott from Latin American summit set for next month", "description": "The participation of Latin American countries in a high-profile regional summit is still in flux, just weeks from when it's scheduled to take place in California amid record migration throughout the Western Hemisphere.", "url": "https://www.cnn.com/2022/05/24/politics/summit-of-the-americas-biden-administration/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220429225820-amlo-reforma-electoral-super-tease.jpg", "publishedAt": "2022-05-24T09:08:43Z", "content": "(CNN)The participation of Latin American countries in a high-profile regional summit is still in flux, just weeks from when it's scheduled to take place in California amid record migration throughout… [+6058 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Elizabeth Wolfe and Hannah Sarisohn, CNN", "title": "Officials ask for public's help as they search for suspect in Moriah Wilson's killing. Here's what evidence has revealed", "description": "Just days before she was to begin a 157-mile race in Austin, Texas, earlier this month, competitive cyclist Anna Moriah \"Mo\" Wilson was shot and killed, shaking the growing community of gravel racing.", "url": "https://www.cnn.com/2022/05/24/us/mo-wilson-death-suspect-search-tuesday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220524013246-mo-wilson-instagram-dupe-super-tease.jpg", "publishedAt": "2022-05-24T08:06:01Z", "content": "(CNN)Just days before she was to begin a 157-mile race in Austin, Texas, earlier this month, competitive cyclist Anna Moriah \"Mo\" Wilson was shot and killed, shaking the growing community of gravel r… [+6552 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Megan Marples", "title": "People will likely lose up to 58 hours of sleep by 2099, study suggests", "description": "Researchers showed that humans living in warmer temperatures do not adapt to heat as well as those living where it's cold. The world's average temperature continues to rise due to global warming, so people can expect their sleep loss to worsen, experts say.", "url": "https://www.cnn.com/2022/05/24/health/sleep-loss-global-warming-study-wellness/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220520021514-02-sleep-loss-global-warming.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-24T08:00:42Z", "content": "People around the world are likely to lose 50 to 58 hours of sleep a year by 2099 due to global warming, a new study revealed.\r\nResearchers used wristbands with internal accelerometers to measure sle… [+4111 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Ronald Brownstein", "title": "Election deniers want to control the 2024 election. And they're getting closer", "description": "Proponents of Donald Trump's discredited lie about rampant fraud in 2020 are running for positions of authority over election administration in virtually every state expected to decide the 2024 presidential race, an explosive trend dramatically underscored by…", "url": "https://www.cnn.com/2022/05/24/politics/midterm-election-2022-georgia-false-claims-trump/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220523175128-perdue-hice-split-super-tease.jpg", "publishedAt": "2022-05-24T04:05:49Z", "content": "To see candidates running on a platform of lies and conspiracy theories about our elections as a campaign position, to see a former president getting involved in endorsing in down ballot races at the… [+257 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/travis-caldwell\">Travis Caldwell</a> and Seán Federico-O'Murchú, CNN", "title": "Russia's war in Ukraine", "description": "President Joe Biden told the Quad Summit in Tokyo the world is \"navigating a dark hour in our shared history\" and that President Vladimir Putin is \"trying to extinguish a culture,\" pointing to Russia's targeting of schools, churches and museums.", "url": "https://www.cnn.com/europe/live-news/russia-ukraine-war-news-05-24-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220523113935-ukraine-cnn-052222-super-tease.jpg", "publishedAt": "2022-05-24T04:00:55Z", "content": "A 20-year veteran of Russia's diplomatic service announced his resignation Monday in protest of his country's war on Ukraine, multiple media outlets reported.  \r\nIn a rare public protest by a Russian… [+3904 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": null, "description": "The online attack campaign against Heard is an important part of the story, but as with so many of these campaigns, it is devilishly hard to trace. \"A years-long campaign of misinformation and online attacks seeded the playing field\" for the trial, Puck's Mat…", "url": "https://view.newsletters.cnn.com/messages/16533612462974388b1f6cddf/raw", "urlToImage": null, "publishedAt": "2022-05-24T04:00:02Z", "content": "\"It's like the O.J. Simpson trial but with technology.\"\r\nThat's what Autumn Witbeck, a stay-at-home mother in Utah, told the WSJ's Rory Satran while \"attempting to explain the fervent interest in the… [+5272 chars]"}]}