{"status": "ok", "totalResults": 157, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte, CNN", "title": "What is monkeypox and its signs and symptoms?", "description": "An extremely rare disease called monkeypox, a cousin of smallpox, has again made its way to the United States. A case of monkeypox was reported Wednesday in a patient hospitalized in Massachusetts who had recently traveled to Canada in private transportation.", "url": "https://www.cnn.com/2022/05/19/health/what-is-monkeypox-virus-explainer-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220519121650-02-monkeypox-explainer-super-tease.jpg", "publishedAt": "2022-05-19T22:15:50Z", "content": "(CNN)An extremely rare disease called monkeypox, a cousin of smallpox, has again made its way to the United States. A case of monkeypox was reported Wednesday in a patient hospitalized in Massachuset… [+4888 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ella Nilsen, CNN", "title": "Energy Secretary says administration is working on relief for solar industry amid tariff investigation", "description": "More than 300 solar projects in the US had already been delayed or canceled as of late April due to a Commerce Department investigation.", "url": "https://www.cnn.com/2022/05/19/politics/solar-industry-investigation-relief-granholm-climate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220519142524-solar-construction-delay-0425-super-tease.jpg", "publishedAt": "2022-05-19T21:30:47Z", "content": "(CNN)Energy Sec. Jennifer Granholm said on Thursday the administration is \"working on a few things\" to help a panicked solar industry that is seeing projects grind to a halt amid a Commerce Departmen… [+2005 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandra Gonzalez, CNN", "title": "John Aylward, known for roles in 'ER' and 'West Wing,' dead at 75", "description": "John Aylward, a veteran film and television actor for more than three decades, has died, according to his longtime agent and friend, Mitchell K. Stubbs.", "url": "https://www.cnn.com/2022/05/19/entertainment/john-aylward-dead/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220519125145-01-john-aylward-er-super-tease.jpg", "publishedAt": "2022-05-19T20:59:43Z", "content": "(CNN)John Aylward, a veteran film and television actor for more than three decades, has died, according to his longtime agent and friend, Mitchell K. Stubbs. \r\nAylward died Monday of natural causes, … [+1862 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kate Bennett, CNN", "title": "First lady Jill Biden touts US commitment to South and Central America in Ecuador speech", "description": "First lady Jill Biden spent her first full day of a trip through South and Central America on Thursday, using a speech at the Carondelet presidential palace in Quito, Ecuador, to emphasize the importance of global assistance and building alliances.", "url": "https://www.cnn.com/2022/05/19/politics/jill-biden-ecuador/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220519155334-03-jill-biden-ecuador-051922-super-tease.jpg", "publishedAt": "2022-05-19T20:59:27Z", "content": "Quito, Ecuador (CNN)First lady Jill Biden spent her first full day of a trip through South and Central America on Thursday, using a speech at the Carondelet presidential palace in Quito, Ecuador, to … [+2962 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jamie Gangel and Evan Perez, CNN", "title": "Former Attorney General William Barr tentatively agrees to give sworn testimony to January 6 committee", "description": "Former Attorney General William Barr has \"tentatively agreed to give sworn testimony behind closed doors\" to the House select committee investigating the January 6, 2021, insurrection, according to two sources familiar with the negotiations.", "url": "https://www.cnn.com/2022/05/19/politics/william-barr-january-6/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201222172423-02-bill-barr-0210-super-tease.jpg", "publishedAt": "2022-05-19T20:55:37Z", "content": "(CNN)Former Attorney General William Barr has \"tentatively agreed to give sworn testimony behind closed doors\" to the House select committee investigating the January 6, 2021, insurrection, according… [+800 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Peter Valdes-Dapena, CNN Business", "title": "Mercedes just sold the world's most expensive car for $142 million", "description": "Mercedes-Benz confirmed on Thursday that it recently sold the world's most expensive car. A very rare 1955 Mercedes-Benz SLR coupe that had been kept in the German automaker's collection was sold to a private owner for €135 million, the equivalent of $142 mil…", "url": "https://www.cnn.com/2022/05/19/business/mercedes-worlds-most-expensive-car/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220519163252-01-1955-mercedes-benz-300-slr-uhlenhaut-coupe-super-tease.jpeg", "publishedAt": "2022-05-19T20:52:36Z", "content": "(CNN)Mercedes-Benz confirmed on Thursday that it recently sold the world's most expensive car. A very rare 1955 Mercedes-Benz SLR coupe that had been kept in the German automaker's collection was sol… [+2038 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lisa Respers France, Chloe Melas", "title": "Rihanna and A$AP Rocky welcome first child", "description": "Rihanna is now a mom.", "url": "https://www.cnn.com/2022/05/19/entertainment/rihanna-first-child/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220519152747-rihanna-file-0301-restricted.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-19T19:56:57Z", "content": "Rihanna is now a mom.\r\nThe superstar singer and her artist partner A$AP Rocky have welcomed their first child, a source close to the couple confirmed to CNN.\r\nThe new parents have not yet shared thei… [+880 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matt McFarland, CNN Business", "title": "NHTSA investigates Tesla crash that killed three", "description": "The National Highway Traffic Safety Administration said Wednesday that it is investigating a Tesla crash in Newport Beach, California, this month that killed three people in the vehicle and injured three construction workers.", "url": "https://www.cnn.com/2022/05/19/cars/nhtsa-tesla-crash-california/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201229024741-tesla-logo-file-2019-super-tease.jpg", "publishedAt": "2022-05-19T19:52:09Z", "content": "Washington, DC (CNN Business)The National Highway Traffic Safety Administration said Wednesday that it is investigating a Tesla crash in Newport Beach, California, this month that killed three people… [+2783 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sam Fossum, CNN", "title": "VP Kamala Harris says overturning Roe v. Wade would be 'an extreme step backwards'", "description": "Vice President Kamala Harris said Thursday that the Supreme Court's draft majority opinion that would overturn the landmark Roe v. Wade ruling is part of a \"war\" on women's rights, as Republican-led legislatures across the nation pass increasingly restrictive…", "url": "https://www.cnn.com/2022/05/19/politics/kamala-harris-abortion-rights/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220514124313-kamala-harris-0513-super-tease.jpg", "publishedAt": "2022-05-19T19:40:32Z", "content": "(CNN)Vice President Kamala Harris said Thursday that the Supreme Court's draft majority opinion that would overturn the landmark Roe v. Wade ruling is part of a \"war\" on women's rights, as Republican… [+3255 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Fung, CNN Business", "title": "US senators target Big Tech's digital advertising machine with new legislation", "description": "Google, Facebook's parent Meta, and Amazon could have to spin off chunks of their advertising businesses under Congress's latest bill targeting Big Tech, according to the US senators behind the proposal.", "url": "https://www.cnn.com/2022/05/19/tech/competition-transparency-digital-advertising-act/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220519140534-u-s-capitol-building-0516-super-tease.jpg", "publishedAt": "2022-05-19T19:29:31Z", "content": "Washington (CNN Business)Google, Facebook's parent Meta, and Amazon could have to spin off chunks of their advertising businesses under Congress's latest bill targeting Big Tech, according to the US … [+2671 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rebekah Riess, Jeremy Grisham, Devan Cole", "title": "Oklahoma Legislature passes bill banning abortions after 'fertilization'", "description": "Oklahoma's legislature on Thursday passed a bill that would ban abortions from the moment of fertilization and allow private citizens to sue abortion providers who \"knowingly\" perform or induce an abortion \"on a pregnant woman.\"", "url": "https://www.cnn.com/2022/05/19/politics/oklahoma-abortion-ban-hb-4327-passed/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220411204126-01-kevin-stitt-file.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-19T19:12:03Z", "content": "Oklahomas legislature on Thursday passed a bill that would ban abortions from the moment of fertilization and allow private citizens to sue abortion providers who knowingly perform or induce an abort… [+127 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Pramila Jayapal and Deepak Bhargava", "title": "Standing up for immigrants is part of US foundation", "description": "Rep. Pramila Japayal and Deepak Bhargava write that as the Biden administration prepares for the end of Title 42, ​​we are at a defining crossroad in our country when it comes to immigration. And Democrats cannot hesitate to communicate with voters their visi…", "url": "https://www.cnn.com/2022/05/19/opinions/title-42-immigration-biden-administration-bhargava-jayapal/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220512152226-migrant-shelter-mexico-file-super-tease.jpg", "publishedAt": "2022-05-19T19:07:52Z", "content": "Pramila Jayapal, a Democrat who represents Washington's 7th congressional district in the US House of Representatives, came to the US at 16 alone and went on to start an immigrant rights organization… [+7711 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Maegan Vazquez and Sam Fossum, CNN", "title": "White House still figuring out how to implement newly announced steps to ease infant formula shortage", "description": "A day after the White House announced its latest steps to attempt to alleviate a national shortage of infant formula, senior administration officials could not provide important details about how their new efforts will be implemented, saying they're in ongoin…", "url": "https://www.cnn.com/2022/05/19/politics/biden-defense-production-act-baby-formula-discussions/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220515230319-baby-formula-shortage-file-0113-super-tease.jpg", "publishedAt": "2022-05-19T19:07:34Z", "content": "(CNN)A day after the White House announced its latest steps to attempt to alleviate a national shortage of infant formula, senior administration officials could not provide important details about ho… [+5671 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ryan Nobles, Annie Grayer and Zachary Cohen, CNN", "title": "January 6 committee investigating Capitol tour given by GOP lawmaker on the eve of the insurrection", "description": "The House select committee investigating the January 6 insurrection has formally requested information from Rep. Barry Loudermilk, a Republican from Georgia, about a US Capitol tour he gave to visitors the day before rioters stormed the building.", "url": "https://www.cnn.com/2022/05/19/politics/barry-loudermilk-capitol-tour-january-6/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220519143329-barry-loudermilk-file-051921-super-tease.jpg", "publishedAt": "2022-05-19T19:01:52Z", "content": "(CNN)The House select committee investigating the January 6 insurrection has formally requested information from Rep. Barry Loudermilk, a Republican from Georgia, about a US Capitol tour he gave to v… [+3173 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Virginia Langmaid", "title": "New ATF report shows annual American gun production nearly tripled in 20 years", "description": "American gunmakers manufactured more than 11 million guns in 2020, nearly three times the number produced in 2000, according to a report published this week by the US Bureau of Alcohol, Tobacco, Firearms and Explosives that provides in-depth data on firearms …", "url": "https://www.cnn.com/2022/05/19/politics/atf-report-gun-production/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220519145357-gun-store-ky-072221-restricted-super-tease.jpg", "publishedAt": "2022-05-19T18:58:22Z", "content": "(CNN)American gunmakers manufactured more than 11 million guns in 2020, nearly three times the number produced in 2000, according to a report published this week by the US Bureau of Alcohol, Tobacco,… [+3177 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Melanie Zanona and Kristin Wilson, CNN", "title": "'They look like a bunch of clowns': Freedom Caucus hardball antics irritate both parties", "description": "As House votes unexpectedly dragged late into the evening on Tuesday, Republicans were forced to cancel eight different party fundraisers and lost out on hundreds of thousands of dollars in campaign cash, according to a GOP lawmaker familiar with the situatio…", "url": "https://www.cnn.com/2022/05/19/politics/freedom-caucus-bipartisan-irritation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220519143331-perry-roy-split-super-tease.jpg", "publishedAt": "2022-05-19T18:40:00Z", "content": "(CNN)As House votes unexpectedly dragged late into the evening on Tuesday, Republicans were forced to cancel eight different party fundraisers and lost out on hundreds of thousands of dollars in camp… [+5328 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tyler Mauldin", "title": "Blackouts possible this summer due to heat and extreme weather, officials warn", "description": "Extreme temperatures and ongoing drought could cause the power grid to buckle across vast areas of the country this summer, potentially leading to electricity shortages and blackouts, a US power grid regulator said Wednesday.", "url": "https://www.cnn.com/2022/05/19/us/blackouts-summer-heat-extreme-weather/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210617023725-california-extreme-heat-power-conservation.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-19T18:23:04Z", "content": "Extreme temperatures and ongoing drought could cause the power grid to buckle across vast areas of the country this summer, potentially leading to electricity shortages and blackouts, a US power grid… [+2576 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sonia Moghe, CNN", "title": "Johnny Depp associates testify about challenges working with him", "description": "Jurors in the ongoing defamation case between actress Amber Heard and her ex-husband Johnny Depp heard testimony Thursday from Depp's former talent agent, a former good friend and his former business manager, who described strain on their relationships with t…", "url": "https://www.cnn.com/2022/05/19/entertainment/amber-heard-johnny-depp-trial/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220519133907-01-depp-heard-trial-0519-super-tease.jpg", "publishedAt": "2022-05-19T18:06:04Z", "content": "(CNN)Jurors in the ongoing defamation case between actress Amber Heard and her ex-husband Johnny Depp heard testimony Thursday from Depp's former talent agent, a former good friend and his former bus… [+3745 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jackie Wattles, CNN Business", "title": "Boeing makes third attempt to launch its Starliner capsule to the ISS", "description": "Boeing will try yet again Thursday to send the capsule it designed to ferry astronauts to and from the International Space Station on a successful, uncrewed test mission. After two prior attempts to complete such a mission failed, Boeing's goal is to prove th…", "url": "https://www.cnn.com/2022/05/19/tech/boeing-starliner-oft-2-launch-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220518135103-03-boeing-starliner-pre-launch-0518-super-tease.jpg", "publishedAt": "2022-05-19T17:32:12Z", "content": "New York (CNN Business)Boeing will try yet again Thursday to send the capsule it designed to ferry astronauts to and from the International Space Station on a successful, uncrewed test mission. After… [+3851 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ella Nilsen, CNN", "title": "First on CNN: DOE announces multibillion-dollar project to kickstart a carbon dioxide removal industry in US", "description": "Direct air carbon capture projects are like giant vacuum cleaners that suck planet-warming carbon dioxide out of the air and lock it away.", "url": "https://www.cnn.com/2022/05/19/politics/doe-carbon-capture-investment-climate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220519124214-01-carbon-dioxide-removal-iceland-super-tease.jpg", "publishedAt": "2022-05-19T17:23:00Z", "content": "(CNN)The US Department of Energy is announcing a massive investment in direct air carbon removal projects, in hopes of kickstarting an industry that energy experts say is critical to getting the coun… [+4796 chars]"}]}