{"status": "ok", "totalResults": 79, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Alexandra Meeks, CNN", "title": "5 things to know for June 21: Gas prices, Ukraine, January 6, Israel, Covid-19", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2022/06/21/us/five-things-june-21-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220620174826-gas-prices-file-061722-super-tease.jpg", "publishedAt": "2022-06-21T10:35:57Z", "content": "(CNN)Today is the first official day of summer and the longest day of the year in the Northern Hemisphere. As expected, maximum sunshine and intense heat are forecast across much of the drought-stric… [+6673 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amy Woodyatt, CNN", "title": "Morgan Cato becomes first woman of color to be hired by an NBA team as Assistant GM", "description": "The Phoenix Suns have named Morgan Cato as Assistant General Manager and Vice President of Basketball Operations, making her the first woman of color to hold the Assistant General Manager title for an NBA team, according to the NBA.", "url": "https://www.cnn.com/2022/06/21/sport/morgan-cato-nba-intl-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220621044827-01-morgan-cato-phoenix-suns-file-super-tease.jpg", "publishedAt": "2022-06-21T10:14:35Z", "content": "(CNN)The Phoenix Suns have named Morgan Cato as Assistant General Manager and Vice President of Basketball Operations, making her the first woman of color to hold the Assistant General Manager title … [+1144 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Natasha Bertrand and Katie Bo Lillis, CNN", "title": "American allies in the Middle East pile pressure on Biden to come up with strategy for containing Iran", "description": "President Joe Biden is under increasing pressure from the US' key Middle East allies to come up with a viable plan to constrain Iran, with hopes for reviving the 2015 nuclear deal fading as Biden prepares for his first trip as president to Israel and Saudi Ar…", "url": "https://www.cnn.com/2022/06/21/politics/joe-biden-iran-saudi-gulf-states-israel/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220620143515-joe-biden-062022-super-tease.jpg", "publishedAt": "2022-06-21T10:00:39Z", "content": "(CNN)President Joe Biden is under increasing pressure from the US' key Middle East allies to come up with a viable plan to constrain Iran, with hopes for reviving the 2015 nuclear deal fading as Bide… [+7818 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eric Bradner, Gregory Krieg", "title": "6 things to watch in Tuesday's elections in Alabama, Virginia, Georgia and DC", "description": "Alabamians voting in Tuesday's runoff for the Republican Senate nomination will decide between the establishment candidate former President Donald Trump has endorsed in Katie Britt and the conservative who has long embraced Trump's brand of politics even thou…", "url": "https://www.cnn.com/2022/06/21/politics/alabama-virginia-georgia-dc-june21-primary-preview/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220620191857-katie-britt-file-restricted-052422.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-06-21T10:00:21Z", "content": "Alabamians voting in Tuesdays runoff for the Republican Senate nomination will decide between the establishment candidate former President Donald Trump has endorsed in Katie Britt and the conservativ… [+8540 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jessie Yeung, Yoonjung Seo and Gawon Bae, CNN", "title": "South Korea launches homegrown Nuri rocket carrying satellites into orbit", "description": "South Korea successfully launched satellites into orbit with its homegrown Nuri rocket on Tuesday, a significant step for the country's burgeoning space program after a failed attempt last year.", "url": "https://www.cnn.com/2022/06/21/asia/south-korea-nuri-satellite-rocket-launch-intl-hnk-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220621041654-01-south-korea-nuri-rocket-super-tease.jpg", "publishedAt": "2022-06-21T09:12:53Z", "content": "Seoul, South Korea (CNN)South Korea successfully launched satellites into orbit with its homegrown Nuri rocket on Tuesday, a significant step for the country's burgeoning space program after a failed… [+2787 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeremy Herb, Zachary Cohen, Annie Grayer and Ryan Nobles, CNN", "title": "What to watch for in January 6 hearing focused on pressure campaign in the states", "description": "The House select committee investigating the January 6, 2021, attack on the US Capitol turns its attention Tuesday to the campaign to pressure state-level officials to overturn the 2020 election results.", "url": "https://www.cnn.com/2022/06/21/politics/january-6-hearings-day-4-what-to-expect/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210916164406-04-georgia-criminal-probe-trump-raffensperger-super-tease.jpg", "publishedAt": "2022-06-21T09:04:04Z", "content": "(CNN)The House select committee investigating the January 6, 2021, attack on the US Capitol turns its attention Tuesday to the campaign to pressure state-level officials to overturn the 2020 election… [+7323 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Forrest Brown", "title": "International Day of Yoga 2022: Time to feel human again", "description": "The International Day of Yoga -- which is on Tuesday, June 22 -- could be the day that jump-starts a healthy new habit. The 2022 theme is \"Yoga for humanity.\"", "url": "https://www.cnn.com/2022/06/21/health/international-day-of-yoga-2022-wellness/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220523100614-taking-care-of-business-bk-yoga-club-on-dekalb-00001709.png?c=16x9&q=w_800,c_fill", "publishedAt": "2022-06-21T08:51:03Z", "content": "Do the challenges of the modern world and the effects of the pandemic have you tied up in knots? Maybe an ancient practice can give you some relief.\r\nFor thousands of years, people have turned to yog… [+3732 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amy Woodyatt and Amanda Davies, CNN", "title": "'I had PTSD': Culture of abuse in British gymnastics leaves lasting legacy on its victims", "description": "For Claire Heafford, the abuse she says she suffered as a young gymnast has left a lasting mark on her life.", "url": "https://www.cnn.com/2022/06/21/sport/british-gymnastics-abuse-intl-spt-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220618080602-gymnastics-stock-super-tease.jpg", "publishedAt": "2022-06-21T08:42:14Z", "content": "By Amy Woodyatt and Amanda Davies, CNN\r\nUpdated 4:42 AM ET, Tue June 21, 2022\r\nLondon (CNN)For Claire Heafford, the abuse she says she suffered as a young gymnast has left a lasting mark on her life.… [+11530 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Leah Dolan, CNN", "title": "Paris Fashion Week menswear: Watch the shows live", "description": "Paris Fashion Week is back again, with this week marking the beginning of the Spring-Summer 2023 menswear shows. Here's how to watch them online.", "url": "https://www.cnn.com/style/article/paris-fashion-week-mens-spring-2023/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220620150434-pfw-mens-2023-live-shows-super-tease.jpg", "publishedAt": "2022-06-21T07:55:31Z", "content": "Paris Fashion Week is back again, with this week marking the beginning of the Spring-Summer 2023 menswear shows.\r\nMenswear has fast become one of the most subversive and innovative areas of fashion. … [+1391 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Travis Caldwell and Rosa Flores, CNN", "title": "11 officers responded to Uvalde shooting within 3 minutes, source says, as new reports reveal how authorities then waited to engage", "description": "Eleven officers -- including Uvalde school district police chief Pete Arredondo -- were inside Robb Elementary within three minutes of a gunman entering on May 24, a law enforcement source close to the investigation tells CNN, as new reports provide a closer …", "url": "https://www.cnn.com/2022/06/21/us/uvalde-texas-school-shooting-footage-police-response/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220620224406-02-uvalde-texas-school-shooting-images-surveillance-footage-super-tease.jpg", "publishedAt": "2022-06-21T07:55:16Z", "content": "(CNN)Eleven officers -- including Uvalde school district police chief Pete Arredondo -- were inside Robb Elementary within three minutes of a gunman entering on May 24, a law enforcement source close… [+4450 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Elizabeth Wolfe and Rob Shackelford, CNN", "title": "As summer officially begins, millions have already suffered sweltering heat with little hope for quick relief", "description": "Though summer officially begins on Tuesday, millions of Americans have already been buffeted by triple-digit temperatures and dangerously high heat, which is only expected to continue as a second wave of extreme heat creeps into the eastern and southern US.", "url": "https://www.cnn.com/2022/06/21/weather/heat-wave-second-week-record-temperatures-tuesday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220621015253-heat-feels-like-temp-tuesday-super-tease.jpg", "publishedAt": "2022-06-21T06:06:07Z", "content": "(CNN)Though summer officially begins on Tuesday, millions of Americans have already been buffeted by triple-digit temperatures and dangerously high heat, which is only expected to continue as a secon… [+3814 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amanda Musa, CNN", "title": "5-year-old boy died after being left in a car for hours while his mother prepared for a birthday party, report says", "description": "A 5-year-old boy died after his mother left him inside a car outside the family's home in Houston while she prepared for her daughter's birthday party on Monday, a law enforcement official told CNN affiliate KTRK.", "url": "https://www.cnn.com/2022/06/21/us/5-year-old-hot-car-death-houston/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220621005445-01-five-year-old-hot-car-death-houston-super-tease.jpeg", "publishedAt": "2022-06-21T05:56:21Z", "content": "(CNN)A 5-year-old boy died after his mother left him inside a car outside the family's home in Houston while she prepared for her daughter's birthday party on Monday, a law enforcement official told … [+2387 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Jessie Yeung, CNN", "title": "Hong Kong's Jumbo floating restaurant sinks at sea", "description": "An iconic Hong Kong floating restaurant has sunk, just days after it was towed out to sea en route to an unspecified destination.", "url": "https://www.cnn.com/travel/article/hong-kong-jumbo-restaurant-sink-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/181107075124-hong-kong-jumbo-seafood-restaurant-00001115-super-tease.jpg", "publishedAt": "2022-06-21T05:52:03Z", "content": "Jessie Yeung, CNNUpdated 21st June 2022\r\n(CNN) An iconic Hong Kong floating restaurant has sunk, just days after it was towed out to sea en route to an unspecified destination. \r\nJumbo Kingdom, a thr… [+2276 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amir Vera", "title": "Parents and residents call for Uvalde school board to fire district police chief during emotional open forum", "description": "Victims parents discussed the devastation the shooting has brought on their families and the city.", "url": "https://www.cnn.com/2022/06/21/us/uvalde-school-board-meeting-parents/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220620215842-01-uvalde-school-board-meeting-parents-file.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-06-21T04:56:02Z", "content": "A mix of anger at local officials, frustration with the school divisions police department and heart-breaking sadness over last months mass shooting at Robb Elementary School dominated the open forum… [+6066 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Stephen Collinson, CNN", "title": "Texas GOP's election denial underscores the ongoing threat that's central message of Jan. 6 hearings", "description": "Last week, the star witness at a January 6 select committee hearing warned that Donald Trump remained a \"clear and present danger\" to American democracy. The Texas Republican Party just showed why, underscoring the critical need for the House investigation in…", "url": "https://www.cnn.com/2022/06/21/politics/texas-gop-trump-jan-6-hearings/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220620193723-trump-texas-0527-super-tease.jpg", "publishedAt": "2022-06-21T04:14:31Z", "content": "(CNN)Last week, the star witness at a January 6 select committee hearing warned that Donald Trump remained a \"clear and present danger\" to American democracy. The Texas Republican Party just showed w… [+8920 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Ronald Brownstein", "title": "House Democrats have unified as never before. It may not save them.", "description": "It may be cold comfort as a stormy midterm election approaches, but House Democrats have achieved a modern milestone in this legislative session that crystallizes a fundamental transformation in how Congress operates.", "url": "https://www.cnn.com/2022/06/21/politics/house-democrats-vote-unity/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220620191112-nancy-pelosi-house-democrats-file-restricted-051322-super-tease.jpg", "publishedAt": "2022-06-21T04:02:12Z", "content": "The consequences of voting against your leadership is failure, and failure for your party, just like a low approval rating for your party's president, means you are going to pay the penalty. I think … [+87 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Gregory Wallace, CNN", "title": "Americans to set road trip record for July 4 despite sky-high gas prices, AAA predicts", "description": "AAA's annual forecast for the July 4 holiday weekend says 42 million Americans -- more than ever -- will take a road trip of 50 miles or more in 2022. Here's what to expect on the road and the skies above.", "url": "https://www.cnn.com/travel/article/aaa-july-4-road-trips-gas-prices-2022/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220620174826-gas-prices-file-061722-super-tease.jpg", "publishedAt": "2022-06-21T04:01:35Z", "content": "(CNN) Americans are feeling the heat at the gas pump, but that won't keep them in park, AAA predicts. \r\nThe automotive and trip-planning group's annual forecast for the July 4 holiday weekend says th… [+3820 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Helen Regan", "title": "Russia's war in Ukraine", "description": "Russian forces attacking the key eastern city of Severodonetsk have enough firepower to launch a large-scale offensive, the Luhansk regional military chief said. Follow live updates here.", "url": "https://www.cnn.com/europe/live-news/russia-ukraine-war-news-06-21-22/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220620133816-lysychansk-file-restricted-061922.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-06-21T04:00:10Z", "content": "Lithuanias decision to ban the transit of sanctioned materials to Russia through the Kaliningrad region Russias exclave in the European Union is unprecedented and Russia considers it illegal, said Kr… [+1866 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "World's biggest freshwater fish, a 660-pound stingray, caught in Cambodia", "description": "Cambodian villagers on the Mekong River have caught what researchers say is the world's biggest freshwater fish ever recorded, a stingray that weighed in at 661 pounds (about 300 kilograms), and took around a dozen men to haul to shore.", "url": "https://www.cnn.com/2022/06/20/asia/cambodia-stingray-heaviest-fish-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220620220902-02-cambodia-stingray-heaviest-fish-super-tease.jpg", "publishedAt": "2022-06-21T03:44:25Z", "content": "CambodiaCambodian villagers on the Mekong River have caught what researchers say is the world's biggest freshwater fish ever recorded, a stingray that weighed in at 661 pounds (about 300 kilograms), … [+934 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": null, "description": "Brian Stelter here. It's 9:35pm ET on Monday, June 20. Tuesday is the longest day of the year in the Northern Hemisphere, a fact that I have strong feelings about, since my kids wake up with the sun at 5:15am. That's why I'm trying to file early!(view.newslet…", "url": "https://view.newsletters.cnn.com/messages/16557754529212757ce3aaf14/raw", "urlToImage": null, "publishedAt": "2022-06-21T01:45:03Z", "content": "Missouri news outlets did not mince words about Monday's new campaign video from Republican U.S. Senate candidate Eric Greitens. \"Gun-wielding Greitens releases violent ad targeting other Republicans… [+3749 chars]"}]}