{"status": "ok", "totalResults": 62, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Francesca Street, CNN", "title": "She sat next to the annoying guy on the plane. Then they fell in love", "description": "Krystina Burton and Gabriel Solberg who met on a cross country flight from New York to California. The airplane became the unlikely setting for a first date as a whirlwind romance took flight.", "url": "https://www.cnn.com/travel/article/chance-encounters-airplane-romance-new-york-california/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220506025132-11-chance-encounters-krystina-gabriel-restricted-super-tease.jpg", "publishedAt": "2022-05-09T10:43:30Z", "content": "(CNN) The first time Krystina Burton met Gabriel Solberg, she rolled her eyes.\r\nBurton, a then 30-year-old dancer living and working in Los Angeles, was waiting at JFK to fly home following an auditi… [+15839 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alexandra Meeks", "title": "5 things to know for May 9: Ukraine, Inflation, Covid-19, Baby formula, Inmate escape", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2022/05/09/us/five-things-may-9-trnd/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220509090142-03-putin-victory-day-050922.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-09T10:39:45Z", "content": "Protesters have been gathering across the US for several days to voice their opposition to the possible overturning of Roe v. Wade. And over the weekend, the situation got even more personal when doz… [+6546 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Angela Dewan", "title": "On a Victory Day without new victories, Putin's speech keeps the world guessing", "description": "Global leaders and defense officials had spent weeks speculating what Russian President Vladimir Putin might reveal about his Ukraine plans in a speech at Russia's Victory Day commemorations Monday. They'll have to keep guessing -- the leader offered few clue…", "url": "https://www.cnn.com/2022/05/09/europe/russia-victory-day-ukraine-snap-analysis-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220509090142-03-putin-victory-day-050922.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-09T10:04:50Z", "content": "Global leaders and defense officials had spent weeks speculating what Russian President Vladimir Putin might reveal about his Ukraine plans in a speech at Russias Victory Day commemorations Monday. T… [+2632 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Veronica Stracqualursi, CNN", "title": "What overturning Roe v. Wade could mean for decades-old abortion bans", "description": "• Watch pro-abortion rights protesters march to Brett Kavanaugh's house\n• Watch: GOP governor pressed on law that would force incest victims to carry child to term\n• Americans' views on abortion diverge along more than just partisan lines", "url": "https://www.cnn.com/2022/05/09/politics/michigan-abortion-ban-explainer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220508172230-01-michigan-abortion-ban-explainer-super-tease.jpg", "publishedAt": "2022-05-09T10:01:23Z", "content": "(CNN)Abortion rights advocates in Michigan are raising alarms about a restrictive abortion ban put in place in 1931 before the US Supreme Court's 1973 landmark decision in Roe v. Wade. \r\nThat law was… [+9342 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katelyn Polantz, Hannah Rabinowitz, Evan Perez and Andrew Millman, CNN", "title": "Oath Keepers share info with Jan. 6 investigators on how they supported Trump", "description": "Top leaders in the Oath Keepers, the far-right extremist group, have been turning over phones and digital files and sitting for interviews with the FBI -- and detailing how they worked to benefit Donald Trump's campaign and communicated with others in the for…", "url": "https://www.cnn.com/2022/05/09/politics/oath-keepers-january-6-election-fraud-trump/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220430140648-01b-capitol-riot-jan-6-super-tease.jpeg", "publishedAt": "2022-05-09T10:00:34Z", "content": "(CNN)Top leaders in the Oath Keepers, the far-right extremist group, have been turning over phones and digital files and sitting for interviews with the FBI -- and detailing how they worked to benefi… [+12273 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Nigerian airlines suspend plans to ground local flights over cost of jet fuel", "description": "Nigerian airlines have suspended plans to ground all local flights due to the soaring cost of jet fuel just hours before the move was due to take effect, the airline operators association said on Sunday.", "url": "https://www.cnn.com/2022/05/09/africa/nigerian-airlines-suspend-shutdown-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220509033933-01-nnamdi-azikiwe-international-airport-file-2020-super-tease.jpg", "publishedAt": "2022-05-09T09:35:15Z", "content": "AbujaNigerian airlines have suspended plans to ground all local flights due to the soaring cost of jet fuel just hours before the move was due to take effect, the airline operators association said o… [+1630 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ben Jones, CNN", "title": "The world's most incredible rail journeys", "description": "From Switzerland's high alpine Bermina Express to the epic Australian Outback adventure of The Ghan, these are some of the world's most extraordinary train rides.", "url": "https://www.cnn.com/travel/article/incredible-train-journeys/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220503190500-09-body-incredible-train-journeys-super-tease.jpg", "publishedAt": "2022-05-09T09:20:47Z", "content": "Editor's Note Monthly Ticket is a new CNN Travel series that spotlights some of the most fascinating topics in the travel world. In May, we're riding the rails as we explore the world's greatest trai… [+15033 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Donald Judd and Paul LeBlanc, CNN", "title": "Biden to announce partnership with internet providers to lower costs for low-income households", "description": "President Joe Biden on Monday will announce that 20 of the nation's internet providers have committed to lowering costs for low-income households, a step the administration says will increase access to high-speed internet for 48 million households nationwide.", "url": "https://www.cnn.com/2022/05/09/politics/white-house-partnership-internet-low-income-households/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220508191139-white-house-partnership-internet-low-income-households-super-tease.jpg", "publishedAt": "2022-05-09T09:06:03Z", "content": "Washington (CNN)President Joe Biden on Monday will announce that 20 of the nation's internet providers have committed to lowering costs for low-income households, a step the administration says will … [+3324 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Laura He", "title": "China faces 'complex and grave' job market, warns Premier Li", "description": "One of China's top leaders has painted a grim picture of the job market in the world's most populous nation, as widespread Covid lockdowns slam the brakes on the economy.", "url": "https://www.cnn.com/2022/05/09/economy/china-li-keqiang-jobs-grave-situation-l-intl-hnk/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220509012120-li-keqiang-0425-restricted.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-09T09:01:34Z", "content": "One of Chinas top leaders has painted a grim picture of the job market in the worlds most populous nation, as widespread Covid lockdowns slam the brakes on the economy.\r\nChinese Premier Li Keqiang th… [+3590 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Pallabi Munsi, CNN", "title": "In Philippines, the fight against online sexual abuse of children exposes tensions between human rights and economic development", "description": "The online platforms and digital services that contribute millions to the Philippine economy also facilitate the online sexual abuse and exploitation of children. Can a new president and a new law hold companies accountable?", "url": "https://www.cnn.com/2022/05/09/asia/philippines-election-online-sexual-abuse-as-equals-intl-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220508080954-computer-dark-stock-super-tease.jpg", "publishedAt": "2022-05-09T04:58:50Z", "content": "This story is part of As Equals, CNN's ongoing series on gender inequality. For information about how the series is funded and more, check out our FAQs.\r\n (CNN)Filipinos are going to the ballot box t… [+12465 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/rhea-mogul\">Rhea Mogul</a> and <a href=\"/profiles/andrew-raine\">Andrew Raine</a>, CNN", "title": "Russia's war in Ukraine", "description": "Ukraine has accused Russia of dropping a bomb on a school in the Luhansk region where 90 people were taking shelter. Dozens of people are feared dead. Follow here for live updates.", "url": "https://www.cnn.com/europe/live-news/russia-ukraine-war-news-05-09-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220508004933-ukr-school-bombing-bilohorivka-super-tease.jpg", "publishedAt": "2022-05-09T04:05:33Z", "content": "The Group of 7 Leaders (G7), including US President Joe Biden, met virtually with Ukrainian President Volodymyr Zelensky and reassured him that they will continue to provide military and economic ass… [+2094 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Stephen Collinson", "title": "Biden tests how much he can ratchet up the pressure on Putin", "description": "President Joe Biden is vowing to ratchet up even more pressure on Vladimir Putin as the Russian leader stages a nationalistic pageant set to highlight the civilization-destroying potential of his nuclear arms in a new round of saber-rattling.", "url": "https://www.cnn.com/2022/05/09/politics/biden-putin-ukraine-war/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220220203733-biden-putin-split-0220.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-09T04:02:30Z", "content": "President Joe Biden is vowing to ratchet up even more pressure on Vladimir Putin as the Russian leader stages a nationalistic pageant set to highlight the civilization-destroying potential of his nuc… [+9466 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kiely Westhoff", "title": "Driver who fatally struck rapper Nicki Minaj's father will serve 'no more than one year,' judge says", "description": "A hit-and-run driver has pleaded guilty to leaving the scene of a suburban New York crash that killed rapper Nicki Minaj's father, prosecutors say.", "url": "https://www.cnn.com/2022/05/08/entertainment/nicki-minaj-father-hit-and-run-sentence/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220508230218-nicki-minaj-met-gala-2019-super-tease.jpg", "publishedAt": "2022-05-09T03:57:43Z", "content": "(CNN)A hit-and-run driver has pleaded guilty to leaving the scene of a suburban New York crash that killed rapper Nicki Minaj's father, prosecutors say.\r\nCharles Polevich, 71, on Friday admitted to l… [+2783 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul LeBlanc, CNN", "title": "Mississippi governor says his state isn't focused on banning certain birth control 'at this time'", "description": "Mississippi Republican Gov. Tate Reeves on Sunday hedged when asked if his state would consider banning certain forms of birth control if the Supreme Court overturns Roe v. Wade, only offering that it's \"not what we are focused on at this time.\"", "url": "https://www.cnn.com/2022/05/08/politics/mississippi-abortion-contraception-roe-wade-cnntv/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220508203556-mississippi-abortion-contraception-roe-wade-cnntv-super-tease.jpg", "publishedAt": "2022-05-09T03:39:32Z", "content": "Washington (CNN)Mississippi Republican Gov. Tate Reeves on Sunday hedged when asked if his state would consider banning certain forms of birth control if the Supreme Court overturns Roe v. Wade, only… [+2656 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": null, "description": "Dafna Linzer, joined me on Sunday's \"Reliable Sources.\" When I asked if Politico's reporters are still in touch with the source of the draft opinion, she said, \" Linzer said Politico has not been contacted by the court about its leak investigation. Chief Just…", "url": "https://view.newsletters.cnn.com/messages/16520626035189c56af5ed137/raw", "urlToImage": null, "publishedAt": "2022-05-09T02:25:02Z", "content": "Nearly one week after Politico's breathtaking scoop about the Supreme Court being poised to overturn Roe v. Wade, there is no indication that Politico's source has been uncovered. There is no reason … [+5286 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rebecca Cairns, CNN Business", "title": "This Singaporean startup has reinvented the instant noodle", "description": "Hardy, drought-resistant and a natural fertilizer, the Bambara groundnut could offer a food for the future. Singapore-based food-tech startup WhatIf is using the unusual ingredient to make healthier instant noodles -- and more.", "url": "https://www.cnn.com/2022/05/08/business/whatif-bamnut-sustainable-instant-noodles-climate-hnk-intl-spc/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220503235359-02-whatif-bamnut-super-tease.jpg", "publishedAt": "2022-05-09T01:28:31Z", "content": "(CNN)There are 300,000 edible plant species but in 2018, just four crops made up half of global production, and three rice, maize, and wheat accounted for 86% of all exports.\r\nChristoph Langwallner, … [+5627 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paula Hancocks", "title": "What North Korea learned from Ukraine: Now's the perfect time for a nuclear push", "description": "If North Korea was looking for another excuse to forge ahead with its nuclear weapons program, it just found one in Russia's invasion of Ukraine.", "url": "https://www.cnn.com/2022/05/08/asia/north-korea-nuclear-ukraine-war-lessons-intl-hnk/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220505141301-02-north-korea-nuclear-ukraine-war-lessons.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-09T01:19:48Z", "content": "If North Korea was looking for another excuse to forge ahead with its nuclear weapons program, it just found one in Russias invasion of Ukraine.\r\nThat one of the very few countries to have voluntaril… [+8109 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Janelle Davis, CNN", "title": "'Stanley Tucci: Searching for Italy': What's on the menu in Piedmont", "description": "From exquisite white truffles to rich risottos and the finest wines, Piedmont is a gastronomic paradise.", "url": "https://www.cnn.com/travel/article/stanley-tucci-searching-for-italy-piedmont-itinerary-origseriesfilms/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220503125158-bpt103-searching-for-italy-season-2-super-tease.jpg", "publishedAt": "2022-05-09T00:59:52Z", "content": "(CNN) From exquisite white truffles to rich risottos and the finest wines, Piedmont is a gastronomic paradise.\r\nBelow is a guide to where you can find some of the dishes Tucci devoured in Piedmont. M… [+5573 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Janelle Davis, CNN. Recipe from Lorella Tamone of Alpage Restaurant", "title": "The Italian version of fondue is so luscious, it requires a spoon", "description": "In season two of \"Stanley Tucci: Searching for Italy,\" Tucci traveled to the Alps and tried fonduta, the Italian version of fondue that's made of fontina cheese.", "url": "https://www.cnn.com/travel/article/stanley-tucci-italian-fondue-recipe-wellness-origseriesfilms/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220429173616-stanley-tucci-searching-for-italy-fonduta-origseriesfilms-00000922-super-tease.png", "publishedAt": "2022-05-09T00:53:32Z", "content": "Editor's Note Don't miss \"Stanley Tucci: Searching for Italy,\" airing Sundays at 9 p.m. ET. Tucci is traveling across Italy to discover the secrets and delights of the country's regional cuisines.\r\n(… [+3328 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Janelle Davis, CNN. Recipe from Christian and Manuel Costardi", "title": "Coffee, beer and rice: Try the risotto dish Stanley Tucci called 'a revelation'", "description": "Piedmont, in northwest Italy, is all about risotto. Stanley Tucci traveled to one of the best places to try it in Vercelli, Italy's rice capital. Tucked at the back of Hotel Cinzia, Christian and Manuel Restaurant is run by two brothers who give this dish a m…", "url": "https://www.cnn.com/travel/article/stanley-tucci-risotto-recipe-wellness-origseriesfilms/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220429173446-stanley-tucci-searching-for-italy-risotto-piedmont-origseriesfilms-00001226-super-tease.png", "publishedAt": "2022-05-09T00:51:31Z", "content": "Editor's Note Don't miss \"Stanley Tucci: Searching for Italy,\" airing Sundays at 9 p.m. ET. Tucci is traveling across Italy to discover the secrets and delights of the country's regional cuisines.\r\n(… [+5358 chars]"}]}