{"status": "ok", "totalResults": 95, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Alicia Wallace", "title": "Covid hit Nashville hard. Now the performing arts are staging a comeback", "description": "The performing arts sector contributes more to the US GDP than the commercial airline business does. But since the pandemic hit, it's been facing a tough battle to return to center stage.", "url": "https://www.cnn.com/2022/05/07/economy/nashville-arts-revival-pandemic/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210702070200-restricted-01-nashville-arts-revival.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-07T14:27:14Z", "content": "When the pandemic hit the US in March 2020, concert halls fell silent, stages faded to black and livelihoods hung in the balance.\r\nThe US performing arts industry immediately lost more than half of i… [+12153 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jack Bantock, CNN", "title": "Liverpool boss Jurgen Klopp questions Champions League final ticket allocation after fan group slams UEFA", "description": "Liverpool manager Jürgen Klopp has questioned UEFA's allocation for tickets to the Champions League final in Paris later this month, admitting he understands the protests of some fans at the accessibility and cost of tickets.", "url": "https://www.cnn.com/2022/05/07/football/klopp-champions-league-final-tickets-uefa-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220507093117-juergen-klopp-0503-restricted-super-tease.jpg", "publishedAt": "2022-05-07T14:00:07Z", "content": "(CNN)Liverpool manager Jürgen Klopp has questioned UEFA's allocation for tickets to the Champions League final in Paris later this month, admitting he understands the protests of some fans at the acc… [+4212 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Stefano Pozzebon, CNN", "title": "Abortion rights activists in the US can learn from recent progress on abortion access in Latin America", "description": "The prospect of the United States overturning decades of abortion rights, which materialized this week in a leaked draft opinion by Supreme Court Justice Samuel Alito, triggered shock waves in many countries in Latin America, where many feminist organizations…", "url": "https://www.cnn.com/2022/05/07/americas/abortion-analysis-latin-america-activists-intl-latam/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220506191806-01-abortion-latin-america-us-perspective-super-tease.jpg", "publishedAt": "2022-05-07T13:22:19Z", "content": "Bogota, Colombia (CNN)The prospect of the United States overturning decades of abortion rights, which materialized this week in a leaked draft opinion by Supreme Court Justice Samuel Alito, triggered… [+6970 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Faith Karimi, CNN\nPhotographs by Lynsey Weatherspoon/Redux for CNN", "title": "These young Black influencers eat, sleep and shoot TikTok videos at a house near Atlanta. Together they have 30 million followers", "description": "The gray mansion with white trim stands out amid the brick homes in this affluent, quiet suburb of Atlanta. A Tesla and a Mercedes sit in the driveway. Towering pines wave gently in the backyard. Bare windows offer glimpses of a spiral staircase and marble fl…", "url": "https://www.cnn.com/2022/05/07/business/collab-crib-atlanta-content-house-cec/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220504172005-13-collab-crib-atlanta-content-house-cnnphotos-super-tease.jpg", "publishedAt": "2022-05-07T12:23:38Z", "content": "By Faith Karimi, CNNPhotographs by Lynsey Weatherspoon/Redux for CNN\r\nUpdated 8:34 AM ET, Sat May 7, 2022\r\nFayetteville, Georgia The gray mansion with white trim stands out amid the brick homes in th… [+15288 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tierney Sneed", "title": "Roe v. Wade reversal would put local prosecutors on the front lines of the abortion fight", "description": "The state-by-state patchwork of abortion restrictions that a reversal of Roe v. Wade would render will be even more complicated by the approaches of local prosecutors and law enforcement officials charged with enforcing abortion bans.", "url": "https://www.cnn.com/2022/05/07/politics/abortion-roe-reversal-prosecution-discretion/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220504130235-01-jackson-womens-health-organization-0503.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-07T12:05:59Z", "content": "The state-by-state patchwork of abortion restrictions that a reversal of Roe v. Wade would render will be even more complicated by the approaches of local prosecutors and law enforcement officials ch… [+6529 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rishi Iyengar", "title": "How Elon Musk could impact Twitter's battles over speech abroad", "description": "Since Elon Musk announced he was buying Twitter last month, the billionaire has sent out tweet after tweet outlining his plans for the platform, touching on everything from new features to security updates to monetization. But Musk's overarching reason for co…", "url": "https://www.cnn.com/2022/05/07/tech/elon-musk-twitter-global-free-speech/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220506122613-twitter-file-0421-restricted-super-tease.jpg", "publishedAt": "2022-05-07T11:55:29Z", "content": "San Francisco (CNN Business)Since Elon Musk announced he was buying Twitter last month, the billionaire has sent out tweet after tweet outlining his plans for the platform, touching on everything fro… [+7760 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Madeline Holcombe", "title": "Mother's Day isn't a celebration for everyone", "description": "You may be grieving the loss of a parent or a parent who didn't treat you right. Here's what some people have done to navigate a painful time.", "url": "https://www.cnn.com/2022/05/07/health/mothers-day-parental-grief-wellness/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220506154537-sad-woman-stock-photo.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-07T10:24:17Z", "content": "Bouquets of flowers, decorated Sunday brunches and sentimental cards dont always hold the same emotions for everyone.\r\nThere are different experiences that could lead up to why Mothers Day would be d… [+5163 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Forrest Brown, CNN", "title": "How to survive an alligator attack -- or better yet, avoid one entirely", "description": "There are millions of alligators in the US South but very few attacks. Here's how to fend off an alligator attack if you're the rare person in a fight for your life.", "url": "https://www.cnn.com/travel/article/how-to-survive-alligator-attack/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220503183156-01-alligator-attack-survival-top-super-tease.jpg", "publishedAt": "2022-05-07T10:00:16Z", "content": "(CNN) Jeffrey Heim woke up on May 30, 2021, with one thing on his mind: Sharks. \r\nSpecifically, shark teeth. They're his passion and his business. An unsuccessful attempt the day before to find any o… [+13506 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Maureen O'Hare, CNN", "title": "Travel news: Glass bridges, space hotels and a beautiful reunion after 23 years", "description": "In this week's travel news roundup, CNN Travel looks at space hotels through the ages, Sicily's new \"Little America\" and a new glass-bottomed bridge in Vietnam.", "url": "https://www.cnn.com/travel/article/pandemic-travel-news-vietnam-glass-bridge-space-hotel/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220505121344-bach-long-bridge-vietnam-super-tease.jpg", "publishedAt": "2022-05-07T09:13:37Z", "content": "(CNN) In this week's travel news roundup, we look at space hotels through the ages, Sicily's new \"Little America\" and a new glass-bottomed bridge in Vietnam that might just be the world's longest. \r\n… [+3768 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Xu Xiaofei, CNN", "title": "Michelin menus in turmoil as France faces foie gras crisis", "description": "France's love for foie gras goose paté has endured controversy over animal cruelty, but appetites are now being hit by an invisible threat to its treasured delicacy.", "url": "https://www.cnn.com/travel/article/france-foie-gras-crisis/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220506115042-02-france-foie-gras-chaos-restricted-super-tease.jpg", "publishedAt": "2022-05-07T09:00:26Z", "content": "Paris (CNN) Fois gras, the French culinary jewel that is as delicious as it is controversial, is a staple of upscale restaurants across the country. But now it's vanishing from menus during an \"unpre… [+4374 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Allison Chinchar, CNN Meteorologist", "title": "Antarctica's majestic underwater world is trying to adapt to a warmer planet", "description": "Icebergs surrounded a team of researchers in January as they cruised toward Antarctica. The team had been studying a thriving underwater ecosystem near the continent for years, but thanks to new modeling and powerful instrumentation they were able to navigate…", "url": "https://www.cnn.com/2022/05/07/weather/antarctica-ice-sheet-climate-ecosystem/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220506093253-05-antarctica-research-trip-2022-super-tease.jpg", "publishedAt": "2022-05-07T09:00:09Z", "content": "(CNN)Icebergs surrounded a team of researchers in January as they cruised toward Antarctica. The team had been studying a thriving underwater ecosystem near the continent for years, but thanks to new… [+11383 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Ramirez, CNN", "title": "The two largest reservoirs in California are already at 'critically low levels' and the dry season is just starting", "description": "According to the latest report from the US Drought Monitor, two of the state's largest reservoirs — Shasta Lake and Lake Oroville — are at \"critically low levels.\"", "url": "https://www.cnn.com/2022/05/07/us/california-water-shasta-oroville-climate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220506140450-lake-oroville-drought-2021-file-super-tease.jpg", "publishedAt": "2022-05-07T08:00:50Z", "content": "(CNN)Against the backdrop of the water crisis in the Colorado River Basin, where the country'slargest reservoirs are plunging at an alarming rate, California's two largest reservoirs Shasta Lake and … [+6493 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi", "title": "Reward offered for information after 2 dolphins died in Texas and Florida following interactions with humans", "description": "Officials are offering rewards for information on people who may have harmed two dolphins that later died in Texas and Florida.", "url": "https://www.cnn.com/2022/05/07/us/dead-dolphins-rewards/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220416094514-stranded-dolphin-dies-texas.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-07T06:58:54Z", "content": "Officials are offering rewards for information on people who may have harmed two dolphins that later died in Texas and Florida. \r\nNOAA Fisheries, a division of the National Oceanic and Atmospheric Ad… [+1917 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Iqbal Athas", "title": "Sri Lanka president declares new state of emergency as protests roil island", "description": "Sri Lanka's President Gotabaya Rajapaksa declared a state of emergency on Friday, after prolonged protests and a general strike shuttered schools, businesses, and transport services.", "url": "https://www.cnn.com/2022/05/07/asia/sri-lanka-president-rajapaksa-state-of-emergency-hnk-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220506223248-01-sri-lanka-strike.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-07T05:34:03Z", "content": "Sri Lankas President Gotabaya Rajapaksa declared a state of emergency on Friday, after prolonged protests and a general strike shuttered schools, businesses, and transport services. \r\nThe state of em… [+1224 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Zoe Sottile", "title": "Customs seized over $10 million worth of counterfeit Rolex watches", "description": "US Customs and Border Protection officers in Indianapolis seized two shipments of counterfeit Rolex watches on April 27 and 29. The fake luxury watches would have had a total value of $10.1 million if real, according to CBP.", "url": "https://www.cnn.com/2022/05/07/us/counterfeit-rolexes-seized-customs-trnd/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220506102814-counterfeit-rolexes-seized-customs.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-07T05:00:09Z", "content": "It might be time to check the authenticity of your new luxury watch.\r\nUS Customs and Border Protection (CBP) officers in Indianapolis seized two shipments of counterfeit Rolex watches on April 27 and… [+915 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paradise Afshar", "title": "Austrian climber found dead on the slopes of North America's tallest peak", "description": "The body of an Austrian climber who was last heard from a week ago has been found on the slopes of Alaska's Mount Denali, authorities said on Friday.", "url": "https://www.cnn.com/2022/05/07/us/austrian-climber-found-dead-alaska-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220506223246-denali-national-park-file.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-07T04:28:33Z", "content": "The body of an Austrian climber who was last heard from a week ago has been found on the slopes of Alaskas Mount Denali, authorities said on Friday.\r\nAn aerial search spotted the body of Matthias Rim… [+1768 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Christina Maxouris, CNN", "title": "Authorities made a key discovery in their search for the missing Alabama officer and inmate. It led to more questions", "description": "In their search for a missing former corrections official and an inmate facing murder charges, authorities announced a key discovery Friday: they located the car they previously believed the pair was traveling in.", "url": "https://www.cnn.com/2022/05/07/us/vicky-white-casey-white-alabama-manhunt-saturday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220506213052-0506-casey-white-vicky-white-split-super-tease.jpg", "publishedAt": "2022-05-07T04:25:27Z", "content": "(CNN)In their search for a missing former corrections official and an inmate facing murder charges, authorities announced a key discovery Friday: they located the car they previously believed the pai… [+4600 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/jessie-yeung\">Jessie Yeung</a> and <a href=\"/profiles/andrew-raine\">Andrew Raine</a>, CNN", "title": "Russia's war in Ukraine", "description": "A Ukrainian commander at the Azovstal steel plant said there are \"bloody battles\" unfolding with Russian forces inside the complex after they breached the perimeter. Follow here for live updates.", "url": "https://www.cnn.com/europe/live-news/russia-ukraine-war-news-05-07-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220506070801-azovstal-050522-super-tease.jpg", "publishedAt": "2022-05-07T04:04:57Z", "content": "The United Kingdom announced Saturday it will bolster its humanitarian aid to Ukraine by sending more essential equipment to relief centers and hospitals. \r\nIn a statement, the British government sai… [+1718 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by David A. Andelman", "title": "Opinion: Many Filipinos might not recall the frightening rule of Ferdinand and Imelda Marcos -- but I do", "description": "The favorite to become next Philippines president is Ferdinand Marco Jr. -- better known as \"Bongbong\" -- the only son of Ferdinand and Imelda Marcos, the notorious dictators who looted the nation of billions of dollars, left a trail of torture and abuse of p…", "url": "https://www.cnn.com/2022/05/06/opinions/philippines-election-marcos-bongbong-imelda-andelman/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220504185849-01-philippines-election-marcos-super-tease.jpg", "publishedAt": "2022-05-07T03:22:15Z", "content": "David A. Andelman, a contributor to CNN, twice winner of the Deadline Club Award, is a chevalier of the French Legion of Honor, author of \"A Red Line in the Sand: Diplomacy, Strategy, and the History… [+6615 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kaitlan Collins, CNN", "title": "Coronavirus wave this fall and winter could potentially infect 100 million, White House warns", "description": "The Biden administration is issuing a new warning that the US could potentially see 100 million Covid-19 infections this fall and winter, as officials publicly stress the need for more funding from Congress to prepare the nation.", "url": "https://www.cnn.com/2022/05/06/politics/white-house-covid-fall-wave/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220506225400-01-white-house-covid-fall-wave-super-tease.jpg", "publishedAt": "2022-05-07T03:00:57Z", "content": "Washington (CNN)The Biden administration is issuing a new warning that the US could potentially see 100 million Covid-19 infections this fall and winter, as officials publicly stress the need for mor… [+1855 chars]"}]}