{"status": "ok", "totalResults": 83, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Jacob Lev, CNN", "title": "Defending champion Phil Mickelson withdraws from PGA Championship", "description": "Phil Mickelson has withdrawn from the upcoming PGA Championship, the PGA of America announced Friday.", "url": "https://www.cnn.com/2022/05/13/sport/phil-mickelson-defending-champion-withdraws-pga-spt/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220513163533-phil-mickelson-feb-05-super-tease.jpg", "publishedAt": "2022-05-14T00:35:41Z", "content": "(CNN)Phil Mickelson has withdrawn from the upcoming PGA Championship, the PGA of America announced Friday.\r\n\"Phil is the defending champion and currently eligible to be a PGA Life Member and we would… [+552 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rishi Iyengar, CNN Business", "title": "Tech groups ask Supreme Court to put Texas social media censorship law on hold", "description": "Two prominent lobbying groups representing the tech industry's biggest companies are asking the US Supreme Court to step in and block a Texas law that lets the state's residents sue large social media platforms for alleged censorship, two days after a federal…", "url": "https://www.cnn.com/2022/05/13/tech/texas-social-media-law-supreme-court/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220513165639-social-media-phone-screen-stock-super-tease.jpg", "publishedAt": "2022-05-14T00:06:04Z", "content": "San Francisco (CNN Business)Two prominent lobbying groups representing the tech industry's biggest companies are asking the US Supreme Court to step in and block a Texas law that lets the state's res… [+2035 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "China's weakening economy and why the Fed may struggle with a soft landing - CNN Video", "description": "The Fed likely won't have a soft landing but a recession can still be skirted, Mohamed El-Erian predicts. The Allianz adviser explains to CNN's Richard Quest the economic impacts of China's lockdowns, and how investors may fare with \"incredibly distorted\" mar…", "url": "https://www.cnn.com/videos/business/2022/05/13/markets-economy-fed-china-lockdowns-mohamed-el-erian-qmb-vpx.cnnbusiness", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220513154907-mohamed-el-erian-super-tease.jpg", "publishedAt": "2022-05-14T00:03:11Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Julian Zelizer, CNN Political Analyst", "title": "Opinion: It won't be long before extremists in the GOP make Trump look tame", "description": "It seems a new generation of Republicans has emerged to take on the former president and his allies, writes Julian Zelizer. The story is certainly a twist, but it is not surprising. The phenomenon has shaped the conservative movement since the 1970s.", "url": "https://www.cnn.com/2022/05/13/opinions/gop-extremists-kathy-barnette-trump-zelizer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220510220412-kathy-barnette-file-042522-super-tease.jpg", "publishedAt": "2022-05-13T22:46:06Z", "content": "Julian Zelizer, a CNN political analyst, is a professor of history and public affairs at Princeton University and author of the forthcoming book \"The Presidency of Donald J. Trump: A First Historical… [+8068 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Steve Contorno, CNN", "title": "DeSantis taps self-described 'Florida gun lawyer' to oversee elections", "description": "Florida Gov. Ron DeSantis has put in charge of the state's election systems a deeply conservative state lawmaker who has championed legislation to ban so-called sanctuary cities and calls himself the \"Florida gun lawyer.\"", "url": "https://www.cnn.com/2022/05/13/politics/desantis-appoints-cord-byrd-secretary-of-state-elections-florida/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220513182143-cord-byrd-2021-file-super-tease.jpg", "publishedAt": "2022-05-13T22:28:31Z", "content": "(CNN)Florida Gov. Ron DeSantis has put in charge of the state's election systems a deeply conservative state lawmaker who has championed legislation to ban so-called sanctuary cities and calls himsel… [+4071 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacopo Prisco, CNN", "title": "Decoding the hidden messages in one city's street art revival", "description": "Cita Sadeli saw the start of the pandemic from a different angle than most: standing on an articulated lift, hovering 120 feet above street level. She spent much of early March 2020 painting a mural on the exterior of Hotel Xena in downtown Washington, DC, wa…", "url": "https://www.cnn.com/style/article/cita-sadeli-miss-chelove-street-art-nomad/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220511161237-01-miss-chelove-washington-dc-nomad-super-tease.jpg", "publishedAt": "2022-05-13T21:22:22Z", "content": "arts\r\nCita Sadeli saw the start of the pandemic from a different angle than most: standing on an articulated lift, hovering 120 feet above street level. She spent much of early March 2020 painting a … [+5990 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Manu Raju and Melanie Zanona, CNN", "title": "GOP eyes Pelosi as party weighs payback for January 6 subpoenas", "description": "House Republicans, furious that five of their own have been subpoenaed by the January 6 select committee, are discussing their own plans to retaliate if they win back the majority: Issuing subpoenas to Speaker Nancy Pelosi and other top Democrats.", "url": "https://www.cnn.com/2022/05/13/politics/nancy-pelosi-subpoenas-january-6/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211120202312-nancy-pelosi-file-102121-super-tease.jpg", "publishedAt": "2022-05-13T21:11:37Z", "content": "(CNN)House Republicans, furious that five of their own have been subpoenaed by the January 6 select committee, are discussing their own plans to retaliate if they win back the majority: Issuing subpo… [+6378 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kasie Hunt, CNN", "title": "John Fetterman looks to November as primary day in Pennsylvania approaches", "description": "Can a Bernie Sanders-supporting advocate for legal marijuana and lower prison sentences flip a Republican Senate seat in Pennsylvania and help keep the Senate in Democratic hands?", "url": "https://www.cnn.com/2022/05/13/politics/john-fetterman-pennsylvania-governor-race/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220513161759-john-fetterman-campaign-0510-super-tease.jpg", "publishedAt": "2022-05-13T20:53:48Z", "content": "YORK, Pennsylvania (CNN)Can a Bernie Sanders-supporting advocate for legal marijuana and lower prison sentences flip a Republican Senate seat in Pennsylvania and help keep the Senate in Democratic ha… [+4526 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Zachary Cohen, CNN", "title": "New images reveal North Korea restarted construction on long-dormant nuclear reactor", "description": "North Korea appears to have resumed construction at a long-dormant nuclear reactor in recent weeks that, if completed, would dramatically increase its capacity to produce plutonium for nuclear weapons, according to new satellite images obtained by CNN and a s…", "url": "https://www.cnn.com/2022/05/13/politics/north-korea-restarts-construction-nuclear-reactor-satellite-images/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220503235506-kim-jong-un-0428-super-tease.jpg", "publishedAt": "2022-05-13T20:35:32Z", "content": "(CNN)North Korea appears to have resumed construction at a long-dormant nuclear reactor in recent weeks that, if completed, would dramatically increase its capacity to produce plutonium for nuclear w… [+4216 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Syra Madad", "title": "Opinion: How I got over my baby formula shame", "description": "With the current baby formula shortage and continued societal pressure for women to breastfeed, it's important to remember breastfeeding does not happen in a vacuum and mothers should consider emotional, mental and physical well-being along with feasibility, …", "url": "https://www.cnn.com/2022/05/13/opinions/baby-formula-shortage-breast-feeding-madad/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220219224111-baby-formula-stock-super-tease.jpeg", "publishedAt": "2022-05-13T19:54:48Z", "content": "Syra Madad, DHSc, MSc, MCP is an infectious disease epidemiologist, senior director of the system-wide special pathogens program at NYC Health + Hospitals, health and safety lead at the Enhanced Inve… [+6004 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brenda Goodman, CNN", "title": "'This is not my kid': Mysterious hepatitis wreaked havoc in healthy child with shocking speed", "description": "The day they wheeled 2-year-old Baelyn Schwab into surgery to get a new liver, her skin was orange, and she was delirious.", "url": "https://www.cnn.com/2022/05/13/health/hepatitis-child-liver-transplant-baelyn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220513143400-06-saving-baelyn-super-tease.jpg", "publishedAt": "2022-05-13T19:44:34Z", "content": "(CNN)The day they wheeled 2-year-old Baelyn Schwab into surgery to get a new liver, her skin was orange, and she was delirious. \r\n\"Her eyes didn't look like they were attached to her head anymore,\" h… [+16928 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Kids craft a 'keep it 100' pep talk hotline", "description": "On Showtime's \"Desus & Mero,\" the hosts, along with Janelle James of the TV show \"Abbott Elementary,\" enlist a group of children to record \"real talk\" messages for callers. Watch here to see what the kids said.", "url": "https://www.cnn.com/videos/business/2022/05/13/desus-mero-kid-hotline-orig.cnn-business", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220513153050-desus-mero-kid-hotline-1-super-tease.jpg", "publishedAt": "2022-05-13T19:34:05Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Veronica Stracqualursi, Maria Cartaya and Jamiel Lynch, CNN", "title": "Louisiana lawmakers pull back from classifying abortion as homicide", "description": "Louisiana House lawmakers on Thursday pared down a controversial bill that included language seeking to classify abortions as homicides and potentially allow for women to be criminally charged for terminating their pregnancies.", "url": "https://www.cnn.com/2022/05/13/politics/louisiana-abortion-bill-criminalize-women/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220513114705-louisiana-abortion-law-file-super-tease.jpg", "publishedAt": "2022-05-13T19:17:29Z", "content": "(CNN)Louisiana House lawmakers on Thursday pared down a controversial bill that included language seeking to classify abortions as homicides and potentially allow for women to be criminally charged f… [+3330 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Nicole Hemmer", "title": "Opinion: Katie Porter's example reveals a pivotal truth about representation", "description": "But it is one thing to try to empathize or to channel past experiences into policy, and another to actually experience scrimping and saving while in office. What Rep. Katie Porter's recent comments on inflation offer is an ability to say: 'This is happening t…", "url": "https://www.cnn.com/2022/05/13/opinions/inflation-katie-porter-democrats-hemmer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220513144830-katie-porter-0330-restricted-super-tease.jpg", "publishedAt": "2022-05-13T19:15:09Z", "content": "Nicole Hemmer is an associate research scholar at Columbia University with the Obama Presidency Oral History Project and the author of \"Messengers of the Right: Conservative Media and the Transformat… [+5526 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Scottie Andrew", "title": "Kendrick Lamar raps about trans relatives in a new song sparking both praise and criticism", "description": "The response to Kendrick Lamar's new song \"Auntie Diaries\" is divisive: Though Lamar is being praised for acknowledging trans people, he's also being sharply criticized for misgendering his relatives, using his cousin's former name and repeating an anti-LGBTQ…", "url": "https://www.cnn.com/2022/05/13/entertainment/kendrick-lamar-auntie-diaries-transgender-relatives-cec/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220513114951-01-kendrick-lamar-file.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-13T18:43:04Z", "content": "Kendrick Lamars highly anticipated new album includes a personal, if problematic, song about his transgender relatives.\r\nIn the song Auntie Diaries, off his new record Mr. Morale &amp; the Big Steppe… [+2814 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Daniel Dale, CNN", "title": "Fact check: White House tweet falsely claims 'there was no vaccine available' when Biden took office", "description": "The official White House Twitter account tweeted Thursday about the sharp decline in the unemployment rate during President Joe Biden's tenure -- but the tweet began with a false claim about Covid-19 vaccinations.", "url": "https://www.cnn.com/2022/05/13/politics/fact-check-white-house-no-vaccine-available-tweet/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210111150133-joe-biden-vaccination-dose-2-january-11-2020-01-super-tease.jpg", "publishedAt": "2022-05-13T18:36:08Z", "content": "Washington (CNN)The official White House Twitter account tweeted Thursday about the sharp decline in the unemployment rate during President Joe Biden's tenure -- but the tweet began with a false clai… [+3358 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alisha Ebrahimji, Ashley Killough, Raja Razek", "title": "Texas Supreme Court overturns injunction on investigating parents who provide their kids with gender-affirming care", "description": "After a pause on investigations of families seeking gender-affirming care for their transgender children, the Texas Supreme Court said the state's child protective services investigations can continue.", "url": "https://www.cnn.com/2022/05/13/us/texas-supreme-court-overturns-transgender-investigations/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220513112539-01-austin-tx-capitol-and-flag-file.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-13T18:29:02Z", "content": "After a pause on investigations of families seeking gender-affirming care for their transgender children, the Texas Supreme Court said the states child protective services investigations can continue… [+1229 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Liz Szabo, Kaiser Health News", "title": "Covid-19 vaccine boosters are critical for older adults. Why aren't more people getting them?", "description": "Even as top U.S. health officials say it's time America learns to live with the coronavirus, a chorus of leading researchers say faulty messaging on booster shots has left millions of older people at serious risk.", "url": "https://www.cnn.com/2022/05/13/health/older-americans-covid-boosters-khn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210806201520-pba-vacuna-huerta-super-tease.jpg", "publishedAt": "2022-05-13T18:01:38Z", "content": "(KHN)Even as top U.S. health officials say it's time America learns to live with the coronavirus, a chorus of leading researchers say faulty messaging on booster shots has left millions of older peop… [+10072 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Livia Borghese", "title": "Saudi man charged after Maserati driven down Rome's Spanish Steps", "description": "Driver was arrested and faces prosecution for allegedly causing damage to historic landmark after his rented sports car descended the famous stairway in the center of the Italian capital.", "url": "https://www.cnn.com/travel/article/maserati-spanish-steps-italy/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220513122508-04-rome-spanish-steps-maserati-super-tease.jpg", "publishedAt": "2022-05-13T17:55:42Z", "content": "Rome (CNN) When in Rome, don't drive your fancy sports car down historic stairways. \r\nThat apparently went unheeded by a man who this week drove his rented Maserati down the city's Spanish Steps and … [+2208 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Allison Chinchar, CNN Meteorologist", "title": "Record high temperatures this weekend \"are difficult for our firefighters\"", "description": "Record temperatures expected in the fire-ravaged southwestern states will continue to worsen the deepening drought, as well as make for tough fire-fighting conditions, as an intense heat wave will be felt across most of the southern tier of the US this weeken…", "url": "https://www.cnn.com/2022/05/13/weather/record-heat-west-fires-drought-weekend/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220513093204-10-laguna-niguel-fire-0511-super-tease.jpg", "publishedAt": "2022-05-13T17:43:44Z", "content": "(CNN)Record temperaturesexpected inthe fire-ravaged southwestern states will continue to worsen the deepening drought, as well as make for tough fire-fighting conditions, as an intense heat wave will… [+4758 chars]"}]}