{"status": "ok", "totalResults": 77, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Art Acevedo", "title": "Opinion: The tragic failures of Uvalde, as seen by a veteran police chief", "description": "My colleagues in our profession —  retired and active police chiefs and officers —  have spent a lot of time talking about the terrible shooting in Uvalde.", "url": "https://www.cnn.com/2022/06/02/opinions/shooting-uvalde-guns-texas-police-acevedo/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220530002649-uvalde-texas-elementary-school-shooting-monday.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-06-02T22:45:38Z", "content": "Editors Note: Art Acevedo is a CNN law enforcement analyst. He served as police chief in Austin, Houston and Miami, during a career in law enforcement spanning three and a half decades. Acevedo has b… [+9180 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Gabriel Kinder, CNN", "title": "TikTok star shares her breastfeeding journey and excess milk to help others during the baby formula shortage", "description": "Inspired by her TikTok and Instagram followers, Lucie Fink is donating her breast milk for babies in need.", "url": "https://www.cnn.com/2022/06/02/us/formula-shortage-instagram-tiktok-lucie-fink-cnnheroes/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220602171036-lucie-fink-baby-milo-super-tease.jpg", "publishedAt": "2022-06-02T21:59:44Z", "content": "(CNN)With no end in sight to the baby formula shortage, lifestyle content creator and new mom Lucie Fink is stepping up to help babies in need. She's donating her excess breast milk, and she credits … [+2216 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Manu Raju", "title": "'Prepared for failure': Democrats confront reality on gun talks as senators search for 'incremental' deal with GOP", "description": "Senate Democrats are ready to drop some of their most pressing demands to restrict access to guns amid the nationwide onslaught of massacres. But even that may not be enough to reach a deal with Republicans.", "url": "https://www.cnn.com/2022/06/02/politics/senate-democrats-gun-control-negotiations/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/200630213305-senator-chris-murphy-0630.jpg?q=x_0,y_0,h_1125,w_1999,c_fill/w_800", "publishedAt": "2022-06-02T21:25:12Z", "content": "Senate Democrats are ready to drop some of their most pressing demands to restrict access to guns amid the nationwide onslaught of massacres. But even that may not be enough to reach a deal with Repu… [+8144 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Asha Rangappa", "title": "Opinion: What Ronald Reagan could teach Congress about passing gun reform measures", "description": "Asha Rangappa writes that if Congress wants to pass meaningful gun reform -- and with only 50 votes in the Senate -- it should take a page out of former President Ronald Reagan's 1984 playbook and condition federal funding to states based on their compliance …", "url": "https://www.cnn.com/2022/06/02/opinions/gun-reform-backdoor-congress-solution-rangappa/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220525114808-02-gun-store-california-0421-super-tease.jpg", "publishedAt": "2022-06-02T21:22:02Z", "content": "Asha Rangappa is a senior lecturer at Yale's Jackson Institute for Global Affairs. She is a former special agent in the FBI, specializing in counterintelligence investigations. Follow her @AshaRangap… [+6638 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry", "title": "'The Boys' still looks pretty super in its savagely satirical third season", "description": "\"The Boys\" serves notice immediately that its third season will be as ferociously gory and savagely satirical as the preceding two, racing through story at something approaching super-speed. While obviously not intended for every taste, the Amazon series rema…", "url": "https://www.cnn.com/2022/06/02/entertainment/the-boys-season-3-review/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220531130925-01-the-boys-ssn-3.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-06-02T21:11:40Z", "content": "The Boys serves notice immediately that its third season will be as ferociously gory and savagely satirical as the preceding two, racing through story at something approaching super-speed. While obvi… [+3585 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oliver Darcy, CNN Business", "title": "Right-wing conspiracy outlet Infowars moves to exit bankruptcy", "description": "Three companies tied to the far-right conspiracy theorist Alex Jones, including the fringe media organization Infowars, are moving to exit bankruptcy.", "url": "https://www.cnn.com/2022/06/02/media/infowars-sandy-hook-alex-jones/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210204165159-alex-jones-0106-super-tease.jpg", "publishedAt": "2022-06-02T21:04:49Z", "content": "New York (CNN)Three companies tied to the far-right conspiracy theorist Alex Jones, including the fringe media organization Infowars, are moving to exit bankruptcy, according to a Wednesday court doc… [+1374 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Jennifer Henderson and Paradise Afshar, CNN", "title": "Las Vegas wedding chapels receive Elvis cease-and-desist letters", "description": "Some wedding chapels in Las Vegas are receiving cease-and-desist letters demanding they stop using Elvis' image and likeness in their operations, according to two letters obtained by CNN.", "url": "https://www.cnn.com/travel/article/vegas-wedding-chapels-elvis-impersonators/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220602153537-vegas-elvis-wedding-super-tease.jpg", "publishedAt": "2022-06-02T21:02:23Z", "content": "(CNN) Some wedding chapels in Las Vegas are receiving cease-and-desist letters demanding they stop using Elvis' image and likeness in their operations, according to two letters obtained by CNN. \r\nIn … [+4241 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Zachary B. Wolf", "title": "A crash course in student loan debt forgiveness", "description": "On Wednesday, the Biden administration made the largest single effort to help Americans pay down their student debt. But recent moves have also sharpened a debate on whether the rising cost of higher education is an undue burden for young adults.", "url": "https://www.cnn.com/2022/06/02/politics/student-loan-debt-forgiveness-what-matters/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220527183336-college-graduates-cap-file-051422.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-06-02T20:58:00Z", "content": "A version of this story appeared in CNNs What Matters newsletter. To get it in your inbox, sign up for free here.\r\nWhen the Department of Educationannounced massive loan forgiveness for formerstudent… [+6272 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Phil Mattingly, CNN", "title": "White House rapid response director departs for Treasury as Biden's messaging operation transitions", "description": "President Joe Biden's director of rapid response will soon depart the White House for the Treasury Department, becoming the latest West Wing aide to shift to a more senior role in another part of the administration.", "url": "https://www.cnn.com/2022/06/02/politics/mike-gwin-leaving-the-west-wing/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220602121526-mike-gwin-super-tease.jpg", "publishedAt": "2022-06-02T20:44:12Z", "content": "(CNN)President Joe Biden's director of rapid response will soon depart the White House for the Treasury Department, becoming the latest West Wing aide to shift to a more senior role in another part o… [+2665 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacqueline Howard and Michael Nedelman, CNN", "title": "Silent spread of monkeypox may be a wakeup call for the world", "description": "A monkeypox outbreak continues to grow in countries where the virus isn't normally found, putting global health officials on high alert.", "url": "https://www.cnn.com/2022/06/02/health/monkeypox-endemic-silent-spread/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220529191557-monkeypox-microscope-file-super-tease.jpg", "publishedAt": "2022-06-02T20:25:53Z", "content": "By Jacqueline Howard and Michael Nedelman, CNN\r\nUpdated 4:25 PM ET, Thu June 2, 2022\r\n (CNN)A monkeypox outbreak continues to grow in countries where the virus isn't normally found, putting global he… [+10231 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chris Isidore, CNN Business", "title": "Gas prices are skyrocketing. Here's why people haven't cut back on spending - yet", "description": "Soaring gas prices have done little to slow US drivers' purchases at the pump. But they could start to spend less on other goods and services, which would be a strong headwind for an increasingly shaky US economy, experts say.", "url": "https://www.cnn.com/2022/06/02/energy/gas-prices-impact-economy/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220602105913-us-gas-prices-driving-super-tease.jpg", "publishedAt": "2022-06-02T20:20:57Z", "content": "New York (CNN Business)Soaring gas prices have done little to slow US drivers' purchases at the pump. But they could start to spend less on other goods and services, which would be a strong headwind … [+4539 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Harmeet Kaur, CNN", "title": "What studies reveal about gun ownership in the US", "description": "As the nation continues to endure devastating mass shootings and increasing homicide rates, guns remain a fixture of American culture. Here's what polls and surveys conducted in recent years tell us about who owns guns in the US.", "url": "https://www.cnn.com/2022/06/02/us/gun-ownership-numbers-us-cec/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220602145730-gun-ownership-super-tease.jpg", "publishedAt": "2022-06-02T20:13:33Z", "content": "(CNN)As the nation continues to endure devastating mass shootings and increasing homicide rates, guns remain a fixture of American culture.\r\nMany Americans consider the right to bear arms sacred, see… [+4441 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Natasha Bertrand, Kevin Liptak, MJ Lee and Alex Marquardt, CNN", "title": "Meeting between Biden and Saudi crown prince increasingly likely after diplomatic breakthroughs", "description": "A meeting this month between President Joe Biden and Saudi Arabia's de facto ruler, Crown Prince Mohammed bin Salman, is looking increasingly likely after two key deals were reached on Thursday following months of diplomatic heavy lifting by the US.", "url": "https://www.cnn.com/2022/06/02/politics/mohammed-bin-salman-joe-biden-meeting/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210217134304-biden-bin-salman-split-super-tease.jpg", "publishedAt": "2022-06-02T19:53:31Z", "content": "(CNN)A meeting this month between President Joe Biden and Saudi Arabia's de facto ruler, Crown Prince Mohammed bin Salman, is looking increasingly likely after two key deals were reached on Thursday … [+4688 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tami Luhby, CNN", "title": "Social Security won't be able to pay full benefits by 2035 if Congress doesn't act", "description": "Americans will stop receiving their full Social Security benefits in about 13 years if lawmakers don't act to address the pending shortfall, according to a new annual report. That's when funds that help support payouts for the elderly, survivors and disabled …", "url": "https://www.cnn.com/2022/06/02/politics/social-security-medicare-report/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210922121430-social-security-check-file-super-tease.jpg", "publishedAt": "2022-06-02T19:45:11Z", "content": "(CNN)Americans will stop receivingtheir full Social Security benefits in about 13 years if lawmakers don't act to address the pending shortfall, according to an annual report released Thursday by the… [+2576 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Gabby Orr, CNN", "title": "Trump endorses Blake Masters in Arizona GOP Senate primary", "description": "Former President Donald Trump has endorsed Arizona Senate hopeful Blake Masters in a move that aides believe will give the Republican significant momentum ahead of the state's August primary.", "url": "https://www.cnn.com/2022/06/02/politics/blake-masters-donald-trump-arizona-senate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210715161620-blake-masters-az-senate-screengrab-super-tease.jpg", "publishedAt": "2022-06-02T19:39:27Z", "content": "(CNN)Former President Donald Trump has endorsed Arizona Senate hopeful Blake Masters in a move that aides believe will give the Republican significant momentum ahead of the state's August primary. \r\n… [+731 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Sara Ashley O'Brien, CNN Business", "title": "After Depp, Heard verdict, Me Too founder says movement can't be stopped", "description": "For weeks, the countless takes, tweets, and TikToks about actor Johnny Depp's defamation trial against Amber Heard have been inescapable. It was hard to ignore the fierce online embrace of Depp or the vitriol directed at Heard. It became clear that the trial …", "url": "https://www.cnn.com/2022/06/02/tech/depp-heard-verdict-metoo/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220428174158-depp-heard-trial-split-super-tease.jpg", "publishedAt": "2022-06-02T19:22:02Z", "content": "(CNN Business)For weeks, the countless takes, tweets, and TikToks about actor Johnny Depp's defamation trial against Amber Heard have been inescapable. It was hard to ignore the fierce online embrace… [+4628 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristin Fisher, CNN", "title": "Watchdog report says Trump-era Space Command decision fell short on transparency", "description": "The US Air Force's decision-making process to move Space Command headquarters from Colorado Springs to Alabama had \"significant shortfalls in its transparency and credibility,\" according to a report released Thursday by the Government Accountability Office (G…", "url": "https://www.cnn.com/2022/06/02/politics/watchdog-report-space-command-headquarters/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200515183227-01-us-space-force-flag-super-tease.jpg", "publishedAt": "2022-06-02T19:04:58Z", "content": "(CNN)The US Air Force's decision-making process to move Space Command headquarters from Colorado Springs to Alabama had \"significant shortfalls in its transparency and credibility,\" according to a re… [+2549 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Stelter", "title": "More than a week after Uvalde massacre, officials are still avoiding the media's questions about what happened", "description": "The obituaries for the shooting victims of Robb Elementary took up three full pages in the Uvalde Leader-News on Thursday. The rest of the paper contains haunting questions about why they died.", "url": "https://www.cnn.com/2022/06/02/media/uvalde-shooting-news-coverage-press/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220602141638-uvalde-texas-questions-0602.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-06-02T18:33:46Z", "content": "The obituaries for the shooting victims of Robb Elementary took up three full pages in the Uvalde Leader-News on Thursday. The rest of the paper contains haunting questions about why they died. \r\nThe… [+4106 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alisha Ebrahimji, Caroll Alvarado, Amanda Watts", "title": "Tulsa hospital shooting victim remembered by colleagues as a kind man whose impact touched lives in Tulsa and Africa", "description": "Two physicians, one receptionist and one patient were killed during a shooting inside an Oklahoma medical building on Wednesday.", "url": "https://www.cnn.com/2022/06/02/us/tulsa-shooting-victims-what-we-know/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220602125643-01-tulsa-shooting-victims-preston-phillips.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-06-02T18:27:12Z", "content": "Two physicians, one receptionist and one patient were killed during a shooting inside an Oklahoma medical building on Wednesday.\r\nA gunman, who was also a patient at the hospital himself, shot and ki… [+3990 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sean Lyngaas", "title": "US confirms military hackers have conducted cyber operations in support of Ukraine", "description": "Cyber Command, the US military's hacking unit, has conducted offensive cyber operations in support of Ukraine as it defends itself against Russia's invasion, the head of the command has confirmed.", "url": "https://www.cnn.com/2022/06/02/politics/us-hackers-ukraine-support/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210621154549-hackers-keyboard.jpg?q=x_0,y_131,h_1419,w_2523,c_crop/w_800", "publishedAt": "2022-06-02T18:09:23Z", "content": "Cyber Command, the US militarys hacking unit, has conducted offensive cyber operations in support of Ukraine as it defends itself against Russias invasion, the head of the command has confirmed. \r\nTh… [+4972 chars]"}]}