{"status": "ok", "totalResults": 80, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Paradise Afshar", "title": "Austrian climber found dead on the slopes of North America's tallest peak", "description": "The body of an Austrian climber who was last heard from a week ago has been found on the slopes of Alaska's Mount Denali, authorities said on Friday.", "url": "https://www.cnn.com/2022/05/07/us/austrian-climber-found-dead-alaska-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220506223246-denali-national-park-file.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-07T04:28:33Z", "content": "The body of an Austrian climber who was last heard from a week ago has been found on the slopes of Alaskas Mount Denali, authorities said on Friday.\r\nAn aerial search spotted the body of Matthias Rim… [+1768 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Christina Maxouris, CNN", "title": "Authorities made a key discovery in their search for the missing Alabama officer and inmate. It led to more questions", "description": "In their search for a missing former corrections official and an inmate facing murder charges, authorities announced a key discovery Friday: they located the car they previously believed the pair was traveling in.", "url": "https://www.cnn.com/2022/05/07/us/vicky-white-casey-white-alabama-manhunt-saturday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220506213052-0506-casey-white-vicky-white-split-super-tease.jpg", "publishedAt": "2022-05-07T04:25:27Z", "content": "(CNN)In their search for a missing former corrections official and an inmate facing murder charges, authorities announced a key discovery Friday: they located the car they previously believed the pai… [+4600 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/jessie-yeung\">Jessie Yeung</a> and <a href=\"/profiles/andrew-raine\">Andrew Raine</a>, CNN", "title": "Russia's war in Ukraine", "description": "A Ukrainian commander at the Azovstal steel plant said there are \"bloody battles\" unfolding with Russian forces inside the complex after they breached the perimeter. Follow here for live updates.", "url": "https://www.cnn.com/europe/live-news/russia-ukraine-war-news-05-07-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220506070801-azovstal-050522-super-tease.jpg", "publishedAt": "2022-05-07T04:04:57Z", "content": "The United Kingdom announced Saturday it will bolster its humanitarian aid to Ukraine by sending more essential equipment to relief centers and hospitals. \r\nIn a statement, the British government sai… [+1718 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by David A. Andelman", "title": "Opinion: Many Filipinos might not recall the frightening rule of Ferdinand and Imelda Marcos -- but I do", "description": "The favorite to become next Philippines president is Ferdinand Marco Jr. -- better known as \"Bongbong\" -- the only son of Ferdinand and Imelda Marcos, the notorious dictators who looted the nation of billions of dollars, left a trail of torture and abuse of p…", "url": "https://www.cnn.com/2022/05/06/opinions/philippines-election-marcos-bongbong-imelda-andelman/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220504185849-01-philippines-election-marcos-super-tease.jpg", "publishedAt": "2022-05-07T03:22:15Z", "content": "David A. Andelman, a contributor to CNN, twice winner of the Deadline Club Award, is a chevalier of the French Legion of Honor, author of \"A Red Line in the Sand: Diplomacy, Strategy, and the History… [+6615 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kaitlan Collins, CNN", "title": "Coronavirus wave this fall and winter could potentially infect 100 million, White House warns", "description": "The Biden administration is issuing a new warning that the US could potentially see 100 million Covid-19 infections this fall and winter, as officials publicly stress the need for more funding from Congress to prepare the nation.", "url": "https://www.cnn.com/2022/05/06/politics/white-house-covid-fall-wave/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220506225400-01-white-house-covid-fall-wave-super-tease.jpg", "publishedAt": "2022-05-07T03:00:57Z", "content": "Washington (CNN)The Biden administration is issuing a new warning that the US could potentially see 100 million Covid-19 infections this fall and winter, as officials publicly stress the need for mor… [+1855 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Nick Confessore on Tucker Carlson's 'apocalyptic' rhetoric and remarkable reach - Reliable Sources with Brian Stelter - Podcast on CNN Audio", "description": "On your computer On your mobile device Smart speakers US World Politics Business Reliable Sources examines how journalists do their jobs and how the media affect the stories they cover in this weekly CNN program.(cnn.com)", "url": "https://www.cnn.com/audio/podcasts/reliable-sources/episodes/117369ff-da46-4854-909b-ae8c017a446b", "urlToImage": "https://www.cnn.com/audio/static/images/podcasts/reliable-sources-square-l.9042e67c.jpg", "publishedAt": "2022-05-07T01:30:02Z", "content": "10 PM ET: Ukraine aid package, Justice Clarence Thomas, Cuba hotel explosion &amp; more\r\nOn your computerOn your mobile deviceSmart speakers\r\nUSWorldPoliticsBusiness"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": null, "description": "explosive scoop about a draft opinion revealing that the Supreme Court has voted to overturn Roe v. Wade first tweet about the story had more than triple the impressions Politico normally sees in an entire month on Twitter, the rep said. The outlet's previous…", "url": "https://view.newsletters.cnn.com/messages/165188331508615fbb5acd471/raw", "urlToImage": null, "publishedAt": "2022-05-07T01:30:01Z", "content": "The Department of Defense fought to prevent its previous chief, Mark Esper, from revealing in his book that former President Donald Trump had proposed launching missiles into Mexico to destroy drug l… [+2257 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Steve Almasy", "title": "Nine hospitalized after Texas authorities find dozens of undocumented workers in semi trailer", "description": "Nine people were treated for dehydration and scores of others fled the scene when authorities discovered up to 100 undocumented workers in the trailer of a broken-down semi in rural Texas, officials said Friday.", "url": "https://www.cnn.com/2022/05/06/us/texas-undocumented-workers-truck-hospitalized/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220506174910-01-texas-migrants-truck-flee.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-07T01:27:51Z", "content": "Nine people were treated for dehydration and scores of others fled the scene when authorities discovered up to 100 undocumented workers in the trailer of a broken-down semi in rural Texas, officials … [+1851 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Andrew Raine", "title": "Chelsea Football Club will be sold to group led by Todd Boehly", "description": "Chelsea Football Club announced Friday that terms have been agreed for a new ownership group, led by Todd Boehly, to buy the club.", "url": "https://www.cnn.com/2022/05/06/football/chelsea-football-club-to-be-bought-by-todd-boehly/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220415112305-chelsea-football-club-file-0310-super-tease.jpg", "publishedAt": "2022-05-07T01:27:00Z", "content": "(CNN)Chelsea Football Club announced Friday that terms have been agreed for a new ownership group, led by Todd Boehly, to buy the club.\r\nBoehly owns stakes in the MLB's Los Angeles Dodgers, the NBA's… [+847 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oliver Darcy", "title": "Politico's exclusive on Roe v. Wade was most-viewed story in outlet's history", "description": "Politico's explosive scoop about a draft opinion revealing that the Supreme Court had voted to overturn Roe v. Wade has become the most-trafficked story in the outlet's 15-year history, a spokesperson for the outlet told CNN on Friday.", "url": "https://www.cnn.com/2022/05/06/media/politico-scotus-roe-v-wade-scoop/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220506171931-01-politico-scotus-scoop.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-07T01:18:13Z", "content": "Politicos explosive scoop about a draft opinion revealing that the Supreme Court had voted to overturn Roe v. Wade has become the most-trafficked story in the outlets 15-year history, a spokesperson … [+904 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oliver Darcy", "title": "Defense Dept. tried to block Esper from revealing Trump floated launching missiles into Mexico to 'destroy' drug labs", "description": "The Department of Defense fought to prevent Mark Esper, the former secretary of defense, from revealing in his forthcoming book that former President Donald Trump had proposed launching missiles into Mexico to destroy drug labs.", "url": "https://www.cnn.com/2022/05/06/media/mark-esper-trump-missiles-mexico-defense-department/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/211128174453-mark-esper-2020-file.jpg?q=x_3,y_44,h_1684,w_2993,c_crop/w_800", "publishedAt": "2022-05-07T01:13:05Z", "content": "The Department of Defense fought to prevent Mark Esper, the former secretary of defense, from revealing in his forthcoming book that former President Donald Trump had proposed launching missiles into… [+2288 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Michael Warren", "title": "In Pennsylvania, McCormick campaign keeps up attacks over Oz's Turkish ties", "description": "Republican Senate candidate Dave McCormick has honed in on a closing message in the final days before the May 17 Pennsylvania primary: questioning the patriotic loyalties of his main primary opponent, Mehmet Oz.", "url": "https://www.cnn.com/2022/05/06/politics/dr-oz-mccormick-turkey-pennsylvania-senate/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220506185237-mehmet-oz-file-042122.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-07T00:49:48Z", "content": "Republican Senate candidate Dave McCormick has honed in on a closing message in the final days before the May 17 Pennsylvania primary: questioning the patriotic loyalties of his main primary opponent… [+5274 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Shawna Mizelle, CNN", "title": "Who is Brad Raffensperger, Georgia's Republican secretary of state?", "description": "Georgia Secretary of State Brad Raffensperger is being swept into another sensitive political matter, the latest in a series of headline-grabbing incidents for an official whose day-to-day duties typically render the position obscure.", "url": "https://www.cnn.com/2022/05/06/politics/who-is-brad-raffensperger-georgia-secretary-of-state/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220506160120-brad-raffensperger-file-restricted-050422-super-tease.jpg", "publishedAt": "2022-05-07T00:15:01Z", "content": "Washington (CNN)Georgia Secretary of State Brad Raffensperger is being swept into another sensitive political matter, the latest in a series of headline-grabbing incidents for an official whose day-t… [+5573 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ariel Edwards-Levy, CNN", "title": "Americans' views on abortion diverge along more than just partisan lines", "description": "Americans' views on abortion are sharply divided across partisan lines, CNN's latest polling shows: An overwhelming 88% of Democrats want to see Roe vs. Wade upheld, while a smaller 63% majority of Republicans want to see it overturned. But neither party is e…", "url": "https://www.cnn.com/2022/05/06/politics/partisan-divides-abortion-cnn-poll/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220504102651-roe-wade-protest-0503-texas-super-tease.jpg", "publishedAt": "2022-05-07T00:01:21Z", "content": "(CNN)Americans' views on abortion are sharply divided across partisan lines, CNN's latest polling shows: An overwhelming 88% of Democrats want to see Roe vs. Wade upheld, while a smaller 63% majority… [+3936 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Cheri Mossburg and Taylor Romine, CNN", "title": "Widower of Black woman who died hours after childbirth files civil rights lawsuit against Cedars-Sinai", "description": "The widower of a Black woman who died shortly after giving birth to the couple's second son is taking aim at Cedars-Sinai Medical Center and its parent health system for a second time by filing a civil rights lawsuit alleging she received inferior care becaus…", "url": "https://www.cnn.com/2022/05/06/us/california-civil-rights-lawsuit-cedars-sinai/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/200221005825-04-fathers-maternal-mortality-super-tease.jpg", "publishedAt": "2022-05-06T23:22:20Z", "content": "(CNN)The widower of a Black woman who died shortly after giving birth to the couple's second son is taking aim at Cedars-Sinai Medical Center and its parent health system for a second time by filing … [+4690 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Fung, CNN", "title": "Judge dismisses Trump lawsuit against Twitter over ban", "description": "A federal judge in San Francisco has dismissed former President Donald Trump's lawsuit against Twitter that sought to reinstate his banned account on the platform, according to a court filing.", "url": "https://www.cnn.com/2022/05/06/tech/trump-twitter-lawsuit-dismissed/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220506175103-donald-trump-file-050122-super-tease.jpg", "publishedAt": "2022-05-06T22:16:54Z", "content": "(CNN Business)A federal judge in San Francisco has dismissed former President Donald Trump's lawsuit against Twitter that sought to reinstate his banned account on the platform, according to a court … [+1370 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Bo Lillis, Jeremy Herb, Zachary Cohen", "title": "White House walks a fine line with intelligence sharing in Ukraine", "description": "Two months into Russia's war in Ukraine, the Biden administration has increased the amount of intelligence it shares with Kyiv, contributing to successful strikes against senior Russian leaders and the Russian Navy's flagship, the Moskva, sources familiar wit…", "url": "https://www.cnn.com/2022/05/06/politics/white-house-intelligence-sharing-ukraine-red-line-russia/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220418131404-moska-fire-0418.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-06T22:02:39Z", "content": "Two months into Russias war in Ukraine, the Biden administration has increased the amount of intelligence it shares with Kyiv, contributing to successful strikes against senior Russian leaders and th… [+5958 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Helen Regan and Yasmin Coles, CNN\nPhotographs by Veejay Villafranca for CNN", "title": "Son of dictator poised for the presidency as the Philippines goes to the polls", "description": "Almost 40 years since the Marcos dictatorship in the Philippines ended in a mass uprising, Marcos Sr's son and namesake, Ferdinand Marcos Jr is frontrunner to become the country's next President when Filipinos vote in general elections on May 9, replacing Pre…", "url": "https://www.cnn.com/2022/05/06/asia/philippines-election-presidency-marcos-profile-dst-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220504233640-01-philippines-election-feature-super-tease.jpg", "publishedAt": "2022-05-06T21:55:38Z", "content": "(CNN)Six years after losing the race for vice president, the son of Philippines' dictator Ferdinand Marcos is taking on his old rival Leni Robredo -- and this time they're both aiming for the preside… [+12758 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oren Liebermann, Henry Klapper", "title": "Sailors on Navy aircraft carrier outline bleak living conditions and leadership failures following series of suicides", "description": "The commanding officer stood before the sailors of the USS George Washington's security team. One of their own, Xavier Sandor, had taken his life a few weeks earlier in mid-April, and the captain had come down to speak with the 110 or so young men and women w…", "url": "https://www.cnn.com/2022/05/06/politics/uss-george-washington-conditions/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220505163259-uss-george-washington-0505.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-06T21:50:46Z", "content": "Newport News, VirginiaCNN\r\n  — \r\nThe commanding officer stood before the sailors of the USS George Washingtons security team. One of their own, Xavier Sandor, had taken his life a few weeks earlier i… [+9948 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Megan Thomas", "title": "Mike Hagerty, 'Friends' and 'Somebody Somewhere' actor, has died", "description": "Mike Hagerty, a character actor known for his roles in shows like \"Friends\" and films like \"Overboard,\" has passed away, Bridget Everett, his costar in HBO's \"Somebody Somewhere,\" said in an Instagram post.", "url": "https://www.cnn.com/2022/05/06/entertainment/mike-hagerty-dead/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220506170132-01-mike-hagerty.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-06T21:11:01Z", "content": "Mike Hagerty, a character actor known for his roles in shows like Friends and films like Overboard, has passed away, Bridget Everett, his costar in HBOs Somebody Somewhere, said in an Instagram post.… [+1136 chars]"}]}