{"status": "ok", "totalResults": 108, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Maeve Reston, CNN", "title": "Three years after leaving Trump White House, Sarah Huckabee Sanders glides toward GOP nomination for Arkansas governor", "description": "Sarah Huckabee Sanders, who has leaned into the more controversial chapters of her time in the Trump White House during her Arkansas gubernatorial campaign, is on a glide path toward securing the Republican nomination on Tuesday long after clearing the field …", "url": "https://www.cnn.com/2022/05/24/politics/sarah-huckabee-sanders-arkansas-governor-gop-primary/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220523153926-01-sarah-sanders-campaigning-super-tease.jpg", "publishedAt": "2022-05-24T14:11:23Z", "content": "(CNN)Sarah Huckabee Sanders, who has leaned into the more controversial chapters of her time in the Trump White House during her Arkansas gubernatorial campaign, is on a glide path toward securing th… [+11461 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Fung, CNN", "title": "Federal appeals court rules for social media companies in battle over content moderation", "description": "Key parts of a Florida law restricting social media platforms' ability to moderate content likely violate the First Amendment, a federal appeals court ruled Monday, in a victory for the tech industry amid a wider battle over digital speech.", "url": "https://www.cnn.com/2022/05/24/tech/federal-court-ruling-florida-social-media-content-moderation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220524094047-03-social-media-phone-stock-super-tease.jpeg", "publishedAt": "2022-05-24T14:04:12Z", "content": "Washington (CNN Business)Key parts of a Florida law restricting social media platforms' ability to moderate content likely violate the First Amendment, a federal appeals court ruled Monday, in a vict… [+3135 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Mark Wolfe for CNN Business Perspectives", "title": "Opinion: The US solar panel industry is on the verge of collapsing. Here's how to prevent it", "description": "To meet the nation's clean energy goals, the US must develop a robust manufacturing capability to produce solar energy panels and components. It can do that by providing financial incentives to US manufacturers to help offset higher domestic production costs.", "url": "https://www.cnn.com/2022/05/24/perspectives/solar-panels-tariffs-clean-energy/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220524093322-restricted-us-solar-panel-industry.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-24T13:59:37Z", "content": "Editors Note: Mark Wolfe is an energy economist and serves as the executive director of the National Energy Assistance Directors Association (NEADA), representing the state directors of the Low Incom… [+3700 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kara Scannell, CNN", "title": "New York attorney general subpoenas Trump's longtime assistant for testimony", "description": "The New York attorney general's office has subpoenaed former President Donald Trump's longtime executive assistant for testimony as part of its civil investigation into the Trump Organization's finances.", "url": "https://www.cnn.com/2022/05/24/politics/trump-new-york-attorney-general/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220524092207-01-rhona-graff-file-super-tease.jpg", "publishedAt": "2022-05-24T13:58:16Z", "content": "(CNN)The New York attorney general's office has subpoenaed former President Donald Trump's longtime executive assistant for testimony as part of its civil investigation into the Trump Organization's … [+2657 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sonia Moghe, CNN", "title": "Amber Heard's attorneys rest their case in defamation trial", "description": "Attorneys for Amber Heard have rested their case in the defamation trial between the actress and her ex-husband, Johnny Depp.", "url": "https://www.cnn.com/2022/05/24/entertainment/johnny-depp-amber-heard-trial/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220517103727-01-depp-heard-trial-0517-super-tease.jpg", "publishedAt": "2022-05-24T13:54:14Z", "content": "(CNN)Attorneys for Amber Heard have rested their case in the defamation trial between the actress and her ex-husband, Johnny Depp.\r\nDepp has sued Heard for $50 million over a 2018 op-ed for the Washi… [+951 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Scottie Andrew", "title": "Obi-Wan Kenobi returns to our screens this week. Here's where he left off", "description": "Ewan McGregor returns as our beloved bearded Jedi in the Disney+ series \"Obi-Wan Kenobi\" -- after a whopping 17 years away from the \"Star Wars\" universe.", "url": "https://www.cnn.com/2022/05/24/entertainment/obi-wan-kenobi-series-star-wars-disney-plus-cec/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220518144736-03-obi-wan-series-disney.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-24T13:42:11Z", "content": "After a whopping 17 years away from the Star Wars universe, Ewan McGregor returns this week as our beloved bearded Jedi, Obi-Wan Kenobi. Patience, you must have, INDEED. \r\nBut what was Master Kenobi … [+4525 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Marnie Hunter and Forrest Brown, CNN", "title": "CDC adds five new destinations to 'high' risk category for travel, including the Bahamas", "description": "The US Centers for Disease Control and Prevention added five new destinations -- including Belize and the Bahamas -- to its \"high\" risk category for travelers on Monday.", "url": "https://www.cnn.com/travel/article/cdc-covid-travel-risk-destinations-may-23/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190401153142-bahamas-turtles-savannah-sound-eleuthera-super-tease.jpg", "publishedAt": "2022-05-24T13:40:17Z", "content": "(CNN) The US Centers for Disease Control and Prevention added five new destinations to its \"high\" risk category for travelers on Monday.\r\nThe Central American country of Belize, the Bahamas archipela… [+5208 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Faith Karimi, CNN", "title": "The Black birdwatcher who recorded a viral clash with a White woman in New York's Central Park will host his own National Geographic show", "description": "Christian Cooper's National Geographic series, \"Extraordinary Birder,\" will premiere in 2023 and showcase colorful birds around the US.", "url": "https://www.cnn.com/2022/05/24/entertainment/christian-cooper-national-geographic-show-cec/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220523141851-christian-cooper-extraordinary-birder-super-tease.jpg", "publishedAt": "2022-05-24T13:30:42Z", "content": "(CNN)Birdwatcher Christian Cooper was thrust into the spotlight in 2020 when he filmed a racially charged encounter with a White woman in New York's Central Park. Next year he'll be back on televisio… [+4662 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kevin Liptak, CNN", "title": "An off-script Biden works to bury Trump's legacy in Asia", "description": "When President Joe Biden stated unequivocally Monday he was willing to intervene militarily to defend Taiwan against a Chinese attack, it was not the first time this city has seen a US president catch his national security aides off guard.", "url": "https://www.cnn.com/2022/05/24/politics/joe-biden-donald-trump-asia-legacy/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220523123902-01-biden-abroad-japan-0523-super-tease.jpg", "publishedAt": "2022-05-24T12:33:52Z", "content": "Tokyo (CNN)When President Joe Biden stated unequivocally Monday he was willing to intervene militarily to defend Taiwan against a Chinese attack, it was not the first time this city has seen a US pre… [+6412 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Evan Perez, Whitney Wild and Kaitlan Collins, CNN", "title": "DOJ requires officers to intervene if they see another use excessive force as part of broader reform effort", "description": "The Justice Department will require its agents and law enforcement officers to intervene and render aid if they see another officer use excessive force against a detainee -- a policy change in tandem with a series of police reform measures that the Biden admi…", "url": "https://www.cnn.com/2022/05/24/politics/justice-department-excessive-force/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220505122422-doj-seal-file-restricted-super-tease.jpg", "publishedAt": "2022-05-24T12:30:47Z", "content": "Washington (CNN)The Justice Department will require its agents and law enforcement officers to intervene and render aid if they see another officer use excessive force against a detainee -- a policy … [+2178 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amanda Davies, Matias Grez", "title": "Paris Saint-Germain chief promises 'a lot of changes' to create 'new era' at the club", "description": "After managing to hold onto his star player when it looked likely he would depart for Real Madrid, Paris Saint-Germain President Nasser Al-Khelaifi has promised \"a lot of changes\" in order to \"create a new era\" at the club.", "url": "https://www.cnn.com/2022/05/24/football/paris-saint-germain-nasser-al-khelaifi-promises-changes-spt-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220524083810-mbappe-khelaifi.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-24T12:22:16Z", "content": "After managing to hold onto his star player when it looked likely he would depart for Real Madrid, Paris Saint-Germain President Nasser Al-Khelaifi has promised a lot of changes in order to create a … [+6041 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Maureen Chowdhury, <a href=\"/profiles/aditi-sandal\">Aditi Sangal</a>, Melissa Macaya and Mike Hayes, CNN", "title": "Georgia, Alabama, Arkansas, Texas and Minnesota elections", "description": "Voters are heading to the polls in Georgia, Texas, Alabama, Arkansas and Minnesota in another round of primary contests that will test former President Trump's endorsement power. Follow here for the latest news updates, results and analysis.", "url": "https://www.cnn.com/politics/live-news/primary-election-results-georiga-alabama-2022/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220518045254-north-carolina-primary-voting-0517-super-tease.jpg", "publishedAt": "2022-05-24T12:07:33Z", "content": "Georgia will host competitive senate and governor elections in November, but the most competitive primaries will be Republican contests for governor and secretary of state and the Democratic primary … [+3391 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by David A. Andelman", "title": "Biden shouldn't confuse Taiwan with Ukraine", "description": "Taiwan is not Ukraine. China, in that part of the world especially, is not Russia. Still, in his off-the-cuff remarks that the United States will come directly to Taiwan's rescue if Beijing chooses to take the self-governing island by force, President Joe Bid…", "url": "https://www.cnn.com/2022/05/24/opinions/biden-china-taiwan-andelman/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220523082745-03-biden-asia-trip-0523-super-tease.jpg", "publishedAt": "2022-05-24T11:36:48Z", "content": "David A. Andelman, a contributor to CNN and twice winner of the Deadline Club Award, is a chevalier of the French Legion of Honor, author of \"A Red Line in the Sand: Diplomacy, Strategy, and the Hist… [+6978 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Metz", "title": "Google's new Street View camera is more portable (and looks weirdly cute)", "description": "Since launching in five US cities in 2007, Google's Street View cars have been circling the globe, using roof-mounted cameras to map more than 10 million miles of imagery — pictures that have been stitched together to build a visual map of much of the world.", "url": "https://www.cnn.com/2022/05/24/tech/google-street-view-new-camera/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220523152000-embargoed-google-street-view-new-camera-prototype.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-24T11:05:28Z", "content": "Since launching in five US cities in 2007, Googles Street View cars have been circling the globe, using roof-mounted cameras to map more than 10 million miles of imagery pictures that have been stitc… [+2984 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Metz, CNN Business", "title": "She thought a dark moment in her past was forgotten. Then she scanned her face online", "description": "Cher Scarlett, a software engineer, has a history of being misidentified by face-scanning technology, including one instance that may have surfaced a distant ancestor in a photo. So when she was introduced to an online facial-recognition tool she hadn't heard…", "url": "https://www.cnn.com/2022/05/24/tech/cher-scarlett-facial-recognition-trauma/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220517160555-cher-scarlett-super-tease.jpg", "publishedAt": "2022-05-24T11:02:26Z", "content": "(CNN Business)Cher Scarlett, a software engineer, has a history of being misidentified by face-scanning technology, including one instance that may have surfaced a distant ancestor in a photo. So whe… [+15738 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rob Picheta, Radina Gigova", "title": "Boris Johnson under more pressure over new lockdown 'Partygate' photos", "description": "Britain's beleaguered Prime Minister Boris Johnson is facing accusations he misled lawmakers and is staring down fresh calls to resign, after new images were published appearing to show him raising a glass with colleagues at a social gathering inside Downing …", "url": "https://www.cnn.com/2022/05/24/uk/boris-johnson-partygate-new-pictures-gbr-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220523213531-01-boris-johnson-lockdown-party.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-24T11:02:04Z", "content": "Britains beleaguered Prime Minister Boris Johnson is facing accusations he misled lawmakers and is staring down fresh calls to resign, after new images were published appearing to show him raising a … [+3629 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Priscilla Alvarez, CNN", "title": "Keeping Title 42 in place won't slow US-Mexico border crossings, officials say", "description": "A court ruling blocking the termination of a Trump-era pandemic restriction at the US-Mexico border is unlikely to slow border crossings, Biden administration officials say, as migration in the Western hemisphere reaches new highs.", "url": "https://www.cnn.com/2022/05/24/politics/title-42-border-crossings/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220505154054-asylum-seekers-mexico-border-file-032122-super-tease.jpg", "publishedAt": "2022-05-24T11:01:33Z", "content": "(CNN)A court ruling blocking the termination of a Trump-era pandemic restriction at the US-Mexico border is unlikely to slow border crossings, Biden administration officials say, as migration in the … [+4830 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Barry Neild, CNN", "title": "Elizabeth line: Huge new underground railway opens deep beneath London", "description": "A huge new subterranean railway whisked fare-paying passengers deep beneath the streets of London for the first time on Tuesday as the UK capital opened a $25 billion new metro line that will transform travel across the city.", "url": "https://www.cnn.com/travel/article/elizabeth-line-london-opening/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220524105130-crossrail-tunnel-super-tease.jpg", "publishedAt": "2022-05-24T10:40:17Z", "content": "Barry Neild, CNNPublished 24th May 2022\r\nEditor's Note Monthly Ticket is a new CNN Travel series that spotlights some of the most fascinating topics in the travel world. In May, we're riding the rail… [+3755 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Silvia Marchetti, CNN", "title": "How American-style cheesecake was born in ancient Rome", "description": "Toga clad Romans loved snacking on Savilium cheesecake made from goat milk and honey. Their recipes evolved over time and distance to become American cheesecake, which is now a big hit back in Italy.", "url": "https://www.cnn.com/travel/article/american-cheesecake-ancient-rome/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220523170621-wild-fruits-and-strawberry-italian-cheesecake-made-by-simona--super-tease.jpg", "publishedAt": "2022-05-24T10:28:04Z", "content": "Editor's Note Sign up to CNN Travel's Unlocking Italy newsletter for insider intel on Italy's best loved destinations and lesser-known regions to plan your ultimate trip. Plus, we'll get you in the m… [+7546 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jessie Yeung, Nectar Gan and Steven Jiang, CNN", "title": "What you need to know about China-Taiwan tensions", "description": "US President Joe Biden's warning the US would defend Taiwan against Chinese aggression has made headlines around the world -- and put growing tensions between the small democratic island and its neighboring autocratic superpower back under the spotlight.", "url": "https://www.cnn.com/2022/05/24/china/china-taiwan-conflict-explainer-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220524032125-taiwan-navy-exercise-0107-restricted-super-tease.jpg", "publishedAt": "2022-05-24T10:20:49Z", "content": "Hong Kong (CNN)US President Joe Biden's warning the US would defend Taiwan against Chinese aggression has made headlines around the world -- and put growing tensions between the small democratic isla… [+9310 chars]"}]}