{"status": "ok", "totalResults": 118, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Horowitz, CNN Business", "title": "Retailers just sounded an alarm on inflation. It's worth heeding", "description": "Shares of retailers were pummeled on Wednesday as investors dug through the latest earnings results from Target and Walmart, which were flush with signs that the economy is entering a period of deep uncertainty.", "url": "https://www.cnn.com/2022/05/19/investing/premarket-stocks-trading/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220519123820-target-bell-051922-super-tease.jpg", "publishedAt": "2022-05-19T12:35:21Z", "content": "A version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up right here. You can listen to an audio version of the newsletter by clicking the … [+7262 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jordan Valinsky", "title": "Taco Bell's Mexican Pizza finally returns to menus", "description": "Taco Bell's highly anticipated Mexican Pizza finally returns to menus Thursday following a roughly two-year hiatus.", "url": "https://www.cnn.com/2022/05/19/business/taco-bell-mexican-pizza-return/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220417084721-taco-bell-mexican-pizza.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-19T12:06:20Z", "content": "Taco Bells highly anticipated Mexican Pizza finally returns to menus Thursday following a roughly two-year hiatus.\r\nThe beloved menu item was eliminated in November 2020 as part of a broader culling … [+1636 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": null, "description": "everybody in the industry understands what the whole country is going through in terms of the visibility toward next year, in terms of supply-chain issues that we are still dealing with because of Covid,\" Paramount Global's head of US ad sales Jo Ann Ross tol…", "url": "https://view.newsletters.cnn.com/messages/16529289334047284e3a42e5f/raw", "urlToImage": null, "publishedAt": "2022-05-19T11:55:17Z", "content": "Brian Stelter here at 10:48pm ET on Wednesday, May 18. Here's the latest on Elon Musk, Nina Jankowicz, Recurrent Ventures, the CBC, the NYT, Taylor Swift, Dick Wolf, \"Top Gun,\" and so much more...\r\nT… [+4252 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Leah Dolan, CNN", "title": "Adriana Lima shows off baby bump on Cannes red carpet", "description": "At the Cannes film festival premiere of Joseph Kosinski's \"Top Gun: Maverick\" on Wednesday, former Victoria's Secret model Adriana Lima became the latest celebrity to turn maternity fashion on its head.", "url": "https://www.cnn.com/style/article/adriana-lima-cannes-red-carpet-pregnant-bump/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220519114701-adriana-lima-cannes-2-super-tease.jpg", "publishedAt": "2022-05-19T11:40:11Z", "content": "Now in its 75th year, the Cannes red carpet is one of the most revered fashion events on the calendar. Scroll through the gallery to see the best looks from each day of the festival. Deepika Padukone… [+162 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lianne Kolirin, CNN", "title": "British Prime Minister Boris Johnson faces no further action over 'Partygate' scandal", "description": "British Prime Minister Boris Johnson will face no further action over breaches of lockdown regulations after the Metropolitan Police concluded its investigation of the \"Partygate\" scandal, Downing Street said Thursday.", "url": "https://www.cnn.com/2022/05/19/uk/uk-boris-johnson-partygate-gbr-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220228164509-boris-johnson-0224-super-tease.jpg", "publishedAt": "2022-05-19T11:35:40Z", "content": "London (CNN)British Prime Minister Boris Johnson will face no further action over breaches of lockdown regulations after the Metropolitan Police concluded its investigation of the \"Partygate\" scandal… [+3294 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marshall Cohen, CNN", "title": "Clinton campaign lawyer charged in Durham probe seeks mistrial", "description": "The Hillary Clinton campaign lawyer currently on trial as part of special counsel John Durham's investigation requested a mistrial in a late-night filing Wednesday, though the judge overseeing the case has already said he is skeptical of his arguments.", "url": "https://www.cnn.com/2022/05/19/politics/michael-sussmann-john-durham-mistrial-request/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220519064341-michael-sussmann-0517-super-tease.jpg", "publishedAt": "2022-05-19T11:26:10Z", "content": "(CNN)The Hillary Clinton campaign lawyer currently on trial as part of special counsel John Durham's investigation requested a mistrial in a late-night filing Wednesday, though the judge overseeing t… [+2107 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacopo Prisco, CNN", "title": "The restaurant where real Italian mothers rule the kitchen", "description": "The premise is simple: real Italian mothers and grandmothers are recruited from one of Italy's 20 regions. They then move to London for a three-month residency, showcasing their own traditional recipes based around their local cuisine.", "url": "https://www.cnn.com/travel/article/the-restaurant-where-real-italian-mothers-rule-the-kitchen/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220518093650-01-italian-mother-restaurant-top-super-tease.jpg", "publishedAt": "2022-05-19T11:24:57Z", "content": "Editor's Note Forget what you think you know about British food. This Sunday at 8 p.m. ET \"Searching for Italy,\" Stanley Tucci explores how Italian immigration has transformed the food scene in his a… [+4357 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jen Christensen, CNN", "title": "CDC's independent vaccine advisers will meet to discuss Covid-19 boosters for kids", "description": "The US Centers for Disease Control and Prevention's independent Advisory Committee on Immunization Practices (ACIP) will meet Thursday to discuss updates on Covid-19 vaccine safety and effectiveness for children ages 5-11 years, CDC guidance on boosters for t…", "url": "https://www.cnn.com/2022/05/19/health/covid-19-kid-boosters-acip-meeting/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220209163215-covid-vaccine-kids-california-0119-super-tease.jpg", "publishedAt": "2022-05-19T11:23:12Z", "content": "(CNN)The US Centers for Disease Control and Prevention's independent Advisory Committee on Immunization Practices (ACIP) will meet Thursday to discuss updates on Covid-19 vaccine safety and effective… [+2633 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Frankie de la Cretaz", "title": "Opinion: Sports Illustrated's swimsuit issue is a step back in time. And not in a good way", "description": "Sports Illustrated rolled out its annual swimsuit iIssue with messaging this year highlighting body diversity and using buzzwords like \"inclusive.\" While  including a variety of body types and gender orientations could be seen as a step forward, the esthetics…", "url": "https://www.cnn.com/2022/05/19/opinions/women-basketball-wnba-sports-illustrated-swimsuit-cretaz/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220519070041-si-swimsuit-wnba-cover.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-19T11:04:43Z", "content": "Editors Note: Editors note: Frankie de la Cretaz is an independent journalist whose writing sits at the intersection of sports and gender. They are the co-author of Hail Mary: The Rise and Fall of th… [+7851 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Dr. Kee B. Park", "title": "Opinion: Why North Korea's Covid-19 outbreak could shock the world", "description": "Without immediate help, North Korea's Covid-19 death toll could be unprecedented, warns Dr. Kee B. Park, who has worked alongside surgeons in Pyongyang and witnessed firsthand the resourcefulness of staff in stretched hospitals.", "url": "https://www.cnn.com/2022/05/19/opinions/north-korea-covid-19-outbreak-deaths-park/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220519051325-north-korea-covid-0516-super-tease.jpg", "publishedAt": "2022-05-19T10:56:39Z", "content": "Dr. Kee B. Park (@keepark) is director of the Korea Health Policy Project at Harvard Medical School. He has worked alongside North Korean doctors during more than 20 visits to North Korea and is a me… [+6024 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacqueline Howard", "title": "Ukrainians seeking shelter in US must have TB screenings and certain vaccinations", "description": "The United States is preparing to welcome more displaced Ukrainians now that the Biden administration has approved the first group to enter through the new Uniting for Ukraine program. Ukrainians began arriving through the program this month.", "url": "https://www.cnn.com/2022/05/19/health/ukraine-vaccines-tuberculosis-screening/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220315152836-ukraine-vaccinations-file-110921.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-19T10:48:32Z", "content": "The United States is preparing to welcome more displaced Ukrainians now that the Biden administration has approved the first group to enter through the new Uniting for Ukraine program. Ukrainians beg… [+4467 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alexandra Meeks, CNN", "title": "5 things to know for May 19: Ukraine, Buffalo shooting, Stocks, Baby formula, Soccer", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2022/05/19/us/five-things-may-19-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220518140700-01-us-embassy-kyiv-reopen-0518-super-tease.jpg", "publishedAt": "2022-05-19T10:27:15Z", "content": "(CNN)Many Americans say life has at least partially returned to a pre-pandemic normal, but experts warn that when it comes to Covid-19, the US is not out of the woods yet. A third of people in the US… [+6867 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lauren Fox and Daniella Diaz, CNN", "title": "Democrats intensify efforts to stop implementation of draft New York congressional map that pits incumbents against each other", "description": "The Democratic Congressional Campaign Committee is intensifying efforts to stop the implementation of a draft congressional map that would pit several Democratic incumbents against one another in the midterms and has exacerbated sensitive divisions in the cau…", "url": "https://www.cnn.com/2022/05/19/politics/new-york-democrats-congressional-map/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220105214540-sean-patrick-maloney-file-11162021-restricted-super-tease.jpg", "publishedAt": "2022-05-19T10:25:27Z", "content": "The thinly veiled racism here is profoundly disappointing. \r\nA black man is ideologically ill suited to represent a Westchester County District that he represents presently and won decisively in 2020… [+86 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Reuters", "title": "Melvin Capital to shut after heavy losses on meme stocks, market slump", "description": "Melvin Capital, once one of Wall Street's most successful hedge funds which then lost billions in the meme stock saga, will shut down after it was hit again by this year's market slump.", "url": "https://www.cnn.com/2022/05/19/investing/melvin-capital-hedge-fund-closes/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220519060239-01-gamestop-store-nyc-file-03232021-super-tease.jpg", "publishedAt": "2022-05-19T10:09:36Z", "content": "Melvin Capital, once one of Wall Street's most successful hedge funds which then lost billions in the meme stock saga, will shut down after it was hit again by this year's market slump.\r\nGabe Plotkin… [+2770 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ali Zaslav, Clare Foran and Ellie Kaufman, CNN", "title": "Senate to vote on $40 billion Ukraine aid package", "description": "The Senate is expected to vote on Thursday to pass a roughly $40 billion bill to send aid to Ukraine as the country fights back against Russia's brutal and unprovoked attacks.", "url": "https://www.cnn.com/2022/05/19/politics/senate-vote-ukraine-aid-package/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220515001217-01-zelensky-us-senate-super-tease.jpg", "publishedAt": "2022-05-19T09:01:36Z", "content": "(CNN)The Senate is expected to vote on Thursday to pass a roughly $40 billion bill to send aid to Ukraine as the country fights back against Russia's brutal and unprovoked attacks. \r\nThe measure pass… [+5591 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "David G. Allan, CNN", "title": "How to become more grateful, and why that will make you happier, healthier and more resilient", "description": "There are easy ways to increase our levels of daily gratitude, and good mental and physical health reasons to do so.", "url": "https://www.cnn.com/2022/05/19/health/gratitude-wisdom-project-chasing-life-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/161122165314-wisdom-project-half-full-super-tease.jpg", "publishedAt": "2022-05-19T08:43:28Z", "content": "David G. Allan is the editorial director for CNN Travel, Style, Science and Wellness. This essay is part of a column called The Wisdom Project, to which you can subscribe here. \r\n (CNN)If you really … [+9177 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Aya Elamroussi, CNN", "title": "Some Buffalo shooting survivors hid in a milk cooler, waiting for the horror to stop. The suspect is set to appear in court today", "description": "When Jerome Bridges heard gunshots ring out in a Buffalo, New York, supermarket Saturday, he ran to lead some of his coworkers and customers to safety in the store's break room and barricaded them inside with a heavy desk.", "url": "https://www.cnn.com/2022/05/19/us/buffalo-supermarket-shooting-thursday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220519002612-01-buffalo-supermarket-shooting-thursday-super-tease.jpg", "publishedAt": "2022-05-19T06:54:54Z", "content": "(CNN)When Jerome Bridges heard gunshots ring out in a Buffalo, New York, supermarket Saturday, he ran to lead some of his coworkers and customers to safety in the store's break room and barricaded th… [+6096 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Akanksha Singh and Roshan Abbas", "title": "Opinion: In the world's largest democracy, 'looking Muslim' could cost your life", "description": "When documentary photographer Roshan Abbas leaves his house for work in the morning, he thinks carefully about whether to wear clothes that might reveal he is Muslim. In India, roughly 200 million Muslims -- just over 14% of the population -- are defending th…", "url": "https://www.cnn.com/2022/05/19/opinions/indian-muslims-violence-hindu-nationalism-singh-abbas/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220512140036-01-india-muslim-clashes-041522-super-tease.jpg", "publishedAt": "2022-05-19T06:39:36Z", "content": "Akanksha Singh is a Mumbai-based journalist covering politics and social justice and has written for the BBC, The Independent and South China Morning Post, among others.Roshan Abbas is a Delhi-based … [+7130 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Susan Harris Rimmer", "title": "Opinion: How Australia's 'mate-ocracy' created a toxic Parliament", "description": "Australians will go to the polls Saturday in the shadow of sexual harassment scandals that have rocked Parliament, barely any visibility of female leaders from either major party, and seemingly not much concern to woo the female vote, writes Susan Harris Rimm…", "url": "https://www.cnn.com/2022/05/19/opinions/australia-election-women-sexual-harassment-rimmer/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220518110454-03-australian-election.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-19T06:38:12Z", "content": "Editors Note: Susan Harris Rimmer is the Director of the Griffith University Policy Innovation Hub and a human rights lawyer in Brisbane, Australia. She is a co-convenor of the Griffith Gender Equali… [+8180 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Reuters", "title": "Teenage pilot lands in Kenya amid record-setting flight attempt", "description": "16-year-old Mack Rutherford, the world's youngest licensed pilot, is trying to become the youngest person to fly solo around the world.", "url": "https://www.cnn.com/travel/article/mack-rutherford-youngest-pilot/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220519003810-mack-rutherford-kenya-0518-super-tease.jpg", "publishedAt": "2022-05-19T05:33:02Z", "content": "ReutersPublished 19th May 2022\r\nA 16-year-old schoolboy who is on a quest to become the youngest person to fly around the world solo, landed his small plane in Kenya's capital, Nairobi, on Wednesday.… [+1619 chars]"}]}