{"status": "ok", "totalResults": 76, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Stephen Collinson, CNN", "title": "Pennsylvania primaries encapsulate America's choice in the 2022 midterms", "description": "Before the stroke that knocked him off the campaign trail, Senate candidate John Fetterman tossed out a question that defines the Democratic Party's 2022 zeitgeist to a crowd packed, pre-pandemic style, into a rowdy bar.", "url": "https://www.cnn.com/2022/05/17/politics/pennsylvania-primaries-2022-midterms/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220516194150-voting-walkup-pa-051622-super-tease.jpg", "publishedAt": "2022-05-17T04:00:39Z", "content": "York, Pennsylvania (CNN)Before the stroke that knocked him off the campaign trail, Senate candidate John Fetterman tossed out a question that defines the Democratic Party's 2022 zeitgeist to a crowd … [+10173 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/rhea-mogul\">Rhea Mogul</a>, CNN", "title": "Russia's war in Ukraine", "description": "Ukrainian forces have completed their \"combat mission\" in Mariupol, according to the country's military. It comes after hundreds of people were evacuated from a steel plant that was the last holdout in the city. Follow here for live news updates.", "url": "https://www.cnn.com/europe/live-news/russia-ukraine-war-news-05-17-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220516132417-03-ukraine-security-service-hunt-russia-spies-super-tease.jpg", "publishedAt": "2022-05-17T04:00:24Z", "content": "A Ukrainian military base about 15 kilometers (9 miles) from the border with Poland was targeted in a Russian missile attack early Tuesday morning, according to information from Maksym Kozytsky, the … [+1115 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oren Liebermann, CNN", "title": "US Air Force tests troubled hypersonic missile", "description": "The US Air Force carried out a successful test of its troubled hypersonic missile over the weekend, one month after announcing the program had suffered delays because of \"recent flight test anomalies.\"", "url": "https://www.cnn.com/2022/05/16/politics/us-air-force-hypersonic-missile-test/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220404222451-b52-takeoff-08082020-super-tease.jpg", "publishedAt": "2022-05-17T03:25:48Z", "content": "Washington (CNN)The US Air Force carried out a successful test of its troubled hypersonic missile over the weekend, one month after announcing the program had suffered delays because of \"recent fligh… [+3235 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Priscilla Alvarez, CNN", "title": "DHS chief Mayorkas says it's 'virtually impossible' to monitor all hate online", "description": "Homeland Security Secretary Alejandro Mayorkas told CNN on Monday his department is working closely with local authorities in the wake of a deadly mass shooting at a supermarket in Buffalo, New York, over the weekend, but noted DHS is not in a position of mon…", "url": "https://www.cnn.com/2022/05/16/politics/mayorkas-dhs-buffalo-shooting-title-42/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220516171137-alejandro-mayorkas-file-050422-super-tease.jpg", "publishedAt": "2022-05-17T03:03:48Z", "content": "(CNN)Homeland Security Secretary Alejandro Mayorkas told CNN on Monday his department is working closely with local authorities in the wake of a deadly mass shooting at a supermarket in Buffalo, New … [+4046 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Sri Lanka down to last day of petrol, Prime Minister tells crisis-hit nation", "description": "Sri Lanka's new prime minister said on Monday the crisis-hit nation was down to its last day of petrol, as the country's power minister told citizens not to join the lengthy fuel queues that have galvanized weeks of anti-government protests.", "url": "https://www.cnn.com/2022/05/16/asia/sri-lanka-fuel-economic-crisis-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220516190832-sri-lanka-protest-0516-super-tease.jpg", "publishedAt": "2022-05-17T02:55:25Z", "content": "Colombo, Sri LankaSri Lanka's new prime minister said on Monday the crisis-hit nation was down to its last day of petrol, as the country's power minister told citizens not to join the lengthy fuel qu… [+3657 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Melissa Holzberg DePalo", "title": "Proposed New York congressional map could pit longtime Democratic members against each other", "description": "A proposed version of New York's new congressional map could set up several incumbent vs. incumbent primaries, potentially pitting veteran Democratic lawmakers against each other, and dampen Democratic hopes of picking up more seats in the Empire State in thi…", "url": "https://www.cnn.com/2022/05/16/politics/new-york-congressional-map-democratic-incumbents/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220516214931-new-york-congressional-map-democratic-incumbents-split-super-tease.jpg", "publishedAt": "2022-05-17T02:28:29Z", "content": "(CNN)A proposed version of New York's new congressional map could set up several incumbent vs. incumbent primaries, potentially pitting veteran Democratic lawmakers against each other, and dampen Dem… [+3310 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alaa Elassar, CNN\nPhotographs by Lauren Petracca for CNN", "title": "'We didn't have much, and you took what was left'", "description": "The beloved Tops is the only supermarket in a one-mile radius within this largely Black neighborhood and one that took more than a decade to get. It has now been scarred by a deadly rampage whose remnants are evident in the stretches of police tape that now g…", "url": "https://www.cnn.com/2022/05/16/us/buffalo-tops-supermarket-community-stories/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220516172638-01-buffalo-community-super-tease.jpg", "publishedAt": "2022-05-17T00:35:05Z", "content": "By Alaa Elassar, CNNPhotographs by Lauren Petracca for CNN\r\nUpdated 8:35 PM ET, Mon May 16, 2022\r\nBUFFALO, New York -- Phylicia Dove fails to fight back tears as she talks about the massacre that sha… [+9478 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brad Lendon, Blake Essig, Emiko Jozuka", "title": "US Navy's first woman aircraft carrier commander: Leadership is hard", "description": "Amy Bauernschmidt is the only woman ever to command a US aircraft carrier, the largest and among the most powerful warships afloat.", "url": "https://www.cnn.com/2022/05/16/asia/us-navy-woman-aircraft-carrier-commander-intl-hnk-ml/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220511035155-02-us-navy-woman-aircraft-carrier-commander.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-17T00:22:59Z", "content": "Amy Bauernschmidt is the rarest of the rare.\r\nThe 51-year-old is in a select group of United States Navy officers: The commanders of the 11 aircraft carriers in the US fleet.\r\nCapt. Bauernschmidt is … [+6664 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amir Vera and Jamiel Lynch, CNN", "title": "Remains of 17-year-old girl who went missing in 2009 found in South Carolina, sheriff says", "description": "Brittanee Drexel was reported missing on April 25, 2009.", "url": "https://www.cnn.com/2022/05/16/us/brittanee-drexel-case-remains-found/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220516160230-brittanee-drexel-file-super-tease.jpg", "publishedAt": "2022-05-17T00:06:19Z", "content": "(CNN)The remains of a 17-year-old girl have been found in Georgetown County, South Carolina -- 13 years after she went missing while visiting Myrtle Beach -- and a suspect in her death is in custody,… [+993 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Michael Nedelman and Forrest Brown, CNN", "title": "CDC to all domestic travelers: Test close as possible to departure time", "description": "The US Centers for Disease Control and Prevention now urges all domestic travelers to \"consider getting tested as close to the time of departure as possible (no more than three days) before your trip.\"", "url": "https://www.cnn.com/travel/article/cdc-updated-guidance-domestic-travel-testing/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220516144106-covid-test-file-super-tease.jpg", "publishedAt": "2022-05-16T23:30:04Z", "content": "The agency now urges all domestic travelers to \"consider getting tested as close to the time of departure as possible (no more than three days) before your trip,\" according to its Covid-19 website up… [+1985 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Hansler, CNN", "title": "Biden reverses Trump policies related to Cuba", "description": "The State Department on Monday announced a series of measures it said is aimed at supporting the Cuban people, including reinstating the Cuban Family Reunification Parole Program and increasing consular services and visa processing.", "url": "https://www.cnn.com/2022/05/16/politics/cuba-joe-biden/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220515214305-biden-0515-super-tease.jpg", "publishedAt": "2022-05-16T22:34:43Z", "content": "(CNN)The State Department on Monday announced a series of measures it said is aimed at supporting the Cuban people, including reinstating the Cuban Family Reunification Parole Program and increasing … [+1140 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Mick Krever", "title": "Ukraine's security service hunts the spies selling information to Russia", "description": "On a dusty street in the eastern Ukrainian town of Sloviansk, a man in a long-sleeved black shirt and cargo pants smokes a cigarette. He's being watched.", "url": "https://www.cnn.com/2022/05/16/europe/ukraine-sbu-russian-spies-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220516115238-01-ukraine-security-service-hunt-russia-spies.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-16T22:33:08Z", "content": "On a dusty street in the eastern Ukrainian town of Sloviansk, a man in a long-sleeved black shirt and cargo pants smokes a cigarette. Hes being watched.\r\nHes ours, a man says into a radio from his ca… [+4153 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Clare Duffy and Donie O'Sullivan, CNN Business", "title": "Social media platforms vowed to rein in extremism. Buffalo puts them to the test", "description": "In the wake of Saturday's mass shooting in Buffalo, New York, Big Tech platforms scrambled to stop the spread of a video of the attack filmed by the suspect and a document allegedly also produced by him where he outlines his beliefs.", "url": "https://www.cnn.com/2022/05/16/tech/buffalo-shooting-social-media-response/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220516144426-buffalo-shooting-scene-0516-super-tease.jpg", "publishedAt": "2022-05-16T22:33:02Z", "content": "New York (CNN Business)In the wake of Saturday's mass shooting in Buffalo, New York, Big Tech platforms scrambled to stop the spread of a video of the attack filmed by the suspect and a document alle… [+6594 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Michael Warren", "title": "Major outside spending boosts Trump-backed Budd in North Carolina Senate primary", "description": "Nearly a year after former President Donald Trump endorsed Rep. Ted Budd for North Carolina's open Senate race, the conservative congressman appears in strong position heading into Tuesday's Republican primary.", "url": "https://www.cnn.com/2022/05/16/politics/nc-republican-senate-primary-election/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220513151833-ted-budd-north-carolina-super-tease.jpg", "publishedAt": "2022-05-16T22:32:04Z", "content": "(CNN)Nearly a year after former President Donald Trump endorsed Rep. Ted Budd for North Carolina's open Senate race, the conservative congressman appears in strong position heading into Tuesday's Rep… [+3988 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Forrest Brown and Marnie Hunter, CNN", "title": "CDC: Africa tourism favorite now at 'high' risk for Covid-19", "description": "The CDC placed the popular African destination, along with three other spots, in the \"high\" Covid-19 risk category for travelers on Monday.", "url": "https://www.cnn.com/travel/article/cdc-covid-travel-risk-destinations-may-16/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220516164802-01-cdc-advisory-south-africa-super-tease.jpg", "publishedAt": "2022-05-16T22:16:50Z", "content": "(CNN) The US Centers for Disease Control and Prevention has placed a popular African destination in its \"high\" Covid-19 risk category for travelers.\r\nSouth Africa -- renowned for its stunning vistas,… [+5215 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chloe Melas", "title": "'Rust' producer 'confident' film will get finished", "description": "Months after cinematographer Halyna Hutchins was fatally shot on the set of the film \"Rust,\" the co-producer of the project says he is \"confident\" the movie will resume filming and be completed.", "url": "https://www.cnn.com/2022/05/16/entertainment/rust-film-will-be-completed/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/211026182135-halyna-hutchins-rust-set-last-photo.jpg?q=x_3,y_2,h_898,w_1596,c_crop/w_800", "publishedAt": "2022-05-16T22:14:39Z", "content": "Months after cinematographer Halyna Hutchins was fatally shot on the set of the film Rust, the co-producer of the project says he is confident the movie will resume filming and be completed. \r\nIn an … [+2005 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Gregory Krieg, CNN", "title": "Oregon's Kurt Schrader, facing backlash over breaking with House Democrats, faces primary challenge in redrawn district", "description": "A contentious House primary in Oregon is dividing national and local Democrats as Rep. Kurt Schrader, running now in a district where more than half of primary voters are seeing his name on the ballot for the first time, faces a challenge on Tuesday from prog…", "url": "https://www.cnn.com/2022/05/16/politics/kurt-schrader-oregon-democrat-primary-election/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220516154439-jamie-mcleod-skinner-kurt-schrader-super-tease.jpg", "publishedAt": "2022-05-16T21:52:30Z", "content": "(CNN)A contentious House primary in Oregon is dividing national and local Democrats as Rep. Kurt Schrader, running now in a district where more than half of primary voters are seeing his name on the … [+5216 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rishi Iyengar", "title": "With deal in doubt, Elon Musk and Twitter CEO Parag Agrawal debate bots on Twitter", "description": "Twitter CEO Parag Agrawal and Elon Musk are engaged in a debate over an issue Musk has made central to his proposed purchase of the platform — spam.", "url": "https://www.cnn.com/2022/05/16/tech/elon-musk-twitter-spam-bots-parag/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220516145705-restricted-parag-agrawal-elon-musk-split.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-16T21:32:24Z", "content": "San FranciscoCNN Business\r\n  — \r\nTwitter CEO Parag Agrawal and Elon Musk are engaged in a debate over an issue Musk has made central to his proposed purchase of the platform spam. \r\nIn a series of tw… [+3208 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sean Lyngaas, CNN", "title": "US prosecutors accuse Venezuelan doctor of being ransomware mastermind", "description": "US prosecutors have accused a 55-year-old Venezuelan doctor of creating and selling widely used malicious software that cybercriminals used in extortion attempts on multiple organizations.", "url": "https://www.cnn.com/2022/05/16/politics/us-ransomware-venezulean-doctor/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190219200658-computer-hacking-stock-super-tease.jpg", "publishedAt": "2022-05-16T21:28:48Z", "content": "Washington (CNN)US prosecutors have accused a 55-year-old Venezuelan doctor of creating and selling widely used malicious software that cybercriminals used in extortion attempts on multiple organizat… [+1481 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Daniel Dale, CNN", "title": "Fact check: Deceptive anti-Barnette ad misleads about her positions on Black Lives Matter and police defunding", "description": "A deceptive new attack ad in Pennsylvania's Republican Senate primary tries to convince voters that late-surging candidate Kathy Barnette, who has vehemently opposed the Black Lives Matter movement and defunding the police, is a supporter of both.", "url": "https://www.cnn.com/2022/05/16/politics/fact-check-barnette-blm-defund-the-police-mccormick/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220512183822-kathy-barnette-0512-super-tease.jpg", "publishedAt": "2022-05-16T21:19:00Z", "content": "Washington (CNN)A deceptive new attack ad in Pennsylvania's Republican Senate primary tries to convince voters that late-surging candidate Kathy Barnette, who has vehemently opposed the Black Lives M… [+3835 chars]"}]}