{"status": "ok", "totalResults": 152, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Chris Cillizza, CNN Editor-at-large", "title": "This Ted Cruz exchange on guns is deeply revealing", "description": "Following a vigil for the 19 children and two teachers who died in a mass shooting in Uvalde, Texas, Mark Stone, a US correspondent for the British outlet Sky News, asked Ted Cruz a simple question: \"Is this the moment to reform gun laws?\"", "url": "https://www.cnn.com/2022/05/26/politics/ted-cruz-gun-laws-exchange/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220525092317-ted-cruz-uvalde-texas-shooting-remarks-super-tease.jpg", "publishedAt": "2022-05-26T22:32:33Z", "content": "(CNN)Following a vigil for the 19 children and two teachers who died in a mass shooting in Uvalde, Texas, Mark Stone, a US correspondent for the British outlet Sky News, asked Ted Cruz a simple quest… [+3028 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Natasha Bertrand, Jim Sciutto and Alex Marquardt, CNN", "title": "US preparing to approve advanced long-range rocket system for Ukraine", "description": "The Biden administration is preparing to step up the kind of weaponry it is offering Ukraine by sending advanced, long-range rocket systems that are now the top request from Ukrainian officials, multiple officials say.", "url": "https://www.cnn.com/2022/05/26/politics/us-long-range-rockets-ukraine-mlrs/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220526165224-multiple-launch-rocket-system-file-030420-super-tease.jpg", "publishedAt": "2022-05-26T21:26:32Z", "content": "Washington (CNN)The Biden administration is preparing to step up the kind of weaponry it is offering Ukraine by sending advanced, long-range rocket systems that are now the top request from Ukrainian… [+6520 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Radhika Marya", "title": "Depeche Mode's Andy Fletcher dies at 60", "description": "\"We are shocked and filled with overwhelming sadness with the untimely passing of our dear friend, family member, and bandmate Andy 'Fletch' Fletcher,\" Depeche Mode said on social media Thursday.", "url": "https://www.cnn.com/2022/05/26/entertainment/andy-fletcher-depeche-mode-death-cec/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220526161303-andy-fletcher-file-061117.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-26T21:19:03Z", "content": "Andy Fletcher, a keyboardist and founding member of Depeche Mode, has died, the band announced on their official social media channels. He was 60 years old.\r\nWe are shocked and filled with overwhelmi… [+1585 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Faith Karimi", "title": "She once wrote an essay on how to murder your husband. This week a jury found her guilty of murdering her husband", "description": "Unlike the antagonists in her romance thrillers, author Nancy Crampton-Brophy did not get away with murder. A jury in Oregon convicted her in the 2018 slaying of her longtime husband.", "url": "https://www.cnn.com/2022/05/26/us/nancy-crampton-brophy-guilty-murder-cec/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220405142614-01-nancy-crampton-brophy-romance-novelist-trial.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-26T20:47:15Z", "content": "Unlike the antagonists in her steamy romance thrillers, author Nancy Crampton-Brophy did not get away with murder.\r\nA jury found her guilty Wednesday of second-degree murder in the 2018 death of her … [+6085 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Parija Kavilanz", "title": "Instacart: Baby formula searches surging as store shelves remain empty", "description": "", "url": "https://www.cnn.com/2022/05/26/business/baby-formula-instacart/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220526135047-01-baby-formula-stock.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-26T20:36:17Z", "content": "Instacart said searches for baby formula hit a record high in mid-May but the on-demand grocery delivery site is struggling to fulfill orders because its stores remain severely understocked amid the … [+2841 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brian Lowry, CNN", "title": "Ellen DeGeneres says goodbye to show that 'forever changed my life'", "description": "Ellen DeGeneres bid a tearful farewell to her daytime talk show on Thursday, saying that the show had \"forever changed my life.\"", "url": "https://www.cnn.com/2022/05/26/entertainment/ellen-degeneres-final-show/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210513121011-ellen-degeneres-emotional-talk-show-ending-super-tease.jpg", "publishedAt": "2022-05-26T20:26:13Z", "content": "(CNN)Ellen DeGeneres bid a tearful farewell to her daytime talk show on Thursday, saying that the show had \"forever changed my life.\"\r\nDeGeneres opened the last hour of \"The Ellen DeGeneres Show\" by … [+2012 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katie Bo Lillis, Kylie Atwood and Natasha Bertrand, CNN", "title": "Russia is depopulating parts of eastern Ukraine, forcibly removing thousands into remote parts of Russia", "description": "Hundreds of thousands of Ukrainians have been processed through a series of Russian \"filtration camps\" in Eastern Ukraine and sent into Russia as part of a systemized program of forced removal, according to four sources familiar with the latest Western intell…", "url": "https://www.cnn.com/2022/05/26/politics/ukraine-filtration-camps-forcibly-remove-russia/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220525202757-02-bezimenne-file-050122-super-tease.jpg", "publishedAt": "2022-05-26T20:00:04Z", "content": "Washington (CNN)Hundreds of thousands of Ukrainians have been processed through a series of Russian \"filtration camps\" in Eastern Ukraine and sent into Russia as part of a systemized program of force… [+7146 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lisa Respers France", "title": "Bobby Brown wants you to get to know who he is now", "description": "Bobby Brown knows there are a ton of memes that poke fun at his relationship with his former wife Whitney Houston, but he's not interested in seeing them.", "url": "https://www.cnn.com/2022/05/26/entertainment/bobby-brown-reality-show-doc/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220525163237-01-bobby-brown.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-26T19:03:36Z", "content": "Bobby Brown knows there are a ton of memes that poke fun at his relationship with his former wife Whitney Houston, but hes not interested in seeing them.\r\nI really dont look at all of the memes, he t… [+2255 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "In pictures: Ray Liotta's life on the screen", "description": "Ray Liotta, the actor known for his roles in \"Field of Dreams\" and the Martin Scorsese mob classic \"Goodfellas,\" died at the age of 67, it was reported on Thursday, May 25.", "url": "https://www.cnn.com/2022/05/26/entertainment/gallery/ray-liotta-notable-roles/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220526134924-01-ray-liotta-notable-roles-restricted-super-tease.jpg", "publishedAt": "2022-05-26T18:59:37Z", "content": "Ray Liotta appears in one his most memorable roles as real-life mobster Henry Hill in the 1990 film \"Goodfellas.\" \r\nUpdated 2:59 PM ET, Thu May 26, 2022\r\nRay Liotta appears in one his most memorable … [+568 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Cheri Mossburg", "title": "Musicians cancel performances at upcoming NRA convention in wake of Uvalde shooting", "description": "At least three musicians who were set to sing in a concert at this weekend's annual convention of the National Rifle Association have canceled their performances in the wake of the tragic school shooting in Uvalde, Texas.", "url": "https://www.cnn.com/2022/05/26/entertainment/don-mclean-nra-performance-canceled/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220526144600-don-mclean-0512.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-26T18:48:46Z", "content": "At least three musicians who were set to sing in a concert at this weekends annual convention of the National Rifle Association have canceled their performances in the wake of the tragic school shoot… [+2000 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Angela Fritz and Rachel Ramirez, CNN", "title": "Lake Mead water level running well below predictions, could drop another 12 feet by fall", "description": "Federal officials have a sobering forecast for the Colorado River Basin: Lake Mead, the nation's largest reservoir which serves millions of people in the Southwest, will likely drop another 12 feet by this fall.", "url": "https://www.cnn.com/2022/05/26/us/lake-mead-water-level-low-projection-climate/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220526140908-lake-mead-water-level-low-projection-climate-0522-restricted-super-tease.jpg", "publishedAt": "2022-05-26T18:44:36Z", "content": "This state's two largest reservoirs are already at 'critically low levels' and the dry season is just starting\r\nCalifornia is in a water crisis, yet usage is way up. Officials are focused on the wron… [+329 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Kent Sepkowitz", "title": "Opinion: We're in the 'Keep Calm and Carry On' phase of the pandemic", "description": "Easing the intensity of Covid-19 precautions carries with it the false suggestion that it is 2019 all over again. \"How then to proceed from the less terrifying present into the still extremely uncertain months ahead? I suggest we listen to British history and…", "url": "https://www.cnn.com/2022/05/26/opinions/covid-keep-calm-and-carry-on-sepkowitz/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220420080519-face-mask-train-california-file-super-tease.jpg", "publishedAt": "2022-05-26T18:36:25Z", "content": "Kent Sepkowitz is a physician and infectious disease expert at Memorial Sloan Kettering Cancer Center in New York. The views expressed in this commentary are his own. View more opinion on CNN.\r\n (CNN… [+5511 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Lakshman Achuthan and Anirvan Banerji for CNN Business Perspectives", "title": "Opinion: It's time to prepare for a recession", "description": "There is a toxic brew of external economic headwinds, including the war in Ukraine and Covid lockdowns in China, resulting in supply shocks that boost inflation and slow growth.", "url": "https://www.cnn.com/2022/05/26/perspectives/recession-gdp-fed-inflation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220526132648-01-us-recession-risk-super-tease.jpg", "publishedAt": "2022-05-26T18:30:09Z", "content": "Lakshman Achuthan and Anirvan Banerji are co-founders of the Economic Cycle Research Institute (ECRI). The opinions expressed in this commentary are their own. \r\nThe economy is close to entering a re… [+3636 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sean Lyngaas", "title": "Ransomware attack hits New Jersey county", "description": "A ransomware attack has forced officials in a 345,000-person New Jersey county to switch off their computers and set up temporary Gmail accounts so the public can email key agencies such as the health, emergency and sheriff's departments.", "url": "https://www.cnn.com/2022/05/26/politics/new-jersey-somerset-county-ransomware-attack/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220526125036-ransomware-file.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-26T18:29:49Z", "content": "A ransomware attack has forced officials in a 345,000-person New Jersey county to switch off their computers and set up temporary Gmail accounts so the public can email key agencies such as the healt… [+2345 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Judson Jones, CNN Meteorologist", "title": "Snow, severe storms and triple-digit heat all in holiday weekend forecast", "description": "Many see Memorial Day weekend as the \"unofficial\" start of summer. But, if you are planning outdoor events, you may want to read this first.", "url": "https://www.cnn.com/2022/05/26/weather/memorial-day-weekend-holiday-forecast/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220526113447-hp-cuts-only-weather-memorial-day-forecast-super-tease.jpg", "publishedAt": "2022-05-26T18:03:21Z", "content": "We could see multiple rounds of severe weather through the #MemorialDayWeekend, with storms mainly during the evening &amp; overnight hours. \r\nIf you have outdoor plans or will be camping, be sure to… [+137 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lauren Fox, Morgan Rimmer, Ted Barrett and Clare Foran, CNN", "title": "Exclusive: McConnell says he has directed Cornyn to engage with Democrats on a 'bipartisan solution' on gun violence", "description": "Senate Minority Leader Mitch McConnell told CNN on Thursday he met earlier in the day with Texas Sen. John Cornyn and encouraged the senior Republican senator to begin discussions with Democrats, including Sens. Chris Murphy of Connecticut and Kyrsten Sinema …", "url": "https://www.cnn.com/2022/05/26/politics/mcconnell-cornyn-democrats-bipartisan-effort-gun-violence/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220504064925-mitch-mcconnell-0503-super-tease.jpg", "publishedAt": "2022-05-26T17:40:30Z", "content": "(CNN)Senate Minority Leader Mitch McConnell told CNN on Thursday he met earlier in the day with Texas Sen. John Cornyn and encouraged the senior Republican senator to begin discussions with Democrats… [+2517 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Peter Nickeas", "title": "Uvalde school district had detailed security plan in place at time of elementary school massacre", "description": "The Uvalde school district where 19 children and two teachers were killed by a gunman this week had a safety plan that included its own police force, social media monitoring and a threat reporting system to \"provide a safe and secure environment\" for students.", "url": "https://www.cnn.com/2022/05/26/us/robb-elementary-security-texas-shooting/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220525173629-robb-elementary-school-memorial-220525.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-26T17:29:36Z", "content": "The Uvalde school district where 19 children and two teachers were killed by a gunman this week had a safety plan that included its own police force, social media monitoring and a threat reporting sy… [+3080 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Peniel Joseph", "title": "Opinion: A movie star, NBA coach and Texan politician are all asking the same question", "description": "When children can be mercilessly slaughtered in school and the majority's political will to take constructive action is stymied by a small group of politicians, donors and special interests, we cannot expect our democracy to survive, writes Peniel Joseph.", "url": "https://www.cnn.com/2022/05/26/opinions/uvalde-mass-shooting-kerr-mcconaughey-orourke-joseph/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220525225903-05-uvalde-vigil-052522.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-26T17:20:35Z", "content": "Editors Note: Peniel E. Joseph is the Barbara Jordan Chair in ethics and political values and the founding director of the Center for the Study of Race and Democracy at the LBJ School of Public Affai… [+8015 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tierney Sneed", "title": "Trump judges, citing militias, have ruled against gun purchase limits for older teens", "description": "A spate of high-profile massacres where the shooters were in their late teens comes as the federal judiciary has shown increased hostility to gun control measures aimed at people under 21 years old.", "url": "https://www.cnn.com/2022/05/26/politics/shootings-18-year-olds-court-rulings/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220526092502-robb-elementary-5-things-super-tease.jpg", "publishedAt": "2022-05-26T17:17:39Z", "content": "(CNN)A spate of high-profile massacres where the shooters were in their late teens comes as the federal judiciary -- yanked to the right by former President Donald Trump -- has shown increased hostil… [+8960 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Lisa Respers France, CNN", "title": "Ray Liotta, 'Goodfellas' star, has died at age 67", "description": "Ray Liotta, the actor known for his roles in \"Field of Dreams\" and the Martin Scorsese mob classic \"Goodfellas,\" has died.", "url": "https://www.cnn.com/2022/05/26/entertainment/ray-liotta-dead/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220526122401-02-ray-liotta-file-2021-restricted-super-tease.jpg", "publishedAt": "2022-05-26T17:10:33Z", "content": "(CNN)Ray Liotta, the actor known for his roles in \"Field of Dreams\" and the Martin Scorsese mob classic \"Goodfellas,\" has died.\r\n\"Ray was working on a project in the Dominican republic called 'Danger… [+189 chars]"}]}