{"status": "ok", "totalResults": 108, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Daniel Dale, CNN", "title": "Fact check: Democratic commentators falsely claim Mehmet Oz isn't registered to vote in Pennsylvania", "description": "Republican candidate Mehmet Oz is being criticized on social media with a false claim that he is not registered to vote in Pennsylvania, the state he is running to represent in the US Senate.", "url": "https://www.cnn.com/2022/06/09/politics/fact-check-oz-registered-to-vote-pennsylvania/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220608072556-mehmet-oz-outside-polling-place-0517-super-tease.jpg", "publishedAt": "2022-06-09T10:13:46Z", "content": "Washington (CNN)Republican candidate Mehmet Oz is being criticized on social media with a false claim that he is not registered to vote in Pennsylvania, the state he is running to represent in the US… [+6519 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Gregory Wallace, CNN", "title": "Biden administration wants to standardize electric vehicle charging, like gas stations", "description": "Every gas station is essentially the same -- the nozzle fits every vehicle, the pump takes common credit cards and the price is posted on a big sign. The Biden administration wants to make electric vehicle charging stations a lot more like that.", "url": "https://www.cnn.com/2022/06/09/politics/electric-vehicle-charging-stations/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220608193558-02-electric-vehicle-charging-station-super-tease.jpg", "publishedAt": "2022-06-09T09:13:22Z", "content": "(CNN)Every gas station is essentially the same -- the nozzle fits every vehicle, the pump takes common credit cards and the price is posted on a big sign. The Biden administration wants to make elect… [+2343 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Zachary Cohen, Jeremy Herb, Ryan Nobles and Annie Grayer, CNN", "title": "What to watch at the House's first prime-time hearing on the January 6 insurrection", "description": "The House select committee investigating January 6 will use its first prime-time public hearing on Thursday to make the case that former President Donald Trump was at the center of a conspiracy to overturn the 2020 election and prevent the transition of power…", "url": "https://www.cnn.com/2022/06/09/politics/january-6-hearing-trump/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220607190526-january-6-hanging-from-balcony-super-tease.jpg", "publishedAt": "2022-06-09T09:12:01Z", "content": "(CNN)The House select committee investigating January 6 will use its first prime-time public hearing on Thursday to make the case that former President Donald Trump was at the center of a conspiracy … [+6931 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Donald Judd, CNN", "title": "Biden administration lays out its plan for Covid-19 vaccinations for children under 5", "description": "The White House is announcing a Covid-19 vaccine rollout plan Thursday for children under 5, partnering with state and local governments, health care providers, federal pharmacy partners, national and community-based organizations and other entities to ship a…", "url": "https://www.cnn.com/2022/06/09/politics/covid-19-vaccines-children-under-5-biden-plan/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220608210854-white-house-covid19-response-file-060222-super-tease.jpg", "publishedAt": "2022-06-09T09:09:34Z", "content": "(CNN)The White House is announcing a Covid-19 vaccine rollout plan Thursday for children under 5, partnering with state and local governments, health care providers, federal pharmacy partners, nation… [+3858 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Michael Bociurkiw", "title": "Opinion: My father's 1950 painting of Ukraine and a life-changing decision", "description": "Growing up in Canada, Michael Bociurkiw had fond memories of a picture sketched by his father of his native Ukraine in 1950. Now, amid Russia's invasion, the artwork has taken on new significance -- and is part of a life-changing decision to relocate closer t…", "url": "https://www.cnn.com/2022/06/09/opinions/ukraine-move-canada-ancestor-father-painting-bociurkiw/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220608085730-batkivshchyna-sketch-super-tease.jpg", "publishedAt": "2022-06-09T08:57:58Z", "content": "Michael Bociurkiw (@WorldAffairsPro) is a global affairs analyst. He is a senior fellow at the Atlantic Council and a former spokesperson for the Organization for Security and Cooperation in Europe. … [+7330 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Stephanie Mansour, CNN", "title": "Foot and ankle mobility: Exercises to do in bed or while seated", "description": "Ready to improve flexibility in your lower body and feet, but don't want to put on tennis shoes? While barefoot, do this five-exercise routine that can be done in bed or while seated from fitness expert Stephanie Mansour.", "url": "https://www.cnn.com/2022/06/09/health/foot-stretches-ankle-mobility-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220607194827-01-foot-stretches-ankle-mobility-wellness-super-tease.jpg", "publishedAt": "2022-06-09T08:32:52Z", "content": "(CNN)For many people, sore, achy feet can be bothersome after walking long distances. But for others, dealing with chronic ankle or heel pain is an everyday occurrence. \r\nTo help relieve pain or disc… [+3544 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sandee LaMotte, CNN", "title": "Do optimists live longer? Of course they do", "description": "Keeping a positive outlook may lengthen life, even into the 90s, a new study finds.", "url": "https://www.cnn.com/2022/06/09/health/living-longer-optimist-study-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220607180637-senior-woman-smiling-stock-super-tease.jpg", "publishedAt": "2022-06-09T08:26:41Z", "content": "(CNN)\"Choose to be optimistic. It feels better,\" the Dalai Lama has said.\r\nIt may also lengthen your life. Higher levels of optimism are associated with a longer lifespan and a greater chance of livi… [+3904 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jamiel Lynch and Elizabeth Wolfe, CNN", "title": "Stepfather found guilty of child abuse after a Florida restaurant employee saved a boy with a note asking if he needed help", "description": "A stepfather in Florida has been convicted of child abuse after a restaurant employee last year noticed concerning signs and used a surreptitious note to ask a boy if he needed help, the Orange County State Attorney's Office announced Monday.", "url": "https://www.cnn.com/2022/06/09/us/florida-restaurant-note-stepfather-conviction-child-abuse/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210115132128-04-orlando-abuse-note-super-tease.jpg", "publishedAt": "2022-06-09T08:23:33Z", "content": "(CNN)A stepfather in Florida has been convicted of child abuse after a restaurant employee last year noticed concerning signs and used a surreptitious note to ask a boy if he needed help, the Orange … [+3191 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Simone McCarthy, CNN", "title": "China and Cambodia break ground at naval base in show of 'iron-clad' relations", "description": "Officials from China and Cambodia broke ground on a controversial, Chinese-funded upgrade of a naval base in southern Cambodia on Wednesday, with Beijing's envoy in the country calling military cooperation part of the countries' \"iron-clad partnership.\"", "url": "https://www.cnn.com/2022/06/09/asia/china-cambodia-naval-base-military-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220608213809-01-china-cambodia-naval-base-super-tease.jpg", "publishedAt": "2022-06-09T07:13:29Z", "content": "(CNN)Officials from China and Cambodia broke ground on a controversial, Chinese-funded upgrade of a naval base in southern Cambodia on Wednesday, with Beijing's envoy in the country calling military … [+4534 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Megan C. Hills", "title": "'Chersace': Cher and Versace team up for a Pride Month collection", "description": "Singer Cher and Italian fashion house Versace have collaborated on \"Chersace\", a limited collection that features a colorful take on the brand's Medusa logo.", "url": "https://www.cnn.com/style/article/chersace-cher-versace-collection/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220609025951-07-chersace-cher-versace-collaboration-super-tease.jpg", "publishedAt": "2022-06-09T07:10:45Z", "content": "Rainbow-themed Pride Month collections have become par for the course for fashion brands, but Versace's latest collaboration is shaking things up with a surprise celebrity. Singer and Oscar-winning a… [+2033 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Kathleen Magramo, CNN", "title": "Russia's war in Ukraine", "description": "Ukrainian forces are considering pulling back to more fortified positions as the battle for the key eastern city of Severodonetsk continues. Follow here for live updates.", "url": "https://www.cnn.com/europe/live-news/russia-ukraine-war-news-06-09-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220608093719-01-ukraine-kherson-super-tease.jpg", "publishedAt": "2022-06-09T06:50:46Z", "content": "Ukrainian President Volodymyr Zelensky said the eastern city of Severodonetsk \"remains the epicenter of the confrontation in Donbas.\r\n\"This is a very fierce battle, very difficult,\" he said. \"Probabl… [+1496 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Elizabeth Wolfe and Andy Rose, CNN", "title": "3 Texas families sue over the state's investigations of gender-affirming care as potential 'child abuse'", "description": "Three Texas families have filed a lawsuit challenging the state's investigations into parents who provide their transgender children with gender-affirming healthcare procedures, according to attorneys on their behalf.", "url": "https://www.cnn.com/2022/06/09/us/texas-transgender-health-care-children-abuse-investigation-lawsuit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220608171803-transgender-protests-texas-220306-restricted-super-tease.jpg", "publishedAt": "2022-06-09T06:30:12Z", "content": "(CNN)Three Texas families have filed a lawsuit challenging the state's investigations into parents who provide their transgender children with gender-affirming healthcare procedures, according to att… [+5657 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ed Lavandera and Elizabeth Wolfe, CNN", "title": "New details emerge on how a convicted murderer managed to escape and later kill a family of 5, police say", "description": "New details have emerged revealing how convicted murderer Gonzalo Lopez escaped a prisoner bus in Texas and what he did before killing a family of five, police say.", "url": "https://www.cnn.com/2022/06/09/us/gonzalo-lopez-texas-escape-details/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220602215700-02-gonzalo-lopez-escape-authorities-manhunt-killings-super-tease.jpg", "publishedAt": "2022-06-09T05:48:17Z", "content": "(CNN)New details have emerged revealing how convicted murderer Gonzalo Lopez escaped a prisoner bus in Texas and what he did before killing a family of five, police say. \r\nLopez's escape last month t… [+4635 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rob Frehse, CNN", "title": "Federal prosecutors recommend R. Kelly be sentenced to more than 25 years in prison", "description": "Federal prosecutors in New York recommended that disgraced R&B singer R. Kelly be sentenced to more than 25 years in prison, citing his \"decades of crime\" and a \"callous disregard for the very real effects that his crimes had on his victims,\" according to a s…", "url": "https://www.cnn.com/2022/06/09/us/r-kelly-federal-prosecutors-sentencing-recommendations/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220608212533-r-kelly-file-restricted-050719-super-tease.jpg", "publishedAt": "2022-06-09T05:31:23Z", "content": "(CNN)Federal prosecutors in New York recommended that disgraced R&amp;B singer R. Kelly be sentenced to more than 25 years in prison, citing his \"decades of crime\" and a \"callous disregard for the ve… [+1967 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Iconic Italian dish highlights food crisis fueled by Ukraine war", "description": "Pasta may be a simple dish but the price of the two key ingredients, a staple for many Italian households, is skyrocketing. Journalist Barbie Nadeau visits a pasta factory and a farm growing tomato to see the hard choices facing these business owners.", "url": "https://www.cnn.com/videos/business/2022/06/09/italy-pasta-cost-food-crisis-ukraine-nadeau-pkg-nr-intl-hnk-vpx.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220609125605-screengrab-pasta-dish-super-tease.jpg", "publishedAt": "2022-06-09T05:25:37Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tara Subramaniam, Camilo Rocha and Marcia Reverdosa, CNN", "title": "Suspect held as Brazil steps up search for missing British journalist and researcher in remote Amazon", "description": "Brazilian authorities said Wednesday they have detained a suspect in the case of a missing British journalist and indigenous affairs expert -- but are yet to establish whether the man was linked to their disappearance in a remote region of the Amazon.", "url": "https://www.cnn.com/2022/06/09/americas/dom-phillips-bruno-pereira-missing-suspect-intl-latam/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220608232335-03-dom-phillips-journalist-super-tease.jpg", "publishedAt": "2022-06-09T05:14:51Z", "content": "(CNN)Brazilian authorities said Wednesday they have detained a suspect in the case of a missing British journalist and indigenous affairs expert -- but are yet to establish whether the man was linked… [+3505 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sanyo Fylyppov and Ivana Kottasová, CNN", "title": "Russian soldiers smashed up their school. Then they purportedly left messages for pupils urging peace", "description": "When Ukrainian forces regained control of Katyuzhanka, a village north of Kyiv that had been under Russian occupation for more than a month in March, they found the local school wrecked. Any equipment that hadn't been stolen was smashed, there was a makeshift…", "url": "https://www.cnn.com/2022/06/09/europe/russia-ukraine-school-blackboard-letters-intl-cmd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220603111439-08-ukraine-school-notes-from-russians-super-tease.jpg", "publishedAt": "2022-06-09T04:04:37Z", "content": "(CNN)When Ukrainian forces regained control of Katyuzhanka, a village north of Kyiv that had been under Russian occupation for more than a month in March, they found the local school wrecked. Any equ… [+7807 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Maggie Hiufu Wong, CNN", "title": "How a female Buddhist monk became one of Asia's most revered chefs", "description": "Chef Jeong Kwan was the recipient of the Asia's 50 Best Restaurants Icon Award in 2022. A Buddhist monk, she has gained fans around the world for her vegetarian \"temple cuisine\" that showcases the best of Korean produce.", "url": "https://www.cnn.com/travel/article/south-korean-monk-chef-jeong-kwan/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220606010835-04-south-korean-monk-chef-jeong-kwan-super-tease.jpg", "publishedAt": "2022-06-09T03:27:32Z", "content": "(CNN) It's a busy Saturday morning for Jeong Kwan, a South Korean Buddhist monk. \r\nAfter her early morning meditationpractice and breakfast, she tends to her garden inside Baekyangsa, a temple at the… [+8994 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Steve Almasy", "title": "Man says he spent 17 days in jail because American Airlines misidentified him as burglary suspect", "description": "An Arizona man is suing American Airlines, claiming the airline's negligence led to him spending 17 days in jail after he was misidentified to police investigating a burglary at a duty-free shop in Dallas Fort Worth International Airport in 2020, according to…", "url": "https://www.cnn.com/2022/06/08/us/american-airlines-lawsuit-man-17-days-in-jail/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220608201340-01-american-airlines-lawsuit-man-17-days-in-jail.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-06-09T02:40:50Z", "content": "An Arizona man is suing American Airlines, claiming the airlines negligence led to him spending 17 days in jail after he was misidentified to police investigating a burglary at a duty-free shop in Da… [+3689 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katherine Dillinger, CNN", "title": "Former employee filed whistleblower complaint about Abbott's Sturgis facility eight months before previously known", "description": "A former employee at Abbott Nutrition filed a whistleblower complaint about the company's Sturgis, Michigan, plant with the US Department of Labor's Occupational Safety and Health Administration in February 2021, months earlier than previously known, a source…", "url": "https://www.cnn.com/2022/06/08/health/abbott-whistleblower-complaints/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220519115542-abbott-manufacturing-0513-sturgis-super-tease.jpg", "publishedAt": "2022-06-09T01:51:59Z", "content": "(CNN)A former employee at Abbott Nutrition filed a whistleblower complaint about the company's Sturgis, Michigan, plant with the US Department of Labor's Occupational Safety and Health Administration… [+3353 chars]"}]}