{"status": "ok", "totalResults": 67, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Christina Maxouris", "title": "'Somebody was wrong.' Texas shooting victim's father demands accountability over police delays at school", "description": "Alfred Garza was outside Robb Elementary School on Tuesday as the massacre unfolded, trying to stay calm even as other parents were panicking so authorities could \"do their job like they asked us to,\" hoping they could quickly get his daughter out of harm's w…", "url": "https://www.cnn.com/2022/05/28/us/uvalde-texas-elementary-school-shooting-saturday/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220527214547-uvalde-texas-school-shooting-alfred-garza-052722.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-28T04:21:17Z", "content": "Alfred Garza was outside Robb Elementary School on Tuesday as the massacre unfolded, trying to stay calm even as other parents were panicking so authorities could do their job like they asked us to, … [+5717 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/simone-mccarthy\">Simone McCarthy</a>, CNN", "title": "Russia's war in Ukraine", "description": "Ukraine's President Volodymyr Zelensky said the situation in Donbas is \"very difficult\" as Russia ramps up firepower and manpower, but vowed the region would be \"Ukrainian again.\" Follow live news updates here.", "url": "https://www.cnn.com/europe/live-news/russia-ukraine-war-news-05-28-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220527090139-ukraine-luhansk-052622-super-tease.jpg", "publishedAt": "2022-05-28T04:00:20Z", "content": "The US Defense Department said it is mindful and aware of Ukraines request for multiple-launch rocket systems, but that decisions havent been made yet.\r\nOur goal from the very beginning has been to t… [+1102 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matias Grez", "title": "Liverpool vs. Real Madrid: The '50/50' Champions League final", "description": "Choose your color -- red or white. The bars and stands around Paris' Stade de France, the venue for Saturday's Champions League final, have certainly nailed their colors to the mast.", "url": "https://www.cnn.com/2022/05/27/football/real-madrid-liverpool-champions-league-final-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220528003326-benzema-tease-super-tease.jpg", "publishedAt": "2022-05-28T00:37:36Z", "content": "Paris, France (CNN)Choose your color -- red or white. The bars and stands around Paris' Stade de France, the venue for Saturday's Champions League final, have certainly nailed their colors to the mas… [+6138 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rhea Mogul and Sophia Saifi, CNN", "title": "Imran Khan claims there's a US conspiracy against him. Why do so many Pakistanis believe him?", "description": "Standing atop a truck, thronged by a huge crowd, a visibly enraged Imran Khan repeated the claim that has become a rallying cry for his millions of supporters.", "url": "https://www.cnn.com/2022/05/27/asia/pakistan-imran-khan-us-conspiracy-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220526211924-01-imran-khan-foreign-conspiracy-popularity-super-tease.jpg", "publishedAt": "2022-05-28T00:09:34Z", "content": "By Rhea Mogul and Sophia Saifi, CNN\r\nUpdated 8:09 PM ET, Fri May 27, 2022\r\nIslamabad, Pakistan (CNN)Standing atop a truck, thronged by a huge crowd, a visibly enraged Imran Khan repeated the claim th… [+9304 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Daniel A. Medina, Isabelle Chapman, Jeff Winter and Casey Tolan, CNN", "title": "Uvalde gunman threatened rapes and school shootings on social media app Yubo in weeks leading up to the massacre, users say", "description": "Salvador Ramos told girls he would rape them, showed off a rifle he bought, and threatened to shoot up schools in livestreams on the social media app Yubo, according to several users who witnessed the threats in recent weeks.", "url": "https://www.cnn.com/2022/05/27/us/yubo-app-salvador-ramos-threats-invs/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220527170351-uvalde-memorial-file-052622-super-tease.jpg", "publishedAt": "2022-05-28T00:01:54Z", "content": "(CNN)Salvador Ramos told girls he would rape them, showed off a rifle he bought, and threatened to shoot up schools in livestreams on the social media app Yubo, according to several users who witness… [+4776 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eric Bradner, CNN", "title": "In NRA speech, Trump does not back any gun reforms but calls for security overhaul at schools", "description": "Former President Donald Trump did not back any gun reforms in a speech Friday at the National Rifle Association's convention in Houston, instead calling for funding for schools to seal all but one entrance, station armed guards at that entrance and allow teac…", "url": "https://www.cnn.com/2022/05/27/politics/uvalde-donald-trump-nra-convention/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220527182643-02-donald-trump-nra-convention-052722-super-tease.jpg", "publishedAt": "2022-05-27T23:49:00Z", "content": "Houston (CNN)Former President Donald Trump did not back any gun reforms in a speech Friday at the National Rifle Association's convention in Houston, instead calling for funding for schools to seal a… [+2484 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Peter Bergen, CNN National Security Analyst", "title": "Opinion: Trump and Biden were both foolish about Afghanistan. Now we're all paying the price", "description": "Whether it's providing a safe haven for terrorist groups like al Qaeda or installing officials who face United Nations sanctions in cabinet positions, the Taliban is up to its old ways, according to a new report issued by the UN on Friday. While the report do…", "url": "https://www.cnn.com/2022/05/27/opinions/un-afghanistan-report-indictment-trump-biden-administrations-bergen/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211214103932-01-taliban-parade-afghanistan-sept2021-super-tease.jpg", "publishedAt": "2022-05-27T23:47:36Z", "content": "Peter Bergen is CNN's national security analyst, a vice president at New America, and a professor of practice at Arizona State University. His forthcoming paperback is \"The Cost of Chaos: The Trump A… [+6051 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Virginia Langmaid, Christina Maxouris, Melissa Gray", "title": "A timeline of how the Texas school massacre -- and the police response -- unfolded", "description": "As a broken community tries to make sense of a massacre that took the lives of 19 young children and two teachers, authorities have offered shifting timelines of what happened inside the Uvalde, Texas, school.", "url": "https://www.cnn.com/2022/05/27/us/uvalde-shooting-police-response-timeline/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220527171030-texas-department-of-public-safety-052722.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-27T21:59:10Z", "content": "As a broken community tries to make sense of a massacre that took the lives of 19 young children and two teachers, authorities have offered shifting timelines of what happened inside the Uvalde, Texa… [+8600 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Curt Devine, CNN", "title": "Focus turns to Uvalde school police chief's decision not to send officers inside", "description": "The law enforcement official who made the decision not to breach the Uvalde elementary school classroom where a gunman was shooting children and teachers was the school district police chief, officials said Friday.", "url": "https://www.cnn.com/2022/05/27/us/uvalde-school-police-chief-shooting-response/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220527163529-pedro-pete-arredondo-uvalde-0524-super-tease.jpg", "publishedAt": "2022-05-27T21:45:07Z", "content": "(CNN)The law enforcement official who made the decision not to breach the Uvalde elementary school classroom where a gunman was shooting children and teachers was the school district police chief, of… [+2699 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Annie Grayer, Ryan Nobles", "title": "Kevin McCarthy refuses to comply with January 6 committee subpoena as it stands and issues demands", "description": "House Minority Leader Kevin McCarthy sent a letter via his lawyer to the House select committee investigating the January 6, 2021, attack on the US Capitol, outlining why he will not comply with his subpoena as it stands and delivering a list of demands in or…", "url": "https://www.cnn.com/2022/05/27/politics/kevin-mccarthy-january-6-subpoena/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220527164959-kevin-mccarthy-file-051222.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-27T21:04:41Z", "content": "House Minority Leader Kevin McCarthy sent a letter via his lawyer to the House select committee investigating the January 6, 2021, attack on the US Capitol, outlining why he will not comply with his … [+4885 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brenda Goodman, CNN", "title": "Global toll of sudden, mysterious hepatitis in children rises to 650 cases", "description": "The World Health Organization reported Friday that there are at least 650 cases of sudden and unexplained hepatitis in young children under investigation in 33 countries, an increase of about 36 cases over the last international update, about a week ago. Anot…", "url": "https://www.cnn.com/2022/05/27/health/who-hepatitis-update/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220423194846-multi-country-outbreak-of-hepatitis-in-children-super-tease.jpg", "publishedAt": "2022-05-27T20:20:13Z", "content": "(CNN)The World Health Organization reported Friday that there are at least 650 cases of sudden and unexplained hepatitis in young children under investigation in 33 countries, an increase of about 36… [+2680 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacopo Prisco", "title": "Photos of a struggling community reveal the lives of its most vulnerable residents", "description": "\"Yellow tape\" is a reminder of life's fragility that was part of the latest exhibition for Shoot for Peace, a grassroots mentorship program that teaches photography to young people in Toronto. Photographer and illustrator Yasmin Osman started the program in 2…", "url": "https://www.cnn.com/style/article/yasmin-osman-shoot-for-peace-toronto-nomad/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220523131359-02-shoot-for-peace-super-tease.jpg", "publishedAt": "2022-05-27T19:35:32Z", "content": "arts\r\nKareema Hassan was at her local mosque in Toronto, Canada, for a nightly prayer called Taraweeh -- camera and tripod in tow -- when she captured a striking sign of the times. \r\nIt was the end o… [+5497 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Holmes Lybrand", "title": "Alleged Nazi sympathizer convicted for role in January 6 US Capitol riot after claiming he didn't know Congress met there", "description": "The alleged White supremacist claimed that he didn't know Congress met at the United States Capitol.", "url": "https://www.cnn.com/2022/05/27/politics/timothy-hale-cusanelli-verdict/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/210316213945-bigote-hitler-atacante-capitolio-timothy-hale-cusanelli-supremacista-nazi-pkg-isabel-morales-dusa-00001928.png?q=x_0,y_0,h_1080,w_1919,c_fill/w_800", "publishedAt": "2022-05-27T19:34:04Z", "content": "A January 6 rioter and alleged White supremacist was convicted Friday on all five charges he faced after hitching his case to the claim that he didnt know Congress met at the United States Capitol.\r\n… [+3453 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sara Murray and Jason Morris, CNN", "title": "First on CNN: Georgia district attorney investigating Trump has subpoenaed officials from secretary of state's office", "description": "An Atlanta-area district attorney investigating Donald Trump's efforts to overturn the 2020 election results has subpoenaed half a dozen officials from the Georgia secretary of state's office, according to copies of the documents obtained by CNN.", "url": "https://www.cnn.com/2022/05/27/politics/georgia-da-fani-willis-trump-subpoena-officials/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/211027234429-02-donald-trump-100921-super-tease.jpg", "publishedAt": "2022-05-27T19:09:30Z", "content": "(CNN)An Atlanta-area district attorney investigating Donald Trump's efforts to overturn the 2020 election results has subpoenaed half a dozen officials from the Georgia secretary of state's office, a… [+2760 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marshall Cohen", "title": "Jury begins deliberations in trial of former Hillary Clinton lawyer Michael Sussmann", "description": "The jury in the trial of Michael Sussmann, the Hillary Clinton campaign lawyer charged by special counsel John Durham as part of his inquiry into the origins of the FBI's Trump-Russia probe, began deliberations Friday afternoon.", "url": "https://www.cnn.com/2022/05/27/politics/michael-sussmann-trial/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220527122208-michael-sussmann-closeup-0516-super-tease.jpg", "publishedAt": "2022-05-27T17:48:11Z", "content": "(CNN)The jury in the trial of Michael Sussmann, the Hillary Clinton campaign lawyer charged by special counsel John Durham as part of his inquiry into the origins of the FBI's Trump-Russia probe, beg… [+3020 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Steve Contorno and Elizabeth Wolfe, CNN", "title": "Fired data scientist's claims of Covid-19 data manipulation 'unsubstantiated,' Florida IG report finds", "description": "Allegations the Florida Department of Health fired an employee because she objected to manipulating coronavirus data were \"unsubstantiated,\" according to a state inspector general report.", "url": "https://www.cnn.com/2022/05/27/us/florida-report-coronavirus-numbers-manipulated/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/201208181837-01-jones-interview-1208-super-tease.jpg", "publishedAt": "2022-05-27T17:45:21Z", "content": "(CNN)Allegations the Florida Department of Health fired an employee because she objected to manipulating coronavirus data were \"unsubstantiated,\" according to a state inspector general report.\r\nThe f… [+4918 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jennifer Hansler, CNN", "title": "Finnish foreign minister optimistic that 'sooner or later' Finland and Sweden will be NATO members", "description": "Finnish Foreign Minister Pekka Haavisto expressed optimism that \"sooner or later, Finland and Sweden will be members of NATO\" and said discussions with the Turkish government would continue as Ankara threatens to block the two nations from joining the defensi…", "url": "https://www.cnn.com/2022/05/27/politics/finland-foreign-minister-interview-dc/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220314075932-finnish-foreign-minister-pekka-haavisto-ctw-super-tease.jpg", "publishedAt": "2022-05-27T17:38:30Z", "content": "Washington (CNN)Finnish Foreign Minister Pekka Haavisto expressed optimism that \"sooner or later, Finland and Sweden will be members of NATO\" and said discussions with the Turkish government would co… [+4560 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ramishah Maruf", "title": "Elon Musk says it's 'dumb' to call billionaires the bad guys", "description": "Elon Musk, the world's richest man, said on Twitter Thursday that billionaires aren't the bad guys.", "url": "https://www.cnn.com/2022/05/27/business/elon-musk-billionaires-tweet/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220527115816-04-elon-musk-0309-file.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-27T17:38:27Z", "content": "Elon Musk, the worlds richest man, said on Twitter Thursday that billionaires arent the bad guys.\r\nMusk tweeted that it is morally wrong &amp; dumb to use the word billionaire as a pejorative if that… [+3199 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Photographs by Pete Luna/Uvalde Leader-News", "title": "Photos show chaotic scene as Uvalde students escape", "description": "Pete Luna, the general manager of the Uvalde Leader-News, was among those outside Robb Elementary School on Tuesday as a gunman was inside. Luna's photos capture the scene outside the school as worried parents gathered and some students escaped.", "url": "https://www.cnn.com/2022/05/27/us/gallery/uvalde-school-escape-photos/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220527101520-01b-uvalde-leader-news-school-shooting-coverage-super-tease.jpg", "publishedAt": "2022-05-27T17:26:13Z", "content": "Students run to safety after escaping from a window at Robb Elementary School on Tuesday, May 24.\r\nPhotographs by Pete Luna/Uvalde Leader-News\r\nUpdated 1:26 PM ET, Fri May 27, 2022\r\nStudents run to s… [+1097 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dan Merica, CNN", "title": "Oz says he's earned 'presumptive Republican nomination,' even as Pennsylvania Senate primary recount kicks off", "description": "Pennsylvania Senate candidate Mehmet Oz released a video on Friday in which the celebrity doctor calls himself the \"presumptive Republican\" nominee on the same day counties can begin recounting ballots in the commonwealth's tight GOP primary.", "url": "https://www.cnn.com/2022/05/27/politics/dr-oz-pennsylvania-senate-recount/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220527121657-mehmet-oz-0517-super-tease.jpg", "publishedAt": "2022-05-27T17:01:30Z", "content": "(CNN)Pennsylvania Senate candidate Mehmet Oz released a video on Friday in which the celebrity doctor calls himself the \"presumptive Republican\" nominee on the same day counties can begin recounting … [+2591 chars]"}]}