{"status": "ok", "totalResults": 82, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "By Karla Cripps, CNN", "title": "Asia's 50 best bars for 2022 revealed", "description": "With pandemic travel restrictions easing in much of the region, the annual Asia's 50 Best Bars ceremony took place in front of a live audience for the first time since 2019 on Thursday evening.", "url": "https://www.cnn.com/travel/article/asia-best-bars-2022/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220429152617-11-asia-best-bars-super-tease.jpg", "publishedAt": "2022-04-29T09:05:16Z", "content": "(CNN) With pandemic travel restrictions easing in much of the region, the annual Asia's 50 Best Bars ceremony took place in front of a live audience for the first time since 2019 on Thursday evening.… [+2766 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nectar Gan, CNN", "title": "Eileen Gu sparks praise and debate after thanking China in farewell post", "description": "\"Thank you China,\" complete with a Chinese flag and a heart emoji, might seem like an innocuous enough farewell message from China's Winter Olympics superstar Eileen Gu.", "url": "https://www.cnn.com/2022/04/29/china/eileen-gu-thank-you-china-intl-hnk-mic/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220301175802-02-eileen-gu-file-restricted-021822-super-tease.jpg", "publishedAt": "2022-04-29T08:35:56Z", "content": "A version of this story appeared in CNN's Meanwhile in China newsletter, a three-times-a-week update exploring what you need to know about the country's rise and how it impacts the world. Sign up her… [+4637 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Laura He", "title": "Apple loses top spot in China as smartphone sales slump", "description": "Just three months ago, Apple became the top-selling smartphone brand in China for the first time in six years. Now it's fallen back behind its Chinese rivals after suffering more than others from a first quarter slump in sales.", "url": "https://www.cnn.com/2022/04/29/tech/apple-china-smartphone-sales-intl-hnk/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220429004353-wuhan-apple-advert-0411.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-29T08:15:12Z", "content": "Just three months ago, Apple became the top-selling smartphone brand in China for the first time in six years. Now its fallen back behind its Chinese rivals after suffering more than others from a fi… [+3721 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Christina Maxouris, CNN", "title": "Second official claims Los Angeles County sheriff tried to cover up deputy's excessive use of force", "description": "A former top official with the Los Angeles County Sheriff's Department has accused Sheriff Alex Villanueva of attempting to cover up an alleged excessive force incident and then lying about doing so, according to legal documents obtained by CNN.", "url": "https://www.cnn.com/2022/04/29/us/los-angeles-county-sheriff-alex-villanueva-coverup-allegations-second-official/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220428202708-sheriff-alex-villanueva-kneelling-presser-0329-super-tease.jpg", "publishedAt": "2022-04-29T06:54:58Z", "content": "(CNN)A former top official with the Los Angeles County Sheriff's Department has accused Sheriff Alex Villanueva of attempting to cover up an alleged excessive force incident and then lying about doin… [+6544 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jamiel Lynch, CNN", "title": "British Virgin Islands Premier and Port Authority Director arrested on drug and money laundering charges in Miami", "description": "The Premier of the British Virgin Islands and the territory's ports director were arrested Thursday in Miami on charges related to drug trafficking and money laundering, according to a criminal affidavit filed in the US District Court's Southern District of F…", "url": "https://www.cnn.com/2022/04/29/world/british-virgin-islands-premier-drug-charges/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220428213823-andrew-fahie-super-tease.jpg", "publishedAt": "2022-04-29T06:43:10Z", "content": "(CNN)The Premier of the British Virgin Islands and the territory's ports director were arrested Thursday in Miami on charges related to drug trafficking and money laundering, according to a criminal … [+7122 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Sean Federico-OMurchu and Steve George, CNN", "title": "Russia's war in Ukraine", "description": "Ukrainian officials say several people were injured in Russia's missile attack on Kyiv Thursday night, which occurred as the United Nations Secretary General Antonio Guterres was finishing a visit to the Ukrainian capital. Follow here for live news updates.", "url": "https://www.cnn.com/europe/live-news/russia-ukraine-war-news-04-29-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220428092931-kharkiv-shelling-042722-super-tease.jpg", "publishedAt": "2022-04-29T04:35:58Z", "content": "Russian forces have made some progress in Moscow's renewed assault on eastern Ukraine, according to US and NATO officials, as their military tries to fix the myriad problems that plagued the early we… [+2273 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chris Isidore, CNN Business", "title": "Elon Musk sells $4.8 billion worth of Tesla shares", "description": "Tesla CEO Elon Musk sold $4.8 billion worth of the electric automaker's stock on Tuesday, the day after the Twitter board agreed to sell the company to him in a deal valuing the social media platform at $44 billion.", "url": "https://www.cnn.com/2022/04/28/investing/elon-musk-tesla-stock-sale/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220427125717-01-elon-musk-2019-file-super-tease.jpg", "publishedAt": "2022-04-29T03:30:45Z", "content": "New York (CNN Business)Tesla CEO Elon Musk sold $4.8 billion worth of the electric automaker's stock on Tuesday, the day after the Twitter board agreed to sell the company to him in a deal valuing th… [+3143 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Reuters", "title": "A 'Leonardo da Vinci of violins' goes up for auction in France", "description": "A near three-century-old instrument crafted by revered Italian luthier Giuseppe Guarner could fetch as much as 10 million euros ($10.6 million) when it is auctioned next month.", "url": "https://www.cnn.com/style/article/violin-auction-france/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220428191400-02-violin-auction-france-super-tease.jpg", "publishedAt": "2022-04-29T03:30:15Z", "content": "luxuryPublished 29th April 2022\r\nA near three-century-old instrument lauded as a Leonardo da Vinci of violins could fetch as much as 10 million euros ($10.6 million) when it is auctioned next month, … [+1624 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Katherine Dillinger", "title": "CDC confirms case of bird flu in Colorado man but says the public health risk assessment remains low", "description": "A case of influenza A(H5), also known as H5 bird flu, has been confirmed in a man in Colorado who had direct exposure to poultry and the culling of birds with presumptive H5N1 bird flu, the US Centers for Disease Control and Prevention said in a statement Thu…", "url": "https://www.cnn.com/2022/04/28/health/colorado-bird-flu-human-case-cdc/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220428223136-cdc-file-041922-super-tease.jpg", "publishedAt": "2022-04-29T02:48:10Z", "content": "(CNN)A case of influenza A(H5), also known as H5 bird flu, has been confirmed in a man in Colorado who had direct exposure to poultry and the culling of birds with presumptive H5N1 bird flu, the US C… [+795 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ellie Kaufman and Clarissa Ward, CNN", "title": "American killed fighting alongside Ukrainian forces in Ukraine", "description": "An American citizen, Willy Joseph Cancel, was killed fighting alongside Ukrainian forces in Ukraine, members of Cancel's family confirmed to CNN.", "url": "https://www.cnn.com/2022/04/28/politics/american-killed-ukraine/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220428170614-03-willy-joseph-cancel-super-tease.jpg", "publishedAt": "2022-04-29T02:06:21Z", "content": "(CNN)An American citizen, Willy Joseph Cancel, was killed fighting alongside Ukrainian forces in Ukraine, members of Cancel's family confirmed to CNN. \r\nThe 22-year-old was working with a private mil… [+3963 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Francesca Street, CNN", "title": "The world's most challenging cruise ship routes", "description": "Navigating a colossal ship is no mean feat under any conditions, but certain routes, like the sandstorm-prone, narrow Suez Canal -- infamously blocked by a container ship last year -- or the windy, glacier-lined waterways of Alaska, are particularly challengi…", "url": "https://www.cnn.com/travel/article/challenging-cruise-ship-routes/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220425145352-06-challenging-cruise-ship-routes-restricted-super-tease.jpg", "publishedAt": "2022-04-29T01:40:04Z", "content": "Editor's Note Monthly Ticket is a new CNN Travel series that spotlights some of the most fascinating topics in the travel world. In April, we're setting course for the diverse world of cruises. Wheth… [+9291 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brenda Goodman and Jacqueline Howard, CNN", "title": "Whistleblower alerted FDA to alleged safety lapses at baby formula plant months before recalls, complaint shows", "description": "A former employee of Abbott Nutrition documented his concerns that the company was hiding safety problems at its Sturgis, Mich., production facility and sent a detailed complaint to the US Food and Drug Administration months before infant formula was removed …", "url": "https://www.cnn.com/2022/04/28/health/baby-formula-whistleblower/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220219224111-baby-formula-stock-super-tease.jpeg", "publishedAt": "2022-04-29T00:49:13Z", "content": "(CNN)A former employee of Abbott Nutrition documented his concerns that the company was hiding safety problems at its Sturgis, Mich., production facility and sent a detailed complaint to the US Food … [+7206 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Frida Ghitis", "title": "Opinion: Putin has created an unexpected opportunity", "description": "At first glance, there's no immediately apparent connection between Elon Musk's efforts to control Twitter, the war in Ukraine and the recent election in France. And yet, there was a perplexing similarity in the current of unease that gripped the world as all…", "url": "https://www.cnn.com/2022/04/28/opinions/putin-created-unexpected-opportunity-future-of-democracy-ghitis/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220427131058-putin-threat-04-27-2022-super-tease.jpg", "publishedAt": "2022-04-29T00:48:03Z", "content": "Frida Ghitis, (@fridaghitis) a former CNN producer and correspondent, is a world affairs columnist. She is a frequent opinion contributor to CNN, a contributing columnist to The Washington Post and a… [+7379 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Meg Dunn, CNN", "title": "Go inside the school offering adults with special needs the college experience they were missing", "description": "When DeAnna Pursai realized how few opportunities her sister with Down syndrome had to keep learning and growing as an adult, she co-founded the College of Adaptive Arts for students like her.", "url": "https://www.cnn.com/2022/04/28/us/california-college-special-needs-adults-cnnheroes/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220428190055-cnnheroes-deanna-pursai-and-sister-super-tease.jpg", "publishedAt": "2022-04-29T00:25:29Z", "content": "Know someone who inspires you? Click here to nominate them as a CNN Hero.\r\nSan Jose, California (CNN)Growing up in rural Indiana, DeAnna Ellenberger Pursai and her sister, Angel, were constant compan… [+6013 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sara Smart, CNN", "title": "A 61-year-old is set to row solo from the US to France. The entire journey will be nearly 4,000 miles", "description": "Over the next couple of months, one man will attempt to row close to 4,000 miles across the Atlantic Ocean.", "url": "https://www.cnn.com/2022/04/28/us/peter-harley-solo-row-us-to-france-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220428174641-02-rower-peter-harley-super-tease.jpg", "publishedAt": "2022-04-29T00:15:48Z", "content": "(CNN)Over the next couple of months, one man will attempt to row close to 4,000 miles across the Atlantic Ocean.\r\nPeter Harley, 61, hopes to set sail next week, weather permitting, from Virginia Beac… [+2872 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amir Vera and Sonia Moghe, CNN", "title": "Elon Musk not expected to testify in Johnny Depp's defamation case against Amber Heard", "description": "Elon Musk is not expected to testify in Johnny Depp's defamation trial against his ex-wife Amber Heard, a source close to Musk's legal team confirmed to CNN.", "url": "https://www.cnn.com/2022/04/28/entertainment/johnny-depp-amber-heard-elon-musk-testimony/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220428174158-depp-heard-trial-split-super-tease.jpg", "publishedAt": "2022-04-29T00:03:27Z", "content": "(CNN)Elon Musk is not expected to testify in Johnny Depp's defamation trial against his ex-wife Amber Heard, a source close to Musk's legal team confirmed to CNN. \r\nMusk was listed as a potential wit… [+1863 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jomana Karadsheh and Mohammed Tawfeeq, CNN", "title": "Turkey's Erdogan visits Saudi Arabia for first time in years, seeking to mend ties", "description": "Turkey's President Recep Tayyip Erdogan met with Saudi Arabia's Crown Prince Mohammed bin Salman and King Salman bin Abdulaziz Al-Saud in Jeddah on Thursday, marking his first visit to the country since the killing of journalist Jamal Khashoggi in 2018.", "url": "https://www.cnn.com/2022/04/28/middleeast/turkey-erdogan-saudi-arabia-visit-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220428184948-erdogan-saudi-arabia-visit-super-tease.jpg", "publishedAt": "2022-04-28T23:52:06Z", "content": "(CNN)Turkey's President Recep Tayyip Erdogan met with Saudi Arabia's Crown Prince Mohammed bin Salman and King Salman bin Abdulaziz Al-Saud in Jeddah on Thursday, marking his first visit to the count… [+1505 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul LeBlanc, CNN", "title": "16 states, DC and environmental groups sue USPS over gas-powered trucks", "description": "Attorneys general from 16 states and the District of Columbia and a coalition of environmental groups are suing the US Postal Service in an effort to stop the purchase of thousands of gasoline-powered trucks.", "url": "https://www.cnn.com/2022/04/28/politics/usps-gas-powered-trucks-lawsuits/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220428143252-usps-mail-truck-super-tease.jpg", "publishedAt": "2022-04-28T23:32:10Z", "content": "Washington (CNN)Attorneys general from 16 states and the District of Columbia and a coalition of environmental groups are suing the US Postal Service in an effort to stop the purchase of thousands of… [+3186 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alisha Ebrahimji", "title": "Texas high school policy banning braided or twisted hair has stopped a teen from attending school, his mom says", "description": "Nothing makes Dyree Williams feel more like himself than his hair, which he has proudly worn in twists, braids and locks all his life -- it's part of his identity and a direct connection to his ancestors.", "url": "https://www.cnn.com/2022/04/28/us/texas-high-school-east-bernard-braided-hair-ban/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220428105024-01-texas-high-school-east-bernard-braided-hair-ban.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-04-28T23:16:27Z", "content": "Nothing makes Dyree Williams feel more like himself than his hair, which he has proudly worn in twists, braids and locks all his life its part of his identity and a direct connection to his ancestors… [+5083 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Zachary Cohen, Oren Liebermann, Jim Sciutto and Katie Bo Lillis, CNN", "title": "Russia making 'slow and uneven' progress as military tries to fix problems that plagued early invasion, US officials say", "description": "Russian forces have made some progress in Moscow's renewed assault on eastern Ukraine, according to US and NATO officials, as their military tries to fix the myriad problems that plagued the early weeks of the invasion.", "url": "https://www.cnn.com/2022/04/28/politics/russia-military-progress-eastern-ukraine/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220428180203-putin-0428-super-tease.jpg", "publishedAt": "2022-04-28T22:39:00Z", "content": "(CNN)Russian forces have made some progress in Moscow's renewed assault on eastern Ukraine, according to US and NATO officials, as their military tries to fix the myriad problems that plagued the ear… [+8607 chars]"}]}