{"status": "ok", "totalResults": 103, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "By Maxime Tamsett, CNN", "title": "How the hamburger became an American staple -- and where to get classic burgers today", "description": "Take a tasty dive into the history of the hamburger and discover five long-lasting burger joints in the United States still serving them old school.", "url": "https://www.cnn.com/travel/article/original-american-hamburger-restaurants-history/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220428140436-04-classic-american-hamburgers-super-tease.jpg", "publishedAt": "2022-05-03T12:35:52Z", "content": "(CNN) Whether you're in the heartland of the United States or halfway across the world, when you crave an American meal, you're probably sinking your teeth into a hamburger. \r\nWhile most Americans ca… [+8969 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julia Horowitz", "title": "Wall Street needs a reason to buy stocks. Is this it?", "description": "Stocks have been volatile in recent weeks, notching their worst start to the year since 1939. Between the war in Ukraine, decades-high inflation and recession fears, it's been difficult for investors to convince themselves to put more money into the market.", "url": "https://www.cnn.com/2022/05/03/investing/premarkets-stock-trading/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220503124813-google-buyback-050322.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-03T12:34:59Z", "content": "A version of this story first appeared in CNN Business Before the Bell newsletter. Not a subscriber? You can sign up right here. You can listen to an audio version of the newsletter by clicking the s… [+6136 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oren Liebermann, CNN", "title": "More than 200 sailors moved off aircraft carrier after multiple suicides", "description": "More than 200 sailors have moved off the USS George Washington aircraft carrier after multiple deaths by suicide among the crew, including three in less than one week in April, according to the Navy.", "url": "https://www.cnn.com/2022/05/03/politics/uss-george-washington-sailors/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220503124338-uss-george-washington-restricted-super-tease.jpg", "publishedAt": "2022-05-03T12:09:13Z", "content": "(CNN)More than 200 sailors have moved off the USS George Washington aircraft carrier after multiple deaths by suicide among the crew, including three in less than one week in April, according to the … [+2226 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/adrienne-vogt\">Adrienne Vogt</a>, <a href=\"/profiles/aditi-sandal\">Aditi Sangal</a>, Maureen Chowdhury, Melissa Macaya, <a href=\"/profiles/meg-wagner\">Meg Wagner</a> and Mike Hayes, CNN", "title": "Ohio and Indiana 2022 primary elections", "description": "Voters are heading to the polls in Ohio and Indiana Tuesday as the first multi-state primary of 2022 kicks off. Follow here for live news updates, results and analysis.", "url": "https://www.cnn.com/politics/live-news/ohio-indiana-primary-elections-results-2022/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220502181352-ohio-primary-early-voting-file-040622-super-tease.jpg", "publishedAt": "2022-05-03T12:09:03Z", "content": "The midterm elections won't take place until November, but the primaries that begin in earnest on Tuesday will frame Americans' choices on which direction the country takes.\r\nWill Democrats move to t… [+3434 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "What you need to know about Finland's and Sweden's path to NATO membership", "description": "Since Russia's invasion of Ukraine, Finland and Sweden have been considering applying for membership of the NATO military alliance, which would mark a major policy shift for the Nordic region.", "url": "https://www.cnn.com/2022/05/03/europe/finland-sweden-path-nato-membership-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220503123122-01-finland-sweden-path-nato-super-tease.jpg", "publishedAt": "2022-05-03T12:05:58Z", "content": "Helsinki/StockholmSince Russia's invasion of Ukraine, Finland and Sweden have been considering applying for membership of the NATO military alliance, which would mark a major policy shift for the Nor… [+3244 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Megan C. Hills, CNN", "title": "Kim Kardashian wore one of Marilyn Monroe's most iconic dresses to the Met Gala", "description": "The pre-loved dress was worn by the late star when she famously sang \"Happy Birthday\" to President John F. Kennedy in 1962.", "url": "https://www.cnn.com/style/article/kim-kardashian-marilyn-monroe-met-gala-2022/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220502222806-65-met-gala-2022-kim-kardashian-super-tease.jpg", "publishedAt": "2022-05-03T12:03:10Z", "content": "As the Met Gala red carpet drew to a close on Monday night, Kim Kardashian arrived fashionably late in a sparkling skin-tight gown once worn by Marilyn Monroe. Adorned with over 6,000 handsewn crysta… [+2669 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Janfaza, Andrew Menezes", "title": "Here are the key House primaries to watch in Ohio and Indiana", "description": "It's Election Day in Ohio and Indiana, where voters will pick their party nominees in primary races ahead of the 2022 midterm elections.", "url": "https://www.cnn.com/2022/05/03/politics/ohio-indiana-house-primaries/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220430192010-key-house-primaries-ohio-indiana.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-03T12:01:04Z", "content": "Its Election Day in Ohio and Indiana, where voters will pick their party nominees in primary races ahead of the 2022 midterm elections. \r\nWhile Ohio has made headlines for its Senate and gubernatoria… [+5352 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/aditi-sandal\">Aditi Sangal</a>, <a href=\"/profiles/adrienne-vogt\">Adrienne Vogt</a> and <a href=\"/profiles/meg-wagner\">Meg Wagner</a>, CNN", "title": "Supreme Court draft opinion would overturn Roe v. Wade", "description": "Politico has published what it says is a draft opinion written by Supreme Court Justice Samuel Alito that would overturn Roe v. Wade. Follow live news updates here.", "url": "https://www.cnn.com/politics/live-news/scotus-abortion-rights-reactions/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220503004720-supreme-court-abortion-protest-0502-super-tease.jpg", "publishedAt": "2022-05-03T11:58:33Z", "content": "In a stunning breach of Supreme Court confidentiality and secrecy, Politico has obtained what it calls a draft of a majority opinion written by Justice Samuel Alito that would strike down Roe v. Wade… [+1641 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jack Guy, Vasco Cotovio, Rodrigo Pedroso and Francesca Street, CNN", "title": "Brazil has a towering new statue of Jesus", "description": "The Cristo Protetor de Encantado statue overlooking the Brazilian town of Encantado is nearly five meters taller than Rio de Janeiro's famous \"Christ the Protector\" statue.", "url": "https://www.cnn.com/travel/article/brazil-christ-statue-encantado-completed/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220503112749-brazil-christ-statue-encantado-revealed-super-tease.jpg", "publishedAt": "2022-05-03T11:56:21Z", "content": "(CNN) The Brazilian town of Encantado has a towering new statue of Jesus Christ that rivals the height of Rio de Janeiro's famous \"Christ the Protector\" statue. \r\nMade of steel and concrete, the stat… [+2052 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Matt Egan, CNN Business", "title": "'Very, very unlikely' Fed can tame inflation without sparking recession, former NY Fed chief says", "description": "The Federal Reserve helped rescue the economy from the worst pandemic in a century. That task may prove easy compared with the Fed's next mission: crush inflation, without causing a recession.", "url": "https://www.cnn.com/2022/05/03/economy/recession-inflation-fed-bill-dudley/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/190827110542-bill-dudley-file-super-tease.jpg", "publishedAt": "2022-05-03T11:51:20Z", "content": "By the time you know you've overdone it, the next thing you know, you're already in a recession.\"\r\nformer NY Fed president Bill Dudley"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kaitlan Collins, CNN", "title": "Biden's trip to Alabama to highlight importance of US anti-tank missiles in Ukraine fight", "description": "President Joe Biden on Tuesday will make a trip that would have seemed far-fetched to his own advisers one year ago, visiting a weapons-making facility in ruby-red Alabama.", "url": "https://www.cnn.com/2022/05/03/politics/joe-biden-alabama-ukraine/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220428121601-02-biden-ukraine-042822-super-tease.jpg", "publishedAt": "2022-05-03T11:42:38Z", "content": "(CNN)President Joe Biden on Tuesday will make a trip that would have seemed far-fetched to his own advisers one year ago, visiting a weapons-making facility in ruby-red Alabama. \r\nBut 69 days into Ru… [+2195 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Michael Warren, CNN", "title": "Hogan will call for a GOP 'course correction' from Trump during speech at Reagan Library", "description": "Maryland GOP Gov. Larry Hogan will call for a \"course correction\" for the Republican Party following the Trump administration during a speech Tuesday night, according to prepared remarks obtained by CNN.", "url": "https://www.cnn.com/2022/05/03/politics/larry-hogan-donald-trump-reagan-library/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220503123755-larry-hogan-file-072922-super-tease.jpg", "publishedAt": "2022-05-03T11:42:24Z", "content": "(CNN)Maryland GOP Gov. Larry Hogan will call for a \"course correction\" for the Republican Party following the Trump administration during a speech Tuesday night, according to prepared remarks obtaine… [+3773 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Michelle Toh, CNN Business", "title": "HSBC's biggest shareholder reignites debate about breaking up the bank", "description": "HSBC has long prided itself on being the bank that connects East and West. Now it's under pressure to rethink that model after a challenge from its top shareholder, one of the most powerful finance companies in China.", "url": "https://www.cnn.com/2022/05/03/investing/hsbc-breakup-ping-an-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220503101134-hsbc-breakup-super-tease.jpg", "publishedAt": "2022-05-03T11:27:18Z", "content": "Hong Kong (CNN Business)HSBC has long prided itself on being the bank that connects East and West. Now it's under pressure to rethink that model after a challenge fromits top shareholder, one of the … [+3143 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Eric Bradner, CNN", "title": "'The economics of everything': Ohio voters say inflation is their top concern", "description": "After casting their early Ohio primary ballots last weekend, voter after voter -- those who grabbed Democratic ballots and Republican ballots -- identified the same issue as the most important to them: inflation.", "url": "https://www.cnn.com/2022/05/03/politics/ohio-primary-issues-inflation/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220502214759-ohio-primary-voting-0426-super-tease.jpg", "publishedAt": "2022-05-03T11:03:05Z", "content": "Dayton, Ohio (CNN)After casting their early Ohio primary ballots last weekend, voter after voter -- those who grabbed Democratic ballots and Republican ballots -- identified the same issue as the mos… [+5829 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Elizabeth Wolfe, CNN", "title": "These are the US states where abortion rights could be under threat if Roe v. Wade is overturned", "description": "Many Americans anxiously anticipating the Supreme Court's decision on Roe v. Wade may have been offered a glimpse of what's to come when Politico revealed Monday night what it describes as a draft Supreme Court opinion that would upend the landmark abortion r…", "url": "https://www.cnn.com/2022/05/03/us/state-abortion-trigger-laws-roe-v-wade-overturned/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220502201802-03-outside-supreme-court-0502-super-tease.jpg", "publishedAt": "2022-05-03T10:04:02Z", "content": "(CNN)Many Americansanxiously anticipating the Supreme Court's decision on Roe v. Wade may have been offered a glimpse of what's to come when Politico revealed Monday night what it describes as a draf… [+7178 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Finnish group ditches Russian-built nuclear plant plan", "description": "Finnish-led consortium Fennovoima said on Monday it had scrapped a contract for Russia's state-owned Rosatom to build a nuclear power plant in Finland, citing delays and increased risks due to the war in Ukraine.", "url": "https://www.cnn.com/2022/05/03/business/finnish-group-ditch-russian-built-nuclear-plant-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220503041719-hanhikivi-1-construction-site-file-11032021.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-03T08:59:12Z", "content": "Finnish-led consortium Fennovoima said on Monday it had scrapped a contract for Russias state-owned Rosatom to build a nuclear power plant in Finland, citing delays and increased risks due to the war… [+2466 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oscar Holland, CNN | Ziyu Zhang, CNN", "title": "'Like a supermodel': Eileen Gu's Met Gala appearance lights up Chinese social media", "description": "Olympic skier Eileen Gu was among the most talked-about topics on China's Weibo after she wore a Louis Vuitton mini-dress to the Met Gala.", "url": "https://www.cnn.com/style/article/eileen-gu-met-gala-china/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220503032456-eileen-gu-met-gala-2022-super-tease.jpg", "publishedAt": "2022-05-03T08:55:28Z", "content": "Winter Olympian Eileen Gu set Chinese social media alight after she attended Monday evening's notoriously exclusive Met Gala in a figure-hugging Louis Vuitton mini-dress. \r\nAppearing on the red carpe… [+3360 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jessie Yeung, CNN", "title": "'What is going on in Shanghai': Horror as elderly man taken to morgue in body bag -- while still alive", "description": "An elderly Shanghai resident was mistakenly declared dead and taken to a morgue in a body bag, in the latest sign of dysfunction in the Covid-stricken city where millions of people remain under government-enforced lockdown.", "url": "https://www.cnn.com/2022/05/03/china/shanghai-morgue-care-home-resident-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220429032033-shanghai-lockdown-0428-super-tease.jpg", "publishedAt": "2022-05-03T08:46:46Z", "content": "(CNN)An elderly Shanghai resident was mistakenly declared dead and taken to a morgue in a body bag, in the latest sign of dysfunction in the Covid-stricken city where millions of people remain under … [+2936 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Milly Chan", "title": "Lab-grown 'human milk' may be just three years away", "description": "Breast milk is the perfect food for babies. The possible second best, according to a North Carolina startup? \"Human milk\" grown in the lab.", "url": "https://www.cnn.com/2022/05/03/business/lab-grown-human-milk-biomilq-health-climate-hnk-spc-intl/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220425122923-biomilq-1.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-05-03T08:10:13Z", "content": "Breast milk is the perfect food for babies but not all mothers are able to breastfeed, and with adoption or surrogacy, parents dont have the option.\r\nEnter: BIOMILQ. The North Carolina-based startup … [+4313 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Angie Orellana Hernandez and Ashley Strickland, CNN", "title": "The Eta Aquariids meteor shower will dazzle this week", "description": "The Eta Aquariids meteor shower, which originated from Halley's Comet, will peak on during the early morning hours of May 5, and those in the Southern Hemisphere will get the best view.", "url": "https://www.cnn.com/2022/05/03/world/eta-aquariids-meteor-shower-may-2022-scn/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210504142212-eta-aquarid-meteor-shower-restricted-super-tease.jpg", "publishedAt": "2022-05-03T07:56:34Z", "content": "(CNN)While the moon's brightness may have obscured April Lyrid's meteor shower, stargazers will have another opportunity to spot meteors with the upcoming Eta Aquariids meteor shower, peaking at arou… [+4546 chars]"}]}