{"status": "ok", "totalResults": 51, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Zoe Sottile", "title": "A super-rare orange lobster named Cheddar was saved from becoming seafood", "description": "A bright orange lobster was rescued from its fate as a meal at Red Lobster after staff members recognized the crustacean's unusual coloring.", "url": "https://www.cnn.com/2022/07/17/us/orange-lobster-ripleys-aquarium-scn-trnd/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220716082641-01-orange-lobster-ripleys-aquarium.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-17T05:01:27Z", "content": "A bright orange lobster was rescued from its fate as a meal at Red Lobster after staff members recognized the crustaceans unusual coloring.\r\nThe lobster was named Cheddar in an ode to the restaurants… [+1492 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Zoe Sottile, CNN", "title": "You can now buy George Clooney's infamous 'Batman' costume", "description": "\"Batman\" superfans can step into the iconic costume from George Clooney's turn as the superhero -- complete with realistically molded nipples.", "url": "https://www.cnn.com/style/article/george-clooney-batman-costume-auction-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220715143655-george-clooney-batman-costume-restricted-super-tease.jpg", "publishedAt": "2022-07-17T04:04:47Z", "content": "design\r\n\"Batman\" superfans can step into the iconic costume from George Clooney's turn as the superhero -- complete with realistically molded nipples. \r\nHeritage Auctions is auctioning the notorious … [+1344 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rosa Flores and Christina Maxouris, CNN", "title": "A fact-focused report on the Uvalde school massacre is expected to be released to the public Sunday", "description": "A Texas House investigative committee is expected to release a preliminary report Sunday on the Uvalde, Texas, school massacre that left 21 people dead, more than a month after the group began its search for answers.", "url": "https://www.cnn.com/2022/07/17/us/texas-house-uvalde-shooting-report/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220527101520-01b-uvalde-leader-news-school-shooting-coverage-super-tease.jpg", "publishedAt": "2022-07-17T04:02:33Z", "content": "(CNN)A Texas House investigative committee is expected to release a preliminary report Sunday on the Uvalde, Texas, school massacre that left 21 people dead, more than a month after the group began i… [+3600 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Tara John, CNN", "title": "Britain's Conservative party leadership race is turning into a transphobic spectacle", "description": "Britain's Conservative leadership contest kicked off this week, a weeks-long process that will result in the country's next prime minister. Besides the standard pledges of tax cuts or a slimmed down state, there has also been an enthusiastic promotion of anti…", "url": "https://www.cnn.com/2022/07/17/uk/uk-conservative-leadership-trans-intl-gbr/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220715130343-trans-rights-march-london-restricted-super-tease.jpg", "publishedAt": "2022-07-17T04:02:30Z", "content": "(CNN)Britain's Conservative leadership contest kicked off this week, a weeks-long process that will result in the country's next prime minister. Besides the standard pledges of tax cuts or a slimmed … [+7463 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Carma Hassan, Christina Maxouris", "title": "US will get an answer on second boosters for adults under 50 'reasonably soon,' Fauci says", "description": "US health officials have been in active discussions with the Food and Drug Administration on whether the agency will authorize a second booster vaccine for Americans under 50 years old, the nation's top infectious disease expert shared Saturday.", "url": "https://www.cnn.com/2022/07/16/health/fauci-covid-second-boosters-adults-under-50/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220716221911-01-fauci-covid-second-boosters-adults-under-50.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-17T02:40:50Z", "content": "US health officials have been in active discussions with the Food and Drug Administration on whether the agency will authorize a second booster vaccine for Americans under 50 years old, the nations t… [+2963 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Frida Ghitis", "title": "Opinion: Biden's risky fist bump with MBS", "description": "Are presidential fist bumps a sign of distance or closeness? The Biden administration may have thought that by avoiding a handshake with Saudi Crown Prince Mohammed bin Salman, known as MBS, the President could dampen any criticism for meeting the de facto ru…", "url": "https://www.cnn.com/2022/07/16/opinions/biden-saudi-trip-fist-bump-with-mbs-ghitis/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220715123924-01b-biden-mbs-fist-bump-super-tease.jpg", "publishedAt": "2022-07-17T02:25:53Z", "content": "Frida Ghitis, (@fridaghitis) a former CNN producer and correspondent, is a world affairs columnist. She is a frequent opinion contributor to CNN, a contributing columnist to The Washington Post and a… [+7836 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Xiaofei Xu, CNN", "title": "How American tourists are saving France's summer", "description": "Summer is in full swing in Paris and the entrance square to the Louvre is busy with vendors selling water or Eiffel Tower souvenirs. Among them, US tourist Chris Walkley is enjoying his first visit to France, taking selfies with his girlfriend by the art muse…", "url": "https://www.cnn.com/travel/article/american-tourists-france-summer/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220715090425-04-american-tourists-france-summer-beach-super-tease.jpg", "publishedAt": "2022-07-17T02:22:32Z", "content": "Paris (CNN) Summer is in full swing in Paris and the entrance square to the Louvre is busy with vendors selling water or Eiffel Tower souvenirs. Among them, US tourist Chris Walkley is enjoying his f… [+4477 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kathleen Magramo, CNN", "title": "Filipinos are buying books to preserve the truth about the Marcos regime", "description": "Filipinos living abroad are snapping up books about the late Philippine dictator Ferdinand E. Marcos, not just to read about history but to preserve it.", "url": "https://www.cnn.com/2022/07/16/asia/philippines-marcos-books-truth-rewrite-history-intl-hnk-dst/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220705001748-03-filipinos-fear-censorship-0705-super-tease.jpg", "publishedAt": "2022-07-17T00:44:52Z", "content": "Hong Kong (CNN)Filipinos living abroad are snapping up books about the late Philippine dictator Ferdinand E. Marcos, not just to read about history but to preserve it.\r\nThe rush to buy books document… [+8150 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Hannah Sarisohn, Josh Campbell", "title": "Man who allegedly fatally stabbed professional race car driver was killed in a police shooting, authorities say", "description": "A man who allegedly fatally stabbed professional race car driver Bobby East at a Southern California gas station was later killed in a police shooting as authorities attempted to arrest him, according to a news release from the Westminster, California, Police…", "url": "https://www.cnn.com/2022/07/16/us/bobby-east-nascar-stabbing-death/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220716201027-bobby-east-nascar-stabbing-death.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-17T00:41:47Z", "content": "A man who allegedly fatally stabbed professional race car driver Bobby East at a Southern California gas station was later killed in a police shooting as authorities attempted to arrest him, accordin… [+1345 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paradise Afshar, CNN", "title": "Stopped driver dies after a crash involving a deputy responding to a call in Louisiana", "description": "A Louisiana woman sitting in her stopped car on a state highway died Friday after being hit by a Livingston Parish Sheriff's Office deputy responding to a call, according to a release from the Louisiana State Police.", "url": "https://www.cnn.com/2022/07/16/us/louisiana-woman-killed-deputy-crash/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220716203219-louisiana-fatal-crash-map-super-tease.jpg", "publishedAt": "2022-07-17T00:40:13Z", "content": "(CNN)A Louisiana woman sitting in her stopped car on a state highway died Friday after being hit by a Livingston Parish Sheriff's Office deputy responding to a call, according to a release from the L… [+1423 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jack Bantock, CNN", "title": "The Open: McIlroy and Hovland level at the top after enthralling third round fight", "description": "The Open Championship is teed up for a mouthwatering final showdown after a pulsating battle between Rory McIlroy and Viktor Hovland at St. Andrews, Scotland on Saturday.", "url": "https://www.cnn.com/2022/07/16/golf/the-open-mcilroy-hovland-third-round-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220716151042-01-hovland-mcilroy-220716-super-tease.jpg", "publishedAt": "2022-07-16T21:31:52Z", "content": "(CNN)The Open Championship is teed up for a mouthwatering final showdown after a pulsating battle between Rory McIlroy and Viktor Hovland at St. Andrews, Scotland on Saturday.\r\nPartnered for the thir… [+4751 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kate Bennett", "title": "Jill Biden on President Joe Biden's hindered progress: 'He had so many hopes'", "description": "First lady Jill Biden on Saturday voiced frustration about the stalled progress of President Joe Biden's tenure in the White House during a private Democratic National Committee fundraiser.", "url": "https://www.cnn.com/2022/07/16/politics/jill-biden-joe-biden-democratic-national-committee-fundraiser/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220716164024-01-jill-biden-joe-biden-democratic-national-committee-fundraiser.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-16T21:31:37Z", "content": "First lady Jill Biden on Saturday voiced frustration about the stalled progress of President Joe Bidens tenure in the White House during a private Democratic National Committee fundraiser.\r\nThe first… [+3886 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Ariel Edwards-Levy, CNN", "title": "Here's what the post-Roe polling says about voters' top issues", "description": "Few individual news events have the power to singlehandedly rearrange voters' electoral priorities. But if anything held that possibility, it might have been the Supreme Court's decision to overturn Roe vs. Wade. Beyond its immediate consequences for abortion…", "url": "https://www.cnn.com/2022/07/16/politics/top-issue-polls-abortion/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220709223001-protest-dc-super-tease.jpg", "publishedAt": "2022-07-16T20:58:35Z", "content": "(CNN)Few individual news events have the power to singlehandedly rearrange voters' electoral priorities. But if anything held that possibility, it might have been the Supreme Court's decision to over… [+10216 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Forrest Brown, CNN", "title": "Presidio Tunnel Tops: A new entry for your San Francisco to-do list", "description": "On Sunday, tourists get another attraction to add to their San Francisco to-do list. Presidio Tunnel Tops is new federal parkland that has been built in an unusual place -- on top of a busy highway tunnel.", "url": "https://www.cnn.com/travel/article/presidio-tunnel-tops-parkland-san-francisco-california/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220712161003-05-presidio-tunnel-tops-super-tease.jpg", "publishedAt": "2022-07-16T20:04:46Z", "content": "Editor's Note Monthly Ticket is a CNN Travel series that spotlights some of the most fascinating topics in the travel world. In July, we're hitting the trails to explore the world's greatest hikes.\r\n… [+5466 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Samantha Beech and Amya Henry, CNN", "title": "Murder convictions overturned decades after 3 men were convicted in a New York attack that resembled a scene from the 'Money Train' film", "description": "Three men who served decades in prison for the arson murder of a New York City subway clerk, a murder that resembled a scene from the 1995 movie \"Money Train,\" have had their convictions overturned.", "url": "https://www.cnn.com/2022/07/16/us/new-york-murder-convictions-overturned/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220716140718-01-ny-subway-conviction-overturned-super-tease.jpg", "publishedAt": "2022-07-16T19:01:41Z", "content": "(CNN)Three men who served decades in prison for the arson murder of a New York City subway clerk, a murder that resembled a scene from the 1995 movie \"Money Train,\" have had their convictions overtur… [+3306 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeremy Herb, Katelyn Polantz", "title": "New York Times: Conservative lawyer suggested to Trump he take steps akin to declaring 'martial law' to overturn election results", "description": "Then-President Donald Trump in December 2020 was entertaining fringe legal advice from a wider group of outside lawyers than was previously known as he sought to block the 2020 election result. That included hearing directly from a little-known conservative l…", "url": "https://www.cnn.com/2022/07/16/politics/william-olson-donald-trump-memo-martial-law/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220716141450-donald-trump-0708.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-16T18:35:31Z", "content": "Then-President Donald Trump in December 2020 was entertaining fringe legal advice from a wider group of outside lawyers than was previously known as he sought to block the 2020 election result. That … [+5333 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kate Sullivan, CNN", "title": "5 takeaways from Biden's first presidential trip to the Middle East", "description": "President Joe Biden on Saturday capped a four-day trip to Israel and Saudi Arabia, his first trip to the Middle East since taking office.", "url": "https://www.cnn.com/2022/07/16/politics/biden-middle-east-trip-takeaways/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220716073629-05-biden-saudi-arabia-0716-super-tease.jpg", "publishedAt": "2022-07-16T18:10:52Z", "content": "(CNN)President Joe Biden on Saturday capped a four-day trip to Israel and Saudi Arabia, his first trip to the Middle East since taking office. \r\nThe President started his trip by meeting with Israeli… [+8987 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Mary Ziegler", "title": "Opinion: The horrific story of one little girl in America is a cautionary tale", "description": "Historian of abortion Mary Ziegler writes of a 10-year-old Ohio girl whose story sparked a firestorm this week that as \"appalling as the violence perpetrated against her was, it was also shocking to witness the reflexive doubt many had about her story.", "url": "https://www.cnn.com/2022/07/16/opinions/ohio-10-year-old-girl-abortion-ziegler/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220714153912-20220715-abortion-data-collection-illustration-super-tease.jpg", "publishedAt": "2022-07-16T18:08:25Z", "content": "Mary Ziegler is the author of \"Abortion and the Law in America: Roe v. Wade to the Present\" and \"Dollars for Life: The Anti-Abortion Movement and the Fall of the Republican Establishment.\" The views … [+8410 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "John Couwels, CNN", "title": "Akron mayor intends to lift city curfew implemented following police shooting of Jayland Walker", "description": "The nightly curfew in Akron, Ohio, put in place following the police shooting of Jayland Walker will be lifted if there are no major public safety concerns Saturday evening, Mayor Daniel Horrigan said.", "url": "https://www.cnn.com/2022/07/16/us/akron-mayor-city-curfew-jayland-walker/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220716115402-jayland-walker-march-ohio-0708-super-tease.jpg", "publishedAt": "2022-07-16T16:41:25Z", "content": "(CNN)The nightly curfew in Akron, Ohio, put in place following the police shooting of Jayland Walker will be lifted if there are no major public safety concerns Saturday evening, Mayor Daniel Horriga… [+3010 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ray Sanchez and Peter Nickeas, CNN", "title": "What we learned from the Uvalde shooting video, and what remains unknown", "description": "The video of law enforcement response to the Robb Elementary School shooting sheds no light on why officers waited so long to confront the gunman, nor does it reveal who was responsible for the delay. In fact, the video raises more questions than answers.", "url": "https://www.cnn.com/2022/07/16/us/uvalde-shooting-video-what-we-learned/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220713000802-01-uvalde-video-071222-super-tease.jpg", "publishedAt": "2022-07-16T15:53:34Z", "content": "(CNN)The gunman walked into the Uvalde, Texas, elementary school and casually pushed back his long hair before moving to adjoining classrooms where he killed 19 students and two teachers, according t… [+12061 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Fredreka Schouten, David Wright", "title": "Democratic Senate contenders smash fundraising records as Donald Trump's cash pace slows", "description": "New fundraising reports show Donald Trump's political operation continuing to pull in millions of dollars from his army of supporters -- but at a slower pace -- as Democratic Senate candidates in key battleground states rake in massive amounts of campaign mon…", "url": "https://www.cnn.com/2022/07/16/politics/senate-trump-second-quarter-2022-fundraising/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220716100754-john-fetterman-0510.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-16T15:16:57Z", "content": "Democratic Senate candidates in key battleground states continue to rake in massive amounts of campaign money as the battle for control of the chamber intensifies, according to new campaign finance r… [+8978 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Charlie Dent", "title": "Opinion: Joe Manchin is a symptom of Biden's political ailments", "description": "Joe Biden's presidency and agenda are struggling. With Sen. Joe Manchin of West Virginia's announcement that he will not support the climate and tax provisions in what was left of Biden's revived Build Back Better bill, it's clear the President's signature po…", "url": "https://www.cnn.com/2022/07/16/opinions/manchin-biden-administration-problem-dent/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220715130012-01-joe-manchin-joe-biden-split-super-tease.jpg", "publishedAt": "2022-07-16T14:40:02Z", "content": "Charlie Dent is a former Republican congressman from Pennsylvania who served as chair of the House Ethics Committee from 2015 until 2017 and chair of the House Appropriations Subcommittee on Military… [+5159 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Scott Galloway on Twitter Vs. Musk - CNN Video", "description": "Twitter is suing Elon Musk to force him to complete his $45B purchase of the social media platform. \"This has clearly gone from sort of an irrational deal to an insane deal,\" says NYU professor Scott Galloway, \"but he signed a contract.\"", "url": "https://www.cnn.com/videos/business/2022/07/15/scott-galloway-on-twitter-v-musk.cnn", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220716095200-scott-galloway-on-twitter-v-musk-00035127-super-tease.png", "publishedAt": "2022-07-16T14:01:51Z", "content": ""}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sana Noor Haq, CNN", "title": "Londoners urged not to travel as heat wave engulfs Europe", "description": "Commuters in London have been advised not to use the city's transport network unless for \"essential journeys,\" amid a sweltering heat wave across western Europe.", "url": "https://www.cnn.com/2022/07/16/weather/london-travel-warning-europe-heat-wave-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220715081707-01-uk-heat-wave-0714-super-tease.jpg", "publishedAt": "2022-07-16T13:59:03Z", "content": "London (CNN)Commuters in London have been advised not to use the city's transport network unless for \"essential journeys,\" amid a sweltering heat wave across western Europe. \r\nThe UK Met Office issue… [+4805 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Holly Thomas", "title": "Opinion: Boris Johnson's greatest disappearing trick of all", "description": "It wasn't so much a starting pistol as a starting squib. Last week, British Prime Minister Boris Johnson stood outside Number 10 and announced his resignation. Closing a speech notable only for its lack of memorable excerpts or emotional resonance, our once i…", "url": "https://www.cnn.com/2022/07/16/opinions/british-prime-minister-race-westminster-thomas/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220706143707-02-boris-johnson-lead-image.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-16T13:51:13Z", "content": "Editors Note: Holly Thomas is a writer and editor based in London. She is morning editor at Katie Couric Media. She tweets @HolstaT. The opinions expressed in this commentary are solely those of the … [+7102 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jamiel Lynch and Rebekah Riess, CNN", "title": "Dust storm causes a 21-vehicle pileup in Montana, killing six", "description": "A dust storm caused a 21-vehicle pileup on Interstate 90 in Big Horn County, Montana, on Friday evening, resulting in six fatalities, according to the Montana Highway Patrol.", "url": "https://www.cnn.com/2022/07/16/us/hardin-montana-dust-storm-crash/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220716042556-01-montana-highway-car-pileup-dust-storm-super-tease.jpg", "publishedAt": "2022-07-16T13:48:53Z", "content": "(CNN)A dust storm caused a 21-vehicle pileup on Interstate 90 in Big Horn County, Montana, on Friday evening, resulting in six fatalities, according to the Montana Highway Patrol.\r\nMontana Attorney G… [+809 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Marianne Garvey", "title": "'Love Is Blind' contestants forced to film drunk, hungry and sleep-deprived, lawsuit claims", "description": "Reality TV started for Jeremy Hartwell, a director at a mortgage company in Chicago, with a direct message on a dating app.", "url": "https://www.cnn.com/2022/07/16/entertainment/love-is-blind-lawsuit/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220715113849-03-love-is-blind-netflix-lawsuit.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-16T13:43:09Z", "content": "Reality TV started for Jeremy Hartwell, a director at a mortgage company in Chicago, with a direct message on a dating app.\r\nSomeone matched with me then very quickly messaged me saying, you know, I … [+5606 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Catherine Thorbecke", "title": "How companies subtly trick users online with 'dark patterns'", "description": "An \"unsubscribe\" option that's a little too hard to find. A tiny box you click, thinking it simply takes you to the next page, but it also grants access to your data. And any number of unexpected charges that appear during checkout that weren't made clearer e…", "url": "https://www.cnn.com/2022/07/16/tech/dark-patterns-what-to-know/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220715134920-20220715-dark-patterns-explainer-gfx.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-16T13:14:49Z", "content": "An unsubscribe option thats a little too hard to find. A tiny box you click, thinking it simply takes you to the next page, but it also grants access to your data. And any number of unexpected charge… [+7312 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kristen Rogers", "title": "Suicide myths debunked", "description": "Society sometimes deems people who die by suicide as selfish, attention-seeking or mentally ill. Experts explain how these falsehoods worsen the stigma, and they debunk common suicide myths.", "url": "https://www.cnn.com/2022/07/16/health/suicide-myths-facts-wellness/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220715174807-holding-hands-stock.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-16T12:34:58Z", "content": "Editors Note: If you or someone you know is struggling with suicidal thoughts or mental health matters, please call the National Suicide Prevention Lifeline at 988 or 800-273-8255 to connect with a t… [+7486 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jamiel Lynch, CNN", "title": "Rapper Kodak Black arrested during a traffic stop in Florida", "description": "Rapper Kodak Black was arrested during a traffic stop in Florida, authorities said Friday.", "url": "https://www.cnn.com/2022/07/16/entertainment/rapper-kodak-black-arrested-florida/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220715224602-kodak-black-file-super-tease.jpg", "publishedAt": "2022-07-16T12:04:02Z", "content": "(CNN)Rapper Kodak Black was arrested during a traffic stop in Florida, authorities said Friday.\r\nBlack, whose real name is Bill K. Kapri, was driving a purple Dodge Durango with an expired license wh… [+1353 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Phil Mattingly, Allie Malloy, Tamara Qiblawi and Celine Alkhaldi, CNN", "title": "MBS fires back at Biden after the President confronts Saudi prince about Khashoggi", "description": "Saudi Arabia's de facto ruler, Crown Prince Mohammed bin Salman, hit back at Joe Biden after the US President confronted him about the 2018 murder of Saudi journalist Jamal Khashoggi during a meeting between the two leaders on Friday, according to a source fa…", "url": "https://www.cnn.com/2022/07/16/middleeast/biden-mbs-khashoggi-abu-akleh-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220715123924-01b-biden-mbs-fist-bump-super-tease.jpg", "publishedAt": "2022-07-16T11:21:11Z", "content": "(CNN)Saudi Arabia's de facto ruler, Crown Prince Mohammed bin Salman, hit back at Joe Biden after the US President confronted him about the 2018 murder of Saudi journalist Jamal Khashoggi during a me… [+5047 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Pete Muntean, Gregory Wallace and Marnie Hunter, CNN", "title": "These US airports are the worst for cancellations and delays this summer", "description": "Summer air travel is a mess, and flight cancellations and delays show no signs of letting up. Find out which airports have the highest numbers of flight disruptions this summer.", "url": "https://www.cnn.com/travel/article/us-airports-most-summer-cancellations-delays/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220715143659-newark-liberty-airport-220701-super-tease.jpg", "publishedAt": "2022-07-16T11:03:22Z", "content": "Pete Muntean, Gregory Wallace and Marnie Hunter, CNNPublished 16th July 2022\r\n(CNN) Summer air travel is a mess, and flight delays and cancellations show no signs of letting up.\r\nUS airlines have can… [+3570 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeremy Herb, CNN", "title": "January 6 committee's investigation stirs up fresh revelations ahead of last planned hearing", "description": "The House January 6 committee corroborated key details involving former President Donald Trump's heated exchange with the Secret Service when Trump was told he could not go to the Capitol -- the latest in a string of shocking revelations that have come from t…", "url": "https://www.cnn.com/2022/07/16/politics/january-6-committee-latest/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220613104923-03-jan-6-hearing-0613-super-tease.jpg", "publishedAt": "2022-07-16T10:01:10Z", "content": "(CNN)The House January 6 committee corroborated key details involving former President Donald Trump's heated exchange with the Secret Service when Trump was told he could not go to the Capitol -- the… [+8308 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Maureen O'Hare, CNN", "title": "The best destinations to visit in 2022 and the best airlines to get there", "description": "In travel news this week, Time Out and TIME have both announced their annual lists of must-visit destinations, while AirlineRatings.com has named the world's best airlines for 2022.", "url": "https://www.cnn.com/travel/article/pandemic-travel-news-best-destinations-2022/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220715112608-travel-nl-0716-top-cities-edinburgh-super-tease.jpg", "publishedAt": "2022-07-16T09:13:58Z", "content": "(CNN) This week in travel news, Time Out and TIME have both announced their annual lists of must-visit destinations, while AirlineRatings.com has named the world's best airlines for 2022. \r\nFirst, Ti… [+2263 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ella Nilsen, CNN", "title": "Democrats fumble on the climate crisis again as US suffers consequences of inaction", "description": "Manchin dealt Democrats' climate agenda its final blow this week, them the chance to pass climate legislation for at least several years.", "url": "https://www.cnn.com/2022/07/16/politics/democrats-climate-failure-manchin/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220715172136-washburn-fire-yosemite-220711-super-tease.jpg", "publishedAt": "2022-07-16T09:02:01Z", "content": "(CNN)After more than a year of painstaking negotiations, congressional Democrats on Thursday night found themselves no further on implementing their ambitious climate agenda than when President Joe B… [+7437 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jacqueline Howard And Veronica Stracqualursi", "title": "988: National Suicide Prevention Lifeline launches new 3-digit number", "description": "To reach the National Suicide Prevention Lifeline for mental health crises, it now takes only three digits: 988.", "url": "https://www.cnn.com/2022/07/16/health/988-national-suicide-prevention-lifeline-launches/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220715084241-person-holding-phone-stock.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-16T08:44:01Z", "content": "To reach the National Suicide Prevention Lifeline for mental health crises, it now takes only three digits: 988.\r\nOn Saturday, Vibrant Emotional Health, the nonprofit that operates the lifeline on be… [+3163 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Zoe Sottile, CNN", "title": "A cat will be finally reunited with her family after spending 3 weeks lost in a Boston airport", "description": "A pet cat who spent a harrowing three weeks on the loose in the Boston Logan International Airport has finally been captured and is set to be reunited with her family.", "url": "https://www.cnn.com/travel/article/boston-logan-airport-cat-rescue-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220715110702-boston-logan-airport-cat-rescue-trnd-super-tease.jpg", "publishedAt": "2022-07-16T07:00:36Z", "content": "The cat, fittingly named \"Rowdy,\" escaped her kennel after the arrival of her Lufthansa flight from Germany on June 24, according to a press release from the airport.\r\nRowdy roamed the airport for a … [+2830 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brad Lendon, CNN", "title": "US Navy challenges Chinese claims in South China Sea for second time in a week", "description": "A US Navy warship on Saturday challenged Chinese claims to disputed islands in the South China Sea, the US 7th Fleet said in a statement -- the second operation of its kind this week.", "url": "https://www.cnn.com/2022/07/16/asia/us-navy-freedom-of-navigation-spratly-islands-south-china-sea-intl-hnk-ml/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220715234546-01-us-navy-freedom-of-navigation-spratly-islands-south-china-sea-super-tease.jpeg", "publishedAt": "2022-07-16T05:03:23Z", "content": "Seoul, South Korea (CNN)A US Navy warship on Saturday challenged Chinese claims to disputed islands in the South China Sea, the US 7th Fleet said in a statement -- the second operation of its kind th… [+2357 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Zoe Sottile", "title": "More than 500 couples got mock-married at Lincoln Center's 'Celebrate Love' event", "description": "The more, the merrier for the 500 couples who got symbolically married at Lincoln Center last weekend.", "url": "https://www.cnn.com/2022/07/16/us/lincoln-center-covid-rewedding-trnd/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220715113206-01-lincoln-center-rewedding-ceremony.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-16T05:00:12Z", "content": "The more, the merrier for the 500 couples who got symbolically married at Lincoln Center last weekend.\r\nAfter more than two years of weddings were canceled, rescheduled, or downsized due to the pande… [+2947 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Taylor Romine, Josh Campbell", "title": "2 suspects arrested following a string of robberies, mostly at 7-Elevens, in the Los Angeles-area", "description": "Two people were arrested Friday in connection with a string of robberies that left two people dead and three others wounded at grocery stores in Southern California, police said.", "url": "https://www.cnn.com/2022/07/16/us/southern-california-robberies-suspects-arrested/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220715232729-03-southern-california-robberies-suspects-arrested.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-16T04:23:10Z", "content": "Two people were arrested Friday in connection with a string of robberies that left two people dead and three others wounded at grocery stores in Southern California, police said. \r\nSix of those seven… [+1640 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kate Sullivan", "title": "Biden to lay out his Middle East strategy on last day of trip to region", "description": "President Joe Biden on Saturday is expected to lay out his vision for the US' engagement in the Middle East at a summit attended by key leaders in the region on the last day of his Middle East swing.", "url": "https://www.cnn.com/2022/07/16/politics/biden-last-day-middle-east-trip/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220715161420-35-biden-saudi-arabia-0715.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-16T04:00:13Z", "content": "President Joe Biden on Saturday is expected to lay out his vision for the US engagement in the Middle East at a summit attended by key leaders in the region on the last day of his Middle East swing.\r… [+2722 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tara Subramaniam and Rey Rodriguez, CNN", "title": "Mexico detains drug lord Rafael Caro Quintero, wanted for killing of US agent", "description": "A notorious drug lord on the FBI's 10 most wanted list has been detained by the Mexican Navy, a Navy source told CNN on Friday.", "url": "https://www.cnn.com/2022/07/15/americas/mexico-rafael-caro-quintero-fbi-arrest-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220715220438-01-rafael-caro-quintero-fbi-arrest-mexico-super-tease.jpg", "publishedAt": "2022-07-16T03:40:15Z", "content": "(CNN)A notorious drug lord on the FBI's 10 most wanted list has been detained by the Mexican Navy, a Navy source told CNN on Friday.\r\nRafael Caro Quintero, known as the \"narco of drug traffickers,\" i… [+895 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Amanda Musa, CNN", "title": "Transgender swimmer Lia Thomas nominated for NCAA 2022 Woman of the Year Award", "description": "The University of Pennsylvania nominated swimmer Lia Thomas -- who has become the face of the debate on transgender women in sports -- for the 2022 NCAA Woman of the Year award.", "url": "https://www.cnn.com/2022/07/15/sport/lia-thomas-ncaa-woman-of-the-year-nomination/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220715222852-lia-thomas-file-012222-super-tease.jpg", "publishedAt": "2022-07-16T03:05:37Z", "content": "(CNN)The University of Pennsylvania nominated swimmer Lia Thomas -- who has become the face of the debate on transgender women in sports -- for the 2022 NCAA Woman of the Year award. \r\nThe Ivy League… [+2320 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Zachary Cohen", "title": "January 6 committee subpoenas Secret Service for records", "description": "The House select committee investigating January 6, 2021, has issued a subpoena to the US Secret Service, marking the first time the panel has publicly done so for an executive branch agency.", "url": "https://www.cnn.com/2022/07/15/politics/january-6-committee-subpoena-secret-service-records/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220711150822-jan-6-hearing-0623-super-tease.jpg", "publishedAt": "2022-07-16T02:56:31Z", "content": "(CNN)The House select committee investigating January 6, 2021, has issued a subpoena to the US Secret Service, marking the first time the panel has publicly done so for an executive branch agency. \r\n… [+42 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Natasha Bertrand, CNN", "title": "Exclusive: Russians have visited Iran at least twice in last month to examine weapons-capable drones", "description": "A Russian delegation has visited an airfield in central Iran at least twice in the last month to examine weapons-capable drones, according to national security adviser Jake Sullivan and satellite imagery obtained exclusively by CNN.", "url": "https://www.cnn.com/2022/07/15/politics/russian-visit-iran-weapons-capable-drones/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220715182126-russians-in-iran-drones-super-tease.jpg", "publishedAt": "2022-07-16T02:02:50Z", "content": "(CNN)A Russian delegation has visited an airfield in central Iran at least twice in the last month to examine weapons-capable drones, according to national security adviser Jake Sullivan and satellit… [+2353 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Raja Razek and Hannah Sarisohn, CNN", "title": "Pulitzer Prize-winning journalist and creator of the '1619 Project' reaches settlement with University of North Carolina", "description": "Pulitzer Prize-winning journalist and creator of the \"1619 Project,\" whose tenure last year was initially denied by the University of North Carolina board of trustees despite a recommendation by the tenure committee, has reached a settlement with the UNC over…", "url": "https://www.cnn.com/2022/07/15/us/nikole-hannah-jones-university-of-north-carolina-settlement/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220715213153-nikole-hannah-jones-file-070621-super-tease.jpg", "publishedAt": "2022-07-16T01:41:28Z", "content": "(CNN)Pulitzer Prize-winning journalist and creator of the \"1619 Project,\" whose tenure last year was initially denied by the University of North Carolina board of trustees despite a recommendation by… [+2220 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Betsy Klein, CNN", "title": "Biden scraps plans to nominate conservative anti-abortion lawyer to federal judgeship", "description": "The White House has scrapped President Joe Biden's plans to nominate an anti-abortion Republican as a federal judge in Kentucky, citing opposition to the nomination from Kentucky Republican Sen. Rand Paul.", "url": "https://www.cnn.com/2022/07/15/politics/kentucky-conservative-anti-abortion-federal-judgeship-biden/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220710202956-joe-biden-white-house-0708-super-tease.jpg", "publishedAt": "2022-07-16T01:05:42Z", "content": "(CNN)The White House has scrapped President Joe Biden's plans to nominate an anti-abortion Republican as a federal judge in Kentucky, citing opposition to the nomination from Kentucky Republican Sen.… [+2965 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Heather Chen, CNN", "title": "Sri Lanka crisis: How do you fix a broken country?", "description": "Gotabaya Rajapaksa may be gone, but Sri Lanka is still struggling with a ruinous financial crisis, and experts said things are likely to get worse before they get better.", "url": "https://www.cnn.com/2022/07/15/asia/sri-lanka-crisis-economy-fix-gotabaya-rajapaksa-saturday-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220714232139-02-sri-lanka-crisis-how-do-you-fix-a-broken-country-restricted-super-tease.jpg", "publishedAt": "2022-07-16T00:53:24Z", "content": "By Heather Chen, CNN\r\nUpdated 8:53 PM ET, Fri July 15, 2022\r\n (CNN)For years it had been one of Sri Lanka's grandest and most heavily guarded buildings, serving as the official residence and state of… [+10719 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Topher Gauk-Roger", "title": "Judge revokes indicted Colorado clerk Tina Peters' arrest warrant", "description": "A Colorado judge on Friday quashed an arrest warrant for indicted Mesa County clerk Tina Peters, a leading election denier who lost last month's Republican primary for secretary of state, after she allegedly violated the terms of her bond.", "url": "https://www.cnn.com/2022/07/15/politics/tina-peters-arrest-warrant-bond-violation/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220715163926-02-tina-peters-0728.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-16T00:31:09Z", "content": "A Colorado judge on Friday quashed an arrest warrant for indicted Mesa County clerk Tina Peters, a leading election denier who lost last months Republican primary for secretary of state, after she al… [+1545 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Andrew Millman, CNN", "title": "Former Overstock CEO testifies to January 6 committee for nearly 8 hours", "description": "Former Overstock CEO Patrick Byrne, an ally of former President Donald Trump, testified behind closed doors before the House select committee investigating January 6, 2021, for nearly eight hours on Friday.", "url": "https://www.cnn.com/2022/07/15/politics/former-overstock-ceo-testifies-january-6-committee/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220712184229-patrick-byrn-super-tease.jpg", "publishedAt": "2022-07-16T00:28:41Z", "content": "(CNN)Former Overstock CEO Patrick Byrne, an ally of former President Donald Trump, testified behind closed doors before the House select committee investigating January 6, 2021, for nearly eight hour… [+1377 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "William Han", "title": "Opinion: 'I am part of a dying breed of Taiwanese'", "description": "The war in Ukraine has touched off a wave of soul-searching in Taiwan. For William Han, one of Taiwan's ethnic minority \"waishengren,\" it has also underlined a \"dying breed\" holding fast to their Chinese heritage.", "url": "https://www.cnn.com/2022/07/15/opinions/taiwan-independence-china-ukraine-war-intl-hnk-han/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220707141934-ing-ning-john-han.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-16T00:06:40Z", "content": "Editors Note: William Han (@w_t_han) is a writer and lawyer. His book From the Wall to the Water will be published in September. The views expressed in this commentary are his own. View more opinion … [+6998 chars]"}]}