{"status": "ok", "totalResults": 63, "articles": [{"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Joshua A. Douglas", "title": "Opinion: The dangerous election theory the Supreme Court may be poised to endorse", "description": "The US Supreme Court is poised to take up a case with the potential to profoundly reshape American life -- this time at the ballot box. The case, Moore v. Harper, could make it easier for political incumbents to entrench themselves in office and could even pu…", "url": "https://www.cnn.com/2022/07/07/opinions/supreme-court-2024-elections-north-carolina-douglas/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220520094415-us-supreme-court-building-0503-super-tease.jpg", "publishedAt": "2022-07-08T00:34:16Z", "content": "Joshua A. Douglas is a professor at the University of Kentucky J. David Rosenberg College of Law. He is the author of Vote for US: How to Take Back Our Elections and Change the Future of Voting. Foll… [+7782 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Joe Sutton and Christina Maxouris, CNN", "title": "An 8-year-old boy is paralyzed from the waist down after getting shot in the chest in Highland Park parade attack", "description": "An 8-year-old boy who was attending the Highland Park Fourth of July parade with his parents and twin brother was shot and is now paralyzed from the waist down, family spokesperson Anthony Loizzi told CNN on Thursday.", "url": "https://www.cnn.com/2022/07/07/us/highland-park-shooting-cooper-roberts-8-year-old-paralyzed/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220707145149-cooper-roberts-highland-park-critical-condition-super-tease.jpg", "publishedAt": "2022-07-07T23:27:04Z", "content": "(CNN)An 8-year-old boy who was attending the Highland Park Fourth of July parade with his parents and twin brother was shot and is now paralyzed from the waist down, family spokesperson Anthony Loizz… [+3430 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Zachary B. Wolf, CNN", "title": "IRS audits: Strange coincidence or new enemies list?", "description": "It's the most bizarre coincidence: two former top FBI officials, former Director James Comey and his deputy Andrew McCabe, were both audited by the IRS after they were fired by the Trump administration.", "url": "https://www.cnn.com/2022/07/07/politics/irs-audits-comey-mccabe-what-matters/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220414172140-01-2021-us-tax-form-1040-stock-super-tease.jpeg", "publishedAt": "2022-07-07T22:52:08Z", "content": "A version of this story appeared in CNN's What Matters newsletter. To get it in your inbox, sign up for free here. \r\n (CNN)It's the most bizarre coincidence: two former top FBI officials, former Dire… [+6374 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Megan Thomas", "title": "Hugh Grant encouraged British demonstrators to blast 'Benny Hill' theme song -- and they did", "description": "Actor Hugh Grant sought a little humor in response to British Prime Minister Borris Johnson's announcement Thursday that he will resign and found it in the most brilliant way.", "url": "https://www.cnn.com/2022/07/07/entertainment/hugh-grant-benny-hill/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220707171929-steve-bray-downing-street-0707-restricted.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-07T22:17:43Z", "content": "Actor Hugh Grant sought a little humor in response to British Prime Minister Borris Johnsons announcement Thursday that he will resign and found it in the most brilliant way.\r\nGrant posted a tweet, t… [+1161 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rachel Fadem, CNN", "title": "Rates of childhood obesity have increased, study finds", "description": "Childhood obesity is becoming more common and beginning at younger ages, according to a recent study.", "url": "https://www.cnn.com/2022/07/07/health/childhood-obesity-increase-study-wellness/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220706124112-childhood-obesity-increase-study-wellness-stock-super-tease.jpg", "publishedAt": "2022-07-07T22:15:41Z", "content": "(CNN)Despite national school and community-based efforts to promote healthy behaviors at a young age, childhood obesity is becoming more common in the United States, a recent study found. \r\nThe resea… [+6872 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Betsy Klein, CNN", "title": "About 300,000 children under 5 have received at least one Covid-19 shot, White House says", "description": "Approximately 300,000 children under the age of 5 in the US -- about 2% of that age group -- have received at least one shot of the Covid-19 vaccine since it was recommended by the US Centers for Disease Control and Prevention last month, a senior White House…", "url": "https://www.cnn.com/2022/07/07/politics/covid-19-vaccine-children-under-5/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220707175508-covid-19-vaccine-under-five-file-062122-super-tease.jpg", "publishedAt": "2022-07-07T22:04:12Z", "content": "(CNN)Approximately 300,000 children under the age of 5 in the US -- about 2% of that age group -- have received at least one shot of the Covid-19 vaccine since it was recommended by the US Centers fo… [+5938 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Julian Zelizer", "title": "Opinion: Boris Johnson's legacy will endure -- just look at Trump", "description": "Julian Zelizer asks, \"Does Boris Johnson's downfall mark the end of an era?\"", "url": "https://www.cnn.com/2022/07/07/opinions/boris-johnson-resignation-legacy-trump-remake-parties-zelizer/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220707125520-05-boris-johnson-resignation-0707.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-07T21:41:24Z", "content": "Editors Note: Julian Zelizer, a CNN political analyst, is a professor of history and public affairs at Princeton University. He is the author and editor of 24 books, including, The Presidency of Dona… [+5195 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Clarissa Ward, Brent Swails and Scott McWhinnie, CNN", "title": "Mothers are having to bury their children as fears of famine hang over Somalia", "description": "Somalia's children are dying as the effects of drought, disease and distant war ravage the country. In one camp, CNN talks to mothers who don't have time to grieve.", "url": "https://www.cnn.com/2022/07/07/africa/somalia-famine-children-dying-ward/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220706124900-03-somalia-crisis-super-tease.jpg", "publishedAt": "2022-07-07T21:39:46Z", "content": "By Clarissa Ward, Brent Swails and Scott McWhinnie, CNN\r\nUpdated 5:51 PM ET, Thu July 7, 2022\r\nMogadishu, Somalia (CNN)Ijabu Hassan has had no chance to grieve the deaths of her children. She's had t… [+5165 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Allie Torgan, CNN", "title": "With food prices rising, this urban farmer is on a mission to help thousands of people grow their own", "description": "Bobby Wilson's Metro Atlanta Urban Farm has taught thousands of people how to plant, grow and prepare fresh produce.", "url": "https://www.cnn.com/2022/07/07/us/georgia-urban-farming-hunger-food-deserts-cnnheroes/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220707170436-bobby-wilson-smiling-new-2-super-tease.jpg", "publishedAt": "2022-07-07T21:23:54Z", "content": "Know someone who inspires you? Click here to nominate them as a CNN Hero.\r\n (CNN)In the state of Georgia, where one in eight people face hunger, one farmer has made it his mission not only to feed th… [+3751 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paradise Afshar and Alaa Elassar, CNN", "title": "Officers were justified in the fatal shooting of Charleena Lyles, a pregnant mother of 4, jury finds", "description": "Seattle police officers were justified in the fatal shooting of Charleena Lyles, a pregnant mother of four who was shot and killed in her home by police in 2017, an inquest jury concluded Wednesday.", "url": "https://www.cnn.com/2022/07/07/us/charleena-lyles-jury-officers-justified/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220707135310-charleena-lyles-memorial-file-super-tease.jpg", "publishedAt": "2022-07-07T21:19:50Z", "content": "(CNN)Seattle police officers were justified in the fatal shooting of Charleena Lyles, a pregnant mother of four who was shot and killed in her home by police in 2017, an inquest jury concluded Wednes… [+2918 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Whitney Wild, CNN", "title": "Secret Service Director Murray to retire at the end of July", "description": "US Secret Service Director James Murray, who has served in the role under President Joe Biden and former President Donald Trump, will retire July 30, according to the agency.", "url": "https://www.cnn.com/2022/07/07/politics/james-murray-secret-service-retirement/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210512112623-secret-service-director-james-murray-super-tease.jpg", "publishedAt": "2022-07-07T21:07:21Z", "content": "Washington (CNN)US Secret Service Director James Murray, who has served in the role under President Joe Biden and former President Donald Trump, will retire July 30, according to the agency. \r\nMurray… [+1900 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "W. Ralph Eubanks", "title": "Opinion: How Mississippi set off a firestorm far beyond its borders", "description": "The South is America's mirror, a region that reflects ideas about this country that many of us would rather not see reflected in our own visage. While not an ideological monolith, the South's influence on American political culture is nonetheless larger than …", "url": "https://www.cnn.com/2022/07/07/opinions/mississippi-abortion-pink-house-eubanks/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220707140117-01-ms-abortion-eubanks-opinion-super-tease.jpg", "publishedAt": "2022-07-07T21:04:05Z", "content": "W. Ralph Eubanks is the author of the new book \"A Place Like Mississippi: A Journey Through a Real and Imagined Literary Landscape\" (Timber Press), as well as \"Ever Is a Long Time\" and \"The House at … [+9416 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jeremy Herb", "title": "Zelensky says Ukraine will not give up territory for peace with Russia: 'This is our land'", "description": "Ukrainian President Volodymyr Zelensky told CNN's Wolf Blitzer on Thursday that Ukraine is unwilling to cede any of its land to Russia, standing firm that a concession of Ukrainian territory won't be part of any diplomatic negotiations to end the war.", "url": "https://www.cnn.com/2022/07/07/politics/volodymyr-zelensky-interview-cnntv/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220707140343-01-zelensky-interview.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-07T21:00:14Z", "content": "Ukrainian President Volodymyr Zelensky told CNNs Wolf Blitzer on Thursday that Ukraine is unwilling to cede any of its land to Russia, standing firm that a concession of Ukrainian territory wont be p… [+5572 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Tami Luhby, CNN", "title": "Black and Hispanic Americans are getting hit harder by inflation. Here's why", "description": "Many Americans are struggling to cope with higher prices for food, gas, housing and other essentials. But inflation has taken an even heavier toll on certain segments of the population.", "url": "https://www.cnn.com/2022/07/07/economy/inflation-black-hispanic-americans/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220706165125-inflation-impact-super-tease.jpg", "publishedAt": "2022-07-07T20:03:30Z", "content": "New York (CNN Business)Many Americans are struggling to cope with higher prices for food, gas, housing and other essentials. But inflation has taken an even heavier toll on certain segments of the po… [+3649 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kate Sullivan", "title": "White House staff joined call with Paul Whelan's sister after she ripped Biden administration", "description": "White House staff joined a call with Elizabeth Whelan on Wednesday to discuss her brother Paul Whelan's detainment in Russia after she told CNN she was furious that President Joe Biden had not spoken with her family.", "url": "https://www.cnn.com/2022/07/07/politics/elizabeth-whelan-white-house-call/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220706180847-elizabeth-whelan-lead.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-07T20:02:06Z", "content": "White House staff joined a call with Elizabeth Whelan on Wednesday to discuss her brother Paul Whelans detainment in Russia after she told CNN she was furious that President Joe Biden had not spoken … [+3134 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jessica Dean and Ali Zaslav, CNN", "title": "Senate Democrats reach agreement to close tax loophole in next step toward broader deal", "description": "Senate Democrats have finalized an agreement to close a tax loophole in order to extend the solvency of Medicare, according to a source familiar with the agreement, in another step forward on their economic and prescription drug package.", "url": "https://www.cnn.com/2022/07/07/politics/senate-agreement-tax-loophole-medicare/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210205121011-07-chuck-schumer-file-super-tease.jpg", "publishedAt": "2022-07-07T19:36:27Z", "content": "(CNN)Senate Democrats have finalized an agreement to close a tax loophole in order to extend the solvency of Medicare, according to a source familiar with the agreement, in another step forward on th… [+1544 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sara Ashley O'Brien, CNN Business", "title": "The rise and fall of Theranos: A timeline", "description": "Four years after the top two Theranos executives, Elizabeth Holmes and Ramesh \"Sunny\" Balwani, were first indicted together on a dozen federal fraud charges stemming from their time heading up the failed blood testing startup, both have been convicted by juri…", "url": "https://www.cnn.com/2022/07/07/tech/theranos-rise-and-fall/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220617160734-02-file-elizabeth-holmes-ramesh-sunny-balwani-split-super-tease.jpg", "publishedAt": "2022-07-07T19:27:58Z", "content": "(CNN)Four years after the top two Theranos executives, Elizabeth Holmes and Ramesh \"Sunny\" Balwani, were first indicted together on a dozen federal fraud charges stemming from their time heading up t… [+14165 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rebekah Riess", "title": "Mother drowns her 3 children in a murder-suicide following husband's suicide, sheriff's office says", "description": "A mother and her three children whose bodies were found in a Minnesota lake over the weekend died in a murder-suicide, sheriff's investigators said Thursday -- and their deaths apparently followed the suicide of the children's father.", "url": "https://www.cnn.com/2022/07/07/us/minnesota-children-drowned/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220707122647-01-minnesota-children-drowned.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-07T18:58:47Z", "content": "A mother and her three children whose bodies were found in a Minnesota lake over the weekend died in a murder-suicide, sheriffs investigators said Thursday and their deaths apparently followed the su… [+2143 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Henry Fernandez for CNN Business Perspectives", "title": "Opinion: 4 ways governments can encourage businesses to meaningfully lower their carbon emissions", "description": "As of May 31, only 11% of the 9,000-plus companies in the MSCI All Country World Investable Market Index were aligned with a 1.5-degree pathway, according to the MSCI Net-Zero Tracker, which monitors carbon emissions and other climate metrics among listed com…", "url": "https://www.cnn.com/2022/07/07/perspectives/msci-ceo-climate-business-government/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220707140929-carbon-emissions-global-economy-file-super-tease.jpg", "publishedAt": "2022-07-07T18:16:11Z", "content": "Henry Fernandez is chairman and CEO of MSCI. The opinions expressed in this commentary are his own.\r\nIf the world hopes to limit the increase in global temperatures to 1.5 degrees Celsius the level s… [+5953 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Brandon Griggs", "title": "James Caan, Oscar-nominated actor of 'The Godfather,' 'Misery' and \"Elf,' dies at 82", "description": "James Caan, the veteran screen actor known for his work in such films as \"The Godfather,\" \"Misery\" and \"Elf,\" has died, his family said in a statement on his verified Twitter account. He was 82.", "url": "https://www.cnn.com/2022/07/07/entertainment/james-caan-dies/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220707132754-04-james-caan-roles-godfather-super-tease.jpg", "publishedAt": "2022-07-07T17:35:02Z", "content": "(CNN)James Caan, the veteran screen actor known for his work in such films as \"The Godfather,\" \"Misery\" and \"Elf,\" has died, his family said in a statement on his verified Twitter account. He was 82.… [+319 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kara Scannell, CNN", "title": "IRS chief refers Comey, McCabe audit decision to inspector general for review", "description": "The head of the Internal Revenue Service has asked a watchdog to investigate the decision to conduct rare tax audits of former FBI Director James Comey and former FBI Deputy Director Andrew McCabe, the agency announced Thursday.", "url": "https://www.cnn.com/2022/07/07/politics/internal-revenue-service-inspector-general-probe-comey-mccabe/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220707074017-mccabe-comey-split-super-tease.jpg", "publishedAt": "2022-07-07T17:16:45Z", "content": "Washington (CNN)The head of the Internal Revenue Service has asked a watchdog to investigate the decision to conduct rare tax audits of former FBI Director James Comey and former FBI Deputy Director … [+1420 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/joe-ruiz\">Joe Ruiz</a>, JiMin Lee, and <a href=\"/profiles/maegan-vazquez\">Maegan Vazquez</a>, CNN", "title": "Biden to award Medal of Freedom to 17 recipients", "description": "President Biden will award 17 people, including Olympic gymnast Simone Biles, former Rep. Gabby Giffords and actor Denzel Washington with the United States' highest civilian honor. Follow for news updates.", "url": "https://www.cnn.com/politics/live-news/presidential-medal-of-freedom-awards-2022/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220701145806-medal-of-freedom-split-2-super-tease.jpg", "publishedAt": "2022-07-07T16:59:36Z", "content": "Olympic athletes Simone Biles and Megan Rapinoe are set to become the fifth and sixth female athletes to be honored for the Medal of Freedom. \r\nRapinoe will be the first female soccer player to recei… [+1765 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Analysis by Harry Enten, CNN", "title": "Why Liz Cheney is in a lot of trouble in Wyoming", "description": "Rep. Liz Cheney has become an unexpected hero for Democrats. She was one of the few Republicans to vote to impeach President Donald Trump last year, has served as one of his most vocal critics in the GOP and is the vice chair of the House select committee inv…", "url": "https://www.cnn.com/2022/07/07/politics/liz-cheney-wyoming-republican-donald-trump/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220630095532-01-cheney-hearing-0628-super-tease.jpg", "publishedAt": "2022-07-07T16:38:31Z", "content": "(CNN)Rep. Liz Cheney has become an unexpected hero for Democrats. She was one of the few Republicans to vote to impeach President Donald Trump last year, has served as one of his most vocal critics i… [+4614 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Elise Hammond, <a href=\"/profiles/aditi-sandal\">Aditi Sangal</a>, Maureen Chowdhury and <a href=\"/profiles/adrienne-vogt\">Adrienne Vogt</a>, CNN", "title": "Derek Chauvin to be sentenced on federal charges for George Floyd's murder", "description": "Former Minneapolis police officer Derek Chauvin will be sentenced for federal civil rights violations in the killing of George Floyd. Follow here for the latest live news updates.", "url": "https://www.cnn.com/us/live-news/derek-chauvin-federal-sentencing-07-07-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210625155434-08-chauvin-sentencing-0625-super-tease.jpg", "publishedAt": "2022-07-07T16:00:20Z", "content": "Former Minneapolis police officer Derek Chauvin, already jailed on state murder charges for his role in the death of George Floyd, will learn his federal sentence Thursday when he appears in a US Dis… [+2148 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": null, "title": "Six injured as controversial bull run returns to Spain's Pamplona", "description": "Half a dozen people, including a 30-year-old man from the US city of Atlanta, were taken to hospital after the first running of the bulls in three years kicked off in Spain's Pamplona.", "url": "https://www.cnn.com/travel/article/six-injured-as-controversial-bull-run-returns-to-spains-pamplona/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220707100429-02-spain-pamplona-bull-running-7-injured-0707-super-tease.jpg", "publishedAt": "2022-07-07T15:41:26Z", "content": "(CNN) Half a dozen people, including a 30-year-old man from the US city of Atlanta, were taken to hospital after the first running of the bulls in three years kicked off in Spain's Pamplona.\r\nNone of… [+1339 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kate Sullivan, CNN", "title": "Biden to honor 17 people with the Medal of Freedom", "description": "President Joe Biden on Thursday will award the presidential Medal of Freedom to 17 people, including Olympic gymnast Simone Biles, Academy Award-winning actor Denzel Washington, former congresswoman Gabrielle Giffords, and, posthumously, Apple co-founder Stev…", "url": "https://www.cnn.com/2022/07/07/politics/biden-presidential-medal-of-freedom/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220701145806-medal-of-freedom-split-2-super-tease.jpg", "publishedAt": "2022-07-07T15:34:59Z", "content": "(CNN)President Joe Biden on Thursday will award the presidential Medal of Freedom to 17 people, including Olympic gymnast Simone Biles, Academy Award-winning actor Denzel Washington, former congressw… [+2631 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alicia Wallace", "title": "Friday's jobs report could be telling as recession worries mount", "description": "Economic uncertainty and recession fears have yet to take the shine off a robust labor market, but investors and Federal Reserve officials will be carefully parsing the details of Friday's jobs report for any sign of softening.", "url": "https://www.cnn.com/2022/07/07/economy/june-jobs-report-preview/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220705222829-job-candidates-file-052122.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-07T15:07:00Z", "content": "MinneapolisCNN Business\r\n  — \r\nEconomic uncertainty and recession fears have yet to take the shine off a robust labor market, but investors and Federal Reserve officials will be carefully parsing the… [+3571 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jordan Valinsky", "title": "GameStop shares are about to get much cheaper", "description": "GameStop shares will soon lose three quarters of their value. But don't worry: It's good news for stockholders.", "url": "https://www.cnn.com/2022/07/07/business/gamestop-stock-split/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220124153304-gamestop-store-1208-file.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-07T14:52:26Z", "content": "GameStop shares will soon lose three quarters of their value. But dont worry: Its good news for stockholders.\r\nThe company announced Wednesday that its board approved a 4-for-1 stock split, effective… [+1715 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chloe Melas, CNN", "title": "William Friend, husband of 'One Tree Hill' star Bevin Prince, dead at 33", "description": "William Friend, the husband of \"One Tree Hill\" star Bevin Prince, died unexpectedly  over the weekend, according to a statement Bisnow Media, a commercial real estate media company, for which he served as CEO. He was 33.", "url": "https://www.cnn.com/2022/07/07/entertainment/bevin-prince-husband-obit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220707102728-bevin-prince-william-friend-restricted-super-tease.jpg", "publishedAt": "2022-07-07T14:45:17Z", "content": "(CNN)William Friend, the husband of \"One Tree Hill\" star Bevin Prince, died unexpectedly over the weekend, according to a statement Bisnow Media, a commercial real estate media company, for which he … [+1543 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oscar Holland, CNN", "title": "A photographer cataloged all 12,795 items in her house. This is what she found", "description": "After going through a divorce and moving home for the 11th time, Barbara Iweins decided to take stock of her life -- and everything in it.", "url": "https://www.cnn.com/style/article/barbara-iweins-photo-series-katalog-arles/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220707083158-13-barbara-iweins-katalog-super-tease.jpg", "publishedAt": "2022-07-07T14:42:08Z", "content": "arts\r\nAfter going through a divorce and moving home for the 11th time, Barbara Iweins decided to take stock of her life -- and everything in it.\r\nGoing from room to room, she spent almost five years … [+4014 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Chris Cillizza", "title": "It's *very* hard to see the Comey and McCabe audits as a coincidence", "description": "Rule one of politics goes like this: There's no such thing as coincidences.", "url": "https://www.cnn.com/2022/07/07/politics/comey-mccabe-trump-tax-audit/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/181209143047-comey-1207.jpg?q=x_0,y_122,h_1319,w_2344,c_crop/w_800", "publishedAt": "2022-07-07T14:40:15Z", "content": "Rule one of politics goes like this: Theres no such thing as coincidences. \r\nSo, when a politician from, say, Illinois just happens to find himself in New Hampshire, its not a coincidence. Or when th… [+3430 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Marnie Hunter, CNN", "title": "Landmark 112-year-old Nashville hotel reveals lavish makeover", "description": "Billed as Nashville's third skyscraper and the city's first million-dollar hotel when it opened in 1910, The Hermitage has recently unveiled the results of a lavish multi-year restoration and redesign.", "url": "https://www.cnn.com/travel/article/hermitage-hotel-nashville-redesign/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220706160852-01-body-hermitage-hotel-nashville-redesign-super-tease.jpg", "publishedAt": "2022-07-07T14:13:21Z", "content": "(CNN) Billed as Nashville's third skyscraper and the city's first million-dollar hotel when it opened in 1910, The Hermitage has endured for more than a century in Tennessee's changing capital.\r\nAnd … [+2293 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kyung Lah, CNN", "title": "Arizona Gov. Doug Ducey endorses rival to Trump-backed candidate in GOP gubernatorial primary", "description": "Arizona Gov. Doug Ducey has endorsed Republican candidate Karrin Taylor Robson in the race to succeed him as the top executive in the critical battleground state, putting him at odds with former President Donald Trump, who is backing former television anchor …", "url": "https://www.cnn.com/2022/07/07/politics/doug-ducey-trump-arizona-karrin-taylor-robson/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220707094629-doug-ducey-arizona-1221-file-super-tease.jpg", "publishedAt": "2022-07-07T13:54:39Z", "content": "(CNN)Arizona Gov. Doug Ducey has endorsed Republican candidate Karrin Taylor Robson in the race to succeed him as the top executive in the critical battleground state, putting him at odds with former… [+2489 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Review by Brian Lowry, CNN", "title": "'Black Bird' captures the cat-and-mouse game around catching a serial killer", "description": "Taron Egerton stars as a jailhouse informant in one of Ray Liotta's last roles on Apple TV+.", "url": "https://www.cnn.com/2022/07/07/entertainment/black-bird-review/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220705165329-02-black-bird-apple-tv-super-tease.jpg", "publishedAt": "2022-07-07T13:28:07Z", "content": "(CNN)A taut true-crime tale, \"Black Bird\" delivers a tense and mostly compelling game of cat and mouse, finding a new avenue into the well-worn world of serial killers via a jailhouse informant despe… [+2864 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sara Murray, CNN", "title": "Michigan GOP gubernatorial hopeful remains defiant ahead of court hearing related to January 6 charges", "description": "Michigan Republican gubernatorial hopeful Ryan Kelley, a day before he was set to appear in federal court on charges related to his presence at the January 6, 2021, Capitol riot, continued to spread lies about the 2020 election and defended his appearance at …", "url": "https://www.cnn.com/2022/07/07/politics/ryan-kelley-january-6/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220707091428-ryan-kelley-michigan-0622-super-tease.jpg", "publishedAt": "2022-07-07T13:27:08Z", "content": "(CNN)Michigan Republican gubernatorial hopeful Ryan Kelley, a day before he was set to appear in federal court on charges related to his presence at the January 6, 2021, Capitol riot, continued to sp… [+1639 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Van Jones and Nisha Anand", "title": "Opinion: A Supreme Court ruling for those who believe in second chances", "description": "One much overlooked decision from the just-concluded Supreme Court term broke with the familiar conservative-liberal divide. In Concepcion v. United States, the Court's three liberal justices were joined by conservatives Clarence Thomas and Neil Gorsuch in a …", "url": "https://www.cnn.com/2022/07/07/opinions/supreme-court-concepcion-sentencing-rehabilitation-jones-anand/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220520094415-us-supreme-court-building-0503-super-tease.jpg", "publishedAt": "2022-07-07T13:18:31Z", "content": "CNN host Van Jones is the founder and a board member at Dream Corps, a national nonprofit organization working at the intersection of criminal justice reform, green economics and tech equity. Nisha A… [+4924 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Scottie Andrew, CNN", "title": "How Jane Foster became Thor in Marvel comics", "description": "Before you watch Natalie Portman as a super-powered Jane Foster in \"Thor: Love and Thunder,\" catch up on her comic book origins.", "url": "https://www.cnn.com/2022/07/07/entertainment/thor-love-thunder-jane-foster-natalie-portman-cec/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220704103744-natalie-portman-thor-love-and-thunder-restricted-super-tease.jpg", "publishedAt": "2022-07-07T13:17:07Z", "content": "(CNN)Depending on who you ask, the \"Thor\" films are either a love story about a boy and his hammer -- or the love between a boy and his brother, or a boy and a brilliant, beautiful scientist or, more… [+3807 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rosa Prince", "title": "Opinion: Boris Johnson's empire of lies has finally collapsed", "description": "For British Prime Minister Boris Johnson, \"lying is a habit as natural to him as telling the truth comes easily to most people and, with the confidence of his background, telling bare-faced untruths has never seemed incompatible with serving at the highest le…", "url": "https://www.cnn.com/2022/07/07/opinions/boris-johnson-resignation-lies-scandals-prince/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220707044734-02-boris-johnson-resignation-file.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-07T12:30:41Z", "content": "Editors Note: Rosa Prince is editor of The House magazine. She is the former assistant political editor of The Daily Telegraph and author of the books Theresa May: The Enigmatic Prime Minister and Co… [+6950 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Dana Santas", "title": "What you need to know about your low back pain", "description": "If you're suffering from low back pain or have grappled with it in the past, you're not alone.", "url": "https://www.cnn.com/2022/07/07/health/low-back-pain-relief-causes-wellness/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220601200511-01-low-back-pain-wellness-stock.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-07T12:25:14Z", "content": "Editors Note: Join Dana Santas for a four-part series to learn how you can recover from and prevent low back pain. Santas, known as the Mobility Maker, is a certified strength and conditioning specia… [+8565 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Terry Ward, CNN", "title": "The secret stretch of coastal France that's nicer than Nice", "description": "Think of the south of France and the lavender fields of Provence and tony spots along the Côte d'Azur likely spring to mind. But in the region of Occitanie, the department of Aude and the coastal city of Narbonne and surrounds offer up a different, more relax…", "url": "https://www.cnn.com/travel/article/occitanie-narbonne-france/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220705093154-03-narbonne-occitanie-france-gruissan-super-tease.jpg", "publishedAt": "2022-07-07T12:05:24Z", "content": "(CNN) Think of the south of France and postcard images of the lavender fields of Provence and tony spots with yachts -- Nice, Cannes and St. Tropez -- likely spring to mind. \r\nBut look at a map of Fr… [+10015 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rishi Iyengar, CNN Business", "title": "The balance of power is shifting in the tech industry", "description": "For much of the past decade, tech companies have showered their corporate employees with money and lavish perks to attract and retain talent in a hyper-competitive industry. That dynamic only kicked into overdrive the past couple of years amid a pandemic-fuel…", "url": "https://www.cnn.com/2022/07/07/tech/tech-layoffs-workers-silicon-valley/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220705160846-bay-area-commute-restricted-super-tease.jpg", "publishedAt": "2022-07-07T11:35:00Z", "content": "San Francisco (CNN Business)For much of the past decade, tech companies have showered their corporate employees with money and lavish perks to attract and retain talent in a hyper-competitive industr… [+5553 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nicole Goodkind", "title": "Cotton's plunge: Recession warning or just another market mess?", "description": "Cotton: it's the touch, the feel, the fabric of our lives. It's also in the middle of what economists are calling a \"market bloodbath\" and in desperate need of a \"tourniquet to stop the bleeding.\"", "url": "https://www.cnn.com/2022/07/07/investing/premarket-stocks-trading/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220706180912-cotton-prices.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-07T11:31:02Z", "content": "Cotton: its the touch, the feel, the fabric of our lives. Its also in the middle of what economists are calling a market bloodbath and in desperate need of a tourniquet to stop the bleeding. \r\nEach d… [+6384 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ben Church, CNN", "title": "Tennis star Nick Kyrgios found it 'hard' to focus on match amid assault allegations", "description": "Tennis star Nick Kyrgios says ongoing allegations of assault made it \"hard\" to focus on his quarterfinal match at Wimbledon on Wednesday.", "url": "https://www.cnn.com/2022/07/07/tennis/nick-kyrgios-assault-allegations-tennis-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220707120505-kyrgios-card-super-tease.jpg", "publishedAt": "2022-07-07T11:23:40Z", "content": "(CNN)Tennis star Nick Kyrgios says ongoing allegations of assault made it \"hard\" to focus on his quarterfinal match at Wimbledon on Wednesday.\r\nThe Australian, who beat Chile's Cristian Garín in stra… [+2978 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Alexandra Meeks, CNN", "title": "5 things to know for July 7: Boris Johnson, Parade shooting, Ukraine, Monkeypox, Debt", "description": "Here's what else you need to know to Get Up to Speed and On with Your Day.", "url": "https://www.cnn.com/2022/07/07/us/five-things-july-7-trnd/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220707081949-01-boris-johnson-pmqs-070622-super-tease.jpg", "publishedAt": "2022-07-07T10:55:38Z", "content": "(CNN)Corporate life has changed significantly since the 1990s: Long gone are the days of boxy computers and fax machines. We're now at a time when many are questioning whether we need offices at all,… [+6181 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Opinion by Mayra Cuevas", "title": "Opinion: What's really at stake in the abortion debate", "description": "CNN's Mayra Cuevas writes that \"what's at stake in the abortion debate isn't just the constitutionality of regulating abortion, but the right of all women to wield control over their bodies -- a right that already is eroded daily in classrooms across the coun…", "url": "https://www.cnn.com/2022/07/07/opinions/abortion-after-roe-v-wade-cuevas/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220706154521-02-abortion-doulas-restricted-super-tease.jpg", "publishedAt": "2022-07-07T10:17:16Z", "content": "Born and raised in Sabana Grande, Puerto Rico, Mayra Cuevas is a CNN award-winning journalist and the author of multiple books and stories for children, most recently the young adult novel, \"Does My … [+6757 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Ben Morse, CNN", "title": "Three Wimbledon security guards arrested for alleged fight amongst each other", "description": "Three security guards at Wimbledon have been arrested after an alleged fight broke out among the group.", "url": "https://www.cnn.com/2022/07/07/tennis/wimbledon-security-guards-arrested-spt-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220707042904-01-wimbledon-security-guards-super-tease.jpg", "publishedAt": "2022-07-07T09:59:12Z", "content": "(CNN)Three security guards at Wimbledon have been arrested after an alleged fight broke out among the group.\r\nThe altercation, which happened on the grounds of the grand slam on Friday, was broken up… [+986 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kathleen Magramo, CNN", "title": "Singapore executes two drug traffickers despite pleas for clemency", "description": "Singapore on Thursday executed two men for drug trafficking, ignoring pleas for mercy from human rights campaigners who fear \"a new wave\" of hangings in the Asian city state notorious for its strict drugs laws.", "url": "https://www.cnn.com/2022/07/07/asia/singapore-executions-kalwant-singh-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220705172738-anti-death-penalty-protest-juala-lumpur-0704-super-tease.jpg", "publishedAt": "2022-07-07T09:00:49Z", "content": "(CNN)Singapore on Thursday executed two men for drug trafficking, ignoring pleas for mercy from human rights campaigners who fear \"a new wave\" of hangings in the Asian city state notorious for its st… [+3027 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Rhea Mogul, Swati Gupta", "title": "Last Muslim lawmaker leaves India's ruling party", "description": "The last remaining Muslim lawmaker in India's ruling Bharatiya Janata Party has resigned, leaving the party without a single representative from the minority community among its 395 members of parliament.", "url": "https://www.cnn.com/2022/07/07/india/india-muslim-bjp-minister-resign-intl-hnk/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220706233755-india-bjp-resignation-muslim-intl-hnk.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-07T09:00:44Z", "content": "The last remaining Muslim lawmaker in Indias ruling Bharatiya Janata Party has resigned, leaving the party without a single representative from the minority community among its 395 members of parliam… [+3153 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jackie Prager, CNN", "title": "With stunning black and white images, photographer Mário Macilau uses the 'language' of his craft to question society", "description": "Mário Macilau opens up about his journey to become an award-winning photographer and the messages behind his striking images in his home country of Mozambique.", "url": "https://www.cnn.com/style/article/mario-macilau-mozambique-photography-spc-intl/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220705101558-mrio-macilau-pic6-super-tease.jpg", "publishedAt": "2022-07-07T08:30:52Z", "content": "arts\r\nSurrounded by his images in his workshop in Maputo, Mozambique, photographer Mário Macilau adjusts the contrast of a recent picture he captured. The simple yet striking image shows a boy covere… [+3711 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/tara-john\">Tara John</a>, CNN", "title": "The latest on Boris Johnson", "description": "Boris Johnson is clinging to power as efforts to end his premiership continue, with further resignations from his Conservative government. Follow live updates.", "url": "https://www.cnn.com/uk/live-news/uk-boris-johnson-government-collapse-live-updates-intl-gbr/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220707081949-01-boris-johnson-pmqs-070622-super-tease.jpg", "publishedAt": "2022-07-07T07:45:16Z", "content": "Boris Johnson was rocked by more resignations on Thursday morning as a growing number of ruling Conservative Party lawmakers attempt to force the UK Prime Minister out of 10 Downing Street.\r\nHere are… [+2358 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Oscar Holland, CNN", "title": "Wires, watercoolers and off-white walls: A portrait of '90s offices", "description": "At a time when many are questioning whether we need offices at all, Steven Ahlgren's images of American workplaces offer a glimpse of corporate life in the 1990s and early 2000s.", "url": "https://www.cnn.com/style/article/steven-ahlgren-90s-office-photos/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220706034256-07-steven-ahlgren-the-office-copy-super-tease.jpeg", "publishedAt": "2022-07-07T07:25:43Z", "content": "arts\r\nThe role that offices play in our lives has been disrupted by the Covid-19 pandemic. \r\nAmong US workers able to perform their jobs from home, almost six in 10 now do so most, or all, of the tim… [+5267 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Travis Caldwell, Joe Sutton", "title": "Memorials grow as Highland Park community remembers the victims of a parade mass shooting", "description": "In the heart of Highland Park, Illinois, a community gathers in mourning, placing flowers, messages of remembrance and American flags at the scene of yet another mass shooting in the US.", "url": "https://www.cnn.com/2022/07/07/us/highland-park-illinois-shooting-july-fourth-parade-thursday/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220706221854-03-highland-park-illinois-shooting-july-fourth-parade-thursday.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-07T07:18:53Z", "content": "In the heart of Highland Park, Illinois, a community gathers in mourning, placing flowers, messages of remembrance and American flags at the scene of yet another mass shooting in the US. \r\nYellow bar… [+6448 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Jarrod Wardwell, CNN", "title": "A former funeral home operator pleads guilty to stealing human remains and selling them, prosecutors say", "description": "A former Colorado funeral home operator has pleaded guilty to stealing and then selling hundreds of human bodies or body parts to people who were buying the remains for scientific, medical or educational purposes, according to prosecutors.", "url": "https://www.cnn.com/2022/07/07/us/colorado-funeral-home-fake-ashes-scheme/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220707001746-01-colorado-funeral-home-fake-ashes-scheme-super-tease.jpg", "publishedAt": "2022-07-07T06:53:25Z", "content": "(CNN)A former Colorado funeral home operator has pleaded guilty to stealing and then selling hundreds of human bodies or body parts to people who were buying the remains for scientific, medical or ed… [+1990 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By <a href=\"/profiles/helen-regan\">Helen Regan</a>, CNN", "title": "Russia's war in Ukraine", "description": "Russia is likely to mount an offensive on Sloviansk, a city military chief said, as strikes on the Donetsk region intensify and civilians were urged to evacuate. Meanwhile, G20 foreign ministers meet in Bali. Follow here for live updates.", "url": "https://www.cnn.com/europe/live-news/russia-ukraine-war-news-07-07-22/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220706100204-ukraine-donetsk-troops-super-tease.jpg", "publishedAt": "2022-07-07T06:48:48Z", "content": "A Turkish-made Bayraktar TB2 drone, secured by Lithuania for Ukraine after a local crowdfunding campaign, is expected to be shipped to Kyiv in the coming hours. \r\nThe Vanagas (which means \"Hawk\" in L… [+1905 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "By Jake Kwon and Mayumi Maruyama, CNN", "title": "A Japanese aquarium bought cheaper fish for its penguins. And they're not happy", "description": "An aquarium employee waves a mackerel near a penguin -- but there's no reaction. When she moves the fish closer to its beak, the penguin turns away haughtily. An otter sniffs the fish, then runs away.", "url": "https://www.cnn.com/travel/article/japan-hakone-aquarium-penguins-fish-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220707015718-01-japan-aquarium-penguins-super-tease.jpg", "publishedAt": "2022-07-07T06:18:55Z", "content": "(CNN) An aquarium employee waves a mackerel near a penguin -- but there's no reaction. When she moves the fish closer to its beak, the penguin turns away haughtily. An otter sniffs the fish, then run… [+2015 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Nectar Gan, Shawn Deng", "title": "Beijing imposes mainland China's first Covid vaccine mandate in face of Omicron subvariant", "description": "Beijing on Wednesday announced a Covid-19 vaccine mandate for residents to enter public venues, becoming the first city in mainland China to do so as it attempts to contain a highly infectious Omicron subvariant.", "url": "https://www.cnn.com/2022/07/07/china/china-covid-beijing-vaccine-mandate-intl-hnk/index.html", "urlToImage": "https://media.cnn.com/api/v1/images/stellar/prod/220707000652-01-china-covid-beijing-vaccine-mandate.jpg?c=16x9&q=w_800,c_fill", "publishedAt": "2022-07-07T04:47:19Z", "content": "Beijing on Wednesday announced a Covid-19 vaccine mandate for residents to enter public venues, becoming the first city in mainland China to do so as it attempts to contain a highly infectious Omicro… [+2998 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Sara Ashley O'Brien, CNN Business", "title": "Elon Musk reportedly had twins with a Neuralink executive", "description": "Elon Musk, the Tesla and SpaceX CEO and world's richest man, welcomed twins last year with an executive at one of his other companies, Neuralink, Business Insider reported on Wednesday.", "url": "https://www.cnn.com/2022/07/07/tech/elon-musk-twins-shivon-zilis-neuralink/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220706225156-02-elon-musk-file-070622-super-tease.jpg", "publishedAt": "2022-07-07T04:23:08Z", "content": "(CNN Business)Elon Musk, the Tesla and SpaceX CEO and world's richest man, welcomed twins last year with an executive at one of his other companies, Neuralink, Business Insider reported on Wednesday.… [+3047 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Kiely Westhoff and Aya Elamroussi, CNN", "title": "Officer injured in Philadelphia July Fourth shooting says he found a bullet in his hat", "description": "One of the two police officers injured in a shooting during a July Fourth celebration in Philadelphia didn't realize he had been shot until he arrived at a hospital and found a bullet lodged in his hat, he told CNN.", "url": "https://www.cnn.com/2022/07/07/us/philadelphia-july-fourth-festival-shooting-thursday/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220706223659-01-philadelphia-july-fourth-festival-shooting-wednesday-super-tease.jpg", "publishedAt": "2022-07-07T04:22:11Z", "content": "(CNN)One of the two police officers injured in a shooting during a July Fourth celebration in Philadelphia didn't realize he had been shot until he arrived at a hospital and found a bullet lodged in … [+2994 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Steve Almasy, CNN", "title": "Derek Chauvin to be sentenced Thursday on federal charges", "description": "Former Minneapolis police officer Derek Chauvin, already jailed on state murder charges for his role in the death of George Floyd, will learn his federal sentence Thursday when he appears in a US District Court.", "url": "https://www.cnn.com/2022/07/07/us/derek-chauvin-federal-sentencing/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/210625153028-07-chauvin-sentencing-0625-super-tease.jpg", "publishedAt": "2022-07-07T04:03:57Z", "content": "(CNN)Former Minneapolis police officer Derek Chauvin, already jailed on state murder charges for his role in the death of George Floyd, will learn his federal sentence Thursday when he appears in a U… [+1009 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Paul LeBlanc, CNN", "title": "McCabe says his and Comey's selections for 'rigorous' IRS audits should be investigated", "description": "Former FBI Deputy Director Andrew McCabe on Wednesday said an investigation should be launched into how he and former FBI Director James Comey were both selected by the Internal Revenue Service for an intensive tax audit.", "url": "https://www.cnn.com/2022/07/06/politics/andrew-mccabe-james-comey-irs-tax-audit/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220706202312-andew-mccabe-james-comey-tax-audit-super-tease.jpg", "publishedAt": "2022-07-07T03:20:02Z", "content": "Washington (CNN)Former FBI Deputy Director Andrew McCabe on Wednesday said an investigation should be launched into how he and former FBI Director James Comey were both selected by the Internal Reven… [+3649 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Story by Reuters", "title": "Italian Alps glacier collapse death toll rises to 9, with 3 still missing", "description": "Italian rescue teams on Wednesday found the bodies of two more victims of the glacier collapse in the Alps that is feared to have killed up to 12 people and is being blamed on rising temperatures.", "url": "https://www.cnn.com/2022/07/06/world/italy-avalanche-glacier-rescue-victims-intl-hnk/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220706182927-marmolado-glacier-collapse-file-070422-super-tease.jpg", "publishedAt": "2022-07-07T02:09:36Z", "content": "Canazei, ItalyItalian rescue teams on Wednesday found the bodies of two more victims of the glacier collapse in the Alps that is feared to have killed up to 12 people and is being blamed on rising te… [+1199 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Veronica Stracqualursi, CNN", "title": "Where state abortion bans stand amid legal challenges", "description": "In more than a dozen states, legal fights are underway over abortion bans and other laws that greatly limit the procedure after the US Supreme Court ended a constitutional right to an abortion on June 24.", "url": "https://www.cnn.com/2022/07/06/politics/state-abortion-laws-legal-challenges/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220702140235-texas-abortion-0702-super-tease.jpg", "publishedAt": "2022-07-07T02:06:22Z", "content": "(CNN)In more than a dozen states, legal fights are underway over abortion bans and other laws that greatly limit the procedure after the US Supreme Court ended a constitutional right to an abortion o… [+6430 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Shimon Prokupecz and Matthew J. Friedman, CNN", "title": "Uvalde teacher feels forgotten by the officers sent to rescue him and his students", "description": "Robb Elementary teacher Arnie Reyes tells CNN he could hear law enforcement outside his classroom during the mass shooting but no one came in to help.", "url": "https://www.cnn.com/2022/07/06/us/uvalde-teacher-survivor-arnie-reyes/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220706152820-03-arnulfo-reyes-screengrab-super-tease.jpg", "publishedAt": "2022-07-07T00:49:31Z", "content": "Uvalde, Texas (CNN)As he lay in his own blood, with dead and dying students around him, Arnie Reyes knew help was just outside the classroom door. \r\nTwice he heard law enforcement officers in the hal… [+4767 chars]"}]}