{"status": "ok", "totalResults": 319, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Opposition slams Centre for slashing interest rate on EPF", "description": "State Urban Development and Municipal Affairs Minister Firhad Hakim said, “People's safe investment is being gradually destroyed so that they cannot keep EPF money and get involved in the share market and gamble with their money.”", "url": "https://indianexpress.com/article/cities/kolkata/opposition-centre-slashing-interest-rate-epf-7953273/", "urlToImage": "https://images.indianexpress.com/2022/06/epfo-1200-1-1-1.jpg", "publishedAt": "2022-06-04T22:48:45Z", "content": "Trinamool Congress (TMC), Congress and Left parties on Saturday criticised the BJP-led central government for approving the reduction of the rate of interest on the employees’ provident fund (EPF) de… [+1270 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "GTA elections: 210 of 318 candidates are Independents", "description": "Of the 108 nominations, only Hamro Party has fielded candidates on all 45 seats, while Bharatiya Gorkha Prajatantrik Morcha (BGPM) (36), CPI(M) (12), TMC (10), and Congress (5) seats.", "url": "https://indianexpress.com/article/cities/kolkata/gorkha-territorial-administration-gta-elections-candidates-independents-7953267/", "urlToImage": "https://images.indianexpress.com/2022/06/Gorkha-Territorial-Administration-new.jpg", "publishedAt": "2022-06-04T22:42:20Z", "content": "Nearly two-thirds of the total candidates who filed their papers for the elections to the 45 Gorkha Territorial Administration (GTA) seats are Independents, said officials as the process of filing no… [+2471 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Navjeevan Gopal", "title": "Beant assassin sister: ‘support us in fight for Bandi Singhs’", "description": "Kamaldeep, who had earlier rejected a proposal to contest the election, told The Indian Express that she agreed to be the Akali Dal's candidate after meeting Rajoana at Patiala jail earlier in the day. She will file her nomination papers on Monday.", "url": "https://indianexpress.com/article/cities/chandigarh/beant-assassin-sister-support-us-in-fight-for-bandi-singhs-7953269/", "urlToImage": "https://images.indianexpress.com/2022/06/ttttt.jpg", "publishedAt": "2022-06-04T22:40:01Z", "content": "The Shiromani Akali Dal-BSP alliance on Saturday declared Kamaldeep Kaur, the sister of Balwant Singh Rajoana a convict in the assassination of former Punjab chief minister Beant Singh as its candida… [+2480 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Geeta Nair", "title": "Demand push: Rubber industry looks to double exports by ‘25", "description": "AIRIA president Sawar Dhanania said the global market for rubber products which is estimated at around $212 billion today is also expected to grow by 2025.", "url": "https://indianexpress.com/article/business/companies/demand-push-rubber-industry-looks-to-double-exports-by-2025-7953117/", "urlToImage": "https://images.indianexpress.com/2022/06/rubber-mat-4col.jpg", "publishedAt": "2022-06-04T22:38:28Z", "content": "The $2-billion non-tyre rubber sector is aiming to double its exports by 2025, according to the All India Rubber Industries Association (AIRIA).AIRIA president Sawar Dhanania said the global market f… [+2377 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Navjeevan Gopal", "title": "Simranjit Mann: Let Sukhbir, Dhami first appoint Bandi Singhs as chiefs of their organisations", "description": "“They should appoint Bandi Singhs as chiefs of the respective organizations they are heading. Those who give advices should first make sacrifices themselves. Then only should they should give advice to the people,” Mann said referring to Badal, Dhuman and Dha…", "url": "https://indianexpress.com/article/cities/chandigarh/simranjit-mann-let-sukhbir-dhami-first-appoint-bandi-singhs-as-chiefs-of-their-organisations-7953263/", "urlToImage": "https://images.indianexpress.com/2022/06/rrrr.jpg", "publishedAt": "2022-06-04T22:32:26Z", "content": "Making it clear that only his party was representative of Sikhs, Shiromani Akali Dal (Amritsar) president Simranjit Singh Mann Saturday said the Sangrur Lok Sabha bypoll is for [seeking] justice for … [+1928 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "KK’s death: Bengal Governor slams state administration over ‘mismanagement’", "description": "“The death of KK was very painful. There could not have been more mismanagement. There could not have been more failure of the administration,” said West Bengal Governor Jagdeep Dhankhar.", "url": "https://indianexpress.com/article/cities/kolkata/kk-death-bengal-governor-jagdeep-dhankhar-state-administration-mismanagement-7953264/", "urlToImage": "https://images.indianexpress.com/2022/06/JAGDEEP-1.jpg", "publishedAt": "2022-06-04T22:31:33Z", "content": "West Bengal Governor Jagdeep Dhankhar on Saturday criticised the state government over singer KKs death, saying there could not have been more failure of the administration.Speaking to mediapersons a… [+1912 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sukrita Baruah, Abhinav Saha", "title": "An Express Investigation – Part 2 | Class 5A Topic: Mathematics", "description": "The last time they were physically in school was in Class 2, just before the pandemic shut down their classroom and upended their lives at home, too. So Neha Sharma’s students, back to begin Class 5, are struggling with basics.", "url": "https://indianexpress.com/article/india/an-express-investigation-part-2-class-5a-topic-mathematics-7953089/", "urlToImage": "https://images.indianexpress.com/2022/06/Schoolboardnewz1.jpg", "publishedAt": "2022-06-04T22:30:53Z", "content": "Close your eyes and think… is there any time of your day that mathematics is not around you? The children shift in their seats, their impatient eyes dart behind their shut eyelids as they attempt to … [+11235 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "ITU Council: India to contest for re-election", "description": "India is contesting for re-election to ITU Council for the term 2023-2026. India has been a member of ITU and continuously participating in the activities of the Union", "url": "https://indianexpress.com/article/business/commodities/itu-council-india-to-contest-for-re-election-7953112/", "urlToImage": "https://images.indianexpress.com/2022/06/Telecom-cable-2col.jpg", "publishedAt": "2022-06-04T22:30:15Z", "content": "India will contest for re-election to International Telecommunications Union (ITU) Council, Ministry of Communications said in a statement on Saturday.New Delhi has also underlined its firm commitmen… [+885 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Geeta Nair", "title": "All set to roll out Tork electric motorcycles this month: Baba Kalyani", "description": "A new factory is all set to roll out the Tork electric motorcycles this month. Next will be an electric truck, says Bharat Forge Chairman and MD Baba Kalyani.", "url": "https://indianexpress.com/article/business/all-set-roll-out-tork-electric-motorcycles-bharat-forge-baba-kalyani-7953127/", "urlToImage": "https://images.indianexpress.com/2022/06/04-Baba-Kalyani-3col.jpg", "publishedAt": "2022-06-04T22:30:04Z", "content": "It took forging company Bharat Forge 61 years to reach an annual turnover of Rs 10,000 crore. Chairman and MD Baba Kalyani is confident of the next Rs 10,000 crore coming at a faster pace, with the c… [+2712 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Adrija Roychowdhury", "title": "Delhi rewind: How the National Museum of Natural History became a centre for environmental activism in Delhi", "description": "The National Museum of Natural History was established inside the FICCI building at Mandi House, where it stayed until it was destroyed in a massive fire in April 2016.", "url": "https://indianexpress.com/article/cities/delhi/delhi-rewind-national-museum-of-natural-history-centre-environmental-activism-7953222/", "urlToImage": "https://images.indianexpress.com/2022/06/newsline-rewind-5col.jpg", "publishedAt": "2022-06-04T22:30:02Z", "content": "In 1977, Asif Naqvi (68) was on a college trip to New Delhi when he first came across the National Museum of Natural History that was in the final stages of being completed. Naqvi was at that time a … [+6834 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Suspecting affair, man kills wife in Civil Hospital; held", "description": "The couple had one more child, who is around three-years-old, who has been handed over to the relatives of the accused while the four-day-old child is admitted to the civil hospital.", "url": "https://indianexpress.com/article/cities/chandigarh/suspecting-affair-man-kills-wife-in-civil-hospital-held-7953262/", "urlToImage": "https://images.indianexpress.com/2021/10/ahd.jpeg", "publishedAt": "2022-06-04T22:24:36Z", "content": "A man killed his wife in Civil Hospital, Kapurthala, on Saturday when he was alone in the room with her, who had delivered a baby boy just four days ago.The accused has been identified as Manjit Sing… [+523 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lalmani Verma", "title": "As SP strain shows, BJP again leans on OBCs for Azamgarh, Rampur LS bypolls", "description": "Both the seats are prestige fights, having been vacated by SP stalwarts Akhilesh Yadav and Azam Khan, after their move to the Assembly in the recent elections.", "url": "https://indianexpress.com/article/india/political-pulse/sp-bjp-obc-azamgarh-rampur-ls-bypolls-7953120/", "urlToImage": "https://images.indianexpress.com/2022/06/Dinesh-Lal-Yadav-Nirahua-1.jpg", "publishedAt": "2022-06-04T22:23:35Z", "content": "CONTINUING its focus on OBCs, the BJP Saturday declared Bhojpuri actor-turned-politician Dinesh Lal Yadav ‘Nirahua’ and former Samajwadi Party MLC Ghanshyam Lodhi as its candidates for Azamgarh and R… [+3702 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sajan C Kumar", "title": "Post Supreme Court decision: Will settle creditors, script new chapter, says Siva Industries", "description": "Vallal RCK, a shareholder of the company, had challenged the NCLAT order upholding the NCLT’s order to liquidate SIHL, despite the committee of creditors (CoC) accepting the settlement plan with a voting majority of 94.23%.", "url": "https://indianexpress.com/article/business/companies/post-supreme-court-decision-will-settle-creditors-script-new-chapter-says-siva-industries/", "urlToImage": "https://images.indianexpress.com/2022/06/supreme-court-3-1.jpg", "publishedAt": "2022-06-04T22:23:27Z", "content": "Armed with a Supreme Court order allowing the promoters settlement plan to save the company from liquidation, the ailing Siva Industries and Holding Ltd (SIHL) said on Saturday the company will be pl… [+2499 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kamaldeep Singh Brar", "title": "Bathinda: Weapon ‘seized, kept’ by police recovered from drug peddler", "description": "Police said Kudratdeep was presented in the court of District Session Judge, Rupinderjit Chahal, which sent him to judicial remand. The next date of hearing in the case is on June 7.", "url": "https://indianexpress.com/article/cities/chandigarh/bathinda-weapon-seized-kept-by-police-recovered-from-drug-peddler-7953258/", "urlToImage": "https://images.indianexpress.com/2022/06/Indian-Express-13.jpeg", "publishedAt": "2022-06-04T22:20:20Z", "content": "The top brass of Bathinda police have been left scratching their heads after the recovery of a weapon from an alleged drug smuggler, which their records showed had been seized and was supposed to be … [+3012 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Uttar Pradesh: Two killed, three hurt in highway crash", "description": "Kargapur SHO Kuber Tiwari said Chand Babu (30) and Khuddan (58), both car occupants, died in the accident. The bodies have been sent for post-mortem, the SHO added.", "url": "https://indianexpress.com/article/cities/lucknow/uttar-pradesh-two-killed-three-hurt-highway-crash-7953260/", "urlToImage": "https://images.indianexpress.com/2022/06/dead-4-1.jpg", "publishedAt": "2022-06-04T22:16:13Z", "content": "Two people were killed and three others injured in a collision involving a roadways bus and a car on the Gonda-Balrampur highway in the early hours of Saturday, police said."}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Coomi Kapoor", "title": "Inside Track: Yours, Mine & Mama’s", "description": "Coomi Kapoor writes: For RS nominations, Sonia Gandhi picked P Chidambaram and Jairam Ramesh; Priyanka Gandhi’s protégés were Imran Pratapgarhi, Rajiv Shukla and Pramod Tiwari and Rahul decided on the others, including the fiery Ranjeet Ranjan.", "url": "https://indianexpress.com/article/opinion/columns/coomi-kapoor-writes-inside-track-yours-mine-mamas-rajya-sabha-sonia-cong-priyanka-rahul-7953113/", "urlToImage": "https://images.indianexpress.com/2022/06/sonia-ganhdi.jpg", "publishedAt": "2022-06-04T22:15:00Z", "content": "It would appear that the 10 candidates for Congress Rajya Sabha nominations were selected exclusively by the Gandhi family. Sonia Gandhi picked P Chidambaram and Jairam Ramesh; Priyanka Gandhis proté… [+4612 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Naveed Iqbal", "title": "‘I feel like her blood is still on me’: In Kulgam, a staff room in tears", "description": "The land on which the school stands is disputed, which means there is no boundary wall around it. From where Rajni Bala fell after a single gunshot, there is a thick canopy of apple orchards as far as the eye can see.", "url": "https://indianexpress.com/article/cities/srinagar/feel-like-blood-still-on-me-kulgam-staff-room-tears-rajni-bala-7953166/", "urlToImage": "https://images.indianexpress.com/2022/06/p1-naveed2-3col-1.jpg", "publishedAt": "2022-06-04T22:10:26Z", "content": "THE Government High School at Gopalpora in Kulgam is shut since the morning of May 31, when terror came to its doorstep. Its five teachers, though, turn up every day, sitting huddled together, unable… [+3719 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "14-year-old girl dies after ‘gangrape’, three booked", "description": "\"The girl’s father – who belonged to the Dalit community – stated in his complaint that on Wednesday night two of the accused came to his house and kidnapped his daughter. The girl was sleeping outside her house with her family,\" police said.", "url": "https://indianexpress.com/article/cities/lucknow/14-year-old-girl-dies-gangrape-3-booked-7953257/", "urlToImage": "https://images.indianexpress.com/2022/06/Indian-Express-13.jpeg", "publishedAt": "2022-06-04T22:09:20Z", "content": "A day after a 14-year-old girl died during treatment after she was allegedly gang-raped, an FIR was lodged against three persons in Chitrakoot, police said.The three persons were detained for interro… [+2056 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Will not allow shifting of Rohtak mini secretariat and judicial complex, says Hooda", "description": "“If the government wants to take any decision in public interest, then it should set up industries at a large scale, on the lines of the Congress government, so that the youth get employment and economic activities in the area are accelerated,” Hooda said.", "url": "https://indianexpress.com/article/cities/chandigarh/will-not-allow-shifting-of-rohtak-mini-secretariat-and-judicial-complex-says-hooda-7953256/", "urlToImage": "https://images.indianexpress.com/2022/05/hooda3-1.jpg", "publishedAt": "2022-06-04T22:07:26Z", "content": "Haryana’s Leader of Opposition and former Chief Minister, Bhupinder Singh Hooda, on Saturday took strong objection to state’s plan of shifting Rohtak’s mini secretariat and judicial complex out of th… [+1862 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Santosh Singh", "title": "Buzz in Bihar: A Rs 500-cr bottling unit, Rs 105-cr ethanol plant, ‘more coming’", "description": "Promoters say govt speeding up clearances, minister points to relaxed norms and single-window system.", "url": "https://indianexpress.com/article/cities/patna/buzz-bihar-rs-500-cr-bottling-unit-rs-105-cr-ethanol-plant-more-coming-7953157/", "urlToImage": "https://images.indianexpress.com/2022/06/Bihar-1-1.jpg", "publishedAt": "2022-06-04T22:05:31Z", "content": "IT is early days, this is a state known for too many false starts and yet the buzz this time is unmistakable.A little over 1.6 km from Zero Mile in Begusarai, there’s the hum of new life as workers l… [+8907 chars]"}]}