{"status": "ok", "totalResults": 442, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Varinder Bhatia", "title": "‘Good luck & goodbye’: After Jakhar, Congress wary of parting shots from Haryana rebels", "description": "An aspirant for a leadership role, ex-MP Bishnoi publicly declared that he was “angry”, as he could not find a place among the HPCC brass. He has since continued to be at loggerheads with the state party leadership.", "url": "https://indianexpress.com/article/india/political-pulse/good-luck-goodbye-after-jakhar-congress-wary-of-parting-shots-from-haryana-rebels-7921283/", "urlToImage": "https://images.indianexpress.com/2022/05/bishnoi.jpg", "publishedAt": "2022-05-17T04:50:25Z", "content": "After former Punjab Congress chief Sunil Jakhar quit the grand old party in a dramatic fashion last Saturday, when its Chintan Shivir was underway in Udaipur, the party has now turned its focus to th… [+3595 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "CBI books Karti Chidambaram over illegal gratification", "description": "Following the registration of the FIR, the CBI on Tuesday morning started searches at nine premises of Chidambaram in Chennai and other cities in the country, they said.", "url": "https://indianexpress.com/article/india/cbi-books-karti-chidambaram-over-illegal-gratification/", "urlToImage": "https://images.indianexpress.com/2020/11/karti-1.jpg", "publishedAt": "2022-05-17T04:48:17Z", "content": "By: PTI | New Delhi | May 17, 2022 10:18:17 am\r\nKarti Chidambaram (File)The CBI has registered a new case against Lok Sabha MP Karti Chidambaram, son of former finance minister P Chidambaram, for all… [+219 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Apple releases iOS 15.5, iPadOS 15.5 and macOS 12.4: All you need to know", "description": "iOS 15.5 brings new changes including new Apple Cash buttons, automatically deleting podcasts and more. Read more below.", "url": "https://indianexpress.com/article/technology/tech-news-technology/apple-releases-ios-15-5-ipados-15-5-and-macos-12-4-all-you-need-to-know-7921249/", "urlToImage": "https://images.indianexpress.com/2022/05/Apple-iOS-15-Express-Photo.jpg", "publishedAt": "2022-05-17T04:41:59Z", "content": "Apple has launched the latest version of its mobile software for iPhones and iPads – iOS 15.5 and iPadOS 15.5. A minor update over iOS 15, iOS 15.5 doesnt have a lot of features on the customer side,… [+2467 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Iram Siddique", "title": "MP: Tensions in Neemuch city after idol found placed near mosque; police say situation under control", "description": "Neemuch's Superitendent of Police, Suraj Kumar, said the police were informed about the idol being placed near the dargah late afternoon, and district administration and police officials reached the site soon.", "url": "https://indianexpress.com/article/cities/bhopal/tension-in-mps-neemuch-city-after-idol-found-placed-near-mosque-police-say-situation-under-control-7921273/", "urlToImage": "https://images.indianexpress.com/2021/10/police-van.jpg", "publishedAt": "2022-05-17T04:38:20Z", "content": "There were reports of tension in Neemuch city, in the district of the same name in Madhya Pradesh, on Monday after an idol of Lord Hanuman was found placed near a dargah in the city, police said late… [+1423 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Delhi Capitals peaking at right time in IPL, says Mitchell Marsh", "description": "Marsh smashed the only half-century of the match as Delhi defended a modest 159-7 to record their first back-to-back victories this season.", "url": "https://indianexpress.com/article/sports/ipl/delhi-capitals-peaking-at-right-time-in-ipl-says-mitchell-marsh-7921269/", "urlToImage": "https://images.indianexpress.com/2022/05/Mitchell-Marsh-1.jpg", "publishedAt": "2022-05-17T04:36:03Z", "content": "Delhi Capitals are hitting their stride at the perfect time in the Indian Premier League, all-rounder Mitch Marsh said after helping the side break into the top four with Monday’s victory against Pun… [+1449 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi weather: Maximum temperature at 41 degrees; cloudy skies, thunder and lightning on forecast", "description": "The maximum temperature recorded on Monday at the Safdarjung weather observatory was 42.4 degrees Celsius, two degrees above the long period average for this time of the year.", "url": "https://indianexpress.com/article/cities/delhi/delhi-weather-forecast-today-heatwave-7921265/", "urlToImage": "https://images.indianexpress.com/2022/05/delhi-3.jpg", "publishedAt": "2022-05-17T04:34:06Z", "content": "Delhi is likely to record a maximum temperature of 41 degrees Celsius Tuesday, with cloudy skies and the possibility of thunder and lightning, according to the India Meteorological Department (IMD) f… [+2201 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Legalising same-sex marriages petitions: Plea for live streaming proceedings a publicity ploy, says Centre to Delhi HC", "description": "There have been many matters of national importance where live streaming was never requested or allowed by the court, it said.", "url": "https://indianexpress.com/article/cities/delhi/legalising-same-sex-marriages-petitions-plea-for-live-streaming-proceedings-a-publicity-ploy-says-centre-to-delhi-hc-7921266/", "urlToImage": "https://images.indianexpress.com/2022/05/Delhi-HC-1.jpg", "publishedAt": "2022-05-17T04:32:46Z", "content": "Opposing an application seeking live streaming proceedings of the petitions seeking legalisation of same-sex marriages in India, the Centre has told the Delhi High Court that the plea was aimed at cr… [+1787 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "World Hypertension Day 2022: Five restorative yoga poses for high blood pressure", "description": "Holistic practices like yoga, meditation, and mindfulness, help handle stress in a productive and effective manner.", "url": "https://indianexpress.com/article/lifestyle/fitness/world-hypertension-day-2022-five-restorative-yoga-poses-high-blood-pressure-fitness-7902681/", "urlToImage": "https://images.indianexpress.com/2022/05/bloodpressureGetty_1200.jpg", "publishedAt": "2022-05-17T04:30:55Z", "content": "An estimated 26 per cent of the world’s population or roughly 972 million people have hypertension; and this number is set to increase to 29 per cent by 2025, according to National Center for Biotech… [+2828 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Mahender Singh Manral", "title": "Conman Sukesh went on hunger strike twice in Tihar to meet wife more often", "description": "DG (Prisons) Sandeep Goel said Sukesh Chandrashekhar's demand was to arrange a meeting with his wife, who is lodged in jail no 6 of Tihar jail.", "url": "https://indianexpress.com/article/cities/delhi/sukesh-chandrashekhar-tihar-hunger-strike-wife-7921257/", "urlToImage": "https://images.indianexpress.com/2022/05/Sukesh.jpeg", "publishedAt": "2022-05-17T04:26:59Z", "content": "To meet his wife more than twice per month, as mandated in the jail manual, alleged conman Sukesh Chandrashekhar went on hunger strike, demanding he be allowed to see his wife Leena Maria Paul, who i… [+2422 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Turkey objects as Sweden, Finland seek NATO membership", "description": "Sweden decided Monday to seek NATO membership a day after the country’s governing Social Democratic party endorsed a plan for the country to join the trans-Atlantic alliance and Finland’s government announced that it would seek to join NATO.", "url": "https://indianexpress.com/article/world/turkey-objects-as-sweden-finland-seek-nato-membership-7921242/", "urlToImage": "https://images.indianexpress.com/2022/05/sweden-3.jpg", "publishedAt": "2022-05-17T04:17:58Z", "content": "Turkey’s president on Monday complicated Sweden and Finland´s historic bid to join NATO, saying he cannot allow them to become members of the alliance because of their perceived inaction against exil… [+5486 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Jury sees pictures of Amber Heard’s swollen face after fight with Johnny Depp", "description": "Amber Heard concluded her direct testimony in a Virginia courtroom with a third day that was centred on the final months of her marriage to Johnny Depp.", "url": "https://indianexpress.com/article/entertainment/hollywood/jury-sees-pics-of-amber-heard-swollen-face-after-fight-with-johnny-johnny-depp-7921173/", "urlToImage": "https://images.indianexpress.com/2022/05/AMber-Heard-ap-1200by667-1.jpeg", "publishedAt": "2022-05-17T04:16:48Z", "content": "Jurors in Johnny Depps libel trial against his ex-wife, Amber Heard, saw photos Monday of her with red marks and swelling on her face after their final fight before their divorce, and heard testimony… [+4941 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Tamil Nadu: 435 houses under PMAY in Pudukkottai never built, exist only in files, finds probe", "description": "The issue came to light when district collector Kavitha Ramu ordered a probe based on a complaint which said that several houses in the Avudaiyarkoil block were not built but payments were made entirely by the government.", "url": "https://indianexpress.com/article/cities/chennai/tamil-nadu-435-houses-pmay-pudukkottai-never-built-probe-7921225/", "urlToImage": "https://images.indianexpress.com/2022/05/house-1.jpg", "publishedAt": "2022-05-17T04:14:42Z", "content": "A probe by the Pudukkottai district administration in Tamil Nadu has found that beneficiaries of hundreds of housing projects under the Pradhan Mantri Awas Yojana (PMAY) were paid the complete eligib… [+266 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Indian shares extend gain; LIC listing in focus", "description": "The NSE Nifty 50 index was up 0.75% at 15,961.20, as of 0352 GMT, with most major sub-indexes in positive territory, while the S&P BSE Sensex rose 0.59% to 53,284.31.", "url": "https://indianexpress.com/article/business/market/equity-markets-stocks-shares-bse-sensex-nse-nifty-oil-rupee-prices-global-cues-may-17-7921229/", "urlToImage": "https://images.indianexpress.com/2022/02/REUTERS-BSE-BUDGET-1200.jpeg", "publishedAt": "2022-05-17T04:14:12Z", "content": "Indian shares rose for a second consecutive session on Tuesday, with investors focused on the market debut of state-owned Life Insurance Corp, while the rupee weakened to an all-time low.The NSE Nift… [+771 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Aishwarya Rai, Abhishek Bachchan, Aaradhya leave for Cannes 2022, fans say, ‘Aaradhya looks exactly like her father’. Watch video", "description": "Aishwarya Rai Bachchan, Abhishek Bachchan and Aaradhya Bachchan were spotted at the Mumbai airport as they left for Cannes to attend the Cannes Film Festival.", "url": "https://indianexpress.com/article/entertainment/bollywood/aishwarya-rai-bachchan-leaves-for-cannes-2022-abhishek-aaradhya-watch-7921200/", "urlToImage": "https://images.indianexpress.com/2022/05/abhishek-aishwarya-cannes.jpeg", "publishedAt": "2022-05-17T04:10:50Z", "content": "Bollywood couple Aishwarya Rai Bachchan and Abhishek Bachchan, along with their daughter Aaradhya Bachchan, have left for France to attend this year’s Cannes Film Festival. They were spotted at the M… [+2158 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Kumaraswamy hits back at Rahul: ‘Congress facing phobia of regional parties’", "description": "\"Congress is facing a phobia of regional parties, it has lost its identity in Andhra, Telangana, Odisha and other states. In Karnataka, the Congress is nearing its end. It’s good if Rahul Gandhi understands this,” Kumaraswamy said.", "url": "https://indianexpress.com/article/cities/bangalore/rahul-gandhi-regional-parties-kumaraswamy-karnataka-7921181/", "urlToImage": "https://images.indianexpress.com/2022/05/Karnataka22.jpeg", "publishedAt": "2022-05-17T04:09:33Z", "content": "Former Karnataka chief minister and Janata Dal (Secular) leader H D Kumaraswamy Monday said the Congress was facing a “phobia of regional parties”, and that it had “lost its identity in Andhra, Telan… [+1135 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Watch: Paulo Dybala breaks down into tears after playing his last match for Juventus", "description": "Alongside Giorgio Chiellini, Dybala was honoured after the match, and the 28-year-old forward couldn't hold back his own emotions as he was celebrated by supporters.", "url": "https://indianexpress.com/article/sports/football/watch-paulo-dybala-breaks-down-into-tears-after-his-last-match-for-juventus-7921219/", "urlToImage": "https://images.indianexpress.com/2022/05/Paulo-Dybala.jpg", "publishedAt": "2022-05-17T04:05:25Z", "content": "Emotions got the better of Paulo Dybala on Monday as the long-serving Juventus forward broke down in tears as he said farewell to the crowd in Turin.A stoppage-time goal from Sergej Milinkovic-Savic … [+2680 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Anushka Sharma says she’s ‘more than a rat in a rat race’, explains why she stepped down from Clean Slate Filmz", "description": "Anushka Sharma opened up about her decision to step down from her production banner Clean Slate Filmz, which she claimed was to dedicate her time to her 'first love' — acting.", "url": "https://indianexpress.com/article/entertainment/bollywood/anushka-sharma-says-shes-more-than-a-rat-in-a-rat-race-explains-why-she-stepped-down-from-clean-slate-filmz-7921163/", "urlToImage": "https://images.indianexpress.com/2022/05/anushka-sharma-1200.jpg", "publishedAt": "2022-05-17T04:05:18Z", "content": "Anushka Sharma has backed critically acclaimed projects such as NH10, Phillauri, Pari, Paatal Lok and Bulbbul through her production house, Clean Slate Filmz, which she founded with her brother Karne… [+2583 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Mumbai News Live: MVA leaders react to Rahul Gandhi’s regional parties remarks, say should focus on reviving Congress", "description": "Mumbai News Live: Congress leader Rahul Gandhi’s recent statement on regional parties has not gone down well with its ally partners in the state’s ruling Maharashtra Vikas Aghadi (MVA) government.", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-news-live-updates-weather-traffic-covid-7921168/", "urlToImage": "https://images.indianexpress.com/2022/05/rahul-2-1.jpg", "publishedAt": "2022-05-17T04:02:29Z", "content": "Mumbai News Live: After Congress leader Rahul Gandhi said regional parties neither have an ideology nor a centralised approach, leaders of both the Shiv Sena and NCP, allies of the party in Maharasht… [+902 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Trump’s Truth Social posts will have to wait before reposts on other platforms", "description": "Billionaire Elon Musk, who has bid to buy Twitter for $44 billion, has said he would reverse Trump's ban on the platform, calling it \"morally wrong and flat-out stupid.\"", "url": "https://indianexpress.com/article/technology/social/trumps-truth-social-posts-will-have-to-wait-before-reposts-on-other-platforms-7921214/", "urlToImage": "https://images.indianexpress.com/2022/05/Donald-Trump-Reuters.jpg", "publishedAt": "2022-05-17T04:00:15Z", "content": "Donald Trump will have to wait for six hours before reposting his messages from social media platform Truth Social on other platforms, a regulatory filing revealed on Monday.The platform was launched… [+1280 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Backer of stricken TerraUSD says spent reserves trying to salvage dollar peg", "description": "LFG said in a series of tweets on Monday that it had spent the majority of its bitcoin last week in a failed attempt to prop up TerraUSD as it collapsed.", "url": "https://indianexpress.com/article/technology/tech-news-technology/backer-of-stricken-terrausd-says-spent-reserves-trying-to-salvage-dollar-peg-7921179/", "urlToImage": "https://images.indianexpress.com/2022/05/cryptocurerncy-reuters.jpg", "publishedAt": "2022-05-17T03:51:07Z", "content": "An affiliate of the company behind collapsed stablecoin TerraUSD on Monday said it had spent the bulk of its reserves trying to defend its dollar peg last week and would use what little remained to c… [+3286 chars]"}]}