{"status": "ok", "totalResults": 356, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "US: Two in biker gangs fatally shot outside Tennessee bar, say police", "description": "According to Knoxville police, a preliminary investigation determined that a member of the Outlaws Motorcycle Club and a member of the Pagans Motorcycle Club were killed in the shooting outside Hatmaker's Bar & Grill on Friday night.", "url": "https://indianexpress.com/article/world/us-two-in-biker-gangs-fatally-shot-outside-tennessee-bar-say-police-7895889/", "urlToImage": "https://images.indianexpress.com/2022/05/US-SHOOTING-1.jpg", "publishedAt": "2022-05-01T04:49:08Z", "content": "Two members of motorcycle gangs were fatally shot during a fight that broke out in the parking lot of a Tennessee bar, police said.According to Knoxville police, a preliminary investigation determine… [+700 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Mira Kapoor is having the best time with girlfriends in Dubai as they swim ‘on top of the world’. See photos, videos", "description": "Mira Kapoor spent a great time with her girlfriends in Dubai. Photos and videos from the trip were shared by Mira and her friends on social media.", "url": "https://indianexpress.com/article/entertainment/bollywood/mira-kapoor-girls-trip-dubai-see-photos-videos-7895814/", "urlToImage": "https://images.indianexpress.com/2022/05/mira-kapoor-1200.jpg", "publishedAt": "2022-05-01T04:47:43Z", "content": "Mira Kapoor has cracked her social media game and the woman knows how to make the best content for her followers. The influencer, who is also the wife of film actorShahid Kapoor, is presently in Duba… [+1433 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Eid-ul-Fitr 2022: Moon Sighting date and timings in India, Saudi Arabia, UAE", "description": "Eid-ul-Fitr 2022 Moon Sighting Date and Timing in India, UAE, Saudi Arabia: Special prayers are offered upon the sighting of the moon, after which people dress up in their best clothes and welcome their friends and family", "url": "https://indianexpress.com/article/lifestyle/life-style/eid-ul-fitr-2022-moon-sighting-date-and-timings-in-india-saudi-arabia-uae-7890907/", "urlToImage": "https://images.indianexpress.com/2022/04/eid-festival-1200-1.jpg", "publishedAt": "2022-05-01T04:45:59Z", "content": "Eid-ul-Fitr 2022 Moon Sighting Date and Timing: While the exact date is dependent on the sighting of the moon, it is expected that the event will begin on Tuesday, May 3, in India and Saudi Arabia, U… [+1062 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pune: Student beaten up during Traditional Day function at Sinhgad College, four men arrested", "description": "The arrested men allegedly forced Atharva Choudhary to sit on a two-wheeler and took him to a lane outside the college where they thrashed him with bamboo sticks. They also allegedly threatened other people and shop-keepers at the spot.", "url": "https://indianexpress.com/article/cities/pune/pune-student-beaten-up-during-traditional-day-function-at-sinhgad-college-four-men-arrested-7895856/", "urlToImage": "https://images.indianexpress.com/2022/04/ARREST-1-5-3-1.jpg", "publishedAt": "2022-05-01T04:40:55Z", "content": "A HISTORY-SHEETER and his aides have been arrested for allegedly beating up a student during the Traditional Day function on the premises of Sinhgad College of Arts, Commerce and Science, at Ambegaon… [+1057 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Barcelona face Lyon in Women’s Champions League final", "description": "The titleholder will face seven-time champion Lyon in the final on May 21 in Turin, Italy.", "url": "https://indianexpress.com/article/sports/football/barcelona-face-lyon-in-womens-champions-league-final-7895885/", "urlToImage": "https://images.indianexpress.com/2022/03/Untitled-design-4-7.jpg", "publishedAt": "2022-05-01T04:37:34Z", "content": "Defending champion Barcelona reached the Women’s Champions League final at the expense of its perfect season.Barcelona lost the second-leg semifinal to Wolfsburg 2-0 in Germany but advanced 5-3 on ag… [+1366 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Hubble and Spitzer data of 25 hot Jupiters helps explain exoplanet atmospheres", "description": "Until recently, the field of exoplanet science has long focused on just the detection and characterisation of exoplanets. This new study offers interesting insights into the atmospheres of exoplanets.", "url": "https://indianexpress.com/article/technology/science/hubble-and-spitzer-data-of-25-hot-jupiters-helps-researchers-learn-about-exoplanet-atmospheres-7895806/", "urlToImage": "https://images.indianexpress.com/2022/05/25-hot-jupiters-hubble-spitzer-data-exoplanet-atmospheres.jpg", "publishedAt": "2022-05-01T04:33:03Z", "content": "A team of astronomers has analysed the Hubble Space Telescopes observations of over 25 hot Jupiters to answer five questions that are essential for your understanding of exoplanet atmospheres. Hot Ju… [+2599 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "‘No Muslim woman wants husband to bring 3 wives’: Assam CM bats for UCC as Owaisi opposes", "description": "\"We are against it. The Law Commission has also said that Uniform Civil Code (UCC) is not needed in India,\" AIMIM chief Asaduddin Owaisi said. Assam Chief Minister Himanta Biswa Sarma, meanwhile, spoke in favour of UCC, asserting that it's an issue for all Mu…", "url": "https://indianexpress.com/article/india/uniform-civil-code-assam-himanta-biswa-sarma-asaduddin-owaisi-7895578/", "urlToImage": "https://images.indianexpress.com/2022/05/sarma-owaisi.jpg", "publishedAt": "2022-05-01T04:31:11Z", "content": "AIMIM chief Asaduddin Owaisi Saturday opposed the Uniform Civil Code (UCC), saying it was “not required in India” as chief ministers of several BJP-ruled states have expressed willingness to implemen… [+2154 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "When Ajith Kumar recalled his love story: ‘I cut Shalini’s wrist by accident, it started there’", "description": "Ajith Kumar's birthday: As the actor turns 51, we look at an old interview in which he had described his wife Shalini as his main support system and worst critic.", "url": "https://indianexpress.com/article/entertainment/tamil/happy-birthday-ajith-kumar-his-love-story-shalini-7894258/", "urlToImage": "https://images.indianexpress.com/2022/03/ajith1200.jpg", "publishedAt": "2022-05-01T04:30:54Z", "content": "Tamil superstar Ajith Kumar has turned 51 today. The star is notorious for his elusiveness. It has been a long time since he gave an interview of any sort to the media. He’s kind of old-school when i… [+2263 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rohan Naahar", "title": "The 8 most underrated films of April and where to watch them", "description": "Here's a list of the best films from April that you must check out; the list includes a breakneck action film that bombed at the box office, an animated stunner from one of the best filmmakers alive, and a standup special that truly belongs in the same catego…", "url": "https://indianexpress.com/article/entertainment/hollywood/top-films-april-where-to-watch-netflix-amazon-prime-mubi-7893251/", "urlToImage": "https://images.indianexpress.com/2022/04/april-top-picks.jpg", "publishedAt": "2022-05-01T04:30:24Z", "content": "What a terrific month for films April has been. After a rather lean March, the last 30 days have been so excellent in terms of quality, you could be forgiven for thinking that we’re in the thick of a… [+4855 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Russia Ukraine War Live Updates: Volodymyr Zelenskyy urges Russian troops not to fight, discusses UN’s Mariupol evacuation efforts with UK PM", "description": "Russia Ukraine War Live Updates: An estimated 1,00,000 civilians remain in the city, and up to 1,000 are living beneath a sprawling Soviet-era steel plant in Mariupol, according to Ukrainian officials.", "url": "https://indianexpress.com/article/world/russia-ukraine-war-live-updates-volodymyr-zelenskyy-mariupol-evacuation-7895612/", "urlToImage": "https://images.indianexpress.com/2022/04/ukraine-1-7.jpg", "publishedAt": "2022-05-01T04:28:41Z", "content": "Hollywood actress and UN humanitarian Angelina Jolie made a surprise visit to the western Ukrainian city of Lviv, the Lviv regional governor said on Telegram. According to Maksym Kozytskyy, Jolie - w… [+925 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "GPAT 2022 answer key released, here’s how to raise objections", "description": "The candidates, who are not satisfied with the answer key, may challenge the provisional answer key by paying a non-refundable fee of Rs 200 per question. Candidates can raise objections till May 2.", "url": "https://indianexpress.com/article/education/nta-gpat-answer-key-2022-released-gpat-nta-nic-in-7895812/", "urlToImage": "https://images.indianexpress.com/2021/03/GPAT-answer-key-1200.jpg", "publishedAt": "2022-05-01T04:21:29Z", "content": "NTA GPAT answer key 2022: How to check\r\nStep 1: Visit the official website i.e ntagpat.nic.in\r\nStep 2: Click on download answer keys\r\nStep 3: Enter registration number, roll number\r\nStep 4: Answer ke… [+872 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aksheev Thakur", "title": "Lakes of Bengaluru: At Rs 2.5 crore, Hoodi Lake is now a rejuvenated waterbody", "description": "However, a high-tension cable tower has been installed in the middle of the water body which the BBMP officials said cannot be removed now.", "url": "https://indianexpress.com/article/cities/bangalore/lakes-of-bengaluru-at-rs-2-5-crore-hoodi-lake-is-now-a-rejuvenated-waterbody-7895754/", "urlToImage": "https://images.indianexpress.com/2022/05/Devarakere-Lake.jpeg", "publishedAt": "2022-05-01T04:20:58Z", "content": "Last year, the Hoodi Lake located in the Hoodi village under the Mahadevapura zone was restored at a cost of Rs 2.5 crore. While the Bruhat Bengaluru Mahanagara Palike (BBMP) diverted the sewage and … [+1710 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Are the next global tennis stars among these tweens?", "description": "The search for elite players is so competitive that IMG, the agency that once ruled tennis, is cultivating preteens to find the next prodigy, giving kids access to representatives from the pro tours and Nike.", "url": "https://indianexpress.com/article/sports/tennis/are-the-next-global-tennis-stars-among-these-tweens-7895733/", "urlToImage": "https://images.indianexpress.com/2022/05/Untitled-design-9.jpg", "publishedAt": "2022-05-01T04:20:29Z", "content": "Behold Dominik Defoe. Ten years old and barely taller than the net. Golden-brown, shoulder-length curls bouncing in the air as he chases and crushes tennis balls, which he does better than just about… [+8914 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "KGF 2 crosses Rs 1000 crore worldwide, becomes only the fourth Indian movie to do so", "description": "KGF 2 has exceeded already sky-high expectations to become a global hit at the box office, and even new releases for two weeks have not managed to make a dent into its earnings. Now, it has crossed the Rs 1000 crore mark worldwide.", "url": "https://indianexpress.com/article/entertainment/regional/kgf-2-crosses-rs-1000-crore-worldwide-only-fourth-indian-movie-7895818/", "urlToImage": "https://images.indianexpress.com/2022/05/KGF-2-1200.jpg", "publishedAt": "2022-05-01T04:19:13Z", "content": "From the day of its release, Yash-starrer sequel to 2018’s KGF, titled KGF Chapter 2or simply KGF 2, has exceeded already sky-high expectations to become a global hit at the box office, and even new … [+1370 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuj Bhatia", "title": "I tried the OnePlus Nord Buds and they were surprisingly good for the price", "description": "For those of us who want a general pair of earbuds that offer good overall sound and long battery life, I feel the Nord Buds will fit the bill.", "url": "https://indianexpress.com/article/technology/tech-reviews/oneplus-nord-buds-review-7895752/", "urlToImage": "https://images.indianexpress.com/2022/05/VCC.jpg", "publishedAt": "2022-05-01T04:14:24Z", "content": "My expectation from a pair of truly wireless earbuds is rather simple. I need them to be comfortable, fit well into my ears, sound just right for my mood, and have enough battery life to get me throu… [+4299 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Second bombing in two days in Kabul on eve of Eid al-Fitr holiday", "description": "Islamic state claimed responsibility for the attack on Saturday, according to the group's telegram channel.", "url": "https://indianexpress.com/article/world/second-bombing-in-two-days-in-kabul-on-eve-of-eid-al-fitr-holiday-7895725/", "urlToImage": "https://images.indianexpress.com/2022/05/KABUL-1.jpg", "publishedAt": "2022-05-01T04:01:04Z", "content": "A bomb blast in a passenger van in Kabul on Saturday killed at least one person, officials said, in the second explosion in the Afghan capital in two days, as security concerns rise on the eve of the… [+1502 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Ranbir Kapoor, mom Neetu Kapoor attempt Laal Singh Chaddha’s ‘feather challenge’; fans can’t get over his cuteness", "description": "Ranbir Kapoor, mom Neetu Kapoor attempted the Laal Singh Chaddha feather challenge, and the fans could not take their eyes off Ranbir.", "url": "https://indianexpress.com/article/entertainment/bollywood/ranbir-kapoor-neetu-kapoor-laal-singh-chaddha-feather-challenge-7895662/", "urlToImage": "https://images.indianexpress.com/2022/05/laal-singh-chaddha.jpg", "publishedAt": "2022-05-01T03:56:38Z", "content": "Actor Ranbir Kapoor and mother Neetu Kapoor spent some time together on Rishi Kapoor’s death anniversary on Saturday. The family went out for dinner in the memory of the late star and from the outing… [+1709 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi: SDMC steps up Covid preparedness, to provide month’s medicines to chronic disease patients", "description": "Delhi News: The civic agency has set up separate registration counters, waiting rooms, queues for medical consultations, dedicated lab testing facilities, and counters for free distribution of medicines for suspected Covid-19 patients besides making people aw…", "url": "https://indianexpress.com/article/cities/delhi/delhi-sdmc-steps-up-covid-preparedness-to-provide-months-medicines-to-chronic-disease-patients-7895677/", "urlToImage": "https://images.indianexpress.com/2022/05/COVID-7.jpg", "publishedAt": "2022-05-01T03:51:12Z", "content": "With the uptick in the number of Covid-19 cases in the national capital, the South Delhi Municipal Corporation (SDMC) has stepped up its preparedness to control the spread of the virus.The civic agen… [+1957 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Dravidar Kazhagam members held for bid to tar Hindi letters at railway station in Chennai", "description": "The members, who came in a procession from DK's office nearby, to efface the Hindi letters during a protest against the imposition of Hindi were detained by the police before they could reach the railway station.", "url": "https://indianexpress.com/article/cities/chennai/dravidar-kazhagam-members-held-for-bid-to-tar-hindi-letters-at-railway-station-in-chennai-7895674/", "urlToImage": "https://images.indianexpress.com/2022/05/ki.veeramani.jpg", "publishedAt": "2022-05-01T03:45:57Z", "content": "The Dravidar Kazhagam (DK) members led by its president K Veeramani were detained by the police for attempting to tar the Hindi letters on the signboards at the Egmore railway station here on Saturda… [+682 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Bangladeshi director Shabnam Ferdousi at KIFF: Earthiness, spirit of ‘two Bengal’ should be captured in films", "description": "Addressing a press meet on Friday, the filmmaker, who has helmed over 30 documentaries, said she had been inspired by the craft of directors like Buddhadev Dasgupta and Goutam Ghosh, the \"innate lyricism\" in their works.", "url": "https://indianexpress.com/article/entertainment/entertainment-others/bangladeshi-director-shabnam-ferdousi-at-kiff-earthiness-spirit-of-two-bengal-should-be-captured-in-films-7895618/", "urlToImage": "https://images.indianexpress.com/2022/05/ajab-karkhana-1200.jpeg", "publishedAt": "2022-05-01T03:40:23Z", "content": "Bangladeshi director , whose Ajob Karkhana (Song of the soul) is the sole representation from her country at the ongoing 27th Kolkata International Film Festival (KIFF), said there was an immediate n… [+1943 chars]"}]}