{"status": "ok", "totalResults": 654, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Jagpreet Singh Sandhu", "title": "‘Kids can’t be allowed to be the score to settle personal egos of parents’", "description": "While disposing her plea, the single bench had directed the Police Commissioner, Amritsar to decide her representation within a period of wight weeks, as her application with similar grievance was pending before the Punjab Police.", "url": "https://indianexpress.com/article/cities/chandigarh/kids-cant-be-allowed-to-be-the-score-to-settle-personal-egos-of-parents-7895497/", "urlToImage": "https://images.indianexpress.com/2022/04/Punjab-and-Haryana-HC-2.jpeg", "publishedAt": "2022-04-30T22:45:08Z", "content": "Holding that the custody of the children cannot be allowed to be the score to settle personal egos of parents, the Punjab and Haryana High Court has dismissed an appeal filed by woman challenging a s… [+3321 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Raakhi Jagga", "title": "Punjab: 33% more demand for power in April this year; PSPCL says didn’t falter in supply", "description": "Unscheduled power cuts and curbs on industry were imposed during these days only, they claimed.", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-33-more-demand-for-power-in-april-this-year-pspcl-says-didnt-falter-in-supply-7895494/", "urlToImage": "https://images.indianexpress.com/2022/04/power22-5-1-1.jpg", "publishedAt": "2022-04-30T22:31:49Z", "content": "Punjab witnessed a 33% surge in its power demand in April (between April 1 and April 28) this year, as compared to the same period last year, with Punjab State Power Corporation Limited (PSPCL) claim… [+3280 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aakash Joshi", "title": "French Ambassador looks at India, Raghu Rai at France, in black, white and grey", "description": "Despite the lack of colour, or perhaps because of it, Lenain’s shots of India during the pandemic’s devastating second wave, his celebration of the country as a living thing, even its chaos, manage to capture the sheer scale of its diversity.", "url": "https://indianexpress.com/article/lifestyle/art-and-culture/french-ambassador-looks-at-india-raghu-rai-at-france-in-black-white-and-grey-7895469/", "urlToImage": "https://images.indianexpress.com/2022/05/raghu-1.jpg", "publishedAt": "2022-04-30T22:30:53Z", "content": "US rapper Eminem may be a little removed from Raghu Rai, one of Indias most celebrated photographers, and Emmanuel Lenain, Frances Ambassador to India. Yet his words define, in a sense, the essence o… [+4902 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "P Chidambaram", "title": "Indianness is citizenship, not caste", "description": "If we equate caste with Indianness, we will find ourselves on a dangerous slope. I have no illusion that caste consciousness or caste-based discrimination will vanish overnight, but there are encouraging trends toward getting rid of the caste system... To equ…", "url": "https://indianexpress.com/article/opinion/columns/indianness-is-citizenship-not-caste-7895433/", "urlToImage": "https://images.indianexpress.com/2022/04/modi-18.jpg", "publishedAt": "2022-04-30T22:29:18Z", "content": "A few days ago, I was startled to read a screaming headline in several newspapers: Indianness the Only Caste. It was the headline of a story reporting the speech of the Prime Minister when inaugurati… [+5402 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Chandigarh: Bulldozers, 2000 cops to move into Colony No 4 today", "description": "All the successful 290 applicants are advised to attend the camp with their following documents etc.", "url": "https://indianexpress.com/article/cities/chandigarh/chandigarh-bulldozers-2000-cops-to-move-into-colony-no-4-today-7895490/", "urlToImage": "https://images.indianexpress.com/2022/05/qq.jpg", "publishedAt": "2022-04-30T22:22:56Z", "content": "Colony number 4 is set to be demolished on Sunday in the presence of 10 executive magistrates and almost 2,000 police personnel. The administration has also imposed Section 144 of CrPC, prohibiting t… [+811 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Leher Kala", "title": "Legs matter, more than they should", "description": "The mini-skirt has been visible onscreen in Hindi films since the 1960s. One of the first and most memorable images is of Dimple Kapadia wearing a polka dotted top with a short, black skirt in Bobby —perhaps the first “good girl” to flash ample leg in a movie…", "url": "https://indianexpress.com/article/opinion/columns/legs-matter-more-than-they-should-7895452/", "urlToImage": "https://images.indianexpress.com/2020/07/GettyImages-ethnic-divide-life-positive_1200.jpg", "publishedAt": "2022-04-30T22:14:45Z", "content": "Its been thirty years since the crossing, or technically, uncrossing of legs on screen scandalized the world, yet, the provocative scene from the movie Basic Instinct continues to be a frame of refer… [+3549 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Acting on plea, Bar Council of India puts on hold election result", "description": "The BCI acted on the plea of Vijender Ahlawat, former BCPH chairman, and five other members, who had challenged the resolution taken by the BCPH on April 25.", "url": "https://indianexpress.com/article/cities/chandigarh/acting-on-plea-bar-council-of-india-puts-on-hold-election-result-7895489/", "urlToImage": "https://images.indianexpress.com/2022/03/Punjab-and-Haryana-HC-2.jpeg", "publishedAt": "2022-04-30T22:02:46Z", "content": "The Bar Council of India (BCI) has stayed the results of the election of the Bar Council of Punjab and Haryana (BCPH) wherein the different posts of the BCPH were elected.On April 25, the BCPH had an… [+1496 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Suraj Yengde", "title": "Why they are afraid of Jignesh Mevani", "description": "Mevani represents the state of the ordinary public, who look at him as their hero fighting for their rights. Though Mevani is an Independent legislator, he has a nationwide reach.", "url": "https://indianexpress.com/article/opinion/columns/why-they-are-afraid-of-jignesh-mevani-7895447/", "urlToImage": "https://images.indianexpress.com/2022/04/jignesh.jpg", "publishedAt": "2022-04-30T22:01:39Z", "content": "The Bharatiya Janata Party acts like the bullock who thinks of himself as the owner of the farm. Least does it know that the real tamer of the bullock is the owner who is holding the leash. The owner… [+4369 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Saurabh Parashar", "title": "‘Don’t ignore us’: Councillors lash out at civic body officials", "description": "The Aam Aadmi Party’s leader of Opposition, Yogesh Dhingra, said, “We are the voice of the people. People send us to the House with great hopes. But here, we have been sidelined. It is not good.”", "url": "https://indianexpress.com/article/cities/chandigarh/dont-ignore-us-councillors-lash-out-at-civic-body-officials-7895488/", "urlToImage": "https://images.indianexpress.com/2022/04/Express-Representational-Image-32.jpeg", "publishedAt": "2022-04-30T21:58:19Z", "content": "Councillors from all parties hit hard at the officials of the Municipal Corporation (MC) and blamed them for ignoring the elected representatives of the people, while deciding the terms and condition… [+1480 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "George Mathew", "title": "No polls, no problem for donors: Parties get Rs 648.48 crore of electoral bonds in April", "description": "Political parties encashed bonds worth Rs 9,836 crore since 2018", "url": "https://indianexpress.com/article/business/economy/no-polls-no-problem-for-donors-parties-get-rs-648-48-crore-of-electoral-bonds-in-april-7895450/", "urlToImage": "https://images.indianexpress.com/2022/05/electoral-bonds1.jpg", "publishedAt": "2022-04-30T21:54:28Z", "content": "Political parties continue to get funds from benevolent donors even during the non-election period, as they received electoral bonds worth Rs 648.48 crore from donors this April, as per data from Sta… [+3326 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Saurabh Parashar", "title": "Chandigarh civic body meet lays bare cracks in AAP’s House unity", "description": "The possibility of corruption cannot be ruled out, given the manner in which AAP councillors gave their accent in the favor of agenda.", "url": "https://indianexpress.com/article/cities/chandigarh/chandigarh-civic-body-meet-lays-bare-cracks-in-aaps-house-unity-7895485/", "urlToImage": "https://images.indianexpress.com/2022/05/chd.jpg", "publishedAt": "2022-04-30T21:54:09Z", "content": "THE DIFFERENCES within Aam Adami Party (AAP) councillors came to light when at least four AAP councillors gave their nod approving a supplementary agenda, ignoring their own councillors including the… [+2584 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Nirupama Subramanian", "title": "Why Lanka’s failed dairy experiment is glass half full", "description": "Crippled by an acute shortage of dollars, Sri Lanka has restricted all its imports, including essential food items. At the time Kurien ventured into Sri Lanka, the country’s annual milk powder import bill was $60 million.", "url": "https://indianexpress.com/article/opinion/columns/why-lankas-failed-dairy-experiment-is-glass-half-full-7895437/", "urlToImage": "https://images.indianexpress.com/2022/04/Rambukkana-.jpg", "publishedAt": "2022-04-30T21:52:26Z", "content": "It was sometime in 1997. In Colombo, in the basement banquet hall of a five-star hotel, the milk man of India was addressing a press conference to announce a $20 million joint venture between the Nat… [+5001 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tavleen Singh", "title": "Stop this violence", "description": "Mohan Bhagwat deserves respect for saying what he did. What is very hard to understand is why it was not the Prime Minister who took the lead in saying something about the deliberate targeting of the Muslim community by his chief ministers, ministers, acolyte…", "url": "https://indianexpress.com/article/opinion/columns/stop-this-violence-7895436/", "urlToImage": "https://images.indianexpress.com/2022/04/Mohan-Bhagwat-2.jpg", "publishedAt": "2022-04-30T21:34:57Z", "content": "Just before I sat down to write this piece, the head of the RSS made a very important statement. He said, Violence does not benefit anybody. The society to which violence is dear is now counting its … [+5068 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manoj C G", "title": "Centre says no to CJI plan for national infrastructure panel, jobs for retired HC judges", "description": "Agreement on state-level bodies with CMs, CJs, says Rijiju", "url": "https://indianexpress.com/article/india/centre-says-no-to-cji-plan-for-national-infrastructure-panel-jobs-for-retired-hc-judges-7895483/", "urlToImage": "https://images.indianexpress.com/2022/05/CMs-4col.jpg", "publishedAt": "2022-04-30T21:31:35Z", "content": "Two proposals by Chief Justice of India N V Ramana didnt find favour with the Centre and some BJP-ruled states at the conference of Chief Justices and Chief Ministers Saturday: a statutory authority … [+5306 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "United, we will give BJP & MNS befitting reply: MVA", "description": "Sawant said the Modi government was misusing central agencies like the Enforcement Directorate by filing false cases against ministers and leaders of MVA.", "url": "https://indianexpress.com/article/cities/pune/united-we-will-give-bjp-mns-befitting-reply-mva-7895481/", "urlToImage": "https://images.indianexpress.com/2022/05/pune.jpg", "publishedAt": "2022-04-30T21:26:01Z", "content": "THE THREE key constituents of Maha Vikas Aghadi (MVA) Congress, NCP and Shiv Sena and smaller parties in the alliance held a rally in Pune on Saturday to send out a message that attempts by the BJP a… [+2450 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Parthasarathi Biswas", "title": "Pune: Agricultural marketing board aims to treat 2,000 tonnes of mangoes for export this season", "description": "Located near the Agricultural Produce Marketing Committee (APMC), the MSAMB’s facility in Vashi for exports has necessary infrastructure for exporters to send their fruits to foreign destinations.", "url": "https://indianexpress.com/article/cities/pune/agricultural-marketing-board-aims-to-treat-2000-tonnes-of-mangoes-for-export-this-season-7895480/", "urlToImage": "https://images.indianexpress.com/2022/04/MANGO-1.jpg", "publishedAt": "2022-04-30T21:06:58Z", "content": "The Maharashtra State Agricultural Marketing Board aims to treat nearly 2,000 tonnes of mangoes in its facility in Vashi for exports between April and July this year.Bhaskar Patil, DGM, Vapour Heat T… [+2804 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Navjeevan Gopal", "title": "Police failed to gauge threats, social media build-up flagged by intel", "description": "Things normalised Saturday following a curfew the night before and suspension of Internet services during the day.", "url": "https://indianexpress.com/article/cities/chandigarh/police-failed-to-gauge-threats-social-media-build-up-flagged-by-intel-7895473/", "urlToImage": "https://images.indianexpress.com/2022/05/aa.jpg", "publishedAt": "2022-04-30T20:55:15Z", "content": "The Punjab government Saturday shunted out the top brass of Patiala police, including an Inspector General, even as the district limped back to normalcy with security personnel keeping a tight vigil … [+4327 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aranya Shankar", "title": "Part of ceiling collapses at KMC, injured professor demands structural audit", "description": "Principal Vibha Chauhan said the matter had already been dealt with: “The false ceiling is what seems to have mainly fallen off. I don’t think it was fixed properly. The college contacted the person who renovated it and he’s been asked to redo it. Thankfully …", "url": "https://indianexpress.com/article/cities/delhi/part-of-ceiling-collapses-at-kmc-injured-professor-demands-structural-audit-7895472/", "urlToImage": "https://images.indianexpress.com/2018/07/delhi-university-1200.jpg", "publishedAt": "2022-04-30T20:13:28Z", "content": "A part of the ceiling fell on the head of a professor at Kirori Mal College Friday. Geography professor Seema Parihar, who sustained bruises on her head and arm, said a structural audit of the colleg… [+1775 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Adrija Roychowdhury", "title": "How Shanti Niketan and Vasant Vihar came up for retd central govt officers", "description": "The colony of Shanti Niketan, lying close to the diplomatic enclave of Chanakyapuri, was built on the request of a few government servants, for allotment of some land at a subsidised rate for their post-retirement years.", "url": "https://indianexpress.com/article/cities/delhi/how-shanti-niketan-and-vasant-vihar-came-up-for-retd-central-govt-officers-7895467/", "urlToImage": "https://images.indianexpress.com/2022/05/1234.jpg", "publishedAt": "2022-04-30T20:05:48Z", "content": "In the mid-1950s when Padma Chib (85) reached Japan with her husband after a 26-day journey on the ship from Calcutta, she received a letter from her father-in-law who was in Chandigarh at that time,… [+5295 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Soumyarendra Barik", "title": "Semiconductor scheme a 20-plus year plan; global cos including India as core focus: Ashwini Vaishnaw", "description": "He also spoke about how the government plans to encourage domestic manufacturers to build capacity in this space.", "url": "https://indianexpress.com/article/business/economy/semiconductor-scheme-interview-minister-of-electronics-information-technology-ashwini-vaishnaw-7895466/", "urlToImage": "https://images.indianexpress.com/2022/05/ashwini-.jpg", "publishedAt": "2022-04-30T19:59:04Z", "content": "Stipulating that only four months have passed since the programme to invite semiconductor manufacturers to set up base in India was launched, Minister of Electronics &amp; Information Technology Ashw… [+2841 chars]"}]}