{"status": "ok", "totalResults": 579, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Sukhbir Siwach", "title": "Haryana officers turn ‘guardians’ of villages", "description": "Deepika, who studied at JNU, added: “Under this scheme, I along with village sarpanch Nazma Khan ensured that no genuine labourer is left out from the benefit of MGNREGA scheme.", "url": "https://indianexpress.com/article/cities/chandigarh/haryana-officers-turn-guardians-of-villages-7896761/", "urlToImage": "https://images.indianexpress.com/2022/05/chhh.jpg", "publishedAt": "2022-05-01T22:23:50Z", "content": "It was five years ago that a state civil services officer, Deepika Chuadhary, first visited Dhauj village of Faridabad district when the then deputy commissioner Chander Shekhar, an IAS officer, aske… [+3045 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Hooda, Bhan hold ‘Vipaksh Aapke Samaksh’ programme", "description": "“People of Haryana have been hit hard by the acute power crisis in the state caused by the short-sightedness of the anti-people BJP-JJP government. Government has pushed the state into an abyss due to their ill-conceived policies”, Hooda said while launching …", "url": "https://indianexpress.com/article/cities/chandigarh/hooda-bhan-hold-vipaksh-aapke-samaksh-programme-7896759/", "urlToImage": "https://images.indianexpress.com/2022/04/Hooda-Bhan.jpg", "publishedAt": "2022-05-01T22:09:36Z", "content": "In the first display of unity, CLP leader Bhupinder Singh Hooda and HPCC president Udai Bhan held a Vipaksh Aapke Samaksh programme in Faridabad on Sunday.Earlier, Hooda had been conducting these pro… [+3214 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shubhajit Roy", "title": "Explained: The significance of PM Modi’s Europe tour", "description": "Modi will be visiting Germany, Denmark and France from today. What will be on the table in the context of the Ukraine crisis, and economic and defence ties?", "url": "https://indianexpress.com/article/explained/explained-the-significance-of-pm-modis-europe-tour-7896689/", "urlToImage": "https://images.indianexpress.com/2022/05/Modi-3-1-1-2.jpg", "publishedAt": "2022-05-01T22:05:18Z", "content": "Prime Minister Narendra Modi is travelling to Germany, Denmark and France from May 2 to 4. His first foreign trip this year, it comes at a time when a war in the heart of Europe has upended seven dec… [+6588 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "UP: Kin says woman died after cops’ assault; probe ordered", "description": "The alleged incident took place on Sunday around 4 pm when a police team had gone to Kanhaiya Yadav’s house at Manrajpur village in Chandauli to arrest him after a non-bailable warrant was issued against him.", "url": "https://indianexpress.com/article/cities/lucknow/up-kin-says-woman-died-after-cops-assault-probe-ordered-7896757/", "urlToImage": "https://images.indianexpress.com/2022/05/IE-79-1.jpeg", "publishedAt": "2022-05-01T22:04:33Z", "content": "The Chandauli SP on Sunday ordered a probe into the allegations of a police team manhandling two daughters of a criminal during a raid, leading to the death of one in Sayedraja area of the district.T… [+894 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Surjewala cites ‘power crisis’: Attempt to hide Cong’s internal strife, says power minister", "description": "Hitting back, Chautala termed Surjewala’s allegations of giving free electricity to Adani as “baseless and beyond facts” while insisting that “Haryana has nothing to do with the flow of the said ‘Mundra-Mahendergarh High Voltage Direct Current Line’.”", "url": "https://indianexpress.com/article/cities/chandigarh/surjewala-cites-power-crisis-attempt-to-hide-congs-internal-strife-says-power-minister-7896756/", "urlToImage": "https://images.indianexpress.com/2020/11/Ranjit-Singh-Chautala.jpg", "publishedAt": "2022-05-01T22:02:41Z", "content": "After senior Congress leader Randeep Singh Surjewala criticised the Khattar government on the ongoing power crisis in the state, Haryana power minister Ranjit Singh Chautala Sunday termed it an attem… [+2716 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manish Sahu", "title": "Post-mortem report rules out rape of Unnao nurse: police", "description": "The police said the vaginal swab of the nurse would be sent for further examination. “So far, we have not found any evidence against the nursing home owners named in the FIR. It appears to be a suicide case. The investigation is on,” said the Additional SP.", "url": "https://indianexpress.com/article/cities/lucknow/post-mortem-report-rules-out-rape-of-unnao-nurse-police-7896749/", "urlToImage": "https://images.indianexpress.com/2022/05/cop-2-1-1.jpg", "publishedAt": "2022-05-01T21:55:42Z", "content": "Unnao police on Sunday said that the post-mortem report of an 18-year-old nurse, whose body was found hanging under mysterious circumstances from a wall of a nursing home on Saturday morning, did not… [+1491 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "Palm oil lessons", "description": "Ukraine work forces rethink on hyper-globalisation. Nations need to de-risk against overdependence on few suppliers.", "url": "https://indianexpress.com/article/opinion/editorials/palm-oil-lessons-7896638/", "urlToImage": "https://images.indianexpress.com/2022/04/editorial-38.jpeg", "publishedAt": "2022-05-01T21:54:53Z", "content": "In a hyper-globalised world, countries would largely produce things in which they have comparative advantage and import those others can make at lower opportunity cost. That idea, going back to the 1… [+2566 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anju Agnihotri Chaba", "title": "Explained: Why farmers in Punjab are burning wheat stubble when rate of dry fodder is so high?", "description": "Experts said that in December last year when reports came that the area under wheat coverage had gone down to some extent in several states in the 2021-22 Rabi sowing season, several big traders started storing dry fodder and the rates also started shooting u…", "url": "https://indianexpress.com/article/explained/explained-why-farmers-in-punjab-are-burning-wheat-stubble-when-rate-of-dry-fodder-is-so-high-7896752/", "urlToImage": "https://images.indianexpress.com/2022/05/punjab-explained.jpg", "publishedAt": "2022-05-01T21:54:14Z", "content": "Tudi, which is made from wheat stubble, is considered to be the best dry fodder for cattle because of its nutritional value. So when wheat yield is down this year, the rate of tudi is very high and f… [+5360 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "Letter and spirit", "description": "Access to justice framed conversation at meet presided by PM, CJI. Executive and judiciary must work together to realise it.", "url": "https://indianexpress.com/article/opinion/editorials/letter-and-spirit-4/", "urlToImage": "https://images.indianexpress.com/2022/04/editorial-38.jpeg", "publishedAt": "2022-05-01T21:50:04Z", "content": "Three pressing issues framed the discussions at the Joint Conference of Chief Ministers and Chief Justices of High Courts on Saturday, which was presided over by Prime Minister Narendra Modi and Chie… [+2683 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "K P Nayar", "title": "What to expect from India’s new foreign secretary", "description": "Observing the minutest of details is first nature to Vinay Mohan Kwatra.", "url": "https://indianexpress.com/article/opinion/columns/what-to-expect-from-indias-new-foreign-secretary/", "urlToImage": "https://images.indianexpress.com/2022/05/vinay.png", "publishedAt": "2022-05-01T21:46:54Z", "content": "A diplomat who had the shortest tenure in history in Pakistan has become Indias foreign secretary. Vinay Mohan Kwatra went to Karachi as Consul in May 1993 but returned after just five months.It was … [+4057 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Khattar launches Amrit Sarovar Mission from Sonipat village", "description": "There are 18,000 ponds in Haryana, of which 4,000 are filled with rainwater, while 6,000 are filled with water for animal use and 8,000 ponds are filled with dirty water, which will be treated.", "url": "https://indianexpress.com/article/cities/chandigarh/khattar-launches-amrit-sarovar-mission-from-sonipat-village-7896751/", "urlToImage": "https://images.indianexpress.com/2022/04/KHATTAR.jpg", "publishedAt": "2022-05-01T21:45:35Z", "content": "Just as Bhagirath with his dedicated efforts brought river Ganga from Heavens to Earth, similarly Prime Minister Narendra Modi, by launching the Amrit Sarovar Mission, has also made Bhagirath-like ef… [+2763 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shyam Saran", "title": "India must make the most of the diplomatic attention it’s receiving", "description": "A rare but perishable opportunity has presented itself to significantly advance India’s long-term prospects. It must be grasped with single-minded tenacity.", "url": "https://indianexpress.com/article/opinion/columns/india-must-make-the-most-of-the-diplomatic-attention-its-receiving-7896628/", "urlToImage": "https://images.indianexpress.com/2022/04/22-5.jpg", "publishedAt": "2022-05-01T21:43:42Z", "content": "India has witnessed a flurry of diplomatic activity during the past week with a long line of ministers, senior military officers and diplomats from a number of countries visiting Delhi and engaging w… [+6642 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Man Aman Singh Chhina", "title": "In a first, woman sportsperson enrolled in Army Military Police", "description": "Summy belongs to Haryana and will join the large number of women soldiers who have already joined the CMP and many of them are already deployed in field units.", "url": "https://indianexpress.com/article/cities/chandigarh/in-a-first-woman-sportsperson-enrolled-in-army-military-police-7896748/", "urlToImage": "https://images.indianexpress.com/2022/05/summy.jpg", "publishedAt": "2022-05-01T21:39:05Z", "content": "Breaking the male bastion in Army sports nodes and Mission Olympics of the services, for the first time a woman sportsperson has been enrolled as a soldier in the Corps of Military Police (CMP).Summy… [+3727 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Explained: A portable device that turns seawater into drinking water, without using filters", "description": "While other portable desalination units that require water to pass through filters, this device utilises electrical power to remove particles from drinking water.", "url": "https://indianexpress.com/article/explained/explained-a-portable-device-that-turns-seawater-into-drinking-water-without-using-filters-7896685/", "urlToImage": "https://images.indianexpress.com/2022/05/explained.jpg", "publishedAt": "2022-05-01T21:33:24Z", "content": "Massachusetts Institute of Technology (MIT) researchers have developed a portable desalination unit, weighing less than 10 kg, that can remove particles and salts to generate drinking water.WHAT IT D… [+2196 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Dr Wazir Singh Lakra awarded M S Johal Award", "description": "After his passing away, his family settled in the United States of America and students decided to initiate this annual award to continue his legacy by honouring an eminent fisheries scientist from India.", "url": "https://indianexpress.com/article/cities/chandigarh/dr-wazir-singh-lakra-awarded-m-s-johal-award-7896746/", "urlToImage": "https://images.indianexpress.com/2022/05/111.jpg", "publishedAt": "2022-05-01T21:17:50Z", "content": "A pioneer fisheries award was announced in the memory of renowned ichthyologist, Prof Mohinder Singh Johal, in Chandigarh.Prof Johal made exceptional contribution to the field of fish biology, ecolog… [+1855 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi Confidential: Chiefs’ Batch", "description": "First, as is known, is that he is the first Army Chief from the Corps of Engineers. Second, in a rare instance, the Chiefs of Navy and Air Force, too, were present at the ceremony along with their wives.", "url": "https://indianexpress.com/article/delhi-confidential/delhi-confidential-chiefs-batch-gen-manoj-pande-naravane-7896741/", "urlToImage": "https://images.indianexpress.com/2022/05/nav-dc.jpg", "publishedAt": "2022-05-01T21:11:40Z", "content": "AS THE new Army Chief Gen Manoj Pande received the Guard of Honour on Sunday morning in front of the South Block, some new precedents were set. First, as is known, is that he is the first Army Chief … [+2075 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Chandigarh Administration sets May 15 as target to ensure 100% vaccination", "description": "“As a fresh internal target, the health department, in close-coordination with the education department, has decided 100 percent vaccination of all the eligible children by May 15, 2022,” a statement issued by the administration said.", "url": "https://indianexpress.com/article/cities/chandigarh/admin-sets-may-15-as-target-to-ensure-100-vaccination-7896744/", "urlToImage": "https://images.indianexpress.com/2022/01/covid-19-2.jpg", "publishedAt": "2022-05-01T21:11:16Z", "content": "The Chandigarh Administration has set May 15,2022, as the target date to ensure 100 percent vaccination of all children, within the age group 12 to 18 years.The education department was also asked to… [+2261 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "‘The Saviour: Brig Pritam Singh’ wins best documentary award", "description": "Sibia says Singh was the true saviour of Poonch, whose story needed to be shared with the younger generation.", "url": "https://indianexpress.com/article/cities/chandigarh/the-saviour-brig-pritam-singh-wins-best-documentary-award-7896743/", "urlToImage": "https://images.indianexpress.com/2022/04/Image.180199feaf6207cf5f01.jpg", "publishedAt": "2022-05-01T21:04:47Z", "content": "A documentary-drama based on the life of the hero of the first war in Poonch, Brig Pritam Singh, won the Best Punjabi Documentary Award at the 12th Dada Saheb Phalke Film Festival 2022 held in Noida … [+1420 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mohali: Three ‘rob’ filling station staffer of Rs 30,000, fire shots in the air", "description": "“They were covering their faces. When I was filling fuel, they left the bike, approached me and snatched my purse which had around Rs 30,000,” Sunil Kumar alleged.", "url": "https://indianexpress.com/article/cities/chandigarh/mohali-three-rob-filling-station-staffer-of-rs-30000-fire-shots-in-the-air-7896742/", "urlToImage": "https://images.indianexpress.com/2022/05/Indian-express-1-3.jpg", "publishedAt": "2022-05-01T20:59:21Z", "content": "Three men allegedly snatched Rs 30,000 cash from an employee of a filling station and fired gunshots in the air in Lalru on Friday night. Police registered a case and initiated an investigation on Su… [+1195 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Hina Rohtaki", "title": "Chandigarh reclaims 65 acres of land as the oldest slum of city, Colony No. 4, razed to ground", "description": "The residents at the site said that the electricity and water supply connections were cut off in the wee hours, before the demolition, which is when they understood that they must quickly vacate their dwellings.", "url": "https://indianexpress.com/article/cities/chandigarh/ut-reclaims-65-acres-of-land-as-the-oldest-slum-of-city-colony-no-4-razed-to-ground-7896720/", "urlToImage": "https://images.indianexpress.com/2022/05/demolition.jpg", "publishedAt": "2022-05-01T20:55:15Z", "content": "About 65 acres of land worth Rs 2,000 crore was reclaimed on Sunday as Chandigarhs oldest and biggest slum colony Colony Number 4 was razed amid the a heavy police presence 2,000 personnel and 10 exe… [+4910 chars]"}]}