{"status": "ok", "totalResults": 698, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pune: Parents who kept their son confined in apartment with 22 dogs arrested, later granted bail", "description": "On Wednesday, the boy was shifted to an ‘observation home’ in Pune as per the directions of the Child Welfare Committee (CWC).", "url": "https://indianexpress.com/article/cities/pune/pune-parents-who-kept-their-son-confined-in-apartment-with-22-dogs-arrested-later-granted-bail-7914015/", "urlToImage": "https://images.indianexpress.com/2022/05/arrest-1-8.jpg", "publishedAt": "2022-05-12T12:36:25Z", "content": "Meanwhile, on Wednesday, the boy was shifted to an observation home in Pune as per the directions of the Child Welfare Committee (CWC). The members of the CWC also interacted with his parents against… [+2178 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Bashaarat Masood", "title": "Kashmiri Pandit employee shot dead inside tehsil office in J&K Budgam", "description": "This is the third attack on a member of a minority community in the Valley this year.", "url": "https://indianexpress.com/article/cities/srinagar/kashmiri-pandit-shot-dead-militants-govt-office-budgam-7914006/", "urlToImage": "https://images.indianexpress.com/2022/05/Kashmir-3.jpg", "publishedAt": "2022-05-12T12:29:52Z", "content": "Suspected militants on Thursday shot dead a Kashmiri Pandit employee in central Kashmirs Budgam district. The government employee was shot inside his office.On Thursday afternoon, militants barged in… [+2044 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "CBI dismisses four officials for extortion bid in Chandigarh", "description": "The dismissed officials allegedly threatened to implicate a businessman in a terrorism case and demanded Rs 25 lakh from him. The four were caught by the Chandigarh Police and handed over to the CBI Chandigarh zone.", "url": "https://indianexpress.com/article/india/cbi-dismisses-four-officials-extortion-bid-chandigarh-7913954/", "urlToImage": "https://images.indianexpress.com/2022/05/CBI-2-1.jpg", "publishedAt": "2022-05-12T12:28:42Z", "content": "The CBI has registered a case of corruption against the officials, identified as sub-inspectors Sumit Gupta, Pradeep Rana, Ankur Kumar and Akash Ahlawat. The arrested accused are being produced befor… [+2467 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Man Aman Singh Chinna", "title": "Explained: What are the Protected Mobility Vehicles that the Army wants to purchase?", "description": "Army Vehicles Explained: We explain what are PMVs, how are they utilised and who manufactures them.", "url": "https://indianexpress.com/article/explained/explained-what-are-the-protected-mobility-vehicles-that-the-army-wants-to-purchase-7913981/", "urlToImage": "https://images.indianexpress.com/2022/05/EXPLAINED-1.jpg", "publishedAt": "2022-05-12T12:27:50Z", "content": "The Army has floated a Request for Information (RFI) to purchase Protected Mobility Vehicles (PMV) for high-altitude areas and for deserts and plains. What are PMVs, how are they utilised and who man… [+2930 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Nikitin Dheer, Kratika Sengar Dheer welcome baby girl", "description": "Nikitin Dheer and Kratika Sengar Dheer got married in 2014. The couple welcomed their baby girl on Thursday.", "url": "https://indianexpress.com/article/entertainment/television/nikitin-dheer-kratika-sengar-dheer-welcome-baby-girl-7913978/", "urlToImage": "https://images.indianexpress.com/2022/05/nikitin-kratika-1200.jpg", "publishedAt": "2022-05-12T12:24:18Z", "content": "Actors Nikitin Dheer and Kratika Sengar Dheer welcomed a baby girl on Thursday.A statement from their spokesperson read, “To all their well wishers, Nikitin Dheer and Kratika Sengar Dheer have been b… [+999 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rohan Naahar", "title": "Our Father movie review: An unsettling true story gets upsetting Netflix treatment", "description": "Our Father movie review: Netflix's harrowing documentary doesn't fully explore the emotional fallout of its shocking true story, but it has important things to say about consent and trust.", "url": "https://indianexpress.com/article/entertainment/hollywood/our-father-movie-review-netflix-documentary-7913486/", "urlToImage": "https://images.indianexpress.com/2022/05/our-father-movie-review.jpg", "publishedAt": "2022-05-12T12:24:14Z", "content": "A small-town doctor with a God complex secretly impregnated dozens of unsuspecting women under the guise of using donor sperm. His crimes were uncovered after a woman with a hunch decided to take a D… [+3497 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "RS polls to 57 seats from 15 states on June 10: EC", "description": "Prominent among those retiring are Union minister Mukhtar Abbas Naqvi, Congress leaders Ambika Soni, Jairam Ramesh and Kapil Sibal, and BSP's Satish Chandra Misra.", "url": "https://indianexpress.com/article/india/india-news-india/rs-polls-to-57-seats-from-15-states-on-june-10-ec-7913968/", "urlToImage": "https://images.indianexpress.com/2022/04/11-4.jpg", "publishedAt": "2022-05-12T12:17:32Z", "content": "Elections will be held on June 10 to fill 57 Rajya Sabha seats from 15 states falling vacant due to the retirement of members on different dates between June and August, the Election Commission said … [+887 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Neha Banka", "title": "Explained: North Korea confirms Covid crisis, what happens in hermit country here onward?", "description": "Despite the crisis, Pyongyang may not necessarily be willing to accept help from foreign entities, including the UN, NK News said.", "url": "https://indianexpress.com/article/explained/explained-north-korea-covid-19-omicron-7913942/", "urlToImage": "https://images.indianexpress.com/2022/05/North-Korea-Covid-Main.jpg", "publishedAt": "2022-05-12T12:14:24Z", "content": "For over two years, North Korea claimed that it was free of Covid-19. That changed on Thursday (May 12), when state media made an unexpected announcement that the country was facing a “grave situatio… [+5233 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "SC to Haridwar dharam sansad accused: ‘Stay together peacefully, enjoy life’", "description": "Haridwar Dharam Sanasad:  The apex court, while hearing the bail application of former Uttar Pradesh Shia Waqf Board chairman Waseem Rizvi, now Jitendra Narayan Singh Tyagi, asks the Uttarakhand government what further investigation is required in the case in…", "url": "https://indianexpress.com/article/india/sc-to-haridwar-dharam-sansad-accused-stay-together-peacefully-enjoy-life-7913921/", "urlToImage": "https://images.indianexpress.com/2022/05/SC-1-2.jpg", "publishedAt": "2022-05-12T12:12:30Z", "content": "The Supreme Court on Thursday had a word of advice for the former Uttar Pradesh Shia Waqf Board chairman arrested in connection with alleged inflammatory speeches at a dharam sansad in Haridwar last … [+1255 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Retail inflation spikes to 7.79% in Apr; IIP grows 1.9% in Mar, shows govt data", "description": "CPI Inflation Rate April, IIP Growth Rate March 2022: The retail inflation, measured by the Consumer Price Index (CPI), rose to 7.79 per cent in April. Separately, the factory output, measured in terms of Index of Industrial Production (IIP), grew by 1.9 per …", "url": "https://indianexpress.com/article/business/economy/india-cpi-retail-inflation-april-iip-factory-output-march-2022-nso-mospi-govt-data-7913936/", "urlToImage": "https://images.indianexpress.com/2021/08/retail-inflation-vegetable-express-archieve-1200.jpg", "publishedAt": "2022-05-12T12:11:26Z", "content": "India CPI Inflation, IIP Growth Rate: The countrys retail inflation, which is measured by the Consumer Price Index (CPI), rose to an eight-year high of 7.79 per cent in the month of April. Separately… [+243 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "‘Nano was meant for all our people’: Ratan Tata shares motivation behind car", "description": "\"What really motivated me, and sparked a desire to produce such a vehicle, was constantly seeing Indian families on scooters, maybe the child sandwiched between the mother and father,\" he wrote.", "url": "https://indianexpress.com/article/trending/trending-in-india/nano-was-meant-for-all-our-people-ratan-tata-shares-motivation-7913574/", "urlToImage": "https://images.indianexpress.com/2022/05/ratan-tata-nano.jpg", "publishedAt": "2022-05-12T12:01:31Z", "content": "Tata Nano has been one of the most popular cars in India over the years. Now, nearly 14 years later, Ratan Tata has revealed the reason why Nano was made in the first place.The Chairman Emeritus of T… [+1889 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Why do people come back after ghosting? Here are four possible reasons", "description": "To 'ghost' a person means to \"not officially end something, but simply just disappear\", says an expert", "url": "https://indianexpress.com/article/lifestyle/feelings/men-ghosting-coming-back-possible-reasons-relationships-7911125/", "urlToImage": "https://images.indianexpress.com/2022/05/GettyImages-ghosting-couple-relationship-1200.jpg", "publishedAt": "2022-05-12T12:00:18Z", "content": "The term ‘ghosting’ has become popular of late in the datingculture. It simply means pulling a vanishing act on a person, going incommunicado on them. Shahzeen Shivdasani, a relationshipexpert and mi… [+2111 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "IPO Wrap: Prudent Corporate Advisory Services IPO subscribed 1.22 times on final day led by retailers and QIBs", "description": "Prudent IPO subscription status: The initial public offering (IPO) of retail wealth management firm Prudent Corporate Advisory Services was subscribed 1.22 times on the final day.", "url": "https://indianexpress.com/article/business/market/final-day-subscription-status-prudent-corporate-advisory-services-ipo-7913873/", "urlToImage": "https://images.indianexpress.com/2022/05/prudent-ipo.jpg", "publishedAt": "2022-05-12T11:57:59Z", "content": "Prudent Corporate Advisory Services IPO subscription status: The initial public offering (IPO) of retail wealth management firm Prudent Corporate Advisory Services was subscribed 1.22 times on the fi… [+1813 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Asad Rehman", "title": "Delhi to Varanasi, the unlikely group of five Gyanvapi petitioners", "description": "Varying accounts of how the women – one 'never leaves home', another not seen in court – got together for prayer at complex", "url": "https://indianexpress.com/article/india/political-pulse/gyanvapi-masjid-case-delhi-varanasi-petitioners-7913892/", "urlToImage": "https://images.indianexpress.com/2022/05/Gyanvapi-petitioners.jpeg", "publishedAt": "2022-05-12T11:53:01Z", "content": "At the heart of the new tension around the disputed Kashi Vishwanath Temple-Gyanvapi Mosque complex in Varanasi are five women petitioners, one Delhi-based, four living in Varanasi, the youngest 35, … [+5044 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Abhishek Angad", "title": "Newsmaker | Go-getter with an ‘eye for detail’: Jharkhand mining secretary in ED net", "description": "IAS officer Pooja Singhal’s arrest and suspension come at a time when CM Hemant Soren is also under the scanner.", "url": "https://indianexpress.com/article/india/political-pulse/newsmaker-go-getter-with-an-eye-for-detail-jharkhand-mining-secretary-in-ed-net-7913894/", "urlToImage": "https://images.indianexpress.com/2022/05/POOJA-SINGHAL-1.jpg", "publishedAt": "2022-05-12T11:52:45Z", "content": "In bureaucratic circles, she was known as the person who would get things done in any department. Be it as the agriculture secretary in the Raghubar Das government or the tourism, industries and mini… [+4471 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "RRR gears up for OTT debut, here’s where you can watch the SS Rajamouli blockbuster", "description": "SS Rajamouli's RRR was a massive hit at the box office and now, the film will be available for streaming soon.", "url": "https://indianexpress.com/article/entertainment/telugu/rrr-ott-debut-ss-rajamouli-watch-online-release-date-7913893/", "urlToImage": "https://images.indianexpress.com/2022/04/RRR.jpg", "publishedAt": "2022-05-12T11:51:22Z", "content": "SS Rajamouli’s RRR, which is one of the biggest hits of the year, is all set to release on a streaming platform. While the film had the audience cheering and applauding in theatres, fans will surely … [+1286 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Asad Rehman", "title": "Gyanvapi inspection to continue, anyone causing hindrance to be booked: court", "description": "The commission has been asked to submit a report on its inspection of the complex to the court by May 17.", "url": "https://indianexpress.com/article/cities/lucknow/gyanvapi-survey-to-continue-anyone-causing-hindrance-to-be-booked-court-7913890/", "urlToImage": "https://images.indianexpress.com/2022/05/Gyanvapi-Mosque-2.jpg", "publishedAt": "2022-05-12T11:48:03Z", "content": "The Varanasi court hearing the petition of five women seeking the right to worshipwithout any hindrance at the Kashi Vishwanath temple-Gyanvapi mosque complex on Thursday ordered that the inspection … [+1840 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "IPL 2022 CSK vs MI Live Score Updates: Chennai take on Mumbai in must-win game", "description": "IPL 2022 CSK vs MI Live Cricket Score Streaming Online Today Match, Star Sports 1 Hindi, Hotstar IPL Live: The MS Dhoni-led side would take confidence from their 91-run win over Delhi Capitals in their last outing and hope the batters build on their brilliant…", "url": "https://indianexpress.com/article/sports/ipl/ipl-2022-csk-vs-mi-live-score-updates-7913539/", "urlToImage": "https://images.indianexpress.com/2022/05/csk-vs-mi.jpeg", "publishedAt": "2022-05-12T11:45:13Z", "content": "IPL 2022, CSK vs MI Live Cricket Score Streaming Online Today Match Updates: Here are the two squads.\r\nChennai Super Kings: MS Dhoni (Captain), Ravindra Jadeja, Moeen Ali, Ruturaj Gaikwad, Dwayne Bra… [+744 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "In the Trenches of Eastern Ukraine, a Vicious and Deadly Dance", "description": "Fighting in eastern Ukraine has mostly occurred at a distance, with Ukrainian and Russian forces lobbing artillery at one another, sometimes from dozens of miles away.", "url": "https://indianexpress.com/article/world/in-the-trenches-of-eastern-ukraine-a-vicious-and-deadly-dance-7913516/", "urlToImage": "https://images.indianexpress.com/2022/05/1-163.jpg", "publishedAt": "2022-05-12T11:38:43Z", "content": "The impact of a tank round cracked the bunkers plaster roof and sent uniformed men scrambling. Flak jackets and helmets were flung on and automatic weapons cocked. Amid a crescendo of machine-gun fir… [+8065 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "UP govt makes singing national anthem compulsory at all madrassas", "description": "The order said that before the commencement of classes, the national anthem will be sung by teachers and students from the upcoming academic session in all recognised, aided and non-aided madrassas in the state.", "url": "https://indianexpress.com/article/education/up-govt-makes-singing-national-anthem-compulsory-at-all-madrassas-7913837/", "urlToImage": "https://images.indianexpress.com/2019/02/madarsa-1200.jpg", "publishedAt": "2022-05-12T11:35:09Z", "content": "Singing the national anthem “Jana Gana Mana” has been made compulsory at all madrassas in Uttar Pradesh from Thursday, an official said. The Registrar of the Uttar Pradesh Madrassa Education Board, S… [+1440 chars]"}]}