{"status": "ok", "totalResults": 313, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Agnipath scheme: Protests continue in Bengal, blockades hit train services", "description": "On Saturday, train services were hit on the Sealdah-Barrackpore section in North 24 Parganas district for around an hour after a group of protesters blocked railway tracks.", "url": "https://indianexpress.com/article/cities/kolkata/agnipath-scheme-protests-continue-in-bengal-blockades-hit-train-services-7977890/", "urlToImage": "https://images.indianexpress.com/2022/06/Agnipath-1.jpeg", "publishedAt": "2022-06-18T22:44:35Z", "content": "FOR THE second consecutive day, agitations against the Centre’s Agnipath recruitment scheme continued at several various places in West Bengal on Saturday with protesters blocking railway tracks, lea… [+2181 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Coomi Kapoor", "title": "Inside Track: Suspect choice", "description": "Coomi Kapoor writes: Some suspect that the BJP’s surprise decision to field Ghanshyam Lodhi, and not Mukhtar Abbas Naqvi, as its candidate for the Rampur Lok Sabha by-election is part of a secret understanding with former Rampur MP Azam Khan.", "url": "https://indianexpress.com/article/opinion/columns/coomi-kapoor-writes-inside-track-suspect-choice-rampur-lok-sabha-by-election-bjp-7977784/", "urlToImage": "https://images.indianexpress.com/2022/06/Azam-Khan-1200-1.jpg", "publishedAt": "2022-06-18T22:35:39Z", "content": "Some suspect that the BJPs surprise decision to field Ghanshyam Lodhi, and not Mukhtar Abbas Naqvi, as its candidate for the Rampur Lok Sabha by-election is part of a secret understanding with former… [+4429 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "India will be critical driver of demand in next 30 yrs, international arrangements may change: Puri", "description": "Puri was in conversation with Anant Goenka, Executive Director, The Indian Express, and P Vaidyanathan Iyer, Executive Editor, The Indian Express.", "url": "https://indianexpress.com/article/india/india-will-be-critical-driver-of-demand-in-next-30-yrs-international-arrangements-may-change-puri-7977858/", "urlToImage": "https://images.indianexpress.com/2022/06/adda2-3col.jpg", "publishedAt": "2022-06-18T22:31:03Z", "content": "India will be a critical driver of demand in the next 30 years, said Hardeep Singh Puri, Union Minister of Housing and Urban Affairs and Petroleum and Natural Gas. Speaking at the Express Adda in New… [+3987 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Santosh Singh, Sourav Roy Barman", "title": "BJP ally JDU slams move: History is history, cannot be reversed", "description": "Congress Rajya Sabha MP and its general secretary (communication) Jairam Ramesh said, “Selective amnesia of the recent past is as bad as rewriting of the ancient one.”", "url": "https://indianexpress.com/article/india/bjp-ally-jdu-slams-move-history-is-history-cannot-be-reversed-7977851/", "urlToImage": "https://images.indianexpress.com/2022/06/tyagi.jpg", "publishedAt": "2022-06-18T22:30:37Z", "content": "Reacting sharply to the BJP-led governments attempt to rewrite history in the name of rationalisation of history, NDA partner JD(U) said Saturday history is history and it cannot be reversed. It also… [+2704 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gandhinagar varsity to organise 3 day chiropractic service camp", "description": "According to a press release, the camp is being organised “to ensure to bring back the same amount of awareness, enthusiasm and benefits” to India which was observed by “delegates of Kadi Sarva Vishwavidyalaya during their visit to Life Chiropractic College W…", "url": "https://indianexpress.com/article/cities/gandhinagar/gandhinagar-varsity-to-organise-3-day-chiropractic-service-camp-7977808/", "urlToImage": "https://images.indianexpress.com/2022/06/dseu.jpeg", "publishedAt": "2022-06-18T22:30:29Z", "content": "A Gandhinagar-based private university, Kadi Sarva Vishwavidyalaya, in association with Life Chiropractic CollegeWest, San Francisco, California will organise a three-day chiropractic service camp at… [+186 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Monojit Majumdar", "title": "Bangladesh’s Rohingya problem", "description": "Five years after Bangladesh took in hundreds of thousands of Rohingya driven out of Myanmar, the refugee population is exploding — with serious security implications. Bangladesh warns that the consequences of potential crime and extremism will not leave India…", "url": "https://indianexpress.com/article/world/bangladesh-rohingya-issue-migration-kutupalong-refugees-camp-7977773/", "urlToImage": "https://images.indianexpress.com/2022/06/Rohingya-featured-1.jpg", "publishedAt": "2022-06-18T22:30:28Z", "content": "From the 40-foot-high watch tower at the highest point of the winding, up-and-down mud-and-brick road, the shantytown is seen stretching in all directions, until it fades into the monsoon mist. Tin a… [+12730 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "P Chidambaram", "title": "More minus than plus in jobs", "description": "Jobs should have been the singular focus of the Modi government. It was not; it wasted 8 years. It used its social and political capital to divide the people of India", "url": "https://indianexpress.com/article/opinion/columns/10-lakh-persons-recruitment-india-unemployment-7977754/", "urlToImage": "https://images.indianexpress.com/2022/04/ssc759.jpg", "publishedAt": "2022-06-18T22:30:05Z", "content": "The government has flattered me by reading my column (The Indian Express, February 20, 2022). Finally waking up to the reality of soaring unemployment, it has announced that 10 lakh persons will be r… [+5082 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pranav Mukul, Mihir Mishra", "title": "As Covid-19 numbers ease, Govt looks at scrapping Air Suvidha", "description": "The Air Suvidha portal was introduced in August 2020 as a mandatory self-reporting portal where incoming international passengers have to submit the details of their journey and their vaccination or Covid19 testing status.", "url": "https://indianexpress.com/article/india/as-covid-19-numbers-ease-govt-looks-at-scrapping-air-suvidha-7977865/", "urlToImage": "https://images.indianexpress.com/2022/06/travel22.jpg", "publishedAt": "2022-06-18T22:26:12Z", "content": "As countries ease restrictions for international travellers, India is also considering doing away with the Air Suvidha requirement, which mandates people arriving from abroad to register before they … [+2603 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tavleen Singh", "title": "Bring out the bulldozers?", "description": "Tavleen Singh writes: We know for certain that the angry young men who set trains and buses on fire last week and blocked roads and railway tracks were doing this out of a passionate desire to serve the nation by joining the army.", "url": "https://indianexpress.com/article/opinion/columns/tavleen-singh-writes-up-bulldozers-agnipath-indian-army-javed-demolition-7977777/", "urlToImage": "https://images.indianexpress.com/2022/06/ballia-2-1-1.jpg", "publishedAt": "2022-06-18T22:23:45Z", "content": "When those we elect to rule us disrespect the law, they lose the right to impose it. Has this message gone home to Bulldozer Baba as his admirers call him? When he saw trains and buses being burned i… [+4975 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Ritika Chopra", "title": "Express Investigation — Part 2: Key deletions on caste, minorities in revised school textbooks", "description": "Removed: ‘women, shudras not allowed to study Vedas’; impact of numerical majority winning political power", "url": "https://indianexpress.com/article/express-exclusive/express-investigation-part-2-key-deletions-on-caste-minorities-in-revised-school-textbooks-7977839/", "urlToImage": "https://images.indianexpress.com/2022/06/dalits.jpg", "publishedAt": "2022-06-18T22:19:49Z", "content": "A Dalit is likely to be confined to traditional occupations such as agricultural labour, scavenging, or leather work… Minorities must face the risk that the majority community will capture political … [+8501 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Esha Roy", "title": "Centre focuses on access to anganwadi services for migrants", "description": "Take Home Ration, or THR, is provided to children between 6 months and 3 years, pregnant women and lactating mothers, as well as adolescent girls as part of the Centre's flagship Integrated Child Development Services (ICDS).", "url": "https://indianexpress.com/article/india/centre-focuses-on-access-to-anganwadi-services-for-migrants-7977880/", "urlToImage": "https://images.indianexpress.com/2022/06/migrants-coronavirus-2.jpg", "publishedAt": "2022-06-18T22:13:52Z", "content": "The Centre has instructed state governments and their Women and Child Development (WCD) departments to ensure digitisation of anganwadi services so that migrating families can continue accessing the … [+2473 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Why Ukraine doesn’t figure in our classroom", "description": "If the conventional education system is failing, I believe that artists – visual and performing – need to shoulder the responsibility and shake the complacency of the general populace.", "url": "https://indianexpress.com/article/opinion/columns/why-ukraine-doesnt-figure-in-our-classroom-7977799/", "urlToImage": "https://images.indianexpress.com/2022/06/Opinion-Ukraine-3col.jpg", "publishedAt": "2022-06-18T21:56:33Z", "content": "War is cruelty. War is trauma. War is unnecessary. Yet, it is 2022 and war is still the foremost thing on our minds and on our screens. A quick Google search on the Russia-Ukraine war reveals eight o… [+4406 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Ahmedabad: MICA students return to offline internships after a gap of 2 years", "description": "For 2021-23, MICA witnessed an increase in the highest stipend offered to its students for their 2-month summer placements. The FMCG sector offered the highest stipend at Rs 3.5 lakh against Rs 3.2 lakh offered last year, followed by the IT sector, offering R…", "url": "https://indianexpress.com/article/cities/ahmedabad/ahmedabad-mica-students-return-to-offline-internships-after-a-gap-of-2-years-7977887/", "urlToImage": "https://images.indianexpress.com/2022/06/ch425651-1-3.jpg", "publishedAt": "2022-06-18T21:56:19Z", "content": "The second-year students of MICA, Ahmedabad, have returned to corporate offices to do their internships offline this year as Covid-19 cases witnessed a significant decline. This comes after being tra… [+2265 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rinku Ghosh", "title": "If you can lean in, you can lean out too", "description": "Rinku Ghosh writes: Sandberg embodies nothing but the real issues. It matters little that a widowed woman at 52 also has the right to be happy and is simply taking some time off to reboot, steady her new ship, blending “her extended family of five children (f…", "url": "https://indianexpress.com/article/opinion/columns/rinku-ghosh-writes-if-you-can-lean-in-you-can-lean-out-sheryl-sandberg-meta-coo-7977787/", "urlToImage": "https://images.indianexpress.com/2022/06/SherylSandberg_Reuters_1-2.jpg", "publishedAt": "2022-06-18T21:46:01Z", "content": "When Bill Gates stepped down from the Microsoft board in 2020 to pursue philanthropy, people conveniently forgot the allegations of his intimacy with a former employee that might have prompted such a… [+3929 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kamal Saiyed", "title": "Atlanta exhibition: Textile traders from Gujarat sell goods at almost thrice the domestic price", "description": "This was the first fair in the US by the SGCCI with support from the Ministry of Textiles.", "url": "https://indianexpress.com/article/cities/surat/atlanta-exhibition-gujarat-textile-traders-price-7977879/", "urlToImage": "https://images.indianexpress.com/2022/04/GettyImages-silk-fabric-1200.jpg", "publishedAt": "2022-06-18T21:42:45Z", "content": "Over 50 textile traders from Gujarat, who took part in the Global Trade Fair in Atlanta, made significant profits by selling their goods at almost three times the price it would have sold back home, … [+4903 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Ritu Sharma", "title": "Abbas finished his Class 8-9 staying with us: PM’s brothers", "description": "Abbas, 64 now, retired as a Class-II officer in the Gujarat government, and left for Sydney last week to be with his son, says Pankajbhai.", "url": "https://indianexpress.com/article/cities/ahmedabad/abbas-finished-his-class-8-9-staying-with-us-pms-brothers-7977882/", "urlToImage": "https://images.indianexpress.com/2022/06/modi-7-1-2.jpg", "publishedAt": "2022-06-18T21:28:52Z", "content": "PRIME MINISTER Narendra Modi’s brothers remember Abbas Miyanjibhai Ramsada Momin from Kesimpa village in Mehsana as a family member. Modi mentioned Abbas in his blog penned to mark his mother’s 100th… [+1151 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pinarayi Vijayan writes to PM Modi, seeks withdrawal of Agnipath", "description": "“They execute a unique duty to maintain national security. Hence, the government is duty bound to ensure job security, reservation benefits and other emoluments,” Kerala Chief Minister Pinarayi Vijayan said.", "url": "https://indianexpress.com/article/india/kerala/pinarayi-vijayan-writes-to-pm-modi-seeks-withdrawal-of-agnipath-7977874/", "urlToImage": "https://images.indianexpress.com/2022/06/kerala-cm-1.jpg", "publishedAt": "2022-06-18T21:01:20Z", "content": "Kerala Chief Minister Pinarayi Vijayan on Saturday wrote to Prime Minister Narendra Modi, urging him to withdraw the Agnipath Army recruitment scheme.He said military service was the dream job of the… [+274 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Deve Gowda, Shivakumar ask govt to withdraw textbooks", "description": "The opposition parties, rights groups, writers and seers have accused the BJP government of saffronising school textbooks and casting key social reformers such as Basavanna and Dr B R Ambedkar in a lesser light in new school books.", "url": "https://indianexpress.com/article/cities/bangalore/deve-gowda-shivakumar-ask-govt-to-withdraw-textbooks-7977876/", "urlToImage": "https://images.indianexpress.com/2022/06/deve-gowda-1.jpeg", "publishedAt": "2022-06-18T20:59:07Z", "content": "Former Prime Minister and Janata Dal (Secular) leader H D Deve Gowda and state Karnataka Congress chief D K Shivakumar shared the stage on Saturday to participate in a protest called by civil rights … [+1628 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gurgaon builder told to pay Rs 100 crore for ‘violation of green norms’", "description": "In an NGT order from 2019, the builder was directed to stop all construction/expansion activity at Sushant Lok Phase I. The CPCB had also imposed compensation of Rs 16.729 crore for", "url": "https://indianexpress.com/article/cities/delhi/gurgaon-builder-told-to-pay-rs-100-crore-for-violation-of-green-norms-7977871/", "urlToImage": "https://images.indianexpress.com/2022/06/national-green-tribunal-1200.jpg", "publishedAt": "2022-06-18T20:54:18Z", "content": "The Central Pollution Control Board (CPCB) has issued directions to Ansal Properties and Infrastructure Ltd to pay environment compensation of Rs 100 crore for alleged violation of norms at its Susha… [+3593 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Agnipath scheme: Rajasthan resolution seeks rollback", "description": "The decision was taken in a meeting chaired by CM Ashok Gehlot on Saturday, said an official statement.", "url": "https://indianexpress.com/article/cities/jaipur/agnipath-scheme-rajasthan-resolution-seeks-rollback-7977869/", "urlToImage": "https://images.indianexpress.com/2022/06/ashok.jpeg", "publishedAt": "2022-06-18T20:47:12Z", "content": "The Rajasthan Council of Ministers on Saturday passed a unanimous resolution that the central government must withdraw the newly introduced Agnipath scheme keeping in mind the larger public interest … [+1515 chars]"}]}