{"status": "ok", "totalResults": 431, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Bengali director Tarun Majumdar passes away", "description": "Tarun Majumdar is known for films like Smriti Tuku Thak, Palatak, Kuheli, Shriman Prithviraj, Balika Badhu, Ganadevata and Dadar Kirti.", "url": "https://indianexpress.com/article/entertainment/regional/director-tarun-majumdar-passes-away-7986879/", "urlToImage": "https://images.indianexpress.com/2022/06/Tarun-Majumdar.jpeg", "publishedAt": "2022-07-04T06:48:48Z", "content": "Director Tarun Majumdar, who is known for making movies based on compelling tales highlighting the life of middle-class families, died in a Kolkata hospital on Monday, family sources said. He was 92.… [+454 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rishika Singh", "title": "Explained: Who was Alluri Sitharama Raju, whose statue PM Modi unveiled?", "description": "In June this year, Home Minister Amit Shah named Alluri as one of the prominent leaders from the area, along with Ramji Gaur and Kumaram Bhim, as those who stood against the Nizams for the liberation of Telangana.", "url": "https://indianexpress.com/article/explained/explained-who-was-alluri-sitharama-raju-pm-narendra-modi-statue-8007693/", "urlToImage": "https://images.indianexpress.com/2022/07/Modi-inauguration.jpg", "publishedAt": "2022-07-04T06:45:00Z", "content": "Prime Minister Narendra Modi will unveil a 30-foot-tall bronze statue of freedom fighter Alluri Sitharama Raju as part of his visit to Bhimavaram, Andhra Pradesh, on Monday (July 4). The year-long ce… [+5036 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Farah Khan says she refused to step out when people ‘ripped apart’ Tees Maar Khan, called herself ‘poor cousins’ of Zoya-Farhan Akhtar", "description": "Farah Khan started off as an assistant and a background dancer. Her first full-fledged film choreography began with Jo Jeeta Wohi Sikandar in 1992.", "url": "https://indianexpress.com/article/entertainment/bollywood/farah-khan-refused-to-step-out-tees-maar-khan-ripped-apart-poor-cousins-of-zoya-farhan-akhtar-8007437/", "urlToImage": "https://images.indianexpress.com/2022/07/farah-khan-tees-maar-khan-1200.jpg", "publishedAt": "2022-07-04T06:41:23Z", "content": "Farah Khan completes three decades in the entertainment industry as a choreographer-director. While she says she’s ‘grateful’ for being lucky to get all the opportunities, she added that being a woma… [+2186 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sayak Dutta", "title": "Transfer news: Manchester United, Ronaldo saga to end as Barcelona, Chelsea slug it out for Raphinha", "description": "With just over a month left for the summer transfer window left, some clubs like Manchester City and Liverpool have concluded most of their business already, while other clubs continue to fight over deals that could change the trajectory of football.", "url": "https://indianexpress.com/article/sports/football/2022-23-transfer-season-transfer-news-manchester-united-ronaldo-saga-to-end-as-barcelona-chelsea-slug-it-out-for-raphinha-8007489/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-9-1.jpg", "publishedAt": "2022-07-04T06:37:42Z", "content": "Its that time of the year when football teams from all around the globe try to bolster their squads while fans salivate at the prospect of dream signings and fantasy lineups. Its the 2022-23 transfer… [+8344 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Did Hrithik Roshan refuse to shoot in UP for Vikram Vedha? Producers clear the air", "description": "Recent media reports suggested that Hrithik Roshan's demanded that Vikram Vedha should be shot in Abu Dhabi instead of Uttar Pradesh. Reliance Entertainment has now issued a clarification.", "url": "https://indianexpress.com/article/entertainment/bollywood/did-hrithik-roshan-refuse-to-shoot-in-uttar-pradesh-for-vikram-vedha-producer-clarify-8007660/", "urlToImage": "https://images.indianexpress.com/2022/01/vikram-vedha-hrithik-roshan-1200.jpg", "publishedAt": "2022-07-04T06:33:08Z", "content": "Hrithik Roshan-Saif Ali Khan’s Vikram Vedha is one of the most anticipated films of recent times. While fans await its release, the film has already managed to find itself in controversy. As per medi… [+2475 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Muslim pilgrims flock to Mecca for first post-pandemic haj", "description": "In 2019, the last year before the pandemic struck, some 2.6 million people performed the haj, while around 19 million took part in the umrah, another form of pilgrimage to Mecca which - unlike the haj - can be carried out at any time of the year", "url": "https://indianexpress.com/article/lifestyle/life-style/muslim-pilgrims-flock-to-mecca-for-first-post-pandemic-haj-8006756/", "urlToImage": "https://images.indianexpress.com/2022/07/Reuterssaudi-haj-noon-prayers.jpg", "publishedAt": "2022-07-04T06:30:58Z", "content": "Thousands of pilgrims started arriving in the holy city of Mecca in Saudi Arabia on Friday, among some one million Muslims expected to attend the 2022 haj pilgrimage season after two years of major d… [+2463 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "NATA 2022 Phase 2 Admit card to be released today; check how to download", "description": "NATA 2022 admit card: Registered and eligible candidates can download the admit card from the official website at nata.in", "url": "https://indianexpress.com/article/education/nata-2022-phase-2-admit-card-released-how-to-download-nata-in-8007569/", "urlToImage": "https://images.indianexpress.com/2021/05/1200-630-VITEEE-2021-Starts-Today_-Know-How-to-Take-Online-Test.jpeg", "publishedAt": "2022-07-04T06:28:43Z", "content": "Council of Architecture (CoA) will release the admit cards for National Aptitude Test in Architecture (NATA) 2022 today. Registered candidates can download their admit card atthe official website, i.… [+1393 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "SC to hear Uddhav Thackeray-led faction’s plea challenging Speaker’s decision on party whip", "description": "Senior Advocate A M Singhvi mentioned the plea before a bench of Justices Indira Banerjee and J K Maheshwari, seeking a stay and urgent listing of the matter for hearing.", "url": "https://indianexpress.com/article/india/supreme-court-uddhav-thackeray-shiv-sena-speaker-chief-whip-8007677/", "urlToImage": "https://images.indianexpress.com/2022/06/uddhav1.jpg", "publishedAt": "2022-07-04T06:26:48Z", "content": "The Udhav Thackeray-led faction of the Shiv Sena approached the Supreme Court on Monday seeking a stay on the newly elected Maharashtra Assembly Speakers decision to recognise the whip nominated by t… [+1311 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Xiaomi 12S, Xiaomi 12S Ultra launch Live updates: Livestream timings, expected specifications", "description": "Xiaomi 12S live blog: Xiaomi is hosting a global event today where its new Xiaomi 12S series with the new Leica-branded camera will be showcased. Follow our live blog for all the details", "url": "https://indianexpress.com/article/technology/mobile-tabs/xiaomi-12s-xiaomi-12s-ultra-xiaomi-band-7-launch-live-updates-specifications-price-features-8007661/", "urlToImage": "https://images.indianexpress.com/2022/07/Xiaomi12S_LEAD_NEW.jpg", "publishedAt": "2022-07-04T06:23:00Z", "content": "Xiaomi 12S is the new series from the brand and this one will be all about the camera. The top-end device in this series is expected to be the Xiaomi 12S Ultra, which will likely be powered by the Sn… [+1093 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "HDFC and HDFC Bank merger proposal gets nod from bourses", "description": "HDFC Bank has received observation letter with 'no adverse observations' from BSE Limited and observation letter with 'no objection' from the National Stock Exchange of India Limited, both dated July 2, 2022, HDFC Bank said in a filing.", "url": "https://indianexpress.com/article/business/banking-and-finance/hdfc-hdfc-bank-merger-proposal-gets-bourses-nod-8007441/", "urlToImage": "https://images.indianexpress.com/2022/06/hdfc-bank-express-photo-1200.jpg", "publishedAt": "2022-07-04T06:12:17Z", "content": "The proposal of merger of HDFC with its banking subsidiary HDFC Bank, the biggest transaction in India’s corporate history, has got approval from stock exchanges.Both HDFC and HDFC Bank have got no-o… [+2229 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Maharashtra: Five metre-reading agencies removed as MSEDCL probes complaints", "description": "The Maharashtra State Electricity Distribution Company Ltd (MSEDCL) said wrong meter readings not only affected consumers, but it also caused losses for the company.", "url": "https://indianexpress.com/article/cities/pune/maharashtra-metre-reading-agencies-removed-msedcl-8007636/", "urlToImage": "https://images.indianexpress.com/2022/07/electricity.jpg", "publishedAt": "2022-07-04T06:09:31Z", "content": "Following complaints of widespread discrepancies, the Maharashtra State Electricity Distribution Company Ltd (MSEDCL) has put all electric meter-reading agencies under the scanner. So far, the power … [+1381 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Ukraine withdraws from battered Lysychansk city; Russia claims major victory", "description": "Ukraine on Sunday said the tactical withdrawal would save the lives of its soldiers who would regroup, to launch a counter-offensive with the help of long-range Western weapons.", "url": "https://indianexpress.com/article/world/ukraine-withdraws-from-lysychansk-city-russia-wins-8007411/", "urlToImage": "https://images.indianexpress.com/2022/07/ol22-1.jpg", "publishedAt": "2022-07-04T06:09:08Z", "content": "Ukraine’s forces have withdrawn from the bombed-out city of Lysychansk, prompting Russia to claim full control of the eastern Luhansk region, a key Kremlin war goal, but President Volodymyr Zelenskiy… [+5254 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Video shows Akron police kill black man in hail of gunfire", "description": "Akron police released video of the shooting of Jayland Walker, 25, who was killed June 27 in a pursuit that had started with an attempted traffic stop; in the resulting encounter Walker sustained more than 60 wounds.", "url": "https://indianexpress.com/article/world/video-akron-police-kill-black-man-gunfire-8007500/", "urlToImage": "https://images.indianexpress.com/2019/08/ohio-shooting-ap19216584817378.jpg", "publishedAt": "2022-07-04T06:08:46Z", "content": "A Black man was unarmed when Akron police chased him on foot and killed him in a hail of gunfire, but officers believed he had shot at them earlier from a vehicle and feared he was preparing to fire … [+4833 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Watch | Month after his death, fans continue to pour at Sidhu Moosewala’s cremation site", "description": "A fan posted a video, which went viral, on Sunday, where cars and motorbikes are seen lined up at Moosewala's cremation site. Fans can also be seen gathered at the site.", "url": "https://indianexpress.com/article/india/watch-fans-pour-sidhu-moosewala-cremation-site-8007503/", "urlToImage": "https://images.indianexpress.com/2022/07/WhatsApp-Image-2022-05-31-at-3.18.22-PM.jpeg", "publishedAt": "2022-07-04T06:03:54Z", "content": "Over a month after his death, fans of Congress leader and popular Punjabi singer Sidhu Moosewala are still pouring at his cremation site.A fan tweeted a video, which went viral on Sunday, in which ca… [+902 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Jeff Bezos slams Joe Biden’s call for gasoline stations to cut prices", "description": "In May, he accused Biden of misleading the public and blamed his administration for a spike in inflation.", "url": "https://indianexpress.com/article/world/jeff-bezos-joe-biden-cut-gasoline-prices-8007528/", "urlToImage": "https://images.indianexpress.com/2021/06/Jeff-Bezos-Blue-Origin.jpg", "publishedAt": "2022-07-04T06:03:14Z", "content": "Amazon.com Inc founder Jeff Bezos renewed his spat with the White House over the weekend, as the world’s third-richest person criticized President Joe Biden for calling on companies running gasoline … [+1205 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Ahead of floor test, one more Sena MLA joins Shinde faction; tally rises to 40", "description": "The Shiv Sena currently has 55 MLAs in the 288-member state Assembly.", "url": "https://indianexpress.com/article/cities/ahead-of-floor-test-one-more-sena-mla-joins-shinde-faction-tally-rises-to-40-8007641/", "urlToImage": "https://images.indianexpress.com/2022/07/shinde-fadnavis-1-3.jpg", "publishedAt": "2022-07-04T06:02:06Z", "content": "Ahead of the floor test of the Eknath Shinde-led Maharashtra government on Monday, one more Shiv Sena MLA from the Uddhav Thackeray camp joined CM Shinde’s faction, taking its tally to 40.The Shiv Se… [+799 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Meet Sini Shetty, the 21-year-old from Karnataka who has been crowned Miss India World 2022", "description": "A firm believer in faith, dedication and hard work, Shetty admits that her grandmother is the most influential person in her life", "url": "https://indianexpress.com/article/lifestyle/life-style/sini-shetty-miss-india-world-2022-karnataka-8007440/", "urlToImage": "https://images.indianexpress.com/2022/07/Sini-Shetty-1200.jpg", "publishedAt": "2022-07-04T06:01:15Z", "content": "Sini Shetty was crowned Miss India World 2022last night at the grand finale event held at the Jio World Convention Centre in Mumbai. Rubal Shekhawat from Rajasthan came second, and Shinata Chauhan wa… [+1421 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Wimbledon 2022: Sore loser Jelena Ostapenko booed after throwing water bottle after loss", "description": "The two-time mother Tatjana Maria, who came back from a maternity leave this year, is now through to the quarters. Maria has criticised WTA for not supporting pregnant players", "url": "https://indianexpress.com/article/sports/tennis/sore-loser-ostapenko-booed-after-throwing-water-bottle-after-loss-jelena-ostapenko-tatjana-maria-wimbeldon-wta-8007534/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-8-1.jpg", "publishedAt": "2022-07-04T05:56:53Z", "content": "Sore loser Jelena Ostapenko was booed off court at Wimbledon after throwing a water bottle at her chair after loss. Ostapenko also claimed Tatjana Maria, who came back from a year-long maternity leav… [+3089 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "China’s Tianwen-1 orbiter has mapped the entire surface of Mars", "description": "China's Tianwen-1  Mars probe consists of an orbiter, a lander and a rover named Zhurong.", "url": "https://indianexpress.com/article/technology/science/china-tianwen-1-mars-probe-zhurong-rover-mars-surface-map-8007587/", "urlToImage": "https://images.indianexpress.com/2022/07/China-Tianwen-1-Mars-featured-1.jpg", "publishedAt": "2022-07-04T05:56:03Z", "content": "China National Space Administration (CNSA) announced this week that the orbiter and rover of the countrys Tianwen-1 probe have both completed their targeted scientific exploration missions. After ope… [+1682 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Supreme Court to hear plea challenging Centre’s Agnipath scheme next week", "description": "A vacation bench of Justices Indira Banerjee and JK Maheshwari said that petitions will be listed next week before an appropriate bench upon reopening of the apex court after summer vacation.", "url": "https://indianexpress.com/article/india/supreme-court-plea-challenging-agnipath-scheme-8007622/", "urlToImage": "https://images.indianexpress.com/2022/06/indian-army-1-1.jpeg", "publishedAt": "2022-07-04T05:54:47Z", "content": "The Supreme Court on Monday agreed to hear a plea challenging the Centre’s newly introduced ‘Agnipath’ scheme for recruitment in armed forces after the apex court reopens on July 11."}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "‘Where ‘e’ stands for eat’: Anand Mahindra promotes e-mobility with a funny twist", "description": "Many users were of the view that the concept is not applicable on pothole-riddled roads in India.", "url": "https://indianexpress.com/article/trending/trending-in-india/anand-mahindra-promotes-e-mobility-with-a-funny-twist-8007583/", "urlToImage": "https://images.indianexpress.com/2022/07/Anand-Mahindra-funny-video.jpg", "publishedAt": "2022-07-04T05:54:46Z", "content": "Business tycoon Anand Mahindra has also joined the bandwagon of promoting e-mobility but with a quirky twist.Mahindra shared a funny clip showing four men seated on a dining table fitted with four wh… [+2483 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Watch: Sri Lanka’s Abeykoon becomes first South Asian to sprint 100m in less than 10 seconds", "description": "Abeykoon became the first South Asian to break the 10-second barrier.", "url": "https://indianexpress.com/article/sports/sport-others/watch-sri-lanka-abeykoon-100m-record-less-than-10-seconds-8007454/", "urlToImage": "https://images.indianexpress.com/2022/07/Yupun-Abeykoon.jpg", "publishedAt": "2022-07-04T05:49:05Z", "content": "Sri Lankan sprinter Yupun Abeykoon scripted a new record after becoming the first South Asian to run 100m in less than 10 seconds when he competed at the Resisprint International ( a World Athletics … [+1793 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Indoor games like chess, scrabble to be introduced in Delhi’s primary school classrooms", "description": "The games are meant to boost concentration and build confidence and mental strength in students of classes III to V in government schools in Delhi, according to an order issued to schools.", "url": "https://indianexpress.com/article/cities/delhi/indoor-games-chess-scrabble-introduced-delhi-primary-school-classrooms-8007576/", "urlToImage": "https://images.indianexpress.com/2022/07/delhi-schools-1.jpeg", "publishedAt": "2022-07-04T05:48:05Z", "content": "Indoor classroom games are set to be introduced in primary sections of government schools in Delhi, according to officials. Chess, carrom, puzzles, scrabble and monopoly will soon be introduced as cl… [+1128 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Petrol, Diesel rates today, July 4, 2022: Check fuel prices in Delhi, Mumbai, Bengaluru and other major cities", "description": "Petrol & Diesel Rates Today in Delhi, Mumbai, Banglore, Chennai: In Delhi, petrol costs Rs 96.72 per litre, while diesel is available for Rs 89.62 per litre. In Mumbai, petrol retails at Rs 111.35 per litre, while diesel stands at Rs 97.28 per litre. Keep rea…", "url": "https://indianexpress.com/article/business/commodities/petrol-diesel-rates-today-july-4-check-fuel-prices-delhi-mumbai-bengaluru-key-cities-8007458/", "urlToImage": "https://images.indianexpress.com/2022/07/Delhi-petrol-pump-2col.jpg", "publishedAt": "2022-07-04T05:47:01Z", "content": "Petrol and Diesel Rates Today in Mumbai, Delhi, Bengaluru, Chennai: Prices of petrol and diesel remained stagnant across the country for the 43rd consecutive day on Monday, July 4, 2022.In Delhi, pet… [+2611 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Man claiming to be from PM Modi’s office seeks tourist facilities in Karnataka, booked", "description": "Chamarajnagar deputy commissioner (DC) Charulatha Somal filed the police complaint after receiving a call on June 27 from a man who identified himself as \"Rao'' from the PMO and sought arrangements for the travel of his family to tourist spots in the district.", "url": "https://indianexpress.com/article/cities/bangalore/man-claiming-to-be-from-prime-ministers-office-seeks-tourist-facilities-in-karnataka-booked-8007555/", "urlToImage": "https://images.indianexpress.com/2022/07/ha.jpg", "publishedAt": "2022-07-04T05:43:31Z", "content": "The Karnataka Police have booked an unidentified man who allegedly sought tourist arrangements in the Chamarajanagar district of the state by claiming to be a retired Gujarat Indian Administrative Se… [+64 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Shane Warne’s cricket brain was ahead of his time: Arjuna Ranatunga", "description": "The former Sri Lankan captain, one of the great cricketing rivals of Warne, heaps praise on the late Australian legspinner", "url": "https://indianexpress.com/article/sports/cricket/shane-warnes-cricket-brain-was-ahead-of-his-time-arjuna-ranatunga-8007468/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-7.jpg", "publishedAt": "2022-07-04T05:35:08Z", "content": "The duels of Arjuna Ranatunga, Sri Lankas legendary captain, with the late and great Australian spinner Shane Warne was of the fiercest ever witnessed on and off a  cricket field. Time and again, Ran… [+3568 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Four, including three minors, detained in Chennai for attacking photographer at Marina beach", "description": "The police said the photographer was with his friends near the Namma Chennai selfie point at Marina beach for a photoshoot when an argument broke out with a local. Soon, a gang assaulted the youth and fled.", "url": "https://indianexpress.com/article/cities/chennai/assault-in-chennai-marina-beach-4-held-8007466/", "urlToImage": "https://images.indianexpress.com/2022/07/chennai-selfie-point.png", "publishedAt": "2022-07-04T05:27:41Z", "content": "The Greater Chennai Police detained four people, including three juveniles, for attacking a photographer in full public view near Marina beach Sunday.According to the police, the photographer, identi… [+1110 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "PSEB 10th result not releasing today, likely tomorrow: Punjab board official", "description": "PSEB 10th Result 2022 Date, Time, Websites: Punjab Board Mohali conducted the term II exams in April- May with the Punjabi language exam and concluded on May 19 with the physical education paper. Around 3.25 lakh students appeared in class 10 board exams this…", "url": "https://indianexpress.com/article/education/pseb-10th-result-2022-not-today-date-time-punjab-board-official-pseb-ac-in-indiaresults-in-8007492/", "urlToImage": "https://images.indianexpress.com/2022/02/Punjab-boards.jpg", "publishedAt": "2022-07-04T05:25:59Z", "content": "PSEB 10th result 2022 updates: The Punjab School Education Board (PSEB) will not declared the matric exam results today. The result is likely to be announced on Tuesday, July 5, a board official conf… [+1045 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Udaipur murder: Situation normal in Udaipur, curfew relaxed for 12 hours", "description": "Mobile internet services are suspended till 12 pm and a decision to restore the services would be taken after a review, collector Tara Chand Meena said.", "url": "https://indianexpress.com/article/cities/jaipur/udaipur-murder-situation-normal-udaipur-curfew-relaxed-8007467/", "urlToImage": "https://images.indianexpress.com/2022/07/Udaipur-7.jpg", "publishedAt": "2022-07-04T05:22:15Z", "content": "Mobile internet services are suspended till 12 pm and a decision to restore the services would be taken after a review, collector Tara Chand Meena said.\r\n“A relaxation of 12 hours from 8 am to 8 pm i… [+599 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Simple tips to take care of your eyes this monsoon", "description": "Our eyes are particularly vulnerable to infections and other issues during monsoon, according to the expert", "url": "https://indianexpress.com/article/lifestyle/health/eye-health-tips-monsoon-rainy-season-8002434/", "urlToImage": "https://images.indianexpress.com/2022/07/eyes-1200.jpg", "publishedAt": "2022-07-04T05:20:46Z", "content": "The rainy season has arrived, giving everyone a respite from the sweltering heat. As lively as the monsoon may be, it is also marked by a host of seasonal illnessessuch as dengue, malaria and diarrho… [+2183 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Ajay Devgn announces next directorial Bholaa, Kaithi remake to star him and Tabu", "description": "After U, Me Aur Hum, Shivaay and Runway 34, Ajay Devgn is set to director a high-octane emotional drama Bholaa which will star him and Tabu.", "url": "https://indianexpress.com/article/entertainment/bollywood/ajay-devgn-announces-next-directorial-bholaa-kaithi-remake-tabu-8007449/", "urlToImage": "https://images.indianexpress.com/2022/07/ajay-devgn-bholaa-director.jpg", "publishedAt": "2022-07-04T05:15:54Z", "content": "After Runway 34, Ajay Devgn is all set to don the director’s hat once again. On Monday, the actor announced his next that will also feature him and his good friend, actor Tabu. As per the announcemen… [+2244 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "‘Kohli has brass neck blowing mock kisses’- England’s celebrities attack Virat Kohli for his on-field behaviour", "description": "ENG vs IND 5th Test: Piers Morgan, as ever, was quick to get into the ring to slam Virat Kohli.", "url": "https://indianexpress.com/article/sports/cricket/eng-v-ind-kohli-has-brass-neck-blowing-mock-kisses-englands-celebrities-attack-virat-kohli-for-his-on-field-behaviour-8007428/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-6.jpg", "publishedAt": "2022-07-04T05:07:43Z", "content": "Virat Kohli has angered some of the English celebrities with his on-field behaviour that ranged from a verbal duel with Jonny Bairstow to blowing a kiss after taking Bairstows catch.Piers Morgan, as … [+1951 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi: Barking dog leads to brawl, man hits three residents in Paschim Vihar", "description": "The police have registered a case against Dharamvir Dahiya who attacked the residents and struck the pet dog with an iron pipe on Sunday morning.", "url": "https://indianexpress.com/article/cities/delhi/delhi-dog-owner-attacked-paschim-vihar-8007450/", "urlToImage": "https://images.indianexpress.com/2022/07/delhi-dog-attack.png", "publishedAt": "2022-07-04T05:05:30Z", "content": "A case has been registered in Delhi’s Outer District after a man allegedly attacked three Paschim Vihar residents and struck a pet dog with an iron pipe after it barked at him.The officials at the Ea… [+1584 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "From one July Fourth to the next, a steep slide for Joe Biden", "description": "As Biden approaches his second Fourth of July in the White House, his standing couldn't be more different. A series of miscalculations and unforeseen challenges have Biden struggling for footing as he faces a potentially damaging verdict from voters in the up…", "url": "https://indianexpress.com/article/world/one-july-fourth-to-next-steep-slide-biden-8007387/", "urlToImage": "https://images.indianexpress.com/2022/07/AP22184850801201.jpg", "publishedAt": "2022-07-04T05:04:45Z", "content": "Last Fourth of July, President Joe Biden gathered hundreds of people outside the White House for an event that would have been unthinkable for many Americans the previous year. With the coronavirus i… [+7723 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi weather today: Light rainfall likely, maximum temperature around 36°C", "description": "Rainfall is on the forecast for Delhi till July 10. While moderate rainfall is likely on Tuesday, the intensity is likely to increase with heavy rainfall on the forecast for Wednesday.", "url": "https://indianexpress.com/article/cities/delhi/delhi-weather-today-light-rainfall-likely-8007453/", "urlToImage": "https://images.indianexpress.com/2022/07/Delhi-rains_1200_ab-saha.jpeg", "publishedAt": "2022-07-04T05:02:32Z", "content": "Light rainfall is likely in Delhi on Monday and the maximum temperature is likely to settle at around 36 degrees Celsius, according to the India Meteorological Department (IMD).The minimum temperatur… [+1726 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Hubble captures stunning image of globular cluster with thousands of stars", "description": "Globular clusters, like this one captured by NASA's Hubble telescope, are stable and tightly bound clusters that contain tens of thousands to millions of stars.", "url": "https://indianexpress.com/article/technology/science/nasa-hubble-globular-cluster-ngc-6569-thousands-stars-8007438/", "urlToImage": "https://images.indianexpress.com/2022/07/NASA-hubble-telescope-globular-cluster-featured.jpg", "publishedAt": "2022-07-04T05:01:16Z", "content": "NASA has released a picture of a globular cluster that contains thousands of glittering stars. The Hubble Space Telescope used its Wide Field Camera 3 and Advanced Camera for Surveys to capture this … [+1986 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "L-G Vinai Kumar Saxena invites suggestions to address Delhi’s water crisis", "description": "This year, Delhi faced a huge water shortage problem in the summer and a quarrel between the national capital and Haryana took place with the Delhi Jal Board (DJB) claiming that the neighbouring state was not releasing water. On its part, Haryana said it is s…", "url": "https://indianexpress.com/article/delhi/l-g-vinai-kumar-saxena-invites-suggestions-to-address-delhis-water-crisis-8007447/", "urlToImage": "https://images.indianexpress.com/2022/07/pune-1-1-2.jpeg", "publishedAt": "2022-07-04T04:59:02Z", "content": "After calling for suggestions on improving the air quality and clearing Delhi of the mountains of garbage, Lieutenant Governor Vinai Kumar Saxena Monday sought proposals on addressing the water crisi… [+1753 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Indiana: Over 30 bodies, some decomposing, found in funeral home", "description": "Police in the Louisville suburb of Jeffersonville responded to Lankford Funeral Home and Family Center on Friday evening and found 31 bodies, including some \"in the advanced stages of decomposition,” Maj. Isaac Parker said.", "url": "https://indianexpress.com/article/world/indiana-31-bodies-found-in-funeral-home-8007416/", "urlToImage": "https://images.indianexpress.com/2022/07/indiana.jpeg", "publishedAt": "2022-07-04T04:54:22Z", "content": "Police are investigating after more than 30 bodies, some decomposing was found inside a southern Indiana funeral home.Police in the Louisville suburb of Jeffersonville responded to Lankford Funeral H… [+1182 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Sensex climbs nearly 160 points in early trade", "description": "The BSE benchmark was trading with a gain of 159.56 points at 53,067.49 in early trade. The NSE Nifty also went higher by 45.4 points to 15,797.45.", "url": "https://indianexpress.com/article/business/market/share-market-today-july-4-equity-stocks-bse-sensex-nse-nifty-rupee-global-cues-8007358/", "urlToImage": "https://images.indianexpress.com/2022/06/bse-bombay-stock-exchange-express-archive-1200-1.jpg", "publishedAt": "2022-07-04T04:50:20Z", "content": "The BSE benchmark index Sensex climbed nearly 160 points in early trade on Monday, tracking gains in index majors RIL, ICICI Bank and ITC amid a mixed trend in global markets.The BSE benchmark was tr… [+1089 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "At least 16 killed as bus falls into gorge in Himachal Pradesh", "description": "The bus fell into the gorge near Jangla village at around 8.30 am.", "url": "https://indianexpress.com/article/cities/shimla/sixteen-killed-as-bus-falls-into-gorge-in-himachal-pradesh-8007423/", "urlToImage": "https://images.indianexpress.com/2022/07/Bus-hp.jpg", "publishedAt": "2022-07-04T04:50:03Z", "content": "A private bus fell into a gorge in Himachal Pradesh’s Kullu district on Monday, leaving 16 people, including some school children, dead, a senior official said.Kullu Deputy Commissioner Ashutosh Garg… [+1189 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Agencies to conduct IPDR analysis of Udaipur accused phones to check their Internet activities", "description": "Besides these two accused, against whom the evidence is a self-shot video, the security agencies also nabbed two more -- Mohsin and Asif -- who are alleged to be a part of the conspiracy to spread terror amongst the public at large.", "url": "https://indianexpress.com/article/cities/jaipur/agencies-to-conduct-ipdr-analysis-of-udaipur-accused-phones-to-check-their-internet-activities-8007419/", "urlToImage": "https://images.indianexpress.com/2022/07/Udaipur-accused-1.jpg", "publishedAt": "2022-07-04T04:45:17Z", "content": "Security agencies including the NIA, probing the “heinous” murder of a tailor in Udaipur, will conduct an Internet Protocol Detail Records (IPDR) analysis of the phones used by the four accused arres… [+3647 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Wimbledon crowds down 7 percent from 2019; 2nd-lowest since 2007", "description": "", "url": "https://indianexpress.com/article/sports/tennis/wimbledon-crowds-down-7-percent-from-2019-2nd-lowest-since-2007-8007390/", "urlToImage": "https://images.indianexpress.com/2022/07/tennis-crowd.jpg", "publishedAt": "2022-07-04T04:44:03Z", "content": "If it seems as if there are more empty green seats in the stands at Wimbledon than usual this fortnight, that’s because there have been fewer spectators than usual so far.Through the first six days o… [+2639 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Janhvi Kapoor and Nysa Devgn twin in red in Amsterdam as they dine together, see photos", "description": "Janhvi Kapoor shared multiple pictures from her Amsterdam trip and fans having going gaga over one that sees her bonding with Nysa Devgn.", "url": "https://indianexpress.com/article/entertainment/bollywood/janhvi-kapoor-and-nysa-devgn-bond-in-amsterdam-as-they-dine-together-see-photos-8007356/", "urlToImage": "https://images.indianexpress.com/2022/07/janhvi-kapoor-nysa-devgn-amsteradam.jpg", "publishedAt": "2022-07-04T04:43:27Z", "content": "The next generation of star kids seems to be quite friendly to each other. A picture from Janhvi Kapoor and Nysa Devgn having brunch together in Amsterdam with friends is going viral on social media.… [+1785 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Rocketry The Nambi Effect box office collection: R Madhavan film receives good word-of-mouth, gets 9.3 rating on IMDb", "description": "Rocketry The Nambi Effect box office collection: The R Madhavan film is reportedly doing better in the Hindi speaking belt of India.", "url": "https://indianexpress.com/article/entertainment/bollywood/box-office-collection/rocketry-the-nambi-effect-box-office-collection-r-madhavan-good-word-of-mouth-imdb-8007317/", "urlToImage": "https://images.indianexpress.com/2022/07/rocketry-madhavan-1200.jpg", "publishedAt": "2022-07-04T04:43:03Z", "content": "R Madhavan’s Rocketry: The Nambi Effect is picking up pace at the box office. The film, which released on July 1, is getting a positive word-of-mouth and currently holding an IMDb rating of 9.3. Madh… [+1911 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "আনন্দের মুহূর্ত বদলে গেল ‘কান্নায়’, শপিং মলে এলোপাথাড়ি গুলিতে মৃত ৩", "description": "ডেনমার্কের মত দেশে গুলি চালনার ঘটনা বিরল, ঘটনার তদন্ত শুরু করা হয়েছে।", "url": "https://bengali.indianexpress.com/general-news/3-dead-3-critically-wounded-in-shooting-at-denmark-mall-465074/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/05/usa-shooting.jpg", "publishedAt": "2022-07-04T04:42:16Z", "content": ", ‘ \r\n , ’ , ‘ ’\r\n : [ , ?]\r\n , ! , , ” ’\r\n : [ , ]\r\n , , ’ \r\nStay updated with the latest news headlines and all the latest General news download Indian Express Bengali App.\r\nWeb Title: 3 dead 3 cri… [+42 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "British Army’s Twitter and YouTube accounts restored after hack", "description": "The British Army regained control of its Twitter and YouTube accounts on Sunday after they were briefly hacked.", "url": "https://indianexpress.com/article/technology/tech-news-technology/british-armys-twitter-and-youtube-accounts-restored-after-hack-8007404/", "urlToImage": "https://images.indianexpress.com/2022/07/British-army-twitter-hacked.jpg", "publishedAt": "2022-07-04T04:41:19Z", "content": "The British Army regained control of its Twitter and YouTube accounts on Sunday after they were briefly hacked and used to post about cryptocurrencies and non-fungible tokens.“Apologies for the tempo… [+1082 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "With no fuel and no cash, Sri Lanka keeps schools closed", "description": "A huge foreign debt has left the Indian Ocean island with none of the suppliers willing to sell fuel on credit. The available stocks, sufficient for only several days, will be provided for essential services, including health and port workers, public transpor…", "url": "https://indianexpress.com/article/world/with-no-fuel-cash-sri-lanka-schools-closed-8007400/", "urlToImage": "https://images.indianexpress.com/2022/07/SL-2-1.jpg", "publishedAt": "2022-07-04T04:37:46Z", "content": "Cash-strapped Sri Lanka on Sunday extended school closures for one week because there isn’t enough fuel for teachers and parents to get children to classrooms, and the energy minister appealed to the… [+3133 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuj Bhatia", "title": "Infinix Inbook X1 Slim review: Lacks bells and whistles but feels dependable", "description": "The Inbook X1 Slim doesn’t set any such unrealistic expectations that make it hard to justify spending upwards of Rs 30,000 on Infinix’s latest budget laptop.", "url": "https://indianexpress.com/article/technology/tech-reviews/infinix-inbook-x1-slim-review-8007266/", "urlToImage": "https://images.indianexpress.com/2022/07/Infinix-1.jpg", "publishedAt": "2022-07-04T04:36:05Z", "content": "As I was leaving for an evening walk the other day, I got a call from an old friend who narrated his ordeal of how his decision of buying an expensive laptop turned out to be a bad one. He just chose… [+5708 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Delhi News Live Updates: Monsoon session in Assembly to commence today; light rain expected", "description": "Delhi News Live Updates, Delhi Assembly Monsoon session, Delhi rains, weather forecast, July 4: Light rain and thundershowers are expected in the city on Monday.", "url": "https://indianexpress.com/article/cities/delhi/delhi-news-live-updates-monsoon-session-rains-8007257/", "urlToImage": "https://images.indianexpress.com/2022/07/delhi-assembly.jpg", "publishedAt": "2022-07-04T04:33:43Z", "content": "Waterlogging at one of the underpasses that is part of the Pragati Maidan Corridor after Sundays rain. (Express Photo by Prem Nath Pandey)\r\nDelhi is expected to get heavy rainfall on Wednesday, offic… [+1467 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Apple Watch 8 could include ‘temperature sensor’, no heart-rate on AirPods Pro 2: Report", "description": "Apple Watch Series 8 will get a new body temperature sensor, and a rugged variant as well. But the AirPods Pro will not come with any heart-rate sensor.", "url": "https://indianexpress.com/article/technology/gadgets/apple-watch-8-could-include-temperature-sensor-no-heart-rate-on-airpods-pro-2-report-8007397/", "urlToImage": "https://images.indianexpress.com/2022/07/AppleWatch_7_LEAD_3.jpg", "publishedAt": "2022-07-04T04:32:13Z", "content": "It looks like the most significant upgrade on the Apple Watch Series 8 will be the inclusion of a new body temperature sensor. According to Bloombergs Mark Gurman, the feature will be part of the sta… [+2277 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Rupee falls 9 paise to 79.03 against US dollar in early trade", "description": "At the interbank foreign exchange, the rupee opened at 78.97 against the US dollar, then fell to quote 79.03, registering a decline of 9 paise over the last close.", "url": "https://indianexpress.com/article/business/market/rupee-vs-us-dollar-today-july-4-currency-market-8007365/", "urlToImage": "https://images.indianexpress.com/2022/07/rupee-pixabay-1200.jpg", "publishedAt": "2022-07-04T04:31:17Z", "content": "The rupee depreciated 9 paise to 79.03 against the US dollar in opening trade on Monday, as persistent foreign funds outflows weighed on investor sentiments.Forex traders said the weakness of crude o… [+1560 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "‘Getting stronger every day’: Shweta Tripathi Sharma’s fitness trainer is all praises for her", "description": "\"Once your hardwork is visible, you will never give up,\" fitness trainer Tridev Pandey wrote on Instagram", "url": "https://indianexpress.com/article/lifestyle/fitness/shweta-tripathi-sharma-fitness-trainer-benefits-cardio-7943763/", "urlToImage": "https://images.indianexpress.com/2022/05/Shweta-Tripathi-Sharma_1200.jpg", "publishedAt": "2022-07-04T04:30:23Z", "content": "Shweta Tripathi Sharma is not just an accomplished actor, she is also someone who sets massive fitness goals. As such, she often shares glimpses of her sweat sessions from the gym.But this time, it w… [+1946 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "CBSE Class 10th, 12th Results 2022: Before CBSE results are declared, here’s all you need to know", "description": "CBSE Class 10, 12 results 2022: To check term 2 results of class 10 and class 12, students can visit the official website — cbse.nic.in, cbseresults.nic.in, cbseresults.gov.in or cbse.gov.in.", "url": "https://indianexpress.com/article/education/before-cbse-results-are-declared-heres-all-you-need-to-know-cbseresults-nic-in-cbse-gov-in-7999158-8003097/", "urlToImage": "https://images.indianexpress.com/2022/07/CBSE-1.jpg", "publishedAt": "2022-07-04T04:29:08Z", "content": "CBSE Class 10th, 12th results 2022: The Central Board of Secondary Education (CBSE) concluded the class 10 and 12 exams recently, and the results will soon be declared on the official website cbseres… [+3226 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "A clunky mask may be the answer to airborne disease and N95 waste", "description": "A few studies have suggested that reusable elastomeric respirators should be essential gear for frontline medical workers during a respiratory pandemic, which experts predicted would quickly deplete supplies of N95s, the disposable filtration masks largely ma…", "url": "https://indianexpress.com/article/technology/science/a-clunky-mask-may-be-the-answer-to-airborne-disease-and-n95-waste-8007383/", "urlToImage": "https://images.indianexpress.com/2022/07/Clunky-elastomeric-reusable-mask-N95-solution.jpg", "publishedAt": "2022-07-04T04:26:30Z", "content": "In the early 1990s, long before PPE, N95 and asymptomatic transmission became household terms, federal health officials issued guidelines for how medical workers should protect themselves from tuberc… [+10806 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "‘Big series next year against India. Our approach is to be proactive and being brave’: Australia captain Pat Cummins", "description": "Pat Cummins says Australia will continue to bat aggressively and keep up the tempo on spin tracks.", "url": "https://indianexpress.com/article/sports/cricket/big-series-next-year-against-india-our-approach-is-to-be-proactive-and-being-brave-australia-captain-pat-cummins-8007375/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-5.jpg", "publishedAt": "2022-07-04T04:24:50Z", "content": "Pat Cumminss Australia has already started targeting the India Test tour next year, and consciously adopting an aggressive batting strategy in Sri Lanka that they feel would help them do well in Indi… [+2435 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Sticky bombs, pistols, grenades seized from captured LeT militant’s hideout in Jammu and Kashmir’s Rajouri", "description": "Talib Shah and another LeT militant Faizal Ahmed Dar from Pulwama were captured by residents of Tuksan Dhok village in the Reasi district on Sunday.", "url": "https://indianexpress.com/article/cities/jammu/jammu-kashmir-let-militant-talib-shah-hideout-8007381/", "urlToImage": "https://images.indianexpress.com/2022/07/let-militant-hideout.jpg", "publishedAt": "2022-07-04T04:22:54Z", "content": "The Jammu and Kashmir Police have seized arms, ammunition and explosives from a hideout of arrested Lashkar-e-Toiba (LeT) militant Talib Shah in the Draj area of border Rajouri district.The seizures … [+2604 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Wimbledon 2022 lookahead: No ‘Manic Monday’ as Nadal, Halep play", "description": "Second-seeded Rafael Nadal will face Botic van de Zandschulp of the Netherlands.", "url": "https://indianexpress.com/article/sports/tennis/wimbledon-2022-lookahead-no-manic-monday-as-nadal-halep-play-8007332/", "urlToImage": "https://images.indianexpress.com/2022/06/Nadal-8.jpg", "publishedAt": "2022-07-04T04:16:55Z", "content": "There’s no more Manic Monday at Wimbledon, although there will be plenty of intriguing fourth-round matchups nonetheless. Nick Kyrgios will be first out on Centre Court, trying to follow up his win o… [+1586 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Amid anger in Kashmir over Amarnath Yatra restrictions, L-G Manoj Sinha directs for smooth movement of fruit and vegetable trucks", "description": "On Saturday, the fruit growers protested at Sopore against the government for stopping trucks carrying fruit and vegetable on the Srinagar-Jammu national highway to facilitate the movement of the Amarnath pilgrims.", "url": "https://indianexpress.com/article/cities/srinagar/anger-kashmir-amarnath-yatra-restrictions-manoj-sinha-movement-fruit-vegetable-trucks-8007377/", "urlToImage": "https://images.indianexpress.com/2022/07/lamber1-1.jpg", "publishedAt": "2022-07-04T04:16:11Z", "content": "J-Ks Lieutenant Governor Manoj Sinha has directed officials not to stop fruit and vegetable trucks on the highway amid anger in the Valley over the severe restrictions on the movement of traffic and … [+2765 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Udaipur murder casts shadow on tourism; tourists cancel advance hotel bookings", "description": "Most tourists in Udaipur visit Jagdish Chowk and Hathi Pole area, and Maldas street, where the barbaric killing of tailor Kanhaiya Lal took place on Tuesday, is located nearby.", "url": "https://indianexpress.com/article/cities/jaipur/udaipur-murder-casts-shadow-on-tourism-tourists-cancel-advance-hotel-bookings-8007378/", "urlToImage": "https://images.indianexpress.com/2022/07/udaipur.jpeg", "publishedAt": "2022-07-04T04:16:00Z", "content": "More than half the hotel bookings made for the next two months in Udaipur have been cancelled as a fallout of the gruesome killing of a tailor, stakeholders claimed.This has come as a major setback f… [+4179 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Maharashtra Floor Test Live Updates: Eknath Shinde reinstated as Shiv Sena legislative party leader ahead of trust vote", "description": "Maharashtra Floor Test Live Updates, July 4, 2022: The trust vote comes a day after the BJP-Eknath Shinde faction government's candidate Rahul Narwekar was elected as Assembly Speaker.", "url": "https://indianexpress.com/article/cities/mumbai/maharashtra-floor-test-live-updates-eknath-shinde-shiv-sena-bjp-thackeray-8007342/", "urlToImage": "https://images.indianexpress.com/2022/07/Shinde.jpg", "publishedAt": "2022-07-04T04:13:22Z", "content": "Over 600 Mumbaikars participated in a peaceful protest held on Sunday against the controversial Metro 3 car shed site near the picnic point in Aarey forest. \"The new CM Eknath Shinde was part of the … [+1510 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sheetal Banchariya", "title": "Despite language barrier, Chinese universities make huge gains in global rankings over the last decade", "description": "An analysis of the QS rankings and Times Higher Education (THE) rankings over ten years shows that only China has significantly increased its share of universities in the world's top 500", "url": "https://indianexpress.com/article/education/despite-language-barrier-chinese-universities-make-huge-gains-global-rankings-last-decade-8007350/", "urlToImage": "https://images.indianexpress.com/2022/07/Tsinghua-University-1.jpg", "publishedAt": "2022-07-04T04:12:36Z", "content": "China has been steadily climbing the world university rankings over the past decade as it continues to promote policies that strengthen the performance of its high-potential institutions on ranking m… [+9114 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Searching for gold, miners discover a frozen baby mammoth", "description": "Experts estimate that the mammoth was just over a month old when it perished in mud. It was then captured in time, encased in the frozen layer of ground known as permafrost, during the ice age more than 30,000 years ago.", "url": "https://indianexpress.com/article/technology/science/searching-for-gold-miners-discover-a-frozen-baby-mammoth-8007362/", "urlToImage": "https://images.indianexpress.com/2022/07/Woolly_mammoth.jpg", "publishedAt": "2022-07-04T04:03:53Z", "content": "About a half-hour before his lunch break one June morning, Travis Mudry was operating an excavator and digging through permafrost in the Klondike gold fields of the Yukon in Canada.\r\nHe was scratchin… [+3930 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Most places in Rajasthan receive rainfall Jaipur", "description": "According to the department, less than 4 cm rainfall was recorded at many other places in the state.", "url": "https://indianexpress.com/article/cities/jaipur/most-places-in-rajasthan-receive-rainfall-jaipur-8007360/", "urlToImage": "https://images.indianexpress.com/2022/07/gujarat-6.jpeg", "publishedAt": "2022-07-04T04:02:16Z", "content": "Light to moderate rain was recorded in most areas of Rajasthan during the last 24 hours, while isolated pockets received downpours, the weather department said on Sunday.According to the Meteorologic… [+690 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "BJP, JD(U) in search of ‘their own Eknath Shinde’ to pull each other down: Chirag Paswan", "description": "Chirag Paswan accused the two parties of remaining in an alliance \"just for the sake of power\", and charged the BJP with capitulating before Chief Minister Nitish Kumar on ideological issues.", "url": "https://indianexpress.com/article/cities/patna/bjp-jdu-eknath-shinde-chirag-paswan-8007213/", "urlToImage": "https://images.indianexpress.com/2022/07/ch1352767.jpg", "publishedAt": "2022-07-04T04:00:15Z", "content": "The JD(U) and its ally BJP were in search of “their own Eknath Shinde”, who could pull the rug from under the feet of his own party to benefit the rival, former Lok Janshakti Party chief Chirag Paswa… [+2653 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Bloomberg", "title": "Tether fails to calm jittery nerves with short sellers circling", "description": "Crypto investors have soured on Tether since the collapse of the TerraUSD stablecoin in early May led to increased scrutiny of the assets it claims to be backed by. Short sellers have boosted bets against Tether in the past month.", "url": "https://indianexpress.com/article/technology/crypto/tether-fails-to-calm-jittery-nerves-with-short-sellers-circling-8007348/", "urlToImage": "https://images.indianexpress.com/2022/07/Tether-short-sellers-circle-jittery.jpg", "publishedAt": "2022-07-04T03:55:48Z", "content": "Repeated assurances by the backers of Tether, the biggest stablecoin, that the token is backed by ample reserves and working smoothly havent been enough to reassure markets.A so-called liquidity pool… [+2669 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Yashee", "title": "Surat’s Dumas beach is considered haunted. This is the real danger here", "description": "The Dumas Beach has gained its 'haunted' reputation probably because of its black sand and stories about an ancient cremation ground here. But those living around it really are scared of something – something man-made.", "url": "https://indianexpress.com/article/cities/ahmedabad/surats-dumas-beach-haunted-real-danger-8007281/", "urlToImage": "https://images.indianexpress.com/2022/07/dumas-three.jpg", "publishedAt": "2022-07-04T03:53:22Z", "content": "If you ever look up ‘the most haunted places in India’ online, you will come across the name of Dumas beach, about 20 km from Surat in Gujarat. The sand at the beach is black, providing fertile groun… [+5175 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Maharashtra: Speaker removes Ajay Chaudhary as Shiv Sena legislature party leader, reinstates Eknath Shinde", "description": "Narvekar also recognised the appointment of Bharat Gogawale from the Shinde camp as the chief whip of the Sena, removing Sunil Prabhu, who belongs to the Thackeray faction.", "url": "https://indianexpress.com/article/cities/mumbai/maharashtra-speaker-removes-ajay-chaudhary-as-shiv-sena-legislature-party-leader-reinstates-eknath-shinde-8007328/", "urlToImage": "https://images.indianexpress.com/2022/07/shinde-fadnavis-1200.jpeg", "publishedAt": "2022-07-04T03:53:04Z", "content": "In a jolt to Uddhav Thackeray ahead of the Eknath Shinde-led government’s floor test, Maharashtra Assembly Speaker Rahul Narvekar has reinstated Shinde as Shiv Sena legislature party leader, removing… [+2187 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Udit Misra", "title": "ExplainSpeaking: Despite the fall, are Indian stock markets still overvalued?", "description": "One of the key observations in RBI's Financial Stability Report that caught everyone’s attention was the growing disconnect between India’s stock markets and the real economy. We take a look at the status of India’s equity markets and their valuation.", "url": "https://indianexpress.com/article/explained/explainspeaking-indian-stock-markets-valuation-rbi-8007300/", "urlToImage": "https://images.indianexpress.com/2022/07/udit-4.7.jpg", "publishedAt": "2022-07-04T03:48:30Z", "content": "ExplainSpeaking-Economy is a weekly newsletter by Udit Misra, delivered in your inbox every Monday morning. Click here to subscribeDear Readers,\r\nLast week, the Reserve Bank of India came out with it… [+10044 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "SL vs AUS: Nathan Lyon just 7 wickets away from overtaking Ashwin’s Test tally", "description": "If he takes 7 or more wickets, Nathan Lyon will become the off spinner with most Test wickets since Muralitharan", "url": "https://indianexpress.com/article/sports/cricket/sl-vs-aus-nathan-lyon-just-7-wickets-away-from-overtaking-ashwins-test-tally-8007327/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-3.jpg", "publishedAt": "2022-07-04T03:48:08Z", "content": "Just six wickets separate Nathan Lyon and R Ashwin. If Australias Lyon can take seven or more wickets in the second Test, he can become the off spinner with most Test wickets since Sri Lankas Muttiah… [+2566 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Here’s what makes sprouts an ideal food to begin your day with", "description": "What do you usually have for breakfast?", "url": "https://indianexpress.com/article/lifestyle/health/sprouts-benefits-kick-start-morning-breakfast-idea-benefits-energy-7985752/", "urlToImage": "https://images.indianexpress.com/2020/02/sprouts-fb.jpg", "publishedAt": "2022-07-04T03:40:40Z", "content": "Having nourishing foods for breakfast is the ideal way to kickstart your day, as they not only aid metabolismbut also boost energy levels.One such food is sprouts.\r\nBuy Now | Our best subscription pl… [+985 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Hema Malini, Esha Deol dance together on Superstar Singer: ‘Dream girl becomes Dhoom girl’", "description": "Esha Deol shared a video of mother Hema Malini dancing on her song 'Dhoom' during their recent visit to Superstar Singer 2. Watch here.", "url": "https://indianexpress.com/article/entertainment/television/hema-malini-daughter-esha-deol-dance-together-dhoom-superstar-singer-watch-8007278/", "urlToImage": "https://images.indianexpress.com/2022/07/hema-malini-esha-deol-dhoom.jpg", "publishedAt": "2022-07-04T03:37:15Z", "content": "The latest episode of Superstar Singer 2 saw Hema Malini and daughter Esha Deol grace the stage. While the two actors enjoyed a musical evening, fans were in for a happy surprise when they got on sta… [+1985 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Minions set box office on fire with $108.5 million debut", "description": "The success of Minions: The Rise of Gru at the box office serves as further proof that family audiences are willing to go back to the movie theater.", "url": "https://indianexpress.com/article/entertainment/hollywood/minions-set-box-office-on-fire-with-108-5-million-debut-8007274/", "urlToImage": "https://images.indianexpress.com/2022/07/Minions-Rise-of-Gru-ap-1200by667.jpeg", "publishedAt": "2022-07-04T03:35:16Z", "content": "Families went bananas for Minions this weekend at the movie theater. Minions: The Rise of Gru brought in an estimated $108.5 million in ticket sales from 4,391 screens in North America, Universal Pic… [+2804 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Hamza Khan", "title": "Bhim Army chief Chandra Shekhar Azad arrested from Jaipur hotel, activists cry foul", "description": "Talking to The Indian Express, Dalit activist Dharmendra Kumar said Azah had reached Jaipur to support the protest called by Covid Health Assistants (CHA), who have been demanding regularisation of their jobs.", "url": "https://indianexpress.com/article/cities/jaipur/bhim-army-chief-arrested-from-hotel-activists-cry-foul-8007295/", "urlToImage": "https://images.indianexpress.com/2022/07/Chandrashekhar-Azad.jpg", "publishedAt": "2022-07-04T03:23:17Z", "content": "The People’s Union for Civil Liberties (PUCL)Rajasthan on Sunday condemned what it termed was illegal arrest of Bhim Army Chief Chandra Shekhar Azad and 21 others by the Jaipur Police from a hotel in… [+1930 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Kareena Kapoor seals her weekend with a kiss from Saif Ali Khan at the English Channel, see photos", "description": "Kareena Kapoor Khan and Saif Ali Khan are vacationing in the UK , along with their sons Taimur and Jeh for sometime now.", "url": "https://indianexpress.com/article/entertainment/bollywood/kareena-kapoor-khan-seals-her-weekend-with-a-kiss-from-saif-ali-khan-at-the-english-channel-see-photos-8007260/", "urlToImage": "https://images.indianexpress.com/2022/07/kareena-saif-1200.jpg", "publishedAt": "2022-07-04T03:14:54Z", "content": "Kareena Kapoor Khan had a romantic weekend with husband Saif Ali Khan, a glimpse of which she shared on her Instagram account on Sunday. Kareena spent some quality time at the English Channel with Sa… [+1083 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Leela Prasad, Srishti Kapoor", "title": "Daily Briefing: BJP era will last 30-40 years, says Amit Shah; SC judge calls for mandatory regulation of social media", "description": "In today’s edition: A Supreme Court judge wants mandatory regulation of social media; Covid crisis brings estranged couples together in Gujarat; and why over 50% of Indigo flights were delayed.", "url": "https://indianexpress.com/article/live-news/daily-briefing-top-news-july-4-8007275/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-2021-11-08T081015.674.jpg", "publishedAt": "2022-07-04T03:12:00Z", "content": "In todays edition: A Supreme Court judge wants mandatory regulation of social media; Covid crisis brings estranged couples together in Gujarat; and why over 50% of Indigo flights were delayed. \r\nThe … [+5996 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Arushi Jain", "title": "Bollywood box office report 2022: RRR and KGF 2 reigned as big stars bombed", "description": "Six months into 2022, and we already have a few films setting new box office records and earning better than what they would have in the pre-pandemic time. KGF Chapter 2 Hindi version has trumped them all with a collection of Rs 434.70 crore.", "url": "https://indianexpress.com/article/entertainment/bollywood/box-office-collection/bollywood-box-office-report-2022-rrr-kgf-2-the-kashmir-files-bhool-bhulaiyaa-2-8003965/", "urlToImage": "https://images.indianexpress.com/2022/07/box-office-report-copy.jpeg", "publishedAt": "2022-07-04T03:04:40Z", "content": "The outbreak of Covid-19 impacted the business of cinema as theatres were either shut down or people were wary of visiting them. But just when everyone thought the cinema-going experience would soon … [+4037 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Bengaluru, Karnataka Live Updates: Yashwant Sinha: BJP govt in Karnataka trying to communalise school curriculum", "description": "Bengaluru, Karnataka Live Updates: Sinha said he will not hesitate to restrain the Centre from destabilising state governments run by Opposition parties; BESCOM to hold EV Expo in tier-two cities in Karnataka", "url": "https://indianexpress.com/article/cities/bangalore/bengaluru-karnataka-live-updates-yashwant-sinha-bjp-govt-in-karnataka-trying-to-communalise-school-curriculum-karnataka-latest-news-bangalore-news-8007224/", "urlToImage": "https://images.indianexpress.com/2022/07/sinha-1.jpg", "publishedAt": "2022-07-04T03:04:29Z", "content": "The presidential candidate for the opposition also welcomed the statement of the Chief Justice of India that the judiciary is answerable only to the Constitution. (PTI)Bengaluru, Karnataka Live Updat… [+1003 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Explained: What is the IS-KP, the terror outfit behind Kabul gurdwara attack?", "description": "Formed in 2015, the IS-KP is the regional affiliate of the Islamic State of Iraq and Syria (ISIS), also known as ISIL (Islamic State of Iraq and the Levant). Khorasan refers to a region that falls in modern-day Pakistan and Afghanistan.", "url": "https://indianexpress.com/article/explained/explained-what-is-the-is-kp-the-terror-outfit-behind-kabul-gurdwara-attack-8006958/", "urlToImage": "https://images.indianexpress.com/2022/07/explained-1.jpg", "publishedAt": "2022-07-04T03:00:05Z", "content": "A batch of 11 Afghan Sikhs arrived in Delhi last week after two persons from the community were killed in a terror attack on Gurdwara Dashmesh Pita Guru Gobind Singh Karte Parwan in Kabul on June 18.… [+4632 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "‘Two very competitive people doing what they love’: Jonny Bairstow plays down Virat Kohli incident", "description": "Stirred by a hot exchange with Kohli, Bairstow turns aggressive to reach his 100", "url": "https://indianexpress.com/article/sports/cricket/eng-vs-ind-two-very-competitive-people-doing-what-they-love-jonny-bairstow-plays-down-virat-kohli-incident-8007255/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-2.jpg", "publishedAt": "2022-07-04T02:58:04Z", "content": "The key moment during Englands batting was the verbals between Virat Kohli and Jonny Bairstow. Bairstow was on 13 off 60, the verbal interaction with Kohli happened. He shifted gears and galloped to … [+3958 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Man stabbed to death with key in East Delhi", "description": "DCP (East) Priyanka Kashyap said: “Initial inquiry revealed that the deceased along with his friend had an altercation with an unknown scooter rider on touching of their (vehicles).”", "url": "https://indianexpress.com/article/delhi/man-stabbed-to-death-with-key-in-east-delhi-8007268/", "urlToImage": "https://images.indianexpress.com/2022/07/dead-body.jpg", "publishedAt": "2022-07-04T02:58:00Z", "content": "A 20-year-old man died after allegedly being stabbed to death with a key outside a wine shop in East Delhis Samaspur Sunday in an apparent incident of road rage, sources said. The deceased was identi… [+839 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "‘Sometimes things have to fall apart in order to come back together’: Patti Ashley", "description": "“You aren't born asking for a Starbucks; instead you cry out for the feeling of being comforted, loved, seen, nurtured,” says Patti in her Ted Talk", "url": "https://indianexpress.com/article/lifestyle/life-positive/patti-ashley-life-positive-motivational-8002872/", "urlToImage": "https://images.indianexpress.com/2022/07/patti-ashley-final.jpg", "publishedAt": "2022-07-04T02:50:45Z", "content": "Everybody in their lives has faced trauma; it does not matter how deep-rooted or how instantaneous and surface-level your sentiments feel, theyre all in there somewhere waiting for you to acknowledge… [+1385 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anonna Dutt", "title": "Private labs claim not paid in full for Covid tests, officials cite ‘delays’", "description": "Of the total amount, Rs 35 crore was released as an advance or in the first phase of payment soon after the verification process was completed. Another Rs 3-Rs 4 crore was released in the second phase after laboratories produced additional documents.", "url": "https://indianexpress.com/article/cities/delhi/private-labs-claim-not-paid-for-covid-tests-8007253/", "urlToImage": "https://images.indianexpress.com/2022/07/coronavirus-1-2-1.jpg", "publishedAt": "2022-07-04T02:48:53Z", "content": "Several labs in the West district said that they have been paid less to the tune of crores for Covid-19 tests when payments for bills worth more than Rs 50 crore, that were pending clearance for two … [+4137 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Bobby Deol on rehearsing for Gupt’s ‘Duniya Haseeno Ka Mela’: ‘Itni rehearsal karta tha ki meri pant…’", "description": "As Bobby Deol, Kajol and Manisha Koirala's thriller Gupt turns 25 today, we revisit a few BTS moments of the Rajiv Rai film.", "url": "https://indianexpress.com/article/entertainment/bollywood/bobby-deol-kajol-25-years-of-gupt-8000100/", "urlToImage": "https://images.indianexpress.com/2022/06/deol1200x.jpg", "publishedAt": "2022-07-04T02:48:19Z", "content": "Bobby Deol, Kajol and Manisha Koirala-starrer Guptturns 25 today. The Rajiv Rai directorial had hit the screens on exactly this day two-and-a-half decades ago. People still remember Gupt for its clim… [+1650 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Is Cristiano Ronaldo to blame for United missing out on Champions League spot", "description": "At the age of 36, Ronaldo tied his future to Manchester United at the beginning of last season for two years. But one year in, Ronaldo has now reportedly asked the United board to relinquish their rights to him, should an acceptable offer come in.", "url": "https://indianexpress.com/article/explained/cristiano-ronaldo-manchester-united-champions-league-8007248/", "urlToImage": "https://images.indianexpress.com/2022/07/Ronaldo.jpg", "publishedAt": "2022-07-04T02:36:34Z", "content": "Cristiano Ronaldo is undoubtedly one of the greatest footballers of all time. But in his second coming at Manchester United, he couldnt prevent the club from being an also-ran in the race for a Champ… [+6238 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "While You Were Asleep: In Wimbledon-Djokovic beats curfew to reach quarters, Tunisia’s Ons Jabeur into QF again; Windies beat Bangladesh in 2nd T20I", "description": "The three-time defending champion Djokovic will face Jannik Sinner in the quarters.", "url": "https://indianexpress.com/article/sports/while-you-were-asleep-in-wimbledon-djokovic-beats-curfew-to-reach-quarters-tunisias-ons-jabeur-into-qf-again-windies-beat-bangladesh-in-2nd-t20i-8007234/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-1.jpg", "publishedAt": "2022-07-04T02:28:14Z", "content": "Novak Djokovic reached his 13th Wimbledon quarterfinal on Sunday night by beating Dutch player Tim van Rijthoven 6-2, 4-6, 6-1, 6-2 on Centre Court. The wild-card entry Rijthoven, ranked 104th, posed… [+2430 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Sports Desk", "title": "ইউরোপের চ্যাম্পিয়ন দলে ভারতের সুপারস্টার! দেশের ফুটবলে বিপ্লব এনে খেলবেন চ্যাম্পিয়ন্স লিগেও", "description": "মহিলা ফুটবলে বিপ্লব এনে দিলেন ডংমেই গ্রেস, মণীষা কল্যাণ। মণীষা যোগ দিচ্ছেন সাইপ্রাসের ক্লাবে।", "url": "https://bengali.indianexpress.com/sports/indian-women-football-manisha-kalyan-roped-in-by-cyprus-apollon-ladies-to-play-in-champions-league-465050/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/Manisha-kalyan.jpeg", "publishedAt": "2022-07-04T02:09:55Z", "content": "Thank you, Manisha! \r\nAfter 3 illustrious years as a Malabarian and winning two IWL titles with us, Manisha has signed a two-year deal with Cypriot Champion Club Apollon Ladies She is all set to beco… [+156 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Karnataka’s Sini Shetty crowned Femina Miss India World 2022", "description": "The pageant in its hybrid format had launched a nationwide hunt to find prospective talents from all corners of the country through virtual auditions", "url": "https://indianexpress.com/article/lifestyle/life-style/karnatakas-sini-shetty-crowned-femina-miss-india-world-2022-8007208/", "urlToImage": "https://images.indianexpress.com/2022/07/SiniShetty_Insta1200.jpg", "publishedAt": "2022-07-04T01:27:57Z", "content": "Sini Shetty from Karnataka was on Sunday announced the winner of Femina Miss India World 2022 title at the grand finale of VLCC Femina Miss India here.At the ceremony, hosted at the Jio World Convent… [+1893 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Yogesh Naik, Vallabh Ozarkar", "title": "Flaying MVA over districts renaming, SP, AIMIM MLAs abstain from Speaker vote", "description": "While congratulating the newly-elected Speaker Rahul Narwekar in his speech in the House, the SP leader and MLA, Abu Asim Azmi, expressed resentment over the MVA government’s last-moment renaming decision.", "url": "https://indianexpress.com/article/political-pulse/maharashtra-speaker-election-mv-sp-aimim-mlas-8007207/", "urlToImage": "https://images.indianexpress.com/2022/07/PTI07_03_2022_000113A.jpg", "publishedAt": "2022-07-04T01:27:45Z", "content": "Both the Samajwadi Party (SP) MLAs, Abu Asim Azmi (Mankhurd) and Rais Shaikh (Bhiwandi), and one of the two AIMIM MLAs, Shah Faruque Anwar (Dhule), in Maharashtra abstained from voting in the Assembl… [+3678 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Chennai power cut today: These areas will face a power disruption in Chennai", "description": "Chennai power disruption July 4, Monday: Parts of Chennai will face a power cut from 9 am to 2 pm for maintenance work today.", "url": "https://indianexpress.com/article/cities/chennai/chennai-power-cut-today-these-areas-will-face-a-power-disruption-in-chennai-8006982/", "urlToImage": "https://images.indianexpress.com/2022/07/electricity-reuters-1200-2-1-2.jpeg", "publishedAt": "2022-07-04T01:00:42Z", "content": "The Tamil Nadu Generation and Distribution Corporation (Tangedco) has announced that power will be suspended in parts of Chennai today in Tambaram, Guindy, Avadi, Adyar, Velachery, KK Nagar, Perambur… [+2234 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "রহস্যময় শিবমন্দির, আজও যার রহস্য ভেদের চেষ্টা চলছে অবিরত", "description": "এটিই বিশ্বে গ্রানাইট পাথরে তৈরি প্রথম সম্পূর্ণ মন্দির।", "url": "https://bengali.indianexpress.com/lifestyle/mysterious-brihadeshwar-shiva-temple-thanjavur-465041/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/tanjavur-shiva-temple.jpg", "publishedAt": "2022-07-04T00:30:00Z", "content": ", , , , \r\n () , ? \r\n - ? ?\r\n , , ’ \r\n - - . , , \r\nStay updated with the latest news headlines and all the latest Lifestyle news download Indian Express Bengali App.\r\nWeb Title: Mysterious brihadeshwa… [+23 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anju Agnihotri Chaba", "title": "Punjab: 34-year-old jailed in Macedonia for 5 years, kin appeal to Government for help", "description": "“I also met local MLA Sukhwinder Kumar Sukhi on Saturday and appraised him about the situation and also handed over to him the letter,” the father said, adding that he will also file a police complaint on Monday against the agent.", "url": "https://indianexpress.com/article/cities/jalandhar/punjab-man-jailed-macedonia-kin-government-appeal-help-8007203/", "urlToImage": "https://images.indianexpress.com/2022/07/arrest-7.jpg", "publishedAt": "2022-07-04T00:18:14Z", "content": "A 34-year-old man from Malla Bedia village of Nawanshahr has been jailed for five years in Northern Macedonia after he was nabbed in the country without a passport. Currently he is in the jail of Sko… [+3497 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "July 4, 1982, Forty Years Ago: UDF Ministry crisis", "description": "The five-week old UDF ministry is engulfed in a grim political crisis which will end up in the exit of at least one minister. The crisis is the direct creation of a revised budget which Finance Minister M Mani presented to the Assembly.", "url": "https://indianexpress.com/article/opinion/editorials/forty-years-ago-israeli-invasion-no-recession-udf-ministry-crisis-8007012/", "urlToImage": "https://images.indianexpress.com/2022/07/04-Jul-1982_IE_001.jpg", "publishedAt": "2022-07-03T22:43:07Z", "content": "The five-week old UDF ministry is engulfed in a grim political crisis which will end up in the exit of at least one minister. The crisis is the direct creation of a revised budget which Finance Minis… [+570 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "The way backward", "description": "Taliban regime in Afghanistan seeks international recognition while continuing to belie all expectations of moderation in power", "url": "https://indianexpress.com/article/opinion/editorials/taliban-regime-in-afghanistan-seeks-international-recognition-while-continuing-to-belie-all-expectations-of-moderation-in-power-8007005/", "urlToImage": "https://images.indianexpress.com/2022/07/edit-1.jpg", "publishedAt": "2022-07-03T22:39:31Z", "content": "The first public appearance by Haibatullah Akhundzada, the supreme leader of Afghanistans Taliban regime, has given no room for hope that those who have taken charge of that benighted country will ch… [+2502 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Ronen Sen", "title": "Ronen Sen writes: The good diplomat", "description": "Satinder Lambah’s professionalism and warmth inspired respect and affection in all he met. He was a proponent of India’s national interests, and also certain universal values.", "url": "https://indianexpress.com/article/opinion/columns/ronen-sen-writes-the-good-diplomat-satinder-kumar-lambah-civil-servant-8007030/", "urlToImage": "https://images.indianexpress.com/2022/07/satinder-1.jpg", "publishedAt": "2022-07-03T22:35:34Z", "content": "Last week, when Satinder Kumar Lambah breathed his last, India lost one of her finest diplomats. Sati, as his friends called him, went away just a fortnight before his 82nd birthday, after a two-year… [+5498 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Anil Sahasrabudhe, Idea Exchange | The economy can’t run only on computer science or electronics, it requires civil and mechanical engineering, too:", "description": "AICTE chairman Anil Sahasrabudhe on why civil and mechanical engineering courses need to incorporate AI and a start-up/entrepreneurial spirit, and how industry involvement and curriculum upgrade are key to students’ employability. The session was moderated by…", "url": "https://indianexpress.com/article/idea-exchange/anil-sahasrabudhe-idea-exchange-the-economy-session-8007078/", "urlToImage": "https://images.indianexpress.com/2022/07/sahasrabudhe.jpg", "publishedAt": "2022-07-03T22:35:31Z", "content": "Alifiya Khan: For the last few years, mechanical and civil engineering seem to have taken a beating. The admission is very low with several colleges closing down. There are allegations that the sylla… [+14140 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Divya Goyal", "title": "An Express Investigation – Part 1: Processing plant lying shut; 21L MT legacy waste dumped at landfill site", "description": "The problem with Ludhiana’s solid waste management, the only city from Punjab that had made it to the first list of 20 “Smart Cities” way back in 2016 even before UT Chandigarh, however, is much more deeper and serious, and is turning huge with each passing d…", "url": "https://indianexpress.com/article/cities/ludhiana/an-express-investigation-part-1-processing-plant-lying-shut-21l-mt-legacy-waste-dumped-at-landfill-site-8007179/", "urlToImage": "https://images.indianexpress.com/2022/07/garbage-4col.jpg", "publishedAt": "2022-07-03T22:33:42Z", "content": "Around 11,00,000 kg, or 1,100 tonnes per day (TPD) thats the quantity of garbage or solid waste that the city of Ludhiana produces in a single day, the highest among 13 Municipal Corporations (MCs) i… [+6279 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sourav Roy Barman", "title": "Panel calls for boosting protein, nutrients in govt meal programmes", "description": "Currently, eggs are served in mid-day meals in 13 states and three UTs as part of “additional food items”. It is served with a frequency varying from five days a week to once a month.", "url": "https://indianexpress.com/article/india/panel-calls-for-boosting-protein-nutrients-in-govt-meal-programmes-8007128/", "urlToImage": "https://images.indianexpress.com/2022/07/MID-DAY-meal-1200.jpg", "publishedAt": "2022-07-03T22:30:55Z", "content": "The Covid-19 pandemic is likely to have aggravated the silent crisis of undernutrition in India, an inter-ministerial committee has observed, recommending that protein-rich food items like eggs, nuts… [+5360 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sourav Roy Barman", "title": "Panel calls for boosting protein, nutrients in government meal programmes", "description": "Currently, eggs are served in mid-day meals in 13 states and three UTs as part of “additional food items”. It is served with a frequency varying from five days a week to once a month.", "url": "https://indianexpress.com/article/education/panel-calls-for-boosting-protein-nutrients-in-govt-meal-programmes-8007128/", "urlToImage": "https://images.indianexpress.com/2022/07/MID-DAY-meal-1200.jpg", "publishedAt": "2022-07-03T22:30:55Z", "content": "The Covid-19 pandemic is likely to have aggravated the silent crisis of undernutrition in India, an inter-ministerial committee has observed, recommending that protein-rich food items like eggs, nuts… [+5360 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Ravik Bhattacharya, Atri Mitra, Joyprakash Das", "title": "Bengal teacher recruitment: Shock, denial at homes of those sacked by High Court", "description": "A single-judge Bench of Justice Abhijit Gangopadhyay on June 13 not only ordered the sacking of these teachers, who were hired through the Teachers’ Eligibility Test in 2014, but also ordered a CBI probe.", "url": "https://indianexpress.com/article/cities/kolkata/bengal-teacher-recruitment-shock-denial-at-homes-of-those-sacked-by-high-court-8007142/", "urlToImage": "https://images.indianexpress.com/2022/07/bengal-protest.jpg", "publishedAt": "2022-07-03T22:30:44Z", "content": "The son of a Trinamool Congress (TMC) panchayat samiti member, the wife of a CPI(M) leader, a TMC youth leader, two brothers, and the wife and two close relatives of a secretary at a private teachers… [+10174 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Deeptiman Tiwary", "title": "Fratricide by mentally ill BSF man: CoI orders action against five", "description": "The CoI has found that even though Satteppa suffered from multiple mental health ailments, he was given a Shape 1 certificate during medical check-ups.", "url": "https://indianexpress.com/article/india/fratricide-by-mentally-ill-bsf-man-coi-orders-action-against-five-8007123/", "urlToImage": "https://images.indianexpress.com/2022/07/BSF.jpg", "publishedAt": "2022-07-03T22:30:28Z", "content": "It was a regular morning at the 144 battalion headquarters of the Border Security Force (BSF) in Amritsar on March 6 this year with men training in the grounds, operational units preparing for duty, … [+4983 chars]"}]}