{"status": "ok", "totalResults": 376, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "One held after man’s dismembered body found in Ludhiana canal", "description": "Police said that Mehfooz hacked Islam to death with a sharp edged weapon with intention to rob Rs 25,000 in cash from him. The accused then cut the body in pieces with an axe before dumping it in the Sidhwan Canal.", "url": "https://indianexpress.com/article/cities/ludhiana/one-held-after-mans-dismembered-body-found-in-ludhiana-canal-7900170/", "urlToImage": "https://images.indianexpress.com/2022/05/express-photo-13-5-1.jpg", "publishedAt": "2022-05-04T00:47:46Z", "content": "Parts of a man’s dismembered body, allegedly cut into several pieces and stuffed in different bags before being dumped, were recovered from Sidhwan Canal Monday, after which the Ludhiana police arres… [+1568 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Congress calls on Punjab Governor, seeks termination of knowledge sharing pact with Delhi, raises law & order concerns", "description": "The memorandum on law and order mentioned about two groups clashing in Patiala last week over an anti-Khalistan march  said despite advance intelligence inputs, the government failed to take timely action.", "url": "https://indianexpress.com/article/cities/chandigarh/congress-calls-on-punjab-governor-seeks-termination-of-knowledge-sharing-pact-with-delhi-raises-law-order-concerns-7900167/", "urlToImage": "https://images.indianexpress.com/2022/05/Kejriwal-Mann-2.jpg", "publishedAt": "2022-05-04T00:44:30Z", "content": "A Punjab Congress delegation Tuesday met Governor Banwari Lal Purohit and expressed concern over law and order situation in state and seeking the termination of the knowledge-sharing agreement that t… [+3786 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "After bonus for DSR adoption, CM Bhagwant Mann promises MSP for alternative crops", "description": "Under the DSR technique, paddy seeds are drilled into the ground with the help of a machine that does seeding of rice and spraying of herbicide simultaneously.", "url": "https://indianexpress.com/article/cities/ludhiana/bonus-for-dsr-adoption-bhagwant-mann-promises-msp-alternative-crops-paddy-maize-bajra-7900165/", "urlToImage": "https://images.indianexpress.com/2022/05/paddy.jpg", "publishedAt": "2022-05-04T00:37:35Z", "content": "With paddy sowing set to begin in Punjab, CM Bhagwant Mann Tuesday declared that to encourage crop diversification, his government will provide minimum support price (MSP) on alternative crops such a… [+1478 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "AAP issues show-cause notice to 6 councillors, asks why they voted in favour of agenda item", "description": "It was added, “During the discussions on the above-mentioned agenda/item in MC house, our leader of the house Councillor Sh Yogesh Dhingra demanded the poll. As discussed in the House meeting, it was made clear that all councillors shall vote against this age…", "url": "https://indianexpress.com/article/cities/chandigarh/aap-issues-show-cause-notice-to-6-councillors-asks-why-they-voted-in-favour-of-agenda-item/", "urlToImage": "https://images.indianexpress.com/2019/09/aam-aadmi-party-aap-logo-1200.jpg", "publishedAt": "2022-05-04T00:31:34Z", "content": "The city unit of AAP Tuesday issued a show-cause notice to six of its councillors seeking an immediate reply as to why they voted in favour of an agenda item when the party leadership had not said so… [+1378 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anju Agnihotri Chaba", "title": "Punjab to conclude procurement as wheat arrival declines: Centre yet to take call on shrivelled grains, mandis to start shutting from May 5", "description": "There is a huge demand for Indian wheat amid sharp decline in availability of the grain in the global market due to the ongoing conflict between Russia and Ukraine. Both nations are major producers and exporters of wheat.", "url": "https://indianexpress.com/article/cities/jalandhar/punjab-to-conclude-procurement-as-wheat-arrival-declines-centre-yet-to-take-call-on-shrivelled-grains-mandis-to-start-shutting-from-may-5-7900158/", "urlToImage": "https://images.indianexpress.com/2022/05/PUNJAB-WHEAT.jpg", "publishedAt": "2022-05-04T00:27:20Z", "content": "A year after surpassing all previous records in wheat procurement ever during the last Rabi marketing Season (RMS), Punjab has this year hit its lowest procurement figure in that last 15 years with a… [+4726 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "After hitting victim, accused driver crashed his BMW near Burail jail; sent to custody", "description": "The victim Shubham, a resident of Dadu Majra and an employee with a garment shop in Sector 23, had come to Sector 22 along with his three friends. Sources said they had dinner at a restaurant and were waiting for a cab when Swapan Preet stopped his car near t…", "url": "https://indianexpress.com/article/cities/chandigarh/after-hitting-victim-accused-driver-crashed-his-bmw-near-burail-jail-sent-to-custody-7900161/", "urlToImage": "https://images.indianexpress.com/2022/05/accident-1-1-2-1.jpg", "publishedAt": "2022-05-04T00:22:38Z", "content": "The driver of the car that mowed down and dragged a 24-year-old for over 80 metres on the bonnet, also crashed his BMW near Model Jail, Burail, in Sector 22 on Friday night. The incident happened aft… [+1813 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Hina Rohtaki", "title": "Chandigarh defers move to restrict unvaccinated kids from attending physical classes", "description": "Parents in Chandigarh had expressed vaccine hesitation and had requested the administration to relook its directives. However, the review was done only after the Supreme Court’s orders Monday.", "url": "https://indianexpress.com/article/cities/chandigarh/chandigarh-defers-move-to-restrict-unvaccinated-kids-from-attending-physical-classes-7900160/", "urlToImage": "https://images.indianexpress.com/2022/02/PTI02_14_2022_000188A.jpg", "publishedAt": "2022-05-04T00:15:56Z", "content": "A day after the Supreme Court ordered that vaccination cannot be forced on an individual, the Chandigarh Administration on Tuesday put on hold its orders restricting unvaccinated students from attend… [+2136 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "April: Petro goods propel exports to record high", "description": "Engineering goods exports saw a growth of 15.4 per cent to $9.2 billion, while petroleum product exports jumped 113.2 per cent to $7.7 billion.", "url": "https://indianexpress.com/article/business/commodities/april-petro-goods-propel-exports-to-record-high-7900157/", "urlToImage": "https://images.indianexpress.com/2021/11/Untitled-design-2021-11-02T040155.899.jpg", "publishedAt": "2022-05-04T00:01:39Z", "content": "Indias merchandise exports grew by 24.2 per cent to a monthly record of $38.2 billion in April, boosted by growth in outward shipments of petroleum products, engineering goods, chemicals and electron… [+2053 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Stephen’s 85:15 admission row: DU V-C says will resolve issue from varsity’s side by next week", "description": "DU had said the college was free to do so on the 50% seats reserved for Christian candidates, but not on all seats. However, St Stephen’s refused to relent, saying “there shall be no discrimination between minority and non-minority applicants”.", "url": "https://indianexpress.com/article/cities/delhi/stephens-8515-admission-row-du-v-c-says-will-resolve-issue-from-varsitys-side-by-next-week/", "urlToImage": "https://images.indianexpress.com/2016/06/arts_faculty-main.jpg", "publishedAt": "2022-05-03T23:58:30Z", "content": "Though the University of Delhi is awaiting a report on the legal opinion that they had sought regarding admissions to St Stephens College, Vice-Chancellor Yogesh Singh said a final decision on the ma… [+1847 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Peter Vidal", "title": "Horoscope Today, May 4, 2022: Libra, Aries, Pisces and other signs — check astrological prediction", "description": "What’s on the cards today for you? Aries, you're in an uncharacteristically sensitive mood. Cancer, in love, you'll settle for life-long friendship rather than temporary passion. Read detailed astrological predictions by western astrologer Peter Vidal below.", "url": "https://indianexpress.com/article/horoscope/horoscope-today-may-4-2022-libra-aries-pisces-and-other-signs-check-astrological-prediction-7900155/", "urlToImage": "https://images.indianexpress.com/2022/04/HORO33-1-1-1-1-1.jpeg", "publishedAt": "2022-05-03T23:50:20Z", "content": "Whats on the cards today for you? Aries, you’re in an uncharacteristically sensitive mood. Cancer, in love, you’ll settle for life-long friendship rather than temporary passion. Read detailed astrolo… [+3666 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "BJP’s ‘chargesheet’ slams TMC govt for ‘lawlessness’", "description": "The saffron party also targeted the state government for failing to provide jobs to the protesting SSC candidates and bring down unemployment.", "url": "https://indianexpress.com/article/cities/kolkata/bjps-chargesheet-slams-tmc-govt-for-lawlessness-7900150/", "urlToImage": "https://images.indianexpress.com/2022/05/mamata-eid.jpg", "publishedAt": "2022-05-03T23:43:10Z", "content": "Publishing a chargesheet against the Trinamool Congress government on the completion of one year in the office after being voted to power for the consecutive third term last year, the state BJP slamm… [+1162 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "TMC MP says Mamata to be PM & Abhishek CM in 2024, deletes tweet later", "description": "Poddar tweeted, “In 2024, Mamata Banerjee will be sworn in as the Prime Minister by an RSS-selected President; Abhishek Banerjee will become the Chief Minister of Bengal.” However, Poddar deleted the tweet within an hour.", "url": "https://indianexpress.com/article/cities/kolkata/tmc-mp-says-mamata-to-be-pm-abhishek-cm-in-2024-deletes-tweet-later-7900149/", "urlToImage": "https://images.indianexpress.com/2020/12/TMC-6.jpg", "publishedAt": "2022-05-03T23:38:32Z", "content": "A DAY after Trinamool Congress (TMC) state general secretary Kunal Ghosh took to Twitter, saying that Abhishek Banerjee would become chief minister of West Bengal in 2036, TMC MP Aparupa Poddar on Tu… [+2060 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Woman stabbed to death, suspect arrested: Police", "description": "Sources said CCTV footage shows the accused purportedly stabbing her in front of some of her neighbours. The accused allegedly pulled out a gun and threatened to open fire on onlookers before fleeing, the sources added.", "url": "https://indianexpress.com/article/cities/kolkata/woman-stabbed-to-death-suspect-arrested-police-7900147/", "urlToImage": "https://images.indianexpress.com/2022/05/Indian-express-1-3-3.jpg", "publishedAt": "2022-05-03T23:31:00Z", "content": "A DAY after a 21-year-old woman was stabbed to death allegedly by her former boyfriend at Behrampore in Murshidabad district, a war of words has broken out between the TMC and the Opposition parties,… [+3335 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Committed to justice demand: CPM leader after calling on Anis Khan kin", "description": "Describing the BJP's “Achchhe Din” slogan as “fake achhe din”, she told people, “Achchhe din will come, but those will not be fake achchhe din. Achchhe din will come with 'sachhe din'. And that will come for all.”", "url": "https://indianexpress.com/article/cities/kolkata/committed-to-justice-demand-cpm-leader-after-calling-on-anis-khan-kin-7900146/", "urlToImage": "https://images.indianexpress.com/2022/03/Md-Selim.jpeg", "publishedAt": "2022-05-03T23:27:28Z", "content": "CPI(M) POLITBURO member and the party’s state secretary, Md Salim, on Tuesday visited Salem Khan, the father of student leader Anis Khan, at his residence in Howrahs Amta on Eid. Anis, 28, was found … [+1681 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sohini Ghosh", "title": "13% rise in registered deaths in Gujarat in pandemic year compared to 2019", "description": "Among the districts, Ahmedabad (79,404) registered maximum number of deaths, followed by Surat (47,480), Vadodara (35,906), Rajkot (31,538), Bhavnagar(20,288) and Anand (20,211).", "url": "https://indianexpress.com/article/cities/ahmedabad/13-rise-in-registered-deaths-in-gujarat-in-pandemic-year-compared-to-2019-7900144/", "urlToImage": "https://images.indianexpress.com/2022/02/indianexpress-logo-4-22.jpeg", "publishedAt": "2022-05-03T23:16:50Z", "content": "Gujarat reported a 13 per cent increase in registered deaths in 2020 the pandemic year compared to 2019, revealed the Civil Registration System(CRS) report.The report, released by the Centre on Tuesd… [+2595 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Book withdrawn after Cong flags derogatory reference on tribals", "description": "Ahmedabad-based publisher R Jamnadas and Company announced on its website that the book will be withdrawn. “", "url": "https://indianexpress.com/article/cities/ahmedabad/book-withdrawn-after-cong-flags-derogatory-reference-on-tribals-7900143/", "urlToImage": "https://images.indianexpress.com/2022/04/book-2.jpg", "publishedAt": "2022-05-03T23:11:23Z", "content": "A PRIVATE publisher has apologised and withdrawn a preparatory book on sociology for undergraduate students after the Congress pointed out derogatory references to the tribal community in the text.Co… [+1541 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Bharti Ashram chief seer goes missing, police launch probe", "description": "A CCTV footage scanned by the police has shown that the seer was last spotted walking from Kapurai junction towards Tarsali on April 30. However, he was not seen in any further CCTV cameras located along the route.", "url": "https://indianexpress.com/article/cities/ahmedabad/bharti-ashram-chief-seer-goes-missing-police-launch-probe-7900142/", "urlToImage": "https://images.indianexpress.com/2022/05/Indian-Express.jpeg", "publishedAt": "2022-05-03T23:02:46Z", "content": "The Vadodara city police have begun a probe after the presiding seer of the Bharti Ashram trust, Mahamandaleshwar Hariharanand, went missing from Vadodara on April 30.The probe was launched after the… [+1684 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aditi Raja", "title": "‘Heat condition’: Govt calls off job fair", "description": "However, one government official said the fair was called off due to “heat wave conditions” across the state.", "url": "https://indianexpress.com/article/cities/ahmedabad/heat-condition-govt-calls-off-job-fair-7900141/", "urlToImage": "https://images.indianexpress.com/2022/03/Job_fair_1200.jpg", "publishedAt": "2022-05-03T22:58:04Z", "content": "The Directorate of Employm-ent and Training of the government Of Gujarat has decided to call off the Employment Fair to be held across 33 districts for three days from May 5 to May 7.While the Distri… [+1384 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Udhna police lodges 2 FIRs over AAP-BJP scuffle in Surat", "description": "A second FIR was filed after AAP leader Dinesh Jikadra lodged a complaint. Jikadra is one of the two AAP leaders who suffered injuries and was admitted to the New Civil Hospital in Surat on Monday, and does not name any accused persons.", "url": "https://indianexpress.com/article/cities/ahmedabad/udhna-police-lodges-2-firs-over-aap-bjp-scuffle-in-surat-7900140/", "urlToImage": "https://images.indianexpress.com/2022/05/Gopal-Italia.jpg", "publishedAt": "2022-05-03T22:44:02Z", "content": "Udhna police station in Surat has lodged two FIRs Monday, charging 16 Aam Aadmi Party (AAP) workers, including the partys Gujarat chief Gopal Italia, for unlawful assembly and rioting.The FIRs were l… [+2774 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Four-hour power cuts in Vadodara for 4 days from today", "description": "An official of the MGVCL engineering department told this newspaper that the power cuts are not to be viewed as load-shedding in the backdrop of coal deficit in the country and that it was “regular” for mandatory maintenance.", "url": "https://indianexpress.com/article/cities/ahmedabad/four-hour-power-cuts-in-vadodara-for-4-days-from-today-7900139/", "urlToImage": "https://images.indianexpress.com/2022/04/punjab-electricity-1.jpg", "publishedAt": "2022-05-03T22:39:56Z", "content": "Several areas in Vadodara will face four-hour power disruptions between 6 am and 10 am from Wednesday to Saturday during a mega maintenance drive across the city by the Vadodara division of Madhya Gu… [+1892 chars]"}]}