{"status": "ok", "totalResults": 448, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Asad Rehman", "title": "With ‘Yuva Panchayats’, RLD seeks to tap into Agnipath unrest, replicate farm stir", "description": "In the recent Uttar Pradesh Assembly elections, the RLD had fielded 33 candidates in an alliance with the Samajwadi Party (SP), managing to win eight from the Jat-dominated Western UP – a jump from one seat in the 2017 Assembly polls.", "url": "https://indianexpress.com/article/political-pulse/yuva-panchayats-rld-agnipath-unrest-farm-stir-8004256/", "urlToImage": "https://images.indianexpress.com/2022/07/agnipath-protests-1-2-1.jpeg", "publishedAt": "2022-07-02T02:43:21Z", "content": "In a bid to reach out to the youth discontented with Agnipath, the Centres short-term soldiers’ recruitment scheme, the Rashtriya Lok Dal (RLD) has been holding a series of meetings, called Yuva Panc… [+2779 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "How Tom Cruise clawed his way back to the top with the weirdest character of his career", "description": "Tom Cruise was battling professional and personal setbacks in the mid-2000s, when he conceived, from scratch, the character that would take his career to the next level.", "url": "https://indianexpress.com/article/entertainment/hollywood/tom-cruise-60th-birthday-career-comeback-tropic-thunder-les-grossman-8003299/", "urlToImage": "https://images.indianexpress.com/2022/07/tom-cruise-tropic-thunder.jpg", "publishedAt": "2022-07-02T02:40:38Z", "content": "Tom Cruise’s stardom, which he has sustained for over four extraordinary decades, was further cemented some weeks ago with the release of Top Gun: Maverick. The film proved that Cruise is still a big… [+4578 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Arushi Jain", "title": "Rocketry, Minions The Rise of Gru, Stranger Things 4 Volume 2: Top shows, films to watch this weekend", "description": "Confused about what to watch? For this weekend, we have six titles that would be worth your time -- from Rocketry: The Nambi Effect in cinemas to Stranger Things 4 Volume 2 on Netflix.", "url": "https://indianexpress.com/article/entertainment/web-series/rocketry-minions-the-rise-of-gru-the-terminal-list-top-shows-films-this-weekend-8003186/", "urlToImage": "https://images.indianexpress.com/2022/07/what-to-watch-.jpg", "publishedAt": "2022-07-02T02:40:05Z", "content": "If you plan to visit a theatre this weekend, we suggest giving Rocketry: The Nambi Effect a go. The R Madhavan film is a decent watch. In case you are going out with children (or adults, we dont judg… [+4019 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rohan Naahar", "title": "The 8 most underrated films of June and where to watch them: From Dakota Johnson’s career-best performance to Jessie Buckley’s bonkers horror movie", "description": "From a harrowing new Netflix true-crime documentary to a creepy stalker thriller that fans of Alfred Hitchcock’s films will appreciate, and the latest mindbender from a one of the best auteurs around to a future Oscar favourite, here is a list of the most und…", "url": "https://indianexpress.com/article/entertainment/hollywood/the-top-most-underrated-films-of-june-2022-and-where-to-watch-them-dakota-johnsons-jessie-buckley-netflix-hulu-hbo-8000737/", "urlToImage": "https://images.indianexpress.com/2022/06/best-films-of-june.jpg", "publishedAt": "2022-07-02T02:39:35Z", "content": "A relatively unimpressive month for Indian cinema means that Junes list of the best underrated films is dominated by foreign titles. This is the first time in the six editions of this series that thi… [+6199 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sampada Sharma", "title": "Raj Kapoor did Teesri Kasam for one rupee, Waheeda Rehman did it for free but the film still ruined lyricist-producer Shailendra", "description": "Much like its lead characters, Teesri Kasam was a victim of its fate. Because watching it today, it is hard to decipher why a film with such emotional depth, popular music and stellar actors did not get accepted 56 years ago.", "url": "https://indianexpress.com/article/entertainment/bollywood/raj-kapoor-did-teesri-kasam-for-one-rupee-and-waheeda-rehman-did-not-take-even-a-penny-yet-the-film-ruined-lyricist-producer-shailendra-8003243/", "urlToImage": "https://images.indianexpress.com/2022/07/teesri-kasam-2.jpeg", "publishedAt": "2022-07-02T02:37:02Z", "content": "When we are introduced to Waheeda Rehman’s Hirabai in Basu Bhattacharya’s Teesri Kasam, Raj Kapoor’s Hiraman calls her a ‘pari’. Her poise, grace and pristine beauty leaves him mesmerised and he is i… [+4631 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "8,233 ex-students of Delhi University register for centenary chance to complete degrees", "description": "Of these, the oldest student is one who was supposed to have completed their degree in B Com from Shri Ram College of Commerce back in 1975.", "url": "https://indianexpress.com/article/cities/delhi/8233-ex-students-of-du-register-for-centenary-chance-8004237/", "urlToImage": "https://images.indianexpress.com/2022/07/DU.jpg", "publishedAt": "2022-07-02T02:33:19Z", "content": "As many as 8,233 former students of the Delhi University, who were a part of it nearly 50 years ago, have registered for the universitys centenary chance — second opportunity to complete their degree… [+1397 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "While You Were Asleep: Alcaraz stays on course, England win European U-19 Championship, Man United to sign Malacia", "description": "Alcaraz will next face Italian 10th seed Jannik Sinner. Tyrell Malacia will join Manchester United from Feyenoord.", "url": "https://indianexpress.com/article/sports/sport-others/while-you-were-asleep-alcaraz-stays-on-course-england-win-european-u-19-championship-man-united-to-sign-malacia-8004248/", "urlToImage": "https://images.indianexpress.com/2022/07/While-You-Were-Asleep-2.jpg", "publishedAt": "2022-07-02T02:30:43Z", "content": "Carlos Alcaraz is one win away from a potential quarter-final showdown Novak Djokovic after an easy 6-3 6-1 6-2 win over Oscar Otte. Alcaraz will next face Italian 10th seed Jannik Sinner. If he wins… [+2385 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mohali: ‘Suspicious’ letter near union minister’s house triggers probe", "description": "According to the sources in the police, at around 8.30 pm on Thursday, a woman — identified as Beant Kaur — handed over a piece of paper with some scribblings on it to a constable — Karamjit Singh — who was on guard duty outside the residence of Som Parkash.", "url": "https://indianexpress.com/article/cities/sas-nagar-mohali/mohali-suspicious-letter-near-union-ministers-house-triggers-probe-8004241/", "urlToImage": "https://images.indianexpress.com/2022/07/som-prakash.jpg", "publishedAt": "2022-07-02T02:28:58Z", "content": "Police launched a probe on Friday after a policeman on duty at Union Minister of Commerce and Industry, Som Prakash’s Mohali Sector 71 residence was handed over a suspicious letter by a woman.Accordi… [+906 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "UT sees good footfall in PUNBUS service to Delhi’s IGI airport", "description": "Five luxurious 43-seater Volvo PUNBUS buses are being run from Chandigarh ISBT, Sector 17 to Indira Gandhi International (IGI) Airport, New Delhi. PUNBUS is a subsidiary of the Punjab Roadways", "url": "https://indianexpress.com/article/chandigarh/ut-sees-good-footfall-in-punbus-service-to-delhis-igi-airport-8004242/", "urlToImage": "https://images.indianexpress.com/2022/07/ch1570392.jpg", "publishedAt": "2022-07-02T02:13:21Z", "content": "THE RECENTLY introduced luxurious buses of the Punjab State Bus Stand Management Company Ltd (PUNBUS) from Punjab to Delhi airport has been witnessing good response in Chandigarh with most of the bus… [+1965 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Man arrested for beating up, tearing clothes of estranged wife", "description": "Police sources said a matrimonial dispute had been pending between the couple for a long time. The victim is pursuing a domestic violence case against the accused, who has filed a divorce petition against the victim in a local court.", "url": "https://indianexpress.com/article/chandigarh/man-arrested-for-beating-up-tearing-clothes-of-estranged-wife-8004238/", "urlToImage": "https://images.indianexpress.com/2022/07/acid.jpg", "publishedAt": "2022-07-02T02:08:35Z", "content": "A 47-YEAR-old man was arrested for beating up and tearing the clothes of his estranged wife outside his house in Sector 8 Thursday night. Sources said the woman saved herself after running away from … [+1084 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Chandigarh to take lessons from Maharashtra, its neighbours for EWS admissions", "description": "The State Advisory Council has been constituted as per the provisions of Right To Education (RTE) Act to advise the government regarding implementation of various provisions of the Act and has UT Adviser Dharam Pal as its chairperson.", "url": "https://indianexpress.com/article/cities/chandigarh/chandigarh-to-take-lessons-from-maharashtra-its-neighbours-for-ews-admissions-8004233/", "urlToImage": "https://images.indianexpress.com/2022/07/school-kids-2.jpg", "publishedAt": "2022-07-02T02:07:31Z", "content": "The 11th meeting of the State Advisory Council on Friday decided that the UT education department will study the practices and procedures being followed by the government of Maharashtra and those by … [+162 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "2 vegetable traders arrested for attacking three fellow vendors", "description": "Police said a recent brawl over the issue of vending space at the market was the reason behind the attack. Police said that the assailants and victims knew each other.", "url": "https://indianexpress.com/article/chandigarh/2-vegetable-traders-arrested-for-attacking-three-fellow-vendors-8004229/", "urlToImage": "https://images.indianexpress.com/2022/07/mumbai-vegetable-vendor-coorna.jpg", "publishedAt": "2022-07-02T02:04:20Z", "content": "TWO VEGETABLE vendors were arrested for attacking their three fellow vendors, who were brothers, with sharp-edged weapons at Grain Market, Sector 26, Friday.The assailants were identified as Mohammed… [+1031 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Chandigarh: Murder of 27-yr-old man: Juvenile apprehended", "description": "Three more suspects are still absconding. The juvenile was sent to the Juvenile Home, Sector 25. The victim was identified as Harikesh, a labourer.", "url": "https://indianexpress.com/article/cities/chandigarh/chandigarh-murder-of-27-yr-old-man-juvenile-apprehended-8004221/", "urlToImage": "https://images.indianexpress.com/2022/07/arrest-1.jpg", "publishedAt": "2022-07-02T02:01:36Z", "content": "The UT Police has apprehended a 17-year-old juvenile in connection with the murder of a 27-year-old man following a drunken brawl near Mauli village. The incident happened on Wednesday night. The juv… [+1160 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sushant Nepta", "title": "Panchkula: Scanty water supply and low pressure bane of Sector 15", "description": "The shortage of water supply has been due to an underground high tension cable breakdown at Industrial area phase 1 water works from where Sector 15 receives its water supply.", "url": "https://indianexpress.com/article/cities/panchkula/panchkula-scanty-water-supply-and-low-pressure-bane-of-sector-15-8004224/", "urlToImage": "https://images.indianexpress.com/2022/07/pune-1-1-1.jpeg", "publishedAt": "2022-07-02T01:58:53Z", "content": "Panchkula, July 1From muddy water to very low water pressure, the residents of Sector 15 of Panchkula have been bearing the brunt of drinking water woes for quite sometime.Some 20,000 residents of Pa… [+1625 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Parul", "title": "Antidote to stress is helping patients, says PGI director", "description": "Prof Lal who took over as director of the institute over a month back is focusing on making the institute more patient-friendly, with the Standing Finance Committee approving new posts for both faculty and residents.", "url": "https://indianexpress.com/article/cities/chandigarh/antidote-to-stress-is-helping-patients-says-pgi-director-8004206/", "urlToImage": "https://images.indianexpress.com/2022/07/pgimer1-1200.jpg", "publishedAt": "2022-07-02T01:52:19Z", "content": "“The commitment and compassion of doctors of PGI are responsible for its reputation, the amazing faith that patients have in this institute and its faculty make it among the top teaching hospitals in… [+2700 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Panchkula ASI dies as PCR vehicle rams road divider", "description": "The ASI was a native of Mouli village in Raipur Rani, Panchkula. He had joined the police force on February 7, 1990, and was currently posted with the PCR (2) wing of Sector 21 police station.", "url": "https://indianexpress.com/article/cities/panchkula/panchkula-asi-dies-as-pcr-vehicle-rams-road-divider-8004215/", "urlToImage": "https://images.indianexpress.com/2022/07/accident-1-1-1.jpeg", "publishedAt": "2022-07-02T01:52:00Z", "content": "An ASI with Panchkula Police died on Thursday evening after his PCR vehicle hit the divider on Sector 20/21 dividing road.According to the police, ASI Ram Gopal and driver Jagmal Singh met with the a… [+591 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Andrew Scott, Claire Foy join Andrew Haigh’s next directorial Strangers", "description": "Strangers film is loosely based on an award-winning novel by Japanese screenwriter and novelist Taichi Yamada.", "url": "https://indianexpress.com/article/entertainment/hollywood/andrew-scott-claire-foy-join-andrew-haigh-next-directorial-strangers-8002487/", "urlToImage": "https://images.indianexpress.com/2022/07/Andrew-Scott-and-Claire-Foy-1200by667.jpg", "publishedAt": "2022-07-02T01:50:44Z", "content": "British stars Andrew Scott, Claire Foy, Paul Mescal and Jamie Bell have boarded the cast of Lean on Pete filmmaker Andrew Haigh’s next movie Strangers. According to Variety, the film is loosely based… [+785 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "‘Suspicious’ letter near Union minister’s Mohali residence triggers probe", "description": "The police said, “At the entry of the park, she saw a folded piece of paper. She picked up the paper and saw something that looked similar to a map of the minister's house and the word 'cop' written on it.\"", "url": "https://indianexpress.com/article/chandigarh/suspicious-letter-near-union-ministers-mohali-residence-triggers-probe-8004205/", "urlToImage": "https://images.indianexpress.com/2022/07/som-prakash-759x422-1.jpg", "publishedAt": "2022-07-02T01:44:11Z", "content": "Police launched a probe on Friday after a policeman on duty at Union Minister of Commerce and Industry, Som Prakash’s Mohali Sector 71 residence was handed over a suspicious letter by a woman.Accordi… [+905 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Covid-19: Tamil Nadu reports 2,385 new cases; active coronavirus cases surge to 12,158", "description": "Chennai, Tamil Nadu Covid-19 cases today: The Covid-19 cases in Chennai crossed the 1,000-mark reporting 1,025 news cases in the last 24 hours.", "url": "https://indianexpress.com/article/cities/chennai/tamil-nadu-covid-infections-chennai-coronavirus-active-cases-deaths-news-today-8004199/", "urlToImage": "https://images.indianexpress.com/2022/07/Chennai-COVID-19-10-1.jpeg", "publishedAt": "2022-07-02T01:24:13Z", "content": "Tamil Nadu has reported over 2,000 coronavirus cases for the second day in a row with 2,385 people testing positive in the last 24 hours, including two returnees from Oman and the United States, said… [+930 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi Confidential: Message, On Screen", "description": "Mukhtar Abbas Naqvi had an unusual assignment on Friday – gracing the 5th Global Film Tourism Conclave in Mumbai. But even while addressing the film conclave, the minister made sure not to forget his government’s line.", "url": "https://indianexpress.com/article/delhi-confidential/delhi-confidential-message-on-screen-post-8004181/", "urlToImage": "https://images.indianexpress.com/2022/07/Mukhtar-Abbas-Naqvi-illustration.jpg", "publishedAt": "2022-07-02T01:08:57Z", "content": "MINORITY AFFAIRS Minister Mukhtar Abbas Naqvi had an unusual assignment on Friday gracing the 5th Global Film Tourism Conclave in Mumbai. But even while addressing the film conclave, the minister mad… [+1686 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Chennai power cut: these areas will face a power cut in Chennai today", "description": "Chennai power disruption July 2, Saturday: Parts of Chennai will face a power cut from 9 am to 2 pm for maintenance work today.", "url": "https://indianexpress.com/article/cities/chennai/chennai-power-cut-these-areas-will-face-a-power-cut-in-chennai-today-8004191/", "urlToImage": "https://images.indianexpress.com/2022/07/electricity-reuters-1200-2-1-1.jpeg", "publishedAt": "2022-07-02T01:03:50Z", "content": "The Tamil Nadu Generation and Distribution Corporation (Tangedco) has announced that power will be suspended in parts of Chennai today in Anna Salai, Anna Nagar, Mylapore, Tambaram, Porur, IT Corrido… [+4441 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Kolkata Science City celebrates its 25 years with film and exhibition", "description": "The formal ceremony began with the lighting of the ceremonial lamp by the dignitaries, along with Science City's present director Anurag Kumar. It was followed by a welcome address by Chowdhury.", "url": "https://indianexpress.com/article/cities/kolkata/science-city-celebrates-its-25-years-with-film-and-exhibition-8004172/", "urlToImage": "https://images.indianexpress.com/2022/07/science-city-fb.jpg", "publishedAt": "2022-07-02T00:28:54Z", "content": "Kolkata Science City, one of the National Council of Science’s biggest projects and the largest science centre inthe Indian Subcontinent, on Friday completed 25 years of its existence.The silver jubi… [+1479 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Arnav Chandrasekhar", "title": "Paharganj collapse: Have no place to stay, say building residents", "description": "The municipal corporation demolished certain sections deemed dangerous on Friday. Amit Kumar, PRO (MCD), said: “The exact cause of the collapse has not yet been determined yet. We are demolishing a part of the building which is imminently dangerous.”", "url": "https://indianexpress.com/article/delhi/paharganj-collapse-have-no-place-to-stay-say-building-residents-8004178/", "urlToImage": "https://images.indianexpress.com/2022/07/paharganj-3col.jpg", "publishedAt": "2022-07-02T00:28:54Z", "content": "A day after a portion of a two-story building collapsed in Central Delhis Paharganj, several residents who lost their homes said they have no place to stay.On Thursday, police received a PCR call at … [+2045 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "New assessment norms to focus on questions that test competency", "description": "The government will also be introducing assessment for its Happiness, Deshbhakti and Entrepreneurship Mindset curricula for students of classes III to IX, and XI this year for the first time. However, this assessment will not bear any weightage in determining…", "url": "https://indianexpress.com/article/delhi/new-assessment-norms-to-focus-on-questions-that-test-competency-8004176/", "urlToImage": "https://images.indianexpress.com/2022/07/schools-6.jpg", "publishedAt": "2022-07-02T00:23:43Z", "content": "In a new set of assessment guidelines, the Delhi government has directed all schools in the city to make competency-based questions count for 40% of the question papers for students from classes III … [+2016 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "4 villages to get sewer lines, 3 lakh people to benefit, says Sisodia", "description": "According to officials, areas including Bijwasan, Najafgarh, Shikarpur, Burari, Sangam Vihar which currently have poor drainage systems will get proper sewer systems that will benefit around 3 lakh people.", "url": "https://indianexpress.com/article/delhi/4-villages-to-get-sewer-lines-3-lakh-people-to-benefit-says-sisodia-8004174/", "urlToImage": "https://images.indianexpress.com/2022/07/manish-sisodia-7591-1.jpg", "publishedAt": "2022-07-02T00:20:33Z", "content": "The Delhi government on Friday approved a project to lay sewer lines in four villages and 36 unauthorised colonies, one of the poll promises of the Aam Aadmi Party (AAP) government.According to offic… [+1506 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "L-G nod to making 128 temporary medical posts permanent", "description": "This will allow permanent staffing on 76 posts at Dr Baba Saheb Ambedkar Medical College in Rohini, 40 posts at Guru Teg Bahadur Hospital in Dilshad Garden, nine posts at Maulana Azad Medical College near Delhi Gate, and three posts at Lal Bahadur Shastri Hos…", "url": "https://indianexpress.com/article/delhi/l-g-nod-to-making-128-temporary-medical-posts-permanent-8004169/", "urlToImage": "https://images.indianexpress.com/2022/07/Vinai-Kumar-Saxena-2.jpg", "publishedAt": "2022-07-02T00:17:16Z", "content": "Ahead of National Doctors Day, Delhi Lieutenant Governor V K Saxena said removing ad hocism and professional insecurity for doctors would be a fitting tribute to them. He was speaking on Thursday aft… [+1710 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "West Bengal: BJP to hold rallies in Howrah to counter TMC’s Martyrs’ Day event", "description": "We will compensate 21 Hindu traders whose shops were vandalised. The programme will be held after 4pm,\" said leader of Opposition in Assembly Suvendhu Adhikari.", "url": "https://indianexpress.com/article/cities/kolkata/bjp-to-hold-rallies-in-howrah-to-counter-tmcs-martyrs-day-event-8004165/", "urlToImage": "https://images.indianexpress.com/2022/07/bjp-2.jpg", "publishedAt": "2022-07-02T00:16:07Z", "content": "In an bid to counter the ruling Trinamool Congress on its Shahid Diwas (Martyrs Day) event on July 21, the BJP said it will organise rallies in Howrah district to pay homage to its workers killed in … [+1264 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "ED asks cops for details of Zubair’s bank accounts", "description": "On Tuesday, DCP (Cyber Crime) KPS Malhotra had claimed: “We have found transactions over Rs 50 lakh in Zubair’s account. These were made in the last three months. We don’t know the source yet, but they could be donations from questionable organisations...”", "url": "https://indianexpress.com/article/delhi/ed-asks-cops-for-details-of-zubairs-bank-accounts-8004159/", "urlToImage": "https://images.indianexpress.com/2022/07/enforcement-directorate-ed-1200.jpg", "publishedAt": "2022-07-02T00:07:18Z", "content": "Days after Alt News co-founder Mohammed Zubair was arrested on charges of allegedly hurting religious sentiments over a 2018 tweet, the Enforcement Directorate (ED) has asked the Delhi Police probe t… [+970 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Avaneesh Mishra", "title": "Will make Uttarakhand best state by 2025: CM Dhami", "description": "", "url": "https://indianexpress.com/article/india/will-make-uttarakhand-best-state-by-2025-pushkar-singh-dhami-8004163/", "urlToImage": "https://images.indianexpress.com/2022/07/dhami.jpg", "publishedAt": "2022-07-02T00:01:04Z", "content": "UTTARAKHAND CHIEF Minister Pushkar Singh Dhami, who completed 100 days of his second term on Thursday, said his government has done a good job during this period and made a commitment to make Uttarak… [+1664 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Dalit youth dies in explosion under cot, probe still to figure out who, how & why", "description": "The father of the youth, Mevalal Rawat, who is a labourer, in his complaint has said that two upper caste men killed his son over “enmity with the family”.", "url": "https://indianexpress.com/article/cities/lucknow/dalit-youth-dies-in-explosion-under-cot-probe-still-to-figure-out-who-how-why-8004161/", "urlToImage": "https://images.indianexpress.com/2022/07/Express-Representational-Image-46-5.jpeg", "publishedAt": "2022-07-01T23:42:24Z", "content": "A week after a Dalit youth was killed in Lucknow districts Maal area allegedly following an explosion, police are still not clear how the explosion took place and who were behind the incident.The exp… [+2058 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Will give development push: UP govt signs MoU with AAI for maintenance, operation of 5 airports", "description": "Uttar Pradesh CM Yogi Adityanath said that no one could have imagined five years back that an airport will be developed in a place like Azamgarh in eastern UP.", "url": "https://indianexpress.com/article/cities/lucknow/up-govt-yogi-adityanath-airports-authority-india-mou-8004154/", "urlToImage": "https://images.indianexpress.com/2022/07/yogi.jpg", "publishedAt": "2022-07-01T23:37:23Z", "content": "The Uttar Pradesh government on Friday signed a memorandum of understanding (MoU) with the Airports Authority of India (AAI) for operation and maintenance of five new airports being developed in Azam… [+1609 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Bring new GST with single low rate as starting point: Congress", "description": "", "url": "https://indianexpress.com/article/india/bring-new-gst-with-single-low-rate-as-starting-point-congress-8004156/", "urlToImage": "https://images.indianexpress.com/2022/07/Jairam-ramesh-2col.jpg", "publishedAt": "2022-07-01T23:30:59Z", "content": "SAYING THAT the current GST regime has serious birth defects, the Congress, for the first time on Friday, said that it should be scrapped and replaced by a new law that provides for a single low rate… [+4501 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Passing stress test", "description": "New RBI report says asset quality, capital position of banking system continues to improve. That's something to build on", "url": "https://indianexpress.com/article/opinion/editorials/indian-banking-rbi-report-loans-capital-assets-8004073/", "urlToImage": "https://images.indianexpress.com/2022/07/edit-new-logo-2.jpg", "publishedAt": "2022-07-01T23:25:37Z", "content": "Despite concerns, the asset quality of the Indian banking system has continued to improve. According to the Reserve Bank of India’s latest financial stability report, gross non-performing loans (GNPA… [+2777 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "P Vaidyanathan Iyer", "title": "Udaipur killing on video | ‘Do something spectacular’: Man from Pak told accused", "description": "Early probe shows two main accused started planning the attack around June 10-15, had support of others in area", "url": "https://indianexpress.com/article/india/udaipur-killing-on-video-do-something-spectacular-man-from-pak-told-accused-8004151/", "urlToImage": "https://images.indianexpress.com/2022/07/Mohammad-Riyaz-Ghouse-Mohammad-f-1.jpg", "publishedAt": "2022-07-01T23:17:54Z", "content": "THE NATIONAL Investigation Agency (NIA) has found that the killing of Kanhaiyalal Teli in Udaipur was meticulously planned and instigated by a person in Pakistan identified as Salman bhai who told on… [+3967 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "‘Acute price pressures: Factory PMI growth at 9-mth low’", "description": "There was positive news regarding supply chains, with the latest results showing the first shortening of input lead times since the onset of Covid-19.", "url": "https://indianexpress.com/article/business/india-manufacture-sector-growth-sales-prices-purchasing-managers-index-8004148/", "urlToImage": "https://images.indianexpress.com/2022/07/manuacture.jpg", "publishedAt": "2022-07-01T23:14:27Z", "content": "India’s manufacturing sector growth fell in June as growth of total sales and production eased amid intense price pressures, as per an S&amp;P Global India survey. The seasonally adjusted S&amp;P Glo… [+3204 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Mallica Joshi", "title": "In village of fauji dreams, second thoughts, insecurity over Agnipath", "description": "The village has around 2,000 households and in at least 800 of these, Sirohi says, there is someone who has served or is serving in the armed forces.", "url": "https://indianexpress.com/article/india/in-village-of-fauji-dreams-second-thoughts-insecurity-over-agnipath-8004145/", "urlToImage": "https://images.indianexpress.com/2022/07/Agnipath-protest.jpeg", "publishedAt": "2022-07-01T23:10:55Z", "content": "SARKAAR AB itni sakht hai ki ya toh bulldozer chalega, ya career kharab hoga. Ye sarkaar baahubali hai, logon ko jhukna hi padega, says Amit Sirohi (37), the pradhan of Bulandshahrs Saidpur village, … [+4189 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pranav Mukul", "title": "AIASL’s ‘service lapses’ irk Air India, may scout for ‘alternatives’", "description": "Among its concerns with AIASL, Air India listed increased ground handling delays, perennial shortage of manpower, discourteous behaviour with customers, baggage mishandling etc.", "url": "https://indianexpress.com/article/business/aiasls-service-lapses-irk-air-india-may-scout-for-alternatives-8004147/", "urlToImage": "https://images.indianexpress.com/2022/07/air-india-express-photo-1200-1.jpg", "publishedAt": "2022-07-01T23:08:43Z", "content": "Tata Group-owned Air India has flagged concerns over flight delays and poor customer experience with its ground handling service provider AI Airport Services Ltd (AIASL). In a letter to AIASLs parent… [+2167 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "Neeraj Chopra: His golden arm", "description": "If Neeraj Chopra also becomes a world champion, it will mark the first time any male has held both titles simultaneously since Norway's Andreas Thorkildsen way back in 2009.", "url": "https://indianexpress.com/article/opinion/editorials/neeraj-chopra-diamond-league-record-8004066/", "urlToImage": "https://images.indianexpress.com/2022/07/edit-new-logo.jpg", "publishedAt": "2022-07-01T23:00:55Z", "content": "Track and field tragics and those who fell in love with javelin throw since Neeraj Chopra made history at the Tokyo Olympics nearly a year ago have been keenly watching the 24-year-old with floppy ha… [+824 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "George Mathew", "title": "Delhi HC recently struck down powers of Banks Board Bureau; new body to select chiefs of PSU banks, insurance firms", "description": "The selection process of top officials of public sector insurance companies was in limbo in the wake of the Delhi High Court decision to strike down the power of BBB to select directors and chiefs of PSU insurers.", "url": "https://indianexpress.com/article/business/delhi-hc-recently-struck-down-powers-of-banks-board-bureau-new-body-to-select-chiefs-of-psu-banks-insurance-firms-8004144/", "urlToImage": "https://images.indianexpress.com/2022/07/bank.jpg", "publishedAt": "2022-07-01T23:00:55Z", "content": "The Appointments Committee of the Cabinet (ACC) has approved a government resolution for establishing the Financial Services Institutions Bureau (FSIB) in place of the Banks Board Bureau (BBB). The F… [+3486 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Antonio Guterres", "title": "A Renewables Revolution", "description": "As we wean ourselves off fossil fuels, benefits will be vast, and not just to the climate", "url": "https://indianexpress.com/article/opinion/columns/climate-change-crisis-energy-fuels-coal-oil-gas-renewable-energy-8004060/", "urlToImage": "https://images.indianexpress.com/2022/07/oil.jpg", "publishedAt": "2022-07-01T22:45:54Z", "content": "Nero was famously accused of fiddling while Rome burned. Today, some leaders are doing worse. They are throwing fuel on the fire. Literally. As the fallout of Russias invasion of Ukraine ripples acro… [+4402 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pimpri-Chinchwad may get first cabinet berth, Landge frontrunner", "description": "Congress leader Babu Nair said if Mahesh Landge becomes a state minister this time, he will be the first leader from the city to do so.", "url": "https://indianexpress.com/article/cities/pune/pimpri-chinchwad-may-get-first-cabinet-berth-landge-frontrunner-8004142/", "urlToImage": "https://images.indianexpress.com/2022/07/shinde12.jpg", "publishedAt": "2022-07-01T22:43:50Z", "content": "WITH Eknath Shinde taking over as the 20th chief minister of Maharashtra and slated to induct his ministers in next two days, a leader from Pimpri-Chinchwad may, for the first time, get a place in th… [+1927 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Alifiya Khan", "title": "Learning engineering in mother tongue: Amid poor response elsewhere, Pune college fills seats", "description": "While it was assumed that the opportunity to learn in their mother tongue would entice many to seek admission in such courses, the ground reality is different.", "url": "https://indianexpress.com/article/cities/pune/learning-engineering-in-mother-tongue-amid-poor-response-elsewhere-pune-college-fills-seats-8004140/", "urlToImage": "https://indianexpress.com/wp-content/themes/indianexpress/images/IE-OGimage.jpg", "publishedAt": "2022-07-01T22:34:43Z", "content": "Six months ago when he was taking admission in a computer engineering course at a college in Pune’s Akurdi area, 19-year-old Atharva Ingle did not know that his batch would be a historic one. The Ako… [+4484 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Girish Kuber", "title": "Win and lose", "description": "For Devendra Fadnavis, Maharashtra drama didn't end the way it was supposed to. Thereby hangs a tale.", "url": "https://indianexpress.com/article/opinion/columns/bjp-modi-amit-shah-maharashra-uddhav-shiv-sena-eknath-shinde-8004053/", "urlToImage": "https://images.indianexpress.com/2022/07/bjp.jpg", "publishedAt": "2022-07-01T22:30:25Z", "content": "As the BJP’s top leadership gathers in Hyderabad for its national executive, it will have one more trophy to display on its wall: The state of Maharashtra. Even though former Chief Minister Devendra … [+6119 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Soumya Kanti Ghosh", "title": "How the bank held its own", "description": "Contrary to the criticism from some quarters, RBI has done well to balance inflation and growth during exceptionally trying circumstances", "url": "https://indianexpress.com/article/opinion/columns/how-the-bank-held-its-own-8002098/", "urlToImage": "https://images.indianexpress.com/2022/07/oped.jpeg", "publishedAt": "2022-07-01T22:00:44Z", "content": "Several articles published of late have been uncharacteristically harsh about the RBI’s inflation management. Writing an epitaph for such articles reminds me of a recent interaction with RBI Deputy G… [+6631 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pallavi Smart", "title": "Change of Maharashtra govt brings focus back on vexed Public Universities Act Amendment Bill", "description": "Notably, Higher and Technical Education minister from the MVA government, Uday Samant of the Shiv Sena, who earlier promoted the amendments, is now part of the new state government under Chief Minister Eknath Shinde.", "url": "https://indianexpress.com/article/cities/mumbai/change-of-govt-brings-focus-back-on-vexed-public-universities-act-amendment-bill-8004132/", "urlToImage": "https://images.indianexpress.com/2022/07/Pune-colleges.jpeg", "publishedAt": "2022-07-01T21:03:25Z", "content": "Following the change in government, a new discussion has begun in university circles across Maharashtra the moves possible impact on the Maharashtra Public Universities Act Amendment Bill.The bill, w… [+1584 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Nirupama Subramanian", "title": "‘Best foreign secretary that India never had’, led back-channel talks with Pak", "description": "As then Prime Minister Manmohan Singh’s Special Envoy to Pakistan, Lambah held discreet behind-the-scene talks with his counterpart Tariq Aziz, appointed for the back-channel process by then military ruler General Parvez Musharraf.", "url": "https://indianexpress.com/article/india/best-foreign-secretary-that-india-never-had-led-back-channel-talks-with-pak-8004084/", "urlToImage": "https://images.indianexpress.com/2022/07/Satinder-Lambah-illustration.jpg", "publishedAt": "2022-07-01T20:29:47Z", "content": "Satinder Lambah, the diplomat who led the back-channel process between India and Pakistan from 2005 till 2014, and was unshaken until the end in his conviction that engagement with an adversary was a… [+6820 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Nirupama Subramanian", "title": "‘Best foreign secretary that India never had’, led back-channel talks with Pak", "description": "As then Prime Minister Manmohan Singh’s Special Envoy to Pakistan, Lambah held discreet behind-the-scene talks with his counterpart Tariq Aziz, appointed for the back-channel process by then military ruler General Parvez Musharraf.", "url": "https://indianexpress.com/article/cities/chennai/best-foreign-secretary-that-india-never-had-led-back-channel-talks-with-pak-8004084/", "urlToImage": "https://indianexpress.com/wp-content/themes/indianexpress/images/IE-OGimage.jpg", "publishedAt": "2022-07-01T20:29:47Z", "content": "Satinder Lambah, the diplomat who led the back-channel process between India and Pakistan from 2005 till 2014, and was unshaken until the end in his conviction that engagement with an adversary was a… [+6820 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mumbai daily Covid-19 caseload drops with 978 fresh Covid cases; Maharashtra logs 3,249", "description": "Maharashtra recorded 3,249 new cases and four more deaths on the day. Active Covid cases stood at 23,996 as of July 1.", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-daily-covid-19-caseload-drops-with-978-fresh-covid-cases-maharashtra-news-8004130/", "urlToImage": "https://images.indianexpress.com/2022/07/covid.jpg", "publishedAt": "2022-07-01T20:27:11Z", "content": "New Covid cases in Mumbai dropped further to 978 on Friday, a day after the city registered 1,265 cases. Mumbai’s daily caseload plunged by 22.6 per cent in the last 24 hours. The test positivity rat… [+557 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sagar Rajput", "title": "Money laundering case: Shiv Sena MP Sanjay Raut appears before ED", "description": "ED sources said Shiv Sena MP Sanjay Raut presented himself at 11.45am and was quizzed for around ten hours.", "url": "https://indianexpress.com/article/cities/mumbai/sanjay-raut-money-laundering-maharashtra-ed-case-8004127/", "urlToImage": "https://images.indianexpress.com/2022/07/sanjay-raut.jpg", "publishedAt": "2022-07-01T20:18:13Z", "content": "Shiv Sena MP and party spokesperson Sanjay Raut appeared before the Enforcement Directorate (ED) on Friday. The federal agency had summoned him for questioning in connection with a case of alleged mo… [+2129 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Bashaarat Masood", "title": "Hyderpora encounter: HC upholds compensation to family of Amir Magray", "description": "A division bench of Chief Justice Justice Pankaj Mithal and Justice Javed Iqbal said: \"Appellants to pay compensation of Rs.5.00 lakhs, awarded by the Writ Court, to respondent no.1 is maintained.\"", "url": "https://indianexpress.com/article/cities/srinagar/hyderpora-encounter-hc-upholds-compensation-to-family-of-amir-magray-8004125/", "urlToImage": "https://images.indianexpress.com/2020/12/JK-HC.jpg", "publishedAt": "2022-07-01T20:15:29Z", "content": "The J&amp;K High Court on Friday upheld a compensation of Rs 5 lakhs to the family of Amir Magray, a Jammu youth killed in Hyderpora gunfight in November last year. The court said the appeal for exhu… [+2523 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Rainfall lash Rajkot and Amreli dists", "description": "Lodhika taluka of Rajkot district received 115 millimetres (mm) of rain during the day Friday, an official release said.", "url": "https://indianexpress.com/article/cities/rajkot/rainfall-lash-rajkot-and-amreli-dists-8004123/", "urlToImage": "https://images.indianexpress.com/2022/06/monsoon.jpeg", "publishedAt": "2022-07-01T20:01:38Z", "content": "PARTS OF Rajkot district were lashed by heavy rain leading to temporary waterlogging in many areas Friday. Moderate rainfall was reported from Amreli also.Lodhika taluka of Rajkot district received 1… [+1173 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Esha Roy", "title": "MoEF proposes amendments in Environment Protection Act, to decriminalize provisions", "description": "The ministry has proposed the removal of imprisonment as a penalty for the \"less severe’’ contraventions. Incidentally, the EPA provisions\r\nwill be in force for penal provisions of the single use plastic ban which has come into force from today.", "url": "https://indianexpress.com/article/india/moef-proposes-amendments-environment-protection-act-decriminalize-provisions-8004120/", "urlToImage": "https://images.indianexpress.com/2022/03/bhupendra-yadav-1-1.jpg", "publishedAt": "2022-07-01T19:54:01Z", "content": "The Ministry of Environment, Forests and Climate Change has today proposed the decriminalisation of the existing provisions of the Environment Protection Act, 1986. The EPA is the overarching environ… [+2802 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Jayprakash S Naidu", "title": "Shop owner in Amravati likely killed for post supporting Nupur Sharma", "description": "The incident took place between 10 pm to 10.30 pm on June 21 when Umesh Kolhe was on his way home after closing his shop ‘Amit Medical Store’. Sanket, 27, and his wife Vaishnavi were accompanying him on another scooter.", "url": "https://indianexpress.com/article/cities/mumbai/shop-owner-in-amravati-likely-killed-for-post-supporting-nupur-sharma-udaipur-killing-8004116/", "urlToImage": "https://images.indianexpress.com/2022/07/Express-Representational-Image-46-4.jpeg", "publishedAt": "2022-07-01T19:48:35Z", "content": "EXACTLY a week before tailor Kanhaiyalal Teli was hacked to death in Udaipur, Umesh Prahladrao Kolhe, a 54-year-old chemist, was killed in Maharashtras Amravati district on June 21. Investigators now… [+3453 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "2014 student death case: Sherwood principal, 2 others found guilty of negligence, sent to 2-yr jail", "description": "In November 2014, Shaan, a student from Nepal, had died of pneumonia and septicemia while on his way from a hospital in Haldwani to a higher centre in Noida, where he was declared brought dead.", "url": "https://indianexpress.com/article/india/2014-student-death-case-sherwood-principal-2-found-guilty-negligence-jail-8004118/", "urlToImage": "https://images.indianexpress.com/2022/07/arrest-2.jpg", "publishedAt": "2022-07-01T19:44:50Z", "content": "The Court of Chief Judicial Magistrate (CJM) in Nainital has pronounced principal Amandeep Sandhu, infirmary in-charge sister Payal Paul and warden Ravi Kumar guilty of criminal negligence in the 201… [+3291 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Deep Mukherjee", "title": "Udaipur killing: Two more arrested; Rath Yatra procession taken out amid heavy police deployment", "description": "The Special Operations Group and the ATS of the Rajasthan Police issued a statement saying media reports claiming that the NIA said there was no terrorist organisation's hand in the killing were “premature” because the investigation is in a preliminary stage.", "url": "https://indianexpress.com/article/cities/jaipur/udaipur-killing-two-arrested-rath-yatra-procession-taken-heavy-police-deployment-8004114/", "urlToImage": "https://images.indianexpress.com/2022/07/udaipur-killing.jpeg", "publishedAt": "2022-07-01T19:38:49Z", "content": "The Rajasthan Police on Friday arrested two more accused for the murder of Udaipur-based tailor Kanhaiya Lal on June 28, with officials saying they were involved in the conspiracy to plan and execute… [+5026 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Bharuch: 21 held for ‘sprinkling inflammable material on pan shop, elderly woman’", "description": "The police said that 23 have been named in the police complaint based on video footage, while the remaining nine are yet to be identified.", "url": "https://indianexpress.com/article/cities/surat/bharuch-21-held-for-sprinkling-inflammable-material-on-pan-shop-elderly-woman-8004110/", "urlToImage": "https://images.indianexpress.com/2022/07/Express-Representational-Image-46-3.jpeg", "publishedAt": "2022-07-01T19:36:36Z", "content": "The Bharuch police arrested 21 youths for allegedly “trying to set fire to a pan shop and an elderly woman” by sprinkling an inflammable material after a quarrel erupted between the shop owner and tw… [+1850 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sreenivas Janyala", "title": "Ahead of BJP national executive meet, Nadda holds roadshow in Hyderabad", "description": "The BJP welcomed the party chief with a show of strength with almost all state BJP leaders, including state BJP chief Bandi Sanjay Kumar; Union Minister G Kishan Reddy; district coordinators, and others, converging at the airport to welcome Nadda.", "url": "https://indianexpress.com/article/cities/hyderabad/ahead-of-bjp-national-executive-meet-nadda-holds-roadshow-hyderabad-8004109/", "urlToImage": "https://images.indianexpress.com/2022/07/Nadda-in-Telangana-1.jpg", "publishedAt": "2022-07-01T19:33:30Z", "content": "The BJP held a massive roadshow led by party national president J P Nadda at Shamshabad on the outskirts of Hyderabad today evening, ahead of the two-day national executive meeting.The BJP welcomed t… [+2522 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Peter Vidal", "title": "Horoscope Today, July 2 2022: Leo, Libra, Virgo and other signs — check astrological prediction", "description": "Cancer - A continuing planetary emphasis on money, in all its forms, eclipses any other consideration in your chart", "url": "https://indianexpress.com/article/horoscope/horoscope-today-july-2-2022-leo-libra-virgo-and-other-signs-check-astrological-prediction-7991631/", "urlToImage": "https://images.indianexpress.com/2022/07/horoscope_3.jpg", "publishedAt": "2022-07-01T19:30:14Z", "content": "Two regions of your chart are stimulated today, one dealing with lovers, the other with friends. What links the two is the thought that it is people who are older, or otherwise more experienced, who … [+3301 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Issued him ‘eligible’ hall ticket: MS varsity prohibits rusticated student from appearing for exam", "description": "The Faculty of Fine Arts (FFA) handed over a letter to Kundan on Friday stating that since he has been debarred, he cannot be allowed to appear for the examinations.", "url": "https://indianexpress.com/article/cities/baroda/vadodara-ms-university-gujarat-8004106/", "urlToImage": "https://images.indianexpress.com/2022/07/MSU.jpg", "publishedAt": "2022-07-01T19:26:51Z", "content": "Vadodara MS University Friday prohibited Kundan Kumar Mahato, the former Fine Arts student who was debarred on May 13 following a controversy over an artwork, from appearing for the regular offline e… [+2852 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Plea to CJI seeks withdrawal of remarks against Nupur", "description": "The letter petition by Delhi resident and social activist Ajay Gautam referred to the remarks as reported by various media houses and said the “observation made by the court is unwanted, uncalled and without any merit and liable to (be) withdraw(n)”.", "url": "https://indianexpress.com/article/cities/delhi/plea-to-cji-seeks-withdrawal-of-remarks-against-nupur-8004107/", "urlToImage": "https://images.indianexpress.com/2022/07/nupur-sharma-1-5.jpeg", "publishedAt": "2022-07-01T19:25:56Z", "content": "WITH THE observations of a two-judge Supreme Court bench of Justices Surya Kant and J B Pardiwala lambasting suspended BJP spokesperson Nupur Sharma for her remarks on the Prophet during a TV show an… [+1877 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Avinash Nair", "title": "Ensure BJP gets 3/4th majority in Gujarat polls: Shah tells voters", "description": "The Union Home Minister said, \"BJP has ensured an all-round development of Gujarat. Be it urban, rural, mountains or coastal areas, the BJP government has developed all areas.\"", "url": "https://indianexpress.com/article/cities/ahmedabad/ensure-bjp-gets-3-4th-majority-in-gujarat-polls-shah-tells-voters-8004103/", "urlToImage": "https://images.indianexpress.com/2022/06/amit-shah-2-1.jpeg", "publishedAt": "2022-07-01T19:19:46Z", "content": "Emphasising that the Bharatiya Janata Party (BJP) has ensured an all-round development of Gujarat, Union Home Minister Amit Shah Friday asked voters in the state to ensure a three-fourth majority for… [+2888 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Nitin Sharma", "title": "Alleged age fraud in badminton: Parents protest on court, Under-13 tournament postponed for a day", "description": "While some of the parents sat on the court stopping the matches midway, BAI observer Bamang Tago was seen urging the parents to let the matches happen.", "url": "https://indianexpress.com/article/sports/badminton/alleged-age-fraud-in-badminton-parents-protest-on-court-under-13-tournament-postponed-for-a-day-8004102/", "urlToImage": "https://images.indianexpress.com/2022/07/Badminton-4.jpg", "publishedAt": "2022-07-01T19:18:56Z", "content": "In a first in, a sub-junior ranking U-13 badminton tournament of the Badminton Association of India (BAI) was stopped midway and postponed for a day after more than 60 parents protested over alleged … [+2444 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kamaal Saiyed", "title": "Gujarat: Airstrip at Surat airport to be strengthened using steel slag", "description": "Sources said that through e-tendering, Adroit Structural Engineers Private Limited from Vadodara was given the work for ground improvement and stabilisation of the runway strip in October 2021.", "url": "https://indianexpress.com/article/cities/surat/gujarat-airstrip-at-surat-airport-to-be-strengthened-using-steel-slag-8004100/", "urlToImage": "https://images.indianexpress.com/2022/07/flight.png", "publishedAt": "2022-07-01T19:18:05Z", "content": "The Surat airport will strengthen its airstrip using steel slag as per the International Civil Aviation Organisation (ICAO) recommendations and Civil Aviation Requirements (CAR), according to airport… [+2465 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Iram Siddique", "title": "Booth capturing: Four in MP village get show-cause notice", "description": "Told to pay Rs 5.02 lakh re-polling cost or face demolition of houses.", "url": "https://indianexpress.com/article/cities/bhopal/booth-capturing-four-in-mp-village-get-show-cause-notice-8004086/", "urlToImage": "https://images.indianexpress.com/2022/07/Gavel.jpg", "publishedAt": "2022-07-01T19:11:53Z", "content": "Four people accused of booth capturing were issued show-cause notices and told to deposit Rs 5.02 lakh as the cost district administration had to bear for the re-polling or face demolition of their i… [+2261 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sandip G", "title": "Kohli luckless but looked good, rest of top order shaky against masterful Anderson and spirited Potts", "description": "The master craftsman Anderson and the newbie Potts accentuate the weakness of Indian top order who collapse to 98 for 5.", "url": "https://indianexpress.com/article/sports/cricket/kohli-luckless-but-looked-good-rest-of-top-order-shaky-against-masterful-anderson-and-spirited-potts-8004091/", "urlToImage": "https://images.indianexpress.com/2022/07/IND-top-order.jpg", "publishedAt": "2022-07-01T19:03:31Z", "content": "As the barrel-chested Matthew Potts barged into his teammates in joy after terminating Virat Kohli, the former India skipper stared helplessly at Rishabh Pant, the non-striker, before he flashed a wr… [+4306 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gujarat CM flags off procession: Jagannath Rath Yatra held amid fanfare, tight security", "description": "On Friday, the ceremony began around 4 am when Union Home Minister Amit Shah arrived at the temple premises to conduct the “Mangla Aarti”. Shah left shortly after.", "url": "https://indianexpress.com/article/cities/ahmedabad/gujarat-jagannath-rath-yatra-bhupendra-patel-amit-shah-8004094/", "urlToImage": "https://images.indianexpress.com/2022/07/bhupendra-ptel.jpg", "publishedAt": "2022-07-01T19:02:59Z", "content": "The 145th Lord Jagannath Rath Yatra was concluded in old city Ahmedabad amid huge fanfare and heavy police security Friday as Chief Minister Bhupendra Patel flagged off the procession only three days… [+2758 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gujarat weather: Rainfall lash Rajkot and Amreli districts", "description": "The rain led to temporary waterlogging in Indrapasthnagar underpass, sections of 150-feet Ring Road, Kothariya Road, etc.", "url": "https://indianexpress.com/article/cities/rajkot/gujarat-monsoons-rainfall-rajkot-amreli-weather-8004090/", "urlToImage": "https://images.indianexpress.com/2022/07/rain.jpg", "publishedAt": "2022-07-01T18:54:02Z", "content": "PARTS OF Rajkot district were lashed by heavy rain leading to temporary waterlogging in many areas Friday. Moderate rainfall was reported from Amreli also.Lodhika taluka of Rajkot district received 1… [+1176 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sandip G", "title": "It’s Dhoni, it’s Gilchrist, no it’s Rishabh Pant", "description": "With a combination of breath-taking swagger and percentage cricket, India's crisis man shows he is a worthy Gilchrist reincarnation.", "url": "https://indianexpress.com/article/sports/cricket/its-dhoni-its-gilchrist-no-its-rishabh-pant-8004081/", "urlToImage": "https://images.indianexpress.com/2022/07/Pant-100.jpg", "publishedAt": "2022-07-01T18:42:15Z", "content": "Under the gloomy Edgbaston skies, Rishabh Pant made another leap into greatness. He cracked 146 off 111 balls in a staggering exhibition of counterpunching to make the first day of the series-decider… [+6392 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Apurva Vishwanath", "title": "Explained: Law & precedent on clubbing of cases, and SC denial of Nupur Sharma plea", "description": "A vacation Bench of Justices Surya Kant and J B Pardiwala, while refusing to grant interim relief, criticised the remarks she had made leading to the case against her.", "url": "https://indianexpress.com/article/explained/explained-law-precedent-clubbing-of-cases-sc-denial-nupur-sharma-plea-8004078/", "urlToImage": "https://images.indianexpress.com/2022/07/Nupur-sharma-explained.png", "publishedAt": "2022-07-01T18:37:48Z", "content": "ON FRIDAY, the Supreme Court declined a plea by former BJP spokesperson Nupur Sharma to club the hate speech cases filed against her across the country. A vacation Bench of Justices Surya Kant and J … [+4815 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "Ajker Rashifal bengali, 2 July 2022: সাবধান! পরিবারে ভাঙন ধরতে পারে এই রাশির জাতকদের", "description": "আজকের রাশিফল ২ জুলাই, জানুন কী আছে আজ ভাগ্যে?", "url": "https://bengali.indianexpress.com/horoscope/ajker-rashifal-july-2-2022-aries-taurus-gemini-cancer-leo-virgo-libra-scorpio-sagittarius-capricorn-aquarius-pisces-464081/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/sat1.jpg", "publishedAt": "2022-07-01T18:35:00Z", "content": "/ Aries  Rashifal ( March 21 – April 20 )\r\n/ Taurus  Rashifal ( April 21 – May 21 )\r\n/ Gemini  Rashifal ( May 22 – June 21 )\r\n/ Cancer Rashifal  ( June 22 – July 23 )\r\n [ -, ] \r\n/ Leo   Rashifal  ( J… [+336 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "‘Murmu could’ve been consensus candidate if NDA consulted Opp’", "description": "Speaking to mediapersons during a Rath Yatra programme in Kolkata, Banerjee said Murmu has a better chance of winning the Presidential election.", "url": "https://indianexpress.com/article/cities/kolkata/murmu-couldve-been-consensus-candidate-if-nda-consulted-opp-8004061/", "urlToImage": "https://images.indianexpress.com/2022/07/mamata-759-1-1-1-5.jpg", "publishedAt": "2022-07-01T18:34:53Z", "content": "West Bengal Chief Minister Mamata Banerjee on Friday said that Droupadi Murmu, the National Democratic Alliance (NDA) nominee for the Presidential polls, could have been a consensus candidate had the… [+1934 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kaushik Das Gupta", "title": "Explained: Concise companion to a bestselling treatise", "description": "Thomas Piketty’s latest work, A Brief History of Equality, is a slimmer and a far less dense companion volume to Capital — and to his 2019 work Capital and Ideology.", "url": "https://indianexpress.com/article/explained/explained-concise-companion-to-a-bestselling-treatise-8004075/", "urlToImage": "https://images.indianexpress.com/2022/07/FotoJet-2022-07-01T235341.265-logo.png", "publishedAt": "2022-07-01T18:27:05Z", "content": "In 2014, French economist Thomas Pikettys Capital in The Twenty-First Century became one of the rare hardcore economics books to feature on bestseller lists. Written in the backdrop of the Occupy Mov… [+2703 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "70-yr-old woman falls into sewer pit, rescued", "description": "The house inmates, after learning about the incident, called the fire department officials. The villagers also gathered and inserted a rope into the pit but the woman could not hold it.", "url": "https://indianexpress.com/article/cities/surat/70-yr-old-woman-falls-into-sewer-pit-rescued-8004064/", "urlToImage": "https://images.indianexpress.com/2022/07/Indian-expressss-1.jpg", "publishedAt": "2022-07-01T18:15:53Z", "content": "Fire department officials on Friday rescued a 70-year-old woman who fell into a 20-feet-deep sewer pit outside her house in Surat.According to the fire officials, the incident took place on Friday mo… [+318 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Nihal Koshie", "title": "Why Chopra won’t have to throw 90 metres to finish on the podium at Worlds", "description": "Since the start of the millennium just seven of the 48 medalists at the Olympics and Championships have crossed the barrier.", "url": "https://indianexpress.com/article/sports/sport-others/why-chopra-wont-have-to-throw-90-metres-to-finish-on-the-podium-at-worlds-8004063/", "urlToImage": "https://images.indianexpress.com/2022/07/neerajmain.jpg", "publishedAt": "2022-07-01T18:11:00Z", "content": "If Neeraj Chopra is getting tired of the 90-metre question, the genial javelin thrower isn’t showing it. 88.06 metres, a then national record, at the Jakarta Asian Games four years ago had first rais… [+5783 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rahul V Pisharody", "title": "Telangana junior doctors continue their protest for pending stipends on National Doctors’ Day", "description": "Health Minister T Harish Rao says the government is trying to find a solution to the issue of delayed payments.", "url": "https://indianexpress.com/article/cities/hyderabad/telangana-junior-doctors-protest-pending-stipends-national-doctors-8004055/", "urlToImage": "https://images.indianexpress.com/2022/07/Telangana.jpg", "publishedAt": "2022-07-01T18:01:43Z", "content": "Amid National Doctors’ Day posters and banners greeting them, senior residentspostgraduate doctors in compulsory one-year government serviceintensified their protest over pending stipends, boycotting… [+4555 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Namit Kumar", "title": "Who is Tim Van Rijthoven? Novak Djokovic’s Wimbledon R4 opponent who was winless on tour until last month", "description": "The Dutchman received a wildcard for the main draw at SW19 following a fairytale grass title in his home country three weeks ago.", "url": "https://indianexpress.com/article/sports/tennis/who-is-tim-van-rijthoven-novak-djokovics-wimbledon-r4-opponent-who-was-winless-on-tour-until-last-month-8004052/", "urlToImage": "https://images.indianexpress.com/2022/07/Tim-Van-Rijthoven.jpg", "publishedAt": "2022-07-01T17:42:55Z", "content": "Tim Van Rijthoven was not supposed to be at Wimbledon. Until three weeks ago, according to every conceivable metric used to judge elite-level tennis, the 25-year-old was nowhere near the sports oldes… [+5174 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pallavi Smart", "title": "Change in govt brings contentious Public Universities Act Amendment Bill back in focus", "description": "The bill, which was passed by the cabinet in December last year under the Maha Vikas Aghadi (MVA) government amid strong opposition from the Bharatiya Janata Party (BJP), has been pending for the Governor’s final nod.", "url": "https://indianexpress.com/article/cities/mumbai/change-in-govt-brings-contentious-public-universities-act-amendment-bill-8004047/", "urlToImage": "https://images.indianexpress.com/2022/07/shinde12-1-1.jpg", "publishedAt": "2022-07-01T17:41:39Z", "content": "Following the change in government, a new discussion has begun in university circles across the state the moves possible impact on the Maharashtra Public Universities Act Amendment Bill.The bill, whi… [+2929 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Biden to award Medal of Freedom to Steve Jobs, actor Denzel Washington", "description": "Biden will also recognize Sandra Lindsay, the New York City nurse who rolled up her sleeve on live television in December 2020 to receive the first COVID-19 vaccine dose that was pumped into an arm in the United States, the White House announced Friday.", "url": "https://indianexpress.com/article/world/biden-to-award-medal-of-freedom-to-steve-jobs-actor-denzel-washington-8004051/", "urlToImage": "https://images.indianexpress.com/2022/05/Joe-BIden-2.jpg", "publishedAt": "2022-07-01T17:33:37Z", "content": "President Joe Biden will present the nation’s highest civilian honor, the Presidential Medal of Freedom, to 17 people, including actor Denzel Washington, gymnast Simone Biles and the late John McCain… [+5115 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Karnataka electric vehicles exhibition begins in Bengaluru with more than 100 stalls", "description": "The exhibition has more than 100 stalls to display products, solutions and technologies from different parts of the globe.", "url": "https://indianexpress.com/article/cities/bangalore/karnataka-electric-vehicles-exhibition-begins-in-bengaluru-with-around-100-stalls-8004048/", "urlToImage": "https://images.indianexpress.com/2022/07/ev.jpg", "publishedAt": "2022-07-01T17:23:43Z", "content": "The Karnataka governments electric vehicles exhibition was inaugurated by Chief Minister Basavaraj Bommai on Friday.The EV Abhiyaana will be held at Chamara Vajra, Palace Grounds, in Bengaluru till S… [+1819 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "John Isner sets world record for aces during his Wimbledon 3rd round match", "description": "The American now stands alone on top of the mountain with 13,729 untouchable serves and counting, passing Croatia's Ivo Karlovic's previous leading mark of 13,728.", "url": "https://indianexpress.com/article/sports/tennis/john-isner-sets-world-record-for-aces-during-wimbledon-3rd-round-match-8004038/", "urlToImage": "https://images.indianexpress.com/2022/07/Isner.jpg", "publishedAt": "2022-07-01T17:22:17Z", "content": "John Isner literally became the king of aces when he broke the all-time record for serving aces on Friday in his Wimbledon third-round match against Italian Jannik Sinner.The American now stands alon… [+1240 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Poor financial condition drives 3 of a Mansa family to commit suicide", "description": "The deceased have been identified as Suresh Kumar (36), his wife Kajal (32) and their 10-year-old son Harish.", "url": "https://indianexpress.com/article/cities/ludhiana/poor-financial-condition-drives-3-of-a-mansa-family-to-commit-suicide-8004042/", "urlToImage": "https://images.indianexpress.com/2022/07/Indian-expressss.jpg", "publishedAt": "2022-07-01T17:16:17Z", "content": "Three members of a family in Thuthianwali village of Mansa district have allegedly committed suicide by jumping into Kotla branch canal. They reportedly took the extreme step due to poor financial co… [+1353 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Ludhiana top officials launch ‘healthy campus’ drive to keep college students from drugs", "description": "Chairing a meeting with the principals of city-based colleges, the CP and DC said that this campaign was aimed at creating maximum awareness against ill-effects of drugs among college-going students.", "url": "https://indianexpress.com/article/cities/ludhiana/ludhiana-college-students-drugs-problem-healthy-campus-addiction-8004035/", "urlToImage": "https://images.indianexpress.com/2022/07/punjab.jpg", "publishedAt": "2022-07-01T17:15:56Z", "content": "In an effort to keep college students from drugs, Ludhiana police commissioner (CP) Kaustubh Sharma and deputy commissioner (DC) Surabhi Malik launched a ‘healthy campus’ campaign on Friday.Chairing … [+1779 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Gayathri Mani", "title": "Explained: Delhi withdraws circle rate rebate, how does it affect what buyers pay for property?", "description": "Circle rates are minimum prices per unit area determined by the government. A property cannot be registered for a price below the circle rate for that area.", "url": "https://indianexpress.com/article/explained/explained-delhi-circle-rate-rebate-buyers-property-8004037/", "urlToImage": "https://images.indianexpress.com/2022/07/dda-flats-1200.jpg", "publishedAt": "2022-07-01T17:10:28Z", "content": "As the Delhi government on Thursday (June 30) ended the 20 per cent rebate on the circle rate, there were apprehensions that property prices in the national capital would go up.Buyers would have to p… [+2282 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "UT to take lessons from Maharashtra, its neighbours for EWS admissions", "description": "The State Advisory Council has been constituted as per the provisions of Right To Education (RTE) Act to advise the government regarding implementation of various provisions of the Act and has UT Adviser Dharam Pal as its chairperson.", "url": "https://indianexpress.com/article/cities/chandigarh/ut-to-take-lessons-from-maharashtra-its-neighbours-for-ews-admissions-8004025/", "urlToImage": "https://images.indianexpress.com/2021/07/newsline-delhi-ews-2col.jpg", "publishedAt": "2022-07-01T17:06:50Z", "content": "THE 11th meeting of the State Advisory Council on Friday decided that the UT education department will study the practices and procedures being followed by the government of Maharashtra and those by … [+166 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Sam Gilliam ‘took a step most people didn’t understand was possible’", "description": "Sam Gilliam and his work left a deep impact on his fellow artists and friends.", "url": "https://indianexpress.com/article/lifestyle/art-and-culture/sam-gilliam-took-a-step-most-people-didnt-understand-was-possible-7997617/", "urlToImage": "https://images.indianexpress.com/2022/06/NYT.jpg", "publishedAt": "2022-07-01T17:00:04Z", "content": "(An Appraisal)\r\nWhen painter Sam Gilliam died last weekend at age 88, he left behind pioneering artworks, particularly his draped canvases stained with blooms of color that forever changed the way th… [+6237 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Footpath in Peddar Road cracks open in heavy rain, no one harmed", "description": "The landslide took place near an under-construction building at Peddar road, a couple of buildings away from the residence of the late singing legend Lata Mangeshkar.", "url": "https://indianexpress.com/article/cities/mumbai/footpath-in-peddar-road-cracks-open-in-heavy-rain-no-one-harmed-8004023/", "urlToImage": "https://images.indianexpress.com/2022/07/mumbai.jpg", "publishedAt": "2022-07-01T16:58:53Z", "content": "The incessant heavy rainfall in South Mumbai since Wednesday night triggered a landslide at midnight in the Tony Peddar Road area of Mumbai. The landslide resulted in the footpath along the stretch t… [+1569 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anonna Dutt", "title": "Understanding Covid sub-variants: ‘If you’ve had BA.2, it can protect you against BA.4, BA.5’", "description": "The peaks of the latest wave of Covid-19 infections across the country are likely to be smaller with previous exposure to the BA.2 sub-variant offering better protection against emerging variants as compared to its cousin BA.1. Still, it is time to develop a …", "url": "https://indianexpress.com/article/lifestyle/health/understanding-covid-sub-variants-ba-2-ba-4-ba-5-8004028/", "urlToImage": "https://images.indianexpress.com/2022/07/doctor.jpg", "publishedAt": "2022-07-01T16:55:08Z", "content": "Dr Agarwal is a trained pulmonologist, whose research focusses on respiratory disease biology. He was at the helm of the Institute of Genomics and Integrative Biology when the pandemic hit and has be… [+6007 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "‘This Taliban incident’ was not reaction, but result of a belief system: RSS", "description": "RSS publicity chief Sunil Ambekar says the new generation should discuss Partition to ensure 'powers that talk about secession and terrorism do not take root' in the country.", "url": "https://indianexpress.com/article/india/taliban-incident-not-reaction-but-result-of-belief-system-rss-8004020/", "urlToImage": "https://images.indianexpress.com/2022/07/sunil-ambekar-1200.jpg", "publishedAt": "2022-07-01T16:50:23Z", "content": "On a day the Supreme Court came down heavily on suspended BJP spokesperson Nupur Sharma saying she “is single-handedly responsible for what is happening in the country”, the RSS suggested that “this … [+3187 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Julian Assange appeals to UK court against extradition to US", "description": "Julian Assange has battled in British courts for years to avoid being sent to the U.S., where he faces 17 charges of espionage and one charge of computer misuse.", "url": "https://indianexpress.com/article/world/julian-assange-appeals-uk-court-extradition-us-8004015/", "urlToImage": "https://images.indianexpress.com/2022/07/assange.jpg", "publishedAt": "2022-07-01T16:49:30Z", "content": "WikiLeaks founder Julian Assange has appealed against the British’s government decision last month to order his extradition to the US.The appeal was filed Friday at the High Court, the latest twist i… [+2071 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Raakhi Jagga, Kanchan Vasdev", "title": "AAP govt keeps its word, free 300 units of power for Punjab comes into effect", "description": "The announcement came from Chief Minister Bhagwant Mann, who in a video message said that the guarantee would be rolled out from Friday. He said that up to 300 units of electricity would be free for Punjab power consumers from this month.", "url": "https://indianexpress.com/article/cities/chandigarh/aap-govt-punjab-bhagwant-mann-free-electricity-8004013/", "urlToImage": "https://images.indianexpress.com/2022/06/bhagwant-mann-3.jpg", "publishedAt": "2022-07-01T16:39:28Z", "content": "The Punjab government on Friday rolled out its first pre-election guarantee of providing 300 units of free power every month to the residents of the state.The announcement came from Chief Minister Bh… [+4346 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Santanu Chowdhury", "title": "Amid open war between Mamata, Dhankhar over Chancellor role, RBU V-C a new front", "description": "Taking to Twitter, the Governor announced Thursday that he has appointed Mahua Mukherjee, a professor in the RBU's dance department, as its next V-C.", "url": "https://indianexpress.com/article/political-pulse/open-war-between-mamata-dhankhar-over-chancellor-role-rbu-v-c-new-front-8003994/", "urlToImage": "https://images.indianexpress.com/2022/07/Mamata-oath.jpeg", "publishedAt": "2022-07-01T16:29:48Z", "content": "West Bengal Governor Jagdeep Dhankhar has triggered a fresh confrontation with the Mamata Banerjee-led Trinamool Congress (TMC) government by naming the new vice-chancellor of the state-run Rabindra … [+4820 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Debraj Deb", "title": "Many injured as Tripura Rath Yatra elephant runs amok, chariot crest falls on devotees", "description": "Devotees believe they will be absolved of sins if they pull the chariot of Lord Jagannath Dev.", "url": "https://indianexpress.com/article/north-east-india/tripura/many-injured-tripura-rath-yatra-elephant-runs-amok-chariot-crest-falls-devotees-8003997/", "urlToImage": "https://images.indianexpress.com/2022/07/Tripura-yatra.jpg", "publishedAt": "2022-07-01T16:29:19Z", "content": "A policeman, a woman and two children were among those injured during Rath Yatras in Tripura’s Gomati and South Tripura districts on Friday.At Debdaru village in the Shantirbazaar subdivision of Sout… [+2070 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Maha: First-time MLA Narvekar is BJP nominee for speaker post; Cong asks why hold election now", "description": "The Congress sought to know how Governor Bhagat Singh Koshyari can allow the Speaker's election now when he did not give consent for the process when the Shiv Sena-led alliance was in power.", "url": "https://indianexpress.com/article/cities/mumbai/maha-first-time-mla-narvekar-bjp-nominee-speaker-cong-why-election-now-8003982/", "urlToImage": "https://images.indianexpress.com/2022/07/Maha-crisis-1.jpg", "publishedAt": "2022-07-01T16:28:20Z", "content": "First-time Bharatiya Janata Party (BJP) MLA Rahul Narvekar on Friday filed his nomination as the party candidate for the post of Maharashtra Assembly speaker, election for which, if required, will be… [+4459 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Novak Djokovic schools Kecmanovic to reach last 16 again", "description": "The top seed was unplayable in the opening set of his third-round match on Centre Court, taking it in 24 minutes.", "url": "https://indianexpress.com/article/sports/tennis/djokovic-schools-kecmanovic-to-reach-last-16-again-8003998/", "urlToImage": "https://images.indianexpress.com/2022/07/Djokovic-wimbledon.jpg", "publishedAt": "2022-07-01T16:26:05Z", "content": "Novak Djokovic clinically disposed of fellow Serb Miomir Kecmanovic as he continued his relentless pursuit of a fourth successive Wimbledon title with a 6-0 6-3 6-4 victory on Friday.The top seed was… [+830 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Chicago shooting during dispute leaves 2 dead, 3 wounded", "description": "Two men in their 20s were pronounced dead at a hospital, police said, and two other men were wounded along with a fifth person. The wounded were reported in good condition.", "url": "https://indianexpress.com/article/world/chicago-shooting-during-dispute-leaves-2-dead-3-wounded-8003983/", "urlToImage": "https://images.indianexpress.com/2022/07/indian-express.jpg", "publishedAt": "2022-07-01T16:20:16Z", "content": "A person opened fire during a verbal dispute early Friday in downtown Chicago, killing two men and wounding three other people, police said.The five who were shot were leaving a business about 1:45 a… [+1008 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Project Muskurata Bachpan: Ludhiana DC appoints two nodal officers to stop child labor", "description": "According to details, the project will address the basic needs and rights of children engaged or at risk of child labour.", "url": "https://indianexpress.com/article/cities/ludhiana/project-mukturata-bachpan-ludhiana-dc-appoints-two-nodal-officers-stop-child-labor-8003966/", "urlToImage": "https://images.indianexpress.com/2022/07/Surabhi-Malik.jpg", "publishedAt": "2022-07-01T16:20:13Z", "content": "Ludhiana Deputy Commissioner, Surabhi Malik, on Friday appointed two nodal officers Friday under the project ‘Muskurata Bachpan’ that will be aimed at stopping the practice of child labour in the dis… [+1574 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Mertens beats former Wimbledon champion Kerber to reach last 16", "description": "Mertens achieved her best showing at the grasscourt Grand Slam in 2019 when she reached the round of 16 and came into Friday's contest having defeated the three-times major winner in their only previous meeting three years ago.", "url": "https://indianexpress.com/article/sports/tennis/mertens-beats-former-wimbledon-champion-kerber-to-reach-last-16-8003987/", "urlToImage": "https://images.indianexpress.com/2022/07/Kerber.jpg", "publishedAt": "2022-07-01T16:19:51Z", "content": "Belgian Elise Mertens stayed solid against an error-prone Angelique Kerber of Germany to defeat the former Wimbledon champion 6-4 7-5 on Friday and reach the fourth round.Mertens achieved her best sh… [+1378 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sreenivas Janyala", "title": "Ahead of BJP national executive meeting, JP Nadda holds roadshow near Hyderabad", "description": "Apart from members of BJP, a massive crowd gathered on the roadside as JP Nadda’s roadshow proceeded.", "url": "https://indianexpress.com/article/cities/hyderabad/ahead-of-bjp-national-executive-meeting-jp-nadda-holds-roadshow-hyderabad-8003955/", "urlToImage": "https://images.indianexpress.com/2022/07/Nadda.jpg", "publishedAt": "2022-07-01T16:15:51Z", "content": "The BJP held a massive roadshow headed by party national president J P Nadda at Shamshabad on the outskirts of Hyderabad Friday evening, ahead of the two-day national executive meeting slated to be h… [+3376 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "২৮৩ বছরে গুপ্তিপাড়ার রথযাত্রা, উৎসব ঘিরে লোকারণ্য", "description": "বছরের অন্যসময়ে ঐতিহ্যপূর্ণ বৃন্দাবনচন্দ্র মঠের পাশে বছরভর এই রথ পেল্লাই টিনের খাঁচায় ভরা থাকে।", "url": "https://bengali.indianexpress.com/west-bengal/rath-yatra-2022-283-year-old-guptiparas-rath-464198/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/Guptipara-Rath-Yatra.jpg", "publishedAt": "2022-07-01T16:12:57Z", "content": ", , , - , \r\n , , \r\n-- , \r\n , , , / - \r\nStay updated with the latest news headlines and all the latest Westbengal news download Indian Express Bengali App.\r\nWeb Title: Rath yatra 2022 283 year old gup… [+11 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Popular Vermont ski resort ‘Suicide Six’ to change ‘insensitive’ name", "description": "\"Our resort team embraces the increasing awareness surrounding mental health and shares the growing concerns about the insensitive nature of the historical name,\" the resort said", "url": "https://indianexpress.com/article/lifestyle/destination-of-the-week/popular-vermont-ski-resort-suicide-six-change-insensitive-name-8000558/", "urlToImage": "https://images.indianexpress.com/2022/06/skiing-1200.jpg", "publishedAt": "2022-07-01T16:10:03Z", "content": "One of the earliest ski resorts, Suicide Six, is located in South Pomfret, Vermont. It is of historic importance as the resort was the location of the first National Snow Surfing Championships in 198… [+1554 chars]"}]}