{"status": "ok", "totalResults": 510, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Paromita Chakrabarti", "title": "Explained: History of Regency romances, and its most popular practitioners", "description": "If you have binge-watched season two of Netflix’s Regency saga, Bridgerton, here’s a glimpse into the history of Regency romances and the writers who made it a wildly popular mass-market genre.", "url": "https://indianexpress.com/article/explained/bridgerton-regency-romance-georgette-heyer-7903997/", "urlToImage": "https://images.indianexpress.com/2022/05/BRIDGERTON-1.jpg", "publishedAt": "2022-05-06T08:46:20Z", "content": "Dear followers of the adventures of the British ton, if you are one of those who have devoured (perhaps, more than once) the slow burn of an electric romance between Viscount Anthony Bridgerton and K… [+6648 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shalini Langer", "title": "Doctor Strange in the Multiverse of Madness movie review: Really a multiverse of muchness, not amounting to much", "description": "Doctor Strange in the Multiverse of Madness review: It may be the Multiverse of Madness (which it is), but it is above all the Multiverse of Marvel.", "url": "https://indianexpress.com/article/entertainment/movie-review/doctor-strange-in-the-multiverse-of-madness-movie-review-benedict-cumberbatch-sam-raimi-7904003/", "urlToImage": "https://images.indianexpress.com/2022/05/doctor-strange-madness-multiverse-review-.jpg", "publishedAt": "2022-05-06T08:35:51Z", "content": "Doctor Strange in the Multiverse of Madness director: Sam RaimiDoctor Strange in the Multiverse of Madness cast: Benedict Cumberbatch, Elizabeth Olsen, Chiwetel Ejiofor, Benedict Wong, Xochitl Gomez,… [+2714 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Poonam Pandey reveals she suffered brain haemorrhage after domestic violence: ‘I lost sense of smell completely’", "description": "Poonam Pandey revealed that she had suffered brain haemorrhage due to domestic violence, and has lost her sense of smell.", "url": "https://indianexpress.com/article/entertainment/web-series/poonam-pandey-brain-haemorrhage-domestic-violence-7903957/", "urlToImage": "https://images.indianexpress.com/2022/03/poonam-pandey-1200.jpg", "publishedAt": "2022-05-06T08:26:11Z", "content": "Poonam Pandey, who recently faced eviction from Kangana Ranaut’s reality show Lock Upp, has opened up about being a victim of domestic violence. She said that she had even suffered a brain haemorrhag… [+1919 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Karnataka PSI recruitment scam: 32 candidates who scored above 125 marks under CID lens", "description": "The CID has already named 18 candidates, who obtained more than 125 marks in the objective portion of the exam held on October 3, 2021, as accused in the scam.", "url": "https://indianexpress.com/article/cities/bangalore/karnataka-psi-recruitment-scam-32-candidates-investigated-7903980/", "urlToImage": "https://images.indianexpress.com/2022/05/karnataka-psc.jpg", "publishedAt": "2022-05-06T08:24:30Z", "content": "The Criminal Investigation Department (CID) of the Karnataka Police, which is investigating the large-scale cheating that occurred in an examination conducted by the state police to recruit police su… [+5229 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuradha Mascarenhas", "title": "Expediting Covid-19 vaccination in children, Maharashtra plans innovative close-to-home inoculation sessions", "description": "In Pune, there are 3.5 lakh beneficiaries in this age group with 17 per cent fully vaccinated with both doses. Nagpur has been able to administer both doses to 7 per cent of the 1.6 lakh total beneficiaries in this age group.", "url": "https://indianexpress.com/article/cities/pune/covid-vaccination-children-maharashtra-7904009/", "urlToImage": "https://images.indianexpress.com/2022/03/pune-vaccine-2.jpeg", "publishedAt": "2022-05-06T08:23:12Z", "content": "In order to expedite Covid-19 vaccination especially in the below-18 age group, Maharashtra’s health department is planning innovative methods that include locality and near-to-home based sessions. A… [+4278 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manoj Kumar R", "title": "Saani Kaayidham movie review: Keerthy Suresh, Selvaraghavan shine in this unrestrained flow of savagery", "description": "Saani Kaayidham movie review: Saani Kaayidham is a non-nonsense revenge drama with non-stop action, meaning an unrestrained flow of savagery.", "url": "https://indianexpress.com/article/entertainment/movie-review/saani-kaayidham-movie-review-keerthy-suresh-selvaraghavan-7903939/", "urlToImage": "https://images.indianexpress.com/2022/05/Saani-Kaayidham.jpg", "publishedAt": "2022-05-06T08:18:27Z", "content": "It would be too naive to call director Arun Matheswaran’s latest movie Saani Kaayidham ‘a violent torture porn.’ Yes, of course, you see a man and a woman going on a killing spree, leaving behind a t… [+4357 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Day after reduction in fares, Mumbai AC locals see rise in ridership", "description": "The number of passengers who took the AC train services on Thursday not only surpassed the average daily passenger count before the fares were rationalised but also increased manifold.", "url": "https://indianexpress.com/article/cities/mumbai/day-after-reduction-in-fares-mumbai-ac-locals-see-rise-in-ridership-7903987/", "urlToImage": "https://images.indianexpress.com/2022/03/mumbai-local-2.jpg", "publishedAt": "2022-05-06T08:18:11Z", "content": "Over 9,700 passengers boarded Mumbais air-conditioned (AC) local trains on Thursday, the first day after the railways implemented a revised single-journey ticket fares for passengers travelling in th… [+1580 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Spiritual and cultural eco-park, hop-on, hop-off buses, Chennai vizha: TN govt’s grand plans to enhance tourism", "description": "The government plans to establish a 'Spiritual and Cultural Eco- park' on the East Coast Road in collaboration with the Department of Hindu Religious and Charitable Endowments Department (HR and CE) at a cost of Rs 1.5 crore.", "url": "https://indianexpress.com/article/cities/chennai/spiritual-and-cultural-eco-park-hop-on-hop-off-buses-chennai-vizha-tn-govts-grand-plans-to-enhance-tourism-7903988/", "urlToImage": "https://images.indianexpress.com/2022/03/MK-Stalin_Amazon.jpg", "publishedAt": "2022-05-06T08:14:09Z", "content": "A spiritual and cultural eco-park, a summer exhibition, a water sports destination and a handicrafts festival are among several plans of the DMK-led government in Tamil Nadu to enhance tourism in the… [+2553 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Nora Fatehi and Ranveer Singh’s fans can’t handle their sizzling chemistry as they perform ‘Garmi’ pelvic thrusts together. Watch", "description": "Ranveer Singh and Nora Fatehi brought the heat to Dance Deewane Juniors as they performed together to 'Garmi'.", "url": "https://indianexpress.com/article/entertainment/bollywood/nora-fatehi-and-ranveer-singh-garmi-dance-deewane-7903963/", "urlToImage": "https://images.indianexpress.com/2022/05/ranveer-singh-nora-fatehi.jpg", "publishedAt": "2022-05-06T08:13:56Z", "content": "Ranveer Singh and Nora Fatehi’s fans went into a tizzy after watching videos of the two dancing to the song “Garmi” during a taping of the reality Dance Deewane Juniors. Ranveer appeared on a the sho… [+1348 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Jayeshbhai Jordaar title track: Ranveer Singh makes a ‘Jordaar’ attempt at saving his unborn girl child", "description": "Jayeshbhai Jordaar stars Ranveer Singh, Shalini Pandey, Boman Irani and Ratna Pathak Shah. The film touches upon misogyny, female foeticide and gender disparity.", "url": "https://indianexpress.com/article/entertainment/bollywood/jayeshbhai-jordaar-title-track-ranveer-singh-jordaar-song-video-7903918/", "urlToImage": "https://images.indianexpress.com/2022/05/jayeshbhai-jordaar-1200.jpg", "publishedAt": "2022-05-06T08:10:31Z", "content": "The title track of the Ranveer Singh-starrer Jayeshbhai Jordaar was released on Friday. Titled “Jordaar,” the song summarises the core plot of the movie, about a man’s quest to save his unborn girl c… [+1567 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Johnson T A", "title": "Aiming big for 2023 Karnataka polls, JD(S) pins hopes on hung verdict, kingmaker role", "description": "The JD(S)’s key poll strategy is to project itself as a protector of the land, water resources, language and cultural rights of the Karnataka people while portraying the national parties – the ruling BJP and the principal Opposition Congress – as “hurdles” to…", "url": "https://indianexpress.com/article/india/political-pulse/karnataka-polls-jds-pins-hopes-on-hung-verdict-kingmaker-role-7903978/", "urlToImage": "https://images.indianexpress.com/2022/05/JDS.jpg", "publishedAt": "2022-05-06T07:58:56Z", "content": "Despite facing a shrinking vote base, questions over its standing on the political spectrum, and criticism for being largely a family-run outfit, the Janata Dal (Secular), headed by ex-Prime Minister… [+5922 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Tamil Nadu: Children below 5 years to travel for free in govt buses", "description": "At Rs 3 crore, the department is also planning to establish facilities at 16 bus terminuses to display the arrival and location of the bus on a real-time basis.", "url": "https://indianexpress.com/article/cities/chennai/tamil-nadu-children-below-5-free-ticket-govt-buses-7903977/", "urlToImage": "https://images.indianexpress.com/2022/05/TN-Bus.jpg", "publishedAt": "2022-05-06T07:55:55Z", "content": "Tamil Nadu Minister for Transport S S Sivasankar Thursday announced in the Assembly that children below five years of age can travel for free in government buses across the state.The state had earlie… [+1495 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Troops in J&K, Ladakh need to be battle-hardened: Northern Army Commander", "description": "The “eyeball to eyeball’ deployment, ranging from the plains of Jammu to the Siachen Glacier and further to Eastern Ladakh, and the dynamic internal security situation in the Union Territory of Jammu and Kashmir make Northern Command the most unique theatre, …", "url": "https://indianexpress.com/article/india/troops-jk-ladakh-battle-hardened-northern-army-commander-7903968/", "urlToImage": "https://images.indianexpress.com/2022/05/Ladakh-China-1.jpeg", "publishedAt": "2022-05-06T07:55:14Z", "content": "Northern Army Commander Lt General Upendra Dwivedi on Friday said that troops in Jammu Kashmir and Ladakh need to be geared up and battle-hardened to counter the dynamic operational situations and ch… [+3777 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Entertainment Desk", "title": "ভিক্টোরিয়ার সামনে ভাঙের পাঁপড় খেয়ে পুলিশি খপ্পড়ে পড়েন অমিতাভ! শুটের ফাঁকে গল্প অম্বরীশকে", "description": "অমিতাভের স্মৃতিশক্তি দেখে হতবাক 'পটকা' অম্বরীশ.. তারপর?", "url": "https://bengali.indianexpress.com/entertainment/television/once-again-ambarish-bhattacharya-shares-screen-with-amitabh-bachchan/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/05/ambarish.jpg", "publishedAt": "2022-05-06T07:52:27Z", "content": "‘’ ! , \r\n -? ‘ ’ ‘’ , , \r\n ’ , , , “ ! ” ? ’ - “- ”\r\n[ : , , ]\r\n “ ! , !”, , , -\r\n - ! ? , - , \r\n , \r\nStay updated with the latest news headlines and all the latest Television news download Indian Ex… [+98 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Sophie Turner once had a ‘live-in therapist’ to help with her eating disorder", "description": "\"For a long time, I was quite sick with an eating disorder and I had live-in therapist, who would ensure I wasn’t doing anything unhealthy with my eating habits.\"", "url": "https://indianexpress.com/article/lifestyle/life-style/sophie-turner-therapist-eating-disorder-motherhood-mental-health-pregnancy-7902822/", "urlToImage": "https://images.indianexpress.com/2022/05/Sophie-Turner-1200-1.jpg", "publishedAt": "2022-05-06T07:50:26Z", "content": "Sophie Turner is the latest celebrity to have opened up about her struggle with an eating disorder. The Game of Thrones actor, who is expecting her second child with husband Joe Jonas, recently gave … [+2238 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Mahender Singh Manral", "title": "Hours after BJP leader Bagga’s arrest, Delhi Police book Punjab cops for abduction, assault", "description": "A senior officer with the Delhi police said that before arresting Tajinder Bagga from his Delhi residence, the Punjab police did not inform the local cops.", "url": "https://indianexpress.com/article/cities/delhi/hours-after-bjp-leader-baggas-arrest-delhi-police-book-punjab-cops-for-abduction-assault/", "urlToImage": "https://images.indianexpress.com/2022/05/Punjab-Police-Bagga.png", "publishedAt": "2022-05-06T07:49:37Z", "content": "Hours after the Punjab Police arrested BJP spokesperson Tajinder Pal Singh Bagga from his residence in West Delhis Janakpuri, the Delhi Police registered an FIR of abduction, robbery and assault agai… [+3040 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Thief escapes from custody of Chandigarh police near Manesar", "description": "Kumar was arrested for allegedly stealing electric items including an inverter, electric wires, LED lights along with Rs 1.60 lakh cash from his work place at phase-2, Industrial Area, Chandigarh.", "url": "https://indianexpress.com/article/chandigarh/thief-escapes-from-custody-of-chandigarh-police-near-manesar-7903969/", "urlToImage": "https://images.indianexpress.com/2022/05/arerst-1.jpg", "publishedAt": "2022-05-06T07:48:10Z", "content": "A 19-year-old thief identified as Rahul Kumar escaped from the custody of Chandigarh police near Manesar in Gurgaon on Thursday. Kumar was in the custody of three police personnel from Sector 31 poli… [+1069 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Covid-19: India reports 3,545 new cases; active cases drop to 19,688", "description": "Active cases presently comprise 0.05 per cent of total infections, while the national covid recovery rate stands at 98.74 per cent. With 27 more patients succumbing to the deadly disease, the death toll has climbed to 5,24,002.", "url": "https://indianexpress.com/article/india/covid-19-cases-vaccinations-guidelines-updates-7903790/", "urlToImage": "https://images.indianexpress.com/2022/04/Bangalore-covid.jpg", "publishedAt": "2022-05-06T07:45:38Z", "content": "India reported 3,545 new Covid-19 infections in a day, taking the total caseload to 4,30,94,938, while the number of active cases declined to 19,688, according to the latest data released by the Unio… [+1793 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Big relief for 50,000 residents: HC comes to rescue of Dadumajra, seeks action taken report", "description": "Experts have also stated that waste segregation was not the solution for Chandigarh's garbage problems.", "url": "https://indianexpress.com/article/cities/chandigarh/big-relief-for-50000-residents-hc-comes-to-rescue-of-dadumajra-seeks-action-taken-report-7903954/", "urlToImage": "https://images.indianexpress.com/2022/05/cats.jpg", "publishedAt": "2022-05-06T07:36:23Z", "content": "The Punjab and Haryana High Court on Thursday took cognisance of two Public Interest Litigation (PIL)s filed concerning the alleged dumping of waste at Dadumajra that has been causing environmental a… [+3517 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "IPL 2022: RR aim to return to winning ways against inconsistent Punjab", "description": "The Royals were at one point giving Gujarat Titans a strong fight for the top position but the former champions have recently faced minor hiccups.", "url": "https://indianexpress.com/article/sports/ipl/ipl-2022-rr-aim-to-return-to-winning-ways-against-inconsistent-punjab-7903946/", "urlToImage": "https://images.indianexpress.com/2022/04/RR-4.jpg", "publishedAt": "2022-05-06T07:35:47Z", "content": "Rajasthan Royals will look to sort out their batting woes and bring their campaign back on track, while an inconsistent Punjab Kings will be eager to keep the winning momentum going in their IPL game… [+3525 chars]"}]}