{"status": "ok", "totalResults": 387, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Mimansa Shekhar", "title": "Neeraj Pandey recalls how Special OPS hoardings were pulled down, his reaction to A Thursday being called A Wednesday’s sequel", "description": "Filmmaker Neeraj Pandey spoke about helming thrillers, how he puts the onus in the hands of ordinary man in his stories, and his successful collaboration with Akshay Kumar and Taapsee Pannu.", "url": "https://indianexpress.com/article/entertainment/bollywood/neeraj-pandey-making-thrillers-akshay-kumar-taapsee-pannu-baby-special-ops-a-wednesday-7882045/", "urlToImage": "https://images.indianexpress.com/2022/05/neeraj-pandey-a-wednesday-special-ops-1200.jpg", "publishedAt": "2022-05-05T02:35:56Z", "content": "Neeraj Pandey refuses to take credit for the successful thrillers he’s delivered at the box office. “The biggest epics are not thrillers. So it’s not dependent on any genre,” he said.A glance at his … [+3914 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Doctor Strange in the Multiverse of Madness: These three What If… episodes have huge ramifications for Benedict Cumberbatch film", "description": "A few of the alternate-realities that we saw in Marvel Studios' animated series What If...? are coming true in Doctor Strange in the Multiverse of Madness. Here are three episodes of the show that are going to have ramifications for the movie.", "url": "https://indianexpress.com/article/entertainment/hollywood/doctor-strange-in-multiverse-of-madness-what-if-benedict-cumberbatch-7901786/", "urlToImage": "https://images.indianexpress.com/2022/05/doctor-strange-multiverse-of-madness-what-if-1200.jpg", "publishedAt": "2022-05-05T02:35:51Z", "content": "One of the many joys of the Marvel Cinematic Universe is its interconnectedness. This makes for team-ups and crossovers like the Avengers movies, fun stories and amusing callbacks. This quality is wh… [+3582 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sampada Sharma", "title": "From being a fruit juice vendor to becoming the cassette king, Gulshan Kumar’s life was no less than a movie", "description": "On Gulshan Kumar's 66th birth anniversary, here's taking a look back at how a man from humble beginnings changed the way music was distributed in India.", "url": "https://indianexpress.com/article/entertainment/bollywood/gulshan-kumar-went-from-being-a-fruit-juice-vendor-to-becoming-cassette-king-7901162/", "urlToImage": "https://images.indianexpress.com/2022/05/gulshan-kumar-1200.jpg", "publishedAt": "2022-05-05T02:35:43Z", "content": "Way before T-Series was the giant film production company that it is today, it was known as the cassette company that would release imitations of old songs, and would also indulge in re-recording pop… [+3547 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Russia fights for control of Ukraine’s Mariupol stronghold", "description": "Mariupol authorities say some 200 civilians, as well as Ukrainian fighters, are still holed up in a vast network of underground bunkers in the Azovstal steel plant, which has suffered repeated bombardment from encircling Russian troops.", "url": "https://indianexpress.com/article/world/russia-fights-for-control-of-ukraines-mariupol-stronghold-7902101/", "urlToImage": "https://images.indianexpress.com/2022/05/MARIUPOL.jpg", "publishedAt": "2022-05-05T02:34:04Z", "content": "Russian forces battled on Wednesday for control of the last stronghold in Ukraine’s besieged city of Mariupol, Ukrainian officials said, and the European Union proposed tough new sanctions against Mo… [+5498 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "EU takes major step toward Russian oil ban, new sanctions", "description": "European Commission President Ursula von der Leyen, addressing the European Parliament in Strasbourg, France, proposed having EU member nations phase out imports of crude oil within six months and refined products by the end of the year.", "url": "https://indianexpress.com/article/world/eu-takes-major-step-toward-russian-oil-ban-new-sanctions-7902100/", "urlToImage": "https://images.indianexpress.com/2022/05/Ursula-Von-Der.jpg", "publishedAt": "2022-05-05T02:25:46Z", "content": "The European Union’s top official on Wednesday called on the 27-nation bloc to ban oil imports from Russia and target the countrys biggest bank and major broadcasters in a sixth package of sanctions … [+5634 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rahel Philipose, Sonal Gupta", "title": "Daily Briefing: RBI raises key policy rate to tackle inflation; BCCI bans Boria Majumdar over Wriddhiman Saha row", "description": "Uttar Pradesh Deputy Chief Minister Keshav Prasad Maurya said that the drive to remove unauthorised loudspeakers from religious places in the state was conducted “peacefully” and set “an example for the entire country”.", "url": "https://indianexpress.com/article/live-news/top-news-briefing-today-7902087/", "urlToImage": "https://images.indianexpress.com/2022/05/Express-intro-2.jpg", "publishedAt": "2022-05-05T02:02:45Z", "content": "The impact of RBIs rate hike on your money; the ban on journalist Boria Majumdar by BCCI; and how Jodhpur lost its peace here are the top reads from todays edition.\r\nThe Big Story\r\nBringing an end to… [+4738 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kamaldeep Singh Brar", "title": "Viral video shows man openly selling drugs by railway tracks, cops nab seven", "description": "The accused were identified as Pardeep Kumar Jazzy, who was seen in the video selling drugs, and Shivam, Ravi, Deepak, Baljeet Singh, Hira Singh, and Amritpal Singh Jinda, all residents of Faridkot.", "url": "https://indianexpress.com/article/cities/amritsar/viral-video-shows-man-openly-selling-drugs-by-railway-tracks-cops-nab-seven-7902073/", "urlToImage": "https://images.indianexpress.com/2022/05/DRUGS-HEROIN.jpg", "publishedAt": "2022-05-05T01:33:05Z", "content": "Seven drug peddlers were arrested and 300g heroin recovered from them after police Wednesday launched a crackdown soon after a video went viral on social media of addicts crowding near a man openly s… [+1102 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "NHAI seeks probe into compensation granted for land", "description": "The NHAI has contended that an award, under Section 3-A of National Highways Act, 1956, was to be passed with respect to the Memmadpur-\r\nBanur-Kharar (6-lane Greenfield Ambala-Chandigarh Expressway).", "url": "https://indianexpress.com/article/cities/chandigarh/nhai-seeks-probe-into-compensation-granted-for-land-7902069/", "urlToImage": "https://images.indianexpress.com/2022/05/NHAI-1.jpg", "publishedAt": "2022-05-05T01:26:05Z", "content": "The National Highways Authority of India (NHAI) moved the Punjab and Haryana High Court seeking directions to the Punjab government, or any other agency, to probe an ante dated order passed by the th… [+469 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Raakhi Jagga", "title": "Irked by changes in land auction law, Dalit body will gherao Punjab CM’s residence on May 12", "description": "One third of panchayati land was reserved for Dalits for farming for several decades, before new rules were introduced in on March 10 this year.", "url": "https://indianexpress.com/article/cities/ludhiana/irked-by-changes-in-land-auction-law-dalit-body-will-gherao-punjab-cms-residence-on-may-12-7902064/", "urlToImage": "https://images.indianexpress.com/2022/05/GHERAO.jpg", "publishedAt": "2022-05-05T01:25:58Z", "content": "A number of Scheduled Caste (SC) unions of the state have decided to gherao Chief Minister Bhagwant Mann’s Sangrur residence on May 12 to protest against changes made to the policy for 2022-23 auctio… [+4788 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Haryana BJP to launch outreach programme covering 21 lakh families", "description": "In August 2021, the BJP organised 'Tiranga Yatras' in Haryana when the state witnessed farmer agitations over the now-repealed farm laws. These were aimed at “creating a passion for patriotism among youths”, according to the BJP leaders.", "url": "https://indianexpress.com/article/cities/chandigarh/haryana-bjp-to-launch-outreach-programme-covering-21-lakh-families-7902065/", "urlToImage": "https://images.indianexpress.com/2022/05/khattar-1.jpg", "publishedAt": "2022-05-05T01:22:10Z", "content": "To mark eight years of the Narendra Modi government at the Centre, Bharatiya Janata Party (BJP) in Haryana has planned an outreach programme from May 5 (Thursday) which intends to cover 21 lakh famil… [+1755 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Explained Desk", "title": "Bunch of HC pleas that stalled panchayat polls in Haryana", "description": "As it permitted Haryana to hold elections to the Panchayati Raj institutions Wednesday, the Punjab and Haryana High Court made it clear that the polls will be held subject to the outcome of bunch of writ petitions before it.", "url": "https://indianexpress.com/article/explained/explained-bunch-of-hc-pleas-that-stalled-panchayat-polls-7902052/", "urlToImage": "https://images.indianexpress.com/2022/05/punjab-haryana-court.jpg", "publishedAt": "2022-05-05T01:15:57Z", "content": "The term of the village panchayats in Haryana had ended in February, 2021.Although all major political parties across Haryana had been preparing for these polls for over more than 14 months, they wer… [+1508 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "1,500 cops to provide security during Naidu’s PU visit on May 6", "description": "At least 1,500 police personnel drawn from many wings — including security, police stations, traffic —  has been deputed at the university as part of the security of the Vice President, who is also the Chancellor of Panjab University (PU).", "url": "https://indianexpress.com/article/cities/chandigarh/1500-cops-to-provide-security-during-naidus-pu-visit-on-may-6-7902054/", "urlToImage": "https://images.indianexpress.com/2022/05/PANJAB-UNI.jpg", "publishedAt": "2022-05-05T01:11:32Z", "content": "TIGHT SECURITY arrangements have been put in place at Panjab Universitys campus on Wednesday, two days before the visit of Vice President of India, M Venkaiah Naidu for attending the universitys conv… [+1164 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Chandigarh resident clicks on web link, loses over Rs 4 lakh in minutes", "description": "The web link was shared from a mobile number which was later found registered to a fake identity. The person who called Manjinder Singh had introduced himself as a representative of SBI.", "url": "https://indianexpress.com/article/cities/chandigarh/chandigarh-resident-clicks-on-web-link-loses-over-rs-4-lakh-in-minutes-7902050/", "urlToImage": "https://images.indianexpress.com/2022/05/CYBER-CRIME-1.jpg", "publishedAt": "2022-05-05T01:06:59Z", "content": "A SECTOR 32 resident, Manjinder Singh, was cheated of Rs 4.34 lakh minutes after he clicked a web link shared on his cell phone to update Know Your Customer (KYC) details pertaining to his savings ac… [+2166 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Punjab & Haryana HC quashes abduction case against Punjab IGP", "description": "Justice Sangwan after hearing the matter said that allegations were not established as there was no medical record that Cheema was in an inebriated condition.", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-haryana-hc-quashes-abduction-case-against-punjab-igp-7902045/", "urlToImage": "https://images.indianexpress.com/2022/05/gautam-cheema.jpg", "publishedAt": "2022-05-05T01:04:11Z", "content": "The Punjab and Haryana High Court Wednesday quashed the FIR registered against Punjab Police IGP Gautam Cheema, who was booked in an alleged case of abduction, trespassing and criminal conspiracy.The… [+1417 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Punjab: Journalist hit with iron rod, robbed of cash", "description": "The victim Alok Verma, who works in a vernacular daily published from Panchkula, was going home at around 2:30 am. Verma told the police that when he reached near Jamuna Enclave, two bikes started following him.", "url": "https://indianexpress.com/article/cities/sas-nagar-mohali/punjab-journalist-hit-with-iron-rod-robbed-of-cash-7902044/", "urlToImage": "https://images.indianexpress.com/2022/05/ATTACK-FIGHT.jpg", "publishedAt": "2022-05-05T01:02:32Z", "content": "Unknown persons targeted a media person in Zirakpur late on Tuesday night and took away his cash and cell phone, after hitting him with an iron rod on his head.The victim Alok Verma, who works in a v… [+766 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Varinder Bhatia", "title": "Haryana panchayat polls get HC nod, parties gear up for high-stakes battle", "description": "On Wednesday, Dhankar welcomed the decision of the Punjab and Haryana High Court, adding that the panchayat polls will be held in the Haryana soon.", "url": "https://indianexpress.com/article/cities/chandigarh/haryana-panchayat-polls-get-hc-nod-parties-gear-up-for-high-stakes-battle-7902040/", "urlToImage": "https://images.indianexpress.com/2022/05/voting-1200.jpg", "publishedAt": "2022-05-05T00:57:53Z", "content": "Haryana is set to witness a rise in political temperature with the state getting a go-ahead from the Punjab and Haryana High Court to hold the much-delayed panchayat polls. The court’s decision to va… [+4375 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "One arrested for snatching in Nayagaon, two others on run", "description": "Two others allegedly involved in the incident are on the run.", "url": "https://indianexpress.com/article/cities/sas-nagar-mohali/one-arrested-for-snatching-in-nayagaon-two-others-on-run-7902041/", "urlToImage": "https://images.indianexpress.com/2022/05/ARREST-1-2.jpg", "publishedAt": "2022-05-05T00:56:44Z", "content": "Mohali police on Wednesday arrested a man who they said was involved in an incident of snatching that took place near Janta Colony late on Tuesday night.Two others allegedly involved in the incident … [+967 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Selja, Bishnoi, Surjewala missing, Hooda says no factionalism in Congress Haryana unit", "description": "Hooda and Bhan said that unlike Punjab, AAP will not be able to make much foothold in Haryana, where Congress will remain the \"only viable alternative\".", "url": "https://indianexpress.com/article/cities/chandigarh/selja-bishnoi-surjewala-missing-hooda-says-no-factionalism-in-haryana-unit-congress-7902036/", "urlToImage": "https://images.indianexpress.com/2022/05/Bhupinder-Singh-Hooda.jpg", "publishedAt": "2022-05-05T00:51:51Z", "content": "Even as sulking state leaders gave revamped Haryana Congress show of strength a miss, former CM Bhupinder Hooda refuted talk of infighting within the party.You people ask us questions on infighting, … [+2047 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Chandigarh: Man found dead due to suspected drug overdose", "description": "Sabbar was a daily wage labourer, who worked as a plumber and attended to complaints on a daily basis. He had not gone to his house since evening and did not answer the phone calls of his wife, brother and father.", "url": "https://indianexpress.com/article/cities/chandigarh/chandigarh-man-found-dead-due-to-suspected-drug-overdose-7902034/", "urlToImage": "https://images.indianexpress.com/2022/05/indianexpress-logo.jpeg", "publishedAt": "2022-05-05T00:43:01Z", "content": "A 34-YEAR-OLD man was found dead near Burail, Sector 45, under mysterious circumstances, on Wednesday. Police have not ruled out the possibility of drug overdose behind the death, as a used syringe w… [+1029 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Chandigarh: 6.2 mm rain brings down max temperature", "description": "The rain started around 9:25 am and stopped after a brief period. In the afternoon, the city received denser rain.", "url": "https://indianexpress.com/article/cities/chandigarh/chandigarh-6-2-mm-rain-brings-down-max-temperature-7902032/", "urlToImage": "https://images.indianexpress.com/2022/05/rain.jpg", "publishedAt": "2022-05-05T00:37:20Z", "content": "CHANDIGARH RECEIVED the highest rainfall of this season, at 6.2 mm, bringing the maximum temperature to 33.3 degrees Celsius, four degrees below normal, on Wednesday. The wind with a speed of 40-50 k… [+563 chars]"}]}