{"status": "ok", "totalResults": 329, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Haryana govt forms new backward classes panel", "description": "Mukul Kumar, Special Secretary, Scheduled Castes and Backward Classes Welfare Department, has been nominated as Member Secretary.", "url": "https://indianexpress.com/article/cities/chandigarh/haryana-forms-new-backward-classes-panel-8027938/", "urlToImage": "https://indianexpress.com/wp-content/themes/indianexpress/images/IE-OGimage.jpg", "publishedAt": "2022-07-14T02:13:55Z", "content": "Following the announcement made by CM Manohar Lal Khattar, the Haryana government on Wednesday constituted the Haryana Backward Classes Commission afresh in exercise of the powers conferred by sub-se… [+1178 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Tamil Nadu: Mettur dam crosses 105 feet, more rains likely to raise water level", "description": "The full reservoir level in the dam, also known as Stanley Reservoir, is at 120 feet. The water level is likely to increase by another two feet late in the night, as inflow is increasing fast throughout the day.", "url": "https://indianexpress.com/article/cities/chennai/tamil-nadu-mettur-dam-crosses-105-feet-more-rains-likely-to-raise-water-level-8027899/", "urlToImage": "https://images.indianexpress.com/2022/07/Mettur.jpeg", "publishedAt": "2022-07-14T02:00:15Z", "content": "As the catchment areas of Cauvery river in neighbouring Karnataka are receiving heavy rains, the water level in Mettur dam in Salem district breached the 105 feet mark on Wednesday.The full reservoir… [+916 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "No reason for Punjab to oppose Vidhan Sabha land in Chandigarh, says BJP’s Capt Abhimanyu", "description": "Currently, Haryana and Punjab have their respective Vidhan Sabhas in the same complex in Chandigarh. Haryana has been demanding a separate Vidhan Sabha citing that the number of Assembly constituencies may go up to 126 by 2029.", "url": "https://indianexpress.com/article/cities/chandigarh/no-reason-for-punjab-to-oppose-vidhan-sabha-land-in-chandigarh-says-bjps-capt-abhimanyu-8027911/", "urlToImage": "https://images.indianexpress.com/2022/07/capt-abhimanyu.jpg", "publishedAt": "2022-07-14T01:41:06Z", "content": "Senior BJP leader Captain Abhimanyu on Wednesday said that there should not be any reason for political leaders of Punjab to oppose allotment of land to Haryana for an additional Vidhan Sabha buildin… [+3125 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Madras HC issues contempt notice against education dept officials", "description": "As the first bench in its common order dated February 13, 2020 had categorically held that the contempt petitioners were entitled to UGC scales of pay, the present bench said the college was bound to comply with the same.", "url": "https://indianexpress.com/article/cities/chennai/madras-hc-issues-contempt-notice-against-education-dept-officials-8027880/", "urlToImage": "https://images.indianexpress.com/2022/07/Madras-HC-2-3-1-3.jpg", "publishedAt": "2022-07-14T01:15:31Z", "content": "The Madras High Court has ordered issuance of notice to the officials of the Tamil Nadu Education department and the head of a college in Tiruppur district for not complying with its earlier orders.T… [+1076 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "After Chandigarh tree accident: Mohali MC yet to start drive to cut dead trees, lacks exact number", "description": "Mohali has around 70,000 green trees as well but in old parts of the city there are some dead trees which are posing danger to the lives of the people. These areas include Phase V, Phase 3B2, Phase 3A, Phase IV and Phase II.", "url": "https://indianexpress.com/article/cities/sas-nagar-mohali/chandigarh-school-accident-carmel-convent-dead-trees-mohali-municipal-corporation-8027878/", "urlToImage": "https://images.indianexpress.com/2022/07/tree-cutting-express.jpg", "publishedAt": "2022-07-14T01:03:07Z", "content": "After a girl’s death due to falling off of a tree in Chandigarh, the Mohali Municipal Corporation had claimed to start a drive to cut dead trees in the city. But the civic body does not have the numb… [+1823 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Ritika Chopra", "title": "Explained: When parties claim same symbol", "description": "Shinde, who has claimed to be the “original” Shiv Sena on the basis of the support of more than two-thirds of the party's legislators in the Maharashtra Assembly, has not officially written to the EC yet to stake claim to the party symbol.", "url": "https://indianexpress.com/article/explained/explained-when-parties-claim-same-symbol-8027687/", "urlToImage": "https://images.indianexpress.com/2022/07/Exp-Lead-thackeray.jpg", "publishedAt": "2022-07-13T22:28:58Z", "content": "On Monday, the Uddhav Thackeray-led Shiv Sena approached the Election Commission of India, requesting it to hear its side before deciding claims to the party’s bow-arrow symbol. The Shiv Sena has los… [+5919 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "July 14, 1982, Forty Years Ago: Congress dissidents", "description": "Hordes of Congress (I) dissidents from Maharashtra, Andhra Pradesh, Gujarat and Madhya Pradesh arrived in the capital adding to the worries of Prime Minister Indira Gandhi, who is yet to find a new chief minister for Uttar Pradesh.", "url": "https://indianexpress.com/article/opinion/editorials/forty-years-ago-congress-dissidents-8027639/", "urlToImage": "https://images.indianexpress.com/2022/07/14-Jul-1982_IE_001.jpg", "publishedAt": "2022-07-13T22:22:45Z", "content": "Hordes of Congress (I) dissidents from Maharashtra, Andhra Pradesh, Gujarat and Madhya Pradesh arrived in the capital adding to the worries of Prime Minister Indira Gandhi, who is yet to find a new c… [+1691 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shubhajit Roy", "title": "In Gota ‘Palace’: Awestruck families, volunteer guards", "description": "When The Indian Express walked in, Gehan Melroy, 30, headed to a beige sofa, where Gotabaya once relaxed, to watch a flat-screen television.", "url": "https://indianexpress.com/article/world/in-gota-palace-awestruck-families-volunteer-guards-8027744/", "urlToImage": "https://images.indianexpress.com/2022/07/Inside-the-Presidents-residence.-Shubhajit-Roy-1.jpg", "publishedAt": "2022-07-13T22:20:50Z", "content": "Wearing a T-shirt with an I need wifi scrawl, 13-year-old Nishang roams the living room of the Presidents Palace, home to Gotabaya Rajapaksa who fled Sri Lanka in the early hours of Wednesday.The boy… [+5051 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuradha Mascarenhas", "title": "What India’s first HPV vaccine could mean for fight against cervical cancer", "description": "Cervical cancer is a common sexually transmitted infection. Long-lasting infection with certain types of HPV is the main cause of cervical cancer.", "url": "https://indianexpress.com/article/explained/what-indias-first-hpv-vaccine-could-mean-for-fight-against-cervical-cancer-8027690/", "urlToImage": "https://images.indianexpress.com/2022/07/vaccine-4.jpg", "publishedAt": "2022-07-13T22:20:45Z", "content": "The Serum Institute of India (SII)’s vaccine Cervavac recently received the Drugs Controller General of India’s (DGCI) approval for market authorisation. Cervavac is India’s first quadrivalent human … [+4889 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Flooding in low-lying areas, massive traffic jams hit Mumbai", "description": "The Mumbai civic body stated that downpour and the high tide with waves reaching up to 4.68 metres on Wednesday afternoon led to flooding at chronic flooding spots in the suburbs and the island city.", "url": "https://indianexpress.com/article/cities/mumbai/flooding-in-low-lying-areas-massive-traffic-jams-hit-mumbai-8027796/", "urlToImage": "https://images.indianexpress.com/2022/07/andheri-3col.jpg", "publishedAt": "2022-07-13T21:16:01Z", "content": "Heavy rain, coupled with high tide and gusty winds, led to uncommon flooding in pockets of South Mumbai on Wednesday. Taraporewala Aquarium in Marine Drive, Haji Ali junction and Peddar Road witnesse… [+1511 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Avoid keeping ‘dangerous breeds’ as pets: Civic body day after pet dog mauls woman to death", "description": "The statement added that pet owners with bigger dogs should not “bother them while they are eating their meals” and that “meat should be avoided in their meals.”", "url": "https://indianexpress.com/article/cities/lucknow/avoid-keeping-dangerous-breeds-as-pets-civic-body-day-after-pet-dog-mauls-woman-to-death-8027788/", "urlToImage": "https://images.indianexpress.com/2022/07/lmc.jpg", "publishedAt": "2022-07-13T20:53:37Z", "content": "A DAY after an 82-year-old woman was mauled to death by her familys pet American Pit Bull Terrier dog, the Lucknow Municipal Corporation (LMC) on Wednesday appealed to local residents to avoid keepin… [+865 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi Confidential: Role Call", "description": "Will senior Congress leader Ghulam Nabi Azad be the joint Opposition candidate for the post of Vice President? Well, some Opposition parties are not averse to the idea.", "url": "https://indianexpress.com/article/delhi-confidential/delhi-confidential-role-call-8027779/", "urlToImage": "https://images.indianexpress.com/2022/07/Ghulam-Nabi-Azad-confidential.jpg", "publishedAt": "2022-07-13T20:41:04Z", "content": "Will senior Congress leader Ghulam Nabi Azad be the joint Opposition candidate for the post of Vice President? Well, some Opposition parties are not averse to the idea. But the Congress has not yet r… [+2060 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Man who ‘ran over’ cashier was driving BMW owned by client", "description": "Police said Jain deals in spare parts of luxury cars and was allegedly on a “joy ride” with his brother and a friend when he hit Ranjan, who was walking on side of the road.", "url": "https://indianexpress.com/article/cities/delhi/man-who-ran-over-cashier-was-driving-bmw-owned-by-client-8027739/", "urlToImage": "https://images.indianexpress.com/2022/07/club-owner-1.jpg", "publishedAt": "2022-07-13T20:34:36Z", "content": "Days after Ranjan Kumar, a cashier at a club in East of Kailash, was allegedly mowed down by a man driving a BMW vehicle, police Wednesday arrested 23-year-old Shubham Jain and recovered the damaged … [+1402 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Post RBI easing norms, banks hike foreign currency deposit rates", "description": "The RBI had last week temporarily allowed banks to raise fresh FCNR(B) and NRE deposits from NRIs without reference to the current regulations on interest rates, with effect from July 7, 2022.", "url": "https://indianexpress.com/article/business/banking-and-finance/post-rbi-easing-norms-banks-hike-foreign-currency-deposit-rates-8027753/", "urlToImage": "https://images.indianexpress.com/2022/07/money-3-1.jpg", "publishedAt": "2022-07-13T19:59:30Z", "content": "Banks have started hiking interest rates on foreign currency deposits following the Reserve Bank’s decision to relax norms to shore up forex inflows. SBI, ICICI Bank, HDFC Bank and IDFC First Bank ha… [+2627 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Woman booked on charge of extortion after BJP leader claims he was ‘honey-trapped’", "description": "In the 25-second video which went viral on social media, the woman is heard saying, “This man Shrikant Deshmukh has cheated me. He has a wife and is also in a relationship with me. I will show you. Why did you lie to me?”", "url": "https://indianexpress.com/article/cities/mumbai/woman-booked-on-charge-of-extortion-after-bjp-leader-claims-he-was-honey-trapped-8027714/", "urlToImage": "https://images.indianexpress.com/2022/07/mumbai-police-1-2-1-2.jpg", "publishedAt": "2022-07-13T19:08:42Z", "content": "The Oshiwara police last week registered an extortion case on the basis of a complaint from a 52-year-old BJP leader from Solapur, who alleged that he was honey-trapped by a woman. According to the c… [+1827 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Omkar Gokhale", "title": "Bombay HC lets mother take her minor daughter to Poland: ‘Can’t be asked to choose between child & career’", "description": "The court said the woman had the \"important right to development\" and directed her estranged husband to give his no-objection stipulated in law, so that her daughter could avail the visa for Poland.", "url": "https://indianexpress.com/article/cities/mumbai/bombay-hc-lets-mother-take-her-minor-daughter-to-poland-cant-be-asked-to-choose-between-child-career-8027706/", "urlToImage": "https://images.indianexpress.com/2022/07/bombay-high-court-1200-3.jpg", "publishedAt": "2022-07-13T19:05:05Z", "content": "Observing that a “woman cannot be asked to choose between her child and career,” the Bombay High Court on Wednesday set aside a Family Court order that restrained a woman, a Pune resident, from takin… [+3483 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "MP man loses sarpanch elections, booked for threatening people to return money", "description": "The FIR came in the wake of a purported video surfaced on social media, in which Dayma is seen asking people to return his money following his loss.", "url": "https://indianexpress.com/article/cities/bhopal/mp-man-loses-sarpanch-elections-booked-for-threatening-people-to-return-money-8027703/", "urlToImage": "https://images.indianexpress.com/2022/07/cop-2-1-1.jpg", "publishedAt": "2022-07-13T18:55:18Z", "content": "A candidate contesting for the post of sarpanch in Devran village in Manasa tehsil of Madhya Pradesh’s Neemuch district was booked for allegedly threatening people to return his money after he lost t… [+1118 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "U.S. successfully tested Lockheed hypersonic missile this week: Report", "description": "Hypersonic weapons travel in the upper atmosphere at speeds of more than five times the speed of sound, or about 6,200 km (3,853 miles) per hour.", "url": "https://indianexpress.com/article/world/u-s-successfully-tested-lockheed-hypersonic-missile-this-week-report-8027700/", "urlToImage": "https://images.indianexpress.com/2022/07/US-Air-force-2.jpg", "publishedAt": "2022-07-13T18:54:21Z", "content": "The U.S. Air Force successfully tested a Lockheed Martin Corp hypersonic missile this week, sources familiar with the efforts said on Wednesday, amid growing concerns Russia and China have had more s… [+1989 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "If elected president, will ensure CAA is not implemented: Yashwant Sinha", "description": "Interacting with opposition lawmakers of Assam, Sinha said the BJP-led government has not been able to implement the CAA so far as it was \"foolishly drafted\" in a hurry.", "url": "https://indianexpress.com/article/india/if-elected-president-will-ensure-caa-is-not-implemented-yashwant-sinha-8027672/", "urlToImage": "https://images.indianexpress.com/2022/07/Yashwant-Sinha.jpg", "publishedAt": "2022-07-13T17:56:00Z", "content": "Opposition presidential candidate Yashwant Sinha on Wednesday said that if he is elected, he will ensure that the Citizenship Amendment Act (CAA) is not implemented.Interacting with opposition lawmak… [+2434 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Potholed roads caused by incessant rainfall compound commuters’ woes", "description": "The stretch falls in the constituency of Chief Minister Eknath Shinde, who is also the MLA from Thane and the guardian minister. His son Shrikant Shinde is an MP from Bhiwandi.", "url": "https://indianexpress.com/article/cities/mumbai/potholed-roads-caused-by-incessant-rainfall-compound-commuters-woes-8027668/", "urlToImage": "https://images.indianexpress.com/2022/07/mumbi-potholes-1.jpg", "publishedAt": "2022-07-13T17:47:14Z", "content": "Over the last few days, commuters using the Mumbai Nashik Expressway and Bhiwandi Bypass have had to face a harrowing time due to frequent traffic jams caused by the increasing number of potholes tha… [+2535 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sanjana Bhalerao", "title": "July rainfall nears 1,000 mm mark in Mumbai; extremely heavy rain forecast in Maharashtra", "description": "More rainfall is in store for the Konkan region (including Mumbai) and the adjoining areas of Madhya Maharashtra as the weather bureau has issued an orange alert till July 14, after which rains are expected to ease.", "url": "https://indianexpress.com/article/cities/mumbai/july-rainfall-nears-1000-mm-mark-in-mumbai-extremely-heavy-rain-forecast-in-maharashtra-8027654/", "urlToImage": "https://images.indianexpress.com/2022/07/mumbai-rains-amit-chakravarty-2.jpg", "publishedAt": "2022-07-13T17:43:26Z", "content": "With the heavy downpour in Mumbai, the July rainfall is nearing the 1,000 mm mark. Mumbai, which has continuously recorded rainfall since July 1, has received 952 mm of rainfall till Wednesday evenin… [+2655 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Shinde pays tribute to Bal Thackeray and Anand Dighe", "description": "Talking to mediapersons in Mumbai, Shinde said that a common man like him could assume the top post in the state because of the blessings of Bal Thackeray, and his government is committed to all-round development of the state.", "url": "https://indianexpress.com/article/cities/mumbai/shinde-pays-tribute-to-bal-thackeray-and-anand-dighe-8027646/", "urlToImage": "https://images.indianexpress.com/2022/07/Eknath-Shinde-1-4.jpg", "publishedAt": "2022-07-13T17:36:10Z", "content": "CHIEF Minister Eknath Shinde on Wednesday visited Shiv Sena founder Bal Thackeray’s memorial on the occasion of Guru Purnima in Mumbai and paid floral tributes, before heading to Thane where he also … [+1094 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Arundhati Katju", "title": "Roe vs Wade: Myth of the ideologically neutral judge", "description": "Arundhati Katju writes: The overturning of Roe v. Wade is a case study showing how the design of constitutional institutions has real political outcomes.", "url": "https://indianexpress.com/article/opinion/columns/roe-vs-wade-myth-of-the-ideologically-neutral-judge-8027438/", "urlToImage": "https://images.indianexpress.com/2022/07/ABORTION-1-1-2.jpeg", "publishedAt": "2022-07-13T17:23:30Z", "content": "Forty-nine years ago, in 1973, the United States Supreme Court passed Roe v. Wade, recognising that the US constitution protects a right to obtain an abortion. Then and now, abortion remains a politi… [+5232 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Vandana Kalra", "title": "Priyanka Chopra’s New York restaurant now has blue-chip art on sale", "description": "Presented in collaboration with DAG, Sona has on display vibrant works from some of India’s most celebrated artists.", "url": "https://indianexpress.com/article/lifestyle/art-and-culture/priyanka-chopras-new-york-restaurant-sona-blue-chip-art-dag-8027581/", "urlToImage": "https://images.indianexpress.com/2022/07/1L3A1703.jpg", "publishedAt": "2022-07-13T17:13:38Z", "content": "A stylish space in New York’s upmarket neighbourhood of Gramercy, actor Priyanka Chopra-owned restaurant Sona will now also showcase 20th century modern Indian art by some of the most recognised name… [+2031 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Navjeevan Gopal", "title": "Navjot Singh Sidhu complains of ‘misuse of canteen card’, fellow inmate shifted out of barracks", "description": "Navjot Singh Sidhu, who is serving a one-year term of rigorous imprisonment, used to handover his card to two inmates to buy fruits for him, his wife Dr Navjot Kaur informed.", "url": "https://indianexpress.com/article/cities/chandigarh/navjot-singh-sidhu-complains-misuse-canteen-card-fellow-inmate-shifted-barracks-8027605/", "urlToImage": "https://images.indianexpress.com/2022/07/sidhu.jpg", "publishedAt": "2022-07-13T16:49:48Z", "content": "There was a reshuffle in the barracks of the Patiala Central Jail where former Punjab Pradesh Congress Committee (PPCC) chief Navjot Singh Sidhu is lodged after the cricketer-turned-politician report… [+3219 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Neetu Chandra says she was offered Rs 25 Lakh to become a businessman’s ‘salaried wife’", "description": "Actor Neetu Chandra made a mark after appearing in films like Garam Masala and Oye Lucky Lucky Oye.", "url": "https://indianexpress.com/article/entertainment/bollywood/neetu-chandra-says-she-was-offered-rs-25-lakh-to-become-a-businessmans-salaried-wife-8027564/", "urlToImage": "https://images.indianexpress.com/2022/07/neetu-chandra.jpg", "publishedAt": "2022-07-13T16:36:43Z", "content": "Actor Neetu Chandra, who has worked in films like Garam Masala and Oye Lucky Lucky Oye, recently said that she was offered Rs 25 lakh to become a businessmans salaried wife. In a chat with Bollywood … [+1573 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Amber Heard faces high legal hurdles seeking to reverse Johnny Depp’s win", "description": "In a recent development on the Amber Heard-Johnny Depp row, Heard's lawyers have filed a 51-page motion asking the judge to set aside the jury's verdict.", "url": "https://indianexpress.com/article/entertainment/hollywood/amber-heard-johnny-depp-new-motion-legal-hurdles-seeking-to-reverse-verdict-8027352/", "urlToImage": "https://images.indianexpress.com/2022/07/amber-heard-johnny-depp-1200.jpeg", "publishedAt": "2022-07-13T15:26:34Z", "content": "The Johnny Depp-Amber Heard libel trial, which generated intense interest for two months earlier this year as a livestreamed, no-holds-barred soap opera featuring one of Hollywoods biggest stars, is … [+5327 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rahul Pandey", "title": "Cricket taking football route: Bilaterals to be friendly, World Cups real deal", "description": "Shastri has been one of many to propose the idea of domestic and franchise T20 leagues occupying majority of cricket’s action in the annual calendar with international cricket being largely about major tournaments.", "url": "https://indianexpress.com/article/sports/cricket/cricket-taking-football-route-bilaterals-to-be-friendly-world-cups-real-deal-8027487/", "urlToImage": "https://images.indianexpress.com/2022/07/T20-Shastri.jpg", "publishedAt": "2022-07-13T15:26:07Z", "content": "It (cricket) should go the football way, where, in T20 cricket, you just play the World Cup. Bilateral tournaments no one remembers.Former India player-turned-broadcaster-turned-coach-turned-broadcas… [+3221 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Director Ayesha Sood on Indian Predator The Butcher of Delhi: ‘It is an important story to tell’", "description": "Ayesha Sood said many layers and threads kept unraveling during her research for Netflix docu-series, Indian Predator: The Butcher of Delhi.", "url": "https://indianexpress.com/article/entertainment/web-series/director-ayesha-sood-on-indian-predator-the-butcher-of-delhi-it-is-an-important-story-to-tell-8027354/", "urlToImage": "https://images.indianexpress.com/2022/07/indian-predator-ayesha-sood-1200.jpg", "publishedAt": "2022-07-13T14:54:58Z", "content": "Director Ayesha Sood on Wednesday said she was intrigued by the story of Netflixs Indian Predator: The Butcher of Delhi. The true-crime docuseries traces a serial killer who ruthlessly dismembered hi… [+1241 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Abhinav Kumar", "title": "On Gujarat 2002, the wheel has come full circle", "description": "Abhinav Kumar writes: Cynical activists, in pursuit of their political objectives, didn't think twice about unfairly crucifying the police and intelligence community", "url": "https://indianexpress.com/article/opinion/columns/on-gujarat-2002-the-wheel-has-come-full-circle-8027420/", "urlToImage": "https://images.indianexpress.com/2022/07/PTI06_27_2022_000154B.jpg", "publishedAt": "2022-07-13T14:50:20Z", "content": "I don’t know whether to laugh or cry at the outpouring of concern and outrage over the arrest of Teesta Setalvad. I wish a similar sense of anguish was felt for our own Rajendra Kumar, then, joint di… [+5362 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "New air pollution combat plan being firmed up in Delhi", "description": "Suggested revisions to the GRAP, which was notified in 2017, including taking action based on the air quality index (AQI) and not the existing system of response that kicks in based on particulate matter concentrations.", "url": "https://indianexpress.com/article/cities/delhi/new-air-pollution-combat-plan-being-firmed-up-in-delhi-8027456/", "urlToImage": "https://images.indianexpress.com/2021/12/delhi-pollution-12.jpg", "publishedAt": "2022-07-13T14:49:28Z", "content": "The Graded Response Action Plan (GRAP), which sets in with emergency measures when air quality worsens in Delhi, is likely to be revised. A policy prepared by the Commission for Air Quality Managemen… [+3888 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Sara Ali Khan says she gave ‘beep’ worthy content on Koffee with Karan 7, watch fun video", "description": "In a candid video, Sara Ali Khan talks about her experience on Koffee with Karan 7, and also shows off her shayari skills.", "url": "https://indianexpress.com/article/entertainment/web-series/sara-ali-khan-says-she-gave-beep-worthy-content-on-koffee-with-karan-7-watch-fun-video-8027061/", "urlToImage": "https://images.indianexpress.com/2022/07/sara-ali-khan-koffee-with-karan-7.jpg", "publishedAt": "2022-07-13T14:49:05Z", "content": "After a crackling episode with Alia Bhatt and Ranveer Singh, Karan Johar is set to host Janhvi Kapoor and Sara Ali Khan on Koffee with Karan 7. The second episode of the controversial chat show will … [+1161 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Our politicians have mismanaged country, democracy needs to return in Lanka: Sanath Jayasuriya", "description": "Jayasuriya is hopeful that very soon democracy will return and things will slowly become normal in the long run.", "url": "https://indianexpress.com/article/sports/cricket/politicians-mismanaged-democracy-needs-to-return-in-lanka-sanath-jayasuriya-8027453/", "urlToImage": "https://images.indianexpress.com/2022/07/sanath-jayasuriya.jpg", "publishedAt": "2022-07-13T14:36:42Z", "content": "Sanath Jayasuriya is both “angry” and “sad” to witness his beloved Sri Lanka grapple with enormous financial crisis and civil unrest but the former cricketer is expecting that democracy will soon be … [+3213 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi riots ‘hate speech’: HC adds political leaders, activists as respondents in cases seeking action against them", "description": "In a first step towards the start of hearing of arguments in the cases, which have been pending since 2020, the division bench of Justice Siddharth Mridul and Justice Amit Sharma also granted the respondents the liberty to respond within a week to the allegat…", "url": "https://indianexpress.com/article/cities/delhi/delhi-riots-hate-speech-hc-political-leaders-activists-respondents-cases-seeking-action-against-them-8027460/", "urlToImage": "https://images.indianexpress.com/2022/07/Delhi-HC-4-1.jpg", "publishedAt": "2022-07-13T14:34:25Z", "content": "The Delhi High Court Wednesday added several political leaders and activists, including Congress leaders Sonia Gandhi, Rahul Gandhi, Priyanka Gandhi and Union minister Anurag Thakur as respondents in… [+2584 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "To usher in the new President, ‘Mr Ballot Box’ takes a flight", "description": "Once the ballot boxes reach the state capitals, these are stored in previously sanitised and properly sealed \"strong rooms\" that are strictly monitored through cameras.", "url": "https://indianexpress.com/article/political-pulse/presidential-election-ballot-box-journey-election-commission-8027320/", "urlToImage": "https://images.indianexpress.com/2022/07/mr-ballot-box22.jpg", "publishedAt": "2022-07-13T14:30:45Z", "content": "Six days to go for the presidential election, the ballot boxes have begun their journey. On Tuesday, after the customary handing over, the boxes were taken by the designated officers to states. One s… [+2384 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sohini Ghosh", "title": "Sanjiv Bhatt remanded in police custody for 7 days", "description": "A Special Investigation Team (SIT), formed under the Detection of Crime Branch Ahmedabad, where the FIR was lodged on June 25, had sought 14 days police remand.", "url": "https://indianexpress.com/article/cities/ahmedabad/sanjiv-bhatt-remanded-in-police-custody-for-7-days-8027434/", "urlToImage": "https://images.indianexpress.com/2022/07/sanjeev-bhatt-cover.jpg", "publishedAt": "2022-07-13T14:30:23Z", "content": "An additional magisterial court of Ahmedabad on Wednesday remandedformer IPS officer Sanjiv Bhattaccused of forgery, conspiracy and other charges in seven-day police custody.A Special Investigation T… [+3119 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Jessica Simpson criticised for giving daughter a pacifier; expert on its usage and effect on babies", "description": "\"The best way to wean the babies off a pacifier is to get them engaged in other activities,\" said Dr Nidhi Mishra, consultant-pediatrician", "url": "https://indianexpress.com/article/lifestyle/health/jessica-simpson-mom-shamed-birdie-pacifier-expert-comment-8027066/", "urlToImage": "https://images.indianexpress.com/2022/07/Jessica1200.jpg", "publishedAt": "2022-07-13T14:30:00Z", "content": "Despite being an extremely personal thing, many women are judged for their parenting decisions. It is even more challenging for celebrities, who are constantly under public scrutiny.Buy Now | Our bes… [+2360 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Sony to launch high-end Venice 2 cinema camera in India", "description": "The Sony Venice 2 camera will launch in India with two sensor options: a new full-frame 8.6k sensor or the original 6k Venice sensor.", "url": "https://indianexpress.com/article/technology/gadgets/sony-venice-2-india-launch-price-details-8027442/", "urlToImage": "https://images.indianexpress.com/2022/07/Sony-Venice-2-launched-India-1.jpg", "publishedAt": "2022-07-13T14:25:09Z", "content": "Sony has announced that its high-end flagship full-frame cinema camera, Venice 2 will be available in India starting July 18. The Venice 2 will come with an option for two sensors; either a new full-… [+2299 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Bengaluru: Activists accuse BBMP of constructing building in buffer zone of Gangashetty lake", "description": "Commenting on the issue, BBMP chief engineer (lakes) Mohan Krishna said, “I got to know about the issue and we are looking into it.", "url": "https://indianexpress.com/article/india/bengaluru-activists-accuse-bbmp-of-constructing-building-in-buffer-zone-of-gangashetty-lake-8027432/", "urlToImage": "https://images.indianexpress.com/2022/07/BBMP.jpg", "publishedAt": "2022-07-13T14:23:23Z", "content": "Environmental activists have accused the Bruhat Bengaluru Mahanagara Palike (BBMP) of violating buffer zone regulations by constructing a building (Samudaya Bhavan) in the vicinity of Gangashetty lak… [+1443 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Bengaluru: Activists accuse BBMP of constructing building in buffer zone of Gangashetty lake", "description": "Commenting on the issue, BBMP chief engineer (lakes) Mohan Krishna said, “I got to know about the issue and we are looking into it.", "url": "https://indianexpress.com/article/cities/bangalore/bengaluru-activists-accuse-bbmp-of-constructing-building-in-buffer-zone-of-gangashetty-lake-8027432/", "urlToImage": "https://images.indianexpress.com/2022/07/BBMP.jpg", "publishedAt": "2022-07-13T14:23:23Z", "content": "Environmental activists have accused the Bruhat Bengaluru Mahanagara Palike (BBMP) of violating buffer zone regulations by constructing a building (Samudaya Bhavan) in the vicinity of Gangashetty lak… [+1443 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "Deadly waves sweep away 5 persons at Oman beach, video triggers debate on craze for ‘likes’", "description": "A video that has gone viral shows three young females posing on rocky shores of Oman’s Salalah Al Mughsail beach for photographs despite violent waves.", "url": "https://indianexpress.com/article/trending/trending-globally/deadly-waves-sweep-away-5-persons-at-oman-beach-video-8027407/", "urlToImage": "https://images.indianexpress.com/2022/07/oman-waves-video.jpg", "publishedAt": "2022-07-13T14:17:42Z", "content": "A holiday at a beach in Omans Salalah turned into a tragedy for an expat Indian family, when strong waves swept away eight persons from the shore. The jaw-dropping moment caught on camera has taken s… [+3235 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "NEET UG 2022: HC to hear plea seeking postponement of exam", "description": "In the petition filed by aspirants, the court has been asked to direct the National Testing Agency (NTA) to issue a fresh notification to reschedule the examination after considering the grievances of the candidates.", "url": "https://indianexpress.com/article/india/neet-ug-2022-hc-to-hear-plea-seeking-postponement-of-exam-8027424/", "urlToImage": "https://images.indianexpress.com/2022/07/Delhi-HC-4.jpg", "publishedAt": "2022-07-13T14:15:54Z", "content": "The Delhi High Court will Thursday hear a petition seeking postponement of the NEET undergraduate 2022 examination, which is scheduled to be held on July 17.A mentioning for urgent listing of the cas… [+1480 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Mallika Sherawat: What Deepika Padukone did in Gehraiyaan, I did that 15 years ago", "description": "Mallika Sherawat speaks about facing 'mental torture' as people only focused on her glamour and body and never her acting skills.", "url": "https://indianexpress.com/article/entertainment/bollywood/mallika-sherawat-what-deepika-padukone-did-in-gehraiyaan-i-did-that-15-years-ago-8027389/", "urlToImage": "https://images.indianexpress.com/2022/07/deepika-padukone-mallika-sherawat.jpg", "publishedAt": "2022-07-13T14:14:30Z", "content": "Mallika Sherawat is set to be back on screen with RK/RKay. While promoting the film, the actor shared how a section of the industry always spoke about her body and glamour but never her acting. She a… [+1535 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sandip G", "title": "Shami the forgotten white-ball virtuoso returns to ODIs after a 591-day gap to become the fastest Indian to 150 wickets", "description": "Apart from his dreamy seam presentation, Shami uses the bouncers, heavy ball, variation in lengths smarter than most and as he showed in the last IPL, he will be key bowler for India in the T20 world cup.", "url": "https://indianexpress.com/article/sports/cricket/shami-the-forgotten-white-ball-virtuoso-returns-to-odi-150-wickets-8027345/", "urlToImage": "https://images.indianexpress.com/2022/07/Shami-2022.jpg", "publishedAt": "2022-07-13T14:12:46Z", "content": "There was an uncharacteristic restlessness about Mohammed Shami at the Oval on Tuesday. He fidgeted in the solitude of his long-leg outpost, tugging at his sleeves, fiddling with the cap and the shad… [+7672 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "MAYURA JANWALKAR", "title": "Digambar Kamat: ‘Don’t know why Congress is seeking my disqualification. It may make some people happy if I exit the party. I have no such intention’", "description": "Digambar Kamat has now been accused by his own party of allegedly plotting with new entrant Michael Lobo and the ruling BJP to engineer the defection of eight of its 11 MLAs.", "url": "https://indianexpress.com/article/political-pulse/digambar-kamat-disqualification-congress-goa-assembly-bjp-michael-lobo-8027405/", "urlToImage": "https://images.indianexpress.com/2022/07/Digambar-Kamat-2.jpg", "publishedAt": "2022-07-13T14:11:20Z", "content": "Five months after he led the Congress’s campaign for the Goa Assembly polls, the Congress Working Committee (CWC)’s permanent member and ex-chief minister, Digambar Kamat, has now been accused by his… [+4583 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "In pictures: Farmers in Udupi return to work after heavy rains inundate paddy fields", "description": "Owing to a cyclonic circulation over the northwest and adjoining westcentral Bay of Bengal, the Western Ghats have been experiencing heavy rainfall. As a result, Udupi received heavy rainfall, which inundated the paddy fields in Udupi.", "url": "https://indianexpress.com/article/cities/bangalore/udupi-farmers-brave-rain-paddy-produce-8026175/", "urlToImage": "https://images.indianexpress.com/2022/07/udupi-farm-lands-4.jpeg", "publishedAt": "2022-07-13T14:07:19Z", "content": "Karnatakas coastal districts of Dakshina Kannada and Udupi have been receiving heavy rainfall in the past few days, submerging low-lying areas and buildings and throwing normal life out of gear.Howev… [+2309 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Cordelia drugs case: Court allows Aryan Khan to get back his passport, cancels bail bond", "description": "The special Narcotic Drugs and Psychotropic Substance Act court noted that bail bonds of Aryan Khan, son of actor Shah Rukh Khan, stand cancelled and his surety stands discharged", "url": "https://indianexpress.com/article/cities/mumbai/cordelia-drugs-case-court-allows-aryan-khan-to-get-back-his-passport-cancels-bail-bond-8027408/", "urlToImage": "https://images.indianexpress.com/2022/07/Gs08Gs07AryaanKhan01-1.jpeg", "publishedAt": "2022-07-13T14:04:21Z", "content": "The special Narcotic Drugs and Psychotropic Substance (NDPS) Act court Wednesday allowed Aryan Khan, son of actor Shah Rukh Khan, to get back his passport which was in its custody as per the bail con… [+1195 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "Twitter flooded with stunning pictures of ‘Manhattanhenge’ as sun aligns perfectly between Manhattan streets", "description": "In 2022, Manhattanhenge occurred twice, first on May 29 and then on July 12.", "url": "https://indianexpress.com/article/trending/trending-globally/stunning-pictures-of-manhattanhenge-as-sun-aligns-perfectly-between-manhattan-streets-8027412/", "urlToImage": "https://images.indianexpress.com/2022/07/manhattanhenge-2022.jpg", "publishedAt": "2022-07-13T14:04:15Z", "content": "Scores of people congregated on the streets of Manhattan in New York Tuesday to witness Manhattanhenge with the setting sun peeking from behind skyscraper-lined streets.In an article for the American… [+2839 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Priya Kumari Shukla", "title": "UPSC Key-July 13, 2022: Why to read ‘Malimath Committee Report’ or ‘Definition of Farmer’ or ‘Youth in India 2022’ for UPSC CSE", "description": "Exclusive for Subscribers from Monday to Friday: The Indian Express UPSC Key July 13, 2022 will help you prepare for the Civil Services and other competitive examinations with cues on how to read and understand content from the most authoritative news source …", "url": "https://indianexpress.com/article/upsc-current-affairs/upsc-key-july-13-2022-why-to-read-malimath-committee-report-or-definition-of-farmer-or-youth-in-india-2022-for-upsc-cse-8027390/", "urlToImage": "https://images.indianexpress.com/2022/06/UPSC-KEY-Pic-With-Logo.jpg", "publishedAt": "2022-07-13T14:01:46Z", "content": "FRONT PAGE\r\nRetail inflation eases, but still over 7%, IIP hits 12-month high of 19.6% in May\r\nSyllabus:\r\nPreliminary Examination: Economic and Social Development-Sustainable Development, Poverty, In… [+14611 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Karnataka floods: Rs 500 crore to be released soon for repair works, infrastructure works in affected areas", "description": "\"We will request for central assistance to take up relief works after getting reports on the extent of damage in the districts,\" Karnataka Chief Minister Basavaraj Bommai said.", "url": "https://indianexpress.com/article/india/karnataka-floods-rs-500-crore-to-be-released-soon-for-repair-works-infrastructure-works-in-affected-areas-8027340/", "urlToImage": "https://images.indianexpress.com/2022/07/kiran-2.jpg", "publishedAt": "2022-07-13T14:01:19Z", "content": "A sum of Rs 500 crore would immediately be released to facilitate repair and restoration of roads, bridges, power lines and for other infrastructure works in the flood-hit areas of Karnataka based on… [+4383 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Israeli museum finds sketches hidden in Amedeo Modigliani painting", "description": "Modigliani is considered one of the 20th century’s great Modernist artists. His lived a short, turbulent, Bohemian life in France, where his nude paintings were controversial", "url": "https://indianexpress.com/article/lifestyle/art-and-culture/israeli-museum-finds-sketches-hidden-in-amedeo-modigliani-painting-nude-with-a-hat-8026854/", "urlToImage": "https://images.indianexpress.com/2022/07/Modigliani_AP1200.jpeg", "publishedAt": "2022-07-13T14:00:24Z", "content": "Curators at an Israeli museum have discovered three previously unknown sketches by celebrated 20th-century artist Amedeo Modigliani hiding beneath the surface of one of his paintings.The unfinished w… [+4637 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Debraj Deb", "title": "Mohan Bhagwat to visit Tripura on August 27 to inaugurate temple: Shantikali Ashram chief", "description": "Shantikali Ashram operates under the Shantikali Mission Society, which runs a chain of 24 temples across the state, named after Acharya Shantikali, a religious preacher, who was shot dead by insurgents in 2000.", "url": "https://indianexpress.com/article/north-east-india/tripura/mohan-bhagwat-visit-tripura-august-inaugurate-temple-8027392/", "urlToImage": "https://images.indianexpress.com/2022/04/Mohan-Bhagwat-2.jpg", "publishedAt": "2022-07-13T13:52:48Z", "content": "Rashtriya Swayamsevak Sangh (RSS) chief Mohan Bhagwat will visit Tripura on August 27 to inaugurate a temple of the Shantikali Ashram at Sarbong in Amarpur of the state’s Gomati district, 85 km from … [+2235 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pune: Man gets swept away in water while crossing submerged bridge, another who was holding on to lamp post saved", "description": "Officials from Uttam Nagar police station said the incident took place on the bridge connecting Nanded Phata to Shivane.", "url": "https://indianexpress.com/article/cities/pune/pune-man-gets-swept-away-crossing-submerged-bridge-another-holding-lamp-post-saved-8027371/", "urlToImage": "https://images.indianexpress.com/2022/07/pune_Rains-1.jpg", "publishedAt": "2022-07-13T13:49:54Z", "content": "A man was swept away Wednesday while walking on a submerged bridge built on the swollen Mutha River in the Shivane area of rain-lashed Pune and another who held on to a lamp post was rescued by fire … [+1715 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "পাহাড়ের রাজভবনে ‘সৌজন্য’, একে অপরকে উত্তরীয় দিলেন অসমের হিমন্ত ও মমতা", "description": "দার্জিলিংয়ের রাজভবনে এ দিন সাক্ষাৎ হল রাজ্যপাল ও মুখ্যমন্ত্রীর। ছিলেন অসমের মুখ্যমন্ত্রী হিমন্ত বিশ্বশর্মাও।", "url": "https://bengali.indianexpress.com/west-bengal/mamata-benerjee-himanta-biswa-sarma-jagdeep-dhankhar-meets-at-rajbhavan-in-darjeeling-468768/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/mamata-himanta-meet.jpg", "publishedAt": "2022-07-13T13:46:35Z", "content": ", - \r\n , , ‘ ’ ’\r\n , \r\n - , \r\n - - ’? , ‘ , , ’\r\n, , ( ) , ‘ ’\r\nStay updated with the latest news headlines and all the latest Westbengal news download Indian Express Bengali App.\r\nWeb Title: Mamata … [+77 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi High Court permits Vivo to use bank accounts, with conditions", "description": "The court has asked the firm to give Rs 950 cr bank guarantee within seven days.", "url": "https://indianexpress.com/article/cities/delhi/delhi-hc-permits-vivo-use-bank-accounts-with-conditions-8027349/", "urlToImage": "https://images.indianexpress.com/2022/07/Vivo-1.jpg", "publishedAt": "2022-07-13T13:36:59Z", "content": "THE DELHI High Court on Wednesday permitted mobile manufacturer Vivo to use its bank accounts subject to maintaining the balance of Rs 251 crore and submitting a bank guarantee of Rs 950 crore within… [+2305 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Now, Indian cricketer Shikhar Dhawan announces big bet on metaverse", "description": "Shikhar Dhawan is keen on investing in the metaverse because he believes that with the growing sports market, more people will be willing to join the metaverse craze.", "url": "https://indianexpress.com/article/technology/crypto/sports-and-metaverse-why-indian-cricketer-shikhar-dhawan-is-betting-big-on-metaverse-8026990/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-2022-07-13T175316.909-1.jpg", "publishedAt": "2022-07-13T13:31:05Z", "content": "Indian cricketer Shikhar Dhawan has announced plans to launch a sports city in the metaverse. This soon-to-be-launched multifaceted sports city will be home to cricket stadiums, a sportsplex where on… [+1939 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "‘Palette… An Artist’s Odyssey’ to promote artworks, techniques in two-day art exhibition in Delhi", "description": "The event will take place July 16 and 17 at The Stainless Gallery in New Friends Colony, where guests will get a chance to witness mixed media artworks", "url": "https://indianexpress.com/article/lifestyle/art-and-culture/palette-an-artists-odyssey-artworks-two-day-art-exhibition-delhi-8026885/", "urlToImage": "https://images.indianexpress.com/2022/07/ednet-art-exhibition-1200-1.jpg", "publishedAt": "2022-07-13T13:30:53Z", "content": "EdNet School of Art &amp; Design, which is the art wing of EdNet Consultants, has announced the first edition of ‘Palette An Artists Odyssey’, an “immersive exhibition-cum-art camp” for all art enthu… [+2290 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Global PC shipments sees major decline due to Chinese COVID lockdowns: Canalys", "description": "Production crunches due to COVID-19 lockdowns in China and unchecked inflation affected global PC shipments in the second quarter of 2022.", "url": "https://indianexpress.com/article/technology/tech-news-technology/global-pc-market-q2-2022-drop-lenovo-hp-dell-acer-asus-8027224/", "urlToImage": "https://images.indianexpress.com/2022/07/Lenovo-Legion-Slim-7-global-pc-market-2022.jpg", "publishedAt": "2022-07-13T13:27:11Z", "content": "The second quarter of 2022 saw a major disruption in the PC market as COVID-19 lockdowns in China hindered manufacturing. Data from Canalys shows that total shipments of desktops and notebooks fell 1… [+2030 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Post Covid, supply share of studio apartments down to 9% in H1 2022", "description": "In contrast, of the 1,921 projects launched in 2019, around 368 (19 per cent) had studio apartments.", "url": "https://indianexpress.com/article/india/studio-apartments-hardest-hit-supply-share-down-to-9-in-h1-2022-8027219/", "urlToImage": "https://images.indianexpress.com/2021/06/buildings.jpg", "publishedAt": "2022-07-13T13:25:54Z", "content": "The overall supply share of studio apartments, among the hottest-selling configurations before the Covid-19 pandemic, has been dipping across the top seven cities since 2020, according to a research.… [+2727 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Euro falls below dollar parity for first time since 2002", "description": "Heightened global uncertainty and an aggressive Fed monetary policy stance meanwhile have benefited the safe-haven dollar.", "url": "https://indianexpress.com/article/world/euro-falls-below-dollar-parity-for-first-time-since-2002-8027259/", "urlToImage": "https://images.indianexpress.com/2022/07/euro-dollar-reuters-currency-1200.jpeg", "publishedAt": "2022-07-13T13:19:54Z", "content": "The euro dropped below parity against the dollar on Wednesday for the first time in almost two decades, as a hawkish U.S. Federal Reserve and growing concern about rising recession risks in the euro … [+1953 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Teaser of Surbhi Chandna and Arjun Bijlani’s Ho Gaya Hai Pyaar is out, fans call it ‘beautiful’", "description": "Surbhi Chandna and Arjun Bijlani's music video \"Ho Gaya Hai Pyaar\" will drop on July 15. It will see the TV stars play a small-town couple, who fall in love after marriage.", "url": "https://indianexpress.com/article/entertainment/music/teaser-of-surbhi-chandna-and-arjun-bijlanis-ho-gaya-hai-pyaar-is-out-fans-call-it-beautiful-8027241/", "urlToImage": "https://images.indianexpress.com/2022/07/arjun-bijlani-surbhi-chandna-ho-gaya-hai-pyaar.jpg", "publishedAt": "2022-07-13T13:11:34Z", "content": "Popular television actors Surbhi Chandna and Arjun Bijlani are all set to share screen space in a music video. Titled “Ho Gaya Hai Pyaar”, the music video will see them play a couple living in a smal… [+1065 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "US inflation reached a new 40-year high in June of 9.1%", "description": "Consumer prices soared 9.1% compared with a year earlier, the government said Wednesday, the biggest 12-month increase since 1981, and up from an 8.6% jump in May.", "url": "https://indianexpress.com/article/world/us-inflation-reached-new-40-year-high-in-june-of-9-1-8027287/", "urlToImage": "https://images.indianexpress.com/2022/07/usa-cover.jpg", "publishedAt": "2022-07-13T13:09:48Z", "content": "Surging prices for gas, food and rent catapulted US inflation to a new four-decade peak in June, further pressuring households and likely sealing the case for another large interest rate hike by the … [+5838 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Olympic medalist Amos suspended for doping ahead of worlds", "description": "The athlete was notified of the adverse analytical finding and his mandatory provisional suspension this afternoon in Eugene.", "url": "https://indianexpress.com/article/sports/sport-others/olympic-medalist-amos-suspended-for-doping-ahead-of-worlds-8027298/", "urlToImage": "https://images.indianexpress.com/2021/09/Doping-File_1200.jpg", "publishedAt": "2022-07-13T13:02:39Z", "content": "Nijel Amos, an Olympic silver medalist in the men’s 800 meters, has been suspended ahead of the world championships after testing positive for a rare banned substance.The Athletics Integrity Unit sai… [+991 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shaju Philip", "title": "Jaishankar vs Vijayan: An elevated Kerala highway and a Centre-vs-Kerala gridlock", "description": "As the two parties fight it out over development stakes, particularly in the run-up to the 2024 Lok Sabha polls, Kerala Chief Minister Pinarayi Vijayan did not take kindly to Jaishankar’s interactions with beneficiaries of various Central government schemes a…", "url": "https://indianexpress.com/article/political-pulse/jaishankar-vs-vijayan-an-elevated-kerala-highway-and-a-centre-vs-kerala-gridlock-8027285/", "urlToImage": "https://images.indianexpress.com/2022/07/jaishankar_kerela.jpg", "publishedAt": "2022-07-13T12:52:58Z", "content": "BY STANDARDS of his usual travels, the visit to Kerala should have been pretty unremarkable for Union External Affairs Minister S Jaishankar. However, Jaishankar’s three-day stay in the state has bec… [+4604 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Include these 5 foods in your diet to relieve constipation naturally", "description": "\"One in five Indians suffer from constipation,\" nutritionist Lovneet Batra wrote on Instagram", "url": "https://indianexpress.com/article/lifestyle/health/natural-foods-diet-easy-constipation-hacks-relief-remedies-8021848/", "urlToImage": "https://images.indianexpress.com/2022/07/gut-health_200_getty.jpg", "publishedAt": "2022-07-13T12:50:53Z", "content": "Good gut health is extremely important for overall well-being. And an indicator of the same is not suffering from any digestive issues like constipation. But even if you do, worry not, and include ce… [+2083 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "China’s June crude oil imports near 4-year low as lockdowns hit demand", "description": "Imports during the first half of the year fell 3% versus the same period last year to 252.5 million tonnes, or about 10.2 million bpd, as months of COVID control measures and the government's curbs on fuel exports capped crude buying.", "url": "https://indianexpress.com/article/business/world-market/china-june-crude-oil-imports-low-lockdowns-hit-demand-8026635/", "urlToImage": "https://images.indianexpress.com/2022/07/China-Shanghai-Lockdown.jpg", "publishedAt": "2022-07-13T12:47:04Z", "content": "China’s daily crude oil imports in June sank to their lowest since July 2018, as refiners anticipated tough COVID-19 lockdown would curb demand, data showed on Wednesday.The world’s top crude buyer i… [+1679 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Sumukhi Suresh wants to work with Karan Johar and Vikramaditya Motwane: ‘I will make it happen’", "description": "Sumukhi Suresh is an expert in improv comedy and sketches. She will return as a judge in Prime Video reality comedy series Comicstaan 3.", "url": "https://indianexpress.com/article/entertainment/web-series/sumukhi-suresh-comicstaan-wants-to-work-with-karan-johar-vikramaditya-motwane-8027164/", "urlToImage": "https://images.indianexpress.com/2022/07/sumukhi-suresh-1200.jpg", "publishedAt": "2022-07-13T12:45:25Z", "content": "Her unique voice as a stand-up comic has been the bedrock of Sumukhi Sureshs career in the movies, where she hopes to work with filmmakers Karan Johar and Vikramaditya Motwane one day.Already popular… [+4726 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Oil edges higher after slide below $100", "description": "Brent is down sharply since hitting $139 in March, close to the all-time high reached in 2008. Renewed Covid-19 curbs in China have weighed on the market this week.", "url": "https://indianexpress.com/article/business/market/oil-edges-higher-after-slide-below-100-8026718/", "urlToImage": "https://images.indianexpress.com/2022/07/REUTERS-UKRAINE-CRISIS-CRUDE-1200.jpeg", "publishedAt": "2022-07-13T12:43:05Z", "content": "Oil edged up on Wednesday, a day after settling below $100 a barrel for the first time since April, and gains were limited by a US supply report showing rising inventories and caution ahead of US inf… [+1624 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Ponniyin Selvan I: Vikram dubs for Aditya Karikalan in five languages, watch video", "description": "Vikram plays Aditya Karikalan in Mani Ratnam's period drama Ponniyin Selvan: 1, which is due in cinemas on September 30.", "url": "https://indianexpress.com/article/entertainment/tamil/ponniyin-selvan-i-vikram-dubs-for-aditya-karikalan-in-5-languages-watch-8027191/", "urlToImage": "https://images.indianexpress.com/2022/07/vikram-ps.jpg", "publishedAt": "2022-07-13T12:40:30Z", "content": "Madras Talkies, the production house which is bankrolling the upcoming big-budget spectacle Ponniyin Selvan, on Wednesday released a behind-the-scenes video showing Vikram dubbing for his character, … [+1994 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Bombay HC questions imposing total ban on DJs & Dolby sound systems in Maharashtra", "description": "Maharashtra government said that Standard Operating Procedures had been issued under the Noise Pollution Rules. But High Court sought an affidavit from the government about the source of power for imposing such a \"drastic condition\".", "url": "https://indianexpress.com/article/cities/mumbai/bombay-hc-questions-imposing-total-ban-on-djs-dolby-sound-systems-in-maharashtra-8027261/", "urlToImage": "https://images.indianexpress.com/2022/07/bombay-high-court-1200-1-3-2.jpg", "publishedAt": "2022-07-13T12:40:24Z", "content": "The Bombay High Court Wednesday sought to know from the Maharashtra government as to why there is a blanket ban on DJs and Dolby Sound systems across the state. The court was hearing a plea by Profes… [+2247 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Santosh Singh", "title": "With high praise for Nitish, PM Modi signals all is well in Bihar NDA", "description": "Narendra Modi says Bihar CM in league of great leaders produced by state; NDA ties only getting stronger: JD(U).", "url": "https://indianexpress.com/article/political-pulse/high-praise-nitish-pm-modi-all-well-bihar-nda-8027249/", "urlToImage": "https://images.indianexpress.com/2022/07/Modi-Nitish.jpg", "publishedAt": "2022-07-13T12:38:11Z", "content": "Following the tension between the allies over a number of hot-button issues, Pradhan made visits in quick succession to Patna last month to meet Kumar and, during one of the trips, he called the Biha… [+2886 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Entertainment Desk", "title": "বেয়ার গ্রিলসকে জাপটে বার বার চুমু! রণবীরের কীর্তিতে যৌন হেনস্তার হুমকি ক্ষুব্ধ নেটিজেনদের", "description": "ছিঃ-ছিঃ পড়ে গিয়েছে নেটপাড়ায়।", "url": "https://bengali.indianexpress.com/entertainment/ranveer-singh-criticized-for-kissing-bear-grylls-on-man-vs-wild-468726/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/ranveer.jpg", "publishedAt": "2022-07-13T12:36:36Z", "content": "Man Vs Wild - ! ? ! \r\n - - Man Vs Wild , ? \r\n, , , ‘ ?’ ‘ ’ , ‘ ?’ , ‘ , ..’ ‘ ’ \r\n[ : ! ]\r\n, , ‘, ?’\r\n ,"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Hyderabad: Man trying to place warning sign board on road mowed down by speeding car", "description": "The electricity department had dug a hole in the Malakpet-Santoshnagar Road and police had placed barricades and a signboard due to the rains. Liaqat Ali Khan had walked across onto the middle of the road to put back the warning sign board when he was hit", "url": "https://indianexpress.com/article/cities/hyderabad/hyderabad-man-trying-to-place-warning-sign-board-on-road-mowed-down-speeding-car-8027099/", "urlToImage": "https://images.indianexpress.com/2022/07/hyd_mowing.jpeg", "publishedAt": "2022-07-13T12:32:07Z", "content": "A man in Hyderabad was knocked down by a speeding car while he was trying to erect a signboard to warn motorists of a hole in the middle of a busy street.The incident took place at around 9 pm Tuesda… [+2387 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi: Lawyer claims assaulted while refilling oxygen cylinder, court seeks FIR against cops", "description": "The complainant, Ashwani Gaur, had stated that his sister, who also worked with the Delhi Police, had tested positive for Covid in April, 2021and was admitted at a hospital in Prashant Vihar.", "url": "https://indianexpress.com/article/cities/delhi/lawyer-assault-refilling-oxygen-cylinder-court-fir-cops-8027243/", "urlToImage": "https://images.indianexpress.com/2021/12/delhi-covid-3.jpg", "publishedAt": "2022-07-13T12:28:56Z", "content": "A Delhi court has ordered the police to file an FIR against police officers accused of assaulting a lawyer, who was trying to refill an oxygen cylinder during the Covid pandemic.The complainant, Ashw… [+1571 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Geeta Kapur pens heartfelt note for ‘mamma’ Farah Khan: ‘Thank u for always holding my hand’", "description": "On the occasion of Guru Purnima, Geeta Kapur pens a heartfelt note for mentor, choreographer Farah Khan.", "url": "https://indianexpress.com/article/entertainment/bollywood/geeta-kapur-dedicates-a-special-post-for-mamma-farah-khan-8027132/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-26-1.jpg", "publishedAt": "2022-07-13T12:28:13Z", "content": "Choreographer Geeta Kapur took to Instagram on Wednesday and thanked mentor Farah Khan Kunder on the occasion of Guru Purnima. Kapur posted a throwback picture with a heartfelt caption.In the picture… [+1268 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sakshi Saroha, Arnav Chandrasekhar", "title": "CUET in 2 days, apprehensions by students mount", "description": "CUET, which is mandatory for undergraduate admission in Central Universities, is being held over several days in two phases.", "url": "https://indianexpress.com/article/education/cuet-in-2-days-apprehensions-by-students-mount-8027229/", "urlToImage": "https://images.indianexpress.com/2022/07/CUET-2-1.jpg", "publishedAt": "2022-07-13T12:27:32Z", "content": "Several students, school teachers and parents have raised apprehension about the upcoming Common University Entrance Test (CUET) flagging short notice, confusion in admit cards and the exam being spl… [+2350 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sakshi Saroha, Arnav Chandrasekhar", "title": "CUET in 2 days, apprehensions by students mount", "description": "CUET, which is mandatory for undergraduate admission in Central Universities, is being held over several days in two phases.", "url": "https://indianexpress.com/article/cities/delhi/cuet-in-2-days-apprehensions-by-students-mount-8027229/", "urlToImage": "https://images.indianexpress.com/2022/07/CUET-UG-2022.jpg", "publishedAt": "2022-07-13T12:27:32Z", "content": "Several students, school teachers and parents have raised apprehension about the upcoming Common University Entrance Test (CUET) flagging short notice, confusion in admit cards and the exam being spl… [+2350 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Nayanjot Lahiri", "title": "Why the lions in the emblem for the new Parliament are disturbing", "description": "Nayanjot Lahiri writes: The lions lack the restrained modelling and elegance of the Ashokan original. They signify a muscular nationalism.", "url": "https://indianexpress.com/article/opinion/columns/why-the-lions-in-the-emblem-for-the-new-parliament-are-disturbing-8027139/", "urlToImage": "https://images.indianexpress.com/2022/07/admin-ajaxLION_1200x667-1.jpg", "publishedAt": "2022-07-13T12:25:33Z", "content": "What is so disturbingly different about Indias national emblem as Indians know it and how the emblem has been conceived and represented at the new Parliament building?For one, the ferocious expressio… [+4444 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "2022’s biggest supermoon on July 13; here is what you need to know", "description": "The night sky on July 13 will be dominated by the supermoon. But what does that mean and how does it happen?", "url": "https://indianexpress.com/article/technology/science/biggest-supermoon-2022-july-13-8027045/", "urlToImage": "https://images.indianexpress.com/2022/07/What-is-a-supermoon.jpg", "publishedAt": "2022-07-13T12:25:32Z", "content": "On July 13, the night sky will be dominated by the largest and brightest moon, called a Supermoon. It will begin at 12.08 AM IST according to NASA. Here is what a supermoon is and how it happens.Acco… [+1740 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sohini Ghosh", "title": "Chinese study shows Covid-19 ups dementia risk", "description": "By tracking recovered patients for a year, researchers found that 21 per cent of those with severe cases experienced progressive cognitive decline. This means that the Coronavirus can cause long-lasting damage to the brain than previously thought", "url": "https://indianexpress.com/article/lifestyle/health-specials/chinese-study-shows-covid-19-ups-dementia-risk-8027082/", "urlToImage": "https://images.indianexpress.com/2019/07/dementia_1200_thinkstock.jpg", "publishedAt": "2022-07-13T12:24:34Z", "content": "A China-based study, which tracked over 1,000 Covid-19 recovered patients aged 60 years and above for a year, has found that their cognitive abilities have declined and pushed them towards dementia.L… [+7912 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "PSG reject offer to sign Cristiano Ronaldo: Reports", "description": "PSG rejected the opportunity to sign Cristiano Ronaldo after talks between president Nasser Al-Khelaifi and the player's agent Jorge Mendes.", "url": "https://indianexpress.com/article/sports/football/psg-reject-offer-to-sign-cristiano-ronaldo-reports-8027148/", "urlToImage": "https://images.indianexpress.com/2022/07/psg-ronaldo.jpg", "publishedAt": "2022-07-13T12:23:10Z", "content": "Paris Saint-Germain reportedly rejected the chance to sign Manchester United’s Cristiano Ronaldo after being offered to the club by his agent Jorge Mendes.Ronaldo, who has reportedly asked for a rele… [+1054 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "HSEE 2022: IIT Madras releases hall ticket for entrance test; how to download", "description": "HSEE 2022: The entrance exam will be conducted on July 31. Applicants can download the hall ticket at the official website - hsee.iitm.ac.in", "url": "https://indianexpress.com/article/education/hsee-2022-iit-madras-releases-hall-ticket-how-to-download-hsee-iitm-ac-in-8027220/", "urlToImage": "https://images.indianexpress.com/2022/07/Webp.net-resizeimage-15-11.37.58-AM.jpg", "publishedAt": "2022-07-13T12:21:37Z", "content": "The Indian Institute of Technology, IIT Madras has released the admit cards for Humanities and Social Sciences Entrance Examination (HSEE) 2022. Applicants can download the hall ticket at the officia… [+1025 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "The C Seed N1 is a foldable 4K TV straight out of a sci-fi movie", "description": "The C Seed N1 is a luxury 4K TV that folds up into a sculpture in your room.", "url": "https://indianexpress.com/article/technology/gadgets/the-c-seed-n1-is-a-foldable-4k-tv-straight-out-of-a-sci-fi-movie-8027044/", "urlToImage": "https://images.indianexpress.com/2022/07/C-Seed-N1-Folding-TV.jpg", "publishedAt": "2022-07-13T12:20:27Z", "content": "Large screens televisions have been around for a long time now, and with more Laser TVs and projectors launching, the compact approach seems to be the direction large screen experiences are headed to… [+1889 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Commodity prices today, July 13, 2022: Prices of key vegetables and pulses in top cities", "description": "Commodity prices today news update: Urad dal remained the most expensive pulse in the national capital on Wednesday.", "url": "https://indianexpress.com/article/business/commodities/commodity-prices-today-july-13-2022-delhi-mmbai-kolkata-chennai-potato-onion-tomato-pulses-rates-8027023/", "urlToImage": "https://images.indianexpress.com/2022/07/GettyImages-healthy-eating-1200.jpg", "publishedAt": "2022-07-13T12:12:17Z", "content": "Vegetables and pulses price today: The price of moong dal in the national capital experienced a hike of Rs 2 per kg on Wednesday, while the prices of all other major pulses remained unchanged. It was… [+1561 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Wasn’t thinking about break from ODI, already knew what I had to do, says Shami", "description": "The first ODI against England on Monday was Shami's first appearance in the format after almost a gap of two years. He last played in India's 51-run loss to Australia in November 2020.", "url": "https://indianexpress.com/article/sports/cricket/wasnt-thinking-about-break-from-odi-already-knew-what-i-had-to-do-says-shami-8027154/", "urlToImage": "https://images.indianexpress.com/2022/07/Shami-2.jpg", "publishedAt": "2022-07-13T12:09:52Z", "content": "Seasoned India pacer Mohammad Shami said he wasn’t thinking about his long lay off from ODI cricket and approached his comeback game with a clear mind as he is well-versed with the white-ball behavio… [+3203 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Madhuri Dixit responds as fan thanks her for being an ‘anchor, role model’", "description": "Madhuri Dixit Nene reposted a fan’s heartfelt message on her Instagram handle.", "url": "https://indianexpress.com/article/entertainment/bollywood/madhuri-dixit-congratulates-fan-says-thanks-for-being-a-big-fan-8026517/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-23-1.jpg", "publishedAt": "2022-07-13T12:09:49Z", "content": "Madhuri Dixit Nene responded to a fan’s message who thanked the star for being her role model and anchor over the years. She also congratulated the girl on her graduation and wrote, Thanks for being … [+1466 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "When John Abraham called out Pooja Bhatt for not seeking his consent during the filming of Jism: ‘Is anyone going to ask if I am comfortable doing this?’", "description": "Unlike 2022 film Gehraiyaan which boasted of having an intimacy director on set, Jism had producer Pooja Bhatt talking to her artistes and checking if they were comfortable with the intimate scenes.", "url": "https://indianexpress.com/article/entertainment/bollywood/john-abraham-pooja-bhatt-not-seeking-his-consent-during-jism-8027143/", "urlToImage": "https://images.indianexpress.com/2022/07/jism.jpeg", "publishedAt": "2022-07-13T12:02:30Z", "content": "John Abraham and Bipasha Basus 2003 film Jism was a big moment in Indian pop culture. The film attempted what was then known as ‘bold’ scenes and introduced the audience to the on-screen chemistry of… [+1329 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Shooting World Cup: Mehuli-Tushar clinch second gold for India", "description": "With the impressive results on Wednesday, India have now climbed up to the joint second position alongside China, behind leaders Serbia, with two gold and 1 bronze medal.", "url": "https://indianexpress.com/article/sports/sport-others/shooting-world-cup-mehuli-ghosh-tushar-gold-for-india-8027081/", "urlToImage": "https://images.indianexpress.com/2022/07/Mehuli-Ghosh-and-Shahu-Tushar-Mane.jpg", "publishedAt": "2022-07-13T12:00:47Z", "content": "Mehuli Ghosh and Shahu Tushar Mane won Indias second gold medal in the ongoing ISSF World Cup Rifle/Pistol/Shotgun stage, beating Hungarys Eszter Meszaros and Istvan Peni 17-13 in a hard-fought 10m A… [+1345 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Shilpa Shetty explores a vineyard in Saint-Tropez; know what makes the place famous", "description": "\"So beautiful,\" she gasped, adding, \"The grape harvesting season, I think, starts between August and October. So, we are way before time; they are really raw. But, this is so much fun!\" Shilpa said to the camera", "url": "https://indianexpress.com/article/lifestyle/destination-of-the-week/shilpa-shetty-explores-vineyard-saint-tropez-famous-vineyards-8018050/", "urlToImage": "https://images.indianexpress.com/2022/07/Shilpa-Shetty-1200.jpg", "publishedAt": "2022-07-13T12:00:12Z", "content": "Shilpa Shetty‘s social media account is a testament to the fact that the actor loves the good life: be it food, travel, or fashion.Buy Now | Our best subscription plan now has a special price\r\nShe re… [+1996 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Udit Misra", "title": "Explained: How gender equal is India as per the 2022 Global Gender Gap Index?", "description": "India has approximately 662 million (or 66.2 crore) women and in 2022, India’s overall score has improved slightly from 2021.", "url": "https://indianexpress.com/article/explained/explained-how-gender-equal-is-india-as-per-the-2022-global-gender-gap-index-8026983/", "urlToImage": "https://images.indianexpress.com/2022/07/gender-gap-index.jpg", "publishedAt": "2022-07-13T12:00:01Z", "content": "The Global Gender Gap Index for 2022 was released by the World Economic Forum (WEF) Wednesday, and it ranks India at 135 out of 146 countries. In 2021, India was ranked 140 out of 156 countries.What … [+2904 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "Storm splits a house into two in the US. Here is what it looks like", "description": "The US states of Washington and Maryland faced strong thunderstorms on Tuesday evening.", "url": "https://indianexpress.com/article/trending/trending-globally/storm-splits-a-house-into-two-in-the-us-8027126/", "urlToImage": "https://images.indianexpress.com/2022/07/broken-home-strom-usa-1.jpg", "publishedAt": "2022-07-13T11:57:49Z", "content": "A house was ripped into two by powerful gusts of wind in a city in Maryland in the US Tuesday.The video of the damaged house in College Park went viral on social media after ABC7 News journalist Tom … [+3010 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Arun Janardhanan", "title": "TN BJP takes battle against intel chief to Raj Bhavan, seeks NIA probe in passport case", "description": "Senior IPS officer and state intelligence chief Davidson Devaasirvatham has often drawn fire from the BJP leaders and Hindutva outfits in the state.", "url": "https://indianexpress.com/article/political-pulse/tn-bjp-takes-battle-against-intel-chief-to-raj-bhavan-8027032/", "urlToImage": "https://images.indianexpress.com/2022/07/annalai.jpg", "publishedAt": "2022-07-13T11:56:10Z", "content": "The Tamil Nadu BJP has written to the Governor, R N Ravi, demanding a probe into a fake passport case allegedly involving state intelligence chief Davidson Devaasirvatham even by the anti-terror cent… [+5630 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Shreya Ghoshal completes 20 years in Bollywood, sings Devdas song as she thanks Sanjay Leela Bhansali", "description": "Singer Shreya Ghoshal took to Instagram and shared a post of herself singing Silsila Yeh Chahat Ka as she celebrates 20 years of her journey in the entertainment industry.", "url": "https://indianexpress.com/article/entertainment/bollywood/shreya-ghoshal-celebrates-20-years-in-bollywood-shares-a-heartfelt-note-for-sanjay-leela-bhansali-and-devdas-8026852/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-25-1.jpg", "publishedAt": "2022-07-13T11:52:52Z", "content": "As the 20th anniversary of the classic movie Devdas is celebrated this week, the Sanjay Leela Bhansali directorial also marks an epoch in the career of singer Shreya Ghoshal. Ghoshal has shared a lon… [+1637 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "‘HPV vaccination can prevent more than 90 per cent of cervical cancers when given at the recommended age’", "description": "The administration of vaccination to girls and women is best before they are exposed to the virus. Those between the age group of 12 and 26 are considered ideal candidates for getting the vaccination, says Dr Sarika Gupta, Senior Consultant, Oncology and Robo…", "url": "https://indianexpress.com/article/lifestyle/health-specials/hpv-vaccination-prevent-cervical-cancers-age-8027086/", "urlToImage": "https://images.indianexpress.com/2022/01/pexels-VACCINE.jpg", "publishedAt": "2022-07-13T11:50:06Z", "content": "Indias first Quadrivalent Human Papillomavirus vaccine (qHPV)to fight cervical cancer has received a nod from the DCGI for widespread use to protect our women vulnerable to contracting it. According … [+3425 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Parenting Desk", "title": "Five Things: Learning about life through games, photography contest, weaving techniques, and more", "description": "While Mumbai’s ArtNightThursday keeps gallery doors open well past supper, there’s more across the country for young and old alike, be it watching a film together or revisiting old board games", "url": "https://indianexpress.com/article/parenting/five-things-learning-about-life-through-games-photography-contest-weaving-techniques-8026855/", "urlToImage": "https://images.indianexpress.com/2022/07/Art-Gallery.jpg", "publishedAt": "2022-07-13T11:48:59Z", "content": "Its said that play is our brains favourite way of learning. And heres a book that tells us just that. Chennai-based Vinita Sidhartha, founder of Kreeda Games, has authored Just Play!: Life Lessons fr… [+3224 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gujarat rain: Death toll rises to 14 in past 24 hours, govt issues red alert in 5 districts", "description": "Gujarat revenue minister Rajendra Trivedi said, “Two people died after trees fell on them, two others died after being struck by lightning and nine died after drowning.\"", "url": "https://indianexpress.com/article/india/gujarat-rain-death-toll-rises-to-14-in-past-24-hours-govt-issues-red-alert-in-5-districts-8026879/", "urlToImage": "https://images.indianexpress.com/2022/07/gujarat-rains-pti.jpg", "publishedAt": "2022-07-13T11:42:56Z", "content": "The death toll due to rain-related incidents in Gujarat in the last 24 hours ending Wednesday morning climbed to 14, pushing the total number of casualties in the state till now this monsoon to 83, s… [+2267 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "When Deepika Padukone came out of her comfort zone in Cocktail: ‘Veronica impacted me professionally and personally’", "description": "Deepika Padukone's character Veronica in Cocktail became a game-changer for her. As the movie completes 10 years of release today, Deepika looks back at the special role.", "url": "https://indianexpress.com/article/entertainment/bollywood/cocktail-10-years-deepika-padukone-veronica-special-character-8026965/", "urlToImage": "https://images.indianexpress.com/2022/07/cocktail-deepika-padukone-1200.jpg", "publishedAt": "2022-07-13T11:41:16Z", "content": "As Deepika Padukone made the audience swoon over her stylish entry on “Angrezi Beat” in Cocktail, we knew this role was way out of her comfort zone back then. Deepika was offered the character of Mee… [+1609 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "CUET-PG 2022 registration, application correction deadline extended", "description": "CUET PG 2022: The last date for online payment is July 19 till 11:50 pm while the correction window will be open from July 20 to 22 (11:50 pm).", "url": "https://indianexpress.com/article/education/cuet-pg-2022-registration-application-correction-deadline-extended-cuet-nta-nic-in-8027079/", "urlToImage": "https://images.indianexpress.com/2022/05/CUET-2022-1-1.jpg", "publishedAt": "2022-07-13T11:40:04Z", "content": "CUET PG 2022: The National Testing Agency has extended the registration date for the Common University Entrance Test (CUET) PG 2022. The candidates can now apply till July 18, upto 5 pm. Candidates c… [+1347 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Barcelona reach agreement with Leeds for Raphinha transfer", "description": "Raphinha was set for a move to Chelsea before Barcelona joined the chase and it was reported that the 25-year-old preferred the Catalan club.", "url": "https://indianexpress.com/article/sports/football/barcelona-reach-agreement-with-leeds-for-raphinha-transfer-8027022/", "urlToImage": "https://images.indianexpress.com/2022/07/Raphinha.jpg", "publishedAt": "2022-07-13T11:32:03Z", "content": "Barcelona on Wednesday confirmed that they had reached an agreement in principle for the transfer of Raphinha from English Premier League side Leeds United, bringing an end to a protracted saga which… [+1111 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pavneet Singh Chadha", "title": "2017 Gurgaon school murder: Supreme Court dismisses petition against high court order asking JJB to decide afresh whether to treat juvenile as adult", "description": "The CBI apprehended a Class XI student of the school in connection with the murder case on November 7, 2017, with its probe stating that the teenager had committed the murder in a bid to get the examinations postponed and a scheduled parent-teacher meeting ca…", "url": "https://indianexpress.com/article/cities/delhi/2017-gurgaon-school-murder-supreme-court-dismisses-petition-to-treat-juvenile-as-adult-8026950/", "urlToImage": "https://images.indianexpress.com/2022/07/supreme-court-3-1-1-2.jpeg", "publishedAt": "2022-07-13T11:31:52Z", "content": "The Supreme Court Wednesday dismissed the petition filed by the father of the boy who was murdered by another student in a prominent school in Gurgaon in 2017. The petition was against a high court o… [+3406 chars]"}]}