{"status": "ok", "totalResults": 603, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Sreenivas Janyala", "title": "Newsmaker | Math star, coaching centre founder, unlikely politician now in Andhra ‘cheating’ racket", "description": "Dr Ponguru Narayana served as minister in TDP govt, was accused of land scam during Capital formation.", "url": "https://indianexpress.com/article/india/political-pulse/newsmaker-math-star-coaching-centre-founder-politician-andhra-cheating-racket-7910094/", "urlToImage": "https://images.indianexpress.com/2022/05/Ponguru.jpg", "publishedAt": "2022-05-10T12:45:22Z", "content": "The founder of one of Asia’s largest education groups, Dr Ponguru Narayana is an unlikely politician. The soft-spoken 65-year-old, who oversees the Narayana Group of educational institutions, was app… [+4763 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Karnataka CM Basavaraj Bommai in Delhi, says no discussion on Karnataka cabinet rejig for now", "description": "The Chief Minister, who arrived in New Delhi this morning, said he intended to discuss Cabinet exercise with the central leadership during the visit, but BJP national president J P Nadda and Union Home Minister Amit Shah are not in town.", "url": "https://indianexpress.com/article/india/karnataka-cm-basavaraj-bommai-delhi-no-discussion-karnataka-cabinet-rejig-7910100/", "urlToImage": "https://images.indianexpress.com/2022/05/Basavaraj-Bommai-2.jpg", "publishedAt": "2022-05-10T12:39:05Z", "content": "With his visit to the national capital raising hopes among ministerial aspirants about the expansion or rejig of Karnataka Cabinet, Chief Minister Basavaraj Bommai on Tuesday said he will not be hold… [+2102 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sreenivas Janyala", "title": "Cyclone Asani: Navy’s Eastern Command in Visakhapatnam steps up with aid", "description": "Nineteen flood relief teams and six diving teams, along with Gemini craft and associated gears, are on standby at Visakhapatnam for rendering assistance to civil authorities.", "url": "https://indianexpress.com/article/cities/hyderabad/cyclone-asani-navys-eastern-command-in-visakhapatnam-steps-up-with-aid-7910099/", "urlToImage": "https://images.indianexpress.com/2022/05/ASANI-2.jpg", "publishedAt": "2022-05-10T12:34:32Z", "content": "The Indian Navys Eastern Command at Visakhapatnam is preparing to provide assistance in the event that severe cyclonic storm Asani makes landfall on May 11, a statement from the Navy said, adding tha… [+1879 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sana Farzeen", "title": "Azma Fallah: ‘I could have won Lock Upp if I was there from Day 1’", "description": "Amza Fallah talks about her Lock Upp journey, the incident with Zeeshan Khan and her on-off friendship with Payal Rohatgi.", "url": "https://indianexpress.com/article/entertainment/web-series/azma-fallah-could-have-won-lock-upp-munawar-faruqui-kangana-ranaut-7910048/", "urlToImage": "https://images.indianexpress.com/2022/05/azma-fallah-lock-upp.jpg", "publishedAt": "2022-05-10T12:32:51Z", "content": "Azma Fallah was the only wild card contestant on Lock Upp, who managed to make her mark in the show. While Azma ended her journey as a finalist, the model-actor shared that she is overwhelmed with th… [+2756 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sethu Pradeep", "title": "Ather Energy’s Ravneet S Phokela on EV scooter fiascos, and why batteries need to be customised for India", "description": "We spoke to Ather Energy chief business officer (CBO) Ravneet S Phokela to find out what the company does differently. Here is an edited version of the interview.", "url": "https://indianexpress.com/article/technology/tech-news-technology/ather-energys-ravneet-s-phokela-on-ev-scooter-fiascos-and-why-batteries-need-to-be-customised-for-india-7910078/", "urlToImage": "https://images.indianexpress.com/2022/05/Ravneet-Phokela-Ather-CBO-Why-Ather-scooters-dont-catch-fire.jpg", "publishedAt": "2022-05-10T12:29:47Z", "content": "After the government ordered a probe into the recent spate of electric scooters catching fire, an initial probe concluded that faulty battery cells and modules are the leading cause of such incidents… [+5424 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Ranveer Singh-starrer ‘Jayeshbhai Jordaar’ can release with disclaimer: Delhi HC", "description": "The court was hearing a petition seeking deletion of the scene where the movie shows the use of ultrasound technology in a clinic to determine the sex of the foetus.", "url": "https://indianexpress.com/article/cities/delhi/ranveer-singh-starrer-jayeshbhai-jordaar-release-disclaimer-delhi-hc-7910086/", "urlToImage": "https://images.indianexpress.com/2022/05/jayeshbai-jordaar-ranveer-singh-1200.jpg", "publishedAt": "2022-05-10T12:24:37Z", "content": "Disposing of a petition seeking deletion of the scene where the movie shows the use of ultrasound technology in a clinic, the Delhi High Court on Tuesday asked the filmmakers of Ranveer Singh-starrer… [+2177 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "EA is making a new Lord of the Rings game", "description": "Electronic Arts is making a new Lord of the Rings game with Middle-earth Enterprises called The Lord of the Rings: Heroes of Middle-earth. Read all about it below.", "url": "https://indianexpress.com/article/technology/gaming/ea-is-making-a-new-lord-of-the-rings-game-7910039/", "urlToImage": "https://images.indianexpress.com/2022/05/Electronic-Arts-Lord-of-the-Rings.jpg", "publishedAt": "2022-05-10T12:24:03Z", "content": "Electronic Arts is working on a new Lord of the Rings mobile game that will be free-to-play. Called The Lord of the Rings: Heroes of Middle-earth, the game will be a collectible role-playing title th… [+1595 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "German school students had fun while it lasted. Then firefighters ‘rescued’ locked question papers", "description": "While teachers and firefighters scrambled to open the safe, students had fun.", "url": "https://indianexpress.com/article/trending/trending-globally/german-school-students-had-fun-while-it-lasted-then-firefighters-rescued-locked-question-papers/", "urlToImage": "https://images.indianexpress.com/2022/05/firefighters-crop.jpg", "publishedAt": "2022-05-10T12:17:17Z", "content": "Students of a high school in Germany’s Bocholt, who waited with bated breath for the question papers for their final-year examinations, could take a break. If only for an hour. Teachers at Euregio Gy… [+1260 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Insert disclaimers on illegality of sex determination: HC tells Jayeshbhai Jordaar makers", "description": "Jayeshbhai Jordaar stars Ranveer Singh, Boman Irani, Ratna Pathak Shah, Shalini Pandey among others. The film is scheduled for a May 13 release.", "url": "https://indianexpress.com/article/entertainment/bollywood/ranveer-singh-jayeshbhai-jordaar-makers-told-to-insert-disclaimers-illegality-of-sex-determination-7910057/", "urlToImage": "https://images.indianexpress.com/2022/05/ranveer1200-1.jpg", "publishedAt": "2022-05-10T12:17:02Z", "content": "The Delhi High Court Tuesday asked the makers of Jayeshbhai Jordaar to insert in certain scenes a disclaimer concerning the illegality of the practice of sex determination of a foetus and gave its no… [+4061 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "‘Gmail is now GreatMail’: GOP member fumes after Google company sends mail straight to spam, Internet has a field day", "description": "Earlier in April, Republicans complained that Google’s email platform unfairly censored GOP fundraising emails.", "url": "https://indianexpress.com/article/trending/trending-globally/gop-member-fumes-after-gmail-sends-mail-straight-to-spam-internet-has-a-field-day-7909752/", "urlToImage": "https://images.indianexpress.com/2022/05/republican-politican-rant-gmail-spam.jpg", "publishedAt": "2022-05-10T12:16:40Z", "content": "If a name of an app or platform starts dominating trends, one would usually assume that there has been an outage. However, on Tuesday, Gmail dominated trends on Twitter, after GOP (Grand Old Party) m… [+4836 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Amid break-up rumours, Kiara Advani calls herself a hopeless romantic: ‘World is a happier place when people are in love’", "description": "The speculation about Sidharth Malhotra and Kiara Advani's break-up has been rife. The two, however, have maintained a studied silence about their relationship or the rumours.", "url": "https://indianexpress.com/article/entertainment/bollywood/kiara-advani-sidharth-malhotra-break-up-i-am-hopeless-romantic-7910014/", "urlToImage": "https://images.indianexpress.com/2022/05/Kiara-Advani-1.jpg", "publishedAt": "2022-05-10T12:14:42Z", "content": "Kiara Advani started off her career with 2014 release Fugly. However, it was not the big dreamy Bollywood debut as it failed to perform at the box office. In an interview with Femina, Kiara revisited… [+1611 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Artists mourn santoor maestro Pt Shivkumar Sharma’s demise", "description": "Pune News: Pandit Shivkumar Sharma, who took a little-known instrument of santoor from Jammu and Kashmir and exalted it to the ranks of classical instruments, passed away in Mumbai on Tuesday. He was 84.", "url": "https://indianexpress.com/article/cities/pune/artists-mourn-santoor-maestro-pt-shivkumar-sharmas-demise-7910058/", "urlToImage": "https://images.indianexpress.com/2022/05/Pt.-Shivkumar.jpg", "publishedAt": "2022-05-10T12:12:54Z", "content": "It is in a thousand years that a personality like Pandit Shivji, my guru and light, takes birth in this world and I find myself truly fortunate to have been born at the same time, said Dilip Kale, di… [+2857 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Maharashtra CM Uddhav Thackeray announces state funeral for Pandit Shivkumar Sharma", "description": "Pandit Shivkumar Sharma's funeral will be held Wednesday at the Vile Parle Hindu cremation ground near the Juhu airport. Prior to that, the mortal remains will be at Sharma’s Juhu home for the antim darshan from 10 am to 1 pm.", "url": "https://indianexpress.com/article/cities/mumbai/cm-uddhav-thackeray-announces-state-funeral-for-pandit-shivkumar-sharma-7910027/", "urlToImage": "https://images.indianexpress.com/2022/05/shivkumar-1-1.jpg", "publishedAt": "2022-05-10T12:12:53Z", "content": "His funeral will be held Wednesday at the Vile Parle Hindu cremation ground near the Juhu airport. Prior to that, the mortal remains will be at Sharmas Juhu home for the antim darshan from 10 am to 1… [+874 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Union Minister Smriti Irani promises Amethi girl a visit to ISRO", "description": "BJP leader said “It is a matter of pride for Amethi that this girl wants to become a scientist. She will one day bring fame to Amethi,\" Smriti Irani further assured other students that she will help them in whatever way she can for their success.", "url": "https://indianexpress.com/article/education/union-minister-smriti-irani-promises-amethi-girl-visit-to-isro-7909933/", "urlToImage": "https://images.indianexpress.com/2022/05/smriti-irani-1200-1.jpg", "publishedAt": "2022-05-10T12:09:52Z", "content": "Union Minister Smriti Irani here on Tuesday promised a polytechnic student, who wants to become a scientist, a visit to the Indian Space Research Organisation (ISRO) next month.Irani asked a Jagdishp… [+1043 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mumbai raids: NIA identifies 21 ‘associates’ of don Dawood Ibrahim for questioning", "description": "The agency had on Monday carried out searches at 29 premises in and around Mumbai which are suspected to be linked with the fugitive gangsters’ associates and a few hawala operators.", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-raids-nia-21-associates-don-dawood-ibrahim-questioning-7909987/", "urlToImage": "https://images.indianexpress.com/2022/05/NIA-1.jpg", "publishedAt": "2022-05-10T12:07:29Z", "content": "Meanwhile, an NIA team is in Mohali to inspect the site of the rocket-propelled grenade (RPG) attack on Monday at the Punjab Police Intelligence headquarters.\r\nThe NIA had on Monday carried out searc… [+2771 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Ex-England batter Graham Thorpe ‘seriously ill’ in hospital", "description": "The Professional Cricketers' Association has released a statement on behalf of Graham Thorpe's family, stating that the former England international has \"fallen seriously ill and is currently in hospital receiving treatment.\"", "url": "https://indianexpress.com/article/sports/cricket/ex-england-batter-graham-thorpe-seriously-ill-in-hospital-7910054/", "urlToImage": "https://images.indianexpress.com/2022/03/thorpe.jpg", "publishedAt": "2022-05-10T12:07:19Z", "content": "Former England cricketer and assistant coach Graham Thorpe is “seriously ill” in hospital, the Professional Cricketers’ Association (PCA) has released a statement on Tuesday.Graham Thorpe has recentl… [+1826 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Kapil Sharma wonders how Kartik Aaryan has chemistry with all his co-stars, actor roasts him: ‘Just like you…’", "description": "Kartik Aaryan and Kiara Advani will appear on The Kapil Sharma Show to promote Bhool Bhulaiyaa 2.", "url": "https://indianexpress.com/article/entertainment/television/kapil-sharma-kartik-aaryan-chemistry-bhool-bhulaiyya-7909968/", "urlToImage": "https://images.indianexpress.com/2022/05/kapil1200.jpg", "publishedAt": "2022-05-10T12:05:08Z", "content": "Actors Kartik Aaryan and Kiara Advani will promote their upcoming film Bhool Bhulaiyya 2 on the next episode of The Kapil Sharma Show. On the show, Kapil Sharma tries to roast Kartik about his chemis… [+1690 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shreya Agrawal", "title": "Not just winters, summers can affect your heart, too: Follow these preventive measures", "description": "\"People who are already suffering from high blood pressures, diabetes, high cholesterol levels and pre-existing heart conditions are immensely affected, \" said Dr Ritwick Raj Bhuyan, director-adult cardiothoracic vascular surgery, Fortis Escorts Heart Institu…", "url": "https://indianexpress.com/article/lifestyle/health/summer-season-heart-health-symptoms-prevention-lifestyle-diet-7882392/", "urlToImage": "https://images.indianexpress.com/2022/04/heart-health_200_getty.jpg", "publishedAt": "2022-05-10T12:00:49Z", "content": "It is widely known that cardiovascular disease-induced deaths and risks increase dramatically during the winter season. Experts attribute this to the narrowing of heart blood vessels leading to less … [+6985 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kaushik Das Gupta", "title": "From frankie to shawarma, all food is desi", "description": "Why Tamil Nadu health Minister is wrong to call shawarma foreign", "url": "https://indianexpress.com/article/opinion/columns/from-frankie-to-shawarma-all-food-is-desi-v-7910036/", "urlToImage": "https://images.indianexpress.com/2022/05/ROLLS.jpg", "publishedAt": "2022-05-10T11:54:58Z", "content": "Legend has it that the idea for one of Mumbai’s best-loved street foods took root when former hockey player and salt refinery owner, Amarjeet Singh Tibb, chomped up a pita bread wrapped around a mass… [+4247 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Nirmal Pathak Ki Ghar Wapsi trailer: Vaibhav Tatwawadi struggles to initiate reform in his village", "description": "Nirmal Pathak Ki Ghar Wapsi stars Vaibhav Tatwawadi, Alka Amin, Vineet Kumar, Pankaj Jha, Akash Makhija, Kumar Saurabh, Garima Singh and Ishita Ganguly.", "url": "https://indianexpress.com/article/entertainment/web-series/nirmal-pathak-ki-ghar-wapsi-trailer-vaibhav-tatwawadi-7909993/", "urlToImage": "https://images.indianexpress.com/2022/05/1200-1.jpg", "publishedAt": "2022-05-10T11:50:15Z", "content": "The first trailer of Nirmal Pathak Ki Ghar Wapsi, which will stream on SonyLIV, has just dropped. Vaibhav Tatwawadi plays the role of Nirmal, a man who returns to his village after many years and rea… [+933 chars]"}]}