{"status": "ok", "totalResults": 858, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "May 13, 1982, Forty Years Ago: Falkland Battle", "description": "Two Argentine military planes were shot while attacking a British ship off the disputed Falkland Islands, the Defence Ministry announced. The ministry spokesperson reporting the action said three planes attacked the ship.", "url": "https://indianexpress.com/article/opinion/editorials/forty-years-ago-falkland-battle-7914394/", "urlToImage": "https://images.indianexpress.com/2022/05/13-May1982_IE_001.jpg", "publishedAt": "2022-05-12T22:21:04Z", "content": "Two Argentine military planes were shot while attacking a British ship off the disputed Falkland Islands, the Defence Ministry announced. The ministry spokesperson reporting the action said three pla… [+473 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Nirupama Subramanian", "title": "Explained: For 5th-time Lanka PM, political and economic challenge like no other", "description": "This is Wickremesinghe’s fifth time in the office. Each of his earlier terms was truncated, and on two of those occasions he was dismissed by the President — by Chandrika Kumaratunga in 2004, and by Maithripala Sirisena in 2018.", "url": "https://indianexpress.com/article/explained/explained-for-5th-time-lanka-pm-political-and-economic-challenge-like-no-other-7914502/", "urlToImage": "https://images.indianexpress.com/2022/05/Ranil-Wickremesinghe.jpg", "publishedAt": "2022-05-12T22:16:39Z", "content": "A month ago, in an interview to The Indian Express, Ranil Wickremesinghe said he would stay out if asked to become Prime Minister of Sri Lanka again, as he did not have the numbers to form a governme… [+5834 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "DYFI meet: Learn from Lanka stir, CPM urges youths", "description": "“This rally has proved that those evicted from their houses by the ruling party after the Assembly election results are still on the road, and they are fighting. Today, we have to take an oath that we will make history in this state,” added Salim.", "url": "https://indianexpress.com/article/cities/kolkata/dyfi-meet-learn-from-lanka-stir-cpm-urges-youths-7914625/", "urlToImage": "https://images.indianexpress.com/2022/05/YechuryDYFI-4col.jpg", "publishedAt": "2022-05-12T22:14:52Z", "content": "Addressing a Democratic Youth Federation of India’s (DYFI) rally just before the inauguration of an all-India conference of its youth wing on Thursday, CPI(M) West Bengal State Secretary Md Salim cal… [+1571 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pune: Con man dupes businessman of Rs 1.25 lakh in online fraud", "description": "The businessman got a call from the con man in October 2021, asking him to create a 'trading account' for investing money through a website.", "url": "https://indianexpress.com/article/cities/pune/pune-con-man-dupes-businessman-of-rs-1-25-lakh-in-online-fraud-7914623/", "urlToImage": "https://images.indianexpress.com/2022/05/cyber-crime.jpg", "publishedAt": "2022-05-12T22:10:41Z", "content": "Online fraudsters duped a Pune-based businessman of Rs 12.5 lakh by making him download a ‘remote desktop’ software on his cell phone after making false promises of huge profits through an online tra… [+1556 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "West Bengal: Sworn in as MLA, Babul Supriyo inducted into 4 Assembly panels", "description": "The former Union minister, who quit the BJP for the TMC last year, was absorbed as member of Home, Personnel and Administrative Reforms, Law and Correctional Administration standing committees of the House.", "url": "https://indianexpress.com/article/cities/kolkata/west-bengal-sworn-in-as-mla-babul-supriyo-inducted-into-4-assembly-panels-7914620/", "urlToImage": "https://images.indianexpress.com/2022/05/Babul-Supriyo-1200.jpg", "publishedAt": "2022-05-12T22:09:48Z", "content": "Day after  being read his oath of office by the Deputy Speaker, TMC MLA Babul Supriyo was on Thursday inducted into four standing committees of the Assembly.The former Union minister, who quit the BJ… [+1419 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Divya A", "title": "Court order on Kashi Vishwanath Temple-Gyanvapi Mosque site in Varanasi: history and context", "description": "The site is currently opened for Hindu prayers once a year — on the fourth day of the chaitra navratri in April. The petitioners have also sought permission to pray to other “visible and invisible deities within the old temple complex”.", "url": "https://indianexpress.com/article/explained/court-order-on-kashi-vishwanath-temple-gyanvapi-mosque-site-in-varanasi-history-and-context-7914495/", "urlToImage": "https://images.indianexpress.com/2022/05/Kashi-Vishwanath-Gyanvapi-1-1.jpg", "publishedAt": "2022-05-12T22:07:45Z", "content": "A Varanasi court on Thursday ordered that the video survey of the Gyanvapi Mosque located next to the Kashi Vishwanath Temple be resumed and a report submitted by May 17. The court had ordered the in… [+3540 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "In a first, India successfully launches Extended Range Version of BrahMos missile from Sukhoi", "description": "“The launch from the aircraft was as planned and the missile achieved a direct hit on the designated target in the Bay of Bengal region. It was the first launch of an Extended Range version of BrahMos missile from Su-30MKI aircraft,” said a statement from the…", "url": "https://indianexpress.com/article/cities/pune/in-a-first-india-successfully-launches-extended-range-version-of-brahmos-missile-from-sukhoi-7914621/", "urlToImage": "https://images.indianexpress.com/2022/05/brahmos-1.jpg", "publishedAt": "2022-05-12T22:04:40Z", "content": "A successful maiden launch of the Extended Range Version of BrahMos Air Launched was carried out by India on Thursday, which saw themissile set off from the Indian Air Force’s frontline fighter Sukho… [+2245 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuradha Mascarenhas", "title": "More Indians are anaemic than before, 67 pc children under 5 affected: NFHS-5", "description": "According to the survey report, at least 67 per cent children (6-59 months) have anaemia as compared to 58.6 per cent in the last survey conducted in 2015-16.", "url": "https://indianexpress.com/article/cities/pune/more-indians-are-anaemic-than-before-67-pc-children-under-5-affected-nfhs-5-7914613/", "urlToImage": "https://images.indianexpress.com/2021/11/kids.jpg", "publishedAt": "2022-05-12T21:57:30Z", "content": "An increasing number of people across all population groups, including children below five years, adolescent girls and boys, and pregnant women, is being affected by anaemia, findings from the fifth … [+4665 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Missing 20-year-old PDEU student’s body found in Narmada canal", "description": "According to police, the victim Aman Das, a resident of Chandkheda in Ahmedabad, who was in his sixth semester of a BTech course at PDEU, had gone missing from his university campus on Wednesday evening.", "url": "https://indianexpress.com/article/cities/ahmedabad/missing-20-year-old-pdeu-students-body-found-in-narmada-canal-7914618/", "urlToImage": "https://images.indianexpress.com/2022/05/IE-79-15.jpeg", "publishedAt": "2022-05-12T21:48:42Z", "content": "The body of a 20-year-old student of Gandhinagar-based Pandit Deendayal Energy University (PDEU) was recovered from Narmada canal in Sughad area on Thursday, a day after he went missing.According to … [+1368 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "14 state leaders in Udaipur to attend Cong’s chintan shivir", "description": "“14 Gujarat Congress senior leaders have already reached Udaipur for the  Chintan Shivir. The camp will focus on the roadmap for the 2024 General elections and various proposals ,” said Manish Doshi, spokesperson, GPCC.", "url": "https://indianexpress.com/article/cities/ahmedabad/14-state-leaders-in-udaipur-to-attend-congs-chintan-shivir-7914616/", "urlToImage": "https://images.indianexpress.com/2022/05/Jagdish-Thakor.jpg", "publishedAt": "2022-05-12T21:45:42Z", "content": "Ahead of the three day ‘Chintan Shivir’ of Congress scheduled in Udaipur of Rajasthan from Friday, as many as 14 senior leaders of Gujarat Congress arrived in the city on Thursday evening for the ses… [+754 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Shah and Yadav to preside BJP’s chintan shivir in Ahmedabad", "description": "Party officials said that the shivir is part of the party's preparations for the upcoming assembly elections. They added that only a small group of around 35-40 senior party office bearers are expected in the shivir.", "url": "https://indianexpress.com/article/cities/ahmedabad/shah-and-yadav-to-preside-bjps-chintan-shivir-in-ahmedabad-7914614/", "urlToImage": "https://images.indianexpress.com/2022/05/amit-shah-2col.jpg", "publishedAt": "2022-05-12T21:42:33Z", "content": "Union ministers Amit Shah and Bhupender Yadav will preside over a two day chintan shivir of the Bharatiya Janata Party (BJP) to be held on May 15 and 16 in a private club on Bavla-Nalsarovar road in … [+148 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Congress leaders detained, released after CM’s event in Bharuch", "description": "Early morning Thursday, the Bharuch police reached Amleshwar village in the Vagra taluka to detain Rana. Simultaneously, other police teams reached different talukas and detained Congress's youth wing president and other taluka presidents from their homes.", "url": "https://indianexpress.com/article/cities/surat/congress-leaders-detained-released-after-cms-event-in-bharuch-7914611/", "urlToImage": "https://images.indianexpress.com/2022/05/Bhupendra-Patel-1.jpg", "publishedAt": "2022-05-12T21:39:07Z", "content": "The Bharuch police detained around 15 Congress party leaders and workers from their homes in the district and released them later in the afternoon Thursday.The move comes a day after Bharuch district… [+983 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Haryana cops see red in digitisation of revenue records", "description": "The fraudsters log on to the Jamabandi website, fill in district and tehsil details and random dates, and then download all sale deeds for that day, the police stated.", "url": "https://indianexpress.com/article/cities/chandigarh/haryana-cops-see-red-in-digitisation-of-revenue-records-7914609/", "urlToImage": "https://images.indianexpress.com/2021/12/haryana-police-fb-2.jpg", "publishedAt": "2022-05-12T21:39:01Z", "content": "Haryana Police on Thursday raised a red flag on the state government’s digitisation of revenue records on the government’s website jamabandi.nic.in. Citing a recent case, wherein an accused lifted th… [+2049 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "2 cops booked for ‘extorting Rs 4.5 lakh’", "description": "An FIR was lodged against Piyush Kumar Pravinbhai and Kuldeepsinh Rajendrasinh. The siblings—Gaurang Patel (28) and Chandresh Patel (26)—run a honey shop in Narol.", "url": "https://indianexpress.com/article/cities/ahmedabad/2-cops-booked-for-extorting-rs-4-5-lakh-7914608/", "urlToImage": "https://images.indianexpress.com/2022/05/cop-2-1-10.jpg", "publishedAt": "2022-05-12T21:35:51Z", "content": "Two police constables attached with Maninagar police station in Ahmedabad have been booked for extorting Rs 4.5 lakh from two siblings after abducting and taking them to a police station under a fals… [+559 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Punjab: Polls to 2 Rajya Sabha seats on June 10", "description": "The term of office of Rajya Sabha members --Ambika Soni (Congress) and Balwinder Singh Bhunder (Shiromani Akali Dal) -- is due to expire on July 4.", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-polls-to-2-rajya-sabha-seats-on-june-10-7914605/", "urlToImage": "https://images.indianexpress.com/2022/05/voting-1200.jpg", "publishedAt": "2022-05-12T21:34:11Z", "content": "As the term of two Rajya Sabha members elected from Punjab is going to expire in July, the Election Commission of India Thursday announced schedule for biennial elections to the Upper House of Parlia… [+873 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "18-year-old suffers eye injury in cattle attack", "description": "The incident took place on Waghodia road when a stray cow suddenly jumped from the road divider and collided with Henil Patel, a diploma student of MSU's Polytechnic college, who was riding a two-wheeler.", "url": "https://indianexpress.com/article/cities/baroda/18-year-old-suffers-eye-injury-in-cattle-attack-7914584/", "urlToImage": "https://images.indianexpress.com/2022/05/cattle-1.jpg", "publishedAt": "2022-05-12T21:32:21Z", "content": "An 18-year-old student of MS University sustained grievous injuries after a horn of a stray cow pierced into his eyes Wednesday.The incident took place on Waghodia road when a stray cow suddenly jump… [+1569 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sukhbir Siwach", "title": "Post uproar, Haryana reverses decision on loans to varsities, says grant will continue", "description": "The teaching and non-teaching employees of 13 state-run universities have been protesting the government decision of offering loan to the universities instead of grants-in-aid ever since the finance department took a decision in this regard on April 29 this y…", "url": "https://indianexpress.com/article/cities/chandigarh/post-uproar-haryana-reverses-decision-on-loans-to-varsities-says-grant-will-continue-7914604/", "urlToImage": "https://images.indianexpress.com/2022/04/KHATTAR.jpg", "publishedAt": "2022-05-12T21:30:34Z", "content": "After facing major protests against its decision to give loans to the universities instead of grants-in-aid, the Haryana government Thursday announced that the state will continue the support univers… [+4605 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sandeep Singh", "title": "Inflation, rate cuts, falling markets: what now", "description": "Market sentiments have been negative for now amid apprehensions that the RBI could go for a series of rate hikes to keep inflation under check. The Fed has already hiked rates twice in the last two months, by 25 basis points in March and by 50 basis points la…", "url": "https://indianexpress.com/article/explained/inflation-rate-cuts-falling-markets-what-now-7914478/", "urlToImage": "https://images.indianexpress.com/2022/05/inflation-reuters-1200-1.jpeg", "publishedAt": "2022-05-12T21:30:11Z", "content": "The sharp outflow of foreign portfolio investor (FPI) money from Indian markets amid concerns over global growth, rising inflation and monetary tightening by central banks has accelerated the fall in… [+3221 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Power theft: PSPCL fines Bhikhiwind dera Rs 26L", "description": "A PSPCL spokesman said that the enforcement team was investigating a complaint regarding theft of electricity.", "url": "https://indianexpress.com/article/cities/ludhiana/power-theft-pspcl-fines-bhikhiwind-dera-rs-26l-7914603/", "urlToImage": "https://images.indianexpress.com/2021/10/pspcl-main-759.jpg", "publishedAt": "2022-05-12T21:22:19Z", "content": "The enforcement wing of the Punjab State Power Corporation Limited (PSPCL) has detected theft of electricity at a Bhikhiwind dera — Dera Baba Bidhi Chand — in Tarn Taran district and imposed a fine o… [+869 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Divya Goyal", "title": "Punjab: 25-yr-old dies after taking drugs, his friends dump body in drain", "description": "Meanwhile, the youth's father alleged that for four days since his son went missing on May 8, he was made to run from one police station to the other as cops refused to register the FIR.", "url": "https://indianexpress.com/article/cities/ludhiana/punjab-25-yr-old-dies-after-taking-drugs-his-friends-dump-body-in-drain-7914600/", "urlToImage": "https://images.indianexpress.com/2022/05/Moga-man.jpg", "publishedAt": "2022-05-12T21:17:54Z", "content": "Four days after he went missing, the Moga Police Thursday recovered the body of a 25-year old youth from a drain after his suspected death due to drug consumption. His three friends, who allegedly ga… [+3174 chars]"}]}