{"status": "ok", "totalResults": 408, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Antonio Guterres", "title": "A Renewables Revolution", "description": "As we wean ourselves off fossil fuels, benefits will be vast, and not just to the climate", "url": "https://indianexpress.com/article/opinion/columns/climate-change-crisis-energy-fuels-coal-oil-gas-renewable-energy-8004060/", "urlToImage": "https://images.indianexpress.com/2022/07/oil.jpg", "publishedAt": "2022-07-01T22:45:54Z", "content": "Nero was famously accused of fiddling while Rome burned. Today, some leaders are doing worse. They are throwing fuel on the fire. Literally. As the fallout of Russias invasion of Ukraine ripples acro… [+4402 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pimpri-Chinchwad may get first cabinet berth, Landge frontrunner", "description": "Congress leader Babu Nair said if Mahesh Landge becomes a state minister this time, he will be the first leader from the city to do so.", "url": "https://indianexpress.com/article/cities/pune/pimpri-chinchwad-may-get-first-cabinet-berth-landge-frontrunner-8004142/", "urlToImage": "https://images.indianexpress.com/2022/07/shinde12.jpg", "publishedAt": "2022-07-01T22:43:50Z", "content": "WITH Eknath Shinde taking over as the 20th chief minister of Maharashtra and slated to induct his ministers in next two days, a leader from Pimpri-Chinchwad may, for the first time, get a place in th… [+1927 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Alifiya Khan", "title": "Learning engineering in mother tongue: Amid poor response elsewhere, Pune college fills seats", "description": "While it was assumed that the opportunity to learn in their mother tongue would entice many to seek admission in such courses, the ground reality is different.", "url": "https://indianexpress.com/article/cities/pune/learning-engineering-in-mother-tongue-amid-poor-response-elsewhere-pune-college-fills-seats-8004140/", "urlToImage": "https://indianexpress.com/wp-content/themes/indianexpress/images/IE-OGimage.jpg", "publishedAt": "2022-07-01T22:34:43Z", "content": "Six months ago when he was taking admission in a computer engineering course at a college in Pune’s Akurdi area, 19-year-old Atharva Ingle did not know that his batch would be a historic one. The Ako… [+4484 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Girish Kuber", "title": "Win and lose", "description": "For Devendra Fadnavis, Maharashtra drama didn't end the way it was supposed to. Thereby hangs a tale.", "url": "https://indianexpress.com/article/opinion/columns/bjp-modi-amit-shah-maharashra-uddhav-shiv-sena-eknath-shinde-8004053/", "urlToImage": "https://images.indianexpress.com/2022/07/bjp.jpg", "publishedAt": "2022-07-01T22:30:25Z", "content": "As the BJP’s top leadership gathers in Hyderabad for its national executive, it will have one more trophy to display on its wall: The state of Maharashtra. Even though former Chief Minister Devendra … [+6119 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Soumya Kanti Ghosh", "title": "How the bank held its own", "description": "Contrary to the criticism from some quarters, RBI has done well to balance inflation and growth during exceptionally trying circumstances", "url": "https://indianexpress.com/article/opinion/columns/how-the-bank-held-its-own-8002098/", "urlToImage": "https://images.indianexpress.com/2022/07/oped.jpeg", "publishedAt": "2022-07-01T22:00:44Z", "content": "Several articles published of late have been uncharacteristically harsh about the RBI’s inflation management. Writing an epitaph for such articles reminds me of a recent interaction with RBI Deputy G… [+6631 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pallavi Smart", "title": "Change of Maharashtra govt brings focus back on vexed Public Universities Act Amendment Bill", "description": "Notably, Higher and Technical Education minister from the MVA government, Uday Samant of the Shiv Sena, who earlier promoted the amendments, is now part of the new state government under Chief Minister Eknath Shinde.", "url": "https://indianexpress.com/article/cities/mumbai/change-of-govt-brings-focus-back-on-vexed-public-universities-act-amendment-bill-8004132/", "urlToImage": "https://images.indianexpress.com/2022/07/Pune-colleges.jpeg", "publishedAt": "2022-07-01T21:03:25Z", "content": "Following the change in government, a new discussion has begun in university circles across Maharashtra the moves possible impact on the Maharashtra Public Universities Act Amendment Bill.The bill, w… [+1584 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Nirupama Subramanian", "title": "‘Best foreign secretary that India never had’, led back-channel talks with Pak", "description": "As then Prime Minister Manmohan Singh’s Special Envoy to Pakistan, Lambah held discreet behind-the-scene talks with his counterpart Tariq Aziz, appointed for the back-channel process by then military ruler General Parvez Musharraf.", "url": "https://indianexpress.com/article/cities/chennai/best-foreign-secretary-that-india-never-had-led-back-channel-talks-with-pak-8004084/", "urlToImage": "https://indianexpress.com/wp-content/themes/indianexpress/images/IE-OGimage.jpg", "publishedAt": "2022-07-01T20:29:47Z", "content": "Satinder Lambah, the diplomat who led the back-channel process between India and Pakistan from 2005 till 2014, and was unshaken until the end in his conviction that engagement with an adversary was a… [+6820 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mumbai daily Covid-19 caseload drops with 978 fresh Covid cases; Maharashtra logs 3,249", "description": "Maharashtra recorded 3,249 new cases and four more deaths on the day. Active Covid cases stood at 23,996 as of July 1.", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-daily-covid-19-caseload-drops-with-978-fresh-covid-cases-maharashtra-news-8004130/", "urlToImage": "https://images.indianexpress.com/2022/07/covid.jpg", "publishedAt": "2022-07-01T20:27:11Z", "content": "New Covid cases in Mumbai dropped further to 978 on Friday, a day after the city registered 1,265 cases. Mumbai’s daily caseload plunged by 22.6 per cent in the last 24 hours. The test positivity rat… [+557 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sagar Rajput", "title": "Money laundering case: Shiv Sena MP Sanjay Raut appears before ED", "description": "ED sources said Shiv Sena MP Sanjay Raut presented himself at 11.45am and was quizzed for around ten hours.", "url": "https://indianexpress.com/article/cities/mumbai/sanjay-raut-money-laundering-maharashtra-ed-case-8004127/", "urlToImage": "https://images.indianexpress.com/2022/07/sanjay-raut.jpg", "publishedAt": "2022-07-01T20:18:13Z", "content": "Shiv Sena MP and party spokesperson Sanjay Raut appeared before the Enforcement Directorate (ED) on Friday. The federal agency had summoned him for questioning in connection with a case of alleged mo… [+2129 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Bashaarat Masood", "title": "Hyderpora encounter: HC upholds compensation to family of Amir Magray", "description": "A division bench of Chief Justice Justice Pankaj Mithal and Justice Javed Iqbal said: \"Appellants to pay compensation of Rs.5.00 lakhs, awarded by the Writ Court, to respondent no.1 is maintained.\"", "url": "https://indianexpress.com/article/cities/srinagar/hyderpora-encounter-hc-upholds-compensation-to-family-of-amir-magray-8004125/", "urlToImage": "https://images.indianexpress.com/2020/12/JK-HC.jpg", "publishedAt": "2022-07-01T20:15:29Z", "content": "The J&amp;K High Court on Friday upheld a compensation of Rs 5 lakhs to the family of Amir Magray, a Jammu youth killed in Hyderpora gunfight in November last year. The court said the appeal for exhu… [+2523 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Rainfall lash Rajkot and Amreli dists", "description": "Lodhika taluka of Rajkot district received 115 millimetres (mm) of rain during the day Friday, an official release said.", "url": "https://indianexpress.com/article/cities/rajkot/rainfall-lash-rajkot-and-amreli-dists-8004123/", "urlToImage": "https://images.indianexpress.com/2022/06/monsoon.jpeg", "publishedAt": "2022-07-01T20:01:38Z", "content": "PARTS OF Rajkot district were lashed by heavy rain leading to temporary waterlogging in many areas Friday. Moderate rainfall was reported from Amreli also.Lodhika taluka of Rajkot district received 1… [+1173 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Esha Roy", "title": "MoEF proposes amendments in Environment Protection Act, to decriminalize provisions", "description": "The ministry has proposed the removal of imprisonment as a penalty for the \"less severe’’ contraventions. Incidentally, the EPA provisions\r\nwill be in force for penal provisions of the single use plastic ban which has come into force from today.", "url": "https://indianexpress.com/article/india/moef-proposes-amendments-environment-protection-act-decriminalize-provisions-8004120/", "urlToImage": "https://images.indianexpress.com/2022/03/bhupendra-yadav-1-1.jpg", "publishedAt": "2022-07-01T19:54:01Z", "content": "The Ministry of Environment, Forests and Climate Change has today proposed the decriminalisation of the existing provisions of the Environment Protection Act, 1986. The EPA is the overarching environ… [+2802 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Jayprakash S Naidu", "title": "Shop owner in Amravati likely killed for post supporting Nupur Sharma", "description": "The incident took place between 10 pm to 10.30 pm on June 21 when Umesh Kolhe was on his way home after closing his shop ‘Amit Medical Store’. Sanket, 27, and his wife Vaishnavi were accompanying him on another scooter.", "url": "https://indianexpress.com/article/cities/mumbai/shop-owner-in-amravati-likely-killed-for-post-supporting-nupur-sharma-udaipur-killing-8004116/", "urlToImage": "https://images.indianexpress.com/2022/07/Express-Representational-Image-46-4.jpeg", "publishedAt": "2022-07-01T19:48:35Z", "content": "EXACTLY a week before tailor Kanhaiyalal Teli was hacked to death in Udaipur, Umesh Prahladrao Kolhe, a 54-year-old chemist, was killed in Maharashtras Amravati district on June 21. Investigators now… [+3453 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "2014 student death case: Sherwood principal, 2 others found guilty of negligence, sent to 2-yr jail", "description": "In November 2014, Shaan, a student from Nepal, had died of pneumonia and septicemia while on his way from a hospital in Haldwani to a higher centre in Noida, where he was declared brought dead.", "url": "https://indianexpress.com/article/india/2014-student-death-case-sherwood-principal-2-found-guilty-negligence-jail-8004118/", "urlToImage": "https://images.indianexpress.com/2022/07/arrest-2.jpg", "publishedAt": "2022-07-01T19:44:50Z", "content": "The Court of Chief Judicial Magistrate (CJM) in Nainital has pronounced principal Amandeep Sandhu, infirmary in-charge sister Payal Paul and warden Ravi Kumar guilty of criminal negligence in the 201… [+3291 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Deep Mukherjee", "title": "Udaipur killing: Two more arrested; Rath Yatra procession taken out amid heavy police deployment", "description": "The Special Operations Group and the ATS of the Rajasthan Police issued a statement saying media reports claiming that the NIA said there was no terrorist organisation's hand in the killing were “premature” because the investigation is in a preliminary stage.", "url": "https://indianexpress.com/article/cities/jaipur/udaipur-killing-two-arrested-rath-yatra-procession-taken-heavy-police-deployment-8004114/", "urlToImage": "https://images.indianexpress.com/2022/07/udaipur-killing.jpeg", "publishedAt": "2022-07-01T19:38:49Z", "content": "The Rajasthan Police on Friday arrested two more accused for the murder of Udaipur-based tailor Kanhaiya Lal on June 28, with officials saying they were involved in the conspiracy to plan and execute… [+5026 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Bharuch: 21 held for ‘sprinkling inflammable material on pan shop, elderly woman’", "description": "The police said that 23 have been named in the police complaint based on video footage, while the remaining nine are yet to be identified.", "url": "https://indianexpress.com/article/cities/surat/bharuch-21-held-for-sprinkling-inflammable-material-on-pan-shop-elderly-woman-8004110/", "urlToImage": "https://images.indianexpress.com/2022/07/Express-Representational-Image-46-3.jpeg", "publishedAt": "2022-07-01T19:36:36Z", "content": "The Bharuch police arrested 21 youths for allegedly “trying to set fire to a pan shop and an elderly woman” by sprinkling an inflammable material after a quarrel erupted between the shop owner and tw… [+1850 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sreenivas Janyala", "title": "Ahead of BJP national executive meet, Nadda holds roadshow in Hyderabad", "description": "The BJP welcomed the party chief with a show of strength with almost all state BJP leaders, including state BJP chief Bandi Sanjay Kumar; Union Minister G Kishan Reddy; district coordinators, and others, converging at the airport to welcome Nadda.", "url": "https://indianexpress.com/article/cities/hyderabad/ahead-of-bjp-national-executive-meet-nadda-holds-roadshow-hyderabad-8004109/", "urlToImage": "https://images.indianexpress.com/2022/07/Nadda-in-Telangana-1.jpg", "publishedAt": "2022-07-01T19:33:30Z", "content": "The BJP held a massive roadshow led by party national president J P Nadda at Shamshabad on the outskirts of Hyderabad today evening, ahead of the two-day national executive meeting.The BJP welcomed t… [+2522 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Peter Vidal", "title": "Horoscope Today, July 2 2022: Leo, Libra, Virgo and other signs — check astrological prediction", "description": "Cancer - A continuing planetary emphasis on money, in all its forms, eclipses any other consideration in your chart", "url": "https://indianexpress.com/article/horoscope/horoscope-today-july-2-2022-leo-libra-virgo-and-other-signs-check-astrological-prediction-7991631/", "urlToImage": "https://images.indianexpress.com/2022/07/horoscope_3.jpg", "publishedAt": "2022-07-01T19:30:14Z", "content": "Two regions of your chart are stimulated today, one dealing with lovers, the other with friends. What links the two is the thought that it is people who are older, or otherwise more experienced, who … [+3301 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Issued him ‘eligible’ hall ticket: MS varsity prohibits rusticated student from appearing for exam", "description": "The Faculty of Fine Arts (FFA) handed over a letter to Kundan on Friday stating that since he has been debarred, he cannot be allowed to appear for the examinations.", "url": "https://indianexpress.com/article/cities/baroda/vadodara-ms-university-gujarat-8004106/", "urlToImage": "https://images.indianexpress.com/2022/07/MSU.jpg", "publishedAt": "2022-07-01T19:26:51Z", "content": "Vadodara MS University Friday prohibited Kundan Kumar Mahato, the former Fine Arts student who was debarred on May 13 following a controversy over an artwork, from appearing for the regular offline e… [+2852 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Plea to CJI seeks withdrawal of remarks against Nupur", "description": "The letter petition by Delhi resident and social activist Ajay Gautam referred to the remarks as reported by various media houses and said the “observation made by the court is unwanted, uncalled and without any merit and liable to (be) withdraw(n)”.", "url": "https://indianexpress.com/article/cities/delhi/plea-to-cji-seeks-withdrawal-of-remarks-against-nupur-8004107/", "urlToImage": "https://images.indianexpress.com/2022/07/nupur-sharma-1-5.jpeg", "publishedAt": "2022-07-01T19:25:56Z", "content": "WITH THE observations of a two-judge Supreme Court bench of Justices Surya Kant and J B Pardiwala lambasting suspended BJP spokesperson Nupur Sharma for her remarks on the Prophet during a TV show an… [+1877 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Avinash Nair", "title": "Ensure BJP gets 3/4th majority in Gujarat polls: Shah tells voters", "description": "The Union Home Minister said, \"BJP has ensured an all-round development of Gujarat. Be it urban, rural, mountains or coastal areas, the BJP government has developed all areas.\"", "url": "https://indianexpress.com/article/cities/ahmedabad/ensure-bjp-gets-3-4th-majority-in-gujarat-polls-shah-tells-voters-8004103/", "urlToImage": "https://images.indianexpress.com/2022/06/amit-shah-2-1.jpeg", "publishedAt": "2022-07-01T19:19:46Z", "content": "Emphasising that the Bharatiya Janata Party (BJP) has ensured an all-round development of Gujarat, Union Home Minister Amit Shah Friday asked voters in the state to ensure a three-fourth majority for… [+2888 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Nitin Sharma", "title": "Alleged age fraud in badminton: Parents protest on court, Under-13 tournament postponed for a day", "description": "While some of the parents sat on the court stopping the matches midway, BAI observer Bamang Tago was seen urging the parents to let the matches happen.", "url": "https://indianexpress.com/article/sports/badminton/alleged-age-fraud-in-badminton-parents-protest-on-court-under-13-tournament-postponed-for-a-day-8004102/", "urlToImage": "https://images.indianexpress.com/2022/07/Badminton-4.jpg", "publishedAt": "2022-07-01T19:18:56Z", "content": "In a first in, a sub-junior ranking U-13 badminton tournament of the Badminton Association of India (BAI) was stopped midway and postponed for a day after more than 60 parents protested over alleged … [+2444 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kamaal Saiyed", "title": "Gujarat: Airstrip at Surat airport to be strengthened using steel slag", "description": "Sources said that through e-tendering, Adroit Structural Engineers Private Limited from Vadodara was given the work for ground improvement and stabilisation of the runway strip in October 2021.", "url": "https://indianexpress.com/article/cities/surat/gujarat-airstrip-at-surat-airport-to-be-strengthened-using-steel-slag-8004100/", "urlToImage": "https://images.indianexpress.com/2022/07/flight.png", "publishedAt": "2022-07-01T19:18:05Z", "content": "The Surat airport will strengthen its airstrip using steel slag as per the International Civil Aviation Organisation (ICAO) recommendations and Civil Aviation Requirements (CAR), according to airport… [+2465 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Iram Siddique", "title": "Booth capturing: Four in MP village get show-cause notice", "description": "Told to pay Rs 5.02 lakh re-polling cost or face demolition of houses.", "url": "https://indianexpress.com/article/cities/bhopal/booth-capturing-four-in-mp-village-get-show-cause-notice-8004086/", "urlToImage": "https://images.indianexpress.com/2022/07/Gavel.jpg", "publishedAt": "2022-07-01T19:11:53Z", "content": "Four people accused of booth capturing were issued show-cause notices and told to deposit Rs 5.02 lakh as the cost district administration had to bear for the re-polling or face demolition of their i… [+2261 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sandip G", "title": "Kohli luckless but looked good, rest of top order shaky against masterful Anderson and spirited Potts", "description": "The master craftsman Anderson and the newbie Potts accentuate the weakness of Indian top order who collapse to 98 for 5.", "url": "https://indianexpress.com/article/sports/cricket/kohli-luckless-but-looked-good-rest-of-top-order-shaky-against-masterful-anderson-and-spirited-potts-8004091/", "urlToImage": "https://images.indianexpress.com/2022/07/IND-top-order.jpg", "publishedAt": "2022-07-01T19:03:31Z", "content": "As the barrel-chested Matthew Potts barged into his teammates in joy after terminating Virat Kohli, the former India skipper stared helplessly at Rishabh Pant, the non-striker, before he flashed a wr… [+4306 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gujarat CM flags off procession: Jagannath Rath Yatra held amid fanfare, tight security", "description": "On Friday, the ceremony began around 4 am when Union Home Minister Amit Shah arrived at the temple premises to conduct the “Mangla Aarti”. Shah left shortly after.", "url": "https://indianexpress.com/article/cities/ahmedabad/gujarat-jagannath-rath-yatra-bhupendra-patel-amit-shah-8004094/", "urlToImage": "https://images.indianexpress.com/2022/07/bhupendra-ptel.jpg", "publishedAt": "2022-07-01T19:02:59Z", "content": "The 145th Lord Jagannath Rath Yatra was concluded in old city Ahmedabad amid huge fanfare and heavy police security Friday as Chief Minister Bhupendra Patel flagged off the procession only three days… [+2758 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gujarat weather: Rainfall lash Rajkot and Amreli districts", "description": "The rain led to temporary waterlogging in Indrapasthnagar underpass, sections of 150-feet Ring Road, Kothariya Road, etc.", "url": "https://indianexpress.com/article/cities/rajkot/gujarat-monsoons-rainfall-rajkot-amreli-weather-8004090/", "urlToImage": "https://images.indianexpress.com/2022/07/rain.jpg", "publishedAt": "2022-07-01T18:54:02Z", "content": "PARTS OF Rajkot district were lashed by heavy rain leading to temporary waterlogging in many areas Friday. Moderate rainfall was reported from Amreli also.Lodhika taluka of Rajkot district received 1… [+1176 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sandip G", "title": "It’s Dhoni, it’s Gilchrist, no it’s Rishabh Pant", "description": "With a combination of breath-taking swagger and percentage cricket, India's crisis man shows he is a worthy Gilchrist reincarnation.", "url": "https://indianexpress.com/article/sports/cricket/its-dhoni-its-gilchrist-no-its-rishabh-pant-8004081/", "urlToImage": "https://images.indianexpress.com/2022/07/Pant-100.jpg", "publishedAt": "2022-07-01T18:42:15Z", "content": "Under the gloomy Edgbaston skies, Rishabh Pant made another leap into greatness. He cracked 146 off 111 balls in a staggering exhibition of counterpunching to make the first day of the series-decider… [+6392 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Apurva Vishwanath", "title": "Explained: Law & precedent on clubbing of cases, and SC denial of Nupur Sharma plea", "description": "A vacation Bench of Justices Surya Kant and J B Pardiwala, while refusing to grant interim relief, criticised the remarks she had made leading to the case against her.", "url": "https://indianexpress.com/article/explained/explained-law-precedent-clubbing-of-cases-sc-denial-nupur-sharma-plea-8004078/", "urlToImage": "https://images.indianexpress.com/2022/07/Nupur-sharma-explained.png", "publishedAt": "2022-07-01T18:37:48Z", "content": "ON FRIDAY, the Supreme Court declined a plea by former BJP spokesperson Nupur Sharma to club the hate speech cases filed against her across the country. A vacation Bench of Justices Surya Kant and J … [+4815 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "Ajker Rashifal bengali, 2 July 2022: সাবধান! পরিবারে ভাঙন ধরতে পারে এই রাশির জাতকদের", "description": "আজকের রাশিফল ২ জুলাই, জানুন কী আছে আজ ভাগ্যে?", "url": "https://bengali.indianexpress.com/horoscope/ajker-rashifal-july-2-2022-aries-taurus-gemini-cancer-leo-virgo-libra-scorpio-sagittarius-capricorn-aquarius-pisces-464081/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/sat1.jpg", "publishedAt": "2022-07-01T18:35:00Z", "content": "/ Aries  Rashifal ( March 21 – April 20 )\r\n/ Taurus  Rashifal ( April 21 – May 21 )\r\n/ Gemini  Rashifal ( May 22 – June 21 )\r\n/ Cancer Rashifal  ( June 22 – July 23 )\r\n [ -, ] \r\n/ Leo   Rashifal  ( J… [+336 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "‘Murmu could’ve been consensus candidate if NDA consulted Opp’", "description": "Speaking to mediapersons during a Rath Yatra programme in Kolkata, Banerjee said Murmu has a better chance of winning the Presidential election.", "url": "https://indianexpress.com/article/cities/kolkata/murmu-couldve-been-consensus-candidate-if-nda-consulted-opp-8004061/", "urlToImage": "https://images.indianexpress.com/2022/07/mamata-759-1-1-1-5.jpg", "publishedAt": "2022-07-01T18:34:53Z", "content": "West Bengal Chief Minister Mamata Banerjee on Friday said that Droupadi Murmu, the National Democratic Alliance (NDA) nominee for the Presidential polls, could have been a consensus candidate had the… [+1934 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kaushik Das Gupta", "title": "Explained: Concise companion to a bestselling treatise", "description": "Thomas Piketty’s latest work, A Brief History of Equality, is a slimmer and a far less dense companion volume to Capital — and to his 2019 work Capital and Ideology.", "url": "https://indianexpress.com/article/explained/explained-concise-companion-to-a-bestselling-treatise-8004075/", "urlToImage": "https://images.indianexpress.com/2022/07/FotoJet-2022-07-01T235341.265-logo.png", "publishedAt": "2022-07-01T18:27:05Z", "content": "In 2014, French economist Thomas Pikettys Capital in The Twenty-First Century became one of the rare hardcore economics books to feature on bestseller lists. Written in the backdrop of the Occupy Mov… [+2703 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "70-yr-old woman falls into sewer pit, rescued", "description": "The house inmates, after learning about the incident, called the fire department officials. The villagers also gathered and inserted a rope into the pit but the woman could not hold it.", "url": "https://indianexpress.com/article/cities/surat/70-yr-old-woman-falls-into-sewer-pit-rescued-8004064/", "urlToImage": "https://images.indianexpress.com/2022/07/Indian-expressss-1.jpg", "publishedAt": "2022-07-01T18:15:53Z", "content": "Fire department officials on Friday rescued a 70-year-old woman who fell into a 20-feet-deep sewer pit outside her house in Surat.According to the fire officials, the incident took place on Friday mo… [+318 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Nihal Koshie", "title": "Why Chopra won’t have to throw 90 metres to finish on the podium at Worlds", "description": "Since the start of the millennium just seven of the 48 medalists at the Olympics and Championships have crossed the barrier.", "url": "https://indianexpress.com/article/sports/sport-others/why-chopra-wont-have-to-throw-90-metres-to-finish-on-the-podium-at-worlds-8004063/", "urlToImage": "https://images.indianexpress.com/2022/07/neerajmain.jpg", "publishedAt": "2022-07-01T18:11:00Z", "content": "If Neeraj Chopra is getting tired of the 90-metre question, the genial javelin thrower isn’t showing it. 88.06 metres, a then national record, at the Jakarta Asian Games four years ago had first rais… [+5783 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rahul V Pisharody", "title": "Telangana junior doctors continue their protest for pending stipends on National Doctors’ Day", "description": "Health Minister T Harish Rao says the government is trying to find a solution to the issue of delayed payments.", "url": "https://indianexpress.com/article/cities/hyderabad/telangana-junior-doctors-protest-pending-stipends-national-doctors-8004055/", "urlToImage": "https://images.indianexpress.com/2022/07/Telangana.jpg", "publishedAt": "2022-07-01T18:01:43Z", "content": "Amid National Doctors’ Day posters and banners greeting them, senior residentspostgraduate doctors in compulsory one-year government serviceintensified their protest over pending stipends, boycotting… [+4555 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Namit Kumar", "title": "Who is Tim Van Rijthoven? Novak Djokovic’s Wimbledon R4 opponent who was winless on tour until last month", "description": "The Dutchman received a wildcard for the main draw at SW19 following a fairytale grass title in his home country three weeks ago.", "url": "https://indianexpress.com/article/sports/tennis/who-is-tim-van-rijthoven-novak-djokovics-wimbledon-r4-opponent-who-was-winless-on-tour-until-last-month-8004052/", "urlToImage": "https://images.indianexpress.com/2022/07/Tim-Van-Rijthoven.jpg", "publishedAt": "2022-07-01T17:42:55Z", "content": "Tim Van Rijthoven was not supposed to be at Wimbledon. Until three weeks ago, according to every conceivable metric used to judge elite-level tennis, the 25-year-old was nowhere near the sports oldes… [+5174 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pallavi Smart", "title": "Change in govt brings contentious Public Universities Act Amendment Bill back in focus", "description": "The bill, which was passed by the cabinet in December last year under the Maha Vikas Aghadi (MVA) government amid strong opposition from the Bharatiya Janata Party (BJP), has been pending for the Governor’s final nod.", "url": "https://indianexpress.com/article/cities/mumbai/change-in-govt-brings-contentious-public-universities-act-amendment-bill-8004047/", "urlToImage": "https://images.indianexpress.com/2022/07/shinde12-1-1.jpg", "publishedAt": "2022-07-01T17:41:39Z", "content": "Following the change in government, a new discussion has begun in university circles across the state the moves possible impact on the Maharashtra Public Universities Act Amendment Bill.The bill, whi… [+2929 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Biden to award Medal of Freedom to Steve Jobs, actor Denzel Washington", "description": "Biden will also recognize Sandra Lindsay, the New York City nurse who rolled up her sleeve on live television in December 2020 to receive the first COVID-19 vaccine dose that was pumped into an arm in the United States, the White House announced Friday.", "url": "https://indianexpress.com/article/world/biden-to-award-medal-of-freedom-to-steve-jobs-actor-denzel-washington-8004051/", "urlToImage": "https://images.indianexpress.com/2022/05/Joe-BIden-2.jpg", "publishedAt": "2022-07-01T17:33:37Z", "content": "President Joe Biden will present the nation’s highest civilian honor, the Presidential Medal of Freedom, to 17 people, including actor Denzel Washington, gymnast Simone Biles and the late John McCain… [+5115 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Karnataka electric vehicles exhibition begins in Bengaluru with more than 100 stalls", "description": "The exhibition has more than 100 stalls to display products, solutions and technologies from different parts of the globe.", "url": "https://indianexpress.com/article/cities/bangalore/karnataka-electric-vehicles-exhibition-begins-in-bengaluru-with-around-100-stalls-8004048/", "urlToImage": "https://images.indianexpress.com/2022/07/ev.jpg", "publishedAt": "2022-07-01T17:23:43Z", "content": "The Karnataka governments electric vehicles exhibition was inaugurated by Chief Minister Basavaraj Bommai on Friday.The EV Abhiyaana will be held at Chamara Vajra, Palace Grounds, in Bengaluru till S… [+1819 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "John Isner sets world record for aces during his Wimbledon 3rd round match", "description": "The American now stands alone on top of the mountain with 13,729 untouchable serves and counting, passing Croatia's Ivo Karlovic's previous leading mark of 13,728.", "url": "https://indianexpress.com/article/sports/tennis/john-isner-sets-world-record-for-aces-during-wimbledon-3rd-round-match-8004038/", "urlToImage": "https://images.indianexpress.com/2022/07/Isner.jpg", "publishedAt": "2022-07-01T17:22:17Z", "content": "John Isner literally became the king of aces when he broke the all-time record for serving aces on Friday in his Wimbledon third-round match against Italian Jannik Sinner.The American now stands alon… [+1240 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Poor financial condition drives 3 of a Mansa family to commit suicide", "description": "The deceased have been identified as Suresh Kumar (36), his wife Kajal (32) and their 10-year-old son Harish.", "url": "https://indianexpress.com/article/cities/ludhiana/poor-financial-condition-drives-3-of-a-mansa-family-to-commit-suicide-8004042/", "urlToImage": "https://images.indianexpress.com/2022/07/Indian-expressss.jpg", "publishedAt": "2022-07-01T17:16:17Z", "content": "Three members of a family in Thuthianwali village of Mansa district have allegedly committed suicide by jumping into Kotla branch canal. They reportedly took the extreme step due to poor financial co… [+1353 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Ludhiana top officials launch ‘healthy campus’ drive to keep college students from drugs", "description": "Chairing a meeting with the principals of city-based colleges, the CP and DC said that this campaign was aimed at creating maximum awareness against ill-effects of drugs among college-going students.", "url": "https://indianexpress.com/article/cities/ludhiana/ludhiana-college-students-drugs-problem-healthy-campus-addiction-8004035/", "urlToImage": "https://images.indianexpress.com/2022/07/punjab.jpg", "publishedAt": "2022-07-01T17:15:56Z", "content": "In an effort to keep college students from drugs, Ludhiana police commissioner (CP) Kaustubh Sharma and deputy commissioner (DC) Surabhi Malik launched a ‘healthy campus’ campaign on Friday.Chairing … [+1779 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Gayathri Mani", "title": "Explained: Delhi withdraws circle rate rebate, how does it affect what buyers pay for property?", "description": "Circle rates are minimum prices per unit area determined by the government. A property cannot be registered for a price below the circle rate for that area.", "url": "https://indianexpress.com/article/explained/explained-delhi-circle-rate-rebate-buyers-property-8004037/", "urlToImage": "https://images.indianexpress.com/2022/07/dda-flats-1200.jpg", "publishedAt": "2022-07-01T17:10:28Z", "content": "As the Delhi government on Thursday (June 30) ended the 20 per cent rebate on the circle rate, there were apprehensions that property prices in the national capital would go up.Buyers would have to p… [+2282 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "UT to take lessons from Maharashtra, its neighbours for EWS admissions", "description": "The State Advisory Council has been constituted as per the provisions of Right To Education (RTE) Act to advise the government regarding implementation of various provisions of the Act and has UT Adviser Dharam Pal as its chairperson.", "url": "https://indianexpress.com/article/cities/chandigarh/ut-to-take-lessons-from-maharashtra-its-neighbours-for-ews-admissions-8004025/", "urlToImage": "https://images.indianexpress.com/2021/07/newsline-delhi-ews-2col.jpg", "publishedAt": "2022-07-01T17:06:50Z", "content": "THE 11th meeting of the State Advisory Council on Friday decided that the UT education department will study the practices and procedures being followed by the government of Maharashtra and those by … [+166 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Sam Gilliam ‘took a step most people didn’t understand was possible’", "description": "Sam Gilliam and his work left a deep impact on his fellow artists and friends.", "url": "https://indianexpress.com/article/lifestyle/art-and-culture/sam-gilliam-took-a-step-most-people-didnt-understand-was-possible-7997617/", "urlToImage": "https://images.indianexpress.com/2022/06/NYT.jpg", "publishedAt": "2022-07-01T17:00:04Z", "content": "(An Appraisal)\r\nWhen painter Sam Gilliam died last weekend at age 88, he left behind pioneering artworks, particularly his draped canvases stained with blooms of color that forever changed the way th… [+6237 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Footpath in Peddar Road cracks open in heavy rain, no one harmed", "description": "The landslide took place near an under-construction building at Peddar road, a couple of buildings away from the residence of the late singing legend Lata Mangeshkar.", "url": "https://indianexpress.com/article/cities/mumbai/footpath-in-peddar-road-cracks-open-in-heavy-rain-no-one-harmed-8004023/", "urlToImage": "https://images.indianexpress.com/2022/07/mumbai.jpg", "publishedAt": "2022-07-01T16:58:53Z", "content": "The incessant heavy rainfall in South Mumbai since Wednesday night triggered a landslide at midnight in the Tony Peddar Road area of Mumbai. The landslide resulted in the footpath along the stretch t… [+1569 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anonna Dutt", "title": "Understanding Covid sub-variants: ‘If you’ve had BA.2, it can protect you against BA.4, BA.5’", "description": "The peaks of the latest wave of Covid-19 infections across the country are likely to be smaller with previous exposure to the BA.2 sub-variant offering better protection against emerging variants as compared to its cousin BA.1. Still, it is time to develop a …", "url": "https://indianexpress.com/article/lifestyle/health/understanding-covid-sub-variants-ba-2-ba-4-ba-5-8004028/", "urlToImage": "https://images.indianexpress.com/2022/07/doctor.jpg", "publishedAt": "2022-07-01T16:55:08Z", "content": "Dr Agarwal is a trained pulmonologist, whose research focusses on respiratory disease biology. He was at the helm of the Institute of Genomics and Integrative Biology when the pandemic hit and has be… [+6007 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "‘This Taliban incident’ was not reaction, but result of a belief system: RSS", "description": "RSS publicity chief Sunil Ambekar says the new generation should discuss Partition to ensure 'powers that talk about secession and terrorism do not take root' in the country.", "url": "https://indianexpress.com/article/india/taliban-incident-not-reaction-but-result-of-belief-system-rss-8004020/", "urlToImage": "https://images.indianexpress.com/2022/07/sunil-ambekar-1200.jpg", "publishedAt": "2022-07-01T16:50:23Z", "content": "On a day the Supreme Court came down heavily on suspended BJP spokesperson Nupur Sharma saying she “is single-handedly responsible for what is happening in the country”, the RSS suggested that “this … [+3187 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Julian Assange appeals to UK court against extradition to US", "description": "Julian Assange has battled in British courts for years to avoid being sent to the U.S., where he faces 17 charges of espionage and one charge of computer misuse.", "url": "https://indianexpress.com/article/world/julian-assange-appeals-uk-court-extradition-us-8004015/", "urlToImage": "https://images.indianexpress.com/2022/07/assange.jpg", "publishedAt": "2022-07-01T16:49:30Z", "content": "WikiLeaks founder Julian Assange has appealed against the British’s government decision last month to order his extradition to the US.The appeal was filed Friday at the High Court, the latest twist i… [+2071 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Raakhi Jagga, Kanchan Vasdev", "title": "AAP govt keeps its word, free 300 units of power for Punjab comes into effect", "description": "The announcement came from Chief Minister Bhagwant Mann, who in a video message said that the guarantee would be rolled out from Friday. He said that up to 300 units of electricity would be free for Punjab power consumers from this month.", "url": "https://indianexpress.com/article/cities/chandigarh/aap-govt-punjab-bhagwant-mann-free-electricity-8004013/", "urlToImage": "https://images.indianexpress.com/2022/06/bhagwant-mann-3.jpg", "publishedAt": "2022-07-01T16:39:28Z", "content": "The Punjab government on Friday rolled out its first pre-election guarantee of providing 300 units of free power every month to the residents of the state.The announcement came from Chief Minister Bh… [+4346 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Santanu Chowdhury", "title": "Amid open war between Mamata, Dhankhar over Chancellor role, RBU V-C a new front", "description": "Taking to Twitter, the Governor announced Thursday that he has appointed Mahua Mukherjee, a professor in the RBU's dance department, as its next V-C.", "url": "https://indianexpress.com/article/political-pulse/open-war-between-mamata-dhankhar-over-chancellor-role-rbu-v-c-new-front-8003994/", "urlToImage": "https://images.indianexpress.com/2022/07/Mamata-oath.jpeg", "publishedAt": "2022-07-01T16:29:48Z", "content": "West Bengal Governor Jagdeep Dhankhar has triggered a fresh confrontation with the Mamata Banerjee-led Trinamool Congress (TMC) government by naming the new vice-chancellor of the state-run Rabindra … [+4820 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Debraj Deb", "title": "Many injured as Tripura Rath Yatra elephant runs amok, chariot crest falls on devotees", "description": "Devotees believe they will be absolved of sins if they pull the chariot of Lord Jagannath Dev.", "url": "https://indianexpress.com/article/north-east-india/tripura/many-injured-tripura-rath-yatra-elephant-runs-amok-chariot-crest-falls-devotees-8003997/", "urlToImage": "https://images.indianexpress.com/2022/07/Tripura-yatra.jpg", "publishedAt": "2022-07-01T16:29:19Z", "content": "A policeman, a woman and two children were among those injured during Rath Yatras in Tripura’s Gomati and South Tripura districts on Friday.At Debdaru village in the Shantirbazaar subdivision of Sout… [+2070 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Maha: First-time MLA Narvekar is BJP nominee for speaker post; Cong asks why hold election now", "description": "The Congress sought to know how Governor Bhagat Singh Koshyari can allow the Speaker's election now when he did not give consent for the process when the Shiv Sena-led alliance was in power.", "url": "https://indianexpress.com/article/cities/mumbai/maha-first-time-mla-narvekar-bjp-nominee-speaker-cong-why-election-now-8003982/", "urlToImage": "https://images.indianexpress.com/2022/07/Maha-crisis-1.jpg", "publishedAt": "2022-07-01T16:28:20Z", "content": "First-time Bharatiya Janata Party (BJP) MLA Rahul Narvekar on Friday filed his nomination as the party candidate for the post of Maharashtra Assembly speaker, election for which, if required, will be… [+4459 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Novak Djokovic schools Kecmanovic to reach last 16 again", "description": "The top seed was unplayable in the opening set of his third-round match on Centre Court, taking it in 24 minutes.", "url": "https://indianexpress.com/article/sports/tennis/djokovic-schools-kecmanovic-to-reach-last-16-again-8003998/", "urlToImage": "https://images.indianexpress.com/2022/07/Djokovic-wimbledon.jpg", "publishedAt": "2022-07-01T16:26:05Z", "content": "Novak Djokovic clinically disposed of fellow Serb Miomir Kecmanovic as he continued his relentless pursuit of a fourth successive Wimbledon title with a 6-0 6-3 6-4 victory on Friday.The top seed was… [+830 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Chicago shooting during dispute leaves 2 dead, 3 wounded", "description": "Two men in their 20s were pronounced dead at a hospital, police said, and two other men were wounded along with a fifth person. The wounded were reported in good condition.", "url": "https://indianexpress.com/article/world/chicago-shooting-during-dispute-leaves-2-dead-3-wounded-8003983/", "urlToImage": "https://images.indianexpress.com/2022/07/indian-express.jpg", "publishedAt": "2022-07-01T16:20:16Z", "content": "A person opened fire during a verbal dispute early Friday in downtown Chicago, killing two men and wounding three other people, police said.The five who were shot were leaving a business about 1:45 a… [+1008 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Project Muskurata Bachpan: Ludhiana DC appoints two nodal officers to stop child labor", "description": "According to details, the project will address the basic needs and rights of children engaged or at risk of child labour.", "url": "https://indianexpress.com/article/cities/ludhiana/project-mukturata-bachpan-ludhiana-dc-appoints-two-nodal-officers-stop-child-labor-8003966/", "urlToImage": "https://images.indianexpress.com/2022/07/Surabhi-Malik.jpg", "publishedAt": "2022-07-01T16:20:13Z", "content": "Ludhiana Deputy Commissioner, Surabhi Malik, on Friday appointed two nodal officers Friday under the project ‘Muskurata Bachpan’ that will be aimed at stopping the practice of child labour in the dis… [+1574 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Mertens beats former Wimbledon champion Kerber to reach last 16", "description": "Mertens achieved her best showing at the grasscourt Grand Slam in 2019 when she reached the round of 16 and came into Friday's contest having defeated the three-times major winner in their only previous meeting three years ago.", "url": "https://indianexpress.com/article/sports/tennis/mertens-beats-former-wimbledon-champion-kerber-to-reach-last-16-8003987/", "urlToImage": "https://images.indianexpress.com/2022/07/Kerber.jpg", "publishedAt": "2022-07-01T16:19:51Z", "content": "Belgian Elise Mertens stayed solid against an error-prone Angelique Kerber of Germany to defeat the former Wimbledon champion 6-4 7-5 on Friday and reach the fourth round.Mertens achieved her best sh… [+1378 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sreenivas Janyala", "title": "Ahead of BJP national executive meeting, JP Nadda holds roadshow near Hyderabad", "description": "Apart from members of BJP, a massive crowd gathered on the roadside as JP Nadda’s roadshow proceeded.", "url": "https://indianexpress.com/article/cities/hyderabad/ahead-of-bjp-national-executive-meeting-jp-nadda-holds-roadshow-hyderabad-8003955/", "urlToImage": "https://images.indianexpress.com/2022/07/Nadda.jpg", "publishedAt": "2022-07-01T16:15:51Z", "content": "The BJP held a massive roadshow headed by party national president J P Nadda at Shamshabad on the outskirts of Hyderabad Friday evening, ahead of the two-day national executive meeting slated to be h… [+3376 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "২৮৩ বছরে গুপ্তিপাড়ার রথযাত্রা, উৎসব ঘিরে লোকারণ্য", "description": "বছরের অন্যসময়ে ঐতিহ্যপূর্ণ বৃন্দাবনচন্দ্র মঠের পাশে বছরভর এই রথ পেল্লাই টিনের খাঁচায় ভরা থাকে।", "url": "https://bengali.indianexpress.com/west-bengal/rath-yatra-2022-283-year-old-guptiparas-rath-464198/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/Guptipara-Rath-Yatra.jpg", "publishedAt": "2022-07-01T16:12:57Z", "content": ", , , - , \r\n , , \r\n-- , \r\n , , , / - \r\nStay updated with the latest news headlines and all the latest Westbengal news download Indian Express Bengali App.\r\nWeb Title: Rath yatra 2022 283 year old gup… [+11 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Popular Vermont ski resort ‘Suicide Six’ to change ‘insensitive’ name", "description": "\"Our resort team embraces the increasing awareness surrounding mental health and shares the growing concerns about the insensitive nature of the historical name,\" the resort said", "url": "https://indianexpress.com/article/lifestyle/destination-of-the-week/popular-vermont-ski-resort-suicide-six-change-insensitive-name-8000558/", "urlToImage": "https://images.indianexpress.com/2022/06/skiing-1200.jpg", "publishedAt": "2022-07-01T16:10:03Z", "content": "One of the earliest ski resorts, Suicide Six, is located in South Pomfret, Vermont. It is of historic importance as the resort was the location of the first National Snow Surfing Championships in 198… [+1554 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Complex heart surgery with world’s smallest heart pump saves 90-year-old man at PGI", "description": "Gupta said that the patient was not fit for open heart surgery but at the same time the angioplasty procedure was also very complex and high-risk as the patient had heavily calcified left main trifurcation disease with a weak heart.", "url": "https://indianexpress.com/article/cities/chandigarh/complex-heart-surgery-with-worlds-smallest-heart-pump-saves-90-year-old-man-at-pgi-8003967/", "urlToImage": "https://images.indianexpress.com/2022/05/pgimer-12-1.jpg", "publishedAt": "2022-07-01T16:05:33Z", "content": "Doctors at PGI’s Advanced Cardiac Centre, under the guidance of Prof Yash Paul Sharma, have successfully conducted a rare high-risk heart surgery the first in the institute’s history.A team of doctor… [+1508 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "WHO says Monkeypox cases in Europe tripled in last two weeks", "description": "To date, more than 5,000 monkeypox cases have been reported from 51 countries worldwide, according to the US Centres for Disease Control and Prevention.", "url": "https://indianexpress.com/article/world/who-monkeypox-europe-tripled-last-two-weeks-8003958/", "urlToImage": "https://images.indianexpress.com/2022/07/monkeypox-vaccine.jpg", "publishedAt": "2022-07-01T16:03:52Z", "content": "The World Health Organisation’s Europe chief warned on Friday that monkeypox cases in the region have tripled in the last two weeks and urged countries to do more to ensure the previously rare diseas… [+4007 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Maria stuns fifth seed Sakkari to reach first major fourth round", "description": "Maria will next face 12th-seeded Latvian Jelena Ostapenko, the 2017 French Open champion, for a place in the quarter-finals of the grasscourt major.", "url": "https://indianexpress.com/article/sports/tennis/maria-stuns-fifth-seed-sakkari-to-reach-first-major-fourth-round-8003962/", "urlToImage": "https://images.indianexpress.com/2022/07/Maria.jpg", "publishedAt": "2022-07-01T16:00:06Z", "content": "Germany’s Tatjana Maria, at 34 the oldest player left in the women’s draw, knocked fifth seed Maria Sakkari out of Wimbledon 6-3 7-5 on Friday to make the fourth round of a Grand Slam for the first t… [+778 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuradha Mascarenhas", "title": "Explained: Two vaccine doses highly effective across people of different body weights, study suggests", "description": "A new study published in The Lancet Diabetes and Endocrinology has found that body size was not a factor in the effectiveness of vaccines — two doses are highly effective against severe disease for people who are underweight, overweight, or who have obesity.", "url": "https://indianexpress.com/article/explained/explained-two-vaccine-doses-effective-people-body-weights-study-8003940/", "urlToImage": "https://images.indianexpress.com/2021/12/Omicron-explained.jpg", "publishedAt": "2022-07-01T15:58:01Z", "content": "Obesity has been identified as a risk factor for severe Covid-19 since early in the pandemic, but little was known until now about the effectiveness of the vaccines for people with obesity. Now a new… [+4084 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Meena requests people to not spread ‘false information’ about her husband’s death", "description": "Meena Sagar took to social media and requested people to respect the privacy of her family and not spread \"false information\" about her husband's death.", "url": "https://indianexpress.com/article/entertainment/tamil/meena-requests-people-to-not-spread-false-information-about-her-husband-death-8003905/", "urlToImage": "https://images.indianexpress.com/2022/07/meena-sagar.jpg", "publishedAt": "2022-07-01T15:50:08Z", "content": "Actor Meenas husband Vidya Sagar passed away on June 28 in Chennai after reportedly suffering from a severe lung infection. On Friday, the actor took to social media to thank everyone who stood by he… [+1178 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aksheev Thakur", "title": "Rs 14-cr grants for Nimhans to study integrative-medicine approaches involving Ayurveda, yoga", "description": "The premier institute in Bengaluru will carry out Ayurveda- and yoga-based clinical trials for disorders such as schizophrenia, Alzheimer’s disease, mood disorders and multiple sclerosis.", "url": "https://indianexpress.com/article/cities/bangalore/grants-for-nimhans-study-integrative-medicine-approaches-involving-ayurveda-yoga-8003944/", "urlToImage": "https://images.indianexpress.com/2022/07/nimhans.jpg", "publishedAt": "2022-07-01T15:50:07Z", "content": "The National Institute of Mental Health and Neuro Sciences (Nimhans) in Bengaluru has received Rs 14-crore research grants–Rs 10 crore from the Ayush ministry and the rest from other agencies–to carr… [+2151 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Truck hits vehicle of Suvendu Adhikari’s convoy, none hurt", "description": "According to the officer, a speeding Kalyani-Digha route bus went past the vehicle, which, in a bid to avoid a collision, moved to the right and got hit by a truck instead.", "url": "https://indianexpress.com/article/cities/kolkata/truck-hits-vehicle-of-suvendu-adhikaris-convoy-none-hurt-8003884/", "urlToImage": "https://images.indianexpress.com/2022/07/Suvendu-Adhikari-Vehicle.jpg", "publishedAt": "2022-07-01T15:45:46Z", "content": "A truck hit one of the vehicles in Bengal Leader of Opposition (LoP) Suvendu Adhikari’s convoy on Friday afternoon when he was on his way to Kanthi from Tamluk, a police officer said.No one sustained… [+1226 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shaju Philip", "title": "Explosive hurled at Kerala CPM office: Police say yet to identify suspect; CPM, Cong engage in blame game", "description": "The explosive was thrown at one of the gates of the AKG Centre around 11.30 pm Thursday by a person on a two-wheeler as half a dozen policemen stood guard at another entrance of the CPI(M) office.", "url": "https://indianexpress.com/article/cities/thiruvananthapuram/explosive-hurled-kerala-cpm-office-police-yet-identify-suspect-cpm-cong-blame-game-8003887/", "urlToImage": "https://images.indianexpress.com/2022/07/afk_kerela.jpg", "publishedAt": "2022-07-01T15:45:07Z", "content": "A DAY after an explosive was hurled at the CPI(M)s state headquarters, AKG Centre, in Thiruvananthapuram, police on Friday said they were investigating to identify the suspect even as the ruling part… [+2506 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sanjana Bhalerao", "title": "Heavy overnight rainfall throws parts of Mumbai out of gear; flooding, traffic diversions follow", "description": "With sudden bursts and high-intensity rainfall, South Mumbai residents saw a repeat of August 2020, “uncommon” flooding in parts of South Mumbai such as Breach Candy, Girgaum, Churchgate and Marine lines, among others.", "url": "https://indianexpress.com/article/cities/mumbai/heavy-overnight-rainfall-mumbai-flooding-traffic-diversions-8003909/", "urlToImage": "https://images.indianexpress.com/2022/07/mumbairains.jpeg", "publishedAt": "2022-07-01T15:43:09Z", "content": "Incessant overnight rain followed by intermittent showers during the day threw parts of Mumbai out of gear, with the city experiencing severe waterlogging and traffic diversions for the second consec… [+3367 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Raakhi Jagga", "title": "Free power lure ‘splits’ families in Punjab, applications pile up for separate meters", "description": "According to the highly placed sources within the PSPCL, the powercorp has received more than 63,000 such applications since May 1. Of this, sources said, nearly 38,000 have been approved while close to 10,000 have been rejected.", "url": "https://indianexpress.com/article/cities/ludhiana/free-power-lure-splits-families-in-punjab-applications-pile-up-for-separate-meters-8003937/", "urlToImage": "https://images.indianexpress.com/2022/07/electricity-reuters-1200-2-1.jpeg", "publishedAt": "2022-07-01T15:42:08Z", "content": "Hoping to get 300 units free power every month, thousands of domestic consumers have submitted applications at the PSPCL offices for splitting the single meter installed at their households into two … [+1341 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Parthasarathi Biswas", "title": "Maharashtra farmers race ahead with sowing, top official hopeful of no resowing", "description": "Rainfall—though not heavy showers—was regular in the past 15 days, with most areas receiving continual drizzles, according to Agriculture commissioner Dheeraj Kumar.", "url": "https://indianexpress.com/article/cities/pune/maharashtra-farmers-race-ahead-with-sowing-top-official-hopeful-of-no-resowing-8003917/", "urlToImage": "https://images.indianexpress.com/2022/07/Maha-farmer-rep.jpg", "publishedAt": "2022-07-01T15:37:09Z", "content": "Farmers in Maharashtra have raced ahead with their sowing, all thanks to the medium-but-constant rains the state has received in the past few weeks. Compared with the 55.05 lakh hectares of sowing re… [+1953 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "JEE Main 2022: NTA opens correction window for session 2 forms; check details", "description": "Candidates who wish to make corrections in their application forms can now do so by visiting the official JEE website — jeemain.nta.nic.in — before July 3, 2022.", "url": "https://indianexpress.com/article/education/jee-main-2022-nta-opens-correction-window-for-session-2-forms-check-details-jeemain-nta-nic-in-8003890/", "urlToImage": "https://images.indianexpress.com/2022/07/JEE-Main-2022-3.jpg", "publishedAt": "2022-07-01T15:35:15Z", "content": "The National Testing Agency (NTA) has decided to allow candidates to modify their particulars in the online application form of JEE (Main) 2022 Session 2. Candidates who wish to make corrections in t… [+2133 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Shiv Sena MPs undecided on joining Eknath Shinde camp", "description": "A central BJP minister claimed that the split in the Shiv Sena in Maharashtra would also have an impact in the Lok Sabha as at least a dozen Lok Sabha members of the outfit, out of the total 19, were ready to switch sides.", "url": "https://indianexpress.com/article/cities/mumbai/shiv-sena-mps-undecided-joining-eknath-shinde-camp-8003731/", "urlToImage": "https://images.indianexpress.com/2022/07/Eknath-Main-1.jpg", "publishedAt": "2022-07-01T15:34:24Z", "content": "Shiv Sena parliamentarians are still undecided on joining the breakaway faction led by Maharashtra Chief Minister Eknath Shinde amid claims by the BJP leaders that at least a dozen Lok Sabha members … [+1875 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "বিজয়োৎসবে গরহাজির ফড়ণবিশ! বিজেপির উপর কি অসন্তুষ্ট উপমুখ্যমন্ত্রী? শুরু কানাঘুষো", "description": "মুখ্যমন্ত্রী না হতে পেরে কি ক্ষুব্ধ ফড়ণবিশ?", "url": "https://bengali.indianexpress.com/politics/devendra-fadnavis-missing-at-bjps-celebration-of-return-to-power-in-maharashtra-464191/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/Devendra-Fadnavis.jpg", "publishedAt": "2022-07-01T15:34:09Z", "content": ", ! ( ), - ! - , , ?\r\n - - , - \r\n , : \r\n ? , \r\n - , \r\n , , , , \r\nStay updated with the latest news headlines and all the latest Politics news download Indian Express Bengali App.\r\nWeb Title: Devendra… [+70 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "Boss taking offence to subordinate’s ‘hey’ on WhatsApp has everyone weighing in", "description": "While many thought the replies from the boss were uncalled for, others said they did not agree with the boss but understood where he was coming from.", "url": "https://indianexpress.com/article/trending/trending-in-india/boss-taking-offence-to-subordinates-hey-on-whatsapp-has-everyone-weighing-in-8003772/", "urlToImage": "https://images.indianexpress.com/2022/07/boss-hey-offence.jpg", "publishedAt": "2022-07-01T15:33:23Z", "content": "Gone are days when there were strict strict rules and decorum in the professional world. As times move forward more and more people are moving away from rigidity and adopting flexibility in the way t… [+2465 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Gold import duty hike: Demand in spot market may not be impacted in the long term, feel analysts", "description": "The Centre’s attempt to reduce import bills by hiking the import duty on gold by a sharp 5 per cent, may not affect demand for the precious metal significantly according to market experts.", "url": "https://indianexpress.com/article/business/commodities/gold-import-duty-hike-demand-in-spot-market-may-not-be-impacted-in-the-long-term-feel-analysts-8003542/", "urlToImage": "https://images.indianexpress.com/2022/07/j-759.jpg", "publishedAt": "2022-07-01T15:32:09Z", "content": "The demand for gold in the key spot markets of the country may not see a significant drop in the mid-to-long term despite the sharp hike in the import duty of the precious metal, market experts said.… [+4947 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Liz Mathew", "title": "Sidelights of BJP national executive meet starting tomorrow", "description": "The first day of the BJP national executive will begin with a meeting of the general secretaries in Hyderabad. Senior leaders wonder if Devendra Fadnavis will attend the meeting wherein PM Modi and all senior leaders will be present throughout.", "url": "https://indianexpress.com/article/political-pulse/sidelights-of-bjp-national-executive-meet-8003882/", "urlToImage": "https://images.indianexpress.com/2022/07/Tarun.jpg", "publishedAt": "2022-07-01T15:31:49Z", "content": "The Bharatiya Janata Party (BJP) is holding its two-day national executive meeting in Hyderabad on July 2 and 3.Will Fadnavis attend meet?\r\nThe first day of the BJP national executive will begin with… [+2160 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Abhinaya Harigovind", "title": "Single-use plastic alternatives few, costly: Traders in Delhi", "description": "Some wholesale suppliers of such products say they stopped purchasing stock a while ago.", "url": "https://indianexpress.com/article/cities/delhi/single-use-plastic-alternatives-few-costly-traders-in-delhi-8003877/", "urlToImage": "https://images.indianexpress.com/2020/03/plastic-1.jpg", "publishedAt": "2022-07-01T15:26:25Z", "content": "With the country-wide ban on single-use plastic items setting in from July 1, wholesalers and shop owners selling these items say alternatives to plastic are few and still pricey.Manufacture, distrib… [+3194 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Liverpool’s Salah signs long-term contract extension", "description": "\"I feel great and (I am) excited to win trophies with the club. It's a happy day for everyone,\" Salah said in a statement on the club website.", "url": "https://indianexpress.com/article/sports/football/liverpools-salah-signs-long-term-contract-extension-8003885/", "urlToImage": "https://images.indianexpress.com/2022/07/Salah.jpg", "publishedAt": "2022-07-01T15:26:08Z", "content": "Liverpool forward Mohamed Salah has signed a long-term contract extension at the club, the Premier League side said on Friday.Liverpool did not provide details but Sky Sports reported that the Egypt … [+1008 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Penalties for violating single-use plastic ban will kick in after July 10 in Delhi: Environment Minister Gopal Rai", "description": "The penalty for violating the ban is as per provisions of the Environment Protection Act, 1986. “This can be a fine of up to Rs 1 lakh or up to five years imprisonment,” Rai said.", "url": "https://indianexpress.com/article/cities/delhi/penalties-violating-single-use-plastic-ban-july-10-delhi-environment-minister-gopal-rai-8003878/", "urlToImage": "https://images.indianexpress.com/2022/07/Gopal-rai.jpg", "publishedAt": "2022-07-01T15:21:38Z", "content": "As the nation-wide ban on 19 single-use plastic items kicked in on Friday, Delhi Environment Minister Gopal Rai said penalties for violating the ban will be imposed only after July 10. Till then, he … [+3202 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Kim Kardashian’s SKIMS called out for ‘greenwashing’ over packaging claims", "description": "The triangular logo, which is a recycling symbol, inside which the number '4' appears, indicates the packaging is made from type-4 plastic", "url": "https://indianexpress.com/article/lifestyle/life-style/kim-kardashian-skims-brand-greenwashing-packaging-claims-8002896/", "urlToImage": "https://images.indianexpress.com/2022/07/Kim-Kardashian-1200.jpg", "publishedAt": "2022-07-01T15:20:24Z", "content": "Kim Kardashian‘s shapewear and clothing brand SKIMS courted new controversy after it was recently accused of ‘greenwashing’.Buy Now | Our best subscription plan now has a special price\r\nGreenwashing,… [+2021 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "JEE Main 2022: NTA to reopen application window after session 1 result", "description": "Interested candidates will be able to apply for JEE Main session 2 exams from the official JEE website — jeemain.nta.nic.in — after the declaration of the JEE (Main) – 2022 Session 1 result.", "url": "https://indianexpress.com/article/education/jee-main-2022-nta-to-reopen-application-window-after-session-1-result-jeemain-nta-nic-in-8003872/", "urlToImage": "https://images.indianexpress.com/2022/07/JEE-Main-2022-2.jpg", "publishedAt": "2022-07-01T15:11:37Z", "content": "“In view of the persistent demand from the student community to re-open the Online Application Forms for Joint Entrance Examination (Main) 2022 Session 2 (July 2022), and to support them, it has been… [+1396 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Vallabh Ozarkar", "title": "Don’t harm Mumbai because you are angry with me: Thackeray to BJP on Metro shed decision", "description": "Questions move to install ‘so-called Shiv Sena man’ Shinde as CM, says there would have been no MVA had BJP honoured its promise of rotating the post between the two parties", "url": "https://indianexpress.com/article/cities/mumbai/dont-harm-mumbai-thackeray-bjp-metro-shed-decision-8003874/", "urlToImage": "https://images.indianexpress.com/2022/06/uddhav-10-1.jpg", "publishedAt": "2022-07-01T15:03:30Z", "content": "A day after Maharashtras new Chief Minister Eknath Shinde and deputy CM Devendra Fadnavis overturned the decision of the previous MVA government to shift Mumbai Metro-3 carshed to Kanjurmarg from Aar… [+3193 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Soumyarendra Barik", "title": "Govt asks social media firms to remove all content that justify Udaipur killing", "description": "In a missive sent to social media platforms, the ministry said that apart from the videos of the murder that were uploaded online, several instances have come to its notice where social media handles glorified or justified the killing.", "url": "https://indianexpress.com/article/india/govt-asks-social-media-firms-remove-content-justify-udaipur-killing-8003854/", "urlToImage": "https://images.indianexpress.com/2021/09/ch1573466.jpg", "publishedAt": "2022-07-01T14:58:36Z", "content": "THE MINISTRY of Electronics and Information Technology (MeitY) has directed all social media companies to proactively and immediately remove all content that encourages, glorifies or justifies the re… [+3383 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Navmi Krishna", "title": "Explained: US Supreme Court’s EPA ruling and what it means for the fight against climate change", "description": "The US Supreme Court judgment limiting the power of the EPA to regulate the emission of greenhouse gases is set to have a long-term impact on the country's battle against the climate crisis. How, why, what next  — we explain.", "url": "https://indianexpress.com/article/explained/explained-us-supreme-court-epa-ruling-climate-change-8002994/", "urlToImage": "https://images.indianexpress.com/2022/04/climate-change-explainer.jpg", "publishedAt": "2022-07-01T14:58:25Z", "content": "After an action-packed week following the abortion judgment, the United States Supreme Court Thursday delievered another significant ruling. It curbed the ability of the Environmental Protection Agen… [+6140 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Vivek Agnihotri calls R Madhavan ‘a true patriot’, hopes Rocketry becomes as successful as The Kashmir Files", "description": "Rocketry: The Nambi Effect has been written and directed by R Madhavan. He also plays the lead role of Nambi Narayanan, Head of ISRO’s cryogenics division in the film.", "url": "https://indianexpress.com/article/entertainment/bollywood/vivek-agnihotri-calls-r-madhavan-a-true-patriot-hopes-rocketry-becomes-as-successful-as-the-kashmir-files-8003794/", "urlToImage": "https://images.indianexpress.com/2022/07/rocketry-madhavan-vivek-agnihotri-1200.jpg", "publishedAt": "2022-07-01T14:51:38Z", "content": "Filmmaker Vivek Agnihotri gave a shout-out to R Madhavan’s directorial debut Rocketry: The Nambi Effect on Friday. Taking to his Twitter handle, Vivek urged the audience to watch the movie. He also h… [+1279 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "African officials: Monkeypox spread is already an emergency", "description": "The U.N. health agency said it would reconsider its decision if the disease continued spreading across more borders, showed signs of increased severity, or began infecting vulnerable groups like pregnant women and children.", "url": "https://indianexpress.com/article/world/african-officials-monkeypox-spread-is-already-an-emergency-8003802/", "urlToImage": "https://images.indianexpress.com/2022/06/Monkey-pox-4.jpg", "publishedAt": "2022-07-01T14:48:16Z", "content": "Health authorities in Africa say they are treating the expanding monkeypox outbreak there as an emergency and are calling on rich countries to share the world’s limited supply of vaccines in an effor… [+3957 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "2014 student death case: Sherwood principal, 2 others found guilty of negligence, sent to 2-year jail", "description": "The trio has been sentenced to two-year jail besides being imposed a fine of Rs 50,000 each. Taken into custody, the trio was later released on interim bail.", "url": "https://indianexpress.com/article/india/2014-student-death-case-sherwood-principal-guilty-negligence-jail-8003838/", "urlToImage": "https://images.indianexpress.com/2022/04/gavel-1.jpeg", "publishedAt": "2022-07-01T14:41:17Z", "content": "The Court of Chief Judicial Magistrate (CJM) in Nainital has pronounced principal Amandeep Sandhu, infirmary in-charge sister Payal Paul and warden Ravi Kumar guilty of criminal negligence in the 201… [+3224 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Navjeevan Gopal", "title": "Pushed to Punjab politics margins, Capt Amarinder likely to merge PLC with BJP", "description": "A former Congress veteran, Amarinder resigned from the membership of the grand old party in early November last year one-and-half months after he was unceremoniously replaced with Charanjit Singh Channi as the CM by the Congress leadership.", "url": "https://indianexpress.com/article/political-pulse/pushed-to-punjab-politics-margins-capt-amarinder-likely-to-merge-plc-with-bjp-8003771/", "urlToImage": "https://images.indianexpress.com/2022/07/Modi-Singh.jpg", "publishedAt": "2022-07-01T14:37:20Z", "content": "The former Pujab chief minister Capt Amarinder Singh is likely to merge his Punjab Lok Congress (PLC) with the Bharatiya Janata Party (BJP) in the coming days upon his return from London, where the 8… [+2874 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "When Manoj Pahwa ate with Rishi Kapoor during Mulk shoot: ‘Chef from Taj used to cook for him, his food was spread on the entire table’", "description": "In a recent interview, Manoj Pahwa shared that during the shoot of Mulk in Lucknow, Rishi Kapoor asked him to eat with him. He also talked about working with Shammi Kapoor and Ranbir Kapoor.", "url": "https://indianexpress.com/article/entertainment/bollywood/manoj-pahwa-ate-with-rishi-kapoor-mulk-shoot-chef-from-taj-used-to-cook-for-him-8003797/", "urlToImage": "https://images.indianexpress.com/2022/07/rishi-kapoor-manoj-pahwa.jpg", "publishedAt": "2022-07-01T14:33:13Z", "content": "Bollywood actor Manoj Pahwa, popular for his comic roles like Bhatia of Office Office, Dilbagh Singh of Singh Is Kinng, faced apprehensions from the team of Mulk about his casting as Rishi Kapoor’s b… [+1644 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Why you should consume lotus stem or kamal kakdi", "description": "Calling it a versatile vegetable, nutritionist Lovneet Batra said that there is more to this humble vegetable than its delectable flavour", "url": "https://indianexpress.com/article/lifestyle/health/lotus-stem-kamal-kakdi-health-benefits-7993317/", "urlToImage": "https://images.indianexpress.com/2022/06/lotus-stem_1200_wikimedia-commons.jpg", "publishedAt": "2022-07-01T14:30:58Z", "content": "Lotus stem or kamal kakdi, as it is popularly known, is a powerhouse of nutrients and flavour. It is used to make a variety of dishes, including curries and koftas. For the unversed, it comes from th… [+2087 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Omkar Gokhale", "title": "Overground Metro 2B corridor: Bombay HC seeks AAI report on measures to ensure safety of fliers, nearby residents", "description": "The court said while the aviation secretary’s report justified the NOC granted by the AAI to the MMRDA for Metro construction, it needed to be assured that such a nod would not pose any risk to fliers or residents of nearby areas.", "url": "https://indianexpress.com/article/cities/mumbai/overground-metro-2b-corridor-bombay-hc-aai-report-measures-safety-fliers-residents-8003805/", "urlToImage": "https://images.indianexpress.com/2022/07/aai-logo-759.jpg", "publishedAt": "2022-07-01T14:29:53Z", "content": "The Bombay High Court, while hearing a PIL challenging the construction of Metro 2B line near Juhu Aerodrome, recently directed the Airports Authority of India (AAI) to place on record the safety mea… [+3066 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Turkish Airlines, IndiGo resume codeshare flight deal", "description": "The agreement will enable Turkish Airlines and IndiGo to provide more flexibility of choice to the customers on route between İstanbul and India.", "url": "https://indianexpress.com/article/business/aviation/turkish-airlines-and-indigo-resumes-codeshare-partnership-8003654/", "urlToImage": "https://images.indianexpress.com/2022/07/Turkish-airlines-Indigo.jpg", "publishedAt": "2022-07-01T14:29:50Z", "content": "The national flag carrier airline of Türkiye, Turkish Airlines, and IndiGo, announced the resumption of their codeshare flights, in a joint statement on Friday.The agreement allows each airline to se… [+1863 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Turkish Airlines, IndiGo resume codeshare flight deal", "description": "The agreement will enable Turkish Airlines and IndiGo to provide more flexibility of choice to the customers on route between İstanbul and India.", "url": "https://indianexpress.com/article/india/turkish-airlines-and-indigo-resumes-codeshare-partnership-8003654/", "urlToImage": "https://images.indianexpress.com/2022/07/Turkish-airlines-Indigo.jpg", "publishedAt": "2022-07-01T14:29:50Z", "content": "The national flag carrier airline of Türkiye, Turkish Airlines, and IndiGo, announced the resumption of their codeshare flights, in a joint statement on Friday.The agreement allows each airline to se… [+1863 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Your Daily Wrap: SC censures Nupur Sharma over Prophet remarks, Modi-Putin phone call; and more", "description": "From Uddhav Thackeray's media address to film reviews, here are today's top news.", "url": "https://indianexpress.com/article/india/daily-wrap-sc-nupur-sharma-prophet-remarks-modi-putin-phone-call-8003796/", "urlToImage": "https://images.indianexpress.com/2022/07/wrap-1200.jpg", "publishedAt": "2022-07-01T14:28:00Z", "content": "The Supreme Court today came down heavily on suspended BJP spokesperson Nupur Sharma over her controversial comments on Prophet Mohammed during a TV show and said she is single-handedly responsible f… [+5748 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "বাংলা উত্তরপ্রদেশ-গুজরাট হবে, স্কুলে স্কুলে গীতা পড়ানো হবে: শুভেন্দু", "description": "দিবাস্বপ্ন কোনওদিন সফল হবে না, পাল্টা তৃণমূল সাংসদ শান্তনু সেনের।", "url": "https://bengali.indianexpress.com/west-bengal/bengal-will-become-up-assam-gujarat-claims-bjps-suvendu-adhikari-464181/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/Suvendu-Adhikari.jpg", "publishedAt": "2022-07-01T14:22:07Z", "content": "Participated in vibrant #RathYatra festivities at three joyful events showcasing Sanatani cultural heritage &amp; deep connect with the divine Lord.\r\nConsider myself fortunate to pull the wheels of L… [+111 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Briton Watson makes a fourth round at 43rd attempt", "description": "She came through an awkward first set full of slices and drop shots against 21-year-old Juvan and did not let her head drop after blowing three set points in the tiebreak before taking it 8-6 on a double fault by the 60th-ranked Slovenian.", "url": "https://indianexpress.com/article/sports/tennis/briton-watson-makes-a-fourth-round-at-43rd-attempt-8003798/", "urlToImage": "https://images.indianexpress.com/2022/07/Heather.jpg", "publishedAt": "2022-07-01T14:19:16Z", "content": "Britain’s Heather Watson reached the fourth round of a Grand Slam tournament for the first time in 43 attempts over 12 years on Friday as she beat Slovenia’s Kaja Juvan 7-6(6) 6-2 in front of a barel… [+1087 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Parenting Desk", "title": "A science teacher explains: Why do leaves fall off trees?", "description": "To survive in the environment as it becomes hostile, trees initiate abscission, the process of separation of leaves, naturally.", "url": "https://indianexpress.com/article/parenting/learning/a-science-teacher-explains-why-do-leaves-fall-off-trees8003432/", "urlToImage": "https://images.indianexpress.com/2022/03/betel-leaves-1200.jpg", "publishedAt": "2022-07-01T14:10:57Z", "content": "The ethereal beauty of Kashmir has inspired scores of poets and writers, artisans, and even Bollywood to churn out memorable works of art. Besides the breathtaking landscapes, the stimulation is also… [+4076 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Technoblade, Minecraft YouTuber and streamer, dies from cancer aged 23", "description": "With over 10 million YouTube followers, Technoblade shot to fame by livestreaming and posting videos of himself playing the sandbox video game.", "url": "https://indianexpress.com/article/world/technoblade-minecraft-youtuber-and-streamer-dies-from-cancer-aged-23/", "urlToImage": "https://images.indianexpress.com/2022/07/technoblade_faceedited.png", "publishedAt": "2022-07-01T14:10:48Z", "content": "After a prolonged battle with cancer, Minecraft YouTuber Technoblade passed away today. He was 23. His family confirmed his death in an emotional farewell video posted on his behalf. The video was ti… [+1852 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Technoblade, Minecraft YouTuber and streamer, dies from cancer aged 23", "description": "With over 10 million YouTube followers, Technoblade shot to fame by livestreaming and posting videos of himself playing the sandbox video game.", "url": "https://indianexpress.com/article/technology/tech-news-technology/technoblade-minecraft-youtuber-and-streamer-dies-from-cancer-aged-23/", "urlToImage": "https://images.indianexpress.com/2022/07/technoblade_faceedited.png", "publishedAt": "2022-07-01T14:10:48Z", "content": "After a prolonged battle with cancer, Minecraft YouTuber Technoblade passed away today. He was 23. His family confirmed his death in an emotional farewell video posted on his behalf. The video was ti… [+1852 chars]"}]}