{"status": "ok", "totalResults": 482, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Mallica Joshi", "title": "Schools vs riots: How AAP has tweaked patriotism to fit its education course", "description": "Over the past few months, as Delhi Chief Minister Arvind Kejriwal travels the country, from Himachal Pradesh and Gujarat to Karnataka, to expand the Aam Aadmi Party, one common message is the Delhi government’s “success” in transforming schools in the Capital.", "url": "https://indianexpress.com/article/india/political-pulse/aap-delhi-model-education-deshbhakti-curriculum-7887815/", "urlToImage": "https://images.indianexpress.com/2022/04/kejriwal-sisodia.jpg", "publishedAt": "2022-04-26T06:37:28Z", "content": "Mujhe raajneeti nahin karni aati, school banane aate hain (I dont know how to do politics, I know how to make schools); Humein dange karvane nahin aate, school banane aate hain (We dont know how to c… [+4238 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Supreme Court grills Uttarakhand on proposed dharam sansad in Roorkee tomorrow", "description": "A bench presided by Justice A M Khanwilkar said there were already judgments of the court on what needed to be done in such situations and the state only needed to implement the same.", "url": "https://indianexpress.com/article/india/supreme-court-dharam-sansad-roorkee-uttarakhand-govt-7887798/", "urlToImage": "https://images.indianexpress.com/2022/01/haridwar-hate-assembly.png", "publishedAt": "2022-04-26T06:29:33Z", "content": "The Supreme Court Tuesday grilled the Uttarakhand government over a proposed dharam sansad event scheduled to be held in Roorkee on Wednesday and sought an affidavit from the Chief Secretary on what … [+1530 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "অনুব্রতর গতিবিধিতে আরও কড়া নজরদারি সিবিআইয়ের, চাওয়া হল পাসপোর্ট", "description": "পাসপোর্ট অফিসে যোগাযোগ করছেন কেন্দ্রীয় গোয়েন্দারা। এমনকী এয়ারপোর্ট অথরিটি অফ ইন্ডিয়ার সঙ্গেও কথা বলা হচ্ছে।", "url": "https://bengali.indianexpress.com/politics/cbi-asked-anubrat-mondal-to-submit-his-passport-436144/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/02/Anubrata-Mandal-1.jpg", "publishedAt": "2022-04-26T06:23:49Z", "content": "Stay updated with the latest news headlines and all the latest Politics news download Indian Express Bengali App.\r\nWeb Title: Cbi asked anubrat mondal to submit his passport"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Tiger Shroff’s fan almost faints at Heropanti 2 event, netizens ask ‘choti bacchi ho kya?’", "description": "In a video shared by a paparazzo, Tiger Shroff can be seen meeting a fan, who almost fainted at his event. Watch video here.", "url": "https://indianexpress.com/article/entertainment/bollywood/tiger-shroffs-fan-faints-heropanti-2-event-netizens-ask-choti-bacchi-ho-kya-7887656/", "urlToImage": "https://images.indianexpress.com/2022/04/tiger-shroff-fans.jpg", "publishedAt": "2022-04-26T06:20:50Z", "content": "Tiger Shroff, who is busy promoting his upcoming film Heropanti 2, experienced a memorable fan moment recently. During his visit to a mall in Mumbai, the actor got to witness the craze he inspires, e… [+1431 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Ukraine city Kreminna falls to Russia, says UK", "description": "There was no immediate response from the Ukrainian government. Russia claimed days earlier to have taken the city.", "url": "https://indianexpress.com/article/world/russia-ukraine-war-kreminna-7887794/", "urlToImage": "https://images.indianexpress.com/2022/04/ukraine-1-5.jpg", "publishedAt": "2022-04-26T06:20:24Z", "content": "The British Defense Ministry says Russian forces have taken the Ukrainian city of Kreminna.Street-to-street fighting had been going on for days in the city in Ukraine’s Luhansk region, with civilian … [+916 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Gargi Verma", "title": "Chhattisgarh govt issues fresh postings for 18 IAS, 29 IPS officers; 8 districts get new SPs", "description": "The Congress government has been shuffling officers every few months, across the state. Sources in the government believe this to be a massive shift days before the Chief Minister's planned visits to these districts in May.", "url": "https://indianexpress.com/article/india/chhattisgarh-bureaucratic-shuffle-new-postings-7887778/", "urlToImage": "https://images.indianexpress.com/2022/04/Baghel-1.jpeg", "publishedAt": "2022-04-26T06:19:57Z", "content": "The Chhattisgarh government Monday issued fresh posting orders to 18 Indian Administrative Service (IAS) and 28 Indian Police Service (IPS) officers. Eight districts got new superintendents of police… [+1966 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "AR Rahman calls Will Smith ‘a sweetheart,’ reacts on his Oscar slap row: ‘Things happen’", "description": "AR Rahman was a guest on The Kapil Sharma Show where during a game segment, he was asked to comment on Will Smith row.", "url": "https://indianexpress.com/article/entertainment/television/the-kapil-sharma-show-ar-rahman-on-will-smith-tiger-shroff-heropanti-2-7887750/", "urlToImage": "https://images.indianexpress.com/2022/04/AR-Rahman-1.jpg", "publishedAt": "2022-04-26T06:17:24Z", "content": "The Academy Awards this year trended for a very different reason. While the best of last year were honoured at the 94th Oscar awards, Will Smith slapping Chris Rock for joking about wife Jada Pinkett… [+1485 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "ED raids multiple locations in ABG Shipyard bank loan fraud case", "description": "The ED had filed a money laundering case in February after studying a CBI FIR against the former promoters of the ship building company.", "url": "https://indianexpress.com/article/india/ed-raids-multiple-locations-in-abg-shipyard-bank-loan-fraud-case-7887780/", "urlToImage": "https://images.indianexpress.com/2022/04/abg-shipyard.jpg", "publishedAt": "2022-04-26T06:16:34Z", "content": "The Enforcement Directorate (ED) on Tuesday raided multiple premises in Mumbai, Pune and Surat in connection with a money laundering probe against ABG Shipyard Ltd in an alleged Rs 22,842 crore bank … [+895 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Serivce", "title": "Noida: 30-yr-old dies in fight over bill at Gardens Galleria mall", "description": "In the physical fight between customers and the restaurant staff over bill payment, Brajesh received fatal injuries on his head. He was taken to a nearby hospital but could not be saved.", "url": "https://indianexpress.com/article/cities/delhi/noida-30-yr-old-dies-in-fight-over-bill-at-gardens-galleria-mall-7887776/", "urlToImage": "https://images.indianexpress.com/2022/04/Gardens-Galleria-mall.jpg", "publishedAt": "2022-04-26T06:09:43Z", "content": "A 30-year-old man died after getting involved in a brawl at a pub in Noidas Gardens Galleria mall on Monday night.According to the police, Brajesh was attending an office party at the pub. At around … [+866 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Cryptoverse: Ether prepares for epic ‘merge’ in quest to eclipse bitcoin", "description": "Both bitcoin and ether are mined, or produced, using a proof-of-work (POW) method, where thousands of miners, or network nodes, compete to solve complex mathematical puzzles.", "url": "https://indianexpress.com/article/technology/crypto/cryptoverse-ether-prepares-for-epic-merge-in-quest-to-eclipse-bitcoin-7887775/", "urlToImage": "https://images.indianexpress.com/2021/10/ethereum-Reuters__1.jpg", "publishedAt": "2022-04-26T06:08:19Z", "content": "Ether has promised to do better. It has promised to go to the next level, edging out crypto rivals and even outshining the godfather, bitcoin. But the clock’s ticking. The No.2 cryptocurrency was sup… [+3571 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "In India, jealous gang wanted me to fail so I developed thick skin: Ravi Shastri", "description": "From his own experience of working with the Indian team, Shastri feels that national teams across the cricketing world function in a pretty similar fashion.", "url": "https://indianexpress.com/article/sports/cricket/in-india-jealous-gang-wanted-me-to-fail-so-i-developed-thick-skin-ravi-shastri-7887785/", "urlToImage": "https://images.indianexpress.com/2021/12/Ravi-2.jpg", "publishedAt": "2022-04-26T06:03:57Z", "content": "Robert Key will need to grow a “thick skin” akin to the Dukes ball just like I grew one to counter the “jealous people”, former India head coach Ravi Shastri said on how the ex-England opener should … [+3452 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Eye health: How summer heat can harm your eyes; experts share tips to take care of them", "description": "According to Dr Tushar Grover, Medical Director, Vision Eye Centre, New Delhi, \"Summertime exposure to the sun's ultraviolet rays can increase the risk of cataracts and retinal damage\"", "url": "https://indianexpress.com/article/lifestyle/health/eye-health-summer-heat-eyes-tips-to-take-care-7881592/", "urlToImage": "https://images.indianexpress.com/2022/04/eyes-1200.jpg", "publishedAt": "2022-04-26T06:00:10Z", "content": "As the temperature continues to soar, we ensure to take care of our health, skin and hair. However, we often miss paying attention to one of the most important parts of the body affected by the summe… [+2109 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pune: Man sets ablaze woman over job dispute, he dies", "description": "Pune news: \"Primary probe suggests that the deceased, Nathsager, was sacked by the injured woman, Janind, from her tailoring shop because of which they were having a dispute,\" a police officer said.", "url": "https://indianexpress.com/article/cities/pune/pune-vadgaon-sheri-fire-man-dies-7887771/", "urlToImage": "https://images.indianexpress.com/2022/04/Indian-Express-logo-13-5.jpg", "publishedAt": "2022-04-26T06:00:07Z", "content": "A 35-year-old man died of burn injuries as he set ablaze a woman following a dispute over her sacking him from the job at her tailoring shop in Vadgaon Sheri area of Pune, the city police said. While… [+1686 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Johnson TA", "title": "Karnataka: CID probe into SI exam fraud shows arrested accused took exam at same centre", "description": "A scam in the recruitment process emerged after a few candidates who wrote the exam discovered that some of those chosen for recruitment from Kalburagi had answered as few as 21 questions in the objective portion of the test.", "url": "https://indianexpress.com/article/cities/bangalore/karnataka-cid-probe-into-si-exam-fraud-shows-arrested-accused-took-exam-at-same-centre-7887747/", "urlToImage": "https://images.indianexpress.com/2022/04/exam-represent.jpg", "publishedAt": "2022-04-26T05:58:14Z", "content": "An investigation by the Criminal Investigation Department (CID) of the Karnataka police into a fraud in examinations to recruit 545 sub-inspectors (PSIs) for the state police has led to the arrest of… [+7980 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "270 km in two-and-a-half hours: Sahyadri Hospital performs Pune’s first heart transplant this year", "description": "The heart of a 25-year-old man, who was declared brain dead on April 24, was transplanted in a 59-year-old veterinary doctor who was suffering from end-stage heart failure.", "url": "https://indianexpress.com/article/cities/pune/pune-sahyadri-hospital-heart-transplant-7887759/", "urlToImage": "https://images.indianexpress.com/2022/04/surgery.jpg", "publishedAt": "2022-04-26T05:56:15Z", "content": "The first heart transplant in Pune this year was performed Monday at Sahyadri Hospital in Deccan after a medical team took just 150 minutes (two-and-a-half hours) to bring the organ from Kolhapur cov… [+1659 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Serivce", "title": "Delhi govt invites fresh tenders for wholesale supply of country liquor for retail vends", "description": "According to the excise department, currently Delhi has a total number of 87 retail vends of Country liquor (L-8 licensees) which may vary during the licensing period.", "url": "https://indianexpress.com/article/cities/delhi/delhi-govt-invites-fresh-tenders-for-wholesale-supply-of-country-liquor-for-retail-vends-7887746/", "urlToImage": "https://images.indianexpress.com/2022/04/LIQUOR-2.jpg", "publishedAt": "2022-04-26T05:56:03Z", "content": "To procure country liquor for Delhi, the city government has invited fresh tenders for wholesale supply of country liquor for retail vends (L-8) in bottles of 750 ml, 375 ml and 180 ml in the ratio o… [+2051 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Twitter CEO tells employees company is in the dark over future under Musk", "description": "Musk will join Twitter staff for a question-and-answer session at a later date, the company told employees.", "url": "https://indianexpress.com/article/technology/social/twitter-ceo-tells-employees-company-is-in-the-dark-over-future-under-musk-7887714/", "urlToImage": "https://images.indianexpress.com/2022/04/Elon-Musk-Twitter-1.jpg", "publishedAt": "2022-04-26T05:53:41Z", "content": "Twitter Inc Chief Executive Parag Agrawal told employees on Monday that the future of the social media firm is uncertain after the deal to be taken private under billionaire Elon Musk closes. He was … [+1398 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Improve ties with India, defuse ethnic, religious conflicts: Appeal to Pakistan", "description": "SAATH co-founder and former ambassador of Pakistan to the United States, Husain Haqqani, said Pakistan can't come out of its current mess without ending the militarisation of politics and the use of religion for political purposes.", "url": "https://indianexpress.com/article/pakistan/india-pakistan-conflict-saath-7887749/", "urlToImage": "https://images.indianexpress.com/2022/04/shehbaz-sharif-1.jpg", "publishedAt": "2022-04-26T05:52:43Z", "content": "A group of eminent pro-democracy intellectuals, politicians, journalists and activists have urged the new government in Pakistan to play a constructive role in defusing ethnic and religious conflicts… [+2747 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Venom 3 announced at CinemaCon 2022", "description": "Venom franchise features Tom Hardy as journalist Eddie Brock and his unwitting sidekick and parasite Venom, the otherworldly lethal protector in Sony's universe of Marvel characters.", "url": "https://indianexpress.com/article/entertainment/hollywood/venom-3-announced-at-cinemacon-2022-7887699/", "urlToImage": "https://images.indianexpress.com/2022/04/Venom-1200by667.jpg", "publishedAt": "2022-04-26T05:49:20Z", "content": "Sony Pictures is developing a third instalment in the Tom Hardy-led Venom franchise. The film comes following the back-to-back box office successes of 2021’s Venom: Let There Be Carnage and 2018’s Ve… [+509 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Soumyarendra Barik", "title": "Explained: Swiggy’s new programme to help its delivery executives move to managerial roles", "description": "Swiggy has announced a programme for its delivery executives to transition to a dedicated, managerial role in the company. Here's what we know about the 'Step-Ahead' programme.", "url": "https://indianexpress.com/article/explained/swiggy-step-ahead-programme-delivery-executives-7887726/", "urlToImage": "https://images.indianexpress.com/2022/04/Swiggy-2.jpg", "publishedAt": "2022-04-26T05:41:53Z", "content": "Food delivery platform Swiggy has announced a programme for its delivery executives that will allow them to transition to full-time, managerial-level jobs with a fixed salary and additional benefits.… [+2408 chars]"}]}