{"status": "ok", "totalResults": 451, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Watch this video to learn about the importance of being alone", "description": "Today, most people are unaware of their internal strength", "url": "https://indianexpress.com/article/lifestyle/life-positive/importance-of-being-alone-motivational-life-positive-7907994/", "urlToImage": "https://images.indianexpress.com/2022/05/life-positive.jpg", "publishedAt": "2022-05-12T02:50:54Z", "content": "Most people today are unaware of their internalstrength and so, they keep messing their mind and soul by allowing the outside world to influence them.If you look at the most creative men and women in… [+1199 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Taarak Mehta Ka Ooltah Chashmah team attends premiere of Bhavya Gandhi aka Tappu’s film. See pics", "description": "As Tapu aka Bhavya Gandhi hosted premiere of his film, his Taarak Mehta Ka Ooltah Chashmah team members were in attendance. Sonu aka Palak Sindhwani, Sodhi aka Gurucharan Singh, Gogi aka Samay Shah, and Ambika aka Hasmukhi, among others attended the premiere …", "url": "https://indianexpress.com/article/entertainment/television/taarak-mehta-ka-ooltah-chashmah-attends-premiere-of-bhavya-gandhi-aka-tappu-film-see-pics-7910784/", "urlToImage": "https://images.indianexpress.com/2022/05/taarak-mehta.jpg", "publishedAt": "2022-05-12T02:45:56Z", "content": "The team of television’s most popular and long-running sitcom, Taarak Mehta Ka Ooltah Chashmah, got together to attend the premiere of a Gujarati film, Kehvatlal Parivar in Ahmedabad. The film was sp… [+2558 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "De Bruyne impersonates Haaland with 4-goal burst, ‘Zen’ pose", "description": "After the Belgium midfielder completed his hat trick — his first for City — by the 24th minute, he celebrated with the “Zen” pose made famous by Haaland in recent years at Borussia Dortmund.", "url": "https://indianexpress.com/article/sports/football/de-bruyne-impersonates-haaland-with-4-goal-burst-zen-pose-7912583/", "urlToImage": "https://images.indianexpress.com/2022/05/Untitled-design-5.jpg", "publishedAt": "2022-05-12T02:39:03Z", "content": "With his four-goal burst and “Zen” celebration, Kevin De Bruyne did his best impersonation of a future Manchester City teammate on Wednesday.Erling Haaland is joining City next season as one of the m… [+3711 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "North Korea reports first Covid-19 outbreak with Omicron case, orders lockdown", "description": "A report from North Korea said people in Pyongyang had contracted the Omicron variant, without providing details on case numbers or possible sources of infection.", "url": "https://indianexpress.com/article/world/north-korea-covid-omicron-case-lockdown-7912560/", "urlToImage": "https://images.indianexpress.com/2022/05/korea.jpg", "publishedAt": "2022-05-12T02:12:04Z", "content": "North Korea officially confirmed its first Covid-19 outbreak on Thursday and ordered a national lock down, with state media reporting a sub-variant of the highly transmissible Omicron virus had been … [+1923 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Step up exports to meet USD 1 trillion economy by 2030: Tamil Nadu CM MK Stalin", "description": "At present, Tamil Nadu's share on the export front stood at $ 26 billion and this should be increased to $ 100 billion by 2030, he said after presenting the FIEO Southern Region Export Excellence Awards.", "url": "https://indianexpress.com/article/cities/chennai/tamil-nadu-one-trillion-dollor-economy-cm-mk-stalin-7912558/", "urlToImage": "https://images.indianexpress.com/2022/05/Stalin-3.jpg", "publishedAt": "2022-05-12T02:06:52Z", "content": "Asserting that exports are very crucial to achieve economic growth, Tamil Nadu Chief Minister M K Stalin on Wednesday called upon the captains of industries to step up the exports by about $ 100 bill… [+2415 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rahel Philipose, Sonal Gupta", "title": "Daily Briefing: SC puts on hold trial in sedition cases; RBI may have to kill demand, hike rate", "description": "The Supreme Court’s order on sedition cases, the Delhi High Court’s split verdict on marital rape, and the RBI’s plan to tackle inflation – here are the top reads of today’s edition", "url": "https://indianexpress.com/article/live-news/top-news-briefing-today-7912555/", "urlToImage": "https://images.indianexpress.com/2022/05/Express-intro-6.jpg", "publishedAt": "2022-05-12T02:05:16Z", "content": "Good morning,\r\nThe Big Story\r\nThe Supreme Court has put on hold trial in all sedition cases pending before courts across the country until the government completes its promised exercise to re-examine… [+5028 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Daisy Ridley to topline noir thriller Magpie", "description": "Magpie follows a couple whose lives are thrown into disarray when their daughter is cast opposite a controversial major star.", "url": "https://indianexpress.com/article/entertainment/hollywood/daisy-ridley-to-lead-noir-thriller-magpie-7911255/", "urlToImage": "https://images.indianexpress.com/2022/05/Daisy-Ridley-1200by667.jpg", "publishedAt": "2022-05-12T02:00:27Z", "content": "Star Wars alum Daisy Ridley will topline an upcoming noir thriller movie, titled Magpie.The 30-year-old actor will star with Shazad Latif, known for featuring in Spooks and Star Trek: Discovery, in t… [+816 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Jessie Buckley, Riz Ahmed to headline sci-fi romance Fingernails", "description": "Described as a “grounded sci-fi love story\", Fingernails film is set in a world where a test has been discovered that measures whether couples are truly in love.", "url": "https://indianexpress.com/article/entertainment/hollywood/jessie-buckley-riz-ahmed-to-star-in-sci-fi-romance-fingernails-7911156/", "urlToImage": "https://images.indianexpress.com/2022/05/Jessie-Buckley-and-Riz-Ahmed-1200by667.jpg", "publishedAt": "2022-05-12T01:30:25Z", "content": "British stars Jessie Buckley and Riz Ahmed are set to feature together in sci-fi romance film Fingernails. Christos Nikou, best known for the 2020 Greek-language drama Apples, will direct the film fr… [+1030 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "GSEB Gujarat Class 12 Science stream result: When and where to check", "description": "Gujarat Secondary and Higher Secondary Education Board (GSEB) Candidates who appeared in the GSEB class 12 science stream board exams can now check the result at the official website — gseb.org.", "url": "https://indianexpress.com/article/education/gseb-2022-result-declared-check-when-and-where-to-download-scorecard-gseb-org-7868938/", "urlToImage": "https://images.indianexpress.com/2022/03/MP-Board-exams-1.jpeg", "publishedAt": "2022-05-12T01:30:13Z", "content": "Gujarat Board GSEB HSC class 12 Result 2022: The Gujarat Secondary and Higher Secondary Education Board (GSEB) will announce the class 12 science stream result today at 10 am. Candidates who appeared… [+1014 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Vallabh Ozarkar", "title": "10 Mumbra policemen suspended for extorting Rs 6 cr from toy trader", "description": "The suspended policemen have been identified as inspector Gitaram Shewale, sub-inspectors Ravi Madane and Harshal Kale as well as constables Pankaj Gaikar, Jagdish Gavit, Dilip Kirpan, Praveen Kumbhar, Ankush Vaidya, Lalit Mahajan and Nilesh Salunkhe.", "url": "https://indianexpress.com/article/cities/mumbai/10-mumbra-policemen-suspended-for-extorting-rs-6-cr-from-toy-trader-7912544/", "urlToImage": "https://images.indianexpress.com/2022/04/mumbai-police-1-2.jpg", "publishedAt": "2022-05-12T00:52:27Z", "content": "Ten policemen attached with Mumbra police station under the Thane City Police Commissionerate were suspended on Wednesday and a departmental inquiry set up against them for allegedly extorting Rs 6 c… [+2497 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Asad Rehman", "title": "Gyanvapi case: Varanasi court set to pronounce order today", "description": "On Saturday, the Anjuman Intezamia Masjid Committee had filed an application in the court seeking the replacement of Advocate Commissioner Ajai Kumar Mishra, accusing him of being “biased”.", "url": "https://indianexpress.com/article/cities/lucknow/gyanvapi-case-varanasi-court-set-to-pronounce-order-today-7912540/", "urlToImage": "https://images.indianexpress.com/2022/05/Gyanvapi.jpg", "publishedAt": "2022-05-12T00:11:54Z", "content": "THE ARGUMENTS in the hearing regarding the replacement of a court-appointed Advocate Commissioner concluded in a Varanasi court on Wednesday, with the court reserving its order that will be pronounce… [+3019 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Uttar Pradesh: Proceedings in House set to go digital", "description": "Under “E-vidhan” (digitalisation/digitisation of legislatures) initiative, the MLAs will have electronic tablets installed on their desks at the Assembly to continually update them about the proceedings of the House, the questions undertaken and their answers…", "url": "https://indianexpress.com/article/cities/lucknow/uttar-pradesh-proceedings-in-house-set-to-go-digital-7912539/", "urlToImage": "https://images.indianexpress.com/2022/05/Yogi-9.jpg", "publishedAt": "2022-05-12T00:03:33Z", "content": "The first budget session of the second term of the Yogi Adityanath government in the Uttar Pradesh Assembly from May 23 is likely to be different from the past in many respects.Under E-vidhan (digita… [+2814 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Asani has turned into deep depression, rainfall likely across state: Met", "description": "According to the Met office, the coastal districts such as East Medinipur, North and South 24 Parganas and Nadia, are expected to receive more rainfall by Wednesday. Rains are also likely to lash Kolkata.", "url": "https://indianexpress.com/article/cities/kolkata/asani-has-turned-into-deep-depression-rainfall-likely-across-state-met-7912535/", "urlToImage": "https://images.indianexpress.com/2022/05/Asani-4.jpg", "publishedAt": "2022-05-11T23:53:42Z", "content": "Cyclone Asani has lost its strength, turning into a deep depression, the Alipore meteorological office said on Wednesday, adding that it would result in rainfall across the state.There is a high prob… [+1122 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Central policies behind increase in healthcare costs: Mamata", "description": "It was decided in the meeting police, district administration and youth clubs will organise blood donation camps to meet scarcity of blood, health department officials said.", "url": "https://indianexpress.com/article/cities/kolkata/central-policies-behind-increase-in-healthcare-costs-mamata-7912533/", "urlToImage": "https://images.indianexpress.com/2022/05/mamata-759-1-1-1-5-1.jpg", "publishedAt": "2022-05-11T23:49:28Z", "content": "West Bengal Chief Minister Mamata Banerjee on Wednesday claimed that healthcare cost has spiked due to the Central government’s policies as it increases prices of nearly 800 medicines every six month… [+1764 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "13,000 in Bharuch to get benefits under central govt schemes today", "description": "The district administration launched a drive called ‘Utkarsh’ under which it roped in bodies such as the Ankleshwar Industries Association (AIA) to find beneficiaries, announcing incentives per application.", "url": "https://indianexpress.com/article/cities/surat/13000-in-bharuch-to-get-benefits-under-central-govt-schemes-today-7912531/", "urlToImage": "https://images.indianexpress.com/2022/04/BHUPENDRA-PATEL.jpg", "publishedAt": "2022-05-11T23:45:48Z", "content": "Chief Minister Bhupendra Patel will hand over benefits under various central government schemes to over 13,000 beneficiaries of Bharuch district in the virtual presence of Prime Minister Narendra Mod… [+1964 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Ahead of CPM’s youth wing meet, a bid to regain lost ground in Bengal", "description": "After facing a rout in the 2021 Assembly election last year, the CPIM has been trying to stage a comeback in West Bengal politics through their young faces, who are mainly from its  students wing, Students Federation of India (SFI) and the DYFI.", "url": "https://indianexpress.com/article/cities/kolkata/ahead-of-cpms-youth-wing-meet-a-bid-to-regain-lost-ground-in-bengal-7912510/", "urlToImage": "https://images.indianexpress.com/2022/05/DYFI2-4col.jpg", "publishedAt": "2022-05-11T23:42:40Z", "content": "AHEAD OF an all-India conference of the Democratic Youth Federation of India (DYFI) that begins in Salt Lake on Wednesday, the youth organisations of the CPIM have been trying to connect to different… [+3250 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Development works worth Rs 12.2 cr in Gujarat by Oct: Govt", "description": "Briefing media persons after the weekly cabinet meeting chaired by Chief Minister Bhupendra Patel, spokesperson of the state government and Education Minister Jitu Vaghani said Gujarat has emerged as a top state in the country under the PM Gati-Shakti Yojana.", "url": "https://indianexpress.com/article/cities/gandhinagar/development-works-worth-rs-12-2-cr-in-gujarat-by-oct-govt-7912530/", "urlToImage": "https://images.indianexpress.com/2022/05/Bhupendra-Patel.jpg", "publishedAt": "2022-05-11T23:40:04Z", "content": "By October this year, development works worth Rs 12,200 crore will either be dedicated or their foundation stones be laid in 33 districts, the Gujarat government said Wednesday.Briefing media persons… [+1475 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Two arrested over bid to derail train in Valsad", "description": "According to the Railway police, the incident took place on April 27, when a Bandra Vapi passenger train left Vapi railway station towards Mumbai at 12.30 pm.", "url": "https://indianexpress.com/article/cities/surat/two-arrested-over-bid-to-derail-train-in-valsad-7912524/", "urlToImage": "https://images.indianexpress.com/2022/05/arrest1-6.jpeg", "publishedAt": "2022-05-11T23:34:20Z", "content": "Two youths were arrested Wednesday for allegedly trying to derail the Bandra Vapi passenger train near Umargam railway station in Valsad.According to the Railway police, the incident took place on Ap… [+1164 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Railway station near Somnath temple to be upgraded at Rs 134 cr", "description": "RLDA, a statutory body functioning under the Railways Ministry, has solicited request for proposal (RFP) from private contractors for the work after holding a pre-bid consultation meeting with national and state-level developers.", "url": "https://indianexpress.com/article/cities/rajkot/railway-station-near-somnath-temple-to-be-upgraded-at-rs-134-cr-7912520/", "urlToImage": "https://images.indianexpress.com/2022/05/Somnath-temple.jpg", "publishedAt": "2022-05-11T23:27:36Z", "content": "THE RAILWAY station near the famous Somnath temple near Veraval town in Devbhumi Dwarka district is all set for a major overhaul with the Rail Land Development Authority (RLDA) deciding to upgrade th… [+1828 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "RMC approves Rs 1.90 crore paid for Covid services", "description": "According to the proposals, the RMC purchased total one lakh rapid antigen test kits and 50,000 viral transport media (VTM) kits for collecting samples for RT-PCR tests.", "url": "https://indianexpress.com/article/cities/rajkot/rmc-approves-rs-1-90-crore-paid-for-covid-services-7912513/", "urlToImage": "https://images.indianexpress.com/2021/11/rmc_759.jpg", "publishedAt": "2022-05-11T23:20:51Z", "content": "THE STANDING committee of the Rajkot Municipal Corporation on Tuesday gave approval to five proposals by the administrative wing for Rs 1.90 crore paid to various agencies for providing services duri… [+1541 chars]"}]}