{"status": "ok", "totalResults": 419, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Queen Elizabeth II skips Platinum Jubilee church service; Harry, Meghan reunite with Britain’s royal family", "description": "Harry and Meghan made their first public appearance in the UK since stepping back from royal duties two years ago.", "url": "https://indianexpress.com/article/world/queen-elizabeth-ii-platinum-jubilee-harry-meghan-7952028/", "urlToImage": "https://images.indianexpress.com/2022/06/harry-meghan.jpg", "publishedAt": "2022-06-04T02:46:03Z", "content": "Prince Harry and his wife, Meghan, joined other members of Britain’s royal family on Friday for a church service honouring Queen Elizabeth II’s 70 years on the throne, making their first public appea… [+3689 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Arushi Jain", "title": "Vikram, Samrat Prithviraj, The Boys S3: Top shows, films to watch this weekend", "description": "Not sure what to watch? For this weekend, we recommend 6 titles that would be worth your time -- from Kamal Haasan's Vikram and Akshay Kumar's Samrat Prithviraj in theatres to The Boys 3 on Amazon Prime Video.", "url": "https://indianexpress.com/article/entertainment/web-series/vikram-samrat-prithviraj-the-boys-s3-top-shows-films-to-watch-this-weekend-7950932/", "urlToImage": "https://images.indianexpress.com/2022/06/what-to-watch-.jpg", "publishedAt": "2022-06-04T02:39:45Z", "content": "The two marquee movies hitting the big screen this week are all about grandeur and are rightfully starring two of the biggest stars Indian cinema has produced. Action-thriller Vikram, which features … [+4350 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sampada Sharma", "title": "Saudagar: That rare film where Amitabh Bachchan plays a grey character, never finds redemption", "description": "Nutan and Amitabh Bachchan starrer Saudagar examines gender imbalance in marriage, where women are treated like free labour and men hold all the cards.", "url": "https://indianexpress.com/article/entertainment/bollywood/saudagar-rare-film-amitabh-bachchan-grey-character-nutan-7951098/", "urlToImage": "https://images.indianexpress.com/2022/06/Saudagar-2.jpeg", "publishedAt": "2022-06-04T02:39:39Z", "content": "In one of the earlier scenes of the 1973 film Saudagar, Nutan’s Majubi requests Amitabh Bachchan’s Moti for higher wages as she is paid peanuts for her labour in his jaggery business, even though her… [+3707 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Mimansa Shekhar", "title": "Amit Sadh on 20 years of acting, Bigg Boss stint and being a ‘spoiled child’ during TV days: ‘When I moved to films, people called me a loser’", "description": "Amit Sadh has dabbled in television, films and OTT in his two decade-long career. While Amit claims to be calmer and more focused today, he says his failures and struggles have made him the \"hero\" of his own life.", "url": "https://indianexpress.com/article/entertainment/bollywood/amit-sadh-tv-films-kai-po-che-success-failure-breathe-bigg-boss-7947329/", "urlToImage": "https://images.indianexpress.com/2022/06/amit-sadh-20-years-1200.jpeg", "publishedAt": "2022-06-04T02:37:31Z", "content": "Amit Sadh completes two decades as an actor this year. Amit made his acting debut in 2002 with hit TV show Kyun Hota Hai Pyarrr. Looking back at his last 20 years, the actor told indianexpress.com, I… [+5109 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Sports Desk", "title": "একই দিনে দু-দুটো ম্যাচ খেলবে টিম ইন্ডিয়া! বেনজির ঘটনায় বিরাট চমক ভারতের", "description": "ভারত একই সঙ্গে দুটো সফর করবে জুনে। একদিকে জাতীয় টেস্ট ফল খেলবে ইংল্যান্ডের বিরুদ্ধে। সেই সময়েই টিম ইন্ডিয়া নামছে আয়ারল্যান্ডের বিরুদ্ধে টি২০-তে।", "url": "https://bengali.indianexpress.com/sports/team-india-to-play-simultaneous-matches-on-a-same-day-during-england-ireland-tour-451649/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/02/Team-India-1.jpeg", "publishedAt": "2022-06-04T02:36:31Z", "content": "Stay updated with the latest news headlines and all the latest Sports news download Indian Express Bengali App.\r\nWeb Title: Team india to play simultaneous matches on a same day during england irelan… [+5 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "Manabadi AP SSC 10th Results 2022 Live Updates: Result to be announced today", "description": "AP SSC 10th Result 2022, Manabadi BSEAP AP SSC 10th Results Live News: Around 6 lakh candidates appeared for the SSC examination this year. The board will release the provisional marksheets on the official website as well as through SMS.", "url": "https://indianexpress.com/article/education/andhra-pradesh-manabadi-ssc-class-10-result-live-updates-result-announced-toppers-bse-ap-gov-in-7951143/", "urlToImage": "https://images.indianexpress.com/2022/06/6-1-1.jpg", "publishedAt": "2022-06-04T02:33:44Z", "content": "AP SSC exams were conducted from April 27 to May 9 from 9:30 am to 12:45 pm in offline mode.Manabadi AP SSC 10th Results 2022 Live Updates: The Board of Secondary Education Andhra Pradesh (BSEAP) wil… [+679 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Russia Ukraine War News Live Updates: Ukraine says its troops have retaken ground from Russia in Sievierodonetsk", "description": "Russia Ukraine War News Today, Russia Ukraine Strike News Updates, World War 3, Russia Ukraine Capture", "url": "https://indianexpress.com/article/world/russia-ukraine-war-news-live-updates-zelenskyy-putin-biden-7952011/", "urlToImage": "https://images.indianexpress.com/2022/06/ukraine-war-1200.jpg", "publishedAt": "2022-06-04T01:59:05Z", "content": "Russian President Vladimir Putin denied Friday that Moscow was preventing Ukrainian ports from exporting grains, blaming rising global food prices on the West.\r\n Rescuers carry the body of a civilian… [+1322 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Satyendra Nath Bose: Google pays tribute to Indian physicist and mathematician with doodle", "description": "Satyendra Nath Bose Google Doodle: Since childhood, his father, who was an accountant, would write an arithmetic problem for him to solve before leaving for work, feulling Bose’s interest in mathematics.", "url": "https://indianexpress.com/article/trending/trending-in-india/satyendra-nath-bose-google-doodle-7951993/", "urlToImage": "https://images.indianexpress.com/2022/06/Untitled-design-1.jpg", "publishedAt": "2022-06-04T01:33:41Z", "content": "Google Saturday celebrated Indian physicist and mathematician Satyendra Nath Bose and his contribution to the Bose-Einstein Condensate with a doodle. Born in 1924, Bose sent his quantum formulations … [+1826 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "Manabadi AP SSC Class 10 board result 2022: When and where to check", "description": "Manabadi BSEAP AP SSC 10th Results 2022: In case students are unable to check their AP SSC result 2022 due to the extreme traffic on the internet, they can check it through the SMS facility. Andhra Pradesh Board will directly send the AP SSC results 2022 on t…", "url": "https://indianexpress.com/article/education/manabadi-bseap-ap-ssc-class-10-board-result-2022-when-and-where-to-check-bse-ap-gov-in-7936023/", "urlToImage": "https://images.indianexpress.com/2022/06/4-34.jpg", "publishedAt": "2022-06-04T01:30:29Z", "content": "Manabadi AP board Class 10 results 2022: The Board of Secondary Education Andhra Pradesh (BSEAP) will announce the SSC or class 10 results today i.e June 4 at 11 am. Candidates, who appeared in the e… [+99 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Uma Thurman to play US President in rom-com Red, White and Royal Blue", "description": "The story of Red, White and Royal Blue follows the Mexican-American character Alex Claremont-Diaz (Taylor Zakhar Perez) who, upon his mother's (Uma Thurman) election as President, is promptly cast as the American equivalent of a young royal.", "url": "https://indianexpress.com/article/entertainment/hollywood/uma-thurman-to-play-us-president-in-rom-com-red-white-royal-blue-7950609/", "urlToImage": "https://images.indianexpress.com/2022/06/Uma-Thurman-1200by667.jpg", "publishedAt": "2022-06-04T01:30:19Z", "content": "Hollywood star Uma Thurman has been roped in to essay the role of US President Ellen Claremont in Prime Video’s romantic-comedy movie Red, White &amp; Royal Blue. According to Deadline, the film is b… [+1143 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "GSHSEB Class 12 General stream results today: How to check scores", "description": "How to Check Gujarat Board GSEB HSC class 12 Result 2022 Online: Once declared, the result will be available on the official website - gseb.org", "url": "https://indianexpress.com/article/education/gshseb-class-12-general-stream-results-how-to-check-gseb-org-7952000/", "urlToImage": "https://images.indianexpress.com/2021/07/Gujarat-board-class-12-result-2.jpg", "publishedAt": "2022-06-04T01:27:37Z", "content": "The Higher Secondary Certificate (HSC) examination of the Gujarat Board GSHSEB were successfully held between March 28 to April 12, 2022. The board already declared the result for science streams on … [+700 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Committee of urban planners to be chaired by Sabarmati river project chief", "description": "As per the order issued, the committee has been formed to facilitate cities to evolve as bedrock of innovation with sustainable population densities based on carrying capacity of ecosystem services.", "url": "https://indianexpress.com/article/cities/ahmedabad/committee-of-urban-planners-to-be-chaired-by-sabarmati-river-project-chief-7951997/", "urlToImage": "https://images.indianexpress.com/2022/06/Sabarmati-Riverfront-1.jpg", "publishedAt": "2022-06-04T01:23:37Z", "content": "The High Level Committee of urban planners constituted by the Ministry of Housing and Urban Affairs will be chaired by Keshav Varma, chairman Sabarmati Riverfront Development Corporation (SRFDCL) Ahm… [+1861 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Apprehended Pak nationals threw drugs in sea: Gujarat ATS", "description": "On May 31, the Gujarat ATS and Indian Coast Guard (ICG) Thursday arrested seven Pakistani nationals from a boat off Gujarat coast in Kutch for allegedly illegally entering Indian waters.", "url": "https://indianexpress.com/article/cities/ahmedabad/apprehended-pak-nationals-threw-drugs-in-sea-gujarat-ats-7951988/", "urlToImage": "https://images.indianexpress.com/2022/06/arrest-2.jpg", "publishedAt": "2022-06-04T01:15:37Z", "content": "Days after seven Pakistani nationals were apprehended on a boat in the Indian waters off Gujarat coast, the Gujarat Anti Terrorist Squad (ATS) said on Friday that the accused had intended to smuggle … [+1274 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "‘Keep standby ambulance with doctor, check entry’: Police to event organisers", "description": "While no unnatural cause was attributed to death in the post-mortem of singer KK, people have questioned poor arrangements at the venue, saying it was the reason that the singer felt uncomfortable during the performance.", "url": "https://indianexpress.com/article/cities/kolkata/keep-standby-ambulance-with-doctor-check-entry-police-to-event-organisers-7951983/", "urlToImage": "https://images.indianexpress.com/2022/06/KK-oped-1-1.jpg", "publishedAt": "2022-06-04T01:01:47Z", "content": "The Kolkata Police have issued an advisory in the wake of the recent death of Bollywood singer KK soon after a live concert at the city’s Nazrul Manch auditorium and appealed to organisers of such ev… [+2365 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Toppers hail teachers for holding online classes during pandemic", "description": "Schools in the state had reopened in November last year after a gap of 20 months and only students of classes 9 to 12 were allowed to take physical classes. But they were shut again in January following a rapid rise in the infection cases in the state.", "url": "https://indianexpress.com/article/cities/kolkata/toppers-hail-teachers-for-holding-online-classes-during-pandemic-7951980/", "urlToImage": "https://images.indianexpress.com/2022/06/3-KOL-Students-of-Saraswati-Balika-Vidyalaya-and-Shilpa-Sikha-Sadan-4COL-1-1.jpg", "publishedAt": "2022-06-04T00:51:08Z", "content": "Toppers of the class 10 state board examination (Madhyamik), the results for which were declared by the West Bengal Board of Secondary Education (WBBSE) on Friday, credited their teachers for their s… [+2348 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pranav Mukul", "title": "No boarding denial to differently abled sans seeking medical opinion: DGCA draft", "description": "Last month, IndiGo disallowed a specially-abled child from boarding its Hyderabad-bound flight at Ranchi Airport citing potential threat to air safety.", "url": "https://indianexpress.com/article/business/aviation/no-boarding-denial-to-differently-abled-sans-seeking-medical-opinion-dgca-draft-7951975/", "urlToImage": "https://images.indianexpress.com/2022/06/indigo-1200.jpg", "publishedAt": "2022-06-04T00:41:15Z", "content": "In the aftermath of the Ranchi Airport incident, where low-cost airline IndiGo denied boarding to a specially-abled passenger, the countrys aviation safety regulator DGCA has moved to amend its rules… [+2654 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "ISIS operative gets life term for plotting attack on foreigners in Kolkata", "description": "Musa, a resident of Labhpur in West Bengal’s Birbhum district, was arrested on July 4, 2016, from the Burdwan railway station by the state police's CID wing for allegedly radicalising youth to join the ISIS.", "url": "https://indianexpress.com/article/cities/kolkata/isis-operative-gets-life-term-for-plotting-attack-on-foreigners-in-kolkata-7951974/", "urlToImage": "https://images.indianexpress.com/2022/06/gavel-2-3-3.jpg", "publishedAt": "2022-06-04T00:40:13Z", "content": "A special NIA court on Friday sentenced Mohammad Mosiuddin, alias Musa to life imprisonment for plotting an ISIS-style attack on foreigners visiting the headquarters of the Missionaries of Charity in… [+2607 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "Singapore regulator raises issues over Tata takeover of AI", "description": "This is because the CCCS has observed that Air India and Vistara, which is a 51:49 joint venture between Tata Group and Singapore Airlines, are two of the three key market players along overlapping air passenger and air cargo transport routes.", "url": "https://indianexpress.com/article/business/aviation/singapore-regulator-raises-issues-over-tata-takeover-of-ai-7951971/", "urlToImage": "https://images.indianexpress.com/2022/06/air-india.jpg", "publishedAt": "2022-06-04T00:36:50Z", "content": "Tata Group will need to convince Singapores Competition and Consumer Commission (CCCS) that its takeover of Air India does not violate the countrys anti-competition laws.This is because the CCCS has … [+721 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Amid students’ protests, CU syndicate says will go ahead with offline exams", "description": "Although the university is yet to declare the dates for the UG and PG exams, the authorities have directed the affiliated colleges to hold special classes and complete the syllabus before the students take the offline exams.", "url": "https://indianexpress.com/article/cities/kolkata/amid-students-protests-cu-syndicate-says-will-go-ahead-with-offline-exams-7951969/", "urlToImage": "https://images.indianexpress.com/2022/06/calcutta-university-1200.jpg", "publishedAt": "2022-06-04T00:36:07Z", "content": "Despite protests by a section of students seeking online examinations, Calcutta University authorities have decided to continue with the offline exams for the final semesters of undergraduate and pos… [+1875 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Southwest monsoon advances into Bengal", "description": "The weatherman forecast heavy to very heavy rainfall in the districts of Cooch Behar, Jalpaiguri, Alipurduar, Darjeeling and Kalimpong till June 8 morning owing to the onset of the monsoon.", "url": "https://indianexpress.com/article/cities/kolkata/southwest-monsoon-advances-into-bengal-7951965/", "urlToImage": "https://images.indianexpress.com/2022/06/rainfall-759.jpg", "publishedAt": "2022-06-04T00:31:59Z", "content": "The southwest monsoon Friday advanced into West Bengal, at least four days ahead of its normal onset date and has covered some parts of the sub-Himalayan districts of the state, the Met department sa… [+696 chars]"}]}