{"status": "ok", "totalResults": 420, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Raakhi Jagga", "title": "Recent AAP stronghold, Sangrur gave chance to all major parties in 70 years", "description": "In 2014, AAP’s Bhagwant Mann had won with a margin of 2 lakh votes; in 2019 his victory margin was one lakh", "url": "https://indianexpress.com/article/cities/chandigarh/recent-aap-stronghold-sangrur-gave-chance-to-all-major-parties-in-70-years-7940492/", "urlToImage": "https://images.indianexpress.com/2022/05/mann-aap-1.jpg", "publishedAt": "2022-05-28T02:51:06Z", "content": "WITH OVER 15.66 lakh voters, Sangrur Lok Sabha constituency will go to polls on June 23. The bypoll was necessitated after Sangrur MP Bhagwant Mann became AAP’s CM face for the 2022 Assembly polls an… [+3656 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Harikishan Sharma", "title": "Atal Bihari Vajpayee, tall statesman who served as Prime Minister thrice", "description": "Former PM AB Vajpayee, who was widely respected as a statesman across the political spectrum, was also a writer and poet, who was known for his great oratory skills.", "url": "https://indianexpress.com/article/india/political-pulse/atal-bihari-vajpayee-prime-minister-7940523/", "urlToImage": "https://images.indianexpress.com/2022/05/vajpayee-1200.jpg", "publishedAt": "2022-05-28T02:45:13Z", "content": "Atal Bihari Vajpayee, the 11th Prime Minister of India, became the country’s only leader after Jawaharlal Nehru to have been sworn in as the PM during the terms of three successive Lok Sabha.Vajpayee… [+4659 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Beauty therapy course started for women jail inmates in Ludhiana", "description": "Ludhiana deputy commissioner Surabhi Malik and Additional Mission Director, department of employment generation, skill development & training Rajesh Tripathi inaugurated the skill training for the inmates.", "url": "https://indianexpress.com/article/cities/ludhiana/beauty-therapy-course-started-for-women-jail-inmates-in-ludhiana-7940519/", "urlToImage": "https://images.indianexpress.com/2022/05/jail-4.jpeg", "publishedAt": "2022-05-28T02:42:07Z", "content": "In a unique initiative to make women jail inmates financially independent, a training course in beauty therapy was started for them at Women’s Jail, Ludhiana, under the Punjab Skill Development Missi… [+1094 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Arushi Jain", "title": "Top Gun Maverick, Anek, Stranger Things S4: Top shows, films to watch this weekend", "description": "Not sure what to watch? For this weekend, we recommend 7 titles that would be worth your time -- from Top Gun Maverick and Anek in theatres to Stranger Things 4 on Disney Plus Hotstar.", "url": "https://indianexpress.com/article/entertainment/web-series/top-gun-maverick-anek-stranger-things-s4-top-shows-films-to-watch-this-weekend-7939917/", "urlToImage": "https://images.indianexpress.com/2022/05/what-to-watch-1-2.jpg", "publishedAt": "2022-05-28T02:38:38Z", "content": "There are a few films that need the big screen experience. Others need you sprawled on your own couch as you invite a new iteration of an old favourite. It is a good cine week when you get both. It i… [+4739 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Adrija Roychowdhury", "title": "Caste or biradari? How ‘privilege and descent’ plays out among Indian Muslims", "description": "In the South Asian experience of religion, caste is often associated with Hinduism. Yet as sociological research on the lived experience of Islam in India has shown, caste is very much intrinsic to South Asia and practised by Muslims as well, albeit the natur…", "url": "https://indianexpress.com/article/research/caste-or-biradari-how-privilege-and-descent-plays-out-among-indian-muslims-7940273/", "urlToImage": "https://images.indianexpress.com/2022/05/caste-among-muslims.jpg", "publishedAt": "2022-05-28T02:34:34Z", "content": "Ahmad Alis classic novel Twilight in Delhi (1940) portrays a vivid picture of the city and its Muslim inhabitants as it existed in the early 20th century when Mughal rule was at its decline. In Alis … [+14468 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sampada Sharma", "title": "Sharmila Tagore’s Safar has a woman suffering because the men in her life can’t stop being attention seekers", "description": "Safar does not defend its entitled, manipulative men, but it also does not defend its faultless woman. It punishes Sharmila Tagore's Neela, for loving her work, and accepts that the only way she could prosper was by letting go of the men in her life.", "url": "https://indianexpress.com/article/entertainment/bollywood/sharmila-tagore-safar-woman-suffering-because-men-ae-attention-seekers-rajesh-khanna-feroz-khan-7939755/", "urlToImage": "https://images.indianexpress.com/2022/05/safar-feat-1200.jpg", "publishedAt": "2022-05-28T02:32:03Z", "content": "There is a significant scene in Asit Sen’s Safar where Sharmila Tagore’s Neela, a surgeon, is called in to perform the first surgery of her life but to make it to her professional commitment, she has… [+4231 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Komal RJ Panchal", "title": "Sonu Sood on doing more south Indian films: ‘Saves me from doing bad Hindi films’", "description": "Ahead of Samrat Prithviraj, actor Sonu Sood talks about his changing thought process when it comes to his work, the north-south divide and why he is doing more work south of Vindhyas.", "url": "https://indianexpress.com/article/entertainment/bollywood/sonu-sood-on-doing-more-south-indian-films-saves-me-from-doing-bad-hindi-films-7939322/", "urlToImage": "https://images.indianexpress.com/2022/05/sonu1200.jpg", "publishedAt": "2022-05-28T02:31:33Z", "content": "Actor Sonu Sood calls this phase in his life as his “second innings”. The actor believes that after longing to play positive roles in reel life for so long, he is finally getting the right offers. St… [+6174 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rohan Naahar", "title": "Emergency movie review: A wickedly entertaining social thriller that you need to unearth from the depths of Prime Video", "description": "Emergency movie review: Director Carey Williams' uncompromising, Sundance-winning social thriller is must-watch entertainment. It's available in India on Amazon Prime Video.", "url": "https://indianexpress.com/article/entertainment/movie-review/emergency-movie-review-prime-video-social-thriller-7939794/", "urlToImage": "https://images.indianexpress.com/2022/05/emergency-movie-review.jpg", "publishedAt": "2022-05-28T02:30:53Z", "content": "On the same day that a new social thriller starring one of Bollywoods foremost actors arrives in theatres, the under-the-radar Sundance hit Emergency, a wickedly entertaining film also about issues t… [+3598 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "A day after demolition drive, bribe finger at Mohali DFO, Conservator of Forests", "description": "Harish Kumar said that the complaint was filed by one Devinder Singh Sandhu, who is the director of Worldwide Immigration Services.", "url": "https://indianexpress.com/article/cities/sas-nagar-mohali/a-day-after-demolition-drive-bribe-finger-at-mohali-dfo-conservator-of-forests-7940517/", "urlToImage": "https://images.indianexpress.com/2022/05/NL-demolition-3col.jpg", "publishedAt": "2022-05-28T02:30:22Z", "content": "A day after the forest department removed illegal constructions and planted saplings in Masol and Karoran villages of the district, the Chief Conservator (Hills), Harsh Kumar, on Friday wrote a lette… [+2372 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Varinder Bhatia", "title": "Again sent to jail, 5-time CM Chautala was once most Googled person", "description": "In October 2014 (a day before Haryana went to assembly polls), Google had released a statement: “Leader of the Indian National Lokdal (INLD) Om Prakash Chautala, emerged as the most searched leaders in Haryana”.", "url": "https://indianexpress.com/article/cities/chandigarh/again-sent-to-jail-5-time-cm-chautala-was-once-most-googled-person-7940511/", "urlToImage": "https://images.indianexpress.com/2022/05/OP-Chautala-2.jpg", "publishedAt": "2022-05-28T02:25:01Z", "content": "Former Haryana chief minster Om Prakash Chautala was on Friday brought to Tihar Jail here after he was awarded a four-year jail term in a disproportionate assets case, officials said. Chautala was me… [+5456 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Hina Rohtaki", "title": "Chandigarh civic body set to privatise park upkeep", "description": "On Friday, an agenda to privatise the maintenance of neighbourhood parks in Chandigarh was mooted during the civic body's House meeting.", "url": "https://indianexpress.com/article/cities/chandigarh/chandigarh-civic-body-set-to-privatise-park-upkeep-7940509/", "urlToImage": "https://images.indianexpress.com/2022/05/Park2-3col.jpg", "publishedAt": "2022-05-28T02:24:15Z", "content": "The maintenance of neighbourhood parks in Chandigarh is all set to go into private hands.On Friday, an agenda to privatise the maintenance of neighbourhood parks in Chandigarh was mooted during the c… [+4921 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Daily Briefing: NCB gives clean chit to Aryan Khan in drugs case; Geetanjali Shree wins International Man Booker Prize", "description": "Months after being arrested in connection with the drugs-on-cruise case, Shah Rukh Khan’s son Aryan Khan was given a clean chit by the Narcotics Control Bureau (NCB) on Friday.", "url": "https://indianexpress.com/article/live-news/top-news-briefing-today-7940505/", "urlToImage": "https://images.indianexpress.com/2022/04/expressintro-1-1-1-5.jpg", "publishedAt": "2022-05-28T02:22:36Z", "content": "From NCB giving Aryan Khan a clean chit in the drugs-on-cruise case, to Geetanjali Shrees Tomb of Sand becoming the first Hindi novel to win the prestigious International Man Booker Prize 2022 here a… [+4363 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Hina Rohtaki", "title": "Chandigarh: Councillors refuse to restore fuel limit for official staff cars", "description": "The cut in fuel limits was made for official staff cars to cut costs during the Covid-19 pandemic. On Friday, the matter was brought up for discussion but shot down by councillors, who brought up an unfulfilled promise made to them.", "url": "https://indianexpress.com/article/cities/chandigarh/chandigarh-councillors-refuse-to-restore-fuel-limit-for-official-staff-cars-7940504/", "urlToImage": "https://images.indianexpress.com/2022/05/fuel.jpeg", "publishedAt": "2022-05-28T02:15:09Z", "content": "Fridays Municipal Corporations general house meeting saw a standoff between councillors and civic body officials after an agenda to restore fuel limits for official staff cars was put forth. The coun… [+2492 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sriram Veera", "title": "15 mn tweets, 8,000 people: Survey shows Mohamed Salah’s star power is curbing hate crime", "description": "Research by Stanford University found Liverpool fans reduced anti-Muslim tweets compared to others.", "url": "https://indianexpress.com/article/sports/football/15-mn-tweets-8000-people-survey-shows-mohamed-salahs-star-power-is-curbing-hate-crime-7940494/", "urlToImage": "https://images.indianexpress.com/2022/05/Salah.jpg", "publishedAt": "2022-05-28T02:15:00Z", "content": "If he scores another few, then Ill be a Muslim too. Hes sitting in the mosque, thats where I want to be… Mo Salah-la-la-la-la. In 2018, football-intoxicated white fans were belting that song in the s… [+5201 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mohali to have two new sports stadiums by July", "description": "Mohali Mayor, Amarjit Singh Sidhu, on Friday said that a total of five sports stadiums —  Phase VI swimming pool, Phase 5, Sector 71, Phase 7 and Phase 11 sports stadiums — from Greater Mohali Area Development Authority (GMADA) are to be taken over by the civ…", "url": "https://indianexpress.com/article/cities/sas-nagar-mohali/mohali-to-have-two-new-sports-stadiums-by-july-7940498/", "urlToImage": "https://images.indianexpress.com/2022/05/bindra-stadium.jpeg", "publishedAt": "2022-05-28T02:08:00Z", "content": "Mohali is all set to get two more sports stadiums in Phase VII and Phase XI by July.Mohali Mayor, Amarjit Singh Sidhu, on Friday said that a total of five sports stadiums Phase VI swimming pool, Phas… [+699 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Trump urges end to gun-free school zones, easier confinement of ‘deranged’ people", "description": "In his speech at a convention of the National Rifle Association, former US President Donald Trump called for eliminating gun-free school zones, adding that such zones leave victims with no means to defend themselves.", "url": "https://indianexpress.com/article/world/donald-trump-guns-nra-speech-7940483/", "urlToImage": "https://images.indianexpress.com/2022/03/TRUMP-.jpg", "publishedAt": "2022-05-28T02:06:03Z", "content": "Former President Donald Trump Friday argued the United States should make it easier to confine “deranged” people and eliminate gun-free school zones after a gunman killed 19 children and two teachers… [+1805 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Punjab: Assistant lineman suspended on charges of power theft", "description": "During the probe, conducted by the enforcement organization of the corporation, it was found that MCB/MTC seals were broken and a 2 core cable was being used to bypass the metre and give direct supply, thereby establishing theft of electricity.", "url": "https://indianexpress.com/article/cities/ludhiana/punjab-assistant-lineman-suspended-on-charges-of-power-theft-7940488/", "urlToImage": "https://images.indianexpress.com/2022/05/electricity-reuters-1200-2-1-2.jpeg", "publishedAt": "2022-05-28T02:03:16Z", "content": "The Punjab State Power Corporation Limited suspended an assistant lineman, Hardev Singh, who was posted at Abohar for the theft of electricity by direct kundi at his house, the power corporation said… [+653 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kamaldeep Singh Brar", "title": "Conversions hurt poll prospects, says Akali Dal panel; suggests one family one ticket rule", "description": "Without naming the Badals, the committee has suggested that only one member from one family should be allowed to contest either of the Assembly, parliamentary, block samiti, local body or zila parishad election.", "url": "https://indianexpress.com/article/cities/chandigarh/conversions-hurt-poll-prospects-says-akali-dal-panel-suggests-one-family-one-ticket-rule-7940477/", "urlToImage": "https://images.indianexpress.com/2022/05/sad-punjab.jpg", "publishedAt": "2022-05-28T01:58:29Z", "content": "In an indictment of sorts, a committee formed by the Akali Dal to analyse reasons for its rout in the recent Assembly election has, without naming the Badal clan, suggested that only one person from … [+4150 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sandip G", "title": "R Praggnanandhaa – Balancing both Boards", "description": "The 16-year-old, whose dream run to the Chessable Masters final coincided with his board exams, was inadvertently benefited by not preparing for the tournament as much as he would for other competitions.", "url": "https://indianexpress.com/article/sports/chess/r-praggnanandhaa-balancing-both-boards-7940479/", "urlToImage": "https://images.indianexpress.com/2022/05/Praggnanandhaa.jpg", "publishedAt": "2022-05-28T01:56:59Z", "content": "When R Praggnanandhaa was invited for the Chessable Masters, he first checked his board exam schedule. The knockout phase of the tournament, featuring some of the strongest in the field, stretched to… [+4635 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kanchan Vasdev", "title": "Tata Steel evinces interest in Punjab, eyes land in Ludhiana", "description": "All eyes are now on action of land by (Punjab Small Industries and Export Corporation) PSIEC that would be held on June 10.", "url": "https://indianexpress.com/article/cities/chandigarh/tata-steel-evinces-interest-in-punjab-eyes-land-in-ludhiana-7940484/", "urlToImage": "https://images.indianexpress.com/2022/05/1234.jpeg", "publishedAt": "2022-05-28T01:56:54Z", "content": "Domestic steel giant Tata Steel has expressed interest in setting up a scrap-based steel manufacturing unit in Punjab. If all goes well and the company is able to get 100 acres in auction in Ludhiana… [+62 chars]"}]}