{"status": "ok", "totalResults": 322, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Leela Prasad, Rahel Philipose", "title": "Daily briefing: Govt bans wheat exports after new low output estimate; The hand of the Rajapaksas", "description": "The Government could have announced a bonus of Rs 200-250/quintal on top of MSP to augment its wheat procurement.", "url": "https://indianexpress.com/article/live-news/top-news-briefing-today-7917910/", "urlToImage": "https://images.indianexpress.com/2022/04/expressintro-1-1-1-7.jpg", "publishedAt": "2022-05-15T02:43:23Z", "content": "The Big Story\r\nA day after announcing that trade delegations were being sent to nine countries for exploring possibilities of boosting wheat exports from India, the government Saturdaybanned all ship… [+4069 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Maulshree Seth", "title": "Nanda Gopal Gupta interview: ‘I told officers to act like luxury car sellers… Show intent, and they are after you to make that purchase… An industry shows interest, give your 100%’", "description": "It should be written in black and white that Mulayam Singh Yadav, Mayawati and Akhilesh Yadav are responsible for the lost credibility of NOIDA and its adjoining region in UP, the Infrastructure and Industrial Development Minister said.", "url": "https://indianexpress.com/article/india/political-pulse/uttar-pradesh-minister-nanda-gopal-gupta-interview-bjp-7917621/", "urlToImage": "https://images.indianexpress.com/2022/05/Nand-Gopal.jpg", "publishedAt": "2022-05-15T02:30:44Z", "content": "As the Uttar Pradesh Infrastructure and Industrial Development Minister, Nanda Gopal Gupta finds himself holding one of the most crucial portfolios in the Yogi Adityanath-II government. On June 3, th… [+7332 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Tamil Nadu govt launches AI-enabled panic button, CCTV surveillance in 500 Chennai buses", "description": "The state transport department has planned to provide this facility in about 2,500 buses under the Nirbhaya safe city project and in the first phase 500 buses in the metro city have been provided with four panic buttons, AI-enabled Mobile Network Video Record…", "url": "https://indianexpress.com/article/cities/chennai/tamil-nadu-govt-launches-ai-enabled-panic-button-cctv-surveillance-in-500-chennai-buses-7917866/", "urlToImage": "https://images.indianexpress.com/2022/05/MK-Stalin-3.jpg", "publishedAt": "2022-05-15T02:26:20Z", "content": "Tamil Nadu Chief Minister M K Stalin on Saturday launched Artificial Intelligence (AI)-enabled panic button-cum-CCTV surveillance project in 500 Chennai buses as part of an initiative to improve the … [+1669 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sourav Roy Barman, Debraj Deb", "title": "Biplab’s man, dental surgeon, new Tripura CM Manik Saha off to teething troubles", "description": "Saha's induction into the BJP was actually perceived more as an attempt by the BJP to win over the civil society of Tripura, which had been under the CPI(M)-led Left Front rule continuously since 1998.", "url": "https://indianexpress.com/article/north-east-india/tripura/biplabs-man-dental-surgeon-new-tripura-cm-manik-saha-off-to-teething-troubles-7917874/", "urlToImage": "https://images.indianexpress.com/2021/06/tyE3aaPW_400x400.jpg", "publishedAt": "2022-05-15T02:13:28Z", "content": "Tripura BJP president and Rajya Sabha member, Manik Saha, 69, who has replaced Biplab Deb as the Chief Minister, had joined the BJP on December 11, 2016 a development that was no more than a footnote… [+3560 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Gunman kills 10 in racially motivated shooting at Buffalo supermarket", "description": "Authorities said the suspect, who was armed with an assault-style rifle and appeared to have acted alone, drove to Buffalo from his home in a New York county \"hours away\" to launch a Saturday afternoon attack that he broadcast on the internet.", "url": "https://indianexpress.com/article/world/gunman-kills-10-in-racially-motivated-shooting-at-buffalo-supermarket-7917842/", "urlToImage": "https://images.indianexpress.com/2022/05/Gunman.jpg", "publishedAt": "2022-05-15T01:59:26Z", "content": "An 18-year-old white gunman shot 10 people to death and wounded three others at a grocery store in a Black neighborhood of Buffalo, New York, before surrendering after what authorities called an act … [+3372 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Karnataka in a state of flux, Bommai in a fix on Europe trip", "description": "On May 11, following a meeting with Shah, Bommai had stated that anything could happen over the next week in the political situation in Karnataka.", "url": "https://indianexpress.com/article/cities/bangalore/karnataka-in-a-state-of-flux-bommai-in-a-fix-on-europe-trip-7917862/", "urlToImage": "https://images.indianexpress.com/2022/05/Basavaraj-Bommai-2-1-1.jpg", "publishedAt": "2022-05-15T01:57:11Z", "content": "With rapid political developments expected to unfold over the next few weeks in Karnataka, Chief Minister Basavaraj Bommai remains undecided on a proposed visit next week to Europe to attend the Worl… [+1313 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "‘Heartbroken and devastated’: Cricket fraternity reacts to Andrew Symonds’ tragic death", "description": "Two-time World Cup winner Andrew Symonds tragically killed in a single-car crash outside Townsville.", "url": "https://indianexpress.com/article/sports/cricket/heartbroken-and-devastated-cricket-fraternity-reacts-to-andrew-symonds-tragic-death-7917840/", "urlToImage": "https://images.indianexpress.com/2022/05/Andrew-Symonds-1.jpg", "publishedAt": "2022-05-15T01:53:42Z", "content": "Australian cricketer Andrew Symonds died aged 46 on Saturday.Two-time World Cup winner tragically killed in a single-car crash outside Townsville.\r\n“Early information indicates, shortly after 11 pm t… [+2597 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Successive govts cancel projects started by previous regimes, but not liquor policy: Madras HC", "description": "In certain areas, all successive governments for several decades in Tamil Nadu had consistently taken some policy decisions which supported the ones of the previous government irrespective of the political dispensation, Justice R Suresh Kumar observed.", "url": "https://indianexpress.com/article/cities/chennai/madras-high-court-tamil-nadu-liquor-policy-govt-7917832/", "urlToImage": "https://images.indianexpress.com/2022/05/Madras-HC-2-3-1-6.jpg", "publishedAt": "2022-05-15T01:49:44Z", "content": "The Madras High Court on Saturday stated that there have been instances of successive governments abandoning welfare projects initiated by the previous regime, but the prohibition policy remained unt… [+4270 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Debraj Deb, Liz Mathew", "title": "Fast rise, hard fall: The story of Biplab Kumar Deb", "description": "One crisis too many for old-time Sangh hand who was close to top BJP leaders", "url": "https://indianexpress.com/article/india/political-pulse/fast-rise-hard-fall-the-story-of-biplab-kumar-deb-7917712/", "urlToImage": "https://images.indianexpress.com/2022/05/Manik-Saha-1.jpeg", "publishedAt": "2022-05-15T01:30:59Z", "content": "As swift was his rise to become the Chief Minister of Tripura at the relatively young age of 48, so came the end of Biplab Kumar Deb’s tenure. On Saturday, taking everyone by surprise, Deb put in his… [+5353 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Univs should ensure education from KG to PG, says Manohar Lal Khattar", "description": "Haryana chief minister Manohar Lal Khattar added that the fees of poor children studying in these universities would be paid by the government. A new scheme will be introduced for this very soon.", "url": "https://indianexpress.com/article/cities/chandigarh/univs-should-ensure-education-from-kg-to-pg-says-manohar-lal-khattar-7917828/", "urlToImage": "https://images.indianexpress.com/2022/04/KHATTAR.jpg", "publishedAt": "2022-05-15T01:21:47Z", "content": "To ensure quality education under one-roof, Haryana chief minister Manohar Lal Khattar, Saturday said that all state universities should make education available from KG (Kindergarten) to PG (Post Gr… [+40 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Moga: Man beaten to death on suspicion of ‘stealing a piece of wire’, case lodged", "description": "FIR was filed under Sections 304, 148 and 149 of IPC at Nihal Singh Wala police station.", "url": "https://indianexpress.com/article/cities/ludhiana/moga-man-beaten-to-death-on-suspicion-of-stealing-a-piece-of-wire-case-lodged-7917825/", "urlToImage": "https://images.indianexpress.com/2022/05/express-photo-13-12.jpg", "publishedAt": "2022-05-15T01:18:11Z", "content": "A man was allegedly beaten to death by a group of villagers on the suspicion that he stole a piece of wire, at village Madheke of Moga district, Friday."}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Former Australian cricketer Andrew Symonds dies in road accident", "description": "Symonds was the sole passenger in the crash just outside of Townsville in his home state of Queensland and police confirmed that a 46-year-old male died at the scene.", "url": "https://indianexpress.com/article/sports/cricket/andrew-symonds-dies-former-australian-cricketer-road-accident-7917823/", "urlToImage": "https://images.indianexpress.com/2021/01/Symmo.png", "publishedAt": "2022-05-15T01:13:05Z", "content": "Former Australia cricketer and two-time World Cup winner Andrew Symonds has died in a car crash on Saturday night.Symonds was the sole passenger in the crash just outside of Townsville in his home st… [+2459 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sreenivas Janyala", "title": "Amit Shah to KCR: Will defeat you convincingly in 2023 elections", "description": "Amit Shah challenged KCR to opt for early elections. “We are ready. We will defeat you convincingly. BJP governments in state and Centre will implement welfare schemes,” he said.", "url": "https://indianexpress.com/article/cities/hyderabad/amit-shah-to-kcr-will-defeat-you-convincingly-in-2023-elections-7917821/", "urlToImage": "https://images.indianexpress.com/2022/05/amit-shah-7.jpg", "publishedAt": "2022-05-15T01:11:53Z", "content": "Sounding the poll bugle in Telangana, Union Home Minister and BJP veteran Amit Shah on Saturday hit out at the TRS government in the state during a public meeting at Tukkuguda on the outskirts of Hyd… [+1422 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Denial of justice will lead to anarchy: CJI N V Ramana", "description": "Chief Justice of India N V Ramana pointed out that one of the major challenges to the protection of rule of law and human rights was the inability of the formal justice system to deliver speedy and affordable justice to all and the justice delivery mechanism …", "url": "https://indianexpress.com/article/india/denial-of-justice-will-lead-to-anarchy-cji-7917819/", "urlToImage": "https://images.indianexpress.com/2022/05/ramana.jpg", "publishedAt": "2022-05-15T01:04:18Z", "content": "Chief Justice of India N V Ramana on Saturday said that for the functioning of a healthy democracy, its imperative that the people feel that their rights and dignity are protected and recognised.Spea… [+1959 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gangster’s aide arrested after shootout in South Delhi", "description": "Police said he got bail on medical grounds on September 21 last year, but he did not return and was absconding.", "url": "https://indianexpress.com/article/cities/delhi/gangsters-aide-arrested-after-shootout-in-south-delhi-7917816/", "urlToImage": "https://images.indianexpress.com/2022/05/arrest-13.jpg", "publishedAt": "2022-05-15T00:58:27Z", "content": "A 37-year-old member of jailed gangster Rohit Chaudharys gang has been arrested after a brief exchange of fire in South Delhi’s Pushp Vihar, said police.Police said the accused, identified as Sunil R… [+1191 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "The hand of the Rajapaksas", "description": "They were the most powerful political clan in Sri Lanka until the recent crisis spun out of control leading to Mahinda Rajapaksa stepping down as PM and paving the way for Ranil Wickremesinghe. Mahinda has gone. But has he? Nirupama Subramanian traces the arc…", "url": "https://indianexpress.com/article/world/the-hand-of-the-rajapaksas-7917749/", "urlToImage": "https://images.indianexpress.com/2022/05/LANKANEWXZ1.jpg", "publishedAt": "2022-05-15T00:55:33Z", "content": "Its up to the people. People are electing (the Rajapaksas).What can I do about it? When they dont want them, they will kick them out, all Rajapaksas will be kicked out. So said Mahinda Rajapaksa in 2… [+15264 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pavneet Singh Chadha, Jignasa Sinha", "title": "Harrowing last calls to kin: ‘Please mujhe bacha lo’", "description": "Of the 27 victims, bodies of only eight had been identified by evening.", "url": "https://indianexpress.com/article/cities/delhi/delhi-mundka-fire-victims-kin-reaction-7917813/", "urlToImage": "https://images.indianexpress.com/2022/05/delhi-fire-2-1.jpeg", "publishedAt": "2022-05-15T00:49:24Z", "content": "Mummy, papa aag lag gayi yahan pe, please call fire brigade, we are all trapped. This was the last call 26-year-old Tania Bhushan made to her parents, minutes before a massive fire killed her and 26 … [+3301 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Remembering Pandit Shivkumar Sharma: The man who made santoor classical", "description": "His contribution in establishing the santoor as a classical instrument of heft made Pandit Shivkumar Sharma, who passed away this week, a man of prodigious talent and determination, writes Aneesh Pradhan", "url": "https://indianexpress.com/article/express-sunday-eye/remembering-pandit-shivkumar-sharma-the-man-who-made-santoor-classical-7916979/", "urlToImage": "https://images.indianexpress.com/2022/05/Pandit-Shivkumar-Sharma-1200.jpg", "publishedAt": "2022-05-15T00:40:26Z", "content": "The history of Hindustani music is replete with instances of experimentation that have shaped its course. These experiments have taken place in the realm of performance practice, pedagogy, modes of d… [+10508 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Harikishan Sharma", "title": "In Khargone, a tale of two PMAY houses: one bulldozed, other vandalised by mob", "description": "In violence that erupted during Ram Navami procession in which at least 10 houses of her neighbours were set ablaze. Her main door’s a gaping hole, so is the window; a lifetime’s assets, including a gas stove, cylinder, water motor pump, fan and television, a…", "url": "https://indianexpress.com/article/express-exclusive/khargone-violence-demolition-pmay-house-mob-vandalism-7917808/", "urlToImage": "https://images.indianexpress.com/2022/05/khargone.jpg", "publishedAt": "2022-05-15T00:34:13Z", "content": "In blue ink, this is scrawled on the wall of the single-storey house at Towerwali Gali at Sanjay Nagar in Khargone. The house, built under the Prime Minister Awas Yojana-Urban, belongs to Leela Bai C… [+4118 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manoj C G", "title": "Chintan Shivir ends today: Hindutva debate in Cong, party ducks hard talk on defeat", "description": "The CWC will finalise the Udaipur declaration Sunday based on inputs from six committees which discussed: political challenges, organisational issues, economic issues, social justice, youth and empowerment; and farmers and agriculture.", "url": "https://indianexpress.com/article/india/congress-chintan-shivir-hindutva-debate-poll-defeat-7917801/", "urlToImage": "https://images.indianexpress.com/2022/05/chintan-shivar.jpg", "publishedAt": "2022-05-15T00:12:09Z", "content": "On the videography survey of the Kashi Vishwanath temple-Gyanvapi mosque complex, the Congress took a categorial stand Saturday that no attempt should be made to change the status of any place of wor… [+3802 chars]"}]}