{"status": "ok", "totalResults": 301, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Mother’s Day 2022: Google celebrates motherhood by showing small acts of love", "description": "Mother's Day 2022: Today's doodle shows the special relationship of a mother and a child, and the mother's role in the growth of children.", "url": "https://indianexpress.com/article/trending/trending-globally/mothers-day-2022-google-doodle-gifs-7906092/", "urlToImage": "https://images.indianexpress.com/2022/05/Google-Doodle.jpg", "publishedAt": "2022-05-08T02:40:23Z", "content": "Marking the day thats a dedication to mothers across the world, Google has released a special Gif Doodle with four slides on Mothers Day 2022, and it is absolutely adorable. Google is celebrating the… [+709 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rahel Philipose, Rounak Bagchi", "title": "Daily Briefing: UNSC calls Russian invasion of Ukraine a ‘dispute’; Tajinder Bagga gets protection from arrest till May 10", "description": "The Directorate of Estates under the Ministry of Housing and Urban Affairs has sent notices to the Foreign Correspondents’ Club and the Indian Women Press Corps to vacate the bungalows allotted to them as their tenures will soon end.", "url": "https://indianexpress.com/article/live-news/top-news-briefing-today-7906101/", "urlToImage": "https://images.indianexpress.com/2022/05/expressintro-1-1-1-2.jpg", "publishedAt": "2022-05-08T02:26:53Z", "content": "The UNSCs watered down statement on the Russian invasion of Ukraine; Naseeruddin Shah writes on Faiz Ahmed Faizs verses being removed from textbooks; The Assam governments plans to set up schools for… [+5236 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shubhra Gupta", "title": "Is the success of recent films from the south teaching Bollywood a lesson or two in positioning and storytelling?", "description": "Films, be they big or small in scale, what works across the board finally is attitude, vision and conviction", "url": "https://indianexpress.com/article/express-sunday-eye/success-films-south-bollywood-lesson-positioning-storytelling-7905629/", "urlToImage": "https://images.indianexpress.com/2022/05/Eye-RRR-1200.jpg", "publishedAt": "2022-05-08T00:45:48Z", "content": "“Movies from the south are gold at the box office. Bollywood has forgotten how to make movies. These two statements have been tossed out so frequently during the last six months, that even hardened s… [+9964 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Suvir Saran", "title": "In the memory of my aunt Asha, who taught me to be comfortable in my own skin", "description": "Hers was a life unfettered, with neither any obligation to another nor pausing to be questioned by the self or others", "url": "https://indianexpress.com/article/express-sunday-eye/in-the-memory-of-my-aunt-asha-who-taught-me-to-be-comfortable-in-my-own-skin-suvir-saran-7905830/", "urlToImage": "https://images.indianexpress.com/2022/05/suvir-saran-1200.jpg", "publishedAt": "2022-05-08T00:35:24Z", "content": "This past week dealt my family and me another blow, but with it came rich lessons in life and living. I lost my Asha Bua, a lifelong resident of Bombay(now Mumbai), to old age, in Bengaluru. Almost 9… [+6102 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Happy Mother’s Day 2022: Wishes images, quotes, Whatsapp messages, status, and photos", "description": "Happy Mother's Day 2022 Wishes images, status, quotes, messages, status, caption, cards: Mother's love is the purest and most selfless form of love. It is a day to celebrate motherhood and honour mothers.", "url": "https://indianexpress.com/article/lifestyle/life-style/happy-mothers-day-2022-wishes-images-quotes-whatsapp-messages-status-and-photos-7879750/", "urlToImage": "https://images.indianexpress.com/2022/04/Mothers-Day-Feature-card.jpg", "publishedAt": "2022-05-08T00:30:18Z", "content": "Happy Mother’s Day 2022 Wishes images, messages, status, quotes: Mother’s love is the purest and most selfless form of love. It is a day to celebrate motherhood and honour mothers.It is believed that… [+1728 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Peter Vidal", "title": "Weekly Horoscope, May 8, 2022 – May 14, 2022: Libra, Aries, Pisces and other signs — check astrological prediction", "description": "Aquarius-- Friendly arrangements will bring practical gains assuming, of course, that they are made on a business-like basis over the week. Plus, committee work or involvement in a group fighting for a common cause, will become a more attractive proposition.", "url": "https://indianexpress.com/article/horoscope/weekly-horoscope-may-8-2022-may-14-2022-libra-aries-pisces-and-other-signs-check-astrological-prediction-7904914/", "urlToImage": "https://images.indianexpress.com/2022/03/horoscope-1.jpg", "publishedAt": "2022-05-07T23:30:01Z", "content": "Whats on the cards for you this week? Aries, if you’ve been sitting on the fence and generally prevaricating, seize an overdue chance to settle a personal matter. Leo, you’ll be brimming over with se… [+4160 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Serivce", "title": "Centre tormenting people, says Mamata Banerjee", "description": "The statement came in the wake of a hike of Rs 50 in the price of a domestic LPG cylinder. She also accused the Centre of conducting a \"great Indian loot\" by hiking the prices of other essential commodities besides petrol, diesel, LPG.", "url": "https://indianexpress.com/article/cities/kolkata/centre-tormenting-people-says-mamata-banerjee-7906062/", "urlToImage": "https://images.indianexpress.com/2022/05/mamata-759-1-1-1-5.jpg", "publishedAt": "2022-05-07T23:28:48Z", "content": "West Bengal Chief Minister and Trinamool Congress (TMC) supremo Mamata Banerjee on Saturday accused the BJP-led central government of tormenting” the people of the country by regularly raising prices… [+983 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Malayalam Mission removes Qatar coordinator", "description": "Durgadas Sisupalan's removal came after his comments during the  Ananthapuram Hindu Maha Sammelan in Thiruvananthapuram last week.", "url": "https://indianexpress.com/article/cities/thiruvananthapuram/malayalam-mission-removes-qatar-coordinator-7906041/", "urlToImage": "https://images.indianexpress.com/2022/05/IE-79-7.jpeg", "publishedAt": "2022-05-07T23:22:28Z", "content": "Malayalam Mission, a Kerala government initiative to promote Malayalam globally, has removed its Qatar regional coordinator over derogatory remarks against nurses who emigrate to Gulf countries for j… [+1221 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Serivce", "title": "Uttar Pradesh: Man stabbed to death, three suspects arrested", "description": "Some residents blocked the Jaunpur-Azamgarh highway in protest after the incident.", "url": "https://indianexpress.com/article/cities/lucknow/uttar-pradesh-man-stabbed-to-death-three-suspects-arrested-7906071/", "urlToImage": "https://images.indianexpress.com/2022/01/ARREST-1-5-3.jpg", "publishedAt": "2022-05-07T23:17:47Z", "content": "Tension prevailed in Gaura Badshapur area of Jaunpur after a man was stabbed to death and another injured following an argument at a shop on Friday, police said on Saturday. Three persons have been a… [+1300 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Serivce", "title": "Uttar Pradesh: ‘Raped’ by father, Banda woman found hanging", "description": "The woman’s younger sister told the police that on Wednesday evening, their father came home in a drunken state and allegedly raped his elder daughter.", "url": "https://indianexpress.com/article/cities/lucknow/uttar-pradesh-raped-by-father-banda-woman-found-hanging-7906069/", "urlToImage": "https://images.indianexpress.com/2022/05/express-5-2.jpg", "publishedAt": "2022-05-07T23:10:23Z", "content": "THE BANDA police on Saturday arrested a 49-year-old labourer in Banda for allegedly sexually assaulting his 19-year-old daughter, after which she allegedly died by suicide. On Friday, the police were… [+824 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Serivce", "title": "Kashi Vishwanath-Gyanvapi complex: Survey halted over plea seeking court-appointed official’s removal", "description": "On April 8, Civil Judge (Senior Division), Varanasi, Ravi Kumar Diwakar had appointed Kumar as advocate commissioner to carry out the survey and directed him to “prepare videography of the action” and submit a report.", "url": "https://indianexpress.com/article/cities/lucknow/kashi-vishwanath-gyanvapi-complex-survey-halted-over-plea-seeking-court-appointed-officials-removal-7906068/", "urlToImage": "https://images.indianexpress.com/2022/05/Gyanvapi-Mosque.jpg", "publishedAt": "2022-05-07T22:55:46Z", "content": "A day after the court-ordered videographic survey of the Maa Shringar Gauri Sthal at the disputed Kashi Vishwanath Temple-Gyanvapi Mosque complex began in Varanasi, the process had to be halted on Sa… [+2370 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Serivce", "title": "BJP worker’s death: Postmortem report not in, Trinamool & BJP trade barbs", "description": "Arjun Chaurasia (26), a BJP worker, was found dead in an abandoned building in north Kolkata's Cossipore area in the early hours of Friday. Following a Calcutta High Court order, the post-mortem was conducted at the Command Hospital.", "url": "https://indianexpress.com/article/cities/kolkata/bjp-workers-death-postmortem-report-not-in-trinamool-bjp-trade-barbs-7906065/", "urlToImage": "https://images.indianexpress.com/2021/12/BJPTMC.jpg", "publishedAt": "2022-05-07T22:41:38Z", "content": "The Trinamool Congress (TMC) and the BJP entered into a war of words on Saturday over the post-mortem examination of a saffron party worker at the Army’s Command Hospital. The report is yet to be mad… [+2239 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tora Agarwala", "title": "This is the way we go to school", "description": "Come May 10, Assam tea gardens will finally have high schools. Down forests, past elephants, bench by bench, teacher by teacher, children of workers can finally hope to finish schooling, have a life outside", "url": "https://indianexpress.com/article/north-east-india/assam/this-is-the-way-we-go-to-school-7905968/", "urlToImage": "https://images.indianexpress.com/2022/05/Model-Tea-Garden-School.jpg", "publishedAt": "2022-05-07T22:35:15Z", "content": "Two years ago in September, 14-year-old Sonali Gogoi boarded one of the crowded shuttle buses from the Namsang Tea Estate, where her mother Jondoi Tanti works as a plucker, to Joypur town in eastern … [+8279 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Karunjit Singh", "title": "Director General, International Renewable Energy Agency: India working well on phasing out coal, need to focus on existing schemes", "description": "'We have seen that it is the fourth country in the world, when we consider installing capacity of renewables. And we have seen out there that they are raising the ambition for (renewable energy capacity) from 450 to 500 gigawatts by 2030.'", "url": "https://indianexpress.com/article/business/commodities/director-general-international-renewable-energy-agency-india-working-well-on-phasing-out-coal-need-to-focus-on-existing-schemes-7906010/", "urlToImage": "https://images.indianexpress.com/2022/05/06-Camera2-4col.jpg", "publishedAt": "2022-05-07T22:31:32Z", "content": "India’s efforts to boost renewable energy capacity were practically making it possible to reduce the use of coal, Francesco La Camera, Director General of the International Renewable Energy Agency to… [+5780 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Krishn Kaushik, Man Aman Singh Chhina", "title": "The Sunday Profile: General Manoj Pande, the right man at the right place", "description": "General Manoj Pande has broken a glass ceiling by becoming the first Army Chief from Corps of Engineers. But, whether it’s his qualifications, career, postings or diligence, the General has been on a march", "url": "https://indianexpress.com/article/india/the-sunday-profile-general-manoj-pande-the-right-man-at-the-right-place-7905926/", "urlToImage": "https://images.indianexpress.com/2022/05/Army-chief-Gen-Manoj-Pand-Sunday-profile-illustartion-2.jpg", "publishedAt": "2022-05-07T22:25:11Z", "content": "Around eight years ago, when he was Brigadier, Manoj Pande was posted in the headquarters of the Eastern Command as the Brigadier General Staff (Operations), one of the most important positions there… [+7913 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Atri Mitra", "title": "WBCS officers’ body set to hold annual meet after 5 years, poll unlikely", "description": "The Annual General Meeting (AGM) of the association is scheduled to be held on the same day at the Kolkata Town Hall. Sources, however, said, with the polls unlikely, the post holders of the association are to be selected by the top brass of the state adminis…", "url": "https://indianexpress.com/article/cities/kolkata/wbcs-officers-body-set-to-hold-annual-meet-after-5-years-poll-unlikely-7906056/", "urlToImage": "https://images.indianexpress.com/2022/05/express-5-1.jpg", "publishedAt": "2022-05-07T22:24:23Z", "content": "EVEN as the election to West Bengal Civil Service (WBCS) Officers Association is slated be held on May 17, after a gap of nearly five-and-a-half years, sources say it may not happen as no nominations… [+3580 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "FM Sitharaman on RBI rate hike: Timing a surprise to many … but people thought should’ve been done anyway", "description": "“It came as a surprise because it’s between the two MPCs (Monetary Policy Committee meetings). But the US Fed had been saying it all the while,” Sitharaman said in her first reaction to the RBI rate hike.", "url": "https://indianexpress.com/article/business/banking-and-finance/fm-sitharaman-on-rbi-rate-hike-timing-a-surprise-to-many-but-people-thought-shouldve-been-done-anyway-7906002/", "urlToImage": "https://images.indianexpress.com/2022/05/NSDL-4col.jpg", "publishedAt": "2022-05-07T22:17:58Z", "content": "Finance Minister Nirmala Sitharaman on Saturday said the timing of the  Reserve Bank decision to hike policy rates on May 4 came as a surprise to many but people thought it should have been done anyw… [+3261 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sohini Ghosh", "title": "CCHFW passes resolution ‘boycotting’ WHO’s mortality estimate report", "description": "The WHO has estimated 4.7 million excess deaths in the two years of the pandemic.", "url": "https://indianexpress.com/article/cities/ahmedabad/cchfw-passes-resolution-boycotting-whos-mortality-estimate-report-7906051/", "urlToImage": "https://images.indianexpress.com/2022/05/covid-pti.jpg", "publishedAt": "2022-05-07T22:16:11Z", "content": "The three-day conference of the Central Council of Health and Family Welfare (CCHFW) in t Kevadia concluded on Saturday, with a Gujarat government press release quoting Union Health Minister Mansukh … [+1869 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Nirupama Subramanian", "title": "With security, pilgrims pray at ASI-protected temple ruins in Valley", "description": "The 8th century temple was said to have been destroyed during the rule of Sikandar Shah Miri between 1389 and 1413.", "url": "https://indianexpress.com/article/cities/chennai/with-security-pilgrims-pray-at-asi-protected-temple-ruins-in-valley-7906032/", "urlToImage": "https://images.indianexpress.com/2022/05/cop-2-1-6.jpg", "publishedAt": "2022-05-07T22:04:20Z", "content": "Over 100 pilgrims held prayers for a few hours Friday morning at the ASI-protected Martand Sun Temple ruins in Anantnag district of Jammu and Kashmir.Guarded by security personnel provided by the dis… [+3922 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Ritu Sharma, Avinash Nair", "title": "AMC polls: BJP candidate declared winner again after recounting of votes", "description": "The Supreme Court, on April 26, had directed to recount the votes \"to quell all doubts in the election process\", following a petition moved by Congress Jagdish Mohnani who came second in the civic body poll results.", "url": "https://indianexpress.com/article/cities/ahmedabad/amc-polls-bjp-candidate-declared-winner-again-after-recounting-of-votes-7906052/", "urlToImage": "https://images.indianexpress.com/2022/04/bjp-1-1-1.jpg", "publishedAt": "2022-05-07T21:48:19Z", "content": "BJP candidate Gitaba Chavda was declared the winner again from the general seat in Kubernagar ward in the Ahmedabad Municipal Corporation (AMC) elections, held over a year ago, after the Supreme Cour… [+5315 chars]"}]}