{"status": "ok", "totalResults": 319, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Rinku Ghosh", "title": "Why we need moms for management lessons", "description": "The hand that rocks the cradle may not rule the corporate world yet but company policies and campaigns are helping new mothers get their rightful place back, in the boardroom and on office floors", "url": "https://indianexpress.com/article/express-sunday-eye/why-we-need-moms-for-management-lessons-7964799/", "urlToImage": "https://images.indianexpress.com/2022/06/eye-cover-1200.jpg", "publishedAt": "2022-06-12T00:45:34Z", "content": "When Ranjani Krishnaswamy was thinking about a storyboard for jewellery brand Tanishqs Mothers Day campaign, she didnt want a saccharine concept of the forever giver, nurturer and restorer. She wante… [+11393 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Bhabanipur double murder: 2 more accused arrested from Odisha & UP", "description": "A senior officer of the Kolkata Police said, “Both persons are directly involved in the crime. The accused were present at the residence of the deceased couple at the time of the murder. We are questioning them. Both are being brought to Kolkata.”", "url": "https://indianexpress.com/article/cities/kolkata/2-more-accused-arrested-from-odisha-up-7965301/", "urlToImage": "https://images.indianexpress.com/2022/06/arrest-15.jpg", "publishedAt": "2022-06-12T00:40:16Z", "content": "Police have arrested two more persons for their alleged involvement in the murder of a Gujarati couple in Bhawanipore area, taking the total number of people arrested in connection with the killings … [+927 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "His MP seeks Nupur hanging, Owaisi says not party stand", "description": "Addressing a protest in Aurangabad on Friday, Jaleel said: “Agar Nupur Sharma ko phansi dena hai, toh Aurangabad ke isi chauraha ke andar phansi de (If Nupur Sharma is to be hanged, hang her from this very square in Aurangabad).”", "url": "https://indianexpress.com/article/india/his-mp-seeks-nupur-hanging-owaisi-says-not-party-stand-7965289/", "urlToImage": "https://images.indianexpress.com/2022/06/imtiazjaleel-2col.jpg", "publishedAt": "2022-06-12T00:36:24Z", "content": "A DAY after AIMIM MP Imtiaz Jaleel said that if the now-suspended BJP spokesperson Nupur Sharma was to be hanged for her remarks against the Prophet, it should be done from this very square in Aurang… [+2485 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tavleen Singh", "title": "Tavleen Singh writes: Religion and politics do not mix", "description": "\"If religion had not become part of our political discourse, none of this would have happened. But, because it has, we have a situation in which BJP spokespersons appear to have been encouraged to demean Islam,\" writes Tavleen Singh.", "url": "https://indianexpress.com/article/opinion/columns/tavleen-singh-writes-nupur-sharma-naveen-jindal-politics-religion-7965136/", "urlToImage": "https://images.indianexpress.com/2022/06/religion-759.jpg", "publishedAt": "2022-06-12T00:30:58Z", "content": "The storm that two disgraced BJP spokesmen have caused because of their reckless comments about the Prophet of Islam has now begun to cause harm within India. Last week anger erupted outside mosques … [+5186 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "ভারতে কোথায় আছে সূর্য মন্দির, কী মেলে সূর্য উপাসনায়?", "description": "হিন্দু শাস্ত্রমতে কশ্যপ ও অদিতির পুত্র হলেন সূর্য।", "url": "https://bengali.indianexpress.com/lifestyle/surya-temple-in-india-and-abroad-455584/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/surya-temple.jpg", "publishedAt": "2022-06-12T00:30:00Z", "content": ", , \r\n , , \r\n ( ) , , \r\n , , \r\n - , , \r\n , , , , , - , , , - , , \r\nStay updated with the latest news headlines and all the latest Lifestyle news download Indian Express Bengali App.\r\nWeb Title: Surya… [+26 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "State BJP chief held for ‘defying’ govt order", "description": "Earlier in the day, the police stopped Majumdar at his residence in New Town from going to Howrah, citing that his visit could adversely impact the law and order situation in the district.", "url": "https://indianexpress.com/article/cities/kolkata/state-bjp-chief-held-for-defying-govt-order-7965292/", "urlToImage": "https://images.indianexpress.com/2022/06/Sukanta-Majumdar.jpeg", "publishedAt": "2022-06-12T00:29:35Z", "content": "Earlier in the day, the police stopped Majumdar at his residence in New Town from going to Howrah, citing that his visit could adversely impact the law and order situation in the district. However, h… [+3663 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Section 144 imposed in Howrah till June 15", "description": "The move came after a fresh clash broke out between the police and the protesters in Howrah’s Panchla Bazaar on Saturday. The police threw teargas shells to disperse the crowd.", "url": "https://indianexpress.com/article/cities/kolkata/section-144-imposed-in-howrah-till-june-15-7965288/", "urlToImage": "https://images.indianexpress.com/2022/06/PTI06_10_2022_000289A.jpeg", "publishedAt": "2022-06-12T00:19:11Z", "content": "THE STATE government said on Saturday that Section 144 of CrPC, which prohibits the gathering of four or more people, has been put in place in several areas such as Uluberia, Panchla and Domjur till … [+1804 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Abhishek Angad", "title": "Nagaland killings: Cops chargesheet 30 Army men, say SoP flouted", "description": "The Hemant Soren government has ordered a high-level inquiry into the incident and circumstances which led to “firing” by police on crowds protesting remarks against the Prophet by the now-suspended BJP spokesperson Nupur Sharma.", "url": "https://indianexpress.com/article/india/boy-awaiting-class-x-results-among-2-killed-in-ranchi-police-face-probe-7965276/", "urlToImage": "https://images.indianexpress.com/2022/06/cop-2-1-5.jpg", "publishedAt": "2022-06-12T00:04:45Z", "content": "THIRTY Indian Army personnel, including a Major, have been named in a chargesheet filed by the Nagaland Police for the botched operation in which six civilians were killed in Mon district last Decemb… [+3423 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anonna Dutt", "title": "He was happy as his condition was improving… thought he’d be discharged soon: Family", "description": "Although Verma was on ventilator as per the hospital, his wife Munni Devi claimed: “He was off ventilator. I was there last night. I had my dinner with him, he was very happy because his condition was improving and we thought he might be discharged soon.”", "url": "https://indianexpress.com/article/delhi/he-was-happy-as-his-condition-was-improving-thought-hed-be-discharged-soon-family-7965273/", "urlToImage": "https://images.indianexpress.com/2022/06/49dea02c-4512-4c7f-ba61-7336908691b5.jpg", "publishedAt": "2022-06-11T23:53:36Z", "content": "Holi Verma (64), who died in a fire at Brahm Shakti hospital on Saturday, had been undergoing treatment for kidney disease at the facility for over a year. He was admitted 15 days ago when his condit… [+1828 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Anti-encroachment drive continues along Yamuna floodplains in Noida, 27 farmhouses demolished", "description": "Five JCB machines and three dumper trucks were used in the demolition process, officials said, adding that the land on which the illegal colonies/farmhouses are built is worth approximately Rs 60 crore.", "url": "https://indianexpress.com/article/cities/delhi/anti-encroachment-drive-continues-along-yamuna-floodplains-in-noida-27-farmhouses-demolished-7965281/", "urlToImage": "https://images.indianexpress.com/2022/06/delhi-demoition-drive.jpeg", "publishedAt": "2022-06-11T23:51:56Z", "content": "The Noida Authority Saturday carried out another anti-encroachment drive along the Yamuna floodplain zone in Sector 135, near Nangli Nangla and Nangli Bazidpur villages, where 27 farmhouses/structure… [+2032 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shiny Varghese", "title": "How a citizen’s initiative turned a mining site in Gurgaon into an urban forest — the Aravalli Biodiversity Park", "description": "ABP is a story of how a city came together and created a place for wilderness. Citizen group ‘iamgurgaon’, with ideas from then municipal commissioner Sudhir Rajpal to involve corporates, led to turning a barren land into one of NCR’s most nourishing and calm…", "url": "https://indianexpress.com/article/cities/delhi/how-a-citizens-initiative-turned-a-mining-site-in-gurgaon-into-an-urban-forest-the-aravalli-biodiversity-park-7965278/", "urlToImage": "https://images.indianexpress.com/2022/06/aravalli.jpg", "publishedAt": "2022-06-11T23:44:54Z", "content": "A forest is a dynamic system, its in a constant state of evolution; constantly interacting with its elements, ever changing. It has many layers you have trees, shrubs, climbers, epiphytes, grasses, f… [+6067 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Peter Vidal", "title": "Weekly Horoscope, June 12, 2022 – June 18, 2022: Scorpio, Aries, Pisces and other signs — check astrological prediction", "description": "Weekly Horoscope, June 12, 2022 – June 18, 2022: Scorpio, the next fortnight should be one of relaxation and a quest for personal fulfilment, rather than a time for doing what you're told, yet again.", "url": "https://indianexpress.com/article/horoscope/weekly-horoscope-june-12-2022-june-18-2022-scorpio-aries-pisces-and-other-signs-check-astrological-prediction-7963863/", "urlToImage": "https://images.indianexpress.com/2022/06/horoscope.jpg", "publishedAt": "2022-06-11T23:30:35Z", "content": "You are bound to feel slightly confused over the coming weeks, but only if you persist in dealing with practical matters which, in your heart of hearts, you know should be left until tomorrow, or pre… [+3803 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Asad Rehman", "title": "Kanpur ‘illegal’ structure demolished: civic body, police differ on owner ‘links’", "description": "In a statement, Kanpur Development Authority (KDA) said the property belonged to one Mohammad Ishtiaq. “Police and administration have also informed that links of Mr Ishtiaq are apparently to mafia, which is being investigated,” it stated.", "url": "https://indianexpress.com/article/cities/lucknow/kanpur-illegal-structure-demolished-civic-body-police-differ-on-owner-links-7965269/", "urlToImage": "https://images.indianexpress.com/2022/06/June11-Kanpurbuilding-4col.jpg", "publishedAt": "2022-06-11T23:20:15Z", "content": "Days after the city witnessed protests, which subsequently turned violent, Kanpur Development Authority (KDA) on Saturday demolished a commercial building in the city’s Swaroop Nagar area. Police sai… [+2449 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Ravik Bhattacharya, Atri Mitra", "title": "Targeted by protesters, BJP calls for Central forces in Howrah", "description": "Along a 35-km stretch of National Highway 6 in Howrah, the signs of violence are visible – one can see the remains of vandalised and torched BJP offices, shops, business establishments, a local club, police kiosks and vehicles.", "url": "https://indianexpress.com/article/cities/kolkata/targeted-by-protesters-bjp-calls-for-central-forces-in-howrah-7965268/", "urlToImage": "https://images.indianexpress.com/2022/06/bengal-BJPoffice-3col.jpg", "publishedAt": "2022-06-11T23:13:50Z", "content": "Tension mounted in West Bengal after crowds protesting remarks against the Prophet, by the now-suspended BJP spokesperson Nupur Sharma, resorted to fresh violence in Howrah on Saturday, torching shop… [+4590 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Divya A", "title": "Buddha relics to be taken to Mongolia, Rijiju to lead team", "description": "The relics will be displayed at Batsagaan Temple, within the premises of Gandan Monastery, where Prime Minister Narendra Modi had visited in 2015.", "url": "https://indianexpress.com/article/india/buddha-relics-to-be-taken-to-mongolia-rijiju-to-lead-team-7965266/", "urlToImage": "https://images.indianexpress.com/2022/01/Riju2.jpg", "publishedAt": "2022-06-11T23:11:37Z", "content": "In a unique gesture, four Holy Relics of Lord Buddha are being taken to Mongolia for an exposition as part of Mongolian Buddha Purnima celebrations on June 14.A 25-member delegation, led by Union Law… [+3036 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Goa: Sitharaman inaugurates museum that showcases work that Customs do", "description": "The two-storey ‘Blue building’ that houses the museum, which was known as Alfandega, during the Portuguese rule in Goa, has been standing on the banks of the Mandovi River in Panaji is about 400 years old.", "url": "https://indianexpress.com/article/cities/goa/goa-sitharaman-inaugurates-museum-that-showcases-work-that-customs-do-7965267/", "urlToImage": "https://images.indianexpress.com/2022/06/P1-Nirmala-Sitharaman-3col.jpg", "publishedAt": "2022-06-11T23:09:38Z", "content": "Antique coins, statues, endangered wildlife, weapons and narcotics seized by Customs are among the exhibits at the ‘Dharohar’ the National Museum of Customs and GST, which Union Finance Minister Nirm… [+1042 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Soumyarendra Barik, Pranav Mukul", "title": "At biotech startup event, typhoid RT-PCR, cataract detection via WhatsApp", "description": "There were over 300 stalls spanning the biotech spectrum -- medical technology, agricultural tech, diagnostics, vaccine technology, biotech incubators etc.", "url": "https://indianexpress.com/article/india/at-biotech-startup-event-typhoid-rt-pcr-cataract-detection-via-whatsapp-7965261/", "urlToImage": "https://images.indianexpress.com/2022/06/doctor-759-4-1.jpg", "publishedAt": "2022-06-11T23:09:10Z", "content": "EXPANDING RT-PCR based testing to diseases other than Covid-19, vaccine formats that obviate the need for cold chains, portable and cutting-edge wearables, and AI-based diagnostic solutions that can … [+7271 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Serivce", "title": "Karnataka on high alert, says CM Bommai", "description": "Speaking at Hubballi, the Chief Minister said: “A high-level meeting has been held with police top brass to take precautionary measures in the backdrop of violence in Delhi and Uttar Pradesh. Currently the situation is peaceful in the state. The police have b…", "url": "https://indianexpress.com/article/cities/bangalore/karnataka-on-high-alert-says-cm-bommai-7965264/", "urlToImage": "https://images.indianexpress.com/2022/06/bommai-1200-1.jpg", "publishedAt": "2022-06-11T22:58:28Z", "content": "Following the derogatory remarks of expelled BJP leader Nupur Sharma, Karnataka CM on Saturday said he had issued directions to take precautionary measures.Speaking at Hubballi, he said: A high-level… [+681 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kiran Parashar", "title": "After 5 deaths, officials admit filtration unit not cleaned for 5 years", "description": "The man who died on Friday was Janakaraj, a guest lecturer at a government engineering college. He was unmarried and had been taking care of his ailing 65-year-old mother.", "url": "https://indianexpress.com/article/india/after-5-deaths-officials-admit-filtration-unit-not-cleaned-for-5-years-7965233/", "urlToImage": "https://images.indianexpress.com/2022/06/death-5-2-1.jpg", "publishedAt": "2022-06-11T22:43:25Z", "content": "With the death of a 48-year-old man on Friday, the number of people who died after drinking contaminated water in Karnatakas Raichur has gone up to five. Officials have said that several wards in the… [+4093 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Liz Mathew, Shyamlal Yadav", "title": "Sunday Story: A new red line", "description": "A raucous TV debate and a string of tweets by two BJP spokespersons — normal grist to the Hindutva mill. But as their remarks on the Prophet spun out of control, the BJP faced its first blowback on its handling of minority issues. What followed was a swift cr…", "url": "https://indianexpress.com/article/india/sunday-story-red-line-bjp-modi-shah-jindal-nupur-prophet-remark-7963742/", "urlToImage": "https://images.indianexpress.com/2022/06/MODI-COVER-NEW1.jpg", "publishedAt": "2022-06-11T22:34:50Z", "content": "A FEW minutes before 11 pm on June 1, a senior BJP leader got an angry call from a senior colleague. What has this Naveen Jindal tweeted? Until then, the leader, who is part of the media unit, had no… [+15754 chars]"}]}