{"status": "ok", "totalResults": 387, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Russia-Ukraine crisis: UNSC drops ‘war’, ‘invasion’ from first statement, terms it a ‘dispute’", "description": "The short UN Security Council statement expresses \"strong support\" for Secretary-General Antonio Guterres' efforts to find a peaceful solution to the Russia-Ukraine \"dispute.\"", "url": "https://indianexpress.com/article/world/russia-ukraine-crisis-unsc-statement-7905049/", "urlToImage": "https://images.indianexpress.com/2022/02/AP22053194835424.jpg", "publishedAt": "2022-05-07T02:51:19Z", "content": "The UN Security Council on Friday unanimously adopted its first statement on Ukrainesince Russia’s military action began on February 24, expressing “strong support” for Secretary-General Antonio Gute… [+5795 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Arushi Jain", "title": "Home Shanti, Thar, Doctor Strange in the Multiverse of Madness: Top picks for latest shows, movies", "description": "Not sure what to watch? For this weekend, we have 6 titles that could be worth your time -- from Home Shanti on Disney Plus Hotstar to Doctor Strange in the Multiverse of Madness in cinemas.", "url": "https://indianexpress.com/article/entertainment/web-series/home-shanti-thar-doctor-strange-in-the-multiverse-of-madness-top-picks-this-weekend-7904480/", "urlToImage": "https://images.indianexpress.com/2022/05/what-to-watch.jpg", "publishedAt": "2022-05-07T02:50:52Z", "content": "The weather gods haven’t been entirely kind to large portions of the country – from the sultry heat in North and West India to heavy rains in portions of South India. But if you are able, head out to… [+4295 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kshitij Rawat", "title": "Vijay Varma on working with Alia Bhatt in Darlings: ‘Glad she approached me, brought my A-game to the character’", "description": "In the Hindi version of Audible's audio production The Sandman, Vijay Varma voices the titular character. He will also be seen in Darlings, Alia Bhatt's debut production venture.", "url": "https://indianexpress.com/article/entertainment/bollywood/vijay-varma-on-working-with-alia-bhatt-in-darlings-7900646/", "urlToImage": "https://images.indianexpress.com/2022/05/vijay-varma-1200-1.jpg", "publishedAt": "2022-05-07T02:47:09Z", "content": "Vijay Varma is a busy man. Best known for his intense, committed performances in Amazon Prime Video’s heartland crime drama Mirzapur and in Ranveer Singh-led Gully Boy, he has built for himself a con… [+4564 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rinku Ghosh", "title": "Victor Banerjee: ‘We tend to hero worship and are afraid to criticise icons, understand their frailties’", "description": "Victor Banerjee returns to the screen as Rabindranath Tagore in Thinking of Him, a film by Argentinian director Pablo Cesar that explores the poet’s soul relationship with critic and writer Victoria Ocampo.", "url": "https://indianexpress.com/article/entertainment/entertainment-others/victor-banerjee-interview-rabindranath-tagore-thinking-of-him-7905072/", "urlToImage": "https://images.indianexpress.com/2016/08/victorbanerjee-1200.jpg", "publishedAt": "2022-05-07T02:45:13Z", "content": "The only thing constant about actor-author Victor Banerjee is his love for Landour, the birds of Uttarakhand, his writings and being a son of the Bengali culture as he calls himself. And it is becaus… [+7067 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "GT vs MI: Awesome we got over the line, says Daniel Sams on conceding just 3 runs in last over", "description": "Gujarat Titans needed nine runs from the last over bowled by Sams but they could score just three to lose the match.", "url": "https://indianexpress.com/article/sports/ipl/gt-vs-mi-awesome-we-got-over-the-line-saus-daniel-sams-on-conceding-just-3-runs-in-last-over-7905064/", "urlToImage": "https://images.indianexpress.com/2022/05/Daniel-Sams.jpg", "publishedAt": "2022-05-07T02:33:57Z", "content": "Australian pacer Daniel Sams, who conceded just three runs in a dramatic last over to help Mumbai Indians beat Gujarat Titans by five runs, said he stuck to his slower deliveries and it was an “aweso… [+2877 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rahel Philipose, Rounak Bagchi", "title": "Daily Briefing: Highway drama over Delhi BJP leader Tajinder Bagga’s arrest; Why state govts love the sedition law", "description": "With China deciding to postpone the Hangzhou Asian Games, which were scheduled to be held from September 10 to 25, in the face of rising Covid-19 cases, the Olympic Council of Asia is staring at a narrow window where no major championships are already schedul…", "url": "https://indianexpress.com/article/live-news/top-news-briefing-today-7905041/", "urlToImage": "https://images.indianexpress.com/2022/05/expressintro-1-1-1-1.jpg", "publishedAt": "2022-05-07T02:18:07Z", "content": "Froma political slugfest between the AAP and BJP over the arrest of BJP leader Tajinder Pal Singh Bagga, to why Chinas decision to postpone the Asian Games has thrown the 2023 sports schedule into di… [+5810 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Chelsea confirm terms agreed Boehly-led consortium to buy club", "description": "The Stamford Bridge-based outfit announced the 4.25 billion pound ($5.2 billion) deal for the reigning European champions in a statement issued in the early hours of Saturday, subject to receiving the required approvals.", "url": "https://indianexpress.com/article/sports/football/chelsea-confirm-terms-agreed-boehly-led-consortium-to-buy-club-7905053/", "urlToImage": "https://images.indianexpress.com/2022/03/CFC-2.jpg", "publishedAt": "2022-05-07T02:17:28Z", "content": "Chelsea Football Club has confirmed that terms have been agreed with a consortium led by Los Angeles Dodgers part-owner Todd Boehly and backed by Clearlake Capital over the acquisition of the English… [+1920 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tushar Bhaduri", "title": "GT vs MI: Daniel has the veto to stop Titans", "description": "Dramatic last over sees Mumbai Indians’ Sams defend nine runs; David’s cameo at the end proves crucial.", "url": "https://indianexpress.com/article/sports/ipl/gt-vs-mi-daniel-has-the-veto-to-stop-titans-7905042/", "urlToImage": "https://images.indianexpress.com/2022/05/Daniel-Sams-Mumbai-Indians.jpg", "publishedAt": "2022-05-07T02:09:16Z", "content": "Synopsis: Titans squander a winning position to suffer second loss in a row as Mumbai Indians snare back-to-back victories despite Pollards struggles against quality bowling.Gujarat Titans will wonde… [+6336 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Gas leak blamed for blast at iconic Havana hotel that killed 22", "description": "The blast shrouded the building and surrounding streets in plumes of black smoke and dust rising from the rubble.", "url": "https://indianexpress.com/article/world/havana-hotel-blast-death-toll-7905029/", "urlToImage": "https://images.indianexpress.com/2022/05/havana-1200.jpg", "publishedAt": "2022-05-07T01:46:52Z", "content": "A deadly explosion hit a well-known hotel in downtown Havana on Friday, tearing a gash several floors high in the side of the building, killing at least 22 people and injuring upwards of 70, witnesse… [+2846 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Punjab: Van with students turns turtle, 15 miss Class 10 board exam", "description": "One student and the driver have been referred to Guru Gobind Singh Medical College in Faridkot while the others were being treated at the Civil Hospital in Kotkapura.", "url": "https://indianexpress.com/article/cities/ludhiana/punjab-van-with-students-turns-turtle-15-miss-class-10-board-exam-7905024/", "urlToImage": "https://images.indianexpress.com/2022/05/express-photo-7.jpg", "publishedAt": "2022-05-07T01:28:03Z", "content": "Eighteen children were injured when an overloaded van carrying 30 students overturned in Punjabs Faridkot district Friday morning, the police said. The students of Government School Koharwala were he… [+971 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anju Agnihotri Chaba", "title": "No end to power crisis, Punjab govt notifies district-wise paddy transplantation date", "description": "Farmers traditionally have been opposed to the idea of late transplantation of their paddy crops as they claim that it doesn't give them  enough time to manage the stubble.", "url": "https://indianexpress.com/article/cities/jalandhar/no-end-to-power-woes-punjab-govt-notifies-district-wise-paddy-transplantation-date-7905018/", "urlToImage": "https://images.indianexpress.com/2022/05/paddy-2.jpg", "publishedAt": "2022-05-07T01:14:51Z", "content": "Punjab’s Agriculture and Farmers Welfare department on Friday notified various dates for sowing paddy in different districts of the state in view of the current power crisis which has led to blackout… [+3170 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Man who filed FIR against Tejinder Bagga dubs BJP leader as ‘troublemaker’", "description": "Ahluwalia on Friday termed Bagga as a ‘troublemaker’ and wanted Punjab Police to arrest the BJP leader at the earliest.", "url": "https://indianexpress.com/article/cities/sas-nagar-mohali/tejinder-pal-bagga-arrest-bjp-fir-punjab-police-7905011/", "urlToImage": "https://images.indianexpress.com/2022/05/bagga-4.jpg", "publishedAt": "2022-05-07T01:02:44Z", "content": "Sunny Ahluwalia, the man who originally filed the complaint that led to Tejinder Pal Bagga’s arrest on Friday, inhis FIR had alleged that the BJP leader was ‘indulged in activities which was harming … [+777 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Nitin Sharma", "title": "‘Whichever era or format, key is to be consistent and be better player’: Former Indian cricket Syed Kirmani", "description": "\"Every era comes to an end and it happened with the West Indies cricket team, followed by the rise of the Indian team in the 1980’s — including the 1983 Cricket World Cup. Then we saw the dominance of the Australian team and players like Ricky Ponting showed …", "url": "https://indianexpress.com/article/sports/cricket/indian-cricketer-syed-kirmani-test-matches-wicket-keeper-odi-world-cup-1983-7905009/", "urlToImage": "https://images.indianexpress.com/2022/05/SYED-KIRMANI.jpg", "publishedAt": "2022-05-07T00:48:19Z", "content": "Dressed up in a Pathani suit and a waist coat, 72-year-old former Indian cricketer Syed Kirmani looked dashing as he attended a function in Chandigarh on Friday. The former Indian wicket-keeper, who … [+4254 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Chandigarh police reshuffle: 26 officers, including 5 DSPs, transferred", "description": "The reshuffling, though on the cards since the visit of Union Home Minister, Amit Shah, on March 27, kept getting delayed  due to various reasons.", "url": "https://indianexpress.com/article/cities/chandigarh/chandigarh-police-reshuffle-26-officers-including-5-dsps-transferred-7905006/", "urlToImage": "https://images.indianexpress.com/2022/05/chandigarh-police.jpg", "publishedAt": "2022-05-07T00:39:31Z", "content": "The Chandigarh Police on Friday effected a major reshuffle in its ranks, in which 26 police officers, including 5 Deputy Superintendents of Police (DSPs), 19 police inspectors, including 8 station ho… [+2073 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Parul", "title": "‘Technology can never compensate for commitment’: PGI’s new director", "description": "Prof Lal, who is also heading the Department of Neurology at PGI, did his MBBS (1985) from Guru Nanak Dev University, Amritsar, and MD (1990) and DM Neurology (1993) from PGI, Chandigarh.", "url": "https://indianexpress.com/article/cities/chandigarh/technology-can-never-compensate-for-commitment-pgi-director-7905003/", "urlToImage": "https://images.indianexpress.com/2022/05/pgi.jpg", "publishedAt": "2022-05-07T00:32:00Z", "content": "THE faith of people in PGI is so high that we have to keep pace with it. This is my first thought, as I take over a new role in an institute of which I have been a part for the past 35 years. It is a… [+3642 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aditi Raja", "title": "Faculty: Syndicate member led mob to art exhibition", "description": "Jain had, in 2007, protested against the art installations of Masters' student Chandramohan depicting Jesus Christ and Goddess Durga at an annual evaluation exhibition.", "url": "https://indianexpress.com/article/cities/baroda/faculty-syndicate-member-led-mob-to-art-exhibition-7904995/", "urlToImage": "https://images.indianexpress.com/2022/05/Guj-2-1.jpg", "publishedAt": "2022-05-06T23:36:54Z", "content": "A day after a group  of people created ruckus at an art exhibition at MS University alleging “objectionable” artworks on display, Associate Professor Indrapramit Roy from the Painting Department said… [+1134 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Peter Vidal", "title": "Horoscope Today, May 7, 2022: Libra, Aries, Pisces and other signs — check astrological prediction", "description": "Aquarius-- There is no earthly reason why you should be the one to fork out when other people are short of cash. Still, seeing as this is an extravagant moment, you may as well spend money where it's needed.", "url": "https://indianexpress.com/article/horoscope/horoscope-today-may-7-2022-libra-aries-pisces-and-other-signs-check-astrological-prediction-7904912/", "urlToImage": "https://images.indianexpress.com/2022/04/HORO33-1-1-1-1-1.jpeg", "publishedAt": "2022-05-06T23:30:51Z", "content": "Whats on the cards today for you? Aries, you’re liable to shy away from social engagements or emotional risks. Leo, much the same advice applies today as yesterday – relax and indulge yourself. Read … [+3726 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Bashaarat Masood", "title": "Pahalgam: Top Hizb man among 3 militants killed", "description": "They termed the killing of one of the most wanted militant commanders “on the [Amarnath] yatra route” as a major success. “Ashraf Molvi along with two other terrorists killed.", "url": "https://indianexpress.com/article/cities/srinagar/pahalgam-top-hizb-man-among-3-militants-killed-7904992/", "urlToImage": "https://images.indianexpress.com/2022/05/army-1.jpeg", "publishedAt": "2022-05-06T23:30:05Z", "content": "A TOP Hizbul Mujahideen militant commander was among three militants killed in a gunfight with security forces in south Kashmir on Friday.Police said Mohammad Ashraf Khan alias Ashraf Molvi, one of t… [+1188 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Esha Roy", "title": "Underage marriages down overall: NFHS-5", "description": "Working women more likely to use modern contraception: Survey", "url": "https://indianexpress.com/article/india/underage-marriages-down-overall-nfhs-5-7904989/", "urlToImage": "https://images.indianexpress.com/2022/05/Mandaviya-1.jpg", "publishedAt": "2022-05-06T23:21:50Z", "content": "While the national average of underage marriages has come down, the rate has increased in Punjab, West Bengal, Manipur, Tripura and Assam, according to the fifth round of National Family Health Surve… [+1859 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manish Sahu", "title": "Kidnapping, rape of minor: ‘Evidence’ collected against accused cop", "description": "Police sources said the victim identified a room at a police station where she was allegedly taken and sexually assaulted by the then SHO.", "url": "https://indianexpress.com/article/cities/lucknow/kidnapping-rape-of-minor-evidence-collected-against-accused-cop-7904985/", "urlToImage": "https://images.indianexpress.com/2022/05/express-5.jpg", "publishedAt": "2022-05-06T23:14:04Z", "content": "LALITPUR police on Friday said they have collected concrete evidence of assault on a minor Dalit girl by an SHO and other accused. Police sources said the victim identified a room at a police station… [+1634 chars]"}]}