{"status": "ok", "totalResults": 427, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Hina Rohtaki", "title": "Rail India Technical and Economic Services survey: Underpasses to help Chandigarh beat traffic at 9 points", "description": "According to details obtained by The Indian Express, at least 15 traffic junctions in the city stayed choked during peak traffic hours at present, with the situation likely to get worse in the next five years as the number of vehicles increase.", "url": "https://indianexpress.com/article/cities/chandigarh/rail-india-technical-economic-services-survey-underpasses-chandigarh-traffic-8016052/", "urlToImage": "https://images.indianexpress.com/2022/07/chandigarh-traffic.jpg", "publishedAt": "2022-07-08T00:42:32Z", "content": "The Rail India Technical and Economic Services (RITES), after a survey, has proposed the building of underpasses at nine of Chandigarh’s 15 major junctions to ease traffic congestions and prevent veh… [+2959 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Punjab DSP bribe arrest: Police transfer case to Vigilance Bureau", "description": "As per details, the Tarn Taran district police had arrested a drug supplier — identified as Pishora Singh — from a petrol pump near Patti Morh and recovered 250 gram of opium and Rs 1 lakh in drug money from his possession on Sunday.", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-dsp-bribe-arrest-police-transfer-case-to-vigilance-bureau-8016049/", "urlToImage": "https://images.indianexpress.com/2022/07/corruption-1.jpg", "publishedAt": "2022-07-08T00:28:46Z", "content": "A day after arresting its Faridkot Deputy Superintendent of Police (DSP) for allegedly taking a bribe, Punjab Police on Thursday decided to transfer the case to its Vigilance Bureau to ensure “a free… [+1051 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Zubair arrest illegal, will defend freedom of speech if elected: Sinha", "description": "He held a press conference in the presence of SP president Akhilesh Yadav and RLD chief Jayant Chaudhary even as SP alliance partner Suheldev Bhartiya Samaj Party leader Om Prakash Rajbhar was conspicuous by his absence.", "url": "https://indianexpress.com/article/cities/lucknow/zubair-arrest-illegal-will-defend-freedom-of-speech-if-elected-sinha-8016042/", "urlToImage": "https://images.indianexpress.com/2022/07/Yashwant-Sinha-2.jpeg", "publishedAt": "2022-07-08T00:01:57Z", "content": "Opposition’s joint Presidential candidate and former Union Minister Yashwant Sinha on Thursday said that the arrest of fact-checking website Alt News was najayaz (illegal) and that he would defend th… [+2113 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "TMC Govt Scheme: 8,000 students get credit cards for pursuing higher education", "description": "CM tells students to ‘think positive’, says education standard has improved", "url": "https://indianexpress.com/article/cities/kolkata/tmc-govt-scheme-8000-students-get-credit-cards-for-pursuing-higher-education-8016039/", "urlToImage": "https://images.indianexpress.com/2022/07/Students-4col.jpg", "publishedAt": "2022-07-07T23:42:11Z", "content": "Chief Minister Mamata Banerjee on Thursday distributed student credit cards among 8,000 beneficiaries under her government’s scheme for the pursuance of higher education at a function held at Netaji … [+1803 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "TET ‘scam’: CBI searches houses of WBBPE chief and his predecessor", "description": "According to CBI sources, the sleuths seized incriminating materials, electronic evidence and other material during the searches.", "url": "https://indianexpress.com/article/cities/kolkata/tet-scam-cbi-searches-houses-of-wbbpe-chief-and-his-predecessor-8016037/", "urlToImage": "https://images.indianexpress.com/2022/07/CBI-office-4col.jpg", "publishedAt": "2022-07-07T23:38:10Z", "content": "The Central Bureau of Investigation (CBI) on Thursday carried out searches at seven places, including at the West Bengal Board of Primary Education (WBBPE) office and the houses of its former and inc… [+2204 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Acid fly infection scare in north Bengal", "description": "The infection first appeared in Sikkim and has since been around, officials said. About 100 students of North Bengal University (NBU), Siliguri, are now affected by the virus. The fear and panic has gripped students so much that many left hostels to head back…", "url": "https://indianexpress.com/article/cities/kolkata/acid-fly-infection-scare-in-north-bengal-8016035/", "urlToImage": "https://images.indianexpress.com/2022/07/dengue1.jpg", "publishedAt": "2022-07-07T23:31:17Z", "content": "Acid fly or Nairobi fly infection has created scare in several areas of North Bengal with the Darjeeling district administration issuing an advisory for prevention against the insect.Mainly children … [+1329 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gujarat High Court: Lawyers’ body seeks action over violation of livestreaming rules", "description": "The representation also points out that Rule 4, which enlists various cases which should not be livestreamed such as cases involving matrimonial disputes, cases of offences of sexual assault and under POCSO Act, are being livestreamed and unauthorisedly being…", "url": "https://indianexpress.com/article/cities/ahmedabad/gujarat-high-court-lawyers-body-seeks-action-over-violation-of-livestreaming-rules-8016019/", "urlToImage": "https://images.indianexpress.com/2022/07/Gujarat-HC-2.jpg", "publishedAt": "2022-07-07T22:57:18Z", "content": "Pointing out that the live streaming of the Gujarat High Court proceedings are being used by various persons on social media, the Gujarat High Court Advocates Association Thursday wrote to the Chief … [+1576 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Surat: Fire department saves boy who tried to jump into Tapi river", "description": "According to the fire department officials of the Surat Municipal Corporation (SMC), a passerby while traveling on the newly constructed bridge on Tapi river, spotted the boy who climbed on the protection wall to jump into the river.", "url": "https://indianexpress.com/article/cities/surat/surat-fire-department-saves-boy-who-tried-to-jump-into-tapi-river-8016017/", "urlToImage": "https://images.indianexpress.com/2022/07/IE-79-3.jpeg", "publishedAt": "2022-07-07T22:51:40Z", "content": "The fire department officials Thursday saved a 17-year-old boy in Surat who tried to jump into the Tapi river allegedly to end his life.According to the fire department officials of the Surat Municip… [+721 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sourav Roy Barman", "title": "Presidential poll: TMC watchful about tribal votes, Yashwant Sinha may skip Bengal during campaign tour", "description": "Opposition nominee’s camp cites ‘paucity of time’, says ‘one should not read too much into it’", "url": "https://indianexpress.com/article/political-pulse/presidential-poll-tmc-watchful-about-tribal-votes-yashwant-sinha-may-skip-bengal-8015970/", "urlToImage": "https://images.indianexpress.com/2022/07/Yashwant-Sinha-with-Samajwadi-Party-leader-Akhilesh-Yadav-and-RLD-chief-Jayant-Chaudhary-in-Lucknow.jpg", "publishedAt": "2022-07-07T22:50:49Z", "content": "Trinamool Congress (TMC)-governed West Bengal is not likely to feature in the travel itinerary of joint Opposition nominee for presidential elections Yashwant Sinha, who plans to visit, among other p… [+4331 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Yashwant Sinha to meet Gujarat Congress MLAs today ahead of presidential polls", "description": "Meanwhile, ahead of the Gujarat assembly elections, the Congress appointed as many as 37 observers—mostly ministers in Rajasthan and Chhattisgarh governments—for the 26 parliamentary constituencies of Gujarat.", "url": "https://indianexpress.com/article/cities/ahmedabad/yashwant-sinha-to-meet-gujarat-congress-mlas-today-ahead-of-presidential-polls-8016009/", "urlToImage": "https://images.indianexpress.com/2022/07/Yashwant-Sinha-1.jpeg", "publishedAt": "2022-07-07T22:48:55Z", "content": "Ahead of presidential elections, joint opposition candidate Yashwant Sinha will meet Congress MLAs in Gandhinagar Friday. According to Congress party officials, Sinha is expected to arrive at Ahmedab… [+1576 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shyamlal Yadav", "title": "Explained: Sub-categorising OBCs", "description": "The Justice Rohini Commission for sub-categorisation of OBCs has got yet another extension. Why has it been felt necessary to create categories within OBCs for reservations, and what has the panel found so far?", "url": "https://indianexpress.com/article/explained/sub-categorising-other-backward-classes-8015889/", "urlToImage": "https://images.indianexpress.com/2022/07/reservation.jpg", "publishedAt": "2022-07-07T22:40:52Z", "content": "What is sub-categorisation of OBCs?\r\nThe idea is to create sub-categories within the larger group of OBCs for the purpose of reservation. OBCs are granted 27% reservation in jobs and education under … [+5971 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "George Mathew", "title": "Explained: How your car insurance will factor in your driving behaviour", "description": "The new concepts will enable vehicle owners to take advantage of their driving behaviour patterns, general upkeep of the vehicles, mileage and vehicle usage patterns, leading to cheaper insurance policies for their vehicles.", "url": "https://indianexpress.com/article/explained/car-insurance-factor-driving-behaviour-8015897/", "urlToImage": "https://images.indianexpress.com/2022/07/Car-insurance-exp.png", "publishedAt": "2022-07-07T22:40:22Z", "content": "On Wednesday, the Insurance Regulatory and Development Authority of India (IRDAI) allowed general insurance companies to introduce new technology-enabled concepts called pay as you drive, pay how you… [+5184 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Kutch Branch Canal develops breach during maiden testing", "description": "A major breach in the structure of KBC was reported early morning near Bidada village. Purported photos and videos were circulated on social media, showing water gushing away through the broken lining and the earthen embankment having been washed away.", "url": "https://indianexpress.com/article/cities/rajkot/kutch-branch-canal-develops-breach-during-maiden-testing-8015963/", "urlToImage": "https://images.indianexpress.com/2022/07/kutch-copy-1.jpg", "publishedAt": "2022-07-07T22:37:23Z", "content": "THE KUTCH Branch Canal (KBC) of the Narmada dam project developed a breach near Bidada village on the outskirts of Mandvi taluka of Kutch during its maiden testing by the Sardar Sarovar Narmada Nigam… [+1064 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "July 8, 1982, Forty Years Ago: Opposition Demands", "description": "Opposition parties will press for the introduction of an anti-defection bill during the forthcoming monsoon session of the Lok Sabha. At a meeting of representatives of nine opposition parties, it was agreed that there would be proper floor coordination of op…", "url": "https://indianexpress.com/article/opinion/editorials/forty-years-ago-opposition-demands-8015837/", "urlToImage": "https://images.indianexpress.com/2022/07/08-Jul-1982_IE_001.jpg", "publishedAt": "2022-07-07T22:34:35Z", "content": "Opposition parties will press for the introduction of an anti-defection bill during the forthcoming monsoon session of the Lok Sabha. At a meeting of representatives of nine opposition parties, it wa… [+1511 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Zubair sent to six-day police custody in UP, top court to hear bail plea", "description": "“We sought Zubair’s police custody to recover the device from which he used to tweet, and also his motive for uploading objectionable matter on social media,” said Arvind Singh, Station House Officer, Khairabad (Sitapur), where the case was registered.", "url": "https://indianexpress.com/article/cities/delhi/zubair-sent-to-six-day-police-custody-in-up-8015927/", "urlToImage": "https://images.indianexpress.com/2022/07/zubair-3col-1.jpg", "publishedAt": "2022-07-07T22:34:34Z", "content": "CITING DEATH threats, Mohammed Zubair, the co-founder of fact-checker website Alt News, approached the Supreme Court on Thursday seeking quashing of the FIR and grant of bail urgently in a case filed… [+5332 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Lt Gen S A Cruze, an early pioneer of sports medicine in India, dies", "description": "For his service to sports in the country, he was awarded the Shiv Chhatrapati Award by the Maharashtra government and the Krida Bhushan Award by Symbiosis International University.", "url": "https://indianexpress.com/article/cities/pune/lt-gen-s-a-cruze-an-early-pioneer-of-sports-medicine-in-india-dies-8016001/", "urlToImage": "https://images.indianexpress.com/2022/07/sports-2col.jpg", "publishedAt": "2022-07-07T22:33:45Z", "content": "Considered one of the pioneers in sports medicine in India, Lt Gen S A Cruze, VSM passed away on Thursday following a heart attack. He was 70 and is survived by his wife and two daughters.Lt Gen S A … [+1722 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Amarjeet Sinha", "title": "Welfare of the urban poor cannot be an afterthought in economic growth plans", "description": "The time has come to enforce minimum wages. Master Plans must factor in the housing and welfare needs of the working class.", "url": "https://indianexpress.com/article/opinion/columns/welfare-urban-poor-cannot-afterthought-economic-growth-plans-8015868/", "urlToImage": "https://images.indianexpress.com/2020/07/urban-poor-1200.jpg", "publishedAt": "2022-07-07T22:30:57Z", "content": "To make rapid economic progress, India needs to improve the well-being of the workforce that migrates to cities in the hope of a better life. A large number of migrants who returned to their homes in… [+5641 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shamsul Islam", "title": "Every Indian, not Muslims alone, needs an independent judiciary", "description": "For the Supreme Court, constitutional issues should not be confused with minority issues.", "url": "https://indianexpress.com/article/opinion/columns/indian-muslims-needs-independent-judiciary-8015877/", "urlToImage": "https://images.indianexpress.com/2022/06/supreme-court-1.jpeg", "publishedAt": "2022-07-07T22:30:38Z", "content": "Faizan Mustafa, legal scholar, disclosed in a recent article (Bench above religion, IE, July 5) that in 1997, he refused to undertake a project on the role of Muslim judges as it was against the ingr… [+4421 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Varinder Bhatia", "title": "Dalai Lama to visit Leh on July 15 after four-year gap", "description": "China has always objected to the Tibetan spiritual leader's visits to the region, including during his last visit in 2018.", "url": "https://indianexpress.com/article/india/dalai-lama-to-visit-leh-on-july-15-after-four-year-gap-8015938/", "urlToImage": "https://images.indianexpress.com/2022/07/dalai-lama-759.jpg", "publishedAt": "2022-07-07T22:30:10Z", "content": "The Dalai Lama will be in Leh on July 15 his first visit in around four years that comes amid a deterioration of ties between India and China over the standoff in eastern Ladakh.China has always obje… [+1509 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Partha Sarathi Biswas", "title": "With poll defeat, NCP leader loses control over co-op sugar mill", "description": "For Bhagirath, this is the second setback after losing in the by-elections for the Pandharpur assembly seat which fell vacant due to his father's demise.", "url": "https://indianexpress.com/article/cities/pune/with-poll-defeat-ncp-leader-loses-control-over-co-op-sugar-mill-8015999/", "urlToImage": "https://images.indianexpress.com/2022/07/sugar-1-1.jpg", "publishedAt": "2022-07-07T22:28:04Z", "content": "Bhagirath Bhalke, the son of late NCP MLA Bharat, not only lost his directorship but also the control over the Vithal Cooperative Sugar Mill. Declared on Thursday, the results of elections of this co… [+1510 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "Easing the flow", "description": "As external environment becomes challenging, RBI moves to boost inflows, anticipating pressures ahead", "url": "https://indianexpress.com/article/opinion/editorials/rbi-moves-to-boost-inflows-anticipating-pressures-ahead-8015851/", "urlToImage": "https://images.indianexpress.com/2022/07/edit-7.jpg", "publishedAt": "2022-07-07T22:19:01Z", "content": "Data from the Union ministry of commerce and industry on Monday showed that the merchandise trade deficit had surged to a record high of $25.6 billion in June. For the entire first quarter, the defic… [+2787 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Iram Siddique", "title": "After rail officer killed by train, family alleges negligence, GRP launches criminal probe", "description": "The family’s allegations, including that of mental harassment, are now part of a criminal probe — apart from a separate internal investigation — being carried out by the Jabalpur division of the Government Railway Police.", "url": "https://indianexpress.com/article/cities/bhopal/after-rail-officer-killed-by-train-family-alleges-negligence-grp-launches-criminal-probe-8015985/", "urlToImage": "https://images.indianexpress.com/2022/07/Yadvendra-with-wife-Varsha.jpg", "publishedAt": "2022-07-07T22:18:39Z", "content": "On the evening of June 23, Yadvendra Singh Bhati was overseeing track work near the Amlai railway station in Madhya Pradesh when he was hit by a passenger train, suffering fatal injuries.But this was… [+6140 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuradha Mascarenhas", "title": "BA.2.75 variant in 20 cases from Nagpur division: Study", "description": "State health authorities have undertaken a detailed epidemiological investigation of these patients. Presently, the tally of BA.2.75 variant patients in the state stands at 30.", "url": "https://indianexpress.com/article/cities/pune/ba-2-75-variant-in-20-cases-from-nagpur-division-study-8015995/", "urlToImage": "https://images.indianexpress.com/2022/07/covid-2-3.jpg", "publishedAt": "2022-07-07T22:18:08Z", "content": "A PRELIMINARY clinical study of 75 patients with BA.2.74, BA.2.75, and BA.2.76 sub-variants of the Omicron has shown that a majority had mild symptoms. There were no deaths and none of the patients r… [+2026 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "Boris-exit", "description": "Outgoing British PM took people’s confidence for granted while flouting democratic rules and conventions", "url": "https://indianexpress.com/article/opinion/editorials/boris-took-peoples-confidence-for-granted-while-flouting-democratic-rules-8015847/", "urlToImage": "https://images.indianexpress.com/2022/07/edit-6.jpg", "publishedAt": "2022-07-07T22:15:33Z", "content": "In the end, it was a non-cooperation movement within the ruling party that led to the resignation of the British Prime Minister. The revolt within the Conservative Party-led government against Boris … [+2201 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Jignasa Sinha", "title": "‘My father is innocent; we don’t use newspapers to pack meat, only rotis rolled in them’", "description": "Sambhal man held for packing chicken in paper with God's images", "url": "https://indianexpress.com/article/india/sambhal-man-held-for-packing-chicken-in-newspaper-with-images-of-deities-8015982/", "urlToImage": "https://images.indianexpress.com/2022/07/Tabish-Hussain-at-his-fathers-restaurant.jpg", "publishedAt": "2022-07-07T22:14:26Z", "content": "There were only a handful of customers at Mehak Restaurant in Sambhal, Uttar Pradesh, on Thursday afternoon. But the alarm among the staff could be sensed easily they checked each newspaper piece car… [+4396 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Doctor arrested for minor’s rape at clinic in 2019", "description": "He allegedly raped her multiple times till December 2020 by threatening to make her photographs viral on social media. Police said she shared her ordeal with her family recently.", "url": "https://indianexpress.com/article/cities/pune/doctor-arrested-for-minors-rape-at-clinic-in-2019-8015993/", "urlToImage": "https://images.indianexpress.com/2022/07/arrest1-9.jpeg", "publishedAt": "2022-07-07T22:12:27Z", "content": "PUNE CITY police has arrested a doctor for allegedly raping a minor in 2019. The victim, who is now 19, lodged the FIR in this case at the Kothrud police station on Wednesday."}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "Khaki chic", "description": "Delhi Police’s outreach to youngsters via fashion accessories is a step forward. Now for some reform", "url": "https://indianexpress.com/article/opinion/editorials/delhi-polices-outreach-to-youngsters-via-fashion-accessories-is-a-step-forward-8015844/", "urlToImage": "https://images.indianexpress.com/2022/07/edit-5.jpg", "publishedAt": "2022-07-07T22:12:20Z", "content": "The long arm of the law will now come accessorised with a designer tote. Delhi Police has launched a line of apparel, handbags, backpacks, duffel bags, purses, wallets, belts, caps, cufflinks, keycha… [+1766 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "July 7, 1982, Forty Years Ago: Chaos In Bihar House", "description": "Twenty-one more members of the opposition were suspended by the Bihar Assembly for four days and later carried out of the House one by one. This was in pursuance of the order of the Speaker, Radhanandan Jha, to the marshal following a second day of the uproar…", "url": "https://indianexpress.com/article/opinion/editorials/forty-years-ago-chaos-in-bihar-house-8013547/", "urlToImage": "https://images.indianexpress.com/2022/07/07-Jul-1982_IE_001.jpg", "publishedAt": "2022-07-07T22:10:46Z", "content": "Twenty-one more members of the opposition were suspended by the Bihar Assembly for four days and later carried out of the House one by one. This was in pursuance of the order of the Speaker, Radhanan… [+1598 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Karnataka: After flagging ‘threat’, HC judge says ACB chief doing nothing to protect Bureau", "description": "", "url": "https://indianexpress.com/article/cities/bangalore/karnataka-hc-judge-says-acb-chief-doing-nothing-to-protect-bureau-8015980/", "urlToImage": "https://images.indianexpress.com/2022/07/karnataka-HC.jpg", "publishedAt": "2022-07-07T22:08:31Z", "content": "Three days after a Karnataka High Court judge said he was receiving indirect threat over his intervention in a corruption case, the judge on Thursday said in court that the head of state Ant-Corrupti… [+2044 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "BJP removes Haryana IT cell chief after his old tweet goes viral", "description": "Haryana BJP spokesperson Raman Malik told The Indian Express that he was not fully aware about the reasons behind the move.", "url": "https://indianexpress.com/article/cities/chandigarh/bjp-removes-haryana-it-cell-chief-after-his-old-tweet-goes-viral-8015973/", "urlToImage": "https://images.indianexpress.com/2022/07/bjp-1-1.jpg", "publishedAt": "2022-07-07T22:00:12Z", "content": "The BJP Thursday removed its Haryana IT cell incharge following a sustained campaign on the social media calling for his arrest over a tweet that he had made in 2017 but which went viral now amid the… [+1222 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pune: Rainfall increases water levels in 4 dams", "description": "Storage in the four dams has now increased to 4.93 TMC as the catchment area of these dams have continued to witness rainfall. The IMD has predicted heavy rainfall in the area till the weekend.", "url": "https://indianexpress.com/article/cities/pune/pune-rainfall-increases-water-levels-in-4-dams-8015990/", "urlToImage": "https://images.indianexpress.com/2022/07/PUNE-waterlogging-5col.jpg", "publishedAt": "2022-07-07T21:54:52Z", "content": "With continuous rainfall for the last few days, the water level in four dams supplying water to the city has increased to 4.93 TMC. Water storage in four dams Khadakwasla, Panshet, Varasgaon and Temg… [+787 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Alifiya Khan", "title": "Fergusson College starts own exam guidance centre", "description": "There will be two types of batches. An integrated, 15-month batch for graduate students will be of 800-hour duration, and a basic, 3-month foundation course for first year, second year, and third year students.", "url": "https://indianexpress.com/article/cities/pune/fergusson-college-starts-own-exam-guidance-centre-8015987/", "urlToImage": "https://images.indianexpress.com/2022/07/fergusson-college-main-1.jpg", "publishedAt": "2022-07-07T21:50:41Z", "content": "Fergusson College is starting its own competitive examination guidance centre to provide affordable coaching to aspirants of UPSC/MPSC examinations. From July 4, the centre has started accepting appl… [+1104 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Nupur Sharma row: NIA slams social media posts attributed to it, calls them fake", "description": "The statement came in reaction to social media posts that claimed that the NIA had provided a helpline number to report any Muslim or Muslim organisation making such calls on social media.", "url": "https://indianexpress.com/article/india/nupur-sharma-row-nia-slams-social-media-posts-attributed-to-it-calls-them-fake-8015978/", "urlToImage": "https://images.indianexpress.com/2022/07/nupur-sharma-1-3.jpg", "publishedAt": "2022-07-07T21:08:14Z", "content": "The National Investigation Agency (NIA) on Thursday said that it had not asked the public to inform it about calls for beheading people in connection with remarks against the Prophet made by suspende… [+1086 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Bengal: TMC seeks Ghosh arrest for remarks on CM", "description": "“Outrageous. PM @narendramodi, it is about time to get this loose tongue arrested! Is this how @BJP4India leaders talk about the only sitting woman Chief Minister of the nation (sic)?\" Abhishek Banerjee  tweeted Wednesday.", "url": "https://indianexpress.com/article/cities/kolkata/bengal-tmc-seeks-ghosh-arrest-for-remarks-on-cm-8015975/", "urlToImage": "https://images.indianexpress.com/2022/07/Dilip-ghosh-2.jpg", "publishedAt": "2022-07-07T21:02:02Z", "content": "Taking exception to alleged unsavoury comments by BJP national vice-president Dilip Ghosh against West Bengal Chief Minister Mamata Banerjee at a programme of a media group, Trinamool Congress (TMC) … [+149 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Soumyarendra Barik", "title": "Social Media Watch Feb 2021-2022 | IT Min ordered to take down 1,474 accounts, 175 tweets: Twitter in petition", "description": "Twitter has told the court that “increasingly” the Ministry has been issuing orders to block entire accounts without informing the company the specific tweets made by these accounts that call for their blocking, as per the petition, which The Indian Express h…", "url": "https://indianexpress.com/article/business/social-media-watch-feb-2021-2022-it-min-take-down-accounts-tweets-twitter-8015959/", "urlToImage": "https://images.indianexpress.com/2022/07/ashwini-vaishnaw.jpg", "publishedAt": "2022-07-07T20:44:39Z", "content": "BETWEEN FEBRUARY 2021 and 2022, the Ministry of Electronics and Information Technology (MeitY) is learnt to have issued 10 blocking orders to Twitter, directing the company to take down over 1,400 ac… [+3687 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi Confidential: On The Offensive", "description": "The Congress appears to be in no mood to let the issue of some BJP leaders sharing a misleading video of Rahul Gandhi die down easily.", "url": "https://indianexpress.com/article/delhi-confidential/delhi-confidential-congress-rahul-gandhi-adhir-ranjan-chowdhury-8015961/", "urlToImage": "https://images.indianexpress.com/2022/07/rahul-gandhi-ill.jpg", "publishedAt": "2022-07-07T20:44:30Z", "content": "THE CONGRESS appears to be in no mood to let the issue of some BJP leaders sharing a misleading video of Rahul Gandhi die down easily. The party’s leader on Lok Sabha Adhir Ranjan Chowdhury and sever… [+1864 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Jignesh Mevani made a working president of Gujarat Congress", "description": "Congress president Sonia Gandhi has appointed seven working presidents, including Dalit leader and Vadgam MLA Jignesh Mevani, in the party’s state unit.", "url": "https://indianexpress.com/article/cities/ahmedabad/jignesh-mevani-made-a-working-president-of-gujarat-congress-8015939/", "urlToImage": "https://images.indianexpress.com/2022/07/jignesh-mvani.jpg", "publishedAt": "2022-07-07T20:42:25Z", "content": "Ahead of the Assembly elections and after the exit of Patidar leader Hardik Patel, Congress president Sonia Gandhi has appointed seven working presidents, including Dalit leader and Vadgam MLA Jignes… [+552 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "George Mathew", "title": "RBI easing norms may arrest outflows from NRE accounts", "description": "Interest rates on NRE deposits are expected to rise in the wake of the RBI measures.", "url": "https://indianexpress.com/article/business/rbi-easing-norm-arrest-outflows-nre-accounts-8015957/", "urlToImage": "https://images.indianexpress.com/2022/06/RBI-3-1.jpg", "publishedAt": "2022-07-07T20:35:59Z", "content": "Non-resident Indian deposits which showed a decline in the financial year 2021-22 are expected to pick up in the coming months as the Reserve Bank decision to relax the norms governing the Foreign Cu… [+2670 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Punjab CM Bhagwant Mann ties the knot with Haryana doctor in private ceremony", "description": "The 48-year-old Mann and Gurpreet, who hails from Pehowa in Haryana’s Kurukshetra, completed the Anand Karaj rituals in presence of Delhi Chief Minister Arvind Kejriwal, and party Rajya Sabha members Raghav Chadha and Sanjay Singh.", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-cm-bhagwant-mann-ties-the-knot-with-haryana-doctor-in-private-ceremony-8015949/", "urlToImage": "https://images.indianexpress.com/2022/07/mann-gurpreet-1.jpeg", "publishedAt": "2022-07-07T20:34:59Z", "content": "The key elements of a big fat Punjabi wedding the band, bajaa, and baraat were missing as Bhagwant Mann tied the knot with Dr Gurpreet Kaur at his home here in a private ceremony, becoming the the fi… [+1002 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "Rupee posts gains for second straight day", "description": "The Sensex on Thursday rose 427.49 points, or 0.80 per cent, to end at 54,178.46, and the Nifty by 143.10 points, or 0.89 per cent, to 16,132.90.", "url": "https://indianexpress.com/article/business/rupee-posts-gains-for-second-straight-day-8015955/", "urlToImage": "https://images.indianexpress.com/2022/07/Money-1.jpg", "publishedAt": "2022-07-07T20:28:52Z", "content": "The rupee on Thursday posted gains for the second straight day, closing at 79.18 against the dollar from 79.30 a day earlier, in the wake of RBIs steps to shore up forex reserves and the currency.The… [+1078 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "Eye on pre-Covid levels, Q2 hiring intent up 7 ppt, says report", "description": "Bangalore leads among the cities with the highest intent to hire at 95 per cent followed by Chennai (87 per cent), Mumbai (83 per cent).", "url": "https://indianexpress.com/article/business/covid-levels-q2-hiring-intent-up-7-ppt-report-8015948/", "urlToImage": "https://images.indianexpress.com/2022/07/Hiring.jpg", "publishedAt": "2022-07-07T20:22:38Z", "content": "The intent to hire of companies increased by 7 percentage points in July-September from the previous quarter, helped by government stimulus measures, as per TeamLeases latest Employment Outlook Repor… [+1596 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Abhinaya Harigovind", "title": "After downpour last week, Delhi reels under warm and sultry weather, very little rain", "description": "One day of heavy rainfall last week meant that the city has already recorded an excess for the month so far. So far in July, the Safdarjung weather station, which provides a marker for the city, recorded 119.8 mm, an excess of 270% over a normal amount of 32.…", "url": "https://indianexpress.com/article/cities/delhi/delhi-reels-under-warm-and-sultry-weather-very-little-rain-8015951/", "urlToImage": "https://images.indianexpress.com/2022/07/delhi-rain-3col.jpg", "publishedAt": "2022-07-07T20:20:48Z", "content": "The southwest monsoon hit Delhi on June 30 and brought heavy rainfall for a day. But over the week since then, the weather in the capital has been warm and sultry, with no significant amount of rainf… [+3622 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Mahender Singh Manral", "title": "Burglary, attempt to murder cases up: Data", "description": "Data shows that the highest incidents of burglary, 1,563, were reported in Dwarka district this year as compared to 84 last year, 977 in Southeast district as compared to 209, 951 in Outer district as compared to 134, and 783 in South district as compared to …", "url": "https://indianexpress.com/article/cities/delhi/burglary-attempt-to-murder-cases-up-data-8015947/", "urlToImage": "https://images.indianexpress.com/2022/07/Asthana-ie.jpg", "publishedAt": "2022-07-07T20:15:58Z", "content": "Half-yearly crime data of the Delhi Police shows an uptick in cases in the national capital as compared to last year. While the first six months of this year saw 9,450 burglary/house theft cases, 2,3… [+3304 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Tata Power: 75K cr capex for RE in 5 yrs", "description": "Addressing the AGM on Thursday, Tata Power Chairman N. Chandrasekaran said it has planned Rs 14,000 crore consolidated capex in FY23 with Rs 10,000 crore in renewables.", "url": "https://indianexpress.com/article/business/tata-power-75k-cr-capex-re-5-yrs-8015944/", "urlToImage": "https://images.indianexpress.com/2021/10/N-Chandrasekaran-Tata.jpg", "publishedAt": "2022-07-07T20:11:55Z", "content": "Tata Power has announced a capital expenditure plan of over Rs 75,000 crore in the renewable energy sector in the next 5 years.Addressing the AGM on Thursday, Tata Power Chairman N. Chandrasekaran sa… [+793 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Schoolgirl stabbed: Kin approached cops earlier too, ‘they said nothing would happen’", "description": "The accused’s mother said the girl had recently filed a complaint against her son for allegedly misbehaving with her. She said she told her son to leave the girl alone: “But he did not listen... What has happened is very bad,” she said.", "url": "https://indianexpress.com/article/cities/delhi/schoolgirl-stabbed-kin-approached-cops-earlier-too-they-said-nothing-would-happen-8015943/", "urlToImage": "https://images.indianexpress.com/2022/07/cops.jpg", "publishedAt": "2022-07-07T20:11:49Z", "content": "Hours after a Class XII student was stabbed, allegedly by a stalker, the girls mother alleged police inaction and claimed that the accused had been troubling her daughter for a while.My daughter left… [+1863 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Max dangerous buildings in North Delhi: Survey", "description": "According to data, 112 dangerous buildings were found in City Sadar Paharganj zone as of July 1. “On visual inspection, 79 properties were detected and found in dangerous condition. Out of this, 7 properties were demolished, repaired by the department as well…", "url": "https://indianexpress.com/article/cities/delhi/max-dangerous-buildings-in-north-delhi-survey-8015942/", "urlToImage": "https://images.indianexpress.com/2022/07/Vinai-Kumar-Saxena-2-5.jpg", "publishedAt": "2022-07-07T20:11:38Z", "content": "The maximum number of dangerous buildings in the city are in North Delhi, with 265 out of a total 266 buildings located in Karol Bagh, Narela, Rohini and City Sadar Paharganj zones. A total of 24,73,… [+1152 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shubhajit Roy", "title": "Don’t jail journalists for what they say… India a democracy: Germany", "description": "The spokesperson at the German ministry said that they are in contact with European Union partners, and freedom of press is part of discussions between the EU and India.", "url": "https://indianexpress.com/article/india/dont-jail-journalists-india-democracy-germany-8015931/", "urlToImage": "https://images.indianexpress.com/2022/03/111-1.jpg", "publishedAt": "2022-07-07T20:06:46Z", "content": "DAYS AFTER the arrest of Mohammed Zubair, the co-founder of fact-checker website Alt News, on charges of promoting religious enmity in a tweet from 2018, the German Foreign ministry referred to the c… [+2736 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sukrita Baruah", "title": "Several ad hoc English teachers fear job loss under DU’s four-year UG programme", "description": "An English ad hoc teacher who has been at DU for more than 10 years said there have been fluctuations in the workload in the past when the university changed its course structure, and he had adjusted to it by finding a position in another college.", "url": "https://indianexpress.com/article/cities/delhi/several-ad-hoc-english-teachers-fear-job-loss-under-dus-four-year-ug-programme-8015933/", "urlToImage": "https://images.indianexpress.com/2022/07/DU-Delhi-university.jpg", "publishedAt": "2022-07-07T20:03:05Z", "content": "In Delhi University colleges without English honours programmes, ad hoc English teachers fear that there will be little scope for them to hold on to their positions with the impending changes under t… [+2911 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Avishek G Dastidar, Iram Siddique", "title": "Bullet train project chief sacked amid graft case", "description": "The charges of corruption, including an alleged “quid pro quo” deal with a private company, pertain to Satish Agnihotri’s earlier stint as Chairman and Managing Director of Rail Vikas Nigam Limited (RVNL)", "url": "https://indianexpress.com/article/india/bullet-train-project-chief-sacked-amid-graft-case-8015928/", "urlToImage": "https://images.indianexpress.com/2022/07/Satish-Agnihotri.jpg", "publishedAt": "2022-07-07T19:49:16Z", "content": "A YEAR after bringing him back from retirement to helm the bullet train project, the government on Thursday dismissed Satish Agnihotri from the post of Managing Director, National High Speed Rail Cor… [+2873 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Ritu Sarin", "title": "Times Group’s top management questioned by ED in FEMA inquiry", "description": "Top managers of the company have faced rounds of questioning by the Enforcement Directorate (ED) with the agency recently sending formal requests for corroborative information to offshore destinations, sources confirmed to The Indian Express.", "url": "https://indianexpress.com/article/india/times-groups-top-management-questioned-ed-fema-inquiry-8015917/", "urlToImage": "https://images.indianexpress.com/2022/07/ED-1.jpg", "publishedAt": "2022-07-07T19:42:14Z", "content": "BENNETT COLEMAN and Company Limited (BCCL), one of the countrys largest media conglomerates and publishers of the Times of India Group of publications, is under the scrutiny of a Central investigatin… [+2703 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "If Uddhav camp calls rebels, they also have to speak with BJP, says Kesarkar", "description": "\"We will go to meet him (Thackeray)... but now we are allied with the BJP and it's a family. Now, if we want to go back to this family (of Thackeray faction), we are not alone. When we are called, they will also have to speak with the BJP,” he added.", "url": "https://indianexpress.com/article/cities/mumbai/if-uddhav-camp-calls-rebels-they-also-have-to-speak-with-bjp-says-kesarkar-8015923/", "urlToImage": "https://images.indianexpress.com/2022/07/Kesarkar-2col.jpg", "publishedAt": "2022-07-07T19:42:06Z", "content": "Shiv Sena MLA Deepak Kesarkar, the spokesperson of the party faction led by Chief Minister Eknath Shinde, on Thursday expressed willingness to meet Uddhav Thackeray if the latter calls the rebel MLAs… [+2111 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Rafael Nadal says he “can’t be competitive over two matches”, adds he had to withdraw from Wimbledon out of respect for himself", "description": "The Spaniard' was forced to retire from the event after suffering an abdominal tear during his five-set win over Taylor Fritz in the quarterfinal.", "url": "https://indianexpress.com/article/sports/tennis/rafael-nadal-says-he-cant-be-competitive-over-two-matches-adds-he-had-to-withdraw-from-wimbledon-out-of-respect-for-himself-8015919/", "urlToImage": "https://images.indianexpress.com/2022/07/Nadal-withdrawal.jpg", "publishedAt": "2022-07-07T19:42:00Z", "content": "Rafael Nadal was forced to withdraw from his Wimbledon semifinal due to the abdominal injury he sustained in the quarterfinal. Australia’s Nick Kyrgios is through to the maiden Grand Slam final of hi… [+2248 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Vallabh Ozarkar", "title": "Thane ex-corporators back Shinde, district heads, shakha pramukhs likely to follow", "description": "Apart from Thane, around 30 former Sena corporators Navi Mumbai Municipal Corporation (NMMC) have also extended their support to Shinde. While NMMC's term had ended in 2020, TMC's term ended earlier this year. Elections to both are likely to be held after mon…", "url": "https://indianexpress.com/article/cities/mumbai/thane-ex-corporators-back-shinde-district-heads-shakha-pramukhs-likely-to-follow-8015921/", "urlToImage": "https://images.indianexpress.com/2022/07/Eknath-Shinde-1-3.jpg", "publishedAt": "2022-07-07T19:37:49Z", "content": "The split in the Uddhav Thackeray-led Shiv Sena seems to be far from over. In yet another setback to the group, 66 of the 67 former Sena corporators from the Thane Municipal Corporation (TMC), whose … [+3268 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "SMART, river linking projects to be fast-tracked: Fadnavis", "description": "The project, introduced in 2018-19 by then Devendra Fadnavis-led government, was put on the backburner by the Maha Vikas Aghadi.", "url": "https://indianexpress.com/article/cities/mumbai/smart-river-linking-projects-to-be-fast-tracked-fadnavis-8015918/", "urlToImage": "https://images.indianexpress.com/2022/07/devendra-fadnavis-1.jpg", "publishedAt": "2022-07-07T19:33:35Z", "content": "The state government on Thursday decided to fast-track the World Bank-assisted State of Maharashtras Agri-business and Rural Transformation (SMART) project to help farmers.The project, introduced in … [+1991 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Peter Vidal", "title": "Horoscope Today, July 8, 2022: Gemini, Aries, Pisces and other signs — check astrological prediction", "description": "Capricorn - Given that your celestial alignments have indeed been most confusing, the patience and tolerance you have shown in dealing with a financial matter deserve\r\ncongratulations.", "url": "https://indianexpress.com/article/horoscope/horoscope-today-july-8-2022-gemini-aries-pisces-and-other-signs-check-astrological-prediction-7998628/", "urlToImage": "https://images.indianexpress.com/2022/06/horoscope5.jpg", "publishedAt": "2022-07-07T19:30:48Z", "content": "You usually act on the spur of the moment, and quite right too! If you have unfinished business to complete, waste no time, otherwise you’ll find that the goal posts have moved. Next week may be too … [+3528 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Avinash Nair", "title": "45 per cent of commercial office spaces vacant in Ahmedabad", "description": "According to a recent report by global consultants Knight Frank India, the vacancy levels in Ahmedabad are the highest in the country among big cities.", "url": "https://indianexpress.com/article/cities/ahmedabad/45-per-cent-commercial-office-spaces-vacant-ahmedabad-8015911/", "urlToImage": "https://images.indianexpress.com/2022/07/office-spaces-1.jpg", "publishedAt": "2022-07-07T19:23:57Z", "content": "Despite the real-estate market turning bullish post-Covid, developers who have built commercial office spaces continue to battle vacancy levels as high as 45 per cent.According to a recent report by … [+2255 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "No ban on animal slaughter in Haridwar on Bakr Eid: Uttarakhand HC", "description": "Directs slaughtering be carried out at ‘legally compliant’ facility", "url": "https://indianexpress.com/article/india/no-ban-on-animal-slaughter-in-haridwar-on-bakr-eid-hc-8015914/", "urlToImage": "https://images.indianexpress.com/2022/07/Uttarakhand-High-Court.jpg", "publishedAt": "2022-07-07T19:21:30Z", "content": "The Uttarakhand High Court on Thursday stayed a government order that banned slaughter anywhere in Haridwar district, although only for July 10 when members of the Muslim community will be sacrificin… [+1948 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sanjana Bhalerao", "title": "Mumbai: Water stock in reservoirs goes up by 42% in four days", "description": "With incessant and heavy rain along the West coast, including Mumbai and Thane for the last four days, water supply worth 21 days was added to the seven lakes supplying water to the city.", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-water-stock-in-reservoirs-goes-up-in-four-days-8015908/", "urlToImage": "https://images.indianexpress.com/2022/07/Umbrellas1-4col.jpg", "publishedAt": "2022-07-07T19:17:27Z", "content": "AS HEAVY rain lashed Mumbai and Thane districts, a 42 per cent increase was recorded in water stock at the seven lakes that provide drinking water to the city. In four days, water stock in all seven … [+2309 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Mother Dairy cuts prices of soyabean, rice bran oils", "description": "In the case of Dhara Refined Ricebran Oil (Poly Pack), the price will come down to Rs 185 per litre from Rs 194 per litre.", "url": "https://indianexpress.com/article/india/mother-dairy-cuts-prices-of-soyabean-rice-bran-oils-8015697/", "urlToImage": "https://images.indianexpress.com/2022/04/cooking-oil.jpg", "publishedAt": "2022-07-07T19:15:07Z", "content": "Mother Dairy on Thursday said it has cut the prices of soyabean and rice bran oils by up to Rs 14 per litre, a day after the government directed edible oil firms to pass on the benefits of fall in gl… [+1197 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Row over VMC dept’s proposal to clear Rs 1.09 cr for PM event", "description": "The Opposition dashed off a letter to the Standing Committee chairman opposing the move and questioning the VMC’s role in organising the event, which was said to be that of a state government department.", "url": "https://indianexpress.com/article/cities/baroda/vmc-depts-proposal-clear-rs-1-09-cr-pm-event-8015906/", "urlToImage": "https://images.indianexpress.com/2022/05/Amit-Ravat.jpg", "publishedAt": "2022-07-07T19:11:31Z", "content": "A proposal from the mechanical department of the Vadodara Municipal Corporation (VMC) before the standing committee, seeking clearance of expenditure of Rs 1.09 crore towards the arrangement of trans… [+3323 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Omkar Gokhale", "title": "Must prevent accidents once potholes brought to notice: HC tells civic bodies", "description": "The court observed that such incidents were taking place every year, as soon as the first rains of the monsoon season lash the cities, and the civic bodies are not at all equipped to mitigate the situation.", "url": "https://indianexpress.com/article/cities/mumbai/must-prevent-accidents-once-potholes-brought-to-notice-hc-tells-civic-bodies-8015905/", "urlToImage": "https://images.indianexpress.com/2022/07/Potholes-4col.jpg", "publishedAt": "2022-07-07T19:06:20Z", "content": "The Bombay HC Thursday pulled up civic bodies, including the Thane Municipal Corporation, over non-repair and non-filling of potholes, saying that authorities must take measures to prevent road accid… [+3154 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pansare murder: HC seeks CID progress report, kin seek transfer of case to ATS", "description": "While Dabholkar was shot dead in Pune on August 20, 2013, Pansare was shot at on February 16, 2015, near his house in Kolhapur. He died four days later. The CBI is investigating the Dabholkar case while the state SIT is probing Pansare's murder.", "url": "https://indianexpress.com/article/cities/mumbai/pansare-murder-hc-seeks-cid-progress-report-kin-seek-transfer-of-case-to-ats-8015901/", "urlToImage": "https://images.indianexpress.com/2022/07/govind-pansare.jpg", "publishedAt": "2022-07-07T18:59:58Z", "content": "THE BOMBAY High Court on Thursday asked the Maharashtra Police’s Criminal Investigation Department (CID) to submit a report on the progress made by its special investigation team (SIT) since 2020 int… [+2507 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Namit Kumar", "title": "Sania Mirza has proved “even after childbirth, a woman can have a big sports career” – Father Imran shares her motivations", "description": "Sania Mirza lost in the semifinals at her last Wimbledon in the mixed doubles and hopes to make the year-end WTA Finals", "url": "https://indianexpress.com/article/sports/tennis/sania-mirza-has-proved-even-after-childbirth-woman-can-have-big-sports-career-father-imran-8015886/", "urlToImage": "https://images.indianexpress.com/2019/10/Sania-Mirza-1200-1.jpg", "publishedAt": "2022-07-07T18:56:39Z", "content": "A day after the end of Sania Mirzas fairytale run in her last Wimbledon where she fell a step short of getting to play for the Mixed Doubles career Grand Slam, her father Imran put her achievements i… [+4801 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Two held for threatening SP’s Abu Azmi over renaming of Aurangabad, Osmanabad", "description": "The police said that both of them are not connected to each other. \"They did not have any intention to kill Azmi, but both were upset that Azmi had objected to renaming Aurangabad and Osmanabad... They got his number from the Internet and threatened him,\" the…", "url": "https://indianexpress.com/article/cities/mumbai/two-held-for-threatening-sps-abu-azmi-over-renaming-of-aurangabad-osmanabad-8015898/", "urlToImage": "https://images.indianexpress.com/2022/07/arrest1-8.jpeg", "publishedAt": "2022-07-07T18:48:44Z", "content": "Two persons have been arrested by the Colaba police for allegedly making separate threat calls to Samajwadi Party leader Abu Asim Azmi.The police said the two men Bhausaheb Sonawane (40) and Tanaji Y… [+1463 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Varinder Bhatia", "title": "After 4 years, Dalai Lama to visit Leh on July 15", "description": "China has always objected to the Tibetan spiritual leader's visits to the region, including during his last visit in 2018.", "url": "https://indianexpress.com/article/india/after-4-years-dalai-lama-to-visit-leh-on-july-15-8015864/", "urlToImage": "https://images.indianexpress.com/2022/07/dalai-lama-fb.jpg", "publishedAt": "2022-07-07T18:45:41Z", "content": "The Dalai Lama will be in Leh on July 15 his first visit in around four years that comes amid a deterioration of ties between India and China over the standoff in eastern Ladakh.China has always obje… [+2617 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sadaf Modak", "title": "Elgaar Parishad case: Court rejects demand for nets, but asks jail to take precautions against mosquitoes", "description": "On Monday, another court had directed the Taloja prison SP to allow mosquito net to Antilia case accused Sunil Mane", "url": "https://indianexpress.com/article/cities/mumbai/elgaar-parishad-case-court-rejects-demand-for-nets-8015895/", "urlToImage": "https://images.indianexpress.com/2022/07/2021-04-171-4-3.jpg", "publishedAt": "2022-07-07T18:43:11Z", "content": "A SPECIAL court on Thursday rejected applications filed by two accused in the Elgaar Parishad case, 73-year-old journalist Gautam Navlakha and activist Sagar Gorkhe, for access to mosquito nets at Ta… [+2305 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sadaf Modak", "title": "Amravati chemist killing: Court sends seven accused to NIA custody till July 15", "description": "The Maharashtra Police, which was initially investigating the case, had said that Kolhe was killed allegedly for a social media post supporting former BJP spokesperson Nupur Sharma, who had made controversial comments against the Prophet in a TV debate.", "url": "https://indianexpress.com/article/cities/mumbai/amravati-chemist-killing-court-sends-seven-accused-to-nia-custody-till-july-15-8015892/", "urlToImage": "https://images.indianexpress.com/2022/07/umesh-kolhe-shok-sabha-bjp-1.jpeg", "publishedAt": "2022-07-07T18:38:29Z", "content": "The National Investigation Agency (NIA) on Thursday told a special court that the killing of 54-year-old chemist Umesh Kolhe in Amravati was not just a murder but prima facie an act to terrorise peop… [+2831 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Rafael Nadal pulls out of Wimbledon before semifinal due to injury", "description": "Rafael Nadal withdrew from Wimbledon a day before he was supposed to play in the semifinals", "url": "https://indianexpress.com/article/sports/tennis/rafael-nadal-withdraws-wimbledon-semi-final-injury-8015890/", "urlToImage": "https://images.indianexpress.com/2022/07/nadal-12.jpg", "publishedAt": "2022-07-07T18:37:04Z", "content": "Rafael Nadal on Thursday withdrew from the Wimbledon semifinal match because of injury. As a result, Nick Kyrgios advances to Sunday’s final.“I have to pull out of the tournament. As everybody saw ye… [+496 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "Ajker Rashifal Bengali, 8 July 2022: এই রাশির জাতকদের সামনে প্রচুর উন্নতি! পড়ুন রাশিফল", "description": "আজকের রাশিফল ৮ই জুলাই- জানুন কী আছে ভাগ্যে?", "url": "https://bengali.indianexpress.com/horoscope/ajker-rashifal-july-8-2022-aries-taurus-gemini-cancer-leo-virgo-libra-scorpio-sagittarius-capricorn-aquarius-pisces-466503/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/friday-1.jpg", "publishedAt": "2022-07-07T18:35:00Z", "content": "/ Aries  Rashifal ( March 21 – April 20 )\r\n/ Taurus  Rashifal ( April 21 – May 21 )\r\n/ Gemini  Rashifal ( May 22 – June 21 )\r\n/ Cancer Rashifal  ( June 22 – July 23 )\r\n/ Leo   Rashifal  ( July 24 – A… [+353 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Esha Roy", "title": "Centre releases child protection scheme guidelines, asks states to not tamper with name", "description": "States will also have to comply with any “guidelines/instructions issued by the Government of India regarding branding of this Scheme,’’ the WD Ministry stated in its guidelines.", "url": "https://indianexpress.com/article/india/centre-releases-child-protection-scheme-guidelines-8015883/", "urlToImage": "https://images.indianexpress.com/2022/07/child-care-home-2.jpg", "publishedAt": "2022-07-07T18:32:59Z", "content": "In order to access Central funds and benefits under Mission Vatsalya, an umbrella scheme for child protection services in the country, states will have to retain the official name, as given by the Ce… [+4845 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "India’s first joint replacement museum inaugurated in Ahmedabad", "description": "The release, quoting Dr JA Pachore, curator of the museum, said, “This museum will be of great value to young joint replacement surgeons, scholars and researchers for education and research activities...\"", "url": "https://indianexpress.com/article/cities/ahmedabad/indias-first-joint-replacement-museum-inaugurated-ahmedabad-8015884/", "urlToImage": "https://images.indianexpress.com/2022/07/doc-rep.jpg", "publishedAt": "2022-07-07T18:18:21Z", "content": "Indias first joint replacement museum set up by Ahmedabad-based Indian Society Of Hip and Knee Surgeons (ISHKS) was inaugurated in the city recently.Exhibiting the rarest repository of joint implants… [+746 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Abhishek Purohit", "title": "Eight months, 30 matches, 40 players: Team India’s Big Churn since the 2021 T20 World Cup", "description": "Behind these unusually high numbers for a short period are a variety of reasons, from finding the perfect combination to tired legs, and fresh talents barging through the doors to comeback men", "url": "https://indianexpress.com/article/sports/cricket/team-indias-big-churn-since-the-2021-t20-world-cup-8015871/", "urlToImage": "https://images.indianexpress.com/2022/07/rohit-sharma-1.jpg", "publishedAt": "2022-07-07T18:14:31Z", "content": "Since captain Rohit Sharma and coach Rahul Dravid took charge after the 2021 T20 World Cup last November, India have given opportunities to numerous players, as well as different captains, across for… [+6745 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "3 heart valves repaired in 61-yr-old woman via minimally invasive procedure", "description": "The three-hour-long surgery was conducted six weeks ago on the woman weighing 32 kilograms to replace three heart valves--mitral, aortic and tricuspid--with mechanical valves.", "url": "https://indianexpress.com/article/cities/ahmedabad/3-heart-valves-repaired-in-61-yr-old-woman-via-minimally-invasive-procedure-8015881/", "urlToImage": "https://images.indianexpress.com/2022/07/heart.jpg", "publishedAt": "2022-07-07T18:05:23Z", "content": "A triple valve replacement surgery using a minimally invasive technique that required a three to four-inch incision was conducted on a 61-year-old woman from Mehsana at HCG Hospital. The procedure wa… [+1715 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Middle-class bag most benefits: Lack of land titles, funds leave slum dwellers ‘homeless’ under PMAY in Gujarat", "description": "The study titled 'PMAY and Housing for All in Small and Medium size Towns of Gujarat' has found that while a lot of work has been done in Gujarat under PMAY, most of the benefits have gone to non-slum areas.", "url": "https://indianexpress.com/article/cities/rajkot/middle-class-bag-most-benefits-lack-of-land-titles-funds-leave-slum-dwellers-homeless-under-pmay-in-gujarat-8015876/", "urlToImage": "https://images.indianexpress.com/2022/07/slum-dwellers.jpg", "publishedAt": "2022-07-07T18:02:38Z", "content": "Around 94,000 or 48 per cent of the 1.97 lakh families living in slum pockets in the towns of Gujarat want to construct houses on their own with state assistance under the Centres Pradhan Mantri Awas… [+5961 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gujarat reports 717 new Covid cases, highest in five months", "description": "While Ahmedabad city reported 309 new cases — 43 per cent of the state’s daily caseload of Thursday — smaller districts such as Mehsana, Valsad, Patan and Morbi are now seeing a rise.", "url": "https://indianexpress.com/article/cities/ahmedabad/gujarat-reports-717-new-covid-cases-highest-in-five-months-8015872/", "urlToImage": "https://images.indianexpress.com/2022/07/Covid-4-2.jpg", "publishedAt": "2022-07-07T17:56:56Z", "content": "Gujarat on Thursday reported 717 new Covid-19 cases, the highest number of daily cases recorded since mid-February.While Ahmedabad city reported 309 new cases 43 per cent of the states daily caseload… [+1691 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "WNBA’s Griner pleads guilty at her drug trial in Russia", "description": "Griner, 31, was detained at Moscow's Sheremetyevo Airport while returning to play basketball in Russia, and police said they found vape canisters containing cannabis oil in her luggage.", "url": "https://indianexpress.com/article/sports/sport-others/wnbas-griner-pleads-guilty-at-her-drug-trial-in-russia-8015866/", "urlToImage": "https://images.indianexpress.com/2022/07/griner.jpg", "publishedAt": "2022-07-07T17:52:38Z", "content": "American basketball star Brittney Griner pleaded guilty Thursday to drug possession charges on the second day of her trial in a Russian court in a case that could see her sentenced to up to 10 years … [+7082 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Fun’s public status sub judice: HC stays CIC order on releasing PM CARES details on I-T exemption", "description": "Hearing a petition by the department against the CIC order, Justice Yashwant Varma took note of a submission that the question whether PM CARES Fund is a public authority is currently pending before a division bench of the court.", "url": "https://indianexpress.com/article/cities/delhi/funs-public-sub-judice-hc-cic-order-pm-cares-it-exemption-8015862/", "urlToImage": "https://images.indianexpress.com/2022/06/Delhi-HC-6-1-1.jpeg", "publishedAt": "2022-07-07T17:46:54Z", "content": "The Delhi High Court on Thursday stayed a Central Information Commission (CIC) order directing the Income Tax Department to provide copies of all documents submitted by PM CARES Fund while applying f… [+2778 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Fun’s public status sub judice: HC stays CIC order on releasing PM CARES details on I-T exemption", "description": "Hearing a petition by the department against the CIC order, Justice Yashwant Varma took note of a submission that the question whether PM CARES Fund is a public authority is currently pending before a division bench of the court.", "url": "https://indianexpress.com/article/cities/delhi/funs-public-status-sub-judice-hc-stays-cic-order-on-releasing-pm-cares-details-on-i-t-exemption/", "urlToImage": "https://images.indianexpress.com/2022/06/Delhi-HC-6-1-1.jpeg", "publishedAt": "2022-07-07T17:46:54Z", "content": "The Delhi High Court on Thursday stayed a Central Information Commission (CIC) order directing the Income Tax Department to provide copies of all documents submitted by PM CARES Fund while applying f… [+2778 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Revamped Central Vista Avenue likely to be completed by mid-July", "description": "A section of the stretch was readied ahead of the Republic Day Parade this year while the construction of the underpasses and the remaining public facilities were to be completed later.", "url": "https://indianexpress.com/article/india/revamped-central-vista-avenue-likely-completed-mid-july-8015859/", "urlToImage": "https://images.indianexpress.com/2021/12/Central-Vista.jpg", "publishedAt": "2022-07-07T17:42:12Z", "content": "The redevelopment of Central Vista Avenue, the stretch between Vijay Chowk and India Gate, will be completed by mid-July, Union Housing and Urban Affairs Minister Hardeep Singh Puri said Thursday on … [+1516 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "10 held for killing animals, sample from seized 3,000 kg meat sent for test", "description": "The police seized 3,000 kg meat worth Rs 6 lakh and have sent it to the Forensic Science Laboratory to find out the animal it belongs to.", "url": "https://indianexpress.com/article/cities/mumbai/10-held-killing-animals-sample-seized-3000-kg-8015857/", "urlToImage": "https://images.indianexpress.com/2022/07/arrest-14.jpg", "publishedAt": "2022-07-07T17:34:34Z", "content": "The Deonar police on Thursday arrested 10 persons, including the driver of a truck, for allegedly killing animals illegally and transporting their carcasses to the city from Malegaon. The police seiz… [+314 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Inside Saif, Sara, Ibrahim and Jeh’s fam-jam in London, see adorable photos", "description": "Sara Ali Khan on Thursday shared photos with her father Saif Ali Khan, and brothers Ibrahim Ali Khan and Jeh Ali Khan.", "url": "https://indianexpress.com/article/entertainment/bollywood/inside-saif-sara-ibrahim-and-jehs-fam-jam-in-london-8015567/", "urlToImage": "https://images.indianexpress.com/2022/07/sara-saif-ibrahim-jeh-1200.jpg", "publishedAt": "2022-07-07T17:24:02Z", "content": "Sara Ali Khan on Thursday took to Instagram to give a glimpse of her London vacation. The actor shared photos with her father Saif Ali Khan, and brothers Ibrahim Ali Khan and Jeh Ali Khan.Sharing the… [+910 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Yogesh Naik", "title": "Patole meets Sonia, seeks action against MLAs for skipping floor test, cross-voting in LC polls", "description": "Summoned to Delhi on Thursday evening, Congress state president Nana Patole met the party’s national president Sonia Gandhi with complaints against some leaders, including former chief minister Ashok Chavan.", "url": "https://indianexpress.com/article/cities/mumbai/patole-sonia-action-mlas-skipping-floor-test-cross-voting-lc-polls-8015832/", "urlToImage": "https://images.indianexpress.com/2022/05/NANA-1.jpg", "publishedAt": "2022-07-07T17:22:12Z", "content": "The Congress high command has taken a stern view of 11 party MLAs, who were conspicuous by their absence during the trust vote of the Eknath Shinde-led government on Monday and the way MPCC working p… [+3660 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Bombay HC asks state govt to establish a family court in every district", "description": "A division bench of Justice Anil K Menon and Justice Makarand S Karnik was hearing a PIL by a businessman, Tushar Gupta, who said at least one family court is required for every city with a population of over a million, according to the Family Courts Act.", "url": "https://indianexpress.com/article/cities/mumbai/bombay-hc-asks-state-govt-to-establish-a-family-court-in-every-district-8015843/", "urlToImage": "https://images.indianexpress.com/2022/06/Bombay-hC-3-1.jpeg", "publishedAt": "2022-07-07T17:14:50Z", "content": "The Bombay High Court Thursday asked the state government to take the initiative to constitute family courts in every district.A division bench of Justice Anil K Menon and Justice Makarand S Karnik w… [+1172 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Clinical Rybakina powers into Wimbledon final", "description": "Halep, the champion in 2019, did not help her cause, with a string of double faults to hand Rybakina chances at key moments.", "url": "https://indianexpress.com/article/sports/tennis/clinical-rybakina-powers-into-wimbledon-final-8015834/", "urlToImage": "https://images.indianexpress.com/2022/07/rybakina.jpg", "publishedAt": "2022-07-07T17:11:37Z", "content": "Elena Rybakina powered into the Wimbledon final by dismantling former champion Simona Halep 6-3 6-3 on Thursday with a clinical display to reach her maiden Grand Slam showpiece.Halep was caught in th… [+434 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "রাজ্যসভায় মনোনীত সদস্যের ‘সেই দিন গিয়েছে’, এখন সবাই ‘রাজনৈতিক সিলমোহর’, কেন?", "description": "রাজ্যসভা গঠন করা হয়েছিল ১৯৫২ সালে। ১৪২ জনকে সদস্যকে মনোনীত করা হয়েছে তারপর।", "url": "https://bengali.indianexpress.com/general-news/why-does-rajya-sabha-have-nominated-mps-466534/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/rajyasabha.jpg", "publishedAt": "2022-07-07T17:08:50Z", "content": ", , , , , - ’ – , , , \r\n ?\r\n , , , , , , \r\n ?\r\n , , , , - , – - \r\n ‘’ ?\r\n , , , , , , , , , , , , , , , , \r\n , , , , , \r\n - , \r\n - , , , , , ! ’ , , !\r\nRead story in English"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Gita Gopinath becomes first woman and 2nd Indian to feature on IMF’s ‘wall of former chief economists’", "description": "Gopinath had served as the first female chief economist of the Washington-based global lender for three years.", "url": "https://indianexpress.com/article/india/gita-gopinath-first-woman-indian-imfs-wall-former-chief-economists-8015687/", "urlToImage": "https://images.indianexpress.com/2022/05/DAVOS-IMF-GITA-GOPINATH-1200.jpg", "publishedAt": "2022-07-07T17:08:13Z", "content": "India-born Gita Gopinath became the first woman and second Indian to feature on the ‘wall of former chief economists’ of the International Monetary Fund (IMF).The first Indian to achieve the honour w… [+947 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Barcelona makes offer to Bayern Munich for Lewandowski", "description": "Lewandowski would be a huge boost to Barcelona's attack.", "url": "https://indianexpress.com/article/sports/football/barcelona-makes-offer-to-bayern-munich-for-lewandowski-8015807/", "urlToImage": "https://images.indianexpress.com/2021/09/Barca-Bayern.jpg", "publishedAt": "2022-07-07T17:05:34Z", "content": "Barcelona has made an offer to Bayern Munich for star striker Robert Lewandowski, the Spanish clubs president said Thursday.We have made an offer for the player and we are waiting for a response, sai… [+1457 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Brittney Griner pleads guilty in Russia drugs trial: Media", "description": "The reports quoted Griner as pleading guilty to the charges at Thursday's court hearing. They said that speaking through an interpreter, Griner said she had acted unintentionally because she was packing in haste.", "url": "https://indianexpress.com/article/world/griner-pleads-guilty-in-russia-drugs-trial-media-8015815/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-18-1.jpg", "publishedAt": "2022-07-07T17:01:36Z", "content": "Russian news agencies say jailed American basketball star Brittney Griner has pleaded guilty to drug possession and smuggling charges during her trial in Moscow.The reports quoted Griner as pleading … [+5172 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shamik Chakrabarty", "title": "FIR could be filed against sacked Under-17 women’s football coach Alex Ambrose: CoA member Bhaskar Ganguly", "description": "Alex Ambrose, Asstt Head Coach of Under 17 women’s team, was sacked for sexual misconduct.", "url": "https://indianexpress.com/article/sports/football/fir-could-be-filed-against-sacked-under-17-womens-football-coach-alex-ambrose-8015809/", "urlToImage": "https://images.indianexpress.com/2022/01/football-stock-photo.jpg", "publishedAt": "2022-07-07T17:00:53Z", "content": "The All India football federation (AIFF) is not ruling out lodging an FIR, or taking legal route, against the sacked India U-17 womens team assistant coach Alex Ambrose and a decision in this regard … [+2189 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Famous for happiness, and limits on tourism, Bhutan will triple fees to visit", "description": "Visitors no longer need to be on a package tour, but they will now have to pay a $200 daily fee directly to the government of Bhutan, and pay separately for their accommodation, meals, tours and other travel expenses.", "url": "https://indianexpress.com/article/lifestyle/destination-of-the-week/famous-for-happiness-and-limits-on-tourism-bhutan-will-triple-fees-to-visit-8011851/", "urlToImage": "https://images.indianexpress.com/2022/07/GettyImages-Bhutan-travel-1200.jpg", "publishedAt": "2022-07-07T17:00:49Z", "content": "The tiny Buddhist kingdom of Bhutan on the eastern edge of the Himalayas, often referred to as the last Shangri-La for its abundance of natural beauty, sustainable development and rich cultural herit… [+10557 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Meaning of development is empowerment of poor, deprived: PM Modi at Varanasi rally", "description": "The prime minister said that the work should be done in such a way that not only corrects the present, but also benefits Varanasi's future for many decades.", "url": "https://indianexpress.com/article/india/meaning-of-development-empowerment-of-poor-deprived-pm-modi-varanasi-rally-8015803/", "urlToImage": "https://images.indianexpress.com/2022/07/modi_varanasi.jpg", "publishedAt": "2022-07-07T17:00:05Z", "content": "Prime Minister Narendra Modi on Thursday said that the meaning of development is not “chamak-damak”, or glitter, but the empowerment of the poor, deprived and tribal communities.“The development does… [+3471 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Divya A", "title": "Govt to reach out to 20 cr homes through ‘Har Ghar Tiranga’ drive", "description": "According to officials in the Ministry of Culture, the plan is to reach out to more than 20 crore homes across the country on August 15, and the campaign will be officially launched by mid-July.", "url": "https://indianexpress.com/article/india/govt-reach-20-cr-homes-har-ghar-tiranga-drive-8015790/", "urlToImage": "https://images.indianexpress.com/2021/08/red-fort-759.jpg", "publishedAt": "2022-07-07T16:59:21Z", "content": "The government will soon launch Har Ghar Tiranga a nationwide campaign to encourage people to hoist the national flag at their homes to mark the 75th Independence Day.According to officials in the Mi… [+1850 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "This mother’s rendition of ‘Mere Naina Sawan Bhadon’ while cooking has won hearts online", "description": "The clip has garnered more than 14 million views on Facebook and appreciation poured in.", "url": "https://indianexpress.com/article/trending/trending-in-india/mothers-rendition-of-mere-naina-sawan-bhadon-while-cooking-8015777/", "urlToImage": "https://images.indianexpress.com/2022/07/HN24-NEWSFacebook.jpg", "publishedAt": "2022-07-07T16:45:01Z", "content": "Upon persuasion by her child, a mother sang the 1970s song “Mere Naina Sawan Bhadon” while cooking at her home. The woman’s soulful rendition of the romantic song has gone viral and netizens cannot s… [+1257 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Maulshree Seth", "title": "In another first, ‘Congress-mukt’ UP Upper House to not have LoP as SP loses post", "description": "The SP had 11 MLCs earlier, but following the recent election to 13 seats, its tally dipped to 9 leading to the issue of a notification by the Legislative Council Secretariat stating that Yadav has lost his LoP designation.", "url": "https://indianexpress.com/article/political-pulse/congress-mukt-up-upper-house-lop-sp-loses-post-8015780/", "urlToImage": "https://images.indianexpress.com/2022/07/yogi-1-1.jpg", "publishedAt": "2022-07-07T16:38:55Z", "content": "On Thursday, when the term of the 13 newly-elected members of the Uttar Pradesh Legislative Council began, the Samajwadi Party (SP)’s Lal Bihari Yadav lost his post as the Leader of the Opposition as… [+3261 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Arushi Jain", "title": "Koffee with Karan Season 7: Ranveer Singh and Alia Bhatt give Karan Johar show an opening it deserves", "description": "In the first episode of Koffee With Karan 7, Karan Johar fed the curiosity of Alia Bhatt fans and asked the actor everything they wanted to know about her too secretive love life.", "url": "https://indianexpress.com/article/entertainment/web-series/koffee-with-karan-7-ranveer-singh-alia-bhatt-give-karan-johar-show-opening-it-deserves-8015694/", "urlToImage": "https://images.indianexpress.com/2022/07/koffee-with-karan-7.jpg", "publishedAt": "2022-07-07T16:37:56Z", "content": "Celebrity chat show Koffee with Karan returned with a new season on Thursday, after a hiatus of three years. In the first episode, Karan Johar hosted two of Hindi cinema’s “most versatile actors of t… [+2860 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "10 held for killing animals, 3,000 kg meat sent for forensic test", "description": "The police seized 3,000 kg meat worth Rs 6 lakh and have sent it to the Forensic Science Laboratory to find out the animal it belongs to.", "url": "https://indianexpress.com/article/cities/mumbai/10-held-for-killing-animals-3000-kg-meat-sent-for-forensic-test-8015771/", "urlToImage": "https://images.indianexpress.com/2022/07/meat.jpg", "publishedAt": "2022-07-07T16:34:30Z", "content": "The Deonar police on Thursday arrested 10 persons, including the driver of a truck, for allegedly killing animals illegally and transporting their carcasses to the city from Malegaon. The police seiz… [+314 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Nitin Sharma", "title": "Coming from Mizoram, Saitluangpuia hopes to take giant strides in badminton", "description": "On Thursday, the 16-year-old youngster scored a 15-10, 15-7 win over Dhiren Yadav of Haryana in the boys’ singles u-19 second qualification round on the opening day of the 29th Yonex Sunrise Smt Krishna Khaitan Memorial All India Junior Ranking Selection Tour…", "url": "https://indianexpress.com/article/sports/badminton/coming-from-mizoram-saitluangpuia-hopes-to-take-giant-strides-in-badminton-8015760/", "urlToImage": "https://images.indianexpress.com/2022/07/Badminton-5.jpg", "publishedAt": "2022-07-07T16:31:19Z", "content": "Last year in June, when Saitluangpuia Sailo contracted Covid-19 at his Aizawl home, the Mizoram shuttler had to spend more than a week in a local dispensary followed by an isolation ward. The youngst… [+3378 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lalmani Verma", "title": "‘Era of forcing youths long gone’: PM Modi at Akhil Bhartiya Shiksha Samagam", "description": "Modi’s remarks come in the wake of protests against the Centre’s Agnipath recruitment scheme for the country’s armed forces.", "url": "https://indianexpress.com/article/education/narendra-modi-youths-akhil-bhartiya-shiksha-samagam-8015763/", "urlToImage": "https://images.indianexpress.com/2022/07/modi-7-1.jpg", "publishedAt": "2022-07-07T16:30:54Z", "content": "Prime Minister Narendra Modi Thursday said the era of forcing anything on the youth without understanding them and their aspirations has long gone.He was speaking at the inauguration of the Akhil Bha… [+3320 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "New Year’s Eve murder: Bombay High Court denies bail to accused", "description": "On New Year’s Eve, Kukreja attended a party along with Jogdhankar, his co-accused Diya Padalkar, 19, and a few others on the terrace of a building in Khar.", "url": "https://indianexpress.com/article/cities/mumbai/new-years-eve-murder-bombay-high-court-denies-bail-accused-8015757/", "urlToImage": "https://images.indianexpress.com/2022/07/bombay-high-court-1200-3-4.jpg", "publishedAt": "2022-07-07T16:30:00Z", "content": "The Bombay High Court Thursday rejected the bail plea of Shree Ambadas Jogdhankar, 23, booked for the murder of his friend Jhanvi Kukreja, 19, at a New Years Eve party in Khar. Kukreja was found dead… [+1051 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Maharashtra reports 8 Covid deaths while cases continue to drop", "description": "The state recorded a total of 2,678 new Covid-19 cases on Thursday -- a slight drop from the previous day's 3,142 cases.", "url": "https://indianexpress.com/article/cities/mumbai/maharashtra-reports-8-covid-deaths-while-cases-drop-8015761/", "urlToImage": "https://images.indianexpress.com/2022/07/mumbai_covid_NMMC.jpeg", "publishedAt": "2022-07-07T16:27:42Z", "content": "Maharashtra reported eight Covid-related deaths on Thursday, the most in 24 hours amid the current surge in cases.Two of these deaths — a nine-month-old suffering from Ischemic Heart Disease and Down… [+923 chars]"}]}