{"status": "ok", "totalResults": 671, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Deutsche Welle", "title": "Why some young Swedes remain uneasy about joining NATO", "description": "While the majority of Swedes are in favor of joining NATO, there are others who even took to the streets in protest. They warn the decision is rushed and that Sweden should better stick with its tradition of neutrality.", "url": "https://indianexpress.com/article/world/why-some-young-swedes-remain-uneasy-about-joining-nato-7925592/", "urlToImage": "https://images.indianexpress.com/2022/05/sweden-nato.jpg", "publishedAt": "2022-05-19T08:51:21Z", "content": "“The best thing for the security of Sweden and the Swedish people is to join NATO,” said Sweden’s Prime Minister Magdalena Andersson, as she formally confirmed Stockholm’s intention to join the world… [+6737 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Deutsche Welle", "title": "Droughts, fires and floods: Could climate change decide Australia’s election?", "description": "The country, dubbed a \"wrecker\" at climate change negotiations, is a major exporter of fossil fuels, largely to East Asia and India.", "url": "https://indianexpress.com/article/world/droughts-fires-and-floods-could-climate-change-decide-australias-election-7925601/", "urlToImage": "https://images.indianexpress.com/2022/05/australia-fire.jpg", "publishedAt": "2022-05-19T08:44:16Z", "content": "Australia, a major coal exporter and one of the worst per capita emitters, goes to the polls Saturday. The result could be decisive for global climate goals, as voters demand lawmakers do more to cut… [+7467 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Change in format will help Kane Williamson regain form, says NZ coach Stead", "description": "Sunrisers Hyderabad captain Williamson has returned home from the IPL to attend the birth of his second child after managing 216 runs from 13 matches with a strike rate of 93.5.", "url": "https://indianexpress.com/article/sports/cricket/change-in-format-will-help-kane-williamson-regain-form-says-nz-coach-stead-7925613/", "urlToImage": "https://images.indianexpress.com/2020/09/gary-Stead-1200.jpg", "publishedAt": "2022-05-19T08:34:14Z", "content": "Batsman Kane Williamson had a poor season in the Indian Premier League (IPL) but New Zealand coach Gary Stead said a change in format from Twenty20s to tests will help the 31-year-old rediscover form… [+1474 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Mallica Joshi", "title": "‘Mild-mannered, level-headed’: Anil Baijal may have been the L-G AAP could live with", "description": "An AAP-government official who did not want to be named said: “Who the Centre appoints in these positions is very important. While they had their run-ins, Anil Baijal was largely a non-confrontational and professional officer and worked well with the Delhi go…", "url": "https://indianexpress.com/article/india/political-pulse/anil-baijal-resigns-delhi-l-g-aap-government-7925582/", "urlToImage": "https://images.indianexpress.com/2022/05/ch1348090.jpg", "publishedAt": "2022-05-19T08:32:29Z", "content": "As the search begins for the next person who can govern Delhi, the Arvind Kejriwal government might find itself missing Lieutenant Governor Anil Baijal.For all his run-ins with the AAP regime, Baijal… [+4481 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "ABVP meets Health Minister to request postponement of NEET PG 2022 exam", "description": "In the meeting, the ABVP delegation highlighted six points which are of concern to the NEET PG 2022 aspirants.", "url": "https://indianexpress.com/article/education/abvp-meets-health-minister-to-request-postponement-of-neet-pg-2022-exam-7925575/", "urlToImage": "https://images.indianexpress.com/2022/05/NEET-PG-2022-ABVP-1.jpg", "publishedAt": "2022-05-19T08:28:23Z", "content": "The delegation of Akhil Bharatiya Vidyarthi Parishad (ABVP) met the Health Minister of India, Mansukh Mandaviya, to once again request him to postpone the exam date for NEET PG 2022. The exam is sche… [+1658 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Poets gathering, village sports centres: Telangana to celebrate state formation day on June 2 in grand manner", "description": "At Public Gardens in the state capital, CM Rao will deliver his address highlighting the state's progress and achievements since it was carved out of erstwhile unified Andhra Pradesh in 2014 and the Telangana Rashtra Samithi (TRS) party formed government.", "url": "https://indianexpress.com/article/cities/hyderabad/telangana-state-formation-day-celebrations-7925603/", "urlToImage": "https://images.indianexpress.com/2022/03/kcr-telangana.jpg", "publishedAt": "2022-05-19T08:25:23Z", "content": "The Telangana state formation day on June 2 will be celebrated in a grand manner at Public Gardens in Hyderabad after a two-year gap owing to Covid-19, said officials. The state government has also p… [+1309 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Entertainment Desk", "title": "জ্ঞানবাপী মসজিদে শিবলিঙ্গ নিয়ে হিন্দু-মুসলিম তরজা তুঙ্গে! ফের ‘বিস্ফোরক’ কঙ্গনা", "description": "কী বললেন 'বলিউড ক্যুইন'?", "url": "https://bengali.indianexpress.com/entertainment/kangana-ranaut-on-gyanvapi-mosque-row/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/05/kangana.jpg", "publishedAt": "2022-05-19T08:24:27Z", "content": ", , - \r\n - ! ‘’- , ‘ ’ , “ , ”\r\n[ : , , ]\r\n, ‘’ - -, , \r\n, , , - , , , , \r\n , \r\nStay updated with the latest news headlines and all the latest Entertainment news download Indian Express Bengali App.\r… [+48 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "BTS Jimin says whenever he feels ‘colourless’, his band members and ARMY reminds him of his essence: ‘You are my proof…’", "description": "In the video, Jimin said that he wanted to live up to ARMY's expectations and show different sides of himself. He also explained why he chose the songs Filter and Friends for the album, Proof.", "url": "https://indianexpress.com/article/entertainment/music/bts-jimin-friends-filter-song-album-proof-band-7925027/", "urlToImage": "https://images.indianexpress.com/2022/03/RM1200.jpg", "publishedAt": "2022-05-19T08:22:32Z", "content": "BTS’s agency Big Hit has been sharing short videos as part of the run-up to the release of the album, Proof. After Jin and V explained why they chose songs for the album, Jimin has revealed why he se… [+2174 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Gajraj Rao to play a 70-year-old man with erectile dysfunction in Imtiaz Ali’s Thai Massage", "description": "Co-produced by Imtiaz Ali, Thai Massage will also star Divyendu Sharma, Sunny Hinduja, Rajpal Yadav, Vibha Chibber and Russian actor Alina Zasobina. It will hit cinema halls on August 26.", "url": "https://indianexpress.com/article/entertainment/bollywood/gajraj-rao-imtiaz-ali-70-year-old-erectile-dysfunction-thai-massage-7925488/", "urlToImage": "https://images.indianexpress.com/2022/05/gajraj-rao-thai-massage.jpg", "publishedAt": "2022-05-19T08:20:02Z", "content": "Filmmaker Imtiaz Ali is all set to bring a slice-of-life family entertainer starring Gajraj Rao in the lead role. Titled Thai Massage, the film will tell the story of the coming of age of a seventy-y… [+1373 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Debraj Deb", "title": "Day after Tripura introduces motor fuel rationing, govt says provisional stock available", "description": "Union Minister of State for Social Empowerment and Justice Pratima Bhoumik told the media she spoke with Union Minister of State for Petroleum Rameshwar Teli and the central minister assured sufficient fuel would be sent to Tripura via tankers.", "url": "https://indianexpress.com/article/north-east-india/tripura/tripura-motor-fuel-rationing-provisional-stock-7925581/", "urlToImage": "https://images.indianexpress.com/2022/05/petrol-diesel-price-reuters-1200.jpeg", "publishedAt": "2022-05-19T08:19:18Z", "content": "A day after Tripura introduced vehicle fuel rationing in the state in view of disruption of a railway line near Badarpur as well as the traffic movement on National Highway 44, the government said We… [+2905 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "কৃষ্ণ জন্মভূমি মামলা: শাহী ইদগাহ মসজিদের জমির মালিকানা আবেদনের অনুমতি মঞ্জুর", "description": "বিরোধটি মূলত ১৩.৩৭ একর জমির মালিকানা নিয়ে। আবেদনকারীদের দাবি- ওই জমিতে দেবতা শ্রী কৃষ্ণ বিরাজমান।", "url": "https://bengali.indianexpress.com/general-news/krishna-janmabhoomi-case-mathura-court-shahi-idgah-mosque-land-445170/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/05/Shahi-Idgah.jpg", "publishedAt": "2022-05-19T08:17:27Z", "content": ", \r\n . - \r\n , - ‘ ’ \r\n, , 1958 \r\n , - \r\n , , , \r\n , \r\nRead in English\r\nStay updated with the latest news headlines and all the latest General news download Indian Express Bengali App.\r\nWeb Title: Kri… [+58 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Chintan Chandrachud", "title": "On marital rape, regressive notions undermine autonomy of women", "description": "Being raped by someone in whom you have reposed trust is likely to have an indelible emotional impact. Marriage does not change that", "url": "https://indianexpress.com/article/opinion/columns/on-marital-rape-regressive-notions-undermine-autonomy-of-women-7925569/", "urlToImage": "https://images.indianexpress.com/2022/05/WhatsApp-Image-2022-05-19-at-1.40.13-PM.jpeg", "publishedAt": "2022-05-19T08:12:20Z", "content": "On 11 May, two judges of the Delhi High Court handed down separate judgments in RIT Foundation v Union of India. The issue before the Court was straightforward. Section 375 of the IPC defines rape as… [+5251 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Joe Biden invokes Defense Production Act for formula shortage", "description": "Supplies of baby formula across the country have been severely curtailed in recent weeks after a February recall by Abbott Nutrition.", "url": "https://indianexpress.com/article/world/us-baby-formula-shortage-biden-defense-production-act-7925539/", "urlToImage": "https://images.indianexpress.com/2022/05/biden-1200.jpg", "publishedAt": "2022-05-19T08:10:52Z", "content": "US President Joe Biden invoked the Defense Production Act to speed production of infant formula and authorised flights to import supply from overseas, as he faces mounting political pressure over a d… [+6177 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Alifiya Khan", "title": "Pune: SPPU V-C’s tenure ends, Prof Karbhari Vishwanath Kale to take additional charge", "description": "Dr Kale has been the president of the ICT section of the Indian Science Congress Association, Kolkata in 2015-2016 under the Ministry of Science and Technology.", "url": "https://indianexpress.com/article/cities/pune/pune-sppu-v-cs-tenure-ends-prof-karbhari-vishwanath-kale-to-take-additional-charge-7925566/", "urlToImage": "https://images.indianexpress.com/2022/03/SPPU-2.jpeg", "publishedAt": "2022-05-19T08:09:49Z", "content": "With the tenure of the current vice-chancellor (V-C) of Savitribai Phule Pune University (SPPU) coming to an end on May 19 and a new V-C yet to be appointed, the additional charge will now be held by… [+1616 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Ethos IPO: Everything you need to know", "description": "Ethos IPO: The Rs 472.29 crore initial public offering (IPO) of luxury watch retailer Ethos is available from May 18-20, 2022. It has a price band of Rs 836-878 per share.", "url": "https://indianexpress.com/article/business/market/ethos-ipo-everything-you-need-to-know-7925257/", "urlToImage": "https://images.indianexpress.com/2022/05/luxury-watch-showroom-pixabay-1200.jpg", "publishedAt": "2022-05-19T08:07:49Z", "content": "Ethos IPO: The initial public offering (IPO) of luxury watch retailer Ethos opened for subscription on Wednesday, May 18, 2022. The offer was subscribed 27 per cent by the end of the first day of bid… [+3256 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Apex Legends Mobile now most downloaded iPhone game in 60 countries: Report", "description": "Apex Legends Mobile launched for Android and iOS devices earlier this week on May 17.", "url": "https://indianexpress.com/article/technology/gaming/apex-legends-mobile-now-most-downloaded-iphone-game-in-60-countries-report-7925548/", "urlToImage": "https://images.indianexpress.com/2022/05/Apex-Legends-Mobile1-1.jpg", "publishedAt": "2022-05-19T08:05:19Z", "content": "Respawn Entertainment and Electronic Arts launched Apex legends Mobile for Android and iOS smartphones after months of testing earlier this week on May 17. SInce the launch, the battle royale shootin… [+1642 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Navjeevan Gopal", "title": "Punjab top leader Sunil Jakhar set to join BJP, three days after quitting Congress", "description": "Sunil Jakhar will be a formidable Hindu face, with no baggage, for the BJP in a state where it is trying to find its feet without former ally Akali Dal. While he belongs to a prominent Jat family, Jakhar enjoys the support of other communities in the state as…", "url": "https://indianexpress.com/article/india/political-pulse/sunil-jakhar-bjp-party-7925553/", "urlToImage": "https://images.indianexpress.com/2022/05/sunil.jpg", "publishedAt": "2022-05-19T08:02:22Z", "content": "Former Punjab Congress president Sunil Jakhar, who quit the party on May 14 with a good luck and good bye, is set to join the BJP shortly in Delhi on Thursday.BJP president J P Nadda will welcome Jak… [+1852 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "PM Modi addresses Swaminarayan sect Yuva Shivir, says India is hope for the future", "description": "\"Climate change is a perilous situation in the world but India is leading the way for the future with sustainable solutions. We are showing the entire world the way with Yoga and introducing them to Ayurveda,\" PM Narendra Modi said.", "url": "https://indianexpress.com/article/cities/baroda/pm-modi-swaminarayan-yuva-shivir-address-7925538/", "urlToImage": "https://images.indianexpress.com/2022/05/PTI05_18_2022_000263B.jpg", "publishedAt": "2022-05-19T08:02:07Z", "content": "Prime Minister Narendra Modi said Thursday that India is carving a new identity of leadership in the world with the “change in the style of governance and is leading the way in finding solutions to t… [+4610 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "‘Don’t try it at the mandap’: Bengali TV show’s accidental wedding leaves netizens shocked", "description": "The bride is about to garland the groom in the show when a man pushes him and ends up getting garlanded instead. The now-viral moment is from a Star Jalsa serial, Aay Tobe Sohochori.", "url": "https://indianexpress.com/article/trending/trending-in-india/bengali-tv-shows-accidental-wedding-leaves-netizens-shocked-7925079/", "urlToImage": "https://images.indianexpress.com/2022/05/bengali-serial-forced-marriage.jpg", "publishedAt": "2022-05-19T07:58:12Z", "content": "Accidental wedding is one of the most frequent tropes used across Indian soap operas, despite the trenchant criticism it receives. Makers continue to come up with creative ways to execute the familia… [+3124 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Day after Hardik leaves, Gujarat Cong top leaders meet Naresh Patel, share breakfast", "description": "In his resignation letter to Congress president Sonia Gandhi, Hardik wrote about the party’s leadership “lack of seriousness of purpose”.", "url": "https://indianexpress.com/article/india/political-pulse/hardik-patel-gujarat-congress-naresh-patel-7925524/", "urlToImage": "https://images.indianexpress.com/2022/05/Naresh-Patel.jpg", "publishedAt": "2022-05-19T07:56:12Z", "content": "Top leaders of the Gujarat Congress met Patidar leader Naresh Patel at the latters farmhouse on the outskirts of Rajkot city on Thursday morning. The Congress leaders, including AICC in-charge Raghu … [+2160 chars]"}]}