{"status": "ok", "totalResults": 852, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Chennai News Live Updates: Amid power cuts in TN, CM MK Stalin urges PM Modi to supply 72,000 MT coal supply daily", "description": "Chennai, Tamil Nadu News Live Updates Today 23 April 2022: Urging PM Modi to direct the Ministry of Coal, Stalin’s letter said the state was seeking his urgent assistance to ensure adequate availability of coal for the power-generation units in Tamil Nadu.", "url": "https://indianexpress.com/article/cities/chennai/chennai-news-live-updates-covid-cases-deaths-stalin-dmk-aiadmk-traffic-weather-7883154/", "urlToImage": "https://images.indianexpress.com/2022/04/stalin-4-2.jpeg", "publishedAt": "2022-04-23T04:01:13Z", "content": "The Thanjavur All-Women Police Force has arrested a 12-year-old boy under the Protection of Children from Sexual Offences (POCSO) Act for allegedly raping and impregnating a 17-year-old girl. Speakin… [+1099 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "EU agrees on internet rulebook for Google, Facebook, other tech giants", "description": "Under the DSA, the companies face fines up to 6% of their global turnover for violating the rules while repeated breaches could see them banned from doing business in the EU.", "url": "https://indianexpress.com/article/world/eu-agrees-on-internet-rulebook-for-google-facebook-other-tech-giants-7883158/", "urlToImage": "https://images.indianexpress.com/2022/03/European-Union.jpg", "publishedAt": "2022-04-23T03:57:42Z", "content": "European Union countries and EU lawmakers on Saturday clinched a deal on new rules requiring tech giants to do more to police illegal content on their platforms and to pay a fee to regulators monitor… [+1605 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Kris Jenner says Blac Chyna tried to murder her son Rob Kardashian in 2016", "description": "Kris Jenner compared her reference to Will Smith slapping Chris Rock during the recent Oscars.", "url": "https://indianexpress.com/article/entertainment/hollywood/kris-jenner-blac-chyna-tried-to-murder-rob-kardashian-in-2016-7883117/", "urlToImage": "https://images.indianexpress.com/2022/04/Krish-Jenner-Blac-Chyna.jpg", "publishedAt": "2022-04-23T03:53:27Z", "content": "Kris Jenner became emotional while recalling a volatile 2016 argument she heard about between her son Rob Kardashian and his then-girlfriend Blac Chyna that traumatized him.Jenner testified for the s… [+4148 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Russia-Ukraine War News Live Updates: Zelenskyy warns Russia is eyeing other countries after Ukraine", "description": "Russia Ukraine War News Today, Russia Ukraine Strike News Updates, World War 3", "url": "https://indianexpress.com/article/world/russia-ukraine-war-news-live-updates-zelenskyy-putin-biden-moldova-nato-7883084/", "urlToImage": "https://images.indianexpress.com/2022/04/moschun-1.jpg", "publishedAt": "2022-04-23T03:50:23Z", "content": "Ukrainian President Volodymyr Zelenskyy warned that Russia's invasion of his country was just the beginning and that Moscow has designs on capturing other countries, after a Russian general said it w… [+1714 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Zelenskiy warns Russia is eyeing other countries after Ukraine", "description": "Ukrainian military commands in the south and east said they had repelled 11 Russian attacks, killing up to 130 soldiers while destroying 12 tanks and 27 other armoured vehicles, details Reuters could not independently confirm.", "url": "https://indianexpress.com/article/world/zelenskiy-warns-russia-is-eyeing-other-countries-after-ukraine-7883133/", "urlToImage": "https://images.indianexpress.com/2022/04/ZELENSKYY-1-2.jpg", "publishedAt": "2022-04-23T03:48:06Z", "content": "Ukrainian President Volodymyr Zelenskiy warned that Russia’s invasion of his countrywas just the beginning and that Moscow has designs on capturing other countries, after a Russian general said it wa… [+5259 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Want to lose weight? Make sure you are following this hack", "description": "Nutritionist Lovneet Batra suggests an important aspect that needs to be a part of your weight loss regimen", "url": "https://indianexpress.com/article/lifestyle/fitness/weight-loss-sleep-quality-tips-7855771/", "urlToImage": "https://images.indianexpress.com/2022/03/pexels-andrea-piacquadio-3771069.jpg", "publishedAt": "2022-04-23T03:40:00Z", "content": "While we may be doing everything right in our weight loss journey, right from diet to exercise, an important component of this pyramid is sleep. Adequate sleep also aids in weight loss, stressed nutr… [+1498 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shiny Varghese", "title": "Explained: Why Venice Biennale 2022 stands out with its many firsts", "description": "The Venice Biennale, which opens on April 23, has many firsts in its palette. Here’s an aerial view of the exhibition that runs all the way till November.", "url": "https://indianexpress.com/article/explained/venice-biennale-2022-art-exhibition-installations-pavilions-explained-7883114/", "urlToImage": "https://images.indianexpress.com/2022/04/biennale-main.jpg", "publishedAt": "2022-04-23T03:39:03Z", "content": "The Venice Biennale, which opens on April 23, has many firsts in its palette its first Italian woman curator in its 127-year history; the largest number of women artists (nearly 80 per cent) particip… [+8567 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Serivce", "title": "Mohali DC orders wearing of masks at public places", "description": "The DC ordered that the wearing masks at public places like bus stands, airport, cinema halls, malls, crowded places like the markets, will be mandatory.", "url": "https://indianexpress.com/article/cities/sas-nagar-mohali/mohali-dc-orders-wearing-of-masks-at-public-places-7883135/", "urlToImage": "https://images.indianexpress.com/2022/04/CHD-MASK.jpeg", "publishedAt": "2022-04-23T03:37:50Z", "content": "The Deputy Commissioner (DC), Amit Talwar, on Friday issued orders to take strict action against people not wearing masks at the public places.\r\nThe DC ordered that the wearing masks at public places… [+180 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sandeep Dwivedi", "title": "Weekly Sports Newsletter: Dhoni’s last-ball four, Miandad’s six and the stillness of their minds", "description": "If someone takes pains to do a detailed scrutiny of why the Miandads and Dhonis of the world will always have an edge over the Sharmas and Unadkats, the 'hours spent at nets' wouldn't be a decisive factor.", "url": "https://indianexpress.com/article/sports/ipl/sandeep-dwivedi-weekly-sports-newsletter-dhonis-last-ball-four-miandads-six-and-the-stillness-of-their-minds-7883112/", "urlToImage": "https://images.indianexpress.com/2022/04/Untitled-design-4-9.jpg", "publishedAt": "2022-04-23T03:36:02Z", "content": "Early in the week, the internet, that ever-eager celebrator of all events, was raising a toast to Javed Miandad’s 1986 last-ball six, and also recalling Chetan Sharma’s waist-high full toss. Days lat… [+6685 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "ছাত্র-মৃত্যুতে ফুঁসছে বিশ্বভারতী, উপাচার্যের বাড়ির সামনে বিক্ষোভ, সরব অনুপম", "description": "গত বৃহস্পতিবার বিশ্বভারতীর পাঠভবনের দ্বাদশ শ্রেণীর ছাত্র অসীম দাসের অস্বাভাবিক মৃত্যু হয়েছে। অসীমের ঝুলন্ত দেহ উদ্ধার হয়েছে ছাত্রাবাসের একটি ঘর থেকে।", "url": "https://bengali.indianexpress.com/west-bengal/students-shows-protest-regarding-unnatural-death-of-a-student-chaos-at-biswabharati-vice-chancellor-biddyut-chakrabartys-house-435114/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/04/Vc-house.jpg", "publishedAt": "2022-04-23T03:34:27Z", "content": "- , , \r\n, \r\n , \r\n, , \r\n- , \r\n, \r\n, \r\nStay updated with the latest news headlines and all the latest Westbengal news download Indian Express Bengali App.\r\nWeb Title: Students shows protest regarding u… [+91 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Serivce", "title": "US Congressional delegation pays obeisance at Golden Temple", "description": "The SGPC said it honoured the US leaders with 'Siropa' (robe of honour), model of Sri Harmandar Sahib and books related to the Sikh faith.", "url": "https://indianexpress.com/article/cities/amritsar/us-congressional-delegation-pays-obeisance-at-golden-temple-7883128/", "urlToImage": "https://images.indianexpress.com/2022/04/US-1.jpg", "publishedAt": "2022-04-23T03:32:36Z", "content": "A 19-member US Congressional delegation Friday paid obeisance at the Golden Temple where it praised the Sikh community’s tradition of providing ‘langar’ without discrimination.The delegation comprise… [+1286 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anju Agnihotri Chaba", "title": "Ludhiana dumpyard fire: NGT takes cognisance, issues notice to Punjab chief secretary", "description": "The NGT, in the notice issued to Punjab's Chief Secretary, has asked for reasons that led to the failure of the state apparatus in preventing the fire and why accountability of the state not be fixed under section 15 of the NGT Act.", "url": "https://indianexpress.com/article/cities/jalandhar/ludhiana-dumpyard-fire-ngt-takes-cognisance-issues-notice-to-punjab-chief-secy-7883123/", "urlToImage": "https://images.indianexpress.com/2022/04/national-green-tribunal-1200.jpeg", "publishedAt": "2022-04-23T03:29:39Z", "content": "The National Green Tribunal (NGT) on Friday took strong exception to a recent media report about a fire near a garbage dump in Ludhiana in which seven people were killed and slapped a notice on the P… [+2331 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Doctor Strange in the Multiverse of Madness banned in Saudi Arabia: reports", "description": "Doctor Strange in the Multiverse of Madness takes place after the events of Spider-Man: No Way Home and the Disney+ series WandaVision.", "url": "https://indianexpress.com/article/entertainment/hollywood/doctor-strange-in-the-multiverse-of-madness-banned-in-saudi-arabia-reports-7883116/", "urlToImage": "https://images.indianexpress.com/2022/03/doctor-strange-in-the-multiverse-of-madness-1200-1.jpg", "publishedAt": "2022-04-23T03:24:26Z", "content": "Marvel’s much-awaited Doctor Strange in the Multiverse of Madness has been banned in Saudi Arabia as per The Hollywood Reporter. According to the publication’s sources, the Benedict Cumberbatch starr… [+1138 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Hina Rohtaki", "title": "Chandigarh allows delinking of violations from transfer of properties", "description": "With this move, 65,000 families would now benefit, and at present, around 2,000 applications are pending. It was stated that the transferee would now have to submit an affidavit in this regard.", "url": "https://indianexpress.com/article/cities/chandigarh/chandigarh-allows-delinking-of-violations-from-transfer-of-properties-7883119/", "urlToImage": "https://images.indianexpress.com/2022/04/housing-759.jpeg", "publishedAt": "2022-04-23T03:22:40Z", "content": "In a relief to owners of the Chandigarh Housing Board’s (CHB) built-up units with building violations, the Chandigarh Administration on Friday allowed delinking of violation cases from the transfer o… [+3516 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Realme GT 2 launched in India with Snapdragon 888: Check price, specifications", "description": "Here's all you need to know about the Realme GT 2, including price and specifications.", "url": "https://indianexpress.com/article/technology/mobile-tabs/realme-gt-2-launched-in-india-with-snapdragon-888-check-price-specifications-7882866/", "urlToImage": "https://images.indianexpress.com/2022/04/Realme-GT-21.jpg", "publishedAt": "2022-04-23T03:15:52Z", "content": "Realme launched the Realme GT 2 in India earlier this week. The phone is the more affordable version of the Realme GT 2 Pro smartphone. The Vanilla GT 2 features specifications including the Snapdrag… [+1781 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Bengaluru Live Updates: It may be a stray incident, says CM on two students skipping exam for not allowing hijab-wearing", "description": "Bengaluru, Karnataka Live News, Karnataka News Updates, Bengaluru Coronavirus Cases Today, Bangalore News Latest Updates, Bengaluru, Karnataka Today Updates, Royal Challengers Bangalore Match News: Karnataka Police arrested an All India Majlis-e-Ittehadul Mus…", "url": "https://indianexpress.com/article/cities/bangalore/bengaluru-live-updates-basavaraj-bommai-karnataka-bjp-covid-numbers-7883106/", "urlToImage": "https://images.indianexpress.com/2022/04/Basavaraj-Bommai-2-1-1.jpeg", "publishedAt": "2022-04-23T03:14:34Z", "content": "In an effort to replenish the groundwater, DCB Bank on Thursday inaugurated a sustainability project of 25 rainwater-recharge wells at Jalahalli, a suburb of Bengaluru, in conjunction with India Care… [+819 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Pre-departure Covid-19 tests not required for vaccinated travellers to Singapore", "description": "With the latest easing of restrictions on people's movement in COVID-19 environment, fully vaccinated and well travellers will no longer need to be tested for COVID-19 to enter Singapore.", "url": "https://indianexpress.com/article/world/singapore-covid-guidelines-tests-home-isolation-vaccination-7883108/", "urlToImage": "https://images.indianexpress.com/2022/04/singapore-1200.jpg", "publishedAt": "2022-04-23T03:12:37Z", "content": "All vaccinated travellers arriving in Singapore via air or sea checkpoints will no longer need to take a pre-departure COVID-19 test as restrictions for controlling the spread of the coronavirus are … [+5298 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Coronavirus News Live Updates: Over 3.08 lakh precautionary doses of Covid vaccine administered so far; Delhi records 1,042 fresh cases, 2 deaths", "description": "Coronavirus Cases in India Live Updates: Delhi Friday reported 1,042 fresh Covid cases with a positivity rate of 4.64 per cent while two persons died due to the infection, according to data shared by the city health department on Friday.", "url": "https://indianexpress.com/article/india/coronavirus-news-updates-live-covid-19-count-deaths-delhi-mumbai-bangalore-cases-7883092/", "urlToImage": "https://images.indianexpress.com/2022/04/Delhi-Covid-4.jpg", "publishedAt": "2022-04-23T03:00:40Z", "content": "A common anti-inflammatory drug has been found to be an effective antiviral agent in the treatment of mild and moderate Covid-19 patients. The drug, indomethacin, is widely used to treat various type… [+1535 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "When John Cena said BTS helped him in moment of ‘weakness,’ named his favourite band members: ‘Gotta thank BTS…’", "description": "On John Cena's birthday, we revisit the times the wrestling superstar and Hollywood actor professed his love for popular K-Pop band BTS.", "url": "https://indianexpress.com/article/entertainment/music/when-john-cena-said-bts-helped-him-in-moment-of-weakness-named-his-favourite-band-members-7878235/", "urlToImage": "https://images.indianexpress.com/2022/04/cena1200.jpg", "publishedAt": "2022-04-23T03:00:04Z", "content": "Wrestling superstar and Hollywood actor John Cena is a big fan of the wildly popular K-Pop band BTS. Over the years, Cena has shown his support and love for them multiple times by sharing their photo… [+2351 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Shut wing if student tests Covid positive: Delhi education department issues SOPs for schools", "description": "In line with an advisory issued last week, the SOP also states that if any case is reported among students and staff, this must be reported to zonal or district authorities immediately.", "url": "https://indianexpress.com/article/cities/delhi/delhi-covid-19-sop-schools-7883102/", "urlToImage": "https://images.indianexpress.com/2022/04/Delhi-covid-1.jpg", "publishedAt": "2022-04-23T02:55:55Z", "content": "The Directorate of Education (DOE) has asked schools in the national capital to shut a wing rather than closing down the entire institute if a student tests positive for Covid-19 as the Delhi Disaste… [+1990 chars]"}]}