{"status": "ok", "totalResults": 713, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Naveed Iqbal", "title": "Newsmaker | From democracy icon to terror accused, how PDP’s Waheed Para fell out with Centre", "description": "Para, now 34, has spent the better part of the last few years in various forms of incarceration. On May 25, after 17 months in custody, the J&K High Court granted bail to the PDP leader in a terror-related case.", "url": "https://indianexpress.com/article/india/political-pulse/how-pdp-waheed-para-fell-out-with-centre-7939822/", "urlToImage": "https://images.indianexpress.com/2022/05/Para.jpg", "publishedAt": "2022-05-27T12:48:50Z", "content": "In June 2018, speaking from the dais at one of the biggest sport conclaves to be hosted in Srinagar, then Union Home Minister Rajnath Singh made special mention of Waheed-ur-Rehman Para, praising the… [+3992 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "AAP teams visit Mumbai’s landslide-prone areas, say BMC has no plans to save lives", "description": "In a statement issued Friday, the AAP said, \"As per the RTI replies secured by RTI activist Anil Galgali, there are 327 landslide-prone areas while the BMC claims there are 291. Galgali says 22,483 families are at risk in the monsoons.”", "url": "https://indianexpress.com/article/cities/mumbai/aap-visit-mumbai-landslide-prone-areas-bmc-no-plans-to-save-lives-7939931/", "urlToImage": "https://images.indianexpress.com/2022/05/FTv5imoakAAczrv.jpg", "publishedAt": "2022-05-27T12:47:49Z", "content": "Ahead of the monsoon, landslide-prone areas dotting Mumbai have once against endangered the lives of thousands of families. The Aam Aadmi Party (AAP) activists personally visited some of these vulner… [+3909 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "Gateway of India to Empire State building, monuments go upside down as Stranger Things 4 fever takes over", "description": "Ahead of the Vol. 1 of Stranger Things season 4 premiere, Netflix turned \"the world upside down\" as it projected graphics related to the hit series in 14 countries.", "url": "https://indianexpress.com/article/trending/trending-globally/gateway-of-india-to-empire-state-building-monuments-go-upside-down-as-stranger-things-4-fever-takes-over/", "urlToImage": "https://images.indianexpress.com/2022/05/stranger-things-4-mumbai.jpg", "publishedAt": "2022-05-27T12:46:45Z", "content": "As fans of the original Netflix series Stranger Things eagerly await for the new season, the streaming company jazzed up things at an epic level by projecting graphics on some of the world’s most ico… [+2091 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sandip G", "title": "Benzema – a talisman for Real Madrid but a divisive figure in France", "description": "At this moment, Benzema inhabits the game’s pinnacle. He has just propelled Real Madrid to another La Liga crown; he has single-handedly steered them to the Champions League final.", "url": "https://indianexpress.com/article/sports/football/benzema-a-talisman-for-real-madrid-but-a-divisive-figure-in-france-7939932/", "urlToImage": "https://images.indianexpress.com/2022/05/Benzema-2-2.jpg", "publishedAt": "2022-05-27T12:42:20Z", "content": "Three Espanyol defenders converged, like a band of policemen shadowing a slippery pickpocket, onto Karim Benzema, his shaved crown glistening under the lights, his imposing frame in Real Madrids turq… [+10638 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manas Srivastava", "title": "UPSC Essentials: Case study of the week- IAS officers with the dog and ‘VIP’ culture in bureaucracy", "description": "VIP culture and bureaucratic privileges do not go hand in hand with the public interest and the code of ethics of civil services. The recent incident involving the IAS officers at Thyagraj stadium is a case study for reference for the ethics paper of the UPSC…", "url": "https://indianexpress.com/article/upsc-current-affairs/upsc-essentials/upsc-essentials-case-study-of-week-ias-officers-with-dog-vip-culture-in-bureaucracy-7939852/", "urlToImage": "https://images.indianexpress.com/2022/05/Untitled-design-7-3.jpg", "publishedAt": "2022-05-27T12:36:41Z", "content": "Case studies are an important section of the GS IV- Ethics paper. One such case reported at Delhi’s Thyagraj stadium can be curated to suit the syllabus of UPSC-CSE.The case:The recent incident at De… [+3547 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Gargi Verma", "title": "Explained: What are community forest rights, why do they matter?", "description": "The community forest resource area is the common forest land that has been traditionally protected and conserved for sustainable use by a particular community.", "url": "https://indianexpress.com/article/explained/explained-what-are-community-forest-rights-why-do-they-matter-7939921/", "urlToImage": "https://images.indianexpress.com/2022/05/Kanger-Ghati-National-Park.jpg", "publishedAt": "2022-05-27T12:35:59Z", "content": "The Chhattisgarh government has become only the second state in the country to recognise Community Forest Resource (CFR) rights of a village inside a national park. The CFR rights of tribals living i… [+3544 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "BBMP to propose government to hand over Indira Canteens to ISKCON", "description": "BBMP will not call tenders since it believes that the proposal is for a noble cause, said officials.", "url": "https://indianexpress.com/article/cities/bangalore/bbmp-propose-karnataka-government-indira-canteens-iskcon-7939930/", "urlToImage": "https://images.indianexpress.com/2022/05/BBMP.jpg", "publishedAt": "2022-05-27T12:35:57Z", "content": "The Bruhat Bengaluru Mahanagara Palike (BBMP) will propose to the state government to handover the Indira Canteens to the ISKCON. Confirming the development, BBMP special commissioner (finance) Tulas… [+2656 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Dr Saroja Balan", "title": "Doctor in the House: Nothing sweet about it — the hidden danger posed by sugar to infants", "description": "Sugar-heavy diets in babies and toddlers can lead to health issues later in life like diabetes and hypertension.", "url": "https://indianexpress.com/article/parenting/doctor-in-the-house-nothing-sweet-about-it-the-hidden-danger-posed-by-sugar-to-infants-7939871/", "urlToImage": "https://images.indianexpress.com/2022/05/GettyImages-children-health-sugary-foods-1200.jpg", "publishedAt": "2022-05-27T12:35:17Z", "content": "In our modern world, processed foods and hidden sugars have regretfully become a staple in most households. One of World Health Organizations (WHO) growing concerns is the increasing amount of sugar … [+5183 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "SC stays Allahabad HC’s bail condition of SP MLA Azam Khan related to land of Jauhar University", "description": "A vacation bench of Justices DY Chandrachud and Bela M Trivedi said that prima facie the Allahabad High Court's bail condition imposed on Azam Khan is disproportionate and sounds like a decree of a civil court.", "url": "https://indianexpress.com/article/india/sc-stays-allahabad-hc-bail-condition-sp-mla-azam-khan-jauhar-university-7939849/", "urlToImage": "https://images.indianexpress.com/2022/05/Azam-Khan-2.jpg", "publishedAt": "2022-05-27T12:35:11Z", "content": "The Supreme Court Friday stayed the Allahabad High Court’s bail condition imposed on Samajwadi Party MLA Azam Khan directing the District Magistrate of Rampur for taking possession of land attached t… [+5205 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "‘Where will the dog go’: After IAS officers are transferred for walking pet in stadium, netizens share memes", "description": "Hours after IAS officers Sanjeev Khirwar and Rinku Dugga were transferred to Ladakh and Arunachal Pradesh, netizens share memes asking 'where will the dog go'.", "url": "https://indianexpress.com/article/trending/trending-in-india/thyagraj-stadium-after-ias-officers-are-transferred-for-walking-pet-where-will-dog-go-memes-7939307/", "urlToImage": "https://images.indianexpress.com/2022/05/thyagraj.jpg", "publishedAt": "2022-05-27T12:34:34Z", "content": "Hours after The Indian Express reported that athletes at Delhi’s Thyagraj Stadium were were being asked to leave early every day so that Delhi Principal Secretary (Revenue) Sanjeev Khirwar can walk h… [+2713 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Jayam Ravi wraps filming of Agilan", "description": "Bankrolled by Screen Scene Media Entertainment, Agilan features Jayam Ravi, Priya Bhavani Shankar and Tanvi Ravichandran.", "url": "https://indianexpress.com/article/entertainment/tamil/jayam-ravi-wraps-filming-of-agilan-7939581/", "urlToImage": "https://images.indianexpress.com/2022/05/Agilan-movie-1200by667.jpg", "publishedAt": "2022-05-27T12:27:52Z", "content": "Tamil film star Jayam Ravi on Friday said he has completed the shoot of his next film Agilan. The upcoming drama is written and directed by N Kalyanakrishnan, who is collaborating with Ravi for the s… [+997 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Two LeT militants killed in J&K encounter", "description": "Ten militants have been killed in Kashmir in the last three days, of which seven were affiliated to the LeT and three to Jaish-e-Mohammad.", "url": "https://indianexpress.com/article/cities/srinagar/let-militants-killed-jk-encounter-7939906/", "urlToImage": "https://images.indianexpress.com/2022/05/army-2.jpeg", "publishedAt": "2022-05-27T12:24:10Z", "content": "Two militants affiliated to Lashkar-e-Taiba were killed in an overnight encounter in the Buchpura area (Soura) of Srinagar on Friday. Ten militants have been killed in Kashmir in the last three days,… [+1238 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Akshay Kumar film is now Samrat Prithviraj as Yash Raj Films bow before Karni Sena’s demands", "description": "The production company behind Prithviraj, Yash Raj Films, announced the change of the title to Samrat Prithviraj through a public letter addressed to the influential Rajput organisation Karni Sena.", "url": "https://indianexpress.com/article/entertainment/bollywood/akshay-kumar-film-now-samrat-prithviraj-yash-raj-films-bow-before-karni-sena-demands-7939869/", "urlToImage": "https://images.indianexpress.com/2022/05/prithviraj-film-akshay-kumar-1200-1.jpg", "publishedAt": "2022-05-27T12:22:47Z", "content": "The title of Akshay Kumar‘s upcoming historical epic drama Prithviraj is now Samrat Prithviraj, or ‘Emperor Prithviraj’. The production company behind the film, Yash Raj Films, announced the change t… [+2029 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Fit-again Chhetri boosts India’s chances in Jordan friendly", "description": "The 37-year-old Chhetri last played for India during their 3-0 win over Nepal in the SAFF Championships final in October 2021, but since then was side-lined due to injuries.", "url": "https://indianexpress.com/article/sports/football/fit-again-chhetri-boosts-indias-chances-in-jordan-friendly-7939908/", "urlToImage": "https://images.indianexpress.com/2022/05/India-football-2.jpg", "publishedAt": "2022-05-27T12:18:16Z", "content": "Upbeat with the return of talismanic striker Sunil Chhetri in their ranks, India still have a tough task at hand when they face higher-ranked Jordan in an international football friendly match here o… [+2010 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sana Farzeen", "title": "The Broken News trailer: Sonali Bendre, Jaideep Ahlawat fight the war between news and stories", "description": "The Broken News stars Sonali Bendre, Jaideep Ahlawat, Shriya Pilgaonkar, Indraneil Sengupta among others. Directed by Vinay Waikul, the ZEE5 show will start streaming from June 10.", "url": "https://indianexpress.com/article/entertainment/web-series/the-broken-news-trailer-sonali-bendre-jaideep-ahlawat-fight-the-war-between-news-stories-zee5-7939566/", "urlToImage": "https://images.indianexpress.com/2022/05/sonali-bendre-the-broken-news.jpg", "publishedAt": "2022-05-27T12:16:26Z", "content": "ZEE5 recently announced The Broken News, which marks Bollywood star Sonali Bendre’s OTT debut. The show also starring Jaideep Ahlawat, Shriya Pilgaonkar, Indraneil Sengupta, Faisal Rashid, Kiran Kuma… [+2093 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Navmi Krishna", "title": "Imran Khan, Shehbaz Sharif lock horns over early elections in Pakistan. Here’s how it unfolded", "description": "Pakistan's ousted Prime Minister Imran Khan wants the current administration to call early elections. Will Shehbaz Sharif's government relent?", "url": "https://indianexpress.com/article/pakistan/pakistan-imran-khan-islamabad-rally-early-elections-7939219/", "urlToImage": "https://images.indianexpress.com/2022/05/imran-khan-rally-1.jpg", "publishedAt": "2022-05-27T12:16:18Z", "content": "Ousted Pakistan Prime Minister Imran Khan Thursday called for fresh general elections within six days, warning Shehbaz Sharif‘s government that he will ‘return to the capital city of Islamabad with t… [+4117 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Avneesh Mishra", "title": "NAS 2021: Uttarakhand’s performance decline as compared to 2017 scores; most students marked in ‘below basic’ category", "description": "A comparison with the performance of students in NAS-2017 shows a clear decline. A categorization of students on performance levels shows that most of the students in almost all four classes fall in the category of “below basic” or “basic”.", "url": "https://indianexpress.com/article/education/nas-2021-nas-2021-uttarakhands-performance-decline-as-compared-to-2017-scores-most-students-marked-in-below-basic-category-7939895/", "urlToImage": "https://images.indianexpress.com/2022/05/classroom-pune.jpg", "publishedAt": "2022-05-27T12:10:40Z", "content": "The result of the National Achievement Survey (NAS) for 2021, conducted to obtain information about the learning achievement of students of Classes 3, 5, 8 and 10 studying in state govt schools, show… [+4343 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Alfiya Khan", "title": "Campus watch: Maharashtra’s poor science, maths scorecard prompts call for pedagogy reworking", "description": "While educationists say the latest National Achievement Survey report should serve as a wake-up call for teachers and policymakers, a teachers association leader blames the no-detention policy under the Right to Education Act for the poor showing.", "url": "https://indianexpress.com/article/cities/pune/campus-watch-maharashtras-poor-science-maths-scorecard-prompts-call-for-pedagogy-reworking-7939889/", "urlToImage": "https://images.indianexpress.com/2022/05/pune-4.jpg", "publishedAt": "2022-05-27T12:09:42Z", "content": "The survey conducted in November 2021 shows nearly one in three students in secondary school (Classes 8-10) in the state cannot even answer basic science and mathematics questions and the performance… [+3949 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sana Farzeen", "title": "Faisal Malik on the death scene in Panchayat Season 2: ‘The pain of losing someone…’", "description": "The last episode of Amazon Prime Video series Panchayat Season 2 left viewers moist-eyed with its emotional track.", "url": "https://indianexpress.com/article/entertainment/web-series/faisal-malik-emotional-death-scene-panchayat-2-prahlad-7936940/", "urlToImage": "https://images.indianexpress.com/2022/05/prahlad-pandey-faisal-malik-panchayat-2.jpg", "publishedAt": "2022-05-27T12:05:41Z", "content": "Ever since its release, Panchayat Season 2 has been winning hearts with its sweet and simple tale. However, the last episode left viewers moist-eyed with its emotional track. If you are yet to watch … [+2638 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Kareena Kapoor, Amrita Arora take on trolls who commented ‘buddhi’ on their posts: ‘Is this meant to be an insult?’", "description": "Kareena Kapoor Khan hit back at social media trolls who used the word 'buddhi'. She also seemed annoyed at how the word is used as an insult.", "url": "https://indianexpress.com/article/entertainment/bollywood/kareena-kapoor-slams-trolls-call-her-buddhi-amrita-arora-7939817/", "urlToImage": "https://images.indianexpress.com/2022/05/kareena-kapoor-age-shame-buddhi.jpg", "publishedAt": "2022-05-27T12:04:25Z", "content": "Kareena Kapoor on Friday took to social media to respond to trolls who age-shamed her. The actor shared a screengrab of a social media user commenting ‘budhi’ in the comment box of a post. Kareena sa… [+1787 chars]"}]}