{"status": "ok", "totalResults": 397, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Rafael Nadal beats Novak Djokovic in epic clash to reach French Open semifinals", "description": "In a see-saw contest, Djokovic regained the upper hand to open a 3-0 lead in the fourth set but Nadal would not go into a fifth set, breaking back for 4-5 before forcing a tiebreak in which he gave his opponent no chance.", "url": "https://indianexpress.com/article/sports/tennis/french-open-rafael-nada-beats-novak-djokovic-7946333/", "urlToImage": "https://images.indianexpress.com/2022/06/nadal.jpg", "publishedAt": "2022-06-01T00:37:12Z", "content": "Talks of an end to Rafael Nadal’s reign proved premature once again as the claycourt king stayed on course for a record-extending men’s 22nd Grand Slam title by beating arch rival Novak Djokovic 6-2 … [+3220 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Maulshree Seth", "title": "Adityanath claps back: ‘Kids are right… Akhilesh no different from Rahul’", "description": "On Akhilesh’s remark that BJP leaders think only about “gobar” (cow dung), Adityanath said that while Akhilesh on one hand talks about farming, he smells badbu (bad smell) in cow dung.", "url": "https://indianexpress.com/article/cities/lucknow/adityanath-claps-back-kids-akhilesh-no-different-from-rahul-7946526/", "urlToImage": "https://images.indianexpress.com/2022/06/UP.jpg", "publishedAt": "2022-06-01T00:32:46Z", "content": "Speaking during the Budget discussion in the Assembly, Adityanath said: Bache bhole bhale hote hain, lekin mann ke hote hain sacch. Bola hoga to bahut soch samajh ke hi bola hoga… Kyunki farak bahut … [+1151 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Maulshree Seth", "title": "Appeasement of none our resolve: Uttar Pradesh Chief Minister Yogi Adityanath", "description": "MLA Local Area Fund increased to Rs 5 crore; Budget passed by both Assembly and Council", "url": "https://indianexpress.com/article/cities/lucknow/appeasement-of-none-our-resolve-cm-yogi-adityanath-7946524/", "urlToImage": "https://images.indianexpress.com/2022/06/Yogi.jpg", "publishedAt": "2022-06-01T00:24:39Z", "content": "The Budget session of the UP Assembly came to an end on Tuesday with Speaker Satish Mahana adjourning the House sine-die after the budget was passed. The Legislative Council also passed the state bud… [+3275 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "13-year-old from Pune scales Kala Patthar, finishes ‘highest and toughest’ marathon", "description": "On May 27, Kawade reached the Everest base camp at an elevation of 5,364 metres, and ascended the Kala Patthar, at an elevation of 5,644.5 metres, on May 28.", "url": "https://indianexpress.com/article/cities/pune/13-year-old-pune-kala-patthar-highest-toughest-marathon-7946513/", "urlToImage": "https://images.indianexpress.com/2022/06/kala-patthar.jpg", "publishedAt": "2022-06-01T00:08:24Z", "content": "13-year-old Sai Sudhir Kawade had the look of triumph after he finished the Tenzing Hillary Everest Marathon on May 29. As many as 45 countries participated in the annual marathon and Kawade was the … [+821 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi Confidential: House Truths", "description": "As Sharad Yadav briefly interacted with the media, his little grandson ran around excitedly, while wife Rekha Yadav looked on from a distance.", "url": "https://indianexpress.com/article/delhi-confidential/sharad-yadav-vacates-tughlaq-road-bungalow-7946488/", "urlToImage": "https://images.indianexpress.com/2022/06/sharad.jpg", "publishedAt": "2022-06-01T00:04:09Z", "content": "The mood at 7, Tughlaq Road, was sombre on Tuesday with its occupant, socialist stalwart Sharad Yadav, moving out of the bungalow after over two decades. As Yadav briefly interacted with the media, h… [+1738 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Rs 10,000 crore for Bengal biggest fund allocation for railway projects, says Union Railway Minister Ashwini Vaishnaw", "description": "Minister urges state government to “work in synergy with Centrefor speedy execution of projects”.", "url": "https://indianexpress.com/article/cities/kolkata/rs-10000-crore-bengal-fund-allocation-railway-projects-minister-ashwini-vaishnaw-7946509/", "urlToImage": "https://images.indianexpress.com/2022/06/ashwini.jpg", "publishedAt": "2022-05-31T23:57:25Z", "content": "The centre has allotted Rs 10,000 crore for railway projects in West Bengal, Union Railway Minister Ashwini Vaishnaw said on Tuesday. Vaishnaw, who was addressing a gathering during Garib Kalyan Samm… [+3172 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sadaf Modak", "title": "Kiran Gosavi clicked selfie to show friends, pal called him to hear Aryan Khan’s voice: NCB", "description": "Aryan and five others were dropped as accused in the chargesheet filed by the SIT last week. Gosavi’s statement is part of the chargesheet submitted to the court.", "url": "https://indianexpress.com/article/cities/mumbai/kiran-gosavi-clicked-selfie-to-show-friends-pal-called-him-to-hear-aryan-khans-voice-ncb/", "urlToImage": "https://images.indianexpress.com/2022/06/aryan-khan-3.jpg", "publishedAt": "2022-05-31T23:49:58Z", "content": "The viral selfie of actor Shah Rukh Khans son Aryan Khan, which had first led to allegations of irregularity in the probe conducted by the Narcotics Control Bureau (NCB) in the Cordelia cruise ship d… [+2090 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "‘No entry’ for BJP in 2024 polls: West Bengal Chief Minister Mamata Banerjee", "description": "The Chief Minister also targeted the Narendra Modi government on the completion of eight years in power, saying it had started its tenure with fake promises, which has culminated in failed experiments.", "url": "https://indianexpress.com/article/cities/kolkata/no-entry-bjp-2024-polls-west-bengal-chief-minister-mamata-banerjee-7946507/", "urlToImage": "https://images.indianexpress.com/2022/06/mamata.jpg", "publishedAt": "2022-05-31T23:49:20Z", "content": "Targetting the BJP-led Centre for using central agencies to silence Opposition parties, Chief Minister Mamata Banerjee on Tuesday claimed that the BJP would find no entry across the country in the 20… [+2854 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anjali Marar", "title": "‘Cool’ May brings respite after harsh March, April", "description": "The coolest May day this year was on May 12, when the maximum temperature was 33.7 degrees Celsius, mostly due to cloudy sky conditions associated with the development of Cyclone Asani.", "url": "https://indianexpress.com/article/cities/pune/cool-may-brings-respite-after-harsh-march-april-7946503/", "urlToImage": "https://images.indianexpress.com/2022/06/PUNE-RAIN.jpg", "publishedAt": "2022-05-31T23:33:23Z", "content": "After gruelling heat during March and April, Pune city witnessed a cooler than usual May this year. The highest maximum temperature recorded in May was 40.7 degrees Celsius, making it the 13th cooles… [+2213 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Peter Vidal", "title": "Horoscope Today, June 1, 2022: Cancer, Leo, Libra and other signs — check astrological prediction", "description": "Keep remembering Taurus that it's important to do things in line with what is right ethically and morally, and you won't go far wrong. It's not that the stars punish self-interest, only that what's right for you at the moment is the same as what's right for e…", "url": "https://indianexpress.com/article/horoscope/horoscope-today-june-1-2022-cancer-leo-libra-and-other-signs-check-astrological-prediction-7941233/", "urlToImage": "https://images.indianexpress.com/2022/03/horo2121-1-1.jpeg", "publishedAt": "2022-05-31T23:30:14Z", "content": "Current planetary influences seem to be making you more confident of your ground at home. Soon you will be able to confuse people by being nice to them for a change, so put down the stick and pick up… [+3367 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Fadnavis praises Landge for ‘role’ in restarting of bullock cart races", "description": "He also said that his party will make efforts to ensure that bullock cart races do not come to a halt in the state in the future.", "url": "https://indianexpress.com/article/cities/pune/fadnavis-praises-landge-role-restarting-bullock-cart-races-7946498/", "urlToImage": "https://images.indianexpress.com/2022/06/fadnavis.jpg", "publishedAt": "2022-05-31T23:26:18Z", "content": "BJP leader and former chief minister Devendra Fadnavis on Tuesday praised the party’s Bhosari MLA Mahesh Landge for the latter’s role in ensuring that bullock cart races start again in Maharashtra.He… [+1387 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Ajay Jadhav", "title": "Pune: Over a third of sitting corporators stare at tough contest to get party tickets", "description": "\"The number of members would be more in the civic body for next five years but the delimitation and reservation of seats have hampered chances of many members to retain their place,” said a political observer.", "url": "https://indianexpress.com/article/cities/pune/over-third-of-sitting-corporators-stare-at-tough-contest-get-party-tickets-7946494/", "urlToImage": "https://images.indianexpress.com/2022/06/pune-lotterry.jpg", "publishedAt": "2022-05-31T23:20:58Z", "content": "With reservation of seats and delimitation of electoral area for the forthcoming civic polls being finalised, at least one third of sitting corporators in Pune Municipal Corporation (PMC) will have t… [+3722 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Loan recovery agent booked for sexual harassment: police", "description": "The woman has claimed that she neither knows the person who is supposed to have taken the loan nor the man who harassed her to repay the same.", "url": "https://indianexpress.com/article/cities/mumbai/loan-recovery-agent-booked-sexual-harassment-police-7946491/", "urlToImage": "https://images.indianexpress.com/2022/06/Indian-Express-3.jpeg", "publishedAt": "2022-05-31T23:11:31Z", "content": "A loan recovery agent was on Tuesday booked for allegedly sexually harassing a 48-year-old BJP leader in Mumbai.The police said the accused asked the woman to repay a loan of Rs 5,600 taken from him … [+1042 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Man who murdered daughter traced, likely to be arrested along with wife", "description": "The couple decided to kill themselves and their daughter because they faced acute financial crisis, said an officer.", "url": "https://indianexpress.com/article/cities/mumbai/man-murdered-daughter-traced-likely-to-be-arrested-along-with-wife-7946489/", "urlToImage": "https://images.indianexpress.com/2022/06/Indian-Express-2.jpeg", "publishedAt": "2022-05-31T23:05:52Z", "content": "The Kashimira police on Tuesday traced the 39-year-old man who allegedly murdered his seven-year-old daughter with the help of his wife last Sunday. The police said while this was supposed to be a ca… [+1610 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "ACB arrests police inspector for taking Rs 70,000 as bribe", "description": "An officer from the ACB said that the complainant owns a piece of land in Khar with a building on it and a person runs a shop on the ground floor.", "url": "https://indianexpress.com/article/cities/mumbai/acb-arrests-police-inspector-for-taking-rs-70000-as-bribe-7946485/", "urlToImage": "https://images.indianexpress.com/2022/06/arrest-12.jpg", "publishedAt": "2022-05-31T22:59:15Z", "content": "OFFICIALS FROM the Anti-Corruption Bureau (ACB) arrested an assistant police inspector while accepting a bribe of Rs 70,000 from a businessman in Khar. The ACB officials said that the accused police … [+1362 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Students in BMC-run schools to get new uniform this year, no need to wear tie any longer", "description": "According to the information provided by officials from the Education Department at BMC, a committee was formed that included teachers, BMC officials and designers to decide on the new uniform. The idea was to bring about a change, which will be comfortable f…", "url": "https://indianexpress.com/article/cities/mumbai/students-in-bmc-run-schools-to-get-new-uniform-this-year-no-need-to-wear-tie-any-longer-7946478/", "urlToImage": "https://images.indianexpress.com/2022/06/school-kids.jpg", "publishedAt": "2022-05-31T22:56:24Z", "content": "AS THE schools start a new academic year in June after the Covid-19 pandemic, children studying in Mumbai Public Schools (MPS) run by the Brihanmumbai Municipal Corporation (BMC) are expected to get … [+2092 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "GRP files FIRs against commuters who die while crossing rail tracks", "description": "The GRP believes to create a deterrent effect against track crossing by using this method. In 2021, a total of 1,752 rail deaths took place.", "url": "https://indianexpress.com/article/cities/mumbai/grp-files-fir-commuters-who-die-while-crossing-rail-tracks-7946473/", "urlToImage": "https://images.indianexpress.com/2022/06/Railway-track.jpg", "publishedAt": "2022-05-31T22:54:01Z", "content": "THE GOVERNMENT Railway Police (GRP) recently started registering First Information Report (FIR) against commuters, who get killed while crossing the railway tracks. The GRP said that the move will he… [+1615 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Yes Bank-DHFL fraud case: Pune realtor in CBI custody till June 8", "description": "He was ordered to be lodged at the CBI’s guesthouse by the special court till it decided the plea by the agency to seek his remand and a separate application filed by Bhosale’s lawyers claiming that his arrest was illegal.", "url": "https://indianexpress.com/article/cities/mumbai/yes-bank-dhfl-fraud-case-pune-realtor-in-cbi-custody-till-june-8-7946475/", "urlToImage": "https://images.indianexpress.com/2022/06/Avinash-Bhosale-1.jpg", "publishedAt": "2022-05-31T22:49:49Z", "content": "PUNE-BASED builder Avinash Bhosale, arrested in the Yes Bank-DHFL fraud case, was sent in the custody of the CBI till June 8. Bhosale was arrested on Thursday by the CBI.He was ordered to be lodged a… [+1481 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Mohamed Thaver", "title": "Wrongly booked for rape: After he submits probe report, DCP asked to give details on role of cops", "description": "On May 15, the Dharavi police had arrested brothers Nilesh Chauhan (20) and Anil Chauhan (19) in connection with the rape of a 19-year-old married woman at her residence. The woman had alleged that two persons had entered her residence and raped her on May 11.", "url": "https://indianexpress.com/article/cities/mumbai/wrongly-booked-for-rape-after-he-submits-probe-report-dcp-asked-to-give-details-on-role-of-cops-7946466/", "urlToImage": "https://images.indianexpress.com/2022/06/mumbai-9.jpg", "publishedAt": "2022-05-31T22:45:33Z", "content": "The Mumbai Police, conducting an inquiry against Dharavi police station officers, who wrongly arrested and allegedly tortured two brothers in a rape case, has asked the zonal DCP to submit a detailed… [+2228 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rupsa Chakraborty", "title": "Maharashtra records 3-fold increase in active Covid cases, officials call it a ‘blip’", "description": "After flattening of the pandemic curve, daily Covid-19 cases are gradually rising in the state. On April 30, the state had only 998 active cases, which in the last one month has increased to 3,475 -- as on May 31. This accounts for a 248 per cent surge in act…", "url": "https://indianexpress.com/article/cities/mumbai/maharashtra-records-3-fold-increase-in-active-covid-cases-officials-call-it-a-blip-7946443/", "urlToImage": "https://images.indianexpress.com/2022/06/covid-test.jpg", "publishedAt": "2022-05-31T22:44:38Z", "content": "With the gradual rise in the daily Covid-19 cases in Maharashtra, the number of patients currently infected with novel coronavirus has surged by over three times in the last one month. Health officia… [+2658 chars]"}]}