{"status": "ok", "totalResults": 628, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Shutdown in Srinagar over remarks by ex-BJP spokespersons against Prophet, use of derogatory language in Bhaderwah", "description": "Shops and other business establishments remained closed at the city centre or Lal Chowk and other parts of the capital. Limited protests were also seen across the district as well.", "url": "https://indianexpress.com/article/cities/srinagar/shutdown-srinagar-comments-against-prophet-7962848/", "urlToImage": "https://images.indianexpress.com/2022/06/Srinagar-Protest-Main.jpg", "publishedAt": "2022-06-10T10:49:29Z", "content": "Life came to a halt in Srinagar on Friday as the city observed a shutdown in protest against the statements by former BJP spokespersons about Prophet Mohammad, and the objectionable remarks against a… [+1752 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Woman killed as policeman fires several rounds before shooting himself dead", "description": "The identities of the woman and the policeman are yet to be known.", "url": "https://indianexpress.com/article/cities/kolkata/woman-killed-as-policeman-fires-several-rounds-before-shooting-himself-dead-7962849/", "urlToImage": "https://images.indianexpress.com/2022/06/dead.jpg", "publishedAt": "2022-06-10T10:48:44Z", "content": "A policeman allegedly fired several rounds outside the Bangladesh Deputy High Commission in central Kolkata’s busy Park Circus area on Friday afternoon, killing a woman before shooting himself dead, … [+658 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Careers Desk", "title": "RRB NTPC CBT-2 admit card 2019 released for level 2, 3, and 5: How to download", "description": "RRB NTPC CBT-2 admit card: Candidates can download their admit card or hall ticket at the official website — rrbcdg.gov.in", "url": "https://indianexpress.com/article/jobs/rrb-ntpc-2019-admit-card-released-for-level-2-3-and-5-how-to-download-rrbcdg-gov-in-7962778/", "urlToImage": "https://images.indianexpress.com/2022/06/gettyimages-1310796071-612x612-1.jpg", "publishedAt": "2022-06-10T10:46:14Z", "content": "RRB NTPC CBT-2: The Railway Recruitment Board (RRB) has released the admit card for the RRB NTPC Computer-based Test (CBT-2) for Pay Level-5, 3, and 2. Candidates can download their admit card or hal… [+881 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Serivce", "title": "Prophet remark row: Protests erupt outside Hyderabad mosque, cops bring situation under control", "description": "However, anticipating protests, heavy police force had been deployed in the area and they were successfully able to avert any untoward incidents.", "url": "https://indianexpress.com/article/cities/hyderabad/prophet-remark-row-protests-hyderabad-mecca-mosque-7962832/", "urlToImage": "https://images.indianexpress.com/2022/06/mecca-mosque.jpg", "publishedAt": "2022-06-10T10:41:12Z", "content": "Tension briefly prevailed outside Mecca Mosque in Hyderabad on Friday as hundreds of people held a protest against the BJP-led central government over recent comments made by party leaders Nupur Shar… [+87 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Hamza Khan", "title": "Rajasthan Pulse | A Rajya Sabha poll like no other: Cross-voting claims, resort politics and Internet cuts", "description": "As recently as 2016, ahead of the Rajya Sabha polls, the BJP had taken its MLAs to a resort for “training” three days", "url": "https://indianexpress.com/article/political-pulse/rajasthan-pulse-rajya-sabha-poll-like-no-other-cross-voting-resort-politics-internet-cuts-7962757/", "urlToImage": "https://images.indianexpress.com/2022/06/Rajasthan.jpg", "publishedAt": "2022-06-10T10:39:30Z", "content": "On Thursday, Jaipur Divisional Commissioner Vikas Sitaramji Bhale issued orders suspending Internet services in Amer tehsil for 17 hours till Friday noon. Just hours before the order, Congress MLAs h… [+7210 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Personal protection by police an exception, not the rule: Punjab government in high court", "description": "Replying to former minister Gulzar Singh Ranike’s petition for restoring his security cover, the government says spending taxpayer money for deploying police for the security of individuals is not its function.", "url": "https://indianexpress.com/article/cities/chandigarh/personal-protection-by-police-an-exception-not-the-rule-punjab-government-in-high-court-7962776/", "urlToImage": "https://images.indianexpress.com/2022/06/gulzar-singh-ranike210558dl0616.jpg", "publishedAt": "2022-06-10T10:32:32Z", "content": "Replying to a petition filed by former minister Gulzar Singh Ranike, the Punjab government has submitted in the high court that spending taxpayer money for deploying police for the security of indivi… [+2490 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Teenager kills mother over PUBG: Experts on how online gaming can affect mental health", "description": "While games like puzzles and chess can help adolescents and children develop comprehensive reasoning abilities, games like PUBG, according to Dr Syed Zafar Sultan Rizvi, “can transform the neurochemistry of the brain\"", "url": "https://indianexpress.com/article/lifestyle/health/teenager-kills-mother-pubg-online-gaming-mental-health-7962375/", "urlToImage": "https://images.indianexpress.com/2022/06/online-gaming-1200.jpg", "publishedAt": "2022-06-10T10:20:45Z", "content": "Recently, a 16-year-old boy from Lucknow allegedly shot his mother because she stopped him from playing “online games like PUBG”, according to UP Police. In another incident from Hyderabad, a teenage… [+3520 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Explained: Why is Indonesia revisiting its controversial jobs creation law?", "description": "Indonesia will change a major jobs-creation law aimed at cutting red tape after a recent court order", "url": "https://indianexpress.com/article/explained/explained-indonesia-revisiting-jobs-creation-law-7962419/", "urlToImage": "https://images.indianexpress.com/2022/06/Indonesia-President.jpg", "publishedAt": "2022-06-10T10:18:05Z", "content": "Indonesia’s parliament is set to revisit a contentious Job Creation law to comply with a court order to fix procedural flaws during its 2020 passage, amid renewed pressure from unions and environment… [+3126 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shubhra Gupta", "title": "Ghode Ko Jalebi Khilane Le Ja Riya Hoon movie review: An intriguing tour of Shahjahanabad", "description": "Ghode Ko Jalebi Khilane Le Ja Riya Hoon movie review: Anamika Haksar’s nearly two-hour tour of Shahjahanabad is a mix of documentary, ethnography, magical realism, surrealism, fantasy, folk tale, animation, with a bit of burlesque thrown in.", "url": "https://indianexpress.com/article/entertainment/movie-review/ghode-ko-jalebi-khilane-le-ja-riya-hoon-movie-review-raghubir-yadav-ravindra-sahu-7962765/", "urlToImage": "https://images.indianexpress.com/2022/06/Ghode-Ko-Jalebi-Khilane-Le-Ja-Riya-Hoon-review-1200.jpg", "publishedAt": "2022-06-10T10:16:49Z", "content": "Ghode Ko Jalebi Khilane Le Ja Riya Hoon movie cast: Raghubir Yadav, Ravindra Sahu, Lokesh Jain, K GopalanGhode Ko Jalebi Khilane Le Ja Riya Hoon movie director: Anamika HaksarGhode Ko Jalebi Khilane … [+4543 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ANURADHA MASCAREHNAS", "title": "Why bariatric surgery is an answer to uncontrolled diabetes", "description": "Obesity has become a serious health problem in the country, necessitating a surgical intervention to avert life-risks. However bariatric surgeries to treat this condition have not risen proportionately because of low awareness. While we need about four lakh i…", "url": "https://indianexpress.com/article/lifestyle/health/diabetes-cure-bariatric-surgery-7962760/", "urlToImage": "https://images.indianexpress.com/2022/04/diabetes_759_getty.jpg", "publishedAt": "2022-06-10T10:15:13Z", "content": "At 29, Punes Heena Shaikh was the first woman in the country to undergo a bariatric procedure in 1999. I had just delivered my baby via Caesarean section. Somehow, I started gaining weight and was al… [+6210 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Salma Hayek, Demian Bichir to star in Angelina Jolie’s directorial Without Blood", "description": "Without Blood is based on Alessandro Baricco's international bestselling novel of the same name. It is a fable set in the aftermath of an unidentified conflict in a farmhouse deep in the Italian countryside.", "url": "https://indianexpress.com/article/entertainment/hollywood/salma-hayek-demian-bichir-to-star-in-angelina-jolies-directorial-without-blood-7962630/", "urlToImage": "https://images.indianexpress.com/2022/06/Salma-Hayek-and-Demian-Bichir-n-1200by667.jpg", "publishedAt": "2022-06-10T10:11:12Z", "content": "Hollywood star Angelina Jolie is set to direct her Eternals co-star Salma Hayek and Demian Bichir in her upcoming film Without Blood. The feature film is Jolie’s fifth effort as a director and her fi… [+984 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "COMEDK UGET 2022 admit card released: How to download", "description": "The candidates who have registered for the examination can download their admit card through the website- comedk.org.", "url": "https://indianexpress.com/article/education/comedk-uget-2022-admit-card-released-how-to-download-comedk-org-7962712/", "urlToImage": "https://images.indianexpress.com/2022/06/kkkkkkkkkkkkkkkkkkkkkkkkk.jpg", "publishedAt": "2022-06-10T10:10:59Z", "content": "COMEDK UGET 2022 admit card: The Consortium of Medical, Engineering, and Dental Colleges of Karnataka (COMEDK) has released the admit card for the Undergraduate Entrance Test (UGET) 2022. The candida… [+1245 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sreenivas Janyala", "title": "Amid gangrape furore, Telangana governor holds ‘mahila darbar’ to be ‘bridge between govt and public’", "description": "Governor Tamilisai Soundararajan's programme to ‘hear the unheard voices of women’ has not gone down well with the TRS government and further strained the relations.", "url": "https://indianexpress.com/article/cities/hyderabad/telangana-governor-holds-mahila-darbar-to-be-bridge-between-govt-public-7962721/", "urlToImage": "https://images.indianexpress.com/2022/06/Tamilisai-Soundararajan-22.jpg", "publishedAt": "2022-06-10T10:09:20Z", "content": "Amid the furore over the gangrape of a minor girl at an upscale area in Hyderabad, Telangana Governor Tamilisai Soundararajan on Friday held a mahila darbar at the Raj Bhavan, where she listened to o… [+3685 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "West Bengal HS Class 12th 2023 exams to begin on March 14", "description": "WBCHSE president Chiranjib Bhattacharya during a news conference said that the exam will be held on full syllabus and they will be held in external exam centers and not in home venues which were the same this year.", "url": "https://indianexpress.com/article/education/west-bengal-hs-class-12th-2023-exams-to-begin-on-march-14-962753/", "urlToImage": "https://images.indianexpress.com/2019/05/wb-1200-2.jpg", "publishedAt": "2022-06-10T10:07:46Z", "content": "The West Bengal Council of Higher Secondary Education (WBCHSE) will conduct the HS or class 12 exams 2023. The exams will begin on March 14 to March 27. Exams will be conducted based on the full syll… [+1061 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Transact Anywhere, Anytime, With ICICI Bank’s Trade Online Platform", "description": "With an intelligent User Interface and robust security, the unique Trade Online platform also enables corporates to submit Trade Finance transaction requests.", "url": "https://indianexpress.com/article/business/sponsored-business/transact-anywhere-anytime-with-icici-banks-trade-online-platform-7962755/", "urlToImage": "https://images.indianexpress.com/2022/06/IE_Lead_41-1.jpg", "publishedAt": "2022-06-10T10:05:03Z", "content": "With the pandemic easing, cross-border trade has registered an increase of 21 percent over pre-pandemic levels. While uncertainty still prevails for cross-border trade in India due to the impact of t… [+3790 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gold smuggling case: Congress protests across Kerala seeking CM Vijayan’s resignation", "description": "The protests turned violent in Kottayam, Kollam, Kannur and Kochi. Opposition leader V D Satheesan said Pinarayi Vijayan was in a panic over an allegation by accused Swapna Suresh that the CM had taken currency to Dubai with the help of a diplomat.", "url": "https://indianexpress.com/article/cities/thiruvananthapuram/gold-smuggling-case-congress-protest-cm-pinarayi-vijayan-7962743/", "urlToImage": "https://images.indianexpress.com/2022/01/Vijayan-2.jpg", "publishedAt": "2022-06-10T10:04:47Z", "content": "The Congress-led opposition in Kerala held protest marches to various district headquarters across the state demanding the resignation of Chief Minister Pinarayi Vijayan following allegations by a wo… [+1741 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Run BTS: Suga, RM and J-Hope’s song leaves ARMY spellbound, fans say ‘rap line is on fire’", "description": "While Yet to Come is a soothing, emotional track recalling the band’s last 9 years, Run BTS saw the rap line taking centrestage, with powerful verses from Suga, RM and J-Hope.", "url": "https://indianexpress.com/article/entertainment/music/run-bts-k-pop-track-leaves-army-spellbound-rap-line-7962552/", "urlToImage": "https://images.indianexpress.com/2022/06/bts-ap-1200by667.jpeg", "publishedAt": "2022-06-10T09:55:36Z", "content": "South Korean K-pop band BTS latest album Proof just dropped, whipping ARMY into a frenzy. The anthology album comprising their old hits and three new tracks, Yet to Come, Run BTS and For Youth, spark… [+1218 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Southwest monsoon reaches Goa, south Maharashtra after 3-day delay", "description": "Since the onset, the country's monsoon advance has not been impressive. Kerala, where it arrived on May 29, has received 58 per cent below normal rainfall.", "url": "https://indianexpress.com/article/cities/pune/southwest-monsoon-reaches-goa-south-maharashtra-7962682/", "urlToImage": "https://images.indianexpress.com/2022/06/Mumbai-monsoon.jpg", "publishedAt": "2022-06-10T09:53:18Z", "content": "The Southwest monsoon finally arrived over Goa and southern parts of Maharashtra on Friday after a three-day delay, the India Meteorological Department (IMD) said.Last year, the monsoon had arrived o… [+1316 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shubhra Gupta", "title": "The Broken News review: Sonali Bendre, Jaideep Ahlawat show is more of a crime thriller than a cautionary tale", "description": "The Broken News review: The show comes off more like a crime thriller than what it promises at the outset – an exploration of how TV news is shaping everyday discourse in the country.", "url": "https://indianexpress.com/article/entertainment/web-series/the-broken-news-review-sonali-bendre-jaideep-ahlawat-7962664/", "urlToImage": "https://images.indianexpress.com/2022/06/the-broken-news-1200.jpg", "publishedAt": "2022-06-10T09:49:48Z", "content": "The Broken News cast: Jaideep Ahlawat, Sonali Bendre Behl, Shriya Pilgaonkar, Taaruk RainaThe Broken News director: Vinay WaikulTwo rival TV channels, one which chases TRPs to the exclusion of all el… [+2793 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kanchan Vasdev", "title": "Hit to Badal’s business, Punjab govt to run luxury buses directly to Delhi’s IGI airport", "description": "In a video message, CM Bhagwant Mann said that the fare of these buses would be less than half of what was being charged by the private bus operators.", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-govt-to-run-luxury-buses-directly-to-delhi-igi-airport-7962538/", "urlToImage": "https://images.indianexpress.com/2022/06/Mann.jpg", "publishedAt": "2022-06-10T09:47:17Z", "content": "In a move aimed at hitting the transport mafia, Punjab Chief Minister Bhagwant Mann on Friday said that the government-run luxury buses would ply directly to the Indira Gandhi International Airport i… [+1068 chars]"}]}