{"status": "ok", "totalResults": 721, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Covid positivity rate zero in most Bengal districts, says health dept report", "description": "The official said a total 10,710 samples were examined during the surveillance over three days between April 27 to April 29 by Kalyani College of Medicine and JNM Hospital.", "url": "https://indianexpress.com/article/cities/kolkata/covid-positivity-rate-zero-in-most-bengal-districts-says-health-dept-report-7903465/", "urlToImage": "https://images.indianexpress.com/2022/05/covid-1.jpg", "publishedAt": "2022-05-05T22:36:09Z", "content": "An internal report of a sentinel surveillance conducted by the West Bengal health department has found that the Covid-19 positivity rate in most of the districts is zero, rubbishing apprehensions of … [+2766 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Tough to guard borders without support of local admin: Shah in Bengal", "description": "Shah, who is on a two-day visit to the state, asserted that a political situation would emerge soon when the local authorities would be “forced to extend help due to public pressure”.", "url": "https://indianexpress.com/article/cities/kolkata/tough-to-guard-borders-without-support-of-local-admin-shah-in-bengal-7903463/", "urlToImage": "https://images.indianexpress.com/2022/05/aMIT-SHAH-14-2.jpg", "publishedAt": "2022-05-05T22:32:57Z", "content": "Taking an indirect jibe at the Trinamool Congress (TMC) government in West Bengal, Union Home Minister Amit Shah on Thursday said that it was difficult to stop infiltration and smuggling across the i… [+2743 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sachchidanand Shukla", "title": "India must seize the trade opportunity opening now", "description": "The uncertain global economic environment calls for proactive policy actions to boost exports", "url": "https://indianexpress.com/article/opinion/columns/india-must-seize-the-trade-opportunity-opening-7903289/", "urlToImage": "https://images.indianexpress.com/2022/05/export-2.jpg", "publishedAt": "2022-05-05T22:31:06Z", "content": "The year 2021 was a record one for trade despite the pandemic. In terms of volumes, merchandise trade rose 9.8 per cent, while in dollar terms, it grew 26 per cent. The value of commercial services t… [+4707 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Naveed Iqbal, Arun Sharma", "title": "Disempowers, biased: J&K parties oppose panel order", "description": "“We outrightly reject it,” said PDP chief Mehbooba Mufti. She said the Delimitation Commission had “overlooked the basis of population and acted as per their wish... We don’t trust it. Its recommendations are a link to abrogation of Article 370 — how to disem…", "url": "https://indianexpress.com/article/cities/srinagar/disempowers-biased-jk-parties-oppose-panel-order-7903402/", "urlToImage": "https://images.indianexpress.com/2021/12/mufti1.jpg", "publishedAt": "2022-05-05T22:30:57Z", "content": "OPPOSING THE final delimitation order on Thursday, both the Peoples Democratic Party (PDP) and Peoples Conference called it an attempt to disempower the people of Kashmir, while the Congress said it … [+5453 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Will hold meets with TMC’s booth-level leaders, says Mamata", "description": "The TMC supremo also made changes in the party's disciplinary committee by including Subrata Bakshi in place of Partha Chatterjee.", "url": "https://indianexpress.com/article/cities/kolkata/will-hold-meets-with-tmcs-booth-level-leaders-says-mamata-7903461/", "urlToImage": "https://images.indianexpress.com/2022/05/mamata-759-1-1-1-5.jpg", "publishedAt": "2022-05-05T22:30:22Z", "content": "West Bengal Chief Minister Mamata Banerjee on Thursday said that she will start holding meetings of Trinamool Congress (TMC) booth-level leaders alongside district-level administrative review meeting… [+1729 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aanchal Magazine, Aashish Aryan", "title": "Tax reassessment: I-T has 30 days to send notices", "description": "According to the top court’s judgment, the assessing officer will, within 30 days from May 4, provide the respective assesses the information and all relevant material which was relied upon to send the income tax recovery notice to them.", "url": "https://indianexpress.com/article/business/economy/tax-reassessment-i-t-has-30-days-to-send-notices-7903357/", "urlToImage": "https://images.indianexpress.com/2022/03/income-tax-rules-1200.jpg", "publishedAt": "2022-05-05T22:30:14Z", "content": "With the Supreme Court upholding the reassessment notices issued before the amendment to the Income Tax Act through the Finance Act, 2021, taxpayers will have a time period of two weeks to respond to… [+3101 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shubhajit Roy", "title": "Ukraine: Modi & Macron discuss ‘cascading effect’, each’s position", "description": "The tone of India’s statement was in sharp contrast to Delhi’s sharp response to remarks from other European leaders and ministers who, in recent weeks, had conveyed concerns over India not condemning Russia’s actions in Ukraine.", "url": "https://indianexpress.com/article/india/ukraine-modi-macron-discuss-cascading-effect-eachs-position-7903378/", "urlToImage": "https://images.indianexpress.com/2022/05/modi-6.jpg", "publishedAt": "2022-05-05T22:30:12Z", "content": "Hours after Prime Minister Narendra Modi held talks with French President Emmanuel Macron in Paris, Delhi said there was a broad understanding of each others position on the Ukraine issue, that the t… [+2765 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anand Mohan J", "title": "Lynching of 2 tribals in MP: Families of 6 held say accused linked to Bajrang Dal", "description": "The families of some of the six others arrested claimed they were cajoled into joining the raid, which led to the deaths, by people they met at a local wedding. Another accused is a tribal youth whose family does “not know much” about the case.", "url": "https://indianexpress.com/article/india/lynching-of-2-tribals-in-mp-families-of-6-held-say-accused-linked-to-bajrang-dal-7903412/", "urlToImage": "https://images.indianexpress.com/2022/05/Congress-protest.jpg", "publishedAt": "2022-05-05T22:30:09Z", "content": "AT LEAST six of the 13 persons arrested for the death of two tribal men, who were assaulted on Tuesday over allegations of cow slaughter in Madhya Pradeshs Seoni, are members of the Bajrang Dal and h… [+5973 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "Day after MPC: Banks kick off lending, deposit rate hikes", "description": "Bank of Baroda has hiked repo-linked lending rate (RLLR) by 40 basis points to 6.9 per cent. Bank of India and Central Bank of India also raised RLLR by 40 basis points to 7.25 per cent. Other banks are set to follow suit as cost of funds is bound to rise fol…", "url": "https://indianexpress.com/article/business/day-after-mpc-banks-kick-off-lending-deposit-rate-hikes-7903361/", "urlToImage": "https://images.indianexpress.com/2021/04/ICICI-Bank.jpg", "publishedAt": "2022-05-05T22:30:04Z", "content": "Close on the heels of the Reserve Bank of Indias decision to hike the policy repo rate and cash reserve ratio, banks have started hiking lending rates with ICICI Bank and Bank of Baroda (BoB) kicking… [+2628 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Bashaarat Masood", "title": "Explained: What changes to J&K constituencies mean", "description": "Delimitation panel report has added 6 Assembly seats to Jammu, 1 to Kashmir, and redrawn Assembly as well as Lok Sabha seats. What will the impact be?", "url": "https://indianexpress.com/article/explained/explained-what-changes-to-jk-constituencies-mean-7903352/", "urlToImage": "https://images.indianexpress.com/2022/05/jammu-kashmir-1.jpg", "publishedAt": "2022-05-05T22:28:24Z", "content": "On Thursday, a commission set up by the Centre submitted its final report for the delimitation of Assembly and parliamentary constituencies in Jammu and Kashmir. The changes have been opposed by all … [+5586 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Trinamool panchayat member dies in Birbhum, kin allege murder", "description": "Police say preliminary probe suggests that the TMC leader died in an accident but the case was being looked at from all angles", "url": "https://indianexpress.com/article/cities/kolkata/trinamool-panchayat-member-dies-in-birbhum-kin-allege-murder-7903459/", "urlToImage": "https://images.indianexpress.com/2022/05/death-5-2-1.jpg", "publishedAt": "2022-05-05T22:27:20Z", "content": "A Trinamool Congress panchayat member died under mysterious circumstances at Mayureshwar in Birbhum district. The family members of the deceased, identified as Kazi Nazrul Hasan alias Akash, alleged … [+1691 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "70 office-bearers from BJP’s district unit in Jhargram resign", "description": "This came on a day when Union Home Minister and senior party leader Amit Shah arrived in West Bengal on a two-day visit. Among those who resigned are members of the district committee and booth presidents, it is learnt.", "url": "https://indianexpress.com/article/cities/kolkata/70-office-bearers-from-bjps-district-unit-in-jhargram-resign-7903457/", "urlToImage": "https://images.indianexpress.com/2022/05/bjp-1-1.jpg", "publishedAt": "2022-05-05T22:22:26Z", "content": "At least 70 office-bearers of the BJP’s Jhargram district unit in West Bengal tendered their resignations on Thursday.This came on a day when Union Home Minister and senior party leader Amit Shah arr… [+794 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "M Govinda Rao", "title": "Let’s make GST a good and simple tax", "description": "Existing rate structure needs to be rationalised. There should be only two rates", "url": "https://indianexpress.com/article/opinion/columns/lets-make-gst-a-good-and-simple-tax-7902024/", "urlToImage": "https://images.indianexpress.com/2022/05/oped-illustration.jpeg", "publishedAt": "2022-05-05T22:22:18Z", "content": "The introduction of the value-added tax (VAT) has been perhaps the most important tax reform seen across countries in the last three decades. As of 2018, as many as 166 out of the 193 countries that … [+5435 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "ATS apprehends 24, seizes 54 illegal weapons from Saurashtra", "description": "The racket was unearthed after two main accused — Devendra Boria alias Dendu from Sayla      in Surendranagar and Champraj Khachar from Than in Surendranagar — were arrested with four countrymade pistols from Geeta Mandir ST bus stand on Tuesday.", "url": "https://indianexpress.com/article/cities/ahmedabad/ats-apprehends-24-seizes-54-illegal-weapons-from-saurashtra-7903455/", "urlToImage": "https://images.indianexpress.com/2022/05/handcuff-4-3.jpg", "publishedAt": "2022-05-05T22:14:03Z", "content": "In a major arms haul, the Gujarat Anti Terrorist Squad (ATS) apprehended 24 persons from different cities of the Saurashtra region and seized 54 illegal weapons that were allegedly sourced from Madhy… [+1462 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Bakramandi settlement: Families submit objection to AMC’s eviction notice", "description": "On April 29 this year, the AMC served notices to 350 families in the Bakramandi settlement, claiming that they have been encroaching on reserved government land under the Town Planning (TP) project.", "url": "https://indianexpress.com/article/cities/ahmedabad/bakramandi-settlement-families-submit-objection-to-amcs-eviction-notice-7903453/", "urlToImage": "https://images.indianexpress.com/2022/05/Ahmedabad-Municipal-Corporation.jpg", "publishedAt": "2022-05-05T22:10:53Z", "content": "As many as 350 families of Bakramandi settlement in New Ranip, who were served eviction notice for allegedly encroaching government land, on Thursday submitted their objection to the notice at the Ah… [+2341 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Bodies of 3 youths found from Zanzari waterfalls", "description": "Teams of the National Disaster Response Force (NDRF) retrieved the bodies in a day-long operation which began on Thursday.", "url": "https://indianexpress.com/article/cities/ahmedabad/bodies-of-3-youths-found-from-zanzari-waterfalls-7903451/", "urlToImage": "https://images.indianexpress.com/2022/05/death-5-2.jpg", "publishedAt": "2022-05-05T22:07:21Z", "content": "Bodies of three Ahmedabad-based youths were retrieved from Zanzari waterfalls, a popular tourist destination in Dabha of Aravalli, officials said on Thursday.Teams of the National Disaster Response F… [+830 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "After skipping protest over loudspeakers, former MNS Pune chief cites ‘planned visit’", "description": "Vasant More also insisted that his request to hold prayers without loudspeakers was accepted by the in-charge of mosques in his electoral area.", "url": "https://indianexpress.com/article/cities/pune/after-skipping-protest-over-loudspeakers-former-mns-pune-chief-cites-planned-visit-7903449/", "urlToImage": "https://images.indianexpress.com/2022/05/RAJ-1-2.jpeg", "publishedAt": "2022-05-05T21:46:22Z", "content": "AFTER STAYING away from the party’s protest against loudspeakers at mosques by playing `Hanuman Chalisa outside them earlier in the day, former city MNS chief Vasant More clarified late Wednesday tha… [+1877 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "NFAI gets Rs 363 crore to restore 2,200 films", "description": "The films chosen for the process were handpicked by language-wise committees consisting of filmmakers, documentary filmmakers, film historians, producers etc.", "url": "https://indianexpress.com/article/cities/pune/nfai-gets-rs-363-crore-to-restore-2200-films-7903447/", "urlToImage": "https://images.indianexpress.com/2022/05/anurag-thakur-2-1.jpg", "publishedAt": "2022-05-05T21:42:24Z", "content": "The worlds largest film restoration project is to come up at the National Film Archive of India (NFAI) here. The project, under the National Film Heritage Mission (NFHM), has been allotted ? 363 cror… [+1612 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Partha Sarathi Biswas", "title": "Historic high production, but no dip in sugar prices", "description": "Given the present trend, Naiknavare confirmed that India would end up producing 355 LT of sugar. What has made this season stand out is the constant rally in ex-mill prices of sugar despite the bumper production.", "url": "https://indianexpress.com/article/cities/pune/historic-high-production-but-no-dip-in-sugar-prices-7903445/", "urlToImage": "https://images.indianexpress.com/2022/05/sugar-1-1.jpg", "publishedAt": "2022-05-05T21:38:01Z", "content": "In sugar season 2021-22, not only is India set to produce 355 lakh tonnes (LT) of sugar (including 35 LT of sugar subsumed for production of ethanol), but mills have also been able to command prices … [+1730 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "May 6, 1982, Forty Years Ago: Pressure On UK", "description": "Amid international pressure to end the fighting for the Falkland Islands, British Prime Minister Margaret Thatcher had a meeting with her war cabinet to discuss the loss of the destroyer H M S Sheffield knocked down by Argentine forces with at least 30 killed.", "url": "https://indianexpress.com/article/opinion/editorials/forty-years-ago-falkland-islands-margaret-thatcher-pressure-on-uk-7903301/", "urlToImage": "https://images.indianexpress.com/2022/05/06-May1982_IE_001.jpg", "publishedAt": "2022-05-05T21:34:42Z", "content": "Amid international pressure to end the fighting for the Falkland Islands, British Prime Minister Margaret Thatcher had a meeting with her war cabinet to discuss the loss of the destroyer H M S Sheffi… [+617 chars]"}]}