{"status": "ok", "totalResults": 439, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Watch KK perform Maachis song Chhod Aaye Hum just for Gulzar: ‘Moved to see his love’", "description": "Filmmaker Srijit Mukherji shared a sweet video of KK, where the late singer is seen paying a musical tribute to the acclaimed lyricist Gulzar.", "url": "https://indianexpress.com/article/entertainment/music/when-kk-paid-a-sweet-musical-tribute-to-gulzar-7946604/", "urlToImage": "https://images.indianexpress.com/2022/06/gulzar1200.jpg", "publishedAt": "2022-06-01T04:49:08Z", "content": "Ever since the news of KK’s demise was shared, an outpouring of love and throwback videos and photos of the late singer is being shared on social media by his fans and colleagues.Filmmaker Srijit Muk… [+1173 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Atri Mitra", "title": "Bengal tribal politics heats up after Ol Chiki figures in PM ‘Mann Ki Baat’", "description": "The Ol Chiki script for the Santhali language was developed by Pandit Raghunath Murmu, a renowned Santhali writer, eight decades ago following which this script started gaining currency within the tribal community.", "url": "https://indianexpress.com/article/india/political-pulse/bengal-tribal-politics-ol-chiki-figures-pm-mann-ki-baat-7946679/", "urlToImage": "https://images.indianexpress.com/2022/06/Santhal22-political-pulse-.jpg", "publishedAt": "2022-06-01T04:43:13Z", "content": "Tudu, who belongs to the Santhal tribe, is the professor of the Santhali language in Sidho-Kanho-Birsha University in Bengals Purulia. He said that he was very happy that the PM has praised his work,… [+4043 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Sensex jumps 225 points in early trade; turns choppy later", "description": "Share Market News Today, Sensex, Nifty, Share Prices Updates: The 30-share BSE benchmark Sensex jumped 225.08 points to 55,791.49 in early trade. The broader NSE Nifty also climbed 64.65 points to 16,649.20.", "url": "https://indianexpress.com/article/business/market/share-market-stocks-equity-bse-sensex-nse-nifty-q4-gdp-crude-oil-price-rupee-global-cues-june-1-7946630/", "urlToImage": "https://images.indianexpress.com/2022/02/bloomberg-bse-bombay-stock-exchange-1200.jpg", "publishedAt": "2022-06-01T04:40:09Z", "content": "The Sensex jumped 225 points in early trade on Wednesday, but later pared all the initial gains as volatility emerged amid mixed trends from Asian markets.The 30-share BSE benchmark Sensex jumped 225… [+1519 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Moosewala’s killing: Delhi HC to hear on Wednesday gangster Lawrence Bishnoi’s plea", "description": "Punjab Chief Minister Bhagwant Mann has announced setting up a judicial commission headed by a sitting High Court judge to probe the killing of 28-year-old Moosewala.", "url": "https://indianexpress.com/article/india/delhi/moosewalas-killing-delhi-hc-to-hear-on-wednesday-gangster-lawrence-bishnois-plea-7946677/", "urlToImage": "https://images.indianexpress.com/2022/05/lawrence-bishnoi-1.jpeg", "publishedAt": "2022-06-01T04:35:24Z", "content": "The Delhi High Court will hear on Wednesday a plea by jailed gangster Lawrence Bishnoi, who is suspected to be involved in Punjabi singer Sidhu Moosewala’s killing, claiming apprehension of a fake en… [+2287 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Construction at Puri temple: no hearing held in SC on Tuesday", "description": "The plea in the Supreme Court challenges the Orissa High Court’s May 9 order refusing to restrain the state from carrying out construction work at the temple premises, and cites a threat to the temple’s structural safety.", "url": "https://indianexpress.com/article/cities/delhi/jagannath-temple-puri-construction-supreme-court-7946688/", "urlToImage": "https://images.indianexpress.com/2022/06/puri-heritage-corridor.jpg", "publishedAt": "2022-06-01T04:33:07Z", "content": "The plea challenges the Orissa High Courts May 9 order refusing to restrain the state from carrying out construction work at the temple premises, and cites a threat to the temples structural safety.\r… [+751 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "What Ayurveda says about sipping on warm water first thing in the morning", "description": "\"Ayurveda suggests three different temperatures for drinking boiled water, depending on the body/dosha type,\" ayurvedic practitioner Dr Dixa Bhavsar wrote on Instagram", "url": "https://indianexpress.com/article/lifestyle/health/sip-warm-water-first-thing-morning-benefits-constipation-7945447/", "urlToImage": "https://images.indianexpress.com/2022/05/water_200_getty.jpg", "publishedAt": "2022-06-01T04:30:29Z", "content": "Some people prefer a hot cup of tea or coffee, while many others like to sip on lemon water after waking up. But is there a recommended way to kickstart one’s day to ensure overall health and fitness… [+1743 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "eMudhra makes a firm debut, lists at nearly 6% premium over issue price", "description": "eMudhra Stock Price List: The scrip of digital signature certificate provider eMudhra got listed at Rs 271.00 apiece on the BSE, thereby registering a gain of 5.86 per cent from its offer price of Rs 256.00.", "url": "https://indianexpress.com/article/business/market/emudhra-share-price-bse-nse-stock-market-debut-7946632/", "urlToImage": "https://images.indianexpress.com/2022/06/emudhra-ipo-shares.jpg", "publishedAt": "2022-06-01T04:25:00Z", "content": "eMudhra share price: Shares of digital signature certificate provider eMudhra debuted on a firm note and got listed at a premium of nearly 6 per cent from their issue price in the stock exchanges tod… [+2642 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gujarat Congress MLA detained for holding public meeting without police permission", "description": "The Congress leaders of Navsari had sought police permission to take out a rally raising the demands of the workers and, however, the police department denied them permission to hold a rally.", "url": "https://indianexpress.com/article/cities/surat/congress-mla-anant-patel-navsari-detained-7946675/", "urlToImage": "https://images.indianexpress.com/2022/06/gujarat-mla.png", "publishedAt": "2022-06-01T04:24:07Z", "content": "Congress MLA from Vansda Anant Patel was detained Tuesday for holding a public meeting at Lunsikui area in Navsari without police permissionto address contractual workers of Gujarat Energy Transmissi… [+1215 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Viswanathan Anand beats Maxime Vachier-Lagrave in Norway Chess tourney", "description": "The win over the French player late on Tuesday enabled the Indian GM to gain 3 points.", "url": "https://indianexpress.com/article/sports/chess/viswanathan-anand-beats-maxime-vachier-lagrave-in-norway-chess-tourney-7946656/", "urlToImage": "https://images.indianexpress.com/2022/06/Untitled-design-10.jpg", "publishedAt": "2022-06-01T04:19:33Z", "content": "Indian chess ace Viswanathan Anand defeated Maxime Vachier-Lagrave in 40 moves in the first round of the classical section of the Norway Chess tournament in Stavenger (Norway).The win over the French… [+1059 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "MNS chief Raj Thackeray surgery’s hip surgery postponed after testing positive for Covid", "description": "Raj Thackeray, who is suffering from avascular necrosis, may undergo the surgery 10 days later.", "url": "https://indianexpress.com/article/cities/mumbai/mns-chief-raj-thackeray-surgerys-hip-surgery-postponed-after-testing-positive-for-covid-7946669/", "urlToImage": "https://images.indianexpress.com/2022/06/raj0thackeray.jpeg", "publishedAt": "2022-06-01T04:16:44Z", "content": "Doctors at the Lilavati Hospital in Mumbai where Maharashtra Navnirman Sena (MNS) chief Raj Thackeray was hospitalised Tuesday decided to postpone his scheduled hip replacement surgery Wednesday afte… [+900 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "AIIMS Rajkot inaugurates clinic for treatment of tobacco addiction", "description": "“Smoking and smokeless tobacco use is a matter of public health concern in the state of Gujarat with more than 24% men and 8% women using some form of tobacco,” AIIMS, Rajkot said in an official release.", "url": "https://indianexpress.com/article/cities/rajkot/aiims-rajkot-inaugurates-clinic-for-treatment-of-tobacco-addiction-7946660/", "urlToImage": "https://images.indianexpress.com/2022/06/AIIMS-5.jpg", "publishedAt": "2022-06-01T04:16:44Z", "content": "With an aim to help those struggling with tobacco addiction, the All India Institute of Medical Sciences (AIIMS), Rajkot, inaugurated its Addiction Treatment Clinic on the occasion of the World No To… [+925 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Rachel Zegler to play Lucy Gray Baird in Hunger Games prequel", "description": "The Hunger Games: The Ballad of Songbirds and Snakes will release in theatres on November 17, 2023.", "url": "https://indianexpress.com/article/entertainment/hollywood/rachel-zegler-to-star-in-hunger-games-prequel-7946597/", "urlToImage": "https://images.indianexpress.com/2022/06/Rachel-Zegler-ap-1200by667.jpeg", "publishedAt": "2022-06-01T04:15:54Z", "content": "Fresh off her breakthrough role in Steven Spielbergs West Side Story, Rachel Zegler will star in Lionsgates planned Hunger Games prequel.The studio announced Tuesday that Zegler will play Lucy Gray B… [+1282 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Apple WWDC 2022: How to watch live stream, what to expect", "description": "Apple WWDC 2022: Apple is expected to make a number of key software announcements at the event. Here's all we know so far.", "url": "https://indianexpress.com/article/technology/tech-news-technology/apple-wwdc-2022-how-to-watch-live-stream-what-to-expect-7946659/", "urlToImage": "https://images.indianexpress.com/2022/06/Apple-WWDC-20221.jpg", "publishedAt": "2022-06-01T04:14:05Z", "content": "Apple will be kicking off its annual developer conference WWDC early next week on June 6. The Cupertino-based tech giant is also expected to make a number of new announcements during the opening keyn… [+1576 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Tamil Nadu announces kuruvai package for Cauvery Delta farmers", "description": "The package, CM MK Stalin said, would help to bring 4.90 lakh acre under kuruvai paddy cultivation and another 13.34 lakh acre under samba.", "url": "https://indianexpress.com/article/cities/chennai/tamil-nadu-announces-kuruvai-package-for-cauvery-delta-farmers-7946641/", "urlToImage": "https://images.indianexpress.com/2022/06/stalin.jpg", "publishedAt": "2022-06-01T04:12:25Z", "content": "Tamil Nadu government would extend the kuruvai paddy crop package worth Rs 61.09 crore for the Cauvery Delta farmers, as has been done in the previous year, in order to ensure increase in foodgrain p… [+3245 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "World leaders envy Modi’s connect with people on his foreign visits: Jaishankar", "description": "Jaishankar shared the \"experience of travelling around the world\" with PM Modi, whose \"schedules are legendary for being a punishment\".", "url": "https://indianexpress.com/article/cities/baroda/jaishankar-narendra-modi-book-vadodra-7946647/", "urlToImage": "https://images.indianexpress.com/2022/06/FUGrim3aUAEJSo0.jpg", "publishedAt": "2022-06-01T04:04:22Z", "content": "Union Minister of External Affairs S Jaishankar on Tuesday said that leaders across the world were “envious” of the connection Prime Minister Narendra Modi has with people at diaspora events organise… [+3481 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Abhinav Rajput", "title": "Delhi BJP interviews 15 leaders, AAP names Durgesh Pathak as Rajinder Nagar bypoll fight heats up", "description": "The seat fell vacant after area MLA Raghav Chadha was nominated by the AAP to the Rajya Sabha from Punjab.", "url": "https://indianexpress.com/article/cities/delhi/delhi-rajinder-nagar-bypoll-bjp-interviews-aap-durgesh-pathak-7946631/", "urlToImage": "https://images.indianexpress.com/2020/12/pathak.jpg", "publishedAt": "2022-06-01T04:01:20Z", "content": "The seat fell vacant after area MLA Raghav Chadha was nominated by the AAPto the Rajya Sabha from Punjab.\r\nThe BJP leaders who were interviewed for Rajinder Nagar seat the include former MLA from the… [+2332 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Avinash Nair", "title": "Gujarat: Bad loans under PM’s MUDRA scheme rise 69% in pandemic year", "description": "According to the latest available figures from State Level Banker’s Committee (SLBC), banks in Gujarat have an NPA of Rs 957 crore, 9.13 per cent of the total outstanding amount as of December 2021.", "url": "https://indianexpress.com/article/cities/ahmedabad/gujarat-bad-loans-pm-mudra-scheme-rise-69-7946618/", "urlToImage": "https://images.indianexpress.com/2022/06/banks.jpg", "publishedAt": "2022-06-01T03:52:42Z", "content": "Mehsana resident Arvind Patel, who is into the business of decorating mandaps for events and gatherings, borrowed Rs 7.2 lakh under the Pradhan Mantri MUDRA Yojana (PMMY). He used the loan to expand … [+2135 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Chennai News Live: Tamil Nadu BJP stages massive protest against DMK govt over fuel price hike", "description": "Chennai, Tamil Nadu News Live Updates Today 1 June, 2022: Tamil Nadu government directed districts to \"push for vaccination\" of those people eligible to receive the doses against Covid-19 in the wake of new infections nearing the 100 per day-mark.", "url": "https://indianexpress.com/article/cities/chennai/chennai-news-live-updates-stalin-covid-weather-dmk-aiadmk-bjp-fuel-price-7946616/", "urlToImage": "https://images.indianexpress.com/2022/06/chennai-bjp-protest.jpeg", "publishedAt": "2022-06-01T03:45:58Z", "content": "Chennai: People silhouetted against the setting sun at Broken bridge, in Chennai, Sunday, May 29. 2022. (PTI Photo)\r\nChepauk-Triplicane MLA and Tamil Nadu Chief Minister MK Stalins son Udhayanidhi St… [+1316 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Normal rainfall on forecast for monsoon over northwest India", "description": "‘Normal’ rainfall for the northwest region would be 92% to 108% of the long period average (LPA), which is 587.6 mm for the region for the season.", "url": "https://indianexpress.com/article/cities/delhi/normal-rainfall-on-forecast-for-monsoon-over-northwest-india-7946588/", "urlToImage": "https://images.indianexpress.com/2022/06/PUNE-RAIN.jpg", "publishedAt": "2022-06-01T03:43:27Z", "content": "The rainfall over northwest India this monsoon season is likely to be normal, according to the long range forecast issued by the India Meteorological Department (IMD) on Tuesday.Normal rainfall for t… [+1813 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "KK dies at 53: Singer had complained to organisers about stuffy conditions, was sweating profusely at concert", "description": "Singer KK died after suffering a suspected cardiac arrest shortly after performing live in Kolkata. He had been keeping his fans updated about his trip on social media.", "url": "https://indianexpress.com/article/entertainment/music/kk-dies-at-53-overcrowding-bad-conditions-nazrul-mancha-kolkata-7946601/", "urlToImage": "https://images.indianexpress.com/2022/06/kk-.jpg", "publishedAt": "2022-06-01T03:40:57Z", "content": "The voice of a generation, singer Krishnakumar Kunnath died at the age of 53 on Tuesday night. Popularly known as KK, the singer is suspected to have suffered a cardiac arrest, according to news agen… [+2410 chars]"}]}