{"status": "ok", "totalResults": 508, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "MoS education fails to appear before CBI despite HC order", "description": "A single bench of Justice Abhijit Gangopadhyay had on Tuesday directed the minister to \"must appear before the CBI by Tuesday evening\" for interrogation over the allegation.", "url": "https://indianexpress.com/article/cities/kolkata/mos-education-fails-to-appear-before-cbi-despite-hc-order-7924844/", "urlToImage": "https://images.indianexpress.com/2022/05/adhikari.jpg", "publishedAt": "2022-05-19T00:50:59Z", "content": "Even 24 hours after the Calcutta High Court directed him to appear before the Central Bureau of Investigation (CBI), Minister of State for School Education Paresh Chandra Adhikari is yet to visit the… [+1732 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "NREGA: Launch sit-ins for due payments, CM urges party workers", "description": "Speaking at party meetings in Midnapore and Jhargram, the Trinamool Congress chairperson said, “The central government owes Rs 97,000 crore to Bengal.\"", "url": "https://indianexpress.com/article/cities/kolkata/nrega-launch-sit-ins-for-due-payments-cm-urges-party-workers-7924829/", "urlToImage": "https://images.indianexpress.com/2022/03/Mar26-Mamata-3col-1-1-1.jpg", "publishedAt": "2022-05-19T00:35:50Z", "content": "Chief Minister Mamata Banerjee on Wednesday asked her party workers to launch dharna in several parts of West Bengal demanding due money for 100 days of guaranteed work under the Mahatma Gandhi Natio… [+1713 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Debraj Deb", "title": "Cabinet portfolios of Tripura’s Manik Saha cabinet announced", "description": "Most cabinet portfolios were retained similar to the Biplab Deb administration, except a few tweaks to accommodate the two new ministers – Rampada Jamatia and Prem Kumar Reang, who were included in the council of ministers under CM Saha.", "url": "https://indianexpress.com/article/north-east-india/cabinet-portfolios-of-tripuras-manik-saha-cabinet-announced-7924837/", "urlToImage": "https://images.indianexpress.com/2022/05/MANIK-SAHA-1-1.jpg", "publishedAt": "2022-05-19T00:35:12Z", "content": "Two days after new Tripura Chief Minister Dr. Manik Sahas 11 cabinet colleagues were sworn in at the Raj Bhawan here, the ministers for their portfolios announced this evening.Most cabinet portfolios… [+3119 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kabir Firaque", "title": "Explained: What a child’s tooth tells us about our ancient cousins", "description": "In a cave in Laos, a tooth that likely belonged to a Denisovan girl from 13,000-16,000 years ago. Little is known of Denisovans; the find sheds new light on their habitat, adaptability and interbreeding with the ancestors of modern humans.", "url": "https://indianexpress.com/article/explained/what-a-childs-tooth-tells-us-about-our-ancient-cousins-7924835/", "urlToImage": "https://images.indianexpress.com/2022/05/child-tooth.jpg", "publishedAt": "2022-05-19T00:29:11Z", "content": "Scientists have long assumed that Southeast Asia was once home to Denisovans, those ancient cousins of modern humans about whom much remains to be known. Now, the first physical evidence has emerged … [+3595 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manish Sahu", "title": "LU student held for assault on prof booked for Varanasi temple remark", "description": "On May 10, police had lodged a case against associate professor Ravi Kant, 43, for allegedly making “objectionable” remarks on the Kashi Vishwanath Temple in Varanasi. He was booked on various charges, including promoting enmity, on a complaint filed by an AB…", "url": "https://indianexpress.com/article/cities/lucknow/lu-student-held-for-assault-on-prof-booked-for-varanasi-temple-remark-7924827/", "urlToImage": "https://images.indianexpress.com/2022/05/handcuff-4-7.jpg", "publishedAt": "2022-05-19T00:19:37Z", "content": "AN associate professor of the Lucknow University (LU) was allegedly assaulted by a student on the campus on Wednesday, days after an FIR was lodged against the professor for his remarks on the Kashi … [+1783 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "CPSEs to get powers to sell arms, exit JVs", "description": "The move will give a fillip to the government’s efforts to unlock capital, which are either stuck or sub-optimally employed in state assets, and put these into more productive use.", "url": "https://indianexpress.com/article/business/cpses-to-get-powers-to-sell-arms-exit-jvs-7924831/", "urlToImage": "https://images.indianexpress.com/2022/05/diap.jpg", "publishedAt": "2022-05-19T00:19:09Z", "content": "The Union Cabinet Wednesday empowered the boards of the Central Public Sector Enterprises (CPSEs) to privatise, disinvest or close their subsidiaries and stakes in joint ventures. The move will give … [+1265 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "EPF interest income: Govt weighing requests for tweaking tax norms", "description": "The Finance Ministry will also clarify doubts on the applicability of the new tax deduction at source (TDS) provision regarding benefits or perquisites received in a business or profession.", "url": "https://indianexpress.com/article/business/epf-interest-income-govt-weighing-requests-for-tweaking-tax-norms-7924814/", "urlToImage": "https://images.indianexpress.com/2022/05/epfo-1200-1-1-1.jpg", "publishedAt": "2022-05-19T00:16:39Z", "content": "The government may consider proposals for changing norms for taxability of interest income earned by subscribers of Employees’ Provident Fund Organisation (EPFO), a senior official said. The Finance … [+1306 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "Govt to relook BPCL divestment plan post expansion", "description": "Volatility in global crude oil prices as well as periods in which state-owned oil marketing companies have had to retail fuel at a loss may have impacted investor interest in BPCL, the second-largest fuel retailer in the country.", "url": "https://indianexpress.com/article/business/govt-to-relook-bpcl-divestment-plan-post-expansion-7924822/", "urlToImage": "https://images.indianexpress.com/2022/05/bpcl-1200-1.jpg", "publishedAt": "2022-05-19T00:16:34Z", "content": "The government will relook at plans for the divestment of Bharat Petroleum Corporation Ltd (BPCL) post the completion of expansion plans at the company, a source aware of developments told reporters … [+505 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Won’t tolerate corruption, Mamata tells party leaders, warns of expulsion", "description": "Directing the party cadres at the grassroots level to say “ami noi, amra (we, not I)”, the TMC chairperson said the party leaders should work together, and their approach should be collective.", "url": "https://indianexpress.com/article/cities/kolkata/wont-tolerate-corruption-mamata-tells-party-leaders-warns-of-expulsion-7924818/", "urlToImage": "https://images.indianexpress.com/2022/05/mamata-759-1-1.jpg", "publishedAt": "2022-05-19T00:14:36Z", "content": "Trinamool Congress chairperson and Chief Minister Mamata Banerjee warned her party leaders that she would not tolerate any corruption and expel any leader from the party immediately if found indulgin… [+2075 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Constable, his friend held for ‘gangrape’ of minor in Aligarh", "description": "Police said the girl did not speak about the incident earlier as the accused had threatened to circulate the video if she told anyone about the incident.", "url": "https://indianexpress.com/article/cities/lucknow/constable-his-friend-held-for-gangrape-of-minor-in-aligarh-7924819/", "urlToImage": "https://images.indianexpress.com/2022/05/arrest1-9.jpeg", "publishedAt": "2022-05-19T00:14:18Z", "content": "ALIGARH police on Wednesday arrested a 24-year-old police constable and his friend in connection with the alleged gangrape of a teenage girl. Police said the incident came to light after videos of th… [+1504 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "UT adds 4 sq km green cover in 2 yrs", "description": "The open forest area has also seen a major increase by 158 hectares", "url": "https://indianexpress.com/article/cities/chandigarh/ut-adds-4-sq-km-green-cover-in-2-yrs-7924812/", "urlToImage": "https://images.indianexpress.com/2022/05/forest-2.jpg", "publishedAt": "2022-05-19T00:11:58Z", "content": "In recent years the people of Chandigarh may have noticed a change in greenery as the city has now more forest cover which makes it more delightful for the citizens.\r\nThe Forest Survey of India Repor… [+1654 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "Start coal imports: PowerMin to states", "description": "Power Minister RK Singh has written to chief ministers of all states which have not started the process of coal import, according to a government release.", "url": "https://indianexpress.com/article/business/start-coal-imports-powermin-to-states-7924802/", "urlToImage": "https://images.indianexpress.com/2022/05/coal-6.jpg", "publishedAt": "2022-05-19T00:07:24Z", "content": "The Centre has asked states to immediately start importing coal to meet power requirements and to lift coal by road as failure to do so may lead to shortages in such states during the monsoon.Power M… [+2643 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "28% GST on casinos, gaming: GoM finalises valuation technique", "description": "Meghalaya Chief Minister Conrad Sangma, the chairman of the panel, said the report will be submitted to Union Finance Minister Nirmala Sitharaman in a day or two and then the issue will be discussed in the next GST Council meeting.", "url": "https://indianexpress.com/article/business/28-per-cent-gst-on-casinos-gaming-gom-finalises-valuation-technique-7924811/", "urlToImage": "https://images.indianexpress.com/2022/05/GAMBLING-1.jpg", "publishedAt": "2022-05-19T00:07:16Z", "content": "The Group of Ministers on casinos, online gaming and race courses under Goods and Services Tax (GST) in a meeting held Wednesday finalised its report detailing the valuation technique and a consensus… [+2328 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Chhatbir zoo summer routine: Coolers, fans, special diets", "description": "From desert coolers, to air circulatory fans, and from mud baths, to modified shelters, the zoo management is going the whole length to provide relief to its animals and ensure that they stay cool.", "url": "https://indianexpress.com/article/cities/chandigarh/chhatbir-zoo-summer-routine-coolers-fans-special-diets-7924808/", "urlToImage": "https://images.indianexpress.com/2022/05/NL-zoo-3cols.jpg", "publishedAt": "2022-05-19T00:04:06Z", "content": "The mercury in Chandigarh is on an upward march and the UT’s Mohendra Chaudhry Zoological Park better known as Chhatbir zoo management has made adequate arrangements for its captive animals to beat t… [+1932 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manoj Dattatrye More", "title": "Sambhajiraje firm on contesting Rajya Sabha seat; Shiv Sena and BJP to fight for additional seat", "description": "\"I am firm on contesting the election as an independent candidate. I have, through a letter written to all political parties, sought their support to my candidature,\" Sambhajiraje Chhatrapati told The Indian Express on Wednesday.", "url": "https://indianexpress.com/article/cities/pune/sambhajiraje-firm-on-contesting-rajya-sabha-seat-shiv-sena-and-bjp-to-fight-for-additional-seat-7924801/", "urlToImage": "https://images.indianexpress.com/2022/03/Sambhajiraje-Chhatrapati.jpg", "publishedAt": "2022-05-19T00:02:15Z", "content": "EVEN as Sambhajiraje Chhatrapati on Wednesday insisted that he will contest Rajya Sabha elections as an independent candidate, the Shiv Sena and BJP indicated that they will also be contesting an add… [+2227 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Soumyarendra Barik", "title": "Comply with rules or exit from India: MoS IT to VPNs", "description": "While launching clarifications on CERT-In’s cybersecurity norms, he said, “ If you’re a VPN that wants to hide and be anonymous about those who use VPNs and you don’t want to go by these rules, then if you want to pull out (from the country), frankly, that is…", "url": "https://indianexpress.com/article/business/comply-with-rules-or-exit-from-india-mos-it-to-vpns-7924648/", "urlToImage": "https://images.indianexpress.com/2022/05/rajeev-chandrashekhar.jpg", "publishedAt": "2022-05-19T00:01:38Z", "content": "Minister of State for Electronics and IT Rajeev Chandrashekhar on Wednesday warned virtual private network (VPN) service providers that if they dont adhere to the latest cybersecurity rules released … [+3113 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Booster shot for Mohali in fight against drug addiction", "description": "The civil surgeon said that the purpose of opening these centers, which will remain open on a daily basis, is to provide easy and free treatment to patients who want to quit drugs", "url": "https://indianexpress.com/article/cities/sas-nagar-mohali/booster-shot-for-mohali-in-fight-against-drug-addiction-7924805/", "urlToImage": "https://images.indianexpress.com/2022/05/vax-ap.jpg", "publishedAt": "2022-05-19T00:00:07Z", "content": "A total of 17 new Outpatient Opioid Assisted Treatment (OOAT) centres were opened on Wednesday at government health institutions across Mohali, bringing the total number of such centres in the distri… [+1716 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Parul", "title": "National Family Health Survey 5: ‘Excessive milk intake a major cause of nutritional anaemia’", "description": "Anaemia is a medical condition in which red blood cell count or the Hemoglobin (Hb) is less than normal and it is caused by a decrease in the production of red blood cells.", "url": "https://indianexpress.com/article/cities/chandigarh/national-family-health-survey-5-excessive-milk-intake-a-major-cause-of-nutritional-anaemia-7924797/", "urlToImage": "https://images.indianexpress.com/2022/05/milk.jpg", "publishedAt": "2022-05-18T23:57:51Z", "content": "The data compiled by National Family Health Survey 2019-11 (NFHS-5), the fifth in the NFHS series, showed a drop of nearly 20 per cent in cases of anaemia in children between the ages of 6-59 months … [+3865 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Poonawalla Fincorp records Rs 492 crore profit in 2021-22 fiscal", "description": "The press statement issued by the company mentioned strong liquidity position with surplus of Rs 3,890 crore, which has brought down the average cost of borrowing to 7.4 per cent in the last quarter of financial year 2022.", "url": "https://indianexpress.com/article/cities/pune/poonawalla-fincorp-records-rs-492-crore-profit-in-2021-22-fiscal/", "urlToImage": "https://images.indianexpress.com/2021/11/poonawalla.jpg", "publishedAt": "2022-05-18T23:52:50Z", "content": "After reporting loss of Rs 749 crore in the financial year 2020-21, Poonawalla Fincorp Limited has reported profit of Rs 492 crore in the fiscal of 2021-22. Results of the company, which were declare… [+1753 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kamaldeep Singh Brar", "title": "Kunwar Vijay Pratap slams Amritsar admin for dragging feet in hotel collapse case", "description": "The AAP MLA went on to allege that the victims of the incident had told him that the officer assigned by the police to probe the case was close to the mafia.", "url": "https://indianexpress.com/article/cities/amritsar/kunwar-vijay-pratap-slams-amritsar-admin-for-dragging-feet-in-hotel-collapse-case-7924790/", "urlToImage": "https://images.indianexpress.com/2022/05/kunwar.jpg", "publishedAt": "2022-05-18T23:48:24Z", "content": "Aam Adami Party (AAP) MLA from Amritsar North and former IPS Kunwar Vijay Pratap has turned his gun at the local Amritsar district administration once again.Recently an under-construction hotel build… [+3986 chars]"}]}