{"status": "ok", "totalResults": 453, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Debraj Deb", "title": "Tripura University signs MoU with Centre to coach SC students for UPSC exams", "description": "One hundred students would receive free coaching for civil services exams under the Dr Ambedkar Centre for Excellence (DACE).", "url": "https://indianexpress.com/article/north-east-india/tripura/tripura-university-signs-mou-with-centre-to-coach-sc-students-for-upsc-exams-7899107/", "urlToImage": "https://images.indianexpress.com/2022/05/TRIPURA.jpg", "publishedAt": "2022-05-03T06:45:37Z", "content": "Tripura University on Monday inked a memorandum of understanding (MoU) with the central government to set up the Dr Ambedkar Centre for Excellence (DACE) to provide free coaching to students from Sch… [+938 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Met Gala 2022: Blake Lively makes Ryan Reynolds’ jaw drop, Natasha Poonawalla looks like an Eternals character", "description": "Met Gala 2022: From Ryan Reynolds' reaction to his wife Blake Lively's dress to Natasha Poonawalla's metal bustier, here are some highlights from the event.", "url": "https://indianexpress.com/article/entertainment/hollywood/met-gala-2022-blake-lively-ryan-reynolds-natasha-poonawalla-simone-ashley-7899039/", "urlToImage": "https://images.indianexpress.com/2022/05/met-gala-looks.jpg", "publishedAt": "2022-05-03T06:44:09Z", "content": "Boundaries were pushed, as usual, at the annual Met Gala, held in New York City on Tuesday morning India time. The red carpet featured the likes of Kim Kardashian and Pete Davidson, Ryan Reynolds and… [+2674 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "FIR lodged against Independent MLA Saryu Roy", "description": "The FIR was lodged against the Jamshedpur (East) MLA by under secretary of state health department Vijay Verma for allegedly leaking secret documents, police station in-charge Ramesh Kumar told PTI.", "url": "https://indianexpress.com/article/india/fir-lodged-against-independent-mla-saryu-roy-7899093/", "urlToImage": "https://images.indianexpress.com/2022/05/SARYU-ROY-1.jpg", "publishedAt": "2022-05-03T06:39:23Z", "content": "An FIR has been lodged against Jharkhand Independent MLA Saryu Roy under different sections of IPC and official secrets act at Doranda police station here for allegedly leaking secret documents, an o… [+1440 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Ranveer Singh tells Mouni Roy ‘kuch toh reham karo’ as country struggles with heat wave, recreates Sarfarosh scene with Sonali Bendre. Watch", "description": "Ranveer Singh recently shot for an episode of Dance India Dance Li'l Masters to promote his upcoming release Jayeshbhai Jordaar.", "url": "https://indianexpress.com/article/entertainment/bollywood/ranveer-singh-mouni-roy-hot-heat-wave-recreates-sarfarosh-scene-sonali-bendre-watch-7898944/", "urlToImage": "https://images.indianexpress.com/2022/05/ranveer-singh.jpg", "publishedAt": "2022-05-03T06:36:54Z", "content": "Ranveer Singh recently joined the sets of the dance reality show, Dance India Dance Li’l Masters to promote his upcoming film, Jayeshbhai Jordaar. As usual, the actor was in his element on the sets o… [+2035 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Haryana govt to distribute over 5 lakh free tablets to Class 10, 12 students from May 5", "description": "The ambitious scheme of the state government has been named 'e-learning – Advance Digital Haryana Initiative of Government with Adaptive Modules'. The tablet distribution function will be held on May 5 at the Tagore Auditorium of Maharishi Dayanand University…", "url": "https://indianexpress.com/article/education/haryana-govt-to-distribute-over-5-lakh-free-tablets-to-class-10-12-students-from-may-5-7898959/", "urlToImage": "https://images.indianexpress.com/2022/05/WhatsApp-Image-2022-05-03-at-11.48.00-AM.jpeg", "publishedAt": "2022-05-03T06:34:43Z", "content": "The Haryana government will distribute free tablets to students of classes 10-12 from May 5, an official statement said on Monday. The devices will have preloaded content along with personalised and … [+2385 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Worried Alia Bhatt runs with luggage trolley at Delhi airport. Hundreds of cameras capture moment", "description": "Alia Bhatt resumed work days after tying the knot with Ranbir Kapoor last month. She was spotted at Delhi airport shooting for a sequence in Karan Johar directed Rocky Aur Rani Ki Prem Kahani.", "url": "https://indianexpress.com/article/entertainment/bollywood/alia-bhatt-runs-with-luggage-trolley-delhi-airport-watch-7898918/", "urlToImage": "https://images.indianexpress.com/2022/05/alia-bhatt-1200.jpg", "publishedAt": "2022-05-03T06:34:14Z", "content": "Alia Bhatt seems to be throwing in all her energy into work, quite literally. The Bollywood star, who recently tied the knot with Ranbir Kapoor, returned to the shooting of her upcoming film Rocky Au… [+1486 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Double delight: Gyaneshwari Yadav clinches silver, V Rithika wins bronze in Junior World Championships", "description": "Chattisgarh lifter Gyaneshwari produced a total effort of 156kg (73kg+83kg) to take home the silver metal on Monday night. Rithika, on the other hand, heaved 6 kgs less than her compatriot -- 150kg (69kg+81kg) to bag the bronze medal in a depleted 10-lifter f…", "url": "https://indianexpress.com/article/sports/sport-others/double-delight-gyaneshwari-yadav-clinches-silver-v-rithika-wins-bronze-in-junior-world-championships-7899088/", "urlToImage": "https://images.indianexpress.com/2022/05/Gyaneshwari-Yadav-V-Rithika.jpg", "publishedAt": "2022-05-03T06:31:03Z", "content": "Gyaneshwari Yadav clinched the silver medal while compatriot V Rithika finished third to give India a double podium finish in the women’s 49kg category at the IWF Junior World Weightlifting Champions… [+2025 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "The Conversation", "title": "What is toe jam? From harmless gunk to a feast for bugs", "description": "Toe jam can have the consistency of soft cheese or cake crumbs. It can smell or be odourless. And its colour can range from white to grey-brown.", "url": "https://indianexpress.com/article/lifestyle/health/what-is-toe-jam-from-harmless-gunk-to-a-feast-for-bugs-7887961/", "urlToImage": "https://images.indianexpress.com/2022/05/feet1.jpg", "publishedAt": "2022-05-03T06:30:53Z", "content": "Toe jam can be a source of fascination, disgust or barely noticed. It can be a sign you need to wash yourfeet or rethink your choice of footwear. It can also lead to major health issues.Toe jam, the … [+4886 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pune: Leaked gas causes explosion at eatery, two injured", "description": "Pune news: Officials from Pimpri-Chinchwad fire brigade said that the incident took place at an eatery located near the Jain school around 9 am when several customers were having breakfast.", "url": "https://indianexpress.com/article/cities/pune/pune-leaked-gas-explosion-pimpri-chinchwad-7899067/", "urlToImage": "https://images.indianexpress.com/2022/05/fire-department.jpg", "publishedAt": "2022-05-03T06:16:04Z", "content": "Two workers of an eatery suffered burn injuries in an explosion caused by leaked liquified petroleum gas (LPG) in the Chinchwad area Tuesday morning. Officials from Pimpri-Chinchwad fire brigade said… [+1221 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Amazon Summer Sale, Flipkart Big Savings Day sale: Best offers on smartphones", "description": "Both Amazon and Flipkart are hosting their big summer sales, which means a big discount on phones, laptops, etc. Check out the best offers on smartphones from Amazon and Flipkart ahead of the sale dates.", "url": "https://indianexpress.com/article/technology/mobile-tabs/amazon-summer-sale-flipkart-big-savings-day-sale-best-offers-on-smartphones-7898970/", "urlToImage": "https://images.indianexpress.com/2022/05/Amazon-Flipkart-sale.jpg", "publishedAt": "2022-05-03T06:13:22Z", "content": "Amazon is hosting its Summer Sale this year from May 4 and has a lot of offers for customers looking to buy new gadgets, appliances. The sale will also include additional perks for Prime members. Mea… [+2193 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Coordination between power, coal and rail ministries is at its lowest ebb, common people suffering: Moily", "description": "States blame the sharp rise in global coal prices, which affects plants that use imported coal, and the shortage of railway rakes, he said.", "url": "https://indianexpress.com/article/india/coordination-between-power-coal-and-rail-ministries-is-at-its-lowest-ebb-common-people-suffering-moily-7899043/", "urlToImage": "https://images.indianexpress.com/2022/05/COAL22-1.jpg", "publishedAt": "2022-05-03T06:06:53Z", "content": "Amid reports of power shortage in various states, senior Congress leader M Veerappa Moily on Monday attacked the Centre, saying the coordination between power, coal and railway ministries is at its l… [+1684 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "IIT Delhi, ITC ink MoU to carry out research in STEM areas", "description": "Delhi News: Collaboration will combine cutting-edge research at IIT Delhi with application know-how of ITC, says Professor Sunil Kumar Khare, dean of research and development at IIT Delhi", "url": "https://indianexpress.com/article/cities/delhi/iit-delhi-itc-ink-mou-to-carry-out-research-in-stem-areas-7899055/", "urlToImage": "https://images.indianexpress.com/2022/05/IIT-DELHII.jpg", "publishedAt": "2022-05-03T06:05:37Z", "content": "Indian Institute of Technology (IIT) Delhi and multi-business conglomerate ITC Limited have signed a memorandum of understanding to support research in identified STEM (science, technology, engineeri… [+1586 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Doctor Strange in the Multiverse of Madness first reactions tease ‘huge surprises’, call it MCU’s first horror movie", "description": "Doctor Strange in the Multiverse of Madness first reactions call it a true horror movie with massive surprises but a disjointed plot.", "url": "https://indianexpress.com/article/entertainment/hollywood/doctor-strange-in-the-multiverse-of-madness-first-reactions-sam-raimi-benedict-cumberbatch-7898938/", "urlToImage": "https://images.indianexpress.com/2022/05/strange1200.jpg", "publishedAt": "2022-05-03T06:04:57Z", "content": "The first reactions to Marvel’s Doctor Strange in the Multiverse of Madness have arrived online immediately following its world premiere in Los Angeles. The film has massive expectations to live up t… [+3436 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Raakhi Jagga", "title": "Demand for water, cleanliness 16 farm unions in 14 districts stage dharnas outside canal dept offices", "description": "Memorandums addressed to Chief Minister Bhagwant Mann were given by unions to the executive engineers of the department at all protest sites.", "url": "https://indianexpress.com/article/cities/ludhiana/demand-for-water-cleanliness-16-farm-unions-in-14-districts-stage-dharnas-outside-canal-dept-offices-7899000/", "urlToImage": "https://images.indianexpress.com/2022/05/protest-1.jpg", "publishedAt": "2022-05-03T06:03:41Z", "content": "PROTESTING AGAINST canal water shortage and lack of cleanliness in canals, 16 farmers’ union staged dharnas at 41 places outside the offices of the canal department across 14 districts in Punjab, on … [+2712 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Touted to be the longest in the world, Vietnam opens 2,000 ft. glass-bottomed bridge to tourists", "description": "The Bach Long bridge -- meaning 'the white dragon' -- connects two mountains and hangs over a lush green valley in Vietnam's Northwest Son La Province.", "url": "https://indianexpress.com/article/lifestyle/destination-of-the-week/vietnam-opens-a-2000-ft-glass-bottomed-bridge-to-tourists-said-to-be-the-longest-in-the-world-7897301/", "urlToImage": "https://images.indianexpress.com/2022/05/bach-long.jpg", "publishedAt": "2022-05-03T06:00:04Z", "content": "Suspended nearly 500 ft. off the ground, Vietnam’s newest tourist attraction is yet another glass-bottomed bridge that is said to be the longest in the world. Stretching for about 2000 ft., the Bach … [+1364 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anjali Marar", "title": "Frequent, intense heatwaves made April third warmest in India in 122 years", "description": "Eleven meteorological stations break all-time April temperature records.", "url": "https://indianexpress.com/article/india/frequent-intense-heatwaves-made-april-third-warmest-in-india-in-122-years-7899014/", "urlToImage": "https://images.indianexpress.com/2022/05/30-VS-Heavy-Heat-in-City-01.jpg", "publishedAt": "2022-05-03T05:53:23Z", "content": "April this year ended as the third warmest over India in 122 years, the Monthly Weather and Climate summary issued by the India Meteorological Department (IMD) has said. This comes after March had re… [+2465 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi: Weeks after minor’s gang rape, police make second arrest after encounter", "description": "Delhi news: The 14-year-old was allegedly gang-raped by two men who later killed her and dumped her body in Outer Delhi’s Narela area, the police said.", "url": "https://indianexpress.com/article/cities/delhi/delhi-weeks-after-minors-gang-rape-police-make-second-arrest-after-encounter-7899017/", "urlToImage": "https://images.indianexpress.com/2022/05/arrest-1-8-8-1.jpg", "publishedAt": "2022-05-03T05:51:01Z", "content": "Nearly two and a half months after a 14-year-old minor was allegedly kidnapped, gang-raped and killed in Outer Delhis Narela area, the Delhi Police made its second arrest in the case following an enc… [+1680 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "JD(S) Lingayat face, MLC Basavaraj Horatti joins BJP during Amit Shah’s Bengaluru visit", "description": "Bangalore news: Horatti is likely to be the party candidate for the upcoming MLC polls from West Teachers’ constituency", "url": "https://indianexpress.com/article/cities/bangalore/jds-lingayat-basavaraj-horatti-bjp-amit-shah-bengaluru-7899008/", "urlToImage": "https://images.indianexpress.com/2022/05/IMG-20220503-WA0013.jpg", "publishedAt": "2022-05-03T05:49:57Z", "content": "Senior Janata Dal (Secular) leader and Karnataka Legislative Council Chairman Basavaraj Horatti Tuesday joined the BJP in the presence of Union Home Minister Amit Shah in Bengaluru. He is likely to b… [+760 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Diljit Dosanjh scolds a Twitter user who accused him of lip-syncing at a concert: ‘Don’t disrespect musicians’", "description": "Responding to the Twitter user who accused Diljit Dosanjh of lip-syncing at his concert, the actor-singer asked him to join him at the rehearsal. \"This is called hard work,\" he wrote.", "url": "https://indianexpress.com/article/entertainment/bollywood/diljit-dosanjh-scolds-twitter-user-accused-lip-syncing-dont-disrespect-musicians-7898915/", "urlToImage": "https://images.indianexpress.com/2022/05/Diljit-Dosanjh.jpg", "publishedAt": "2022-05-03T05:47:45Z", "content": "Actor-singer Diljit Dosanjh recently performed at the Born To Shine World Tour in Jalandhar, Punjab. Here, the singer was seen singing Ikk Kudi, from Udta Punjab (2016), among other songs.A fan took … [+1895 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "South Africa’s latest surge is a possible preview of pandemic’s next chapter", "description": "In South Africa, researchers estimate about 90% of the population has some immunity, in part from inoculation but largely because of previous infection.", "url": "https://indianexpress.com/article/world/south-africa-covid-surge-coronavirus-pandemic-7898993/", "urlToImage": "https://images.indianexpress.com/2022/05/Covid-Africa-variant.jpg", "publishedAt": "2022-05-03T05:40:24Z", "content": "Written by Alexandra E. PetriCoronavirus cases are surging again in South Africa, and public health experts are monitoring the situation, eager to know what is driving the spike, what it says about i… [+3315 chars]"}]}