{"status": "ok", "totalResults": 397, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Maharashtra: With roses and chocolates, students get rousing welcome as state schools reopen", "description": "Early on Wednesday, teachers of schools run by the Pune Municipal Corporation (PMC) could be seen decorating the premises with balloons and making rangolis in vibrant colours. The students were greeted with roses and chocolates as they trooped back to their s…", "url": "https://indianexpress.com/article/cities/pune/maharashtra-with-roses-and-chocolates-students-get-rousing-welcome-as-state-schools-reopen-7972493/", "urlToImage": "https://images.indianexpress.com/2022/06/Pune-school.jpg", "publishedAt": "2022-06-15T22:52:39Z", "content": "Schools across Maharashtra reopened on Wednesday after the annual summer break. State Education Minister Varsha Gaikwad had earlier announced the reopening of schools on Twitter and the direction by … [+2446 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Probe ordered into Saharanpur police ‘brutality’ video", "description": "“We have ordered an inquiry to ascertain details of the video. The SP (Saharanpur City) will conduct the investigation, and action will be taken based on the facts determined during the probe,” said Saharanpur Senior Superintendent of Police (Saharanpur) Akas…", "url": "https://indianexpress.com/article/cities/lucknow/probe-ordered-into-saharanpur-police-brutality-video-7972492/", "urlToImage": "https://images.indianexpress.com/2022/06/cop-2-1-9.jpg", "publishedAt": "2022-06-15T22:46:33Z", "content": "Saharanpur police have ordered a probe into a viral video in which a policeman can be seen beating a group of people with a stick who had allegedly been involved in the last weeks violent protests in… [+1092 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pune: Civic body fines 2 firms over incorrect property tax bills", "description": "The PMC had appointed SAAR IT Resource Pvt Ltd and Cyber Tech System and Software for carrying out GIS mapping of properties in the civic jurisdiction at the rate of Rs 339 per property.", "url": "https://indianexpress.com/article/cities/pune/pune-civic-body-fines-2-firms-over-incorrect-property-tax-bills-7972490/", "urlToImage": "https://images.indianexpress.com/2022/06/PMC-1200-1.jpg", "publishedAt": "2022-06-15T22:43:09Z", "content": "After finding discrepancies in the registration and mapping of properties in the city leading to incorrect property tax bills being delivered to citizens, the Pune Municipal Corporation (PMC) has pen… [+3162 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "PMC to install 40 CCTV cameras at chariot sites", "description": "The annual pilgrimage, known as Pandharpur waari, will begin on June 20 from Alandi and Dehu in Pune district, and travel to Pandharpur in Solapur district. Lakhs of devotees, mainly from rural parts of the state, participate in the pilgrimage and walk from P…", "url": "https://indianexpress.com/article/cities/pune/pmc-to-install-40-cctv-cameras-at-chariot-sites-7972489/", "urlToImage": "https://images.indianexpress.com/2022/06/PMC.jpg", "publishedAt": "2022-06-15T22:41:37Z", "content": "The Pune Municipal Corporation (PMC) has decided to install at least 40 CCTV cameras for the security of devotees at the two locations where the chariot of the Pandharpur pilgrimage will be stationed… [+947 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pimpri-Chinchwad: 7-year-old raped by neighbour in parking lot of housing society", "description": "A First Information Report in the case has been registered by the mother of the girl at a local police station. The incident took place on Monday night in the parking lot of one of the wings of the residential society.", "url": "https://indianexpress.com/article/cities/pune/pimpri-chinchwad-7-year-old-raped-by-neighbour-in-parking-lot-of-housing-society-7972472/", "urlToImage": "https://images.indianexpress.com/2022/06/express-photo-13-4.jpg", "publishedAt": "2022-06-15T22:34:29Z", "content": "A SEVEN-year-old girl was raped and sexually abused in the parking lot of a residential society in Pimpri-Chinchwad by a 42-year-old man who is a resident of the same neighbourhood. Police have arres… [+1018 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sukrita Baruah", "title": "DU’s maths teachers wary of syllabus under 4-year undergrad program", "description": "The draft Undergraduate Curriculum Framework was passed by the university’s statutory bodies in January, and is to be implemented from the upcoming academic session. For this, the syllabus preparation and finalisation for various programmes is currently under…", "url": "https://indianexpress.com/article/cities/delhi/dus-maths-teachers-wary-of-syllabus-under-4-year-undergrad-program-7972483/", "urlToImage": "https://images.indianexpress.com/2022/06/Exam-1.jpg", "publishedAt": "2022-06-15T22:23:27Z", "content": "Over 50 mathematics teachers from various Delhi University colleges have raised concern over the content and formulation process of the proposed syllabus for the BSc (Honours) Mathematics course unde… [+3364 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "‘Apprehension of bias’: HC on judge conduct in child custody case", "description": "Observing that it had no doubt over the integrity, neutrality, and judicial independence of the judge, a High Court single bench said that his conduct has however given a cause of ‘reasonable apprehension of bias’.", "url": "https://indianexpress.com/article/cities/delhi/apprehension-of-bias-hc-on-judge-conduct-in-child-custody-case-7972481/", "urlToImage": "https://images.indianexpress.com/2022/06/Delhi-HC-4-3.jpeg", "publishedAt": "2022-06-15T22:18:52Z", "content": "The Delhi High Court has set aside three orders passed by a family court in a child custody case after taking note of the conduct of the judge, who had shared his personal contact number with the par… [+2737 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Stop water wastage, says Haryana CM on Delhi’s demand", "description": "Delhi and Haryana have been in a tug of war over water supplies to the former through the Yamuna, even as Northwest India has seen a significant rain deficit over the past four months.", "url": "https://indianexpress.com/article/cities/delhi/stop-water-wastage-says-haryana-cm-on-delhis-demand-7972477/", "urlToImage": "https://images.indianexpress.com/2022/06/khattar-2-1.jpg", "publishedAt": "2022-06-15T22:14:11Z", "content": "Haryana Chief Minister Manohar Lal Khattar said Wednesday that Delhi should address misuse and wastage of water at its end to meet its demands.Delhi and Haryana have been in a tug of war over water s… [+1140 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Nobody wants to admit the underprivileged: HC on EWS admissions", "description": "A single bench on May 27 refused to stay the DoE order, and said irreparable loss would be caused to EWS category students if the order is stayed.", "url": "https://indianexpress.com/article/cities/delhi/nobody-wants-to-admit-the-underprivileged-hc-on-ews-admissions-7972475/", "urlToImage": "https://images.indianexpress.com/2022/06/Delhi-HC-6-1-1.jpeg", "publishedAt": "2022-06-15T22:10:00Z", "content": "Observing that nobody wants to admit underprivileged children, a vacation bench of the Delhi High Court Wednesday declined to grant any relief to a private school whose request for exemption from adm… [+1802 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Waste to energy plant starts at Ghazipur", "description": "This will help in flattening the landfill site at a faster rate, he said, adding that the height of Ghazipur landfill site has been reduced by over 15 metres.", "url": "https://indianexpress.com/article/cities/delhi/waste-to-energy-plant-starts-at-ghazipur-7972473/", "urlToImage": "https://images.indianexpress.com/2022/06/newsline-ghazi-3col.jpg", "publishedAt": "2022-06-15T22:05:25Z", "content": "The Waste to energy plant next to the Ghazipur landfill was made operational Wednesday, with a capacity to process 1,300 metric tonnes of waste per dayDelhi Lieutenant-Governor Vinai Kumar Saxena twe… [+673 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "In Covid surge, Delhi reports 1,375 cases", "description": "The daily incidence increased from 500 to over 1,000 in seven days during the current surge. To compare, it took only three days for a similar change in April when cases spiked a little after mask mandates were done away with.", "url": "https://indianexpress.com/article/cities/delhi/in-covid-surge-delhi-reports-1375-cases-7972467/", "urlToImage": "https://images.indianexpress.com/2022/06/covid-1-2.jpg", "publishedAt": "2022-06-15T21:58:24Z", "content": "The number of Covid-19 cases in the national capital shot up over the last two days, with 1,375 cases recorded on Wednesday. The positivity rate the proportion of samples tested that returned positiv… [+2030 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "June 16, 1982, Forty Years Ago: Argentina Surrenders", "description": "Argentina has surrendered. The Falklands have been liberated. The British pride, punctured by Gen. Leopoldo Galtieri by seizing control of the South Atlantic islands by force, has been retrieved.", "url": "https://indianexpress.com/article/opinion/editorials/forty-years-ago-argentina-surrenders-falkland-crisis-indira-gandhi-7972319/", "urlToImage": "https://images.indianexpress.com/2022/06/16-Jun-1982_IE_001.jpg", "publishedAt": "2022-06-15T21:51:32Z", "content": "Argentina has surrendered. The Falklands have been liberated. The British pride, punctured by Gen. Leopoldo Galtieri by seizing control of the South Atlantic islands by force, has been retrieved. As … [+651 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Hanging wires to air purifiers, revamping Kamla Nagar", "description": "As part of its market redevelopment project, the government is planning to put in place electronic guides for the market, a play zone for kids, air purifiers and EV charging points.", "url": "https://indianexpress.com/article/cities/delhi/hanging-wires-to-air-purifiers-revamping-kamla-nagar-7972462/", "urlToImage": "https://images.indianexpress.com/2022/06/kamlamkt-4col.jpg", "publishedAt": "2022-06-15T21:50:18Z", "content": "The dense tangle of overhead wires at Kamla Nagar market near the Delhi University will soon be a thing of the past, Delhis Deputy Chief Minister Manish Sisodia said Wednesday.As part of its market r… [+2707 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Ritu Sharma", "title": "Ladakh : Tourist deaths spur acclimatisation order", "description": "Ladakh Autonomous Hill Development Council (LAHDC) authorities say within less than two months of the tourist season, 11 deaths have already been reported from Leh's higher locations, including Pangong Tso lake at 4,225 metres above sea level, Changla (5,360 …", "url": "https://indianexpress.com/article/india/ladakh-tourist-deaths-spur-acclimatisation-order-7972464/", "urlToImage": "https://images.indianexpress.com/2021/12/leh-ladakh-getty-images-759.jpg", "publishedAt": "2022-06-15T21:43:15Z", "content": "High number of casualties due to altitude-related complications this years was the the trigger behind the Ladakh administration’s recent mandate of 48-hour acclimatisation for tourists.Ladakh Autonom… [+1280 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Abhishek Angad", "title": "‘Mob assaulted us after asking our names’", "description": "The attack took place in Sujata Chowk area around 8 pm on June 10, hours after a protest in the city over controversial remarks on the Prophet turned violent.", "url": "https://indianexpress.com/article/india/ranchi-violence-mob-attack-police-7972463/", "urlToImage": "https://images.indianexpress.com/2022/06/Ranchi-violence-security-bolstered-internet-restored.jpg", "publishedAt": "2022-06-15T21:38:59Z", "content": "A GROUP of men, armed with sticks and chanting slogans, stopped two brothers, who were out to buy pizza from a local outlet in Ranchi, asked them their names and then allegedly beat them up severely … [+1175 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "George Mathew", "title": "To scale up efficiency, SBI, subsidiaries reshuffle top deck", "description": "SC Setty, who had been looking after the area of retail business & digital banking until now, has been made MD (International Banking, Global Markets & Technology).", "url": "https://indianexpress.com/article/business/banking-and-finance/to-scale-up-efficiency-sbi-subsidiaries-reshuffle-top-deck-7972457/", "urlToImage": "https://images.indianexpress.com/2022/06/sbi-1200-1.jpeg", "publishedAt": "2022-06-15T21:22:08Z", "content": "State Bank of India (SBI) has undertaken a major reshuffle in the top management of the bank and its subsidiaries, in a move aimed at stepping up the efficiency levels.As part of the exercise, the po… [+2755 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Water projects in drought-prone Marathwada not Uddhav Thackeray’s priority: Fadnavis", "description": "Fadnavis was addressing the Jal Akrosh Andolan organised by the BJP in Jalna district.", "url": "https://indianexpress.com/article/cities/mumbai/water-projects-in-drought-prone-marathwada-not-uddhav-thackerays-priority-fadnavis-7972453/", "urlToImage": "https://images.indianexpress.com/2022/05/devendra-fadnavis-1.jpg", "publishedAt": "2022-06-15T21:16:01Z", "content": "The state government has stopped implementing all the water projects that were started by the BJP government, leading to a crisis in drought-prone Marathwada, said Opposition leader Devendra Fadnavis… [+100 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Soumyarendra Barik", "title": "5G closer to launch, Cabinet approves spectrum auction", "description": "Bids for 72 GHz of airwaves from Jul 26", "url": "https://indianexpress.com/article/business/commodities/5g-closer-to-launch-cabinet-approves-spectrum-auction-7972450/", "urlToImage": "https://images.indianexpress.com/2022/06/5G-main-11.jpg", "publishedAt": "2022-06-15T21:12:08Z", "content": "Taking the first step towards rolling out 5G services, the government has invited bid applications for spectrum auctions starting July 26 (changed from next month) after the Union Cabinet on Wednesda… [+4610 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Omkar Gokhale", "title": "Bombay HC grants bail to Jharkhand man booked in fake currency case", "description": "The court held that “merely because the mobile number of the appellant was found in the mobile handset of co-accused, that in itself, will not enable it to draw any adverse inference, particularly, in absence of any retrieval of chats having taken place, purp…", "url": "https://indianexpress.com/article/cities/mumbai/bombay-hc-grants-bail-to-jharkhand-man-booked-in-fake-currency-case-7972448/", "urlToImage": "https://images.indianexpress.com/2022/04/Bombay-hC-1-2-1.jpg", "publishedAt": "2022-06-15T21:01:02Z", "content": "THE BOMBAY High Court recently granted bail to a businessman from Jharkhand, who was booked by the NIA in a fake currency conspiracy case in 2020, stating that merely the mobile number of the appella… [+3269 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Omkar Gokhale", "title": "Bombay HC quashes proceedings against woman found with live cartridge at airport", "description": "A division bench of Justice S S Shinde and Justice M N Jadhav observed that “possession of live cartridge in petitioner's hand bag could not mean that she was in conscious possession and further in the absence of recovery of any firearm or weapon, benefit of …", "url": "https://indianexpress.com/article/cities/mumbai/bombay-hc-quashes-proceedings-against-woman-found-with-live-cartridge-at-airport-7972447/", "urlToImage": "https://images.indianexpress.com/2022/05/BOMBAY-HC.jpg", "publishedAt": "2022-06-15T20:55:51Z", "content": "THE BOMBAY High Court on Wednesday quashed and set aside criminal proceedings initiated under Arms Act against a woman from Sangli after a live cartridge was detected and recovered from her hand bagg… [+1838 chars]"}]}