{"status": "ok", "totalResults": 505, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Avaneesh Mishra", "title": "Explained: Why the Char Dham Yatra is a risky pilgrimage", "description": "Tough terrains, high altitudes and changing weather conditions make the pilgrimage a tough one, especially for senior citizens. Here’s what you should do before planning to embark on the trip", "url": "https://indianexpress.com/article/explained/explained-why-the-char-dham-yatra-is-a-risky-pilgrimage-7917034/", "urlToImage": "https://images.indianexpress.com/2022/05/char-dham.jpg", "publishedAt": "2022-05-14T08:42:41Z", "content": "Since the start of the Char Dham Yatra in Uttarakhand on May 3, at least 23 pilgrims have died en route, mainly due to cardiac-related issues like heart attack, hypertension, or other comorbidities. … [+6293 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "‘Can’t believe I still get work’: Simon Doull shuts down troll on Twitter", "description": "Simon Doull, 52, is currently commentating in the Indian Premier League (IPL) 2022 as a broadcaster.", "url": "https://indianexpress.com/article/sports/cricket/cant-believe-i-still-get-work-simon-doull-shuts-down-troll-on-twitter-7916985/", "urlToImage": "https://images.indianexpress.com/2021/02/simon-doull.jpg", "publishedAt": "2022-05-14T08:40:17Z", "content": "Former New Zealand international and current commentator Simon Doull slammed a social media user, who tried to troll him on Friday. Doull took to Twitter and shared a screenshot of an obnoxious image… [+1638 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Dia Mirza on her son Avyaan Azaad’s first birthday: ‘We are amazed and amused that your first spoken word is…’", "description": "Dia Mirza, in a heartfelt post on Instagram, shared the health scares that her son, Avyaan Azaad, fought before he could come home. Avyaan turns one today.", "url": "https://indianexpress.com/article/entertainment/bollywood/dia-mirza-on-her-son-avyaan-azaads-first-birthday-we-are-amazed-and-amused-that-your-first-spoken-word-is-7916960/", "urlToImage": "https://images.indianexpress.com/2022/05/Dia-Mirza-with-son-Avyaan-Azaad.jpg", "publishedAt": "2022-05-14T08:39:29Z", "content": "Actor Dia Mirzaon Saturday took to her social media platforms to wish her son, Avyaan Azaad Rakhi, on his first birthday. Avyaan was born three months premature and had several health risks before he… [+1925 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Cryptocurrencies melt down in a ‘Perfect Storm’ of fear and panic", "description": "The crypto world went into a full meltdown this week in a sell-off that graphically illustrated the risks of the experimental and unregulated digital currencies.", "url": "https://indianexpress.com/article/technology/tech-news-technology/cryptocurrencies-melt-down-in-a-perfect-storm-of-fear-and-panic-7917017/", "urlToImage": "https://images.indianexpress.com/2022/05/NYT-Crypto-.jpg", "publishedAt": "2022-05-14T08:39:06Z", "content": "Written by David Yaffe-Bellany, Erin Griffith and Ephrat Livni\r\nThe price of bitcoin plunged to its lowest point since 2020. Coinbase, the large cryptocurrency exchange, tanked in value. A cryptocurr… [+7083 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Academy Awards announces date for 2023 ceremony Los Angeles, May 14", "description": "Academy Awards 2023 ceremony will take place at the Dolby Theatre at Ovation Hollywood and will air live on ABC in more than 200 territories around the world.", "url": "https://indianexpress.com/article/entertainment/hollywood/academy-awards-announces-date-for-2023-ceremony-los-angeles-may-14-7917037/", "urlToImage": "https://images.indianexpress.com/2022/05/Oscars.jpeg", "publishedAt": "2022-05-14T08:38:46Z", "content": "The 95th edition of the Academy Awards will take place on March 13, 2023, the organisers have announced. The Academy of Motion Picture Arts and Sciences (AMPAS) shared the news in a statement, also r… [+507 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "How North Korea’s Covid-19 outbreak could ignite a major health crisis", "description": "Experts said that so far the pace of testing suggests North Korea cannot handle the number of symptomatic cases it has reported.", "url": "https://indianexpress.com/article/world/north-korea-coronavirus-outbreak-health-crisis-7917014/", "urlToImage": "https://images.indianexpress.com/2022/05/covid-5.jpg", "publishedAt": "2022-05-14T08:30:32Z", "content": "North Korea’s admission that it is battling an “explosive” COVID-19 outbreak has raised concerns that the virus could devastate a country with an under-resourced health system, limited testing capabi… [+4906 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Sanjay Raut bats for ‘one country, one language’, says Hindi is spoken across India and has acceptability", "description": "Mumbai news: \"Union Home Minister Amit Shah should accept this challenge that there should be one language in all states. One country, one Constitution, one nishan (emblem/symbol) and one language should be there,\" Sanjay Raut said.", "url": "https://indianexpress.com/article/cities/mumbai/sanjay-raut-bats-for-one-country-one-language-says-hindi-is-spoken-across-india-and-has-acceptability-7917022/", "urlToImage": "https://images.indianexpress.com/2022/05/sanjay-raut-2.jpg", "publishedAt": "2022-05-14T08:28:33Z", "content": "Making a pitch for “one country, one language”, Shiv Sena leader Sanjay Raut on Saturday said Hindi is spoken across India and has acceptability, and added that Union minister Amit Shah should accept… [+2821 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "MP: Man beheads uncle over black magic suspicion, walks on street with severed head and axe in hands", "description": "After the killing, the accused started walking towards to the police station by holding the severed head and the axe in his hands, but the cops arrested him midway after being alerted, said Jamodi police station in-charge Sheshmani Mishra.", "url": "https://indianexpress.com/article/cities/bhopal/mp-man-beheads-uncle-over-black-magic-suspicion-walks-on-street-with-severed-head-and-axe-in-hands-7916988/", "urlToImage": "https://images.indianexpress.com/2020/11/Crime-2.jpg", "publishedAt": "2022-05-14T08:21:47Z", "content": "A man allegedly beheaded his 60-year-old maternal uncle over black magic suspicion and walked around two kilometers with his severed head and axe in hands in Sidhi district of Madhya Pradesh before b… [+1296 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Sri Lanka to receive 65,000MT of urea from India", "description": "Moragoda thanked Chaturvedi for India's decision to supply 65,000 MT of urea required for the current Yala cultivation season in Sri Lanka, the High Commission of Sri Lanka in New Delhi said in a message.", "url": "https://indianexpress.com/article/world/sri-lanka-to-receive-65000mt-of-urea-from-india-7916996/", "urlToImage": "https://images.indianexpress.com/2022/05/sri-lanka-flag.jpg", "publishedAt": "2022-05-14T08:20:04Z", "content": "India has assured Sri Lanka to immediately supply 65,000 metric tonnes of urea to avoid any disruption in paddy cultivation in this country, as it faces the worst economic crisis in its post-independ… [+4499 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Ambati Rayudu announces retirement from IPL, and then deletes tweet", "description": "I am happy to announce that this will be my last IPL. I have had a wonderful time playing it and being a part of 2 great teams for 13 years, Ambati Rayudu wrote on Twitter before deleting his tweet.", "url": "https://indianexpress.com/article/sports/ipl/ambati-rayudu-announces-retirement-from-ipl-and-then-deletes-tweet-7916951/", "urlToImage": "https://images.indianexpress.com/2022/05/Ambati-Rayudu.jpg", "publishedAt": "2022-05-14T08:15:51Z", "content": "Chennai Super Kings (CSK) middle-order batsman Ambati Rayudu on Saturday has announced his retirement from the Indian Premier League (IPL), but he later deleted the tweet.“I am happy to announce that… [+3465 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Protests triggered by rising food prices spread in Iran", "description": "Security forces attacked protesters with batons and tear gas and shot bullets in the air in several cities, according to activists, videos shared online and Persian news channels.", "url": "https://indianexpress.com/article/world/protests-triggered-by-rising-food-prices-spread-in-iran-7916923/", "urlToImage": "https://images.indianexpress.com/2022/05/Iran.jpg", "publishedAt": "2022-05-14T08:12:36Z", "content": "Protests against the government spread to at least six provinces in Iran on Friday following several days of sporadic unrest sparked by rising food prices, according to witnesses and videos posted on… [+5148 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "The unlikely ascent of New York’s compost champion", "description": "Morales, a doe-eyed, vibrant 30-year-old once known on the street as “Reckless,” is on a mission to make composting cool, by which he means accessible to everyone, by which he means the people he grew up around in hard-bitten neighborhoods in New York City.", "url": "https://indianexpress.com/article/world/the-unlikely-ascent-of-new-yorks-compost-champion-7916958/", "urlToImage": "https://images.indianexpress.com/2022/05/compost-power.jpg", "publishedAt": "2022-05-14T08:06:40Z", "content": "There were good reasons Domingo Morales, a city kid from the Bronx, didnt want to try his hand at urban farming. He was terrified of germs. He thought vegetables were disgusting. Plus, everyone knows… [+9092 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Mahender Singh Manral", "title": "Mundka Fire: Cops identify 6 bodies, consider conducting DNA tests on some", "description": "Families of those trapped first started receiving distress calls around 4.45 pm, around the same time locals in the area spotted plumes of smoke, and then the flames engulfed the building.", "url": "https://indianexpress.com/article/cities/delhi/mundka-fire-cops-identify-6-bodies-dna-tests-7916976/", "urlToImage": "https://images.indianexpress.com/2022/05/Mundka-fire-1.jpg", "publishedAt": "2022-05-14T08:05:16Z", "content": "A day after 27 people died inside a four-storey commercial building near Mundka Metro station, the Delhi Police identified six of them and the identification process of other bodies is on. The police… [+2125 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Vladimir Putin, family man", "description": "Vladimir Putin did not like the prying. Now, as nations impose sanctions on those closest to him, the facade is beginning to crumble, shedding new light on the Russian leader’s private life.", "url": "https://indianexpress.com/article/world/russia-president-vladimir-putin-family-7916846/", "urlToImage": "https://images.indianexpress.com/2022/05/putin-1200.jpg", "publishedAt": "2022-05-14T08:03:07Z", "content": "Vladimir Putin did not like the prying.\r\nIt was 2008, and the Russian president, then 56 and eight years into his tightening grip on power, stood for a news conference in Sardinias lavish Villa Certo… [+16946 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "Jamia Milia Islamia extends registration deadline for UG, PG courses: Check details here", "description": "Candidates have time till May 25, 2022 to apply for the UG and PG courses in Jamia Milia Islamia. Interested candidates can visit the Jamia's official website — jmi.ac.in — to apply for these UG and PG courses.", "url": "https://indianexpress.com/article/education/jamia-milia-islamia-extends-registration-deadline-for-ug-pg-courses-check-details-here-jmi-ac-in-7916935/", "urlToImage": "https://images.indianexpress.com/2022/05/Jamia-Milia-Islamia.jpg", "publishedAt": "2022-05-14T08:00:38Z", "content": "The Jamia Millia Islamia has extended the registration deadline for JMI undergraduate, postgraduate admission 2022. Now, candidates have time till May 25, 2022 to apply for the UG and PG courses in J… [+1249 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gyanvapi mosque case: First day of survey concludes amid high security", "description": "Inspection of the complex began at 8 am and ended at noon. Varanasi police commissioner Satish Ganesh said the action of the court-appointed commission will continue on Sunday.", "url": "https://indianexpress.com/article/cities/lucknow/gyanvapi-mosque-case-first-day-of-survey-concludes-amid-high-security-7916967/", "urlToImage": "https://images.indianexpress.com/2021/04/Gyanvapi-Mosque.jpg", "publishedAt": "2022-05-14T07:57:09Z", "content": "The first day of the court-ordered videography survey of the Kashi Vishwanath temple-Gyanvapi mosque complex in Varanasi concluded on Saturday.Inspection of the complex began at 8 am and ended at noo… [+2091 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Two-day long Rishikesh Music Festival commences today; all you need to know", "description": "The line-up of the annual music festival held in the Himalayan foothill area of Rishikesh besides river Ganga includes a mix of established and emerging sub-continental and global artistes", "url": "https://indianexpress.com/article/lifestyle/art-and-culture/rishikesh-music-festival-details-timings-artists-kailash-kher-uttarakhand-tourism-7916859/", "urlToImage": "https://images.indianexpress.com/2022/05/music-festival-1200.jpg", "publishedAt": "2022-05-14T07:55:06Z", "content": "From Kailash Kher and Baba Kutani to Bahauddin Dagar and Indian Jam Project, several acclaimed music artisteswill participate in Rishikesh’s two-day music festival, starting today. To be held on May … [+1319 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Karnataka Bitcoin case: ED probes foreign transactions of hacker Srikrishna’s brother", "description": "The central agency has not received satisfactory replies with regard to 50,000 British pounds (around Rs 47 lakh) received by the hacker’s Netherlands-based brother Sudarshan Ramesh in his account.", "url": "https://indianexpress.com/article/cities/bangalore/karnataka-bitcoin-case-ed-probes-foreign-transactions-of-hacker-srikrishnas-brother-7916962/", "urlToImage": "https://images.indianexpress.com/2022/05/Sirki.jpeg", "publishedAt": "2022-05-14T07:53:26Z", "content": "The ED has not received satisfactory responses with regard to an amount of 50,000 British pounds (around Rs 47 lakh) received by the hackers brother Sudarshan Ramesh in his account resulting in the c… [+3772 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Will clay king Rafael Nadal grace Roland Garros?", "description": "With French Open just a fortnight away, Rafael Nadal was downbeat after struggling with a foot injury during his Italian Open loss to Denis Shapovalov", "url": "https://indianexpress.com/article/sports/tennis/rafael-nadal-roland-garros-injuries-7916938/", "urlToImage": "https://images.indianexpress.com/2022/05/nadal-1.jpg", "publishedAt": "2022-05-14T07:52:40Z", "content": "Quick and dominant in the first set against Denis Shapovalov, Rafael Nadal was quite the opposite down the stretch at the Italian Open on Thursday night.Late to the ball. Limping between points. Grim… [+5679 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Suanshu Khurana", "title": "When Pasoori dancer Sheema Kermani used sari and dance to defy Zia regime in Pakistan", "description": "Kermani, trained in Hindustani classical forms in India, brought dance to people against all odds, and fought for women’s rights", "url": "https://indianexpress.com/article/express-sunday-eye/when-pasoori-dancer-sheema-kermani-used-sari-and-dance-to-defy-zia-regime-in-pakistan-7916813/", "urlToImage": "https://images.indianexpress.com/2022/05/Sheema-performing-at-Fano-Italy-1200.jpg", "publishedAt": "2022-05-14T07:51:47Z", "content": "In Pasoori (meaning conflict), Coke Studios recent music video in Technicolor that has India and Pakistan bonding over its Punjabi lyrics and pulsating rhythm, one spots a dancer, in a big black bind… [+7579 chars]"}]}