{"status": "ok", "totalResults": 665, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Chandigarh’s architectural heritage: French envoy assures support for restoration and conservation", "description": "Emmanuel Lenain, while interacting with the Administrator, said that the two countries have shared good working relations, and added that finding new solutions in area of mutual interest would further help in strengthen relations.", "url": "https://indianexpress.com/article/cities/chandigarh/chandigarh-architectural-heritage-french-envoy-support-restoration-conservation-7917784/", "urlToImage": "https://images.indianexpress.com/2022/05/emmnuel-2.jpg", "publishedAt": "2022-05-14T22:49:55Z", "content": "The French Ambassador to India, Emmanuel Lenain, called on the Punjab Governor and UT Administrator, Banwarilal Purohit on Saturday during his visit to Chandigarh. The Ambassador assured their suppor… [+2988 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "In search of a house for Mr Wrong Caste", "description": "A joint study from 2015 to 2017, conducted by Savitribai Phule Pune University, Jawaharlal Nehru University and the Indian Institute of Dalit Studies shows that 22.3 per cent of forward caste (FC) Hindus own 41 per cent of the country’s wealth.", "url": "https://indianexpress.com/article/opinion/columns/caste-division-dalits-urbanisation-wealth-7917638/", "urlToImage": "https://images.indianexpress.com/2022/05/real-estate.jpg", "publishedAt": "2022-05-14T22:30:58Z", "content": "Exhorting Dalits to urbanise, Babasaheb Ambedkar had famously said What is a village but a sink of localism, a den of ignorance, narrow mindedness and communalism. While several positive strides have… [+4084 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "Infra for 5G rollout: GatiShakti Sanchar for RoW nod launched", "description": "The GatiShakti Sanchar portal will enable centralised right of way (RoW) approvals for telecom infrastructure projects and can be used by industry players to apply for RoW approvals, including for 5G services.", "url": "https://indianexpress.com/article/business/infra-for-5g-rollout-gatishakti-sanchar-for-row-nod-launched-7917721/", "urlToImage": "https://images.indianexpress.com/2022/05/Ashwini-Vaishnaw-.jpg", "publishedAt": "2022-05-14T22:30:44Z", "content": "Union Minister Ashwini Vaishnaw on Saturday said that legal backing for right of way (RoW) for telecom infrastructure projects will be put in place by December this year, as he launched the GatiShakt… [+2591 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tavleen Singh", "title": "Small things that matter", "description": "When I asked myself why Narendra Modi who has paid so much attention to rectifying negligence of many kinds during Congress rule, I noticed that Gujarat and Uttar Pradesh were the worst offenders when it came to malnutrition in infants.", "url": "https://indianexpress.com/article/opinion/columns/hindutva-communalism-taj-mahal-nfhs-7917708/", "urlToImage": "https://images.indianexpress.com/2022/01/hindu-2.jpg", "publishedAt": "2022-05-14T22:30:37Z", "content": "Once more last week the bulldozers rolled in Delhi destroying the lives and dreams of ordinary people. Once more battles raged over which mosque was once a Hindu temple. Into this rectification of hi… [+4967 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "P Chidambaram", "title": "Good, bad and doubtful", "description": "The big, breaking, bad news is that a little more than one-half of India’s population did not complete 10 years of school education — 59 per cent of women and 49. 8 per cent of men.", "url": "https://indianexpress.com/article/opinion/columns/nfhs-5-data-literacy-health-7917613/", "urlToImage": "https://images.indianexpress.com/2022/05/YOUTH.jpg", "publishedAt": "2022-05-14T22:30:24Z", "content": "The National Family Health Survey-5 was conducted during 2019-21. The previous survey (NHFS-4) was conducted in 2015-16. Both were periods when the NDA government was in office; therefore the changes… [+4960 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Leher Kala", "title": "The toxic glare of limelight", "description": "There is a tendency to believe that those born with the proverbial silver spoon are happily insulated from the vagaries of life.", "url": "https://indianexpress.com/article/opinion/columns/rahul-gandhi-nightclub-limelight-toxic-glare-7917709/", "urlToImage": "https://images.indianexpress.com/2022/04/pti3_31_2019_000164a.jpg", "publishedAt": "2022-05-14T22:30:23Z", "content": "In the last 10 days, the lurid fascination for Rahul Gandhis private life has spurred Op-Ed pieces in newspapers, righteous Tweets and drawing room debates on what exactly constitutes propriety for p… [+3659 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Leena Misra", "title": "MSU, where freedom was once a lived reality", "description": "Acharya Vinoba Bhave, Dadasaheb Phalke, Babasaheb Ambedkar, Kanhaiyalal Munshi, former RBI governor I G Patel and the 2009 Nobel laureate Venkatraman Ramakrishnan are among the university’s distinguished alumni.", "url": "https://indianexpress.com/article/opinion/columns/msu-baroda-history-art-exhibition-attack-7917705/", "urlToImage": "https://images.indianexpress.com/2022/05/MSU-.jpg", "publishedAt": "2022-05-14T22:30:21Z", "content": "A distinct memory for any visitor to Vadodara is likely to be of students of Maharaja Sayajirao University of Baroda (MSUB) with their sketch pads and pencils at the railway station, at Kamatibaug (n… [+5546 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manish Sahu", "title": "Azam Khan’s PRO externed from Rampur district for six months: ADM", "description": "Rampur Additional District Magistrate (ADM) Lalta Prasad said, “Based on four cases lodged against Ali, the UP Goondas Act has been invoked against him, and he has been externed from the district for six months.”", "url": "https://indianexpress.com/article/cities/lucknow/azam-khans-pro-externed-from-rampur-district-for-six-months-adm-7917780/", "urlToImage": "https://images.indianexpress.com/2022/05/Azam-Khan-1200.jpg", "publishedAt": "2022-05-14T22:21:34Z", "content": "Fasahad Ali Khan Shanu,a close aide and Public Relation Officer (PRO) of jailed Samajwadi Party leader and Rampur MLA Azam Khan, has been externed from Rampur district for six months under the Uttar … [+2756 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Power connections in two projects: Punjab and Haryana HC orders freezing Rs 3.65-cr in account of Bajwa Developer", "description": "The division Bench is hearing petitions filed by Avinder Kumar Kalsy and others (residents of Sector-123, Mohali), and Sukhjinder Singh and others (residents of Sunny Basant- Sector 117). Both the projects have been sold by Bajwa Developer Group.", "url": "https://indianexpress.com/article/cities/sas-nagar-mohali/power-connections-in-two-projects-punjab-and-haryana-hc-orders-freezing-rs-3-65-cr-in-account-of-bajwa-developer-7917782/", "urlToImage": "https://images.indianexpress.com/2022/05/Indian-express-1-3-11.jpg", "publishedAt": "2022-05-14T22:05:44Z", "content": "The Punjab and Haryana High Court has ordered the freezing of around Rs 3.65 crore in the bank account of Bajwa Developer Group for setting up permanent electricity connections at two housing project… [+3209 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Chandigarh: Four CBI men sent to 14 day judicial custody", "description": "Investigators said that two more men involved in the case continue to remain absconding and a hunt had been launched to arrest them.", "url": "https://indianexpress.com/article/cities/chandigarh/chandigarh-cbi-men-14-day-judicial-custody-7917779/", "urlToImage": "https://images.indianexpress.com/2022/05/Indian-express-1-3-10.jpg", "publishedAt": "2022-05-14T21:50:47Z", "content": "Four CBI sub-inspectors (SIs), who had been dismissed and arrested for allegedly trying to extort a sum of Rs 1 crore from a UT-based entrepreneur on May 12, were remanded to 14 days of judicial cust… [+1013 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Gargi Verma", "title": "Raipur Chopper crash: Congress, BJP caught in blame game", "description": "On Friday, even as a DGCA team landed in Raipur to probe the accident, Congress spokesperson Sushil Anand Shukla said the BJP was deliberately trying to politicise the death of two pilots and defame them.", "url": "https://indianexpress.com/article/india/chopper-crash-congress-bjp-caught-in-blame-game-7917773/", "urlToImage": "https://images.indianexpress.com/2022/05/Chopper-crash.jpeg", "publishedAt": "2022-05-14T21:47:14Z", "content": "The death of two pilots in a state government-owned chopper crash in Chhattisgarhs Raipur on Thursday has turned into a political controversy with both ruling Congress and opposition BJP levelling ch… [+1170 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Second National Lok Adalat: Over a crore cases settled across Haryana", "description": "The Lok Adalat was organised under the guidance of Justice Augustine George Masih, Judge, Punjab and Haryana High Court and Executive Chairman, Haryana State Legal Services Authority across Haryana.", "url": "https://indianexpress.com/article/cities/chandigarh/second-national-lok-adalat-crore-cases-settled-haryana-7917777/", "urlToImage": "https://images.indianexpress.com/2022/05/Gavel-18.jpg", "publishedAt": "2022-05-14T21:46:34Z", "content": "The Haryana State Legal Services Authority organised its second National Lok Adalat in 22 Districts and 33 sub-divisions of Haryana.As many as 1,10,324 cases were settled.\r\nThe Lok Adalat was organis… [+2075 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Chandigarh: Two booked for stealing three rental cars", "description": "Sources said Lovely and Jagjeet had taken the three four-wheelers on rent from Ajay Mittal in December 2021. They paid the rent for the first two months but then stopped making the payments.", "url": "https://indianexpress.com/article/cities/chandigarh/chandigarh-two-booked-stealing-three-rental-cars-7917775/", "urlToImage": "https://images.indianexpress.com/2022/05/arrest-13.jpg", "publishedAt": "2022-05-14T21:39:17Z", "content": "Two men were booked for stealing three vehicles including two SUVs Endeavor, Innova and one Brezza after taking them on rent from Sector 45. They were identified as Lovely Mehta alias Sunny Mehta and… [+108 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Caused by stubble burning: Fire engulfs 45 huts in Dera Bassi, kills toddler", "description": "According to the police, the incident occurred around 3 pm when a farmer was burning stubble.", "url": "https://indianexpress.com/article/cities/sas-nagar-mohali/stubble-burning-fire-engulfs-huts-dera-bassi-kills-toddler-7917768/", "urlToImage": "https://images.indianexpress.com/2022/05/NL-fire-3col.jpg", "publishedAt": "2022-05-14T21:33:39Z", "content": "A toddler was killed and another was seriously injured after a fire broke out in Sundran village near Dera Bassi Saturday. The fire, reportedly caused by stubble being burnt nearby, gutted at least 4… [+1007 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Kashi Vishwanath-Gyanvapi case: Video survey resumes amid tight security", "description": "The inspection began at 8 am and ended at noon, amid heavy police force deployment and elaborate arrangements near the complex.", "url": "https://indianexpress.com/article/cities/lucknow/kashi-vishwanath-gyanvapi-case-video-survey-tight-security-7917769/", "urlToImage": "https://images.indianexpress.com/2022/05/Gyanvapi-survey.jpg", "publishedAt": "2022-05-14T21:28:43Z", "content": "A Court-ordered videographic survey of the Kashi Vishwanath temple-Gyanvapi mosque complex in Varanasi resumed on Saturday, with officials saying that more than 50 per cent of the area that has to be… [+2063 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Nandigram post-poll violence: CBI summons 9 TMC members", "description": "They were asked by the central investigating agency to appear at its temporary office in Haldia in connection with the case. Taher, however, evaded the summons.", "url": "https://indianexpress.com/article/cities/kolkata/nandigram-post-poll-violence-cbi-summons-9-tmc-members-7917766/", "urlToImage": "https://images.indianexpress.com/2022/05/CBI-2.jpg", "publishedAt": "2022-05-14T21:14:14Z", "content": "The CBI on Saturday summoned nine TMC members, including party leader Abu Taher, in connection with a case of post-poll violence in Nandigram.They were asked by the central investigating agency to ap… [+1057 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Muslims lost Babri Masjid, won’t lose another mosque: Asaduddin Owaisi on Gyanvapi", "description": "Owaisi also alleged that the Opposition was being silent on the issue of Gyanvapi mosque, located near the Kashi Vishwanath temple in Varanasi, as the Muslim community is not their vote bank.", "url": "https://indianexpress.com/article/cities/ahmedabad/muslims-babri-masjid-wont-lose-gyanvapi-mosque-asaduddin-owaisi-7917765/", "urlToImage": "https://images.indianexpress.com/2022/05/Owaisi-2.jpg", "publishedAt": "2022-05-14T21:07:01Z", "content": "Days after a local court in Varanasi ordered completion of videography survey of Gyanvapi mosque in Uttar Pradesh, Asaduddin Owaisi, president of All India Majlis-e-Ittehadul Muslimeen (AIMIM), on Sa… [+2672 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Harikishan Sharma", "title": "Centre cuts wheat allocation to 10 states under NFSA", "description": "The 10 states of which wheat allocation has been revised downward under the NFSA are: Bihar, Jharkhand, Odisha, West Bengal, Delhi, Uttar Pradesh, Gujarat, Maharashtra, Madhya Pradesh and Tamil Nadu and these accounts about 67 per cent (or 55.14 crore) of 81.…", "url": "https://indianexpress.com/article/india/centre-cuts-wheat-allocation-10-states-nfsa-7917763/", "urlToImage": "https://images.indianexpress.com/2022/05/India-Wheat.jpg", "publishedAt": "2022-05-14T21:00:52Z", "content": "Days after it cut the wheat allocation under the Pradhan Mantri Garib Kalyan Anna Yojana in the wake of grain’s dwindling availability due to lower opening stock, sluggish procurement and aggressive … [+4248 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Surat: Firm that runs RoPax ferry ‘duped’ of Rs 67 lakh", "description": "According to police, on February 10, Indigo Seaways received a communication from another e-mail address demanding the payment dues of Rs 67.79 lakh.", "url": "https://indianexpress.com/article/cities/surat/surat-firm-runs-ropax-ferry-duped-rs-67-lakh-7917762/", "urlToImage": "https://images.indianexpress.com/2022/05/RoPax-vessel.jpg", "publishedAt": "2022-05-14T20:56:37Z", "content": "An investigation has begun after Surat-based Indigo Seaways Company running RoPax ferry services between Hazira in Surat to Ghogha in Bhavnagar filed a complaint that it was allegedly defrauded of Rs… [+1659 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Avinash Nair", "title": "Ten firms bid for last section of Phase-2 of Ahmedabad Metro", "description": "The last section of Phase-2 is over 7.5 kilometres long and will help extend the North-South Corridor of Ahmedabad Metro from Narendra Modi Stadium at Motera to Mahtma Mandir in Gandhinagar city.", "url": "https://indianexpress.com/article/cities/ahmedabad/firms-bid-last-section-phase-2-ahmedabad-metro-7917759/", "urlToImage": "https://images.indianexpress.com/2022/05/ahmedabad-metro-759.jpg", "publishedAt": "2022-05-14T20:50:35Z", "content": "At least 10 firms have placed bids for constructing the final portion of Phase-2 of Ahmedabad Metro at an estimated cost of Rs 600 crore, sources in Gujarat Metro Rail Corporation (GMRC) said.The las… [+1889 chars]"}]}