{"status": "ok", "totalResults": 369, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Kanchan Vasdev", "title": "With GST grant set to end, Punjab’s AAP regime stares at tough times ahead", "description": "The revenue shortfall comes at a time when the AAP is looking to come good on its pre-poll promises of different freebies to voters.", "url": "https://indianexpress.com/article/cities/chandigarh/with-gst-grant-set-to-end-punjabs-aap-regime-stares-at-tough-times-ahead-7903499/", "urlToImage": "https://images.indianexpress.com/2022/05/Mann-1.jpg", "publishedAt": "2022-05-06T00:49:00Z", "content": "Saddled with a debt of Rs 3 lakh crore it inherited from the previous regime, Punjab’s Aam Aadmi Party government is staring at a financial crisis with Centre set to stop the GST compensation grant f… [+3329 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anju Agnihotri Chaba", "title": "Punjab wheat mandi purchases hit 15-year high, but farmers struggle to recover costs", "description": "The lower premium over MSP that the farmers in Punjab are receiving is being attributed to the high levies payable on grain purchases from the state's APMC mandis.", "url": "https://indianexpress.com/article/cities/jalandhar/punjab-wheat-mandi-purchase-farmers-costs-msp-loss-7903497/", "urlToImage": "https://images.indianexpress.com/2022/05/wheat-punjab.jpg", "publishedAt": "2022-05-06T00:38:14Z", "content": "Wheat purchases from mandis (markets) in Punjab this marketing season have touched a 15-year high of almost six lakh tonnes. But farmers are not happy. The reason? Flour millers and traders are payin… [+4669 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Asad Rehman", "title": "School principal booked for ‘asking students to dress up in Eid attire’", "description": "Mustafa is the principal of CBSE-affiliated Nyaya Nagar Public School located in Havelia area under Jhunsi police station. The school has over 1,200 students.", "url": "https://indianexpress.com/article/cities/lucknow/school-principal-booked-for-asking-students-to-dress-up-in-eid-attire-7903481/", "urlToImage": "https://images.indianexpress.com/2022/05/IE-79-6.jpeg", "publishedAt": "2022-05-05T23:38:19Z", "content": "The principal of a private school was booked in Prayagraj on Wednesday on charges of hurting religious sentiments after she allegedly directed students to post 20-second videos wearing Eid attire as … [+3296 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "‘Enemy property’ case: HC reserves order on Azam bail application", "description": "The court said that the order would be pronounced in the second week of May.  Azam has been in jail for more than two years in connection with 87 cases lodged against him since 2017. He is currently lodged in Sitapur jail.", "url": "https://indianexpress.com/article/cities/lucknow/enemy-property-case-hc-reserves-order-on-azam-bail-application-7903479/", "urlToImage": "https://images.indianexpress.com/2022/05/Azam-Khan-1200.jpg", "publishedAt": "2022-05-05T23:26:49Z", "content": "The Allahabad High Court on Thursday reserved its order while hearing the bail plea of Samajwadi Party MLA Azam Khan in an alleged case of grabbing Enemy Property that was  purportedly used for the c… [+1832 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Maulshree Seth", "title": "Free Wi-Fi at all 58,189 gram panchayat secretariats soon", "description": "The facility will help villagers to avail services related to documents, land records through common service centre", "url": "https://indianexpress.com/article/cities/lucknow/free-wi-fi-at-all-58189-gram-panchayat-secretariats-soon-7903474/", "urlToImage": "https://images.indianexpress.com/2022/05/internet.jpg", "publishedAt": "2022-05-05T23:24:17Z", "content": "THE STATE government on Thursday announced that free Wi-Fi facilities would soon be provided in all its 58,000 gram panchayats.The facility would be provided in a 50-metre radius of Gram Sachivalaya … [+2235 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Six-year-old boy run over by bus, 2 arrested: Police", "description": "The Royal Convent Inter College has been sealed while its manager and the bus driver were arrested.", "url": "https://indianexpress.com/article/cities/lucknow/six-year-old-boy-run-over-by-bus-2-arrested-police-7903469/", "urlToImage": "https://images.indianexpress.com/2022/05/arrest1-3.jpeg", "publishedAt": "2022-05-05T23:21:55Z", "content": "A six-year-old boy died after he came under the wheels of a bus belonging to the inter college that he was studying at in Baghpat’s Chamrawal village on Thursday, police said on Friday. The Royal Con… [+856 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Amitabh Sinha", "title": "Over 90% deaths went unreported? Why WHO data raises questions", "description": "The WHO’s estimate of 47.4 lakh Covid-related deaths in India in 2020 and 2021 flies in the face of overall death data, historical trends in death reporting, and Covid death compensation claims from states.", "url": "https://indianexpress.com/article/india/over-90-deaths-went-unreported-why-who-data-raises-questions-7903417/", "urlToImage": "https://images.indianexpress.com/2021/09/funeral.jpg", "publishedAt": "2022-05-05T22:40:43Z", "content": "WHILE there is little doubt that Indias official Covid-19 death toll is an undercount, as is the case with probably most other countries, the excess mortality figures released by the World Health Org… [+5265 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sandeep Singh", "title": "Explained: Interest rates hiked, but equities may do well when inflation is high", "description": "The Fed’s 50-basis-point hike in interest rates on Wednesday, the biggest in over two decades, came in response to rising inflation that has hit a four-decade high.", "url": "https://indianexpress.com/article/explained/interest-rates-hike-equities-inflation-high-explained-7903347/", "urlToImage": "https://images.indianexpress.com/2022/05/economy-.jpg", "publishedAt": "2022-05-05T22:40:05Z", "content": "A day after the Reserve Bank of India raised the repo rateby 40 basis points and the US Federal Reserve raised interest rates by 50 basis points, the benchmark Sensex at the Bombay Stock Exchange jum… [+4820 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "5,261 SSC posts created on CM’s instructions: Minister", "description": "Move aimed at accommodating all candidates who featured in the 2016 merit lists of School Service Commission exam and State Level Selection Test", "url": "https://indianexpress.com/article/cities/kolkata/5261-ssc-posts-created-on-cms-instructions-minister-7903467/", "urlToImage": "https://images.indianexpress.com/2022/05/basu.jpg", "publishedAt": "2022-05-05T22:39:36Z", "content": "Amid the ongoing job protest by successful SSC candidates and the Opposition uproar over the issue, state Education Minister Bratya Basu on Thursday said additional teaching posts have been created f… [+1728 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pranav Mukul", "title": "Jet Airways test flight takes off: What next?", "description": "This test flight, which was approximately 90 minutes long, landed back in Hyderabad, and happened in run up to the airline’s ‘proving flight’ that is expected to be conducted over the next few days.", "url": "https://indianexpress.com/article/explained/jet-airways-test-flight-takes-off-what-next-7903356/", "urlToImage": "https://images.indianexpress.com/2022/05/Jet-Airways-1.jpg", "publishedAt": "2022-05-05T22:36:13Z", "content": "A Jet Airways aircraft took off from Hyderabad Airport a few minutes after 2pm on Thursday, in what was the airlines first flight since it was grounded because of its poor financial situation back in… [+2768 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Covid positivity rate zero in most Bengal districts, says health dept report", "description": "The official said a total 10,710 samples were examined during the surveillance over three days between April 27 to April 29 by Kalyani College of Medicine and JNM Hospital.", "url": "https://indianexpress.com/article/cities/kolkata/covid-positivity-rate-zero-in-most-bengal-districts-says-health-dept-report-7903465/", "urlToImage": "https://images.indianexpress.com/2022/05/covid-1.jpg", "publishedAt": "2022-05-05T22:36:09Z", "content": "An internal report of a sentinel surveillance conducted by the West Bengal health department has found that the Covid-19 positivity rate in most of the districts is zero, rubbishing apprehensions of … [+2766 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Tough to guard borders without support of local admin: Shah in Bengal", "description": "Shah, who is on a two-day visit to the state, asserted that a political situation would emerge soon when the local authorities would be “forced to extend help due to public pressure”.", "url": "https://indianexpress.com/article/cities/kolkata/tough-to-guard-borders-without-support-of-local-admin-shah-in-bengal-7903463/", "urlToImage": "https://images.indianexpress.com/2022/05/aMIT-SHAH-14-2.jpg", "publishedAt": "2022-05-05T22:32:57Z", "content": "Taking an indirect jibe at the Trinamool Congress (TMC) government in West Bengal, Union Home Minister Amit Shah on Thursday said that it was difficult to stop infiltration and smuggling across the i… [+2743 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sachchidanand Shukla", "title": "India must seize the trade opportunity opening now", "description": "The uncertain global economic environment calls for proactive policy actions to boost exports", "url": "https://indianexpress.com/article/opinion/columns/india-must-seize-the-trade-opportunity-opening-7903289/", "urlToImage": "https://images.indianexpress.com/2022/05/export-2.jpg", "publishedAt": "2022-05-05T22:31:06Z", "content": "The year 2021 was a record one for trade despite the pandemic. In terms of volumes, merchandise trade rose 9.8 per cent, while in dollar terms, it grew 26 per cent. The value of commercial services t… [+4707 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Naveed Iqbal, Arun Sharma", "title": "Disempowers, biased: J&K parties oppose panel order", "description": "“We outrightly reject it,” said PDP chief Mehbooba Mufti. She said the Delimitation Commission had “overlooked the basis of population and acted as per their wish... We don’t trust it. Its recommendations are a link to abrogation of Article 370 — how to disem…", "url": "https://indianexpress.com/article/cities/srinagar/disempowers-biased-jk-parties-oppose-panel-order-7903402/", "urlToImage": "https://images.indianexpress.com/2021/12/mufti1.jpg", "publishedAt": "2022-05-05T22:30:57Z", "content": "OPPOSING THE final delimitation order on Thursday, both the Peoples Democratic Party (PDP) and Peoples Conference called it an attempt to disempower the people of Kashmir, while the Congress said it … [+5453 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Will hold meets with TMC’s booth-level leaders, says Mamata", "description": "The TMC supremo also made changes in the party's disciplinary committee by including Subrata Bakshi in place of Partha Chatterjee.", "url": "https://indianexpress.com/article/cities/kolkata/will-hold-meets-with-tmcs-booth-level-leaders-says-mamata-7903461/", "urlToImage": "https://images.indianexpress.com/2022/05/mamata-759-1-1-1-5.jpg", "publishedAt": "2022-05-05T22:30:22Z", "content": "West Bengal Chief Minister Mamata Banerjee on Thursday said that she will start holding meetings of Trinamool Congress (TMC) booth-level leaders alongside district-level administrative review meeting… [+1729 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aanchal Magazine, Aashish Aryan", "title": "Tax reassessment: I-T has 30 days to send notices", "description": "According to the top court’s judgment, the assessing officer will, within 30 days from May 4, provide the respective assesses the information and all relevant material which was relied upon to send the income tax recovery notice to them.", "url": "https://indianexpress.com/article/business/economy/tax-reassessment-i-t-has-30-days-to-send-notices-7903357/", "urlToImage": "https://images.indianexpress.com/2022/03/income-tax-rules-1200.jpg", "publishedAt": "2022-05-05T22:30:14Z", "content": "With the Supreme Court upholding the reassessment notices issued before the amendment to the Income Tax Act through the Finance Act, 2021, taxpayers will have a time period of two weeks to respond to… [+3101 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shubhajit Roy", "title": "Ukraine: Modi & Macron discuss ‘cascading effect’, each’s position", "description": "The tone of India’s statement was in sharp contrast to Delhi’s sharp response to remarks from other European leaders and ministers who, in recent weeks, had conveyed concerns over India not condemning Russia’s actions in Ukraine.", "url": "https://indianexpress.com/article/india/ukraine-modi-macron-discuss-cascading-effect-eachs-position-7903378/", "urlToImage": "https://images.indianexpress.com/2022/05/modi-6.jpg", "publishedAt": "2022-05-05T22:30:12Z", "content": "Hours after Prime Minister Narendra Modi held talks with French President Emmanuel Macron in Paris, Delhi said there was a broad understanding of each others position on the Ukraine issue, that the t… [+2765 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anand Mohan J", "title": "Lynching of 2 tribals in MP: Families of 6 held say accused linked to Bajrang Dal", "description": "The families of some of the six others arrested claimed they were cajoled into joining the raid, which led to the deaths, by people they met at a local wedding. Another accused is a tribal youth whose family does “not know much” about the case.", "url": "https://indianexpress.com/article/india/lynching-of-2-tribals-in-mp-families-of-6-held-say-accused-linked-to-bajrang-dal-7903412/", "urlToImage": "https://images.indianexpress.com/2022/05/Congress-protest.jpg", "publishedAt": "2022-05-05T22:30:09Z", "content": "AT LEAST six of the 13 persons arrested for the death of two tribal men, who were assaulted on Tuesday over allegations of cow slaughter in Madhya Pradeshs Seoni, are members of the Bajrang Dal and h… [+5973 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "Day after MPC: Banks kick off lending, deposit rate hikes", "description": "Bank of Baroda has hiked repo-linked lending rate (RLLR) by 40 basis points to 6.9 per cent. Bank of India and Central Bank of India also raised RLLR by 40 basis points to 7.25 per cent. Other banks are set to follow suit as cost of funds is bound to rise fol…", "url": "https://indianexpress.com/article/business/day-after-mpc-banks-kick-off-lending-deposit-rate-hikes-7903361/", "urlToImage": "https://images.indianexpress.com/2021/04/ICICI-Bank.jpg", "publishedAt": "2022-05-05T22:30:04Z", "content": "Close on the heels of the Reserve Bank of Indias decision to hike the policy repo rate and cash reserve ratio, banks have started hiking lending rates with ICICI Bank and Bank of Baroda (BoB) kicking… [+2628 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Bashaarat Masood", "title": "Explained: What changes to J&K constituencies mean", "description": "Delimitation panel report has added 6 Assembly seats to Jammu, 1 to Kashmir, and redrawn Assembly as well as Lok Sabha seats. What will the impact be?", "url": "https://indianexpress.com/article/explained/explained-what-changes-to-jk-constituencies-mean-7903352/", "urlToImage": "https://images.indianexpress.com/2022/05/jammu-kashmir-1.jpg", "publishedAt": "2022-05-05T22:28:24Z", "content": "On Thursday, a commission set up by the Centre submitted its final report for the delimitation of Assembly and parliamentary constituencies in Jammu and Kashmir. The changes have been opposed by all … [+5586 chars]"}]}