{"status": "ok", "totalResults": 122, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Russia to opt out of International Space Station after 2024", "description": "Yuri Borisov, who was appointed earlier this month to lead the state-controlled space corporation Roscosmos, said during a meeting with Russian President Vladimir Putin that Russia will fulfill its obligations to other partners at the International Space Stat…", "url": "https://indianexpress.com/article/world/russia-to-opt-out-of-international-space-station-after-2024-8053037/", "urlToImage": "https://images.indianexpress.com/2022/07/putin-2.jpg", "publishedAt": "2022-07-26T12:29:07Z", "content": "Russia will opt out of the International Space Station after 2024 and focus on building its own orbiting outpost, the country’s newly appointed space chief said Tuesday. Yuri Borisov, who was appoint… [+1409 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Justin Baldoni feels like ‘a new man’ as he works out in a ‘physical gym’ after long", "description": "\"For the first time in my life I’m building a fitness base not from a place of lack or fear… but from a place of love,\" the actor wrote", "url": "https://indianexpress.com/article/lifestyle/fitness/justin-baldoni-works-out-physical-gym-self-love-fitness-masculinity-8049761/", "urlToImage": "https://images.indianexpress.com/2022/07/Justin-Baldoni-1200.jpg", "publishedAt": "2022-07-26T12:00:06Z", "content": "Justin Baldoni has always been unafraid to show his vulnerable side to his fans and followers on Instagram, sharing posts, pictures and thoughts about where he stands in life.Buy Now | Our best subsc… [+2590 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Richa Chadha recalls almost interviewing Abhay Deol as a magazine intern: ‘I was working with him six months later’", "description": "Richa Chadha made her acting debut with Abhay Deol-starrer Oye Lucky! Lucky Oye! But just a few months before she signed the film, she was an intern at a magazine, looking to interview Abhay.", "url": "https://indianexpress.com/article/entertainment/bollywood/richa-chadha-recalls-almost-interviewing-abhay-deol-as-an-intern-8052840/", "urlToImage": "https://images.indianexpress.com/2022/07/richa-chadha-abhay-deol.jpg", "publishedAt": "2022-07-26T11:41:29Z", "content": "Actor Richa Chadha recalled the time she was interning at a magazine, and was offered the chance to interview Abhay Deol. Only some months later, she had become an actor, and went on to make her debu… [+1337 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Cristiano Ronaldo arrives at Man United’s training base, set for talks", "description": "Cristiano Ronaldo returns to Manchester for showdown talks with Erik ten Hag.", "url": "https://indianexpress.com/article/sports/football/cristiano-ronaldo-arrives-man-united-training-base-8052898/", "urlToImage": "https://images.indianexpress.com/2022/07/Cristiano-Ronaldo-1.jpg", "publishedAt": "2022-07-26T11:32:42Z", "content": "Cristiano Ronaldo arrived at Manchester United’s training ground with his agent on Tuesday with the Portugal great’s future at the English club up in the air.You know it’s going to be serious talks w… [+967 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "NDA’s VP candidate Dhankhar withdraws from SC’s chamber allotment race", "description": "In a letter to the registrar concerned of the apex court, SCBA president Vikas Singh has said Dhankhar’s name be excluded from the process.", "url": "https://indianexpress.com/article/india/ndas-vp-candidate-dhankhar-withdraws-from-scs-chamber-allotment-race-8052861/", "urlToImage": "https://images.indianexpress.com/2022/07/bengal-governor-1200-1.jpg", "publishedAt": "2022-07-26T11:29:36Z", "content": "NDA candidate for vice presidency, Jagdeep Dhankhar, has withdrawn himself from the process of seeking a chamber in the Supreme Court premises here as a lawyer, the Supreme Court Bar Association (SCB… [+1087 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "The Conversation", "title": "Long Covid: with no treatment options, it’s little wonder people are seeking unproven therapies like ‘blood washing’", "description": "This experimental treatment – the medical name for which is apheresis – involves taking blood from the body and “filtering” it", "url": "https://indianexpress.com/article/lifestyle/health/long-covid-with-no-treatment-options-its-little-wonder-people-are-seeking-unproven-therapies-like-blood-washing-8050564/", "urlToImage": "https://images.indianexpress.com/2022/07/Long-Covid-1200.jpg", "publishedAt": "2022-07-26T11:00:19Z", "content": "A recent investigation published by the British Medical Journal revealed that long COVID patientsare travelling abroad to seek expensive blood washing treatment.This experimental treatment the medica… [+5493 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "UAE’s Sultan Ali Neyadi to be the first Arab astronaut to spend six months on ISS", "description": "UAE astronaut Sultan Al Neyadi has been selected to go on a six-month-long mission to the International Space Station aboard the SpaceX Crew-6 mission.", "url": "https://indianexpress.com/article/26-11/uae-arab-emirati-astronaut-sultan-al-neyyadi-spacex-crew6-8052725/", "urlToImage": "https://images.indianexpress.com/2022/07/Sultan-Al-Neyadi-first-UAE-arab-astronaut.jpg", "publishedAt": "2022-07-26T10:48:32Z", "content": "Emirati astronaut Sultan Al Neyadi will become the first Arab astronaut to be part of a long-term mission to the International Space Station (ISS) after he embarks on SpaceXs Crew-6 mission scheduled… [+1910 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Extension of CRZ to boost development of coastal region: Karnataka CM Bommai", "description": "“The CRZ exemption limit has been extended in Goa and Kerala states which have helped the growth of the hotel and tourism industry in a big way in those states in their coastal region.", "url": "https://indianexpress.com/article/cities/bangalore/extension-of-crz-to-boost-development-of-coastal-region-8052681/", "urlToImage": "https://images.indianexpress.com/2022/07/basavaraj-bommai-express-photo.jpg", "publishedAt": "2022-07-26T10:28:08Z", "content": "Karnataka Chief Minister Basavaraj Bommai told media persons in New Delhi Monday that his government has obtained permission for the extension of the Coastal Regulation Zone (CRZ). He added that the … [+2462 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Representing a nation on tv, and a running team on Instagram", "description": "Even less visible to the average fan — especially if you aren’t on Instagram — is that a growing number of them are competing on behalf of professional running teams.", "url": "https://indianexpress.com/article/sports/sport-others/representing-a-nation-on-tv-and-a-running-team-on-instagram-8052672/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-37-3.jpg", "publishedAt": "2022-07-26T10:21:29Z", "content": "At the track and field world championships, distance runners compete on behalf of their countries. Whats less visible to the average fan is that most are also competing for their shoe company sponsor… [+6162 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Nakuul Mehta morphs himself in Ranveer Singh’s nude photo: ‘Haters will say…’", "description": "Ranveer Singh bared it all recently for the Paper magazine. The pictures from the photoshoot have since gone viral. While many were impressed with Ranveer's photoshoot, a few also trolled the actor.", "url": "https://indianexpress.com/article/entertainment/bollywood/nakuul-mehta-morphs-himself-in-ranveer-singhs-nude-photo-8052645/", "urlToImage": "https://images.indianexpress.com/2022/07/singh1200-3.jpg", "publishedAt": "2022-07-26T10:10:46Z", "content": "After Ranveer Singh‘s nude photoshoot went viral, TV star Nakuul Mehta took to his Instagram handle on Tuesday to share a photoshopped version of the nude photo, in which the Bollywood actors face wa… [+2022 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Mohamed Thaver", "title": "Explained: What are India’s laws against obscenity that Ranveer Singh has allegedly violated?", "description": "Mumbai Police have registered an FIR against the actor for posing nude for pictures for a magazine. The complainant has said that India is a land of culture, and such photos could negatively impact children who are crazy about film stars", "url": "https://indianexpress.com/article/explained/explained-what-indias-laws-against-obscenity-ranveer-singh-allegedly-violated-8052620/", "urlToImage": "https://images.indianexpress.com/2022/07/ranveerexp.jpg", "publishedAt": "2022-07-26T10:10:17Z", "content": "Based on a complaint by a Mumbai-based NGO, the Mumbai Police registered an FIR against actor Ranveer Singh on Tuesday (July 26) for sharing photographs from an apparently nude photoshoot that he did… [+6104 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Neither went to BSP nor held talks with it: SBSP", "description": "\"We neither went to the BSP nor had any talks. He is saying it on his own. We only talked about our priorities. Our leader Om Prakash had worked with Kanshiram,\" the SBSP chief spokesperson added.", "url": "https://indianexpress.com/article/cities/lucknow/neither-went-to-bsp-nor-held-talks-with-it-sbsp-8052598/", "urlToImage": "https://images.indianexpress.com/2022/07/Om-Prakash-SBSP.jpg", "publishedAt": "2022-07-26T09:59:12Z", "content": "The Suheldev Bhartiya Samaj Party (SBSB) on Tuesday said it neither approached the Bahujan Samaj Party (BSP) nor held talks with it, a day after a leader of Mayawati-led party took a veiled dig at Om… [+2148 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Deutsche Welle", "title": "Coronavirus: Japan struggles with record-setting seventh wave", "description": "After some short-lived optimism that the worst of the Covid pandemic might be over, health experts are warning that the peak of the seventh wave has yet to arrive.", "url": "https://indianexpress.com/article/world/japan-coronavirus-seventh-wave-8052469/", "urlToImage": "https://images.indianexpress.com/2022/07/japan-covid.jpg", "publishedAt": "2022-07-26T09:16:31Z", "content": "Just a few short weeks ago, coronavirus infections in Japan were hovering around the 10,000-cases-a-day level, and there was optimism across the nation that the worst of the health crisis was over an… [+4995 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "Manabadi AP Inter 1st, 2nd Supplementary Hall Tickets 2022 released: How to download", "description": "Manabadi AP Inter Supplementary Hall Tickets 2022: As per the official notification, the first year and second year students can download their admit cards or hall tickets using their either hall ticket number or their Aadhaar number.", "url": "https://indianexpress.com/article/education/manabadi-ap-inter-1st-2nd-supplementary-hall-tickets-2022-released-how-to-download-8052309/", "urlToImage": "https://images.indianexpress.com/2021/07/ap-inter-2-year.jpg", "publishedAt": "2022-07-26T08:29:09Z", "content": "Manabadi AP Inter Supplementary Hall Tickets 2022:Board of Intermediate Education Andhra Pradesh (BIEAP) today released AP Inter supplementary exam hall tickets. Candidates can download the AP Inter … [+1119 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Income Tax Returns: From house rent to donations; key tax deductions which can be availed", "description": "We take a look at some lesser-known tax deductions which can be availed by taxpayers.", "url": "https://indianexpress.com/article/business/income-tax-returns-itr-filing-financial-year-2021-22-key-tax-deductions-8051873/", "urlToImage": "https://images.indianexpress.com/2022/07/tax-saving-pixabay-1200.jpg", "publishedAt": "2022-07-26T08:16:43Z", "content": "Income Tax Return Filing 2022 Last Date Extension: We are in the last week of July which essentially means that only a few days are left for filing our income tax returns (ITRs) for the financial yea… [+2447 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Ashishkumar Chauhan quits as BSE chief; committee to manage affairs for interim period", "description": "Ashishkumar Chauhan will be joining the National Stock Exchange (NSE) as Managing Director and Chief Executive Officer (CEO).", "url": "https://indianexpress.com/article/business/market/ashishkumar-chauhan-quits-as-bse-chief-committee-to-manage-affairs-for-interim-period-8052220/", "urlToImage": "https://images.indianexpress.com/2022/07/ashish_edit-1.jpg", "publishedAt": "2022-07-26T08:14:26Z", "content": "Ashishkumar Chauhan has resigned as Managing Director and CEO of BSE and has been relieved of his roles and responsibilities at the exchange, the bourse said.Chauhan will be joining rival National St… [+1307 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Namit Kumar", "title": "Explained: Why, despite a €1.3 billion debt, Barcelona are on a summer spending spree", "description": "The economics and sociology of football mega stars with big price tags — Raphinha and Robert Lewandowski — making their way to the Nou Camp.", "url": "https://indianexpress.com/article/explained/barcelona-debt-new-players-spending-spree-explained-8051923/", "urlToImage": "https://images.indianexpress.com/2022/07/sports.jpg", "publishedAt": "2022-07-26T08:12:40Z", "content": "Messis trademark blend of sporting greatness and global superstardom, of tantalising talent and machine-like output, of genius and joy, became central not only to Barcelonas sporting legacy, but also… [+5193 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Ruchika Goswamy", "title": "Aditi Vinayak Dravid on her Best Actress win at Berlin Film Festival: ‘My performance in Ijaad has placed a benchmark’", "description": "Aditi Vinayak Dravid was recently awarded the Best Actress award at the Berlin Film Festival for her performance in the bilingual (Hindi-English) feature film Ijaad.", "url": "https://indianexpress.com/article/entertainment/regional/aditi-vinayak-dravid-best-actress-win-berlin-film-festival-8052149/", "urlToImage": "https://images.indianexpress.com/2022/07/aditi.jpeg", "publishedAt": "2022-07-26T07:58:33Z", "content": "Performing has been part of actor Aditi Vinayak Dravids life for over two decades. Born and raised in Pune, the now Mumbai-based Dravid has always been performing whether through Bharatnatyam, her th… [+3781 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Baking star Paul Hollywood returns to the classic recipes", "description": "The English baking specialist has returned to the basics this summer, offering ultimate versions of recipes that have been adjusted and updated for the modern world in the new cookbook “Bake” from Bloomsbury Publishing.", "url": "https://indianexpress.com/article/books-and-literature/baking-star-paul-hollywood-returns-to-the-classic-recipes-bake-cookbook-8052081/", "urlToImage": "https://images.indianexpress.com/2022/07/APPaulHollywood_1200.jpg", "publishedAt": "2022-07-26T07:55:59Z", "content": "If Paul Hollywood needed any evidence that he and The Great British Bake Off have become pop culture icons, he just needs to turn on Netflix.There last year, in the starry heist film Red Notice starr… [+5522 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Decoding the link between green tea consumption and reduced risk of type 2 diabetes", "description": "Type 2 diabetes, caused due to insulin is a significant global public health challenge, according to the World Health Organization", "url": "https://indianexpress.com/article/lifestyle/health/study-green-tea-type-2-diabetes-risk-blood-sugar-weightloss-benefits-8043040/", "urlToImage": "https://images.indianexpress.com/2022/07/green-tea_1200_getty.jpg", "publishedAt": "2022-07-26T07:51:07Z", "content": "Not just your waistline, green tea may help reduce risk of type 2 diabetes too, a study published in Journal of Nutrition and Metabolism notes. The 2020-published study, titled Effects of green tea c… [+2737 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "Watch: Whale lands on boat in Massachusetts, US", "description": "Local officials confirmed that there were ‘no injuries’ and there was ‘no major damage that affected the seaworthiness of the vessel’", "url": "https://indianexpress.com/article/trending/trending-globally/whale-lands-on-boat-in-massachusetts-8051147/", "urlToImage": "https://images.indianexpress.com/2022/07/Whale-crashes-boat.jpg", "publishedAt": "2022-07-26T07:46:45Z", "content": "A video showing a whale hitting a fishing boat, briefly submerging it, and landing on the vessel has surfaced online. The incident reportedly took place in White Horse Beach, Plymouth in the state of… [+854 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Careers Desk", "title": "REET 2022 Question paper booklet released; answer key soon", "description": "REET 2022 Question Paper, Answer Key and Result Update: REET 2022 Question Paper Out at reetbser2022.in.", "url": "https://indianexpress.com/article/jobs/reet-2022-question-paper-booklet-released-answer-key-date-reetbser2022-in-8052093/", "urlToImage": "https://images.indianexpress.com/2022/07/ch1556838-1-4.jpg", "publishedAt": "2022-07-26T07:35:44Z", "content": "REET 2022 Question Paper, Answer Key &amp; Result Latest Updates: The Board of Secondary Education, Rajasthan, Ajmer today released the Rajasthan Eligibility Examination for Teacher REET-2022 questio… [+1149 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "US: Smuggling migrants at the border now a billion-dollar business", "description": "Migrant smuggling on the US southern border has evolved over the past 10 years from a scattered network of freelance “coyotes” into a multi-billion-dollar international business controlled by organised crime, including some of Mexico’s most violent drug carte…", "url": "https://indianexpress.com/article/world/us-border-smuggling-migrants-billion-dollar-business-8051685/", "urlToImage": "https://images.indianexpress.com/2022/07/us-border-smuggling.jpg", "publishedAt": "2022-07-26T07:33:05Z", "content": "From the street, the little brown house was unremarkable yet pleasant. A bright yellow toy school bus and red truck hung on the hog-wire fence, and the homes facade featured a large Texas lone star. … [+10274 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Law must be enforced without fear or favour: Oppn alleges misuse of investigation agencies in letter to President", "description": "“The law is the law and must be enforced without fear or favour,” the letter read. “But it cannot be used, as it is presently being done, arbitrarily, selectively and without any justification whatsoever against prominent leaders of numbers Opposition parties…", "url": "https://indianexpress.com/article/india/oppn-misuse-investigation-agencies-centre-president-letter-parliament-8052085/", "urlToImage": "https://images.indianexpress.com/2022/07/PTI07_19_2022_000014B.jpg", "publishedAt": "2022-07-26T07:32:38Z", "content": "In a joint-letter addressed to President Droupadi Murmu, several Opposition leaders on Tuesday accused the Modi government of misusing central agencies against its political opponents. Highlighting t… [+1965 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "ESA's Mars Express captures image of 'Martian Grand Canyon' bigger than the real thing - The Indian Express", "description": "<ol><li>ESA's Mars Express captures image of 'Martian Grand Canyon' bigger than the real thing  The Indian Express\r\n</li><li>Stunning new Mars photos explore the solar system's largest canyon  Space.com\r\n</li><li>Mars' Valles Marineris, which is 20 times wide…", "url": "https://indianexpress.com/article/technology/science/esa-mars-express-valles-marineris-grand-canyon-8052029/", "urlToImage": "https://images.indianexpress.com/2022/07/Martian-grand-canyon-valles-marineris.jpg", "publishedAt": "2022-07-26T07:16:39Z", "content": "The European Space Agencys (ESA) Mars Express probe has captured images of the Valles Marineris, which is the largest canyon system in the Solar System. Valles Marineris is almost ten times longer, t… [+2306 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi: DU professor, 14 others briefly detained over meeting to mark Phoolan Devi death anniversary", "description": "The police said those who had gathered were told to refrain from holding the meeting as a notice had been issued under Section 144 of the CrPC. When they refused to comply, 15 people were detained and released around 5 pm.", "url": "https://indianexpress.com/article/cities/delhi/delhi-du-phoolan-devi-death-anniversary-professor-others-detained-8052012/", "urlToImage": "https://images.indianexpress.com/2022/07/phooland-evi.jpeg", "publishedAt": "2022-07-26T07:12:36Z", "content": "Fifteen people, including Delhi University professor Santosh Yadav and JNU scholar Kanchana Yadav, were temporarily detained by the police during a meeting on Monday at the Faculty of Arts at Delhi U… [+1835 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "‘Rusted old grenade’ found near Pune, police, bomb disposal squad called in", "description": "Deputy Commissioner of Police (Zone 4) Rohidas Pawar said, \"An old grenade-like object was found in Manjari Khurd this morning around 8.30 am. Teams from the Lonikand police station and the BDDS have been deployed.\"", "url": "https://indianexpress.com/article/cities/pune/rusted-old-grenade-found-near-pune-police-bomb-disposal-squad-called-in-8051973/", "urlToImage": "https://images.indianexpress.com/2022/07/capture-7592.jpg", "publishedAt": "2022-07-26T06:59:53Z", "content": "An object suspected to be an old grenade was found in Manjari Khurd Tuesday morning prompting authorities to send teams from the Pune City Police and Bomb Detection and Disposal Squad (BDDS) to the a… [+1129 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Chess Olympiad torch relay arrives in Coimbatore", "description": "Chess in chennai, chess olympiad, Mahabalipuram , Chennai, Tamil Nadu, Chess torch in coimbatore, chennai news, chennai live news, chess chennai news, Tamil nadu government", "url": "https://indianexpress.com/article/cities/chennai/chess-olympiad-torch-relay-arrives-in-coimbatore-8051819/", "urlToImage": "https://images.indianexpress.com/2022/07/chess-torch.jpg", "publishedAt": "2022-07-26T06:41:01Z", "content": "The torch relay for the 44th Chess Olympiad, which begins in Chennai on July 28, arrived in Coimbatore on Monday and was received by senior Tamil Nadu ministers.After receiving the torch, state minis… [+1528 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Young Ukrainians use techno parties to rebuild villages", "description": "Ukraine's vibrant club scene was brought to an abrupt halt with the Russian invasion on February 24.", "url": "https://indianexpress.com/article/lifestyle/life-style/young-ukrainians-use-techno-parties-to-rebuild-villages-8050084/", "urlToImage": "https://images.indianexpress.com/2022/07/APtechnoparties1.jpg", "publishedAt": "2022-07-26T06:30:20Z", "content": "In a village in northern Ukraine that was devastated by Russian occupation only months ago, a techno party is in full swing.In a bombed-out building, more than 200 young people have found a novel way… [+3833 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Alia Bhatt wraps up Karan Johar’s Rocky Aur Rani Ki Prem Kahani, see video", "description": "Actor Alia Bhatt has finished the talkie portion of Karan Johar's directorial venture Rocky Aur Rani Ki Prem Kahani.", "url": "https://indianexpress.com/article/entertainment/bollywood/alia-bhatt-wraps-up-karan-johars-rocky-aur-rani-ki-prem-kahani-see-video-8051714/", "urlToImage": "https://images.indianexpress.com/2022/07/Alia-Bhatt-1200by667.jpg", "publishedAt": "2022-07-26T06:07:01Z", "content": "Actor Alia Bhatt has completed the talkie portion of her upcoming film Rocky Aur Rani Ki Prem Kahani. Filmmaker Karan Johar on Tuesday shared a video of Alia being cheered on by the cast and crew of … [+1078 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Michael Jordan’s six NBA Championship-winning sneakers to be displayed for the first time ever", "description": "Six Air Jordans — one from each of Michael Jordan's championship-winning games — will be on display to the public this week for the first time since the legend last walked off the court.", "url": "https://indianexpress.com/article/sports/basketball/michael-jordans-six-nba-championship-winning-sneakers-to-be-displayed-by-csg-for-the-first-time-ever-8051623/", "urlToImage": "https://images.indianexpress.com/2020/08/jordan-1200.jpg", "publishedAt": "2022-07-26T04:56:36Z", "content": "Certified Sports Guaranty (CSG) will honour Michael Jordan with the ‘Dynasty Collection,’ a memorabilia series that will feature all six of his championship-winning sneakers.All six sneakers will now… [+1446 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sukrita Baruah", "title": "DU’s four year undergraduate programme: What is its structure, syllabus and framework", "description": "Single and multidisciplinary programmes offered with multiple exit options; no clarity on final subject list, in the works", "url": "https://indianexpress.com/article/education/dus-four-year-undergraduate-programme-structure-syllabus-framework-8051627/", "urlToImage": "https://images.indianexpress.com/2022/07/Campus-season-2.jpg", "publishedAt": "2022-07-26T04:52:11Z", "content": "Students admitted to Delhi University (DU) in the 2022-23 academic year will be the first batch to study the four-year undergraduate curriculum prescribed by the National Education Policy (2020). DU … [+3317 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Two from Karnataka participate in Rain Forest Challenge 2022", "description": "The event is is held annually in Goa during the monsoons and its participants include the most evolved off-roaders from across the country competing in specially prepared four-wheel drive vehicles.", "url": "https://indianexpress.com/article/cities/bangalore/karnataka-two-participate-rain-forest-challenge-2022-8051630/", "urlToImage": "https://images.indianexpress.com/2022/07/karnataka-rainforest-challenge.jpg", "publishedAt": "2022-07-26T04:49:51Z", "content": "Two Karnataka-based motorsport off-roaders Satish Kumar and Chetan Changappa have embarked on one of the longest-running motorsport competitionsRainforest Challenge (RFC) 2022as the only competitors … [+2055 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "গভীর রাত ২.৩২ থেকে সকাল ৯.৩৫ মিনিট! চার বারেও ফোন ধরলেন না মমতা, হতাশ হয়ে যান পার্থ", "description": "পার্থর বাড়িতে তল্লাশি চালিয়ে প্রচুর চাকরিপ্রার্থীর নামের তালিকা, প্রাক্তন বিধায়কের লেটারপ্যাডে নামের সুপারিশ এবং গ্রুপ ডি প্রার্থীর অ্যাডমিট কার্ড পেয়েছে ইডি।", "url": "https://bengali.indianexpress.com/west-bengal/admit-cards-list-of-candidates-in-bengal-minister-partha-chatterjees-house-ed-to-court-474189/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/Partha-Chatterjee-1.jpg", "publishedAt": "2022-07-26T04:05:49Z", "content": "-, \r\n . \r\n , ., . . . , \r\n , - \r\n , - , - , \r\n , - , \r\n ? , \r\n , “ , , ”\r\n , “ - ”\r\nStay updated with the latest news headlines and all the latest Westbengal news download Indian Express Bengali App.… [+98 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Ranveer Singh lost brand endorsements after Ladies vs Ricky Bahl flopped: ‘Wrote my own script for my first ad’", "description": "Ranveer Singh received many offers from several brands to promote their products after his debut movie Band Baaja Baraat became a box office hit.", "url": "https://indianexpress.com/article/entertainment/bollywood/ranveer-singh-lost-brand-endorsements-after-ladies-vs-ricky-bahl-flopped-wrote-script-for-first-ad-8051563/", "urlToImage": "https://images.indianexpress.com/2022/07/ranveer-singh-1-1.jpg", "publishedAt": "2022-07-26T04:01:30Z", "content": "Ranveer Singh recently won the IAA (International Advertising Association) Brand Endorser of the Year award. At the IAA Leadership Awards, Ranveer revealed how he wrote his own script for a brand end… [+1445 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Chess Olympiad in Tamil Nadu: Government announces holiday for four districts on July 28", "description": "As per the order issued by D Jagannathan, Public Department Secretary, the holiday has been declared in Kancheepuram, Chennai, Tiruvallur, and Chengalpattu to prevent any traffic congestion on the opening day.", "url": "https://indianexpress.com/article/cities/chennai/tamil-nadu-announces-holiday-for-four-districts-on-chess-olympiad-opening-day-on-thursday-8051528/", "urlToImage": "https://images.indianexpress.com/2022/07/chess-india-aicf.jpg", "publishedAt": "2022-07-26T03:29:29Z", "content": "The Tamil Nadu Government Monday announced a holiday for schools, colleges, and other non-essential government offices in four districts for Thursday, July 28, in view of the opening day of the 44th … [+1929 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "2 UK leadership contenders spar over tax in TV debate", "description": "Foreign Secretary Liz Truss promised to cut taxes as soon as she took office, while former Treasury chief Rishi Sunak said he would get inflation under control first.", "url": "https://indianexpress.com/article/world/2-uk-leadership-contenders-spar-over-tax-in-tv-debate-8051513/", "urlToImage": "https://images.indianexpress.com/2022/07/AP22206745518100.jpg", "publishedAt": "2022-07-26T03:28:03Z", "content": "The two candidates vying to be Britains next prime minister sparred Monday over how to help families struggling with the soaring cost of living, meeting in a testy televised debate that highlighted t… [+5101 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Ludhiana MC House passes resolution to regularise contractual sanitation workers", "description": "The resolution was passed amid allegations of irregularities in the list of the names prepared for regularisation. The councillors alleged that there were a number of fake names in the list of the persons who were never really seen working on ground.", "url": "https://indianexpress.com/article/cities/ludhiana/ludhiana-mc-house-passes-resolution-to-regularise-contractual-sanitation-workers-8051497/", "urlToImage": "https://images.indianexpress.com/2022/07/waste-picker-1.jpg", "publishedAt": "2022-07-26T02:53:59Z", "content": "The House of Ludhiana Municipal Corporation led by Mayor Balkar Singh Sandhu of Congress, passed a resolution Monday proposing regularisation of contractual sanitation staff, including sewermen and s… [+2486 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Leela Prasad, Sonal Gupta", "title": "Daily Briefing: Droupadi Murmu sworn in as first tribal woman President; 4 Congress MPs suspended from Parliament", "description": "In today's edition: Droupadi Murmu scripts history as first tribal woman President; the suspension of four Congress MPs in Parliament; India's 5G auctions and more", "url": "https://indianexpress.com/article/live-news/top-news-briefing-today-8051481/", "urlToImage": "https://images.indianexpress.com/2022/07/Express-intro-5.jpg", "publishedAt": "2022-07-26T02:33:54Z", "content": "The Big Story\r\nIn her speech, shortly after taking oath as President, the first to be born after Independence, President Droupadi Murmu said that her election is proof that the poor cannot just dream… [+4105 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "Saving MSMEs", "description": "Payment delays are crippling the sector. Public and private sectors must pay up what is due", "url": "https://indianexpress.com/article/opinion/editorials/saving-msmes-rbi-demonitisation-8051187/", "urlToImage": "https://images.indianexpress.com/2022/07/edit-25-2.jpg", "publishedAt": "2022-07-26T00:00:12Z", "content": "Over the past few years, the micro, small and medium enterprises (MSME) sector has been battered by a series of shocks. From demonetisation to the transition to the goods and services tax to the pand… [+2810 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "2 cops among 3 injured in blast at police station", "description": "Those injured are undergoing treatment at the Murshidabad Medical College, the officials said.", "url": "https://indianexpress.com/article/cities/kolkata/2-cops-among-3-injured-in-blast-at-police-station-8051416/", "urlToImage": "https://images.indianexpress.com/2022/07/Indian-Express-logo-35.jpeg", "publishedAt": "2022-07-25T23:16:56Z", "content": "Three persons, including two policemen, were injured in an explosion that occurred in the warehouse of Behrampur police station in Murshidabad, police said on Monday. The injured were taken to a loca… [+382 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "Fire Mr Chatterjee", "description": "Centre’s use of agencies is dodgy but that’s no alibi. TMC must confront growing corruption within Centre’s use of agencies is dodgy but that’s no alibi. TMC must confront growing corruption within", "url": "https://indianexpress.com/article/opinion/editorials/west-bengal-partha-chatterjee-arrest-ed-8051180/", "urlToImage": "https://images.indianexpress.com/2022/07/edit-25-1.jpg", "publishedAt": "2022-07-25T23:10:25Z", "content": "The arrest of Partha Chatterjee, Commerce, Industry and IT Minister in West Bengal, in connection with an alleged money laundering case leaves the Trinamool Congress (TMC) with a lot of questions to … [+2799 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Murder of DSP: Three including dumper truck owner arrested", "description": "Police have so far arrested nine persons including the dumper driver and cleaner in the case.", "url": "https://indianexpress.com/article/india/murder-of-dsp-three-including-dumper-truck-owner-arrested-8051403/", "urlToImage": "https://images.indianexpress.com/2022/07/Nuh-1-1-1.jpg", "publishedAt": "2022-07-25T23:03:51Z", "content": "Nuh police have arrested three more accused including owner of the dumper truck in connection with the murder of a Haryana police DSP, who was allegedly mowed down by a dumper truck during a raid to … [+700 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shahrukh Alam", "title": "Why the recent trend of criminalising journalists is worrying", "description": "If the state wants to prevent political formations, then, rather than criminalising political mobilisation of some groups, it should quickly intervene so that large parts of the population don’t feel excluded from society", "url": "https://indianexpress.com/article/opinion/columns/why-the-recent-trend-of-criminalising-journalists-is-worrying-8051175/", "urlToImage": "https://images.indianexpress.com/2022/07/Zubair-4-1.jpg", "publishedAt": "2022-07-25T23:00:08Z", "content": "[Cleopatra, the Queen to the messenger: What say you? Strikes him.Horrible villain,Ill spurn thine eyes, like balls before me!Ill unhair thy head!Thou shalt be whipped with wire and stewed in brine,M… [+5635 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sukhbir Siwach", "title": "Extension sought for three IAS officers | Murmurs in bureaucracy: ‘Haryana should consider extensions for other officers also’", "description": "The state government had sent two letters – on July 12 and July 13 – to the Centre to seek extension in service of three senior IAS officers — PK Das, Devender Singh, and Rajeev Arora — for two years. All three are scheduled to retire on July 31 this year.", "url": "https://indianexpress.com/article/cities/chandigarh/extension-sought-for-three-ias-officers-murmurs-in-bureaucracy-haryana-should-consider-extensions-for-other-officers-8051400/", "urlToImage": "https://images.indianexpress.com/2022/07/ias-1.jpg", "publishedAt": "2022-07-25T22:57:20Z", "content": "As the Haryana government keenly waits for the Centre to give its nod for extension in service for three of its senior IAS officers, who are close to their retirements, there are murmurs within the r… [+2630 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kanchan Vasdev", "title": "Under debt, liabilities, freebies’ burden, Punjab struggling to stay ‘fiscally fit’", "description": "The additional burden of 300 units of free power rolled out from July 1 would also cost the state exchequer Rs 1800 crore annually. The power subsidy bill is already set to touch Rs 18,000 crore this fiscal even as an amount of Rs 7,117 crore is due from the …", "url": "https://indianexpress.com/article/cities/chandigarh/under-debt-liabilities-freebies-burden-punjab-struggling-to-stay-fiscally-fit-8051371/", "urlToImage": "https://images.indianexpress.com/2022/07/bhagwant-mann-3-1-2-1.jpeg", "publishedAt": "2022-07-25T22:17:27Z", "content": "WITH A debt of Rs 2.63 lakh crore on the state, a revenue deficit of Rs 12,554 crore, a fiscal liability of Rs 24,352 crore, a liability of Rs 36,068 on debt servicing and the GST compensation regime… [+4511 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Bombay HC asks CBI to begin probe against Nirav Modi’s brother-in-law", "description": "The bench passed directives after the central agency approached the HC seeking a stay on the order of a special court, which permitted Mehta to travel to Hong Kong. The court also granted interim protection from coercive action to Mehta till August 23 in the …", "url": "https://indianexpress.com/article/cities/mumbai/bombay-hc-cbi-probe-nirav-modi-brother-in-law-8051287/", "urlToImage": "https://images.indianexpress.com/2022/07/mainak-1.jpg", "publishedAt": "2022-07-25T20:33:35Z", "content": "The Bombay High Court on Monday asked the Central Bureau of Investigation (CBI) to inform how soon it would commence its inquiry against Mainak Mehta, brother-in-law of fugitive diamantaire Nirav Mod… [+1320 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "India, Pak, Bangladesh can reunite, says Manohar Lal Khattar", "description": "Referring to the neighbouring countries, the CM said that in our country, a woman from the most backward section has become the President in a democratic manner, and that this was possible only in India.", "url": "https://indianexpress.com/article/cities/delhi/india-pak-bangladesh-can-reunite-says-manohar-lal-khattar-8051293/", "urlToImage": "https://images.indianexpress.com/2022/07/newsline-haryanacm-5col.jpg", "publishedAt": "2022-07-25T20:22:06Z", "content": "Haryana Chief Minister Manohar Lal Khattar Monday said that India, Pakistan and Bangladesh could unite just like Germany’s reunification.Describing the Partition during the independence of the countr… [+1596 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Goodfellas actor Paul Sorvino passes away", "description": "Paul Sorvino's publicist Roger Neal said he died on Monday morning in Indiana of natural causes.", "url": "https://indianexpress.com/article/entertainment/hollywood/goodfellas-actor-paul-sorvino-passes-away-8051240/", "urlToImage": "https://images.indianexpress.com/2022/07/Paul-Sorvino-dead-1200-edited.jpeg", "publishedAt": "2022-07-25T19:05:00Z", "content": "Paul Sorvino, an imposing actor who specialized in playing crooks and cops like Paulie Cicero in Goodfellas and the NYPD sergeant Phil Cerretta on Law &amp; Order, has died. He was 83.His publicist R… [+2931 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mumbai: 61-year-old woman cheated of Rs 97,000 lakh after she tried to file online complaint against bus driver", "description": "According to police, the FIR was registered late last week after the woman lost Rs 97,000 to the fraudsters.", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-woman-cheated-tried-file-online-complaint-against-bus-driver-8051213/", "urlToImage": "https://images.indianexpress.com/2022/07/Indian-express-1-3-10.jpg", "publishedAt": "2022-07-25T18:07:43Z", "content": "The NM Joshi Marg police are on the lookout for unknown frauds who allegedly duped a 61-year-old woman who works for a shipping company under the pretext of helping her lodge a complaint against a BE… [+1324 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "RMC bans sale of meat, fish, orders abattoirs to be shut on Shravan Mondays, Janmashtami", "description": "Rajkot Municipal Commissioner Amit Arora has directed agencies concerned to ensure strict implementation of the notification and warned violators of action.", "url": "https://indianexpress.com/article/cities/rajkot/rmc-bans-sale-meat-fish-shut-shravan-mondays-janmashtami-8051201/", "urlToImage": "https://images.indianexpress.com/2022/07/rmc_759.jpg", "publishedAt": "2022-07-25T17:58:24Z", "content": "The Rajkot Municipal Corporation (RMC) has banned the sale and storage of meat, fish and mutton and slaughterhouses to be shut on four Mondays in the month of Shravan as well as on the Hindu festival… [+1578 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Yes Bank-DHFL fraud case: CBI files supplementary chargesheet against Pune-based builder Avinash Bhosale", "description": "During investigation, the money that was taken by DHFL from Yes Bank has been found to have swelled to Rs 4,727 crore. This amount was shared by companies floated by Rana Kapoor, Avinash Bhosale and others.", "url": "https://indianexpress.com/article/business/banking-and-finance/yes-bank-dhfl-fraud-case-cbi-files-supplementary-chargesheet-against-pune-based-builder-avinash-bhosale-8051199/", "urlToImage": "https://images.indianexpress.com/2022/07/yes-bank-express-archieve-photo-1200-1.jpg", "publishedAt": "2022-07-25T17:55:38Z", "content": "The Central Bureau of Investigation (CBI) filed a supplementary chargesheet Monday against Pune-based builder Avinash Bhosale in the Yes Bank-DHFL fraud case. Bhosale was arrested in the last week of… [+151 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "22-year-old cadet pilot crash lands aircraft due to power failure", "description": "Director General of Civil Aviation Arun Kumar said there was a suspected power loss. The aircraft landed in a field and local residents immediately helped the 22-year-old cadet pilot, who reportedly sustained no injuries.", "url": "https://indianexpress.com/article/cities/mumbai/22-year-old-cadet-pilot-crash-lands-aircraft-due-to-power-failure-8051184/", "urlToImage": "https://images.indianexpress.com/2022/07/Indian-Express-logo-29.jpeg", "publishedAt": "2022-07-25T17:37:34Z", "content": "A Redbird Aviation school-owned Cessna 152 (VT-ALI), which was on a solo cross-country flight, made a crash landing while 15 nautical miles in-bound to Baramati airport on Monday morning.Director Gen… [+689 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "‘People don’t even know my name’: Rahul Dravid recalls funny incident after first century in school cricket", "description": "\"I think it was a good lesson for me as well to realize that while I might be really happy and excited about scoring a 100 in school cricket but I am still not well known,\" Dravid said.", "url": "https://indianexpress.com/article/sports/cricket/rahul-dravid-recalls-funny-incident-after-first-century-in-school-cricket-8051136/", "urlToImage": "https://images.indianexpress.com/2022/07/rahul-dravid-1.jpg", "publishedAt": "2022-07-25T17:27:16Z", "content": "India coach Rahul Dravid was the guest in Olympic gold medallist shooter Abhinav Bindra’s “In the Zone” podcast recently, where he shared a never before heard anecdote from his school life.Bindra ask… [+2048 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "CBI arrests 5 for promising Rajya Sabha seats, governorship for Rs 100 cr", "description": "The agency on Monday conducted searches at seven locations in Delhi, Uttar Pradesh, Maharashtra and Karnataka and claimed have recovered incriminating material, including WhatsApp conversations and other evidences.", "url": "https://indianexpress.com/article/india/cbi-arrests-5-for-promising-rajya-sabha-seats-governorship-for-rs-100-cr-8051152/", "urlToImage": "https://images.indianexpress.com/2022/07/CBI-new-2.jpg", "publishedAt": "2022-07-25T16:56:07Z", "content": "THE CENTRAL Bureau of Investigation (CBI) has arrested five people for allegedly promising various people Rajya Sabha seats, governorship and chairmanship of government bodies in lieu of money. The a… [+1927 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Jimmy Leivon", "title": "Manipur proposes to spend Rs 34,930 crore for fiscal 2022-23", "description": "As per the budget, the total revenue expenditure for 2022-23 has been estimated to be Rs 17,914 crore, and capital outlay projected at Rs 9,272 crore.", "url": "https://indianexpress.com/article/north-east-india/manipur/manipur-proposes-spend-rs-34930-crore-fiscal-2022-23-8051132/", "urlToImage": "https://images.indianexpress.com/2022/05/biren.jpg", "publishedAt": "2022-07-25T16:33:08Z", "content": "Manipur Power Minister Thongam Biswajit Monday tabled the budget estimate for financial year 2022-23 and proposed to spend Rs 34,930 crore out of the consolidated state fund during the ongoing fiscal… [+2366 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "PM takes dig at Opposition, says obstructing govt work", "description": "Addressing the 10th death anniversary of late Samajwadi Party (SP) leader Harmohan Singh Yadav virtually, the PM said the interests of the country and society are always bigger than ideologies.", "url": "https://indianexpress.com/article/cities/lucknow/oppn-obstructs-development-political-interests-nation-pm-modi-8051129/", "urlToImage": "https://images.indianexpress.com/2022/07/modi-1200-11.jpg", "publishedAt": "2022-07-25T16:25:37Z", "content": "Prime Minister Narendra Modi on Monday targeted the Opposition, especially the Congress, for opposing the decisions taken by his government, saying that some Opposition parties were putting obstacles… [+2808 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Oppn obstructs development works, gives political interests preference over nation: PM Modi", "description": "Prime Minister Modi during a virtual session said, \"Many times, the opposition parties put some obstacles in the government's work as they could not implement the decisions taken by them when they were in power.\"", "url": "https://indianexpress.com/article/india/oppn-obstructs-development-political-interests-nation-pm-modi-8051129/", "urlToImage": "https://images.indianexpress.com/2022/07/modi-1200-11.jpg", "publishedAt": "2022-07-25T16:25:37Z", "content": "Prime Minister Narendra Modi on Monday accused the Opposition of obstructing development works merely on the ground that they could not accomplish these during their tenure while alleging that they k… [+4075 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sana Farzeen", "title": "Sudeep, Salman Khan on South vs Bollywood debate: ‘It’s a beautiful thing to exchange ideas, collaborate’", "description": "Salman Khan and Kiccha Sudeep spoke about the current South vs Bollywood debate at Vikrant Rona's promotional event.", "url": "https://indianexpress.com/article/entertainment/regional/salman-khan-sudeep-vikrant-rona-film-release-8051094/", "urlToImage": "https://images.indianexpress.com/2022/07/sudeep1200.jpg", "publishedAt": "2022-07-25T16:20:48Z", "content": "Bollywood superstar Salman Khan on Monday graced the promotional event of Vikrant Rona in Mumbai. Salman is presenting the Kiccha Sudeep-starrer in the Hindi belt. At the event, the two superstars sh… [+2513 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "জোর করে ধর্মান্তরণের অভিযোগ করলে প্রমাণও দিতে হবে, স্পষ্ট কথা হাইকোর্টের", "description": "বিচারপতিরা জানান, আদালত এই ব্যাপারে সরকারকে বলতেই পারে। কিন্তু, সেজন্য প্রথমে মামলা করতে হবে।", "url": "https://bengali.indianexpress.com/politics/national/delhi-hc-tells-bjp-leader-to-show-more-than-just-apprehensions-474122/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/delhi-high-court.jpg", "publishedAt": "2022-07-25T15:48:56Z", "content": ", , , , \r\n , , \r\n, - , ‘ ? ? ’\r\n - , \r\n , , , ‘ , ? ? ’\r\n , , , \r\nRead full story in English\r\nStay updated with the latest news headlines and all the latest National news download Indian Express Beng… [+82 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "ECI to launch campaign in Maharashtra to link Voter ID with Aadhaar from August 1", "description": "It can be linked online on Voter helpline app and national voter service portal, too,\" said Shrikant Deshpande, Chief Election Officer (CEO) of Maharashtra.", "url": "https://indianexpress.com/article/cities/mumbai/eci-to-launch-campaign-in-maharashtra-to-link-voter-id-with-aadhaar-from-august-1-8051079/", "urlToImage": "https://images.indianexpress.com/2021/11/Aadhar-1.jpg", "publishedAt": "2022-07-25T15:39:38Z", "content": "The Election Commission of India (ECI) will start a campaign across Maharashtra to link Voter ID cards with Aadhaar from August 1. The aim of this voluntary drive is to establish the identity of elec… [+1507 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Guardians of the Galaxy Vol 3 trailer hasn’t been released online for this reason", "description": "Helmed by James Gunn, Guardians of the Galaxy Vol 3 will release in theatres on May 5, 2023.", "url": "https://indianexpress.com/article/entertainment/hollywood/guardians-of-the-galaxy-vol-3-trailer-hasnt-been-released-online-for-this-reason-mcu-8051080/", "urlToImage": "https://images.indianexpress.com/2022/07/GoG1200.jpg", "publishedAt": "2022-07-25T15:29:57Z", "content": "Marvel fans are keen, intelligent fans who like to zoom in on visuals of a teaser or a trailer and do their breakdowns based on a set of assumptions.Keeping them in mind, filmmaker James Gunn recentl… [+1065 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Neymar slammed for diving to earn penalty in PSG’s pre-season friendly: Watch", "description": "Neymar went down in the penalty box within a few minutes to earn the penalty. Replays, however, showed that there was little to no contact between the Brazilian and the defender inside the box.", "url": "https://indianexpress.com/article/sports/football/neymar-dive-penalty-psg-pre-season-watch-video-8051005/", "urlToImage": "https://images.indianexpress.com/2022/07/Neymar.jpg", "publishedAt": "2022-07-25T14:53:08Z", "content": "Neymar was in the eye of a controversial storm again when he was accused of diving to win a penalty in PSG’s 6-2 win preseason win over Gamba Osaka on Monday.The visitors went 1-0 up courtesy Pablo S… [+986 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Abhishek Purohit", "title": "In series-winning knock against WI, Axar proves he has batting ability to prosper at elite level", "description": "Another aspect of his game that Axar has improved is attacking the wide yorkers designed to prevent him from slogging through midwicket.", "url": "https://indianexpress.com/article/sports/cricket/axar-patel-proves-he-has-batting-ability-to-prosper-at-elite-level-8051030/", "urlToImage": "https://images.indianexpress.com/2022/07/axar-patel-2.jpg", "publishedAt": "2022-07-25T14:42:34Z", "content": "Axar Patel has been so much of an understudy to Ravindra Jadeja that eight years since his international debut, he has played all of six Tests, 40 ODIs and 23 T20Is. And in the handful of games hes g… [+5952 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sourav Roy Barman", "title": "Ram Nath Kovind: The promise, and the President", "description": "As Dalit head of state, Kovind's appointment was as hailed for its symbolism as Droupadi Murmu's now. But in the end, his symbol will be his steadfast silence", "url": "https://indianexpress.com/article/political-pulse/ram-nath-kovind-the-promise-and-the-president-8051020/", "urlToImage": "https://images.indianexpress.com/2022/07/Kovind-1.jpg", "publishedAt": "2022-07-25T14:36:25Z", "content": "Five years ago, the day Ram Nath Kovind swept the Presidential election with over 66% votes, the Rajya Sabha witnessed a heated debate on the “increase” in the cases of lynchings and assaults on Musl… [+6391 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Lionel Messi’s chapter at Barcelona is’ not over’: President Joan Laporta", "description": "Lionel Messi, who scored 672 goals in 778 appearances for Barcelona, won a staggering 35 titles and record-breaking six Ballon d'Or awards during his 17-year stay at the La Liga club.", "url": "https://indianexpress.com/article/sports/football/lionel-messi-barcelona-return-transfer-president-joan-laporta-8050976/", "urlToImage": "https://images.indianexpress.com/2021/08/lionel-messi-barcelona.jpg", "publishedAt": "2022-07-25T14:25:30Z", "content": "Lionel Messi could make a sensational return to Barcelona according to president Joan Laporta.Messi, who left the Blaugrana last year to join PSG, has also been reported to be keen on a return to the… [+1514 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "CBSE Result 2022: Revaluation process to begin tomorrow; check how to apply", "description": "Candidates who are unhappy with their score can apply for rechecking on the official website -- cbse.gov.in -- before 11:59 pm of July 28. Students can apply for revaluation of only term 2 score.", "url": "https://indianexpress.com/article/education/cbse-result-2022-revaluation-process-to-begin-tomorrow-check-how-to-apply-deadline-rechecking-fees-at-cbse-gov-in-8051000/", "urlToImage": "https://images.indianexpress.com/2022/07/CBSE-Revaluation.jpg", "publishedAt": "2022-07-25T14:25:18Z", "content": "This year, board released the final results for classes 10 and 12 on July 22, and the online application process for verification of marks will start Tuesday.\r\nCBSE Result 2022 Revaluation: How to ap… [+1584 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mosque near Qutub Minar a protected monument, Centre tells HC; Delhi Waqf Board challenges submission", "description": "The oral submission was made by a counsel representing the central government before the bench of Justice Manoj Kumar Ohri. Advocate Kirtiman Singh also told the court that a Saket court is presently hearing a matter involving the mosque in question, and soug…", "url": "https://indianexpress.com/article/cities/delhi/mosque-qutub-minar-monument-delhi-hc-waqf-board-8051014/", "urlToImage": "https://images.indianexpress.com/2022/06/Qutub-Minar-1-1-1.jpg", "publishedAt": "2022-07-25T14:14:23Z", "content": "In response to a petition challenging the alleged stopping of prayers since May at a mosque in South Delhi, the Centre Monday told the Delhi High Court that the masjid situated adjacent to the easter… [+2678 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Tunisians vote on proposal to give president more power", "description": "The new constitution gives the office of the president all executive powers and removes key checks and balances", "url": "https://indianexpress.com/article/world/tunisians-vote-president-more-power-8050981/", "urlToImage": "https://images.indianexpress.com/2022/07/tunisia.jpg", "publishedAt": "2022-07-25T14:02:45Z", "content": "Tunisians are voting Monday for a controversial new constitution put forward by President Kais Saied that critics say will formalize his power grab and reverse hard-won democratic gains in the North … [+6087 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Akshay Kumar is excited to join wife Twinkle Khanna in New York after his shoot gets cancelled. See photos", "description": "Akshay Kumar was busy in London with the promotion of his next film Raksha Bandhan, while his wife Twinkle Khanna has been busy exploring New York.", "url": "https://indianexpress.com/article/entertainment/bollywood/akshay-kumar-shoot-cancelled-off-to-new-york-from-london-to-meet-family-twinkle-khanna-8050958/", "urlToImage": "https://images.indianexpress.com/2022/07/akshay-kumar-1200-1.jpg", "publishedAt": "2022-07-25T13:41:13Z", "content": "Akshay Kumar shared a click of himself on Monday afternoon. The actor, who is busy with the promotions of his next film, titled Raksha Bandhan, in London, shared with his fans that he is going to mee… [+1654 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Alleged Abe assassin to undergo mental evaluation until Nov", "description": "The suspect, Tetsuya Yamagami, was arrested immediately after he allegedly shot Abe from behind when the former leader was making a campaign speech outside a busy train station in western Japan on July 8.", "url": "https://indianexpress.com/article/world/alleged-abe-assassin-undergo-mental-evaluation-nov-8050982/", "urlToImage": "https://images.indianexpress.com/2022/07/shinzo-abe-killer.jpg", "publishedAt": "2022-07-25T13:40:05Z", "content": "The alleged assassin of Japan’s former Prime Minister Shinzo Abe will be detained until late November for mental evaluation so prosecutors can determine whether to formally press charges and send him… [+2101 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rupsa Chakraborty", "title": "Covid-19 leading cause of maternal death in Mumbai for second year in a row", "description": "Pregnant women have a weak immune system and they have many physiological changes, say doctors. This may make them more susceptible to Covid-related complications.", "url": "https://indianexpress.com/article/cities/mumbai/covid-19-leading-cause-of-maternal-death-in-mumbai-8050903/", "urlToImage": "https://images.indianexpress.com/2022/07/pexels-cottonbro-5853674.jpg", "publishedAt": "2022-07-25T13:35:23Z", "content": "Maternal deaths from Covid-19 in Mumbai rose from 29 in 2020 to 43 in 2021 with the virus emerging as the leading cause of maternal death followed by sepsis, haemorrhage and tubcerculosis for the sec… [+3061 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Selena Gomez set BFF goals with Taylor Swift as they celebrated her 30th birthday", "description": "The 'Same Old Love' singer took to Instagram to share a couple of pictures, in which the two appeared to have a lot of fun", "url": "https://indianexpress.com/article/lifestyle/fashion/selena-gomez-bff-goals-taylor-swift-30th-birthday-fashion-8048562/", "urlToImage": "https://images.indianexpress.com/2022/07/Selena-and-Taylor-1200.jpg", "publishedAt": "2022-07-25T13:30:42Z", "content": "It is rare to share the kind of bond that Selena Gomez shares with Taylor Swift. The singers got together recently to celebrate Gomez’s 30th birthday on July 22, a milestone event in anyone’s life.Bu… [+2021 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Tata Steel profit falls 21 pc to Rs 7,714 cr in Apr-Jun", "description": "Its expenses including the cost of materials consumed and the finance cost, increased to Rs 51,912.17 crore", "url": "https://indianexpress.com/article/business/tata-steel-profit-falls-21-7714-apr-jun-8050971/", "urlToImage": "https://images.indianexpress.com/2022/07/tata-steel-1200.jpg", "publishedAt": "2022-07-25T13:28:52Z", "content": "Tata Steel on Monday posted a 21 per cent fall in its consolidated net profit to Rs 7,714 crore for the April-June quarter due to higher expenses.The company had reported a net profit of Rs 9,768 cro… [+508 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manas Srivastava", "title": "UPSC Essentials: One word a day – SRI", "description": "What is SRI and why is it compared with DSR? Aspirants should know such terms as agriculture is an important topic for UPSC-CSE. Also, do not miss to solve the MCQ below.", "url": "https://indianexpress.com/article/upsc-current-affairs/upsc-essentials/upsc-essentials-one-word-a-day-sri-8050739/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-57-1.jpg", "publishedAt": "2022-07-25T13:00:13Z", "content": "Take a look at the essential concepts, terms, and phenomena from the static and current parts of the UPSC-CSE. Also, check the answer to the previous MCQ.Word: SRI\r\nSubject: Geography and Agriculture… [+5906 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "World IVF Day 2022: Repeated IVF failure? Here’s what you need to know", "description": "\"Advancement in technology cannot guarantee the definite success of pregnancy. Infertile couples, along with the IVF expert, face a lot of challenges in treating repeated IVF failure,\" said Dr Vaishnavi A Rao", "url": "https://indianexpress.com/article/lifestyle/health/world-ivf-day-2022-repeated-ivf-failure-reasons-prevention-8049776/", "urlToImage": "https://images.indianexpress.com/2022/07/GettyImages-fertility-treatment-IVF-1200.jpg", "publishedAt": "2022-07-25T12:50:31Z", "content": "Every year, July 25 is observed as World IVF Day, commemorating the birth of Louise Brown — the first baby to be born after successful IVF treatment in 1978. It became one of the most prominent landm… [+2206 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Russia tells famine-fearing Africa it’s not to blame for food shortage", "description": "Ahead of the trip, Russia acquiesced to an agreement that allows Ukraine to resume exporting critically needed grain that has been blocked in Black Sea ports by the fighting, a sign of Putin’s apparent concern for public opinion across the developing world.", "url": "https://indianexpress.com/article/world/russia-tells-famine-fearing-africa-its-not-to-blame-for-food-shortage-8050732/", "urlToImage": "https://images.indianexpress.com/2022/07/africa.jpg", "publishedAt": "2022-07-25T12:44:01Z", "content": "President Vladimir Putin of Russia likes to cast himself as the leader of a global movement rising up against domination by the United States and its allies. On Sunday, his top diplomat brought that … [+6980 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi Police arrest 3 men for cheating people", "description": "The accused were identified as Ahmedabad residents", "url": "https://indianexpress.com/article/cities/delhi/delhi-police-arrest-3-men-cheating-8050873/", "urlToImage": "https://images.indianexpress.com/2022/07/arrest-2-7-5-6-1.jpeg", "publishedAt": "2022-07-25T12:31:11Z", "content": "Three men were arrested from Gujarats Ahmedabad for allegedly cheating people by luring them to buy packaging material in bulk and keeping the advance payment without delivering. The accused were ide… [+1307 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gujarat BJP leader quits after video shows him ‘drunk’ at event celebrating Droupadi Murmu’s win", "description": "BJP state general secretary Bhargav Bhatt says Rashmikant Vasava volunteered to resign as president of the party's Chhota Udepur district unit.", "url": "https://indianexpress.com/article/cities/ahmedabad/droupadi-murmu-win-rashmikant-vasava-drunk-video-gujarat-bjp-8050867/", "urlToImage": "https://images.indianexpress.com/2022/07/Rashmikant-Vasava-1200.jpg", "publishedAt": "2022-07-25T12:24:43Z", "content": "Rashmikant Vasava resigned as BJP president in Gujarats Chhota Udepur district hours after a video showed him being unsteady at an event celebrating President Droupadi Murmus election victory, attrac… [+2483 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "‘Forced conversions’: Delhi HC tells BJP leader he has to show more than just apprehensions", "description": "BJP leader Ashwini Kumar Upadhyay had argued that Delhi has become a safe haven for illegal religious conversions and there is no law to book people for it.", "url": "https://indianexpress.com/article/cities/delhi/forced-conversions-delhi-hc-bjp-leader-ashwini-kumar-upadhyay-apprehensions-8050871/", "urlToImage": "https://images.indianexpress.com/2022/06/Delhi-HC-6-1-1.jpeg", "publishedAt": "2022-07-25T12:22:16Z", "content": "Observing that the central and state governments are free to make laws against forced religious conversions, the Delhi High Court on Friday told the petitioner, BJP leader Ashwini Kumar Upadhyay, tha… [+3684 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shruti Dhapola", "title": "Philips SpeedPro Cordless Vacuum Cleaner review: The new way to clean your home", "description": "Is the Philips SpeedPro Cordless Vacuum Cleaner right for you? Find out in our full review of the device.", "url": "https://indianexpress.com/article/technology/tech-reviews/philips-speedpro-cordless-vacuum-cleaner-review-8050724/", "urlToImage": "https://images.indianexpress.com/2022/07/Philips-speedpro-vacuum-cleaner-featured.jpg", "publishedAt": "2022-07-25T11:52:51Z", "content": "The pandemic changed our lives in many ways. Some of us took up new hobbies, and some went deep into fitness. Well, I turned to deep cleaning and reorganising my house. Its now become a fairly regula… [+6984 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sanath Prasad", "title": "Karnataka teacher hailed as hero in lockdown faces action over school ‘closure’ comment", "description": "Veeranna Madiwalar, who teaches at Government Lower Primary School in Ambedkar Nagar in Belagavi district, writes on Facebook that he is ready to face disciplinary action.", "url": "https://indianexpress.com/article/cities/bangalore/karnataka-teacher-faces-action-over-school-closure-comment-8050561/", "urlToImage": "https://images.indianexpress.com/2022/07/Veeranna-Madiwalar-1.jpg", "publishedAt": "2022-07-25T11:38:01Z", "content": "A teacher praised for transforming a government school in Karnataka through crowdfunding during lockdown has been issued a showcause notice over a social media comment criticising an alleged plan to … [+2438 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manoj C G", "title": "Four Congress LS MPs suspended; Parliament stalemate deepens", "description": "The MPs – Manickam Tagore, Ramya Haridas, TN Prathapan and S Jothimani – were named by Rajendra Agrawal – who was in the Chair – first for displaying placards in the House under rule 374.", "url": "https://indianexpress.com/article/india/four-congress-lok-sabha-mps-suspended-parliament-stalemate-8050653/", "urlToImage": "https://images.indianexpress.com/2022/07/Suspended-Mps.jpg", "publishedAt": "2022-07-25T11:20:12Z", "content": "The face-off between the government and the Opposition over the latters demand for an urgent discussion on price rise and hike in GST rates escalated Monday with Lok Sabha Speaker Om Birla suspending… [+1357 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Neha Banka", "title": "Explained: India’s plan to bring cheetahs from Africa to Madhya Pradesh", "description": "70 years after the cheetahs’ extinction, the Indian government is planning to introduce them in the Kuno wildlife sanctuary.", "url": "https://indianexpress.com/article/explained/explained-indias-plan-to-bring-cheetahs-from-africa-to-madhya-pradesh-8050334/", "urlToImage": "https://images.indianexpress.com/2022/07/kuno-cheetah.jpg", "publishedAt": "2022-07-25T11:19:32Z", "content": "India and Namibia signed a Memorandum of Understanding (MoU) on Wednesday to reintroduce the African cheetah in India. The MoU signed by Union Minister for Environment, Forests and Climate Change Bhu… [+8218 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anand Krishnan", "title": "Dealing with Long Covid", "description": "It's time to treat Covid as a regular disease, develop protocols", "url": "https://indianexpress.com/article/opinion/columns/dealing-with-long-covid-8050597/", "urlToImage": "https://images.indianexpress.com/2022/07/Covid-3.jpg", "publishedAt": "2022-07-25T11:19:18Z", "content": "Like Alice, we have reached a fork in the pandemic road. The answer, as the Cheshire cat said, depends on where we want to go. Unlike, Alice, we do know where we want to go: Back to pre-Covid normalc… [+5751 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Naga Chaitanya’s Thank You tanks at box office, collects only Rs 3 crore worldwide", "description": "Thank You is the new addition to the list of recent films of A-listers bombing at the ticket windows. Earlier, Nani's Ante Sundaraniki and Chiranjeevi's Acharya were also rejected by the movie-going audience.", "url": "https://indianexpress.com/article/entertainment/telugu/naga-chaitanyas-thank-you-tanks-at-box-office-collects-rs-3-crore-worldwide-8050531/", "urlToImage": "https://images.indianexpress.com/2022/05/Naga-Chaitanya.jpg", "publishedAt": "2022-07-25T10:56:55Z", "content": "Telugu actor Naga Chaitanya’s latest movie Thank You has not found many takers at the box office. The film, which was released last Friday, has managed to earn only Rs 3 crore worldwide. Written and … [+1747 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Devyani Onial", "title": "Explained: The story of Jim Corbett, the remarkable hunter-naturalist after whom India’s most celebrated national park is named", "description": "Born in Nainital, Jim Corbett lived in India until Independence, after which he left for Kenya where he died in 1955.", "url": "https://indianexpress.com/article/explained/explained-story-jim-corbett-hunter-naturalist-indias-celebrated-national-park-8050464/", "urlToImage": "https://images.indianexpress.com/2022/07/Powalgarhexp.jpg", "publishedAt": "2022-07-25T10:33:57Z", "content": "One hundred and forty-seven years ago on this day July 25, 1875 was born in the foothills of the Western Himalayas India’s most celebrated hunter-naturalist.Edward James Jim Corbett has lent his name… [+7001 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Maharashtra health department issues guidelines on monkeypox", "description": "As per the Centre’s advisory to states, hospitals will also be identified to manage suspected and confirmed cases of monkeypox, Maharashtra health officials said.", "url": "https://indianexpress.com/article/cities/pune/maharashtra-health-department-issues-guidelines-monkeypox-8050492/", "urlToImage": "https://images.indianexpress.com/2022/07/monkeypox-test.jpeg", "publishedAt": "2022-07-25T10:27:05Z", "content": "The Maharashtra health department has stepped up surveillance and urged health professionals to keep a close watch on persons with symptoms that resemble monkeypox. We have enhanced surveillance, iss… [+1318 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "দ্রৌপদীর শপথ গ্রহণে অশ্রুসজল আসমুদ্রহিমাচল, ভারত সন্ধিক্ষণে দাঁড়িয়ে, দাবি মোদীর", "description": "দেশের ১৫তম রাষ্ট্রপতি দ্রৌপদী মুর্মুকে সোমবার সংসদে শপথবাক্য পাঠ করার দেশের প্রধান বিচারপতি এনভি রামানা।", "url": "https://bengali.indianexpress.com/politics/national/pm-modi-says-that-india-is-in-watershed-moment-473868/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/droupadi_murmu.jpg", "publishedAt": "2022-07-25T10:21:33Z", "content": "- , \r\n , , , ‘ , ’\r\n , ‘ , ’ \r\nRead full story in English\r\nStay updated with the latest news headlines and all the latest National news download Indian Express Bengali App.\r\nWeb Title: Pm modi says t… [+31 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Entertainment Desk", "title": "অঙ্ক দেখলেই গায়ে জ্বর! ‘বীজগণিত কোন কাজে লাগে?’ প্রশ্ন ছুঁড়েই ভয়ঙ্কর ট্রোলড জাহ্নবী", "description": "'পড়াশোনা কি শিকেয়?', শ্রীদেবী-কন্যাকে জিজ্ঞেস নেটদুনিয়ার।", "url": "https://bengali.indianexpress.com/entertainment/janhvi-kapoor-trolled-for-commenting-on-mathematics-473863/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/janhvi.jpg", "publishedAt": "2022-07-25T10:07:19Z", "content": "(Janhvi Kapoor) , -, ! \r\n ! , - - , , , , \r\n ? , “ , , ? , ”\r\n[ : , , ]\r\n, , “ ?” , “ , ”\r\n , \r\nStay updated with the latest news headlines and all the latest Entertainment news download Indian Expre… [+78 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "3 women killed, 2 others injured after car rams into stationary DTC bus in Outer Delhi", "description": "The incident happened at a bus depot in Outer Delhi’s Swaroop Nagar Monday morning. The victims were on their way to Delhi from Himachal Pradesh in an i20 car.", "url": "https://indianexpress.com/article/cities/delhi/women-killed-injured-car-stationary-dtc-bus-delhi-8050419/", "urlToImage": "https://images.indianexpress.com/2022/07/Accident-2-1.jpg", "publishedAt": "2022-07-25T10:03:38Z", "content": "Three women were killed and two others, including a one-year-old baby, were injured after their speeding car rammed into a stationary Delhi Transport Corporation (DTC) bus at a depot in Outer Delhis … [+974 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Bengaluru Metro to hold trial runs on Purple Line extension to KR Puram from September", "description": "The metro rail corporation hopes to complete the extension of the line till Whitefield by December this year, the BMRCL managing director said.", "url": "https://indianexpress.com/article/cities/bangalore/bengaluru-metro-purple-line-extension-kr-puram-8050026/", "urlToImage": "https://images.indianexpress.com/2022/07/metro-2.jpg", "publishedAt": "2022-07-25T10:03:29Z", "content": "Trial runs on the much-awaited Purple Line extension of the Bengaluru Metro from Baiyappanahalli to Whitefield will begin in September, senior officials at the Bengaluru Metro Rail Corporation have s… [+1952 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Malavika Prasad", "title": "Uttar Pradesh: Noida administration gears up for Kanwar Yatra; district divided into zones, liquor shops shut", "description": "The Noida administration has also set up a control room in the collectorate office, Surajpur with a helpline number (01202560044) for the convenience of pilgrims.", "url": "https://indianexpress.com/article/cities/delhi/noida-administration-gears-up-for-kanwar-yatra-district-divided-8050357/", "urlToImage": "https://images.indianexpress.com/2022/07/kanwar-yatra-2.jpg", "publishedAt": "2022-07-25T09:53:47Z", "content": "The district authorities in Noida have issued advisories and instructions to provide smooth passage to devotees during the ongoing Kanwar pilgrimage, said officials. GautamBuddha Nagar district magis… [+2301 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Group of writers, cultural leaders from Kerala issue statement against Teesta Setalvad’s arrest", "description": "Condemning the arrest of Setalvad and former DGP Sreekumar, the group – which included Adoor Gopalakrishnan, K Satchidanandan, Sara Joseph and others – said it was part of an agenda to suppress dissenting voices.", "url": "https://indianexpress.com/article/india/kerala/group-of-writers-cultural-leaders-from-kerala-issue-statement-against-teesta-setalvads-arrest-8050354/", "urlToImage": "https://images.indianexpress.com/2022/07/teesta-setalvad-1.jpg", "publishedAt": "2022-07-25T09:32:11Z", "content": "A group of writers, film professionals and cultural leaders from Kerala has protested against the arrest of human rights activist Teesta Setalvad and former DGP R B Sreekumar after conspiracy charges… [+1196 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "CSA T20 League: Lance Klusener appointed as head coach of Durban franchise", "description": "Lance Klusener played 49 Tests and 171 ODIs for South Africa from 1996 to 2004.", "url": "https://indianexpress.com/article/sports/cricket/csa-t20-league-lance-klusener-appointed-as-durban-franchise-head-coach-8050320/", "urlToImage": "https://images.indianexpress.com/2016/06/lance-klusener-fb.jpg", "publishedAt": "2022-07-25T09:14:06Z", "content": "Former South Africa all-rounder Lance Klusener has been appointed as RPSG Group-owned Durban franchise for the first Cricket South Africa T20 League.Klusener played 49 Tests and 171 ODIs for South Af… [+1218 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Monojit Majumdar", "title": "Explained Live: Why monkeypox is spreading, the nationalisation of banks, and why Myanmar executed 4 dissidents", "description": "Explained Live: What is heteropessimism? In India, a recent example of heteropessimism is men trending #MarriageStrike on Twitter when the Delhi HC was hearing a plea to criminalise marital rape. Follow this space to know about more such stuff", "url": "https://indianexpress.com/article/explained/explained-today-daily-topics-current-affairs-live-updates-8050266/", "urlToImage": "https://images.indianexpress.com/2022/07/Explained-Live-3.jpg", "publishedAt": "2022-07-25T08:51:45Z", "content": "Dear Express Explained reader,\r\nShots were fired again in the long-running battle between the Delhi and central governments this week. Lt Governor Vinai Kumar Saxena recommended an investigation by t… [+2153 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lalmani Verma", "title": "It may be back to BSP for OP Rajbhar, eyes Dalit-MBC formula", "description": "SBSP leader says if MBCs and Dalits together, Muslims too might join in; Maya yet to respond", "url": "https://indianexpress.com/article/political-pulse/om-prakash-rajbhar-bsp-alliance-dalit-mbc-8050232/", "urlToImage": "https://images.indianexpress.com/2022/07/op-rajbhar-1.jpg", "publishedAt": "2022-07-25T08:39:32Z", "content": "He started his political career with the Bahujan Samaj Party (BSP) and now, for the second time since the Assembly elections earlier this year, Suheldev Bharatiya Samaj Party (SBSP) president Om Prak… [+3444 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "WhatsApp working on ‘kept messages’ feature to allow users to keep disappearing messages", "description": "WhatsApp is developing a \"kept message\" feature that would allow all participants in a conversation to \"keep\" disappearing messages so that they aren't deleted automatically.", "url": "https://indianexpress.com/article/technology/social/whatsapp-kept-messsages-disappearing-messages-working-8050152/", "urlToImage": "https://images.indianexpress.com/2022/07/WhatsApp-kept-messages-disappearing.jpg", "publishedAt": "2022-07-25T08:39:09Z", "content": "WhatsApp is reportedly working on a kept messages feature that will allow users to keep disappearing messages in chat past their expiration time. Once disappearing messages are kept, they can then be… [+1784 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Soumyarendra Barik", "title": "Explained: Why have Zomato’s shares fallen to their lowest ever price?", "description": "The last time the company’s stock took such a severe beating was after its acquisition of quick commerce startup Blinkit (formerly Grofers) last month.", "url": "https://indianexpress.com/article/explained/explained-zomato-shares-price-fall-8050204/", "urlToImage": "https://images.indianexpress.com/2022/07/Zomato.jpg", "publishedAt": "2022-07-25T08:33:23Z", "content": "Zomatos shares fell to under Rs 50, an all-time low, on Monday (July 25), as the year-long lock-in period for its pre initial public offering (IPO) ended on Friday (July 22). In the early hours of tr… [+2538 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Entertainment Desk", "title": "বিপদে-আপদে আমজনতার পাশে, ‘ক্যানিং-এর মিনু’ এবার জননেত্রী", "description": "সিরিয়ালে রাজনীতি! 'পিসির বায়োপিক নাকি?' প্রশ্ন নেটদুনিয়ার।", "url": "https://bengali.indianexpress.com/entertainment/television/canning-er-minu-colors-bangla-serial-getting-so-much-attention-473822/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/minu.jpg", "publishedAt": "2022-07-25T08:32:17Z", "content": ", , \r\n ! , \r\n, , ! \r\n– \r\n[ , , ]\r\n, , – ? , ‘’ – \r\nStay updated with the latest news headlines and all the latest Television news download Indian Express Bengali App.\r\nWeb Title: Canning er minu colo… [+41 chars]"}]}