{"status": "ok", "totalResults": 439, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "‘AICTE survey will help colleges identify learning gaps so that students can be industry-ready’", "description": "The survey, undertaken between last September and June 7, has found that first year engineering students are struggling with maths more than any other core subject. It has also recommended structural reforms in the civil engineering branch which lags behind o…", "url": "https://indianexpress.com/article/india/aicte-survey-will-help-colleges-identify-learning-gaps-so-that-students-can-be-industry-ready-7970154/", "urlToImage": "https://images.indianexpress.com/2015/05/aicte-main.jpg", "publishedAt": "2022-06-14T22:37:07Z", "content": "All India Council of Technical Education (AICTE) vice-chairman Prof MP Poonia believes the PARAKH survey undertaken by the council will help colleges identify learning gaps so that students can be ma… [+1825 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Raakhi Jagga", "title": "Farmer unions to protest moong procurement conditions on MSP", "description": "Jagmohan Singh Patiala, general secretary of BKU Dakaunda said, “The government is asking for copies of farad (land records) to be submitted with the procurement agency before purchase and also there is a quota of 5 quintals per acre procurement..we want the …", "url": "https://indianexpress.com/article/cities/ludhiana/farmer-unions-to-protest-moong-procurement-conditions-on-msp-7970150/", "urlToImage": "https://images.indianexpress.com/2022/06/pulses759.jpg", "publishedAt": "2022-06-14T22:34:01Z", "content": "Amid slow procurement moong on MSP in Punjab mandis, 22 farmer unions, under the banner of Samyukt Kisan Morcha (SKM), will be protesting against the state governments new procurement conditions in m… [+1085 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manish Sahu", "title": "Families on Prayagraj ‘list’ dread bulldozer shadow", "description": "Lecturer Aqeel Abbas Rizvi is among the 92 held so far by the Prayagraj police.", "url": "https://indianexpress.com/article/cities/lucknow/families-on-prayagraj-list-dread-bulldozer-shadow-7970140/", "urlToImage": "https://images.indianexpress.com/2022/06/UP-7.jpg", "publishedAt": "2022-06-14T22:32:54Z", "content": "ONE FAMILY is frantically putting together documents and bills to keep the bulldozer away. The other has given up because all it has is a two-room hut with this address: Jhopar Patti.About 500 metres… [+3913 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Ex-judges, lawyers urge SC: Protect fundamental rights of citizens in UP", "description": "The letter contended that “instead of giving protesters an opportunity of being heard and engaging in peaceful protests, the UP state administration appears to have sanctioned taking violent action against such individuals”.", "url": "https://indianexpress.com/article/india/ex-judges-lawyers-urge-sc-protect-fundamental-rights-of-citizens-in-up-7970148/", "urlToImage": "https://images.indianexpress.com/2022/06/supreme-court.jpg", "publishedAt": "2022-06-14T22:32:43Z", "content": "A group of advocates and former judges have written to Chief Justice of India N V Ramana, urging the Supreme Court to take suo motu cognisance of recent incidents of violence and repression by state … [+1646 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Gurjit Singh", "title": "The expansion game", "description": "China wants a larger BRICS to challenge the existing international order", "url": "https://indianexpress.com/article/opinion/columns/brics-summit-expansion-china-russia-g20-international-order-7969914/", "urlToImage": "https://images.indianexpress.com/2022/02/14123-2021-12-14t104604z_190538506_rc2aer9x64vi_rtrmadp_3_russia-china-nato.jpg", "publishedAt": "2022-06-14T22:30:39Z", "content": "A virtual meeting of BRICS+ foreign ministers was held on May 20 in which the ministers of Brazil, Russia, India, China, and South Africa (BRICS) were joined by representatives from Argentina, Egypt,… [+5520 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kabir Firaque", "title": "Explained: A prosthetic leg suited for the way Indians sit and walk, adjustable and affordable", "description": "The device contains a knee-locking mechanism that can be activated and deactivated depending on varying conditions. It also provides for adjustment of link length, and includes an alignment adjuster mechanism.", "url": "https://indianexpress.com/article/explained/prosthetic-leg-suited-for-indians-iit-guwahati-explained-7970016/", "urlToImage": "https://images.indianexpress.com/2022/06/prosthetic-leg.jpg", "publishedAt": "2022-06-14T22:30:09Z", "content": "Prosthetic legs available in the market are not affordable to everyone, and those that are do not always suit the special needs of Indian users. Such as sitting cross-legged, squatting on the toilet,… [+3810 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Gargi Verma", "title": "Chhattisgarh: Rescued from 60-ft pit after more than 100 hrs, ‘breathing normally’, 10-yr-old taken to hospital", "description": "According to rescue workers, Rahul was breathing normally and his eyes were open when he was brought out of the pit, through an adjoining tunnel created for his rescue. He was taken out on a stretcher, and taken straight to a waiting ambulance.", "url": "https://indianexpress.com/article/india/chhattisgarh-rescued-from-60-ft-pit-after-more-than-100-hrs-breathing-normally-10-yr-old-taken-to-hospital-7970129/", "urlToImage": "https://images.indianexpress.com/2022/06/Chhattisgarh-Pihrid-village.jpg", "publishedAt": "2022-06-14T22:30:06Z", "content": "More than a hundred hours 106 to be precise after he fell into a pit about 60 feet deep, dug for a borewell near his home in Chhattisgarhs Pihrid village, Rahul Sahu, 10, was finally rescued late Tue… [+1309 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Bashaarat Masood", "title": "Jamat-affiliate Trust schools to shut in J&K", "description": "The government has asked over 11,000 students studying in schools run by the Trust to take admission in the nearby government schools.", "url": "https://indianexpress.com/article/cities/srinagar/jamat-affiliate-trust-schools-to-shut-in-jk-7970142/", "urlToImage": "https://images.indianexpress.com/2020/06/online-classes-1200-1.jpg", "publishedAt": "2022-06-14T22:26:24Z", "content": "The J&amp;K administration has barred Falah-e-Aam Trust (FAT), an affiliate of banned Jamat-e-Islami organisation, from running schools in the Union Territory, asking the district authorities to seal… [+2337 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kamaldeep Singh Brar", "title": "Explained: Who was Dilawar Singh and why his portrait at Golden Temple", "description": "Former Punjab Police officer Dilawar Singh had tied a belt of explosives around his waist, which led to the blast that killed the then CM Beant Singh and 16 others at the Punjab Civil Secretariat on the evening of August 31, 1995.", "url": "https://indianexpress.com/article/explained/who-was-dilawar-singh-and-why-his-portrait-at-golden-temple-7970138/", "urlToImage": "https://images.indianexpress.com/2022/06/Dilawar-1.jpg", "publishedAt": "2022-06-14T22:21:54Z", "content": "Shiromani Gurudwara Parbhandak Committee (SGPC) installed the portrait of Dilawar Singh at the Central Sikh museum inside Golden Temple on Tuesday. Former Punjab Police officer Dilawar Singh had tied… [+2612 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "How is PUBG still available in India: NCPCR asks IT ministry", "description": "The NCPCR has also written to the Indian Olympic Association (IOA), asking them to explain the status of PUBG and other such games in the country.", "url": "https://indianexpress.com/article/india/how-is-pubg-still-available-in-india-ncpcr-asks-it-ministry-7970135/", "urlToImage": "https://images.indianexpress.com/2022/06/pubg-phone-1.jpg", "publishedAt": "2022-06-14T22:08:05Z", "content": "The National Commission of Protection of Child Rights (NCPCR) on Tuesday sent a letter to the Secretary of Ministry of Electronics and Information Technology, Ajay Prakash Sawhney, asking the Ministr… [+1793 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kanchan Vasdev", "title": "Arvind Kejriwal in Jalandhar today to flag off luxury buses to Delhi", "description": "With AAP government managing to get the permit, AAP chief Kejriwal will be landing in Punjab to flag off the buses from Jalandhar on Wednesday.", "url": "https://indianexpress.com/article/cities/jalandhar/arvind-kejriwal-in-jalandhar-today-to-flag-off-luxury-buses-to-delhi-7970133/", "urlToImage": "https://images.indianexpress.com/2022/06/kerjiwal-punjab-1.jpeg", "publishedAt": "2022-06-14T22:04:36Z", "content": "AS Punjab prepares for a political battle in Sangrur Lok Sabha constituency, going to by-election on June 23, Delhi Chief Minister Arvind Kejriwal will be in Jalandhar on Wednesday to flag off public… [+2388 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Serivce", "title": "ISKP releases bulletin on Prophet controversy, threatens attack", "description": "Al-Qaeda in the Indian Subcontinent (AQIS) too recently issued a warning of carrying out 'suicide bombings' in Delhi, Mumbai, Uttar Pradesh and Gujarat in a bid to avenge the insult to the Prophet Mohammed.", "url": "https://indianexpress.com/article/india/iskp-threatens-attack-prophet-controversy-7969991/", "urlToImage": "https://images.indianexpress.com/2022/06/nupur-sharma-1-5.jpeg", "publishedAt": "2022-06-14T22:00:43Z", "content": "The Islamic State has now jumped into the Prophet controversy in India threatening to carry out attacks in the country.The Islamic State Khurasan Province (ISKP), operating in the Indian subcontinent… [+1738 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Krishn Kaushik", "title": "Agnipath recruitment scheme: Why it can help cut the rising salary, pension bill", "description": "The government has either allocated or paid more than Rs. 3.3 lakh crore in defence pension since 2020.", "url": "https://indianexpress.com/article/cities/delhi/agnipath-recruitment-scheme-why-it-can-help-cut-the-rising-salary-pension-bill-7970128/", "urlToImage": "https://images.indianexpress.com/2022/06/rajnath-singh11.jpg", "publishedAt": "2022-06-14T22:00:38Z", "content": "The Agnipath scheme on recruitment of soldiers, sailors and airmen will help cut the salary and pension bill of the armed forces.On Tuesday, when he was asked about this, Defence Minister Rajnath Sin… [+3417 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Portrait of Beant Singh’s assassin put up at Golden Temple museum", "description": "The portrait was unveiled by SGPC president Advocate Harjinder Singh and additional head granthi of Sachkhand Sri Harmandar Sahib, Giani Jagtar Singh.", "url": "https://indianexpress.com/article/cities/amritsar/portrait-of-beant-singhs-assassin-put-up-at-golden-temple-museum-7970126/", "urlToImage": "https://images.indianexpress.com/2022/06/golden-temple-1.jpeg", "publishedAt": "2022-06-14T21:59:40Z", "content": "The Shiromani Gurdwara Parbandhak Committee (SGPC) on Tuesday installed a portrait of the assassin of former Punjab chief minister Beant Singh in the Central Sikh museum of the Golden Temple. SGPC is… [+1312 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kamaldeep Singh Brar", "title": "Why Punjab Police is unhappy with overlapping probe", "description": "Punjab Police is not comfortable with the interest shown, especially by Delhi police, into Sidhu Moosewala murder case.", "url": "https://indianexpress.com/article/cities/amritsar/why-punjab-police-is-unhappy-with-overlapping-probe-7970127/", "urlToImage": "https://images.indianexpress.com/2022/06/moosewala-1.jpg", "publishedAt": "2022-06-14T21:59:13Z", "content": "After the proactive stance of Delhi police in singer Sidhu Moosewala murder case, Maharashtra police held a press conference on Monday regarding important arrests made by their team in relation with … [+2463 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Goa CM: Looking into conversion laws, will make changes if needed", "description": "“If anyone illegally converts by inducement or duress, that will not be tolerated,” said Sawant. “This is not for votes. This is a wrong idea,” he said, when asked if his stance was a political strategy.", "url": "https://indianexpress.com/article/cities/goa/goa-cm-looking-into-conversion-laws-will-make-changes-if-needed-7970123/", "urlToImage": "https://images.indianexpress.com/2022/05/Goa-CM-Pramod-Sawant-1200.jpeg", "publishedAt": "2022-06-14T21:52:17Z", "content": "Panaji: Goa Chief Minister Pramod Sawant said on Tuesday that his legal team was studying anti-conversion laws, and added that if any changes were required, they would be carried out. In an interview… [+779 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "HC disposes 4 petitions by gangsters apprehending threat to their lives", "description": "The first one to approach the High Court was Lawrence Bishnoi, who claimed apprehensions of a fake encounter if he is to be handed over to the Punjab Police for interrogation in the Sidhu Moosewala murder case.", "url": "https://indianexpress.com/article/cities/chandigarh/hc-disposes-4-petitions-by-gangsters-apprehending-threat-to-their-lives-7970124/", "urlToImage": "https://images.indianexpress.com/2022/05/lawrence-bishnoi.jpg", "publishedAt": "2022-06-14T21:50:10Z", "content": "After the killing of singer Sidhu Moosewala at Mansa district in Punjab, either fearing of an attack due to a gang war or a fake encounter by Police, the Punjab and Haryana High Court received has di… [+2902 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi Confidential: On Light Path", "description": "Rajnath Singh, who announced the Agnipath scheme with regard to the new recruitment path for the armed forces on Tuesday, was in a light mood throughout the event.", "url": "https://indianexpress.com/article/delhi-confidential/delhi-confidential-on-light-path/", "urlToImage": "https://images.indianexpress.com/2022/06/rajnath-singh.jpg", "publishedAt": "2022-06-14T21:47:13Z", "content": "Defence Minister Rajnath Singh, who announced the Agnipath scheme with regard to the new recruitment path for the armed forces on Tuesday, was in a light mood throughout the event. After he introduce… [+665 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Santosh Singh", "title": "Bihar population control: JD(U) hits back at ally, says BJP speaking only half-truth", "description": "Just days after BJP’s Bihar unit chief Dr Sanjay Jaiswal’s suggestion that the government, to control state’s population, reward those with only two kids, the ruling party has accused BJP of misleading people on the issue.", "url": "https://indianexpress.com/article/cities/patna/bihar-population-control-jdu-hits-back-at-ally-says-bjp-speaking-only-half-truth-7970105/", "urlToImage": "https://images.indianexpress.com/2022/06/Nitish-kumar-1-2.jpg", "publishedAt": "2022-06-14T21:42:22Z", "content": "Betraying their frosty relations again, the ruling JD (U) and ally BJP in Bihar are not of the same mind on population control. And the differences are growing.Just days after BJPs Bihar unit chief D… [+2210 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Deeptiman Tiwary", "title": "Deadline for freezing administrative boundaries extended, no Census this year", "description": "Since the Census can only begin a few months after the administrative boundaries are frozen, the possibility of a Census in 2022 is ruled out.", "url": "https://indianexpress.com/article/delhi/deadline-for-freezing-administrative-boundaries-extended-no-census-this-year-7970121/", "urlToImage": "https://images.indianexpress.com/2022/03/nrc-day-one.jpeg", "publishedAt": "2022-06-14T21:39:55Z", "content": "The census exercise, which was originally scheduled to take place in 2021, has been further pushed to 2023-24. In a letter sent to all states and Union Territories on Tuesday, the office of the Regis… [+2883 chars]"}]}