{"status": "ok", "totalResults": 479, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Harbour, Pullman explore mental illness with humour in new London play", "description": "The 47-year-old actor, who recently told Britain's Big Issue magazine he was institutionalised and diagnosed with bipolar disorder at 26, said his conversations with the U.S. playwright helped shape the script", "url": "https://indianexpress.com/article/lifestyle/art-and-culture/harbour-pullman-explore-mental-illness-with-humour-in-new-london-play-7989315/", "urlToImage": "https://images.indianexpress.com/2022/06/David-Harbour-1200.jpg", "publishedAt": "2022-06-25T04:45:36Z", "content": "“Stranger Things” star David Harbour says his own experiences with mental illness inspired parts of his new London play “Mad House”, a dark comedy written by acclaimed author Theresa Rebeck.The 47-ye… [+2227 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Earthquake of magnitude 5.7 strikes southern Iran", "description": "The quake's epicentre was in the Southern Iran region and was 8 kilometers below the earth's surface.", "url": "https://indianexpress.com/article/world/iran-earthquake-latest-updates-7990083/", "urlToImage": "https://images.indianexpress.com/2022/06/Breaking_news_IE-2.jpg", "publishedAt": "2022-06-25T04:36:54Z", "content": "By: Reuters | June 25, 2022 10:06:54 am\r\nA magnitude 5.7 earthquake struck Iran on Saturday, European-Mediterranean Seismological Centre (EMSC) said.\r\nThe quake’s epicentre was in the Southern Iran r… [+291 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "A sleepy Baltic rail line gets a geopolitical wake-up call", "description": "This week, long dormant tensions over Kaliningrad erupted, further fraying Russia’s relations with the West, after unfounded claims by Moscow that Europe was choking off train and trucking routes bringing vital supplies to Kaliningrad — and would, as a result…", "url": "https://indianexpress.com/article/world/a-sleepy-baltic-rail-line-gets-a-geopolitical-wake-up-call-7990051/", "urlToImage": "https://images.indianexpress.com/2022/06/RUSSIA-LITHUANIA-RAIL-1.jpg", "publishedAt": "2022-06-25T04:26:39Z", "content": "As war rages in Ukraine, fueling ever-growing tensions between NATO and Russia, a sleepy Baltic railway station with no passengers and few trains this week found itself at the centre of a perilous ne… [+8327 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "US: Abortion ruling imperils gay marriage, other freedoms, liberal justices say", "description": "US Supreme Court's 5-4 ruling on Friday, authored by conservative Justice Samuel Alito, overturned the 1973 Roe v Wade decision that legalised abortion nationwide.", "url": "https://indianexpress.com/article/world/abortion-ruling-imperils-gay-marriage-other-freedoms-liberal-justices-say-7990024/", "urlToImage": "https://images.indianexpress.com/2022/06/us-supreme-court1.jpg", "publishedAt": "2022-06-25T04:23:12Z", "content": "The US Supreme Court’s decision erasing the constitutional right to abortion provides a roadmap to end other freedoms involving marriage, sexuality and birth control, its three liberal members said o… [+4991 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "U.S. crypto firm Harmony hit by $100 million heist", "description": "The California-based company said the heist hit its Horizon \"bridge\", a tool for transferring crypto between different blockchains - the underlying software used by digital tokens such as bitcoin and ether.", "url": "https://indianexpress.com/article/technology/tech-news-technology/u-s-crypto-firm-harmony-hit-by-usd-100-million-heist-7990055/", "urlToImage": "https://images.indianexpress.com/2022/06/cryptocurerncy-reuters.jpg", "publishedAt": "2022-06-25T04:18:47Z", "content": "U.S. crypto firm Harmony said on Friday that thieves stole around $100 million worth of digital coins from one of its key products, the latest in a string of cyber heists on a sector long targeted by… [+1616 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rounak Bagchi", "title": "Explained: How the billion-dollar automobile industry is changing, courtesy Covid-19", "description": "Automakers are moving away from outsourcing towards internalizing most of the production. What catapulted this change? What are automobile companies doing? Is 'Teslafication' the way out?", "url": "https://indianexpress.com/article/explained/automobile-industry-supply-chain-crisis-covid-teslafication-7990040/", "urlToImage": "https://images.indianexpress.com/2022/06/Tesla-1.jpg", "publishedAt": "2022-06-25T04:11:33Z", "content": "The automobile industry, encompassing thousands of companies, millions of workers and billions in sunk costs, is undergoing a once-in-a-century change. Besides shifting from regular internal combusti… [+8146 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Key excerpts from the decision overturning Roe v. Wade", "description": "The Supreme Court on Friday overruled Roe v. Wade, eliminating the constitutional right to an abortion after almost 50 years in a 6-3 ruling. New York Times reporters read the majority opinion and provided analysis below.", "url": "https://indianexpress.com/article/world/key-excerpts-from-the-decision-overturning-roe-v-wade-7989924/", "urlToImage": "https://images.indianexpress.com/2022/06/Reuters-1.jpg", "publishedAt": "2022-06-25T04:06:07Z", "content": "Introduction, Page 1: For the first 185 years after the adoption of the Constitution, each State was permitted to address this issue in accordance with the views of its citizens.\r\nFridays historic op… [+18155 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Watch: Sri Lankan fans rousing reception to Australian cricket team in Colombo", "description": "Sri Lanka is in the midst of its worst financial crisis since independence in 1948, forcing the island nation's population to endure power cuts, shortages and months of sometimes violent protests.", "url": "https://indianexpress.com/article/sports/cricket/watch-sri-lankan-fans-rousing-reception-to-australian-cricket-team-in-colombo-7990042/", "urlToImage": "https://images.indianexpress.com/2022/06/Sri-Lanka-fans.jpg", "publishedAt": "2022-06-25T04:05:46Z", "content": "The Australian cricket team on Friday received a rousing reception from the Colombo crowd in Sri Lanka after Alex Carey got the visitors home in final limited-overs match. Australia won the T20I seri… [+2314 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Nothing to OnePlus: Most anticipated phones expected to launch in July 2022", "description": "From Nothing phone (1) and Xiaomi 12 Ultra to OnePlus Nord 2T and Asus ROG Phone 6 - Check out the most anticipated smartphones expected to launch in July 2022.", "url": "https://indianexpress.com/article/technology/mobile-tabs/nothing-to-oneplus-most-anticipated-phones-expected-to-launch-in-july-2022-7989254/", "urlToImage": "https://images.indianexpress.com/2022/06/Phones-launching-in-July.jpg", "publishedAt": "2022-06-25T04:03:35Z", "content": "Were almost at the end of the month but speculations around new, upcoming smartphones are higher than ever ahead of July, when a number of phones across brands are expected to release. From Nothings … [+4564 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "JugJugg Jeeyo box office collection day 1: Varun Dhawan-Anil Kapoor film gets decent opening, almost hits Gangubai Kathiawadi numbers", "description": "JugJugg Jeeyo box office day 1: Anil Kapoor, Kiara Advani, Neetu Kapoor, and Varun Dhawan-starrer has performed well in the Hindi-speaking belt of the country.", "url": "https://indianexpress.com/article/entertainment/bollywood/box-office-collection/jugjugg-jeeyo-box-office-collection-day-1-varun-dhawan-anil-kapoor-film-gets-decent-opening-7990007/", "urlToImage": "https://images.indianexpress.com/2022/06/jugjugg-jeeyo-box-office-1.jpg", "publishedAt": "2022-06-25T04:01:10Z", "content": "Dharma Productions’ latest release, JugJugg Jeeyo, has received a decent opening at the box office. The film has done good business in the Northern belt of the country, especially in the Delhi-NCR re… [+1798 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Ludhiana Improvement Trust: ‘One flat, one family’ rule to be applied in Atal Apartment scheme", "description": "LIT executive officer said that as per norms, one family, including spouse and dependent children, is entitled for one flat and in case of having more than one allotment to a family, extra flat allotments have to be surrendered by the family concerned.", "url": "https://indianexpress.com/article/cities/ludhiana/ludhiana-improvement-trust-one-flat-one-family-atal-apartment-scheme-housing-7990026/", "urlToImage": "https://images.indianexpress.com/2022/06/FLATS-HOUSING.jpg", "publishedAt": "2022-06-25T03:52:59Z", "content": "A week after the Ludhiana Improvement Trust (LIT) held draw of lots for allotment of flats under the high-rise residential scheme ‘Atal Apartments’ named after former prime minister Atal Bihari Vajpa… [+1435 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Noida Authority warns Sunshine Helios builder to hand over society to residents", "description": "As per residents, an order was issued by the Allahabad High Court last year which stated that the builder had to hand over the maintenance of the housing society to the Association of Apartments (AoA).", "url": "https://indianexpress.com/article/delhi/noida-authority-warns-sunshine-helios-builder-to-hand-over-society-to-residents-7990018/", "urlToImage": "https://images.indianexpress.com/2022/05/real-estate-1200.jpg", "publishedAt": "2022-06-25T03:50:52Z", "content": "The Noida Authority has issued a final warning to the builder of a high-rise in Sector 78, Sunshine Helios, to complete the handover process of the society to its residents.In previous instances, sev… [+2304 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Days after residents ‘assaulted’, Sunshine Helios builder given final warning by Noida authority", "description": "According to the secretary of the Association of Apartments, maintenance responsibilities have not been handed over to them for years despite several indictments.", "url": "https://indianexpress.com/article/cities/delhi/sunshine-helios-builder-final-warning-noida-authority-7990020/", "urlToImage": "https://images.indianexpress.com/2022/06/sunshine-helios.jpeg", "publishedAt": "2022-06-25T03:49:28Z", "content": "Noida Authority has issued a final warning to Helios builders to complete the handover process to its residents. As per the residents, an order was issued by the Allahabad High Court last year which … [+1575 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Hrithik Roshan’s ex-wife Sussanne Khan gushes over his girlfriend Saba Azad: ‘So pretty Saboo’", "description": "Hrithik Rishan's ex-wife Sussanne Khan and his girlfriend Saba Azad often interact with each other on social media.", "url": "https://indianexpress.com/article/entertainment/bollywood/hrithik-roshans-former-wife-sussanne-khan-calls-his-girlfriend-saba-azads-so-pretty-saboo-check-new-post-7989957/", "urlToImage": "https://images.indianexpress.com/2022/06/Collage-Maker-25-Jun-2022-09.04-AM.jpg", "publishedAt": "2022-06-25T03:46:59Z", "content": "Hrithik Roshan’s girlfriend Saba Azadand his ex-wife Sussanne Khan have been setting benchmarks on how to handle changing relationships with maturity. Sussanne and Saba comment on each others’ social… [+1450 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Delhi News Live: KYS claims their activists ‘violently’ detained by police Agnipath protests; Capital logs 1,447 new Covid-19 cases", "description": "Delhi News Live: Delhi recorded 1,447 new Covid cases and one more death on Friday, while the positivity rate dropped to 5.98 per cent.", "url": "https://indianexpress.com/article/delhi/delhi-news-live-kys-claims-their-activists-violently-detained-by-police-agnipath-protests-capital-logs-1447-new-covid-19-cases-7989941/", "urlToImage": "https://images.indianexpress.com/2022/06/KYS.jpg", "publishedAt": "2022-06-25T03:46:37Z", "content": "Delhi news live: Krantikari Yuva Sangathan on Friday claimed that its activists were “forcefully and violently detained” during a protest against the Agnipath defence recruitment scheme at Delhi’s Ja… [+1555 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Khattar approves several infrastructure projects in Gurgaon", "description": "Khattar approved several infrastructure and maintenance projects to expand road network, sewage, drainage and other civic amenties in the city.", "url": "https://indianexpress.com/article/cities/delhi/khattar-approves-several-infrastructure-projects-in-gurgaon-7989893/", "urlToImage": "https://images.indianexpress.com/2022/06/KHATTAR-4-2.jpg", "publishedAt": "2022-06-25T03:41:05Z", "content": "Haryana chief minister Manohar Lal Khattar on Friday gave the approval to upgrade the Southern Peripheral Road (SPR) from village Ghata to NH-48 via Vatika Chowk. Under the project, it has been propo… [+2853 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Can having certain combination of foods worsen vitiligo? Expert busts some common myths", "description": "World Vitiligo Day 2022: The condition is characterised by white spots on the skin that appear as a result of the loss of melanocytes within the skin", "url": "https://indianexpress.com/article/lifestyle/health/can-having-certain-combination-of-foods-worsen-vitiligo-expert-busts-some-common-myths7981391/", "urlToImage": "https://images.indianexpress.com/2022/06/WhatsApp-Image-2022-06-21-at-12.13.10-PM.jpeg", "publishedAt": "2022-06-25T03:40:56Z", "content": "Vitiligo, also known as Leucoderma (white skin) or white leprosy, is an autoimmune condition in which the body’s immune system attacks healthy pigmentary cells called melanocytes, eventually affectin… [+3530 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Man robbed of Rs 34 lakh on Sarai Rohilla flyover", "description": "The victim, Vicky Gupta, was on his scooter when the accused allegedly hit him with their bike and Gupta fell on the road. While he was trying to get up, the accused waylaid him and fled with his bag containing Rs 34 lakh in cash, police said.", "url": "https://indianexpress.com/article/delhi/man-robbed-of-rs-34-lakh-on-sarai-rohilla-flyover-7989987/", "urlToImage": "https://images.indianexpress.com/2022/06/money-3.jpeg", "publishedAt": "2022-06-25T03:36:36Z", "content": "A money transfer agent was allegedly robbed of Rs 34 lakh by two bike-borne men in North Delhi Wednesday night on the busy streets of Sarai Rohilla, police said.The victim, Vicky Gupta, was on his sc… [+882 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Regularly monitor cotton fields for pink bollworm, says Punjab Agricultural University", "description": "Dr Pratiba Vyas, a microbiology expert, said that biofertilizers were low cost, eco-friendly, pollution free microbial inoculants that helped in maintaining soil fertility and enhancing crop productivity.", "url": "https://indianexpress.com/article/cities/ludhiana/cotton-crop-fields-punjab-agricultural-university-pink-bollworm-7989985/", "urlToImage": "https://images.indianexpress.com/2022/06/cotton-1.jpg", "publishedAt": "2022-06-25T03:35:55Z", "content": "The Punjab Agricultural University (PAU) Ludhiana, Friday said that farmers in the state should regularly monitor their cotton crop fields to check pink bollworm incidence. Cotton growers should moni… [+979 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sandeep Dwivedi", "title": "Little India will decide India’s big IPL digital push", "description": "Weekly Sports Newsletter: The e-auction of media rights for the IPL’s 2023-2027 cycle has fetched the BCCI Rs 48,390 crore, with Disney-Star bagging TV rights for the Indian subcontinent and Viacom18/ Reliance sweeping the digital segment.", "url": "https://indianexpress.com/article/sports/cricket/weekly-sports-newsletter-little-india-will-decide-indias-big-ipl-digital-push-7989863/", "urlToImage": "https://images.indianexpress.com/2022/05/Hardik-Pandya-2.jpg", "publishedAt": "2022-06-25T03:31:58Z", "content": "Dear Readers,\r\nThe migrants making daily video calls home. The headphone-wearing daily-commuting young digital native. GPS navigation-equipped cabbies with time to kill between trips. Villagers not c… [+9632 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rahel Philipose", "title": "Daily Briefing: Visiting Eknath Shinde’s native village; what’s behind the fuel shortage", "description": "In today’s edition: We visit Eknath Shinde’s native village in Maharashtra; How a daily wager’s son put Karnataka wrestling hub in the spotlight; Need to accelerate reform pace in energy transition, says Niti Aayog CEO; and more.", "url": "https://indianexpress.com/article/live-news/daily-briefing-visiting-eknath-shindes-native-village-whats-behind-the-fuel-shortage-7989960/", "urlToImage": "https://images.indianexpress.com/2022/06/Express-intro-7.jpeg", "publishedAt": "2022-06-25T03:24:04Z", "content": "Get your weekend started with the top 5 stories from today’s edition: We visit Eknath Shindes native village in Maharashtra; How a daily wagers son put Karnataka wrestling hub in the spotlight; Need … [+4022 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "BSF opens fire, injures two intruding Pakistani fishermen trying to flee", "description": "The BSF patrol challenged the escaping Pakistani fishermen, but they did not stop, and BSF troops had to open fire to apprehend them. Both the fishermen sustained bullet injuries in the ankles, and were evacuated to a hospital.", "url": "https://indianexpress.com/article/cities/ahmedabad/bsf-opens-fire-injures-two-intruding-pakistani-fishermen-trying-to-flee-7989928/", "urlToImage": "https://images.indianexpress.com/2022/06/boat-759.jpg", "publishedAt": "2022-06-25T03:23:33Z", "content": "In a hot pursuit, the Border Security Force (BSF) in Gujarat apprehended two Pakistani fishermen who intruded into Indian territory at Harami Nala area of Kutch district. The paramilitary personnel o… [+1276 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Jagpreet Singh Sandhu", "title": "Matrimony Case transfer petition: HC dismisses woman’s plea, calls it most misused provision to harass poor husband", "description": "The Bench of Justice Fatehdeep Singh, after hearing the matter, said that the husband has invoked his right of restitution of conjugal rights and to argue, the wife had sought maintenance.", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-haryana-high-court-matrimonial-case-dispute-husband-wife-7989961/", "urlToImage": "https://images.indianexpress.com/2022/06/Punjab-and-Haryana-HC-2.jpg", "publishedAt": "2022-06-25T03:21:51Z", "content": "Dismissing the application of a woman seeking transfer of a matrimonial dispute case filed by her husband to her hometown in Moga, the Punjab and Haryana High Court (HC) has said that, it is the most… [+1388 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Sourav Ganguly invited me to IPL twice, but I refused: PCB chief Ramiz Raja", "description": "The PCB has also decided to challenge the proposed two-and-a-half-month expanded window for the IPL. Raja said that the issue will be raised at the next ICC conference.", "url": "https://indianexpress.com/article/sports/cricket/sourav-ganguly-invited-me-to-ipl-twice-but-i-refused-pcb-chief-ramiz-raja-7989965/", "urlToImage": "https://images.indianexpress.com/2021/08/ramiz-raja.jpg", "publishedAt": "2022-06-25T03:18:26Z", "content": "“Twice Ganguly has invited me to attend the IPL finals last year and this year and cricketing wise it made sense to go, but then, because of the situation, we had to look at the fallout of accepting … [+1601 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Jammu and Kashmir forms panel for G20 meetings in 2023", "description": "The G20 meetings are likely to be Jammu and Kashmir's first major event since the revocation of the former state’s special status in 2019.", "url": "https://indianexpress.com/article/cities/srinagar/jk-forms-panel-for-g20-meetings-in-2023-7989916/", "urlToImage": "https://images.indianexpress.com/2022/06/g20-file.jpg", "publishedAt": "2022-06-25T03:10:05Z", "content": "The Jammu and Kashmir administration has constituted an overall coordination committee for meetings to be held in 2023, as India assumes the presidency of the G20.The committee will be chaired by the… [+1164 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sukhbir Siwach", "title": "Independents got twice the no. of BJP’s votes in Haryana civic body polls", "description": "Haryana BJP president Om Prakash Dhankar said that the civic elections prove that the party’s base has expanded in the state.", "url": "https://indianexpress.com/article/cities/chandigarh/haryana-civic-municipal-elections-independents-bjp-inld-7989932/", "urlToImage": "https://images.indianexpress.com/2022/06/election.jpg", "publishedAt": "2022-06-25T03:05:48Z", "content": "The BJP might be jubilant by winning in 22 of the 46 municipalities, which went for polls on June 19, but the independent candidates have secured about double of BJPs vote percentage. BJPs alliance p… [+2811 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Mumbai vs Madhya Pradesh, Ranji Trophy Final Day 4 Live Score Updates: Madhya Pradesh in control", "description": "Ranji Trophy Final, Day 4 Live Cricket Score Streaming Online Today Match, Star Sports 1, Hotstar Live: Madhya Pradesh vs Mumbai takes place in Bengaluru", "url": "https://indianexpress.com/article/sports/cricket/ranji-trophy-final-day-4-madhya-pradesh-vs-mumbai-live-score-7989845/", "urlToImage": "https://images.indianexpress.com/2022/06/Ranji-Final-Live.jpg", "publishedAt": "2022-06-25T03:00:59Z", "content": "Mumbai vs Madhya Pradesh, Ranji Trophy Final, Day 4 Live Cricket Score Streaming Online Today Match Updates: \r\nMP 7 runs away from lead and possibly, from a Ranji Trophy title after Dubey, Shubham to… [+1488 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Mo Salah likely to leave Liverpool: Reports", "description": "Salah has scored 31 goals for Liverpool in the last season.", "url": "https://indianexpress.com/article/sports/football/mo-salah-likely-to-leave-liverpool-reports-7989935/", "urlToImage": "https://images.indianexpress.com/2022/06/Mo-Salah.jpg", "publishedAt": "2022-06-25T02:54:24Z", "content": "As per the reports, the Egyptian mid-fielder has been in deadlock with the club for almost a year over his pay demand of £400,000 a week to sign a new deal.\r\nSalah has scored 31 goals for Liverpool i… [+1653 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Two dead, 14 wounded in Norway nightclub shooting, police say", "description": "Helicopters hovered above central Oslo while ambulance and police car sirens were heard across the city.", "url": "https://indianexpress.com/article/world/norway-nighclub-shooting-oslo-7989912/", "urlToImage": "https://images.indianexpress.com/2022/06/norway.jpg", "publishedAt": "2022-06-25T02:51:29Z", "content": "Two people were killed and 14 wounded on Saturday in a shooting at a nightclub and in nearby streets in Norway’s capital Oslo, Norwegian police said.A suspect believed to be the sole perpetrator was … [+1055 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Raakhi Jagga", "title": "Punjab Agnipath protests: ‘Our sons will be jobless, kisans & jawans are linked’", "description": "Interestingly in Sangrur, where only 45.3% people turned out to vote on Thursday, a huge crowd of locals came out to join Friday's protests, with dharnas being staged at more than 15 places of the Parliamentary constituency .", "url": "https://indianexpress.com/article/cities/ludhiana/agnipath-scheme-protests-farmers-punjab-unions-7989919/", "urlToImage": "https://images.indianexpress.com/2022/06/punjab-agnipath-1.jpg", "publishedAt": "2022-06-25T02:45:10Z", "content": "The farm unions of Punjab on Friday, in response to a call given by the Sanyukta Kisan Morcha (SKM), held protests at 90 places of the state against the Agnipath scheme of the Union Government.The fa… [+2653 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Arushi Jain", "title": "Elvis, JugJugg Jeeyo, The Girl from Plainville: Top shows, films to watch this weekend", "description": "Looking for your weekend binge? For this weekend, we have 6 titles that would be totally worth your time -- from The Girl from Plainville on Lionsgate Play to Elvis in cinemas.", "url": "https://indianexpress.com/article/entertainment/web-series/elvis-jugjugg-jeeyo-the-girl-from-plainville-top-shows-films-to-watch-this-weekend-7988558/", "urlToImage": "https://indianexpress.com/wp-content/themes/indianexpress/images/IE-OGimage.jpg", "publishedAt": "2022-06-25T02:37:03Z", "content": "This weekend, filmmaker Raj Mehta has brought back typical Dharma entertainment into our lives with his film JugJugg Jeeyo, starring an ensemble cast including actors Anil Kapoor, Varun Dhawan, Neetu… [+4406 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Mimansa Shekhar", "title": "When Kareena Kapoor said no one supported Karisma Kapoor as she made her Bollywood debut: How the actor emerged as a star", "description": "Karisma Kapoor ruled the Bollywood in 1990s with her dance moves, comic timing and several performance-backed roles. Here's looking back at her formidable career so far.", "url": "https://indianexpress.com/article/entertainment/bollywood/karisma-kapoor-family-legacy-rise-of-actor-best-films-90s-7985291/", "urlToImage": "https://images.indianexpress.com/2022/06/karisma-kapoor-1200.jpg", "publishedAt": "2022-06-25T02:36:46Z", "content": "Karisma Kapoor was 17 when she entered Bollywood and the pressure was intense. More than dealing with push-and-shove of the Hindi film industry at a young age, she had to deal with keeping up with he… [+6556 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sampada Sharma", "title": "Sanjeev Kumar-Rehana Sultan’s National Award-winning film Dastak examines loneliness in Bombay through the prism of morality", "description": "Rajinder Singh Bedi's Dastak examines the idea of urban isolation for a woman who is not allowed to work, and is jailed inside her apartment.", "url": "https://indianexpress.com/article/entertainment/bollywood/sanjeev-kumar-rehana-sultan-national-award-dastak-examines-loneliness-in-bombay-through-prism-of-morality-7988987/", "urlToImage": "https://images.indianexpress.com/2022/06/Dastak-3.jpeg", "publishedAt": "2022-06-25T02:36:12Z", "content": "We have seen in films and shows that the cramped Mumbai does not allow its lovebirds to take flight. Many films across the decades have explored this concept but Rajinder Singh Bedi’s 1970 film Dasta… [+4073 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shaikh Ayaz", "title": "Shah Rukh Khan rings in 30 years in the Hindi film industry: What does he mean to Indian audiences?", "description": "For the first time in years, Shah Rukh Khan might be feeling the weight of the throne that goes by the name of King Khan. Much now depends on his upcoming films (Dunki, Pathaan and Jawan).", "url": "https://indianexpress.com/article/entertainment/bollywood/shah-rukh-khan-rings-in-30-years-in-the-hindi-film-industry-7989335/", "urlToImage": "https://images.indianexpress.com/2022/01/srk-1.jpg", "publishedAt": "2022-06-25T02:35:52Z", "content": "Will the idea of stardom die with Shah Rukh Khan, as Karan Johar recently suggested? Not everyone agreed. A week after that comment was made, Anil Kapoor, who’s one of the protagonists of Johar’s new… [+5250 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Shah Rukh Khan’s love story with India, decoded through his films", "description": "Shah Rukh broke into Bollywood as India became liberalised, his DDLJ years signify a new risk-averse India’s rise and the last decade has him, and us, finding our feet in a quickly-changing world. So, which is your favourite SRK movie?", "url": "https://indianexpress.com/article/entertainment/bollywood/shah-rukh-khan-love-story-with-india-srk-best-films-7989304/", "urlToImage": "https://images.indianexpress.com/2022/06/shah-rukh-khan-movies.jpg", "publishedAt": "2022-06-25T02:35:14Z", "content": "Shah Rukh Khan remains one of the few people in India who needs no introduction. The boy-next-door from Delhi who became a mega, mega star. The man who has reigned over Bollywood the core of the coun… [+9744 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anju Agnihotri Chaba", "title": "Punjab women’s share in NREGS increases by 8.25%", "description": "Data sourced from the NREGA portal showed that SC and women’s share in total person-days was 74.67% and 68.37%, respectively, in first 100 days from April to June 20, as against 67.11% and 60.12%, respectively, in the entire last financial year.", "url": "https://indianexpress.com/article/cities/jalandhar/punjab-women-national-rural-employment-guarantee-scheme-nregs-7989908/", "urlToImage": "https://images.indianexpress.com/2022/06/women.jpg", "publishedAt": "2022-06-25T02:31:35Z", "content": "The participation of the Scheduled Caste (SC) and women in National Rural Employment Guarantee Scheme (NREGS) in Punjab has grown by leaps and bounds in the first quarter 100 days (April 1 to June 20… [+3210 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "While You Were Asleep: Jesus set to join Arsenal, Manchester City to rope in Phillips, Stokes equals Gilchrist’s record", "description": "Arsenal have reached an agreement in principle with Manchester City to sign Gabriel Jesus. Manchester City have agreed a deal with Leeds for England midfielder Kalvin Phillips.", "url": "https://indianexpress.com/article/sports/sport-others/while-you-were-asleep-jesus-set-to-join-arsenal-manchester-city-to-rope-in-phillips-stokes-equals-gilchrists-record-7989907/", "urlToImage": "https://images.indianexpress.com/2022/06/While-You-Were-Asleep-3-2.jpg", "publishedAt": "2022-06-25T02:28:13Z", "content": "Premier League champions Manchester City has agreed to sell their Brazilian striker Gabriel Jesus to Arsenal. Both the clubs have reached a full verbal agreement. There is still work to do to finalis… [+2915 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Anne Frank: Google commemorates the 75th anniversary of Anne Frank’s diary", "description": "Anne Frank Google Doodle: Over time, Anne Frank's diary has become one of the world's best-selling books, and continues to serve as the inspiration for several plays and films.", "url": "https://indianexpress.com/article/trending/trending-in-india/anne-frank-google-doodle-7989865/", "urlToImage": "https://images.indianexpress.com/2022/06/google-doodle-anne-frank.jpg", "publishedAt": "2022-06-25T02:24:05Z", "content": "Google on Saturday commemorated the 75th anniversary of the publication of The Diary of a Young Girl by Anne Frank, with a Google doodle video depicting moments from her life in the book.The doodle a… [+1755 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Agnipath scheme: Farmers stage protests in Haryana, Punjab", "description": "The Samyukta Kisan Morcha (SKM) has termed the Agnipath scheme as “anti-military, anti-farmer and anti-national”.", "url": "https://indianexpress.com/article/cities/chandigarh/agnipath-scheme-protests-punjab-haryana-skm-army-7989903/", "urlToImage": "https://images.indianexpress.com/2022/06/punjab-farmers.jpg", "publishedAt": "2022-06-25T02:15:58Z", "content": "On the call of Samyukta Kisan Morcha (SKM), the farmer outfits on Friday staged protests in several parts of Haryana to raise their voice against the Agnipath scheme of the central government. After … [+1078 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Kabaddi player who got weapons from gangster Goldy Brar held", "description": "Police said that kabaddi player Jaskaran Singh alias Karan of Bhadson of Patiala had received three weapons in March this year from gangster Goldy Brar, also an accused in Sidhu Moosewala murder case and is believed to be in Canada.", "url": "https://indianexpress.com/article/cities/ludhiana/punjab-sidhu-moosewala-goldy-brar-gangster-kabaddi-player-illegal-weapons-7989898/", "urlToImage": "https://images.indianexpress.com/2022/06/Goldy-Brar-Sidhu-Moosewala-1.jpg", "publishedAt": "2022-06-25T02:09:32Z", "content": "Ludhiana police on Friday arrested a 21-year-old kabaddi player for allegedly supplying illegal weapons to transporter Baldev Chaudhary, an aide of gangster Lawrence Bishnoi who was the mastermind of… [+1839 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sweety Kumari", "title": "Gorkhaland demand pushed to GTA poll margins as bread-and-butter issues flare", "description": "With local residents mainly concerned about burning issues like the lack of employment opportunities and basic amenities, which have worsened in the wake of the Covid pandemic, the long-standing demand for a separate state of Gorkhaland seems to have been rel…", "url": "https://indianexpress.com/article/political-pulse/gorkhaland-demand-pushed-to-gta-poll-margins-7989844/", "urlToImage": "https://images.indianexpress.com/2022/06/Darjeeling.jpg", "publishedAt": "2022-06-25T02:06:05Z", "content": "The wind appears to be blowing in a different direction in the Darjeeling region ahead of the June 26 Gorkha Territorial Administration (GTA) election, which is taking place after a gap of 10 years.W… [+5769 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "‘It’s become real’: Abortion decision roils US midterms, sending fight to States", "description": "For years, the prospect of overturning Roe v Wade was an abstract concept for many Americans — a distressing but distant worry for some and a long-term goal rather than an imminent possibility to others.", "url": "https://indianexpress.com/article/world/us-abortion-decision-roils-midterms-sending-fight-to-states-7989862/", "urlToImage": "https://images.indianexpress.com/2022/06/SCOTUS-ABORTION-28.jpg", "publishedAt": "2022-06-25T02:03:41Z", "content": "The Supreme Courts decision overturning Roe v Wade on Friday catapulted the explosive battle over abortion rights into the centre of several marquee midterm races, turning the fight over key governor… [+10588 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kanchan Vasdev", "title": "National Achievement Survey says Punjab No. 1, CM Mann calls ranking fake", "description": "“You cannot just paint the schools from outside and claim them to be number one. The catch is in the education standards. When the schools are without staff and amenities they cannot be number 1,\" CM Bhagwant Mann said.", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-national-achievement-survey-schools-budget-session-bhagwant-mann-7989891/", "urlToImage": "https://images.indianexpress.com/2022/06/BHAGWANT-MANN-1.jpg", "publishedAt": "2022-06-25T02:00:16Z", "content": "Punjab CM Bhagwant Mann on Friday said Punjabs top rank in Centres National Achievement Survey (NAS) was fake and they would uncover the reality in the days to come.You cannot just paint the schools … [+1958 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Navjeevan Gopal", "title": "Punjab budget session Day 1: Opposition sets pitch, questions govt silence on sacrilege cases, rising crime", "description": "The first day of budget session was largely marked by law and order issue, with opposition blaming the hundred days of AAP govt, and AAP MLAs hitting back blaming gangsterism in Punjab as a legacy of previous Congress and Akali Dal governments.", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-budget-session-2022-sacrilege-aap-congress-sidhu-moosewala-corrupton-crime-7989853/", "urlToImage": "https://images.indianexpress.com/2022/06/PUNJAB-budget.jpg", "publishedAt": "2022-06-25T01:53:48Z", "content": "The October 2015 incidents of sacrilege of the Guru Granth Sahib in Bargari and the subsequent killing of two anti-sacrilege protesters were raised in Vidhan Sabha by Congress MLA from Qadian and lea… [+3725 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Chennai power cut: These areas in Chennai will face a power cut today", "description": "Chennai power disruption June 25, Saturday: Parts of Chennai will face a power cut from 9 am to 2 pm for maintenance work today.", "url": "https://indianexpress.com/article/cities/chennai/chennai-power-cut-these-areas-in-chennai-will-face-a-power-cut-today-7989816/", "urlToImage": "https://images.indianexpress.com/2022/06/electricity-reuters-1200-2-1-15.jpeg", "publishedAt": "2022-06-25T01:30:09Z", "content": "The Tamil Nadu Generation and Distribution Corporation (Tangedco) has announced that power will be suspended in parts of Chennai today in Tambaram, Guindy, Porur, KK Nagar, Avadi, Perambur, Ponneri/s… [+978 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Chandigarh State Consumer Forum: Car maker’s appeal junked, told to refund price of faulty vehicle, other costs to buyer", "description": "The complainant stated that at the time of purchasing the car, she had not thought that she would need to get it repaired so frequently — 6 times by the dealership within a period of 2-3 months from its purchase — thereby heavily depreciating its value.", "url": "https://indianexpress.com/article/cities/chandigarh/chandigarh-consumer-forum-car-makers-appeal-junked-told-to-refund-price-of-faulty-vehicle-other-costs-to-buyer-7989838/", "urlToImage": "https://images.indianexpress.com/2022/06/27-Maruti-2col.jpg", "publishedAt": "2022-06-25T01:23:04Z", "content": "The Chandigarh State Consumer Disputes Redressal Commission has dismissed the appeal filed by Maruti Suzuki India Limited against the order of District Consumer Commission that had directed the compa… [+3269 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Parul", "title": "Chandigarh: Most hospitalisations due to co-morbid illnesses rather than Covid-19, say doctors", "description": "Chandigarh Friday recorded 96 new positive cases, with the average number of positive cases in the last seven days being 65 and the positivity rate in the last one week being 5.59 per cent. The active cases are 458.", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-chandigarh-covid-cases-hospitals-illness-co-morbid-coronavirus-7989836/", "urlToImage": "https://images.indianexpress.com/2022/06/covid-19-3-1.jpg", "publishedAt": "2022-06-25T01:00:41Z", "content": "THE last one week has seen a steady rise in hospitalisation numbers in Chandigarh, with the average occupancy of Covid beds with oxygen in government hospitals between 15 and 23, and the number of pe… [+3479 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mohali: Surge in Covid cases puts health officials on alert, special wards reactivated", "description": "Mohali Civil Surgeon, Dr Adarsh Pal Kaur, said that Covid-19 had not gone away from the society and people should not become complacent and follow protocols.", "url": "https://indianexpress.com/article/cities/sas-nagar-mohali/punjab-mohali-covid-cases-surge-health-officials-alert-protocol-vaccination-camps-7989834/", "urlToImage": "https://images.indianexpress.com/2022/06/ahmedabad-1.jpg", "publishedAt": "2022-06-25T00:49:13Z", "content": "The Mohali health department has put its officials on alert and ordered the restart of Covid wards at various hospitals, as the number of virus cases in the district witnesses a surge.The district ad… [+1368 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Saurabh Parashar", "title": "Chandigarh police reply to RTI: CCTV cameras at police stations, police posts developed snags 13,699 times in past 5 years", "description": "The complaints about the faulty CCTV cameras were received at the communication wing of the Chandigarh Police between January 2017 and May 2022. The wing has been maintaining the CCTV cameras installed at the police stations and police posts since 2014.", "url": "https://indianexpress.com/article/cities/chandigarh/chandigarh-police-rti-application-reply-cctv-cameras-police-stations-security-7989831/", "urlToImage": "https://images.indianexpress.com/2022/06/CCTV-1.jpg", "publishedAt": "2022-06-25T00:41:26Z", "content": "A TOTAL of 157 CCTV cameras installed at 16 police stations and 11 police posts in Chandigarh have developed faults at least 13,699 times in the last five years, reveals reply to the RTI application … [+2325 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "অম্বুবাচীতেও খোলা তারাপীঠ মন্দির, চলছে পুজোপাঠ, জানুন এর রহস্য", "description": "এই সময় ধূপ-দীপ জ্বালিয়ে পূজা করা, মন্দিরে প্রবেশ ও দর্শন বন্ধ রাখা, বিগ্রহ স্পর্শ না-করা, গৃহ দেবতার নিত্যসেবা বাদ দেওয়াই বিধেয়।", "url": "https://bengali.indianexpress.com/lifestyle/tarapith-ambubachi-what-is-the-reason-461354/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/tarapith.jpg", "publishedAt": "2022-06-25T00:30:00Z", "content": ", , , , , , , , , ’ \r\n, , , \r\n , , , , \r\n - , , ?\r\n , , - , , -, , \r\n, , - - - \r\nStay updated with the latest news headlines and all the latest Lifestyle news download Indian Express Bengali App.\r\nWe… [+45 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Varinder Bhatia", "title": "Speaker forms protocol committee: Haryana to rein in its babus showing contempt for MLAs", "description": "In case any MLA faces humiliation by any officer, the MLA would be required to submit a written complaint alleging protocol violation to the Secretary, Vidhan Sabha.", "url": "https://indianexpress.com/article/cities/chandigarh/haryana-vidhan-sabha-speaker-protocol-committee-babus-contempt-mla-7989828/", "urlToImage": "https://images.indianexpress.com/2022/06/haryana-vidhan-sabha-759.jpg", "publishedAt": "2022-06-25T00:24:53Z", "content": "Not answering their phone calls, not ensuring adequate seating arrangement on the dias during government functions in their constituencies, delay in sending invitation cards or not printing names of … [+5505 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Sameer Wankhede to file plea against excise commissioner order", "description": "Sameer Wankhede’s liquor licence was cancelled for allegedly falsifying his age to obtain the same. He had approached the High Court in February challenging the Thane Excise Collector order.", "url": "https://indianexpress.com/article/cities/mumbai/sameer-wankhede-transfer-rumours-file-plea-against-excise-commissioner-order-7989823/", "urlToImage": "https://images.indianexpress.com/2022/06/ch1586638-1-1.jpeg", "publishedAt": "2022-06-24T23:25:41Z", "content": "FORMER NCB Zonal director Sameer Wankhede told the Bombay High Court on Friday that the State Excise Commissioner has dismissed his appeal challenging the order passed by the Thane Excise Collector c… [+914 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Sameer Wankhede to file plea against excise commissioner order", "description": "Sameer Wankhede’s liquor licence was cancelled for allegedly falsifying his age to obtain the same. He had approached the High Court in February challenging the Thane Excise Collector order.", "url": "https://indianexpress.com/article/cities/mumbai/sameer-wankhede-to-file-plea-against-excise-commissioner-order-7989823/", "urlToImage": "https://images.indianexpress.com/2022/06/ch1586638-1-1.jpeg", "publishedAt": "2022-06-24T23:25:41Z", "content": "FORMER NCB Zonal director Sameer Wankhede told the Bombay High Court on Friday that the State Excise Commissioner has dismissed his appeal challenging the order passed by the Thane Excise Collector c… [+916 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "The new workplace", "description": "Co-working manifesto places the interest of workers at the heart of the enterprise, provides them a space they are in control of", "url": "https://indianexpress.com/article/opinion/editorials/the-new-workplace-7989608/", "urlToImage": "https://images.indianexpress.com/2022/06/edit-new-logo-6-5.jpeg", "publishedAt": "2022-06-24T23:10:32Z", "content": "The West Bengal Housing Infrastructure Development Corporation (HIDCO) has introduced Happy Works, a co-working space in Kolkatas growing commercial hub, New Town. At affordable rates of Rs 30 for 90… [+1906 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "No silver bullet", "description": "Bipartisan support for gun control legislation is a historic moment in US politics. But the issue remains a divisive one", "url": "https://indianexpress.com/article/opinion/editorials/united-states-gun-control-legislation-joe-biden-7989605/", "urlToImage": "https://images.indianexpress.com/2022/06/edit-new-logo-6-4.jpeg", "publishedAt": "2022-06-24T23:00:20Z", "content": "The bipartisan support in the US Senate for the passage of the most significant gun control legislation in three decades is historic by any measure. As many as 15 Republican senators voted to overrid… [+2328 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Explained: Study finds potential in using non-humanoid robots for teaching children with autism", "description": "The paper was presented at IEEE International Conference on Robotics and Automation in Xi'an, China in 2021. It has now won the IISc’s Murthy Govindaraju ‘Women in Computer Science’ Research Endowment Award for one of its lead authors, Nabanita Paul.", "url": "https://indianexpress.com/article/explained/explained-study-finds-potential-in-using-non-humanoid-robots-for-teaching-children-with-autism-7989642/", "urlToImage": "https://images.indianexpress.com/2022/06/explained-robot.jpg", "publishedAt": "2022-06-24T22:49:26Z", "content": "RobotICs has been used as teaching aids for children with autism spectrum disorder (ASD), but these interventions have often been expensive humanoids. A research paper examines whether non-humanoid r… [+2215 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "Let there be data", "description": "New consumer expenditure survey is long overdue. Government should move to doing surveys on a more regular basis", "url": "https://indianexpress.com/article/opinion/editorials/consumer-expenditure-survey-2022-7989599/", "urlToImage": "https://images.indianexpress.com/2022/06/edit-new-logo-6-3.jpeg", "publishedAt": "2022-06-24T22:45:27Z", "content": "The Narendra Modi government is set to launch a new household consumer expenditure survey (CES) from July. The exercise is welcome in fact, long overdue. The CES, covering some 1.2 lakh rural and 84,… [+2738 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Deeptiman Tiwary", "title": "Tuna export scam: Lakshadweep MP, his nephew under CBI scanner", "description": "A CBI team of about 25 officials and the Lakshadweep administration's vigilance officials have been engaged in conducting a 'joint surprise check' exercise on different departments of the Lakshadweep administration.", "url": "https://indianexpress.com/article/india/tuna-export-scam-lakshadweep-mp-his-nephew-under-cbi-scanner-7989692/", "urlToImage": "https://images.indianexpress.com/2022/06/Lakshadweep-lawmaker-Mohammed-Faizal.jpg", "publishedAt": "2022-06-24T22:40:31Z", "content": "Lakshadweep MP Mohammed Faizal has come under the CBI scanner in connection with alleged irregularities in the export of tuna fish to Sri Lanka. The central agency is also investigating Faizal’s neph… [+1802 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "June 25, 1982, Forty Years Ago: Vidhan Sabha Elects", "description": "A similar neutrality was observed by  Tara Singh who had occupied the Speaker’s chair when the election of deputy speaker was held.", "url": "https://indianexpress.com/article/opinion/editorials/june-25-1982-forty-years-ago-vidhan-sabha-elects-7989592/", "urlToImage": "https://images.indianexpress.com/2022/06/25-Jun-1982_IE_001.jpg", "publishedAt": "2022-06-24T22:30:27Z", "content": "The Bhajan Lal Government established its majority on the floor of the Haryana Vidhan Sabha when the Congress-I nominees, Tara Singh and Ved Pal, were elected Speaker and Deputy Speaker, respectively… [+1589 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "VL-SRSAM missile system successfully test-fired", "description": "The VL-SRSAM system has been designed to strike at the high-speed airborne targets at the range of 40km to 50km and at an altitude of around 15km.", "url": "https://indianexpress.com/article/cities/pune/vl-srsam-missile-system-successfully-test-fired-7989717/", "urlToImage": "https://images.indianexpress.com/2022/06/missile-3col.jpg", "publishedAt": "2022-06-24T22:29:07Z", "content": "THE INDIGENOUSLY developed shipborne weapon system, Vertical Launch Short Range Surface to Air Missile (VL-SRSAM), was successfully flight tested by the Defence Research and Development Organisation … [+1549 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Mihir Vasavda", "title": "With Asia gold, daily wager’s son puts Karnataka wrestling hub in spotlight", "description": "In these two sentences, Arun Kumakale, a local wrestling coach, captures the history of the wrestling-mad town in North Karnataka, and the journey of its newest sensation and his prodigy, Ningappa Genannavar, 17.", "url": "https://indianexpress.com/article/sports/sport-others/with-asia-gold-daily-wagers-son-puts-karnataka-wrestling-hub-in-spotlight-7989726/", "urlToImage": "https://images.indianexpress.com/2022/06/P1-anchor-3col.jpg", "publishedAt": "2022-06-24T22:24:13Z", "content": "Theres a wrestler in every house here in Mudhol. But thats not the case with Ninga he doesnt have a house.In these two sentences, Arun Kumakale, a local wrestling coach, captures the history of the w… [+4998 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Mihir Vasavda", "title": "With Asia gold, daily wager’s son puts Karnataka wrestling hub in spotlight", "description": "In these two sentences, Arun Kumakale, a local wrestling coach, captures the history of the wrestling-mad town in North Karnataka, and the journey of its newest sensation and his prodigy, Ningappa Genannavar, 17.", "url": "https://indianexpress.com/article/blogs/sports-blogs/with-asia-gold-daily-wagers-son-puts-karnataka-wrestling-hub-in-spotlight-7989726/", "urlToImage": "https://images.indianexpress.com/2022/06/P1-anchor-3col.jpg", "publishedAt": "2022-06-24T22:24:13Z", "content": "Theres a wrestler in every house here in Mudhol. But thats not the case with Ninga he doesnt have a house.In these two sentences, Arun Kumakale, a local wrestling coach, captures the history of the w… [+4998 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Vallabh Ozarkar", "title": "Uddhav: Will never sit with BJP, it went after my family", "description": "The rebel Sena MLAs, led by Eknath Shinde, have said the party needs to revive its relationship with the BJP and break away from the \"ideologically opposed\" Congress and NCP.", "url": "https://indianexpress.com/article/cities/mumbai/uddhav-will-never-sit-with-bjp-it-went-after-my-family-7989744/", "urlToImage": "https://images.indianexpress.com/2022/06/uddhav-1-5.jpg", "publishedAt": "2022-06-24T22:20:27Z", "content": "Maharashtra Chief Minister Uddhav Thackeray shot down suggestions Friday of any rapprochement with the BJP, saying there was no chance of him sitting shoulder-to-shoulder with those who had made pers… [+2263 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Vallabh Ozarkar", "title": "Uddhav: Will never sit with BJP, it went after my family", "description": "The rebel Sena MLAs, led by Eknath Shinde, have said the party needs to revive its relationship with the BJP and break away from the \"ideologically opposed\" Congress and NCP.", "url": "https://indianexpress.com/article/cities/mumbai/uddhav-thackeray-bjp-mva-mumbai-shiv-sena-mva-political-crisis-eknath-shinde-7989744/", "urlToImage": "https://images.indianexpress.com/2022/06/uddhav-1-5.jpg", "publishedAt": "2022-06-24T22:20:27Z", "content": "Maharashtra Chief Minister Uddhav Thackeray shot down suggestions Friday of any rapprochement with the BJP, saying there was no chance of him sitting shoulder-to-shoulder with those who had made pers… [+2263 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sameer Barde", "title": "We need to formulate a structured gaming law that allows players to enjoy the thrills of online gaming responsibly, safely, transparently and securely", "description": "For the players, the industry and government, the need of the hour is to acknowledge the significance of responsible gaming and develop a regulatory framework defined by progressive policies", "url": "https://indianexpress.com/article/opinion/columns/we-need-a-structured-gaming-law-that-allows-players-to-enjoy-the-thrills-of-online-gaming-responsibly-7989590/", "urlToImage": "https://images.indianexpress.com/2022/06/mobile-gaming-bloomberg-1200-1.jpg", "publishedAt": "2022-06-24T22:16:36Z", "content": "Online gaming has swiftly emerged as the most engaging form of entertainment in India owing to younger demographics, increased internet penetration, and affordable smartphones. Evolving technologies … [+5500 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shubhajit Roy", "title": "India takes up delay in student visas with US, UK, Canada, other countries", "description": "Sources told The Indian Express that the MEA officials —joint secretaries dealing with these countries — “strongly raised the issue of student visas” with the ambassadors and deputy chiefs of missions of these eight countries.", "url": "https://indianexpress.com/article/india/india-takes-up-delay-in-student-visas-with-us-uk-canada-other-countries-7989740/", "urlToImage": "https://images.indianexpress.com/2022/06/ministry-of-external-affairs.jpg", "publishedAt": "2022-06-24T22:13:39Z", "content": "WITH MANY Indian students complaining of delays in the visa process, the Ministry of External Affairs (MEA) on Friday called the ambassadors/ deputy chiefs of missions of eight countries, including t… [+2703 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Orders to seal hospital for O2 mock drill lifted", "description": "A fresh order was issued by the medical department four days ago stating that the  licence of the hospital had been restored and it could resume operations with an immediate effect.", "url": "https://indianexpress.com/article/cities/lucknow/orders-to-seal-hospital-for-o2-mock-drill-lifted-7989809/", "urlToImage": "https://images.indianexpress.com/2022/06/9Lucknow-ParasHospital-4col.jpeg", "publishedAt": "2022-06-24T22:11:39Z", "content": "Paras Hospital in the city’s Mathura Colony was sealed on June 8 last year after a purported video clip of its owner talking as how they cut off the oxygen supply to Covid-19 patients for 5 minutes a… [+1856 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Udit Misra", "title": "Explained Books | Prescription for post-Covid world: resilience", "description": "Jobs and livelihoods were lost, inequalities of all kinds widened, governments were pushed to pile on millions of dollars of debt to extend relief, and central banks had to resort to every possible way to stimulate the economy even as health systems collapsed…", "url": "https://indianexpress.com/article/explained/explained-books-prescription-for-post-covid-world-resilience-7989663/", "urlToImage": "https://images.indianexpress.com/2022/06/book-3.jpg", "publishedAt": "2022-06-24T22:10:04Z", "content": "The Covid-19 pandemic has worked like an X-ray machine, revealing the hidden challenges under the surface of many societies, Markus K Brunnermeier says in the introduction to his book. Indeed, the pa… [+2870 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Back Oppn candidate: Akhilesh to SP MLAs", "description": "The BJP-led NDA has announced former Jharkhand Governor Draupadi Murmu as its candidate for the Presidential elections, while the Opposition has announced former BJP leader Yashwant Sinha as their candidate.", "url": "https://indianexpress.com/article/cities/lucknow/back-oppn-candidate-akhilesh-to-sp-mlas-7989807/", "urlToImage": "https://images.indianexpress.com/2022/06/AKHILESH-YADAVv.jpeg", "publishedAt": "2022-06-24T22:09:12Z", "content": "SAMAJWADI PARTY (SP) president Akhilesh Yadav on Friday convened a meeting of his partys MLAs to discuss the coming Presidential polls.The BJP-led NDA has announced former Jharkhand Governor Draupadi… [+1196 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "A first in Uttar Pradesh: Children park opened at Moradabad jail", "description": "Nearly 450 children live with their jailed mothers in state's prisons. Currently, the number of inmates in UP's prisons is 1.24 lakh, including 6,000 women.", "url": "https://indianexpress.com/article/cities/lucknow/a-first-in-uttar-pradesh-children-park-opened-at-moradabad-jail-7989804/", "urlToImage": "https://images.indianexpress.com/2022/06/express-photo-13-16.jpeg", "publishedAt": "2022-06-24T22:06:30Z", "content": "In a first-of-its-kind initiative in Uttar Pradesh, a children park was opened on the premises of the Moradabad jail on Thursday following the state government’s directive that such parks be opened i… [+1113 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Nirupama Subramanian, Deeptiman Tiwary", "title": "26/11 planner Sajid Mir is in Pak custody, years after it claimed he died", "description": "Nikkei Asia reported Friday that Pakistan had arrested Mir to get off the “grey list” of the Financial Action Task Force, the international anti-terror finance watchdog. Indian agencies have held Mir to be more dangerous than Lashkar chief Hafiz Saeed.", "url": "https://indianexpress.com/article/india/26-11-planner-sajid-mir-is-in-pak-custody-years-after-it-claimed-he-died-7989732/", "urlToImage": "https://images.indianexpress.com/2022/06/MIR-FBI-1.jpg", "publishedAt": "2022-06-24T22:06:06Z", "content": "Sajid Mir, a senior Lashkar-e-Toiba operative and the alleged mastermind of the 26/11 Mumbai attacks, who was once presumed dead, is in the custody of authorities in Pakistan. Sources familiar with t… [+5179 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Appoint petitioner to teacher’s post vacated byminister’s daughter: Calcutta HC", "description": "The court also directed that the salary amount returned by Ankita, who was a teacher at Indira High School in Cooch Behar district, be handed over to petitioner Babita Sarkar.", "url": "https://indianexpress.com/article/cities/kolkata/appoint-petitioner-to-teachers-post-vacated-byministers-daughter-calcutta-hc-7989801/", "urlToImage": "https://images.indianexpress.com/2022/06/Calcutta-High-Court-2-2.jpeg", "publishedAt": "2022-06-24T21:57:59Z", "content": "The Calcutta High Court on Friday directed that a petitioner deprived of employment as a teacher be appointed to the post vacated by West Bengal minister Paresh Adhikari’s daughter Ankita Adhikari, w… [+1508 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Dhankhar says Kolkata has turned into a city of retirees, sparks row", "description": "Reacting strongly to Dhankhar's statement, ruling Trinamool Congress state general secretary Kunal Ghosh said, “I respect the Governor's position. But anyone who insults the state cannot be accepted.\"", "url": "https://indianexpress.com/article/cities/kolkata/dhankhar-says-kolkata-has-turned-into-a-city-of-retirees-sparks-row-7989798/", "urlToImage": "https://images.indianexpress.com/2022/06/bengal-governor-1200.jpeg", "publishedAt": "2022-06-24T21:56:18Z", "content": "Governor Jagdeep Dhankhar on Friday said that the state is a hub of mafia and syndicates and that Kolkata once known as a “City of Joy” is now a city of retired persons, sparking a fresh controversy.… [+1320 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "Citing fiscal strains, Expenditure Department advises against PMGKAY extension", "description": "The government has spent approximately Rs 2.60 lakh crore till March and another Rs 80,000 crore will be spent till September 2022, taking the total expenditure for PM-GKAY to nearly Rs 3.40 lakh crore.", "url": "https://indianexpress.com/article/business/economy/citing-fiscal-strains-expenditure-department-advises-against-pmgkay-extension-7989796/", "urlToImage": "https://images.indianexpress.com/2022/06/ration-shop-1.jpg", "publishedAt": "2022-06-24T21:56:14Z", "content": "It is not advisable to continue the Pradhan Mantri Garia Kalyan Anna Yoajana (PMGKAY) beyond its present extension (till September) both on grounds of food security and on fiscal grounds given that i… [+2501 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Why no action against Adhikari after accused named him as beneficiary: TMC", "description": "Accompanied by senior party colleague and MLA Tapas Roy at a press conference here, Ghosh alleged that Adhikari joined the BJP only to save himself from the interrogation and wondered why central agencies never grilled him during their probe into the case.", "url": "https://indianexpress.com/article/cities/kolkata/why-no-action-against-adhikari-after-accused-named-him-as-beneficiary-tmc-7989795/", "urlToImage": "https://images.indianexpress.com/2022/06/Suvendu.jpeg", "publishedAt": "2022-06-24T21:53:58Z", "content": "Referring to a letter purportedly written by Sudipta Sen, the alleged main accused in the Saradha Ponzi scam, Trinamool Congress (TMC) state general secretary Kunal Ghosh on Friday alleged that Leade… [+3368 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Soumyarendra Barik", "title": "Need to accelerate reform pace in energy transition: CEO, Niti Aayog", "description": "Kant, who will leave the government think tank at the end of June, after having led the organisation for over six years, also said in an interview that the government should first assess the success of current production-linked incentive (PLI) schemes before …", "url": "https://indianexpress.com/article/business/need-to-accelerate-reform-pace-in-energy-transition-ceo-niti-aayog-7989686/", "urlToImage": "https://images.indianexpress.com/2022/06/amitabh-kant-1.jpg", "publishedAt": "2022-06-24T21:52:48Z", "content": "Stipulating that energy transition will be a key driver of Indias growth in the coming years, Niti Aayog CEO Amitabh Kant said the country should make a strong push for green hydrogen and accelerate … [+3202 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Calcutta HC dismisses GNLF’s plea to postpone GTA elections", "description": "Rejecting the plea, the single-judge bench of Justice Moushumi Bhattacharya observed that “at this time, the court does not find any necessity to interfere in the GTA election process”.", "url": "https://indianexpress.com/article/cities/kolkata/calcutta-hc-dismisses-gnlfs-plea-to-postpone-gta-elections-7989793/", "urlToImage": "https://images.indianexpress.com/2022/06/GTA.png", "publishedAt": "2022-06-24T21:50:41Z", "content": "The Calcutta High Court on Friday turned down the Gorkha National Liberation Front (GNLF)s plea seeking to postpone the elections to the Gorkhaland Territorial Administration (GTA) scheduled on June … [+3200 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Soumyarendra Barik", "title": "5G: All spectrum may not get sold; govt stares at shortfall", "description": "The auction, to be held on July 26, will be held for spectrum in the frequencies of 600 MHz, 700 MHz, 800 MHz, 900 MHz, 1,800 MHz, 2,100 MHz, 2,300 MHz, 3,300 MHz and 26 GHz bands.", "url": "https://indianexpress.com/article/business/commodities/5g-all-spectrum-may-not-get-sold-govt-stares-at-shortfall-7989671/", "urlToImage": "https://images.indianexpress.com/2022/06/Telecom-cable-2col-1.jpg", "publishedAt": "2022-06-24T21:50:19Z", "content": "The Department of Telecommunications (DoT) is expecting to mop up between Rs 80,000 crore to Rs 1 lakh crore from the upcoming 5G auction, a senior government official has said. All the spectrum up f… [+1972 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi govt moves to bring back detention policy", "description": "The Directorate of Education Friday notified that the Delhi Right of Children to Free and Compulsory Education Rules 2011 have been amended to this effect.", "url": "https://indianexpress.com/article/cities/delhi/delhi-govt-moves-to-bring-back-detention-policy-7989772/", "urlToImage": "https://images.indianexpress.com/2022/06/school-students.jpeg", "publishedAt": "2022-06-24T21:36:37Z", "content": "The Delhi government has moved to bring back provisions to detain students in their grades, doing away with the no-detention policy which has been in place for children up to class VIII.The Directora… [+1649 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "‘FY22 MSME loan growth 36% above pre-Covid level’", "description": "According to CRIF High Mark, a credit information bureau, as of March 2022, there were 137.4 lakh active loans for the MSME sector, an increase of 7 per cent from March 2021 and a 43 per cent increase from March 2020.", "url": "https://indianexpress.com/article/business/economy/fy22-msme-loan-growth-36-above-pre-covid-level-7989788/", "urlToImage": "https://images.indianexpress.com/2022/06/MSME.jpg", "publishedAt": "2022-06-24T21:35:52Z", "content": "The loan portfolio outstanding of micro, small and medium enterprises (MSMEs) rose to Rs 22.7 lakh crore, an increase of 36 per cent over the pre-pandemic level in March 2020 and 18 per cent over Mar… [+2586 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Consumer forum halts tower construction at Gurgaon project", "description": "The complainants stated that in April-May 2019, it came to their knowledge that the opposite parties are planning constructing a new tower without their prior consent and they raised objections with opposite parties and DTCP, Haryana.", "url": "https://indianexpress.com/article/cities/delhi/consumer-forum-halts-tower-construction-at-gurgaon-project-7989787/", "urlToImage": "https://images.indianexpress.com/2022/06/g.png", "publishedAt": "2022-06-24T21:35:22Z", "content": "The National Consumer Disputes Redressal Commission (NCDRC) has ordered real estate developer M3M to halt construction of an 11th tower in its residential project in Sector 67, M3M Merlin, deeming it… [+2285 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "Shareholders reject reappointment of Dish TV MD", "description": "However, Goel would remain a non-executive director of the company and Dua the chief executive officer, the company said in a stock exchange filing.", "url": "https://indianexpress.com/article/business/companies/shareholders-reject-reappointment-of-dish-tv-md-7989774/", "urlToImage": "https://images.indianexpress.com/2022/06/television.jpg", "publishedAt": "2022-06-24T21:32:02Z", "content": "Shareholders of direct-to-home company Dish TV India Ltd on Friday rejected the special resolutions for the re-appointments of Jawahar Goel as Managing Director (MD) and Anil Dua as Whole-time Direct… [+999 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anonna Dutt", "title": "At centre of L-G and AAP govt war, seven semi-permanent hospitals marred by delays", "description": "While the BJP has accused the Delhi government of indulging in “corruption” in commissioning the projects, Saxena recently gave permission to the Anti- Corruption Branch (ACB) to probe allegations of “irregularities” against the Public Works Department (PWD).", "url": "https://indianexpress.com/article/cities/delhi/at-centre-of-l-g-and-aap-govt-war-seven-semi-permanent-hospitals-marred-by-delays-7989775/", "urlToImage": "https://images.indianexpress.com/2022/06/Kirari.png", "publishedAt": "2022-06-24T21:31:24Z", "content": "At six of Delhi governments seven upcoming semi-permanent hospitals that are at the centre of a row between L-G V K Saxena and the AAP government, construction work has started, with the outer steel … [+6809 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi Confidential: Change & Churn", "description": "Jairam Ramesh, the newly appointed AICC general secretary in-charge of the Congress's communication department, is said to be planning to bring in many new faces as spokespersons.", "url": "https://indianexpress.com/article/delhi-confidential/delhi-confidential-change-churn-jairam-ramesh-congress-kovind-7989765/", "urlToImage": "https://images.indianexpress.com/2022/06/jairam.jpg", "publishedAt": "2022-06-24T21:14:30Z", "content": "Jairam Ramesh, the newly appointed AICC general secretary in-charge of the Congress’s communication department, is said to be planning to bring in many new faces as spokespersons. Many of the fresh f… [+2342 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "AAP sharpens attack over suspension of five officials", "description": "On June 21, the L-G had suspended two more government officials from the revenue department in connection with a property and land registry matter, said sources.", "url": "https://indianexpress.com/article/cities/delhi/aap-sharpens-attack-over-suspension-of-five-officials-7989770/", "urlToImage": "https://images.indianexpress.com/2022/06/BHAR.jpg", "publishedAt": "2022-06-24T21:08:50Z", "content": "Following the suspension of five revenue department officials, including a deputy secretary of the CMO, AAP MLA Saurabh Bharadwaj Friday alleged that L-G Vinai Kumar Saxena is hiding facts. Saxena on… [+632 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Technical education: Skill dept, German firm sign MoU", "description": "Principal Secretary Labour, Skill Development and Employment, Anju Sharma, who attended the MoU signing in Germany, said, “Focusing on dual vocational, education and training system, which is very effectively working in Germany.\"", "url": "https://indianexpress.com/article/cities/ahmedabad/technical-education-skill-dept-german-firm-sign-mou-7989769/", "urlToImage": "https://images.indianexpress.com/2022/06/patel-1-1.jpg", "publishedAt": "2022-06-24T21:08:48Z", "content": "The Labour, Skill Development and Employment Department of the Gujarat government has signed a Memorandum of Understanding (MoU) with BBZ Arnsberg, Germany, to enhance the level of quality in technic… [+764 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "2 arrested for ‘conspiring to derail train’ in Morbi", "description": "The accused, arrested by the Rajkot Railway police, were identified as Akbar Miyana, a resident of Wankaner town, and Laxman Koli, a resident of Chandrapur village in Wankaner taluka.", "url": "https://indianexpress.com/article/india/2-arrested-for-conspiring-to-derail-train-in-morbi-7989767/", "urlToImage": "https://images.indianexpress.com/2022/06/arrest-2-5.jpg", "publishedAt": "2022-06-24T21:03:05Z", "content": "Two residents of Morbi district have been arrested for allegedly trying to derail a local train on the night of June 12 by placing bricks on the tracks, a railway police official said Friday.The moti… [+585 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Diu local body elections: BJP wins 6 of 13 seats unopposed", "description": "A total of 36 candidates had filed nomination papers for the 13 seats of the local body polls in the Union Territory of Diu.", "url": "https://indianexpress.com/article/cities/rajkot/diu-local-body-elections-bjp-wins-6-of-13-seats-unopposed-7989761/", "urlToImage": "https://images.indianexpress.com/2022/06/BJP-flags.jpg", "publishedAt": "2022-06-24T20:58:50Z", "content": "The Bharatiya Janata Party (BJP) has an upper hand in the elections to the Diu Municipal Council (DMC) as six of its 13 candidates have been declared winners unopposed as they were the only candidate… [+4802 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Battle for Maharashtra reaches Raj Bhavan and House: Uddhav, Shinde stake claim to ‘real’ Sena", "description": "Sharad Pawar meets Uddhav Thackeray who calls to meet today; BJP’s Darekar writes to Governor", "url": "https://indianexpress.com/article/cities/mumbai/uddhav-thackeray-maharastra-political-crisis-eknath-shinde-mva-faling-mla-rebel-7989749/", "urlToImage": "https://images.indianexpress.com/2022/06/pawarforlateB-5col.jpg", "publishedAt": "2022-06-24T20:54:38Z", "content": "Maharashtra Chief Minister Uddhav Thackeray, battling to save the ruling MVA and regain control of the Shiv Sena, and rebel leader Eknath Shinde, who now has the support of majority MLAs of the party… [+4626 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Battle for Maharashtra reaches Raj Bhavan and House: Uddhav, Shinde stake claim to ‘real’ Sena", "description": "Pawar meets Uddhav who calls meet today; BJP’s Darekar writes to Governor", "url": "https://indianexpress.com/article/cities/mumbai/battle-for-maharashtra-reaches-raj-bhavan-and-house-uddhav-shinde-stake-claim-to-real-sena-7989749/", "urlToImage": "https://images.indianexpress.com/2022/06/pawarforlateB-5col.jpg", "publishedAt": "2022-06-24T20:54:38Z", "content": "Maharashtra Chief Minister Uddhav Thackeray, battling to save the ruling MVA and regain control of the Shiv Sena, and rebel leader Eknath Shinde, who now has the support of majority MLAs of the party… [+4720 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Probe begins in Vadodara woman’s ‘suicide’ a week after recording video", "description": "The police have also sent for forensic analysis a video purportedly made by the victim, Nafisa Khokhar, at Sabarmati Riverfront a week before her death in which she is heard speaking about her heartbreak and decision to end her life.", "url": "https://indianexpress.com/article/cities/baroda/probe-begins-in-vadodara-womans-suicide-a-week-after-recording-video-7989762/", "urlToImage": "https://images.indianexpress.com/2022/06/express-photo-13-15.jpeg", "publishedAt": "2022-06-24T20:51:53Z", "content": "The JP Road police in Vadodara began a probe into the alleged suicide of a 25-year-old woman who was found hanging in the bedroom of her shared rental apartment Monday.The police have also sent for f… [+2480 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aditi Raja", "title": "Dahod health dept initiative: High-performance machine to fight sickle cell disease", "description": "The outreach programme involves mass testing to diagnose SCD, a common monogenic disorder due to autosomal recessive inheritance, is focusing on sickle cell trait screening and genetic counselling before marriage.", "url": "https://indianexpress.com/article/cities/baroda/dahod-health-dept-initiative-high-performance-machine-to-fight-sickle-cell-disease-7989759/", "urlToImage": "https://images.indianexpress.com/2022/06/sickle-cell-disease-759.jpeg", "publishedAt": "2022-06-24T20:49:56Z", "content": "To strengthen its fight against Sickle Cell Disease (SCD), the Dahod district health department is procuring its first-ever High-Performance Liquid Chromatography (HPLC) test machine to improve the m… [+3447 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Ahmedabad junior doctors to continue strike after talks fail", "description": "The junior doctors have been on strike since June 15 over long-pending demands, including equating their bond period with senior residency duration owing to their service in Covid-19 wards for nearly 17 months.", "url": "https://indianexpress.com/article/cities/ahmedabad/ahmedabad-junior-doctors-to-continue-strike-after-talks-fail-7989750/", "urlToImage": "https://images.indianexpress.com/2022/06/NEET-PG-2022-1.jpg", "publishedAt": "2022-06-24T20:48:50Z", "content": "Junior doctors in Ahmedabad who have been boycotting work over pending demands will continue their strike after a meeting between the representatives of the Junior Doctors Association (JDA) of BJ Med… [+1481 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Artist Jyoti Bhatt backs rusticated fine arts student, writes to V-C", "description": "In a letter dated June 20 and addressed to MSU Vice-Chancellor VK Shrivastava, Bhatt, an alumnus and former teacher at the Faculty of Fine Arts, said he was \"pained\" at the sequence of events.", "url": "https://indianexpress.com/article/cities/baroda/artist-jyoti-bhatt-backs-rusticated-fine-arts-student-writes-to-v-c-7989754/", "urlToImage": "https://images.indianexpress.com/2022/06/MSU-.jpeg", "publishedAt": "2022-06-24T20:46:24Z", "content": "“It is my humble request that the university must set aside its decision to rusticate Kundan Kumar until he has received the opportunity to present his side of the story to experts from the field of … [+2528 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Redevelopment project: Sabarmati Ashram resident faces FIR for ‘verbally abusing’ officials", "description": "Ashram resident, Shishir Dabhi, has been booked under IPC sections 186 (obstruction to public servant in discharge      of public functions), 189 (threat of injury to public servant), 504 (intentionally insults provoking a person to break public peace), and 5…", "url": "https://indianexpress.com/article/cities/ahmedabad/redevelopment-project-sabarmati-ashram-resident-faces-fir-for-verbally-abusing-officials-7989752/", "urlToImage": "https://images.indianexpress.com/2022/06/express-photo-13-14.jpeg", "publishedAt": "2022-06-24T20:42:59Z", "content": "An FIR has been lodged against a resident of the Sabarmati Ashram who allegedly threatened and verbally abused Ahmedabad district officials who were facilitating the rehabilitation of residents for A… [+1472 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Lakshadweep MP and his nephew under CBI scanner", "description": "A CBI team of about 25 officials and the Lakshadweep administration's vigilance officials have been engaged in conducting a 'joint surprise check' exercise on different departments of the Lakshadweep administration.", "url": "https://indianexpress.com/article/india/lakshadweep-mp-and-his-nephew-under-cbi-scanner-7989747/", "urlToImage": "https://images.indianexpress.com/2022/06/Untitled-design-51.jpg", "publishedAt": "2022-06-24T20:39:59Z", "content": "Lakshadweep MP Mohammed Faizal has come under the CBI scanner in connection with alleged irregularities in the export of tuna fish to Sri Lanka. The central agency is also investigating Faizal’s neph… [+2068 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Fire in school: 600 students evacuated", "description": "The incident occurred during school hours, fire officials said. Officials from the Makarpura GIDC fire station brought the fire under control before it spread.", "url": "https://indianexpress.com/article/cities/baroda/fire-in-school-600-students-evacuated-7989734/", "urlToImage": "https://images.indianexpress.com/2022/06/Indian-expressss-7.jpg", "publishedAt": "2022-06-24T20:23:29Z", "content": "Around 600 students of Phoenix School, located at Sussen Circle in Vadodara city’s Makarpura, had a narrow escape after a fire broke out on the third floor of the building on Friday. Officials of the… [+1707 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi confidential", "description": "The first signs of change with continuity came on Friday when the party elevated Vineet Punia, who was a secretary in the department, as AICC secretary in-charge of internal communication.", "url": "https://indianexpress.com/article/delhi-confidential/delhi-confidential-jairam-ramesh-7989739/", "urlToImage": "https://images.indianexpress.com/2022/06/delhi.png", "publishedAt": "2022-06-24T20:23:27Z", "content": "Jairam Ramesh, the newly appointed AICC general secretary in-charge of the Congress’s communication department, is said to be planning to bring in many new faces as spokespersons. Many of the fresh f… [+2244 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mumbai: Two men get one year in jail for stalking", "description": "The two men, both aged 19 when the incident took place in 2013, were found guilty under Section 354 D (stalking) of the Indian Penal Code and relevant sections of the Protection of Children from Sexual Offences Act.", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-two-men-get-one-year-in-jail-for-stalking-7989736/", "urlToImage": "https://images.indianexpress.com/2022/06/Gavel-10-12.jpeg", "publishedAt": "2022-06-24T20:12:25Z", "content": "Two men who stalked two minor girls and sought their contact numbers were sentenced to one year in jail by a special court earlier this week.The two men, both aged 19 when the incident took place in … [+944 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Water cut in Mumbai & Thane from June 27", "description": "Even the City and Industrial Development Corporation (CIDCO) announced a 25 per cent water cut in areas where it supplies water from June 27.", "url": "https://indianexpress.com/article/cities/mumbai/water-cut-in-mumbai-thane-from-june-27-7989733/", "urlToImage": "https://images.indianexpress.com/2022/06/chennai-water-crisis-2-1.jpeg", "publishedAt": "2022-06-24T20:10:28Z", "content": "In view of inadequate rainfall in the catchment areas of lakes supplying water to Mumbai, the civic body on Friday announced a 10 per cent water cut starting from June 27. The civic body added that b… [+932 chars]"}]}