{"status": "ok", "totalResults": 439, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Benita Fernando", "title": "Roe v Wade: Why the coat hanger is seeing resurgence as an abortion symbol?", "description": "The coat hanger serves as a symbol of the reproductive rights movement and a reminder of the gruesome pre-Roe era. It symbolises a desperate last resort for women who have been denied legal abortion services.", "url": "https://indianexpress.com/article/explained/roe-v-wade-coat-hanger-resurgence-abortion-symbol-7992279/", "urlToImage": "https://images.indianexpress.com/2022/06/coat-hanger-explained.jpg", "publishedAt": "2022-06-26T08:44:18Z", "content": "Within hours of the historic Roe v Wade verdict, which allowed women access to legal abortions, being overturned by the US Supreme Court, memes with coat hangers popped up across the social media. In… [+5157 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Carpe diem: In Ukraine, war turning love into marriages", "description": "The newlyweds joined a growing army of Ukrainian couples who are speedily turning love into matrimony because of the war.", "url": "https://indianexpress.com/article/world/carpe-diem-in-ukraine-war-turning-love-into-marriages-7992277/", "urlToImage": "https://images.indianexpress.com/2022/06/Ukraine-9.jpg", "publishedAt": "2022-06-26T08:42:05Z", "content": "When the couple awoke to the rumble of war on Feb. 24, they’d been dating for just over a year. Russia was invading and Ihor Zakvatskyi knew there was no more time to lose.He fished out the engagemen… [+3473 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Vikram box office collection: Kamal Haasan film all set to enter Rs 400 crore club worldwide, here’s how much it has earned", "description": "Vikram box office collection: Kamal Haasan's film continues to mint money at the box office and is on the verge of crossing the Rs 400 crore milestone.", "url": "https://indianexpress.com/article/entertainment/tamil/vikram-box-office-kamal-haasan-film-all-set-to-enter-rs-400-crore-club-7992230/", "urlToImage": "https://images.indianexpress.com/2021/07/vikram-kamal-haasan-vijay-sethupathi-fahad-faasil-1200.jpg", "publishedAt": "2022-06-26T08:31:23Z", "content": "Kamal Haasan’s Vikram is on the threshold of earning Rs 400 crore worldwide. In its third week, the Lokesh Kanagaraj-directorial has no intention of stopping. Written and directed by Lokesh and produ… [+1949 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "NYT", "title": "A year away, a new coach and the same goal: Winning Wimbledon", "description": "This will be her 21st Wimbledon, it will be an occasion like no other for Serena Williams. She is returning to the All England Club at 40, having not played a singles match since last year’s Wimbledon", "url": "https://indianexpress.com/article/sports/tennis/a-year-away-a-new-coach-and-the-same-goal-winning-wimbledon-7992130/", "urlToImage": "https://images.indianexpress.com/2021/06/serena-williams-AP-.jpg", "publishedAt": "2022-06-26T08:30:14Z", "content": "At first glance, it certainly looked like business as usual at Wimbledon on Saturday.\r\nTwo days before the start of this Grand Slam tournament, Novak Djokovic and Rafael Nadal were practicing on adja… [+7229 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Bihar: Rs 3 crore cash seized from Patna drug inspector’s house in vigilance raids", "description": "Special Vigilance Unit found the cash stashed in sacks at drug inspector Jitendra Kumar’s Patna house.", "url": "https://indianexpress.com/article/cities/patna/bihar-3-crore-cash-seized-patna-drug-inspectors-house-vigilance-raids-7992261/", "urlToImage": "https://images.indianexpress.com/2022/06/bihar-money.jpg", "publishedAt": "2022-06-26T08:20:56Z", "content": "The Special Vigilance Unit (SVU) in Bihar has seized over Rs 3 crore in cash from the residences of a drug inspector posted in Patna after extensive raids throughout the day on Saturday. The vigilanc… [+92 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manas Srivastava", "title": "UPSC Essentials: Get inspired- What was APJ Abdul Kalam’s oath for Civil Servants?", "description": "A.P.J Abdul Kalam is a role model for many aspirants. Know about his message, oath and idea of a societal grid for civil servants. Enrich your answers in Essay, GS, Ethics and shape your personality with Kalam's words of wisdom.", "url": "https://indianexpress.com/article/upsc-current-affairs/upsc-essentials/upsc-essentials-get-inspired-what-was-apj-abdul-kalams-oath-for-civil-servants-government-officers-7992119/", "urlToImage": "https://images.indianexpress.com/2022/06/Untitled-design-36-1.jpg", "publishedAt": "2022-06-26T08:19:21Z", "content": "During his presidency, A.P.J Abdul Kalam used to visit civil services probationers at Lal Bahadur Shastri National Academy of Administration, Mussoorie. Civil servants in the making would go to Rasht… [+5503 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Centre grants VIP security to 15 rebel Sena MLAs", "description": "Sources said the 15 MLAs granted security do not include the leader of the rebel group, Eknath Shinde. Among those included are Ramesh Bornare, Mangesh Kudalkar, Sanjay Shirsat, Latabai Sonawane, Prakas Surve and 10 others.", "url": "https://indianexpress.com/article/cities/mumbai/centre-shiv-sena-rebel-mlas-vip-security-7992249/", "urlToImage": "https://images.indianexpress.com/2022/06/sena-mlas-guwahati.jpeg", "publishedAt": "2022-06-26T08:18:03Z", "content": "Even as a political turmoil unfolds in Maharashtra with close to 40 Shiv Sena MLAs holed up in a hotel in Guwahati, 15 of the rebel MLAs have been granted central security cover by the Union Ministry… [+1997 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sweety Kumari", "title": "Low voter turnout recorded as polling begins for GTA", "description": "Voting for the GTA polls, being conducted after 10 years, began at 7 am Sunday and till 9 am, a 9.98 per cent voter turnout was recorded, added officials. Till 11 am, a 24.4 per cent turnout was reported, they also said.", "url": "https://indianexpress.com/article/india/low-voter-turnout-polling-gta-7992231/", "urlToImage": "https://images.indianexpress.com/2022/06/1656224406236.jpeg", "publishedAt": "2022-06-26T08:13:32Z", "content": "Polling for the Gorkhaland Territorial Administration (GTA), the semi-autonomous council that governs the Darjeeling Hills in West Bengal, began on a slow note Sunday, said election officials.Voting … [+2648 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Flood situation remains grim in Assam, over 25 lakh still hit", "description": "As many as 2.33 lakh have taken shelter in 637 relief camps of Assam, which has been battling floods and landslides for the past two weeks.", "url": "https://indianexpress.com/article/north-east-india/assam/flood-situation-remains-grim-in-assam-over-25-lakh-still-hit-7992209/", "urlToImage": "https://images.indianexpress.com/2022/06/assam-floods-1-1.jpg", "publishedAt": "2022-06-26T08:04:26Z", "content": "The flood situation in Assam continued to remain critical on Sunday with more than 25 lakh people still reeling under the deluge, although water level has started receding from some areas.Chief Minis… [+1675 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Guinness alert: Blind skater creates record with 142 consecutive ollies", "description": "Remarkably, while there are record categories designed for those with visual impairments, Guinness site reported that Ryusei instead opted for a standard, blindfolded record title", "url": "https://indianexpress.com/article/lifestyle/life-style/guinness-blind-skater-breaks-record-with-142-consecutive-ollies-7991979/", "urlToImage": "https://images.indianexpress.com/2022/06/ryusei-guinness-_1200.jpg", "publishedAt": "2022-06-26T07:55:36Z", "content": "Japanese skateboarder Ryusei Ouchi has managed to create unbelievable Guinness records — achieving the most skateboard ollies of 33 in one minute blindfolded and the most consecutive skateboard ollie… [+2082 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Planned Parenthood of Utah sues to block abortion ban after Supreme Court ruling", "description": "The police identified the deceased as Hemang Gala (31), a resident of Bhandarkar Road in Pune. A businessman, Gala was an avid trekker and had participated in many treks in the Sahyadris and the Himalayas in the past, a police official said.", "url": "https://indianexpress.com/article/world/planned-parenthood-of-utah-sues-to-block-abortion-ban-after-supreme-court-ruling-7992204/", "urlToImage": "https://images.indianexpress.com/2022/06/Reuters-2.jpg", "publishedAt": "2022-06-26T07:52:16Z", "content": "The Utah branch of Planned Parenthood filed a lawsuit on Saturday seeking to block the state’s abortion ban, which came into effect on Friday after the U.S. Supreme Court’s decision to overturn the R… [+1575 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Abhinav Rajput", "title": "How AAP tackled anti-incumbency to win Rajinder Nagar bypoll", "description": "From support in lower middle-class neighbourhoods to BJP's internal politics, key factors that helped AAP's Durgesh Pathak pull ahead", "url": "https://indianexpress.com/article/cities/delhi/aap-tackled-anti-incumbency-win-rajinder-nagar-bypoll-7992217/", "urlToImage": "https://images.indianexpress.com/2022/06/WhatsApp-Image-2022-06-26-at-12.19.57-PM.jpeg", "publishedAt": "2022-06-26T07:51:39Z", "content": "From the urban neighbourhood of Rajinder Nagar to the middle and lower middle class neighbourhoods of Narayana, Pandav Nagar and Dasghara, people were vocal on the issue of shortage of water and bad … [+2844 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Careers Desk", "title": "AAI Recruitment 2022: Apply for 400 Junior Executive vacancies; check last date, eligibility", "description": "Interested candidates can apply for these vacancies before July 14, 2022 through the official AAI website — aai.aero. The CTC per annum for the post of Junior Executive would be around Rs 12 lakh.", "url": "https://indianexpress.com/article/jobs/aai-recruitment-2022-apply-for-400-junior-executive-vacancies-check-last-date-eligibility-sarkari-naukri-aai-aero-7992190/", "urlToImage": "https://images.indianexpress.com/2022/06/AAI-jobs.jpg", "publishedAt": "2022-06-26T07:51:32Z", "content": "The Airports Authority of India (AAI) is inviting applications for nearly 400 vacancies of Junior Executive (Air Traffic Control). Interested candidates can apply for these vacancies before July 14, … [+2492 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Janhvi Kapoor says she is ‘so happy’ to call Arjun Kapoor her brother, Sonam Kapoor pens emotional note on actor’s birthday", "description": "Sonam Kapoor took to Instagram and penned a sweet wish for Arjun Kapoor on his birthday, as Janhvi Kapoor thanked the actor for 'having her back' at all times.", "url": "https://indianexpress.com/article/entertainment/bollywood/janhvi-kapoor-sonam-kapoor-arjun-kapoor-birthday-emotional-note-7992129/", "urlToImage": "https://images.indianexpress.com/2022/06/sonam1200.jpeg", "publishedAt": "2022-06-26T07:44:15Z", "content": "Actor Sonam Kapoor had a sweet birthday wish for her cousin, actor Arjun Kapoor. Sonam took to Instagram and shared several photos from her wedding functions in 2018 as well as a couple of unseen one… [+1661 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "UP bypolls result: BJP takes lead in Samajwadi Party strongholds Azamgarh, Rampur", "description": "As of 12.45 pm, BJP candidate Dinesh Lal Yadav “Nirahua” in Azamgarh led by 3, 529 votes, ahead of SP candidate Dharmendra Yadav.", "url": "https://indianexpress.com/article/cities/lucknow/up-bypolls-result-bjp-sp-azamgarh-rampur-7992168/", "urlToImage": "https://images.indianexpress.com/2022/06/up-bjp.jpg", "publishedAt": "2022-06-26T07:43:18Z", "content": "After trailing behind the Samajwadi Party in the initial rounds of counting in the Uttar Pradesh Lok Sabha bypolls, the Bharatiya Janata Party (BJP) spurred ahead in both Azamgarh and Rampur.As of 12… [+1144 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pune trekker dies in landslide during hill marathon at Sinhagad Fort", "description": "Businessman Hemang Gala (31) was an avid trekker and had participated in many treks in the Sahyadris and the Himalayas in the past, a police official said", "url": "https://indianexpress.com/article/cities/pune/pune-trekker-dies-in-landslide-during-hill-marathon-at-sinhagad-fort-7992200/", "urlToImage": "https://images.indianexpress.com/2022/06/d2de18bc-627b-4059-b172-9bbe7cd41037.jpg", "publishedAt": "2022-06-26T07:40:07Z", "content": "A 31-year-old trekker from Pune was killed in a landslide on Sinhagad Fort in Pune around Saturday afternoon during a hill marathon event organised at the fort, the Pune rural police said. His body w… [+1327 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Explained: Why Germany is pushing for a ‘climate club’", "description": "The German government under Chancellor Olaf Scholz still plans to get the G-7 to commit to collective progress on curbing global warming, and one of the ideas being discussed is the creation of a climate club' for countries that want to speed ahead when it co…", "url": "https://indianexpress.com/article/explained/explained-germany-climate-club-7992175/", "urlToImage": "https://images.indianexpress.com/2022/06/Explained-global-G7.jpg", "publishedAt": "2022-06-26T07:32:42Z", "content": "Before the invasion of Ukraine by Russia triggered a cascade of crises over food, energy and international security, the main focus of the meeting was meant to be on climate change.\r\nThe German gover… [+4572 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "NYT", "title": "The ultimate Tennis disrupter faces the Wimbledon crucible", "description": "Wimbledon is where it all began a year ago for Raducanu. Back then, she was just weeks removed from taking her university entrance exams, a practically unknown player with smooth strokes and an ability to glide across the court.", "url": "https://indianexpress.com/article/sports/tennis/the-ultimate-tennis-disrupter-faces-the-wimbledon-crucible-7992097/", "urlToImage": "https://images.indianexpress.com/2022/02/Emma-Raducanu-2.jpg", "publishedAt": "2022-06-26T07:30:50Z", "content": "The British tennis-sphere gasped earlier this month.\r\nFor the third time this year, 19-year-old sensation Emma Raducanu had to quit in the middle of the match because of an injury. Just weeks before … [+7215 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "IAF can deliver desired punch when required within short time frame: Air Chief Marshal", "description": "Listing the rapid geopolitical upheavals, the Chief of Air Staff noted that any future conflict will require the integration of all elements of the national security apparatus to make it an \"All-of-Nation-Approach\".", "url": "https://indianexpress.com/article/india/air-chief-marshal-iaf-desired-punch-short-time-frame-7991883/", "urlToImage": "https://images.indianexpress.com/2022/06/VR-Chaudhari.jpg", "publishedAt": "2022-06-26T07:30:45Z", "content": "India should comprehend the situation along its unsettled western and northern borders as a ‘two-front’ contingency and prepare for it accordingly, Air Chief Marshal VR Chaudhari said on Sunday, refe… [+5122 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Paul McCartney joined by Bruce Springsteen and Dave Grohl in epic Glastonbury show", "description": "The singer-songwriter, who turned 80 a week ago, was the oldest ever solo headliner at Worthy Farm in south-west England, where the festival celebrated its fiftieth anniversary two years later than planned due to the pandemic.", "url": "https://indianexpress.com/article/entertainment/music/paul-mccartney-joined-by-bruce-springsteen-and-dave-grohl-in-epic-glastonbury-show-7992186/", "urlToImage": "https://images.indianexpress.com/2022/06/paul1200.jpg", "publishedAt": "2022-06-26T07:30:02Z", "content": "Paul McCartney was joined by special guests Bruce Springsteen and Dave Grohl in an epic performance at Glastonbury on Saturday night that spanned the first Beatles demo to some of his latest recordin… [+1370 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Carpenter’s son, school bus driver’s daughter, the Khelo India stars who figured in PM Narendra Modi’s Mann ki Baat", "description": "Prime Minister Narendra Modi on Sunday addressed the nation through his monthly ‘Mann Ki Baat’ programme.", "url": "https://indianexpress.com/article/sports/sport-others/carpenters-son-school-bus-drivers-daughter-the-khelo-india-stars-who-figured-in-pm-narendra-modis-mann-ki-baat-7992132/", "urlToImage": "https://images.indianexpress.com/2022/06/modi-sports.jpg", "publishedAt": "2022-06-26T07:27:23Z", "content": "Prime Minister Narendra Modi on Sunday addressed the nation through his monthly Mann Ki Baat programme and lauded the Indian players who set many records at the recently concluded Khelo India Youth G… [+2765 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Kyle Mayers heads West Indies turnabout to lead Bangladesh by 106", "description": "All-rounder Kyle Mayers on Saturday led the turnaround with a chanceless and unbeaten 126 runs, easily the highest score by either side after two days.", "url": "https://indianexpress.com/article/sports/cricket/kyle-mayers-heads-west-indies-turnabout-to-lead-bangladesh-by-106-7992171/", "urlToImage": "https://images.indianexpress.com/2022/06/Kyle-Mayers.jpg", "publishedAt": "2022-06-26T07:18:56Z", "content": "West Indies started the day 167 runs behind Bangladesh and finished it 106 runs ahead in the second Test at Daren Sammy Stadium here.All-rounder Kyle Mayers on Saturday led the turnaround with a chan… [+1947 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "PM Narendra Modi touches down in Munich for G7 meet, receives warm welcome", "description": "Foreign Secretary Vinay Mohan Kwatra said on Friday that PM Modi will hold bilateral meetings and discussions with the leaders of the G7 and also the guest countries on the sidelines of the G7 summit.", "url": "https://indianexpress.com/photos/picture-gallery-others/prime-minister-narendra-modi-arrives-in-germany-to-attend-g7-summit-7992037/", "urlToImage": "https://images.indianexpress.com/2022/06/modi123.jpg", "publishedAt": "2022-06-26T07:18:33Z", "content": "During the sessions of the Summit, I will be exchanging views with the G7 counties, G7 partner countries and guest International Organisations on topical issues such as environment, energy, climate, … [+116 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Ecuador government, indigenous leaders hold first talks amid protests", "description": "The demonstrations, which broke out on June 13 fueled by indigenous calls for lower fuel and food prices, among other demands, have led to at least six civilian deaths and multiple attacks on security forces.", "url": "https://indianexpress.com/article/world/ecuador-government-indigenous-leaders-hold-first-talks-amid-protests-7992076/", "urlToImage": "https://images.indianexpress.com/2022/06/ecuador-reuters-1.jpg", "publishedAt": "2022-06-26T07:17:49Z", "content": "Ecuador’s government and indigenous leaders met on Saturday for the first formal talks since mass protests began two weeks ago, and President Guillermo Lasso eased security measures.The demonstration… [+3367 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Apple Back to School 2022 offer: Discounts on MacBook Air M1, MacBook Pro, iPads and what to pick", "description": "Apple is hosting its ‘Back to School’ 2022 offers for students who purchase a MacBook Air, Pro, iPad or iMac.", "url": "https://indianexpress.com/article/technology/laptops/apple-back-to-school-2022-offer-discounts-on-macbook-air-m1-macbook-pro-ipads-and-what-to-pick-7992121/", "urlToImage": "https://images.indianexpress.com/2022/06/Apple_Backtoschool1.jpg", "publishedAt": "2022-06-26T07:03:17Z", "content": "Apple is hosting its Back to School 2022 offers for students who purchase a MacBook Air, Pro, iPad or iMac. Under the scheme, select Apple Macs are available at a discounted price, along with the opt… [+3176 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Filipina wins transgender pageant in Thailand", "description": "\"My first message to everyone is to spread love and peace and unity because that is the most important thing that we do as of the moment and what's happening in the world right now,\" said Ravena who wore a glittery-silver evening gown.", "url": "https://indianexpress.com/article/lifestyle/fashion/filipina-wins-transgender-pageant-thailand-7992075/", "urlToImage": "https://images.indianexpress.com/2022/06/ravena_reuters.jpg", "publishedAt": "2022-06-26T07:00:33Z", "content": "Filipina Fuschia Anne Ravena was crowned Miss International Queen 2022 on Saturday at a contest in Thailand billed as the world’s largest and most popular transgender pageant.The 27-year-old business… [+1482 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Ayushmann Khurrana’s Anek is now streaming on this OTT platform", "description": "Ayushmann Khurrana's Anek was helmed by Anubhav Sinha, and is now available for streaming on this OTT giant.", "url": "https://indianexpress.com/article/entertainment/bollywood/ayushmann-khurranas-anek-to-stream-on-netflix-7992093/", "urlToImage": "https://images.indianexpress.com/2022/05/anek1200.jpg", "publishedAt": "2022-06-26T06:58:42Z", "content": "Ayushmann Khurrana’s Anek is now available to stream on Netflix nearly a month after it released in cinemas. The film dropped on the streaming giant on June 26. The streaming platform made the announ… [+1810 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "Leopard rescued from open well using ‘Mohenjo Daro Harappan technology’. Watch video", "description": "Nanda also noted that such incidents will reduce if wells around animal habitats are closed. He also took a dig at the old technique of rescuing the leopard and called it the \"Mohenjo Daro Harappan technology\".", "url": "https://indianexpress.com/article/trending/trending-in-india/leopard-rescued-from-open-well-7992116/", "urlToImage": "https://images.indianexpress.com/2022/06/39572fa4-17ea-4a4f-9c17-eb5ddd7414ad.jpg", "publishedAt": "2022-06-26T06:58:16Z", "content": "Of late, videos showing leopards being rescued from open wells have been surfacing online and conservationists have been raising alarm over the dangers posed to wildlife.A similar video was shared by… [+2437 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Mumbai Greens: Sagar Upvan, a seaside paradise in South Mumbai", "description": "Spread across 12 acres, Sagar Upvan with its dense green cover, large lawns, and sea-facing benches is a haven for joggers, walkers and visitors", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-greens-sagar-upvan-seaside-paradise-south-mumbai-7992052/", "urlToImage": "https://images.indianexpress.com/2022/06/mumbai-greens-feature.jpg", "publishedAt": "2022-06-26T06:55:16Z", "content": "Tucked away in Mumbais tony Cuffe Parade, away from the chaos of South Mumbai, lies the Bombay Port Trust Garden, also known as the Sagar Upvan. With an extensive area of 12 acres, visitors are surro… [+2141 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pune police bust group of cellphone thieves from Jharkhand targeting Pandharpur Wari pilgrims", "description": "On June 24, a team from the Daund police station responded to a call about a cell phone theft from the Amar Society in Daund taluka of Pune district. A team led by inspector Vinod Ghuge launched a probe based on the clues available from the theft.", "url": "https://indianexpress.com/article/cities/pune/pune-police-bust-group-of-cellphone-thieves-from-jharkhand-targeting-pandharpur-wari-pilgrims-7992115/", "urlToImage": "https://images.indianexpress.com/2022/06/cell-phone-123.jpg", "publishedAt": "2022-06-26T06:53:35Z", "content": "The Pune Rural police have busted an interstate gang of cell phone thieves comprising six people, including three minors, from Jharkhand, who had come to Pune to target pilgrims during the Pandharpur… [+1522 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "PM Modi at G7 live updates: PM arrives in Munich; set to attend G7 summit", "description": "PM Modi in Germany live updates, June 26: The G7 leaders are expected to focus on the Ukraine crisis that has triggered geopolitical turmoil besides fuelling a global food and energy crisis.", "url": "https://indianexpress.com/article/india/pm-modi-g7-germany-munich-ukraine-biden-live-updates-7992107/", "urlToImage": "https://images.indianexpress.com/2022/06/PM-Modi-G7.jpg", "publishedAt": "2022-06-26T06:51:46Z", "content": "PM Modi was welcomed by members of the Indian community on his arrival in Munich today.\r\nDuring the sessions of the Summit, I will be exchanging views with the G7 counties, G7 partner countries and g… [+825 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Priya Kumari Shukla", "title": "UPSC Ethics Simplified: Abortion Rights vs Ethics", "description": "From an ethical standpoint, the debate over pregnancy termination is between a woman's right over her body and the foetus's right to life. We take a look at the debate over abortion rights and the ethical dilemma before policymakers.", "url": "https://indianexpress.com/article/upsc-current-affairs/upsc-ethics-simplified-abortion-rights-vs-ethics-7991914/", "urlToImage": "https://images.indianexpress.com/2022/06/Abortion-final-image.jpg", "publishedAt": "2022-06-26T06:34:08Z", "content": "In 1973, in a historic judgment in the Roe vs Wade case, the US Supreme Court made abortion legal everywhere in the country. Now, that decision has been overturned by the Supreme Court, paving the wa… [+5064 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Rajinder Nagar bypoll: AAP leads, BJP second after eight rounds of counting", "description": "After the end of seven rounds, AAP was leading with 17,491 votes, BJP was at 12,467, and Congress at 684 votes", "url": "https://indianexpress.com/article/cities/delhi/rajinder-nagar-bypoll-aap-leads-bjp-second-eight-rounds-counting-7992055/", "urlToImage": "https://images.indianexpress.com/2022/06/WhatsApp-Image-2022-06-26-at-11.52.51-AM.jpeg", "publishedAt": "2022-06-26T06:30:14Z", "content": "The Aam Aadmi Partys (AAPs) Durgesh Pathak is leading by 7,000 votes in Delhis Rajinder Nagar constituency, which voted in the bypoll on Thursday, after the end of eight out of 16 rounds of counting.… [+1201 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "With war, Kyiv pride parade becomes a peace march in Warsaw", "description": "\"However, it's important for us to still march,\" said Maksym Eristavi, who was draped in both the Ukrainian and European Union flags. \"It's still about pride, but pride in being Ukrainian and surviving through genocide.\"", "url": "https://indianexpress.com/article/world/ukraine-russia-war-kyiv-pride-parade-peace-march-warsaw-7991858/", "urlToImage": "https://images.indianexpress.com/2022/06/kyiv-pride-ap.jpg", "publishedAt": "2022-06-26T06:28:13Z", "content": "Ukraine’s largest LGBTQ rights event, KyivPride, went ahead Saturday, although not on its native streets or as a celebration.Due to Russia’s war in Ukraine, the event normally held in Kyiv took place… [+5324 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Shark Tank India’s Namita Thapar, Peyush Bansal, Vineeta Singh reunite for Aman Gupta’s daughter’s birthday. Fans react: ‘Billions in a frame’", "description": "Shark Tank India's business leaders Namita Thapar, Peyush Bansal, Vineeta Singh attended Aman Gupta's daughter's birthday in Delhi. While fans loved their photos, they seemed to be missing Ashneer Grover and other sharks.", "url": "https://indianexpress.com/article/entertainment/television/shark-tank-india-namita-thapar-peyush-bansal-vineeta-singh-aman-gupta-reunite-7992032/", "urlToImage": "https://images.indianexpress.com/2022/06/shark-tank-india-reunion.jpg", "publishedAt": "2022-06-26T06:22:47Z", "content": "It’s been months since Shark Tank India wrapped up, but the craze around it fails to die down. ‘Sharks’ Namita Thapar, Peyush Bansal and Vineeta Singh recently attended Aman Gupta’s daughter’s birthd… [+1374 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "NYT", "title": "For some NBA draftees, making it to the pros runs in the family", "description": "Banchero, who was drafted by the Orlando Magic, said his mother “stayed on me, always held me accountable and made sure I was on the right track.”", "url": "https://indianexpress.com/article/sports/basketball/for-some-nba-draftees-making-it-to-the-pros-runs-in-the-family-7992044/", "urlToImage": "https://images.indianexpress.com/2022/06/Paolo-Banchero.jpg", "publishedAt": "2022-06-26T06:08:47Z", "content": "When the Houston Rockets selected Auburns Jabari Smith Jr. with the third pick of the NBA draft Thursday, it continued a tradition of basketball as a family inheritance.\r\nHis father, also named Jabar… [+7500 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sreenivas Janyala", "title": "Atmakur bypoll: YSRCP candidate Mekapati Vikram Reddy headed for huge win", "description": "The bypoll was held on June 23 which was necessitated after the demise of Mekapati Goutham Reddy, who was YSR Congress Party MLA and Industries Minister, on February 21 due to a heart attack.", "url": "https://indianexpress.com/article/cities/hyderabad/atmakur-bypoll-ysrcp-mekapati-vikram-reddy-headed-for-huge-win-7992041/", "urlToImage": "https://images.indianexpress.com/2022/06/mekapati-vikram-atmakur-ysrcp.jpg", "publishedAt": "2022-06-26T06:02:48Z", "content": "The ruling YSR Congress Partys Mekapati Vikram Reddy Sunday headed towards a big win in the Atmakur bypoll in Andhra Pradesh, leading by over 66,000 votes at the end of round 16. Counting is going on… [+1152 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Dead roaches that ate Moon dust went up for auction. Then NASA objected", "description": "Because of NASA’s poor record-keeping, the agency lost possession of a bag that astronaut Neil Armstrong had used to collect samples of lunar rocks, the audit found.", "url": "https://indianexpress.com/article/technology/science/dead-roaches-that-ate-moon-dust-went-up-for-auction-then-nasa-objected-7992005/", "urlToImage": "https://images.indianexpress.com/2022/06/NASA_roaches.jpg", "publishedAt": "2022-06-26T05:55:55Z", "content": "Unanswered questions fill the cosmos: Are there infinite universes? Why does anything exist? How much would one pay for moon dust digested by a cockroach?\r\nOn that last mystery, humanity was close to… [+5183 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "International Day against Drug Abuse and Illicit Trafficking 2022: Theme, history and signifance", "description": "The focus is to create awarness about the hazardous impacts of drug abuse on the society and to create a world without it", "url": "https://indianexpress.com/article/lifestyle/life-style/international-day-against-drug-abuse-illicit-trafficking-2022-theme-history-signifance-7981418/", "urlToImage": "https://images.indianexpress.com/2022/06/feature-drug.jpg", "publishedAt": "2022-06-26T05:55:53Z", "content": "Drug use continues to be a major problem in the world. It’s harmful effects are not unknown to the world. In order to create awarness about the serious impact of drug abuse and to seek international … [+1929 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Former Wimbledon finalist Andrea Jaeger reveals she was sexually harassed ‘at least 30 times’ by female official", "description": "The former World No. 2, now 57, spoke about how harassment and threats led to her premature burnout from tennis.", "url": "https://indianexpress.com/article/sports/tennis/former-wimbledon-finalist-andrea-jaeger-reveals-she-was-sexually-harassed-at-least-30-times-by-female-official-7991980/", "urlToImage": "https://images.indianexpress.com/2022/06/Andrea-Jaeger.jpg", "publishedAt": "2022-06-26T05:51:39Z", "content": "Former teenage tennis phenom Andrea Jaeger said she was sexually harassed “at least 30 times” by a female Women’s Tennis Association staff member during the 1980s.Jaeger, now 57, also told The Indepe… [+2885 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "NASA’s return to the Moon starts with launching a microwave-size cube", "description": "Early Monday, a spacecraft named CAPSTONE is scheduled to launch as the first piece of Artemis to head to the moon. Compared to what is to follow, it is modest in size and scope.", "url": "https://indianexpress.com/article/technology/science/nasas-return-to-the-moon-starts-with-launching-a-microwave-size-cube-7991981/", "urlToImage": "https://images.indianexpress.com/2022/06/NASA_Moon_NYT.jpg", "publishedAt": "2022-06-26T05:45:49Z", "content": "In the coming years, NASA will be busy at the moon. A giant rocket will loft a capsule with no astronauts aboard around the moon and back, perhaps before the end of summer. A parade of robotic lander… [+10438 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Yogi Adityanath’s helicopter emergency landed in Varanasi after hitting bird", "description": "CM Yogi Adityanath had come to Varanasi on Saturday and had paid obeisance at Kashi Vishwanath temple, besides holding a review meeting.", "url": "https://indianexpress.com/article/cities/lucknow/yogi-adityanath-helicopter-emergency-landed-varanasi-7991977/", "urlToImage": "https://images.indianexpress.com/2022/06/yogi-helicopter.png", "publishedAt": "2022-06-26T05:39:56Z", "content": "By: PTI | Varanasi | Updated: June 26, 2022 11:15:25 am\r\nUP CM Yogi Adityanath's helicopter had to make an emergency landing. (Screenshot/Twitter) Join our Telegram channel (The Indian Express) for t… [+88 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "PM Modi to address 90th edition of Mann Ki Baat", "description": "\"The people of India removed the 'Emergency' and established democracy in a democratic way,\" PM Modi said.", "url": "https://indianexpress.com/article/india/pm-modi-mann-ki-baat-live-updates-7991968/", "urlToImage": "https://images.indianexpress.com/2022/06/modi_brics.jpg", "publishedAt": "2022-06-26T05:34:55Z", "content": "Prime Minister Narendra Modi on Sunday began the 90th edition of his monthly radio programme by invoking the 1975 Emergency, which took place 47 years ago. Calling it an attempt to “crush the democra… [+1999 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Apple AirPods Pro 2 could get updated H1 chip, heart rate detection: Report", "description": "Apple’s AirPods Pro are long overdue for an upgrade, and it has been reported that the new earbuds could make an appearance this year.", "url": "https://indianexpress.com/article/technology/gadgets/apple-airpods-pro-2-could-get-updated-h1-chip-heart-rate-detection-leaks-7991952/", "urlToImage": "https://images.indianexpress.com/2022/06/AirPods_Pro_1.jpg", "publishedAt": "2022-06-26T05:34:55Z", "content": "Apples AirPods Pro are long overdue for an upgrade, and it has been reported that the new earbuds could make an appearance this year. A new report has now given a closer look at some of the upcoming … [+2444 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kanchan Vasdev", "title": "AAP’s white paper in Budget session: Cong govt left behind liability of Rs 24,352 cr", "description": "Of this, Rs 13,759 crore is the liability towards non payment of arrears of sixth Pay Commission and Rs 7,117.86 crore is the liability towards the power utility of the state. The previous government could not discharge the unpaid pending liabilities of Rs 17…", "url": "https://indianexpress.com/article/chandigarh/aaps-white-paper-in-budget-session-cong-govt-left-behind-liability-of-rs-24352-cr-7991958/", "urlToImage": "https://images.indianexpress.com/2022/06/AAP-budge.jpg", "publishedAt": "2022-06-26T05:31:42Z", "content": "The AAP-led Punjab government on Saturday slammed the previous Congress government for leaving an immediate liability of Rs 24,352.29 crore that the incumbent government would have to discharge over … [+5260 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Harmanpreet Kaur surpasses Mithali Raj to become the leading run-scorer for India in T20Is", "description": "Harmanpreet Kaur has set the record 16 days after Mithali Raj’s retirement.", "url": "https://indianexpress.com/article/sports/cricket/harmanpreer-kaur-surpasses-mithali-raj-to-become-the-leading-run-scorer-for-india-in-t20is-7991942/", "urlToImage": "https://images.indianexpress.com/2022/06/Untitled-design-1-12.jpg", "publishedAt": "2022-06-26T05:28:48Z", "content": "Indian women’s cricket team skipper Harmanpreet Kaur touched a career milestone when she surpassed former Indian skipper Mithali Raj’s record of most T20I runs for India on Saturday. Going past Mitha… [+1361 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Sri Lanka hikes fuel prices as filling stations go dry Colombo", "description": "State-run fuel retailer Ceylon Petroleum Corporation (CPC) has announced that the price hike will come into effect from 2 pm on Sunday. Lanka IOC has also hiked prices by the same proportion.", "url": "https://indianexpress.com/article/world/sri-lanka-hikes-fuel-prices-as-filling-stations-go-dry-colombo-7991953/", "urlToImage": "https://images.indianexpress.com/2022/06/petrol-diesel-price-today-express-photo-1200.jpg", "publishedAt": "2022-06-26T05:27:33Z", "content": "Crisis-hit Sri Lanka has hiked petrol price by LKR 50 and diesel by LKR 60 respectively, the third price revision in over two months, as the country continues to reel under the worst economic crisis … [+3605 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Christian Bale on Robert Pattinson’s The Batman: ‘He’s a wonderful actor…’", "description": "Christian Bale revealed that he still hasn't seen Matt Reeves's reboot of The Batman, which stars Robert Pattinson.", "url": "https://indianexpress.com/article/entertainment/hollywood/christian-bale-batman-robert-pattinson-dc-marvel-7991911/", "urlToImage": "https://images.indianexpress.com/2022/06/christianbale.jpeg", "publishedAt": "2022-06-26T05:22:25Z", "content": "Hollywood star Christian Bale revealed that he still hasn’t seen Robert Pattinson’s The Batman yet. Bale had portrayed the role of the caped crusader in Christopher Nolan’s Dark Knight trilogy. In 20… [+1574 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Google allows employees to relocate to states where abortion is legal", "description": "Google’s chief people officer, Fiona Cicconi, on Friday sent out a staff-wide memo reiterating that the company’s benefits plan and health insurance in US covers “out-of-state medical procedures that are not available where an employee lives and works.”", "url": "https://indianexpress.com/article/world/google-allows-employees-to-relocate-to-states-where-abortion-is-legal-7991905/", "urlToImage": "https://images.indianexpress.com/2022/05/Google-reuters-1.jpg", "publishedAt": "2022-06-26T05:20:14Z", "content": "In light of the United States Supreme Courts decision overturning Roe v. Wade and giving individual states the choice of banning or allowing abortions,  Google on Friday notified its American employe… [+3301 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "While Indians struggle, PM busy planning next distraction: Rahul Gandhi", "description": "Congress leader Rahul Gandhi has been critical of the Narendra Modi-led government's handling of the economy and has also called on the Centre to provide jobs to the youth.", "url": "https://indianexpress.com/article/india/rahul-gandhi-attacks-pm-narendra-modi-7991941/", "urlToImage": "https://images.indianexpress.com/2022/06/rahul-gandhi-attacks-pm.jpeg", "publishedAt": "2022-06-26T05:16:46Z", "content": "Congress leader Rahul Gandhi on Sunday attacked Prime Minister Narendra Modi, saying the PM’s mastery in “entire distraction science” can’t hide disasters such as an all-time high unemployment rate, … [+192 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "হাত-পা বেঁধে ৫ তলা থেকে ছুড়ে ফেলল স্বামী! ফ্যাশন ব্লগারের নৃশংস খুন", "description": "মৃতার পরিবারের অভিযোগের ভিত্তিতে আটক করা হয়েছে তার স্বামী আকাশ গৌতম সিং সহ আরও দু’জনকে।", "url": "https://bengali.indianexpress.com/general-news/fashion-blogger-pushed-off-building-with-hands-and-legs-tied-461857/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/cats-117.jpg", "publishedAt": "2022-06-26T05:00:55Z", "content": "- ! - , \r\n , - , \r\n : [ , ]\r\n “ , - , \r\n , -   \r\nStay updated with the latest news headlines and all the latest General news download Indian Express Bengali App.\r\nWeb Title: Fashion blogger pushed of… [+34 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "In a first, Delhi Fire Services deploys robots to douse big godown fire", "description": "Fire broke out at a plastic godown in Delhi’s Samaypur Badli area on Sunday. Delhi Fire Services sent two dozen fire tenders and special robots to douse the blaze.", "url": "https://indianexpress.com/article/cities/delhi/first-delhi-fire-service-deploys-robots-godown-fire-7991932/", "urlToImage": "https://images.indianexpress.com/2022/06/fire.jpeg", "publishedAt": "2022-06-26T04:58:52Z", "content": "A fire broke out at a three-storey plastic godown in Delhis Samaypur Badli area near Rohini Jail in the early hours of Sunday, officials said, adding that the Delhi Fire Services (DFS) used special r… [+1426 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "JugJugg Jeeyo box office collection day 2: Varun Dhawan-Kiara Advani film shows solid growth, here’s how much it minted", "description": "JugJugg Jeeyo box office collection day 2: Dharma Productions' JugJugg Jeeyo is set to see an almost 40 per cent gain in box office numbers. The film released in cinemas on June 24.", "url": "https://indianexpress.com/article/entertainment/bollywood/jugjugg-jeeyo-day-2-box-office-collection-varun-dhawan-kiara-advani-almost-40-percent-rs-12-crore-7991922/", "urlToImage": "https://images.indianexpress.com/2022/06/varun1200-1.jpg", "publishedAt": "2022-06-26T04:58:17Z", "content": "Karan Johar-bankrolled JugJugg Jeeyo is on a high as its box office numbers gained almost 40 per cent on second day of its release. After earning Rs 9.28 crore on its opening day, the film is estimat… [+1224 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Key accused in Secunderabad railway station arson case arrested", "description": "The accused allegedly took a bond for Rs three lakh from those who joined his institute to impart coaching for army recruitment.", "url": "https://indianexpress.com/article/cities/hyderabad/key-accused-in-secunderabad-railway-station-arson-case-arrested-7991917/", "urlToImage": "https://images.indianexpress.com/2022/06/train-fire-1-2.jpg", "publishedAt": "2022-06-26T04:57:50Z", "content": "An ex-serviceman, who allegedly masterminded the arson that took place in Secunderabad railway station on June 17 was arrested, the Telangana railway police said on Saturday.One person died and many … [+1568 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Khyati Rajvanshi", "title": "Behind the Art: Why James Abbott McNeill Whistler’s ‘Arrangement in Grey and Black No. 1’ became symbol of motherhood", "description": "The painting 'Whistler's Mother' has become an American icon overtime and is even known as the Victorian Mona Lisa. But why is this painting so iconic?", "url": "https://indianexpress.com/article/lifestyle/art-and-culture/behind-the-art-why-james-abbott-mcneill-whistlers-arrangement-in-grey-and-black-no-1-became-symbol-of-motherhood-7987417/", "urlToImage": "https://images.indianexpress.com/2022/06/Whistlers_Mother_1200.jpg", "publishedAt": "2022-06-26T04:50:53Z", "content": "Arrangement in Grey and Black No. 1 or better known as Whistlers Mother was paintedby the American-born artist James Abbott McNeill in 1871. The painting was done using oil on canvas and is displayed… [+5683 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Gayathri Mani", "title": "Delhi Government to conduct special drive to resolve pending pension cases", "description": "The main reason behind the delay in deciding pension matters are delays in the issuance of retirement orders and submitting pension papers to the Principal Accounts Office.", "url": "https://indianexpress.com/article/delhi/delhi-government-to-conduct-special-drive-to-resolve-pending-pension-cases-7991926/", "urlToImage": "https://images.indianexpress.com/2022/06/arvind-kejriwal-1.jpeg", "publishedAt": "2022-06-26T04:47:30Z", "content": "To address issues being faced by pensioners due to administrative delays, the Delhi Government has decided to organise a special drive to resolve all pending cases related to pensions and avoid litig… [+3370 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sridhar V", "title": "Explained: Why Toyota fears wheels may come off its flagship electric vehicle", "description": "According to a spokesperson for Toyota, the hub bolts on the wheels of the concerned bZ4X battery EVs run the risk of loosening “to the point where the wheel can detach from the vehicle” after “low-mileage use”.", "url": "https://indianexpress.com/article/explained/explained-toyota-fears-wheels-may-come-off-flagship-electric-vehicle-7991913/", "urlToImage": "https://images.indianexpress.com/2022/06/explained-toyota.png", "publishedAt": "2022-06-26T04:46:29Z", "content": "Less than three months after it launched the bZ4X SUV globally, Toyota Motor Corporation has issued a recall of nearly 2,700 units of the new electric vehicle (EV) following concerns that its loose w… [+3429 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shamik Chakrabarty", "title": "View Review: Why India will face a braver England in the 5th Test at Edgbaston", "description": "Since new coach Brendon MCullum took over and the Test team's reins were handed over to captain Ben Stokes, England have played an aggressive brand of cricket; India, meanwhile, will hope their best batters return to form", "url": "https://indianexpress.com/article/sports/cricket/view-review-why-india-will-face-a-braver-england-in-the-5th-test-at-edgbaston-7991900/", "urlToImage": "https://images.indianexpress.com/2022/06/WhatsApp-Image-2022-06-26-at-10.05.07-AM.jpeg", "publishedAt": "2022-06-26T04:44:31Z", "content": "That was the only time when Jamie Overton looked nervy, after moving into the 90s in his debut Test. Eventually he fell for 97, got a bear hug from Jonny Bairstow and left to a standing ovation from … [+5092 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "The rise of the 0.5 selfie", "description": "The 0.5 selfies are showing up on Instagram, proliferating in group chats, becoming the talk of parties and often being snapped to chronicle the minutiae of daily life.", "url": "https://indianexpress.com/article/technology/tech-news-technology/the-rise-of-the-0-5-selfie-7991916/", "urlToImage": "https://images.indianexpress.com/2022/06/NYT_Selfie_1.jpg", "publishedAt": "2022-06-26T04:36:17Z", "content": "Julia Herzig, a 22-year-old from Larchmont, New York, has an obsession. Its with taking a new kind of selfie one that doesnt exactly conform.\r\nIn some of these selfies, Herzigs forehead bulges across… [+5376 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "BTS: V takes Paris by storm with his swag and plays basketball; J-Hope to drop new album Jack In The Box", "description": "BTS' Kim Taehyung, born V, has been sharing photos of his Paris trip. On the other hand, J-Hope recently announced his new album, Jack In The Box.", "url": "https://indianexpress.com/article/entertainment/music/bts-v-france-fashion-show-j-hope-new-album-7991833/", "urlToImage": "https://images.indianexpress.com/2022/06/BTSV1200.jpeg", "publishedAt": "2022-06-26T04:35:15Z", "content": "BTS on a break, what? The band might have collectively decided to take some time off, but the individual members are churning out something new for ARMY practically every second day. After Jungkook’s… [+1875 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Registration for admissions to DU’s NCWEB begins", "description": "While DU has adopted the Common University Entrance Test (CUET) for admissions to all its undergraduate programmes, admissions to the NCWEB and the School of Open Learning will continue to be conducted on the ‘merit’ of school-leaving examination marks.", "url": "https://indianexpress.com/article/delhi/registration-for-admissions-to-dus-ncweb-begins-7991909/", "urlToImage": "https://images.indianexpress.com/2022/06/DU-Delhi-university-3.jpg", "publishedAt": "2022-06-26T04:27:26Z", "content": "Registrations for admissions to Delhi Universitys Non-Collegiate Womens Education Board (NCWEB) for the upcoming academic session have begun."}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "মাথায় টোপর, গলায় গাঁদার মালা! হাসি মুখে কুকুরকে বিয়ে যুবকের", "description": "তাজ্জব সকলেই!", "url": "https://bengali.indianexpress.com/viral/young-man-married-dog-pic-goes-viral-461852/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/cats-116.jpg", "publishedAt": "2022-06-26T04:25:31Z", "content": ", \r\n , , - ! \r\n : [ , ]\r\n : [ , ]\r\n ! ,  \r\nStay updated with the latest news headlines and all the latest Viral news download Indian Express Bengali App.\r\nWeb Title: Young man married dog pic goes vi… [+2 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "CLAT 2022 counselling process: Registration begins, check schedule here", "description": "Candidates can apply on the Consortium of National Law Universities' official website, consortiumofnlus.ac.in. The deadline for counselling registration, according to the official announcement, is June 27, 2022.", "url": "https://indianexpress.com/article/education/clat-2022-counselling-process-registration-schedule-consortiumofnlus-ac-in-7991896/", "urlToImage": "https://images.indianexpress.com/2022/05/gettyimages-1143715629-612x612-2.jpg", "publishedAt": "2022-06-26T04:17:29Z", "content": "The registration procedure for CLAT Counseling 2022 has begun, according to the Consortium of National Law Universities (CNLU). The registration windown opened on June 25. The dates for the counselli… [+1667 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "WHO says monkeypox is not yet a health emergency", "description": "The \"global emergency\" label currently only applies to the coronavirus pandemic and ongoing efforts to eradicate polio, and the U.N. agency has stepped back from applying it to the monkeypox outbreak.", "url": "https://indianexpress.com/article/world/who-says-monkeypox-is-not-yet-a-health-emergency-7991898/", "urlToImage": "https://images.indianexpress.com/2022/06/monkey.jpg", "publishedAt": "2022-06-26T04:17:08Z", "content": "Monkeypox is not yet a global health emergency, the World Health Organization (WHO) ruled on Saturday, although WHO Director-General Tedros Adhanom Ghebreyesus said he was deeply concerned about the … [+2402 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "এক দশক পর ভোট-যুদ্ধে পাহাড়, নির্বাচন ঘিরে কড়া পুলিশি প্রহরা সমতলেও", "description": "এক দশক পর পাহাড়ে ফের জিটিএ ভোট। সকাল থেকে ভোটের লাইনে পাহাড়বাসী।", "url": "https://bengali.indianexpress.com/west-bengal/a-decade-later-gta-election-is-going-on-at-hill-area-of-north-bengal/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/GTA-Vote-2.jpg", "publishedAt": "2022-06-26T04:06:20Z", "content": ", , , \r\n - \r\n , - , , \r\n - , \r\n - \r\nStay updated with the latest news headlines and all the latest Westbengal news download Indian Express Bengali App.\r\nWeb Title: A decade later gta election is goin… [+32 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "On Arjun Kapoor’s birthday, his 5 honest statements on Malaika Arora, Boney Kapoor and body positivity: ‘Hate creating fake perception we’re one happy family’", "description": "On Arjun Kapoor's birthday, here are some of the most candid statements he has made on people close to him, including his father Boney Kapoor and his partner Malaika Arora.", "url": "https://indianexpress.com/article/entertainment/bollywood/on-arjun-kapoors-birthday-his-5-honest-statements-on-malaika-arora-boney-kapoor-and-body-positivity-janhvi-kapoor-7980625/", "urlToImage": "https://images.indianexpress.com/2022/06/kapoor1200-1.jpg", "publishedAt": "2022-06-26T04:04:46Z", "content": "It can be argued that actor Arjun Kapoor makes as much of an impact with his interviews as he does in a good meaty role. On screen, he might take up any avatar depending upon the script, but off scre… [+6377 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Deaths rise to 23 from mass attempt to enter Spanish enclave", "description": "Spanish Prime Minister Pedro Sánchez on Saturday condemned what he described as a \"violent assault\" and an \"attack on the territorial integrity\" of Spain.", "url": "https://indianexpress.com/article/world/deaths-rise-to-23-from-mass-attempt-to-enter-spanish-enclave-7991878/", "urlToImage": "https://images.indianexpress.com/2022/06/1000-3.jpg", "publishedAt": "2022-06-26T04:03:29Z", "content": "The number of people who were killed after they tried to scale a border fence between Morocco and a Spanish enclave in North Africa rose to 23 Saturday as human rights organizations in Spain and Moro… [+4838 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Bloomberg", "title": "Crypto exchanges hunker down as everything goes wrong in India", "description": "With token prices plummeting, customers unable to transfer money to their accounts and a dreaded transaction tax on cryptocurrencies just around the corner, exchanges in India are bracing for a drawn-out crypto winter", "url": "https://indianexpress.com/article/technology/crypto/crypto-exchanges-hunker-down-as-everything-goes-wrong-in-india-7991890/", "urlToImage": "https://images.indianexpress.com/2022/06/Bitcoin-.jpeg", "publishedAt": "2022-06-26T04:02:23Z", "content": "Indias largest digital assets exchanges are bracing for a drawn-out crypto winter one with some unwelcome local twists.With token prices plummeting, customers unable to transfer money to their accoun… [+3917 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Debraj Deb", "title": "Tripura bypolls result: Counting of votes begins, CM Manik Saha’s fate hangs in balance among others", "description": "Officials said 78.58 per cent of votes were cast in these four Assembly seats in Tripura on June 23 as opposition political parties alleged violence on the day.", "url": "https://indianexpress.com/article/north-east-india/tripura/tripura-bypolls-results-live-updates-manik-saha-7991880/", "urlToImage": "https://images.indianexpress.com/2022/06/IMG_20220623_084359.jpg", "publishedAt": "2022-06-26T04:01:11Z", "content": "Counting of votes for seats in four assembly segments of Tripura began at 8 am Sunday at three locations in the state.As per the schedule of the Election Commission of India (ECI), votes cast for the… [+2078 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pratyush Raj", "title": "35 years after Kapil Dev, Bumrah to be the rare fast bowler to lead India Test side", "description": "Pace spearhead likely to be officially designated as captain for July 1 to 5 Edgbaston game after Rohit tests covid positive.", "url": "https://indianexpress.com/article/sports/cricket/35-years-after-kapil-dev-bumrah-to-be-the-rare-fast-bowler-to-lead-india-test-side-7991871/", "urlToImage": "https://images.indianexpress.com/2022/06/Bumrah.jpg", "publishedAt": "2022-06-26T03:54:57Z", "content": "Rarely has a fast bowler been picked to lead the side in Indian cricket. Kapil Dev was a glorious exception. No fast bowler has led India since Kapil Dev in March 1987. 35 years later Jasprit Bumrah … [+4616 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Kareena Kapoor and Saif Ali Khan turn Taimur into a ‘Rolling Stones baby’ as they head for concert in London, see photos", "description": "Kareena Kapoor took to Instagram and shared several photos with Taimur and Saif Ali Khan before a Rolling Stones concert.", "url": "https://indianexpress.com/article/entertainment/bollywood/kareena-kapoor-and-saif-ali-khan-turn-taimur-into-a-rolling-stones-baby-as-they-head-for-concert-in-london-7991835/", "urlToImage": "https://images.indianexpress.com/2022/06/kareena1200.jpeg", "publishedAt": "2022-06-26T03:52:22Z", "content": "Actors Kareena Kapoor and Saif Ali Khan decided to treat Taimur to a Rolling Stones concert. The couple is currently in London and Kareena took to Instagram and shared a photo with the family in matc… [+1575 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "দ্রৌপদী মুর্মুকে নিয়ে ‘বিতর্কিত’ টুইট, আইনি ঝামেলায় রামগোপাল বর্মা", "description": "যদিও টুইট প্রসঙ্গে চিত্রপরিচালক রামগোপাল বর্মা সাফ জানিয়েছেন নিছক মজার ছলেই এই টুইটটি করা।", "url": "https://bengali.indianexpress.com/entertainment/ram-gopal-varma-in-trouble-over-controversial-tweet-on-droupadi-murmu-461837/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/04/ramu.jpg", "publishedAt": "2022-06-26T03:50:57Z", "content": "This was said just in an earnest irony and not intended in any other way ..Draupadi in Mahabharata is my faviourate character but Since the name is such a rarity I just remembered the associated char… [+149 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Prime Minister Narendra Modi arrives in Germany to attend G7 summit", "description": "The G7 leaders are expected to focus on the Ukraine crisis that has triggered geopolitical turmoil besides fuelling a global food and energy crisis.", "url": "https://indianexpress.com/article/india/prime-minister-narendra-modi-arrives-germany-g7-summit-7991869/", "urlToImage": "https://images.indianexpress.com/2022/06/Modi-g7.jpeg", "publishedAt": "2022-06-26T03:48:32Z", "content": "Prime Minister Modi is attending the G7 summit, to be held on June 26 and 27, following an invitation by German Chancellor Olaf Scholz. The summit is being hosted by Germany in its capacity as the ch… [+1639 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ADAM LIPTAK", "title": "June 24, 2022: The day Chief Justice Roberts lost his court", "description": "The chief justice is now in many ways a marginal figure. The five other conservatives are impatient and ambitious, and they do not need his vote to achieve their goals.", "url": "https://indianexpress.com/article/world/june-24-2022-the-day-chief-justice-roberts-roev-swade-overturn-us-abortion-law-7991851/", "urlToImage": "https://images.indianexpress.com/2022/06/SCOTUS-ABORTION-40.jpg", "publishedAt": "2022-06-26T03:46:50Z", "content": "In the most important case of his 17-year tenure, Chief Justice John Roberts found himself entirely alone.He had worked for seven months to persuade his colleagues to join him in merely chipping away… [+9045 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Senators seek update on US security review of TikTok", "description": "TikTok said it has completed migrating information on its US users to servers at Oracle Corp, as it seeks to address US concerns over data integrity.", "url": "https://indianexpress.com/article/technology/tech-news-technology/senators-seek-update-on-us-security-review-of-tiktok-7991866/", "urlToImage": "https://images.indianexpress.com/2022/06/TikTok_Reuters_2.jpg", "publishedAt": "2022-06-26T03:44:50Z", "content": "A group of six Republican senators on Friday asked US Treasury Secretary Janet Yellen about an ongoing Biden administration national security review of social media platform TikTok.The US government’… [+2086 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Namit Kumar", "title": "Andy Murray – ‘People know what to expect at Wimbledon, and with all the uncertainty in the world, they like that’", "description": "In the build-up to the Championships, the Scot speaks to Namit Kumar about how, with or without ranking points, the event remains special for players and fans alike. He also weighs in on his own preparations and fitness, and how his life outside tennis has ch…", "url": "https://indianexpress.com/article/sports/tennis/andy-murray-people-know-what-to-expect-at-wimbledon-and-with-all-the-uncertainty-in-the-world-they-like-that-7991853/", "urlToImage": "https://images.indianexpress.com/2022/06/Untitled-design-58.jpg", "publishedAt": "2022-06-26T03:40:36Z", "content": "After a controversial build-up, claims and counter-claims, Wimbledon is set to begin on Monday. The familiar sights of the perfectly-manicured lawns, players wearing pristine whites and spectators in… [+5996 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Sunday Zodiac: These signs are likely to be shopaholics", "description": "Astrologer Pandit Jagannath Guruji tells us about zodiacs who love to shop and just can’t control themselves", "url": "https://indianexpress.com/article/lifestyle/life-style/sunday-zodiac-these-are-the-zodiac-signs-which-are-likely-to-be-shopaholic-7987438/", "urlToImage": "https://images.indianexpress.com/2022/06/horoscope1200.jpg", "publishedAt": "2022-06-26T03:40:30Z", "content": "Some people are good at saving money and are borderline stingy, too. But, there are some others who are so crazy about shopping that they live like a pauper by the end of each month.Zodiac signs play… [+1501 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Varun Dhawan reveals he fought with Kiara Advani during JugJugg Jeeyo shoot: ‘She said I am chauvinistic’", "description": "In a recent interview, Varun Dhawan opened up about his equation with Kiara Advani and shared how the two fought during the shoot of JugJugg Jeeyo.", "url": "https://indianexpress.com/article/entertainment/bollywood/varun-dhawan-reveals-fought-with-kiara-advani-during-jugjugg-jeeyo-shoot-called-me-chauvinistic-7991847/", "urlToImage": "https://images.indianexpress.com/2022/06/jugjugg-jeeyo.jpg", "publishedAt": "2022-06-26T03:39:53Z", "content": "While fans have been loving the chemistry between Varun Dhawan and Kiara Advani in JugJugg Jeeyo, things weren’t all smooth between the two during the shoot. In a recent interview, Varun revealed tha… [+1502 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Saurabh Parashar", "title": "In 5 yrs, 18 CCTV cams at UT Police HQ had no glitches", "description": "At least eight CCTV cameras are installed in the office of Ranjan and nine in the office of Chahal. The reply to the RTI filed by The Indian Express revealed that no CCTV cameras have been installed in the office of Deputy Inspector General (DIG) (UT), Deepak…", "url": "https://indianexpress.com/article/cities/chandigarh/in-5-yrs-18-cctv-cams-at-ut-police-hq-had-no-glitches-7991850/", "urlToImage": "https://images.indianexpress.com/2022/06/CCTV-1.jpg", "publishedAt": "2022-06-26T03:35:29Z", "content": "CONTRARY TO the 157 CCTV cameras installed across police stations and posts which developed 13,699 faults in the last five years, the 18 cameras installed at the office of Director General of Police … [+2333 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Two involved in cyber fraud arrested in Chandigarh", "description": "The Angadia system is a parallel banking system where traders send cash from one state to another through a person called Angadia that stands for courier. It is used in the jewellery business with Mumbai – Surat being the most popular route.", "url": "https://indianexpress.com/article/cities/chandigarh/two-involved-in-cyber-fraud-arrested-in-chandigarh-7991845/", "urlToImage": "https://images.indianexpress.com/2022/06/arrest-21.jpg", "publishedAt": "2022-06-26T03:29:45Z", "content": "THE UT Police arrested two men, part of a large-scale cyber fraudsters network, in Chandigarh on Saturday. The two were identified as Chauhan Ratan and Parmar Rajeshji of Gujarat, who stayed in a ren… [+1871 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Arjun Kapoor celebrates birthday with Malaika Arora, shares romantic selfies from Paris vacation. See pics", "description": "Arjun Kapoor took to Instagram and shared several selfies with Malaika Arora from their Paris vacation.", "url": "https://indianexpress.com/article/entertainment/bollywood/arjun-kapoor-shares-romantic-selfies-with-malaika-arora-from-paris-vacation-7991814/", "urlToImage": "https://images.indianexpress.com/2022/06/arjunmalaika1200.jpg", "publishedAt": "2022-06-26T03:28:32Z", "content": "Actors Arjun Kapoor and Malaika Arora shared photos from their Paris vacation on Instagram. The couple is in the city to ring in Arjun Kapoor’s birthday (June 26). In the photos, Arjun and Malaika po… [+1446 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Novak Djokovic doubles down on anti-vaccination stance, says US ban is fuelling his motivation for Wimbledon", "description": "The Serb revealed in his pre-Wimbledon press conference that he has completely closed his mind to getting vaccinated against COVID-19, which could mean the Championships will be the last Major he plays until next year's French Open.", "url": "https://indianexpress.com/article/sports/tennis/novak-djokovic-doubles-down-on-anti-vaccination-stance-says-us-ban-is-fuelling-his-motivation-for-wimbledon-7991844/", "urlToImage": "https://images.indianexpress.com/2022/05/Novak-Djokovic.jpg", "publishedAt": "2022-06-26T03:28:28Z", "content": "Defending champion Novak Djokovic says he will be extra motivated to claim a fourth successive Wimbledon title as it could be his last Grand Slam action of the year.The 35-year-old Serb missed the Au… [+2924 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rahel Philipose", "title": "Explained: Abortion laws around the world", "description": "Very often limits are placed on when an abortion is permitted, generally around gestational time limits. We take a look at some of the abortion policies in countries across the globe.", "url": "https://indianexpress.com/article/explained/explained-abortion-laws-around-the-world-7991798/", "urlToImage": "https://images.indianexpress.com/2022/06/Abortion-4-1.jpg", "publishedAt": "2022-06-26T03:19:42Z", "content": "With the US Supreme Court overturning the landmark 1973 Roe v Wade decision that established a constitutional right to an abortion, the United States is now among the few dozen countries that have se… [+5724 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Saurabh Parashar", "title": "For years, Tricity caught in middle of gang wars", "description": "In August 2021, Vikramajeet Singh (aka Vicky Middukhera), a Youth Akali Dal leader and one close to Lawrence Bishnoi, was chased and shot dead in Mohali. The Mohali police investigation revealed that Shubhmanpreet Singh, manager of late Sidhu Moosewala, was b…", "url": "https://indianexpress.com/article/chandigarh/for-years-tricity-caught-in-middle-of-gang-wars-7991750/", "urlToImage": "https://images.indianexpress.com/2022/06/shot-dead.jpg", "publishedAt": "2022-06-26T03:11:28Z", "content": "Investigation of the murder of Punjabi singer Shubdeep Singh Sidhu Moosewala has revealed several links to the Tricity and gang wars between the Bishnoi and Bambiha groups. A number of people from or… [+2235 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "‘দুর্নীতিতে আষ্ঠেপৃষ্ঠে জড়িত শুভেন্দুও’, গ্রেফতারের দাবিতে পথে নামছে তৃণমূল", "description": "সোমবার রাজ্যের তিন জায়গায় বিরোধী দলনেতাকে গ্রেফতারের দাবিতে পথে নামছে রাজ্যের শাসকদল।", "url": "https://bengali.indianexpress.com/west-bengal/tmc-will-make-protest-demanding-arrest-of-bjp-suvendu-adhikari-461830/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/Mamata-Banerjee-Suvendu-Adhikari-1.jpg", "publishedAt": "2022-06-26T03:11:16Z", "content": ", \r\n - - \r\n - CAA , NRC- \r\n , , , - , \r\n, \r\nStay updated with the latest news headlines and all the latest Westbengal news download Indian Express Bengali App.\r\nWeb Title: Tmc will make protest deman… [+34 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anvita Singh", "title": "96 director on Vijay Sethupathi-Trisha’s cruel fate in the film: ‘I very badly want them to meet again but…’ | Scene Stealer", "description": "In today's installment of Scene Stealer, we revisit the heart-wrenching climax of Vijay Sethupathi-Trisha film 96. The romantic drama released in 2018 and was directed by Prem Kumar.", "url": "https://indianexpress.com/article/entertainment/tamil/96-film-vijay-sethupathi-trisha-climax-scene-stealer-video-7984481/", "urlToImage": "https://images.indianexpress.com/2022/06/961200.jpg", "publishedAt": "2022-06-26T03:02:46Z", "content": "Once all the vogue, out and out romantic movies are no longer to be found in western or Hindi cinema. Their disappearance from mainstream films has caused some heartbreak to cinephiles, who flocked t… [+2956 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sana Farzeen", "title": "Masoom actor Samara Tijori says father Deepak Tijori’s struggles taught her the importance of patience: ‘He said…’", "description": "Samara Tijori, who plays the lead in Masoom, talks about lessons she learned from her father Deepak Tijori and why being a star-kid is subjective.", "url": "https://indianexpress.com/article/entertainment/web-series/masoom-actor-samara-father-deepak-tijori-struggles-nepotism-star-kids-7988973/", "urlToImage": "https://images.indianexpress.com/2022/06/samara-deepak-tojori-masoom.jpg", "publishedAt": "2022-06-26T03:02:27Z", "content": "Deepak Tijori’s daughter Samara Tijori made her acting debut with Bob Biswas last year. While she had a small yet significant part, it’s Disney Plus Hotstar’s Masoom that has brought her into the lim… [+3050 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Bengaluru’s National Gallery of Modern Art: Tracing India’s artistic essence over the years", "description": "From paintings by Rabindranath Tagore, Raja Ravi Varma, Jamini Roy to post-independence art works, the Manikyavelu Mansion unveils artistry that has evolved over many years", "url": "https://indianexpress.com/article/cities/bangalore/national-gallery-of-modern-art-bengaluru-india-art-history-7991167/", "urlToImage": "https://images.indianexpress.com/2022/06/bangalore-kyc-1.jpeg", "publishedAt": "2022-06-26T03:00:47Z", "content": "This palatial mansion is a treat for your eyes as its walls are simply draped in rich history and treasures of art. The National Gallery of Modern Art (NGMA) on the premises of the Manikyavelu Mansio… [+4817 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aksheev Thakur", "title": "Lakes of Bengaluru: As Konanakunte lake dies a slow death, Bengaluru civic body gears up to restore it", "description": "More than two acres of the lake is encroached by a private distillery company, houses and a school. The document also states that a road and graveyard have also eaten away portions of the water body.", "url": "https://indianexpress.com/article/cities/bangalore/lakes-of-bengaluru-konanakunte-lake-slow-death-bengaluru-civic-body-restore-7991479/", "urlToImage": "https://images.indianexpress.com/2022/06/FotoJet-2022-06-25T212736.013-logo-1.jpg", "publishedAt": "2022-06-26T03:00:41Z", "content": "While moving towards Konanakunte Cross in Bengaluru city one would seldom notice the dying Konanakunte lake also known as Ganapathipura lake. Strangely, many residents with whom The Indian Express sp… [+3929 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Ghislaine Maxwell put on suicide watch, may seek sentencing delay, lawyer says", "description": "Prosecutors have said Ghislaine Maxwell should spend at least 30 years in prison, citing her \"utter lack of remorse.\" Maxwell wants a term shorter than 20 years.", "url": "https://indianexpress.com/article/world/ghislaine-maxwell-suicide-watch-sentencing-delay-7991802/", "urlToImage": "https://images.indianexpress.com/2022/06/reuters-ghislaine-maxwell.jpg", "publishedAt": "2022-06-26T02:48:46Z", "content": "In a letter to the judge overseeing Maxwell’s case, Maxwell’s lawyer, Bobbi Sternheim, said her client is “unable to properly prepare, for sentencing,” after officials at the Metropolitan Detention C… [+1618 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Sports Desk", "title": "আজ-ই শুরু ভারত-আয়ারল্যান্ড মহারণ! হার্দিকের ইন্ডিয়াকে কখন, কোন চ্যানেলে দেখা যাবে", "description": "রবিবার দ্বিতীয় সারির দল নিয়ে ভারত মোকাবিলা করতে নামছে আয়ারল্যান্ডের। সেই ম্যাচের বিস্তারিত জেনে নিন।", "url": "https://bengali.indianexpress.com/sports/india-vs-ireland-1st-t20-when-and-where-to-watch-hardik-pandya-men-in-co-in-action-461818/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/Team_India.jpeg", "publishedAt": "2022-06-26T02:45:00Z", "content": "Live Streaming of India Vs Ireland, 1st T20 Match in bengali: , - \r\n (IND vs IRE) ?\r\n : ! \r\n (IND vs IRE) ?\r\n (IND vs IRE) ?\r\n (IND vs IRE) ?-\r\n :  IPL- ! \r\n :, , , / , , , , , , , \r\n :, , , , , , , … [+4 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Mumbai vs Madhya Pradesh, Ranji Trophy Final Day 5 Live Score Updates: MP on cusp of history", "description": "Ranji Trophy Final, Day 5 Live Cricket Score Streaming Online Today Match, Star Sports 1, Hotstar Live: Madhya Pradesh vs Mumbai takes place in Bengaluru.", "url": "https://indianexpress.com/article/sports/cricket/ranji-trophy-final-day-5-madhya-pradesh-vs-mumbai-live-score-7991646/", "urlToImage": "https://images.indianexpress.com/2022/06/Ranji-Final-Day-5-Live.jpg", "publishedAt": "2022-06-26T02:39:26Z", "content": "Mumbai vs Madhya Pradesh, Ranji Trophy Final, Day 5 Live Cricket Score Streaming Online Today Match Updates:\r\nMP show how to get one hand on Ranji Trophy: Bat over 177 overs and bowl smartly wide out… [+989 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Delhi News Live: Rajinder Nagar polls results to be declared today", "description": "At the constituency, the contest was mainly between AAP and BJP. The Congress was largely missing, and their volunteers’ absence at many polling booths was conspicuous.", "url": "https://indianexpress.com/article/cities/delhi/delhi-news-live-rajinder-nagar-polls-results-7991787/", "urlToImage": "https://images.indianexpress.com/2022/06/raghav-chadha-1.jpg", "publishedAt": "2022-06-26T02:29:36Z", "content": "Voting trends through the day signalled that the voter turnout would be low. In the first four hours, for example, the voter turnout was only 14.85%. The voter turnout is low. We have tried out best … [+943 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "While You Were Asleep: Bale joins Los Angeles FC, Liverpool in race to sign Bellingham, McLaughlin smashes her own world record", "description": "Bale had won three La Liga titles, five Champions League trophies - winning one of each last season - plus three UEFA Super Cups, three FIFA Club World Cups, the Copa Del Rey and Spanish Super Cup during his time in Real Madrid.", "url": "https://indianexpress.com/article/sports/sport-others/while-you-were-asleep-gareth-bale-joins-los-angeles-fc-liverpool-in-race-to-sign-jude-bellingham-sydney-mclaughlin-breaks-own-world-record-7991785/", "urlToImage": "https://images.indianexpress.com/2022/06/While-You-Were-asleep-11.jpg", "publishedAt": "2022-06-26T02:27:39Z", "content": "Former Real Madrid forward and Wales captain Gareth Bale has joined MLS side Los Angeles FC on a free transfer. Bale confirmed the move on his social media pages, saying: “See you soon, Los Angeles”.… [+3736 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Administration initiates process for structural audit of 60 societies in Gurgaon, seeks consultants", "description": "The DC said that once the panel is finalised, the financial statement will be prepared by the district administration and the cost involved in conducting the structural audit will be borne by the developer concerned.", "url": "https://indianexpress.com/article/delhi/administration-initiates-process-for-structural-audit-of-60-societies-in-gurgaon-seeks-consultants-7991784/", "urlToImage": "https://images.indianexpress.com/2022/06/gurgaon.jpg", "publishedAt": "2022-06-26T02:21:59Z", "content": "The Gurgaon deputy commissioner (DC) Saturday said the district administration has initiated a process and sought expression of interest from private firms and agencies for a structural audit of more… [+1657 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Sports Desk", "title": "ইংল্যান্ডে বড় ধাক্কায় ভারত! ক্যাপ্টেন রোহিতকে ছাড়াই হয়ত খেলতে হবে ইন্ডিয়াকে", "description": "ইংল্যান্ডে গিয়ে করোনা আক্রান্ত হলেন রোহিত শর্মা। টেস্টে খেলা নিয়ে শুরু হয়ে গেল ঘোরতর সংশয়।", "url": "https://bengali.indianexpress.com/sports/india-vs-england-rohit-sharma-tests-positive-for-corona-virus-days-ahead-of-one-off-test-461806/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/Team-india-3.jpeg", "publishedAt": "2022-06-26T01:53:11Z", "content": "UPDATE – #TeamIndia Captain Mr Rohit Sharma has tested positive for COVID-19 following a Rapid Antigen Test (RAT) conducted on Saturday. He is currently in isolation at the team hotel and is under th… [+61 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Bypoll results 2022 Live Updates: Counting of votes in 3 Lok Sabha, 7 assembly seats today", "description": "Bypoll Results 2022 Live: The fate of newly appointed Tripura Chief Minister Manik Saha among others will be decided today.", "url": "https://indianexpress.com/article/india/bypoll-results-2022-live-uttar-pradesh-punjab-delhi-jharkhand-andhra-pradesh-tripura-7991343/", "urlToImage": "https://images.indianexpress.com/2022/06/UP-polls.jpg", "publishedAt": "2022-06-26T01:30:30Z", "content": "People queue up at a polling station to cast their votes for the Sangrur Lok Sabha bypolls, in Sangrur, Thursday. (PTI)\r\nWhile Sangrur in Punjab recorded 45.3 per cent voter turnout, the polling perc… [+1228 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Rainwater must be tapped optimally in urban & rural areas: Farm unions", "description": "The farmers' unions demanded to repeal the dam safety Act and also asked the state to pass a resolution in the assembly in this regard.", "url": "https://indianexpress.com/article/cities/chandigarh/rainwater-must-be-tapped-optimally-in-urban-rural-areas-farm-unions-7991762/", "urlToImage": "https://images.indianexpress.com/2022/06/pune-1-1.jpg", "publishedAt": "2022-06-26T01:16:05Z", "content": "A pilot project must be initiated to recharge the groundwater, and rainwater must be tapped optimally in both urban and rural areas, according to 22 farmers’ organisations of Punjab.They were speakin… [+1495 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Sunday Long Reads: Meherwan Irani’s Chai Pani restaurant, Kashmir’s transgender community, exotic food, Sahitya Akademi Lit Fest, and more", "description": "Here are much interesting reads of the week!", "url": "https://indianexpress.com/article/express-sunday-eye/sunday-long-reads-of-everyday-exotic-food-ranjit-lal-7990089/", "urlToImage": "https://images.indianexpress.com/2022/06/Fritters_1200_.jpg", "publishedAt": "2022-06-26T01:15:59Z", "content": "When chef Radhika Khandelwal stirs her pot of memories, she stops at the moment when she sat with her grandmother under the winter sun shelling peas. Wed snack on some and keep the pods away because … [+5127 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kamaldeep Singh Brar", "title": "Woman from MP going to Pak with legal visa stopped at Attari border", "description": "The woman was handed over to Rewa police after a “missing person” complaint was registered by her parents.", "url": "https://indianexpress.com/article/cities/chandigarh/woman-from-mp-going-to-pak-with-legal-visa-stopped-at-attari-border-7991755/", "urlToImage": "https://images.indianexpress.com/2020/01/mahatma-1200-1.jpg", "publishedAt": "2022-06-26T01:11:15Z", "content": "A 24-year-old woman from Madhya Pradesh on her way to Pakistan with a valid visa to marry her boyfriend was detained at the Attari border by the Punjab Police for handing her over to her parents in R… [+585 chars]"}]}