{"status": "ok", "totalResults": 424, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Mimansa Shekhar", "title": "Life in a Metro turns 15: Anurag Basu’s love letter to Mumbai about human relationships remains fresh and relevant", "description": "As Anurag Basu's Life in a Metro completes 15 years today, we take a look back at why the film worked, and what keeps it relevant even today.", "url": "https://indianexpress.com/article/entertainment/bollywood/life-in-a-metro-15-years-anurag-basu-mumbai-shilpa-shetty-irrfan-khan-anthology-relevant-7903965/", "urlToImage": "https://images.indianexpress.com/2022/05/life-in-a-metro-1200.jpg", "publishedAt": "2022-05-11T02:51:28Z", "content": "Anurag Basu didn’t want Shilpa Shetty’s character Shikha to end up with her lover Aakash (Shiney Ahuja) at the end of Life in a Metro. He thought no Indian woman would give precedence to her desires … [+4374 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Sadashiv Amrapurkar’s ‘menacing Maharani’ was seen as ‘gross, downmarket’ at the time: ‘The minute we saw him in a sari…’", "description": "On Sadashiv Amrapurkar's 72nd birth anniversary, here's remembering how he played one of his most iconic roles in Mahesh Bhatt's Sadak.", "url": "https://indianexpress.com/article/entertainment/bollywood/sadashiv-amrapurkar-maharani-sadak-gross-down-market-we-saw-him-in-a-sari-7909741/", "urlToImage": "https://images.indianexpress.com/2022/05/sadashiv-amrapurkar-1200.jpg", "publishedAt": "2022-05-11T02:44:18Z", "content": "Actor Sadashiv Amrapurkar devoted his life to Marathi theatre and in the many years that he served his art, he played many memorable characters. But Amrapurkar came to mainstream spotlight when he pl… [+1811 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Covid-19 live updates: UP death registrations fell in pandemic year; Life insurance firms settled 2.2 lakh Covid death claims", "description": "Covid-19 India Live Updates, 11 May: Compensation towards Covid death claims were reported under individual, group policies and the PM Jeevan Jyoti Bima Yojana (PMJJBY). Back-of-the-envelope calculations indicate that the average claim per person was Rs 7,63,…", "url": "https://indianexpress.com/article/india/covid-19-live-updates-deaths-life-insurance-guidelines-7910651/", "urlToImage": "https://images.indianexpress.com/2022/05/Covid-live-updates.jpg", "publishedAt": "2022-05-11T02:39:22Z", "content": "According to data from the Civil Registration System (CRS), Uttar Pradesh registered 8.73 lakh deaths in 2020, down from 9.44 lakh deaths registered in 2019.Kerala, Telangana, Uttarakhand and Delhi a… [+1924 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Watch: Barcelona’s Araújo exits field in ambulance after concussion", "description": "Araújo collapsed after clashing heads with Gavi Páez as both players went for a ball in the 61st minute against Celta Vigo at the Camp Nou Stadium. The defender seemed OK at first but went down to the ground after taking a few steps.", "url": "https://indianexpress.com/article/sports/football/watch-barcelonas-araujo-exits-field-in-ambulance-after-concussion-7910648/", "urlToImage": "https://images.indianexpress.com/2022/05/Untitled-design-42.jpg", "publishedAt": "2022-05-11T02:29:56Z", "content": "Barcelona defender Ronald Araújo was taken off the field in an ambulance after clashing heads with a teammate and collapsing on Tuesday.The Uruguay defender has suffered a concussion and has been tak… [+1018 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Israel arrests 9 for ‘AirDrop’ of crash images aboard plane", "description": "The incident took place on a AndoluJet flight that had been due to take off for Istanbul.", "url": "https://indianexpress.com/article/world/israel-airdrop-crash-images-arrests-7910640/", "urlToImage": "https://images.indianexpress.com/2022/05/israel-flight.jpg", "publishedAt": "2022-05-11T02:20:10Z", "content": "A taxiing plane returned to the gate at Tel Aviv’s Ben Gurion Airport on Tuesday after photos of aviation disasters popped up on passengers’ phones sent, Israeli authorities believe, by nine people o… [+1387 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rahel Philipose, Sonal Gupta", "title": "Daily briefing: Shoot-at-sight orders in Sri Lanka amid violent protests; life insurance firms settle 2.2 lakh Covid death claims", "description": "Preliminary investigations indicate the attack in Mohali was allegedly orchestrated by a wanted gangster, Harvinder Singh alias Rinda, who is believed to be currently based in Pakistan and involved in terror operations against India, sources said.", "url": "https://indianexpress.com/article/live-news/top-news-briefing-today-7910633/", "urlToImage": "https://images.indianexpress.com/2022/05/Express-intro-5.jpg", "publishedAt": "2022-05-11T01:47:05Z", "content": "The Big Story\r\nA day after Mahinda Rajapaksa resigned as Sri Lankas Prime Minister, leading to violent protests, the armed forces have been ordered to shoot at any person damaging public property or … [+4926 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Jodie Comer to headline feminist survival drama The End We Start From", "description": "The End We Start From is touted as a feminist survival story, set amid an environmental crisis that sees London submerged by flood waters.", "url": "https://indianexpress.com/article/entertainment/hollywood/jodie-comer-to-headline-feminist-survival-drama-the-end-we-start-from-7909708/", "urlToImage": "https://images.indianexpress.com/2022/05/Jodie-Comer-1200ny667-nf.jpg", "publishedAt": "2022-05-11T01:30:02Z", "content": "British star Jodie Comer will play the lead role in an upcoming thriller movie, titled The End We Start From.The movie will be produced by actor Benedict Cumberbatch‘s production banner along with Su… [+953 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Will deal bid to foment religious troubles with an iron hand, Tamil Nadu CM MK Stalin says", "description": "Pointing to a rise in hate speeches vis-à-vis caste and religion in social media, Tamil Nadu Chief Minister M K Stalin said elements propagating hatred are being closely monitored.", "url": "https://indianexpress.com/article/cities/chennai/tamil-nadu-cm-mk-stalin-assembly-religious-troubles-iron-hand-7910620/", "urlToImage": "https://images.indianexpress.com/2022/05/MK-Stalin-4-5-1-1.jpeg", "publishedAt": "2022-05-11T01:20:31Z", "content": "Taking a firm stand against violence and its prevention, Tamil Nadu Chief Minister M K Stalin on Tuesday said in the Assembly that any attempts to foment trouble on any grounds like politics, religio… [+4198 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "TANGEDCO’s outstanding debts mount to Rs 1,23,895.68 crore by 2019-20: CAG", "description": "The debts mounted due to the partial takeover of debt, failure to convert 25 per cent debt into bonds and increase in borrowings for generation project by 87.05 per cent and working capital by 189.88 per cent during five years ending 2019-20, a CAG report sai…", "url": "https://indianexpress.com/article/cities/chennai/tangedco-outstanding-debts-cag-report-2019-2020-tamil-nadu-7910617/", "urlToImage": "https://images.indianexpress.com/2022/05/electricity-reuters-1200-2-1.jpeg", "publishedAt": "2022-05-11T01:08:05Z", "content": "The outstanding debts of the State power utility Tamil Nadu Generation and Distribution Corporation Limited (TANGEDCO) increased to Rs 1,23,895.68 crore by the end of 2019-20 from Rs 81,312 crore in … [+2990 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Tamil Nadu: Annamalai University moves Madras HC challenging UGC order restraining admissions", "description": "The writ petition prayed for a direction to the UGC to issue recognition of open and distance learning programmes for the current academic year 2022-23.", "url": "https://indianexpress.com/article/cities/chennai/tamil-nadu-annamalai-university-ugc-madras-high-court-7910615/", "urlToImage": "https://images.indianexpress.com/2022/05/Madras-HC-2-3-1-3.jpg", "publishedAt": "2022-05-11T00:59:07Z", "content": "The Annamalai University in Tamil Nadu has moved the Madras High Court challenging an order of the University grants Commission (UGC), which restrained it from carrying out admissions.The writ petiti… [+1986 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Chennai: Uganda woman smuggles drugs in intestine, remanded", "description": "The prosecution case was that Directorate of Revenue Intelligence (DRI) held 33-year-old Sandra Nanteza at the International Airport in Chennai on May 6 after she came from Sharjah.", "url": "https://indianexpress.com/article/cities/chennai/chennai-uganda-woman-smuggles-drugs-in-intestine-remanded-7910613/", "urlToImage": "https://images.indianexpress.com/2022/05/drugs-1.jpeg", "publishedAt": "2022-05-11T00:52:31Z", "content": "A woman air passenger from Uganda, who was detained on charges of smuggling drugs in the form of capsules in her stomach, was on Tuesday produced before a court in Chennai and was sent to judicial cu… [+725 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Serivce", "title": "IIT-BHU to collaborate with Australian varsity", "description": "The delegation met IIT-BHU Director Pramod Kumar Jain and discussed various avenues of collaborations and, student and faculty exchange programmes that the two institutions could explore. The two institutes also discussed long-term goals like a joint PhD prog…", "url": "https://indianexpress.com/article/cities/lucknow/iit-bhu-to-collaborate-with-australian-varsity-7910603/", "urlToImage": "https://images.indianexpress.com/2018/03/iit-bhu-759.jpg", "publishedAt": "2022-05-11T00:24:07Z", "content": "The Indian Institute of Technology- Banaras Hindu University (IIT-BHU) and the Australian National University (ANU) have joined hands for academic and research collaboration. A high-level delegation … [+1168 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Serivce", "title": "Varanasi court to continue hearing on replacement of senior official today", "description": "On Saturday, the Anjuman Intezamia Masjid Committee filed an application in the court seeking the replacement of Advocate Commissioner Ajai Kumar, accusing him of being “biased”.", "url": "https://indianexpress.com/article/cities/lucknow/varanasi-court-to-continue-hearing-on-replacement-of-senior-official-today-7910599/", "urlToImage": "https://images.indianexpress.com/2021/04/Gyanvapi-Mosque.jpg", "publishedAt": "2022-05-11T00:16:43Z", "content": "THE HEARING regarding replacement of a court-appointed Advocate Commissioner for the survey of Kashi Vishwanath Temple-Gyanvapi Mosque complex continued in a Varanasi court on Tuesday, with the court… [+1557 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Days after girl ‘molested’, her mother dies in acid attack by accused, aides: cops", "description": "Six persons, including the key  accused, have been arrested, said ASP, Pilibhit. Pavitra Mohan Tripathi. The girl’s father is the complainant in the molestation case.", "url": "https://indianexpress.com/article/cities/lucknow/days-after-girl-molested-her-mother-dies-in-acid-attack-by-accused-aides-cops-7910597/", "urlToImage": "https://images.indianexpress.com/2022/05/express-5-8.jpg", "publishedAt": "2022-05-11T00:09:48Z", "content": "A DAY before a 17-year-old girl was to record her statement before the magistrate in a molestation case, the prime accused and his aides allegedly threw acid on the victims parents while they were sl… [+2204 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Serivce", "title": "24 posts in nine departments Cabinet: Olympics, Asian Games medal winners to get govt jobs", "description": "The move comes after a proposal – Uttar Pradesh International Medal Winners Direct appointment Rules, 2022 – pushing for the appointments was cleared by the state cabinet on Tuesday.", "url": "https://indianexpress.com/article/cities/lucknow/24-posts-in-nine-departments-cabinet-olympics-asian-games-medal-winners-to-get-govt-jobs-7910591/", "urlToImage": "https://images.indianexpress.com/2021/11/IOC.jpg", "publishedAt": "2022-05-11T00:01:48Z", "content": "The Uttar Pradesh cabinet will appoint sportspersons who have bagged medals in international championships and tournaments as gazetted officers directly on 24 posts across nine government departments… [+2655 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lalmani Verma", "title": "ABVP protests on LU campus, seeks sacking of Dalit prof", "description": "The ABVP later began an “indefinite” dharna on campus, demanding that the university administration sack Ravi Kant, an associate professor in the Hindi department of the varsity.", "url": "https://indianexpress.com/article/cities/lucknow/abvp-protests-on-lu-campus-seeks-sacking-of-dalit-prof-7910584/", "urlToImage": "https://images.indianexpress.com/2022/05/Guj-2-1.jpg", "publishedAt": "2022-05-10T23:52:35Z", "content": "THE AKHIL Bharatiya Vidyarthi Parishad (ABVP) on Tuesday organised a protest on the Lucknow University (LU) campus demanding an apology from an associate professor a Dalit for allegedly making object… [+2529 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Notify polls for local bodies in 2 weeks: SC to MP poll panel", "description": "The court was hearing petitions challenging the constitutional validity of the amendments made to the Madhya Pradesh Municipal Act, 1956, Madhya Pradesh Panchayat Raj Avam Gram Swaraj Adhiniyam, 1993 and Madhya Pradesh Municipalities Act, 1961.", "url": "https://indianexpress.com/article/india/notify-polls-for-local-bodies-in-2-weeks-sc-to-mp-poll-panel-7910588/", "urlToImage": "https://images.indianexpress.com/2022/04/supreme-court-sc-bloomberg-1200.jpeg", "publishedAt": "2022-05-10T23:51:00Z", "content": "EXPRESSING CONCERN that over 23,000 local bodies in Madhya Pradesh are functioning without elected representatives for more than two years as elections have not happened because the state government … [+3133 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Babul Supriyo to be sworn in as MLA by deputy Speaker today", "description": "Speaking to reporters on Tuesday, state Parliamentary Affairs minister Partha Chatterjee said the oath ceremony of Supriyo would be held on Wednesday and will be administered by the Deputy Speaker as mandated by the Governor.", "url": "https://indianexpress.com/article/cities/kolkata/babul-supriyo-to-be-sworn-in-as-mla-by-deputy-speaker-today-7910585/", "urlToImage": "https://images.indianexpress.com/2022/04/Babul-Supriyo-1200-1.jpg", "publishedAt": "2022-05-10T23:38:41Z", "content": "Former Union minister Babul Supriyo will on Wednesday take oath as a TMC MLA, almost a month after he won the Ballygunge Assembly bypoll.Speaking to reporters on Tuesday, state Parliamentary Affairs … [+962 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Stop partisan politics, treat all equally: Dhankhar to TMC", "description": "A BJP delegation, led by Leader of Opposition in state Assembly Suvendu Adhikari, BJP state president Sukanta Majumdar and others, on Tuesday met Dhankhar at Raj Bhawan along with victims of post poll violence and demanded compensation for them.", "url": "https://indianexpress.com/article/cities/kolkata/stop-partisan-politics-treat-all-equally-dhankhar-to-tmc-7910578/", "urlToImage": "https://images.indianexpress.com/2022/04/DHANKAR-2.jpeg", "publishedAt": "2022-05-10T23:34:01Z", "content": "Governor Jagdeep Dhankhar on Tuesday met victims of post-poll violence in the state and asked the state government to stop partisan politics. A BJP delegation, led by Leader of Opposition in state As… [+1826 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Ruchika Goswamy", "title": "Hearing the name of our country, it was a good feeling: Aishwarya Jadhav", "description": "In late April, Jadhav, India's number one player in the U-14 girls category, adorned the Indian jersey and displayed a stellar performance of skill and grit at the Asia/Oceania World Junior Tennis Competition (U14 Girls’) Final Qualifying 2022, held in New De…", "url": "https://indianexpress.com/article/cities/pune/hearing-the-name-of-our-country-it-was-a-good-feeling-aishwarya-jadhav-7910580/", "urlToImage": "https://images.indianexpress.com/2021/04/pic-4-9.jpg", "publishedAt": "2022-05-10T23:32:25Z", "content": "IF CONFIDENCE had a face, it could very well be Kolhapur tennis player Aishwarya Jadhavs. Jadhav, continuing her consistency since the start of the year, said that she has newfound confidence in hers… [+1310 chars]"}]}