{"status": "ok", "totalResults": 449, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi Police arrests Bhim Sena chief for threatening Nupur Sharma", "description": "In a Facebook video, Tanwar announced a bounty of Rs 1 crores on Nupur Sharma and also made threatening remarks, police said.", "url": "https://indianexpress.com/article/cities/delhi/nupur-sharma-prophet-muhammad-delhi-police-bhima-sena-nawab-satpal-tanwar-bjp-7974415/", "urlToImage": "https://images.indianexpress.com/2022/06/279093882_1445146752603338_5686282835462058302_n-4.jpg", "publishedAt": "2022-06-17T00:40:50Z", "content": "The Delhi Police Special Cell has arrested Bhim Sena chief Nawab Satpal Tanwar for allegedly issuing derogatory remarks and calling for violence against BJP spokesperson Nupur Sharma for her alleged … [+951 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kanchan Vasdev", "title": "Pvt agriculture colleges flouting norms may face action, warns Punjab govt", "description": "As per details, out of 117 colleges, 33 had not complied with rules that mandated that such educational institutions have proper infrastructure to provide agriculture education to students in 2020.", "url": "https://indianexpress.com/article/cities/chandigarh/pvt-agriculture-colleges-flouting-norms-may-face-action-warns-punjab-govt-7974417/", "urlToImage": "https://images.indianexpress.com/2022/05/du-.jpg", "publishedAt": "2022-06-17T00:39:19Z", "content": "Punjab’s Department of Agriculture has decided to crack the whip and may prohibit private colleges offering bachelors degree in Agriculture from holding fresh student admissions if they fail to compl… [+2853 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Jagpreet Singh Sandhu", "title": "Custody battle in Punjab and Haryana high court: ‘Mother’s lap a natural cradle where child’s safety, welfare can be assured’", "description": "During argument in the case, the girl's father (husband of petitioner woman) had contended that the minor child refused to go with the mother in the recent past.", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-haryana-high-court-custody-battle-7974396/", "urlToImage": "https://images.indianexpress.com/2022/02/Punjab-and-Haryana-HC-2-1-1.jpg", "publishedAt": "2022-06-16T23:40:46Z", "content": "The Punjab and Haryana High Court has directed the handing over custody of a five-year-old girl to her mother, observing that lap of the mother is a natural cradle where the safety and welfare of the… [+3871 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Raakhi Jagga", "title": "Farmer unions launch statewide protest against new moong procurement policies", "description": "The farm unions, who held protests in 70 places across 23 districts of Punjab, have claimed that the government was asking for copies of farad (land records) to be submitted with the procurement agency before purchase of the moong and maize crops.", "url": "https://indianexpress.com/article/cities/ludhiana/farmer-unions-launch-statewide-protest-against-new-moong-procurement-policies-7974398/", "urlToImage": "https://images.indianexpress.com/2022/06/protest-3col.jpg", "publishedAt": "2022-06-16T23:40:46Z", "content": "At least 22 farm unions of Punjab on Thursday launched an agitation against the state government against the new procurement policies at mandis for the purchase of moong and maize crops.The farm unio… [+2195 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Raakhi Jagga", "title": "Protests mark Mann’s maiden roadshow", "description": "CM harps on his three-month-old govt achievements", "url": "https://indianexpress.com/article/cities/ludhiana/protests-mark-manns-maiden-roadshow-7974394/", "urlToImage": "https://images.indianexpress.com/2022/06/Mann-campaign-4col.jpg", "publishedAt": "2022-06-16T23:35:26Z", "content": "Although Punjab Chief Minister Bhagwant Mann’s much-publicised maiden roadshow for the upcoming Sangrur Lok Sabha bypoll began on a high note in the morning at Bhadaur market, it gradually tapered of… [+4946 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Ludhiana: Draw of lots held for project named after Vajpayee", "description": "Named after the former PM Atal Bihari Vajpayee, the project was 'relaunched' by the Congress government in December last year ahead of Assembly elections and former CM Charanjit Singh Channi had laid the foundation stone, again.", "url": "https://indianexpress.com/article/cities/ludhiana/ludhiana-draw-of-lots-held-for-project-named-after-vajpayee-7974392/", "urlToImage": "https://images.indianexpress.com/2021/12/atal-bihari-vajpaee.jpg", "publishedAt": "2022-06-16T23:34:27Z", "content": "Nearly a decade after the project was conceptualised during the SAD-BJP regime in 2010-11 and thereafter faced several hiccups, the Ludhiana Improvement Trust (LIT) on Thursday held the draw the lots… [+1690 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Peter Vidal", "title": "Horoscope Today, June 17 2022: Capricorn, Leo, Libra and other signs — check astrological prediction", "description": "Leo-- You are bathed in beneficial lunar alignments, and these are bound to make you feel increasingly emotional - and more compassionate. You may also be a little gullible, and hence a soft touch for some! So, keep a weather-eye open for roving confidence tr…", "url": "https://indianexpress.com/article/horoscope/horoscope-today-june-17-2022-capricorn-leo-libra-and-other-signs-check-astrological-prediction-7970273/", "urlToImage": "https://images.indianexpress.com/2022/05/horoscope_2-1200-1-1-2-1.jpeg", "publishedAt": "2022-06-16T23:30:37Z", "content": "ARIES (Mar 21 – Apr. 20)Assertive Martian alignments should now be having an effect, and today they’re joined by emotional Lunar patterns, indicating that if you should feel like showing off or being… [+3510 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Canal breach submerges 200 acres of fields in Moga village", "description": "Village residents said that water had started entering fields Wednesday night and caused the canal’s banks, which were too weak to handle the pressure, to break.", "url": "https://indianexpress.com/article/cities/ludhiana/canal-breach-submerges-200-acres-of-fields-in-moga-village-7974386/", "urlToImage": "https://images.indianexpress.com/2022/06/mogal-canal.jpg", "publishedAt": "2022-06-16T23:30:09Z", "content": "At least 200 acres of fields were submerged in water due to a canal breach at Ugoke village of Baghapurana division in Moga district on Thursday.Village residents said that water had started entering… [+1192 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kanchan Vasdev", "title": "21% groups in Ludhiana bid for e-auction of liquor", "description": "Of 64 groups put out on e-auction, only 14 groups had responded. The excise department has now extended the last date of bidding by five more days", "url": "https://indianexpress.com/article/cities/chandigarh/21-groups-in-ludhiana-bid-for-e-auction-of-liquor-7974380/", "urlToImage": "https://images.indianexpress.com/2022/06/liquor-1-1.jpg", "publishedAt": "2022-06-16T23:29:01Z", "content": "The first excise policy of Aam Aadmi Party (AAP) government received a luke-warm response during first e-auction of liquor groups receiving bids for only 21 per cent groups in Ludhiana excise divisio… [+2467 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gangster injured inside Ludhiana Central jail", "description": "Ludhiana jail superintendent Shivraj Singh said that the injured inmate was a “B-category” gangster.", "url": "https://indianexpress.com/article/cities/ludhiana/gangster-injured-inside-ludhiana-central-jail-7974379/", "urlToImage": "https://images.indianexpress.com/2022/06/jail-4-2.jpg", "publishedAt": "2022-06-16T23:10:59Z", "content": "In yet another suspected clash inside Ludhiana Central jail, a gangster was injured on Wednesday and rushed to Civil Hospital for medical check-up. The injured inmate was identified as Manoj Kumar al… [+1014 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Moosewala murder: Probe untangles complex web of planning, suspects and their roles in singer’s killing", "description": "At least ten people — including the alleged main conspirator, Lawrence Bishnoi — have been arrested so far for the killing of Moosewala at Jawahar Ke village on the evening of May 29. The police have also identified four shooters who were involved in the crim…", "url": "https://indianexpress.com/article/cities/chandigarh/moosewala-murder-probe-untangles-complex-web-of-planning-suspects-and-their-roles-in-singers-killing-7974371/", "urlToImage": "https://images.indianexpress.com/2022/06/sidhu-moosewala-3.jpg", "publishedAt": "2022-06-16T23:10:27Z", "content": "A tiny clue in an abandoned vehicle, followed by heavy technical surveillance has helped Punjab Police piece together a probable sequence of events that led to the killing of renowned Punjabi singer … [+4824 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "Prelude to 5G", "description": "Government has eased terms of spectrum auction, but high reserve price and allocations for enterprises will pose problems", "url": "https://indianexpress.com/article/opinion/editorials/prelude-to-5g-government-has-eased-terms-of-spectrum-auction-7974177/", "urlToImage": "https://images.indianexpress.com/2022/06/edit-4.jpg", "publishedAt": "2022-06-16T23:06:09Z", "content": "On Wednesday, the Union cabinet took the first steps towards rolling out 5G services, approving the auction of spectrum. The auction, which will include spectrum across multiple frequency bands, is s… [+2310 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Honeybees attack Ludhiana siblings, 2 cops rescue them with car seat covers", "description": "Eyewitnesses said it was not clear what triggered the honeybee attack. \"We were coming to Anti- Human Traffic Unit (AHTU) office in Sector 17 when we spotted the helpless man and woman struggling to save themselves from the bee attack.", "url": "https://indianexpress.com/article/cities/chandigarh/honeybees-attack-ludhiana-siblings-2-cops-rescue-them-with-car-seat-covers-7974376/", "urlToImage": "https://images.indianexpress.com/2022/06/bee-3col.jpg", "publishedAt": "2022-06-16T23:01:02Z", "content": "Two siblings, both in their 20s, were caught unawares when they were attacked by a swarm of honeybees near Press Light Point in Sector 18, Chandigarh, Thursday.Thankfully, help was at hand in the for… [+1343 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anju Agnihotri Chaba", "title": "Punjab: New instructions for sale deeds, plots in illegal colonies", "description": "The instructions were issued by a committee formed by Punjab Chief Minister Bhagwant Mann and which includes Additional Chief Secretary cum Financial Commissioner Revenue (ACS cum FCR), principal secretary of housing and urban development and principal secret…", "url": "https://indianexpress.com/article/cities/jalandhar/punjab-new-instructions-for-sale-deeds-plots-in-illegal-colonies-7974356/", "urlToImage": "https://images.indianexpress.com/2022/06/Mann-1-2-2.jpeg", "publishedAt": "2022-06-16T22:58:51Z", "content": "After it issued a letter on May 24 to stop the sale deeds of properties in illegal colonies that have mushroomed across the state in recent years, the Punjab government issued orders on June 13 to st… [+2357 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Congress workers protest against Rahul’s ‘unending harassment’, submit memo", "description": "The slogan-shouting workers were stopped by a heavy contingent of police at Sector 34-35 traffic lights. About 100 workers of the party, including senior party functionaries, were arrested when they tried to sneak through the police barricades. They were take…", "url": "https://indianexpress.com/article/cities/chandigarh/congress-workers-protest-against-rahuls-unending-harassment-submit-memo-7974373/", "urlToImage": "https://images.indianexpress.com/2022/06/Wet-Congress-4col.jpg", "publishedAt": "2022-06-16T22:57:28Z", "content": "Several workers of Chandigarh Congress Thursday marched towards Punjab Raj Bhawan from Congress Bhawan in Sector 35-C, Chandigarh, to protest and present a memorandum addressed to the President of In… [+2979 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Empty buckets in hands, Youth Congress workers protest outside Kher house", "description": "The protesters, more than 150 in number, blocked the roads for over an hour and a half", "url": "https://indianexpress.com/article/cities/chandigarh/empty-buckets-in-hands-youth-congress-workers-protest-outside-kher-house-7974370/", "urlToImage": "https://images.indianexpress.com/2022/06/Congwithbuckets-3col.jpg", "publishedAt": "2022-06-16T22:53:38Z", "content": "The Chandigarh Youth Congress on Thursday protested outside the residence of MP Kirron Kher by carrying empty buckets.“The dissatisfaction among the people of Chandigarh is growing exponentially. Adm… [+693 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Hina Rohtaki", "title": "On MC agenda: Renovation of cattle pounds, Mahila Bhawan rules, gym rejuvenation plan", "description": "The agenda regarding this is being prepared which would be brought in the General House meeting. The House meeting is scheduled to be held later this month.", "url": "https://indianexpress.com/article/cities/chandigarh/on-mc-agenda-renovation-of-cattle-pounds-mahila-bhawan-rules-gym-rejuvenation-plan-7974367/", "urlToImage": "https://images.indianexpress.com/2022/06/Chandigarh-Municipal-Corporation.jpg", "publishedAt": "2022-06-16T22:50:20Z", "content": "The Chandigarh Municipal Corporation will be discussing the agenda of renovating all its cattle pounds in the city, governing rules of Mahila Bhawan and gyms’ rejuvenation plan.The agenda regarding t… [+4220 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Capt Amarinder suggests review, says 4-yr service too short for a soldier", "description": "“It will dilute the long existing distinct ethos of regiments”, Capt Amarinder said in a statement on Thursday, while adding, “four year service is too short for a soldier”.", "url": "https://indianexpress.com/article/cities/chandigarh/capt-amarinder-suggests-review-says-4-yr-service-too-short-for-a-soldier-7974368/", "urlToImage": "https://images.indianexpress.com/2022/01/Amarinder.jpg", "publishedAt": "2022-06-16T22:49:26Z", "content": "Former Punjab Chief Minister and a veteran of Indi-Sino and Indo-Pak Wars, Captain Amarinder Singh on Thursday suggested reviewing the Agnipath policy of recruitment in defence forces. It will dilute… [+1389 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Power supply hit in Zirakpur yet again; feeders, tubewells unable to function", "description": "Power department officials said that it will take at least 24 hours more to restore the power supply; at least a hundred residential colonies are currently facing a power outage apart from several villages on the periphery of Zirakpur", "url": "https://indianexpress.com/article/cities/sas-nagar-mohali/power-supply-hit-in-zirakpur-yet-again-feeders-tubewells-unable-to-function-7974365/", "urlToImage": "https://images.indianexpress.com/2022/06/power22-5.jpg", "publishedAt": "2022-06-16T22:39:47Z", "content": "The power supply in many areas of Zirakpur remained disrupted on Thursday as the three electricity towers were damaged on Wednesday night and could not be repaired on time.Power department officials … [+1270 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Don’t take any coercive steps till July 27: HC to Punjab", "description": "Accepting notice on behalf of the state of Punjab, the Additional Advocate General of Punjab, S P S Tinna, submitted that the challenged communication was only regarding “possession to be taken of those lands whereby there has been a decision in favour of the…", "url": "https://indianexpress.com/article/cities/sas-nagar-mohali/dont-take-any-coercive-steps-till-july-27-hc-to-punjab-7974362/", "urlToImage": "https://images.indianexpress.com/2022/06/Punjab-HC-2-1-2.jpeg", "publishedAt": "2022-06-16T22:36:01Z", "content": "Hearing a petition challenging the letter issued by Additional Deputy Commissioner (Development) of Mohali wherein the authorities of Mullanpur Garibdas at Kharar have been directed to take possessio… [+1948 chars]"}]}