{"status": "ok", "totalResults": 431, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Monsoon to remain active till July 16: IMD", "description": "According to officials at the India Meteorological Department (IMD), the prevailing rainfall deficit was not because of lack of rainfall but mainly because some areas (like Kerala and northeast) are heavy rainfall-receiving regions.", "url": "https://indianexpress.com/article/india/monsoon-to-remain-active-till-july-16-imd-8025741/", "urlToImage": "https://images.indianexpress.com/2022/07/rainfall-3.jpg", "publishedAt": "2022-07-12T22:42:16Z", "content": "A vigorous spell of Southwest Monsoon has brought bountiful rain over large parts of the country. At the same time, the ongoing spell has caused massive destruction over Gujarat, Maharashtra, Uttarak… [+1501 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Udit Misra", "title": "Why the euro has fallen to $1, what it means for the rupee", "description": "The weakening in the euro against the dollar shows that investors are pulling out money from the Eurozone and into the US.", "url": "https://indianexpress.com/article/explained/why-the-euro-has-fallen-to-1-what-it-means-for-the-rupee-8025626/", "urlToImage": "https://images.indianexpress.com/2022/07/Dollar-Explained.jpg", "publishedAt": "2022-07-12T22:40:11Z", "content": "On Tuesday, the euro achieved parity with the US dollar. In other words, in terms of the exchange rate, one euro became equal to one US dollar. This is only the second time since 2002 that the euro h… [+4139 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Parthasarathi Biswas", "title": "Mills prepare recovery reports for sugar commissioner’s office", "description": "For mills which had produced ethanol from B-heavy molasses or directly from cane juice, VSI was given the work of certifying the final recovery after taking in account the diversion of cane for other products.", "url": "https://indianexpress.com/article/cities/pune/mills-prepare-recovery-reports-for-sugar-commissioners-office-8025740/", "urlToImage": "https://images.indianexpress.com/2022/06/sugar.jpg", "publishedAt": "2022-07-12T22:37:29Z", "content": "AFTER SEVERAL reminders by the office of the state Sugar Commissioner, mills have accelerated submission of recovery reports, which is used to calculate final payment to farmers. Of the 103 mills whi… [+2228 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sushant Kulkarni", "title": "Parole granted during pandemic: Over 800 convicts jump emergency parole, prison dept starts filing cases", "description": "At the beginning of the pandemic, in April 2020, following a Supreme Court ruling on the issue of possible spread of Covid-19 inside prisons, a committee was constituted by the state government to determine the criteria for the release of inmates on interim b…", "url": "https://indianexpress.com/article/cities/pune/parole-granted-during-pandemic-over-800-convicts-jump-emergency-parole-prison-dept-starts-filing-cases-8025737/", "urlToImage": "https://images.indianexpress.com/2022/07/jail1-3.jpg", "publishedAt": "2022-07-12T22:33:49Z", "content": "The Maharashtra Prison Department has started registering offences against over 800 convicts who were released on emergency parole during the Covid-19 pandemic as part of a prison decongestion effort… [+3000 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Apurva Vishwanath", "title": "Bail law and SC call for reform", "description": "Stressing a ‘pressing need’ for reform, the Supreme Court has called on the government to consider a special legislation on bail. What are the bail provisions in the CrPC, and what reforms has the court suggested?", "url": "https://indianexpress.com/article/explained/bail-law-and-sc-call-for-reform-8025618/", "urlToImage": "https://images.indianexpress.com/2022/07/explained-5.jpg", "publishedAt": "2022-07-12T22:30:37Z", "content": "ON MONDAY, the Supreme Court underlined that there is a pressing need for reform in the law related to bail and called on the government to consider framing a special legislation on the lines of the … [+5854 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Vallabh Ozarkar", "title": "Uddhav breaks ranks with allies to pledge Shiv Sena support to NDA’s Murmu", "description": "Thackeray’s announcement came a day after his meeting with party MPs, where several MPs “requested” him to support Murmu and open the door to a possible reconciliation with the BJP and the breakaway Shinde faction.", "url": "https://indianexpress.com/article/cities/mumbai/uddhav-breaks-ranks-with-allies-to-pledge-shiv-sena-support-to-ndas-murmu-8025610/", "urlToImage": "https://images.indianexpress.com/2022/07/uddav.jpg", "publishedAt": "2022-07-12T22:30:26Z", "content": "Two WEEKS after the MVA government led by him was pulled down by the BJP and Shiv Sena rebel leader Eknath Shinde, Shiv Sena chief and former chief minister Uddhav Thackeray said on Tuesday that his … [+4534 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Omkar Gokhale", "title": "HC calls for need for water supply to Aurangabad residents, seeks govt action", "description": "It said that residents of Aurangabad city, which is surrounded by places of tourist attraction such as the historic Ajanta, Ellora and Shirdi Saibaba temple, should not be made to wait longer to avail their daily share of potable water and efforts be made to …", "url": "https://indianexpress.com/article/cities/mumbai/hc-calls-for-need-for-water-supply-to-aurangabad-residents-seeks-govt-action-8025735/", "urlToImage": "https://images.indianexpress.com/2022/07/bombay-high-court-1200-1-3.jpg", "publishedAt": "2022-07-12T22:25:00Z", "content": "Expressing shock over lack of potable water for residents of Aurangabad city, who have been shabbily treated by authorities, the Bombay High Court recently directed the concerned Central and state go… [+1243 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "First, price stability", "description": "Inflation is likely to remain elevated, even as commodity prices soften. RBI must continue to prioritise inflation management.", "url": "https://indianexpress.com/article/opinion/editorials/first-price-stability-8025557/", "urlToImage": "https://images.indianexpress.com/2022/07/Express-Views.jpeg", "publishedAt": "2022-07-12T22:21:40Z", "content": "In line with expectations, retail inflation, as measured by the consumer price index, dipped marginally to 7.01 per cent in June, down from 7.04 per cent the month before, as per data from the Nation… [+2542 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sagar Rajput", "title": "Four persons booked for duping realtor of Rs 26L", "description": "The complainant, identified as Pravin Wagh, alleged that the four persons — Ashok Gavand, Tejas Patel, Disha Soras and Mantu Prasad — duped him after gaining his confidence.", "url": "https://indianexpress.com/article/cities/mumbai/four-persons-booked-for-duping-realtor-of-rs-26l-8025728/", "urlToImage": "https://images.indianexpress.com/2022/07/arrest-2-7-5-3.jpeg", "publishedAt": "2022-07-12T22:20:23Z", "content": "Four persons have been booked by Parksite police for allegedly duping a 46-year-old realtor of Rs 26 lakhs under the pretext of facilitating a work tender of Mumbai airports parking lot. The police s… [+958 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Simarjeet Bains now booked for failing to appear in court", "description": "The fresh case against the ex-MLA has been registered under Section 174-A (non-appearance in response to a proclamation) of IPC at Sarabha Nagar police station on the orders of Chief Judicial Magistrate, Sumit Makkar.", "url": "https://indianexpress.com/article/cities/chandigarh/simarjeet-bains-now-booked-for-failing-to-appear-in-court-8025732/", "urlToImage": "https://images.indianexpress.com/2022/07/bains-1200.jpg", "publishedAt": "2022-07-12T22:20:06Z", "content": "The Ludhiana police have registered another FIR against Lok Insaaf Party (LIP) chief and former MLA, Simarjeet Singh Bains, for failing to appear in court for hearing in the case related to “sting op… [+1253 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Cleaning Buddha Nullah our top priority, says Meet Hayer", "description": "Rajya Sabha MP and Balbir Singh Seechewal also emphasised on the completion of ongoing works under rejuvenation project to ensure cleaning of Budha Dariya.", "url": "https://indianexpress.com/article/cities/chandigarh/cleaning-buddha-nullah-our-top-priority-says-meet-hayer-8025730/", "urlToImage": "https://images.indianexpress.com/2022/07/chd.jpg", "publishedAt": "2022-07-12T22:17:16Z", "content": "Punjab science, technology and environment minister Gurmeet Singh Meet Hayer on Tuesday inspected the ongoing Budha Dariya rejuvenation project and directed the officials of municipal corporation, se… [+927 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mann launches new RC service, Badal says was started in 2011", "description": "He added that apart from facilitating the common man by saving their time, money and energy, it will also help in providing clean, transparent, effective and corruption-free administration to people.", "url": "https://indianexpress.com/article/cities/chandigarh/mann-launches-new-rc-service-badal-says-was-started-in-2011/", "urlToImage": "https://images.indianexpress.com/2022/07/Mann-3.jpg", "publishedAt": "2022-07-12T22:14:23Z", "content": "Punjab Chief Minister Bhagwant Mann on Tuesday announced to launch a new citizen centric service of e-Registration Certificates (e-RCs) of new vehicles through automobile dealers in the state. Mann s… [+1807 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Raakhi Jagga", "title": "AAP firm: Even Cong, BJP have high command in Delhi, why question us", "description": "\"It's an advisory body, temporary body. And, the biggest thing about it is that there is no provision for paying even a single rupee (to the chairman and members of the panel),\" AAP chief spokesperson Saurabh Bharadwaj said.", "url": "https://indianexpress.com/article/cities/ludhiana/aap-firm-even-cong-bjp-have-high-command-in-delhi-why-question-us-8025726/", "urlToImage": "https://images.indianexpress.com/2022/07/bhagwant-mann-9-3-1.jpg", "publishedAt": "2022-07-12T22:10:55Z", "content": "Amid accusation that Chief Minister Bhagwant Mann was running a subservient government directly under the control of the AAP’s top leadership in Delhi, the ruling party Tuesday defended the move to a… [+2443 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Harikishan Sharma", "title": "Pradhan Mantri Fasal Bima Yojana: Andhra rejoins, efforts on to woo 5 other states", "description": "On Tuesday, the Agriculture Ministry announced that Andhra Pradesh has decided to “rejoin” the PMFBY following talks between Union Agriculture Minister Narendra Singh Tomar and Chief Minister Y S Jagan Mohan Reddy.", "url": "https://indianexpress.com/article/india/pradhan-mantri-fasal-bima-yojana-andhra-rejoins-efforts-on-to-woo-5-other-states-8025725/", "urlToImage": "https://images.indianexpress.com/2022/07/ys-reddy.jpg", "publishedAt": "2022-07-12T22:09:16Z", "content": "With Andhra Pradesh deciding to rejoin the Pradhan Mantri Fasal Bima Yojana (PMFBY) from the ongoing kharif season, the Centre is reaching out to the five other statesBihar, Jharkhand, Gujarat, Telan… [+3048 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Lawyer challenges Chadha’s appointment: ‘illegal, arbitrary, done at Kejriwal instance’", "description": "Bhatti, in his petition, contended that the appointment of Chadha, a Rajya Sabha member and an “outsider not being a part of the state legislative assembly”, in the minister rank was in violation of the Constitution.", "url": "https://indianexpress.com/article/cities/chandigarh/lawyer-challenges-chadhas-appointment-illegal-arbitrary-done-at-kejriwal-instance-8025724/", "urlToImage": "https://images.indianexpress.com/2022/01/raghav-chadha.jpg", "publishedAt": "2022-07-12T22:05:39Z", "content": "Less than 24 hours after Punjab government appointed Aam Aadmi Party leader and Rajya Sabha member Raghav Chadha as the chairman of a temporary advisory panel, a lawyer filed a public interest litiga… [+3503 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "PGI gets advanced liver transplant centre", "description": "The advanced endoscopy unit has its own anesthesia workstation and can provide conscious and deep sedation to patients for complex procedures. There is a five-bed recovery unit for patients xoming out of the effects of anesthesia.", "url": "https://indianexpress.com/article/cities/chandigarh/pgi-gets-advanced-liver-transplant-centre-8025722/", "urlToImage": "https://images.indianexpress.com/2022/06/pgimer1-1200.jpg", "publishedAt": "2022-07-12T22:01:30Z", "content": "A state-of-the-art Advanced Hepatopancreatobiliary and Transplant Centre was inaugurated in the department of Hepatology, PGI, on Tuesday by Professor Jagat Ram, former director of the insititute.The… [+2642 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "HC proposes Rs 10L ex gratia for kin of kids mauled by dogs", "description": "The court was hearing the petition filed by Mohammad Shabab, whose children Jannat Fatima (5) and son Mohammad Raza (7) were mauled by stray dogs on April 6. While Raza succumbed, Fatima was seriously injured.", "url": "https://indianexpress.com/article/cities/lucknow/hc-proposes-rs-10l-ex-gratia-for-kin-of-kids-mauled-by-dogs-8025718/", "urlToImage": "https://images.indianexpress.com/2022/07/allahabad-HC-2-1.jpg", "publishedAt": "2022-07-12T22:00:10Z", "content": "The Allahabad High Court has proposed a compensation of Rs 10 lakh while hearing a petition filed by the father of a child who was killed by stray dogs in Lucknows Thakurganj area earlier in April th… [+878 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "MC launches Swachhta ki Paathshala campaign in city schools", "description": "Mitra said students from classes 6-12 from all schools of Chandigarh, including private schools, will be addressed during the morning assembly about the campaign. This way the MC will be able to reach out to more households in Chandigarh, she added.", "url": "https://indianexpress.com/article/cities/chandigarh/mc-launches-swachhta-ki-paathshala-campaign-in-city-schools-8025719/", "urlToImage": "https://images.indianexpress.com/2022/01/Chandigarh-schoolsjpg-1.jpg", "publishedAt": "2022-07-12T21:57:58Z", "content": "As part of the Swachh Chandigarh Mission, the Municipal Corporation (MC), launched Swachhata ki Paathshala awareness campaign in the schools of the city here on Tuesday.Municipal Corporation Commissi… [+1564 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Concerns of Indian players should be taken care of while crafting FTAs", "description": "A well-crafted trade agreement could help India enhance its share in global trade and help attain the government's target of making the country a $5-trillion economy.", "url": "https://indianexpress.com/article/opinion/columns/concerns-of-indian-players-should-be-taken-care-of-while-crafting-ftas-8025545/", "urlToImage": "https://images.indianexpress.com/2020/01/export-1200.jpg", "publishedAt": "2022-07-12T21:57:47Z", "content": "In recent months, India has signed trade agreements with Australia and the UAE. In the last week of June, New Delhi began talks for a similar agreement with the EU. These talks could have a bearing o… [+3827 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Expedite projects under Master Plan: UT Adviser", "description": "The secretaries of all the concerned departments, commissioner of Municipal Corporation, estate officer, CEO CHB, chief architect and other officers from various departments were present.", "url": "https://indianexpress.com/article/cities/chandigarh/expedite-projects-under-master-plan-ut-adviser/", "urlToImage": "https://images.indianexpress.com/2022/05/Dharam-Pal-2.jpg", "publishedAt": "2022-07-12T21:50:26Z", "content": "A meeting was held under the chairmanship of UT Adviser Dharam Pal on Tuesday, seeking updates on the implementation of various projects envisaged in the Master Plan 2031.Projects related to commerci… [+852 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gujarat rain kills 6 in past 24 hours: Man swept away in Rajkot, 2 missing in Navsari", "description": "A 50-year-old man died after being swept off by floodwaters on a road and four children were injured after a wall collapsed as heavy rain pounded Rajkot city and adjoining Morbi district.", "url": "https://indianexpress.com/article/cities/ahmedabad/gujarat-rain-kills-6-in-past-24-hours-man-swept-away-in-rajkot-2-missing-in-navsari-8025712/", "urlToImage": "https://images.indianexpress.com/2022/07/rainfall-2.jpg", "publishedAt": "2022-07-12T21:49:06Z", "content": "Six people died in rain-related incidents as downpour continued in several districts in Gujarat in 24 hours, while over 18,000 people were evacuated from the affected areas, officials said. The death… [+1561 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "CBI nabs junior engineer for taking Rs 8,000 as bribe", "description": "A CBI sleuth said that subsequent searches at the Chandigarh and Yamunanangar residences of the Junior Engineer later led to the recovery of a further Rs 2 lakh.", "url": "https://indianexpress.com/article/cities/chandigarh/cbi-nabs-junior-engineer-for-taking-rs-8000-as-bribe/", "urlToImage": "https://images.indianexpress.com/2022/07/CBI-2-3.jpg", "publishedAt": "2022-07-12T21:47:34Z", "content": "THE CENTRAL Bureau of Investigation on Monday night arrested a Junior Engineer, working with the electrical department of the UT Administration, for allegedly demanding and accepting a bribe of Rs 8,… [+1035 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sushant Nepta", "title": "Firing at Panchkula cafe: Police arrest main accused", "description": "Earlier, the police filed an FIR at the Sector 5 police station on the statement of an injured bouncer, Naresh Sharma, against the accused under Sections 323 and 307 of the IPC and Sections 24, 54 and 59 of the Arms Act.", "url": "https://indianexpress.com/article/cities/chandigarh/firing-at-panchkula-cafe-police-arrest-main-accused-8025713/", "urlToImage": "https://images.indianexpress.com/2022/07/Indian-Express-6.jpeg", "publishedAt": "2022-07-12T21:45:45Z", "content": "CRIME BRANCH, Sector 19, arrested the prime accused in Coco Cafe and Lounge, Sector 11, Panchkula, firing incident from Peohwa in Kurushetra on Monday night. The accused has been identified as Mohit … [+1385 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Jagdeep Singh Deep", "title": "Waterlogging: Admin to revive old pond, clear encroachments", "description": "Water entered hundreds of houses in Desu Majra village and nearby areas on Sunday after heavy rains. The residents alleged that despite repeated requests, the administration failed to solve the issue of waterlogging in the area.", "url": "https://indianexpress.com/article/cities/chandigarh/waterlogging-admin-to-revive-old-pond-clear-encroachments-8025708/", "urlToImage": "https://images.indianexpress.com/2022/07/hhh-3.jpg", "publishedAt": "2022-07-12T21:42:42Z", "content": "Two days after hundreds of residents blocked traffic at Kharar flyover over waterlogging in their houses and streets, the local administration decided to revive a pond and also drain out the water to… [+1311 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Divya A", "title": "National Emblem Row: Dimensions, angle of view, make emblem look different says sculptor", "description": "The National Emblem is an adaptation of ‘Lion Capital’ atop the Ashoka Column at Sarnath. It has four Asiatic lions, depicting power, courage, pride and confidence, seated on a circular base.", "url": "https://indianexpress.com/article/india/national-emblem-row-dimensions-angle-of-view-make-emblem-look-different-says-sculptor-8025706/", "urlToImage": "https://images.indianexpress.com/2022/07/nodal-sculptor-2col.jpg", "publishedAt": "2022-07-12T21:42:20Z", "content": "Amid the row over the alleged distortions in the sculpture of national emblem that has been placed on the new Parliament building, one of the two artists who was commissioned the task to sculpt the S… [+1519 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "Of ships and rats", "description": "British Leader of Opposition had a great quip about the fall of Boris Johnson. But a lot was left unsaid.", "url": "https://indianexpress.com/article/opinion/editorials/of-ships-and-rats-8025568/", "urlToImage": "https://images.indianexpress.com/2022/07/Express-Views.jpeg", "publishedAt": "2022-07-12T21:36:33Z", "content": "In history, fiction and historical fiction, great leaders have risen to the pulpit and the occasion. Mark Antony, in Shakespeare’s Julius Caesar, asks friends, Romans and countrymen, What cause withh… [+1806 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "Chandigarh tightrope", "description": "AAP government in Punjab is accused of remote control by Delhi. New advisory panel seems to confirm fears.", "url": "https://indianexpress.com/article/opinion/editorials/chandigarh-tightrope-8025565/", "urlToImage": "https://images.indianexpress.com/2022/07/Express-View-4-1.jpg", "publishedAt": "2022-07-12T21:32:15Z", "content": "The Bhagwant Singh Mann governments move to appoint Rajya Sabha MP Raghav Chadha, until recently a legislator from a Delhi seat, as head of a temporary advisory panel, appears to give credence to the… [+2336 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Goyal inaugurates NIFT Panchkula, calls it ‘fulcrum of development of textile sector’", "description": "“This will be the fulcrum of development of the entire textile sector,” Goyal said, adding that the campus will help create a complete ecosystem of textiles in Haryana.", "url": "https://indianexpress.com/article/cities/chandigarh/goyal-inaugurates-nift-panchkula-calls-it-fulcrum-of-development-of-textile-sector-8025703/", "urlToImage": "https://images.indianexpress.com/2022/07/Piyush-Goyal.jpg", "publishedAt": "2022-07-12T21:31:55Z", "content": "Union Minister Piyush Goyal, in presence of Chief Minister Manohar Lal Khattar, Tuesday inaugurated the 17th campus of the National Institute of Fashion Technology in Panchkula and expressed hope tha… [+2667 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Hina Rohtaki", "title": "‘Holes or spots on leaves of a tree can tell if it is diseased or not’", "description": "Singh, who retired as an executive engineer of the Horticulture Department of the UT Administration, told The Indian Express, \"Sometimes the drying of leaves or shedding is considered as a natural phenomenon.", "url": "https://indianexpress.com/article/cities/chandigarh/holes-or-spots-on-leaves-of-a-tree-can-tell-if-it-is-diseased-or-not-8025702/", "urlToImage": "https://images.indianexpress.com/2022/07/tree.jpg", "publishedAt": "2022-07-12T21:26:22Z", "content": "Four days after a 250-year-old heritage tree collapsed inside the premises of Carmel Convent School in Sector 9, killing a 16-year-old and injuring several others, a Chandigarh-based tree expert expl… [+3411 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Hina Rohtaki", "title": "UT Admin appoints second panel to probe Carmel tragedy", "description": "On Friday, a 16-year-old Heerakshi, a Class 10 student at Carmel Convent School, Chandigarh, was crushed to death as the a part of the 250-year-old heritage peepal tree collapsed on her. A total of 18 of her school mates were injured, with another student, lo…", "url": "https://indianexpress.com/article/cities/chandigarh/ut-admin-appoints-second-panel-to-probe-carmel-tragedy-8025699/", "urlToImage": "https://images.indianexpress.com/2022/07/pu.jpg", "publishedAt": "2022-07-12T21:22:47Z", "content": "THe Chandigarh Administration, in the face of growing criticism, on Tuesday appointed Justice (retired) Jitendra Chauhan as a one-man committee to investigate the Carmel Convent tree collapse tragedy… [+1844 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "NRHM Scam: Ex-UP DGP, 6 officials summoned by court for death of Dy CMO", "description": "Dr YS Sachan's body was found under mysterious circumstances on June 22, 2011, in a toilet of Lucknow district jail where he was lodged in a case related to the National Rural Health Mission (NRHM) scam.", "url": "https://indianexpress.com/article/cities/lucknow/nrhm-scam-ex-up-dgp-6-officials-summoned-by-court-for-death-of-dy-cmo-8025698/", "urlToImage": "https://images.indianexpress.com/2022/07/nrhm-logo-1-new.jpg", "publishedAt": "2022-07-12T21:20:45Z", "content": "Terming the death of UP deputy chief medical officer Dr YS Sachan inside a Lucknow jail in 2011 as prima facie murder, a special CBI court here has issued summons against seven persons, including for… [+1552 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Divya Goyal Gopal", "title": "For teachers seeking leave to go abroad, a rule: ‘book tickets only if nod granted’", "description": "The order comes almost a month after another such order on ex-India said that many teachers were applying for long leave to fly abroad \"after summer vacations\" which if approved, would lead to loss of studies for students in government schools.", "url": "https://indianexpress.com/article/cities/chandigarh/for-teachers-seeking-leave-to-go-abroad-a-rule-book-tickets-only-if-nod-granted-8025669/", "urlToImage": "https://images.indianexpress.com/2022/07/teachers.jpg", "publishedAt": "2022-07-12T21:17:00Z", "content": "With several of its teachers flying abroad on leave, and some not returning even after their sanctioned leave period got over, the Punjab government Tuesday made it clear that educationists must book… [+4586 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Divya Goyal", "title": "For teachers seeking leave to go abroad, a rule: ‘book tickets only if nod granted’", "description": "The order comes almost a month after another such order on ex-India said that many teachers were applying for long leave to fly abroad \"after summer vacations\" which if approved, would lead to loss of studies for students in government schools.", "url": "https://indianexpress.com/article/education/for-teachers-seeking-leave-to-go-abroad-a-rule-book-tickets-only-if-nod-granted-8025669/", "urlToImage": "https://images.indianexpress.com/2022/07/teachers.jpg", "publishedAt": "2022-07-12T21:17:00Z", "content": "With several of its teachers flying abroad on leave, and some not returning even after their sanctioned leave period got over, the Punjab government Tuesday made it clear that educationists must book… [+4586 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi Confidential: Flying Out", "description": "Incidentally, the party has convened a meeting of general secretaries, in-charges, PCC presidents and heads of frontal organisations on Thursday on the Bharat Jodo Yatra in October, which Rahul is expected to lead.", "url": "https://indianexpress.com/article/delhi-confidential/delhi-confidential-flying-out-8025695/", "urlToImage": "https://images.indianexpress.com/2022/07/Rahul-gandhi.jpg", "publishedAt": "2022-07-12T21:06:14Z", "content": "NEARLY THREE weeks ago, when AICC general secretary Priyanka Gandhi Vadra landed at Mumbai airport amid the political turmoil in Maharashtra, Congress communication in charge Jairam Ramesh promptly p… [+830 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Abhinav Rajput", "title": "Eating out could cost more as dhaba, restaurant licences are set to increase", "description": "The erstwhile North and East corporations had kept their rates lower as opposed to the South MCD, and the parity is now being brought in keeping the South rates as the standard, said a senior MCD official.", "url": "https://indianexpress.com/article/cities/delhi/eating-out-could-cost-more-as-dhaba-restaurant-licences-are-set-to-increase-8025687/", "urlToImage": "https://images.indianexpress.com/2022/07/dhaba.jpg", "publishedAt": "2022-07-12T20:58:51Z", "content": "Eating out in restaurants, coffee houses, hotels, food courts and five-star hotels is set to get costlier in several areas in the capital as the corporation has increased health trade licence fees in… [+1689 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Abhishek Angad", "title": "In Jharkhand, Modi says: Shortcut politics leads to short circuit", "description": "Apparently taking on the Congress, without naming it, Modi said parties in power since Independence indulged in “shortcut politics”, leading to a lack of growth when compared to other countries that gained freedom around the same time.", "url": "https://indianexpress.com/article/india/in-jharkhand-modi-says-shortcut-politics-leads-to-short-circuit-8025640/", "urlToImage": "https://images.indianexpress.com/2022/07/modi-7.jpg", "publishedAt": "2022-07-12T20:54:01Z", "content": "Stating that shortcut politics will ruin the country, Prime Minister Narendra Modi on Tuesday asked people to stay away from such ideologies, as they can lead a nation towards short circuit.Apparentl… [+2544 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi Police prepares for kanwar yatra in city", "description": "A senior official said 338 kanwariya camps have been set up, including 172 government-approved ones, 157 private, and nine security camps.", "url": "https://indianexpress.com/article/cities/delhi/delhi-police-prepares-for-kanwar-yatra-in-city-8025683/", "urlToImage": "https://images.indianexpress.com/2022/07/Delhi-Police-4.jpg", "publishedAt": "2022-07-12T20:46:58Z", "content": "With the Kanwar Yatra beginning on July 14 and a new Delhi Police pilgrim registration system in place, police across the city have been making preparations for the event.The Delhi Traffic Police has… [+1809 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Club cashier mowed down while heading home, body was on roadside for half an hour", "description": "Police said that prima facie, it appears the victim, Ranjan Kumar, was flung into the air after being hit by the vehicle, and his body was found on the footpath. No arrest has been made so far though one person has been detained.", "url": "https://indianexpress.com/article/cities/delhi/club-cashier-mowed-down-while-heading-home-body-was-on-roadside-for-half-an-hour-8025681/", "urlToImage": "https://images.indianexpress.com/2022/07/club-owner.jpg", "publishedAt": "2022-07-12T20:40:15Z", "content": "A 46-year-old man who worked as a cashier at a club in East of Kailash was hit by a vehicle in the early hours of Sunday and left by the side of the road, bleeding, until a food delivery staffer noti… [+2240 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "With free preparatory classes, Delhi govt schools to help ready students for CUET", "description": "Manish Sisodia said Delhi government schools in the Southeast district conducted 20 days of CUET preparatory classes for nearly 5,000 students, which was “an important step towards taking these students closer to their dream colleges”.", "url": "https://indianexpress.com/article/cities/delhi/with-free-preparatory-classes-delhi-govt-schools-to-help-ready-students-for-cuet-8025679/", "urlToImage": "https://images.indianexpress.com/2022/07/Manish-Sisodia-3.jpg", "publishedAt": "2022-07-12T20:34:59Z", "content": "Delhi government schools are helping students prepare for the Common University Entrance Test (CUET) by conducting free preparatory classes for aspirants.Deputy Chief Minister Manish Sisodia, who int… [+2643 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Gayathri Mani", "title": "Capital ready to get first-ever 3 coach train network", "description": "Earlier, to cut costs, the Metro had planned to build a metrolite corridor under Phase IV project to connect Northwest Delhi with the outskirts of the national capital.", "url": "https://indianexpress.com/article/cities/delhi/capital-ready-to-get-first-ever-3-coach-train-network-8025670/", "urlToImage": "https://images.indianexpress.com/2022/07/DMRC-1.jpg", "publishedAt": "2022-07-12T20:20:27Z", "content": "In a first, the Delhi Metro Rail Corporation (DMRC) has planned to start a three-car Metro train service from Narela to Rithala section, said Metro chief Vikas Kumar, adding that recommendations have… [+919 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Gayathri Mani", "title": "For Delhi Metro, feeder buses out, e-autos in", "description": "According to a Delhi transport official, the Delhi government will ply these feeder buses on connecting routes under their route rationalisation program where buses are infrequent.", "url": "https://indianexpress.com/article/cities/delhi/for-delhi-metro-feeder-buses-out-e-autos-in-8025665/", "urlToImage": "https://images.indianexpress.com/2022/07/e-auto.jpg", "publishedAt": "2022-07-12T20:15:12Z", "content": "After staring at recurrent losses in the feeder bus service, the Delhi Metro Rail Corporation (DMRC) has decided to phase out the service and switch to electric autos to provide last-mile connectivit… [+2488 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mumbai Police nixes two orders by former commissioner Pandey", "description": "Pandey sent out a revised order on June 17 directing police officers to immediately register an FIR for molestation or crimes under POCSO Act in cases where they do not suspect any foul play.", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-police-nixes-two-orders-by-former-commissioner-pandey-8025663/", "urlToImage": "https://images.indianexpress.com/2022/07/Sanjay-Pandey-1-1.jpg", "publishedAt": "2022-07-12T20:08:44Z", "content": "The Mumbai Police on Tuesday issued a fresh circular cancelling the two orders issued last month by then Mumbai Police Commissioner Sanjay Pandey. The two orders, that currently stand cancelled, pert… [+1514 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "5 held in Prayagraj for poster critical of PM", "description": "“The poster contained objectionable comments against the Prime Minister, and it was put up on a hoarding without obtaining permission from Prayagraj Municipal Corporation,” the police said.", "url": "https://indianexpress.com/article/cities/lucknow/5-held-in-prayagraj-for-poster-critical-of-pm-8025659/", "urlToImage": "https://images.indianexpress.com/2022/07/ARREST-1-5-2.jpg", "publishedAt": "2022-07-12T20:03:55Z", "content": "Five persons, including a printing press owner and an event organiser, were arrested in Prayagraj on Tuesday for allegedly printing and putting up a poster featuring a cartoon of Prime Minister Naren… [+1756 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Yogesh Naik", "title": "Car depots on Metro routes: CM to hold meet with MMRDA", "description": "The car depot for Metro 2B, connecting Versova to Mandale, is proposed to come up at Mandale and nearly 40 per cent of the work is complete.", "url": "https://indianexpress.com/article/cities/mumbai/car-depots-on-metro-routes-cm-to-hold-meet-with-mmrda-8025656/", "urlToImage": "https://images.indianexpress.com/2022/07/shinde12-1.jpg", "publishedAt": "2022-07-12T20:01:27Z", "content": "Chief Minister Eknath Shinde will soon convene a meeting of senior Mumbai Metropolitan Region Development Authority (MMRDA) officials to find a solution to the issue of several metro routes having no… [+1615 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Amarnath Yatra resumes on both routes after 3 days", "description": "On Tuesday, a fresh batch of pilgrims left the Baltal base camp for the cave shrine up in the Himalayas.", "url": "https://indianexpress.com/article/cities/srinagar/amarnath-yatra-resumes-on-both-routes-after-3-days-8025657/", "urlToImage": "https://images.indianexpress.com/2022/07/amarnath-5.jpg", "publishedAt": "2022-07-12T19:58:46Z", "content": "AFTER REMAINING suspended for three days, the Amarnath pilgrimage resumed on both the traditional routes on Tuesday after the Army constructed a new track on the Baltal-cave axis. The old track was w… [+1397 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Previous govts conspired to abolish PAC: CM", "description": "Yogi Adityanath says attempt was made to breach state’s security and stop talented youngsters from joining Police force.", "url": "https://indianexpress.com/article/cities/lucknow/previous-govts-conspired-to-abolish-pac-cm-8025654/", "urlToImage": "https://images.indianexpress.com/2022/07/July12-Yogi-4col.jpg", "publishedAt": "2022-07-12T19:56:55Z", "content": "Without naming anyone, Uttar Pradesh Chief Minister Yogi Adityanath on Tuesday alleged that previous governments in the state conspired to abolish Provincial Armed Constabulary (PAC) by doing away wi… [+2400 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Karnataka asked to increase Almatti dam water discharge", "description": "Incessant rain in Sangli, Satara and Kolhapur has led to rise in water levels in Krishna river basin and Koyna catchment areas.", "url": "https://indianexpress.com/article/cities/mumbai/karnataka-asked-to-increase-almatti-dam-water-discharge-8025646/", "urlToImage": "https://images.indianexpress.com/2022/07/maha-rain-1.jpg", "publishedAt": "2022-07-12T19:50:15Z", "content": "The state government has urged Karnataka to monitor and increase water discharge from Almatti dam to avert floods in Sangli, Satara and Kolhapur districts in Western Maharashtra.Incessant rain in San… [+1136 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Man convicted of stabbing live-in partner released on her request", "description": "The couple had a three-month-old son and was planning to get married when on November 10, 2020, they had a quarrel following which Chandakumari left home with the child. She started staying with her maternal uncle in the same village.", "url": "https://indianexpress.com/article/cities/surat/man-convicted-of-stabbing-live-in-partner-released-on-her-request-8025645/", "urlToImage": "https://images.indianexpress.com/2022/07/jail1-2.jpg", "publishedAt": "2022-07-12T19:47:33Z", "content": "A 24-year-old man convicted of stabbing his live-in partner was released by the Principal District and Sessions Court of the Union Territory of Daman on an appeal by the woman that she wanted to marr… [+1536 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pallavi Smart", "title": "Not Savarkar, student bodies pick another name for hostel", "description": "According to students, if the hostel has to be named after a personality, it should be someone who has worked for students, irrespective of their caste and community, and has promoted teachings of equality. Both students’ organisations have underlined that th…", "url": "https://indianexpress.com/article/cities/mumbai/not-savarkar-student-bodies-pick-another-name-for-hostel-8025641/", "urlToImage": "https://images.indianexpress.com/2022/06/Mumbai-University-1.jpg", "publishedAt": "2022-07-12T19:46:58Z", "content": "A FRESH drama is brewing in Mumbai University over the name of the new International Students hostel in its Kalina campus with some students organisations demanding it be named after Chhatrapati Raja… [+2474 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Red alert in Palghar, Raigad; rain breaches Mumbai’s July average", "description": "With the heavy rain spell in the first 12 days of the month, the city has crossed its average July rainfall of 855.7 mm.", "url": "https://indianexpress.com/article/cities/mumbai/red-alert-in-palghar-raigad-rain-breaches-mumbais-july-average-8025642/", "urlToImage": "https://images.indianexpress.com/2022/07/mumbai2-1.jpg", "publishedAt": "2022-07-12T19:44:22Z", "content": "Rainfall caused waterlogging and traffic jams in Mumbai on Tuesday even as extremely heavy rainfall is predicted for Palghar and Raighad till Thursday.With overnight heavy rainfall, several low-lying… [+2834 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "AM/NS India to invest Rs 273 crore for green projects at Hazira plant", "description": "The Zero Liquid Discharge system will cover the entire Hazira plant and help AM/NS India in eliminating liquid waste by enabling reuse of the entire treated effluent with RO units. It is being set up for Rs 77 crore.", "url": "https://indianexpress.com/article/cities/ahmedabad/am-ns-india-to-invest-rs-273-crore-for-green-projects-at-hazira-plant-8025635/", "urlToImage": "https://images.indianexpress.com/2022/07/ArcelorMittal-Bloomberg-1200.jpg", "publishedAt": "2022-07-12T19:43:18Z", "content": "Arcelor Mittal Nippon Steel India (AM/NS India), a joint venture of Arcelor Mittal and Nippon Steel, is in the process of investing Rs 273 crore for zero liquid discharge and other environmental init… [+1852 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Exciting to get seam and swing in white-ball cricket: Jasprit Bumrah after 6/19", "description": "Jasprit Bumrah's devastating spell set up India's massive 10-wicket win at The Oval.", "url": "https://indianexpress.com/article/sports/cricket/jasprit-bumrah-exciting-to-get-seam-and-swing-in-white-ball-cricket-8025619/", "urlToImage": "https://images.indianexpress.com/2022/07/jasprit-bumrah-3.jpg", "publishedAt": "2022-07-12T19:42:24Z", "content": "India fast bowler Jasprit Bumrah revealed that the swing on offer at the Oval cricket ground made his job easier and exciting at the same time as he returned with career-best figures of 6/19 in the f… [+2061 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sanjana Bhalerao, Yogesh Naik", "title": "Maharashtra: At least six dead, 95 evacuated in last 24 hours", "description": "Two persons were killed after a structure collapsed in a Mumbai suburb while one person drowned in the Gadchiroli district in east Maharashtra.", "url": "https://indianexpress.com/article/cities/mumbai/maharashtra-at-least-six-dead-95-evacuated-in-last-24-hours-8025634/", "urlToImage": "https://images.indianexpress.com/2022/07/mumbai-rains-3.jpg", "publishedAt": "2022-07-12T19:38:37Z", "content": "AT LEAST SIX persons died in rain-related incidents over the past 24 hours and 95 people were evacuated as heavy rain battered Gadchiroli, Nandurbar, Nashik and Palghar districts of Maharashtra. Most… [+2761 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Peter Vidal", "title": "Horoscope Today, July 13, 2022: Gemini, Aries, Pisces and other signs — check astrological prediction", "description": "Pisces - No-one can accuse you of being a dispassionate observer.", "url": "https://indianexpress.com/article/horoscope/horoscope-today-july-13-2022-gemini-aries-pisces-and-other-signs-check-astrological-prediction-8006582/", "urlToImage": "https://images.indianexpress.com/2022/07/horoscope_3-1.jpg", "publishedAt": "2022-07-12T19:30:07Z", "content": "Your attitudes and opinions have to alter. Probably what’s needed now is a period of self-questioning. Even a momentary lapse of confidence over the next month or so could prove useful if it saves yo… [+3365 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Santosh Singh", "title": "In Bihar, PM stresses cooperation, coexistence, listening to public view", "description": "Speaking at the concluding function of the foundation of Bihar Assembly building, Modi said the NDA government at the Centre has so far changed or amended about 1,500 archaic laws.", "url": "https://indianexpress.com/article/cities/patna/bihar-pm-cooperation-coexistence-listening-to-public-view-8025628/", "urlToImage": "https://images.indianexpress.com/2022/07/Modi-Bihar-2.jpg", "publishedAt": "2022-07-12T19:26:56Z", "content": "Prime Minister Narendra Modi on Tuesday said he believes in “cooperation and coexistence”, and that one should move forward taking along the people and “listen to their views.Speaking at the concludi… [+2534 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Udaipur killing: NIA searches premises of accused", "description": "The case pertains to the murder of a tailor, Kanhaiyalal Teli, on June 28 for allegedly sharing remarks made by BJP's Nupur Sharma on the Prophet.", "url": "https://indianexpress.com/article/india/udaipur-killing-nia-searches-premises-of-accused-8025624/", "urlToImage": "https://images.indianexpress.com/2022/07/udaipur-killing-1.jpg", "publishedAt": "2022-07-12T19:15:01Z", "content": "THE NATIONAL Investigation Agency (NIA) on Tuesday conducted searches at the premises of those accused in the Udaipur killing case.During the searches conducted today at the premises of accused and s… [+860 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "DRI seizes 4.2 mega tonnes of red sanders in Sanand; one held", "description": "According to DRI Ahmedabad zone officials, a raid was conducted at two godowns in Sanand in pursuit of red sanders after which officials found the expensive wood concealed beneath cattle feed bags.", "url": "https://indianexpress.com/article/cities/ahmedabad/dri-seizes-4-2-mega-tonnes-of-red-sanders-in-sanand-one-held-8025622/", "urlToImage": "https://images.indianexpress.com/2022/07/Indian-Express-6.jpeg", "publishedAt": "2022-07-12T19:13:31Z", "content": "The Directorate of Revenue Intelligence (DRI) Monday seized 4.229 mega tonnes of red sanders, estimated to be worth Rs 3.4 crore, from a godown in Sanand on the Ahmedabad outskirts and arrested one p… [+1071 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "2 aides of gangster Manna held with weapons, opium", "description": "Soni added that preliminary investigation revealed both the accused are gang members of the Gurdeep Singh Manna gang, who has 38 criminal cases registered against him.", "url": "https://indianexpress.com/article/cities/chandigarh/2-aides-of-gangster-manna-held-with-weapons-opium-8025608/", "urlToImage": "https://images.indianexpress.com/2022/07/Indian-Express-6.jpeg", "publishedAt": "2022-07-12T18:48:39Z", "content": "Zirakpur police arrested two persons of Malerkotla district and recovered a .32 bore imported pistol, seven live cartridges and 500 grams opium from them on Tuesday. The arrested are said to be aides… [+382 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sweety Kumari", "title": "Rescue Centre Bids Adieu Royal Bengal Tiger Raja dies, administration plans memoir", "description": "While there is no concrete plan yet on what exactly will be done, the district administration and the forest department are planning something so that Raja “can be remembered forever in South Khairbari.”", "url": "https://indianexpress.com/article/cities/kolkata/rescue-centre-bids-adieu-royal-bengal-tiger-raja-dies-administration-plans-memoir-8025605/", "urlToImage": "https://images.indianexpress.com/2022/07/Royal-Bengal-tiger.jpg", "publishedAt": "2022-07-12T18:47:51Z", "content": "THE district administration is planning a memoir for Royal Bengal Tiger Raja, who died on Monday. Raja, nearly 26 years old, died of multiple organ failure at the South Khairbari rescue centre in Kol… [+3033 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Sanjiv Bhatt arrested, brought to Ahmedabad", "description": "Bhatt was lodged at Palanpur jail in Banaskantha in connection with an ongoing narcotics case and was already convicted with life term by a local court in a custodial death case.", "url": "https://indianexpress.com/article/cities/ahmedabad/sanjiv-bhatt-arrested-brought-to-ahmedabad-8025601/", "urlToImage": "https://images.indianexpress.com/2021/08/sanjiv-bhatt.jpeg", "publishedAt": "2022-07-12T18:42:34Z", "content": "Former IPS officer Sanjiv Bhatt was arrested and brought to Ahmedabad by the Ahmedabad Polices Crime Branch on Tuesday evening in connection with a case filed on June 24 after the Supreme Court gave … [+1660 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "Ajker Rashifal Bengali, 13 July 2022: নতুন সম্পর্কে বাধা পাবে এই রাশির জাতকরা! পড়ুন রাশিফল", "description": "১৩ই জুলাই- জানুন কী আছে ভাগ্যে?", "url": "https://bengali.indianexpress.com/horoscope/ajker-rashifal-july-13-2022-aries-taurus-gemini-cancer-leo-virgo-libra-scorpio-sagittarius-capricorn-aquarius-pisces-468173/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/wednesday.jpg", "publishedAt": "2022-07-12T18:35:00Z", "content": "/ Aries  Rashifal ( March 21 – April 20 )\r\n/ Taurus  Rashifal ( April 21 – May 21 )\r\n/ Gemini  Rashifal ( May 22 – June 21 )\r\n/ Cancer Rashifal  ( June 22 – July 23 )\r\n/ Leo   Rashifal  ( July 24 – A… [+322 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Flooding in residential societies: As residents complain of delayed response, AMC cites staff shortage", "description": "According to Harshit and Parimal, the residents also went to the AMC office in their area, a contact number was given to them but it didn’t work. A complaint number was then allotted to the residents.", "url": "https://indianexpress.com/article/cities/ahmedabad/flooding-in-residential-societies-as-residents-complain-of-delayed-response-ahmedabad-municipal-corporation-cites-staff-shortage-8025600/", "urlToImage": "https://images.indianexpress.com/2022/07/ahmedabad-municipal-corporation-1200-1.jpg", "publishedAt": "2022-07-12T18:32:02Z", "content": "RESIDENTS in certain parts of Ahmedabad continued to battle flooding in their houses as Ahmedabad Municipal Corporation (AMC) battled staff shortage, two days after the incessant rainfall on Sunday.\r… [+1742 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sadaf Modak", "title": "Sushant’s ‘extreme drug addiction’ was ‘aided and abetted’: NCB draft charge", "description": "The draft also states that delivery of drugs for Rajput had been taking place since 2018.", "url": "https://indianexpress.com/article/cities/mumbai/sushant-extreme-drug-addiction-aided-abetted-ncb-draft-charge-8025602/", "urlToImage": "https://images.indianexpress.com/2022/07/sushant-singh-rajput-1200-2.jpg", "publishedAt": "2022-07-12T18:32:02Z", "content": "THE Narcotics Control Bureau (NCB) in its draft charge against 35 accused booked in the alleged drugs case filed following the death of actor Sushant Singh Rajput in 2020 has said that the accused ha… [+2135 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "BJP going all out to destroy democratically elected state govts: Sharad Pawar", "description": "Addressing party workers at Y B Chavan Pratisthan, Pawar said that India had seen what happened in Madhya Pradesh (in 2020) and now in Maharashtra. He said that during the Congress-led UPA, agencies were never misused. He also asked his party workers to prepa…", "url": "https://indianexpress.com/article/cities/mumbai/bjp-going-all-out-to-destroy-democratically-elected-state-govts-sharad-pawar-8025594/", "urlToImage": "https://images.indianexpress.com/2022/07/sharad-pawar.jpg", "publishedAt": "2022-07-12T18:21:58Z", "content": "The Bharatiya Janata Party (BJP) is making all-out efforts to dissolve democratically elected state governments, NCP chief Sharad Pawar said on Tuesday, indicating that the day was not far when peopl… [+1331 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pinarayi questions Jaishankar’s Kerala trip; doing my job, says minister", "description": "Responding to the Pinarayi's comment, Jaishankar said, “Anyone who puts development above politics, they could understand what I am doing. Getting a good understanding of what is happening at the ground level is not politically motivated.", "url": "https://indianexpress.com/article/india/kerala/pinarayi-questions-jaishankars-kerala-trip-doing-my-job-says-minister-8025596/", "urlToImage": "https://images.indianexpress.com/2022/06/Pinarayi-Vijayan-100.jpg", "publishedAt": "2022-07-12T18:21:28Z", "content": "Kerala Chief Minister Pinarayi Vijayan on Tuesday took exception to External Affairs Minister S Jaishankar’s visit to the state, saying the former foreign secretary has been tasked with ensuring the … [+1461 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mumbai Police issues circular cancelling 2 orders by former commissioner", "description": "The two orders, that currently stand cancelled, pertains to the registration of FIRs of molestation cases and those under the Protection of Children from Sexual Offences (POCSO), Act.", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-police-issues-circular-cancelling-2-orders-by-former-commissioner-8025595/", "urlToImage": "https://images.indianexpress.com/2022/07/Sanjay-Pandey-1-1-1.jpg", "publishedAt": "2022-07-12T18:20:38Z", "content": "The Mumbai police on Tuesday issued a fresh circular cancelling the two orders issued last month by former Mumbai Police Commissioner Sanjay Pandey. The two orders, that currently stand cancelled, pe… [+1567 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Ahmedabad Municipal Corporation tells residential societies to clear out stagnant water", "description": "The advisory cautions to clear out rainwater that may have collected in crevices, tyres and other such spots in residential quarters, and advises to clean and drain out outlet pipes.", "url": "https://indianexpress.com/article/cities/ahmedabad/ahmedabad-municipal-corporation-tells-residential-societies-to-clear-out-stagnant-water-8025590/", "urlToImage": "https://images.indianexpress.com/2022/07/ahmedabad-municipal-corporation-1200.jpg", "publishedAt": "2022-07-12T18:14:41Z", "content": "As monsoon intensified in the city, the Ahmedabad Municipal Corporation issued an advisory to residential societies to clear out stagnant water to prevent vector-borne diseases such as malaria, dengu… [+655 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "State cabinet expansion likely after Presidential polls", "description": "Accordingly, all elected members of state legislature assembly belonging to the BJP and the Shinde camp have been summoned to reach Mumbai on Thursday.", "url": "https://indianexpress.com/article/cities/mumbai/state-cabinet-expansion-likely-after-presidential-polls-8025589/", "urlToImage": "https://images.indianexpress.com/2022/07/Murmu-latest.jpeg", "publishedAt": "2022-07-12T18:13:27Z", "content": "The cabinet expansion in Maharashtra is likely to take place after Presidential elections on July 18.Highly placed sources in the Bharatiya Janata Party (BJP) said, The NDA’s Presidential candidate, … [+2154 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "SSG Hospital gets first mammography machine", "description": "On Tuesday, Vadodara MP Ranjan Bhatt along with other BJP leaders, inaugurated the mammography section of the radiology department.", "url": "https://indianexpress.com/article/cities/baroda/ssg-hospital-gets-first-mammography-machine-8025587/", "urlToImage": "https://images.indianexpress.com/2022/07/doctor-759-4-1.jpg", "publishedAt": "2022-07-12T18:09:18Z", "content": "The radiology department of Vadodara’s SSG Hospital Tuesday received its first mammography machine donated by a  city-based foundation.The radiology department will now be equipped to test 100 patien… [+762 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sadaf Modak", "title": "Citing Aryan probe, accused in drugs case filed after Sushant death seeks re-investigation", "description": "The case against Aryan was transferred to an NCB SIT after an initial probe by the Mumbai zonal unit of the agency, which also probed Rajput's case in 2020.", "url": "https://indianexpress.com/article/cities/mumbai/citing-aryan-probe-accused-in-drugs-case-filed-after-sushant-death-seeks-re-investigation-8025544/", "urlToImage": "https://images.indianexpress.com/2022/07/Aryan-Khan-1200by667-1.jpg", "publishedAt": "2022-07-12T18:08:04Z", "content": "DRAWING PARALLELS with the probe against Aryan Khan, son of actor Shah Rukh Khan, who was dropped as an accused by the Narcotics Control Bureau (NCB) for lack of evidence, a former employee of a prod… [+3580 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Externed criminal fires at mother-in-law, booked", "description": "Senior police inspector Vijay Kandalgaonkar of Dharavi police station said, “Sayyed married twice and stays with his first wife in Karjat. His second wife Nazmeen stays with her maternal family in Dharavi.”", "url": "https://indianexpress.com/article/cities/mumbai/externed-criminal-fires-at-mother-in-law-booked-8025586/", "urlToImage": "https://images.indianexpress.com/2022/07/Indian-Express-6.jpeg", "publishedAt": "2022-07-12T18:07:14Z", "content": "A 32-year-old externed criminal from Dharavi has been booked for attempted murder after he allegedly fired a round at his mother-in-law. The police said the incident took place at 7am on Tuesday, soo… [+1398 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "‘Fatigued’ Arun Lal steps down as Bengal coach", "description": "An official statement from the Cricket Association of Bengal is awaited, but it is learnt that the state body has accepted his resignation.", "url": "https://indianexpress.com/article/sports/cricket/fatigued-arun-lal-steps-down-as-bengal-coach-8025583/", "urlToImage": "https://images.indianexpress.com/2022/07/Arun-Lal.jpg", "publishedAt": "2022-07-12T18:04:34Z", "content": "Former India cricketer Arun Lal on Tuesday stepped down as Bengal coach citing health and personal reasons. With president Avishek Dalmiya away in the UK, the 66-year-old visited Eden Gardens on Tues… [+1065 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "ACB nabs bank manager, aide for taking Rs 20k bribe", "description": "When an applicant contacted manager Prasannajitkumar Razak for getting a loan approved, he allegedly demanded Rs 50,000. The deal was finalised between them to Rs 20,000.", "url": "https://indianexpress.com/article/cities/surat/acb-nabs-bank-manager-aide-for-taking-rs-20k-bribe-8025581/", "urlToImage": "https://images.indianexpress.com/2022/07/BRIBERY.jpg", "publishedAt": "2022-07-12T18:04:05Z", "content": "Anti-Corruption Bureau (ACB) officials caught a manager of Bank of Baroda along with another man for accepting a bribe of Rs 20,000 from a complainant.According to ACB officials, resident of Pardi ta… [+1124 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Deeptiman Tiwary", "title": "CBI books Lakshadweep MP, his nephew, search premises", "description": "When contacted, Faizal said, “The CBI sought some documents which have been provided. They searched my home. They have given a nil report on recovery. Let’s see what further action they take. We will see from there.”", "url": "https://indianexpress.com/article/cities/delhi/cbi-books-lakshadweep-mp-his-nephew-search-premises-8025582/", "urlToImage": "https://images.indianexpress.com/2022/06/Lakshadweep-lawmaker-Mohammed-Faizal.jpg", "publishedAt": "2022-07-12T18:02:29Z", "content": "The CBI has booked Lakshadweep MP, Mohammed Faizal P P, and his nephew Abdul Razik for allegedly colluding with a Sri Lanka-based company to cheat fishermen in the Union Territory.On Tuesday, the age… [+4151 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Abhishek Purohit", "title": "Rohit hooks and pulls his way to quickfire 78 as India reach target in quick time", "description": "After a gap of a month, followed by another Covid-induced short break, Rohit has batted with refreshing freedom against England, first in the T20I series and then in the first ODI at The Oval.", "url": "https://indianexpress.com/article/sports/cricket/rohit-hooks-and-pulls-his-way-to-quickfire-78-as-india-reach-target-in-quick-time-8025575/", "urlToImage": "https://images.indianexpress.com/2022/07/RO-sharma-2.jpg", "publishedAt": "2022-07-12T17:56:47Z", "content": "The 2022 edition of the Indian Premier League was the first season in 15 years in which Rohit Sharma did not make a single half-century. In fact, his average of 19.14 was his lowest for any IPL seaso… [+2882 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "‘Chargesheet not incomplete’ | Doesn’t matter that CBI filed ‘trunk of documents’ later: Court while rejecting bail to Deshmukh in graft case", "description": "Deshmukh had sought default bail on the grounds that the chargesheet filed by the CBI against him on June 2 was “incomplete” as it was only 59 pages.", "url": "https://indianexpress.com/article/cities/mumbai/chargesheet-not-incomplete-cbi-documents-court-bail-deshmukh-graft-case-8025564/", "urlToImage": "https://images.indianexpress.com/2022/07/anil-deshmukh.jpg", "publishedAt": "2022-07-12T17:32:14Z", "content": "IN ITS detailed order rejecting default bail to former state home minister Anil Deshmukh and two of his staffers, a special court has said that not filing documents and statements of witnesses along … [+1858 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Biden nominates 5 new judges, but not Republican abortion opponent", "description": "Not on Biden's latest nominees list was Chad Meredith, a Republican former Kentucky solicitor general who the White House planned on June 24 to nominate to a judgeship despite his record defending abortion restrictions.", "url": "https://indianexpress.com/article/world/biden-nominates-5-new-judges-but-not-republican-abortion-opponent-8025547/", "urlToImage": "https://images.indianexpress.com/2022/07/biden-1-1.jpg", "publishedAt": "2022-07-12T17:22:52Z", "content": "U.S. President Joe Biden on Tuesday nominated five new federal judges, but did not at this time move forward with a plan opposed by a growing number of Democrats and progressives to appoint a Republi… [+2182 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Deeksha Teri", "title": "CUET-UG 2022 | 98% students given exam centre in city of their choice: UGC Chief", "description": "The Common University Entrance Test, or CUET-UG, will be conducted in two phases from July 15 to August 10, the National Testing Agency (NTA) announced last week.", "url": "https://indianexpress.com/article/education/cuet-ug-2022-students-given-exam-centre-city-of-choice-ugc-chairman-8025534/", "urlToImage": "https://images.indianexpress.com/2022/07/CUET-1-1-1.jpg", "publishedAt": "2022-07-12T17:11:41Z", "content": "Around 98% of CUET-UG candidates have been allotted the exam centre in the city of their choice, University Grants Commission (UGC) Chairman Jagadesh Kumar said on Tuesday the day admit cards for the… [+1993 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pune: Police ‘disrupt’ LGBTQ event, police commissioner promises fair probe", "description": "The organisers of the event have complained of police harassment", "url": "https://indianexpress.com/article/cities/pune/pune-police-disrupt-lgbtq-event-police-commissioner-fair-probe-8025527/", "urlToImage": "https://images.indianexpress.com/2022/07/Indian-Express-logo-13-4-3-1-2.jpeg", "publishedAt": "2022-07-12T17:10:28Z", "content": "The organisers of a private queer event held recently in Pune have complained of police harassment. They have alleged that around 150 members of the LGBTQ community were locked inside the venue of th… [+1739 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mumbai: BMC staffer held for ‘unnatural sex’ with man, causing him burns", "description": "The complainant told the police that the accused was upset as he had to pay Rs 6,000 which the former had demanded.", "url": "https://indianexpress.com/article/cities/mumbai/bmc-staffer-held-for-unnatural-sex-with-man-causing-him-burns-8025433/", "urlToImage": "https://images.indianexpress.com/2022/07/arrest-1-9-1.jpg", "publishedAt": "2022-07-12T17:06:36Z", "content": "The Mumbai Police on Tuesday arrested a BMC employee for allegedly having unnatural sex with a 33-year-old man and causing him burn injuries. The complainant told the police that he had demanded mone… [+897 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuradha Mascarenhas", "title": "Serum Institute’s Cervavac to prevent cervical cancer gets DGCI nod", "description": "CEO of Serum Institute of India (SII), Adar Poonawalla said the vaccine is very important, particularly for all adolescent girls to protect themselves against cervical cancer.", "url": "https://indianexpress.com/article/cities/pune/serum-institutes-cervavac-cervical-cancer-dgci-nod-8025506/", "urlToImage": "https://images.indianexpress.com/2022/01/pexels-VACCINE.jpg", "publishedAt": "2022-07-12T17:06:02Z", "content": "‘Cervavac’, the country’s first quadrivalent human papillomavirus vaccine (qHPV) manufactured by Pune-based Serum Institute of India (SII) was approved by the Drug Controller General of India for mar… [+3526 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "As rain reached Delhi, some districts were left drier than others", "description": "Despite getting little rainfall in the ten days after the monsoon hit Delhi, the city as a whole has recorded rainfall that is in the ‘normal’ category for the season.", "url": "https://indianexpress.com/article/cities/delhi/as-rain-reached-delhi-some-districts-were-left-drier-than-others-8025301/", "urlToImage": "https://images.indianexpress.com/2022/07/delhi-traffic-1.jpg", "publishedAt": "2022-07-12T17:04:32Z", "content": "So far this monsoon season, which the India Meteorological Department (IMD) considers to be from June 1, the Northwest and East districts of Delhi have received the highest amounts of rainfall.Northw… [+1650 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manoj C G", "title": "Opp flounders, Sena’s move ensures Murmu walkover", "description": "The Opposition is hoping that the Aam Aadmi Party – which, like the TRS, is locked in a bitter battle with the BJP -- would extend support to Yashwant Sinha.", "url": "https://indianexpress.com/article/political-pulse/opp-flounders-sena-move-ensures-murmu-walkover-8025517/", "urlToImage": "https://images.indianexpress.com/2022/07/Droupadi-Murmu-1.jpg", "publishedAt": "2022-07-12T17:01:39Z", "content": "It was never meant to be an extremely tight race — the Opposition had, in fact, framed the contest as a fight between two ideologies — but the campaign has unravelled faster than expected.\r\nSinhas ca… [+3392 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "America’s most luxurious butter lives to churn another day", "description": "For many small dairies in Vermont, retirement can be a heartbreaking matter of selling off cows and equipment to large agribusinesses and calling it quits.", "url": "https://indianexpress.com/article/lifestyle/food-wine/americas-most-luxurious-butter-lives-to-churn-another-day-7974578/", "urlToImage": "https://images.indianexpress.com/2022/06/VT-BUTTER-LEGACY-final.jpg", "publishedAt": "2022-07-12T17:00:47Z", "content": "In a wooden barn perched on a grassy hill, some of the most celebrated cows in the dairy business the bovine royal family of American fancy butter sampled hay in their new abode.\r\nDiva, the bossiest … [+10441 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "‘If a batsman plays a reverse sweep, he should be given out lbw even if the ball pitches outside leg stump’: Ashwin", "description": "Ashwin explained the logic of blind spot is only applicable when the batsman is at his original stance. But when they change their position for reverse sweep and switch hits, a ball outside leg stump is no longer a blind spot.", "url": "https://indianexpress.com/article/sports/cricket/if-a-batsman-plays-a-reverse-sweep-he-should-be-given-out-lbw-even-if-the-ball-pitches-outside-leg-stump-its-no-longer-a-blind-spot-ashwin-8025518/", "urlToImage": "https://images.indianexpress.com/2022/07/r-ashwin-scaled-1.jpg", "publishedAt": "2022-07-12T16:59:29Z", "content": "R Ashwin wants the batsmen to be given out lbw even when the ball pitches outside the leg stump if they are attempting to play reverse sweep or a switch hit. As things stand, lbw rule is not applicab… [+2330 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Debraj Deb", "title": "Tripura: Vehicles damaged by miscreants outside Congress venue in Sepahijala, FIR filed", "description": "Speaking to reporters at the state Congress Bhawan in Agartala, All India Congress Committee (AICC) secretary in-charge of Tripura Szarita Laitphlang alleged that a group of around 28 people came out of a BJP office located close to the Congress venue and att…", "url": "https://indianexpress.com/article/north-east-india/tripura/tripura-vehicles-damaged-by-miscreants-outside-congress-venue-fir-8025487/", "urlToImage": "https://images.indianexpress.com/2022/07/Tripura-congress-workers.jpg", "publishedAt": "2022-07-12T16:55:35Z", "content": "At least two vehicles belonging to Congress leaders parked outside the venue of the partys organisational meeting at Bishramganj in Tripuras Sepahijala district were allegedly damaged by BJP workers … [+3325 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "St Joseph’s College in Bengaluru is now a university", "description": "Established in 1882, the St Joseph’s College is one of the oldest colleges in Karnataka managed by the Karnataka Province of the Society of Jesus (Jesuits).", "url": "https://indianexpress.com/article/education/st-josephs-college-in-bengaluru-is-now-a-university-8025500/", "urlToImage": "https://images.indianexpress.com/2022/03/BCU.jpeg", "publishedAt": "2022-07-12T16:55:15Z", "content": "St Joseph’s College (Autonomous) is now upgraded to St Josephs University, announced the management of the university Tuesday. The government of Karnataka formally conferred the status on July 2 this… [+1605 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "UK Home Secretary Priti Patel rules herself out of bid to replace Boris Johnson", "description": "In a statement, Patel said she will not be standing for the Tory leadership.", "url": "https://indianexpress.com/article/world/uk-home-secretary-priti-patel-out-bid-replace-boris-johnson-8025492/", "urlToImage": "https://images.indianexpress.com/2022/03/priti22.jpg", "publishedAt": "2022-07-12T16:52:21Z", "content": "Priti Patel – widely expected to become another Indian-origin candidate in the race for the post of Conservative Party leader and the next British prime minister – on Tuesday ruled out a bid, saying … [+1761 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Joyprakash Das", "title": "শীর্ষ নেতৃত্বের অনুকরণের রাজনীতি, মঙ্গলে সরগরম বাংলার উত্তর থেকে দক্ষিণ", "description": "এদিন দলের কান্ডারীদের পথেই হাটলেন আলিপুরদুয়ারে অভিষেক, হাওড়ায় স্মৃতি ইরানি।", "url": "https://bengali.indianexpress.com/west-bengal/bengal-politics-tuesday-bjp-tmc-abhishek-benerjee-smriti-irani-468399/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/bengal-politics.jpg", "publishedAt": "2022-07-12T16:48:53Z", "content": "- , , \r\n - - - \r\n , ‘ ’ \r\n , , , , , \r\n , ‘ ’ \r\nStay updated with the latest news headlines and all the latest Westbengal news download Indian Express Bengali App.\r\nWeb Title: Bengal politics tuesday… [+38 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Chennai civic body ready to revamp its schools on lines of those in Delhi", "description": "The Tamil Nadu government is taking various measures to improve the quality of corporation schools and take them on par with the private schools in the city.", "url": "https://indianexpress.com/article/cities/chennai/chennai-civic-body-ready-to-revamp-its-schools-on-lines-of-those-in-delhi-8025438/", "urlToImage": "https://images.indianexpress.com/2022/06/MK-Stalin-4-5-1.jpg", "publishedAt": "2022-07-12T16:48:33Z", "content": "Days after Tamil Nadu Chief Minister M K Stalin visited Delhi schools and noted the facilities they provide to the students, the Greater Chennai Corporation Tuesday said they are all set to revamp th… [+1625 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pranav Mukul", "title": "SpiceJet plane grounded after glitch, released to service later", "description": "This was the ninth incident of a technical malfunction involving a SpiceJet flight in the last 24 days.", "url": "https://indianexpress.com/article/business/aviation/spicejet-plane-grounded-after-glitch-released-to-service-later-8025450/", "urlToImage": "https://images.indianexpress.com/2022/07/Spicejet-file-photo.jpg", "publishedAt": "2022-07-12T16:46:35Z", "content": "An oleo strut is a hydraulic device that is used as a shock absorber in the landing gear of an aircraft. It consists of a cylinder fitted with a hollow, perforated piston into which nitrogen gas and … [+1388 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "International Chess Olympiad: Tamil Nadu CM Stalin holds review meet of ministers, officers", "description": "CM Stalin instructs officers to expedite the construction work of event halls at Poonjeri village in Mamallapuram near Chennai", "url": "https://indianexpress.com/article/cities/chennai/international-chess-olympiad-tamil-nadu-cm-stalin-holds-review-meet-of-ministers-officers-8025460/", "urlToImage": "https://images.indianexpress.com/2022/06/mk-stalin-4.jpeg", "publishedAt": "2022-07-12T16:44:09Z", "content": "Tamil Nadu Chief Minister M K Stalin Tuesday chaired a meeting of ministers and senior officers at Poonjeri village in Mamallapuram, near Chennai, where the 44th International Chess Olympiad is sched… [+1916 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shubhangi Khapre", "title": "In Sena’s decision to support Murmu, an open door and a signal from Uddhav to BJP", "description": "Through his decision on Murmu, Thackeray would want to subtly convey that the Sena-BJP relationship is still an open-ended affair", "url": "https://indianexpress.com/article/political-pulse/senas-support-murmu-open-door-signal-uddhav-bjp-8025478/", "urlToImage": "https://images.indianexpress.com/2022/07/uddhavpol.jpg", "publishedAt": "2022-07-12T16:31:39Z", "content": "In the end, it was political compulsion that drove the Shiv Sena’s decision on Monday to support NDA presidential candidate Droupadi Murmu. Though Sena president Uddhav Thackeray claimed he was under… [+3035 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Emmy Awards 2022: The complete nominations list", "description": "The 74th Emmy Awards will be held in Los Angeles on September 12, 2022.", "url": "https://indianexpress.com/article/entertainment/television/emmy-awards-2022-the-complete-nominations-list-8025367/", "urlToImage": "https://images.indianexpress.com/2022/07/zendaya1200.jpg", "publishedAt": "2022-07-12T16:29:27Z", "content": "The nominees for the 74th Emmy Awards were announced on Tuesday. The frontrunners include Succession, Severance, Squid Game, Stranger Things, Barry, Euphoria, Ted Lasso among others. Adam Scott, Rees… [+5891 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Jennifer Winget says she married Karan Singh Grover because she was ‘in love’: ‘It was unfortunate timing’", "description": "Jennifer Winget recalled that she was in love when she took the decision to get married to Karan Singh Grover but she feels that the timing was unfortunate.", "url": "https://indianexpress.com/article/entertainment/television/jennifer-winget-married-karan-singh-grover-she-was-in-love-8025484/", "urlToImage": "https://images.indianexpress.com/2022/07/jennifer-karan-1200.jpg", "publishedAt": "2022-07-12T16:28:13Z", "content": "Jennifer Winget, who was recently seen in Code M Season 2, made it big in the television industry after appearing in popular serials like Kasautii Zindagii Kay and Dill Mill Gayye. In Dill Mill Gayye… [+1769 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Your Daily Wrap: India’s retail inflation eases to 7.01% in June, Uddhav backs NDA’s presidential nominee; and more", "description": "From the Shiv Sena announcing its support to Droupadi Murmu, to Yashwant Sinha lashing out at the Union government for 'misusing central investigating agencies', here are the top stories of the day.", "url": "https://indianexpress.com/article/india/your-daily-wrap-india-retail-inflation-june-uddhav-nda-presidential-nominee-8025457/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-56.jpg", "publishedAt": "2022-07-12T16:25:43Z", "content": "The Uber Files: A year after the rape of a 25-year-old passenger by an Uber driver, the company signed a spree of MoUs with the Centre and many state governments promising jobs to welfare schemes. Mo… [+5678 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "মহুয়ার কালী মন্তব্য বিতর্কের মধ্যেই দ্রৌপদীকে মা কালীর ছবি উপহার বিজেপির", "description": "কেন হঠাৎ দ্রৌপদী মুর্মুকে কালীর ছবি উপহার?", "url": "https://bengali.indianexpress.com/west-bengal/bjps-bengal-mps-mlas-give-maa-kaali-picture-to-draupadi-murmu-468386/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/droupadi.jpg", "publishedAt": "2022-07-12T16:23:46Z", "content": "- - , , \r\n ? , ‘ , ’\r\n , ‘’ , \r\n, , ‘ ’\r\nStay updated with the latest news headlines and all the latest Westbengal news download Indian Express Bengali App.\r\nWeb Title: Bjps bengal mps mlas give maa … [+30 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Explained Desk", "title": "Explained: What was the ‘Lavender Scare’, how is it linked to NASA’s James Webb?", "description": "The Lavender Scare was the marginalisation of LGBTQ employees working in the US government’s offices during the 1950s and 1960s.", "url": "https://indianexpress.com/article/explained/everyday-explainers/explained-lavender-scare-link-nasa-james-webb-8025431/", "urlToImage": "https://images.indianexpress.com/2022/07/Pride-Month-LGBTQ.jpg", "publishedAt": "2022-07-12T16:19:02Z", "content": "NASAs James Webb Space Telescope, which will show the clearest-ever images of the universe, is set to bring about a change in the way we perceive space. However, the telescopes name has come under in… [+3012 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Succession leads Emmy nominations, Squid Game scores big", "description": "The Emmys once were dominated by broadcast networks and then cable, with the rise of streaming services changing the balance of power and perhaps the awards themselves. Netflix’s Squid Game joining the Emmy mix is the result of streaming’s global marketplace …", "url": "https://indianexpress.com/article/entertainment/television/emmy-awards-2022-nominations-succession-squid-game-8025452/", "urlToImage": "https://images.indianexpress.com/2022/07/emmy.jpg", "publishedAt": "2022-07-12T16:17:51Z", "content": "Succession received a leading 25 Emmy nominations Tuesday, but the satirical drama about the rich and ruthless has a landmark rival in Squid Game, the first non-English language series to vie for tel… [+2700 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "এনডিএর সঙ্গে বিবাদ ঘুচল? রাষ্ট্রপতি পদপ্রার্থী দ্রৌপদী মুর্মুকে সমর্থন করবে শিবসেনা", "description": "একদিন আগেই সেনার জনপ্রতিনিধিরা দ্রৌপদী মুর্মুকে সমর্থন করার জন্য উদ্ধবের কাছে আর্জি জানিয়েছিলেন।", "url": "https://bengali.indianexpress.com/politics/national/sena-will-support-droupadi-murmu-468380/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/uddhav_balasaheb.jpg", "publishedAt": "2022-07-12T16:14:16Z", "content": ", ‘ ’ \r\n , ‘ , ’\r\n - , \r\n , , , - , ’ , ‘ ’\r\nRead full story in English\r\nStay updated with the latest news headlines and all the latest National news download Indian Express Bengali App.\r\nWeb Title: … [+31 chars]"}]}