{"status": "ok", "totalResults": 57, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Amil Bhatnagar", "title": "Himachal Pradesh: 2 days after polytechnic student found killed and his body cut into pieces, cops nab four", "description": "As per officials, the victim has been identified as Ankit Kumar, whose mutilated body was found in the woods located within Samoh village on Thursday. The accused, including a woman, have been remanded to police custody till July 28.", "url": "https://indianexpress.com/article/cities/shimla/himachal-pradesh-2-days-after-polytechnic-student-found-killed-and-his-body-cut-into-pieces-cops-nab-four-8048055/", "urlToImage": "https://images.indianexpress.com/2022/07/arrest-29.jpg", "publishedAt": "2022-07-23T21:21:24Z", "content": "Two days after a 19-year-old student was murdered and his body parts were found dumped in gunny bags at separate places Bilaspur, the Himachal Pradesh Police have arrested four persons.As per officia… [+2321 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Series of petitions & protests helped flag irregularites", "description": "Apart from the Primary Teacher Eligibility Test (TET), allegations of irregularities have been made regarding recruitment of schoolteachers, even in Group C and Group D employee categories.", "url": "https://indianexpress.com/article/cities/kolkata/series-of-petitions-protests-helped-flag-irregularites-8048032/", "urlToImage": "https://images.indianexpress.com/2022/07/WhatsApp-Image-2022-07-24-at-1.57.26-AM-1.jpeg", "publishedAt": "2022-07-23T20:36:07Z", "content": "The arrest of state minister Partha Chatterjee in connection with the School Service Commission (SSC) recruitment scam on Saturday is the latest development in an issue that surfaced in 2014 and, mor… [+4411 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Punjab: DGP leads special vehicle-checking op to check gangsters’ movement", "description": "Over 800 nakas – including 56 inter-state, 250 inter-district, 53 hi-tech and 427 city sealing – were set up in the state with an aim to make Punjab free from drugs and gangsters, Director General of Police (DGP) Punjab Gaurav Yadav said.", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-dgp-leads-special-vehicle-checking-op-to-check-gangsters-movement-8048018/", "urlToImage": "https://images.indianexpress.com/2022/07/Punjab-police-2.jpg", "publishedAt": "2022-07-23T20:23:56Z", "content": "Punjab Police on Saturday conducted a special vehicle checking drive, involving 10,000 personnel, in all the 28 police districts to check the movement of anti-social elements as well as drug peddlers… [+936 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Jagpreet Singh Sandhu", "title": "Biological mom can also become adoptive mother of same child: Punjab & Haryana HC", "description": "The HC was hearing a petition filed by a couple against the 2021 order of the Bhiwani Family Court, which had dismissed their application under Section 56(2) of the Juvenile Justice (Care and Protection of Children) Act, 2015.", "url": "https://indianexpress.com/article/cities/chandigarh/biological-mom-can-also-become-adoptive-mother-of-same-child-punjab-haryana-hc-8048007/", "urlToImage": "https://images.indianexpress.com/2022/06/Punjab-and-Haryana-HC-2-1-2.jpeg", "publishedAt": "2022-07-23T20:05:38Z", "content": "Holding that application for adoption cannot be dismissed merely on the ground that a biological mother cannot become a mother in dual status which is a biological mother as well as adoptive mother t… [+2484 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pothole-free roads in 2 years, promises BMC", "description": "Shinde reviews works; all Mumbai roads to be concretised", "url": "https://indianexpress.com/article/cities/mumbai/pothole-free-roads-2-years-bmc-8047915/", "urlToImage": "https://images.indianexpress.com/2022/07/WhatsApp-Image-2022-07-23-at-1.13.38-PM-1.jpeg", "publishedAt": "2022-07-23T18:17:06Z", "content": "With BMC elections ahead, the civic body on Saturday promised to provide pothole-free roads to Mumbaikars within the next two years. This comes after Chief Minister Eknath Shinde reviewed the status … [+2357 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Vallabh Ozarkar", "title": "Loyalists throng Aaditya rallies, say Shiv Sainiks still with Thackerays", "description": "Aaditya, who embarked on the Yatra on Thursday covering parts of Thane, Nashik, Aurangabad and Ahmednagar districts, received a warm welcome from supporters who vowed to stand with the family in the fight to reaffirm its political identity.", "url": "https://indianexpress.com/article/cities/mumbai/loyalists-throng-aaditya-rallies-shiv-sainiks-thackerays-8047948/", "urlToImage": "https://images.indianexpress.com/2022/07/aaditya-thackeray-1200.jpg", "publishedAt": "2022-07-23T18:08:03Z", "content": "Even as arguably the citys most powerful political family is struggling to keep its hold on the party it founded, with the Eknath Shinde faction laying claim to the Shiv Sena and its flag, Aadiyta Th… [+3586 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Hamza Sharif to be ‘trustee’ Punjab province CM till Monday, rules Pakistan’s Supreme Court", "description": "Hamza, 47, was declared the winner in the election though his Pakistan Muslim League-Nawaz (PML-N) party did not have a majority in the Assembly after key by-elections held on July 17.", "url": "https://indianexpress.com/article/world/hamza-sharif-to-be-trustee-punjab-province-cm-till-monday-rules-pakistans-supreme-court-8047932/", "urlToImage": "https://images.indianexpress.com/2022/07/hamza-oath-1.jpg", "publishedAt": "2022-07-23T17:33:10Z", "content": "Pakistan’s Supreme Court on Saturday allowed Hamza Shehbaz to remain as the trustee Punjab province Chief Minister till hearing resumes on Monday, but barred him from using his powers for political g… [+2466 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Iran says it detains Israel-linked network planning sabotage", "description": "The announcement by Iran's Intelligence Ministry came amid heightening tensions with arch-enemy Israel over Tehran's nuclear programme.", "url": "https://indianexpress.com/article/world/iran-detains-israel-linked-network-planning-sabotage-8047933/", "urlToImage": "https://images.indianexpress.com/2021/09/iran-president.jpg", "publishedAt": "2022-07-23T17:32:22Z", "content": "Iran said on Saturday its security forces had arrested a network of agents working for Israel before they were able to carry out sabotage and “terrorist operations”, state media reported.The announce… [+1072 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Real Madrid vs Barcelona Live Streaming: When and where to watch El Clasico preseason friendly match?", "description": "Real Madrid vs Barcelona, El Clasico Live Football Streaming: The preseason match between Real Madrid vs Barcelona will be played at Allegiant Stadium in Las Vegas and can be watched live on TV and streamed on Sony Liv App.", "url": "https://indianexpress.com/article/sports/football/real-madrid-vs-barcelona-live-streaming-ist-time-tv-channel-8047912/", "urlToImage": "https://images.indianexpress.com/2022/07/Barca-Madrid.jpg", "publishedAt": "2022-07-23T17:29:59Z", "content": "Real Madrid vs Barcelona Live Football Score Streaming: Eternal rivals Real Madrid and Barcelona will lock horns once again, albeit in a pre-season friendly, in the Allegiant Stadium in Las Vegas on … [+1800 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "After Patil says BJP made Shinde CM with heavy heart, Fadnavis clarifies, ‘he is leader of new alliance’", "description": "Underplaying Patil's remarks, Fadnavis, while concluding the day-long conclave, said: “In any government, there is always only one CM who is the leader. Accordingly, Eknath Shinde is the CM and the leader of the newly formed Shiv Sena-BJP alliance.”", "url": "https://indianexpress.com/article/cities/mumbai/patil-says-bjp-made-shinde-cm-with-heavy-heart-fadnavis-clarifies-he-is-leader-of-new-alliance-8047909/", "urlToImage": "https://images.indianexpress.com/2022/07/devendra-fadnavis-2.jpg", "publishedAt": "2022-07-23T17:23:31Z", "content": "Deputy Chief Minister and BJP leader Devendra Fadnavis on Saturday clarified that Eknath Shinde is the leader of the Shiv Sena-BJP alliance in Maharashtra. The remark came soon after state party pres… [+4246 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Hamza Khan", "title": "Mining row kept pending, Gehlot braces for BJP backlash over seer death", "description": "On Saturday, three days after he set himself ablaze in Bharatpur's Pasopa village protesting against mining activities in the revered hills of Aadibadri and Kankanchal there, seer Vijay Das passed away while undergoing treatment in Delhi.", "url": "https://indianexpress.com/article/political-pulse/gehlot-firefighting-bjp-bharatpur-anti-mining-seer-immolation-8047899/", "urlToImage": "https://images.indianexpress.com/2022/06/Gehlot-2.jpg", "publishedAt": "2022-07-23T17:06:16Z", "content": "The death of a Bharatpur seer who immolated himself is set to increase troubles for the Ashok Gehlot-led Congress government in Rajasthan, which has already been beset by various crises.On Saturday, … [+3591 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Man arrested for smuggling heroin along Indo-Pak border in Rajasthan", "description": "According to the police, the accused has admitted to sending 15 kg heroin in two consignments from Pakistan to Punjab. Further investigation is going on, they said.", "url": "https://indianexpress.com/article/cities/delhi/man-arrested-smuggling-heroin-indo-pak-border-rajasthan-8047903/", "urlToImage": "https://images.indianexpress.com/2022/07/arrest-29.jpg", "publishedAt": "2022-07-23T17:04:13Z", "content": "A man has been arrested from Rajasthan’s Barmer district for smuggling heroin along the Indo-Pak border and then supplying the contraband in Punjab and Delhi, police said here on Saturday.According t… [+981 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Sainz helps Leclerc edge Verstappen for French GP pole", "description": "Sainz had nothing at stake since he was starting from the back of the grid after multiple engine-part changes, so Ferrari used him to give Leclerc a tow on his two runs in Q3.", "url": "https://indianexpress.com/article/sports/motor-sport/sainz-helps-leclerc-edge-verstappen-for-french-gp-pole-8047896/", "urlToImage": "https://images.indianexpress.com/2022/07/F1-4.jpg", "publishedAt": "2022-07-23T16:54:14Z", "content": "Charles Leclerc used help from Ferrari teammate Carlos Sainz Jr. to beat Formula One leader Max Verstappen and take pole position for the French Grand Prix on Saturday.Sainz had nothing at stake sinc… [+4420 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Style alert: Sara Ali Khan plays with quirky prints on her Europe vacation", "description": "The actor was recently on a vacation, serving travel fashion goals with her chic and trendy ensembles", "url": "https://indianexpress.com/article/lifestyle/fashion/sara-ali-khan-wears-quirky-prints-8024685/", "urlToImage": "https://images.indianexpress.com/2022/07/Sara-ali-khan-3.jpeg", "publishedAt": "2022-07-23T15:20:28Z", "content": "Sara Ali Khan has never failed to impress us with her fashion sense. From wearing elegant ethnic ensembles to choosing vibrant and uniquely styled outfits, she keeps it versatile with her sartorial p… [+1548 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "CWG: Mother to carry baton in place of 14-year old daughter who died due to coronary heart disease in March", "description": "The 14-year old Skye Gardner was nominated for the relay by her school teachers but died in March, and without knowing she had been accepted.", "url": "https://indianexpress.com/article/sports/sport-others/cwg-mother-to-carry-baton-in-place-of-14-year-old-daughter-who-died-due-to-coronary-heart-disease-in-march-8047831/", "urlToImage": "https://images.indianexpress.com/2022/07/Skye.jpg", "publishedAt": "2022-07-23T14:47:48Z", "content": "On Sunday, a mother will take part in the Queens baton relay ahead of Commonwealth Games in place of her 14-year-old girl Skye Gardner, who died in March due to a coronary heart disease. Skye was nom… [+2127 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "When Daniel Radcliffe spoke about one-night stands with Harry Potter fans, said age-difference between him and his first sexual partner would ‘freak people out’", "description": "Daniel Radcliffe has always given straightforward answers in his interviews, especially when he's addressed topics like his alcohol addiction and his sex life as a young star.", "url": "https://indianexpress.com/article/entertainment/hollywood/when-daniel-radcliffe-spoke-about-one-night-stands-with-harry-potter-fans-8047366/", "urlToImage": "https://images.indianexpress.com/2022/03/daniel-radcliffe-1200.jpg", "publishedAt": "2022-07-23T14:41:18Z", "content": "Actor Daniel Radcliffe is someone many millennials have watched grow up in front of their eyes, so it’s always going to be a little jarring to hear him talk frankly about his addiction to alcohol or … [+2064 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "আপাতত পার্থর পাশে দল, তবে পথে নামছে না তৃণমূল", "description": "আইন ও আদালতেই ভরসা রাখছে জোড়া-ফুল। যদিও অভিযোগ প্রমাণিত হলে ব্যবস্থা নেওয়া হবে বলে জানানো হয়েছে।", "url": "https://bengali.indianexpress.com/west-bengal/tmc-reaction-on-partha-chatterjees-arrest-473131/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/tmc-on-partha-chaterjee-arrest.jpg", "publishedAt": "2022-07-23T14:06:54Z", "content": ", , - \r\n , , , \r\n - , - , -\r\n , ‘ , ’\r\n , ‘ , - , ’\r\n - , \r\n , ‘, , - , ’\r\n , ‘ , , ’\r\n - ? ? \r\n‘ ’ \r\nStay updated with the latest news headlines and all the latest Westbengal news download Indian Ex… [+71 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "‘Stronger everyday’: Esha Gupta’s circuit routine is worth your time", "description": "Esha Gupta is setting major fitness inspiration with her workouts lately", "url": "https://indianexpress.com/article/lifestyle/fitness/stronger-everyday-esha-gupta-shoulder-exercises-fitness-8032631/", "urlToImage": "https://images.indianexpress.com/2019/07/esha-gupta-1200.jpg", "publishedAt": "2022-07-23T13:40:02Z", "content": "Esha Gupta has been keeping busy with her workouts and how. The Aashram 3 actor recently shared a glimpse of flexing her muscles with personal trainer Saqib Merchant.“Stronger everyday,” she captione… [+1337 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sanath Prasad", "title": "Karnataka: 40 students fall sick after eating midday meal", "description": "Kumaraswamy, whose daughter fell sick from consuming the midday meal, complained that the school infrastructure is poor and there is no toilet facility.", "url": "https://indianexpress.com/article/cities/bangalore/karnataka-40-students-sick-midday-meal-8047781/", "urlToImage": "https://images.indianexpress.com/2022/07/bangalore_midday.jpeg", "publishedAt": "2022-07-23T13:24:56Z", "content": "Forty students of Government Higher Primary School in Gollarahatti, in Chitradurga district, fell sick and 26 of them had to be hospitalised after eating the midday meal served at the school on Thurs… [+2378 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Why oil-pulling is good for dental hygiene", "description": "This Ayurvedic technique releases enzymes that remove toxins and bacteria from the oral cavity. It is a good and safe hygiene maintenance practice but won’t fix a toothache, infection or major dental problems, says Dr Gauri Merchant, Dental Services, Sir H. N…", "url": "https://indianexpress.com/article/lifestyle/health-specials/dental-hygiene-oil-pulling-dental-hygiene-8047709/", "urlToImage": "https://images.indianexpress.com/2019/02/teeth.jpg", "publishedAt": "2022-07-23T12:48:31Z", "content": "WHAT IS OIL PULLING?\r\nOil pulling is a traditional folk remedy and ayurvedic therapy, which was practised in ancient India. It is believed to cure more than 30 systemic diseases when practised regula… [+7022 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Epic Games won’t ban the use of NFTs in games, says CEO Tim Sweeney", "description": "Minecraft released a public statement stating that the company has made the decision to ban NFTs o ensure that the players have a safe and inclusive experience.", "url": "https://indianexpress.com/article/technology/crypto/epic-games-wont-ban-the-use-of-nfts-in-games-says-ceo-tim-sweeney-8047437/", "urlToImage": "https://images.indianexpress.com/2022/03/EpicGamesUkraineRelief.jpg", "publishedAt": "2022-07-23T12:30:17Z", "content": "Epic Games CEO Tim Sweeney tweeted that the company doesn’t have any plans of banning non-fungible-tokens (NFTs) from its games. This comes as Microsoft-owned Minecraft announced that it will soon ba… [+2464 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Sangita Ghosh introduces her seven-month old daughter Devi to the world, see photos", "description": "Swaran Ghar actor Sangita Ghosh has shared that she is a mother to a seven-month-old baby. She revealed that she never intended to hide the news but was waiting for the right time to talk about her.", "url": "https://indianexpress.com/article/entertainment/television/sangita-ghosh-introduces-her-daughter-devi-rathore-to-the-world-see-photos-8047546/", "urlToImage": "https://images.indianexpress.com/2022/07/sangita-ghosh-baby-girl.jpg", "publishedAt": "2022-07-23T12:01:00Z", "content": "Television actor Sangita Ghoshon Saturday took to Instagram to introduce her baby girl to the world. The Swaran Ghar actor shared photos of her seven-month-old daughter Devi Rathore, as she kickstart… [+1802 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Try this healthy recipe for delicious potato chips", "description": "What better than munching healthy, crunchy potato chips on a regular evening? So, today we've got an easy-to-make recipe for just that.", "url": "https://indianexpress.com/article/lifestyle/food-wine/potatoes-potatao-chips-healthy-recipe-aloo-chips-8033246/", "urlToImage": "https://images.indianexpress.com/2022/07/pexels-andres-ayrton-6550824.jpg", "publishedAt": "2022-07-23T12:00:05Z", "content": "Who doesn’t love a yummy potato dish? Considering its versatility, potatoes can be mixed with almost any food item and can be cooked in a variety of ways. They can be turned into something crunchy, m… [+1640 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Nihal Koshie", "title": "What to watch this weekend: The Miracle Mile and not the Four-minute Mile was Roger Bannister’s greatest moment; how a javelin thrower’s body is like a bow", "description": "There's live sports on the weekend but for those who want to tune in at their own sweet time a big platter of in-depth documentaries, viral videos, video podcasts, movies, interviews are on offer. Two recommendations worth your time for this weekend feature R…", "url": "https://indianexpress.com/article/sports/sport-others/what-to-watch-this-weekend-the-miracle-mile-and-not-the-four-minute-mile-was-roger-bannisters-greatest-moment-how-a-javelin-throwers-body-is-like-a-bow-8047563/", "urlToImage": "https://images.indianexpress.com/2022/07/WTW-W.jpg", "publishedAt": "2022-07-23T11:53:33Z", "content": "How the javelin thrower becomes a bow\r\nYouTube: 4 minutes and 4 seconds\r\nJavelin thrower Neeraj Chopra’s coach Dr Klaus Bartonietz has spoken about elasticity being one of the strengths of India’s Ol… [+3285 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "নাসার নতুন ছবি, ধরা পড়ল লেক মিডের জলস্তর হ্রাসের প্রমাণ", "description": "নাসার ক্যামেরা যে ছবিগুলো তুলেছে তা ২০০০ সালের ৬ জুলাই থেকে ২০২২ সালের ৩ জুলাইয়ের মধ্যে তোলা।", "url": "https://bengali.indianexpress.com/general-news/nasa-releases-new-pictures-that-reveal-scale-of-decline-473012/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/lake-mead.jpg", "publishedAt": "2022-07-23T11:45:06Z", "content": ", , , \r\n , \r\n - , \r\n , , , , , , \r\n , , , , - \r\nRead full story in English\r\nStay updated with the latest news headlines and all the latest General news download Indian Express Bengali App.\r\nWeb Title… [+56 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Megan fox bares her sculpted abs in neon green attire, says ‘I don’t exercise’", "description": "\"I exercise really hard twice a week,\" she had revealed in an interview", "url": "https://indianexpress.com/article/lifestyle/fitness/megan-fox-sculpted-abs-neon-green-attire-i-dont-exercise-8034333/", "urlToImage": "https://images.indianexpress.com/2022/07/megan-1200.jpg", "publishedAt": "2022-07-23T10:00:20Z", "content": "Megan Fox and her sartorial picks are often in headlines, and this time was no different as the diva chose a neon green Jacquemus attire for beau Machine Gun Kelly‘s concert.Buy Now | Our best subscr… [+1646 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "In Pune, Rotary International’s first woman president says India is now a ‘help-giving nation’", "description": "In Pune after her election, Jennifer Jones inaugurated a Linear Accelerator Radiotherapy machine at Suryadatta Hospital in Shaniwarwada to enable citizens from economically weaker sections to undergo radiotherapy treatment for cancer.", "url": "https://indianexpress.com/article/cities/pune/in-pune-rotary-internationals-first-woman-president-says-india-is-now-a-help-giving-nation-8047235/", "urlToImage": "https://images.indianexpress.com/2022/07/rotary-president-jenifer.jpg", "publishedAt": "2022-07-23T09:43:47Z", "content": "Jennifer Jones made history earlier this month when she became the 117-year-old Rotary International’s first woman president. Jones, who was in Pune on Saturday as part of her visit to India after th… [+1804 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Jalandhar deputy commissioner office staff announce strike against AAP MLA Angural’s ‘interference’", "description": "Sources say the immediate provocation for the MLA's visits to branches of the office on Friday was that some employees close to him did not get their preferred posts in a recent reshuffle.", "url": "https://indianexpress.com/article/cities/jalandhar/jalandhar-deputy-commissioner-office-staff-announce-strike-against-aap-mla-angurals-interference-8047278/", "urlToImage": "https://images.indianexpress.com/2022/07/sheetal_angural1.jpg", "publishedAt": "2022-07-23T09:37:53Z", "content": "The staff of the Jalandhar deputy commissioner office have announced an indefinite strike from Monday protesting against AAP MLA Sheetal Angural’s behaviour during his visits to the office’s various … [+2086 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "NASA releases new pictures that reveal scale of decline in Lake Mead’s water levels", "description": "One of the largest reservoirs in the US, Lake Mead straddles Arizona and Nevada and is one of the primary sources of water for California, Arizona and Nevada.", "url": "https://indianexpress.com/article/world/us-lake-mead-water-level-decline-photos-nasa-8045236/", "urlToImage": "https://images.indianexpress.com/2022/07/lake-mead-1200.jpg", "publishedAt": "2022-07-23T09:16:15Z", "content": "NASA has released images that show the sharp decline in water levels in America’s Lake Mead over the past 22 years. The report said that the water levels stand at a little over one-quarter of the tot… [+2450 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "IPU BBA Result 2022 Declared: Follow these steps to check ranks", "description": "IP University conducted the online computer based test (CBT) entrance exam on June 23. Qualified candidates will now participate in the counselling process.", "url": "https://indianexpress.com/article/education/ipu-bba-result-2022-declared-steps-to-check-ranks-ipu-ac-in-8047234/", "urlToImage": "https://images.indianexpress.com/2020/04/jobs-1200-2.jpg", "publishedAt": "2022-07-23T09:13:45Z", "content": "The Guru Gobind Singh Indraprastha University (GGSIPU) has declared the result for  Indraprastha University Common Entrance Test (IPU CET) 2022 for admissions to BBA programme. Candidates who appeare… [+765 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Kartik Aaryan documents his Europe trip, gives major vacation goals", "description": "The actor served major vacation goals with his pictures", "url": "https://indianexpress.com/article/lifestyle/destination-of-the-week/kartik-aaryan-documents-his-europe-trip-gives-major-vacation-goals-8017057/", "urlToImage": "https://images.indianexpress.com/2022/07/KARTIK-AARYAN-9-1.jpeg", "publishedAt": "2022-07-23T08:55:47Z", "content": "With vacation season nearing its end, you still have some time in hand to pack your bags and venture out to explore some new and exciting destinations. If you are not motivated enough, then these pic… [+2095 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "NEET-PG 2022 counselling to begin on September 1", "description": "The PG counselling will commence for all central universities, deemed Universities and 50 per cent All India quota seats and 50 per cent state quota seats of medical and dental colleges simultaneously, the officials said.", "url": "https://indianexpress.com/article/education/neet-pg-2022-counselling-to-begin-on-september-1-8047182/", "urlToImage": "https://images.indianexpress.com/2021/11/NEET-PG.jpg", "publishedAt": "2022-07-23T08:38:51Z", "content": "The National Eligibility cum Entrance Test (Postgraduate)counselling will begin on September 1, official sources said on Saturday.Students who have qualified in the NEET-PG 2022 exam will be able to … [+1588 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "Someone made a Kesariya version without Love Storiyan and netizens can’t get enough of it", "description": "Music producer Harsh More changed the lyrics with ‘yeh dooriyan’ and the video has amassed over 10 million views on Instagram", "url": "https://indianexpress.com/article/trending/trending-in-india/kesariya-version-without-love-storiyan-viral-8046903/", "urlToImage": "https://images.indianexpress.com/2022/07/kesariya-fixed-lyrics.jpg", "publishedAt": "2022-07-23T08:33:59Z", "content": "After much anticipation, the makers of Brahmastra released the full version song ‘Kesariya’ on Sunday. The small teaser released earlier had already got everyones expectations high, however, it only … [+2161 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Explained: The ICJ’s latest judgment in the case of genocide against Myanmar", "description": "The ICJ’s ruling sets the stage for court hearings, airing evidence of atrocities against the Rohingya that human rights groups and a UN probe say amount to breaches of the 1948 Genocide Convention.", "url": "https://indianexpress.com/article/explained/myanmar-genocide-case-international-court-of-justice-ruling-explained-8047114/", "urlToImage": "https://images.indianexpress.com/2022/07/Abubacarr_Tambadou_speaks_at_the_International_Court_of_Justice.jpeg", "publishedAt": "2022-07-23T08:29:27Z", "content": "Judges at the United Nations’ highest court have dismissed preliminary objections by Myanmar to a case alleging the Southeast Asian nation is responsible for genocide against the Rohingya ethnic mino… [+4432 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Deutsche Welle", "title": "Could HIMARS turn the tide of war in Ukraine?", "description": "Precision-guided missile systems provided by the United States have allowed Ukraine to strike targets deep behind enemy lines and frustrate Russia's advance through the eastern Donbas region.", "url": "https://indianexpress.com/article/world/could-himars-turn-the-tide-of-war-in-ukraine-8047116/", "urlToImage": "https://images.indianexpress.com/2022/07/DW.jpg", "publishedAt": "2022-07-23T08:24:39Z", "content": "In late June, Ukraine announced it had destroyed a Russian military base in Izyum, in the eastern Donbas region, killing at least 40 soldiers. Another strike that night reportedly killed a commander … [+5380 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Is there a link between diabetes and frozen shoulder?", "description": "When sugar attaches to collagen, it becomes sticky, restricting mobility and causing your shoulder to stiffen", "url": "https://indianexpress.com/article/lifestyle/health/diabetes-frozen-shoulder-link-relation-health-8044098/", "urlToImage": "https://images.indianexpress.com/2022/07/frozen-shoulder.jpg", "publishedAt": "2022-07-23T07:50:03Z", "content": "“Frozen shoulder is a disorder that causes stiffness and discomfort in the shoulder joint. Frozen shoulder, also known as adhesive capsulitis, occurs when the connective tissue around the shoulder jo… [+4698 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "The Jan 6 panel after 8 hearings: Where will the evidence lead?", "description": "The Jan 6 hearing committee assembled a mass of evidence and testimony — provided in large part by Trump’s aides — not only for the judgment of history but with two immediate goals.", "url": "https://indianexpress.com/article/world/the-jan-6-panel-after-8-hearings-where-will-the-evidence-lead-8046969/", "urlToImage": "https://images.indianexpress.com/2022/07/hutchinson-1200.jpg", "publishedAt": "2022-07-23T07:46:14Z", "content": "Comprehensive, compellingly scripted and packed with details, the eight hearings of the House committee investigating the January 6, 2021, attack on the Capitol have laid out a powerful account of Pr… [+10852 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Ghaziabad cops bust interstate gang for stealing over 300 vehicles, 4 arrested", "description": "During questioning, the kingpin of the gang, Jogendra, revealed that he had been running the racket for the past 15-20 years in Delhi-NCR.", "url": "https://indianexpress.com/article/delhi/ghaziabad-cops-bust-interstate-gang-for-stealing-over-300-vehicles-4-arrested-8046908/", "urlToImage": "https://images.indianexpress.com/2022/07/Delhi-Police-1-3.jpg", "publishedAt": "2022-07-23T06:21:26Z", "content": "The Ghaziabad Police Thursday arrested four members of a gang of interstate car and bike thieves who stole over 300 vehicles from Delhi-NCR, the police said.The leader of the gang has been identified… [+2577 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sriram Veera", "title": "Norman was trying to prove he was no choker and make his Japanese mother proud. James was trying to prove he can run fast even after Graves disease and death of his mother.", "description": "Michael Norman, the 400-metres champion at world championships, and Kirani James, who came second, have fascinating tales of overcoming setbacks", "url": "https://indianexpress.com/article/blogs/sports-blogs/norman-was-trying-to-prove-he-was-no-choker-and-make-his-japanese-mother-proud-james-was-trying-to-prove-he-can-run-fast-even-after-graves-disease-and-death-of-his-mother-8046836/", "urlToImage": "https://images.indianexpress.com/2022/07/Michael-Norman.jpg", "publishedAt": "2022-07-23T05:49:44Z", "content": "Michael Norman was learning Japanese before the Tokyo Olympics. To converse with the relatives of his Japanese mother, who used to be a sprinter in her growing up years in her homeland. Son of an Afr… [+4626 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "CISF personnel shoots himself dead at Kolkata airport", "description": "The body of Pankaj Kumar, a sub-inspector, was found lying in a pool of blood around 7.45 pm on Friday at the basement toilet meant for airport staff, they said.", "url": "https://indianexpress.com/article/cities/kolkata/cisf-personnel-shoots-himself-dead-at-kolkata-airport-8046775/", "urlToImage": "https://images.indianexpress.com/2022/07/SUICIDE-1-1.jpg", "publishedAt": "2022-07-23T05:30:58Z", "content": "A CISF personnel has allegedly shot himself dead at Netaji Subhas Chandra Bose International Airport in Kolkata, police said.The body of Pankaj Kumar, a sub-inspector, was found lying in a pool of bl… [+659 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Nysa Devgn is living her best life as she parties all night in Spain and Greece. Watch videos here", "description": "A new video of Nysa Devgan partying in Greece is being widely shared on social media. Nysa is the daughter of actors Ajay Devgn and Kajol.", "url": "https://indianexpress.com/article/entertainment/bollywood/nysa-devgn-parties-all-night-in-spain-and-greece-8046758/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-36-2.jpg", "publishedAt": "2022-07-23T05:12:20Z", "content": "Actors Ajay Devgn and Kajols daughter, Nysa Devgan, is having the time of her life on a sprawling Europe vacation. Several pictures and videos of her adventures have already been shared online. In a … [+1215 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Santosh Singh", "title": "Behind Bihar govt temple fencing push, Nitish tightrope between secular image, BJP Hindutva", "description": "To expand its existing move to fence temples – on the lines of fencing of cemeteries – to prevent encroachments and confrontations, the Bihar government also decided to conduct a survey of all registered temples that see the attendance of a sizeable number of…", "url": "https://indianexpress.com/article/political-pulse/behind-bihar-govt-temple-fencing-push-nitish-tightrope-between-secular-image-bjp-hindutva-8046792/", "urlToImage": "https://images.indianexpress.com/2022/07/Nitish-kumar-8.jpeg", "publishedAt": "2022-07-23T05:11:18Z", "content": "The Nitish Kumar-led Bihar government recently decided to make the registration of all public temples, mutts, dharamshalas and their trusts in the state with the Bihar State Religious Trust Council (… [+4164 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Mumbai News Live Updates: Sena MPs had asked Thackeray to revive ties with BJP, says Shinde camp member", "description": "Mumbai News Live: Generally cloudy sky with light to moderate showers in Mumbai today.", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-news-live-updates-rains-shiv-sena-eknath-shinde-uddhav-thackeray-8046748/", "urlToImage": "https://images.indianexpress.com/2022/07/eknath-4.jpg", "publishedAt": "2022-07-23T05:04:58Z", "content": "Mumbai residents walk amid rainfall in the city. (Express Photo by Amit Chakravarty)\r\nWith daily Covid-19 cases in Mumbai hovering around 200 and hospital occupancy significantly reduced, the BMC is … [+1175 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "U.S. and Jamaica set up another women’s sprint relay showdown", "description": "The US squad of Melissa Jefferson, Aleia Hobbs, Jenna Prandini and Twanisha Terry clocked 41.56 seconds and have some quicker individuals to bring in for Saturday's final at the World Athletics Championships.", "url": "https://indianexpress.com/article/sports/u-s-and-jamaica-set-up-another-womens-sprint-relay-showdown-8046640/", "urlToImage": "https://images.indianexpress.com/2022/07/Twanisha-Terry-.jpg", "publishedAt": "2022-07-23T05:01:01Z", "content": "The United States landed the first blow in the “phoney war” of the women’s 4x100m relay on Friday as their shadow squad qualified fastest for the final, with perennial rivals Jamaica solid enough but… [+1502 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": null, "title": "Game Time: India's chances at CWG 2022, and some memorable tales - The Indian Express", "description": "Host Mihir Vasavda joins Indian Express’ Shivani Naik to discuss India’s prospects at the upcoming games, and the events you should look forward to.", "url": "https://indianexpress.com/audio/express-sports/game-time-indias-chances-at-cwg-2022-and-some-memorable-tales/8046394/", "urlToImage": "https://images.indianexpress.com/2022/07/c-Roberto-Falck-3.png", "publishedAt": "2022-07-23T05:00:25Z", "content": "The 2022 Commonwealth Games are scheduled to take place in Birmingham (England) from 28 July to 8 August. In this episode, host Mihir Vasavda joins Indian Express Shivani Naik to discuss Indias prosp… [+259 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "টাকার পাহাড় অর্পিতার বাড়িতে, এপর্যন্ত মিলেছে ২১ কোটি, উদ্ধার ৫০ লাখের সোনা", "description": "এসএসসি নিয়োগ দুর্নীতি মামলার তদন্তে নেমে চোখ কপালে ওঠার জোগাড় ইডি-র আধিকারিকদের।", "url": "https://bengali.indianexpress.com/west-bengal/wb-ssc-scam-partha-chatterjee-arpita-mukherjee-ed-notes-seized-updates-472734/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/Arpita-Mukherjee-1.jpg", "publishedAt": "2022-07-23T04:21:28Z", "content": "- ? \r\n - \r\n - , ED\r\n , \r\n - , , \r\n , \r\n , , \r\nStay updated with the latest news headlines and all the latest Westbengal news download Indian Express Bengali App.\r\nWeb Title: Wb ssc scam partha chatte… [+44 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Noida: GNIDA conducts anti-encroachment drive on land worth Rs 40 crore", "description": "The drive was carried out against illegal constructions in Greater Noida’s Sunpura village on land worth Rs 40 crore, officials said.", "url": "https://indianexpress.com/article/cities/delhi/noida-gnida-anti-encroachment-drive-8046727/", "urlToImage": "https://images.indianexpress.com/2022/07/gnida.jpg", "publishedAt": "2022-07-23T04:08:44Z", "content": "The Greater Noida Industrial Development Authority (GNIDA) carried out an anti-encroachment drive against illegal constructions in Greater Noidas Sunpura village on Friday on land worth Rs 40 crore, … [+1340 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "5 held for sending man fake link to activate credit card, duping him of Rs 3.5 lakh", "description": "Police said an analysis of call and transaction details showed that the accused were operating from Faridabad.", "url": "https://indianexpress.com/article/cities/delhi/5-held-for-sending-man-fake-link-to-activate-credit-card-8046705/", "urlToImage": "https://images.indianexpress.com/2022/07/creditcards-759.jpg", "publishedAt": "2022-07-23T04:03:58Z", "content": "Five men were arrested for allegedly cheating a 31-year-old man of Rs 3.5 lakh by sending him a fake link to activate his credit card. Police said the accused were identified as Gurmeet Singh (31), w… [+1882 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "IMD issues red alert for central Telangana districts today", "description": "Hyderabad is likely to witness moderate to heavy rain with intense spells of heavy rains at times, IMD said", "url": "https://indianexpress.com/article/cities/hyderabad/imd-issues-red-alert-for-central-telangana-districts-today-8046703/", "urlToImage": "https://images.indianexpress.com/2022/07/telangana-rains.jpeg", "publishedAt": "2022-07-23T03:49:57Z", "content": "The India Meteorological Department (IMD) has issued a code red warning for Mahabubabad, Jangoan, Suryapet, and Yadadri Buvangiri districts in Telangana on Saturday, predicting a possibility of very … [+1523 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Joyprakash Das", "title": "মন্ত্রীর বাড়িতে ইডির হানা, অস্বস্তি তৃণমূলে, পার্থর সঙ্গে দূরত্ব বাড়াচ্ছে তৃণমূল", "description": "পার্থ চট্টোপাধ্যায়ের বিরুদ্ধে সিবিআই তদন্তের দায় দল নেবে না বলে এর আগেও জানিয়েছিলেন তৃণমূল মুখপাত্র কুণাল ঘোষ।", "url": "https://bengali.indianexpress.com/west-bengal/tmc-keeps-distance-with-partha-chatterjee-on-ssc-scam-issue-472719/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/Partha-Mamata.jpg", "publishedAt": "2022-07-23T03:48:04Z", "content": ", , - \r\n - \r\n , - \r\n - , ?\r\n , ‘ , , , ’ \r\n - , ED\r\n , - , \r\n , \r\nStay updated with the latest news headlines and all the latest Westbengal news download Indian Express Bengali App.\r\nWeb Title: Tmc k… [+53 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Yasin Malik goes on hunger strike in Tihar, alleges case not being probed properly", "description": "Malik, sentenced by a special National Investigation Agency (NIA) court in Delhi this year, is serving two life sentences and varying jail terms, all running concurrently, under the Unlawful Activities (Prevention) Act (UAPA) and the Indian Penal Code.", "url": "https://indianexpress.com/article/cities/delhi/yasin-malik-hunger-strike-tihar-jail-8046680/", "urlToImage": "https://images.indianexpress.com/2022/07/Yasin-Malik-1.jpg", "publishedAt": "2022-07-23T03:39:20Z", "content": "Kashmiri separatist leader Yasin Malik went on a hunger strike in Tihar jail on Friday, alleging that his case is not being investigated properly.Malik, sentenced by a special National Investigation … [+1501 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "6 dead after Kanwar devotees hit by truck in UP’s Hathras", "description": "One pilgrim was injured and is receiving treatment at a hospital in Agra, the police said", "url": "https://indianexpress.com/article/cities/delhi/up-dead-kanwar-devotees-accident-8046642/", "urlToImage": "https://images.indianexpress.com/2022/07/kanwar-yatra-1.jpg", "publishedAt": "2022-07-23T03:29:41Z", "content": "At least six people died after seven devotees of the Kanwar Yatra were hit by a dumper truck in Uttar Pradeshs Hathras area early on Saturday, the police said.One pilgrim was injured and is receiving… [+815 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Shamshera box office collection day 1: Shows cancelled, Ranbir Kapoor’s comeback film tanks with lower opening than Samrat Prithviraj", "description": "Shamshera box office collection day 1: Ranbir Kapoor's much-publicised return to the big screen is tanking at the ticket windows, with reports of cancelled shows and an opening day figure lower than Samrat Prithviraj.", "url": "https://indianexpress.com/article/entertainment/bollywood/shamshera-box-office-collection-day-1-ranbir-kapoor-yrf-film-flop-8046649/", "urlToImage": "https://images.indianexpress.com/2022/07/ranbir-1200.jpg", "publishedAt": "2022-07-23T03:20:52Z", "content": "Ranbir Kapoor’s first film in four years, the big-budget masala entertainer Shamshera, is underperforming at the box office. The film has opened to around Rs 10 crore on the first day of release, whi… [+1746 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Bengaluru, Karnataka Live Updates: ‘Made enough in the name of Gandhis’: Karnataka Congress leader stirs row", "description": "Covid news from Bengaluru, Karnataka, Brain heath awareness initiative, Karnataka forests, CBSE Class 12 results, indian express latest Bengaluru news updates, Karnataka news updates, monsoon updates", "url": "https://indianexpress.com/article/cities/bangalore/bengaluru-karnataka-live-updates-congress-leader-stirs-row-covid-weather-bjp-politics-8046616/", "urlToImage": "https://images.indianexpress.com/2022/07/speaker.jpg", "publishedAt": "2022-07-23T02:57:19Z", "content": "Nikita Kiran likes to keep things simple and to the point. However, the 16-year-old girl is ready to face the complexity when it comes to exploring the technology space. A coder and a badminton playe… [+1689 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Monkeypox virus could become entrenched as new STD in the US", "description": "With monkeypox so rare in the US, many infected men — and their doctors — may have attributed their rashes to some other cause.", "url": "https://indianexpress.com/article/world/monkeypox-virus-could-become-entrenched-as-new-std-us-8046596/", "urlToImage": "https://images.indianexpress.com/2022/07/monkeypox-vaccine-1.jpg", "publishedAt": "2022-07-23T01:57:05Z", "content": "The spread of monkeypox in the US could represent the dawn of a new sexually transmitted disease, though some health officials say the virus that causes pimple-like bumps might yet be contained befor… [+5755 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manoj Kumar R", "title": "Soorarai Pottru, Jai Bhim, Vikram: Suriya is the new face of Tamil cinema’s bravery", "description": "As Suriya turns 47 today, we look at some of the bold career choices that the Soorarai Pottru star made in the last two years.", "url": "https://indianexpress.com/article/entertainment/opinion-entertainment/soorarai-pottru-jai-bhim-vikram-suriya-is-the-new-face-of-tamil-cinema-bravery-8046043/", "urlToImage": "https://images.indianexpress.com/2022/07/suriya-netflix-1.jpg", "publishedAt": "2022-07-23T01:41:00Z", "content": "Actor-producer Suriya, who turned 47 today, has sort of developed the Midas touch in the past two years. It seems everything that he touches is turning into gold. And it all began with Suriya braving… [+4976 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Udit Misra", "title": "As Congress marks bank nationalisation day, a look at the politics of its economics", "description": "Nationalising private banks is arguably the single most important economic decision by any Indian government, and yet it was a result of Congress's internal politics, not an article of faith per se", "url": "https://indianexpress.com/article/political-pulse/congress-bank-nationalisation-day-politics-economics-8046223/", "urlToImage": "https://images.indianexpress.com/2022/07/RBI-Reserve-Bank-Reuters-1200-1-4.jpg", "publishedAt": "2022-07-23T01:22:06Z", "content": "On July 19, the Congress hailed the 53rd anniversary of bank nationalisation in India, undertaken by then Prime Minister Indira Gandhi. While seeking to attack the Modi government over its proposal t… [+7422 chars]"}]}