{"status": "ok", "totalResults": 664, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "US faces a shortage of baby formula; find out what it is and why, when it is given", "description": "According to Dr Krishan Chugh of Fortis Memorial Research Institute, Gurugram, baby formula is a substitute to mother's milk, given when the mother cannot feed them", "url": "https://indianexpress.com/article/lifestyle/health/us-shortage-baby-formula-what-when-why-baby-formula-breast-milk-7911796/", "urlToImage": "https://images.indianexpress.com/2022/05/GettyImages-baby-formula-1200.jpg", "publishedAt": "2022-05-11T12:50:43Z", "content": "The US has been facing a shortage of baby formula and it has vexed parents. According to a CNN report, it has been months now that stores in the country are struggling to put the product on the shelv… [+2152 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "‘Lanka’s ex-PM and once strongman Mahinda Rajapaksa being protected at Trincomalee naval base’", "description": "Rajapaksa is facing calls for his arrest from Opposition politicians for inciting violence against peaceful anti-government protesters who were seeking his resignation for mismanaging the country's economy.", "url": "https://indianexpress.com/article/world/lanka-ex-pm-once-strongman-mahinda-rajapaksa-protected-trincomalee-naval-base-7911999/", "urlToImage": "https://images.indianexpress.com/2022/05/Lanka-1-2.jpg", "publishedAt": "2022-05-11T12:44:28Z", "content": "Sri Lanka’s ex-Prime Minister Mahinda Rajapaksa, who was evacuated from his Temple Trees official residence here, is being protected at the Trincomalee naval base, Defence Secretary Kamal Guneratne s… [+3500 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "I will continue to ask Kejriwal questions whether one or 1,000 cases are registered against me: Bagga", "description": "\"I will continue to ask Kejriwal questions whether one or 1,000 cases are registered against me,\" said Bagga at the Delhi BJP office.", "url": "https://indianexpress.com/article/cities/delhi/tajinder-bagga-arvind-kejriwal-aap-bjp-7912018/", "urlToImage": "https://images.indianexpress.com/2022/05/Bagga-6.jpg", "publishedAt": "2022-05-11T12:42:36Z", "content": "BJP leader Tajinder Pal Singh Bagga on Wednesday said he was arrested by the Punjab Police “like a terrorist” for asking AAP chief Arvind Kejriwal about his promises to act against the accused in the… [+2171 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sana Farzeen", "title": "Prince Narula: ‘After all that Munawar Faruqui has gone through, he deserves the Lock Upp victory’", "description": "Prince Narula talks about his short stint on Lock Upp, why he wanted Munawar Faruqui to win the show and his next project with ALTBalaji.", "url": "https://indianexpress.com/article/entertainment/web-series/prince-narula-after-all-that-munawar-faruqui-has-gone-through-he-deserves-the-lock-upp-victory-7911455/", "urlToImage": "https://images.indianexpress.com/2022/05/prince-narula-munawar-faruqui-lock-upp.jpg", "publishedAt": "2022-05-11T12:40:09Z", "content": "Reality show star Prince Narula is happy about Munawar Faruqui winning Lock Upp. Having been a part of the show as a ‘trouble maker’ for three weeks, the actor developed a close bond with the contest… [+1891 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pune: Parents booked for keeping 11-yr-old boy ‘confined’ with over 20 stray dogs", "description": "Pune News: Anuradha Sahasrabuddhe of Dnyan Devi Childline said, “We were told by the informer that the boy was kept confined in an apartment in Kondhwa. Local residents often saw the boy at the window of the apartment and he seemed to be mentally disturbed.", "url": "https://indianexpress.com/article/cities/pune/pune-parents-booked-for-keeping-11-yr-old-boy-confined-with-over-20-stray-dogs-7912001/", "urlToImage": "https://images.indianexpress.com/2022/05/IE-LOGO-1.jpg", "publishedAt": "2022-05-11T12:36:24Z", "content": "An FIR has been lodged against the parents of an 11-year-old boy for allegedly keeping the child confined in an apartment with 22 stray dogs. The case was registered with the Kondhwa police station u… [+2256 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "DU offline examination begins for second, third-year UG students", "description": "The Delhi University's School of Open Learning held exams for three papers on Wednesday morning. Examinations for 66 papers will be held in the evening and around 23,684 students are expected to appear, university's dean said.", "url": "https://indianexpress.com/article/education/du-offline-examination-begins-for-2nd-3rd-year-undergraduate-students-7911493/", "urlToImage": "https://images.indianexpress.com/2021/10/PTI10_20_2021_000118A.jpg", "publishedAt": "2022-05-11T12:35:00Z", "content": "The physical mode of examination for second and third-year undergraduate students at Delhi University began on Wednesday after a two-year gap due to the Covid pandemic. Over 29,500 students appeared … [+1613 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "Surprise gone wrong: Kids get scared of fake dinosaur at birthday party", "description": "The video has been viewed over two lakh times on Twitter.", "url": "https://indianexpress.com/article/trending/trending-globally/kids-get-scared-of-fake-dinosaur-at-birthday-party-7911993/", "urlToImage": "https://images.indianexpress.com/2022/05/fake-dinasaur-kids-birthday.jpeg", "publishedAt": "2022-05-11T12:34:54Z", "content": "One would assume that the presence of a dinosaur at a birthday party would be delightful for the kids, but this might not always be the case. A case in point is a now-viral video, which was made by a… [+3119 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "CUET 2022 FAQ: Application process, syllabus and more", "description": "Candidates are advised to contact their desired university for clarifications on age requirements, cutoffs and more.", "url": "https://indianexpress.com/article/education/cuet-2022-faq-application-process-syllabus-format-and-more-cuet-samarth-ac-in-7911790/", "urlToImage": "https://images.indianexpress.com/2022/05/CUET-2022-1.jpg", "publishedAt": "2022-05-11T12:34:40Z", "content": "As the deadline for registration of Common University Entrance Test (CUET) 2022 draws near, aspirants have several doubts regarding the newly-introduced entrance exam. To ease the confusion of aspira… [+8557 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "ED arrests Jharkhand IAS officer Pooja Singhal in money laundering case", "description": "The 2000-batch Indian Administrative Service (IAS) officer has been taken into ED custody under the relevant sections of the Prevention of Money Laundering Act (PMLA).", "url": "https://indianexpress.com/article/india/ed-arrests-jharkhand-ias-officer-pooja-singhal-in-money-laundering-case-officials-7912004/", "urlToImage": "https://images.indianexpress.com/2022/05/FSYHcTAaAAANIkP.png", "publishedAt": "2022-05-11T12:30:07Z", "content": "Jharkhand mining secretary Pooja Singhal was arrested by the ED on Wednesday after two consecutive days of grilling in a money-laundering probe linked to alleged embezzlement of MGNREGA funds in Khun… [+827 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Nandagopal Rajan", "title": "Sonos Five review: Purely for the purists", "description": "Is the Sonos Five worth your money at Rs 59,999? Find out in our full review below.", "url": "https://indianexpress.com/article/technology/tech-reviews/sonos-five-review-7911893/", "urlToImage": "https://images.indianexpress.com/2022/05/WhatsApp-Image-2022-05-11-at-5.40.15-PM2.jpeg", "publishedAt": "2022-05-11T12:27:46Z", "content": "There is no longer enough time in my life to enjoy music while not doing anything else. Yes, I still do listen to music, but thats when Im on the treadmill or driving somewhere, never as an activity … [+4101 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "GUJCET 2022: Final answer key released by GSEB; check details", "description": "Candidates can find the final answer key on the official GSEB website — gseb.org. Result for GUJCET 2022 will be released on may 12, 2022.", "url": "https://indianexpress.com/article/education/gujcet-2022-final-answer-key-released-by-gseb-check-details-gseb-org-7911986/", "urlToImage": "https://images.indianexpress.com/2022/05/GUJCET-2022.jpg", "publishedAt": "2022-05-11T12:27:12Z", "content": "The Gujarat Secondary and Higher Secondary Education Board (GSEB) has released the final answer key for the Gujarat Common Entrance Test (GUJCET) 2022 today. Candidates can find the final answer key … [+1248 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Decision on cabinet expansion in 3-4 days: Karnataka CM Basavaraj Bommai after meeting Amit Shah", "description": "In a meeting with Amit Shah, Chief Minister Basavaraj Bommai also informed the Union minister of the possibility of the state election commission announcing the dates for the local body polls on the basis of a Supreme Court order of May 10.", "url": "https://indianexpress.com/article/cities/bangalore/decision-cabinet-expansion-3-4-days-karnataka-cm-basavaraj-bommai-meeting-amit-shah-7911990/", "urlToImage": "https://images.indianexpress.com/2022/05/bommai-2.jpeg", "publishedAt": "2022-05-11T12:23:29Z", "content": "The BJP high command will take a decision on the changes to be made in the Karnataka cabinet in the next three to four days after assessing the political situation in the state, chief minister Basava… [+2840 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "Harsh Varrdhan Kapoor calls buying pre-owned Lamborghini ‘sad reality’ of his life, netizens react with memes", "description": "Harsh Varrdhan Kapoor in an recent interview said that he wants to live the luxurious life but it is difficult to afford that while doing 'arthouse films'.", "url": "https://indianexpress.com/article/trending/trending-in-india/harsh-varrdhan-kapoor-pre-owned-lamborghini-memes-7911554/", "urlToImage": "https://images.indianexpress.com/2022/05/harshavarrdhan-kapoor.jpg", "publishedAt": "2022-05-11T12:11:34Z", "content": "The nepotism debate in Bollywood is anything but ephemeral. And as star kids come out to talk about their “struggles”, the public has always come back with their own comments. Latest in the long exha… [+2709 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Taika Waititi calls Thor Love and Thunder a ‘midlife crisis film’, says Christian Bale is one of the ‘best villains’ in MCU", "description": "Director Taika Waititi said that Thor Love and Thunder is a much deeper film than Thor Ragnarok. The film releases in theatres on July 8.", "url": "https://indianexpress.com/article/entertainment/hollywood/taika-waititi-thor-love-and-thunder-midlife-crisis-christian-bale-best-villain-mcu-7911967/", "urlToImage": "https://images.indianexpress.com/2022/05/thor-4.jpg", "publishedAt": "2022-05-11T12:11:31Z", "content": "Thor: Ragnarok marked director Taika Waititi’s entry into the Marvel Cinematic Universe, and by all accounts, it was a fantastic debut. Waititi is now returning for Thor: Love and Thunder and in a re… [+1501 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Debraj Deb", "title": "In no-Opp Nagaland, a regional powerhouse further shrinks", "description": "21 MLAs of NPF, that has fought on Naga issue for nearly 60 years, merge with leading party in an alliance that holds BJP.", "url": "https://indianexpress.com/article/india/political-pulse/in-no-opp-nagaland-a-regional-powerhouse-further-shrinks-7911939/", "urlToImage": "https://images.indianexpress.com/2022/05/naga-people-front.jpg", "publishedAt": "2022-05-11T12:09:29Z", "content": "The defection of 21 of its MLAs recently marks the continuing shrinking of the powerful regional Naga People’s Front (NPF) in Nagaland, and the changing political landscape in the Northeast since the… [+5231 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "IPL 2022, RR vs DC Live Score Updates: Battle of Kul-Cha returns in season 15", "description": "IPL 2022  RR vs DC Live Cricket Score Streaming Online Today Match, Star Sports 1 Hindi, Hotstar IPL Live: Rajasthan Royals vs Delhi Capitals takes place in Mumbai.", "url": "https://indianexpress.com/article/sports/ipl/ipl-2022-rr-vs-dc-live-score-7911899/", "urlToImage": "https://images.indianexpress.com/2022/05/rr-vs-dc-live.jpg", "publishedAt": "2022-05-11T12:07:00Z", "content": "Delhi Capitals Squad: David Warner, Srikar Bharat, Mitchell Marsh, Rishabh Pant(w/c), Rovman Powell, Ripal Patel, Axar Patel, Shardul Thakur, Kuldeep Yadav, Anrich Nortje, Khaleel Ahmed, Mandeep Sing… [+622 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mumbai police arrest UP constable for link to gang smuggling drugs worth Rs 1.69 cr", "description": "Mumbai News: Police constable Amit Kumar Singh, 32, was posted at Hapur Police Line in Hapur, Uttar Pradesh, and had been a part of the police force since 2011.", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-police-arrest-up-constable-for-link-to-gang-smuggling-drugs-worth-rs-1-69-cr-7911956/", "urlToImage": "https://images.indianexpress.com/2022/05/ARREST-9.jpg", "publishedAt": "2022-05-11T12:02:24Z", "content": "The Mumbai police recently arrested a constable from the Uttar Pradesh police force for allegedly being a part of a gang that smuggled double tiger heroin worth Rs 1.67 crore and mephedrone (MD) drug… [+1210 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Hilary Duff has made peace with her body: ‘I’m proud that it’s produced three children for me’", "description": "The actor recently opened up about body image issues and suffering from an eating disorder", "url": "https://indianexpress.com/article/lifestyle/life-style/hilary-duff-body-image-body-positive-three-children-7911370/", "urlToImage": "https://images.indianexpress.com/2022/05/Hilary-Duff-1200.jpg", "publishedAt": "2022-05-11T12:00:44Z", "content": "Hilary Duff is proud of her body and she is not holding back from sharing her thoughts.The 34-year-old opened up about body image issues and suffering from an eating disorder during an interview with… [+2118 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Explained Desk", "title": "What is tomato flu? Who does it affect?", "description": "About Tomato flu: A team of revenue, health and police officials have been deployed at the Walayar checkpost located on the Tamil Nadu-Kerala border to screen people coming from the neighbouring state.", "url": "https://indianexpress.com/article/explained/what-is-tomato-flu-who-does-it-affect-7911890/", "urlToImage": "https://images.indianexpress.com/2022/05/tomato-1.jpg", "publishedAt": "2022-05-11T11:51:33Z", "content": "Tamil Nadu has ramped up surveillance at its borders in the wake of “tomato flu” cases being detected in Kerala. The flu that gets its name because of the red blister it causes, has raised concern in… [+2378 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Prashant Kishor: Not winning or losing only due to polarisation… Has Opp persisted with any cause", "description": "Speaking at Express Adda, Prashant Kishor also said that for the next 20-30 years at least, Indian politics would revolve around the BJP, and that he does not share the assessment that the BJP will dwindle on its own.", "url": "https://indianexpress.com/article/india/political-pulse/polarisation-prashant-kishor-bjp-congress-express-adda-7911842/", "urlToImage": "https://images.indianexpress.com/2022/05/prashant-kishor-1200.jpg", "publishedAt": "2022-05-11T11:51:28Z", "content": "Arguing that the role played by polarisation in elections is much overhyped, than what is actually on the ground, election strategist Prashant Kishor said that for every Hindu who is impressed with t… [+6168 chars]"}]}