{"status": "ok", "totalResults": 529, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Marin Cilic’s 33 aces put him in 1st French Open semi at age 33", "description": "Cilic was the runner-up to Federer at Wimbledon in 2017 and the Australian Open in 2018; the latter had been Cilic's most recent trip to a Slam semifinal.", "url": "https://indianexpress.com/article/sports/tennis/marin-cilics-33-aces-put-him-in-1st-french-open-semi-at-age-33/", "urlToImage": "https://images.indianexpress.com/2022/06/Untitled-design-18.jpg", "publishedAt": "2022-06-02T06:51:32Z", "content": "Marin Cilic is 33, nearly eight seasons past his one Grand Slam title at the 2014 U.S. Open and, more than four full years removed from his most recent trip to the semifinals of a major tournament.If… [+3970 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Police constable paper leak case: DGP claims paper leaked by printing press employee", "description": "The police said that 121 people have been arrested in the police constable paper leak case so far, of which 85 were candidates and going to take the tests, three were parents of candidates and 33 were agents.", "url": "https://indianexpress.com/article/cities/chandigarh/police-constable-paper-leak-case-dgp-claims-paper-leaked-by-printing-press-employee-7948792/", "urlToImage": "https://images.indianexpress.com/2022/06/Exam.jpg", "publishedAt": "2022-06-02T06:51:30Z", "content": "The Special Investigation Team (SIT) working on the police constable recruitment paper leak case has claimed that a part-time employee – Sudhir Yadav of Akbarpur district of Bihar – of a printing pre… [+1495 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Bengal wins SKOCH ‘Ease of Doing Business’ Award", "description": "According to the SKOCH state of governance report 2021, West Bengal has topped nationally in the 'Ease of Doing Business', as a part of several initiatives by the government.", "url": "https://indianexpress.com/article/business/bengal-skoch-ease-of-doing-business-award-7948547/", "urlToImage": "https://images.indianexpress.com/2022/06/mamata-759-1-1-1.jpg", "publishedAt": "2022-06-02T06:44:30Z", "content": "The West Bengal government has bagged the SKOCH award for ‘ease of doing business’, Chief Minister Mamata Banerjee has said.She said the state was chosen for the honours because of several initiative… [+925 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sweety Kumari", "title": "Bengal BJP ministers, leaders under CID lens over ‘irregularities in recruitments’ at AIIMS Kalyani", "description": "The FIR, based on a complaint filed by one Sariful Islam on May 20, names four BJP leaders, including Minister of State Education Subhas Sarkar and MP Jagannath Sarkar.", "url": "https://indianexpress.com/article/cities/kolkata/bengal-bjp-ministers-leaders-under-cid-lens-over-irregularities-in-recruitments-at-aiims-kalyani-7948780/", "urlToImage": "https://images.indianexpress.com/2022/06/aiims.jpeg", "publishedAt": "2022-06-02T06:39:59Z", "content": "The Crime Investigation Department (CID) has initiated investigations after a First Information Report (FIR) was filed against alleged irregularities in the recruitments at AIIMS Kalyani in West Beng… [+1374 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Shah Rukh Khan uses umbrella as a shield as paps chase after actor: ‘Khan sahab…’", "description": "While paps came chasing after Shah Rukh Khan to get his picture, shouting 'Khan sahab, Khan sahab,' Shah Rukh just walked away with half a smile using his dark umbrella as some kind of shield.", "url": "https://indianexpress.com/article/entertainment/bollywood/shah-rukh-khan-tries-avoiding-paps-video-7948611/", "urlToImage": "https://images.indianexpress.com/2022/06/srk1200.jpg", "publishedAt": "2022-06-02T06:34:44Z", "content": "Bollywood superstar Shah Rukh Khan has been trying his best to avoid the paparazzi lately, especially since son Aryan Khan’s name came up in last year’s infamous cruise drug bust case. On Wednesday, … [+1181 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Award-winning ‘Goshta Arjunchi’, ‘Goshta Abhi-Anuchi’ to feature in Pune short film festival on June 5", "description": "The movies are part of a six-part youth-centric short film series. Hamid Dabholkar's NGO Parivartan Trust collaborated with Rakhadi Studio last year to launch the short film series.", "url": "https://indianexpress.com/article/cities/pune/pune-short-film-festival-award-goshta-arjunchi-goshta-abhi-anuchi-to-feature-june-5-7948745/", "urlToImage": "https://images.indianexpress.com/2022/06/IMG-20220531-WA0057-horz.jpg", "publishedAt": "2022-06-02T06:31:55Z", "content": "Two movies`Goshta Arjunchi’ and `Goshta Abhi-Anuchi’ from a six-part youth-centric series of short films in Marathi will be screened at the 12th Pune short film festival on June 5.The films are part … [+2312 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Monkeypox spread no reason to shun pride parades: World Health Organization", "description": "\"Most of these events - the official events - are outdoors, they're family friendly. We don't see any real reason to be concerned about the enhanced likelihood of transmission in those contexts.\"", "url": "https://indianexpress.com/article/lifestyle/health/monkeypox-spread-no-reason-to-shun-pride-parades-world-health-organization-lgbtq-month-june-7948596/", "urlToImage": "https://images.indianexpress.com/2022/06/POLAND-LGBTQ-MARCH.jpg", "publishedAt": "2022-06-02T06:30:17Z", "content": "An unusual spread of monkeypox does not mean people should shun LGBTQ+ pride parades this summer, a World Health Organization expert said on Monday, adding that it was important to show support.Limit… [+1618 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "Olive Ridley turtles venture into the sea after hatching. Watch video", "description": "Netizens were delighted to watch the endangered species of sea turtles venturing into the sea in unison.", "url": "https://indianexpress.com/article/trending/trending-in-india/olive-ridley-turtles-venture-into-the-sea-after-hatching-7948748/", "urlToImage": "https://images.indianexpress.com/2022/06/Trending-Card-01.jpg", "publishedAt": "2022-06-02T06:27:58Z", "content": "Odisha’s Rushikulya beach has witnessed mass hatching of Olive Ridley turtlesas hundreds of hatchlings came out of the nests buried in the sand to crawl towards the sea.A clip shared by ANI showed a … [+2080 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mumbai Police to continue probe against BJP leader even after bank withdraws plaint", "description": "After the police registered a first information report (FIR), Mohit Kamboj tweeted Wednesday a letter which was purportedly written by the complainant in the case to the joint commissioner of police (EOW).", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-police-to-continue-probe-against-bjp-leader-even-after-bank-withdraws-plaint-7948744/", "urlToImage": "https://images.indianexpress.com/2022/06/mohit-kamboj-1-2.jpeg", "publishedAt": "2022-06-02T06:26:05Z", "content": "After the police registered a first information report (FIR), Kamboj tweeted Wednesday a letter which was purportedly written by the complainant in the case to the joint commissioner of police (EOW).… [+1178 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Norway chess: Anand posts second straight win in Classical event, takes lead", "description": "The 52-year-old Anand trumped his opponent in 36 moves in the battle of the veterans to make it two out of two after the second round late on Wednesday.", "url": "https://indianexpress.com/article/sports/chess/norway-chess-anand-posts-second-straight-win-in-classical-event-takes-lead-7948732/", "urlToImage": "https://images.indianexpress.com/2022/06/Untitled-design-17.jpg", "publishedAt": "2022-06-02T06:24:11Z", "content": "Indian Grandmaster Viswanathan Anand posted his second win on the trot, defeating Bulgarian Veselin Topalov in the Classical section to take the lead at the Norway Chess tournament here.The 52-year-o… [+1455 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Abhinav Rajput", "title": "Continuity vs neglect: AAP, BJP’s narrative battle shapes Delhi bypoll contest", "description": "AAP banking on Arvind Kejriwal’s popularity to see it through in Rajinder Nagar, BJP hoping for local resentment against ruling party.", "url": "https://indianexpress.com/article/india/political-pulse/delhi-rajinder-nagar-bypoll-aap-bjp-7948718/", "urlToImage": "https://images.indianexpress.com/2022/06/durgesh-pathak.jpg", "publishedAt": "2022-06-02T06:22:09Z", "content": "Major elections in Delhi since 2014 have thrown up clear winners, with the BJP winning all seven Lok Sabha seats in the last two general elections and the Aam Aadmi Party (AAP) sweeping the last two … [+4209 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "On Telangana Formation Day, KCR hits out at Modi govt’s ‘strong Centre-weak states doctrine’", "description": "In a nearly hour-long speech, CM K Chandrasekhar Rao also elaborated on his government’s reforms-filled progress card while underlining an alleged conspiracy to wreck the financial condition of states.", "url": "https://indianexpress.com/article/cities/hyderabad/telangana-formation-day-kcr-hits-out-at-modi-govt-federalism-7948722/", "urlToImage": "https://images.indianexpress.com/2022/06/KCR-1.jpg", "publishedAt": "2022-06-02T06:18:39Z", "content": "Marking the eighth anniversary of state formation on Thursday, Telangana Chief Minister K Chandrasekhar Rao took the opportunity to lash out at the Centre for its discrimination towards the youngest … [+4066 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "DGCA fines Vistara Rs 10 lakh for letting improperly trained pilot land flight in Indore", "description": "DGCA fines Vistara: A first officer has to be first trained to land an aircraft in a simulator before he or she can land a plane with passengers on board.", "url": "https://indianexpress.com/article/business/aviation/dgca-fines-vistara-rs-10-lakh-for-letting-improperly-trained-pilot-land-flight-in-indore-7948708/", "urlToImage": "https://images.indianexpress.com/2022/06/vistara-1200.jpg", "publishedAt": "2022-06-02T06:15:05Z", "content": "Aviation regulator DGCA has imposed a fine of Rs 10 lakh on Vistara for letting an improperly trained pilot land an aircraft with passengers on board at the Indore airport, officials said on Thursday… [+957 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Bank employee from Rajasthan shot dead in Kashmir’s Kulgam", "description": "The employee of the Ellaqui Dehati Bank, Vijay Kumar was shot inside the bank premises, the officials said.", "url": "https://indianexpress.com/article/cities/jammu/jk-bank-employee-shot-dead-in-kulgam-7948729/", "urlToImage": "https://images.indianexpress.com/2022/06/Indian-express-logo-2.jpg", "publishedAt": "2022-06-02T06:14:08Z", "content": "A bank employee from Rajasthan was shot dead on Thursday by militants in Kulgam district of Jammu and Kashmir, officials said.The employee of the Ellaqui Dehati Bank, Vijay Kumar was shot inside the … [+389 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "India weighs appeal panel against social media takedowns", "description": "The Information Technology Ministry is considering whether to set up an appeals panel to reverse the content moderation decisions of social media firms like Facebook, Twitter, and YouTube.", "url": "https://indianexpress.com/article/technology/it-ministry-appeal-panel-against-social-media-7948651/", "urlToImage": "https://images.indianexpress.com/2022/06/social-media-1.jpg", "publishedAt": "2022-06-02T06:08:39Z", "content": "India is considering whether to set up an appeals panel with the power to reverse the content moderation decisions of social media firms, the Information Technology Ministry said, in what would be th… [+881 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shubhajit Roy", "title": "In a first since Taliban took over Afghanistan, Indian team in Kabul to hold talks", "description": "J P Singh, who is the Joint Secretary in-charge of Pakistan, Afghanistan and Iran, is the official leading the team. He has met Taliban officials in Doha in the past as well.", "url": "https://indianexpress.com/article/india/taliban-afghanistan-indian-team-in-kabul-7948678/", "urlToImage": "https://images.indianexpress.com/2022/06/Kabul.jpg", "publishedAt": "2022-06-02T06:02:10Z", "content": "In the first official visit to Kabul after the Taliban took over the country in August last year, a team led by a senior official from the Union Ministry of External Affairs is in the Afghan capital.… [+2367 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Bloomberg", "title": "Sheryl Sandberg is leaving Facebook at a perilous moment: Parmy Olson", "description": "Sheryl Sandberg could be leaving behind a contentious legacy after helping grow the social media company into the behemoth it is today.", "url": "https://indianexpress.com/article/technology/opinion-technology/sheryl-sandberg-is-leaving-facebook-at-a-perilous-moment-parmy-olson-7948675/", "urlToImage": "https://images.indianexpress.com/2022/06/Sheryl-sandberg-leaving-Meta-Facebook-COO-featured-opinion.jpg", "publishedAt": "2022-06-02T06:00:50Z", "content": "Sheryl Sandberg, the chief operating officer of Meta Platforms Inc., is resigning after 14 years of running the company alongside Mark Zuckerberg. It was time to write the next chapter of my life, sh… [+5376 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "‘Jugjugg Jeeyo’ promotions: Kiara Advani sets summer style goals", "description": "Styled by Lakshmi Lehr, she accessorised with blue drop earrings that perfectly complemented the vibrant look.", "url": "https://indianexpress.com/article/lifestyle/fashion/kiara-advani-jugjugg-jeeyo-promotions-latest-look-fashion-7942228/", "urlToImage": "https://images.indianexpress.com/2022/05/Kiara-1200-1.jpg", "publishedAt": "2022-06-02T06:00:27Z", "content": "Kiara Advani’s style is always on point. From ethnic ensembles to chic contemporary looks, the actor keeps it versatile and doesn’t shy away from experimenting with her sartorial picks. And now, afte… [+1311 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Petrol and diesel prices on June 2: Check fuel rates in your city today", "description": "Petrol and Diesel price today in Delhi, Mumbai, Kolkata, Chennai, Bengaluru, Hyderabad, Jaipur: Petrol price in Delhi stands at Rs 96.72 per litre while diesel is available for Rs 89.62. In Mumbai, petrol is retailing at Rs 111.35, while diesel costs Rs 97.28…", "url": "https://indianexpress.com/article/business/market/petrol-diesel-price-today-june-2-check-latest-fuel-rates-7948548/", "urlToImage": "https://images.indianexpress.com/2022/04/petrol-diesel-price-reuters-1200.jpg", "publishedAt": "2022-06-02T05:57:19Z", "content": "Petrol Diesel Price Today: Prices of petrol and diesel remained steady for the 11th consecutive day across the country on Thursday, June 2, 2022.The price of petrol in Delhi stands at Rs 96.72 per li… [+2220 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Centre will arrest Manish Sisodia next… appeal to PM Modi to jail all of us together: Arvind Kejriwal", "description": "\"By putting people like Satyendar Jain and Manish Sisodia behind bars in false cases, they (Centre) want to stop the good work that they are doing in the fields of health and education,” Delhi CM Arvind Kejriwal.", "url": "https://indianexpress.com/article/cities/delhi/arvind-kejriwal-satyendar-jain-arrest-manish-sisodia-delhi-7948668/", "urlToImage": "https://images.indianexpress.com/2022/06/ch1625729.jpg", "publishedAt": "2022-06-02T05:54:15Z", "content": "Delhi Chief Minister Arvind Kejriwal Thursday said that the sources who had informed him of Satyendar Jains arrest a few months ago have told him that the Central government will arrest Manish Sisodi… [+1080 chars]"}]}