{"status": "ok", "totalResults": 373, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Nitin Sharma", "title": "‘Whichever era or format, key is to be consistent and be better player’: Former Indian cricket Syed Kirmani", "description": "\"Every era comes to an end and it happened with the West Indies cricket team, followed by the rise of the Indian team in the 1980’s — including the 1983 Cricket World Cup. Then we saw the dominance of the Australian team and players like Ricky Ponting showed …", "url": "https://indianexpress.com/article/sports/cricket/indian-cricketer-syed-kirmani-test-matches-wicket-keeper-odi-world-cup-1983-7905009/", "urlToImage": "https://images.indianexpress.com/2022/05/SYED-KIRMANI.jpg", "publishedAt": "2022-05-07T00:48:19Z", "content": "Dressed up in a Pathani suit and a waist coat, 72-year-old former Indian cricketer Syed Kirmani looked dashing as he attended a function in Chandigarh on Friday. The former Indian wicket-keeper, who … [+4254 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Chandigarh police reshuffle: 26 officers, including 5 DSPs, transferred", "description": "The reshuffling, though on the cards since the visit of Union Home Minister, Amit Shah, on March 27, kept getting delayed  due to various reasons.", "url": "https://indianexpress.com/article/cities/chandigarh/chandigarh-police-reshuffle-26-officers-including-5-dsps-transferred-7905006/", "urlToImage": "https://images.indianexpress.com/2022/05/chandigarh-police.jpg", "publishedAt": "2022-05-07T00:39:31Z", "content": "The Chandigarh Police on Friday effected a major reshuffle in its ranks, in which 26 police officers, including 5 Deputy Superintendents of Police (DSPs), 19 police inspectors, including 8 station ho… [+2073 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Parul", "title": "‘Technology can never compensate for commitment’: PGI’s new director", "description": "Prof Lal, who is also heading the Department of Neurology at PGI, did his MBBS (1985) from Guru Nanak Dev University, Amritsar, and MD (1990) and DM Neurology (1993) from PGI, Chandigarh.", "url": "https://indianexpress.com/article/cities/chandigarh/technology-can-never-compensate-for-commitment-pgi-director-7905003/", "urlToImage": "https://images.indianexpress.com/2022/05/pgi.jpg", "publishedAt": "2022-05-07T00:32:00Z", "content": "THE faith of people in PGI is so high that we have to keep pace with it. This is my first thought, as I take over a new role in an institute of which I have been a part for the past 35 years. It is a… [+3642 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aditi Raja", "title": "Faculty: Syndicate member led mob to art exhibition", "description": "Jain had, in 2007, protested against the art installations of Masters' student Chandramohan depicting Jesus Christ and Goddess Durga at an annual evaluation exhibition.", "url": "https://indianexpress.com/article/cities/baroda/faculty-syndicate-member-led-mob-to-art-exhibition-7904995/", "urlToImage": "https://images.indianexpress.com/2022/05/Guj-2-1.jpg", "publishedAt": "2022-05-06T23:36:54Z", "content": "A day after a group  of people created ruckus at an art exhibition at MS University alleging “objectionable” artworks on display, Associate Professor Indrapramit Roy from the Painting Department said… [+1134 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Peter Vidal", "title": "Horoscope Today, May 7, 2022: Libra, Aries, Pisces and other signs — check astrological prediction", "description": "Aquarius-- There is no earthly reason why you should be the one to fork out when other people are short of cash. Still, seeing as this is an extravagant moment, you may as well spend money where it's needed.", "url": "https://indianexpress.com/article/horoscope/horoscope-today-may-7-2022-libra-aries-pisces-and-other-signs-check-astrological-prediction-7904912/", "urlToImage": "https://images.indianexpress.com/2022/04/HORO33-1-1-1-1-1.jpeg", "publishedAt": "2022-05-06T23:30:51Z", "content": "Whats on the cards today for you? Aries, you’re liable to shy away from social engagements or emotional risks. Leo, much the same advice applies today as yesterday – relax and indulge yourself. Read … [+3726 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Bashaarat Masood", "title": "Pahalgam: Top Hizb man among 3 militants killed", "description": "They termed the killing of one of the most wanted militant commanders “on the [Amarnath] yatra route” as a major success. “Ashraf Molvi along with two other terrorists killed.", "url": "https://indianexpress.com/article/cities/srinagar/pahalgam-top-hizb-man-among-3-militants-killed-7904992/", "urlToImage": "https://images.indianexpress.com/2022/05/army-1.jpeg", "publishedAt": "2022-05-06T23:30:05Z", "content": "A TOP Hizbul Mujahideen militant commander was among three militants killed in a gunfight with security forces in south Kashmir on Friday.Police said Mohammad Ashraf Khan alias Ashraf Molvi, one of t… [+1188 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Esha Roy", "title": "Underage marriages down overall: NFHS-5", "description": "Working women more likely to use modern contraception: Survey", "url": "https://indianexpress.com/article/india/underage-marriages-down-overall-nfhs-5-7904989/", "urlToImage": "https://images.indianexpress.com/2022/05/Mandaviya-1.jpg", "publishedAt": "2022-05-06T23:21:50Z", "content": "While the national average of underage marriages has come down, the rate has increased in Punjab, West Bengal, Manipur, Tripura and Assam, according to the fifth round of National Family Health Surve… [+1859 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manish Sahu", "title": "Kidnapping, rape of minor: ‘Evidence’ collected against accused cop", "description": "Police sources said the victim identified a room at a police station where she was allegedly taken and sexually assaulted by the then SHO.", "url": "https://indianexpress.com/article/cities/lucknow/kidnapping-rape-of-minor-evidence-collected-against-accused-cop-7904985/", "urlToImage": "https://images.indianexpress.com/2022/05/express-5.jpg", "publishedAt": "2022-05-06T23:14:04Z", "content": "LALITPUR police on Friday said they have collected concrete evidence of assault on a minor Dalit girl by an SHO and other accused. Police sources said the victim identified a room at a police station… [+1634 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shubhangi Khapre, Sadaf Modak", "title": "Sharad Pawar ping pong and politics of Bhima Koregaon violence probe", "description": "In 2018, less that 48 hours after the violence breaking out under the BJP government, Pawar had called it the handiwork of “outsiders”, and said he had learnt from some locals that it could be the work of right-wing leaders.", "url": "https://indianexpress.com/article/cities/mumbai/sharad-pawar-ping-pong-and-politics-of-bhima-koregaon-violence-probe-7904960/", "urlToImage": "https://images.indianexpress.com/2022/05/sharad-pawar.jpg", "publishedAt": "2022-05-06T23:09:47Z", "content": "CONTINUING his flip-flops on the matter of the Bhima Koregaon violence, NCP chief Sharad Pawar Thursday steered clear of making any specific allegations against Hindutva leaders Milind Ekbote and Sam… [+4169 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Jahangirpuri demolition: Experts write to Kejriwal", "description": "The Street Vendors Act, 2014 requires civic authorities to survey street vendors and provide them with licences and allot sites, it notes.", "url": "https://indianexpress.com/article/cities/delhi/jahangirpuri-demolition-experts-write-to-kejriwal-7904983/", "urlToImage": "https://images.indianexpress.com/2022/05/arvind-kejriwal.jpg", "publishedAt": "2022-05-06T23:06:55Z", "content": "Several academics, policy advisors and civil society practitioners have written to Chief Minister Arvind Kejriwal on the demolitions that took place at Jahangirpuri last month, asking him to compensa… [+1340 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sweety Kumari", "title": "Party worker had escaped after polls fearing TMC reprisal: BJP", "description": "Lawyer and BJP state secretary Priyanka Tibrewal said nearly 70 party workers, including Arjun Chowrasia, from Cossipore were forced to leave the area after the polls.", "url": "https://indianexpress.com/article/cities/kolkata/party-worker-had-escaped-after-polls-fearing-tmc-reprisal-bjp-7904979/", "urlToImage": "https://images.indianexpress.com/2021/09/Priyanka-Tibrewal-1.jpg", "publishedAt": "2022-05-06T23:02:28Z", "content": "A 26-year-old party worker, who was found hanging in an abandoned building near his house in Cossipore area of Kolkata on Friday, had fled from the area after the Trinamool Congress (TMC) victory in … [+2729 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Serivce", "title": "‘Shah a political tourist, tarnishing state’s image’: Trinamool hits back", "description": "Calling Amit Shah “a political tourist in Bengal”, they said he was trying to sully the image of the state by lying about the incident and politicising it.", "url": "https://indianexpress.com/article/cities/kolkata/shah-a-political-tourist-tarnishing-states-image-trinamool-hits-back-7904978/", "urlToImage": "https://images.indianexpress.com/2022/05/aMIT-SHAH-14-2.jpg", "publishedAt": "2022-05-06T22:55:47Z", "content": "The ruling Trinamool Congress on Friday came down heavily on Union Home Minister Amit Shah over his labelling the death of Arjun Chowrasiya, a BJP worker who was found dead in North Kolkata on Friday… [+2082 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "At thermal power plants running on imported coal, govt orders full capacity", "description": "The order noted that about 7,600 MW of the 17,600 MW of imported coal-based thermal power capacity in the country was not operating as states have not been able to reach agreements with thermal plants on the pass-through of the higher price of imported coal.", "url": "https://indianexpress.com/article/business/commodities/at-thermal-power-plants-running-on-imported-coal-govt-orders-full-capacity-7904922/", "urlToImage": "https://images.indianexpress.com/2022/05/thermal-plant.jpg", "publishedAt": "2022-05-06T22:50:55Z", "content": "The power ministry has directed all imported coal-based thermal power plants to operate at full capacity amid the ongoing power crisis, which has seen power cuts across a number of states due to low … [+1556 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "Underdone idea", "description": "If a robot can make every plate of food perfect in taste, what will be left for human beings to argue about?", "url": "https://indianexpress.com/article/opinion/editorials/robot-make-food-what-will-be-left-for-human-beings-to-argue-about-7904856/", "urlToImage": "https://images.indianexpress.com/2022/05/editorial-1.jpeg", "publishedAt": "2022-05-06T22:48:17Z", "content": "After being made to perform open-heart surgery, assemble cars, build houses, steer traffic, clean up messes and mind babies and pets, robots will now be made to taste food. The scientists at Cambridg… [+1581 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Serivce", "title": "Need to fight politically, Amit Shah tells BJP leaders at meeting", "description": "On a two-day visit to West Bengal, Shah is learnt to have told his party leaders that a democratically elected government cannot be overthrown in this way and the political battle has to be fought “politically”, a senior party leader told The Indian Express o…", "url": "https://indianexpress.com/article/cities/kolkata/need-to-fight-politically-shah-tells-bjp-leaders-at-meeting-7904971/", "urlToImage": "https://images.indianexpress.com/2022/05/1-84.jpg", "publishedAt": "2022-05-06T22:48:16Z", "content": "Union Home Minister Amit Shah on Friday ruled out the possibility of imposing Article 356 in West Bengal during a meeting with BJP leaders from the state, sources said.On a two-day visit to West Beng… [+2592 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sreenivas Janyala", "title": "Hyderabad Killing over interfaith marriage: He sold chain to take wife Eid shopping", "description": "On Friday, the Hyderabad Police said the two main accused — Ashrin's brother Mubin Ahmed Syed and another relative M Masood Ahmed — have been arrested.", "url": "https://indianexpress.com/article/cities/hyderabad/hyderabad-killing-over-interfaith-marriage-he-sold-chain-to-take-wife-eid-shopping-7904958/", "urlToImage": "https://images.indianexpress.com/2022/05/marriage-killing.jpg", "publishedAt": "2022-05-06T22:43:47Z", "content": "B Nagaraju, 25, who was stabbed to death at a busy crossing in Hyderabad Wednesday night over his marriage to a Muslim woman, had sold his gold chain to take his wife, Ashrin Sultana Syed, Eid shoppi… [+2604 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "No picture postcard", "description": "J&K delimitation report raises more questions than it answers. Next step, elections, must come sooner rather than later", "url": "https://indianexpress.com/article/opinion/editorials/jk-delimitation-report-raises-more-questions-than-it-answers-7904847/", "urlToImage": "https://images.indianexpress.com/2022/05/editorial.jpeg", "publishedAt": "2022-05-06T22:42:50Z", "content": "The final award of the Jammu and Kashmir Delimitation Commission has not laid to rest the concerns that dogged its work. The J&amp;K Reorganisation Act 2019, which is itself sub judice, provides new … [+2406 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Jagpreet Singh Sandhu, Sofi Ahsan, Pavneet Singh Chadha", "title": "Punjab tells HC its officers held; Haryana, Delhi deny", "description": "As a Punjab Police team took Bagga away, and his father filed a complaint at the Janakpuri police station alleging he had been abducted, the Delhi Police filed an FIR and its inspector Antariksh approached the Dwarka court for a search warrant.", "url": "https://indianexpress.com/article/india/punjab-tells-hc-its-officers-held-haryana-delhi-deny-7904966/", "urlToImage": "https://images.indianexpress.com/2022/05/bagga-1200-1.jpg", "publishedAt": "2022-05-06T22:34:26Z", "content": "The drama involving Delhi BJP leader Tajinder Pal Singh Bagga played out not just on the highway but also inside two courtrooms one in Chandigarh and the other in Dwarka in Delhi.As a Punjab Police t… [+6753 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Nitin Gadkari: Pune has potential to become the hub for automobile manufacturing", "description": "The Union minister said GST revenue from automobile sector is the highest. “The Rs 50,000-crore turnover comes from ancillary units in the automobile sector. Pune has the best environment for becoming an automobile hub as major manufacturing units are located…", "url": "https://indianexpress.com/article/cities/pune/nitin-gadkari-pune-has-potential-to-become-the-hub-for-automobile-manufacturing-7904969/", "urlToImage": "https://images.indianexpress.com/2022/04/Gadkari-1.jpg", "publishedAt": "2022-05-06T22:32:49Z", "content": "Pune should be made an automobile-manufacturing hub as it has lot of potential in the field, Union Minister for Transport and Highways Nitin Gadkari said on Friday. He also promised to take up the is… [+4170 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Covid-19 vaccine designed for oral use protects against disease and transmission, study finds", "description": "The study, led by Duke University researcher Stephanie N Langel, PhD, medical instructor in the Department of Surgery, have been published in the journal Science Translational Medicine.", "url": "https://indianexpress.com/article/explained/covid-vaccine-oral-use-disease-transmission-protection-explained-7904865/", "urlToImage": "https://images.indianexpress.com/2021/12/paxlovid.jpg", "publishedAt": "2022-05-06T22:30:05Z", "content": "An investigational Covid vaccine designed to be taken orally has been found not only to protect the host, but also to decrease the airborne spread of the virus to other close contacts. The vaccine wa… [+2883 chars]"}]}