{"status": "ok", "totalResults": 616, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Supreme Court to hear Gyanvapi case on Friday, asks Varanasi court to not take any further action in the matter", "description": "On May 17, the SC while declining to stay proceedings before a Varanasi court on matters related to the Kashi Vishwanath temple-Gyanvapi mosque complex, had asked the Varanasi district magistrate to secure the area where a Shivling was claimed to have been fo…", "url": "https://indianexpress.com/article/india/supreme-court-gyanvapi-mosque-case-varanasi-court-7925347/", "urlToImage": "https://images.indianexpress.com/2022/05/Gyanvapi-Mosque-4.jpg", "publishedAt": "2022-05-19T06:47:17Z", "content": "The Supreme Court on Thursday agreed to a request to adjourn the hearing on the plea challenging the orders of a Varanasi court in the Gyanvapi dispute till Friday and asked the Varanasi court before… [+2071 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi: 15-year-old boy stabbed outside school by unknown men", "description": "The police said the accused attacked the class 12 student with knives and belts when he was coming out of the school after writing an exam.", "url": "https://indianexpress.com/article/cities/delhi/delhi-sultanpuri-boy-stabbed-7925350/", "urlToImage": "https://images.indianexpress.com/2022/05/sultanpuri-1200.jpg", "publishedAt": "2022-05-19T06:46:02Z", "content": "A 15-year-old boy was allegedly stabbed and assaulted by a group of unknown men outside a school in Outer Delhis Sultanpuri Wednesday afternoon. The police said the accused attacked the class 12 stud… [+995 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Aishwarya Rai on not having a release since 2018: ‘I’ve been a proverbial tortoise since the start of my career’", "description": "Aishwarya Rai spoke about why she doesn't appear regularly in films, and why she has never been one to give in to industry perception.", "url": "https://indianexpress.com/article/entertainment/bollywood/aishwarya-rai-at-cannes-2022-7925314/", "urlToImage": "https://images.indianexpress.com/2022/05/Aishwarya-1200-AP.jpg", "publishedAt": "2022-05-19T06:44:04Z", "content": "Actor Aishwarya Rai Bachchan has been a fixture at the Cannes Film Festival for over 20 years, and she walked the red carpet once again on Wednesday, at the festival’s 75th edition. In an interview o… [+1536 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "China relaxes some Covid test rules for US, other travellers", "description": "From Friday, travellers from the United States will no longer need an RT-PCR test seven days before flying, according to notices from the Chinese embassy and consulates in the United States. Requirements for antibody tests have also been scrapped.", "url": "https://indianexpress.com/article/world/china-covid-test-rules-us-7925326/", "urlToImage": "https://images.indianexpress.com/2022/05/HONG-kong_ap_12001.jpg", "publishedAt": "2022-05-19T06:42:07Z", "content": "China has removed some Covid-19 test requirements for people flying in from countries such as the United States and shortened the pre-departure quarantine for some inbound travellers, as it fine-tune… [+1598 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "‘Quniton de Kock knew he would make it count the day he got going’", "description": "Lucknow Super Giants assistant coach Vijay Dahiya cited the possible reason behind the charged-up celebration by the South African opener.", "url": "https://indianexpress.com/article/sports/ipl/quniton-de-kock-knew-he-would-make-it-count-the-day-he-got-going-7925309/", "urlToImage": "https://images.indianexpress.com/2022/05/Quniton-de-Kock-ipl.jpg", "publishedAt": "2022-05-19T06:39:52Z", "content": "A bit of frustration came out in Quinton de Kock’s uncharacteristic celebration after his blazing hundred against Kolkata Knight Riders in the IPL .At the post-match press conference on Wednesday, Lu… [+3213 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Kangana Ranaut on Gyanvapi mosque row: ‘Lord Shiva exists in every particle of Kashi, doesn’t need a structure’", "description": "Kangana Ranaut was asked about the Gyanvapi mosque row during her recent visit to Varanasi.", "url": "https://indianexpress.com/article/entertainment/bollywood/kangana-ranaut-gyanvapi-mosque-row-lord-shiva-exists-in-every-particle-kashi-7925236/", "urlToImage": "https://images.indianexpress.com/2022/05/kangana-1200-2.jpg", "publishedAt": "2022-05-19T06:39:19Z", "content": "Kangana Ranaut, who will next be seen in Dhaakad, was recently asked about the Gyanvapi mosque row. Kangana was in Varanasi ahead of the release of her film with Arjun Rampal.Talking to a group of re… [+1399 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Explained: The controversy over Delhi’s College of Art admissions", "description": "The College of Art has begun its admission process under Ambedkar University. How is it associated with Ambedkar University? Why is the announcement of admissions drawing criticism?", "url": "https://indianexpress.com/article/explained/college-of-art-admission-delhi-ambedkar-university-7925310/", "urlToImage": "https://images.indianexpress.com/2022/05/College-of-Art-1.jpg", "publishedAt": "2022-05-19T06:38:06Z", "content": "The College of Art (COA) has formally begun its admission process under Ambedkar University, drawing criticism from teachers and elected members of the Executive Council and Academic Council members.… [+2709 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Chetan Nayak", "title": "I used Realme’s Pad Mini for a week – here are the biggest pros and cons", "description": "The Realme Pad Mini comes with an affordable price and specifications that have been pulled together accordingly. Does that translate into a good, value-for-money tablet? Find out below.", "url": "https://indianexpress.com/article/technology/mobile-tabs/realme-pad-mini-review-7924949/", "urlToImage": "https://images.indianexpress.com/2022/05/Realme-Pad-Mini-review-1.jpg", "publishedAt": "2022-05-19T06:37:42Z", "content": "The budget tablet market in India has seen a resurgence during the pandemic. This has led to a number of tablet options popping up, but the Realme Pad Mini aims to be something different. At Rs 10,99… [+5289 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "‘Unjustified and brutal invasion of Iraq… I mean Ukraine’: George Bush’s faux pas caught on camera", "description": "The mix-up occurred while former US President George W Bush was speaking at an event in Dallas on Wednesday.", "url": "https://indianexpress.com/article/world/george-bush-invasion-iraq-ukraine-mix-up-7925196/", "urlToImage": "https://images.indianexpress.com/2022/05/george-bush-1.jpg", "publishedAt": "2022-05-19T06:35:53Z", "content": "Former US president George W Bush was momentarily embarrassed after he termed the invasion of Iraq as “wholly unjustified and brutal”. Bush quickly corrected himself: “I mean, [invasion] of Ukraine.”… [+1135 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Heavy rains lash Kerala, red alert sounded in 12 districts", "description": "Several low-lying areas, including residential hubs in Kochi and suburban areas, were flooded due to incessant rains since Wednesday night.", "url": "https://indianexpress.com/article/cities/thiruvananthapuram/heavy-rains-kerala-red-alert-weather-7925313/", "urlToImage": "https://indianexpress.com/wp-content/themes/indianexpress/images/IE-OGimage.jpg", "publishedAt": "2022-05-19T06:33:19Z", "content": "Pre-monsoon rains continued to lash Kerala on Thursday as the Met Department predicted heavy to extremely heavy showers on Thursday owing to a cyclonic circulation over Tamil Nadu. An alert has also … [+1163 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Parenting Desk", "title": "What no one tells new moms about what childbirth can do to their bodies", "description": "Postpartum bodies need love, care and acceptance. Birthing a new life does not come easy. While new mothers nurture their newborns, understanding their own bodies and serving themselves too should be part of the postpartum journey.", "url": "https://indianexpress.com/article/parenting/health-fitness/what-no-one-tells-new-moms-about-what-childbirth-can-do-to-their-bodies-7923992/", "urlToImage": "https://images.indianexpress.com/2022/04/pregnancy1200.jpg", "publishedAt": "2022-05-19T06:30:50Z", "content": "While enough is said and discussed about the changes in the body of a woman during pregnancy, often enough emphasis is not laid on the postpartumrepercussions that one may face after giving birth.\r\nT… [+3208 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "The Conversation", "title": "The dark side of social media influencing", "description": "Influencers are motivated to increase their power on social media; followers, on the other hand, can easily become attached and obsessed with them", "url": "https://indianexpress.com/article/lifestyle/life-style/dark-side-of-social-media-influencing-7918524/", "urlToImage": "https://images.indianexpress.com/2022/05/social-media-crop.jpg", "publishedAt": "2022-05-19T06:30:46Z", "content": "Do you follow influencerson social media? Do you always check their posts? Do you find you’re spending too much time or becoming obsessed with checking influencers’ accounts? And when you can’t check… [+4964 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "ASI shuts Aurangzeb’s tomb in Maharashtra’s Aurangabad after MNS comments", "description": "Two days ago, MNS spokesperson Gajanan Kale had in a tweet questioned the need for the monument's existence in the state and said it should be destroyed.", "url": "https://indianexpress.com/article/cities/mumbai/maharashtra-asi-closes-aurangzebs-tomb-for-5-days-7925231/", "urlToImage": "https://images.indianexpress.com/2022/05/ASI-1.jpg", "publishedAt": "2022-05-19T06:27:52Z", "content": "The Archaeological Survey of India (ASI) Thursday shut Mughal emperor Aurangzeb’s tomb in the Aurangabad district of Maharashtra for five days after a mosque committee in the area tried to lock the p… [+1411 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuradha Mascarenhas", "title": "Pune’s Ashok Dyalchand among eight nominees for World’s Children’s Prize award for decade", "description": "Ghana's James Kofi Annan and Pakistan's Malala Yousafzai are some of the other nominees for the prestigious award given by the World's Children's Prize Foundation (WCPF) of which the previous recipient was Nelson Mandela.", "url": "https://indianexpress.com/article/cities/pune/pune-ashok-dyalchand-world-childrens-prize-award-7925283/", "urlToImage": "https://images.indianexpress.com/2022/05/DYALCHAND-.jpg", "publishedAt": "2022-05-19T06:24:23Z", "content": "Someone who campaigns against child marriages and for girls’ rights in India through his Institute of Health Management Pachod (IHMP), 74-year-old Dr Ashok Dyalchand from Pune is among the eight nomi… [+3877 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Three Thousand Years of Longing teaser heralds an epic, bonkers return for legendary George Miller", "description": "The teaser for George Miller's Three Thousand Years of Longing that was released online is nuts, in the best way possible. It is basically a 19-second montage that deserves to be paused nearly every other second due to loads of weird, exciting imagery packed …", "url": "https://indianexpress.com/article/entertainment/hollywood/three-thousand-years-of-longing-teaser-george-miller-idris-elba-tilda-swinton-7925142/", "urlToImage": "https://images.indianexpress.com/2022/05/Three-Thousand-Years-of-Longing-1200.jpg", "publishedAt": "2022-05-19T06:23:44Z", "content": "Aussie filmmaking legend George Milleris back. Mad Max spinoff film Furiosa is still a couple of years away, but he is giving us a fantasy epic in the meanwhile, a film that we did not know we needed… [+1971 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Archery World Cup Stage 2: Indian women’s team wins recurve bronze", "description": "The Indian women's team had to fight for a bronze after they lost out to its nemesis and home favourites Korea 2-6 (53-55, 57-55, 51-53, 43-53) in the semi-final.", "url": "https://indianexpress.com/article/sports/sport-others/archery-world-cup-stage-2-indian-womens-team-wins-recurve-bronze-7925270/", "urlToImage": "https://images.indianexpress.com/2022/03/archery-stock-photo-2022.jpg", "publishedAt": "2022-05-19T06:21:42Z", "content": "Indian women archers won a team bronze in the recurve section to take their medal’s tally to three at the World Cup Stage 2  on Thursday.On a day when Indian men made a quarterfinal exit going down t… [+1731 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Getty Images partners with Candy Digital to launch its first-ever NFTs", "description": "Getty Images and Candy Digital will collaborate and develop a diverse portfolio of NFT products and collections derived from Getty Images’ extensive library of more than 465 million images.", "url": "https://indianexpress.com/article/technology/crypto/getty-images-to-introduce-its-first-ever-nfts-in-collaboration-with-candy-digital/", "urlToImage": "https://images.indianexpress.com/2022/03/ezgif.com-gif-maker-1-1.jpg", "publishedAt": "2022-05-19T06:20:58Z", "content": "According to a press release, Getty Images is developing a diverse portfolio of NFT products and collections derived from its extensive library of more than 465 million images, including over 135 mil… [+2068 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "‘Don’t spoil classics’: Fans respond as remake of Rajesh Khanna-Amitabh Bachchan’s Anand announced", "description": "Rajesh Khanna and Amitabh Bachchan's cult drama Anand is being remade by original producer N.C. Sippy's grandson Sameer Raj Sippy and Vikram Khakar.", "url": "https://indianexpress.com/article/entertainment/bollywood/anand-remake-rajesh-khanna-amitabh-bachchan-fans-say-no-7925099/", "urlToImage": "https://images.indianexpress.com/2022/05/anand-film-remake-rajesh-khanna-amitabh-bachchan.jpg", "publishedAt": "2022-05-19T06:11:48Z", "content": "Anandmay have released over half a century ago but the film has stayed relevant for its legions of fans. Playing on this nostalgia, Sameer Raj Sippy has announced the remake of his grandfather N.C. S… [+1991 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Focus on innovative research, Manish Sisodia to Delhi’s state universities", "description": "Manish Sisodia met the vice-chancellors of these universities on Wednesday to review their research projects. During that meeting, he told them that the government is \"determined\" to promote innovative research.", "url": "https://indianexpress.com/article/cities/delhi/manish-sisodia-delhi-state-universities-innovative-research-7925262/", "urlToImage": "https://images.indianexpress.com/2022/04/manish-sisodia-2-1.jpg", "publishedAt": "2022-05-19T06:11:19Z", "content": "There will be no shortage of funds for “out of the box research ideas”, Deputy Chief Minister Manish Sisodia told the vice-chancellors of Delhi’s state universities, encouraging them to pursue innova… [+1282 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Instagram may soon show just three stories, hide rest behind a ‘Show All’ button", "description": "Instagram is acting on story-spam by showing just three stories and hiding the rest behind a ‘show all’ button.", "url": "https://indianexpress.com/article/technology/social/instagram-may-soon-show-just-three-stories-hide-rest-behind-a-show-all-button-7925239/", "urlToImage": "https://images.indianexpress.com/2022/05/Instagram-Reuters.jpg", "publishedAt": "2022-05-19T06:06:15Z", "content": "Instagrams stories is perhaps one of the apps most used features along with Reels. However, despite the whole point of Stories being to tell your followers what youve been up to all day, some people … [+1620 chars]"}]}