{"status": "ok", "totalResults": 727, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Serivce", "title": "Need to fight politically, Amit Shah tells BJP leaders at meeting", "description": "On a two-day visit to West Bengal, Shah is learnt to have told his party leaders that a democratically elected government cannot be overthrown in this way and the political battle has to be fought “politically”, a senior party leader told The Indian Express o…", "url": "https://indianexpress.com/article/cities/kolkata/need-to-fight-politically-shah-tells-bjp-leaders-at-meeting-7904971/", "urlToImage": "https://images.indianexpress.com/2022/05/1-84.jpg", "publishedAt": "2022-05-06T22:48:16Z", "content": "Union Home Minister Amit Shah on Friday ruled out the possibility of imposing Article 356 in West Bengal during a meeting with BJP leaders from the state, sources said.On a two-day visit to West Beng… [+2592 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sreenivas Janyala", "title": "Hyderabad Killing over interfaith marriage: He sold chain to take wife Eid shopping", "description": "On Friday, the Hyderabad Police said the two main accused — Ashrin's brother Mubin Ahmed Syed and another relative M Masood Ahmed — have been arrested.", "url": "https://indianexpress.com/article/cities/hyderabad/hyderabad-killing-over-interfaith-marriage-he-sold-chain-to-take-wife-eid-shopping-7904958/", "urlToImage": "https://images.indianexpress.com/2022/05/marriage-killing.jpg", "publishedAt": "2022-05-06T22:43:47Z", "content": "B Nagaraju, 25, who was stabbed to death at a busy crossing in Hyderabad Wednesday night over his marriage to a Muslim woman, had sold his gold chain to take his wife, Ashrin Sultana Syed, Eid shoppi… [+2604 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "No picture postcard", "description": "J&K delimitation report raises more questions than it answers. Next step, elections, must come sooner rather than later", "url": "https://indianexpress.com/article/opinion/editorials/jk-delimitation-report-raises-more-questions-than-it-answers-7904847/", "urlToImage": "https://images.indianexpress.com/2022/05/editorial.jpeg", "publishedAt": "2022-05-06T22:42:50Z", "content": "The final award of the Jammu and Kashmir Delimitation Commission has not laid to rest the concerns that dogged its work. The J&amp;K Reorganisation Act 2019, which is itself sub judice, provides new … [+2406 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Jagpreet Singh Sandhu, Sofi Ahsan, Pavneet Singh Chadha", "title": "Punjab tells HC its officers held; Haryana, Delhi deny", "description": "As a Punjab Police team took Bagga away, and his father filed a complaint at the Janakpuri police station alleging he had been abducted, the Delhi Police filed an FIR and its inspector Antariksh approached the Dwarka court for a search warrant.", "url": "https://indianexpress.com/article/india/punjab-tells-hc-its-officers-held-haryana-delhi-deny-7904966/", "urlToImage": "https://images.indianexpress.com/2022/05/bagga-1200-1.jpg", "publishedAt": "2022-05-06T22:34:26Z", "content": "The drama involving Delhi BJP leader Tajinder Pal Singh Bagga played out not just on the highway but also inside two courtrooms one in Chandigarh and the other in Dwarka in Delhi.As a Punjab Police t… [+6753 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Nitin Gadkari: Pune has potential to become the hub for automobile manufacturing", "description": "The Union minister said GST revenue from automobile sector is the highest. “The Rs 50,000-crore turnover comes from ancillary units in the automobile sector. Pune has the best environment for becoming an automobile hub as major manufacturing units are located…", "url": "https://indianexpress.com/article/cities/pune/nitin-gadkari-pune-has-potential-to-become-the-hub-for-automobile-manufacturing-7904969/", "urlToImage": "https://images.indianexpress.com/2022/04/Gadkari-1.jpg", "publishedAt": "2022-05-06T22:32:49Z", "content": "Pune should be made an automobile-manufacturing hub as it has lot of potential in the field, Union Minister for Transport and Highways Nitin Gadkari said on Friday. He also promised to take up the is… [+4170 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Covid-19 vaccine designed for oral use protects against disease and transmission, study finds", "description": "The study, led by Duke University researcher Stephanie N Langel, PhD, medical instructor in the Department of Surgery, have been published in the journal Science Translational Medicine.", "url": "https://indianexpress.com/article/explained/covid-vaccine-oral-use-disease-transmission-protection-explained-7904865/", "urlToImage": "https://images.indianexpress.com/2021/12/paxlovid.jpg", "publishedAt": "2022-05-06T22:30:05Z", "content": "An investigational Covid vaccine designed to be taken orally has been found not only to protect the host, but also to decrease the airborne spread of the virus to other close contacts. The vaccine wa… [+2883 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shyamlal Yadav", "title": "Explained: The cooling-off period for retired bureaucrats before joining a new job", "description": "Post-retirement commercial employment for the three All India Services (IAS, Indian Police Service, and Indian Forest Service) is covered under the AIS Death-cum-Benefits Rules, and for the Central Civil Services under the CCS (Pension) Rules.", "url": "https://indianexpress.com/article/explained/retired-bureaucrats-cooling-off-period-new-job-explained-7904870/", "urlToImage": "https://images.indianexpress.com/2022/03/ias.jpg", "publishedAt": "2022-05-06T22:30:04Z", "content": "Archana Goyal Gulati, an 1989-batch official of the Indian Posts and Telecommunication Accounts and Finance Service (Indian P&amp;TAFS), has joined Google as Chief of Public Policy after taking volun… [+5047 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "No one can take our freedom away, says Chidambaram", "description": "A state-of-the-art production room and broadcast hall were inaugurated by Chidambaram. He also released a book of the journey of 100 years of Tilak Maharashtra Vidyapeeth.", "url": "https://indianexpress.com/article/cities/pune/no-one-can-take-our-freedom-away-says-chidambaram-7904968/", "urlToImage": "https://images.indianexpress.com/2022/04/chidambaram-1200-1.jpeg", "publishedAt": "2022-05-06T22:25:32Z", "content": "LOKMANYA TILAK has given freedom to India with the help of a four-point agenda of Swadeshi, Swarajya, boycott and national teaching. He proved the importance of freedom. Though we are denied the righ… [+189 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "Day 3: LIC IPO subscribed 1.38 times", "description": "LIC policyholders’ quota was oversubscribed 4.01 times (401 per cent) and the employee reserved portion attracted 306 per cent subscription. The retail investors portion was subscribed 123 per cent, according to data revealed by the stock exchanges.", "url": "https://indianexpress.com/article/business/companies/day-3-lic-ipo-subscribed-1-38-times-7904875/", "urlToImage": "https://images.indianexpress.com/2022/05/LIC-IPO-REUTERS-1200.jpeg", "publishedAt": "2022-05-06T22:24:32Z", "content": "The mega initial public offering (IPO) of Life Insurance Corporation (LIC) was subscribed 1.38 times (138 per cent) on Friday with investors putting in bids for 22.36 crore shares as against the publ… [+1632 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Cyclone brewing in Bay of Bengal, headed towards AP, Odisha coast", "description": "The IMD said a low pressure developed over the South Andaman Sea and adjoining Southeast Bay of Bengal on Friday.", "url": "https://indianexpress.com/article/cities/pune/cyclone-brewing-in-bay-of-bengal-headed-towards-ap-odisha-coast-7904959/", "urlToImage": "https://images.indianexpress.com/2021/05/odisha-7.jpg", "publishedAt": "2022-05-06T22:21:07Z", "content": "THIS YEARS first cyclonic storm, likely to develop in the Bay of Bengal, is expected to reach close to Andhra Pradesh-Odisha coast around Tuesday, according to the India Meteorological Department (IM… [+1219 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Good hand hygiene can prevent 70% of health infections: WHO report", "description": "Today, out of every 100 patients in acute-care hospitals, seven patients in high income countries and 15 patients in low and middle income countries will acquire at least one healthcare-associated infection during their hospital stay.", "url": "https://indianexpress.com/article/cities/pune/good-hand-hygiene-can-prevent-70-of-health-infections-who-report-7904965/", "urlToImage": "https://images.indianexpress.com/2022/02/handwashing_1200_getty.jpg", "publishedAt": "2022-05-06T22:15:28Z", "content": "THE COVID-19 pandemic and other recent large disease outbreaks have highlighted the extent to which healthcare settings can contribute to the spread of infections, harming patients, health workers an… [+1310 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Vallabh Ozarkar", "title": "ASI rejects state’s plan to restore ancient temples", "description": "The state government had recently allocated  Rs 101 crore for conservation of the eight temples.", "url": "https://indianexpress.com/article/cities/pune/asi-rejects-states-plan-to-restore-ancient-temples-7904962/", "urlToImage": "https://images.indianexpress.com/2022/05/asi.jpg", "publishedAt": "2022-05-06T22:03:44Z", "content": "In what could be seen as a blow to the Maharashtra government’s ambitious project of restoration, preservation and area development programme of the eight heritage temples of the state, the Archaeolo… [+1265 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rupsa Chakraborty", "title": "Covid ex-gratia gap: Central team to randomly screen 5% applications", "description": "As The Indian Express reported on Friday, against the Maharashtra government’s official Covid-19 death toll of 1.47 lakh, the number of applications approved for ex-gratia payment of Rs 50,000 for Covid-19 deaths has exceeded by 23 per cent as of May 1.", "url": "https://indianexpress.com/article/cities/mumbai/covid-ex-gratia-gap-central-team-to-randomly-screen-5-applications-7904961/", "urlToImage": "https://images.indianexpress.com/2022/05/covid-pti.jpg", "publishedAt": "2022-05-06T21:54:50Z", "content": "A CENTRAL team is currently scrutinizing Covid-19 ex-gratia claims in 10 districts in Maharashtra, following the directive of the Supreme Court. Considering the gap in the approved claims and the sta… [+2161 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sadaf Modak", "title": "Booked under UAPA, man gets 7 years in jail after he accepts guilt", "description": "Special Judge Dinesh E Kothalikar allowed Yafai's plea and convicted him under UAPA. Yafai, in his plea, had said that he has already spent six years in jail and the trial will take a long time to commence.", "url": "https://indianexpress.com/article/cities/mumbai/booked-under-uapa-man-gets-7-years-in-jail-after-he-accepts-guilt-7904957/", "urlToImage": "https://images.indianexpress.com/2022/04/jail-4.jpg", "publishedAt": "2022-05-06T21:44:10Z", "content": "The special National Investigation Agency (NIA) court on Friday convicted a 39-year-old man, booked on charges under Unlawful Activities (Prevention) Act (UAPA) for his alleged links to terrorist org… [+2229 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Omkar Gokhale", "title": "Mumbai: Man refusing to vacate flat for redevelopment to pay Rs 5 lakh to housing society", "description": "Maintaining that a single person cannot take the housing society to ransom, the HC directed the member to vacate the flat within two weeks, failing which, the court receiver would take forcible possession of the house to handover it to the developer or the so…", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-man-refusing-to-vacate-flat-for-redevelopment-to-pay-rs-5-lakh-to-housing-society-7904954/", "urlToImage": "https://images.indianexpress.com/2021/10/bombay-HC-1200-1.jpg", "publishedAt": "2022-05-06T21:34:29Z", "content": "The Bombay High Court recently imposed a cost of Rs 5 lakh on a member of a housing society who was not vacating his flat, which is in a dilapidated building, even after the society appointed a devel… [+1697 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Jayant Sinha", "title": "India’s dharmic democracy has ancient roots", "description": "Concepts of ahimsa and dharma inspire the country to be a beacon of pluralism and democracy.", "url": "https://indianexpress.com/article/opinion/columns/indias-dharmic-democracy-has-ancient-roots-7904815/", "urlToImage": "https://images.indianexpress.com/2021/11/indian-national-flag759.jpg", "publishedAt": "2022-05-06T21:30:58Z", "content": "The Ukrainian crisis has fractured the world into separate blocs. On one side, we have autocrats ruling their countries with complete control of the state, economy, and media. On the other side, we h… [+6133 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Bright prospects for India-France ties", "description": "PM Modi's visit has cemented the relationship, highlighted new areas for cooperation.", "url": "https://indianexpress.com/article/opinion/columns/bright-prospects-for-india-france-ties-7904823/", "urlToImage": "https://images.indianexpress.com/2022/05/modi-macron-2-1.jpg", "publishedAt": "2022-05-06T21:30:17Z", "content": "Prime Minister Narendra Modis visit to France on May 4 is his fifth since 2015, and the 10th such high-level bilateral visit.\r\nThis time, the exchange between the French and Indian leaders was especi… [+5445 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Vishwas Waghmode", "title": "After SC order, SEC tells local bodies to continue poll process", "description": "On Thursday, the poll panel had asked all the 25 Zilla Parishads and 284 Panchayat Samitis to check the draft ward boundaries at the SEC and six Zilla Parishad did so on Friday.", "url": "https://indianexpress.com/article/cities/mumbai/after-sc-order-sec-tells-local-bodies-to-continue-poll-process-7904955/", "urlToImage": "https://images.indianexpress.com/2022/03/voting-200.jpg", "publishedAt": "2022-05-06T21:26:12Z", "content": "Even as the MVA government has said that the SC order on ward delimitation of local bodies is ambiguous, the state election commission (SEC) on Friday asked the Zilla Parishads, Panchayat Samitis, Mu… [+1696 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Yogesh Naik", "title": "Not much has changed at SGNP 25 years after HC ordered removal of encroachment", "description": "Environmentalist Debi Goenka said, “The problem was that demolition was not effectively done. The boundary wall was not complete. Many of those who got pucca houses in Chandivali sold them and came back to the slums in the park. I think only 10 per cent of th…", "url": "https://indianexpress.com/article/cities/mumbai/not-much-has-changed-at-sgnp-25-years-after-hc-ordered-removal-of-encroachment-7904927/", "urlToImage": "https://images.indianexpress.com/2018/05/sanjay-gandhi-national-park-fb.jpg", "publishedAt": "2022-05-06T21:15:46Z", "content": "This Saturday, the Bombay High Court order to clear the Sanjay Gandhi National Park of encroachment will complete 25 years but not much has changed on the ground.The petition was filed by Bombay Envi… [+5287 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Gayathri Mani", "title": "Former L-G, oppn say larger bench can help bring clarity", "description": "Kamaljeet Kaur, who is in Bihar at the moment, said she received a call from her husband, Preetpal Singh Bagga, around 7 am informing her of the incident.", "url": "https://indianexpress.com/article/cities/delhi/former-l-g-oppn-say-larger-bench-can-help-bring-clarity-7904951/", "urlToImage": "https://images.indianexpress.com/2020/01/jung_1200.jpg", "publishedAt": "2022-05-06T20:53:11Z", "content": "Delhis former Lieutenant Governor (L-G) as well as the opposition welcomed the apex courts decision to refer the dispute between the Delhi government and the Centre over control of administrative ser… [+1529 chars]"}]}