{"status": "ok", "totalResults": 727, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Udhna police lodges 2 FIRs over AAP-BJP scuffle in Surat", "description": "A second FIR was filed after AAP leader Dinesh Jikadra lodged a complaint. Jikadra is one of the two AAP leaders who suffered injuries and was admitted to the New Civil Hospital in Surat on Monday, and does not name any accused persons.", "url": "https://indianexpress.com/article/cities/ahmedabad/udhna-police-lodges-2-firs-over-aap-bjp-scuffle-in-surat-7900140/", "urlToImage": "https://images.indianexpress.com/2022/05/Gopal-Italia.jpg", "publishedAt": "2022-05-03T22:44:02Z", "content": "Udhna police station in Surat has lodged two FIRs Monday, charging 16 Aam Aadmi Party (AAP) workers, including the partys Gujarat chief Gopal Italia, for unlawful assembly and rioting.The FIRs were l… [+2774 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Four-hour power cuts in Vadodara for 4 days from today", "description": "An official of the MGVCL engineering department told this newspaper that the power cuts are not to be viewed as load-shedding in the backdrop of coal deficit in the country and that it was “regular” for mandatory maintenance.", "url": "https://indianexpress.com/article/cities/ahmedabad/four-hour-power-cuts-in-vadodara-for-4-days-from-today-7900139/", "urlToImage": "https://images.indianexpress.com/2022/04/punjab-electricity-1.jpg", "publishedAt": "2022-05-03T22:39:56Z", "content": "Several areas in Vadodara will face four-hour power disruptions between 6 am and 10 am from Wednesday to Saturday during a mega maintenance drive across the city by the Vadodara division of Madhya Gu… [+1892 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gas cylinder painted near lotus symbol as BJP-Cong spar reaches Jamnagar walls", "description": "The BJP leaders said that it has been following \"tradition\" in election season and that the Congress is doing a \"deplorable act\" by painting other symbols beside lotus. But Congress claimed that it is merely raising the voice of the people.", "url": "https://indianexpress.com/article/cities/ahmedabad/gas-cylinder-painted-near-lotus-symbol-as-bjp-cong-spar-reaches-jamnagar-walls-7900137/", "urlToImage": "https://images.indianexpress.com/2022/05/gujaray.jpg", "publishedAt": "2022-05-03T22:36:53Z", "content": "In a move to counter the BJP’s campaign of painting its election symbols on walls of Jamnagar city, the Congress has started drawing paintings of articles which have become costlier during the BJP re… [+3043 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Mihir Vasavda", "title": "Asian Games in Sept, China looks at strict ‘closed-loop’ Covid curbs", "description": "Late last month, it was reported that postponing the Asian Games, second only to Olympics in terms of size, was a possibility as China, where the coronavirus emerged in late 2019, faced its biggest Covid-19 crisis.", "url": "https://indianexpress.com/article/sports/asian-games-2022-china-covid-19-7900070/", "urlToImage": "https://images.indianexpress.com/2013/01/neeraj-chopra-12001.jpg", "publishedAt": "2022-05-03T22:32:36Z", "content": "IF THE Tokyo Olympics presented athletes with the unique challenges of living and competing in a bio-bubble, this year’s Asian Games in the Chinese city of Hangzhou will likely be more of the same, p… [+3971 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Krishn Kaushik", "title": "Explained: Submarine tech that India wants", "description": "What is AIP technology, how is it different, and why does the Indian Navy want it?", "url": "https://indianexpress.com/article/explained/submarine-tech-that-india-wants-aip-technology-7900043/", "urlToImage": "https://images.indianexpress.com/2022/05/submarine.jpg", "publishedAt": "2022-05-03T22:30:51Z", "content": "On April 30, Frances Naval Group, one of five shortlisted Original Equipment Manufacturers (OEM) for the Navys P-75 India (P-75I) project to build six conventional submarines within the country, anno… [+7042 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anonna Dutt", "title": "Death registrations show 6% rise in pandemic year 2020: Registrar General", "description": "These are not the actual number of births and deaths in India in 2020, but only those births and deaths which got registered. Registration of births and deaths have been steadily increasing in recent years.", "url": "https://indianexpress.com/article/india/death-registrations-show-6-rise-in-pandemic-year-2020-registrar-general-7900062/", "urlToImage": "https://images.indianexpress.com/2022/04/covid-death-1.jpg", "publishedAt": "2022-05-03T22:30:47Z", "content": "New data released Tuesday by the office of the Registrar General showed that 81.16 lakh deaths were registered in the country in 2020, about six per cent higher than the previous years number, which … [+3049 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Debraj Deb", "title": "Distortion, imposition: Why NE groups are against Centre’s Hindi push", "description": "Each Northeast state has its own set of diverse languages, ranging from Indo-Aryan to Tibeto-Burman to Austro-Asiatic families.", "url": "https://indianexpress.com/article/explained/distortion-imposition-why-ne-groups-are-against-centres-hindi-push-7900049/", "urlToImage": "https://images.indianexpress.com/2022/05/shah.jpg", "publishedAt": "2022-05-03T22:30:24Z", "content": "Last week, a conglomerate of 56 tribal organisations in Tripura came out in protest against what they saw as the possibility of Hindi being introduced as the script for Kokborok, the lingua franca fo… [+5342 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sriram Veera", "title": "Wisden trims W G Grace’s numbers, and some myths around the legend", "description": "Grace, who played from 1865 to 1908, was a great cricketer, embellished with myths and legends, and is considered to have done more to establish and popularise cricket than anyone in history.", "url": "https://indianexpress.com/article/sports/cricket/wisden-trims-w-g-graces-numbers-and-some-myths-around-the-legend-7900063/", "urlToImage": "https://images.indianexpress.com/2022/05/W-G-Grace.jpg", "publishedAt": "2022-05-03T22:30:02Z", "content": "The law has finally caught up with W G Grace after 150 years; its such a W G story in many ways, Lawrence Booth, the editor of Wisden Almanack, says in jest about his decision to amend the statistics… [+4370 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pune, Pimpri cops issue notice to MNS workers", "description": "During his rally, Thackeray had said that he was firm on the May 3 'deadline' given by him for removing loudspeakers from mosques across the state.", "url": "https://indianexpress.com/article/cities/pune/pune-pimpri-cops-issue-notice-to-mns-workers-7900136/", "urlToImage": "https://images.indianexpress.com/2022/05/mns.jpeg", "publishedAt": "2022-05-03T22:18:21Z", "content": "Pune and Pimpri-Chinchwad Police have issued notices to several leaders and workers of Maharashtra Navnirman Sena (MNS) in the backdrop of controversial statements made by party chief Raj Thackeray a… [+176 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manoj Dattatrye More", "title": "Lokmanya began process for Chhatrapati samadhi renovation, says family", "description": "\"It is true that Mahatma Jyotirao Phule discovered the samadhi of Chhatrapati Shivaji Maharaj in 1869. But it was Lokmanya Tilak who initiated the process of renovating it,\" Rohit Tilak, the great-grandson of Lokmanya Tilak, said on Tuesday.", "url": "https://indianexpress.com/article/cities/pune/lokmanya-began-process-for-chhatrapati-samadhi-renovation-says-family-7900130/", "urlToImage": "https://images.indianexpress.com/2022/05/samridhi.jpg", "publishedAt": "2022-05-03T22:14:11Z", "content": "THE FAMILY of Lokmanya Tilak and a descendant of Chhatrapati Shivaji Maharaj have stepped forward to assert that it was Mahatma Jyotirao Phule who discovered the samadhi of the Maratha king even as t… [+2265 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shubhajit Roy", "title": "‘India is pragmatic…there is understanding in the US about our concerns’", "description": "In this explained.Live session, C Raja Mohan, Visiting Research Professor, National University of Singapore, talks about the diplomatic challenges India faces after the Russia-Ukraine war and how it will have to redraw existing equations.", "url": "https://indianexpress.com/article/explained/india-is-pragmaticthere-is-understanding-in-the-us-about-our-concerns-7900106/", "urlToImage": "https://images.indianexpress.com/2022/05/explainer1.jpg", "publishedAt": "2022-05-03T22:10:20Z", "content": "Two months ago, we were hopeful that a framework could be negotiated and that there was reasonable space for negotiation, accommodation and avoiding conflict. Russian President Vladimir Putin had the… [+6320 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sanjana Bhalerao", "title": "Iced treats, cold baths: Some comfort for zoo animals", "description": "On offer are fruit and vegetable icicles and lollies for sloth bears, monkeys and Asian elephants — Anarkali is one of the latter. The Royal Bengal tigers, including Karishma and Shakti, and leopards get to chew on frozen meat and bones.", "url": "https://indianexpress.com/article/cities/mumbai/iced-treats-cold-baths-some-comfort-for-zoo-animals/", "urlToImage": "https://images.indianexpress.com/2022/05/yyyy.jpg", "publishedAt": "2022-05-03T21:53:00Z", "content": "Anarkali, 56, enjoys iced lollies and cold showers. Young Karishma and Shakti, meanwhile, prefer baths in the pool.Amid the heatwave, everyone is looking for ways to cool off and the denizens of the … [+2070 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pallavi Smart", "title": "Maharashtra: Medical students told to finish internship in hospitals attached to own colleges", "description": "As per the old practice, students were allowed externships, which meant the opportunity to complete the mandatory internship in hospitals attached to medical colleges and universities other than the ones where they pursued the MBBS courses.", "url": "https://indianexpress.com/article/cities/mumbai/maharashtra-medical-students-told-to-finish-internship-in-hospitals-attached-to-own-colleges-7900067/", "urlToImage": "https://images.indianexpress.com/2022/05/doctor-759-4.jpg", "publishedAt": "2022-05-03T21:52:44Z", "content": "Medical students in the state will now have to complete the mandatory 12-month internship in hospitals attached to the colleges where they studied MBBS. The Maharashtra University of Health Sciences … [+1968 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Yogesh Naik", "title": "Book on paintings by Usha Mangeshkar, relatives released", "description": "The coffee table book consists of 129 paintings, largely painted by Usha. It also includes paintings of her brother Hridaynath Mangeshkar, Anuja Bhosle, Saanjali Khadikar, Zanai Bhosle, Ranjay Bhosle and two by Lata Mangeshkar.", "url": "https://indianexpress.com/article/cities/mumbai/book-on-paintings-by-usha-mangeshkar-relatives-released-7900116/", "urlToImage": "https://images.indianexpress.com/2022/05/hhhhh.jpg", "publishedAt": "2022-05-03T21:43:55Z", "content": "The book Strokes of Harmony, a compilation of paintings by singer Usha Mangeshkar and some members of the Mangeshkar family, including the late Lata Mangeshkar, was released on Tuesday by noted paint… [+1138 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rupsa Chakraborty", "title": "Fatality rate among partially and unvaccinated more than double of vaccinated: Study", "description": "Maharashtra has given first dose to 92 per cent of its target population but only 75 per cent have taken the second dose.", "url": "https://indianexpress.com/article/cities/mumbai/fatality-rate-among-partially-and-unvaccinated-more-than-double-of-vaccinated-study-7900114/", "urlToImage": "https://images.indianexpress.com/2022/05/covid-pti.jpg", "publishedAt": "2022-05-03T21:38:40Z", "content": "AT A TIME, when nearly 2 crore beneficiaries across Maharashtra have missed their second dose against Covid-19, a study conducted by the Seven Hills Hospital in Marolone of the major civic-run Covid … [+2013 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sanjana Bhalerao", "title": "Only 25% of 4 lakh children taken first shot", "description": "The state health department, in a presentation to Chief Minister Uddhav Thackeray on April 27, had said that Maharashtra is below the national average in all vaccination categories.", "url": "https://indianexpress.com/article/cities/mumbai/only-25-of-4-lakh-children-taken-first-shot-7900111/", "urlToImage": "https://images.indianexpress.com/2022/02/Mumbai-Covid-1.jpg", "publishedAt": "2022-05-03T21:34:37Z", "content": "MUMBAI CONTINUES to be the worst performer when it comes to vaccinating children against Covid-19 among the 35 districts in Maharashtra, official data has revealed. Till May 1, around 25 per cent of … [+2656 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "Injecting trust", "description": "SC insistence on proportionality in vaccine mandate is good advice and a cautionary note.", "url": "https://indianexpress.com/article/opinion/editorials/injecting-trust-covid-pandemic-supreme-court-healthcare-7900022/", "urlToImage": "https://images.indianexpress.com/2022/04/editorial-37.jpeg", "publishedAt": "2022-05-03T21:30:57Z", "content": "On Monday, the Supreme Court did the right thing in asking the government and private agencies to apply the proportionality principle while applying Covid vaccine-related restrictions. The Court invo… [+2878 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Gurjit Singh", "title": "A defining moment for Indo-German ties", "description": "India-Germany joint statement shows congruence and commonality on UN, Afghanistan and terrorism.", "url": "https://indianexpress.com/article/opinion/columns/narendra-modi-germany-igc-meet-olaf-scholz-india-foreign-policy-ukraine-crisis-7900028/", "urlToImage": "https://images.indianexpress.com/2022/05/Scholz-Modi-meet-1.jpg", "publishedAt": "2022-05-03T21:30:52Z", "content": "Prime Minister Narendra Modi’s visit to Berlin for the sixth Indo-German Inter-Governmental Consultations (IGC) is significant for its timing and substantial results. Chancellor Olaf Scholz, despite … [+5380 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "Terms of recovery", "description": "A new RBI report underlines that monetary and fiscal policies need to be adjusted to secure growth prospects.", "url": "https://indianexpress.com/article/opinion/editorials/rbi-recovery-covid-19-pandemic-7900023/", "urlToImage": "https://images.indianexpress.com/2022/04/editorial-38.jpeg", "publishedAt": "2022-05-03T21:30:38Z", "content": "Last week the Reserve Bank of India released the Report on Currency and Finance 2021-22. It provides a frank assessment of the state of the Indian economy, beginning from its analysis of the economic… [+2408 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Mohan Kumar", "title": "India and France: A deepening friendship", "description": "Strategic convergence between India and France runs deep. As PM Modi visits the French capital, bilateral ties are set for a boost, even as both nations together review the turbulent international landscape.", "url": "https://indianexpress.com/article/opinion/columns/india-and-france-a-deepening-friendship-7900017/", "urlToImage": "https://images.indianexpress.com/2022/05/oped-illustration-1.jpg", "publishedAt": "2022-05-03T21:30:32Z", "content": "Prime Minister Narendra Modis ascent to power has not just brought about a more frenetic form of Indian diplomacy but has also resulted in what may be called personalised diplomacy. Modi believes tha… [+5743 chars]"}]}