{"status": "ok", "totalResults": 392, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Navjeevan Gopal", "title": "After his plea for special diet, medical board puts Sidhu through tests", "description": "Sidhu suffers from embolism, which causes blockage in arteries due to blood clot or an air bubble, and liver ailments. He reportedly needs blood thinner medications and has been on a special diet for a long time.", "url": "https://indianexpress.com/article/cities/chandigarh/after-his-plea-for-special-diet-medical-board-puts-sidhu-through-tests-7932750/", "urlToImage": "https://images.indianexpress.com/2022/05/navjot-sidhu-surrenders.jpeg", "publishedAt": "2022-05-24T00:47:33Z", "content": "A panel of three doctors, including a dietician, compiled a report Monday after conductingh medical tests on Navjot Singh Sidhu serving a year-long sentence in a Patiala jail in a 1988 road rage case… [+3383 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Maulshree Seth", "title": "Amid ruckus, rift in SP comes out in open", "description": "Notably, Suheldev Bhartiya Samaj Party of Om Prakash Rajbhar also kept away from the protest during the Governor's address. Rajbhar, who is an ally of the Samajwadi Party, did not join the SP members in the protest.", "url": "https://indianexpress.com/article/cities/lucknow/amid-ruckus-rift-in-sp-comes-out-in-open-7932745/", "urlToImage": "https://images.indianexpress.com/2022/05/Azam-4col.jpg", "publishedAt": "2022-05-24T00:45:02Z", "content": "As Samajwadi Party members protested during Governor Anandiben Patels speech to the joint sitting of the UP Legislative Assembly and Legislative Council on Monday, cracks in the main opposition party… [+1853 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "AAP MLA Balbir Singh, wife, son gets 3 yrs in jail in assault case, secure bail", "description": "As per details, the case dates back to 2011 when the complainant Paramjit Kaur, sister of Dr Balbir Singh's wife, Rupinderjit Saini, had claimed that she and her husband had been attacked at Tapparian Dyal Singh village of Chamkaur Sahib (Ropar district).", "url": "https://indianexpress.com/article/cities/chandigarh/aap-mla-balbir-singh-wife-son-gets-3-yrs-in-jail-in-assault-case-secure-bail-7932748/", "urlToImage": "https://images.indianexpress.com/2022/05/Indian-express-logo-7.jpg", "publishedAt": "2022-05-24T00:43:58Z", "content": "The court of additional chief judicial magistrate, Ravi Inder Singh, in Ropar on Monday convicted Aam Aadmi Party (AAP)’s Patiala Rural MLA Dr Balbir Singh (65), his wife Rupinderjit Saini, son Rahul… [+1745 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Raakhi Jagga", "title": "Much before Mann push, nearly half of border district Fazilka adopted DSR", "description": "According to details, in 2021, around 46% of the area under paddy in Fazilka was grown using the new technique, making it the top district in Punjab to have embraced this method.", "url": "https://indianexpress.com/article/cities/chandigarh/much-before-mann-push-nearly-half-of-border-district-fazilka-adopted-dsr-7932743/", "urlToImage": "https://images.indianexpress.com/2022/05/ja.jpg", "publishedAt": "2022-05-24T00:36:23Z", "content": "Harpal Singh, a farmer of Parbhat Singh Wala village of Jalalabad constituency in Fazilka district, has 123 kanals of land that stretches across the fencing of the India-Pakistan border.Singh on Mond… [+3023 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Amit Sharma", "title": "Hathras ‘custodial death’: 2 held, security beefed up", "description": "“We have arrested two accused so far. They have been identified as Aakash (22) and Shubham (19). We have deployed policemen in the village to ensure peace,” said Girish Chand Gautam, the in-charge of Chandpa police station.", "url": "https://indianexpress.com/article/cities/lucknow/hathras-custodial-death-2-held-security-beefed-up-7932742/", "urlToImage": "https://images.indianexpress.com/2022/05/arrest1-15.jpeg", "publishedAt": "2022-05-24T00:31:17Z", "content": "Hathras police have arrested two persons aged 19 and 22 years old — in connection with the alleged custodial death of a Hindu Jagran Manch worker last Monday. A total of 17 people, including five pol… [+1189 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "AMU woman scholar ‘tries to kill herself’, blames supervisors", "description": "The AMU administration has constituted a fact-finding committee to look into the allegations levelled by the scholar, and submit a report in three days.", "url": "https://indianexpress.com/article/cities/lucknow/amu-woman-scholar-tries-to-kill-herself-blames-supervisors-7932738/", "urlToImage": "https://images.indianexpress.com/2022/05/AMU-1.jpg", "publishedAt": "2022-05-24T00:23:10Z", "content": "A woman PhD student of Aligarh Muslim University (AMU) on Sunday allegedly tried to die by suicide.In her complaint to the AMU administration, the scholar, who is currently admitted to a hospital, ac… [+1551 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gujarat inks MoU to develop India’s first carbon market", "description": "The MoU was signed in the presence of Chief Minister Bhupendra Patel and officials from climate change and mines and industries department.", "url": "https://indianexpress.com/article/cities/ahmedabad/gujarat-inks-mou-to-develop-indias-first-carbon-market-7932728/", "urlToImage": "https://images.indianexpress.com/2022/05/Bhupendra-Patel1-1200-1.jpg", "publishedAt": "2022-05-24T00:12:04Z", "content": "In order to set up Indias first carbon market, the Gujarat government on Monday inked a Memorandum of Understanding (MoU) with Energy Policy Institute at the University of Chicago and Abdul Latif Jam… [+809 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Data entry ponzi scamster held for duping investors of Rs 50 cr: Police", "description": "According to police, the accused Rahul Vaghela, a Nadiad resident, was arrested by a team of Local Crime Branch (LCB) of Banaskantha Police from Dhanera border taluka Sunday night when he was allegedly trying to flee to Rajasthan.", "url": "https://indianexpress.com/article/cities/ahmedabad/data-entry-ponzi-scamster-held-for-duping-investors-of-rs-50-cr-police-7932726/", "urlToImage": "https://images.indianexpress.com/2022/05/handcuff-4-10.jpg", "publishedAt": "2022-05-23T23:42:57Z", "content": "An owner of two Nadiad-based technology firms has been arrested for allegedly duping over 20,000 investors across the state to the tune of over Rs 50 crore through a dubious “data entry investment” s… [+2452 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Valamji Humbal re-elected unopposed as Sarhad Dairy director", "description": "The newly-elected directors went to Gandhinagar to thank state BJP president CR Paatil. Incidentally, the BJP has started nominating candidates for election to cooperative bodies in the state since Paatil took over as the BJP's state unit chief.", "url": "https://indianexpress.com/article/cities/rajkot/valamji-humbal-re-elected-unopposed-as-sarhad-dairy-director-7932723/", "urlToImage": "https://images.indianexpress.com/2022/05/milk-1.jpg", "publishedAt": "2022-05-23T23:38:20Z", "content": "Incumbent Vice-Chairman of Gujarat State Milk Marketing Federation (GCMMF), Valamji Humbal, was among the 12 candidates elected unopposed as directors of Kutch District Cooperative Milk Producers Uni… [+1266 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Gujarat BJP ‘hopes’ to collect Rs 200 cr ahead of elections", "description": "In the meeting, Gujarat BJP prepared a roadmap for its various programmes for the assembly elections. The meeting was also attended by Chief Minister Bhupendra Patel and co-incharge of Gujarat party unit, Sudhir Gupta, among others.", "url": "https://indianexpress.com/article/cities/gandhinagar/gujarat-bjp-hopes-to-collect-rs-200-cr-ahead-of-elections-7932721/", "urlToImage": "https://images.indianexpress.com/2022/05/Bhupendra-Patel-4.jpg", "publishedAt": "2022-05-23T23:33:57Z", "content": "Ahead of the Gujarat Assembly elections due later this year, state BJP has decided to collect Chuntani Sahyog Nidhi (Election Assistance Fund) from party workers and well wishers, hoping to collect a… [+2298 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Man who strangulated his friend found dead in village pond: Police", "description": "According to police, Payal’s father Rajesh Patel, a cab driver, who was aware of Payal’s relationship, filed a complaint against Smith after Hinaben informed him that Smith had come looking for Payal when she was alone at home.", "url": "https://indianexpress.com/article/cities/surat/man-who-strangulated-his-friend-found-dead-in-village-pond-police-7932719/", "urlToImage": "https://images.indianexpress.com/2022/05/death-5-2-5.jpg", "publishedAt": "2022-05-23T23:28:38Z", "content": "The 21-year-old man allegedly strangulated a 18-year-old tribal girl at her home in Valsad on Sunday before he died by suicide in a pond in Nani Sarol village of Valsad, police said after his body wa… [+1744 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sohini Ghosh", "title": "NGT-constituted panel gives clean chit to Ghogha Seaport", "description": "However, the joint committee ruled that the wastes from the beached ship were disposed of “in an environment friendly manner”.", "url": "https://indianexpress.com/article/cities/ahmedabad/ngt-constituted-panel-gives-clean-chit-to-ghogha-seaport-7932717/", "urlToImage": "https://images.indianexpress.com/2022/05/Guj-ship-2col.jpg", "publishedAt": "2022-05-23T23:22:41Z", "content": "A joint committee constituted by the National Green Tribunal (NGT)  has given a clean chit to Ghogha Seaport authorities who were allegedly violating environmental norms in the beaching of a decommis… [+3230 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Man held with 98 fake currency notes", "description": "According to police, Dilip Keshwala (20), a resident of Sola in Ahmedabad, was held with 98 fake currency notes of Rs 2,000 each. Police said that Dilip informed that he has been acting on the behest of the main conspirator who hired him as a porter.", "url": "https://indianexpress.com/article/cities/ahmedabad/man-held-with-98-fake-currency-notes-7932715/", "urlToImage": "https://images.indianexpress.com/2022/05/arrest1-14.jpeg", "publishedAt": "2022-05-23T23:13:28Z", "content": "The Ahmedabad Detection of Crime Branch (DCB) arrested a man with 98 fake Indian currency notes of Rs 2,000 denomination and unearthed a racket of using fake currency to avail money.According to poli… [+1351 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Ritu Sharma", "title": "Gujarat government indecisive, ‘dream project’ unlikely to commence in June", "description": "The statement comes six months after 70 applicants were shortlisted following a rigorous scrutiny of around 350 applications for the state government project on Public Private Partnership (PPP) mode.", "url": "https://indianexpress.com/article/cities/ahmedabad/govt-indecisive-dream-project-unlikely-to-commence-in-june-7932713/", "urlToImage": "https://images.indianexpress.com/2022/05/SCHOOLS-2-2-1.jpg", "publishedAt": "2022-05-23T23:10:07Z", "content": "The Gujarat governments ambitious Residential Schools of Excellence project has been facing delays as the schools are unlikely to commence from the new academic session starting June first week.The n… [+3145 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Prashant Kishor: ‘In the next 20-30 years, Indian politics will revolve around the BJP — you are with it or opposed to it’", "description": "At the latest edition of Express eAdda, election strategist-turned-politician Prashant Kishor spoke on why the BJP will remain a formidable electoral force in the coming decades, how the Congress needs to learn to be in Opposition and on taking the political …", "url": "https://indianexpress.com/article/india/prashant-kishor-express-adda-bjp-congress-7932554/", "urlToImage": "https://images.indianexpress.com/2022/05/Prashant-Kishor-4.jpg", "publishedAt": "2022-05-23T23:00:35Z", "content": "At the latest edition of Express eAdda, election strategist-turned-politician Prashant Kishor spoke on why the BJP will remain a formidable electoral force in the coming decades, how the Congress nee… [+13352 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Leopard sighted at Ukai power plant, four cages installed", "description": "Personnel of the Central Industrial Security Force (CISF) guarding the plant spotted the big cat on CCTV footage from cameras installed in the campus with a 12-foot high fencing wall.", "url": "https://indianexpress.com/article/cities/surat/leopard-sighted-at-ukai-power-plant-four-cages-installed-7932682/", "urlToImage": "https://images.indianexpress.com/2022/05/leopard-5-1.jpg", "publishedAt": "2022-05-23T22:50:37Z", "content": "A leopard was sighted at the Ukai thermal power plant campus in Tapi district on Sunday, after which the firest department places four cages at different locations to trap the animal.Personnel of the… [+1842 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Three injured in parasailing mishap on Daman beach", "description": "3 fell on the beach as parachute overturned in high-speed winds.", "url": "https://indianexpress.com/article/cities/surat/three-injured-in-parasailing-mishap-on-daman-beach-7932702/", "urlToImage": "https://images.indianexpress.com/2022/05/parasailing.jpeg", "publishedAt": "2022-05-23T22:47:27Z", "content": "Three people, including a minor, who were parasailing at Jampore beach in Moti Daman (Union Territory) were injured as their parachute overturned in the high-speed winds and the trio fell on the beac… [+846 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "May 24, 1982, Forty Years Ago: Bhajan Lal is CM", "description": "In a two hour drama on May 23, Bhajan Lal was sworn in as the Chief Minister by the Haryana Governor, B D Tapase, for being the leader of the “largest single party” in the assembly.", "url": "https://indianexpress.com/article/opinion/editorials/forty-years-ago-bhajan-lal-is-cm-7931069/", "urlToImage": "https://images.indianexpress.com/2022/05/express-archive-8.jpg", "publishedAt": "2022-05-23T22:45:52Z", "content": "In a two hour drama on May 23, Bhajan Lal was sworn in as the Chief Minister by the Haryana Governor, B D Tapase, for being the leader of the largest single party in the assembly. The swearing-in ren… [+1639 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Nirupama Subramanian", "title": "Quad: opportunities, challenges", "description": "Leaders of the four Quad nations are meeting in Tokyo today. A look at what's on their plate, from the war in Europe to dealing with China, and their cooperation on non-security inititaives such as tech and infra.", "url": "https://indianexpress.com/article/explained/quad-summit-opportunities-challenges-russia-ukraine-war-china-taiwan-conflict-7932567/", "urlToImage": "https://images.indianexpress.com/2022/05/modi-biden-4.jpg", "publishedAt": "2022-05-23T22:45:49Z", "content": "As the leaders of the Quadrilateral Security Dialogue grouping of Australia, Japan, India and the United States also known as the Quad meet in Tokyo Tuesday for their second in-person summit, after t… [+6948 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Report: Climate change caused extreme heat wave over India & Pakistan", "description": "The severe heat waves hampered growth of crops like wheat, spiked power demands and led to forest fires in India and triggered early melting of glaciers in what is scientifically termed as Glacial Lake Outburst Flood (GLOF) in hilly terrains of adjoining Paki…", "url": "https://indianexpress.com/article/cities/pune/report-climate-change-caused-extreme-heat-wave-over-india-pakistan-7932700/", "urlToImage": "https://images.indianexpress.com/2022/05/HEAT-4-1-2.jpg", "publishedAt": "2022-05-23T22:45:22Z", "content": "The recent extreme heat experienced over large parts of north and northwest India and Pakistan has been directly linked to human-induced activities aggravating climate change, according to a report r… [+2564 chars]"}]}