{"status": "ok", "totalResults": 404, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Udit Misra", "title": "Explained: Reading GDP growth data", "description": "Newly released provisional estimates show GDP rose 8.7% in 2021-22. While aggregates show the economy has gone past pre-pandemic levels, the recovery has not been uniform across sections.", "url": "https://indianexpress.com/article/explained/india-gdp-data-provisional-estimates-covid-pandemic-lockdown-explained-7946558/", "urlToImage": "https://images.indianexpress.com/2022/06/explained.jpg", "publishedAt": "2022-06-01T02:26:56Z", "content": "Indias gross domestic product (GDP) grew by 8.7% in 2021-22 (or FY22) according to the provisional estimates released by the Ministry of Statistics and Programme Implementation on Tuesday. This growt… [+5665 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rahel Philipose, Sonal Gupta", "title": "Daily Briefing: India’s GDP grows 8.7% in FY22; teacher’s killing in Kashmir ignites protests", "description": "From reports on India’s GDP growth estimates to the BJP’s candidates for the Rajya Sabha polls, here are the top reads of today’s edition.", "url": "https://indianexpress.com/article/live-news/top-news-briefing-today-7946556/", "urlToImage": "https://images.indianexpress.com/2022/06/Express-intro.jpg", "publishedAt": "2022-06-01T02:09:11Z", "content": "The Big Story\r\nIndias economic growth slowed in the January-March period of 2021-22 to 4.1 per cent, a four-quarter low, reflecting in part the impact of the Omicron wave of the Covid-19 pandemic on … [+4356 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Pay pension to transport staff without discrimination: Madras HC", "description": "Allowing the petitions, the judge noted that even if the pension was to be paid from and out of the pension fund, reality is that the pension fund is being paid and funded by the State government as the amount of pension fund is not sufficient to meet the req…", "url": "https://indianexpress.com/article/cities/chennai/pay-pension-to-transport-staff-without-discrimination-madras-hc-7946548/", "urlToImage": "https://images.indianexpress.com/2022/06/Madras-HC-2-3-1.jpg", "publishedAt": "2022-06-01T01:47:40Z", "content": "The Madras High Court has directed the Tamil Nadu government to pay within six months the pension due to the employees of various transport corporations in the State without any discrimination.“I am … [+3088 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Tamil Nadu CM MK Stalin slams opposition parties, says law & order under control", "description": "Rejecting the charge of the opposition parties that law and order had deteriorated in the state, he said after taking up the reins as the Chief Minister he had transformed Tamil Nadu into an Eden of Peace.", "url": "https://indianexpress.com/article/cities/chennai/tamil-nadu-cm-mk-stalin-slams-opposition-parties-says-law-order-under-control-7946544/", "urlToImage": "https://images.indianexpress.com/2022/06/MK-STALIN-1.jpeg", "publishedAt": "2022-06-01T01:39:32Z", "content": "Tamil Nadu Chief Minister M K Stalin on Tuesday slammed the opposition parties for needlessly faulting his government on the law and order issue and said the situation was stable as a result of which… [+1002 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Abhinaya Harigovind", "title": "Why did so many trees fall in Delhi? Experts have a theory", "description": "An NGT order from 2013 states that concrete within a 1 metre radius of trees is to be removed. A notice was issued in 2019 by the forest department, informing all departments and civic agencies that concretisation of trees damages them and is an offence under…", "url": "https://indianexpress.com/article/cities/delhi/severe-category-thunderstorm-why-did-so-many-trees-fall-in-delhi-experts-have-a-theory-7946418/", "urlToImage": "https://images.indianexpress.com/2022/06/delhi-storm.jpg", "publishedAt": "2022-06-01T01:33:40Z", "content": "A day after a severe category thunderstorm hit the city on Monday, pavements and roads of Lutyens Delhi were still strewn with tree branches and trunks that had snapped, and full-grown trees that wer… [+3526 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manish Sahu", "title": "Father of woman in inter-faith marriage says husband killed her", "description": "The woman's father has complained to the police that Sharif Hashmi, who had married his daughter nearly 7 years ago, had forcibly converted her to Islam and then killed her and disposed of her body.", "url": "https://indianexpress.com/article/cities/lucknow/father-woman-inter-faith-marriage-husband-killed-her-7946534/", "urlToImage": "https://images.indianexpress.com/2022/06/Indian-Express-4.jpeg", "publishedAt": "2022-06-01T00:45:49Z", "content": "Varanasi Police is planning to dispatch its teams to Bareilly and Roorkee in Uttarakhand to find about a 26-year-old woman, who is feared to be killed by her husband.The woman’s father has complained… [+2693 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Hindu litigant outfit removes father-son advocate duo", "description": "The two advocates have been at the centre of at least five ongoing cases that involve claims of ancient temple ruins in mosques — from the Teele Wali Masjid to the Bhojshala in Dhar, among others.", "url": "https://indianexpress.com/article/cities/lucknow/hindu-litigant-outfit-removes-father-son-advocate-duo-7946530/", "urlToImage": "https://images.indianexpress.com/2022/06/Gyanvapi-MosqueNEWCOV1-3.jpg", "publishedAt": "2022-06-01T00:40:45Z", "content": "Vishwa Vedic Sanatan Sangh (VVSS) president Jitendra Singh Vishen Tuesday said that the organisation has decided that senior lawyers Harishankar Jain and Vishnu Shankar Jain will no more be its couns… [+119 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Rafael Nadal beats Novak Djokovic in epic clash to reach French Open semifinals", "description": "In a see-saw contest, Djokovic regained the upper hand to open a 3-0 lead in the fourth set but Nadal would not go into a fifth set, breaking back for 4-5 before forcing a tiebreak in which he gave his opponent no chance.", "url": "https://indianexpress.com/article/sports/tennis/french-open-rafael-nada-beats-novak-djokovic-7946333/", "urlToImage": "https://images.indianexpress.com/2022/06/nadal.jpg", "publishedAt": "2022-06-01T00:37:12Z", "content": "Talks of an end to Rafael Nadal’s reign proved premature once again as the claycourt king stayed on course for a record-extending men’s 22nd Grand Slam title by beating arch rival Novak Djokovic 6-2 … [+3220 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Maulshree Seth", "title": "Adityanath claps back: ‘Kids are right… Akhilesh no different from Rahul’", "description": "On Akhilesh’s remark that BJP leaders think only about “gobar” (cow dung), Adityanath said that while Akhilesh on one hand talks about farming, he smells badbu (bad smell) in cow dung.", "url": "https://indianexpress.com/article/cities/lucknow/adityanath-claps-back-kids-akhilesh-no-different-from-rahul-7946526/", "urlToImage": "https://images.indianexpress.com/2022/06/UP.jpg", "publishedAt": "2022-06-01T00:32:46Z", "content": "Speaking during the Budget discussion in the Assembly, Adityanath said: Bache bhole bhale hote hain, lekin mann ke hote hain sacch. Bola hoga to bahut soch samajh ke hi bola hoga… Kyunki farak bahut … [+1151 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Maulshree Seth", "title": "Appeasement of none our resolve: Uttar Pradesh Chief Minister Yogi Adityanath", "description": "MLA Local Area Fund increased to Rs 5 crore; Budget passed by both Assembly and Council", "url": "https://indianexpress.com/article/cities/lucknow/appeasement-of-none-our-resolve-cm-yogi-adityanath-7946524/", "urlToImage": "https://images.indianexpress.com/2022/06/Yogi.jpg", "publishedAt": "2022-06-01T00:24:39Z", "content": "The Budget session of the UP Assembly came to an end on Tuesday with Speaker Satish Mahana adjourning the House sine-die after the budget was passed. The Legislative Council also passed the state bud… [+3275 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "13-year-old from Pune scales Kala Patthar, finishes ‘highest and toughest’ marathon", "description": "On May 27, Kawade reached the Everest base camp at an elevation of 5,364 metres, and ascended the Kala Patthar, at an elevation of 5,644.5 metres, on May 28.", "url": "https://indianexpress.com/article/cities/pune/13-year-old-pune-kala-patthar-highest-toughest-marathon-7946513/", "urlToImage": "https://images.indianexpress.com/2022/06/kala-patthar.jpg", "publishedAt": "2022-06-01T00:08:24Z", "content": "13-year-old Sai Sudhir Kawade had the look of triumph after he finished the Tenzing Hillary Everest Marathon on May 29. As many as 45 countries participated in the annual marathon and Kawade was the … [+821 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi Confidential: House Truths", "description": "As Sharad Yadav briefly interacted with the media, his little grandson ran around excitedly, while wife Rekha Yadav looked on from a distance.", "url": "https://indianexpress.com/article/delhi-confidential/sharad-yadav-vacates-tughlaq-road-bungalow-7946488/", "urlToImage": "https://images.indianexpress.com/2022/06/sharad.jpg", "publishedAt": "2022-06-01T00:04:09Z", "content": "The mood at 7, Tughlaq Road, was sombre on Tuesday with its occupant, socialist stalwart Sharad Yadav, moving out of the bungalow after over two decades. As Yadav briefly interacted with the media, h… [+1738 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Rs 10,000 crore for Bengal biggest fund allocation for railway projects, says Union Railway Minister Ashwini Vaishnaw", "description": "Minister urges state government to “work in synergy with Centrefor speedy execution of projects”.", "url": "https://indianexpress.com/article/cities/kolkata/rs-10000-crore-bengal-fund-allocation-railway-projects-minister-ashwini-vaishnaw-7946509/", "urlToImage": "https://images.indianexpress.com/2022/06/ashwini.jpg", "publishedAt": "2022-05-31T23:57:25Z", "content": "The centre has allotted Rs 10,000 crore for railway projects in West Bengal, Union Railway Minister Ashwini Vaishnaw said on Tuesday. Vaishnaw, who was addressing a gathering during Garib Kalyan Samm… [+3172 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sadaf Modak", "title": "Kiran Gosavi clicked selfie to show friends, pal called him to hear Aryan Khan’s voice: NCB", "description": "Aryan and five others were dropped as accused in the chargesheet filed by the SIT last week. Gosavi’s statement is part of the chargesheet submitted to the court.", "url": "https://indianexpress.com/article/cities/mumbai/kiran-gosavi-clicked-selfie-to-show-friends-pal-called-him-to-hear-aryan-khans-voice-ncb/", "urlToImage": "https://images.indianexpress.com/2022/06/aryan-khan-3.jpg", "publishedAt": "2022-05-31T23:49:58Z", "content": "The viral selfie of actor Shah Rukh Khans son Aryan Khan, which had first led to allegations of irregularity in the probe conducted by the Narcotics Control Bureau (NCB) in the Cordelia cruise ship d… [+2090 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "‘No entry’ for BJP in 2024 polls: West Bengal Chief Minister Mamata Banerjee", "description": "The Chief Minister also targeted the Narendra Modi government on the completion of eight years in power, saying it had started its tenure with fake promises, which has culminated in failed experiments.", "url": "https://indianexpress.com/article/cities/kolkata/no-entry-bjp-2024-polls-west-bengal-chief-minister-mamata-banerjee-7946507/", "urlToImage": "https://images.indianexpress.com/2022/06/mamata.jpg", "publishedAt": "2022-05-31T23:49:20Z", "content": "Targetting the BJP-led Centre for using central agencies to silence Opposition parties, Chief Minister Mamata Banerjee on Tuesday claimed that the BJP would find no entry across the country in the 20… [+2854 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anjali Marar", "title": "‘Cool’ May brings respite after harsh March, April", "description": "The coolest May day this year was on May 12, when the maximum temperature was 33.7 degrees Celsius, mostly due to cloudy sky conditions associated with the development of Cyclone Asani.", "url": "https://indianexpress.com/article/cities/pune/cool-may-brings-respite-after-harsh-march-april-7946503/", "urlToImage": "https://images.indianexpress.com/2022/06/PUNE-RAIN.jpg", "publishedAt": "2022-05-31T23:33:23Z", "content": "After gruelling heat during March and April, Pune city witnessed a cooler than usual May this year. The highest maximum temperature recorded in May was 40.7 degrees Celsius, making it the 13th cooles… [+2213 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Peter Vidal", "title": "Horoscope Today, June 1, 2022: Cancer, Leo, Libra and other signs — check astrological prediction", "description": "Keep remembering Taurus that it's important to do things in line with what is right ethically and morally, and you won't go far wrong. It's not that the stars punish self-interest, only that what's right for you at the moment is the same as what's right for e…", "url": "https://indianexpress.com/article/horoscope/horoscope-today-june-1-2022-cancer-leo-libra-and-other-signs-check-astrological-prediction-7941233/", "urlToImage": "https://images.indianexpress.com/2022/03/horo2121-1-1.jpeg", "publishedAt": "2022-05-31T23:30:14Z", "content": "Current planetary influences seem to be making you more confident of your ground at home. Soon you will be able to confuse people by being nice to them for a change, so put down the stick and pick up… [+3367 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Fadnavis praises Landge for ‘role’ in restarting of bullock cart races", "description": "He also said that his party will make efforts to ensure that bullock cart races do not come to a halt in the state in the future.", "url": "https://indianexpress.com/article/cities/pune/fadnavis-praises-landge-role-restarting-bullock-cart-races-7946498/", "urlToImage": "https://images.indianexpress.com/2022/06/fadnavis.jpg", "publishedAt": "2022-05-31T23:26:18Z", "content": "BJP leader and former chief minister Devendra Fadnavis on Tuesday praised the party’s Bhosari MLA Mahesh Landge for the latter’s role in ensuring that bullock cart races start again in Maharashtra.He… [+1387 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Ajay Jadhav", "title": "Pune: Over a third of sitting corporators stare at tough contest to get party tickets", "description": "\"The number of members would be more in the civic body for next five years but the delimitation and reservation of seats have hampered chances of many members to retain their place,” said a political observer.", "url": "https://indianexpress.com/article/cities/pune/over-third-of-sitting-corporators-stare-at-tough-contest-get-party-tickets-7946494/", "urlToImage": "https://images.indianexpress.com/2022/06/pune-lotterry.jpg", "publishedAt": "2022-05-31T23:20:58Z", "content": "With reservation of seats and delimitation of electoral area for the forthcoming civic polls being finalised, at least one third of sitting corporators in Pune Municipal Corporation (PMC) will have t… [+3722 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Loan recovery agent booked for sexual harassment: police", "description": "The woman has claimed that she neither knows the person who is supposed to have taken the loan nor the man who harassed her to repay the same.", "url": "https://indianexpress.com/article/cities/mumbai/loan-recovery-agent-booked-sexual-harassment-police-7946491/", "urlToImage": "https://images.indianexpress.com/2022/06/Indian-Express-3.jpeg", "publishedAt": "2022-05-31T23:11:31Z", "content": "A loan recovery agent was on Tuesday booked for allegedly sexually harassing a 48-year-old BJP leader in Mumbai.The police said the accused asked the woman to repay a loan of Rs 5,600 taken from him … [+1042 chars]"}]}