{"status": "ok", "totalResults": 105, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Noida: GNIDA conducts anti-encroachment drive on land worth Rs 40 crore", "description": "The drive was carried out against illegal constructions in Greater Noida’s Sunpura village on land worth Rs 40 crore, officials said.", "url": "https://indianexpress.com/article/cities/delhi/noida-gnida-anti-encroachment-drive-8046727/", "urlToImage": "https://images.indianexpress.com/2022/07/gnida.jpg", "publishedAt": "2022-07-23T04:08:44Z", "content": "The Greater Noida Industrial Development Authority (GNIDA) carried out an anti-encroachment drive against illegal constructions in Greater Noidas Sunpura village on Friday on land worth Rs 40 crore, … [+1340 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "5 held for sending man fake link to activate credit card, duping him of Rs 3.5 lakh", "description": "Police said an analysis of call and transaction details showed that the accused were operating from Faridabad.", "url": "https://indianexpress.com/article/cities/delhi/5-held-for-sending-man-fake-link-to-activate-credit-card-8046705/", "urlToImage": "https://images.indianexpress.com/2022/07/creditcards-759.jpg", "publishedAt": "2022-07-23T04:03:58Z", "content": "Five men were arrested for allegedly cheating a 31-year-old man of Rs 3.5 lakh by sending him a fake link to activate his credit card. Police said the accused were identified as Gurmeet Singh (31), w… [+1882 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "IMD issues red alert for central Telangana districts today", "description": "Hyderabad is likely to witness moderate to heavy rain with intense spells of heavy rains at times, IMD said", "url": "https://indianexpress.com/article/cities/hyderabad/imd-issues-red-alert-for-central-telangana-districts-today-8046703/", "urlToImage": "https://images.indianexpress.com/2022/07/telangana-rains.jpeg", "publishedAt": "2022-07-23T03:49:57Z", "content": "The India Meteorological Department (IMD) has issued a code red warning for Mahabubabad, Jangoan, Suryapet, and Yadadri Buvangiri districts in Telangana on Saturday, predicting a possibility of very … [+1523 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Yasin Malik goes on hunger strike in Tihar, alleges case not being probed properly", "description": "Malik, sentenced by a special National Investigation Agency (NIA) court in Delhi this year, is serving two life sentences and varying jail terms, all running concurrently, under the Unlawful Activities (Prevention) Act (UAPA) and the Indian Penal Code.", "url": "https://indianexpress.com/article/cities/delhi/yasin-malik-hunger-strike-tihar-jail-8046680/", "urlToImage": "https://images.indianexpress.com/2022/07/Yasin-Malik-1.jpg", "publishedAt": "2022-07-23T03:39:20Z", "content": "Kashmiri separatist leader Yasin Malik went on a hunger strike in Tihar jail on Friday, alleging that his case is not being investigated properly.Malik, sentenced by a special National Investigation … [+1501 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "6 dead after Kanwar devotees hit by truck in UP’s Hathras", "description": "One pilgrim was injured and is receiving treatment at a hospital in Agra, the police said", "url": "https://indianexpress.com/article/cities/delhi/up-dead-kanwar-devotees-accident-8046642/", "urlToImage": "https://images.indianexpress.com/2022/07/kanwar-yatra-1.jpg", "publishedAt": "2022-07-23T03:29:41Z", "content": "At least six people died after seven devotees of the Kanwar Yatra were hit by a dumper truck in Uttar Pradeshs Hathras area early on Saturday, the police said.One pilgrim was injured and is receiving… [+815 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Shamshera box office collection day 1: Shows cancelled, Ranbir Kapoor’s comeback film tanks with lower opening than Samrat Prithviraj", "description": "Shamshera box office collection day 1: Ranbir Kapoor's much-publicised return to the big screen is tanking at the ticket windows, with reports of cancelled shows and an opening day figure lower than Samrat Prithviraj.", "url": "https://indianexpress.com/article/entertainment/bollywood/shamshera-box-office-collection-day-1-ranbir-kapoor-yrf-film-flop-8046649/", "urlToImage": "https://images.indianexpress.com/2022/07/ranbir-1200.jpg", "publishedAt": "2022-07-23T03:20:52Z", "content": "Ranbir Kapoor’s first film in four years, the big-budget masala entertainer Shamshera, is underperforming at the box office. The film has opened to around Rs 10 crore on the first day of release, whi… [+1746 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Bengaluru, Karnataka Live Updates: ‘Made enough in the name of Gandhis’: Karnataka Congress leader stirs row", "description": "Covid news from Bengaluru, Karnataka, Brain heath awareness initiative, Karnataka forests, CBSE Class 12 results, indian express latest Bengaluru news updates, Karnataka news updates, monsoon updates", "url": "https://indianexpress.com/article/cities/bangalore/bengaluru-karnataka-live-updates-congress-leader-stirs-row-covid-weather-bjp-politics-8046616/", "urlToImage": "https://images.indianexpress.com/2022/07/speaker.jpg", "publishedAt": "2022-07-23T02:57:19Z", "content": "Nikita Kiran likes to keep things simple and to the point. However, the 16-year-old girl is ready to face the complexity when it comes to exploring the technology space. A coder and a badminton playe… [+1689 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Monkeypox virus could become entrenched as new STD in the US", "description": "With monkeypox so rare in the US, many infected men — and their doctors — may have attributed their rashes to some other cause.", "url": "https://indianexpress.com/article/world/monkeypox-virus-could-become-entrenched-as-new-std-us-8046596/", "urlToImage": "https://images.indianexpress.com/2022/07/monkeypox-vaccine-1.jpg", "publishedAt": "2022-07-23T01:57:05Z", "content": "The spread of monkeypox in the US could represent the dawn of a new sexually transmitted disease, though some health officials say the virus that causes pimple-like bumps might yet be contained befor… [+5755 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manoj Kumar R", "title": "Soorarai Pottru, Jai Bhim, Vikram: Suriya is the new face of Tamil cinema’s bravery", "description": "As Suriya turns 47 today, we look at some of the bold career choices that the Soorarai Pottru star made in the last two years.", "url": "https://indianexpress.com/article/entertainment/opinion-entertainment/soorarai-pottru-jai-bhim-vikram-suriya-is-the-new-face-of-tamil-cinema-bravery-8046043/", "urlToImage": "https://images.indianexpress.com/2022/07/suriya-netflix-1.jpg", "publishedAt": "2022-07-23T01:41:00Z", "content": "Actor-producer Suriya, who turned 47 today, has sort of developed the Midas touch in the past two years. It seems everything that he touches is turning into gold. And it all began with Suriya braving… [+4976 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Udit Misra", "title": "As Congress marks bank nationalisation day, a look at the politics of its economics", "description": "Nationalising private banks is arguably the single most important economic decision by any Indian government, and yet it was a result of Congress's internal politics, not an article of faith per se", "url": "https://indianexpress.com/article/political-pulse/congress-bank-nationalisation-day-politics-economics-8046223/", "urlToImage": "https://images.indianexpress.com/2022/07/RBI-Reserve-Bank-Reuters-1200-1-4.jpg", "publishedAt": "2022-07-23T01:22:06Z", "content": "On July 19, the Congress hailed the 53rd anniversary of bank nationalisation in India, undertaken by then Prime Minister Indira Gandhi. While seeking to attack the Modi government over its proposal t… [+7422 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Vallabh Ozarkar", "title": "Bullet train project: NHSRCL invites bids for construction of BKC station", "description": "The announcement of clearance had came close on the heels of sustained opposition to the project by the previous Maha Vikas Aghadi (MVA) government led by Uddhav Thackeray, who had termed it as “of no use to the people of Maharashtra”. Instead, a Mumbai-Nagpu…", "url": "https://indianexpress.com/article/cities/mumbai/bullet-train-project-nhsrcl-invites-bids-for-construction-of-bkc-station-8046549/", "urlToImage": "https://images.indianexpress.com/2022/07/bullet-train-2-2-1-1.jpg", "publishedAt": "2022-07-22T23:39:19Z", "content": "Days after the Maharashtra government announced that it has granted all permissions required for the Mumbai-Ahmedabad bullet train project considered a pet project of Prime Minister Narendra Modi the… [+2385 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Ritu Sarin", "title": "Explained | Panama Papers: The Whistleblowers", "description": "After the source of the Uber Files investigation, the whistleblower of the 2016 Panama Papers has given his first interview. What motivates such whistleblowers, and why doesn’t India have any on that scale?", "url": "https://indianexpress.com/article/explained/explained-panama-papers-the-whistleblowers-8046306/", "urlToImage": "https://images.indianexpress.com/2022/07/Panama-Papers-ex.jpg", "publishedAt": "2022-07-22T23:00:50Z", "content": "Within 10 days, two whistleblowers have gone public in interviews given to major media outlets. Is this a coincidence?It could be.\r\nOn July 13, Mark MacGann, who worked with Uber as a senior lobbyist… [+5949 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "July 23, 1982, Forty Years Ago: Resolution Delayed", "description": "Lok Sabha Speaker Balram Jakhar put off a decision on the Opposition demand to table verbatim proceedings of the Committee on Public Undertakings on the Kuo Oil deal, but announced that he would convene a meeting of leaders of parties to sort out matters.", "url": "https://indianexpress.com/article/opinion/40-years-ago/forty-years-ago-resolution-delayed-israel-bombs-beirut-8046286/", "urlToImage": "https://images.indianexpress.com/2022/07/23-Jul-1982_IE_001.jpg", "publishedAt": "2022-07-22T23:00:08Z", "content": "Lok Sabha Speaker Balram Jakhar put off a decision on the Opposition demand to table verbatim proceedings of the Committee on Public Undertakings on the Kuo Oil deal, but announced that he would conv… [+1457 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Opposition disrupts Lok Sabha over price rise, GST on packaged food", "description": "The government reiterated that it is ready to discuss the GST in the House as and when Finance Minister Nirmala Sitharaman, who is down with Covid, gets recovered and returns to Parliament.", "url": "https://indianexpress.com/article/india/opposition-disrupts-lok-sabha-over-price-rise-gst-on-packaged-food-8046532/", "urlToImage": "https://images.indianexpress.com/2022/07/parliament-5col.jpg", "publishedAt": "2022-07-22T22:47:59Z", "content": "Lok Sabha witnessed uproarious scenes for the fifth consecutive day with the Opposition disrupting the proceedings with sloganeering against the increased taxes on fuel and packaged foods. The govern… [+1588 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "Abdicating space", "description": "TMC’s abstention from V-P election makes it look churlish. It also undermines itself in a time of shrinking Opposition", "url": "https://indianexpress.com/article/opinion/editorials/tmcs-abstention-from-v-p-election-makes-it-look-churlish-8046303/", "urlToImage": "https://images.indianexpress.com/2022/07/edit-24.jpg", "publishedAt": "2022-07-22T22:29:14Z", "content": "The Trinamool Congress’s move to abstain from the vice-presidential poll shows the party in poor light. The TMC has offered two reasons in its own defence that it could not go with the NDA’s choice, … [+2529 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sourav Roy Barman", "title": "More PhD applications from SC, ST, OBC candidates at IITs in 5 years: govt data", "description": "Share of applications getting accepted by IITs remains largely same across social categories", "url": "https://indianexpress.com/article/education/more-phd-applications-from-sc-st-obc-candidates-at-iits-in-5-years-govt-data-8046419/", "urlToImage": "https://images.indianexpress.com/2022/07/iit-d-12001.jpg", "publishedAt": "2022-07-22T22:28:28Z", "content": "Over the last five years, the annual rate of PhD applications getting accepted by the IITs have remained largely the same across social categories, but the pool of aspirants, including candidates fro… [+2331 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Grand celebrations to mark 75th I-Day: Uttar Pradesh Govt", "description": "A government spokesperson said the ceremony would be held in front of the Vidhan Bhawan, where 75 different groups would perform. These groups would include folk artistes, tribal groups and various communities who would display the “diverse culture” of Uttar …", "url": "https://indianexpress.com/article/cities/lucknow/grand-celebrations-to-mark-75th-i-day-uttar-pradesh-govt-8046513/", "urlToImage": "https://images.indianexpress.com/2022/07/martyrs-day_759.jpg", "publishedAt": "2022-07-22T22:16:29Z", "content": "THE STATE government has planned grand celebrations to mark the 75th Independence Day this year by forming 75 special groups of 75 people each having representatives from 75 districts of the state, w… [+1133 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Bajrang Dal puts up ‘Haj House’ posters at Gujarat Congress HQ over Thakor remark", "description": "Addressing a party event of minority communities Wednesday, Thakor had reportedly endorsed the statement of former Prime Minister Manmohan Singh that minorities must have the first claim on the resources of the country.", "url": "https://indianexpress.com/article/cities/ahmedabad/bajrang-dal-puts-up-haj-house-posters-at-gujarat-congress-hq-over-thakor-remark-8046467/", "urlToImage": "https://images.indianexpress.com/2022/07/Guj-Cong-4col.jpg", "publishedAt": "2022-07-22T21:06:31Z", "content": "Objecting to a purported remark made by Gujarat Congress chief Jagdish Thakor earlier this week, Bajrang Dal workers Friday stuck posters on the walls of the party headquarters in Ahmedabad which sai… [+2434 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "CBSE 10 results: Nahar Rohilla, of KBDAV School, bags first position in Tricity with 99.8 pc", "description": "“I preferred class notes and practice tests for exams. I solved as many questions for the speed accuracy. My role model is my father as he supports and motivates me to pursue my dreams,” Nahar says.", "url": "https://indianexpress.com/article/education/cbse-10-results-nahar-rohilla-of-kbdav-school-bags-first-position-in-tricity-with-99-8-pc-8046459/", "urlToImage": "https://images.indianexpress.com/2022/07/Nahar-Rohill.jpg", "publishedAt": "2022-07-22T20:57:01Z", "content": "Nahar Rohilla, a student of KBDAV School, Sector 7, Chandigarh, bagged the first position in the Tricity with 99.8 per cent marks in the Class 10 results, which were declared Friday.I preferred class… [+2104 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Vince McMahon announces retirement from WWE", "description": "Vince McMahon announced his retirement from World Wrestling Entertainment Inc. after leading the company for decades.", "url": "https://indianexpress.com/article/wwe/vince-mcmahon-retirement-wwe-wrestling-8046447/", "urlToImage": "https://images.indianexpress.com/2022/07/vince-mcmahon-1.jpg", "publishedAt": "2022-07-22T20:33:38Z", "content": "Vince McMahon has said that he is retiring from WWE.There is no update as to who will take over his position but his daughter Stephanie McMahon is the current interim CEO.\r\nAs I approach 77 years old… [+2261 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Fake Documents: Mukhtar Ansari’s bail plea rejected", "description": "Mukhtar  Ansari filed a bail application in the High Court after the same was rejected by the MP/MLA court in December last year.", "url": "https://indianexpress.com/article/cities/lucknow/fake-documents-mukhtar-ansaris-bail-plea-rejected-8046451/", "urlToImage": "https://images.indianexpress.com/2022/07/mukhtar-759.jpg", "publishedAt": "2022-07-22T20:27:30Z", "content": "The Allahabad High Court has rejected the bail application of gangster-turned-politician Mukhtar Ansari in a case related to fake documents allegedly used for registration of an ambulance. The ambula… [+79 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Raakhi Jagga", "title": "For saving water: BKU Ugrahan’s dharna continues, some industrial units offer to talk", "description": "At Dhaula of Barnala district, where protesters are sitting on a dharna against the Trident group, farmers claimed that company authorities approached them for holding talks.", "url": "https://indianexpress.com/article/cities/ludhiana/for-saving-water-bku-ugrahans-dharna-continues-some-industrial-units-offer-to-talk-8046431/", "urlToImage": "https://images.indianexpress.com/2020/10/farmers-protest-3.jpg", "publishedAt": "2022-07-22T20:04:42Z", "content": "A dharna by Bharatiya Kisan Union (BKU) to raise awareness about saving water in Punjab entered into its second day on Friday, with the number of dharna sites increasing from 16 to 17 across the stat… [+2410 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "CBSE results: Maharashtra logs pass percentage of 97.41 for X and 90.48 for XII", "description": "The region fared far better than the national average of 94.40 per cent in Class 10 while it was lesser than the country average of 92.71 per cent in Class 12.", "url": "https://indianexpress.com/article/education/cbse-results-maharashtra-pass-percentage-class10-class12-8046433/", "urlToImage": "https://images.indianexpress.com/2022/06/Webp.net-resizeimage-38-10.41.52-PM-1.jpg", "publishedAt": "2022-07-22T20:01:44Z", "content": "The CBSE pass percentages in Maharashtra were recorded at 97.42 per cent for Class 10 and 90.21 per cent for Class 12, while that of the Pune region, which includes Maharashtra, Goa, Diu-Daman and Da… [+144 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sukhbir Siwach", "title": "23 IAS retiring in two years, Haryana knocks at Centre’s doors", "description": "The IAS officers whose repatriation has been sought from the Centre to Haryana are Vivek Joshi, Abhilaksh Likhi and Sukriti Likhi. The state government has also sought a two-year extension in service to three senior IAS officers — PK Das, Devender Singh and R…", "url": "https://indianexpress.com/article/cities/chandigarh/23-ias-retiring-in-two-years-haryana-knocks-at-centres-doors-8046374/", "urlToImage": "https://images.indianexpress.com/2022/07/ias.jpg", "publishedAt": "2022-07-22T19:08:41Z", "content": "Around 23 IAS officers are scheduled to retire in Haryana in nearly two years from now, prompting the state to seek extensions for three such officers, besides seeking repatriation of three others fr… [+3272 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Punjab education minister Harjot Singh Bains meets teacher unions", "description": "Harjot Singh Bains said that education department was a priority for Punjab Chief Minister Bhagwant Mann.", "url": "https://indianexpress.com/article/cities/ludhiana/punjab-education-minister-meets-teacher-unions-8046337/", "urlToImage": "https://images.indianexpress.com/2022/03/bains.jpg", "publishedAt": "2022-07-22T18:30:19Z", "content": "Punjab Education Minister Harjot Singh Bains, on Friday, held meetings with the delegations of teachers and employees unions of various cadres of the department, at Chandigarh."}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "DSP mowed down in Nuh: Third accused held", "description": "Krishan Kumar, spokesperson, Nuh police, said, “Jabid alias Billa, a resident of Gandwa village in Alwar, Rajasthan, was arrested from village Bibipur in Nuh.\"", "url": "https://indianexpress.com/article/cities/chandigarh/dsp-mowed-down-in-nuh-third-accused-held-8046298/", "urlToImage": "https://images.indianexpress.com/2022/07/dsp-pti.jpg", "publishedAt": "2022-07-22T17:17:19Z", "content": "Krishan Kumar, spokesperson, Nuh police, said, Jabid alias Billa, a resident of Gandwa village in Alwar, Rajasthan, was arrested from village Bibipur in Nuh. He was produced in a district court and t… [+1009 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Mallica Joshi", "title": "Why charges against Sisodia may strike AAP where it hurts most", "description": "Kejriwal's closest confidant and journalist-turned-activist-turned-politician, Sisodia is face of the showpiece education policy that AAP is counting on for electoral gains", "url": "https://indianexpress.com/article/political-pulse/corruption-charges-manish-sisodia-aap-hurts-most-8046285/", "urlToImage": "https://images.indianexpress.com/2022/07/arvind_assembly.jpg", "publishedAt": "2022-07-22T17:04:28Z", "content": "From a journalist to a social activist to the Deputy Chief Minister of Delhi and Arvind Kejriwal’s closest confidant, Manish Sisodia is an unlikely politician who in a short span has emerged as the f… [+3854 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sanjana Bhalerao", "title": "BMC tests 4 alternate methods to fill road potholes", "description": "Four pothole filling solutions were tried out at three sites on a road under the Eastern Freeway on Friday.", "url": "https://indianexpress.com/article/cities/mumbai/bmc-tests-4-alternate-methods-to-fill-road-potholes-8046268/", "urlToImage": "https://images.indianexpress.com/2022/07/BMC-1-1-2.jpg", "publishedAt": "2022-07-22T16:43:30Z", "content": "After facing flak over the years for using cold mix technology to fill potholes on asphalt roads in the city, the Brihanmumbai Municipal Corporation (BMC) tested several alternative methods to fill p… [+2156 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sofi Ahsan", "title": "No innocuous investigation: Meta on Whatsapp Privacy policy probe by CCI", "description": "CCI came to a prima facie conclusion in 2021 that the conduct of WhatsApp in “sharing of users’ personalised data with other Facebook companies, in a manner that is neither fully transparent nor based on voluntary and specific user consent'', appears unfair t…", "url": "https://indianexpress.com/article/cities/delhi/no-innocuous-investigation-meta-on-whatsapp-privacy-policy-probe-by-cci-8046221/", "urlToImage": "https://images.indianexpress.com/2022/07/delhi-high-court-1.jpg", "publishedAt": "2022-07-22T16:09:19Z", "content": "Meta Platforms, the owner of Facebook and WhatsApp, on Friday told the Delhi High Court that the Competition Commission of Indias (CCI) ongoing probe against it with regard to WhatsApps privacy polic… [+2780 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "ED seizes Rs 20 cr cash after raids on WB minister Partha Chatterjee’s aide", "description": "\"The said amount is suspected to be proceeds of crime of the said SSC scam,\" it said in a statement.", "url": "https://indianexpress.com/article/india/ed-seizes-rs-20-cr-cash-after-raids-on-wb-minister-partha-chatterjees-aide-8046211/", "urlToImage": "https://images.indianexpress.com/2022/07/enforcement-directorate-ed-1200-2.jpg", "publishedAt": "2022-07-22T15:40:49Z", "content": "The Enforcement Directorate Friday said it has seized Rs 20 crore in cash after raids on the premises of Arpita Mukherjee, a close associate of West Bengal Minister Partha Chatterjee, in connection w… [+538 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Explained: Significance of Ukraine, Russia UN deal to export grain on Black Sea", "description": "The deal will help clear the way for exporting millions of tons of desperately needed and to avoid a global food crisis.", "url": "https://indianexpress.com/article/explained/explained-significance-of-ukraine-russia-un-deal-to-export-grain-on-black-sea-8046143/", "urlToImage": "https://images.indianexpress.com/2022/07/Ap-ukraine-russia-deal.jpg", "publishedAt": "2022-07-22T15:28:14Z", "content": "Russia and Ukraine signed separate agreements Friday with Turkey and the U.N., clearing the way for exporting millions of tons of desperately needed Ukrainian grain as well as Russian grain and ferti… [+4228 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Ajay Devgn bags National Award for ‘Tanhaji: the Unsung Warrior’; here’s a quick recap of Battle of Sinhagad", "description": "Directed by Om Raut, the film is based on the story of Tanaji Malusare, the 17th-century Maratha warrior and general of Chhatrapati Shivaji Maharaj.", "url": "https://indianexpress.com/article/cities/pune/ajay-devgn-bags-national-award-for-tanhaji-the-unsung-warrior-heres-a-quick-recap-of-battle-of-sinhagad-8046147/", "urlToImage": "https://images.indianexpress.com/2022/07/Tanhaji-movie-review-759-1.jpg", "publishedAt": "2022-07-22T15:07:41Z", "content": "Ajay Devgn on Friday bagged the National Award for Best Actor at the 68th National Film Awards for 2020 for his titular role in ‘Tanhaji: the Unsung Warrior’. He shared the honours with Suriya, who g… [+1708 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "Man viral after going on vacation with wife’s meme-face pillow as she couldn’t join him", "description": "Raymond and Joanne Fortunado had long planned a holiday in Palawan, the Philippines. However, her work commitments stopped her from going on the trip.", "url": "https://indianexpress.com/article/trending/trending-globally/man-vacation-with-wife-face-pillow-as-she-couldnt-join-him-8045981/", "urlToImage": "https://images.indianexpress.com/2022/07/man-wife-pillow-vacation.jpg", "publishedAt": "2022-07-22T14:46:00Z", "content": "A Filipino man is being hailed as the “husband of the year” after he got creative when his wife could not join him on a vacation. Keeping his promise to take his wife wherever he goes, he took with h… [+2220 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Days After Inauguration by PM Modi, Parts Of Bundelkhand Expressway Damaged By Rain", "description": "", "url": "https://indianexpress.com/videos/news-video/days-after-inauguration-by-pm-modi-parts-of-bundelkhand-expressway-damaged-by-rain/", "urlToImage": "https://images.indianexpress.com/2022/07/Bundelkhand-Expressway-YT-copy.jpg", "publishedAt": "2022-07-22T14:44:17Z", "content": "ITBP Personnel Provide Oxygen To Pilgrims Near Sheshnag, Amarnath Yatra Route"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Johnson T A", "title": "Pre-empting BJP, dynasty charge, BSY gives up Shikaripura for son Vijayendra", "description": "BSY's announcement comes at a time when the BJP leadership has refused to budge from its stance that it cannot consider Vijayendra's poll candidature because of PM Modi's pitch against dynastic politics.", "url": "https://indianexpress.com/article/political-pulse/pre-empting-bjp-dynasty-charge-bsy-gives-up-shikaripura-for-son-vijayendra-8046127/", "urlToImage": "https://images.indianexpress.com/2022/07/Yediyurappa_Vijayendra-1.jpg", "publishedAt": "2022-07-22T14:43:33Z", "content": "Former Karnataka chief minister and veteran BJP leader B S Yediyurappa on Friday signalled his retirement from electoral politics by declaring that his youngest son B Y Vijayendra will replace him as… [+5186 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "‘I am a very cool captain’: Shikhar Dhawan opens up on his captaincy style before IND vs WI 1st ODI", "description": "West Indies took the knee before their first ODI, showing support for the ‘Black Lives Matter movement.", "url": "https://indianexpress.com/article/sports/cricket/shikhar-dhawan-opens-up-on-his-captaincy-style-before-ind-vs-wi-1st-odi-8046103/", "urlToImage": "https://images.indianexpress.com/2022/07/shikhar-dhawan.jpg", "publishedAt": "2022-07-22T14:31:29Z", "content": "Shikhar Dhawan, who is leading the Indian team in the three-match ODI series against West Indies opened up on his captaincy and stated that he is a very cool captain and will look to keep the energy … [+1672 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Disney swaps the use of ‘fairy godmothers in training’ for a more gender-neutral term", "description": "The decision was taken so that cast members that \"might not identify as female\" can still be \"part of the process to dress up and style the children without having to refer to themselves as a female Disney character\"", "url": "https://indianexpress.com/article/lifestyle/destination-of-the-week/disney-fairy-godmothers-in-training-gender-neutral-term-8046026/", "urlToImage": "https://images.indianexpress.com/2022/07/Disney-1200.jpg", "publishedAt": "2022-07-22T14:30:34Z", "content": "With gender-neutral terms gaining acceptance around the world, Disney is doing its bit to keep the conversation going. According to reports, it has done away with the popular term ‘fairy godmothers’ … [+1811 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Marrying victim, birth of child does not mitigate offence of rape: Delhi HC", "description": "The court said that merely because the accused has claimed that marriage had been performed in a temple, the same cannot “sanctify” the offence.", "url": "https://indianexpress.com/article/cities/delhi/marrying-victim-birth-of-child-does-not-mitigate-offence-of-rape-delhi-hc-8046090/", "urlToImage": "https://images.indianexpress.com/2022/07/Delhi-HC-3.jpg", "publishedAt": "2022-07-22T14:28:51Z", "content": "Dismissing the bail petition of an accused in a rape case, the Delhi High Court Friday said merely because such sexual abuse ended in tying of knot between the victim and the accused and resulted in … [+3097 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kirubhakar Purushothaman", "title": "Madonne Ashwin on winning National Film Award for Best Debut Director: ‘To find my film among all these champions gives me so much pleasure’", "description": "Madonne Ashwin won the National Film Award for Best Debut Director and Best Dialogues for his film Mandela. In a chat with indianexpress.com, the filmmaker expressed his delight at the wins.", "url": "https://indianexpress.com/article/entertainment/tamil/madonne-ashwin-on-winning-national-film-award-for-best-debut-director-8046076/", "urlToImage": "https://images.indianexpress.com/2021/04/mandela.jpg", "publishedAt": "2022-07-22T13:59:52Z", "content": "Madonne Ashwin has won the National Film Award for Best Debut Director and Best Dialogues at the 68th National Film Awards. He earned the honours for his film Mandela.Talking to indianexpress.com abo… [+1873 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "‘AAP govt promoted cartelisation to benefit liquor firms in Delhi’: BJP leader Meenakshi Lekhi", "description": "BJP leader Meenakshi Lekhi was hitting out at Chief Minister Arvind Kejriwal, who defended his deputy and excise minister Manish Sisodia after the L-G recommended a CBI probe into the 2021-22 Excise Policy.", "url": "https://indianexpress.com/article/cities/delhi/aap-govt-promoted-cartelisation-to-benefit-liquor-firms-in-delhi-bjp-leader-meenakshi-lekhi-8045980/", "urlToImage": "https://images.indianexpress.com/2022/07/kejriwal-6.jpg", "publishedAt": "2022-07-22T13:35:47Z", "content": "The Arvind Kejriwal-led AAP government violated rules and procedures and promoted cartelisation to benefit liquor firms in Delhi, union minister and senior BJP leader Meenakshi Lekhi alleged on Frida… [+1 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Atri Mitra", "title": "TMC stands firm on V-P poll abstention, but worries about blowback persist", "description": "Some senior leaders are concerned about how the move will play out in north Bengal and the effect on the party's minority vote bank.", "url": "https://indianexpress.com/article/political-pulse/tmc-stands-firm-on-v-p-poll-abstention-worries-about-blowback-persist-8046014/", "urlToImage": "https://images.indianexpress.com/2022/07/mamata-4.jpg", "publishedAt": "2022-07-22T13:34:37Z", "content": "The Trinamool Congress (TMC) is officially holding firm on its decision to abstain from the vice-presidential elections, but the move has engendered fears in the organisation that it will be viewed a… [+5245 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Flashback Friday: Sidharth Malhotra to Malaika Arora, celebs who put their best fashion foot forward this week", "description": "Here's a round-up of our favourite looks from the week that was all about glitter and glam!", "url": "https://indianexpress.com/article/lifestyle/fashion/flashback-friday-sidharth-malhotra-malaika-arora-hina-khan-aditi-rao-hydari-photos-fashion-8043988/", "urlToImage": "https://images.indianexpress.com/2022/07/feature-image-1.jpg", "publishedAt": "2022-07-22T13:30:35Z", "content": "Without further ado, lets round up the best looks from this week that left us in absolute awe.\r\nBuy Now | Our best subscription plan now has a special price\r\nMalaika Arora ensures to take her fashion… [+1413 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Subhasish Hazra", "title": "বিদেশি কোচ প্রায় চূড়ান্ত ইস্টবেঙ্গলে! ভারতে কোচিং করিয়ে যাওয়া দুজনের মধ্যেই হবে চূড়ান্ত বাছাই", "description": "ইস্টবেঙ্গলের কোচ বাছাই পর্ব প্রায় শেষ পর্যায়ে। দ্রুতই কোচের নাম জানিয়ে দেওয়া হবে ক্লাবের তরফে।", "url": "https://bengali.indianexpress.com/sports/isl-transfer-stephen-constantine-jorge-costa-are-favourites-to-be-east-bengal-coach-472535/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/East-bengal-1.jpg", "publishedAt": "2022-07-22T13:13:10Z", "content": "Stay updated with the latest news headlines and all the latest Sports news download Indian Express Bengali App.\r\nWeb Title: Isl transfer stephen constantine jorge costa are favourites to be east beng… [+7 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "‘The Master Speaks’: Vedanta exponent Swami A Parthasarathy to deliver powerful insights this Sunday", "description": "As the spiritual philosopher shares his knowledge on life and living, you find a message to \"find lasting peace and happiness amidst the trials and tribulations in this world\"", "url": "https://indianexpress.com/article/lifestyle/life-style/the-master-speaks-vedanta-exponent-swami-a-parthasarathy-8045622/", "urlToImage": "https://images.indianexpress.com/2022/07/parthasarthy.jpg", "publishedAt": "2022-07-22T13:07:25Z", "content": "Swami A Parthasarathy, believed to be one of the greatest living exponents of Vendanta, is all set to impart his powerful insights about life at 7 pm on July 24 in a worldwide online broadcast, The M… [+1294 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Sony Bravia XR OLED A80K series launched in India: Check details - The Indian Express", "description": "<ol><li>Sony Bravia XR OLED A80K series launched in India: Check details  The Indian Express\r\n</li><li>Sony BRAVIA XR OLED A80K Smart TV Series Launched in India  Beebom\r\n</li><li>Sony brings latest BRAVIA series in India  BusinessLine\r\n</li><li>Sony unveils …", "url": "https://indianexpress.com/article/technology/gadgets/sony-bravia-xr-oled-a80k-series-now-in-india-price-specifcations-8046006/", "urlToImage": "https://images.indianexpress.com/2022/07/Sony-XR-OLED-TV.jpg", "publishedAt": "2022-07-22T13:00:58Z", "content": "Sony has just launched the XR OLED A80K smart TV series in India under its Bravia lineup. The TVs come with features like 4K upscaling and Sonys Cognitive Processor XR and will be available in multip… [+1439 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Amravati chemist killing: NIA court sends seven accused to judicial custody till Aug 5", "description": "On July 15, the court had extended their NIA custody till July 22. The central agency had argued that Umesh Kolhe’s murder had “international ramifications” as the act was done with “a view to terrorise” society.", "url": "https://indianexpress.com/article/cities/mumbai/amravati-chemist-killing-nia-court-sends-seven-accused-to-judicial-custody-till-aug-5-8045767/", "urlToImage": "https://images.indianexpress.com/2022/07/umesh-kolhe-shok-sabha-bjp-1-1.jpeg", "publishedAt": "2022-07-22T12:26:51Z", "content": "Seven men booked for killing 54-year-old chemist Umesh Kolhe, allegedly over a social media post supporting former BJP spokesperson Nupur Sharmas comments against Prophet Mohammed, were Friday produc… [+1399 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "After Kim Kardashian, Lizzo wraps herself in Balenciaga caution tape", "description": "\"I don't want to be the token big girl for the fashion world. I want to open the door. I want this for everybody,\" the singer said", "url": "https://indianexpress.com/article/lifestyle/fashion/lizzo-balenciaga-caution-tape-kim-kardashian-8045036/", "urlToImage": "https://images.indianexpress.com/2022/07/Lizzo-1200.jpg", "publishedAt": "2022-07-22T12:00:43Z", "content": "Buy Now | Our best subscription plan now has a special price\r\nChannelling the same style, Lizzo took the internet by storm as she featured on the cover of Elle UK‘s September 2022 issue wrapped in Ba… [+1556 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "SC allows Centre to continue with security of Industrialist Mukesh Ambani, family in Mumbai", "description": "A bench comprising Chief Justice N V Ramana and Justices Krishna Murari and Hima Kohli allowed the appeal of the Central government challenging the Tripura High Court's direction on a PIL.", "url": "https://indianexpress.com/article/india/sc-allows-centre-to-continue-security-industrialist-mukesh-ambani-family-mumbai-8045802/", "urlToImage": "https://images.indianexpress.com/2022/04/Mukesh-ambani.jpg", "publishedAt": "2022-07-22T11:22:03Z", "content": "The Supreme Court on Friday allowed the Centre to continue with the security cover for industrialist Mukesh Ambani and his family members in Mumbai.A bench comprising Chief Justice N V Ramana and Jus… [+863 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Lack of ideology exposes bankruptcy in Opposition camp: Prakash Ambedkar", "description": "A day after the Presidential poll results which saw Droupadi Murmu striking a thumping victory with 64 per cent votes, Prakash Ambedkar expressed disappointment and questioned the working style of the Opposition parties.", "url": "https://indianexpress.com/article/india/lack-ideology-exposes-bankruptcy-opposition-camp-prakash-ambedkar-8045697/", "urlToImage": "https://images.indianexpress.com/2022/07/prakash-ambedkar-1200-1.jpg", "publishedAt": "2022-07-22T11:18:40Z", "content": "The lack of ideology and ideas have exposed the bankruptcy in the Opposition parties both at the centre and in the state and as a result, the BJP remains unchallenged on almost every front, said pres… [+3206 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Erik Ten Hag keen to bolster Man United attacking options before transfer window shuts", "description": "Manchester United begin the new campaign with a home game against Brighton & Hove Albion on August 7.", "url": "https://indianexpress.com/article/sports/ten-hag-keen-to-bolster-attacking-options-before-transfer-window-shuts-8045696/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-6.png", "publishedAt": "2022-07-22T11:01:35Z", "content": "Manchester United need to strengthen the squad before the end of the transfer window if they want to compete for silverware next season, manager Erik ten Hag said on Friday.United, who finished sixth… [+1672 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Five men arrested for interfering with anti-encroachment drive in Noida: police", "description": "Police say a group of 50-60 came to the spot in the Hindon floodplains with sticks and that some of them became aggressive and tried to start a scuffle with officials.", "url": "https://indianexpress.com/article/cities/delhi/five-men-arrested-for-interfering-with-anti-encroachment-drive-in-noida-police-8045739/", "urlToImage": "https://images.indianexpress.com/2022/07/Handcuffs-crime-1200-1.jpeg", "publishedAt": "2022-07-22T11:01:11Z", "content": "Five men were arrested for allegedly trying to interfere with an anti-encroachment drive in the Hindon floodplains in Noida on Thursday evening.Police said the accusedJaiveer Yadav, Krishna Kumar, Vi… [+1448 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Exquisite 19th century stolen painting of Maharaja Serfoji II traced to US museum", "description": "The painting, which has Raja Serfoji and his youthful son, according to some historians, was probably painted between 1822 and 1827 and kept in the Saraswathi mahal. In 1918, the Saraswathi Mahal Library was opened to the public", "url": "https://indianexpress.com/article/lifestyle/art-and-culture/exquisite-19th-century-stolen-painting-of-maharaja-serfoji-ii-traced-to-us-museum-8044989/", "urlToImage": "https://images.indianexpress.com/2022/07/raja-shivaji-or-smthng.jpeg", "publishedAt": "2022-07-22T11:00:10Z", "content": "An exquisite mid-19 century painting of Maharaja Serfoji II of Thanjavur and his son Sivaji II, stolen from Saraswathi Mahal and found its way to a museum in the US in 2006, has been traced by the id… [+3593 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Sugar output in 2022-23 may dip slightly 355 lakh tonnes: ISMA", "description": "As per the ISMA, the sugar production in 2022-23 is estimated at 355 lakh tonnes as against 360 lakh tonnes in the current marketing year ending September.", "url": "https://indianexpress.com/article/business/commodities/sugar-output-in-2022-23-may-dip-slightly-355-lakh-tonnes-isma-8045663/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-3.jpg", "publishedAt": "2022-07-22T10:56:02Z", "content": "India’s sugar production may fall slightly to 355 lakh tonnes in the 2022-23 marketing year starting October, due to diversion of sugarcane towards ethanol manufacturing, according to industry data.I… [+2049 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "No plan to extend deadline for filing income tax returns: Revenue Secy Tarun Bajaj - The Indian Express", "description": "<ol><li>No plan to extend deadline for filing income tax returns: Revenue Secy Tarun Bajaj  The Indian Express\r\n</li><li>54% tax payers yet to file ITR; 37% say difficult to do so by deadline: Survey  Economic Times\r\n</li><li>ITR filing deadline: Will there b…", "url": "https://indianexpress.com/article/business/no-plan-to-extend-deadline-for-filing-income-tax-returns-revenue-secretary-tarun-bajaj-8045629/", "urlToImage": "https://images.indianexpress.com/2022/07/income-tax-returns-1200.jpg", "publishedAt": "2022-07-22T10:56:00Z", "content": "The government is not considering extending the last date for filing income tax returns as it expects most returns to come in by the due date of July 31, a top official said on Friday.Revenue Secreta… [+2148 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Children among 7 killed in alleged Russian strike in Syria", "description": "The Syrian Observatory for Human Rights and opposition media outlet Orient TV say the airstrike in Idlib's town of Jisr al-Shoghour was carried out by a Russian warplane following four other Russian airstrikes in a town further north.", "url": "https://indianexpress.com/article/world/children-among-7-killed-in-alleged-russian-strike-in-syria-8045638/", "urlToImage": "https://images.indianexpress.com/2022/07/cover-8.jpg", "publishedAt": "2022-07-22T10:46:53Z", "content": "A monitoring rights group says a Russian warplane struck a house on Friday in northwestern Syria near the Turkish border, killing seven civilians, including four children.Syrian Civil Defense volunte… [+1073 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "CBSE 12th Results 2022: PM Modi advises students to follow ‘inner calling’", "description": "Education Minister Dharmendra Pradhan in a series of tweets emphasised that exams are not the only measure of success.", "url": "https://indianexpress.com/article/education/cbse-12th-results-2022-pm-modi-advises-students-to-follow-inner-calling-8045435/", "urlToImage": "https://images.indianexpress.com/2022/07/Modi-14.jpg", "publishedAt": "2022-07-22T10:34:11Z", "content": "Congratulating students who cleared class 12 CBSE exams, Prime Minister Narendra Modi on Friday said they should follow their inner calling and pursue subjects they are passionate about.The PM said s… [+2826 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "68th National Film Awards LIVE UPDATES", "description": "68th National Film Awards: Filmmaker Vipul Shah headed the jury for the feature film category this year.", "url": "https://indianexpress.com/article/entertainment/entertainment-others/68th-national-film-awards-winners-live-updates-8045470/", "urlToImage": "https://images.indianexpress.com/2022/07/national-film-awards.jpg", "publishedAt": "2022-07-22T10:34:00Z", "content": "The winners of the 68th National Film Awards were announced on Friday.Talking about the awards, Union Information and Broadcasting Minister Anurag Thakur told news agency ANI, “I want to congratulate… [+1229 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Yediyurappa says he will vacate Shikaripura seat; son Vijayendra to contest in 2023 Assembly polls", "description": "\"I'm not contesting, Vijayendra will be contesting from Shikaripura. I pray to the people of Shikaripura with folded hands to make him victorious with a margin bigger than mine,\" Yediyurappa said.", "url": "https://indianexpress.com/article/cities/bangalore/yediyurappa-says-he-will-vacate-shikaripura-seat-son-vijayendra-to-contest-in-2023-assembly-polls-8045636/", "urlToImage": "https://images.indianexpress.com/2020/09/BSY.jpg", "publishedAt": "2022-07-22T10:31:58Z", "content": "Karnataka BJP strongman and former Chief Minister B S Yediyurappa on Friday said his son and party’s state Vice-President B Y Vijayendra will be contesting 2023 Assembly polls from his Shikaripura co… [+1063 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Africa’s top public health body gets $100 mln from World Bank", "description": "The Africa CDC has played a major role advising African countries during the COVID-19 pandemic and is also providing guidance on diseases like monkeypox.", "url": "https://indianexpress.com/article/world/africas-top-public-health-body-gets-100-mln-from-world-bank-8045609/", "urlToImage": "https://images.indianexpress.com/2022/06/world-bank-1.jpg", "publishedAt": "2022-07-22T10:30:00Z", "content": "Africa’s main public health body, the Africa Centres for Disease Control and Prevention (Africa CDC), will receive $100 million from the World Bank to help African countries prepare for, detect and r… [+792 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "আর নিশ্চিন্তে থাকা যাচ্ছে না, আরও এক মাঙ্কিপক্স আক্রান্তের হদিশ দেশের এই রাজ্যে", "description": "করোনার দোসর মাঙ্কিপক্স। বিদেশ ফেরত যুবকের শরীরে মিলল মাঙ্কিপক্সের ভাইরাস।", "url": "https://bengali.indianexpress.com/general-news/kerala-state-reports-third-case-of-monkeypox-in-india-472446/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/Monkeypox-1.jpg", "publishedAt": "2022-07-22T10:24:46Z", "content": ", \r\n , \r\n - - \r\n - , CBI , \r\n , - \r\n , - , , , , , , ( , )\r\nStay updated with the latest news headlines and all the latest General news download Indian Express Bengali App.\r\nWeb Title: Kerala state r… [+38 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "CBSE Class 10 results 2022: J&K records highest pass percentage in Chandigarh region", "description": "97.59 per cent candidates cleared CBSE Class 10 exams in Punjab", "url": "https://indianexpress.com/article/education/cbse-class-10-results-2022-jk-records-highest-pass-percentage-8045596/", "urlToImage": "https://images.indianexpress.com/2022/07/cbseclass10.jpg", "publishedAt": "2022-07-22T10:09:55Z", "content": "The overall pass percentage in Panchkula and Chandigarh regions stood at 95.38% and 96.33% respectively, as the Central Board of Secondary Education (CBSE) announced the Class 10 results on Friday. B… [+1453 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "CBSE 10th Results 2022: Sharp increase in students scoring 90% and above", "description": "Like Class 12, Board has tabulated Class 10 results based on 30% weightage to Term 1 performance and 70% to Term 2", "url": "https://indianexpress.com/article/education/cbse-10th-results-2022-sharp-increase-in-students-scoring-90-and-above-8045589/", "urlToImage": "https://images.indianexpress.com/2022/07/cbseclass10.jpg", "publishedAt": "2022-07-22T09:59:19Z", "content": "The overall pass percentage in the Class 10 CBSE results is much lower this year. However, interestingly, a greater number of students have scored over 90% and 95%.The CBSE released the Class 10 resu… [+1971 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "CBSE 12th Result 2022: Country topper from Bulandshahr wants to study History at Delhi University", "description": "CBSE Board Class 12th Toppers List 2022: Tanya Singh (18), a student of Delhi Public School, Bulandshahr, is the joint country topper with  Yuvakshi Vig (17) from Amity International School Noida", "url": "https://indianexpress.com/article/education/cbse-12th-result-2022-country-topper-from-bulandshahr-wants-to-study-history-at-delhi-university-8045519/", "urlToImage": "https://images.indianexpress.com/2022/07/CBSE-Class-12_Tanya-Singh-copy.jpg", "publishedAt": "2022-07-22T09:47:48Z", "content": "Tanya Singh (18) from Bulandhshahr also achieved a perfect score of 500/500 in her Class 12 CBSE exams, making her the joint country topper with Yuvakshi Vig (17) from Noida.\r\nA student of Delhi Publ… [+1057 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "CBSE 12th Results 2022: ৫০০-য় ৫০০! একশো শতাংশ নম্বর পেয়ে দেশের গর্ব নয়ডার যুবাক্ষী", "description": "রেকর্ডের বন্যা বইয়ে দিয়েছেন নয়ডার স্কুলছাত্রী।", "url": "https://bengali.indianexpress.com/education/cbse-12th-results-2022-noida-girl-tops-country-with-a-perfect-score-of-500500-472394/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/CBSE-class-12-topper.jpg", "publishedAt": "2022-07-22T09:32:08Z", "content": "- ! CBSE , CBSE \r\n, , , , , “ , !”\r\nCBSE 12th Results 2022: , \r\n (CUET) \r\n , \r\nCBSE Class 12th results 2022: , . \r\n , “ ” ,"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Sawan 2022: Expert shares essential tips for fasting", "description": "\"People who fast on a regular basis frequently want to shed weight or live a healthier, longer life,\" nutritionist Bhakti Kapoor wrote on Instagram", "url": "https://indianexpress.com/article/lifestyle/health/sawan-2022-before-after-intermittent-fasting-tips-8042809/", "urlToImage": "https://images.indianexpress.com/2022/07/GettyImages-fasting-diet-plan-1200.jpg", "publishedAt": "2022-07-22T09:30:26Z", "content": "During the month of Sawan, many devotees fastevery Monday as it is believed that Lord Shiva, pleased with his worshippers, showers blessings on them during this auspicious month. The fasting practice… [+1836 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "দাউদাউ করে জ্বলছে ট্রেন, প্রাণ বাঁচাতে সেতু থেকে নদীতে ঝাঁপ! দেখুন ভিডিও", "description": "২০০ যাত্রীক কোনমতে উদ্ধার করা হয়েছে।", "url": "https://bengali.indianexpress.com/viral/boston-train-catches-fire-over-a-bridge-passengers-jump-out-of-windows-to-escape-flames-472391/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/cats-123.jpg", "publishedAt": "2022-07-22T09:28:31Z", "content": "New video shows a person in the water after an Orange Line train broke down and started smoking over the Mystic River.\r\nRiders had to climb off the train on to the tracks and walk back to the station… [+117 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "CBSE 10th Result 2022: প্রকাশিত CBSE দশমের ফলাফল, পাশের হার ৯৪.৪০ শতাংশ", "description": "গতবারের তুলনায় কমেছে পাশের হার", "url": "https://bengali.indianexpress.com/education/cbse-class-ten-result-out-term-two-472358/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/cbse1.jpg", "publishedAt": "2022-07-22T09:22:30Z", "content": "CBSE - . , CBSE \r\n , , , \r\n [ CBSE 12th Results 2022: , ] \r\n , . % , .% , .% , .% .% \r\n. –  cbse.nic.in, cbseresults.nic.in, cbse.gov.in and cbseresults.gov.in. – CBSE- ,"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Entertainment Desk", "title": "‘রণবীরের জায়গায় মেয়েরা নগ্ন হলে ছেড়ে দিতেন?’, বিতর্কের আগুন জ্বাললেন মিমি", "description": "লিঙ্গবৈষম্য নিয়ে তুখড় প্রশ্ন মিমি চক্রবর্তীর।", "url": "https://bengali.indianexpress.com/entertainment/ranveer-singhs-nude-photoshoot-mimi-chakraborty-questioned-about-women-empowerment-472357/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/mimi.jpg", "publishedAt": "2022-07-22T09:09:51Z", "content": "We talk about Equality where is that now??!!!!You know right its your perspective that can change something or destroy it https://t.co/xFCpF3qMcr this case lets broaden our perspective coz that body … [+123 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Neeraj Chopra’s World Championship main rival, Anderson Peters, started by aiming at mangoes with stones, wanted to be a sprinter like Usain Bolt", "description": "The Grenadian has the best throw in the world this year - 93.07 metres - and after topping qualifying, is a major contender in the javelin throw final.", "url": "https://indianexpress.com/article/sports/neeraj-chopras-world-championship-main-rival-anderson-peters-started-by-aiming-at-mangoes-with-stones-wanted-to-be-a-sprinter-like-usain-bolt-8045426/", "urlToImage": "https://images.indianexpress.com/2022/07/Anderson-Peters-1.jpg", "publishedAt": "2022-07-22T09:05:56Z", "content": "The 2016 Under-20 World Championships in Poland is where Neeraj Chopra and Grenada’s Anderson Peters had their first big showdown. This was two years before Peters, who has studied in the United Stat… [+4707 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Interview with Panama Papers whistleblower ‘John Doe’: Without accountability, society cannot function", "description": "So far, 'John Doe' has only spoken out publicly on one occasion, in the form of a manifesto published four weeks after the Panama Papers emerged. In it, the source called on policymakers to take action to combat global inequality. Since then, there have been …", "url": "https://indianexpress.com/article/express-exclusive/interview-panama-papers-whistleblower-john-doe-8045361/", "urlToImage": "https://images.indianexpress.com/2022/07/FO-and-BO-interviewing-JD.jpg", "publishedAt": "2022-07-22T09:00:26Z", "content": "In 2015, an anonymous whistleblower calling themself ‘John Doe’ contacted the Süddeutsche Zeitung (SZ) and leaked more than 2.6 terabytes of secret data to two reporters, including millions of intern… [+15807 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Explained Desk", "title": "Explained: What happened in the Constituent Assembly 75 years ago, when the National Flag was adopted?", "description": "Jawaharlal Nehru moved the Resolution with an emotional speech, and a large number of members gave it a rousing endorsement. The Motion was adopted to a standing ovation.", "url": "https://indianexpress.com/article/explained/how-india-national-flag-was-adopted-constituent-assembly-8045431/", "urlToImage": "https://images.indianexpress.com/2022/07/Tricolour.jpeg", "publishedAt": "2022-07-22T08:56:03Z", "content": "Three quarters of a century ago on this day, July 22, in 1947, the Constituent Assembly of India adopted the National Flag. It was a red-letter day in our history, and on Friday, Prime Minister Naren… [+8719 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shaju Philip", "title": "Kerala reports third case of monkeypox in India", "description": "State Minister for Health Veena George said the 35-year-old patient came from the UAE and reached Malappuram on July 6. He developed a fever on July 13 and later showed other symptoms of monkeypox.", "url": "https://indianexpress.com/article/cities/thiruvananthapuram/kerala-reports-third-case-of-monkeypox-in-india-8045413/", "urlToImage": "https://images.indianexpress.com/2022/07/monkeypox-4.jpeg", "publishedAt": "2022-07-22T08:39:27Z", "content": "Kerala on Friday reported the countrys third case of monkeypox in the state’s Malappuram district. The two previous cases were also reported in Kerala over the last one week.State Minister for Health… [+2215 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Manish Sisodia most honest; BJP scared of AAP’s expansion: Arvind Kejriwal after LG calls for CBI probe into Delhi Excise Policy", "description": "“I’ve known Sisodia for 22 years and I have never seen anyone as honest or as much of a deshbhakt as him,” Delhi CM Arvind Kejriwal said.", "url": "https://indianexpress.com/article/cities/delhi/sisodia-bjp-aap-expansion-kejriwal-hits-back-8045373/", "urlToImage": "https://images.indianexpress.com/2022/05/manish-sisodia-2-1-1.jpg", "publishedAt": "2022-07-22T08:34:31Z", "content": "Delhi Chief Minister Arvind Kejriwal on Friday defended Deputy Chief Minister Manish Sisodia after Lieutenant Governor VK Saxena called for a CBI probeinto the AAP governments Delhi Excise Policy and… [+1842 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Six takeaways from Thursday’s January 6 US Capitol riot hearing", "description": "Thursday's congressional committee hearing into the January 6, 2021, Capitol riot by supporters of Donald Trump featured minute-by-minute accountings of the then-president's actions as his supporters launched a violent attack.", "url": "https://indianexpress.com/article/world/six-takeaways-from-july-21-january-6-us-capitol-riot-hearing-8045369/", "urlToImage": "https://images.indianexpress.com/2022/07/trump-oval.jpg", "publishedAt": "2022-07-22T08:30:19Z", "content": "Thursday’s congressional committee hearing into the January 6, 2021, Capitol riot by supporters of Donald Trump featured minute-by-minute accountings of the then-president’s actions and inaction as h… [+4644 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Info Desk", "title": "Delhi Metro: Map, routes, fares, train timings and more", "description": "Delhi Metro latest map, routes, and train timings today: The Delhi Metro is the largest and busiest metro network in India covering a distance of 390.14 km and 286 stations, including the areas of Delhi NCR.", "url": "https://indianexpress.com/article/cities/delhi/delhi-metro-map-route-fares-timings-information-8041217/", "urlToImage": "https://images.indianexpress.com/2022/07/delhi-metro-1200-1.jpg", "publishedAt": "2022-07-22T08:28:35Z", "content": "The Delhi Metro is an urban Mass Rapid Transit (MRT) system serving Delhi-NCR regions including the cities of Ghaziabad, Faridabad, Gurgaon, Noida, Bahadurgarh, and Ballabhgarh. With a constructed ne… [+20279 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Telangana woman sets pregnant daughter-in-law ablaze, arrested", "description": "The victim, 22, is currently battling for her life at a hospital with over 50% burns and has lost the four-month-old twins she was carrying, the police said.", "url": "https://indianexpress.com/article/cities/hyderabad/telangana-woman-sets-pregnant-daughter-in-law-ablaze-arrested-8045358/", "urlToImage": "https://images.indianexpress.com/2022/07/arerst-1-6.jpg", "publishedAt": "2022-07-22T08:22:22Z", "content": "The police in Telangana’s Kamareddy district arrested a woman for allegedly setting her pregnant daughter-in-law ablaze. Keerthana, 22, suffered over 50 per cent burns, lost the four-month-old twins … [+1440 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Nothing phone (1): How to enable Music Visualisation mode for the Glyph lights", "description": "Here's how you can use your Nothing phone (1) Glyph lights as music visualisers when playing audio on the speakers.", "url": "https://indianexpress.com/article/technology/techook/nothing-phone-1-enable-secret-music-visualisation-for-glyph-lights-8045298/", "urlToImage": "https://images.indianexpress.com/2022/07/Nothing-phone-1-glyph-ie.jpg", "publishedAt": "2022-07-22T08:00:29Z", "content": "The Nothing phone (1) Glyph lights are great and offer a number of features like Flip to Glyph and Charging Meter. However, there is a secret feature thats hidden in the Glyph Interface settings that… [+1606 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Karnataka Lip-lock video: Case against 8 students", "description": "The students were booked for alleged offences punishable under Sections 376, 354, 354 (C) and 120 (B) of the IPC and different sections of the POCSO and IT Acts, police sources said.", "url": "https://indianexpress.com/article/cities/bangalore/karnataka-lip-lock-video-case-against-8-students-8045280/", "urlToImage": "https://images.indianexpress.com/2022/07/express-photo-13-5.jpeg", "publishedAt": "2022-07-22T07:51:46Z", "content": "A case has been registered by the city police against eight students for their involvement in the lip-lock competition at a private apartment in the city, a video of which had gone viral.The students… [+971 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Divya Goyal", "title": "Sidhu Moosewala murder: Body of ‘shooter’ killed in encounter cremated in the dead of night", "description": "The body of gangster Manpreet Singh Mannu was cremated  at his native Kussa village, amid heavy police security.", "url": "https://indianexpress.com/article/cities/ludhiana/sidhu-moosewala-murder-shooter-encounter-killed-cremated-night-8045285/", "urlToImage": "https://images.indianexpress.com/2022/07/cremation-1.jpg", "publishedAt": "2022-07-22T07:51:38Z", "content": "The body of gangster Manpreet Singh Mannu, one of the alleged sharpshooters who killed Punjabi singer Sidhu Moosewala, was cremated on the intervening night of Thursday and Friday at his native Kussa… [+2162 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Fake call centre case: Bengaluru Police reach out to US consulate to find citizens hit by fraud", "description": "According to a senior police officer, the fake call centres used software applications that allowed agents to target a large number of people from US databases and the “callers and bankers” would con susceptible victims into parting with funds.", "url": "https://indianexpress.com/article/cities/bangalore/fake-call-centre-case-bengaluru-police-us-consulate-8045239/", "urlToImage": "https://images.indianexpress.com/2022/07/bengaluru-police-1.jpeg", "publishedAt": "2022-07-22T07:36:10Z", "content": "The Bengaluru police have decided to contact the US consulate in Chennai for assistance in finding victims of two fake call centres targeting US citizens. The call centres were busted in Bengaluru ea… [+2772 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Google Pixel 6a vs Nothing Phone (1): A comparison of the two smartphones - The Indian Express", "description": "<ol><li>Google Pixel 6a vs Nothing Phone (1): A comparison of the two smartphones  The Indian Express\r\n</li><li>Google Pixel 6A Review: Can You Feel It?  Marques Brownlee\r\n</li><li>Rejoice, the Google Pixel 6a is here? That price tag is letting it down  Hindu…", "url": "https://indianexpress.com/article/technology/mobile-tabs/pixel-6a-vs-nothing-phone-1-price-features-specifications-compared-8045121/", "urlToImage": "https://images.indianexpress.com/2022/07/Google-Pixel-6A-vs-Nothing-Phone-1.jpg", "publishedAt": "2022-07-22T07:35:48Z", "content": "The Google Pixel 6a has now gone up for pre-order in India, after Google announced the phone earlier this year in other regions. With stock Android, a focus on user experience, upper mid-range specif… [+4859 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sanath Prasad", "title": "Karnataka: As government shifts students to ‘model school’, villagers protest", "description": "Villagers, Opposition parties and student organisations allege the Karnataka government is planning to shut down thousands of schools on the pretext of implementing its model school programme. Minister, government officials allay fears, defend pilot initiative", "url": "https://indianexpress.com/article/cities/bangalore/karnataka-model-school-baginagere-villagers-protest-8045204/", "urlToImage": "https://images.indianexpress.com/2022/07/karnataka-school.jpg", "publishedAt": "2022-07-22T07:31:10Z", "content": "The implementation of the Karnataka governments ambitious model school programme met with resistance at Baginagere village in Ramanagara district on Thursday after students from a school in the villa… [+6667 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "CBSE Class 10th Result 2022: Board ‘trying hard’ to announce today, says official", "description": "CBSE Class 10th Result 2022 Date and Time: CBSE Class 10th Result 2022 Expected to release today on cbse.nic.in, results.cbse.gov.in. Like Class 12, the Class 10 results too have been tabulated based on unequal weightage to Term 1 and Term 2 exam.", "url": "https://indianexpress.com/article/education/cbse-class-10th-result-2022-date-and-time-board-trying-hard-to-announce-today-says-official-8045080/", "urlToImage": "https://images.indianexpress.com/2022/07/CBSE-4.jpg", "publishedAt": "2022-07-22T06:54:21Z", "content": "CBSE Class 10th Result 2022 Date and Time: The Central Board of Secondary Education (CBSE) is “trying hard” to announce the Class 10 Board results today, a senior official told The Indian Express.\r\nC… [+1046 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anju Agnihotri Chaba", "title": "Explained: Despite incentives, why is DSR technique not gaining ground in Punjab?", "description": "The Punjab government has announced a Rs 1,500 per acre incentive to farmers for adopting the DSR method. But they are returning to the traditional method of puddled transplanting of rice in majority of the paddy area. Why is this?", "url": "https://indianexpress.com/article/explained/punjab-direct-sowing-rice-method-vs-puddled-transplanting-of-rice-8045101/", "urlToImage": "https://images.indianexpress.com/2022/07/Punjab-2.jpg", "publishedAt": "2022-07-22T06:33:25Z", "content": "Punjab is not only a long way away from its target of Direct Sowing of Rice (DSR) for this year (as it could only achieve 6.7% of the total target) but also the state has seen 85.7% decline in DSR ar… [+5483 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "No more girls & boys only schools in Kerala, orders child rights panel", "description": "In a landmark order, the Kerala State Commission for Protection of Child Rights directed the state government that there should only be co-education institutions in the southern state from the academic year 2023-24.", "url": "https://indianexpress.com/article/cities/thiruvananthapuram/no-more-girls-boys-only-schools-in-kerala-orders-child-rights-panel-8045077/", "urlToImage": "https://images.indianexpress.com/2022/07/school-students-express.jpg", "publishedAt": "2022-07-22T06:22:51Z", "content": "The girls-only and boys-only schools are likely to be a thing of the past in Kerala soon, as the state child rights panel ordered conversion of all educational institutions in the state into mixed sc… [+1221 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "8 arrested for offering ‘namaz’ in public in Haridwar", "description": "The accused were later granted bail by the sub-divisional magistrate's (SDM) court, they said.", "url": "https://indianexpress.com/article/india/8-arrested-namaz-public-haridwar-8045084/", "urlToImage": "https://images.indianexpress.com/2022/07/Handcuffs-crime-1200-1.jpeg", "publishedAt": "2022-07-22T06:17:14Z", "content": "Eight people were arrested for offering ‘namaz’ at a weekly market in Uttarakhand’s Haridwar, police said on Friday.The accused were later granted bail by the sub-divisional magistrate’s (SDM) court,… [+512 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sukrita Baruah", "title": "In CBSE exams after pandemic, drop in Class X, XII pass percentage", "description": "CBSE 12th Results 2022: For Class XII, fewer students scored more than 90 per cent and 95 per cent, though the same numbers rose for Class X.", "url": "https://indianexpress.com/article/education/cbse-12th-results-2022-overall-pass-percentage-dips-fewer-students-scoring-95-and-above-8045046/", "urlToImage": "https://images.indianexpress.com/2022/07/CBSE-Class-12-result-2022-3.jpg", "publishedAt": "2022-07-22T06:13:54Z", "content": "After the record results of the pandemic-hit 2021, the Central Board of Secondary Educations (CBSE) Class XII and X results were tempered this year by the return of external board examinations, with … [+3918 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sana Farzeen", "title": "Karan Johar on favouring Janhvi Kapoor over Sara Ali Khan on Koffee with Karan episode: ‘Love them both dearly’", "description": "At the trailer launch of Liger, Karan Johar spoke about the Sara Ali Khan-Janhvi Kapoor Koffee with Karan 7 episode, and the criticism that followed.", "url": "https://indianexpress.com/article/entertainment/bollywood/karan-johar-on-favouring-janhvi-kapoor-over-sara-ali-khan-on-koffee-with-karan-episode-8045056/", "urlToImage": "https://images.indianexpress.com/2022/07/Karan-Johar-Janhvi-Kapoor-Sara-Ali-Khan-1200.jpg", "publishedAt": "2022-07-22T06:11:25Z", "content": "The second episode of Koffee with Karan Season 7 had sparked a war among Sara Ali Khan and Janhvi Kapoor’s fans. The former’s fans believed that host Karan Johar was quite unfair towards her. At the … [+1184 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Akasa Air to operate its first commercial flight on Aug 7; opens ticket sales", "description": "In a statement, Akasa Air said it has opened ticket sales on 28 weekly flights it will be operating on Mumbai-Ahmedabad route from August 7, as well as on 28 weekly flights it will operating on Bengaluru-Kochi route from August 13.", "url": "https://indianexpress.com/article/business/aviation/akasa-air-to-operate-its-first-commercial-flight-on-aug-7-opens-ticket-sales-8045021/", "urlToImage": "https://images.indianexpress.com/2022/07/Akasa-air-1200-twitter.jpg", "publishedAt": "2022-07-22T06:09:17Z", "content": "New airline Akasa Air on Friday said it will launch commercial flight operations on August 7 by operating its first service on Mumbai-Ahmedabad route using Boeing 737 Max aircraft.In a statement, the… [+1072 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "Ranveer Singh goes naked for magazine shoot, memes break the internet", "description": "Posing for Paper magazine, Bollywood actor Ranveer Singh bared it all as he opened up about his true self behind the colourful, joyous public persona.", "url": "https://indianexpress.com/article/trending/trending-in-india/ranveer-singh-goes-naked-for-magazine-shoot-memes-break-the-internet-8044824/", "urlToImage": "https://images.indianexpress.com/2022/07/ranveer-singh-nude-photoshoot-memes.jpg", "publishedAt": "2022-07-22T06:07:28Z", "content": "Known for his eccentric and flamboyant sartorial choices, it is not unusual for Bollywood actor Ranveer Singh to get everyone talking about his photoshoots. However, on Thursday evening he broke the … [+3543 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "A Jan. 6 mystery: Why did it take so long to deploy the National Guard?", "description": "The House committee said in December that Meadows had “sent an email to an individual about the events on Jan. 6 and said that the National Guard would be present to ‘protect pro-Trump people’ and that many more would be available on standby.”", "url": "https://indianexpress.com/article/world/jan-6-mystery-why-did-it-take-so-long-to-deploy-the-national-guard-us-capitol-hill-attack-trump-8045022/", "urlToImage": "https://images.indianexpress.com/2022/07/us-capital-nyt-photo.jpg", "publishedAt": "2022-07-22T06:01:27Z", "content": "As the House committee investigating Jan. 6 used its prime-time hearing Thursday to document President Donald Trumps lack of forceful response to the attack on the Capitol by his supporters, it again… [+7336 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "From favourite cuisine to go-to dish to cook, Sobhita Dhulipala reveals it all in ‘AMA’ session", "description": "Dhulipala, who hails from Tenali in Andhra Pradesh, was asked about her favourite cuisine. Guess what she replied?", "url": "https://indianexpress.com/article/lifestyle/life-style/favourite-cuisine-dish-cooking-sobhita-dhulipala-travelling-ama-session-8039111/", "urlToImage": "https://images.indianexpress.com/2022/07/Sobhita-Dhulipala-1200.jpg", "publishedAt": "2022-07-22T06:00:12Z", "content": "Sobhita Dhulipala recently provided an interesting insight into her life, when she initiated an ‘ask-me-anything’ session on Instagram, wherein her fans and followers got to ask her many different ki… [+1870 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Arushi Jain", "title": "Ghar Waapsi review: A relatable, endearing show", "description": "Dice Media and Disney Plus Hotstar’s Ghar Waapsi is for anyone who has longed for the family feels from a web series.", "url": "https://indianexpress.com/article/entertainment/web-series/ghar-waapsi-review-relatable-endearing-show-8044756/", "urlToImage": "https://images.indianexpress.com/2022/07/Ghar-Waapsi-review.jpg", "publishedAt": "2022-07-22T05:25:24Z", "content": "Do you have siblings who have gone to a different city to study or for a job? Do you miss them? Or, have you become accustomed to their absence? And, when they visit during holidays or for festivals,… [+3762 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Anupam Kher to play Jayaprakash Narayan in Kangana Ranaut’s Emergency, see first look", "description": "Emergency: Anupam Kher's Jayaprakash Narayan has been introduced as the 'people's hero' in Kangana Ranaut's film.", "url": "https://indianexpress.com/article/entertainment/bollywood/anupam-kher-jayaprakash-narayan-kangana-ranaut-emergency-first-look-8044834/", "urlToImage": "https://images.indianexpress.com/2022/07/anupam-kher-1200.jpg", "publishedAt": "2022-07-22T04:34:32Z", "content": "The first look of Anupam Kher from Kangana Ranaut’s Emergency is out. The actor plays political leader Jayaprakash Narayan in the film.Kher will have an important role to play in Emergency, as Naraya… [+1516 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Nandagopal Rajan", "title": "Google Pixel 6a review: The software phone", "description": "Google Pixel 6a review: The Pixel series marks a return to India and always the focus is on hardware", "url": "https://indianexpress.com/article/technology/tech-reviews/google-pixel-6a-review-india-camera-specifications-8044741/", "urlToImage": "https://images.indianexpress.com/2022/07/Pixel6a_NEW_LEAD.jpg", "publishedAt": "2022-07-22T04:26:00Z", "content": "I have never used or reviewed a Google Pixel phone till now. So when the opportunity came to review the new Google Pixel 6a, which is actually coming to India this time, I wanted to take this phone f… [+7096 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "CBSE Class 12th Result 2022 Live Updates: Result declared at cbse.gov.in - The Indian Express", "description": "<ol><li>CBSE Class 12th Result 2022 Live Updates: Result declared at cbse.gov.in  The Indian Express\r\n</li><li>CBSE Result 2022 Live: CBSE Class 12th results out, 92.71% students pass  Hindustan Times\r\n</li><li>ICSI CS Foundation, CSEET Result 2022 Declared: …", "url": "https://indianexpress.com/article/education/cbse-class-12th-result-2022-live-updates-result-declared-toppers-pass-percentage-term-ii-cbse-gov-in-cbseresults-nic-in-8038785/", "urlToImage": "https://images.indianexpress.com/2022/07/CBSE-Class-12-result-2022-live.jpg", "publishedAt": "2022-07-22T04:11:48Z", "content": "CBSE Board Class 12th Result 2022 Live Updates: The Central Board of Secondary Education (CBSE) today released the class 12 board exam results 2022. The result are now available at official website c… [+856 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Noida: Man held for duping employer of Rs 3.25 lakh", "description": "Accused, who used to work at a grocery shop, was given Rs 3.25 lakh to purchase items for the shop but he fled with the cash, police said. More than Rs 2.37 lakh was recovered.", "url": "https://indianexpress.com/article/cities/delhi/noida-man-held-duping-employer-8044806/", "urlToImage": "https://images.indianexpress.com/2022/07/arrest-27.jpg", "publishedAt": "2022-07-22T04:11:02Z", "content": "The Noida police on Thursday arrested a man for allegedly duping his employer of Rs 3.25 lakh in cash and identified him as Pradeep Kori, a resident of Harsundi village in Hamirpur, Uttar Pradesh.Acc… [+828 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Goa BJP MLA wants 56 villages dropped from Centre’s list of eco-sensitive zones", "description": "The Union Ministry of Environment, Forests and Climate Change should drop 56 villages from a list of 99 from its draft notification on Ecologically Sensitive Areas in the Western Ghats,  BJP MLA Deviya Rane has said", "url": "https://indianexpress.com/article/cities/goa/goa-bjp-mla-56-villages-dropped-centres-eco-system-zones-8044791/", "urlToImage": "https://images.indianexpress.com/2022/07/Deviya-Rane-pic.jpg", "publishedAt": "2022-07-22T04:09:58Z", "content": "BJP MLA Deviya Rane on Thursday moved a motion in the Goa Legislative Assembly calling its attention to the issue of 56 villages in North Goas Sattari taluka being declared eco sensitive zones which,… [+2108 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Kallakurichi student death: School was running hostel without a license", "description": "Following the meeting, Saraswathy Rangasamy, the chairperson of the Commission, while addressing the reporters, informed that the school had been running the hostel on its premises without a requisite license.", "url": "https://indianexpress.com/article/cities/chennai/kallakurichi-student-death-school-was-running-hostel-without-a-license-8044787/", "urlToImage": "https://images.indianexpress.com/2022/07/Kallaikurichi-violence-2.jpeg", "publishedAt": "2022-07-22T04:03:53Z", "content": "The Tamil Nadu State Commission for Protection of Child Rights (TNCPCR) on Thursday held discussions with the district collector, superintendent of police and other officials of the Kallakurichi educ… [+1472 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Chennai News Live: Tamil Nadu reports 2,093 fresh infections, one death; parts of Chennai to face power cut today", "description": "Tamil Nadu, Chennai News Live Updates Today July 22, 2022: Parts of Chennai will face a power shutdown from 9 am to 2 pm, with supply expected to resume before 2 pm if the work is completed.", "url": "https://indianexpress.com/article/cities/chennai/chennai-news-live-tamil-nadu-chess-olympiad-covid-stalin-dmk-aiadmk-traffic-kallakurichi-8044716/", "urlToImage": "https://images.indianexpress.com/2022/07/chennai-covid-1-1.jpeg", "publishedAt": "2022-07-22T03:45:58Z", "content": "Ten days after it was sealed by revenue department officials in the wake of violence between supporters of former chief ministers Edappadi K Palaniswami and O Panneerselvam, the AIADMK headquarters a… [+1279 chars]"}]}