{"status": "ok", "totalResults": 428, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Arun Prakash", "title": "Arun Prakash writes: Agnipath, between the lines", "description": "Turmoil points to two larger absences: India doesn't have a National Security Doctrine. Armed forces have remained outside ambit of reform", "url": "https://indianexpress.com/article/opinion/columns/agnipath-scheme-armed-forces-protests-7979936/", "urlToImage": "https://images.indianexpress.com/2022/06/Agnipath-Protest-3.jpg", "publishedAt": "2022-06-20T08:52:31Z", "content": "So dreadful is the prospect of a military defeat, and so horrifying its consequences, that nations are willing to go to any length to avoid such an outcome. It is for this reason that national securi… [+6247 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "New brand of activist takes aim at Ukraine war and climate crisis, together", "description": "Led by young women from Eastern Europe, they are cornering Europe’s leaders and pressing them for a total energy embargo on Russia — to end the fighting and to save the planet.", "url": "https://indianexpress.com/article/world/new-brand-of-activist-takes-aim-at-ukraine-war-and-climate-crisis-together-7979907/", "urlToImage": "https://images.indianexpress.com/2022/06/1000-4.jpeg", "publishedAt": "2022-06-20T08:48:22Z", "content": "Emmanuel Macron, the president of France, had just finished a speech at a major conference on Europe.\r\nWhile he lingered onstage, soaking up adulation and taking pictures with fans, little did he kno… [+7528 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Madan Sabnavis", "title": "Madan Sabnavis writes: The jobs puzzle", "description": "While the government’s intent to add over a million jobs in the next 18 months is laudable, the task is audacious and challenging from both an administrative and financial point of view", "url": "https://indianexpress.com/article/opinion/columns/india-jobs-unemployment-7979910/", "urlToImage": "https://images.indianexpress.com/2022/06/Government-jobs-2.jpg", "publishedAt": "2022-06-20T08:45:15Z", "content": "Let us look at three reports that have appeared recently on the issue of jobs. The first pertains to start-ups that have begun issuing pink slips to their employees. The number given for this year so… [+6064 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Colombia elects former guerrilla Petro as first leftist president", "description": "Petro beat construction magnate Rodolfo Hernandez with an unexpectedly wide margin of more than 700,000 votes in what analysts said was a demonstration of Colombians' eagerness for efforts to combat deep inequality.", "url": "https://indianexpress.com/article/world/colombia-elects-former-guerrilla-petro-as-first-leftist-president-7979733/", "urlToImage": "https://images.indianexpress.com/2022/06/petro.jpg", "publishedAt": "2022-06-20T08:44:51Z", "content": "Leftist Gustavo Petro, a former member of the M-19 guerrilla movement, who has vowed profound social and economic change, won Colombia’s presidency on Sunday, the first progressive to do so in the co… [+4870 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Deep Mukherjee", "title": "Rajasthan HC to mark Yoga Day for first time, invites judges for PM speech", "description": "Initially, the court had invited sitting and former judges, advocates and staff to participate in a yoga session from 7 am to 7:45 am to mark the day. A second circular was later issued for attending a telecast of the PM's speech.", "url": "https://indianexpress.com/article/cities/jaipur/rajasthan-hc-to-mark-yoga-day-for-first-time-invites-judges-for-pm-speech-7979928/", "urlToImage": "https://images.indianexpress.com/2021/10/rajasthan-hC-1200.jpg", "publishedAt": "2022-06-20T08:41:44Z", "content": "THE Rajasthan High Court has invited its sitting and former judges to the Court complex to attend a live telecast of Prime Minister Narendra Modis address on International Yoga Day on June 21 at 6:30… [+2083 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Partha Sarathi Biswas", "title": "Global warming increases frequency of lightning strikes: Study", "description": "The study by Murari Lal, a climate change expert at RMSI, advocates putting in place a system where warnings can be issued to help reduce fatalities to lightning.", "url": "https://indianexpress.com/article/cities/pune/global-warming-increases-frequency-of-lightning-strikes-study-7979693/", "urlToImage": "https://images.indianexpress.com/2022/06/FILE-14.png.png", "publishedAt": "2022-06-20T08:39:52Z", "content": "Global warming can cause more lightning incidents as every rise in surface temperature by 1 degree Celsius may lead to a rise in the frequency of lightning events by 12 per cent, a study has found.A … [+2407 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Bhuvneshwar Kumar was special through the series: Mark Boucher", "description": "South African coach believes Bhuvneshwar Kumar's brilliant outing in the series took the series away from them.", "url": "https://indianexpress.com/article/sports/cricket/bhuvneshwar-was-special-through-the-series-mark-boucher-bhuvneshwar-kumar-mark-boucher-aiden-markram-ind-vs-sa-t20i-7979869/", "urlToImage": "https://images.indianexpress.com/2022/06/Untitled-design-7.jpg", "publishedAt": "2022-06-20T08:36:16Z", "content": "South Africa head coach Mark Boucher termed India seamer Bhuvneshwar Kumar’s performance in the series as special while ruing the absence of Aiden Markram, who he feels could have made a lot of diffe… [+2732 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Amitabh Sinha", "title": "Explained: How lightning kills, and how to be safe when it strikes?", "description": "With several deaths being reported due to lightning across India, we take a look at how it strikes and what precautions can be taken against it.", "url": "https://indianexpress.com/article/explained/explained-lightning-strikes-kills-precautions-7979880/", "urlToImage": "https://images.indianexpress.com/2022/06/17063-pti06_17_2022_000266b.jpg", "publishedAt": "2022-06-20T08:27:02Z", "content": "Seventeen people have been killed by lightning over the past 24 hours in different parts of Bihar. Maximum six deaths were reported from Bhagalpur district, followed by three in Vaishali, and two eac… [+5306 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Bengaluru: Man cheats people by posing as Union minister Shobha Karandlaje’s aide, probe on", "description": "The minister’s personal assistant complained to the Bengaluru police that a fraudster had been collecting lakhs of rupees from various people in Karandlaje’s name.", "url": "https://indianexpress.com/article/cities/bangalore/bengaluru-man-cheats-people-union-minister-shobha-karandlaje-aide-7979877/", "urlToImage": "https://images.indianexpress.com/2022/06/shobha-karandlaje.jpg", "publishedAt": "2022-06-20T08:23:24Z", "content": "A police complaint has been filed by the personal assistant of Union Minister of State for Agriculture Shobha Karandlaje against a fraudster allegedly using her name to collect funds from landowners … [+1021 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Bashaarat Masood", "title": "Two more militants killed in overnight gunfight in J-K’s Kupwara, another eliminated in South Kashmir", "description": "The police said that the two militants were killed in a gunfight that started on Sunday afternoon in the Lolab forests in the frontier district of Kupwara.", "url": "https://indianexpress.com/article/cities/jammu/two-more-militants-killed-in-overnight-gunfight-in-j-ks-kupwara-another-eliminated-in-south-kashmir-7979866/", "urlToImage": "https://images.indianexpress.com/2018/08/army1200.jpg", "publishedAt": "2022-06-20T08:22:34Z", "content": "An arrested militant was among the two more militants gunned down in an overnight gunfight in North Kashmir’s Kupwara taking the number of those killed by security forces to four, according to the Ja… [+1708 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "Bizarre blue spiral light formations appear over New Zealand skies, leave netizens awestruck", "description": "Theories proposed by users on social media groups included \"wormhole\", \"rocket exhaust fumes\", and \"rocket spinning out of control\".", "url": "https://indianexpress.com/article/trending/trending-globally/bizarre-blue-spiral-light-formations-appear-over-new-zealand-skies-7979855/", "urlToImage": "https://images.indianexpress.com/2022/06/Trending-Card-2-3.jpg", "publishedAt": "2022-06-20T08:21:02Z", "content": "Stargazers in New Zealand were left astounded and puzzled by bizarre, spiral light formations in the sky on Sunday night. Social media is abuzz with photographs showing the rare phenomenon and theori… [+2067 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "FIFA to use AI to combat online hate speech aimed at players during Qatar World Cup", "description": "The Qatar 2022 FIFA World Cup is due to take place from November 21 to December 18.", "url": "https://indianexpress.com/article/sports/football/fifa-to-use-ai-to-combat-online-hate-speech-aimed-at-players-during-qatar-world-cup-7979854/", "urlToImage": "https://images.indianexpress.com/2022/06/Untitled-design-3-5.jpg", "publishedAt": "2022-06-20T08:18:37Z", "content": "Football’s governing body FIFA has announced that it will work with FIFPRO, the worldwide representative organisation for professional footballers, on a plan to better protect individuals with the Qa… [+1971 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "PM Modi to inaugurate Centre for Brain Research, lay foundation stone of 800-bed hospital in Bengaluru today", "description": "CBR was established in 2014 as an institution dedicated to study the numerous aspects of the functioning of the brain.", "url": "https://indianexpress.com/article/cities/bangalore/pm-modi-to-inaugurate-centre-for-brain-research-lay-foundation-stone-of-800-bed-hospital-in-bengaluru-today-7979692/", "urlToImage": "https://images.indianexpress.com/2022/06/WhatsApp-Image-2022-06-20-at-12.38.37-PM.jpg", "publishedAt": "2022-06-20T08:18:08Z", "content": "Prime Minister Narendra Modi, who is on a two-day visit to Karnataka, Monday will inaugurate the Centre for Brain Research (CBR) and Super Computing Facility and also lay the foundation stone for Bag… [+3204 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rinku Ghosh", "title": "Chhavi Mittal: Most cancers are curable but the healing journey depends on you", "description": "When she hosted a webinar on breast cancer, little did actor-producer Chhavi Mittal know that she would be diagnosed with it a fortnight later. Always used to seeing the brighter side of life, she used that knowledge to focus on getting better. She boldly doc…", "url": "https://indianexpress.com/article/lifestyle/health/chhavi-mittal-most-cancers-are-curable-but-the-healing-journey-depends-on-you-7979864/", "urlToImage": "https://images.indianexpress.com/2022/06/cancer-3.jpg", "publishedAt": "2022-06-20T08:16:10Z", "content": "Chhavi Mittal doesnt believe in taking a weekend off like any other content creator who has a deadline to meet Monday morning. Shes busy instructing her staff and okaying papers in between our call. … [+8314 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "CLAT 2022 answer key released: Check steps to download, raise objection", "description": "The expected cut-offs for CLAT 2022 for general category candidates are likely to be around 100-105 for the top 3 NLUs. CLAT result 2022 is likely to be declared in the fourth week of June 2022.", "url": "https://indianexpress.com/article/education/clat-2022-answer-key-released-steps-to-download-raise-objection-consortiumofnlus-ac-in-7979805/", "urlToImage": "https://images.indianexpress.com/2022/06/answer-key-1200-1.jpg", "publishedAt": "2022-06-20T08:13:21Z", "content": "The Consortium of National Law University (NLUs)  released the CLAT 2022 answer key for both UG and PG entrance exams today. The CLAT 2022 answer key is available at consortium onlus.ac.in. Candidate… [+1489 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manoj Dattatrye More", "title": "Ailing BJP MLAs rush to Mumbai from Pune to vote in Legislative Council polls, say party comes first", "description": "While Kasba Peth MLA Mukta Tilak reached the Vidhan Bhawan in Mumbai around 11.15 am, Pimpri-Chinchwad MLA Laxman Jagtap, according to his office, left his constituency around 11 am and is expected to reach the state capital around 2.30 pm.", "url": "https://indianexpress.com/article/cities/pune/ailing-bjp-mlas-rush-to-mumbai-from-pune-to-vote-in-legislative-council-polls-say-party-comes-first-7979766/", "urlToImage": "https://images.indianexpress.com/2022/06/bjp-1-1.jpg", "publishedAt": "2022-06-20T08:11:47Z", "content": "The two ailing Bharatiya Janata Party (BJP) MLAs, for whom the party has made medical arrangements enabling them to vote in the Maharashtra Legislative Council polls, rushed to Mumbai from Pune on Mo… [+2419 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Loopholes and missing data: The gaps in the gun background check system in the US", "description": "The massive system already has major loopholes advocated by gun manufacturers to maintain easier access to firearms. The Senate’s proposed gun reform measures could fall victim to those same limitations.", "url": "https://indianexpress.com/article/world/us-gun-violence-background-check-system-7979626/", "urlToImage": "https://images.indianexpress.com/2022/06/NYT-.png", "publishedAt": "2022-06-20T08:10:00Z", "content": "Written by Glenn Thrush and Serge F. KovaleskiThe bipartisan gun control billbeing hashed out in the Senate this weekend leans heavily on a muscular but mistake-plagued bureaucratic workhorse familia… [+11555 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Varinder Bhatia", "title": "Cong withdrawal gives AAP an opening in Haryana civic polls", "description": "Elections were held in 46 municipal bodies across Haryana, with results to be declared on June 22. The Congress did not field any candidates, though some are contesting with the party's support.", "url": "https://indianexpress.com/article/political-pulse/cong-withdrawal-gives-aap-an-opening-in-haryana-civic-polls-7979833/", "urlToImage": "https://images.indianexpress.com/2022/06/Haryana-4.jpg", "publishedAt": "2022-06-20T08:08:56Z", "content": "Elections were held in 46 municipal bodies across Haryana, with results to be declared on June 22. The Congress did not field any candidates, though some are contesting with the party’s support. Whil… [+3285 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Careers360", "title": "NCHM JEE 2022: Check previous year’s cutoff", "description": "The authority will announce the result on the official website at ntaresults.nic.in. Candidates can check the results by entering their application number, and date of birth.", "url": "https://indianexpress.com/article/education/nchm-jee-2022-check-previous-years-cutoff-result-date-ntaresults-nic-in-7979698/", "urlToImage": "https://images.indianexpress.com/2022/06/NEET-PG-2022-2.jpg", "publishedAt": "2022-06-20T07:59:32Z", "content": "The National Testing Agency (NTA) conducted the NCHM JEE on June 18, 2022 and results will soon be announced on the official website at ntaresults.nic.in. Candidates can check the results by entering… [+1518 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Fire breaks out at ATM kiosk in Pune’s Upper Indiranagar", "description": "The blaze at the kiosk near Dolphin Chowk was brought under control in five minutes and no one was injured, Pune fire brigade officials said, adding that the money inside two cash dispensers was gutted.", "url": "https://indianexpress.com/article/cities/pune/fire-atm-upper-indiranagar-7979825/", "urlToImage": "https://images.indianexpress.com/2022/06/fire.jpg", "publishedAt": "2022-06-20T07:54:52Z", "content": "A fire broke out at an Automatic Teller Machine (ATM) kiosk located in the densely populated area of Upper Indiranagar in Pune on Monday morning, fire brigade officials said. While no casualties were… [+89 chars]"}]}