{"status": "ok", "totalResults": 751, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Amil Bhatnagar", "title": "Dadri lynching: Case picks up pace after seven years, Akhlaq’s daughter records testimony", "description": "Shaista in her testimony has named accused who allegedly harassed the family following the incident and narrated her account of seeing Akhlaq being dragged out of the house by a mob and beaten up.", "url": "https://indianexpress.com/article/cities/delhi/dadri-lynching-case-pace-seven-years-akhlaq-daughter-records-testimony-7972061/", "urlToImage": "https://images.indianexpress.com/2022/06/dadri-lynching-4.jpg", "publishedAt": "2022-06-15T14:46:00Z", "content": "The Dadri lynching victims daughter recorded her statement for the second day on Wednesday as the trial picked up pace after seven years. Shaista (27), daughter of Mohammad Akhlaq who was beaten to d… [+1770 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Harish Damodaran", "title": "Explained: Why the UAE has ‘suspended’ re-export of Indian wheat-milling", "description": "\"India doesn't want its wheat exported to Dubai or Abu Dhabi to go out to other countries, whether as grain or flour. It would want that wheat to be consumed locally, including the migrant Indian workers in UAE,\" trade sources told The Indian Express.", "url": "https://indianexpress.com/article/explained/explained-why-the-uae-has-suspended-re-export-of-indian-wheat-milling-7972065/", "urlToImage": "https://images.indianexpress.com/2022/06/wheat-explained.jpg", "publishedAt": "2022-06-15T14:41:54Z", "content": "“India doesn’t want its wheat exported to Dubai or Abu Dhabi to go out to other countries, whether as grain or flour. It would want that wheat to be consumed locally, including the migrant Indian wor… [+1816 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aanchal Magazine", "title": "Explained: ‘Temporary visitors’ and ‘migrants’ — how they moved during the pandemic", "description": "Females recorded a higher share of migration rate of 47.9 per cent, with 48 per cent in rural areas and 47.8 per cent in urban areas. The migration rate for males was seen at 10.7 per cent", "url": "https://indianexpress.com/article/explained/explained-temporary-visitors-and-migrants-how-they-moved-during-the-pandemic-7972060/", "urlToImage": "https://images.indianexpress.com/2022/06/delhi-migrants-1200.jpg", "publishedAt": "2022-06-15T14:32:35Z", "content": "After the onset of the Covid-19 pandemic in March 2020, 0.7 per cent of the countrys population was recorded as a temporary visitor across households during the July 2020-June 2021 period, a report n… [+3220 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Deep Mukherjee", "title": "Another OBC quota stir in Rajasthan puts Gehlot govt in a spot ahead of 2023 polls", "description": "The five communities protesting now -- Saini, Kushwaha, Mali, Maurya and Shakya – have been demanding 12 per cent reservation", "url": "https://indianexpress.com/article/political-pulse/obc-quota-stir-in-rajasthan-puts-gehlot-govt-in-a-spot-ahead-of-2023-polls-7972046/", "urlToImage": "https://images.indianexpress.com/2022/06/Gehlot-2.jpg", "publishedAt": "2022-06-15T14:31:00Z", "content": "As traditionally clad men and women from five OBC communities in Rajasthan held sticks and laid siege to the Jaipur-Agra highway in Bharatpur on June 12 to demand separate reservation, the scene was … [+3542 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Roshni Chopra shares how to make crispy bhindi without deep frying", "description": "Try this quick and delicious recipe for crispy bhindi today!", "url": "https://indianexpress.com/article/lifestyle/food-wine/roshni-chopra-crispy-bhindi-recipe-without-deep-frying-7966987/", "urlToImage": "https://images.indianexpress.com/2022/06/roshni-1200-1.jpg", "publishedAt": "2022-06-15T14:30:16Z", "content": "Bhindi or ladyfinger is a versatile vegetable that can be made in numerous ways. While some love it soft and coated with different spices, others prefer crispy bites as a mid-day snack option or an a… [+989 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Your Daily Wrap: Oppn deliberates on Presidential candidate, ED grills Rahul Gandhi for 3rd straight day; and more", "description": "From Sharad Pawar saying no to becoming the Opposition candidate for the Presidential polls to Rahul Gandhi appearing before the ED for the third consecutive day, here are the top stories of today.", "url": "https://indianexpress.com/article/india/your-daily-wrap-oppn-presidential-candidate-ed-rahul-gandhi-3rd-straight-day-7972018/", "urlToImage": "https://images.indianexpress.com/2022/06/Untitled-design-40.jpg", "publishedAt": "2022-06-15T14:24:56Z", "content": "Who will be the Opposition candidate for the upcoming Presidential polls? To deliberate on this, senior leaders of several Opposition parties, including the Congress and the Trinamool Congress, met W… [+3920 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "Pakistani man’s beautiful rabab cover of song from Fanaa wows all online", "description": "Siyal Khan, a young Pakistani artist was seen playing a soulful rendition of 'Mere Haath Mein Tera Haath Hai' sitting against picturesque views.", "url": "https://indianexpress.com/article/trending/trending-globally/rabab-mere-haath-mein-tera-haath-hai-cover-pak-man-7971985/", "urlToImage": "https://images.indianexpress.com/2022/06/rabab-cover-pak.jpg", "publishedAt": "2022-06-15T14:23:01Z", "content": "Separated by geographical borders, the people of India and Pakistan are often connected over their love for music, mostly folk and Bollywood songs. Now, in a beautiful video, a man from across the bo… [+1443 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Debraj Deb", "title": "Tripura Congress locks local ED office in protest against summons to Rahul Gandhi", "description": "The Congress party Wednesday alleged that the entire episode of charging Rahul Gandhi in the National Herald case is \"politically motivated\".", "url": "https://indianexpress.com/article/north-east-india/tripura/tripura-congress-locks-local-ed-office-protest-summons-rahul-gandhi-7972053/", "urlToImage": "https://images.indianexpress.com/2022/06/ed.jpg", "publishedAt": "2022-06-15T14:22:14Z", "content": "The Tripura unit of Congress Wednesday protested in front of the local Enforcement Directorate (ED) office for serving a notice and interrogating Congress leader Rahul Gandhi in the National Herald c… [+174 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Azadi Ka Amrit Mahotsav tour: Karnataka minister says state, Centre didn’t ask to select Hindi-speaking students", "description": "A controversy erupted after a circular by the Deputy Director for Pre-University Education Department (Bengaluru South) instructed colleges to choose students who can speak Hindi for the tour.", "url": "https://indianexpress.com/article/cities/bangalore/azadi-ka-amrit-mahotsav-tour-karnataka-minister-hindi-speaking-students-7972044/", "urlToImage": "https://images.indianexpress.com/2022/06/BC-Nagesh-1-1-1.jpg", "publishedAt": "2022-06-15T14:18:02Z", "content": "Following reports of the government reportedly selecting only Hindi-speaking students for the ‘Azadi Ka Amrit Mahotsav’ tour programme, Karnataka Primary and Secondary Education Minister B C Nagesh W… [+1550 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "B Praak’s newborn baby passes away", "description": "In April, B Praak and his wife Meera had shared a pregnancy post on Instagram. The singer shared on Wednesday that his newborn has passed away.", "url": "https://indianexpress.com/article/entertainment/bollywood/b-praak-newborn-baby-passes-away-7972048/", "urlToImage": "https://images.indianexpress.com/2022/06/b-praak.jpg", "publishedAt": "2022-06-15T14:16:46Z", "content": "Singer B Praak took to Instagram on Wednesday to share that his baby passed away at the time of birth.His note on Instagram read, “With deepest pain, we have to announce that our newborn baby has pas… [+827 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Karnataka HC upholds dropping of charges by police against CSI bishop in POCSO case", "description": "The CSI bishop had been named along with four others in a complaint of attack filed by a woman in the year 2015 but the Bengaluru police had not named the bishop in a chargesheet filed in the case.", "url": "https://indianexpress.com/article/cities/bangalore/karnataka-hc-upholds-dropping-charges-police-csi-bishop-pocso-case-7972038/", "urlToImage": "https://images.indianexpress.com/2022/06/karnataka-HC-1.jpg", "publishedAt": "2022-06-15T14:12:47Z", "content": "The Karnataka High Court has upheld a police probe which did not press criminal charges under the Indian Penal Code (IPC) and the Protection of Children from Sexual Offences (POCSO) Act against a bis… [+1718 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ANURADHA MASCAREHNAS", "title": "Covaxin booster can protect against Omicron variants BA.1.1 and BA.2: ICMR study", "description": "The booster dose was found to improve the neutralising antibody response against the Delta variant and both the Omicron sub-variants of the coronavirus.", "url": "https://indianexpress.com/article/lifestyle/health/covaxin-booster-protect-omicron-variants-ba-1-1-and-ba-2-icmr-study-7972030/", "urlToImage": "https://images.indianexpress.com/2022/06/Covaxin-1-3.jpeg", "publishedAt": "2022-06-15T14:04:01Z", "content": "A new study conducted by the Indian Council of Medical Research (ICMR), the National Institute of Virology (NIV) and Bharat Biotech has shown that a Covaxin booster dose is effective against both the… [+3378 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Deutsche Welle", "title": "From Covid to war: Will travel become more expensive?", "description": "The pandemic remains ongoing; there's a war in Europe, and inflation is soaring. In such challenging times, many people are longing for a vacation. But taking off on holiday isn't as easy as it used to be", "url": "https://indianexpress.com/article/lifestyle/destination-of-the-week/from-covid-to-war-will-travel-become-more-expensive-7969919/", "urlToImage": "https://images.indianexpress.com/2022/06/Travel_DW.jpg", "publishedAt": "2022-06-15T14:00:00Z", "content": "The pandemic still hasn’t ended, there’s a war in Europe and inflation is soaring. In challenging times like these, many people are longing for a vacation. Yet even going on holiday isn’t as easy as … [+5848 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Bloomberg", "title": "YouTube reaches 1.5 billion users of shorts, its TikTok rival", "description": "YouTube's focus on Shorts is part of a broader trend in social media to challenge ByteDance Ltd.’s TikTok for the attention of viewers and creators.", "url": "https://indianexpress.com/article/technology/social/youtube-reaches-1-5-billion-users-of-shorts-its-tiktok-rival-7972026/", "urlToImage": "https://images.indianexpress.com/2022/06/YouTube-shorts-billion-users-220615.jpg", "publishedAt": "2022-06-15T13:59:36Z", "content": "YouTube said it has reached more than 1.5 billion monthly logged-in viewers of Shorts, its short-form video feature that launched in late 2020 as a response to the surging popularity of TikTok.The vi… [+1200 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manas Srivastava", "title": "UPSC Essentials- Historical Tidbits: Three international disciples of Mahatma Gandhi", "description": "Many great international personalities have made a difference in the world being inspired by Mahatma Gandhi. UPSC aspirants must look into the profiles of these three lesser-mentioned names in the History books.", "url": "https://indianexpress.com/article/upsc-current-affairs/upsc-essentials/upsc-essentials-historical-tidbits-3-disciples-of-mahatma-gandhi-7971260/", "urlToImage": "https://images.indianexpress.com/2022/06/Untitled-design-24-2.jpg", "publishedAt": "2022-06-15T13:59:31Z", "content": "Among the most popular international personalities that Gandhi inspired were Nelson Mandela and Martin Luther King Jr. However, some other prominent disciples are often overlooked. The Indian Express… [+5995 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Suriya gets nostalgic after shooting for Akshay Kumar’s Soorarai Pottru remake: ‘Enjoyed every minute…’", "description": "Suriya will make a cameo appearance in the Hindi remake of Soorarai Pottru, which is headlined by Akshay Kumar.", "url": "https://indianexpress.com/article/entertainment/tamil/suriya-gets-nostalgic-after-shooting-for-akshay-kumar-soorarai-pottru-remake-7971982/", "urlToImage": "https://images.indianexpress.com/2022/06/suriya-akki.jpg", "publishedAt": "2022-06-15T13:58:18Z", "content": "Actor-filmmaker Suriya on Wednesday shot for the Hindi remake of his critically acclaimed film Soorarai Pottru. He will make a cameo appearance in the movie, which is headlined by Bollywood star Aksh… [+1673 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Debraj Deb", "title": "Tripura bypolls: BJP files complaint against TMC for using state museum photo in advertisement", "description": "The four constituencies where the bypolls are slated to be held are Agartala, Town Bordowali, Surma and Yubrajnagar.", "url": "https://indianexpress.com/article/north-east-india/tripura/tripura-bypolls-bjp-files-complaint-tmc-using-state-museum-photo-advertisement-7972023/", "urlToImage": "https://images.indianexpress.com/2022/03/banner-1.jpg", "publishedAt": "2022-06-15T13:56:46Z", "content": "Amid allegations of political violence in the run up to the bypolls in the four Assembly segments in Tripura, the state unit of BJP lodged a complaint with the Chief Electoral Officer against Trinamo… [+2173 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Man Aman Singh Chhina", "title": "Ex-jawans slam Agnipath: Don’t experiment with Army, what if they join gangsters after four years?", "description": "The Indian Express speaks to a cross-section of ex-servicemen who have served as jawans and find that they disapprove of the new plan to hire soldiers for four-year terms and retain only 25 per cent of the intake for full pensionable service.", "url": "https://indianexpress.com/article/india/ex-jawans-slam-agnipath-dont-experiment-with-army-7972007/", "urlToImage": "https://images.indianexpress.com/2022/06/indian-army-1-1.jpg", "publishedAt": "2022-06-15T13:51:25Z", "content": "Ex-servicemen associations in Punjab and Haryana have hit out at the Agnipath scheme for Army recruitment saying it is akin to playing with the career of the youth and cautioned the government agains… [+3759 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Karnataka HC reserves verdict on Xiaomi plea against ED seizure of bank accounts in forex violation case", "description": "Xiaomi India approached the high court last month stating that the payment of Rs 5,500 crore to three foreign companies since 2016 did not contravene the FEMA law.", "url": "https://indianexpress.com/article/cities/bangalore/karnataka-hc-reserves-verdict-on-xiaomi-plea-against-ed-seizure-of-bank-accounts-forex-violation-7972013/", "urlToImage": "https://images.indianexpress.com/2022/06/Xiaomi_LOGO_Reuters.jpg", "publishedAt": "2022-06-15T13:49:30Z", "content": "The Karnataka High Court Wednesday reserved its verdict in a plea filed by Xiaomi Technology India Private Limited against a move by the Enforcement Directorate (ED) for seizure of bank accounts of X… [+2239 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi reports 1,375 new Covid cases, positivity rate climbs to 7.01%", "description": "The daily incidence increased from 500 to over 1,000 in seven days during the current surge. To compare, it took only three days for a similar change in April when the cases spiked a little after mask mandates were done away with.", "url": "https://indianexpress.com/article/cities/delhi/delhi-reports-1375-new-covid-cases-positivity-rate-climbs-7971977/", "urlToImage": "https://images.indianexpress.com/2022/06/Delhi-covid-1.jpg", "publishedAt": "2022-06-15T13:45:54Z", "content": "The number of Covid-19 cases in the capital shot up over the last two days, with 1,375 cases recorded on Wednesday. The positivity rate proportion of samples tested that returned positive, indicative… [+1451 chars]"}]}