{"status": "ok", "totalResults": 367, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Chandigarh: Man found dead due to suspected drug overdose", "description": "Sabbar was a daily wage labourer, who worked as a plumber and attended to complaints on a daily basis. He had not gone to his house since evening and did not answer the phone calls of his wife, brother and father.", "url": "https://indianexpress.com/article/cities/chandigarh/chandigarh-man-found-dead-due-to-suspected-drug-overdose-7902034/", "urlToImage": "https://images.indianexpress.com/2022/05/indianexpress-logo.jpeg", "publishedAt": "2022-05-05T00:43:01Z", "content": "A 34-YEAR-OLD man was found dead near Burail, Sector 45, under mysterious circumstances, on Wednesday. Police have not ruled out the possibility of drug overdose behind the death, as a used syringe w… [+1029 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Chandigarh: 6.2 mm rain brings down max temperature", "description": "The rain started around 9:25 am and stopped after a brief period. In the afternoon, the city received denser rain.", "url": "https://indianexpress.com/article/cities/chandigarh/chandigarh-6-2-mm-rain-brings-down-max-temperature-7902032/", "urlToImage": "https://images.indianexpress.com/2022/05/rain.jpg", "publishedAt": "2022-05-05T00:37:20Z", "content": "CHANDIGARH RECEIVED the highest rainfall of this season, at 6.2 mm, bringing the maximum temperature to 33.3 degrees Celsius, four degrees below normal, on Wednesday. The wind with a speed of 40-50 k… [+563 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "UP recommends suspension of former DM, orders probe against her", "description": "The chief minister has also directed officials to file an FIR and take legal action against those involved.", "url": "https://indianexpress.com/article/cities/lucknow/up-recommends-suspension-of-former-dm-orders-probe-against-her-7902014/", "urlToImage": "https://images.indianexpress.com/2022/05/Yogi-4col.jpg", "publishedAt": "2022-05-05T00:34:01Z", "content": "Uttar Pradesh Chief Minister Yogi Adiyanath on Wednesday recommended the suspension of former Ghaziabad District Magistrate Nidhi Kesarwani to the Centre, and ordered a departmental inquiry against h… [+2277 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Covid: Data shows 10 people tested positive in last 7 days", "description": "hile the rate of vaccination for children in the age group of 15 to 18 is 98.85% (first dose), vaccination percentagein the age group of 12 to 14 years has been only 63.30% (first dose).", "url": "https://indianexpress.com/article/cities/chandigarh/covid-data-shows-10-people-tested-positive-in-last-7-days-7902028/", "urlToImage": "https://images.indianexpress.com/2022/05/chandigarh-covid.jpg", "publishedAt": "2022-05-05T00:32:40Z", "content": "THE past week has seen a marginal increase in the new Covid cases in Chandigarh, with the average number of positive cases in the last seven days settling at 10, and the positivity rate touching 0.80… [+1497 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Maulshree Seth", "title": "Eastern UP: Govt holds chaupals to help Vantangias and Musahars avail welfare schemes", "description": "While Vantangias come under Scheduled Tribes, Musahars come under Scheduled Castes in UP.", "url": "https://indianexpress.com/article/cities/lucknow/eastern-up-govt-holds-chaupals-to-help-vantangias-and-musahars-avail-welfare-schemes-7902012/", "urlToImage": "https://images.indianexpress.com/2022/05/Yogi-9.jpg", "publishedAt": "2022-05-05T00:28:02Z", "content": "To bring Vantangias and Musahars the two socially backward communities of eastern Uttar Pradesh into the mainstream, the state government has started holding chaupals in their hamlets, informing them… [+2293 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Divya Goyal", "title": "50 Patiala varsity students test positive in 48 hours", "description": "The university, in view of the sudden outbreak of the virus, has also decided to temporarily postpone its end term examinations, an order issued by the university's Registrar read on Wednesday.", "url": "https://indianexpress.com/article/cities/ludhiana/rajiv-gandhi-national-university-law-patiala-punjab-covid-cases-hotspot-testing-7902020/", "urlToImage": "https://images.indianexpress.com/2022/05/rajiv-gandhi-national-law-uni.jpg", "publishedAt": "2022-05-05T00:26:27Z", "content": "The Rajiv Gandhi National University of Law (RGNUL), Patiala, has emerged as a Covid hotspot, with at least fifty students testing positive for Covid on campus in the last 48 hours.The university, in… [+4051 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Avinash Nair", "title": "Buying costly power: GUVNL hikes fuel surcharge third time in 2022", "description": "In a communique to all four electricity distribution companies on April 29, Gujarat Urja Vikas Nigam Ltd (GUVNL) directed them to charge Rs 2.30 per unit as FPPPA (fuel and power purchase price adjustment charges or fuel surcharge), which is an increase of 10…", "url": "https://indianexpress.com/article/cities/ahmedabad/buying-costly-power-guvnl-hikes-fuel-surcharge-third-time-in-2022-7902017/", "urlToImage": "https://images.indianexpress.com/2022/05/power22-5.jpg", "publishedAt": "2022-05-05T00:22:14Z", "content": "Purchasing costly power from energy exchanges to tide over the deficit has prompted the Gujarat government to effect an increase in fuel surcharge for almost all consumers, for a third time in 2022.I… [+4032 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Shah’s visit cut short to 2 days", "description": "This will be Shah’s first visit to Bengal after the BJP’s defeat in last year’s state Assembly polls.", "url": "https://indianexpress.com/article/cities/kolkata/shahs-visit-cut-short-to-2-days-7902010/", "urlToImage": "https://images.indianexpress.com/2022/05/aMIT-SHAH-14-1.jpg", "publishedAt": "2022-05-05T00:17:45Z", "content": "From a three-day trip scheduled earlier, Union Home Minister Amit Shahs visit to West Bengal starting Thursday has been cut down to two days. According to the new schedule, Shah will hold meetings wi… [+1382 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Peter Vidal", "title": "Horoscope Today, May 5, 2022: Libra, Aries, Pisces and other signs — check astrological prediction", "description": "Leo-- What matters most now is that you are getting much closer to resolving partnership or matrimonial problems. You see, partners hold the key to domestic harmony and you will get precisely nowhere unless you acknowledge this simple, basic truth.", "url": "https://indianexpress.com/article/horoscope/horoscope-today-may-5-2022-libra-aries-pisces-and-other-signs-check-astrological-prediction/", "urlToImage": "https://images.indianexpress.com/2022/04/horoscope_2-1200-1-1-2-1.jpeg", "publishedAt": "2022-05-05T00:03:07Z", "content": "Whats on the cards today for you? Aries, financial plans will begin to move after a period of delay, intentional or otherwise. Cancer, ask yourself why it is that you should be attracted to people wh… [+3640 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "TMC trade union protests against jute price ceiling", "description": "Minister Manna takes a dig at BJP MP: ‘Why he didn’t raise it in Parliament?’", "url": "https://indianexpress.com/article/cities/kolkata/tmc-trade-union-protests-against-jute-price-ceiling-7902004/", "urlToImage": "https://images.indianexpress.com/2022/05/Arjun-Singh-latest.jpg", "publishedAt": "2022-05-04T23:56:59Z", "content": "Two days after BJP MP Arjun Singh spoke up against the jute policy of the Central government, INTTUC, the trade union wing of the ruling Trinamool Congress on Wednesday submitted a memorandum at the … [+1628 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Ritu Sharma", "title": "Gujarat begins process to regulate fee for non-tech courses in pvt institutes", "description": "The education department will regulate fee for non-technical programmes such as arts, commerce and others on the lines of Fee Regulatory Committee (FRC) for technical undergraduate and postgraduate programmes such as medical, engineering, pharmacy and others …", "url": "https://indianexpress.com/article/cities/ahmedabad/gujarat-begins-process-to-regulate-fee-for-non-tech-courses-in-pvt-institutes-7901999/", "urlToImage": "https://images.indianexpress.com/2022/05/Exam-1.jpg", "publishedAt": "2022-05-04T23:27:40Z", "content": "Weighed down by the huge variation in tuition fee charged by private institutes for non-technical programmes that the state government has to reimburse under centrally-sponsored post-matric scholarsh… [+5008 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Kutch earthquake: Affected families to get ownership documents of their new houses", "description": "The in-principal approval to provide ownership documents was given by Chief Minister Bhupendra Patel, the release stated.", "url": "https://indianexpress.com/article/cities/ahmedabad/kutch-earthquake-affected-families-to-get-ownership-documents-of-their-new-houses-7901996/", "urlToImage": "https://images.indianexpress.com/2022/05/Bhupendra-Patel.jpg", "publishedAt": "2022-05-04T23:20:45Z", "content": "Over two decades after the 2001 Kutch earthquake, the Gujarat government has decided to provide ownership documents of houses where the affected families were resettled, the government stated in an o… [+716 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "AAP state vice-president under police detention for over 3 days, says party", "description": "AAP alleged that three party workers: Bhemabhai Chaudhary, Karsanji Rajput and Navin Patel were detained by the Thara police station to stop them from holding a protest to demand supply of water in the sujalam sufalam canal and other farmer related issues.", "url": "https://indianexpress.com/article/cities/ahmedabad/aap-state-vice-president-under-police-detention-for-over-3-days-says-party-7901993/", "urlToImage": "https://images.indianexpress.com/2022/05/AAP.png", "publishedAt": "2022-05-04T23:17:45Z", "content": "Aam Aadmi Party (AAP) alleged on Wednesday that police has detained their state vice president Bhemabhai Chaudhary in Banaskantha for over three days to deter him from holding a farmers protest.AAP a… [+1430 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Tribal rights group denied permission to hold rally in Ahmedabad", "description": "“The government of Gujarat and police have behaved in an undemocratic and unconstitutional manner...” a statement released by the organisation reads.", "url": "https://indianexpress.com/article/cities/ahmedabad/tribal-rights-group-denied-permission-to-hold-rally-in-ahmedabad-7901988/", "urlToImage": "https://images.indianexpress.com/2022/05/cop-2-1-5.jpg", "publishedAt": "2022-05-04T23:02:39Z", "content": "A Gujarat-based tribal rights group, Eklavya Sangathan, has said that Ahmedabad city police did not give them permission to hold a tribal rally in the city and a convention at the Sabarmati Riverfron… [+824 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Tamil Nadu medical college dean expresses regret, reinstated, says minister", "description": "After students at the Madurai college took the “archaic” oath on April 30, against conventions followed by the state government and at an event attended by two state ministers, it emerged that students of at least three other government medical colleges in th…", "url": "https://indianexpress.com/article/education/tamil-nadu-medical-college-dean-expresses-regret-reinstated-says-minister/", "urlToImage": "https://images.indianexpress.com/2022/05/1-12-1.jpg", "publishedAt": "2022-05-04T23:00:17Z", "content": "Removed last week after first-year medical students of Madurai Medical College took the Charak Shapath, instead of the Hippocratic oath, the medical college’s dean, Dr A Rathinavel, was reinstated on… [+2277 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "LIC IPO: Day 1, 67% booked, employees and policyholders oversubscribe quota", "description": "LIC policyholders led the subscription list, with their quota subscribed 1.99 times (199 per cent). The portion for employees was subscribed 117 per cent. The retail investors portion, meanwhile, was subscribed 60 per cent, according to stock exchange data.", "url": "https://indianexpress.com/article/business/lic-ipo-day-1-67-booked-employees-and-policyholders-oversubscribe-quota/", "urlToImage": "https://images.indianexpress.com/2022/05/LIC-IPO-REUTERS-1200-2.jpg", "publishedAt": "2022-05-04T23:00:10Z", "content": "The mega initial public offering (IPO) of Life Insurance Corporation (LIC) received a strong response from investors with 67 per cent of the shares getting sold out on Wednesday, the first day of bid… [+2518 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Interactive event launched for students of Signal School", "description": "Signal school is a project to prepare children involved in begging at traffic signals for formal education by Government of Gujarat, Gujarat State Legal Service Authority, Ahmedabad Municipal corporation and Municipal School Board.", "url": "https://indianexpress.com/article/cities/ahmedabad/interactive-event-launched-for-students-of-signal-school-7901987/", "urlToImage": "https://images.indianexpress.com/2022/05/SCHOOLS-2-2.jpg", "publishedAt": "2022-05-04T22:51:57Z", "content": "The students of Anant National University in Ahmedabad on Wednesday launched an interactive event, ‘Sapno Ka Manch’, for students of Signal Schools to help them to develop different cognitive abiliti… [+1153 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Amitabh Sinha", "title": "No medical care for 45% of recorded deaths in 2020, highest ever: New data", "description": "For several months in 2020, when the pandemic first gripped the world, non-Covid medical services were suspended or operating thinly in India, with 80 to 100 per cent of beds in several hospitals reserved for Covid patients.", "url": "https://indianexpress.com/article/india/no-medical-care-for-45-of-recorded-deaths-in-2020-highest-ever-new-data-7901930/", "urlToImage": "https://images.indianexpress.com/2022/04/delhi-covid-3.jpg", "publishedAt": "2022-05-04T22:50:55Z", "content": "THE CIVIL Registration System (CRS) data for 2020 includes a key metric that shows how difficult it was for people to access health facilities during the pandemic: over 45 per cent of all recorded de… [+2705 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Deep Mukherjee", "title": "Flags, loudspeakers and a rope on freedom fighter’s bust: How Jodhpur lost its peace", "description": "Two days later, at Ground Zero in Jodhpur’s Jalori Gate, sugarcane juice machines lay abandoned on the street dotted with police barricades. There were police teams keeping curfew watch and there was only one flag fluttering above the bust of Balmukund Bissa …", "url": "https://indianexpress.com/article/cities/jaipur/flags-loudspeakers-and-a-rope-on-freedom-fighters-bust-how-jodhpur-lost-its-peace-7901900/", "urlToImage": "https://images.indianexpress.com/2022/05/jodhpurNew.jpg", "publishedAt": "2022-05-04T22:50:33Z", "content": "RELIGIOUS FLAGS were hoisted. A few loudspeakers were taken down. A flag rope was allegedly tied on the bust of a revered freedom fighter. Tempers rose, angry words were exchanged, mobs gathered. And… [+5129 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Work on India’s planned Venus mission is under way, says ISRO chairperson", "description": "The conference, which was live streamed, included presentations on the themes of Sun and Venus connection, Venusian atmospheric and surface studies and sessions on opportunities for user community as well as the scientific context and possibilities.", "url": "https://indianexpress.com/article/cities/ahmedabad/work-on-indias-planned-venus-mission-is-under-way-says-isro-chairperson-7901984/", "urlToImage": "https://images.indianexpress.com/2022/05/S-Somanath.jpg", "publishedAt": "2022-05-04T22:49:39Z", "content": "Work on Indias planned Venus mission is under way and the mission will aim for unique scientific observations and outcomes, said S Somanath, Chairperson of Indian Space Research Organisation (ISRO), … [+2019 chars]"}]}