{"status": "ok", "totalResults": 652, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Haryana launches campaign on hoisting tricolour at every house from August 11-17", "description": "The Haryana government has said its campaign is in sync with the Union government’s ‘Har Ghar Tiranga’ campaign under the Azadi ka Amrit Mahotsav to commemorate 75 years of India’s independence", "url": "https://indianexpress.com/article/cities/chandigarh/haryana-campaign-hoisting-tricolour-every-house-from-august-11-17-8015129/", "urlToImage": "https://images.indianexpress.com/2022/07/indian-national-flag759-1-1.jpg", "publishedAt": "2022-07-07T10:50:18Z", "content": "The Haryana government has launched a campaign to ensure that each house in Haryana should have the national flag hoisted from August 11-17. The state government said that this is in sync with the Un… [+2719 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Former NITI Aayog CEO Amitabh Kant to be new Sherpa of G-20", "description": "Abhinav Kant replaces Union Minister Piyush Goyal as full time sherpa of G-20; India assumes the G-20 presidency later this year", "url": "https://indianexpress.com/article/india/amitabh-kant-new-g-20-sherpa-8015031/", "urlToImage": "https://images.indianexpress.com/2020/12/amitabh-kant.jpg", "publishedAt": "2022-07-07T10:49:19Z", "content": "Former NITI Aayog CEO Amitabh Kant will be the new Sherpa of G-20, replacing Union Minister Piyush Goyal, as full-time sherpa required for India’s presidency, sources said on Thursday.India assumes t… [+658 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Karan Johar reveals Katrina Kaif-Vicky Kaushal romance began on Koffee With Karan: ‘It started on this couch’", "description": "Karan Johar's talk show Koffee with Karan is all set to return and the director has revealed some interesting trivia about his show.", "url": "https://indianexpress.com/article/entertainment/web-series/karan-johar-reveals-katrina-kaif-vicky-kaushal-romance-started-on-koffee-with-karan-8014951/", "urlToImage": "https://images.indianexpress.com/2022/07/kwk-vickat.jpg", "publishedAt": "2022-07-07T10:48:38Z", "content": "Karan Johar’s much anticipated talk show Koffee with Karan is all set to return and in the run-up to the series, the filmmaker has revealed that it was on his show that the Vicky Kaushal and Katrina … [+1654 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Thor Love and Thunder slated to get a $300 mn opening: A look at how the God of Thunder fared at box office", "description": "Thor: Love and Thunder box office: Filmmaker Taika Waititi’s directorial, with Chris Hemsworth returning once again as Thor, is predicted to do a business of 300 million dollars worldwide.", "url": "https://indianexpress.com/article/entertainment/hollywood/before-thor-love-and-thunder-a-look-at-how-the-franchise-has-fared-at-box-office-8012938/", "urlToImage": "https://images.indianexpress.com/2022/07/thor-box-office-.jpg", "publishedAt": "2022-07-07T10:46:23Z", "content": "The Marvel movie, Thor: Love and Thunder is expected to break all the box office records across the international film market. Filmmaker Taika Waititis directorial, with Chris Hemsworth returning onc… [+3757 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "AP EAPCET (EAMCET) answer key release date announced; check schedule", "description": "AP EAPCET 2022 answer key: Engineering candidates will be given time till 5 pm of July 14, and agricultural stream will have time till 9 am of July 15 to register their objections.", "url": "https://indianexpress.com/article/education/ap-eamcet-eapcet-answer-key-release-date-announced-check-schedule-cets-apsche-ap-gov-in-8014998/", "urlToImage": "https://images.indianexpress.com/2022/07/AP-EAPCET.jpg", "publishedAt": "2022-07-07T10:44:26Z", "content": "AP EAPCET 2022 answer key: The State Council for Higher Education, Andhra Pradesh (APSCHE) has announced the dates for the release of the preliminary answer keys along with candidates response sheets… [+1518 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "With UK’s Boris Johnson set to quit, who could replace him?", "description": "The list of likely candidates include Rishi Sunak and Sajid Javid", "url": "https://indianexpress.com/article/world/uks-boris-johnson-quit-who-replace-him-8014936/", "urlToImage": "https://images.indianexpress.com/2022/07/boris_featured.jpg", "publishedAt": "2022-07-07T10:41:33Z", "content": "Boris Johnson was due to resign as Britain’s prime minister on Thursday, bringing an end to a turbulent two and half years in office and triggering a search for a new leader.Below is a summary of som… [+5321 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Three TMC workers shot, hacked to death in West Bengal’s Canning", "description": "A team of district police and CID have reached the spot and are examining the area. The police who have launched an investigation into the killings, are yet to ascertain the motive behind the murders. The bodies of the Trinamool workers have been sent for aut…", "url": "https://indianexpress.com/article/cities/kolkata/tmc-workers-killed-west-bengal-canning-8015116/", "urlToImage": "https://images.indianexpress.com/2022/07/indian-express-1.jpg", "publishedAt": "2022-07-07T10:41:14Z", "content": "Three Trinamool Congress workers, including a member of a local gram panchayat, were killed by unidentified attackers in Canning town of West Bengals South 24 Parganas Thursday morning, said the poli… [+1816 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Shahid Kapoor calls wife Mira Kapoor ‘legend, survivor’ for making it through ‘seven hard long years’ with him. See photo", "description": "Shahid Kapoor and Mira Kapoor tied the knot on July 2015 in an intimate ceremony in Gurugram, Haryana. They became parents for the first time in 2016 and were blessed with a daughter.", "url": "https://indianexpress.com/article/entertainment/bollywood/shahid-kapoor-wife-mira-kapoor-wedding-anniversary-romantic-post-8015014/", "urlToImage": "https://images.indianexpress.com/2022/07/shahid-mira-anniversary.jpg", "publishedAt": "2022-07-07T10:39:04Z", "content": "Bollywood actor Shahid Kapoor is celebrating his seventh wedding anniversary with his wife Mira Kapoor on Thursday. On the special occasion, the actor took to social media to wish Mira with an adorab… [+1567 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Boris Johnson resignation: The story so far", "description": "Boris Johnson's tenure at the top post had been marked by a sea of scandals, including the 'Partygate'.", "url": "https://indianexpress.com/article/world/boris-johnson-resignation-uk-political-crisis-story-so-far-8014654/", "urlToImage": "https://images.indianexpress.com/2022/07/Boris-Johnson-2.jpg", "publishedAt": "2022-07-07T10:38:58Z", "content": "Johnson’s tenure at the top post had been marked by a sea of scandals, including the ‘Partygate’ which refers to a number of gatherings attended by the senior lawmakers and the Prime Minister himself… [+3940 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Debraj Deb", "title": "28 years after quitting studies, Tripura woman clears Class 10 as daughters pass Class 12", "description": "Asked if she would pursue higher secondary and further studies, Shila Rani, from Chowdhury Mill Para in Agartala, says, ‘Let’s see. Nothing is decided yet but who knows!’", "url": "https://indianexpress.com/article/north-east-india/tripura/28-years-after-quitting-studies-tripura-woman-clears-class-10-8015044/", "urlToImage": "https://images.indianexpress.com/2022/07/Shila-Rani.jpeg", "publishedAt": "2022-07-07T10:37:38Z", "content": "Twenty-eight years after she quit studies, 53-year-old Shila Rani Das has passed madhyamik (Class 10) examinations conducted by the Tripura Board of Secondary Education (TBSE), even as her two daught… [+2509 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Punjab: 4 held in Jalandhar for duping people in the name of sending them abroad", "description": "Commissioner of Police Gursharan Singh Sandhu said the Special Operation Unit (SOU) had received a tip-off on illegal practices being carried out by a few travel agencies.", "url": "https://indianexpress.com/article/cities/jalandhar/punjab-jalandhar-duping-sending-abroad-8015058/", "urlToImage": "https://images.indianexpress.com/2022/02/passport.jpeg", "publishedAt": "2022-07-07T10:35:41Z", "content": "The Commissionerate Police Wednesday busted a gang of multiple travel agencies of Jalandhar who were involved in duping innocent people on the pretext of arranging their travel to foreign countries. … [+1934 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shruti Dhapola", "title": "Xiaomi OLED Vision 55-inch TV review: An OLED for everyone?", "description": "Xiaomi OLED Vision review: The advantage is that it is one of the most affordable OLED options in India. But is that good enough to consider the Xiaomi TV? Here's our review", "url": "https://indianexpress.com/article/technology/tech-reviews/xiaomi-oled-vision-55-inch-tv-review-8015026/", "urlToImage": "https://images.indianexpress.com/2022/07/Xiaomi_OLED_Vision_NEW4.jpg", "publishedAt": "2022-07-07T10:34:37Z", "content": "Xiaomi is best known for disrupting the technology industry with its value-for-money products. The companys strategy has always been to provide the best specifications on paper at a slightly lower pr… [+7239 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "From Brexit to Partygate, a timeline of Boris Johnson’s career", "description": "As Boris Johnson's time as UK prime minister comes to an end amidst a flurry of ethics allegations and the 'partygate' investigation, here is a timeline of events that led to the eventual downfall of his political career.", "url": "https://indianexpress.com/article/world/boris-johnson-resignation-career-timeline-8014911/", "urlToImage": "https://images.indianexpress.com/2022/07/Boris.jpg", "publishedAt": "2022-07-07T10:29:11Z", "content": "He was the mayor who basked in the glory of hosting the 2012 London Olympics, and the man who led the Conservatives to a thumping election victory on the back of his promise to get Brexit done.But Bo… [+6858 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Nutrition hack: Foods you should eat before and after a swim", "description": "\"Make the most of your fun summer swim that doubles up as cardiovascular metabolic burner for you as well,\" nutritionist Pooja Makhija wrote on Instagram", "url": "https://indianexpress.com/article/lifestyle/food-wine/foods-pre-post-swimming-health-benefits-7958889/", "urlToImage": "https://images.indianexpress.com/2022/06/swmming-nuts_1200_pexels.jpg", "publishedAt": "2022-07-07T10:20:00Z", "content": "Swimming is one of the best forms of physical activity; and if combined with the right foods — before and after — you can reap the maximum benefits.Explaining the same, nutritionist Pooja Makhija too… [+1178 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Who is Veerendra Heggade, the philanthropist from Karnataka nominated to Rajya Sabha", "description": "Hereditary administrator of the Dharmasthala temple in Karnataka's Dakshina Kannada district, Veerendra Heggade has been running several social, economic and cultural institutions in the state.", "url": "https://indianexpress.com/article/cities/bangalore/who-is-veerendra-heggade-philanthropist-karnataka-rajya-sabha-nomination-8014969/", "urlToImage": "https://images.indianexpress.com/2022/07/Veerendra-Heggade.jpg", "publishedAt": "2022-07-07T10:18:29Z", "content": "Veerendra Heggade, a philanthropist and hereditary administrator of the Dharmasthala temple in Karnataka’s Dakshina Kannada district, is one of the four eminent persons nominated to Rajya Sabha Wedne… [+2138 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "‘A leader like no other’: Birthday wishes pour in for MS Dhoni who turns 41", "description": "MS Dhoni's birthday: The Indian cricket board paid tribute to 'Captain Cool' with a video that shows a collection of his best sixes.", "url": "https://indianexpress.com/article/sports/cricket/wishes-pour-in-for-ms-dhoni-as-he-turns-41-8014830/", "urlToImage": "https://images.indianexpress.com/2021/11/Untitled-design-42.png", "publishedAt": "2022-07-07T10:18:24Z", "content": "Former India skipper MS Dhoni turns 41 on July 7, 2022. Dhoni is in London these days with his family as he was seen cheering Rafael Nadal at Wimbledon on his birthday eve on Wednesday.Wishes are pou… [+2826 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Boeing’s Aurora to build Virgin Galactic spaceship carrier plane", "description": "Boeing subsidiary Aurora Flight Science will build Virgin Galactic's new twin-fuselage carrier plane that will ferry its next-generation spaceship toward space.", "url": "https://indianexpress.com/article/technology/science/boeing-aurora-flight-services-virgin-galactic-spaceshiptwo-build-8014945/", "urlToImage": "https://images.indianexpress.com/2022/07/Virgin-Galaxtic-SpaceShipTwo.jpg", "publishedAt": "2022-07-07T10:10:16Z", "content": "Virgin Galactic inked an agreement with Boeing subsidiary Aurora Flight Sciences to build the company’s new twin-fuselage carrier plane that will ferry its next-generation spaceship toward space, the… [+803 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi: Man kills friend for not returning phone after call, arrested", "description": "During the investigation, the police identified the accused and found that he used to work at a restaurant before the Covid lockdown.", "url": "https://indianexpress.com/article/cities/delhi/delhi-man-kills-friend-returning-phone-call-arrested-8014965/", "urlToImage": "https://images.indianexpress.com/2022/07/crime-1200.jpg", "publishedAt": "2022-07-07T10:09:22Z", "content": "The Delhi Police have arrested a Nepali man for allegedly killing his friend for refusing to return his phone after making a call.Deputy commissioner of police (central district) Shweta Chauhan said … [+1627 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shruti Dhapola", "title": "FAQ: What is Apple’s Lockdown Mode to fight ‘mercenary spyware’, when does it roll out, and more", "description": "‘Lockdown Mode’ is Apple’s latest feature for iOS 16, iPadOS 16 and macOS Ventura. We answer questions on what the mode does, who should use, etc.", "url": "https://indianexpress.com/article/technology/tech-news-technology/faq-apple-lockdown-mode-ios-16-macos-ventura-ipados-16-how-to-install-release-date-download-8014909/", "urlToImage": "https://images.indianexpress.com/2022/07/Apple_LockdownMode_1.jpg", "publishedAt": "2022-07-07T10:08:36Z", "content": "Lockdown Mode is Apples latest feature for iOS 16, iPadOS 16 and macOS Ventura. The feature–which will be optional–is aimed at fighting mercenary spyware such as Pegasus and Hermit. But what exactly … [+5962 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shalini Langer", "title": "Thor Love and Thunder movie review: Chris Hemsworth film strays far from Marvel, Thor", "description": "Thor Love and Thunder movie review: Taika Waititi gets away with a lot in the film because of Chris Hemsworth’s ridiculously easy charm, in that ridiculously easy-on-the-eye body.", "url": "https://indianexpress.com/article/entertainment/movie-review/thor-love-and-thunder-movie-review-chris-hemsworth-natalie-portman-taika-waititi-marvel-star-rating-8014846/", "urlToImage": "https://images.indianexpress.com/2022/07/Thor-Love-and-Thunder-movie-review-1200.jpeg", "publishedAt": "2022-07-07T10:00:21Z", "content": "Love and Thunder has no big Thor-ic ambitions except perhaps one. When an angry Zeus flicks clothes off that blond, biceped screen god called Chris Hemsworth, whats down there causes watchers to gasp… [+2632 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "New Year Eve murder: Bombay High Court denies bail to accused", "description": "Jhanvi Kukreja, 19, was found dead in a Khar building on January 1, 2021. A sessions court had earlier granted bail to Shree Ambadas Jogdhankar's co-accused Diya Padalkar", "url": "https://indianexpress.com/article/cities/mumbai/new-year-eve-murder-bombay-high-court-denies-bail-accused-8014853/", "urlToImage": "https://images.indianexpress.com/2022/07/jogdhankar_edited.jpg", "publishedAt": "2022-07-07T09:55:49Z", "content": "The Bombay High Court on Thursday rejected the bail plea of Shree Ambadas Jogdhankar, 23, booked for the murder of his friend Jhanvi Kukreja, 19, at a New Years Eve party in Khar. Kukreja was found d… [+1087 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "CBI arrests Power Grid exec director, Tata Projects executive VP among 6 in bribery case", "description": "The probe agency had conducted searches on Wednesday in Ghaziabad, Noida, Gurugram, among other places, during which Rs 93 lakh cash was recovered from the Gurugram premises of Jha.", "url": "https://indianexpress.com/article/india/cbi-power-grid-exec-director-tata-projects-executive-vp-bribery-case-8014914/", "urlToImage": "https://images.indianexpress.com/2022/06/CBI-1.jpg", "publishedAt": "2022-07-07T09:55:29Z", "content": "The CBI has arrested Executive Director of Power Grid Corporation of India B S Jha and five officials of Tata Projects, including its Executive VP Deshraj Pathak and Assistant VP R N Singh, in connec… [+549 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Comicstaan 3 trailer: Rohan Joshi roasting judges will leave you ROFLing", "description": "The trailer of comedy show Comicstaan 3 is out. While contestants seem to be impressive, it's the mentors' performances that leave you in splits.", "url": "https://indianexpress.com/article/entertainment/web-series/comicstaan-3-trailer-rohan-joshi-roasting-judges-will-leave-you-rofling-8014754/", "urlToImage": "https://images.indianexpress.com/2022/07/rohan-joshi-comicstaan-3.jpg", "publishedAt": "2022-07-07T09:54:26Z", "content": "Amazon Prime Video on Thursday dropped the trailer of Comicstaan 3, and from the looks of it, the show is set to leave you ROFLing. While Zakir Khan, Sumukhi Suresh, Neeti Palta and Kenny Sebastian t… [+1744 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "UK political crisis live updates: PM Boris Johnson agrees to resign, to address nation today", "description": "UK political crisis live updates: Months of discontent over Johnson’s judgment and ethics within the governing Conservative Party erupted with the resignations of Treasury chief Rishi Sunak and Health Secretary Sajid Javid within minutes of each other on Tues…", "url": "https://indianexpress.com/article/world/uk-political-crisis-live-updates-pm-boris-johnson-resigns-8014728/", "urlToImage": "https://images.indianexpress.com/2022/07/Boris-3.jpg", "publishedAt": "2022-07-07T09:53:51Z", "content": "British Prime Minister Boris Johnson is expected to resign on Thursday, with his office saying he will make a statement to the country.\r\nBoris Johnson will resign as Conservative Party leader today, … [+771 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "God of War Ragnarok launching on November 9: New Trailer, Collector’s Edition, Jotnar Edition", "description": "Sony announced the launch of God of War Ragnarök along with a new cinematic (CGI) trailer, pre-order dates and the Collector's and Jötnar editions.", "url": "https://indianexpress.com/article/technology/gaming/god-of-war-ragnarok-launch-pre-order-trailer-collectors-edition-jotnar-edition-8014894/", "urlToImage": "https://images.indianexpress.com/2022/07/God-of-war-ragnarok-trailer-launch-preorder-collectors-edition-jotnar-edition.jpg", "publishedAt": "2022-07-07T09:46:53Z", "content": "God of War Ragnarök – Father and Son will release on PS4 and PS5 on November 9, announced Sony. The company also released a CGI trailer for the game. Santa Monica Studio, the developers of the franch… [+3101 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Divya Goyal", "title": "Moga court convicts 3 Dera followers in 2015 sacrilege case", "description": "Three of the five persons named in the FIR have been awarded 3 years of imprisonment under section 295-A and another three years under 120-B of IPC. Both punishments will run parallel", "url": "https://indianexpress.com/article/cities/chandigarh/moga-court-convicts-dera-followers-2015-sacrilege-case-8014885/", "urlToImage": "https://images.indianexpress.com/2022/07/Gavel-10-12-11.jpeg", "publishedAt": "2022-07-07T09:36:35Z", "content": "A local Moga court in Punjab convicted three Dera Sacha Sauda followers in the 2015 sacrilege case Thursday.Two others have been acquitted.\r\nThe three convicts are Pirthi Singh of Baghapurana, Mithu … [+837 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Kangana Ranaut reminds Karan Johar of her surgical strike on Koffee With Karan: ‘Ghar mein ghuss ke maara tha’", "description": "As the seventh season of Koffee With Karan is releasing on Disney+ Hotstar on July 7, Kangana Ranaut reminded Karan Johar of her ruling the show when she was there for the fifth season.", "url": "https://indianexpress.com/article/entertainment/bollywood/kangana-ranaut-reminds-karan-johar-of-her-surgical-strike-on-koffee-with-karan-ghar-mein-ghuss-ke-maara-tha-8014726/", "urlToImage": "https://images.indianexpress.com/2022/07/kangana-karan-johar-.jpg", "publishedAt": "2022-07-07T09:33:06Z", "content": "When actor Kangana Ranaut appeared on Karan Johar’s Koffee With Karan season five, she took the lead from the moment she sat on the couch. She called the host the “flag-bearer of nepotism” in Bollywo… [+2019 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Why we need more celebrities to curb tobacco use", "description": "Creative expression and freedom of speech should also be seen in conjunction with the right to life and good health. More than 50 per cent smokers start using tobacco before the age of 10 and one-third of youth experiment with tobacco as a result of Tobacco A…", "url": "https://indianexpress.com/article/lifestyle/health/why-we-need-more-celebrities-to-curb-tobacco-use-8014880/", "urlToImage": "https://images.indianexpress.com/2022/07/tobacco-1200.jpg", "publishedAt": "2022-07-07T09:32:30Z", "content": "A few years ago, many Indians woke up to the sight of a respected Hollywood star on their front pages and on huge billboards across their cities, promoting a product that most of us readily know stan… [+5128 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Punjab CM Bhagwant Mann ties the knot with Gurpeet Kaur; details inside", "description": "The newlyweds opted for traditional ensembles for the Anand Karaj ceremony", "url": "https://indianexpress.com/article/lifestyle/fashion/punjab-cm-bhagwant-mann-wedding-gurpreet-kaur-outfits-food-menu-8014430/", "urlToImage": "https://images.indianexpress.com/2022/07/bhagwant-mann-wedding.jpeg", "publishedAt": "2022-07-07T09:30:54Z", "content": "Punjab Chief Minister Bhagwant Mann and Gurpreet Kaur tied the knot at the former’s residence in Chandigarhtoday. The wedding was attended by Delhi CM Arvind Kejriwal, AAP leader and Rajya Sabha MP R… [+1647 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "As ‘Stranger Things’ Season 4 concludes, Twitter brims up with memes", "description": "The final two episodes of Stranger Things season 4 were released on Netflix on July 1.", "url": "https://indianexpress.com/article/trending/trending-globally/stranger-things-volume-2-memes-8014712/", "urlToImage": "https://images.indianexpress.com/2022/07/stranger-things-1.jpg", "publishedAt": "2022-07-07T09:30:13Z", "content": "The fourth season of Stranger Things, arguably one of the most popular Netflix series, finally concluded earlier this month.It was reported that Netflix crashed for a brief period as millions of fans… [+3555 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pune-based woman asked to pay electricity bill online, loses Rs 10 lakh", "description": "In an online fraud, a 53-year-old woman was made to download certain apps on her phone. After she shared her screen, Rs 10 lakh was transferred from her account, police said.", "url": "https://indianexpress.com/article/cities/pune/pune-based-woman-asked-to-pay-electricity-bill-online-loses-rs-10-lakh-8014868/", "urlToImage": "https://images.indianexpress.com/2022/07/Pune-Police-2.jpg.jpg", "publishedAt": "2022-07-07T09:20:54Z", "content": "Online fraudsters duped a Pune-based woman of Rs 10 lakh after making her download third-party applications like Quick support and Any Desk on her mobile phone while paying her electricity bill onlin… [+14 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Ponniyin Selvan 1 poster: Trisha is Princess Kundavai, the face of courage", "description": "Trisha is playing the role of Princess Kundavai in Mani Ratnam’s Ponniyin Selvan: Part 1.", "url": "https://indianexpress.com/article/entertainment/tamil/ponniyin-selvan-1-poster-trisha-princess-kundavai-8014661/", "urlToImage": "https://images.indianexpress.com/2022/07/trisha.jpg", "publishedAt": "2022-07-07T09:15:09Z", "content": "The first look of Trisha from upcoming magnum opus Ponniyin Selvan: Part 1 was released on Thursday. Trisha is playing the role of Princess Kundavai in the movie, which is written and directed by Man… [+1647 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "Strangers rally together, lie about train service disruption to help Mumbai man take an off", "description": "A Mumbaikar requested people on a transport app to say trains were not running on a certain route to furnish proof to his boss, and people did it in no time", "url": "https://indianexpress.com/article/trending/trending-in-india/strangers-lie-about-train-service-disruption-to-help-mumbai-man-take-off-8014574/", "urlToImage": "https://images.indianexpress.com/2022/07/mumbai-train-m-indicator-chat.jpg", "publishedAt": "2022-07-07T09:14:27Z", "content": "For people travelling in and around Mumbai, M-indicator is nothing but a saviour. Its help is not limited to providing real-time transportation updates though. One creative Mumbaikar showed how by us… [+1591 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Ranbir Kapoor says he ‘always wanted children’ with Alia Bhatt: ‘Spoke about having kids from the first day we met’", "description": "Ranbir Kapoor and Alia Bhatt tied the knot in April 2022. They are expecting their first child later this year.", "url": "https://indianexpress.com/article/entertainment/bollywood/ranbir-kapoor-alia-bhatt-having-kids-8014710/", "urlToImage": "https://images.indianexpress.com/2022/07/ranbir-alia-1200.jpg", "publishedAt": "2022-07-07T09:12:51Z", "content": "Ranbir Kapoor revealed he and wife Alia Bhatt wanted to have kids from the moment they fell in love. The power couple of Bollywood tied the knot in April this year, after dating for a long time. Alia… [+1507 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Two Punjab cops held for extorting money, possessing heroin", "description": "One of the arrested constables is posted in the security details of Punjabi singer Mankirat Aulakh, said the police.", "url": "https://indianexpress.com/article/cities/sas-nagar-mohali/punjab-cops-extortion-heroin-arrest-8014821/", "urlToImage": "https://images.indianexpress.com/2022/07/arrest-13.jpg", "publishedAt": "2022-07-07T09:12:49Z", "content": "The anti-drug Special Task Force (STF) of the Punjab Police arrested two police constables with 5 gm heroin and seized Rs 19,000 cash from them. The duo had allegedly extorted the money from a person… [+857 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Divya Goyal", "title": "Afghan Sikh, Hindu community donates 1 lakh Afghani for family of Muslim security guard killed in Kabul gurdwara attack", "description": "Members of the Afghan Sikh and Hindu community, led by gurdwara president Gurnam Singh, handed over the amount to the family of Ahmed Jaan, the security guard of the gurdwara, who was shot dead by the terrorists.", "url": "https://indianexpress.com/article/cities/ludhiana/afghan-sikh-hindu-community-donates-1-lakh-afghani-security-guard-kabul-attack-8014714/", "urlToImage": "https://images.indianexpress.com/2022/06/gurudwara-1-1.jpeg", "publishedAt": "2022-07-07T09:09:11Z", "content": "Members of the Afghan Sikh and Hindu community, led by gurdwara president Gurnam Singh, handed over the amount to the family of Ahmed Jaan, the security guard of the gurdwara, who was shot dead by th… [+1302 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "China’s Xiaomi produces first smartphones in Vietnam", "description": "The Xiaomi devices were produced at a factory in the province of Thai Nguyen, north of the capital Hanoi.", "url": "https://indianexpress.com/article/technology/tech-news-technology/chinas-xiaomi-produces-first-smartphones-in-vietnam-8014822/", "urlToImage": "https://images.indianexpress.com/2022/07/Xiaomi-vietnam.jpg", "publishedAt": "2022-07-07T09:06:23Z", "content": "China’s Xiaomi Corp has produced its first batch of smartphones in Vietnam, the company said on Thursday, as it seeks to expand its foothold in Southeast Asia.The devices were produced at a factory i… [+676 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "England-Austria open Women’s Euro 2022 with record crowd", "description": "The record set by the first match of the tournament is expected to be broken by the final that will be played on Sunday, July 31 at the Wembley Stadium, the 90,000 tickets for which have been sold out.", "url": "https://indianexpress.com/article/sports/football/england-austria-open-womens-euro-2022-with-record-crowd-8014599/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-1-13.jpg", "publishedAt": "2022-07-07T09:02:39Z", "content": "68,871 people watched England beat Austria 1-0 in the Women’s Euro 2022 opening match at Old Trafford, an attendance record in the competition’s history. The previous record was 41,301 during the 201… [+923 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "AIADMK row: Madras HC bench dismisses all pleas against EPS faction", "description": "Since their orders passed in the wee hours of June 23 had been stayed by the Supreme Court on Wednesday, the Madras High Court judges said they were dismissing the applications and petitions.", "url": "https://indianexpress.com/article/cities/chennai/madras-hc-aiadmk-paneerselvam-palaniswami-general-council-meet-8014797/", "urlToImage": "https://images.indianexpress.com/2022/07/EPS-OPS-2.jpeg", "publishedAt": "2022-07-07T08:58:05Z", "content": "A division bench of the Madras High Court on Thursday dismissed a contempt application seeking to punish former Chief Minister and AIADMK leader Edappadi K Palaniswami and his supporters for alleged … [+1988 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Malayalam actor Sreejith Ravi arrested again for ‘flashing’ girls, booked under POCSO Act", "description": "The Thrissur West police booked Sreejith, 46, based on the complaint of the parents of the two minors. He was earlier arrested in a similar case in 2016.", "url": "https://indianexpress.com/article/cities/malayalam-actor-sreejith-ravi-arrested-again-for-flashing-girls-booked-under-pocso-act-8014757/", "urlToImage": "https://images.indianexpress.com/2022/07/Sreejith-Ravi-1.jpg", "publishedAt": "2022-07-07T08:50:45Z", "content": "Malayalam film actor Sreejith Ravi was arrested Thursday for allegedly flashing two schoolgirls in Kerala’s Thrissur district, said the police. The Thrissur West police booked Sreejith, 46, under the… [+1448 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Careers Desk", "title": "UGC NET 2022 admit card released: How to download", "description": "UGC NET 2022 admit card: The exams for a total of 25 subjects will be conducted on July 9, for 4 subjects on both July 11 and 12.", "url": "https://indianexpress.com/article/jobs/ugc-net-2022-admit-card-released-how-to-download-ugcnet-nta-nic-in-8010120/", "urlToImage": "https://images.indianexpress.com/2022/07/UGC-NET-1.jpg", "publishedAt": "2022-07-07T08:48:17Z", "content": "UGC NET 2022 admit card: The National Testing Agency (NTA) today released the admit card for UGC National Eligibility Test (NET) 2022. The admit card for the combined cycle of December 2021 and June … [+1506 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "Ever seen green skies? Catch photos and videos of the rare weather phenomenon", "description": "The reason behind the occurrence of green skies is not completely explained scientifically.", "url": "https://indianexpress.com/article/trending/trending-globally/green-skies-in-south-dakota-after-storm-8014678/", "urlToImage": "https://images.indianexpress.com/2022/07/green-skies.jpg", "publishedAt": "2022-07-07T08:48:13Z", "content": "After storms hit Sioux Falls in US’South Dakota this week, residents in the area witnessed a rare phenomenona green-tinged sky. Meteorologists and residents who managed to capture the green-coloured … [+3461 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Multiple complaints against Mahua Moitra over Kali remarks", "description": "", "url": "https://indianexpress.com/videos/news-video/multiple-complaints-against-mahua-moitra-over-kali-remarks/", "urlToImage": "https://images.indianexpress.com/2022/07/WhatsApp-Image-2022-07-07-at-12.43.05-PM.jpeg", "publishedAt": "2022-07-07T08:47:50Z", "content": "Car Driven By Minor Rams Into Shop, Two Suffer Severe Injuries"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Pa Ranjith on Natchathiram Nagargiradhu: ‘Love is political’", "description": "Natchathiram Nagargiradhu stars Dushara Vijayan, Kalidas Jayaram, Kalaiarasan, Hari Krishnan, Subatra Robert and Shabeer Kallarakkal.", "url": "https://indianexpress.com/article/entertainment/tamil/pa-ranjith-on-his-next-movie-natchathiram-nagargiradhu-love-is-political-8014465/", "urlToImage": "https://images.indianexpress.com/2022/07/Natchathiram-Nagargiradhu.jpg", "publishedAt": "2022-07-07T08:47:20Z", "content": "Filmmaker Pa Ranjith on Wednesday announced his upcoming movie Natchathiram Nagargiradhu. Even though the first look poster suggests a fun, woman-centric romantic movie, Ranjiths tweet hints that the… [+1485 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pranav Mukul", "title": "Explained: Apple’s ‘Lockdown Mode’ – how the new iPhone feature battles advanced spyware", "description": "Apple has announced a new security feature, called the 'Lockdown Mode', which will be available later this year for iPhones, iPads and Mac devices. What is it, and how will it work? Why is Apple rolling out this feature?", "url": "https://indianexpress.com/article/explained/apple-iphone-lockdown-mode-explained-8014593/", "urlToImage": "https://images.indianexpress.com/2022/07/Apple-Explained.jpg", "publishedAt": "2022-07-07T08:41:58Z", "content": "Apple has announced a major change to iPhone security in an effort to make it harder for mercenary spyware firms like Pegasus-maker NSO Labs to target and hack users of the iPhone. This has come in t… [+2687 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Chennai police spark row with tweet on beef curry post, issue clarification later", "description": "This tweet soon got traction with people criticising the police for ‘food policing’. Many said that they would like to remind the Chennai police that food was a basic human right and a personal preference, and no one had the right to dictate what another pers…", "url": "https://indianexpress.com/article/cities/chennai/chennai-police-spark-row-with-tweet-on-beef-curry-post-8014676/", "urlToImage": "https://images.indianexpress.com/2022/07/BEEF.jpg", "publishedAt": "2022-07-07T08:41:19Z", "content": "After receiving flak on social media for its tweet telling a Twitter user that his post on beef curry was unwarranted, the Greater Chennai Police (GCP) on Thursday issued a clarification and deleted … [+1936 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Government reduces gap between Covid booster and second shot to 6 months; experts welcome the move", "description": "According to the World Health Organization, the objective of a booster dose is to restore vaccine effectiveness from that deemed no longer sufficient", "url": "https://indianexpress.com/article/lifestyle/health/covid-booster-gap-second-vaccine-shot-reduced-6-months-experts-8014035/", "urlToImage": "https://images.indianexpress.com/2022/07/booster_200_express-photo-amit-chakravarty.jpg", "publishedAt": "2022-07-07T08:40:46Z", "content": "The Centre has decided to reduce the gap between the precautionary dose or booster shot and the second Covid vaccine shot from nine to six months. According to Union Health Secretary Rajesh Bhushan’s… [+3814 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "LIGO will be back in 2023, able to detect even ‘fainter’ gravitational waves", "description": "The Laser Interferometer Gravitational-wave Observatory (LIGO) is a massive laser interferometer that helped scientists confirm the existence of gravitational waves in 2016, working in tandem with the Virgo observatory in Italy.", "url": "https://indianexpress.com/article/technology/science/ligo-laser-interferometer-gravitational-wave-observatory-8014587/", "urlToImage": "https://images.indianexpress.com/2022/07/LIGO-fourth-operational-run-black-hole-merger-featured.jpg", "publishedAt": "2022-07-07T08:39:59Z", "content": "The Laser Interferometer Gravitational-wave Observatory (LIGO) is scheduled to begin its fourth run of operations in March 2023 after over two years of maintenance work and upgrades. During its lates… [+1787 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Car Driven By Minor Rams Into Shop, Two Suffer Severe Injuries", "description": "", "url": "https://indianexpress.com/videos/news-video/car-driven-by-minor-rams-into-shop-two-suffer-severe-injuries/", "urlToImage": "https://images.indianexpress.com/2022/07/WhatsApp-Image-2022-07-07-at-12.00.39-PM-1.jpeg", "publishedAt": "2022-07-07T08:37:51Z", "content": "After Uddhav Thackerays Auto Rickshaw Jibe, CM Eknath Shinde Hits Back"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "A Train Collided With A Truck At Bhalki Crossing In Karnataka; No Injury Reported", "description": "", "url": "https://indianexpress.com/videos/news-video/a-train-collided-with-a-truck-at-bhalki-crossing-in-karnataka-no-injury-reported/", "urlToImage": "https://images.indianexpress.com/2022/07/WhatsApp-Image-2022-07-07-at-11.12.02-AM.jpeg", "publishedAt": "2022-07-07T08:36:22Z", "content": "After Uddhav Thackerays Auto Rickshaw Jibe, CM Eknath Shinde Hits Back"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "J-K administration has established decisive domination over terrorism: Amit Shah", "description": "Shah said the administration headed by Sinha has also delivered development to the people of Kashmir without any discrimination.", "url": "https://indianexpress.com/article/cities/srinagar/j-k-administration-has-established-decisive-domination-over-terrorism-amit-shah-8014590/", "urlToImage": "https://images.indianexpress.com/2022/07/amit-shah-1-1.jpg", "publishedAt": "2022-07-07T08:35:44Z", "content": "The administration in Jammu and Kashmir has established a decisive domination over terrorism under the leadership of Prime Minister Narendra Modi, Union Home Minister Amit Shah said on Thursday.“Toda… [+1859 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Realme GT Neo 3 ‘Thor: Love and Thunder’ Edition launched at Rs 42,999", "description": "The Realme GT Neo 3 'Thor: Love and Thunder' edition comes with a new packaging and some exclusive Thor-themed goodies.", "url": "https://indianexpress.com/article/technology/mobile-tabs/realme-gt-neo-3-thor-love-and-thunder-edition-launched-at-rs-42999-8014598/", "urlToImage": "https://images.indianexpress.com/2022/07/Realme-GT-Neo-3-Thor-Love-and-Thunder-edition.jpg", "publishedAt": "2022-07-07T08:29:01Z", "content": "Realme has today announced a special edition variant of the Realme GT Neo 3 smartphone. The new GT Neo 3 Thor: Love and Thunder edition was made in collaboration with Marvel Studios and comes with so… [+1727 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Mindy Kaling reveals new details about Priyanka Chopra’s character in upcoming wedding-themed comedy, teases ‘fun dynamic’", "description": "Mindy Kaling has said that Priyanka Chopra will play a Punjabi character in their upcoming romantic comedy film.", "url": "https://indianexpress.com/article/entertainment/hollywood/mindy-kaling-reveals-new-details-about-priyanka-chopra-character-in-upcoming-wedding-themed-comedy-8014472/", "urlToImage": "https://images.indianexpress.com/2021/11/Priyanka-Chopra-Diwali-party-1.jpg", "publishedAt": "2022-07-07T08:21:27Z", "content": "Actor-writer-producer-director Mindy Kaling revealed more details about her upcoming romantic comedy film with fellow multi-hyphenate Priyanka Chopra. The two are collaborating on the film, which was… [+2095 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Residential market in Chennai grew by 21% in Jan-June, says study", "description": "Chennai recorded sale of 6,951 housing units during the first half of the year compared to 5,751 sold in the same period last year, Knight Frank India said in its report 'India Real Estate H1-2022.'", "url": "https://indianexpress.com/article/cities/chennai/residential-market-in-chennai-grew-by-21-in-jan-june-says-study-8014482/", "urlToImage": "https://images.indianexpress.com/2022/07/Bengaluru-real-estate.jpeg", "publishedAt": "2022-07-07T08:17:45Z", "content": "The Chennai residential market has registered a 21 per cent year-on-year growth on sales during the first six months of this year, a study by Knight Frank India revealed on Wednesday.The city recorde… [+1815 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anonna Dutt", "title": "Explained: Under tax lens now, how Micro Labs made Dolo-650 pandemic’s go-to fever drug", "description": "Dolo-650 manufacturer Micro Labs Ltd is under the income tax scanner for suspected tax evasion. The company saw a rise in sales of Dolo-650 during the Covid-19 pandemic.", "url": "https://indianexpress.com/article/explained/micro-labs-dolo-650-tax-evasion-8014547/", "urlToImage": "https://images.indianexpress.com/2022/07/Micro-Labs-1.jpg", "publishedAt": "2022-07-07T08:15:28Z", "content": "Bengaluru-based pharmaceutical company Micro Labs Ltd, the manufacturer of Dolo-650 tablet, is under the income tax scanner for suspected tax evasion.The tax department is looking at financial record… [+3035 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Shehnaaz Gill serves a storm on Instagram in red dress, fans call her ‘bawaal’. Watch", "description": "Many even called Shehnaaz Gill 'stunning' and 'beautiful', while a lot of her fans added heart and fire emojis on the video.", "url": "https://indianexpress.com/article/entertainment/television/shehnaaz-gill-serves-a-storm-on-instagram-in-red-dress-fans-call-her-bawaal-watch-8014473/", "urlToImage": "https://images.indianexpress.com/2022/07/shehnaaz-gill-new-photos-1.jpg", "publishedAt": "2022-07-07T08:14:30Z", "content": "Shehnaaz Gill on Thursday surprised her fans as she shared a video on Instagram. The Bigg Boss 13 star looks gorgeous in the video as she dons a backless satin red dress. Sashaying around the beautif… [+1167 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Do not feel safe anywhere at this moment: Leena Manimekalai on ‘Kaali’ row", "description": "The Toronto-based director, Leena Manimekalai, described the online vitriol as a \"grand-scale mass lynching\" by right-wing Hindu groups.", "url": "https://indianexpress.com/article/india/kaali-row-leena-manimekalai-right-wing-hindu-groups-8014498/", "urlToImage": "https://images.indianexpress.com/2022/07/Leena-Manimekali-twt-1200-1.jpg", "publishedAt": "2022-07-07T08:13:09Z", "content": "At the centre of a huge storm over her documentary “Kaali”, Leena Manimekalaion Thursday said she does not feel safe “anywhere at this moment”. The filmmaker is facing several FIRs following outrage … [+2431 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Madras HC dismisses plea to freeze AIADMK symbol, imposes Rs 25,000 cost on litigant", "description": "The petitioner had approached the Court without even waiting for a week from the ECI. The petition was filed purely for cheap publicity, the bench said and dismissed it in limine.", "url": "https://indianexpress.com/article/cities/chennai/madras-hc-dismisses-plea-to-freeze-aiadmk-symbol-imposes-rs-25000-cost-on-litigant-8014543/", "urlToImage": "https://images.indianexpress.com/2022/07/Madras-HC-2-3-1-2.jpg", "publishedAt": "2022-07-07T08:09:39Z", "content": "The Madras High Court on Thursday imposed a cost of Rs 25,000 on a PIL petitioner, who prayed for a direction to the Election Commission of India to freeze the AIADMK’s “Two Leaves” symbol.The petiti… [+964 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Woman tries to sell furniture online for Rs 21,000, instead loses Rs 3.77 lakh to cyber fraud", "description": "According to the woman, her company’s chief general manager called her saying that he wanted to sell some furniture for Rs 21,000 and he met a potential customer on Quickr, an online marketplace, who showed interest in buying them.", "url": "https://indianexpress.com/article/cities/mumbai/woman-tries-to-sell-furniture-online-for-rs-21000-instead-loses-rs-3-77-lakh-to-cyber-fraud-8014532/", "urlToImage": "https://images.indianexpress.com/2022/07/cyber-crime-2.jpg", "publishedAt": "2022-07-07T08:09:04Z", "content": "A 26-year-old woman in Mumbai who tried to sell furniture worth Rs 21,000 on an online platform ended up losing Rs 3.77 lakh after a cyber fraudster tricked her into sending the money under the prete… [+1777 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "New UK finance minister Nadhim Zahawi says PM Boris Johnson must go", "description": "Nadhim Zahawi did not say he had resigned, but said he went to the prime minister's office in Downing Street with cabinet colleagues on Wednesday evening to tell Boris Johnson to \"leave with dignity\".", "url": "https://indianexpress.com/article/world/new-uk-finance-minister-nadhim-zahawi-boris-johnson-8014534/", "urlToImage": "https://images.indianexpress.com/2022/07/boris-johnson-1.jpg", "publishedAt": "2022-07-07T08:07:28Z", "content": "Britain’s new finance minister Nadhim Zahawi told Boris Johnson to resign on Thursday, less than 48 hours after the prime minister promoted him to the job, saying the crisis engulfing the government … [+795 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Gold, silver price today: Gold declines Rs 427/10 gms, silver rises 134/kg", "description": "Gold, Silver Rates Today News Update: The 999 purity gold on Thursday opened at Rs 50,871 per 10 grams, dropping Rs 427 from Wednesday's closing price of Rs 51,298, while the 999 purity silver opened at Rs 56,583 per kg, up Rs 134 from Rs 56,449. Keep reading…", "url": "https://indianexpress.com/article/business/commodities/gold-silver-price-today-july-7-bullion-rates-mcx-8014258/", "urlToImage": "https://images.indianexpress.com/2022/07/gold-jewellery-bloomberg-1200.jpg", "publishedAt": "2022-07-07T08:04:36Z", "content": "Gold silver prices today, July 7, 2022: The price of gold prices opened lower while that of silver inched higher in the key spot markets on Thursday, July 7, 2022.The 999 purity gold opened at Rs 50,… [+2756 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "TVS launches new bike ‘RONIN’ priced at Rs 1.49 lakhs", "description": "The TVS bike is powered by a 225.9 cc 4 valve, oil-cooled single-cylinder engine that produces 20.4 hp at 7750rpm.", "url": "https://indianexpress.com/article/auto-travel/launches/tvs-brings-new-bike-ronin-at-rs-1-49-lakhs-8014286/", "urlToImage": "https://images.indianexpress.com/2022/07/TVS-Ronin-2-jpg.jpg", "publishedAt": "2022-07-07T08:02:22Z", "content": "TVS motor company has launched a new 225 cc bike “TVS RONIN”, based on “modern-retro” priced at Rs 1.49 lakhs (ex-showroom).The auto company, with this bike, aims to enter into the “premium lifestyle… [+1501 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Maharashtra CM Eknath Shinde takes charge at Mantralaya; Bal Thackeray, Dighe’s photos in his office", "description": "Speaking to reporters, Deepak Kesarkar, spokesperson of the Shinde-led faction of MLAs, said Bal Thackeray was nobody's property.", "url": "https://indianexpress.com/article/cities/mumbai/maharashtra-cm-eknath-shinde-takes-charge-8014536/", "urlToImage": "https://images.indianexpress.com/2022/07/Shinde-Main.jpg", "publishedAt": "2022-07-07T07:56:43Z", "content": "Maharashtra Chief Minister Eknath Shinde officially took charge of his post at the state secretariat Mantralaya on Thursday.A puja was held at the tastefully decorated office of the chief minister be… [+1560 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Hrithik Roshan is experiencing Rocketry FOMO, R Madhavan calls him ‘my special hero’", "description": "Hrithik Roshan has showered praise on R Madhavan's directorial debut, Rocketry: The Nambi Effect. He said he is looking forward to watch it.", "url": "https://indianexpress.com/article/entertainment/bollywood/hrithik-roshan-is-experiencing-rocketry-fomo-r-madhavan-calls-him-my-special-hero-8014308/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-1-12.jpg", "publishedAt": "2022-07-07T07:54:17Z", "content": "Actor R. Madhavan has responded to Bollywood star Hrithik Roshan’s praise for his directorial debut Rocketry: The Nambi Effect, calling him “my special hero’. Hrithik said that he is experiencing FOM… [+1881 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "CLAT 2022: Second merit list released at consortiumofnlus.ac.in", "description": "CLAT 2022 Second allotment list: Candidates can now check he second allotment list on the official website - consortiumofnlus.ac.in. The admission process for second list will conclude on July 9.", "url": "https://indianexpress.com/article/education/clat-2022-second-merit-list-released-at-consortiumofnlus-ac-in-8014463/", "urlToImage": "https://images.indianexpress.com/2022/06/Kerala-results-2.jpg", "publishedAt": "2022-07-07T07:50:46Z", "content": "The National Law Universities (NLU) released the second provisional CLAT 2022 merit list. Candidates can now check he second allotment list on the official website – consortiumofnlus.ac.in. Students … [+1394 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Roshni Chopra shares five home décor trends ‘that will never go out of style’", "description": "If you are someone who likes to keep it classic, there are some home décor trends that you shouldn't miss out on", "url": "https://indianexpress.com/article/lifestyle/life-style/roshni-chopra-home-decor-trends-classic-elegant-8004492/", "urlToImage": "https://images.indianexpress.com/2022/07/roshni-chopra.jpg", "publishedAt": "2022-07-07T07:50:19Z", "content": "When it comes to decorating your new abode or amping up your old space with new elements, there’s never a dearth of ideas. The home décor industry is brimming with new trendsand themes, fit for every… [+1714 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Telangana: BJP demands ban on PFI after four activists arrested under UAPA", "description": "Three PFI activists were arrested in Telangana's Nizamabad district Wednesday and booked under the UAPA on charges of conspiring and attempting to create religious animosity and promote enmity between groups.", "url": "https://indianexpress.com/article/cities/hyderabad/telangana-bjp-demands-ban-on-pfi-after-four-activists-arrested-under-uapa-8014505/", "urlToImage": "https://images.indianexpress.com/2022/07/telangana-bjp.jpg", "publishedAt": "2022-07-07T07:49:40Z", "content": "The BJPs Telangana unit has called for the ban of the Popular Front of India following the arrest of four of its activists in Nizamabad and urged the Union Ministry of Home Affairs to ban the “radica… [+2672 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "INS Vikrant cheating case: HC extends interim protection from arrest to BJP leader Kirit Somaiya, son till August 10", "description": "The Bombay High Court had earlier granted interim protection from arrest to Kirit Somaiya and his son till July 7 and asked them to cooperate with the probe while seeking the investigation progress report from Mumbai Police.", "url": "https://indianexpress.com/article/cities/mumbai/ins-vikrant-cheating-case-bjp-leader-kirit-somaiya-son-navy-aircraft-carrier-8014477/", "urlToImage": "https://images.indianexpress.com/2022/07/kirit-ins-vikrant.jpg", "publishedAt": "2022-07-07T07:44:04Z", "content": "The Bombay High Court on Thursday extended the interim protection from arrest to BJP leader Kirit Somaiya and his son Neil till August 10 in connection with a cheating case alleging swindling of fund… [+2325 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "Aim to increase international students in India to 5 lakh in two years: Rajkumar Ranjan Singh", "description": "Dr Rajkumar Ranjan Singh is hoping that India will be able to increase the number of international students studying in Indian universities from 50,000 currently to five lakh by the year 2024.", "url": "https://indianexpress.com/article/education/aim-to-increase-international-students-in-india-to-5-lakh-in-two-years-rajkumar-ranjan-singh-at-chandigarh-university-8010853/", "urlToImage": "https://images.indianexpress.com/2022/07/Rajkumar-Ranjan-Singh.jpg", "publishedAt": "2022-07-07T07:40:40Z", "content": "India aims to increase the number of international students to at least five lakh in the next two years, said the Union Minister of State for External Affairs and Education Dr Rajkumar Ranjan Singh, … [+1330 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Wimbledon 2022 Singles Semi-Finals Live Streaming: When and where to watch", "description": "Wimbledon 2022 Semi-Finals Live Streaming, Broadcast Details: How to watch Wimbledon Semi-Finals Live", "url": "https://indianexpress.com/article/sports/tennis/wimbledon-2022-singles-semi-finals-live-streaming-tv-ist-8012312/", "urlToImage": "https://images.indianexpress.com/2022/06/Untitled-design-2-8.jpg", "publishedAt": "2022-07-07T07:39:58Z", "content": "Wimbledon 2022 Singles Semi-Finals Live Streaming: And then there were four. It is semi-finals time at Wimbledon 2022. Just three games in the men’s and women’s categories and we’ll have our singles … [+1522 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "Watch: Frenzy at Kerala’s Lulu malls as huge crowds throng outlets for midnight sale", "description": "Midnight sale at Lulu International Shopping Mall in Kerala receives an overwhelming response in both Kochi and Thiruvananthapuram", "url": "https://indianexpress.com/article/trending/trending-in-india/lulu-mall-kerala-midnight-sale-overcrowded-video-8014085/", "urlToImage": "https://images.indianexpress.com/2022/07/lulu-mall-midnight-sale-crowd.jpg", "publishedAt": "2022-07-07T07:35:12Z", "content": "In a bid to renew nightlife shopping, Lulu International Shopping Mall in Kerala has announced midnight sales and received an overwhelming response. Now, videos and photos of people thronging their o… [+1456 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Explained Desk", "title": "Explained: Why does Raja Sabha have ‘nominated’ MPs, and who gets nominated?", "description": "The Constitution allows for 12 nominated members in the Rajya Sabha with those favourable to ruling parties often getting the nomination", "url": "https://indianexpress.com/article/explained/rajya-sabha-nominated-mp-explained-8014310/", "urlToImage": "https://images.indianexpress.com/2022/07/mahatma-gandhi-parliament.jpg", "publishedAt": "2022-07-07T07:34:40Z", "content": "The government on Wednesday (July 6) nominated musician Ilaiyaraaja, track-and-field icon PT Usha, Telugu screenwriter V Vijayendra Prasad, and philanthropist and spiritual leader Veerendra Heggade t… [+5144 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Brazil at risk of unrest more severe than January 6 US riots, warns elections chief", "description": "Bolsonaro has cast doubts on the voting system, without evidence, going as far as threatening to reject an unfavorable outcome in the elections.", "url": "https://indianexpress.com/article/world/brazil-unrest-january-6-us-riots-election-chief-8014278/", "urlToImage": "https://images.indianexpress.com/2022/06/Brazil.jpg", "publishedAt": "2022-07-07T07:26:59Z", "content": "Brazil is at risk of facing a more serious incident than the January 6, 2021, attack on the US Capitol, said the head of the country’s Electoral Court, Edson Fachin, on Wednesday ahead of the preside… [+1230 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Iran TV says several foreigners, a UK diplomat, detained for alleged spying", "description": "On Wednesday, Iranian state TV reported that several foreigners had been detained on grounds of suspiciously collecting soil samples from restricted areas near which missile tests were being conducted in central and southern Iran.", "url": "https://indianexpress.com/article/world/iran-tv-claims-foreigners-detained-for-spying-8014377/", "urlToImage": "https://images.indianexpress.com/2020/07/iran-1200-1.jpg", "publishedAt": "2022-07-07T07:25:18Z", "content": "Iran’s Revolutionary Guards have detained several foreigners, including Britain’s second most senior envoy in Tehran, for alleged acts of spying such as taking soil samples in restricted areas, state… [+1909 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Ranveer Singh eats a bug in new Ranveer vs Wild with Bear Grylls promo. Watch", "description": "Ranveer Vs Wild with Bear Grylls will premiere on Netflix on July 8. Apart from this, the actor will also be seen on Karan Johar's Koffee With Karan Season 7 on July 7.", "url": "https://indianexpress.com/article/entertainment/web-series/ranveer-singh-eats-bug-in-new-ranveer-vs-wild-with-bear-grylls-promo-watch-8014301/", "urlToImage": "https://images.indianexpress.com/2022/07/singh1200-1.jpg", "publishedAt": "2022-07-07T07:22:24Z", "content": "Actor Ranveer Singh is the latest Bollywood celebrity to take part in Bear Grylls’ adventure series, Into the Wild, albeit with a twist. After Bollywood stars like Akshay Kumar, Ajay Devgn and Vicky … [+1727 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pune: SPPU to empower early stage startups with Rs 5 lakh fund, invites applications", "description": "‘Power 2022’, a pre-incubation programme, will provide guidance on starting a business and help innovators build their startup", "url": "https://indianexpress.com/article/cities/pune/sppu-savitribai-phule-pune-university-early-age-startups-funding-applications-8014413/", "urlToImage": "https://images.indianexpress.com/2022/07/SPPU.jpg", "publishedAt": "2022-07-07T07:22:12Z", "content": "The Center for Innovation, Incubation and Linkages at Savitribai Phule Pune University is offering an opportunity for early stage startups that need guidance and funding through a new pre-incubation … [+1036 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Chennai corporation tightens Covid curbs, 121 people fined for mask violations", "description": "Among the 15 zones, Kodambakkam and Tondiarpet accounted for most of the mask violations, with 19 people fined at each zone.", "url": "https://indianexpress.com/article/cities/chennai/chennai-corporation-tightens-covid-curbs-121-people-fined-for-mask-violations-8014462/", "urlToImage": "https://images.indianexpress.com/2022/07/Chennai-COVID-19-10-1-1-1.jpeg", "publishedAt": "2022-07-07T07:22:06Z", "content": "The Greater Chennai Corporation on Wednesday fined 121 people for not wearing masks and collected a sum of Rs 60,500 as part of its enforcement of Covid-19 protocols, according to a release from the … [+1138 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "A Year Since a President’s Killing, Haitians Keep Waiting to Hit Rock Bottom", "description": "This week marks a year since Haitian President Jovenel Moïse was killed in his home in one of the capital’s wealthiest neighborhoods as dozens of police stepped aside, letting the assassins through.", "url": "https://indianexpress.com/article/world/haitian-president-jovenel-moise-killing-8014357/", "urlToImage": "https://images.indianexpress.com/2022/07/Jovenel-Moise.jpg", "publishedAt": "2022-07-07T07:18:04Z", "content": "The warring gangs took over several neighborhoods around Port-au-Prince, Haiti, weeks ago, going door to door, raping women and girls, killing the men, beheading many of the adults and then forcing t… [+7856 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Maulshree Seth", "title": "Newsmaker | Now in charge of UP health, Deputy CM Brajesh Pathak’s new test: walking the talk", "description": "Having established links with the RSS-BJP Brahmin network in the state, Brajesh Pathak’s rise in the ruling party was equally quick.", "url": "https://indianexpress.com/article/political-pulse/newsmaker-now-in-charge-of-up-health-deputy-cm-brajesh-pathaks-new-test-walking-the-talk-8014378/", "urlToImage": "https://images.indianexpress.com/2022/07/Brajesh-Pathak.jpg", "publishedAt": "2022-07-07T07:14:59Z", "content": "Uttar Pradesh Deputy Chief Minister Brajesh Pathak is known as a leader unafraid of speaking his mind and for whom his approachability is a key strength. The Brahmin face of the second Yogi Adityanat… [+2989 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mumbai: Five pet puppies ‘killed by poisoning’ in Kandivali", "description": "The pet owner alleged that she suspects her neighbour might have killed the dogs as he used to pick fights with her over the pets frequently.", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-five-pet-puppies-poisoning-kandivali-8014384/", "urlToImage": "https://images.indianexpress.com/2022/07/Puppies.jpg", "publishedAt": "2022-07-07T07:10:31Z", "content": "The Samta Nagar police in Mumbai have registered a first information report (FIR) against an unknown person for allegedly killing five puppies, owned by a 69-year-old woman, by poisoning them in Kand… [+1071 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Ludhiana: Two injured in boiler blast in a factory", "description": "The impact of the explosion was so powerful that parts of the boiler broke through the side walls and fell outside, in the adjacent fields.", "url": "https://indianexpress.com/article/cities/ludhiana/ludhiana-boiler-factory-blast-8014353/", "urlToImage": "https://images.indianexpress.com/2022/07/ludhiana-1200.jpg", "publishedAt": "2022-07-07T07:09:02Z", "content": "One worker died and another was injured after a boiler exploded at a dyeing factory located in Gaunsgarh village near Meharban in Ludhiana late on Wednesday.According to SI Jagdeep Singh, the station… [+695 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Four injured after clashes in Karnataka’s Kerur, large gatherings banned", "description": "The police have registered four FIRs and arrested 18 people till now.", "url": "https://indianexpress.com/article/cities/bangalore/four-injured-after-clashes-in-karnatakas-kerur-8014299/", "urlToImage": "https://images.indianexpress.com/2022/07/Screenshot-2022-07-07-at-12.33.08-PM-3.jpg", "publishedAt": "2022-07-07T07:08:29Z", "content": "One person was stabbed and three others were injured in the Kerur town of Karnataka’s Bagalkote district in a clash between two groups Wednesday, the police said Thursday."}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "Mumbai University Admissions 2022: Second merit list released", "description": "Mumbai University Admissions 2022: Students can now visit their official website of Mumbai university, or even visit the official websites of individual colleges they are interested in, and check the second merit list for the applied programme.", "url": "https://indianexpress.com/article/education/mumbai-university-admissions-2022-second-merit-list-released-mu-ac-in-8014289/", "urlToImage": "https://images.indianexpress.com/2022/07/Mumbai-University-1-1.jpg", "publishedAt": "2022-07-07T07:06:22Z", "content": "Mumbai University Admissions 2022: Mumbai University has released the second list for admissions to various courses in different colleges for the upcoming academic session. Students can now check det… [+1395 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Rajasthan CM Ashok Gehlot takes a dig at Sachin Pilot", "description": "Pilot and Gehlot were at loggerheads soon after the victory of the Congress in December 2018 Assembly polls to become the chief minister. The party made Gehlot the CM of Rajasthan for a third time and gave Pilot the post of deputy CM.", "url": "https://indianexpress.com/article/cities/jaipur/rajasthan-cm-ashok-gehlot-takes-a-dig-at-sachin-pilot-8014376/", "urlToImage": "https://images.indianexpress.com/2022/07/Pilot-vs-Gehlot.jpg", "publishedAt": "2022-07-07T07:05:20Z", "content": "Rajasthan Chief Minister Ashok Gehlot on Wednesday took a subtle dig at former Deputy CM Sachin Pilot. After Gehlot had accused Union Minister Gajendra Singh Shekhawat and Pilot of conniving to toppl… [+1559 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Rajinikanth, Kamal Haasan, Chiranjeevi and Mohanlal congratulate Ilaiyaraaja for his Rajya Sabha nomination", "description": "Ilaiyaraaja was nominated to the Rajya sabha along with sports icon P T Usha, popular screenwriter V Vijayendra Prasad and philanthropist and spiritual leader Veerendra Heggade.", "url": "https://indianexpress.com/article/entertainment/tamil/rajinikanth-kamal-haasan-chiranjeevi-mohanlal-congratulate-ilaiyaraaja-after-his-rs-nomination-8014200/", "urlToImage": "https://images.indianexpress.com/2019/06/ilayaraja-1200.jpg", "publishedAt": "2022-07-07T07:05:15Z", "content": "Kamal opined that Ilaiyaraaja could have been given presidency while calling him a ‘musician par excellence.’ Rajinikanth called Ilaiyaraaja a “dear friends”, while tweeting his “heartfelt congratula… [+2951 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Jayashree Narayanan", "title": "Is increased cocoa content in chocolates beneficial for health?", "description": "World Chocolate Day 2022: Cocoa inherently has a bitter and deep taste since it has theobromine which gives its \"stimulatory characteristic and pleasantly bitter taste\", and hence increasing cocoa percentage changes the taste of the chocolate a lot", "url": "https://indianexpress.com/article/lifestyle/food-wine/world-chocolate-day-2022-experts-increase-cocoa-content-health-benefits-bean-to-bar-single-origin-dark-8006990/", "urlToImage": "https://images.indianexpress.com/2022/07/chocolate-cocoa_200_getty.jpg", "publishedAt": "2022-07-07T07:00:44Z", "content": "The Indian chocolate industry is poised to grow at a Compound Annual Growth Rate (CAGR) of 11 per cent for the period of 2022-28, according to a recent study conducted by BlueWeave Consulting, a mark… [+9602 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Shamshera song ‘Fitoor’ features Ranbir Kapoor and Vaani Kapoor frolicking underwater, is like Asoka meets Avatar 2", "description": "YRF has unveiled the second song from the upcoming film Shamshera. Titled \"Fitoor,\" the love track is performed by Arijit Singh and Neeti Mohan, and is picturised on Ranbir Kapoor and Vaani Kapoor.", "url": "https://indianexpress.com/article/entertainment/bollywood/shamshera-song-fitoor-ranbir-kapoor-and-vaani-kapoor-asoka-meets-avatar-2-8014309/", "urlToImage": "https://images.indianexpress.com/2022/07/ranbir-kapoor-vaani-kapoor-shamshera.jpg", "publishedAt": "2022-07-07T07:00:02Z", "content": "Yash Raj Films on Thursday debuted “Fitoor,” the second song from the upcoming film Shamshera, starring Ranbir Kapoor. YRF had previously unveiled the more peppy “Ji Huzoor” performed by Aditya Naray… [+1397 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuradha Mascarenhas", "title": "Pune Cantonment Board in precarious financial condition, says new CEO", "description": "If the Centre does not provide adequate grants in the next two months, giving salaries to the staff would also be difficult, said Subrat Pal, who took charge as the new CEO of the board recently.", "url": "https://indianexpress.com/article/cities/pune/pune-cantonment-board-in-precarious-financial-condition-ceo-8014272/", "urlToImage": "https://images.indianexpress.com/2022/07/pcb-ceo.jpg", "publishedAt": "2022-07-07T06:56:49Z", "content": "Subrat Pal, who took charge over a month ago as the new chief executive officer (CEO) of Pune Cantonment Board, the administrative body for the region of Camp Cantonment, has expressed worries over t… [+2368 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Nihal Koshie", "title": "From track and fields to the Rajya Sabha, P T Usha has a new role to play", "description": "In 2016, PT Usha had said that she had no political leanings when she was named the chairperson of the organising committee of the BJP's national executive meet in Kozhikode.", "url": "https://indianexpress.com/article/political-pulse/from-track-and-fields-to-the-rajya-sabha-p-t-usha-has-a-new-role-to-play-8014328/", "urlToImage": "https://images.indianexpress.com/2022/07/PT-USha.jpg", "publishedAt": "2022-07-07T06:55:54Z", "content": "Sprint queen P T Usha, along with music maestro Ilaiyaraaja, acclaimed screenwriter V Vijayendra Prasad, and philanthropist and spiritual leader Veerendra Heggade, was nominated to the Rajya Sabha on… [+2203 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Nihal Koshie", "title": "From track and fields to the Rajya Sabha, P T Usha has a new role to play", "description": "In 2016, PT Usha had said that she had no political leanings when she was named the chairperson of the organising committee of the BJP's national executive meet in Kozhikode.", "url": "https://indianexpress.com/article/sports/from-track-and-fields-to-the-rajya-sabha-p-t-usha-has-a-new-role-to-play-8014328/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-33.jpeg", "publishedAt": "2022-07-07T06:55:54Z", "content": "Sprint queen P T Usha, along with music maestro Ilaiyaraaja, acclaimed screenwriter V Vijayendra Prasad, and philanthropist and spiritual leader Veerendra Heggade, was nominated to the Rajya Sabha on… [+2203 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Court grants stay to order on vacating Mumbai’s iconic ice-cream parlour K Rustom premises", "description": "The interim stay has been granted subject to the condition that K Rustom and Company will deposit Rs 2.5 lakh per month in court by the 10th of each month till the final disposal of the appeal.", "url": "https://indianexpress.com/article/cities/mumbai/court-stay-order-vacating-mumbai-k-rustom-icecream-parlour-8014154/", "urlToImage": "https://images.indianexpress.com/2022/07/k-rustom.jpg", "publishedAt": "2022-07-07T06:54:28Z", "content": "A small causes appellate court has granted an interim stay to an order which had directed Mumbais iconic ice-cream parlour K Rustom to vacate its premises at the North Stand building, part of the Bra… [+2224 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "The rise of the far-right Latina", "description": "The Trump age has given rise to a new brand of Texas Republicans, one of whom is already walking the halls of Congress: the far-right Latina.", "url": "https://indianexpress.com/article/world/texas-republicans-hispanic-vote-8014243/", "urlToImage": "https://images.indianexpress.com/2022/07/tr1.jpg", "publishedAt": "2022-07-07T06:53:30Z", "content": "For years, Texas Republicans tried to win the Hispanic vote using a Bush-era brand of compassionate conservatism. The idea was that a moderates touch and softer rhetoric on immigration were key to ma… [+9087 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gurgaon: Man held for trying to murder woman for ‘refusing to marry him’", "description": "19-year-old tells police that the accused who shot at her was a former classmate who had been stalking her", "url": "https://indianexpress.com/article/cities/delhi/gurgaon-man-held-for-trying-to-murder-woman-8014132/", "urlToImage": "https://images.indianexpress.com/2022/07/Delhi-Police-5-2.jpeg", "publishedAt": "2022-07-07T06:53:02Z", "content": "The Gurgaon police have arrested a man for allegedly trying to murder his former classmate in IMT Manesar after she refused to marry him. The 19-year-old woman told the police that the accused had be… [+1831 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sana Farzeen", "title": "Kapil Sharma’s New York shows gets cancelled, walks as ‘Vehle Munde’ on the roads of US", "description": "Kapil Sharma's weekend show in New York has been pushed. While there's a buzz that it's because of a recent case by an American promoter, his team says the shows have been postponed because of a visa issue.", "url": "https://indianexpress.com/article/entertainment/television/kapil-sharma-new-york-shows-gets-cancelled-visa-issues-8014097/", "urlToImage": "https://images.indianexpress.com/2022/07/kapil-sharma-show-new-york.jpg", "publishedAt": "2022-07-07T06:49:58Z", "content": "After successful shows in Vancouver and Toronto, Kapil Sharma and his teammates were set to perform in New York this weekend. However, the shows now stand cancelled. As per the promoter of the event,… [+2166 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Duffer Brothers announce Stranger Things spin-off, launch production house Upside Down Pictures", "description": "The live-action Stranger Things spin-off series is based on an original idea by The Duffer Brothers, with Upside Down and Shawn Levy's 21 Laps as the producers.", "url": "https://indianexpress.com/article/entertainment/web-series/duffer-brothers-announce-stranger-things-spin-off-launch-production-house-upside-down-pictures-8014091/", "urlToImage": "https://images.indianexpress.com/2022/07/Duffer-Brother-Millie-Bobby-Brown-and-Shawn-Levy-1200by667.jpg", "publishedAt": "2022-07-07T06:48:43Z", "content": "Stranger Things creators Matt and Ross Duffer have announced a spin-off show to their blockbuster sci-fi series. The filmmaker duo, popularly known as The Duffer Brothers, have launched their product… [+2649 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Careers360", "title": "JEE Main 2022 Session 1 result likely today at jeemain.nta.nic.in; check steps to download score card", "description": "JEE Main 2022 Session 1 Result: NTA is expected to announce the JEE Main 2022 session 1 result today. Candidates will be able to check their scores from the official JEE Main website - jeemain.nta.nic.in.", "url": "https://indianexpress.com/article/education/jee-main-2022-session-1-result-likely-today-at-jeemain-nta-nic-in-check-steps-to-download-score-card-nta-nic-in-8014212/", "urlToImage": "https://images.indianexpress.com/2022/07/JEE-Main-3.jpg", "publishedAt": "2022-07-07T06:45:29Z", "content": "JEE Main 2022 Session 1 Result: The National Testing Agency (NTA) is likely to declare JEE Main 2022 result for session 1 today. To check their score, candidates will have to visit the official JEE M… [+1377 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Rohit Ranjan seeks urgent hearing in Supreme Court on plea against FIRs lodged for doctored Rahul Gandhi video", "description": "A day after the video was aired, Zee News anchor Rohit Ranjan had apologised for mistakenly playing Rahul Gandhi's statement out of context by linking it with the Udaipur murder case.", "url": "https://indianexpress.com/article/india/rohit-ranjan-supreme-court-plea-doctored-rahul-gandhi-video-8014304/", "urlToImage": "https://images.indianexpress.com/2022/07/Zee-journalist-Rohit-Ranjan.jpg", "publishedAt": "2022-07-07T06:44:59Z", "content": "A TV news anchor, facing several FIRs in some states for playing a doctored clip of Congress leader Rahul Gandhi, on Thursday again sought urgent hearing from the Supreme Court on his plea seeking pr… [+3147 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi Deputy CM Manish Sisodia launches new centre for artificial intelligence at Netaji Subhas University of Technology", "description": "The centre is envisaged to enhance the university's research capabilities and is equipped with high-end graphical processing units, workstations, data storage and communication systems.", "url": "https://indianexpress.com/article/cities/delhi/delhi-manish-sisodia-artificial-intelligence-netaji-subhas-university-technology-8014131/", "urlToImage": "https://images.indianexpress.com/2022/07/manish-sisodia-7591-1.jpg", "publishedAt": "2022-07-07T06:42:49Z", "content": "Delhi Deputy Chief Minister Manish Sisodia inaugurated a new centre of excellence in artificial intelligence at Netaji Subhas University of Technology (NSUT) Wednesday.According to the institute spok… [+1421 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Why Apple wants to sell more high-end ‘iPhone 14 Pro’ in 2022", "description": "Apple will be primarily focusing on selling more high-end iPhone 14 Pro to consumers in an effort to expand the market for super-premium smartphones in 2022.", "url": "https://indianexpress.com/article/technology/mobile-tabs/iphone-14-pro-will-be-key-focus-for-apple-in-2022-8014049/", "urlToImage": "https://images.indianexpress.com/2022/07/iphone-14-1-1.jpeg", "publishedAt": "2022-07-07T06:42:15Z", "content": "A significant change is coming to the 2022 iPhone lineup and it isn’t just about price. But rather how Apple differentiates the ‘Pro’ range from ‘non-Pro’ models. It starts with the upcoming iPhone 1… [+3259 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Mother gives helping hand in final stride, son disqualified", "description": "A somewhat similar incident had occurred at the 1992 Barcelona Olympics where Derek Redmond, the Great Britain runner, had won his quarterfinal after achieving the fastest time in the 400m event’s first round.", "url": "https://indianexpress.com/article/sports/mother-gives-helping-hand-in-final-stride-son-disqualified-8014128/", "urlToImage": "https://images.indianexpress.com/2022/07/sports-8.jpg", "publishedAt": "2022-07-07T06:41:15Z", "content": "In an unusual incident on Wednesday, a son was disqualified after his mother helped him cross the finish line. Runner Artem Burtsev was leading the 10 km event in the Russian Far Eastern region of Ya… [+1610 chars]"}]}