{"status": "ok", "totalResults": 394, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "New Zealand Prime Minister Jacinda Ardern tests positive for Covid-19", "description": "Jacinda Ardern had been in isolation since Sunday, when her partner Clarke Gayford tested positive for Covid-19.", "url": "https://indianexpress.com/article/world/new-zealand-prime-minister-jacinda-ardern-covid-positive-7916580/", "urlToImage": "https://images.indianexpress.com/2022/05/ardern-covid.jpg", "publishedAt": "2022-05-14T02:51:03Z", "content": "New Zealand Prime Minister Jacinda Ardern tested positive for Covid-19 with moderate symptoms, her office said in a statement on Saturday.She will not be in parliament for the government’s emissions … [+1313 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Aviation Minister Scindia to examine airlines charging passengers for issuing boarding passes at check-in counters", "description": "Currently, many airlines in India charge passengers a certain fee for issuing boarding passes at check-in counters.", "url": "https://indianexpress.com/article/india/airline-boarding-pass-charges-jyotiraditya-scindia-7916573/", "urlToImage": "https://images.indianexpress.com/2021/08/Jyotiraditya-Scindia-1.jpg", "publishedAt": "2022-05-14T02:36:32Z", "content": "Aviation Minister Jyotiraditya Scindia on Friday said he is examining the matter of airlines charging passengers a fee for issuing boarding passes at check-in counters inside the terminals.Ridiculous… [+923 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Arushi Jain", "title": "Jayeshbhai Jordaar, Modern Love Mumbai, Puzhu: Top shows, films to watch this weekend", "description": "Not sure what to watch? For this weekend, we recommend 6 titles that would be worth your time - from Jayeshbhai Jordaar in theatres to Puzhu on SonyLIV.", "url": "https://indianexpress.com/article/entertainment/web-series/jayeshbhai-jordaar-modern-love-mumbai-puzhu-top-shows-films-to-watch-this-weekend-7915778/", "urlToImage": "https://images.indianexpress.com/2022/05/what-to-watch-.jpg", "publishedAt": "2022-05-14T02:31:38Z", "content": "Jayeshbhai Jordaar and Puzhu are the two cinematic highlights of this weekend. Both of them are family dramas led by actors Ranveer Singh and Mammootty respectively. While Jayeshbhai Jordaar is out i… [+4039 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Mimansa Shekhar", "title": "‘Neena Gupta and the director said I was bad, didn’t know how to act’: Amit Sadh revisits Kyun Hota Hai Pyaarrr", "description": "This week's First of Many features Amit Sadh. In the 98th edition of our series, the actor recalls how he landed up his first acting project, TV show Kyun Hota Hai Pyarrr which aired on Star Plus.", "url": "https://indianexpress.com/article/entertainment/television/amit-sadh-acting-debut-tv-show-kyun-hota-hai-pyaar-first-of-many-7913731/", "urlToImage": "https://images.indianexpress.com/2022/05/First-of-Many-7-Amit-Sadh.jpg", "publishedAt": "2022-05-14T02:29:43Z", "content": "Amit Sadh believes he was so bad in his debut acting project that he was sure he’ll get replaced. The actor might be completing two decades in the industry this year, but his start wasn’t a smooth on… [+6119 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sampada Sharma", "title": "Hrishikesh Mukherjee’s Chupke Chupke was the subtle antidote to the ‘angry young man’ era; a balance we have forgotten today", "description": "The 1970s were the era of the 'angry young man' but it was also the era where every 'larger than life' hero film was balanced with a subtle, almost relatable film. For every Deewar, there was a Chupke Chupke.", "url": "https://indianexpress.com/article/entertainment/bollywood/hrishikesh-mukherjee-chupke-chupke-subtle-antidote-to-angry-young-man-era-7915586/", "urlToImage": "https://images.indianexpress.com/2022/05/Chupke-Chupke-1200.jpg", "publishedAt": "2022-05-14T02:29:37Z", "content": "We live in an era where mainstream filmmakers assume that the audience is not smart enough to catch what is being implied, hence, we get the overdose of sound effects, multiple shots establishing who… [+4099 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rohan Naahar", "title": "Operation Mincemeat movie review: Colin Firth leads the cream of British acting in old-fashioned spy drama", "description": "Operation Mincemeat movie review: Colin Firth and Matthew Macfadyen star in director John Madden's handsome drama about one of the most unbelievable espionage operations in history.", "url": "https://indianexpress.com/article/entertainment/movie-review/operation-mincemeat-movie-review-colin-firth-spy-drama-7915848/", "urlToImage": "https://images.indianexpress.com/2022/05/operation-mincemeat-movie-review.jpg", "publishedAt": "2022-05-14T02:29:33Z", "content": "An exceptionally packed year for dad movies continues with Operation Mincemeat, the new World War II thriller that should make for an excellent companion piece to Munich – The Edge of War and The Out… [+3821 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Doctor Strange in the Multiverse of Madness writer Michael Waldron denies being forced to include Illuminati, opens up about reshoots", "description": "Michael Waldron, the writer of Doctor Strange in the Multiverse of Madness, spoke about the Illuminati sequence and whether it was studio-mandated or had a different lineup originally.", "url": "https://indianexpress.com/article/entertainment/hollywood/doctor-strange-in-the-multiverse-of-madness-writer-michael-waldron-illuminati-reshoots-7915066/", "urlToImage": "https://images.indianexpress.com/2022/05/doctor-strange-2-1200.jpg", "publishedAt": "2022-05-14T02:27:44Z", "content": "Doctor Strange in the Multiverse of Madness screenwriter Michael Waldron, who also served as the head writer and creator of the Disney+ series Loki, has spoke about the many twists and turns of the l… [+2430 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Delhi Mundka Fire Tragedy Live: At least 27 killed, several injured; PM Modi announces Rs 2 lakh each for kin of deceased", "description": "Delhi Mundka fire Live Updates 14 May 2022: Reacting to the incident, Prime Minister Narendra Modi said “Extremely saddened by the loss of lives due to a tragic fire in Delhi.", "url": "https://indianexpress.com/article/cities/delhi/delhi-mundka-fire-news-live-updates-death-toll-injured-7916562/", "urlToImage": "https://images.indianexpress.com/2022/05/Delhi-Mundka-fire-1.jpg", "publishedAt": "2022-05-14T02:15:33Z", "content": "Firefighters try to douse a fire which broke out in a building at Mundka, in West Delhi, Friday, May 13, 2022.\r\nWhen the fire department first received a call about the Mundka blaze, they were under … [+1350 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Covid-19 a ‘great turmoil’ to fall on North Korea since its founding, says Kim Jong Un", "description": "North Korea made an unprecedented admission of its first Covid outbreak this week, after claiming no infections for more than two years since the start of the pandemic.", "url": "https://indianexpress.com/article/world/north-korea-covid-19-deaths-7916563/", "urlToImage": "https://images.indianexpress.com/2022/05/KIMJONG.jpeg", "publishedAt": "2022-05-14T02:09:53Z", "content": "North Korean leader Kim Jong Un said on Saturday that the spread of Covid-19 had put the country in “great turmoil” and called for an all-out battle to overcome the epidemic, while 21 new deaths were… [+2700 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi Confidential: Setting a limit", "description": "Congress president Sonia Gandhi admitted that many leaders wanted to be at the Shivir but the party had to limit participation for a variety of reasons.", "url": "https://indianexpress.com/article/delhi-confidential/delhi-confidential-setting-a-limit-congress-chintan-shivir-bjp-tripura-hindus-7916548/", "urlToImage": "https://images.indianexpress.com/2022/05/sonia-gandhi-4.jpg", "publishedAt": "2022-05-14T01:44:57Z", "content": "The inclusion of some leaders and exclusion of many at the Congresss Chintan Shivir has led to much heartburn. And some of the leaders in private allege that the exercise was done in an arbitrary fas… [+2428 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shivani Naik", "title": "Thomas Cup: India seal it with Shetty’s moonball serve, Srikanth’s deception and Prannoy’s hiss", "description": "This Thomas Cup will count as the resurrection of Kidambi Srikanth, who has won all 5 matches, and playing the third rubber lent stability to the core of this group.", "url": "https://indianexpress.com/article/sports/badminton/thomas-cup-india-seal-it-with-shettys-moonball-serve-srikanths-deception-and-prannoys-hiss-7916546/", "urlToImage": "https://images.indianexpress.com/2022/05/HS-Prannoy.jpg", "publishedAt": "2022-05-14T01:44:01Z", "content": "The flick serve in doubles employed by both Satwiksairaj Rankireddy and Chirag Shetty, will go down in history as the singularly cheeky gameplan that took India into the finals of a Thomas Cup.Badmin… [+5135 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Dan Stevens to feature in Godzilla vs Kong follow-up", "description": "Dan Stevens is the first actor to board the follow-up of Godzilla vs. Kong. The details of his character have been kept under wraps.", "url": "https://indianexpress.com/article/entertainment/hollywood/dan-stevens-to-star-in-godzilla-vs-kong-follow-up-7915458/", "urlToImage": "https://images.indianexpress.com/2022/05/Dan-Stevens-n-1200by667.jpg", "publishedAt": "2022-05-14T01:30:38Z", "content": "British actor Dan Stevens will be featuring in director Adam Wingard’s follow-up to his recent hit Godzilla vs. Kong. The new film will be the fifth instalment of Hollywood studio Legendary’s franchi… [+805 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Twitter’s Parag Agrawal after firing top execs: ‘Expect more change for the better’", "description": "Twitter CEO Parag Agrawal has a put out a series of tweets explaining why he chose to fire two top executives at the company, adding that more changes could be on the way.", "url": "https://indianexpress.com/article/technology/tech-news-technology/twitter-parag-agrawal-tweets-after-firing-top-executives-916528/", "urlToImage": "https://images.indianexpress.com/2022/05/Parag_Agrawal_Twitter_1.jpg", "publishedAt": "2022-05-14T01:19:02Z", "content": "Twitter CEO Parag Agrawal has a put out a series of tweets explaining why he chose to fire two top executives at the company, stating that he would not avoid making difficult discussions about the co… [+3949 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Naveed Iqbal, Arun Sharma", "title": "In Valley, Kashmiri Pandits protest killing, teargassed by police", "description": "In Jammu, where Bhat's body was taken for cremation, angry mourners confronted BJP leaders and accused them of making Kashmiri Pandits “sacrificial goats’’ by sending them to Kashmir in the name of the PM’s employment package.", "url": "https://indianexpress.com/article/cities/srinagar/in-valley-kashmiri-pandits-protest-killing-teargassed-by-police-7916502/", "urlToImage": "https://images.indianexpress.com/2022/05/srinagarteargas-4col.jpg", "publishedAt": "2022-05-14T01:10:27Z", "content": "POLICE FIRED tear gas shells to disperse protesters marching towards the Srinagar airport on Friday over the killing of a Kashmiri Pandit government employee by suspected militants even as protests b… [+4561 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "West Bengal: BJP, TMC trade barbs after tribal woman found dead in S Dinajpur", "description": "While the BJP claimed that the woman was gangraped and murdered, the ruling TMC accused the saffron party of politicising the incident.", "url": "https://indianexpress.com/article/cities/kolkata/west-bengal-bjp-tmc-trade-barbs-tribal-woman-found-dead-s-dinajpur-7916513/", "urlToImage": "https://images.indianexpress.com/2022/05/Indian-express-1-3-8.jpg", "publishedAt": "2022-05-14T00:49:44Z", "content": "A tribal woman was found dead in bushes in South Dinajpur district on Thursday night, triggering a political war of words between the ruling Trinamool Congress (TMC) and the BJP over women safety in … [+2873 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "West Bengal: Programmes to mark TMC’s 11 years in govt to continue for a month", "description": "As part of the 'Unnayaner Pathey 11 Bochor' campaign that is being organised in all districts, 631 static exhibitions will be held at various venues, including educational institutions and government offices, to showcase “achievements and successful initiativ…", "url": "https://indianexpress.com/article/cities/kolkata/west-bengal-programmes-mark-tmc-11-years-govt-continue-month-7916511/", "urlToImage": "https://images.indianexpress.com/2022/05/tmc-fb-1.jpg", "publishedAt": "2022-05-14T00:45:32Z", "content": "Programmes being organised since on May 5 by the Mamata Banerjee-led Trinamool Congress (TMC) government in West Bengal to mark the completion of the party’s 11 years in office will continue for a mo… [+1506 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Cracks in buildings: Bowbazar soil to be tested to take call on fate of structures, says Kolkata Mayor", "description": "At least 12 buildings in the congested Bowbazar area developed major cracks on Thursday following which as many as 82 affected people were moved to different hotels.", "url": "https://indianexpress.com/article/cities/kolkata/cracks-buildings-bowbazar-soil-tested-take-call-fate-structures-kolkata-mayor-7916507/", "urlToImage": "https://images.indianexpress.com/2022/05/cracks-1.jpg", "publishedAt": "2022-05-14T00:36:15Z", "content": "Hakim also said that The Kolkata Metro Railway Corporation Ltd (KMRCL) has been asked to test the soil condition in Bowbazar to decide the fate of the buildings that have developed major cracks.\r\nAt … [+1770 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Constable shot dead in Pulwama", "description": "This is the second killing in the Valley in the last 24 hours. A Kashmiri Pandit employee at the Tehsil office at Chadoora, Budgam was killed within his office premises on Thursday evening.", "url": "https://indianexpress.com/article/cities/srinagar/constable-shot-dead-in-pulwama-7916486/", "urlToImage": "https://images.indianexpress.com/2022/04/srinagar.jpeg", "publishedAt": "2022-05-14T00:34:21Z", "content": "A J&amp;K Police constable was shot dead by suspected militants at his residence in Gudroo area of Pulwama early Friday morning. J&amp;K Police IGP Vijay Kumar said Constable Reyaz Ahmad Thokar with … [+1157 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Bashaarat Masood", "title": "J&K: 3 govt employees dismissed, order calls prof ‘threat to state’", "description": "Lt Governor Manoj Sinha ordered Dr Pandit's dismissal “with immediate effect” on Friday, declaring him a “threat to the security of the state”.", "url": "https://indianexpress.com/article/cities/srinagar/jk-3-govt-employees-dismissed-order-calls-prof-threat-to-state-7916505/", "urlToImage": "https://images.indianexpress.com/2022/02/Manoj-Sinha.jpg", "publishedAt": "2022-05-14T00:30:19Z", "content": "A University of Kashmir professor is among three government employees terminated by the J&amp;K government, the latest in a series of dismissals under a law whose growing use in the Valley has trigge… [+2063 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "SSC recruitment exam: Calcutta HC panel seeks action against top officials", "description": "The committee, headed by Justice (retd) RK Bag, recommended criminal proceedings against four ex-state SSC officials and the incumbent president of the West Bengal Board of Secondary Education.", "url": "https://indianexpress.com/article/cities/kolkata/ssc-recruitment-exam-calcutta-hc-panel-seeks-action-against-top-officials-7916495/", "urlToImage": "https://images.indianexpress.com/2022/05/SSC-exam-759.jpg", "publishedAt": "2022-05-14T00:28:01Z", "content": "A committee constituted by the Calcutta High Court on Friday submitted a report on an alleged scam in recruitments by the School Service Commission (SSC), saying that 381 appointments for Group-C pos… [+2416 chars]"}]}