{"status": "ok", "totalResults": 685, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Ahmedabad: EPFO releases pension to 307 employees under Prayaas scheme", "description": "The regional PF office at Ahmedabad released pensions for more than 1,000 persons in June. Of these, 307 were under the Prayaas scheme, which is perhaps the highest in the country, Manoranjan Kumar, regional commissioner of Ahmedabad EPFO office, said", "url": "https://indianexpress.com/article/cities/ahmedabad/ahmedabad-epfo-releases-pension-to-307-employees-prayaas-scheme-8001080/", "urlToImage": "https://images.indianexpress.com/2022/04/money-salary-3-1.jpg", "publishedAt": "2022-06-30T10:49:25Z", "content": "The regional office of the Employees Provident Fund Organisation (EPFO) in Ahmedabad on Thursday released pension to 307 employees of various organisations in Gujarat under the Prayaas scheme. Under … [+1927 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pune: Uttarakhand Governor Lt Gen Gurmit Singh delivers talk on national security at MILIT", "description": "The MILIT, located at Girinagar in Pune, is a premier triservices technical training institute under the Headquarters Integrated Defence Staff.", "url": "https://indianexpress.com/article/cities/pune/pune-uttarakhand-governor-lt-gen-gurmit-singh-delivers-talk-on-national-security-at-milit-8001130/", "urlToImage": "https://images.indianexpress.com/2022/06/milit.jpg", "publishedAt": "2022-06-30T10:48:28Z", "content": "Uttarakhand Governor Lieutenant General Gurmit Singh (Retd) delivered a talk on the National Security Aspects at the Military Institute of Technology (MILIT), Pune Wednesday to students officers from… [+1278 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Vaibhav Jha", "title": "After disgruntled leader complains, AAP Gujarat reinstates him as vice-president, appoints over 6,000 new office-bearers", "description": "Bhemabhai Chaudhary has been reinstated as the vice-president. Nikhil Savani has been made the vice-president of the youth wing while Ramesh Nabhani has been appointed as the state secretary.", "url": "https://indianexpress.com/article/cities/ahmedabad/after-disgruntled-leader-complains-aap-gujarat-reinstates-him-as-vice-president-appoints-over-6000-new-office-bearers-8000985/", "urlToImage": "https://images.indianexpress.com/2022/06/Indian-Express-27.jpeg", "publishedAt": "2022-06-30T10:47:46Z", "content": "Furthering their party framework expansion in Gujarat, Aam Aadmi Party (AAP) on Thursday appointed 6,098 new office-bearers for its state unit, which included the reinstatement of as the vice-preside… [+2721 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Manipur: Six killed, dozens missing as massive landslide blocks river’s flow", "description": "Manipur landslide: The massive debris has blocked the Ijei River, creating a reservoir that may inundate low-lying areas.", "url": "https://indianexpress.com/article/north-east-india/manipur/manipur-landslide-noney-biren-singh-8000610/", "urlToImage": "https://images.indianexpress.com/2022/06/manipur-landslide.jpg", "publishedAt": "2022-06-30T10:44:55Z", "content": "At least six people were killed and dozens were missing after a massive landslide occurred at a railway construction site in Manipur’s Noney district, officials said on Thursday.The incident took pla… [+4095 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manas Srivastava", "title": "UPSC Essentials: Historical Tidbits- Freedom struggle, 20th century literature and Premchand", "description": "20th-century literature integrated socio-economic questions with the freedom movement. This was well highlighted in Premchand's writings. Aspirants must know about the role of literature in different phases of the national movement for UPSC-CSE. Also don't mi…", "url": "https://indianexpress.com/article/upsc-current-affairs/upsc-essentials/upsc-essentials-historical-tidbits-freedom-struggle-20th-century-literature-and-premchand-8000718/", "urlToImage": "https://images.indianexpress.com/2022/06/Untitled-design-40-1.jpg", "publishedAt": "2022-06-30T10:39:08Z", "content": "Tricky questions on national movement’s literature are UPSC’s favourite for prelims. Also, questions in the mains can be framed a little advance. The 20th-century literature is different in many aspe… [+6542 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Ranbir Kapoor talks about his ‘Hindi cinema ka keeda’, says ‘main toh generational filmy hun’. Watch", "description": "Ranbir Kapoor said that he had a phase where he felt that Western cinema was more real but soon realised that the filminess of Hindi cinema had his heart.", "url": "https://indianexpress.com/article/entertainment/bollywood/ranbir-kapoor-hindi-cinema-ka-keeda-says-main-toh-generational-filmy-hun-watch-8000555/", "urlToImage": "https://images.indianexpress.com/2022/06/Ranbir-Kapoor-3.jpg", "publishedAt": "2022-06-30T10:36:45Z", "content": "In a bid to promote his upcoming film Shamshera, Ranbir Kapoor appeared on the first episode of RK Tapes on YRF’s YouTube channel where he spoke about his love for Hindi films.In the video, Ranbir is… [+1684 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rishika Singh", "title": "Explained: How China, UAE are helping Pakistan tide over its economic crisis", "description": "As Pakistan’s economic condition has worsened over the last few years with foreign exchange reserves dipping, it has turned to various kinds of loan deals.", "url": "https://indianexpress.com/article/explained/explained-how-china-uae-are-helping-pakistan-tide-over-its-economic-crisis-8001019/", "urlToImage": "https://images.indianexpress.com/2022/06/china-pak-.jpg", "publishedAt": "2022-06-30T10:36:01Z", "content": "Looking for ways to tide over its current economic crisis, Pakistan may consider giving minority shares in its public-owned companies to the United Arab Emirates at a negotiated price, according to P… [+4684 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Adivi Sesh’s Major gets OTT release date", "description": "Directed by Sashi Kiran Tikka, Major stars Adivi Sesh, Saiee M Manjrekar, Sobhita Dhulipala, Prakash Raj, Revathi, Murali Sharma and Anish Yohan Kuruvilla among others.", "url": "https://indianexpress.com/article/entertainment/telugu/adivi-sesh-major-gets-ott-release-date-8000736/", "urlToImage": "https://images.indianexpress.com/2022/06/Major-movie-1200by667.jpg", "publishedAt": "2022-06-30T10:34:07Z", "content": "Adivi Sesh-starrer Major will be available for streaming in Telugu, Hindi and Malayalam on Netflix from July 3, the OTT platform announced on Thursday.The untold story of a son. The untold story of a… [+1432 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Raakhi Jagga", "title": "Punjab: Border district Fazilka comes up with project ‘Kitab’, launches three libraries to develop reading habit among children", "description": "Students can take membership at a monthly fee of Rs 200 which would provide them internet access as well.", "url": "https://indianexpress.com/article/cities/ludhiana/punjab-border-district-fazilka-project-kitab-libraries-8000793/", "urlToImage": "https://images.indianexpress.com/2022/06/IMG-20220627-WA0279-2-3.jpg", "publishedAt": "2022-06-30T10:33:38Z", "content": "The Fasikla district administration in southwest Punjab last week launched three state-of-the-art libraries with internet access as part of its unique project called ‘Kitab’ to provide students with … [+3579 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Step inside Ankita Lokhande’s new home as she gives a house tour Tulsi Virani style. Watch", "description": "Ankita Lokhande, who has recently moved into her new home, gave a glimpse of the home on social media by recreating Kyunki Saas Bhi Kabhi Bahu Thi title song.", "url": "https://indianexpress.com/article/entertainment/television/ankita-lokhande-tulsi-virani-recreates-kyunki-saas-bhi-kabhi-bahu-thi-title-song-new-house-watch-8000823/", "urlToImage": "https://images.indianexpress.com/2022/06/ankita-lokhande-.jpg", "publishedAt": "2022-06-30T10:32:52Z", "content": "Actor Ankita Lokhande channelled her inner Tulsi Virani, the popular TV bahu from Ekta Kapoor’s Kyunki Saas Bhi Kabhi Bahu Thi, in a new video. Ankita, who has recently moved into her new home, gave … [+1385 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "‘Prima facie politically induced’: Bombay HC asks petitioners seeking return of Eknath Shinde, other rebels to deposit Rs 1 lakh", "description": "The PIL filed on June 27 by seven people claimed the citizens' fundamental rights were ignored as ministers neglected their duties.", "url": "https://indianexpress.com/article/cities/mumbai/politically-induced-bombay-hc-petitioners-return-of-eknath-shinde-other-rebels-deposit-rs-1-lakh-8000899/", "urlToImage": "https://images.indianexpress.com/2022/06/Eknath-Main-1-2.jpg", "publishedAt": "2022-06-30T10:30:41Z", "content": "The Bombay High Court on Thursday asked the petitioners in a public interest litigation (PIL) seeking the immediate return of Eknath Shinde and other rebel Maharashtra ministers to deposit Rs 1 lakh … [+1233 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Kareena Kapoor Khan’s yoga trainer suggests simple stretches to relieve neck pain", "description": "\"Here are a few exercises for strengthening your neck and relieving yourself of the pain due to a desk job, spondylitis, just a weak neck, disc prolapse or nerve pinch,\" Rupal Sidhpura Faria wrote on Instagram", "url": "https://indianexpress.com/article/lifestyle/fitness/kareena-kapoor-khan-yoga-trainer-rupal-sidhpura-faria-neck-pain-stretches-7902245/", "urlToImage": "https://images.indianexpress.com/2022/06/kareena-kapoor-trainer_200_insta.jpg", "publishedAt": "2022-06-30T10:30:09Z", "content": "Bad posture while working, reading, walking, and even talking on the phone can lead to neck and back pain. While improving one’s posture is of utmost importance, there are also some simple stretches … [+1502 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Garmin launches Forerunner 955 Solar and Forerunner 255 smartwatches in India", "description": "Garmin launched the Forerunner Solar 955 and Forerunner 255 series watches in India. Here is what you need to know about them.", "url": "https://indianexpress.com/article/technology/gadgets/garmin-forerunner-955-solar-forerunner-255-pricing-launch-india-8000913/", "urlToImage": "https://images.indianexpress.com/2022/06/Garming-forerunner-955-solar-forerunner-255-solar.jpg", "publishedAt": "2022-06-30T10:27:38Z", "content": "Garmin has launched the Forerunner 955 Solar and Forerunner 255 smartwatches in India. The Forerunner 955 Solar is a dedicated GPS running smartwatch with solar charging. Garmin claims that the watch… [+3647 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Chinese President Xi arrives in Hong Kong for handover anniversary", "description": "In 2019, millions of Hong Kongers protested against growing Chinese authoritarian rule, which later prompted Beijing to impose a sweeping national security law outlawing acts such as subversion with possible life imprisonment.", "url": "https://indianexpress.com/article/world/chinese-president-xi-arrives-in-hong-kong-for-handover-anniversary-8000546/", "urlToImage": "https://images.indianexpress.com/2022/06/Xi-1-reuters.jpg", "publishedAt": "2022-06-30T10:27:20Z", "content": "Chinese President Xi Jinping arrived in Hong Kong on Thursday for events to celebrate 25 years since the former British colony returned to Chinese rule and the inauguration of the city’s new leader J… [+2224 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Hong Kong has ‘risen from the ashes’, China’s Xi says on rare visit", "description": "China's President Xi Jinping will swear in the global financial hub's new leader, John Lee, on Friday during his first visit to the city since 2017", "url": "https://indianexpress.com/article/world/hong-kong-china-xi-jinping-visit-8000988/", "urlToImage": "https://images.indianexpress.com/2022/06/hong-kong-1.jpg", "publishedAt": "2022-06-30T10:20:10Z", "content": "Xi will swear in the global financial hub’s new leader, John Lee, on Friday during his first visit to the city since 2017, which is also his first known trip outside the mainland in more than two yea… [+4422 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Fawad Khan’s blink-and-miss appearance in Ms Marvel leaves fans curious about his role", "description": "Pakistani star Fawad Khan made a fleeting appearance in the latest episode four of Ms Marvel. He is expected to enter the show full fledged in the next episode.", "url": "https://indianexpress.com/article/entertainment/web-series/fawad-khan-ms-marvel-blink-and-miss-appearance-episode-4-fans-curious-about-his-role-photo-8000676/", "urlToImage": "https://images.indianexpress.com/2022/06/fawad-khan-ms-marvel-1200.jpg", "publishedAt": "2022-06-30T10:18:23Z", "content": "We know Fawad Khan is a part of Ms Marvel’s cast. But when many fans on Wednesday saw his name in the end credits of the show’s episode four, they were left wondering. Yes, Fawad is indeed part of th… [+2138 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Partha Sarathi Biswas", "title": "Shiv Sena leaders in Pune district adopt wait-and-watch policy after Uddhav Thackeray resigns as Maharashtra CM", "description": "While Sulabha Ubale and a few others pledged their alliance to Thackeray, some other senior leaders were more cautious in their reactions.", "url": "https://indianexpress.com/article/cities/pune/shiv-sena-leaders-pune-adopt-wait-and-watch-policy-8000957/", "urlToImage": "https://images.indianexpress.com/2022/06/uddhav-1-6.jpg", "publishedAt": "2022-06-30T10:08:51Z", "content": "Shiv Sena leaders in Pune and Pimpri-Chinchwad have mixed reactions to the split in the party triggered by Eknath Shinde and the resignation of Uddhav Thackeray as Maharashtra chief minister. While S… [+2013 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Arjun Das to lead Hindi remake of Malayalam hit Angamaly Diaries", "description": "Tamil director Madhumita of KD fame will helm the Hindi remake of Angamaly Diaries, which is bankrolled by Abundantia Entertainment.", "url": "https://indianexpress.com/article/entertainment/tamil/arjun-das-to-lead-hindi-remake-of-malayalam-hit-angamaly-diaries-8000654/", "urlToImage": "https://images.indianexpress.com/2022/06/arjun-das.jpeg", "publishedAt": "2022-06-30T10:08:31Z", "content": "Actor Arjun Das is set to make his debut in Bollywood with the Hindi remake of the Malayalam hit Angamaly Diaries. Tamil director Madhumita of KD fame will helm the remake, which is bankrolled by Abu… [+1672 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Ek Villain Returns trailer: Killer on the loose won’t spare women who ignore their stalkers in this Mohit Suri film", "description": "Ek Villain Returns trailer: Starring John Abraham, Arjun Kapoor, Disha Patani and Tara Sutaria, Ek Villain Returns releases on July 29. The four leads seem to be competing to usurp the eponymous villain's tag.", "url": "https://indianexpress.com/article/entertainment/bollywood/ek-villain-returns-trailer-john-abraham-arjun-kapoor-disha-patani-tara-sutaria-8000385/", "urlToImage": "https://images.indianexpress.com/2022/06/Ek-villain-2.jpg", "publishedAt": "2022-06-30T10:06:33Z", "content": "Starring John Abraham, Arjun Kapoor, Disha Patani and Tara Sutaria, the trailer of Ek Villain Returns is out. The trailer opens with JD Chakravarthy giving us a short recap of the villainy that took … [+1618 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Debraj Deb", "title": "Tripura: Bru migrants write to CM, want resettlement process expedited", "description": "The migrants have sought the CM’s intervention to clear cash dole, purportedly pending from January this year, and support materials like blankets, mosquito nets, chappals, Lifebuoy soap, and arrears of ration for October 2019, and ration support pending for …", "url": "https://indianexpress.com/article/north-east-india/tripura/tripura-bru-migrants-write-to-cm-want-resettlement-process-expedited-8000924/", "urlToImage": "https://images.indianexpress.com/2022/05/MANIK-SAHA-1-1.jpg", "publishedAt": "2022-06-30T10:06:30Z", "content": "Mizorams Bru migrants, who are being resettled in Tripura, wrote to Chief Minister Dr Manik Saha Wednesday seeking to expedite the resettlement process and clear cash dole and relief dues pending sin… [+3662 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Punjab assembly passes resolution against the Agnipath scheme", "description": "Participating in the discussion on the resolution, Mann said he will soon raise the issue of Agnipath scheme with the prime minister and the Union home minister.", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-assembly-passes-resolution-against-the-agnipath-scheme-8000933/", "urlToImage": "https://images.indianexpress.com/2022/06/bhagwant-mann-3.jpg", "publishedAt": "2022-06-30T10:01:40Z", "content": "The Punjab Assembly on Thursday passed a resolution against the Centre’s Agnipath defence recruitment scheme.Two BJP legislators Ashwani Sharma and Jangi Lal Mahajan, however, opposed the resolution.… [+846 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "V Kaushik Kumar", "title": "Not just a holiday: Messages in Naveen Patnaik’s visit abroad", "description": "Odisha CM's visits to the Vatican and the Sheikh Zayed mosque in Abu Dhabi send out beeping signals, politics and some history written all over them.", "url": "https://indianexpress.com/article/political-pulse/not-just-a-holiday-messages-in-naveen-patnaiks-visit-abroad-8000843/", "urlToImage": "https://images.indianexpress.com/2022/06/Naveen-Patnaik-1.jpg", "publishedAt": "2022-06-30T10:01:06Z", "content": "Naveen Patnaik posted a message on social media earlier this week along with a video of him strolling in the Sheikh Zayed mosque in Abu Dhabi, relaxed, smiling, and in a light blue kurta a rarity for… [+4622 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Public support received by BSP will translate into votes: Mayawati on Azamgarh bypoll", "description": "The Azamgarh seat fell vacant after Samajwadi Party leader Mohammed Azam Khan quit as a member of parliament (MP) after being elected a MLA in March.", "url": "https://indianexpress.com/article/cities/lucknow/bsp-public-support-translate-into-votes-mayawati-azamgarh-bypoll-7984920/", "urlToImage": "https://images.indianexpress.com/2022/04/mayawati-1-4-1.jpeg", "publishedAt": "2022-06-30T10:00:28Z", "content": "BSP supremo Mayawati on Wednesday exuded confidence about her party candidate’s victory in the Azamgarh Lok Sabha bypoll.She also said that the party was getting support from all sections of the soci… [+1291 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Things you need to know before booking your next waxing appointment", "description": "Does choosing chocolate over sugar wax really make a difference, or is it all a marketing gimmick?", "url": "https://indianexpress.com/article/lifestyle/health/waxing-bikini-wax-salon-parlour-tan-tips-7998441/", "urlToImage": "https://images.indianexpress.com/2022/06/Wax-Feature-Image.jpg", "publishedAt": "2022-06-30T10:00:18Z", "content": "Waxing is one of the most popular ways of hair removal, a method that involves applying the wax in the direction of hair growth and then pulling the strip in the opposite direction.But before you boo… [+3840 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Bloomberg", "title": "Air New Zealand to introduce bed-like ‘pods’ in economy class", "description": "SkyNests will go into service in 2024 on aircraft serving Air New Zealand’s ultralong-haul nonstop routes, such as Chicago or New York to Auckland.", "url": "https://indianexpress.com/article/world/air-new-zealand-lie-flat-airplane-seats-8000915/", "urlToImage": "https://images.indianexpress.com/2022/06/Skynest-with-people.jpg", "publishedAt": "2022-06-30T09:59:43Z", "content": "The worlds first lie-flat pods are coming to an economy class airplane section near you.Air New Zealand has had its SkyNest concept in development for the past five years and announced on June 28 its… [+5049 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Maharashtra Political Crisis: Swearing in Ceremony: Eknath Shinde and Devendra Fadnavis to meet Bhagat Singh Koshyari shortly", "description": "Shivsena, Eknath Shinde, Devendra Fadnavis, Maharashtra Political Crisis,", "url": "https://indianexpress.com/article/cities/mumbai/maharashtra-political-crisis-swearing-in-ceremony-eknath-shinde-and-devendra-fadnavis-to-meet-bhagat-singh-koshyari-shortly/", "urlToImage": "https://images.indianexpress.com/2022/06/Eknath-Main-1-1.jpg", "publishedAt": "2022-06-30T09:55:07Z", "content": "Eknath Shinde has already reached Sagar Bungalow to meet Devendra Fadnavis. Both shall meet Governor Bhagat Singh Koshyari shortly to discuss their plans of forming the government. Shiv Sena leader S… [+497 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Maharashtra swearing-in ceremony Live Updates: Eknath Shinde and Devendra Fadnavis to meet Bhagat Singh Koshyari shortly", "description": "Ex-Maharashtra Chief Minister Devendra Fadnavis and Shivsena rebel leader Eknath Shinde are likely to take oath at Rajya Sabha today at &7pm. Follow live and latest updates on Maharashtra Political Crisis here", "url": "https://indianexpress.com/article/cities/mumbai/maharashtra-swearing-in-live-updates-devendra-fadnavis-eknath-shinde-uddhav-thackeray-8000901/", "urlToImage": "https://images.indianexpress.com/2022/06/Eknath-Main-1-1.jpg", "publishedAt": "2022-06-30T09:55:07Z", "content": "Shinde and Fadnavis shall meet Governor Bhagat Singh Koshyari shortly to discuss their plans of forming the government. Eknath Shinde has already reached Sagar Bungalow to meet former Maharashtra chi… [+713 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Deutsche Welle", "title": "Food consumerism: What’s stopping the switch to a climate-friendly diet?", "description": "Food production accounts for around a quarter of the world's greenhouse gas emissions. Most of that comes from meat and dairy, which contribute almost 15% of global emissions.", "url": "https://indianexpress.com/article/world/food-consumerism-whats-stopping-the-switch-to-a-climate-friendly-diet-8000141/", "urlToImage": "https://images.indianexpress.com/2022/06/DW-1.jpg", "publishedAt": "2022-06-30T09:54:58Z", "content": "The global food system allows us to buy almost any product we want, whenever we want often at the cost of the environment. Scientists say we need to consume less. But are we even capable of changing … [+6538 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "AltNews journo Mohammed Zubair taken to Bengaluru home to recover devices: police", "description": "The Twitter handle Balajikijaiin, which flagged the 2018 tweet to the Delhi police, has been deleted.", "url": "https://indianexpress.com/article/india/altnews-journo-mohammed-zubair-taken-bengaluru-home-recover-devices-police-8000888/", "urlToImage": "https://images.indianexpress.com/2022/06/zubair-house.jpeg", "publishedAt": "2022-06-30T09:49:19Z", "content": "The Delhi police flew journalist Mohammed Zubair to Bengaluruon Thursday to recover his electronic devices as part of the investigation in the case in which he was arrested on Monday over a 2018 twee… [+1080 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anvita Singh", "title": "From Jodhaa Akbar to Ranbir Kapoor’s Shamshera: This one shot is crucial in filming battle scenes of Hindi movies", "description": "Inspired by the likes of Troy and Gladiator, modern Hindi features have almost always employed this one variation of an aerial shot in shooting their battle scenes.", "url": "https://indianexpress.com/article/entertainment/bollywood/from-jodhaa-akbar-to-ranbir-kapoors-shamshera-aerial-shot-battle-scenes-hindi-films-7997823/", "urlToImage": "https://images.indianexpress.com/2022/06/kapoor1200-3.jpg", "publishedAt": "2022-06-30T09:47:52Z", "content": "The filming style of cinematographers and filmmakers have evolved over a period of time, and it of course varies depending on the subject they are going to ultimately shoot. But when it comes to batt… [+2631 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi police conducts search at Mohammed Zubair’s Bengaluru residence", "description": "Zubair, who is a fact-checker with Alt News website was arrested on June 27 over a tweet he posted in 2018.", "url": "https://indianexpress.com/article/cities/bangalore/delhi-police-conducts-search-at-mohammed-zubairs-bengaluru-residence-8000849/", "urlToImage": "https://images.indianexpress.com/2022/06/zubair-house.jpeg", "publishedAt": "2022-06-30T09:42:15Z", "content": "The Delhi Police left for Zubair’s house early on Thursday and landed in Bengaluru at 11 am. They reached his home in DJ Halli at 11.30 am and have been conducting a search since then. Zubair is also… [+904 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "When Kapil Sharma refused to admit he has a girlfriend, and Karan Johar asked him, ‘So, what do you do for sex?’", "description": "In a 2017 appearance on Koffee with Karan, comedian Kapil Sharma was stunned into silence after Karan Johar asked him what he does for sex.", "url": "https://indianexpress.com/article/entertainment/web-series/when-kapil-sharma-refused-to-admit-he-has-a-girlfriend-on-koffee-with-karan-johar-8000225/", "urlToImage": "https://images.indianexpress.com/2022/06/karan-johar-koffee-with-karan-kapil-sharma.jpg", "publishedAt": "2022-06-30T09:40:50Z", "content": "Koffee with Karan will return with its seventh season on July 7, and host Karan Johar is already playing up the show’s snackable, guilty pleasure reputation in the promos. Ahead of the show’s return,… [+2601 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi University standing committee passes draft FYUP syllabus, concerns on just one semester being deliberated raised", "description": "Multiple elected members of the standing committee argued that without examining the syllabi of the rest of the semesters, it would not be possible to comment on overlap and discontinuity.", "url": "https://indianexpress.com/article/cities/delhi/delhi-university-standing-committee-fyup-syllabus-semester-8000219/", "urlToImage": "https://images.indianexpress.com/2022/06/DU14.jpg", "publishedAt": "2022-06-30T09:40:46Z", "content": "The draft first-semester syllabi of 19 departments for the four-year undergraduate programme (FYUP) were passed by Delhi University’s standing committee on academic matters on Wednesday amidst concer… [+1811 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Autorickshaw driver kills minor daughters, drives around town with bodies: Karnataka police", "description": "The man is mentally not sound and had feared his children's lives would be spoiled if they were sent to his estranged wife, as demanded by her, according to police.", "url": "https://indianexpress.com/article/cities/bangalore/autorickshaw-driver-kills-minor-daughters-drives-town-bodies-karnataka-police-8000696/", "urlToImage": "https://images.indianexpress.com/2022/06/death-7592.jpg", "publishedAt": "2022-06-30T09:38:53Z", "content": "A 34-year-old autorickshaw driver allegedly killed his minor daughters, kept their bodies under the vehicles back seat and roamed around a Karnataka town at night before surrendering to police.Lakshm… [+1589 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi: Manish Sisodia releases flood control orders, asks for action taken report on complaints of waterlogging", "description": "With heavy waterlogging on Delhi roads, Deputy Chief Minister Manish Sisodia asked officials to identify vulnerable points and submit a report on the action taken by them, emphasising that citizens should not suffer.", "url": "https://indianexpress.com/article/cities/delhi/manish-sisodia-releases-flood-control-orders-delhi-rains-waterlogging-8000827/", "urlToImage": "https://images.indianexpress.com/2022/06/delhi-rain.jpeg", "publishedAt": "2022-06-30T09:37:38Z", "content": "Delhi Deputy Chief Minister Manish Sisodia Thursday released the Flood Control Order, 2022, as monsoon showers lashed the national capitalleading to water logging and traffic jams across the city.Wit… [+1626 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "AIFF general secretary Kushal Das resigns", "description": "Kushal Das sent the resignation to the CoA which is currently running Indian football after the Praful Patel-led dispensation was ousted by the Supreme Court for not holding elections on time.", "url": "https://indianexpress.com/article/sports/football/aiff-general-secretary-kushal-das-resigns-8000812/", "urlToImage": "https://images.indianexpress.com/2022/04/kushal-das-aiff.jpg", "publishedAt": "2022-06-30T09:32:38Z", "content": "The controversial All India Football Federation (AIFF) general secretary Kushal Das has resigned from his post on “health grounds”, ending his 12-year tenure which was often marred by allegations of … [+2348 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Mohamed Thaver", "title": "From praises to brickbats, the eventful 4-month tenure of Mumbai Police Commissioner Sanjay Pandey", "description": "Several officers were in a proxy battle with him refusing to register cases he had been asking them to.", "url": "https://indianexpress.com/article/cities/mumbai/the-eventful-4-month-tenure-of-mumbai-police-commissioner-sanjay-pandey-8000856/", "urlToImage": "https://images.indianexpress.com/2022/06/Sanjay-Pandey.jpeg", "publishedAt": "2022-06-30T09:32:23Z", "content": "In one of the last Facebook lives, through which he interacted with the citizens every Sunday, Sanjay Pandey, who took charge as the Mumbai Police Commissioner on March 1, said he was aware many offi… [+5432 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Rupee rises 13 paise to 78.90 against US dollar in early trade", "description": "In the previous session, the rupee had closed at its all-time low of 79.03 against the US dollar.", "url": "https://indianexpress.com/article/business/market/rupee-rises-13-paise-to-78-90-against-us-dollar-in-early-trade-8000730/", "urlToImage": "https://images.indianexpress.com/2022/06/rupee-low-pixabay-1200-1.jpg", "publishedAt": "2022-06-30T09:27:40Z", "content": "Recovering from its record low, the rupee appreciated 13 paise to 78.90 against the US dollar on Thursday.At the interbank foreign exchange, the rupee opened at 78.92 against the American dollar. In … [+1125 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Santosh Singh", "title": "With AIMIM MLAs in fold, RJD on a roll as it eyes Agnipath and Seemanchal", "description": "RJD has again emerged as the single-largest party with 80 MLAs in the 243-member Bihar Assembly as four of the AIMIM’s total five MLAs joined its fold Wednesday, boosting the Opposition party’s presence in the Seemanchal region in east Bihar.", "url": "https://indianexpress.com/article/political-pulse/with-aimim-mlas-in-fold-rjd-on-song-as-it-eyes-agnipath-seemanchal-8000694/", "urlToImage": "https://images.indianexpress.com/2022/06/RJD.jpg", "publishedAt": "2022-06-30T09:23:54Z", "content": "The Lalu Prasad-headed RJD, which is now effectively led by his son and Leader of Opposition Tejashwi Prasad Yadav, seems to be gaining ground on various fronts in Bihar politics lately.It has again … [+3011 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "Watch: Chris Martin surprises couple with an impromptu performance at British pub", "description": "The Coldplay frontman sang ‘A Sky Full of Stars’ for a soon-to-be married couple after finding out that they had picked the band’s song for their first dance", "url": "https://indianexpress.com/article/trending/trending-globally/chris-martin-surprises-couple-with-an-impromptu-performance-at-british-pub-8000578/", "urlToImage": "https://images.indianexpress.com/2022/06/coldplay-chris-martin-pub-performance.jpg", "publishedAt": "2022-06-30T09:19:19Z", "content": "For any couple, theres always a song that holds a special meaning for them, oftentimes becoming the choice of their first dance. However, its not every day that your favourite artiste surprises you b… [+1882 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi rain: Amid waterlogging and traffic snarls, police issue advisories", "description": "Officials also issued warnings of waterlogging at the Pul Prahladpur railway underpass noting that, \"Movement of traffic has been restricted at Railway underpass Pul Prahladpur. Both the carriageways are closed due to waterlogging.\"", "url": "https://indianexpress.com/article/cities/delhi/delhi-rain-amid-waterlogging-and-traffic-snarls-police-issue-advisories-8000710/", "urlToImage": "https://images.indianexpress.com/2022/06/delhi-7.jpg", "publishedAt": "2022-06-30T09:17:31Z", "content": "The Delhi Traffic Police Thursday issued several advisories on social media after rain lashed the city and the National Capital Region (NCR) leading to traffic jams and waterlogging in many areas. Th… [+1717 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sana Farzeen", "title": "Taarak Mehta Ka Ooltah Chashmah gets a new Nattu Kaka in Kiran Bhatt, makers remember Ghanshyam Nayak: ‘Character is forever…’", "description": "Taarak Mehta Ka Ooltah Chashmah creator Asit Kumar Modi introduced the new Nattu Kaka, actor Kiran Bhatt, in a candid video. Actor Ghanshyam Nayak, who essayed the role for a decade, passed away last year.", "url": "https://indianexpress.com/article/entertainment/television/taarak-mehta-ka-ooltah-chashmah-new-nattu-kaka-kiran-bhatt-ghanshyam-nayak-death-watch-8000655/", "urlToImage": "https://images.indianexpress.com/2022/06/TMOC.jpg", "publishedAt": "2022-06-30T09:16:19Z", "content": "Taarak Mehta Ka Ooltah Chashmah is all set to welcome a new Nattu Kaka. Ghanshyam Nayak, who played the part for many years, passed away last year due to cancer last year. While earlier the makers ha… [+2160 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Explained Desk", "title": "Explained: What is the Biocon bribery case linked to a drug trial waiver bid?", "description": "It has even arrested the Associate Vice President of the company, L Praveen Kumar. However, the Kiran Mazumdar Shaw-promoted pharmaceutical firm has denied these allegations.", "url": "https://indianexpress.com/article/explained/explained-biocon-bribery-case-drug-trial-waiver-8000702/", "urlToImage": "https://images.indianexpress.com/2022/06/CBI-Biocon-explained.jpg", "publishedAt": "2022-06-30T09:15:29Z", "content": "The CBI last week nabbed the Joint Drug Controller (JDC) with the Central Drugs Standard Control Organization (COSCO), S Eswara Reddy, while accepting a bribe of Rs 4 lakh from a representative of a … [+5078 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Udaipur tailor murder case: Prompt action by state stopped accused from fleeing, says CM Ashok Gehlot", "description": "Meanwhile, curfew remains imposed in areas falling under the limits of at least seven police stations of Udaipur.", "url": "https://indianexpress.com/article/cities/jaipur/udaipur-tailor-murder-case-cm-ashok-gehlot-8000599/", "urlToImage": "https://images.indianexpress.com/2022/03/Ashok-Gehlot.jpg", "publishedAt": "2022-06-30T09:13:51Z", "content": "Calling the beheading of an Udaipur tailor by two men over a controversial social media post as an act of terrorism, Chief Minister Ashok Gehlot said that immediate action by the state government pre… [+1778 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "JB Chemicals gets board approval to acquire Dr Reddy’s 4 brands", "description": "JB Chemicals & Pharmaceuticals has inked a pact with Dr Reddy's Laboratories to acquire four of its brands -- Z&D, Pedicloryl, Pecef and Ezinapi -- for the India market", "url": "https://indianexpress.com/article/business/companies/jb-chemicals-gets-board-approval-to-acquire-dr-reddys-4-brands-8000697/", "urlToImage": "https://images.indianexpress.com/2022/06/dr-reddys.jpg", "publishedAt": "2022-06-30T09:12:50Z", "content": "JB Chemicals &amp; Pharmaceuticals on Thursday said its board has approved a proposal to acquire four pediatric brands from Dr Reddy’s Laboratories for about Rs 98 crore.The company’s board at its me… [+771 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "GST’s half-a-decade journey: Tech usage to plug revenue leaks, Rs 1.3 lakh cr monthly tax ‘new normal’", "description": "On July 1, 2017, at midnight, a countrywide Goods and Services Tax (GST) was implemented, replacing 13 cessers and 17 local levies including VAT, service tax, and excise duty.", "url": "https://indianexpress.com/article/business/economy/gsts-half-a-decade-journey-tech-usage-to-plug-revenue-leaks-rs-1-3-lakh-cr-monthly-tax-new-normal-8000605/", "urlToImage": "https://images.indianexpress.com/2022/06/gst-4.jpg", "publishedAt": "2022-06-30T09:11:21Z", "content": "India’s biggest tax reform, the Goods and Services Tax (GST), completes its half-a-decade journey on June 30, with many hits and some misses, and also brought about a paradigm shift in use of technol… [+6399 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Samsung Elec starts 3-nanometre chip production to lure new foundry customers", "description": "Samsung said on Thursday it has begun mass producing chips with advanced 3-nanometre technology, becoming the first to do so globally", "url": "https://indianexpress.com/article/technology/tech-news-technology/samsung-electronics-3-nanometre-chip-production-8000713/", "urlToImage": "https://images.indianexpress.com/2022/06/Samsung-elec-3-nanometre-chip-featured-30062022.jpg", "publishedAt": "2022-06-30T09:10:47Z", "content": "Samsung Electronics Co Ltd said on Thursday it has begun mass producing chips with advanced 3-nanometre technology, the first to do so globally, as it seeks new clients to catch far bigger rival TSMC… [+2551 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Seven states among top achievers in ‘ease of doing business’ ranking of states and UTs", "description": "The Aspires category includes seven states, including Assam, Kerala and Goa. In the category of emerging business ecosystems are eleven states and UTs, including Delhi, Puducherry and Tripura.", "url": "https://indianexpress.com/article/business/seven-states-ease-of-doing-business-seven-aspires-category-eleven-emerging-8000316/", "urlToImage": "https://images.indianexpress.com/2022/06/P1-Nirmala-Sitharaman-3col.jpg", "publishedAt": "2022-06-30T09:08:56Z", "content": "Andhra Pradesh, Gujarat and Telangana are among the seven states categorised as top achievers in the ranking of states and Union Territories based on the implementation of the business reform action … [+533 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Debraj Deb", "title": "Tripura court sentences man to death for raping, murdering girl", "description": "In February last year, a 4-and-a-half-year-old girl went missing from her home in a village in the Teliamura area. She was found dead with wounds on her body six days later.", "url": "https://indianexpress.com/article/north-east-india/tripura/tripura-court-death-sentence-rape-murder-case-8000685/", "urlToImage": "https://images.indianexpress.com/2022/06/Gavel.jpeg", "publishedAt": "2022-06-30T09:03:23Z", "content": "The Khowai District Court in Tripura on Wednesday sentenced a man to death for raping and murdering a minor child in February last year. District court and special POCSO Act judge Shankari Das passed… [+1872 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Three of a family, driver found dead in Mumbai hospital building", "description": "All four bodies were found inside family-run Radhabhai Dalvi hospital, which has been shut down for years; internal family issues said to be the cause of murders and suicides.", "url": "https://indianexpress.com/article/cities/mumbai/three-family-driver-dead-mumbai-hospital-building-8000687/", "urlToImage": "https://images.indianexpress.com/2022/06/Indian-Express-logo-13-4-3-4.jpeg", "publishedAt": "2022-06-30T08:59:12Z", "content": "A 17-year-old girl and her family driver allegedly murdered her older sister and mother before taking their own lives at a hospital, which has been shut down for several years, in Kandivali (west) la… [+1816 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Parul", "title": "Will banning single-use plastics impact our health?", "description": "Single-use plastic products will be banned from July 1. Dr Ravindra Khaiwal, Professor of Environmental Health, PGI, Chandigarh, explains why this step is needed to maintain public health and the ecosystem.", "url": "https://indianexpress.com/article/lifestyle/health/single-use-plastics-ban-impact-health-8000680/", "urlToImage": "https://images.indianexpress.com/2017/09/plastic-1200.jpg", "publishedAt": "2022-06-30T08:58:51Z", "content": "Single-use plastics, known as throw-away plastics, are manufactured to be used only once before being discarded or recycled. For everyday use, the ban applies to the following — plastic sticks used i… [+6190 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "A more muscular NATO emerges as West confronts Russia and China", "description": "It was a fundamental shift for an alliance that was born in the Cold War but came to view a post-Soviet Russia as a potential ally, and did not focus on China at all.", "url": "https://indianexpress.com/article/world/nato-expansion-ukraine-war-8000542/", "urlToImage": "https://images.indianexpress.com/2022/06/NATO-SUMMIT-4.jpg", "publishedAt": "2022-06-30T08:55:42Z", "content": "Written by Steven Erlanger and Michael D. ShearFaced with a newly aggressive Russia, NATO leaders on Wednesday outlined a muscular new vision that names Moscow as the military alliances primary adver… [+9055 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Devas-Antrix deal: ED seeks to declare Devas Multimedia CEO fugitive economic offender in PMLA case", "description": "The special court is yet to take up the application filed by the ED earlier this month for declaring the Devas Multimedia CEO an economic offender. It had in April 2022 ordered the splitting up of the charge sheet against Viswanathan and nine others on accoun…", "url": "https://indianexpress.com/article/cities/bangalore/devas-antrix-multimedia-ceo-fugitive-economic-offender-pmla-8000682/", "urlToImage": "https://images.indianexpress.com/2022/06/devas-media.jpeg", "publishedAt": "2022-06-30T08:54:47Z", "content": "The Enforcement Directorate (ED) has sought permission from a special court in Bengaluru to declare the US-based founder and CEO of the now liquidated start-up firm Devas Multimedia Private Limited a… [+2106 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Gold and silver rates today: Gold rate drops Rs 189/10 grams, silver at Rs 353/kg", "description": "Gold Silver Live Update 30 June 2022: The 999 purity gold opened at Rs 50,970 per 10 grams, down Rs 189 from Wednesday's closing price of Rs 51,159, while the opening price of 999 purity silver was Rs 59,500 per kg, taking a drop of Rs 353 from Rs 59,853. Rea…", "url": "https://indianexpress.com/article/business/commodities/gold-and-silver-rates-today-gold-rate-silver-rate-june-30-2022-delhi-mumbai-banglore-bullion-rate-mcx-8000438/", "urlToImage": "https://images.indianexpress.com/2022/06/gold759.jpg", "publishedAt": "2022-06-30T08:54:39Z", "content": "Gold, Silver Rates Today News Update: The rates of gold and silver opened lower in the key spot markets Thursday.The 999 purity gold opened at Rs 50,970 per 10 grams, dropping Rs 189 from Wednesday’s… [+2246 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Heated debate erupts over what happened inside Trump’s Vehicle on Jan. 6", "description": "What happened next has become a matter of intense debate after explosive testimony on Tuesday by Cassidy Hutchinson, a former White House aide who said Trump became enraged when his security detail refused to take him to the Capitol.", "url": "https://indianexpress.com/article/world/heated-debate-trumps-vehicle-jan-6-8000572/", "urlToImage": "https://images.indianexpress.com/2022/06/JAN6-HEARINGS-PENCE-2.jpg", "publishedAt": "2022-06-30T08:52:53Z", "content": "Soon after his speech on the Ellipse ended on Jan. 6, 2021, President Donald Trump stepped into the back of a black Suburban bearing the presidential seal.\r\nWhat happened next has become a matter of … [+3488 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Shruti Haasan on facing the ‘worst hormonal issues’: ‘My body isn’t perfect right now’", "description": "In the accompanying video, the Ramaiya Vastavaiya actor could be seen working out in the gym, doing a combination of bodyweight exercises, cardio, and core stretches", "url": "https://indianexpress.com/article/lifestyle/health/shruti-haasan-worst-hormonal-issues-pcos-endometriosis-women-workout-risk-8000053/", "urlToImage": "https://images.indianexpress.com/2022/06/shruti-haasan_1200_insta.jpg", "publishedAt": "2022-06-30T08:40:38Z", "content": "Shruti Haasan recently took to social media to open up about her struggle with polycystic ovary syndrome (PCOS) and endometriosis, and said that she has been “facing some of the worst hormonal issues… [+2952 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "IIT-Delhi collaborates with DBSE to design Robotics and Automation curriculum", "description": "Delhi Board of School Education (DBSE) signed an MoU with I-Hub Foundation for Cobotics (IHFC), the Technology Innovation Hub of IIT Delhi to design Robotics and Automation curriculum for the Schools of Specialized Excellence (SoSE) under the Delhi government.", "url": "https://indianexpress.com/article/education/dbse-partners-with-iit-delhi-to-design-robotics-and-automation-curriculum-8000588/", "urlToImage": "https://images.indianexpress.com/2022/04/iit-delhi.jpeg", "publishedAt": "2022-06-30T08:40:29Z", "content": "IIT Delhi will design a curriculum to train students in the different aspects of Robotics and Automation that will enable them to pursue higher education and diverse career pathways in the field. In … [+2144 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "CLAT 2022: First merit list to be released today", "description": "The institution is currently compiling five lists for the allocation of provisional seats. Along with many other law schools and institutions, 22 NLUs will accept the scores.", "url": "https://indianexpress.com/article/education/clat-2022-first-merit-list-to-be-released-today-consortiumofnlus-ac-in-8000519/", "urlToImage": "https://images.indianexpress.com/2022/06/CLAt-2022-NLU-1.jpg", "publishedAt": "2022-06-30T08:39:09Z", "content": "The National Law Universities (NLU) will be releasing the first provisional CLAT 2022 merit list at its official website- consortiumofnlus.ac.in today, June 30, 2022. The qualified applicants will ha… [+1752 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Sangli murders: MANS demands invoking of anti-superstition act against ‘mantrik’, aide", "description": "Two brothers, Dr Manik Vanmore, 49, a veterinarian, and Popat Vanmore, 52, an art teacher, along with their mother, their wives and four children were found dead in two separate houses located a kilometre apart in Mhaisal on June 20.", "url": "https://indianexpress.com/article/cities/pune/sangli-murders-mans-demands-invoking-of-anti-superstition-act-against-mantrik-aide-8000499/", "urlToImage": "https://images.indianexpress.com/2022/06/sanglimurder.jpeg", "publishedAt": "2022-06-30T08:36:36Z", "content": "The Maharashtra Andhashraddha Nirmoolan Samiti (MANS) has demanded that the anti-superstition law must be invoked in the case of the killing of nine members of a family in Mhaisal town of the states … [+2841 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "KGF actor BS Avinash survives a road accident: ‘An unimaginable event’", "description": "BS Avinash's car collided with a canter truck in Bengaluru during the early hours of Wednesday. Avinash was on his way to his gym when the accident took place.", "url": "https://indianexpress.com/article/entertainment/regional/kgf-actor-bs-avinash-survives-a-road-accident-an-unimaginable-event-8000515/", "urlToImage": "https://images.indianexpress.com/2022/06/BS-Avinash.jpg", "publishedAt": "2022-06-30T08:34:34Z", "content": "Kannada actor BS Avinash, who is popular for his role in the KGF franchise, met with a car accident in Bengaluru on Wednesday morning. The actor survived the car crash without an injury.Avinashs car … [+1498 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Five members of Indian men’s hockey team test positive for Covid-19", "description": "The Indian men's team is currently in Bengaluru preparing for next month's Commonwealth Games in Birmingham.", "url": "https://indianexpress.com/article/sports/hockey/five-members-of-indian-hockey-mens-team-test-covid-19-positive-8000548/", "urlToImage": "https://images.indianexpress.com/2022/06/HOCKEY-9.jpg", "publishedAt": "2022-06-30T08:33:08Z", "content": "Two players and three support staff members of the Indian Men’s Hockey team have tested positive for Covid-19.Hockey India released a statement on Thursday stating that the five returned positive for… [+1352 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Apple iPhone 14 to Google Pixel 7: A look at flagship phones expected in second half of 2022", "description": "Here's a quick look at the top flagship phones we are yet to see launch before the end of the year.", "url": "https://indianexpress.com/article/technology/mobile-tabs/iphone-14-to-pixel-7-upcoming-flagship-phones-of-2022-8000501/", "urlToImage": "https://images.indianexpress.com/2022/06/iPhone-14-leak.jpg", "publishedAt": "2022-06-30T08:28:48Z", "content": "This year has already seen a number of brands launch their top-end ‘flagship’ phones. These include the Samsung Galaxy S22 Series, the iQOO 9 Pro and the Realme GT 2 Pro. However, the second half of … [+5195 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Virat Kohli vs James Anderson: To Play Or Not To Play", "description": "", "url": "https://indianexpress.com/videos/news-video/virat-kohli-vs-james-anderson-to-play-or-not-to-play/", "urlToImage": "https://images.indianexpress.com/2022/06/Kohli-vs-Jimmy.jpeg", "publishedAt": "2022-06-30T08:28:21Z", "content": "BJP To AIMIM, Congress To CPI(M): Political Leaders Condemn Act, Demand Action"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Israel’s parliament dissolves, sets 5th election in 4 years", "description": "Yair Lapid, Israel's foreign minister and architect of the outgoing coalition government, will become the country's caretaker prime minister.", "url": "https://indianexpress.com/article/world/israels-parliament-dissolves-sets-5th-election-in-4-years-8000592/", "urlToImage": "https://images.indianexpress.com/2022/03/Yair-Lapid-Reuters.jpg", "publishedAt": "2022-06-30T08:23:34Z", "content": "Yair Lapid, Israel’s foreign minister and architect of the outgoing coalition government, will become the country’s caretaker prime minister just after midnight on Friday. He will be the 14th person … [+821 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "TS Telangana SSC Results 2022 Manabadi declared: 90% students pass; girls outperform boys", "description": "TS Telangana SSC Results 2022 Manabadi: Advanced supplementary exams will be held between August 1 and 10, 2022. Students can check their results through the websites — bse.telangana.gov.in or bseresults.telangana.gov.in.", "url": "https://indianexpress.com/article/education/ts-telangana-ssc-results-2022-manabadi-declared-90-students-pass-girls-outperform-boys-bse-telangana-gov-in-8000557/", "urlToImage": "https://images.indianexpress.com/2022/06/TS-SSC-3-1.jpg", "publishedAt": "2022-06-30T08:22:42Z", "content": "TS Telangana SSC Results 2022 Manabadi: Telangana SSC Public Examinations 2022 results were announced on Thursday by Education Minister P Sabitha Indra Reddy. Recording an overall pass percentage of … [+3404 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "‘Enchanted Lake’ on Mars: Why it is the best spot to look for signs of life", "description": "The sedimentary rocks of the \"Enchanted Lake\" make it a good location to look for signs of early life on Mars.", "url": "https://indianexpress.com/article/technology/science/enchanted-lake-on-mars-the-best-spot-to-look-for-signs-of-life-8000551/", "urlToImage": "https://images.indianexpress.com/2022/06/Enchanted-lake-perseverance-rover-Mars.jpg", "publishedAt": "2022-06-30T08:21:18Z", "content": "NASA has shared images of the Enchanted Lake on Mars, where scientists believe that the Perseverance rover could find the first evidence of extraterrestrial life. The Enchanted Lake is a rocky outcro… [+2233 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Three held for cow slaughter after encounter, two including cop injured: UP police", "description": "Police had been on an alert after a video of cow slaughter in the district surfaced on the social media two days ago.", "url": "https://indianexpress.com/article/cities/lucknow/three-held-for-cow-slaughter-after-encounter-two-including-cop-injured-up-police-8000407/", "urlToImage": "https://images.indianexpress.com/2022/06/arrest-2-7-16.jpeg", "publishedAt": "2022-06-30T08:20:19Z", "content": "Three gang members allegedly involved in cow slaughter were arrested after an encounter that left two persons including a policeman injured, a senior official said on Thursday.The accused, Shahzad al… [+538 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Three held for cow slaughter after encounter, two including cop injured: UP police", "description": "Police had been on an alert after a video of cow slaughter in the district surfaced on the social media two days ago.", "url": "https://indianexpress.com/article/india/three-held-for-cow-slaughter-after-encounter-two-including-cop-injured-up-police-8000407/", "urlToImage": "https://images.indianexpress.com/2022/06/arrest-2-7-16.jpeg", "publishedAt": "2022-06-30T08:20:19Z", "content": "Three gang members allegedly involved in cow slaughter were arrested after an encounter here that left two persons including a policeman injured, a senior official said on Thursday.The accused, Shahz… [+548 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "AltNews co-founder Mohammed Zubair moves Delhi HC challenging police remand; hearing tomorrow", "description": "On June 28, Chief Metropolitan Magistrate Snigdha Savaria had sent Zubair to police custody for four days as the cops stated that he was “non-cooperative” and had to be taken to his residence in Bengaluru for the recovery of the phone/laptop used for posting …", "url": "https://indianexpress.com/article/cities/delhi/altnews-mohammed-zubair-delhi-high-court-8000561/", "urlToImage": "https://images.indianexpress.com/2022/06/Zubair-4.jpg", "publishedAt": "2022-06-30T08:16:36Z", "content": "The Delhi High Court has agreed to hear on Friday AltNews co-founder Mohammed Zubair’s plea challenging his police remand on the charge of hurting religious sentiments following a complaint over a tw… [+1132 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "IIM-Bangalore launches certificate progamme in Hospital Management; check details", "description": "To be eligible for this programme, candidates need to have a background in healthcare and be graduates (10+2+3) in any discipline from a recognised university. Interested candidates can apply for this programme on the official website - iimbx.iimb.ac.in/hospi…", "url": "https://indianexpress.com/article/education/iim-bangalore-launches-certificate-progamme-in-hospital-management-check-details-link-to-apply-iimbx-iimb-ac-in-8000510/", "urlToImage": "https://images.indianexpress.com/2022/06/IIM-Bangalore-1.jpg", "publishedAt": "2022-06-30T08:14:21Z", "content": "The Indian Institute of Management, Bangalore (IIM-B) today launched a Professional Certificate programme in Hospital Management. Interested candidates can apply for this programme on the official we… [+1387 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "আদেশ ছিল স্বয়ং শ্রীচৈতন্যের, পুরীর রথের রশি যেত বাংলার এই গ্রাম থেকেই", "description": "পুরীর জগন্নাথ দেবের রথযাত্রার সঙ্গে আজও জড়িয়ে রয়েছে বাংলার এই গ্রামের নাম।", "url": "https://bengali.indianexpress.com/west-bengal/the-rope-of-puri-rath-was-sent-from-east-burdwan-kulin-villege-463506/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/Kulin-Villege-Rath.jpg", "publishedAt": "2022-06-30T08:12:18Z", "content": ", \r\n , ‘’ \r\n , , \r\n , \r\n - , \r\n , \r\n - ? - \r\n , - , \r\n - , , \r\n , , \r\nStay updated with the latest news headlines and all the latest Westbengal news download Indian Express Bengali App.\r\nWeb Title: T… [+60 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "When Kareena Kapoor roasted Saif Ali Khan for ‘being all over’ Preity Zinta: ‘Don’t complain…’", "description": "As Koffee With Karan will return soon, here's looking back at the time when Kareena Kapoor and Saif Ali Khan roasted each other during their appearance on the show, in 2010.", "url": "https://indianexpress.com/article/entertainment/bollywood/when-kareena-kapoor-roasted-saif-ali-khan-for-being-all-over-preity-zinta-dont-complain/", "urlToImage": "https://images.indianexpress.com/2022/06/saifkareena.jpeg", "publishedAt": "2022-06-30T08:11:06Z", "content": "Actor Kareena Kapoor once teased Saif Ali Khan for being ‘all over’ his Salaam Namaste co-star, Preity Zinta. During an episode of Koffee With Karan, host Karan Johar quizzed them about how the actor… [+1793 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "After 3 years, EC begins revision of electoral rolls in Jammu and Kashmir", "description": "EC directs J-K election officer to complete summary revision of electoral rolls by October end.", "url": "https://indianexpress.com/article/india/jammu-and-kashmir-election-commission-electoral-rolls-revision-8000522/", "urlToImage": "https://images.indianexpress.com/2022/06/electoral-rolls.jpg", "publishedAt": "2022-06-30T08:02:19Z", "content": "The Election Commission (EC) has begun the process of electoral rolls revision in Jammu and Kashmir after a gap of three years, in an indication that polls could be held in the Valley post its delimi… [+5277 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "JAC Jharkhand Board Class 12th result 2022 declared: How to check Inter score card", "description": "JAC Jharkhand Board 12th Result 2022 at jacresults.com, jac.nic.in, jac.jharkhand.gov.in, jharresults.nic.in, IndiaResults.com: Students, parents, teachers and other stakeholders awaiting their Jharkhand Board 12th result can check it at jacresults.com, jac.n…", "url": "https://indianexpress.com/article/education/jac-jharkhand-board-12th-result-2022-how-to-check-inter-roll-number-jacresults-com-jac-jharkhand-gov-in-indiaresult-in-7925295/", "urlToImage": "https://images.indianexpress.com/2022/05/123.jpeg", "publishedAt": "2022-06-30T08:00:38Z", "content": "JAC Jharkhand Board Class 12th Result 2022: The Jharkhand Academic Council (JAC), Ranchi will announce the class 12 board exam results of Arts and Commerce streams today. The result is scheduled to r… [+1815 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "England one of my favorite places to play cricket: Shardul Thakur", "description": "In a recent video posted by bcci.tv, the 30-year-old spoke about why he loves playing in the English conditions, his nickname that he earned by playing against them and his knock that helped India win at The Oval.", "url": "https://indianexpress.com/article/sports/cricket/ind-vs-eng-england-one-of-my-favorite-places-to-play-cricket-shardul-thakur-8000493/", "urlToImage": "https://images.indianexpress.com/2021/09/Untitled-design-21-1.jpg", "publishedAt": "2022-06-30T07:56:07Z", "content": "Shardul Thakur has earned the title of Lord from his teammates and the cricket fans. A name he believes he is referred to more for his performances vs England. It shows how much people and my teammat… [+2414 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Vijay Deverakonda, Team Liger wishes Mike Tyson on his birthday: ‘You are a memory for life’", "description": "Starring Vijay Deverakonda, Ananya Panday, Mike Tyson, Ramya Krishnan, Ronit Roy, and Vishu Reddy in the pivotal roles, Liger will open in cinemas in Hindi, Telugu, Tamil, Malayalam, and Kannada on August 25.", "url": "https://indianexpress.com/article/entertainment/telugu/vijay-deverakonda-team-liger-wishes-mike-tyson-on-his-birthday-you-are-a-memory-for-life-8000320/", "urlToImage": "https://images.indianexpress.com/2022/06/Liger-1200by667.jpg", "publishedAt": "2022-06-30T07:54:34Z", "content": "Marking the birthday of boxing legend Mike Tyson on Thursday, Team Liger wished him with a special behind-the-scenes video. Sharing the video on his Twitter handle, Vijay Deverakonda wrote, “Happy Bi… [+1332 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "US Coast Guard rescues 7 people after lightning strikes boat. Watch terrifying video", "description": "The incident happened last weekend and seven people, including five women and two men, were rescued from the 39-foot personal vessel, according to the press release issued by US Coast Guard.", "url": "https://indianexpress.com/article/trending/trending-globally/us-coast-guard-rescues-7-people-after-lightning-strikes-boat-8000509/", "urlToImage": "https://images.indianexpress.com/2022/06/USCGSoutheast@USCGSoutheastTwitter.jpg", "publishedAt": "2022-06-30T07:53:41Z", "content": "Lightning hit a boat while seven people were taking part in a fishing tournament in Clearwater, Florida. A terrifying clip showing the lighting strike and dramatic rescue by the US Coast Guard has su… [+1964 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Ticket to Paradise trailer: George Clooney and Julia Roberts reunite for a feel-good feature. Watch", "description": "Helmed by Ol Parker of the Mamma Mia fame, Ticket to Paradise will release in cinemas on October 21.", "url": "https://indianexpress.com/article/entertainment/hollywood/ticket-to-paradise-trailer-george-clooney-and-julia-roberts-reunite-for-a-feel-good-feature-watch-8000026/", "urlToImage": "https://images.indianexpress.com/2022/06/julia1200.jpg", "publishedAt": "2022-06-30T07:52:39Z", "content": "America’s sweethearts and Hollywood superstars Julia Roberts and George Clooney are reuniting for a big screen experience, this time for an out and out romantic comedy called Ticket to Paradise, whos… [+1138 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Kamal Haasan congratulates Suriya on the Academy invitation: ‘My brother treads the ground of stars…’", "description": "Tamil actor Suriya received congratulatory wishes from Kamal Haasan after he was invited to become a member of the Academy of Motion Picture Arts and Sciences.", "url": "https://indianexpress.com/article/entertainment/tamil/kamal-haasan-to-suriya-on-the-academy-invitation-8000286/", "urlToImage": "https://images.indianexpress.com/2022/06/kamal3.jpeg", "publishedAt": "2022-06-30T07:52:22Z", "content": "Tamil actor Suriya has received a flood of congratulatory wishes after he received an invitation to become a member of the Academy of Motion Picture Arts and Sciences. Every year, the Academy chooses… [+1955 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Parthasarathi Biswas", "title": "Osmanabad MP and MLA pledge their allegiance to Uddhav Thackeray", "description": "Asked about the vertical split in Shiv Sena, Pavanraje Nimbalkar said MLAs and MPs might leave the party but the voters will never leave it.", "url": "https://indianexpress.com/article/cities/pune/osmanabad-mp-mla-pledge-allegiance-uddhav-thackeray-8000408/", "urlToImage": "https://images.indianexpress.com/2022/06/maharashta-2.jpg", "publishedAt": "2022-06-30T07:52:19Z", "content": "A day after Shiv Sena leader Uddhav Thackeray resigned as the Maharashtra chief minister bringing an end to the 2.5 years of the MVA government, Osmanabad MP and MLA from his party Thursday pledged t… [+1731 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Can you contract HIV after one exposure?", "description": "HIV is transmitted between people through bodily fluids, unprotected anal or vaginal sex and sharing of needles. People can also transmit HIV to their babies during pregnancy or while breastfeeding", "url": "https://indianexpress.com/article/lifestyle/health/hiv-after-one-exposure-possible-expert-7995028/", "urlToImage": "https://images.indianexpress.com/2022/06/hiv_200_getty.jpg", "publishedAt": "2022-06-30T07:50:07Z", "content": "The human immunodeficiency virus (HIV) has already devastated many individuals, families, and communities. The epidemic has left millions of children orphaned, disrupted community life, and increasin… [+2841 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Govt making necessary policy changes to encourage MSME sector: PM Modi", "description": "Addressing the 'Udyami Bharat' programme, the Prime Minister exhorted small entrepreneurs to register themselves on the GEM portal for supplying goods to the government.", "url": "https://indianexpress.com/article/india/pm-modi-govt-policy-changes-msme-8000497/", "urlToImage": "https://images.indianexpress.com/2022/06/modi_brics.jpg", "publishedAt": "2022-06-30T07:43:37Z", "content": "Prime Minister Narendra Modi on Thursday assured the MSME sector that the centre is ready to make necessary policy changes to encourage small entrepreneurs as they are playing a key role in the ‘Aatm… [+1492 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "NASA to release ‘deepest image of universe ever’ taken with James Webb Space Telescope", "description": "We finally have hints of what the first images from NASA's James Webb Space Telescope will look like.", "url": "https://indianexpress.com/article/technology/science/nasa-james-webb-space-telescope-deepest-image-universe-8000396/", "urlToImage": "https://images.indianexpress.com/2022/06/James-webb-space-telescope-first-images-how-to-view.jpg", "publishedAt": "2022-06-30T07:34:27Z", "content": "Ahead of NASAs release of the James Webb Space Telescopes first full-colour images and spectroscopic data, we may finally have hints of what the first few operational images will look like. The first… [+2065 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Bengaluru Live Updates: Justice Aradhe appointed acting CJ of Karnataka HC; Hindu outfits to start ‘I’m Nupur Sharma Supporter’ campaign", "description": "Bengaluru news live updates today June 30, 2022: earthquake in Karnataka, covid guidelines, oxygen generators at Bengaluru airport,Bengaluru covid numbers, Covid-19 tally, Bengaluru covid news, Karnataka covid news", "url": "https://indianexpress.com/article/cities/bangalore/karnataka-bengaluru-latest-news-covid-rains-bbmp-bommai-live-updates-8000417/", "urlToImage": "https://images.indianexpress.com/2022/06/karnataka-HC-3.jpg", "publishedAt": "2022-06-30T07:34:26Z", "content": "Karnataka, Bengaluru News Live Updates: Justice Alok Aradhe was on Thursday appointed as the acting chief justice of the Karnataka High Court as Chief Justice Ritu Raj Awasthi demits office on July 2… [+831 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Entertainment Desk", "title": "সাভারকরকে চরম অপমান! একের পর এক খুনের হুমকি পেয়ে FIR স্বরা ভাস্করের", "description": "নায়িকার বাড়িতেই এল বেনামি হুমকি চিঠি! তারপর?", "url": "https://bengali.indianexpress.com/entertainment/swara-bhasker-receives-death-threat-files-fir-463475/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/swara.jpg", "publishedAt": "2022-06-30T07:28:25Z", "content": "(Swara Bhasker) ? \r\n ? , “ ”\r\n , “ , ‘’- ” , ‘’ \r\n[ : , ]\r\n, , \r\n , \r\nStay updated with the latest news headlines and all the latest Entertainment news download Indian Express Bengali App.\r\nWeb Title… [+46 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pranav Mukul, Aanchal Magazine", "title": "Explained: Govt’s small savings rate call today – what to expect?", "description": "The interest rates on small savings schemes were revised for the first quarter of 2021-22 (April-March) being reduced sharply by 40-110 basis points but the decision was later rolled back.", "url": "https://indianexpress.com/article/explained/explained-centre-small-savings-rate-8000415/", "urlToImage": "https://images.indianexpress.com/2022/06/Small-Savings.jpg", "publishedAt": "2022-06-30T07:22:43Z", "content": "The central government will Thursday announce its decision on interest rates on small savings instruments for the July-September quarter. Interest rates on small savings schemes are reset on a quarte… [+2030 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "NCHM JEE 2022: NTA issues answer key; check how to download", "description": "The result of NCHMCT JEE 2022 will be determined based on the final answer key. Candidates will be able to download the answer key from nchmjee.nta.nic.in.", "url": "https://indianexpress.com/article/education/nchm-jee-2022-nta-issues-answer-key-nchmjee-nta-nic-in-8000151/", "urlToImage": "https://images.indianexpress.com/2022/06/school-students-2.jpg", "publishedAt": "2022-06-30T07:22:24Z", "content": "The National Testing Agency (NTA) has released the answer key for NCHM JEE 2022 on its official website nchmjee.nta.nic.in. Along with the answer key, the question paper and responses marked by the s… [+1758 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "‘There are battles everywhere’: Fighting in eastern Ukraine rages across artillery-scoured ground", "description": "A senior US defense official described the contested area as equivalent to the stretch of land between Washington and Fairfax, Virginia, a distance of around 20 miles.", "url": "https://indianexpress.com/article/world/russia-ukraine-crisis-luhansk-province-fighting-8000397/", "urlToImage": "https://images.indianexpress.com/2022/06/UKRAINE-RUSSIA-3-1.jpg", "publishedAt": "2022-06-30T07:21:17Z", "content": "Moscow is dispatching thousands more soldiers and heavy weapons to eastern Ukraine as it struggles to lay claim to the last patch of sovereign Ukrainian territory in Luhansk province, according to Uk… [+3340 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pune Infra Watch: After environmentalists oppose, PMC undertakes citizen survey for proposed Balbharati-Paud Phata Road", "description": "The PMC has completed other necessary surveys and studies but continues to witness opposition from environmentalists. Thus, it has undertaken online and offline surveys of citizens to ascertain the need for the road. The environmentalists have termed the surv…", "url": "https://indianexpress.com/article/cities/pune/pune-infra-watch-environmentalists-pmc-citizens-balbharati-paud-phata-road-8000372/", "urlToImage": "https://images.indianexpress.com/2022/06/trees-forest-road-1200.jpg", "publishedAt": "2022-06-30T07:21:04Z", "content": "Amidst opposition by environmentalists, the Pune Municipal Corporation (PMC) has undertaken a survey of citizens for the development of the proposed 1.8-km link road from Balbharati to Paud Phata to … [+2569 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Cameron Diaz sets acting return with Netflix film Back In Action co-starring Jamie Foxx", "description": "Cameron Diaz, the star of Charlie's Angels franchise and There's Something About Mary, said only Jamie Foxx could have convinced her to return to films.", "url": "https://indianexpress.com/article/entertainment/hollywood/cameron-diaz-sets-acting-return-with-netflix-film-back-in-action-co-starring-jamie-foxx-8000062/", "urlToImage": "https://images.indianexpress.com/2022/06/Cameron-Diaz-and-Jamie-Foxx-1200by667.jpg", "publishedAt": "2022-06-30T07:16:13Z", "content": "Hollywood star Cameron Diaz is coming out of retirement for Back In Action, a Netflix film with Jamie Foxx. The project reunites Diaz and Foxx, who worked together on 1999’s sports drama Any Given Su… [+1724 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "JugJugg Jeeyo box office collection day 6: Dharma film crosses Rs 50 cr mark in first week", "description": "JugJugg Jeeyo box office collection day 6: Starring Varun Dhawan, Kiara Advani, Neetu Kapoor and Anil Kapoor, the Dharma film has managed to hold its own during the weekdays.", "url": "https://indianexpress.com/article/entertainment/bollywood/box-office-collection/jugjugg-jeeyo-day-6-dharma-film-crosses-rs-50-crore-mark-8000325/", "urlToImage": "https://images.indianexpress.com/2022/06/varun1200-1.jpg", "publishedAt": "2022-06-30T07:15:53Z", "content": "Raj Mehta’s Jugjugg Jeeyo has managed to impress the audience in its first week as the film has clocked in Rs 50.24 crore in six days. Starring Neetu Kapoor, Kiara Advani, Anil Kapoor and Varun Dhawa… [+2189 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Kangana Ranaut recalls 2020 warning to Uddhav Thackeray as she reacts to his resignation in new video. Watch", "description": "Kangana Ranaut appeared to welcome the resignation of Uddhav Thackeray as Maharashtra chief minister. She shared a video message recalling her comments from 2020.", "url": "https://indianexpress.com/article/entertainment/bollywood/kangana-ranaut-recalls-2020-warning-to-uddhav-thackeray-as-she-reacts-to-his-resignation-in-new-video-8000343/", "urlToImage": "https://images.indianexpress.com/2020/10/Kangana-Uddhav.jpg", "publishedAt": "2022-06-30T07:10:26Z", "content": "Kangana Ranaut on Thursday seemingly reacted to the resignation of Maharashtra chief minister Uddhav Thackeray in a video posted on Instagram. In the minute-long video, Kangana made a reference to co… [+1587 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Man killed as soil caves in during Chennai Metro rail work; 3 booked", "description": "The 45-year-old man entered a 10-foot-deep pit allegedly without any safety gears as part of the works on the second phase of the metro rail project at Medavakkam.", "url": "https://indianexpress.com/article/cities/chennai/man-killed-as-soil-caves-in-during-chennai-metro-rail-work-3-booked-8000371/", "urlToImage": "https://images.indianexpress.com/2022/06/express-photo-13-25.jpeg", "publishedAt": "2022-06-30T07:07:47Z", "content": "A 45-year-old worker was killed after soil caved in while he was working underground for laying Chennai Metro rail project’s sewage pipeline at Medavakkam in Chennai. The deceased was identified as K… [+820 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi L-G Saxena launches portal to help residents contact sanitation workers", "description": "The list of all safai sainiks, their contact numbers, area of work/deployment and the names of their sanitary inspector are now available on the corporation’s website.", "url": "https://indianexpress.com/article/cities/delhi/delhi-l-g-saxena-launches-portal-to-help-residents-contact-sanitation-workers-8000220/", "urlToImage": "https://images.indianexpress.com/2022/06/municipal-corporation-delhi-1.jpg", "publishedAt": "2022-06-30T07:07:01Z", "content": "To enable citizens living in Municipal Corporation of Delhi (MCD) areas to directly connect and interact with more than 57,000 safai karamcharis (sanitation workers) and 5,000 malis (gardeners), the … [+1300 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Sports Desk", "title": "হাবাস যা বুঝেছেন, সেটাই করেছেন! ফেরান্দোর সঙ্গে তুলনা টেনে মুখ খুললেন প্রবীর", "description": "বেঙ্গালুরু এফসিতে কয়েক দিন আগেই যোগ দিয়েছেন প্রবীর দাস। এরপরেই তিনি মুখ খুললেন হাবাস-ফেরান্দোকে নিয়ে।", "url": "https://bengali.indianexpress.com/sports/isl-transfer-bengaluru-fc-new-star-prabir-das-speaks-on-atk-mohun-bagan-juan-ferrando-antonio-habas-463425/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/habas-prabir-ferrando.jpg", "publishedAt": "2022-06-30T07:06:29Z", "content": "- \r\n : ! \r\n , \r\n , “ - ”\r\n :  ISL, I League , \r\n , “ , , ”\r\n - , “ ”\r\n :  ! \r\n -, , “ , , , , ”\r\n“ , ”\r\nStay updated with the latest news headlines and all the latest Sports news download Indian Expr… [+127 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pune: Mephedrone worth Rs 1.4 lakh seized, one held", "description": "The anti-narcotics cell received a specific input on Tuesday that a suspect was peddling banned narcotics in the Pune Camp area and laid a trap trap to arrest him.", "url": "https://indianexpress.com/article/cities/pune/pune-mephedrone-seized-one-held-8000328/", "urlToImage": "https://images.indianexpress.com/2022/06/drugs.jpg", "publishedAt": "2022-06-30T07:05:57Z", "content": "The anti-narcotics cell of Pune city police has arrested an alleged drug peddler and seized from him Mephedrone, known also as Meow Meow, worth Rs 1.4 lakh. A probe has been launched into the supply … [+1287 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "SL vs AUS 1st Test: Stand blown away with strong wind at Galle; Day 2 start delayed", "description": "No spectators were in the stand at the time of collapse on Thursday morning.", "url": "https://indianexpress.com/article/sports/cricket/sl-vs-aus-1st-test-stand-blown-away-with-strong-wind-at-galle-day-2-start-delayed-8000324/", "urlToImage": "https://images.indianexpress.com/2022/06/Untitled-design-20-3.jpg", "publishedAt": "2022-06-30T07:05:18Z", "content": "The scheduled start of the Day 2 of the 1st Sri Lanka-Australia Test at Galle International Stadium has been delayed due to heavy rain. The strong wind has also blown away the roof on a makeshift gra… [+1395 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Bloomberg", "title": "Beer made from recycled toilet water wins admirers in Singapore", "description": "If you’re in Singapore and you want to taste it yourself, you may need to be quick.", "url": "https://indianexpress.com/article/world/beer-made-from-recycled-toilet-water-singapore-8000295/", "urlToImage": "https://images.indianexpress.com/2022/06/beer-1200.jpg", "publishedAt": "2022-06-30T07:02:04Z", "content": "The alcoholic beverage is a collaboration between the countrys national water agency, PUB, and local craft brewery Brewerkz. First unveiled at a water conference in 2018, NEWBrew went on sale in supe… [+2733 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "‘Is anyone going to buy this?’: Priyanka Chopra’s homeware brand criticised for selling ‘overpriced’ products", "description": "The actor had shared that the collection features \"vibrant designs, timeless refinement, and joyful detail that nod to my beautiful India\"", "url": "https://indianexpress.com/article/lifestyle/life-style/priyanka-chopra-homeware-brand-sona-home-overpriced-products-criticism-reddit-8000130/", "urlToImage": "https://images.indianexpress.com/2022/06/priyanka-chopra_1200.jpg", "publishedAt": "2022-06-30T07:00:21Z", "content": "Priyanka Chopra recently launched a homewarebrand ‘Sona Home’ in New York that intends to “transport you to an elegant bygone era with these exceptional pieces curated for the modern home“.Buy Now | … [+1620 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Farah Khan says ‘Rishi Kapoor is coming back’ after Alia Bhatt-Ranbir Kapoor’s pregnancy announcement, Neetu calls it ‘happiest news’", "description": "In the upcoming episode of Dance Deewane Juniors, the team will celebrate Alia Bhatt-Ranbir Kapoor's pregnancy news with Neetu Kapoor.", "url": "https://indianexpress.com/article/entertainment/television/alia-bhatt-ranbir-kapoor-pregnancy-news-rishi-kapoor-coming-back-farah-khan-neetu-dance-deewane-juniors-8000222/", "urlToImage": "https://images.indianexpress.com/2022/06/farah-khan-neetu-kapoor-chintu-ji.jpg", "publishedAt": "2022-06-30T06:58:50Z", "content": "Ranbir Kapoor and Alia Bhattannounced their pregnancy earlier this week. Fans and celebs alike have congratulated the couple. Grandma-to-be Neetu Kapoor, who is serving as a judge on Dance Deewane Ju… [+1714 chars]"}]}