{"status": "ok", "totalResults": 355, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Amarnath Yatra resumes; 4,026 pilgrims leave Jammu for base camps", "description": "The Yatra was suspended from Jammu due to bad weather conditions and no batch was allowed to proceed to the base camps in the Valley on Sunday.", "url": "https://indianexpress.com/article/cities/jammu/amarnath-yatra-resumes-pilgrims-leave-jammu-base-camps-8021666/", "urlToImage": "https://images.indianexpress.com/2022/07/Amarnath-cloudburst-4-1-1.jpg", "publishedAt": "2022-07-11T04:49:38Z", "content": "Amarnath Yatra resumed on Monday after remaining suspended for a day due to inclement weather as another batch of over 4,000 pilgrims left for the base camps of the 3,880-metre high cave shrine in so… [+1989 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Raima Sen says star-kids are judged and criticised: ‘It’s difficult for us as newcomers; outsiders don’t have that baggage’", "description": "Actor Raima Sen says that she did not have it easy during her initial days of joining the film industry, and that star-kids have the baggage of expectations to deal with unlike outsiders.", "url": "https://indianexpress.com/article/entertainment/bollywood/raima-sen-judged-nepotism-outsiders-8021572/", "urlToImage": "https://images.indianexpress.com/2018/03/raima-sen-12000.jpg", "publishedAt": "2022-07-11T04:49:33Z", "content": "While nepotism continues to be a raging debate in the film industry, actor Raima Sen, the daughter of Moon Moon Sen and granddaughter of Suchitra Sen has a rather different perspective on the issue. … [+1540 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Ranveer Singh-Deepika Padukone hold hands as they return from their vacation, fans point out at Ranveer’s bag. Here’s why", "description": "Ranveer Singh rang in his 37th birthday with wife Deepika Padukone at an undisclosed location, presumably on a beach-side vacation recently. The couple returned to Mumbai on Sunday.", "url": "https://indianexpress.com/article/entertainment/bollywood/ranveer-singh-deepika-padukone-return-to-mumbai-hand-in-hand-bag-alia-bhatt-8021569/", "urlToImage": "https://images.indianexpress.com/2022/07/ranveer-deepika-1200.jpg", "publishedAt": "2022-07-11T04:43:06Z", "content": "Ranveer Singh and Deepika Padukone returned to Mumbai late on Sunday after their holiday. The Bollywood power couple were there to celebrate Ranveer’s birthday at an undisclosed location, presumably … [+1435 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Ropeway glitch in Uttarakhand: BJP MLA among 40 people stuck mid-air for 45 minutes", "description": "BJP MLA Kishore Upadhayay said they were returning from Surkanda Devi Temple when the technical snag occurred. He said the ropeway service should be properly examined before starting it for tourists.", "url": "https://indianexpress.com/article/cities/city-others/ropeway-glitch-in-uttarakhand-bjp-mla-among-40-people-stuck-mid-air-for-45-minutes-8021676/", "urlToImage": "https://images.indianexpress.com/2022/06/trail.jpg", "publishedAt": "2022-07-11T04:40:37Z", "content": "More than 40 people, including BJP MLA Kishore Upadhayay, were stranded mid-air for over 45 minutes in cable cars due to technical glitch in the ropeway service between Surkanda Devi Temple and Kaddu… [+1431 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "UP man on Interpol’s ‘red notice’ arrested at Delhi’s IGI Airport", "description": "The man, identified as Majid, 30, a resident of Katauli Kalan of Uttar Pradesh’s Azamgarh district, was arrested at 12:38 pm on Sunday and the STF team recovered two mobile phones, Rs. 6000 and 850 Saudi Riyals (over Rs. 17,000) from the accused, said a senio…", "url": "https://indianexpress.com/article/cities/delhi/up-man-interpol-red-notice-arrested-delhi-igi-airport-8021607/", "urlToImage": "https://images.indianexpress.com/2022/07/PHOTO-2022-07-10-18-38-51.jpg", "publishedAt": "2022-07-11T04:38:39Z", "content": "A team of the Noida polices Special Task Force arrested a man, who had been absconding for eight years after allegedly committing murder in 2013, from Delhis Indira Gandhi International Airport Sunda… [+2135 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sriram Veera", "title": "The Indian Basketball connection that helped Nick Kyrgios reach Wimbledon final", "description": "Mahesh Padmanabhan, the Indian-origin basketball player, oversees the fierce sessions involving Kyrgios in Australia.", "url": "https://indianexpress.com/article/sports/tennis/the-indian-basketball-connection-that-helped-nick-kyrgios-reach-wimbledon-final-8021658/", "urlToImage": "https://images.indianexpress.com/2022/07/Nick-Kyrgios-1.jpg", "publishedAt": "2022-07-11T04:35:53Z", "content": "“Literally a month and a half ago, I was actually playing basketball with some boys back home and I said to one of them, ‘I think I’m going to have some fun and maybe win Wimbledon’,” said Nick Kyrgi… [+3823 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Amid heavy rain in Telangana, flood alert issued at Bhadrachalam as Godavari rises", "description": "There was flooding in several parts of Hyderabad and the police have advised residents to avoid non-essential travel. The police have also asked citizens to stay away from old and dilapidated buildings, uprooted electricity poles, and trees.", "url": "https://indianexpress.com/article/cities/hyderabad/amid-heavy-rain-in-telangana-flood-alert-issued-at-bhadrachalam-as-godavari-rises-8021662/", "urlToImage": "https://images.indianexpress.com/2022/07/hyderabad-1-1.jpg", "publishedAt": "2022-07-11T04:32:47Z", "content": "Heavy overnight rain threw life out of gear across Telangana Monday as ponds, lakes, streams, rivers, and reservoirs overflowed causing flooding in downstream areas. The sub-collector of Bhadrachalam… [+1287 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "‘He was a role model to me’: Camilla, Duchess of Cornwall, on her relationship with Prince Philip", "description": "The Duchess of Cornwall also revealed one aspect of royal life that continues to make her nervous, even after all these years", "url": "https://indianexpress.com/article/lifestyle/life-style/camilla-duchess-cornwall-relationship-prince-philip-royal-life-8018637/", "urlToImage": "https://images.indianexpress.com/2022/07/camilla.jpg", "publishedAt": "2022-07-11T04:30:45Z", "content": "Camilla, Duchess of Cornwall, who will turn 75 this month, is all set to be the future Queen Consort. Ahead of her birthday, she spoke to The Australian Women’s Weekly about her relationship with Pri… [+1134 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Siberia or Japan? Expert Google Maps players can tell at a glimpse.", "description": "In GeoGuessr, competitors try to pinpoint where in the world a Google Street View image has been taken. Some have become experts who can do it in seconds.", "url": "https://indianexpress.com/article/technology/tech-news-technology/siberia-or-japan-expert-google-maps-players-can-tell-at-a-glimpse-8021647/", "urlToImage": "https://images.indianexpress.com/2022/07/Expert-geoguesser-google-maps.jpg", "publishedAt": "2022-07-11T04:28:14Z", "content": "An unremarkable stretch of highway and trees, as seen on Google Maps Street View, appeared on the screen. It could have been anywhere from Tasmania to Texas.This is going to be south Philippines, som… [+7648 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sakshi Saroha", "title": "JEE Main 2022 topper Sneha Pareek: ‘No plans to reappear for Main, will prefer BTech (CS) from any IIT’", "description": "JEE Main 2022 topper: Sneha Pareek will not appear in the session 2 of the JEE Main 2022 exam and will now prepare for JEE Advanced. Her strategy for JEE Advanced will be the same as JEE Main of ‘practicing maximum mock tests’.", "url": "https://indianexpress.com/article/education/jee-main-2022-topper-sneha-pareek-no-plans-to-reappear-main-prefer-btech-cs-any-iit-8021041/", "urlToImage": "https://images.indianexpress.com/2022/07/JEE-Main-2022-topper.jpg", "publishedAt": "2022-07-11T04:23:40Z", "content": "JEE Main 2022 result: In the JEE Main 2022 Session 1 results declared today, Guwahatis Sneha Pareek has secured the top rank by getting a perfect score of 600/600. Pareek wishes to pursue BTech in Co… [+1460 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rahul Pandey", "title": "Sara Björk Gunnarsdóttir: The mother leading Iceland at the Euros", "description": "The Iceland national team captain’s journey from training during her pregnancy, to staying fit for the Euros, to actually leading her country at the competition is one for Viking literature.", "url": "https://indianexpress.com/article/sports/football/sara-bjork-gunnarsdottir-the-mother-leading-iceland-at-the-euros-8021623/", "urlToImage": "https://images.indianexpress.com/2022/07/Sara-Bjork-Gunnarsdottir.jpg", "publishedAt": "2022-07-11T04:17:50Z", "content": "I can see the Euros, yeah, for sure.Towards the end of her 11 minute, 51 second documentary is when Iceland womens national team captain, Sara Björk Gunnarsdóttir says the above line. The documentary… [+7094 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "OPS vs EPS: HC rejects plea to stay AIADMK meet on future leadership", "description": "Stating that the court cannot interfere in the squabbles of a political party, Justice Krishnan Ramaswamy allowed the general council meeting of AIADMK to continue in accordance with law.", "url": "https://indianexpress.com/article/cities/chennai/aiadmk-general-council-meeting-madrash-hc-rejects-ops-plea-eps-8021614/", "urlToImage": "https://images.indianexpress.com/2022/07/PTI07_10_2022_000172A.jpg", "publishedAt": "2022-07-11T04:14:30Z", "content": "Stating that the court cannot interfere in the squabbles of a political party, Justice Krishnan Ramaswamy delivered the verdict on Monday morning. Dismissing another plea against the general council … [+1193 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Deeksha Teri", "title": "CUET-UG 2022: All you want to know about the exam, schedule", "description": "Indianexpress.com answers some of the frequently asked questions about the computer-based test, which is now the gateway exam for admissions to all undergraduate programmes at central universities", "url": "https://indianexpress.com/article/education/all-you-want-to-know-about-cuet-ug-pg-exam-dates-eligibility-syllabus-cuet-samarth-ac-in-nta-ac-in-8017596/", "urlToImage": "https://images.indianexpress.com/2022/07/Campus-Season-CUET.jpg", "publishedAt": "2022-07-11T04:08:27Z", "content": "The Central University Entrance Test  or CUET-UG, which is mandatory for undergraduate admission to central universities in the country, is set to be held this month. The National Testing Agency (NTA… [+6068 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "UGC-NET technical glitch: Affected candidates can appear again for exam in second phase", "description": "The first day of UGC-NET on Saturday was marred by technical glitches, with candidates across states complaining of long delays and other difficulties in taking the exam.", "url": "https://indianexpress.com/article/jobs/ugc-net-technical-glitch-affected-candidates-appear-again-in-second-phase-8021620/", "urlToImage": "https://images.indianexpress.com/2021/04/ugc-net-1200.jpg", "publishedAt": "2022-07-11T04:00:27Z", "content": "UGC NET 2022: Candidates who couldn’t sit for the University Grants Commission-National Eligibility Test (UGC-NET) on Saturday due to technical glitches will, in all likelihood, be permitted to do so… [+1628 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Stock, Share Market News Today: Sensex slips nearly 250 points in early trade, Nifty hovers near 16,150-mark; IT stocks drag", "description": "Stock Market And Share Market Today Updates: At 9:20 am, the S&P BSE Sensex was down 242.12 points (0.44 per cent) at 54,239.72 while the Nifty 50 was trading at 16,155.80, down 64.80 points (0.40 per cent). Click here to follow LIVE updates", "url": "https://indianexpress.com/article/business/market/share-market-today-july-11-equity-stocks-bse-sensex-nse-nifty-rupee-global-cues-tcs-q1-profit-results-earnings-8021609/", "urlToImage": "https://images.indianexpress.com/2022/06/bse-bombay-stock-exchange-bloomberg-1200.jpg", "publishedAt": "2022-07-11T03:57:40Z", "content": "Sensex, Nifty, Share Prices Today: The frontline equity indices on the BSE and National Stock Exchange (NSE) opened lower on Monday weighed by IT heavyweights Tata Consultancy Services (TCS) and Info… [+1084 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "NASA to showcase Webb space telescope’s first full-color images", "description": "The highly anticipated unveiling this week of pictures and spectroscopic data from the James Webb Space Telescope follows a six-month process of remotely unfurling various components, aligning its mirrors and calibrating instruments.", "url": "https://indianexpress.com/article/technology/science/nasa-to-showcase-webb-space-telescopes-first-full-color-images-8021599/", "urlToImage": "https://images.indianexpress.com/2022/06/James-webb-space-telescope-first-images-how-to-view.jpg", "publishedAt": "2022-07-11T03:56:49Z", "content": "Drawing back the curtain to a photo gallery unlike any other, NASA will soon present the first full-color images from its James Webb Space Telescope, a revolutionary apparatus designed to peer throug… [+4588 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Clash outside AIADMK headquarters in Tamil Nadu, OPS arrives at party office", "description": "On his part, former Coordinator O Panneerselvam (OPS) arrived at the party office, along with supporters, while EPS was on his way to a marriage hall in the city where the General Council meet is slated.", "url": "https://indianexpress.com/article/cities/chennai/aiadmk-panneerselvam-palaniswami-general-council-meet-chennai-tamil-nadu-8021610/", "urlToImage": "https://images.indianexpress.com/2022/07/aiadmk-.png", "publishedAt": "2022-07-11T03:54:43Z", "content": "On his part, former Coordinator O Panneerselvam (OPS) arrived at the party office, along with supporters, while EPS was on his way to a marriage hall in the city where the General Council meet is sla… [+1300 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Ranveer Singh buys Rs 119 cr quadruplex apartment, becomes Shah Rukh Khan and Salman Khan’s neighbour: reports", "description": "Ranveer Singh has reportedly bought a sprawling new property in Bandra, that's located around Shah Rukh Khan's Mannat and Salman's Galaxy apartment.", "url": "https://indianexpress.com/article/entertainment/bollywood/ranveer-singh-buys-rs-119-cr-apartment-shah-rukh-khan-salman-khan-neighbour-reports-8021548/", "urlToImage": "https://images.indianexpress.com/2022/05/Ranveer-1200.jpg", "publishedAt": "2022-07-11T03:51:15Z", "content": "Bollywood superstars Shah Rukh Khan and Salman Khan have got a new neighbbour in Ranveer Singh. The latter has reportedly bought a sprawling new property near SRK’s Mannat and Salman’s Galaxy in Band… [+1202 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Mumbai News Live Updates: Shinde celebrates Maha Pooja; Aditya says can’t destroy Aarey unique forest", "description": "Mumbai News Live Updates: Aaditya Thackeray says \"Aarey is a unique forest and the state government can't destroy the city's biodiversity\"", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-news-live-updates-eknath-shinde-celebrates-maha-pooja-aditya-thackeray-says-cant-destroy-aarey-unique-forest-8021549/", "urlToImage": "https://images.indianexpress.com/2022/07/eknath-shinde-hindutva-1-1.jpg", "publishedAt": "2022-07-11T03:49:35Z", "content": "Mumbai News Live Updates: Maharashtra Chief Minister Eknath Shinde and his wife performed a maha pooja of Lord Vitthal and Goddess Rukmini at a famous temple in Pandharpur town on Sunday on the occas… [+752 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Japan ruling party wins big in polls in wake of Abe’s death", "description": "The Liberal Democratic Party and its junior coalition partner Komeito raised their combined share in the 248-seat chamber to 146 — far beyond the majority — in the elections for half of the seats in the less powerful upper house.", "url": "https://indianexpress.com/article/world/japan-ruling-party-wins-polls-abe-death-8021581/", "urlToImage": "https://images.indianexpress.com/2022/07/AP22191494509068.jpg", "publishedAt": "2022-07-11T03:45:07Z", "content": "The Liberal Democratic Party and its junior coalition partner Komeito raised their combined share in the 248-seat chamber to 146 far beyond the majority in the elections for half of the seats in the … [+4289 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Sri Lanka crisis Live Updates: President Rajapaksa to resign, PM confirms; Oppn meets to form new govt", "description": "Sri Lanka crisis Live Updates, July 11: The protesters will continue to occupy the residences of President Rajapaksa and PM Wickremesinghe until the two quit office, the anti-government protest leaders said on Sunday.", "url": "https://indianexpress.com/article/world/sri-lanka-crisis-live-updates-protests-gotabaya-rajapaksa-resign-8021566/", "urlToImage": "https://images.indianexpress.com/2022/07/2022-07-10T094714Z_1244412886_RC2P8V9RC52C_RTRMADP_3_SRI-LANKA-CRISIS.jpg", "publishedAt": "2022-07-11T03:44:27Z", "content": "A man stands in the swimming pool as people visit the President's house on the day after demonstrators entered the building, after President Gotabaya Rajapaksa fled, amid the country's economic crisi… [+1352 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "YouTuber Gaurav Taneja says will take ‘appropriate legal remedy’ against arrest after fans crowd metro station", "description": "Taneja, who runs a channel on YouTube called Flying Beast, and his wife Ritu Rathee have said in a statement that the ‘fans’ who had gathered had not caused any harm.", "url": "https://indianexpress.com/article/cities/delhi/youtuber-gaurav-taneja-legal-remedy-arrest-8021592/", "urlToImage": "https://images.indianexpress.com/2022/07/Gaurav-Taneja.jpg", "publishedAt": "2022-07-11T03:42:44Z", "content": "YouTuber Gaurav Taneja has said that he will pursue a legal remedy against his arrest by the Noida police on Saturday, adding that he sought permission to book a metro coach for his birthday celebrat… [+2661 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Keep skincare woes at bay with this ‘monsoon fruit’", "description": "Have you ever had an increase in acne breakout, rashes, clogged skin pores or oiliness during the rainy season? Nutritionist Lovneet Batra has the perfect solution", "url": "https://indianexpress.com/article/lifestyle/health/monsoon-skincare-plum-benefits-8014380/", "urlToImage": "https://images.indianexpress.com/2022/07/skincare_1200_getty.jpg", "publishedAt": "2022-07-11T03:40:23Z", "content": "Oiliness, acne breakouts, and even rashes become common during the rainy season. While certain ointments and medicines may provide temporary relief from such skincare issues, experts stress eating se… [+1910 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Priyanka Chopra cheers for Nick Jonas at golf game at Lake Tahoe, signs autographs for fans. See videos, photos", "description": "Priyanka Chopra attended Nick Jonas's golf game in the US and cheered him on. A fan took to Instagram and shared videos and photos from the outing.", "url": "https://indianexpress.com/article/entertainment/bollywood/priyanka-chopra-cheers-for-nick-jonas-at-golf-game-at-lake-tahoe-8021546/", "urlToImage": "https://images.indianexpress.com/2022/07/FotoJet1.jpg", "publishedAt": "2022-07-11T03:40:02Z", "content": "Actor Priyanka Chopra turned cheerleader for her husband, singer Nick Jonas as he played golf at Lake Tahoe in the US. A fan took to Instagram and shared photos and videos the couple during the ACC G… [+1617 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "15 killed in Russian strike in Ukraine, 20 believed trapped", "description": "The strike late Saturday destroyed three buildings in a residential quarter of the town of Chasiv Yar, inhabited mostly by people who work in nearby factories.", "url": "https://indianexpress.com/article/world/15-killed-in-russian-strike-in-ukraine-20-believed-trapped-8021570/", "urlToImage": "https://images.indianexpress.com/2022/07/90.jpg", "publishedAt": "2022-07-11T03:39:11Z", "content": "Dozens of Ukrainian emergency workers laboured Sunday to pull people out of the rubble after a Russian rocket attack smashed into apartment buildings in eastern Ukraine, killing at least 15 people.Mo… [+6568 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Chennai power cut today: Check out the list of affected areas that will face a power cut in Chennai", "description": "Chennai power disruption July 11, Monday: Parts of Chennai will face a power cut from 9 am to 2 pm for maintenance work today.", "url": "https://indianexpress.com/article/cities/chennai/chennai-power-cut-today-these-areas-will-face-power-cut-in-chennai-8021576/", "urlToImage": "https://images.indianexpress.com/2022/07/electricity-reuters-1200-2-1-9.jpeg", "publishedAt": "2022-07-11T03:38:34Z", "content": "The Tamil Nadu Generation and Distribution Corporation (Tangedco) has announced that power will be suspended in parts of Chennai today in Mylapore, Tambaram, Porur, T Nagar, KK Nagar, IT Corridor, Ad… [+3557 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Four arrested for involvement in murder of elderly woman in Northwest Delhi", "description": "According to the police, the accused had allegedly encouraged the boy to commit the crime to repay a loan they had given him.", "url": "https://indianexpress.com/article/cities/delhi/four-arrested-for-involvement-in-murder-of-elderly-woman-in-northwest-delhi-8021582/", "urlToImage": "https://images.indianexpress.com/2022/07/arrest-4.jpg", "publishedAt": "2022-07-11T03:37:55Z", "content": "A day after a minor boy was apprehended for allegedly killing his elderly relative in Delhi’s Northwest district over her refusal to give him money, four others were arrested Saturday for their alleg… [+1989 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "When Sanjay Dutt had said he can ‘shed blood’ for Kumar Gaurav: ‘Love him immensely’", "description": "On former superstar Kumar Gaurav's birthday, we revisit the changing relationship between the former actor and his brother-in-law Sanjay Dutt.", "url": "https://indianexpress.com/article/entertainment/bollywood/sanjay-dutt-shed-his-blood-for-kumar-gaurav-mahesh-bhatt-naam-movie-8012091/", "urlToImage": "https://images.indianexpress.com/2022/07/naammovie1200.jpg", "publishedAt": "2022-07-11T03:34:03Z", "content": "The Gen Z, and even a fair amount of millennials, might not be familiar with who Kumar Gaurav is, but after his debut film Love Story (1981), Kumar turned into a superstar overnight. His good looks a… [+2353 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Monsoon news live updates: Telangana declares three-day holiday for academic institutions amid heavy rains; Karnataka sees heavy rainfall in coastal regions", "description": "India Monsoon live, IMD weather news updates today 11 July: Deputy commissioners for coastal districts in Karnataka declared a holiday for schools and anganwadis on Monday.", "url": "https://indianexpress.com/article/india/monsoon-news-live-updates-karnataka-delhi-maharashtra-rainfall-weather-today-8021534/", "urlToImage": "https://images.indianexpress.com/2022/07/WhatsApp-Image-2022-07-09-at-4.33.44-PM.jpeg", "publishedAt": "2022-07-11T03:32:00Z", "content": "Monsoon, Weather Live News Updates Today: As heavy rains continue in Telangana, Chief Minister K Chandrashekhar Rao urged all departments to be on high alert and take measures to ensure no lives are … [+403 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Upcoming rugged Apple Watch ‘Pro’ model could cost $900, report says", "description": "The Apple Watch Pro could have a bigger screen, larger battery, an S8 chip and a body temperature sensor.", "url": "https://indianexpress.com/article/technology/tech-news-technology/apple-watch-pro-model-could-cost-900-report-says-8021526/", "urlToImage": "https://images.indianexpress.com/2022/07/AppleWatch_7_LEAD_3.jpeg", "publishedAt": "2022-07-11T03:25:29Z", "content": "Apple is reportedly planning to launch not one but three different Apple Watch models this year, including an expensive $900 ‘rugged’ smartwatch. Writing via the PowerOn newsletter, Bloomberg’s Mark … [+2042 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Udit Misra", "title": "ExplainSpeaking | Forex reserves & rupee’s exchange rate: What are they and how are they related?", "description": "In this edition of ExplainSpeaking, we look at forex reserves and exchange rates, how they impact each other, and why it's necessary to keep aside political loyalties in understanding them.", "url": "https://indianexpress.com/article/explained/forex-reserves-rupee-exchange-rate-explained-8021551/", "urlToImage": "https://images.indianexpress.com/2022/07/udit-feature.jpg", "publishedAt": "2022-07-11T03:14:09Z", "content": "ExplainSpeaking-Economy is a weekly newsletter by Udit Misra, delivered in your inbox every Monday morning. Click here to subscribeDear Readers,\r\nOver the past two years, and more so over the past tw… [+10255 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Rohit defends Virat, says it has happened to me also, we back quality of player", "description": "Virat Kohli scored 11 in the third and final T20I against England.", "url": "https://indianexpress.com/article/sports/cricket/rohit-defends-virat-says-it-has-happened-to-me-also-we-back-quality-of-player-8021552/", "urlToImage": "https://images.indianexpress.com/2022/07/Virat-Kohli.jpg", "publishedAt": "2022-07-11T03:05:56Z", "content": "Kohli was caught at the cover while trying to manufacture a third consecutive hit after collecting a four and a straight six off David Willey.\r\nVirat Kohli’s lean patch has gone past two and half yea… [+2655 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Leela Prasad, Srishti Kapoor", "title": "Daily Briefing: After Delhi rape, panic in Uber HQ; steep rise in legal demands to remove content from Twitter", "description": "In today's edition: Delhi rape rang alarm bells in Uber HQ, Indian Express investigation finds; Goa Congress accuses Micheal Lobo and Digambar Kamat of 'hobnobbing' with the BJP; and more", "url": "https://indianexpress.com/article/live-news/daily-briefing-top-news-july-11-uber-twitter-sri-lanka-crisis-8021542/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-2021-11-08T081015.674-4.jpg", "publishedAt": "2022-07-11T02:54:58Z", "content": "The Uber Files\r\nIn its eighth collaboration with the International Consortium of Investigative Journalists (ICIJ), The Indian Express spent four monthsinvestigating The Uber Files, a cache of 124,000… [+5928 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "‘Nobody can be you, but you; so show up and show out’: Bevy Smith", "description": "Adults often find themselves in a transitional stage in life, wherein they think they are too old to change. Bevy thinks otherwise.", "url": "https://indianexpress.com/article/lifestyle/life-positive/bevy-smith-life-positive-motivational-7982544/", "urlToImage": "https://images.indianexpress.com/2022/06/BevySmith_Insta1200.jpg", "publishedAt": "2022-07-11T02:50:41Z", "content": "Pop culture queen Bevy Smith did not always feel the same way about the ‘dream life’ she was living. In a recent TED Talk, she delivered some hard-won advice about authenticity, confidence, success, … [+2053 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "While You Were Sleeping: India knocked out of Hockey World Cup, France thrash Italy in Euro 2022, Bangladesh beat WI by 6 wickets", "description": "Marta Segu (57th minute) scored the lone goal for the hosts as they moved into the quarterfinals. Geyoro scored the competition's maiden first-half hat-trick in France's 5-1 win over Italy. Shoriful Islam (4/34) and Mehidy Hasan Miraz (3/36) shared seven wick…", "url": "https://indianexpress.com/article/sports/sport-others/while-you-were-sleeping-india-knocked-out-of-hockey-world-cup-france-thrash-italy-in-euro-2022-bangladesh-beat-wi-by-6-wickets-8021520/", "urlToImage": "https://images.indianexpress.com/2022/07/While-You-Were-Asleep-2-3.jpg", "publishedAt": "2022-07-11T02:28:50Z", "content": "Indian women’s team has been knocked out of the FIH Hockey Women’s World Cup after losing to Spain 0-1 in their must-win crossover match. Marta Segu (57th minutes) scored the lone goal for the hosts … [+5212 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Redevelopment of Delhi’s 5 popular markets: Survey to chalk out new design, take stock of facilities", "description": "Kamla Nagar, Sarojini Nagar, Khari Baoli spice market, Lajpat Nagar and Kirti Nagar furniture markets are the five markets that will get a facelift under the market redevelopment project.", "url": "https://indianexpress.com/article/cities/delhi/redevelopment-of-delhis-5-popular-markets-survey-to-chalk-out-new-design-take-stock-of-facilities-8021513/", "urlToImage": "https://images.indianexpress.com/2021/12/sarojini-nagar-covid-crowd-delhi.jpg", "publishedAt": "2022-07-11T02:06:47Z", "content": "On the heels of its proposals to redevelop five popular markets, the Delhi government has begun preliminary works towards revamping them. The government will conduct an online survey of traders of al… [+1805 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "I-T officials told me I can be CM by framing official, alleges trader", "description": "In a video message circulated on social media, Coal and transport businessman Suryakant Tiwari alleged that he was physically and mentally tortured during the searches after he refused to implicate a government officer posted at Chief Minister’s Office by giv…", "url": "https://indianexpress.com/article/cities/i-t-officials-told-me-i-can-be-cm-by-framing-official-alleges-trader-8021495/", "urlToImage": "https://images.indianexpress.com/2022/07/income-tax-dept-1.jpg", "publishedAt": "2022-07-11T01:03:33Z", "content": "COAL AND transport businessman Suryakant Tiwari, whose premises were recently searched by Income-Tax department in Chhattisgarh, on Sunday alleged that I-T officials told him that he could become Chi… [+1801 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Chhattisgarh: I-T officials told me I can be CM by framing official, alleges trader", "description": "In a video message circulated on social media, Coal and transport businessman Suryakant Tiwari alleged that he was physically and mentally tortured during the searches after he refused to implicate a government officer posted at Chief Minister’s Office by giv…", "url": "https://indianexpress.com/article/india/i-t-officials-told-me-i-can-be-cm-by-framing-official-alleges-trader-8021495/", "urlToImage": "https://images.indianexpress.com/2022/07/income-tax-dept-1.jpg", "publishedAt": "2022-07-11T01:03:33Z", "content": "Coal and transport businessman Suryakant Tiwari, whose premises were recently searched by Income-Tax department in Chhattisgarh, on Sunday alleged that I-T officials told him that he could become Chi… [+1801 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Harish Damodaran", "title": "Global edible oil prices crash; will other food commodities follow?", "description": "India annually consumes around 23 million tonnes (mt) of edible oils, out of which 13.5-14.5 mt is imported and 8.5-9.5 mt domestically produced.", "url": "https://indianexpress.com/article/explained/global-edible-oil-prices-crash-will-other-food-commodities-follow-8021484/", "urlToImage": "https://images.indianexpress.com/2022/07/edible-oil.jpg", "publishedAt": "2022-07-11T00:39:44Z", "content": "The present prolonged bout of global food inflation from around end-2020 began with edible oils. Could it end with edible oils?As far as overall food inflation goes, these are still early days. The U… [+6271 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anand Mohan J", "title": "Uber panic button: On paper for security, but in car only for show", "description": "In 48 of 50 rides The Indian Express took, either panic button wasn’t there or didn’t work.", "url": "https://indianexpress.com/article/express-exclusive/uber-files-india-panic-button-8021204/", "urlToImage": "https://images.indianexpress.com/2022/07/The-Indian-Express-5.jpg", "publishedAt": "2022-07-11T00:30:41Z", "content": "Painted in red, the panic button is a crucial safety feature in vehicles used to ferry passengers. Mandated by a notification following the rape in New Delhi of a passenger by an Uber driver, this bu… [+7635 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Twitter hires U.S. law firm Wachtell to sue Musk after pulling out of $44 bln deal: Sources", "description": "Elon Musk, the chief executive officer of Tesla, on Friday terminated his deal, saying Twitter had failed to provide information about fake accounts on the platform, after which Twitter's chairman, Bret Taylor, vowed a legal fight.", "url": "https://indianexpress.com/article/technology/social/twitter-hires-u-s-law-firm-wachtell-to-sue-musk-after-pulling-out-of-44-bln-deal-sources-8021476/", "urlToImage": "https://images.indianexpress.com/2022/07/elon-twitter.jpg", "publishedAt": "2022-07-11T00:16:00Z", "content": "Twitter Inc has hired U.S. law firm Wachtell, Lipton, Rosen &amp; Katz LLP as it prepares to sue Elon Musk and force him to complete the $44 billion acquisition of the social media company, according… [+1042 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "Taming the scourge", "description": "Cancer has been a scourge of humankind for centuries. Advances in molecular cell biology and genetics since the second half of the 20th century have made the disease far less intractable", "url": "https://indianexpress.com/article/opinion/editorials/taming-the-scourge-cancer-research-8021336/", "urlToImage": "https://images.indianexpress.com/2022/07/Express-View-4.jpg", "publishedAt": "2022-07-10T22:54:12Z", "content": "Last week, the University of Houston announced that its researchers have made significant improvements to a next-generation cancer therapy that kills tumour cells while leaving healthy tissues intact… [+2855 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Nirupama Subramanian, Bashaarat Masood", "title": "Amarnath stream flooded last year too, yet tents set up at same spot", "description": "Yet, as The Indian Express has reported, this year, the tents for pilgrims were set up on the flood channel, also known as the dry river bed. This was done to accommodate as many people as possible at a time. A langar was also permitted to operate from this d…", "url": "https://indianexpress.com/article/india/amarnath-stream-flooded-last-year-too-yet-tents-set-up-at-same-spot/", "urlToImage": "https://images.indianexpress.com/2022/07/Amarnath-cloudburst-4-1.jpg", "publishedAt": "2022-07-10T22:50:33Z", "content": "No lives were lost in last years July 28 flood there was no yatra in 2021 owing to the Covid-19 pandemic. The flash flood, which was caused by heavy rain, had triggered shooting stones, and the flood… [+4924 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Nirupama Subramanian, Bashaarat Masood", "title": "Amarnath stream flooded last year too, yet tents set up at same spot", "description": "Yet, as The Indian Express has reported, this year, the tents for pilgrims were set up on the flood channel, also known as the dry river bed. This was done to accommodate as many people as possible at a time. A langar was also permitted to operate from this d…", "url": "https://indianexpress.com/article/india/amarnath-stream-flooded-last-year-too-yet-tents-set-up-at-same-spot-8021382/", "urlToImage": "https://images.indianexpress.com/2022/07/Amarnath-cloudburst-4-1.jpg", "publishedAt": "2022-07-10T22:50:33Z", "content": "No lives were lost in last years July 28 flood there was no yatra in 2021 owing to the Covid-19 pandemic. The flash flood, which was caused by heavy rain, had triggered shooting stones, and the flood… [+4924 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shyamlal Yadav, Ritu Sarin", "title": "Explained: Uber in India", "description": "The Uber Files show how the ride-hailing company found ways around laws, and lobbied aggressively with governments during the period of its dramatic expansion. What is \r\nUber’s profile in India, and what do the Files say about its operations in the country?", "url": "https://indianexpress.com/article/explained/uber-in-india-uber-files-express-investigation-8021356/", "urlToImage": "https://images.indianexpress.com/2022/07/uber.jpg", "publishedAt": "2022-07-10T22:45:59Z", "content": "The Uber Files are a leak of 182 gigabytes of data that were obtained by The Guardian newspaper from an anonymous source and shared with the International Consortium of Investigative Journalists (ICI… [+8731 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Indiafm", "title": "HC comes to the aid of ‘special child’ deprived of right to education", "description": "", "url": "https://indianexpress.com/article/india/hc-comes-to-the-aid-of-special-child-deprived-of-right-to-education-8021443/", "urlToImage": "https://indianexpress.com/wp-content/themes/indianexpress/images/IE-OGimage.jpg", "publishedAt": "2022-07-10T22:17:27Z", "content": "While pulling up the state of Haryana for being blissfully unaware of its duties for providing necessary infrastructural support to special children with disabilities, the Punjab and Haryana High Cou… [+2010 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Canning Killings: Raids on, key accused still at large, says Police", "description": "On Saturday, police had arrested an  aide of Sardar, Aftabuddin Sheikh, who is among the six people named in the triple murder FIR.", "url": "https://indianexpress.com/article/cities/kolkata/canning-killings-raids-on-key-accused-still-at-large-says-police-8021449/", "urlToImage": "https://images.indianexpress.com/2022/07/police-9.jpg", "publishedAt": "2022-07-10T22:16:23Z", "content": "Baruipur police, probing the murder of three TMC workers, on Sunday carried out several raids in South 24 Parganas and adjoining districts but failed to nab prime accused Rafikul Sardar.\r\nOn Saturday… [+580 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Six members of CPI(M) join CPI in Darjeeling", "description": "CPI’s Darjeeling district secretary Animesh Banerjee. said that their joining the CPI will give much-needed oxygen to the party’s organisation in the district.", "url": "https://indianexpress.com/article/cities/kolkata/six-members-of-cpim-join-cpi-in-darjeeling-8021447/", "urlToImage": "https://images.indianexpress.com/2022/07/900px-cpi759.jpg", "publishedAt": "2022-07-10T22:10:31Z", "content": "A group of six CPI (M) members resigned from the party and joined the CPI in West Bengal’s Darjeeling district on Sunday. The leaders who joined CPI were former district committee member of CPI(M) Pa… [+626 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Amarnath Flash Flood: 22-yr-old college student from Baruipur among dead, was missing since Friday", "description": "Barsha Mahuri was missing from Friday and her body was recovered on Saturday, officials said here on Sunday. According to Mahuri’s family, a group of six persons from Baruipur had left for Amarnath Yatra on July 1.", "url": "https://indianexpress.com/article/cities/kolkata/amarnath-flash-flood-22-yr-old-college-student-from-baruipur-among-dead-was-missing-since-friday-8021444/", "urlToImage": "https://images.indianexpress.com/2022/07/Amarnath-cloudburst-featured-1.jpg", "publishedAt": "2022-07-10T22:02:02Z", "content": "A 22-year-old college student from Baruipur in South 24 Parganas district of West Bengal is among the 16 people who died in the flash flood near the Amarnath cave shrine in Jammu and Kashmir on Frida… [+2155 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "After row on Metro station inauguration, KMRC sends invite to CM & Governor", "description": "On Saturday, the ruling Trinamool Congress (TMC) had alleged that during her tenure as a railway minister, it was Banerjee who had approved the project, but the Centre was “deliberately inaugurating” the Metro station by “ignoring” the Chief Minister.", "url": "https://indianexpress.com/article/cities/kolkata/after-row-on-metro-station-inauguration-kmrc-sends-invite-to-cm-governor-8021440/", "urlToImage": "https://images.indianexpress.com/2022/07/Mamta-and-governor.jpg", "publishedAt": "2022-07-10T21:51:57Z", "content": "A day after Kolkata Municipal Rail Corporation (KMRC) triggered a row by reportedly not inviting Chief Minister Mamata Banerjee to the inauguration of Sealdah Metro station, it sent out an invitation… [+1885 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Man Aman Singh Chhina", "title": "Territorial Army seeks Chinese interpreter officers", "description": "", "url": "https://indianexpress.com/article/cities/chandigarh/territorial-army-seeks-chinese-interpreter-officers/", "urlToImage": "https://indianexpress.com/wp-content/themes/indianexpress/images/IE-OGimage.jpg", "publishedAt": "2022-07-10T21:50:10Z", "content": "In an interesting development, the Territorial Army (TA) has for the first time sought officers having a specific linguistic proficiency and has sought applications from male and female candidates to… [+4480 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Haryana to constitute Backward Classes Commission afresh: CM", "description": "The CM made this announcement during Baba Makhan Shah Labana and Baba Lakhi Shah Vanjara Jayanti celebrations at Kurukshetra", "url": "https://indianexpress.com/article/india/haryana-to-constitute-backward-classes-commission-afresh-cm-8021438/", "urlToImage": "https://indianexpress.com/wp-content/themes/indianexpress/images/IE-OGimage.jpg", "publishedAt": "2022-07-10T21:43:59Z", "content": "Haryana Chief Minister Manohar Lal Khattar Sunday said that the state government is forming the Backward Classes Commission afresh. This commission will take care of all the problems of the community… [+1416 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Kevin Rudd at Idea Exchange: I can never rule out Xi Jinping making a significant gesture to India in his overwhelming interest of changing the game in his favour", "description": "In his book, The Avoidable War, former Australian PM Kevin Rudd analyses the layers of the US-China relationship, the need for strategic competition, what it means for Quad and the way Australia looks at India. He also explains why the new Australian Labour g…", "url": "https://indianexpress.com/article/idea-exchange/kevin-rudd-express-idea-exchange-8021435/", "urlToImage": "https://images.indianexpress.com/2022/07/idea-exchange.jpg", "publishedAt": "2022-07-10T21:42:15Z", "content": "Shubhajit Roy: Why write this book now? You also mention that theres a potential for a conflict between the US and China. That it is a question of not if but when. Why do you say so despite all the g… [+15274 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Kevin Rudd at Idea Exchange: I can never rule out Xi Jinping making a significant gesture to India in his overwhelming interest of changing the game in his favour", "description": "In his book, The Avoidable War, former Australian PM Kevin Rudd analyses the layers of the US-China relationship, the need for strategic competition, what it means for Quad and the way Australia looks at India. He also explains why the new Australian Labour g…", "url": "https://indianexpress.com/article/idea-exchange/kevin-rudd-express-idea-exchange8021435/", "urlToImage": "https://images.indianexpress.com/2022/07/idea-exchange.jpg", "publishedAt": "2022-07-10T21:42:15Z", "content": "Shubhajit Roy: Why write this book now? You also mention that theres a potential for a conflict between the US and China. That it is a question of not if but when. Why do you say so despite all the g… [+15274 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "Sri Lanka restart", "description": "Public anger also points to the way out: A new political leadership is needed to steer Sri Lanka out of present impasse.", "url": "https://indianexpress.com/article/opinion/editorials/sri-lanka-restart-8021333/", "urlToImage": "https://images.indianexpress.com/2022/06/Editorial-10.jpeg", "publishedAt": "2022-07-10T21:41:10Z", "content": "In scenes reminiscent of the Arab Spring, citizens stormed the residences of Sri Lankas president and prime minister in Colombo on Friday, forcing both leaders to announce that they would quit their … [+2885 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pranav Mukul", "title": "IndiGo technicians in Hyderabad, Delhi call in sick over salary issues", "description": "According to a source, a significant number of aircraft technicians did not report for duty on Friday’s night shift at Hyderabad airport. This was followed by technicians not reporting for duty on Saturday morning as well.", "url": "https://indianexpress.com/article/business/aviation/indigo-technicians-in-hyderabad-delhi-call-in-sick-over-salary-issues-8021433/", "urlToImage": "https://images.indianexpress.com/2022/07/indigo-1-1-1.jpg", "publishedAt": "2022-07-10T21:26:25Z", "content": "A significant number of IndiGo aircraft maintenance engineers at Hyderabad and Delhi called in sick over the last few days in protest of the salaries being paid to these technicians, according to mul… [+1538 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "George Mathew", "title": "Premium mobilisation: PSU general insurers lose market share in Jun quarter", "description": "While the market share of private companies rose to 51.82 per cent in June 2022 from 47.63 per cent a year ago, PSU general insurers lost the market share from 42.23 per cent to 37.85 per cent.", "url": "https://indianexpress.com/article/business/banking-and-finance/premium-mobilisation-psu-general-insurers-lose-market-share-in-jun-quarter-8021429/", "urlToImage": "https://images.indianexpress.com/2022/07/market-finance-759.jpg", "publishedAt": "2022-07-10T21:20:01Z", "content": "With public sector insurance general companies, which once monopolised the sector, focussing more on profits, they have lost market share in gross premium underwritten to the aggressive private secto… [+3003 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Minor sits with sibling’s body as father looks for transport", "description": "Their father, Pujaram Jatav, could not afford an ambulance run by a private agency hired by the hospital. The agency charged him between Rs 1,500 and Rs 2,000 to ferry them to their village, Badphara, about 40 km from the hospital.", "url": "https://indianexpress.com/article/cities/bhopal/minor-sits-with-siblings-body-as-father-looks-for-transport-8021427/", "urlToImage": "https://images.indianexpress.com/2022/07/Indian-express-logo-1-17.jpeg", "publishedAt": "2022-07-10T21:18:21Z", "content": "Images and video clips of an eight-year-old boy holding his toddler brothers body and sobbing while their father, a labourer, was away trying to arrange a vehicle to take them home has sent shock wav… [+2203 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Kejriwal, Mann to lead Tiranga Yatra in HP", "description": "The Delhi chief minister and his Punjab counterpart had on June 11 participated in a town hall meeting organised in Hamirpur district to deliberate on the state of education in Himachal Pradesh.", "url": "https://indianexpress.com/article/cities/delhi/kejriwal-mann-to-lead-tiranga-yatra-in-hp/", "urlToImage": "https://images.indianexpress.com/2022/07/arvind-kejriwal-2.jpg", "publishedAt": "2022-07-10T21:17:54Z", "content": "Delhi Chief Minister and AAP national convenor Arvind Kejriwal will visit Himachal Pradesh this week to participate in a Tiranga Yatra organised by his party’s state unit in Palampur in the run up to… [+2128 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Kejriwal, Mann to lead Tiranga Yatra in HP", "description": "The Delhi chief minister and his Punjab counterpart had on June 11 participated in a town hall meeting organised in Hamirpur district to deliberate on the state of education in Himachal Pradesh.", "url": "https://indianexpress.com/article/cities/delhi/kejriwal-mann-to-lead-tiranga-yatra-in-hp-8021419/", "urlToImage": "https://images.indianexpress.com/2022/07/arvind-kejriwal-2.jpg", "publishedAt": "2022-07-10T21:17:54Z", "content": "Delhi Chief Minister and AAP national convenor Arvind Kejriwal will visit Himachal Pradesh this week to participate in a Tiranga Yatra organised by his party’s state unit in Palampur in the run up to… [+2128 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Soumyarendra Barik", "title": "Content blocking orders by govt and courts to Twitter soars 48,000%", "description": "According to the data shared in the Lok Sabha by former Minister of State for Electronics and IT Sanjay Dhotre, the government ordered social media companies to take down 9,849 links from their platforms under Section 69 (A) of the Information Technology Act,…", "url": "https://indianexpress.com/article/technology/social/content-blocking-orders-by-govt-and-courts-to-twitter-soars-48000-8021423/", "urlToImage": "https://images.indianexpress.com/2022/07/twitter-1-1.jpg", "publishedAt": "2022-07-10T21:12:10Z", "content": "There has been a rise of more than 48,000 per cent in legal demands being made by India from various courts and the government to remove content from Twitter between 2014 and 2020, an analysis of Twi… [+2930 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Amarnath flash flood rescue ops resume, J&K L-G visits base camp", "description": "J&K Lt Governor Manoj Sinha visited the base camp at Pahalgam in south Kashmir to monitor the rescue and relief operations.", "url": "https://indianexpress.com/article/india/amarnath-flash-flood-rescue-ops-resume-jk-l-g-visits-base-camp-8021424/", "urlToImage": "https://images.indianexpress.com/2022/07/sri.jpg", "publishedAt": "2022-07-10T21:10:58Z", "content": "RESCUE EFFORTS to track Amarnath pilgrims who went missing after the flash floods last week resumed Sunday afternoon, after bad weather delayed the operations in the morning.J&amp;K Lt Governor Manoj… [+690 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "I-T officers told me to frame official, be CM: businessman", "description": "In a video message circulated on social media, Tiwari alleged he was physically and mentally tortured during the searches after he refused to implicate a government officer posted at Chief Minister’s Office by giving false statement.", "url": "https://indianexpress.com/article/india/i-t-officers-told-me-to-frame-official-be-cm-businessman-8021421/", "urlToImage": "https://images.indianexpress.com/2022/07/income-tax-dept.jpg", "publishedAt": "2022-07-10T21:06:47Z", "content": "COAL AND transport businessman Suryakant Tiwari, whose premises were recently searched by Income-Tax department in Chhattisgarh, on Sunday alleged that I-T officials told him that he could become CM … [+1402 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Communication with workers essential, says Congress leader", "description": "Dr Udit Raj was speaking at the Kamdar Karmachari Congress (KKC) meet held at Rajiv Gandhi Bhawan in Paldi where over 400 representatives of Gujarat KKC, including its state president Ashok Punjabi, were present.", "url": "https://indianexpress.com/article/cities/ahmedabad/communication-with-workers-essential-says-congress-leader8021416/", "urlToImage": "https://images.indianexpress.com/2022/07/udit-raj.jpg", "publishedAt": "2022-07-10T20:56:01Z", "content": "Former MP and chairman of unorganised workers and employees Congress Dr Udit Raj addressed party workers in Ahmedabad Sunday where he emphasised on communicating with workers groups ahead of the Guja… [+698 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Sidelined by Cong, Bishnoi makes his next move clear, calls on Shah, Nadda", "description": "“It was a real honor and a pleasure to meet Mr @amitshah ji. A true statesman, I felt his aura and charisma in my interactions with him. His vision for India is awe-inspiring,” Bishnoi said in a tweet in Hindi.", "url": "https://indianexpress.com/article/india/sidelined-by-cong-bishnoi-makes-his-next-move-clear-calls-on-shah-nadda-8021406/", "urlToImage": "https://indianexpress.com/wp-content/themes/indianexpress/images/IE-OGimage.jpg", "publishedAt": "2022-07-10T20:51:05Z", "content": "A month after the Congress in Haryana removed Kuldeep Bishnoi from all party posts for cross-voting in the Rajya Sabha elections, the MLA from Adampur tweeted Sunday pictures of his meetings in New D… [+2891 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Gayathri Mani", "title": "Delhi: 2 underpasses on Mathura Road remain shut after inauguration", "description": "When asked about the closure, an official from ITPO — which helmed the redevelopment project — said, “The Pragati Maidan tunnel and five underpasses were opened to decongest traffic. This kind of a facility has been opened for the first time.", "url": "https://indianexpress.com/article/cities/delhi/delhi-2-underpasses-on-mathura-road-remain-shut-after-inauguration-8021411/", "urlToImage": "https://images.indianexpress.com/2022/07/cats-2.jpg", "publishedAt": "2022-07-10T20:49:40Z", "content": "Of the five underpasses part of Pragati Maidan Corridor project inaugurated by the Prime Minister on June 19, two on Mathura Road are yet to be opened to the public. According to the Public Works Dep… [+1843 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sukrita Baruah", "title": "1,000 applications pending for SC/ST/OBC scholarships, education dept pulled up", "description": "The Welfare department has found that there were 918 pending applications for reimbursement of private school tuition fees for 2021-2022. In the same year, there were 397 pending applications for the Pre-Matric Scholarship Scheme for SC and 20 for the Post-Ma…", "url": "https://indianexpress.com/article/cities/delhi/1000-applications-pending-for-sc-st-obc-scholarships-education-dept-pulled-up-8021408/", "urlToImage": "https://images.indianexpress.com/2022/02/exam-represent.jpg", "publishedAt": "2022-07-10T20:43:10Z", "content": "With more than 1,000 applications for various scholarships to Scheduled Castes, Scheduled Tribes, and Other Backward Classes students left pending after the end of the 2021-2022 financial year, the S… [+1451 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "CM performs ‘maha pooja’, seeks blessings to serve common man", "description": "Addressing a gathering later, Shinde said he would reveal his “experience of the last two and a half years” in the then MVA government at an appropriate time.", "url": "https://indianexpress.com/article/cities/mumbai/cm-performs-maha-pooja-seeks-blessings-to-serve-common-man-8021405/", "urlToImage": "https://images.indianexpress.com/2022/07/eknath-shinde-hindutva-1.jpg", "publishedAt": "2022-07-10T20:40:46Z", "content": "Maharashtra Chief Minister Eknath Shinde and his wife performed a maha pooja of Lord Vitthal and Goddess Rukmini at a famous temple in Pandharpur town on Sunday on the occasion of Ashadhi Ekadashi. T… [+1873 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shobhit Mahajan", "title": "Despite structural inequality, small acts of kindness have value", "description": "Our society is unequal and no amount of do-gooding will bring about any significant structural change. But that does not mean that one doesn’t do small acts which can bring a little joy.", "url": "https://indianexpress.com/article/opinion/columns/despite-structural-inequality-small-acts-of-kindness-have-value-8021318/", "urlToImage": "https://images.indianexpress.com/2022/07/helping-hand.jpg", "publishedAt": "2022-07-10T20:40:25Z", "content": "Panditji looked very worried. His eyes were searching the dense foliage which overhung the high wall and he was making sounds which one normally makes to summon an animal. In the end, he just gave up… [+4258 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aditi Nayar", "title": "An uncertain transition: As GST compensation ends, state governments need to be provided certainty of revenues", "description": "If the government decides to step-up tax devolution to the states in the near term, it may reduce the size of state borrowings in the second quarter and embolden states to ringfence their capital spending.", "url": "https://indianexpress.com/article/opinion/columns/an-uncertain-transition-as-gst-compensation-ends-state-governments-need-to-be-provided-certainty-of-revenues-8021329/", "urlToImage": "https://images.indianexpress.com/2022/06/gst-4.jpg", "publishedAt": "2022-07-10T20:40:04Z", "content": "The five-year transition period after the adoption of the Goods and Services Tax (GST) on July 1, 2017, came to an end on June 30, 2022. With this, the era of GST compensation that the state governme… [+4453 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Wife, ex-wife, daughter held for hiring shooter to kill DTC employee", "description": "DCP (Southeast) Esha Pandey said, “Najma told us that her husband died in a road accident in Govindpuri. She didn’t say anything about his gunshot injuries. On questioning, she said Kumar had a tiff with other DTC workers and some of them had threatened to sh…", "url": "https://indianexpress.com/article/cities/delhi/wife-ex-wife-daughter-held-for-hiring-shooter-to-kill-dtc-employee-8021404/", "urlToImage": "https://images.indianexpress.com/2022/03/dtc-bus-1200.jpg", "publishedAt": "2022-07-10T20:38:30Z", "content": "Days after a 45-year-old Delhi Transport Corporation employee was gunned down while heading home with his wife and 9-year-old son, police have arrested three people his wife, his ex-wife and her daug… [+2062 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Rain continues to elude Delhi, light showers on forecast", "description": "The city recorded a maximum temperature of 34.9 degrees Celsius, a degree below normal. The minimum was 27.5 degrees Celsius, normal for this time of the year.", "url": "https://indianexpress.com/article/cities/delhi/rain-continues-to-elude-delhi-light-showers-on-forecast-8021402/", "urlToImage": "https://images.indianexpress.com/2022/07/monsoon-3.jpg", "publishedAt": "2022-07-10T20:29:09Z", "content": "Delhi is likely to get only light or very light rain over the coming week, according to the India Meteorological Department. While the forecast for Sunday earlier was of moderate rain, it was later m… [+1255 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pavneet Singh Chadha", "title": "Hardlook: Revisiting Khori Gaon", "description": "In July last year, hundreds of homes were razed by the Municipal Corporation of Faridabad following a Supreme Court order to clear encroachments on forest land. The Indian Express visits the site a year later to find several people continuing to live in the b…", "url": "https://indianexpress.com/article/cities/delhi/hardlook-revisiting-khori-gaon-8021392/", "urlToImage": "https://images.indianexpress.com/2022/07/hardlook.jpg", "publishedAt": "2022-07-10T20:26:40Z", "content": "At Khori Gaon in Faridabad, Mohammad Hadish Ansari (46) sits on a makeshift bed under a tarpaulin while his wife cooks on a wood fire in a cramped corner covered by a tin shed. Every day, he cycles t… [+10122 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pavneet Singh Chadha", "title": "Hardlook: Revisiting Khori Gaon", "description": "In July last year, hundreds of homes were razed by the Municipal Corporation of Faridabad following a Supreme Court order to clear encroachments on forest land. The Indian Express visits the site a year later to find several people continuing to live in the b…", "url": "https://indianexpress.com/article/cities/bathinda/hardlook-revisiting-khori-gaon-8021392/", "urlToImage": "https://images.indianexpress.com/2022/07/hardlook.jpg", "publishedAt": "2022-07-10T20:26:40Z", "content": "At Khori Gaon in Faridabad, Mohammad Hadish Ansari (46) sits on a makeshift bed under a tarpaulin while his wife cooks on a wood fire in a cramped corner covered by a tin shed. Every day, he cycles t… [+10122 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Aarey unique forest; can’t destroy city’s biodiversity: Aaditya Thackeray", "description": "Calling Aarey “a unique forest within our city”, Aaditya Thackeray said, “(Former CM) Uddhav Thackeray ji declared 808 acres of Aarey as forest and the car shed must move out (of there).”", "url": "https://indianexpress.com/article/cities/mumbai/aarey-unique-forest-cant-destroy-citys-biodiversity-aaditya-thackeray-8021398/", "urlToImage": "https://images.indianexpress.com/2022/07/July10-BOM-AareyProtest03-4col.jpg", "publishedAt": "2022-07-10T20:24:08Z", "content": "Our human greed and lack of compassion cannot be allowed to destroy the biodiversity in our city, Shiv Sena leader and former state environment minister Aaditya Thackeray said on Sunday as he joined … [+660 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Omkar Gokhale", "title": "High Court seeks state’s response on action against ‘illegal’ nursing homes, hospitals", "description": "The petitioner, last week told the HC that the health department had not submitted the latest progress report on the probe and action taken by it against private nursing homes and hospitals, despite a finding that over 6,000 hospitals in the state were functi…", "url": "https://indianexpress.com/article/cities/mumbai/high-court-seeks-states-response-on-action-against-illegal-nursing-homes-hospitals-8021395/", "urlToImage": "https://images.indianexpress.com/2022/07/bombay-high-court-1200-1-1.jpg", "publishedAt": "2022-07-10T20:14:52Z", "content": "The Bombay High Court recently granted four weeks time to the state health department to file a report on action taken against illegal private nursing homes across the state that were found flouting … [+2063 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Yubaraj Ghimire", "title": "China keen to improve ties with India, Communist Party leader tells Nepal minister", "description": "Liu, who heads the Communist party's international department, also flagged the role of the United States in wake of a series of agreements between the US and Nepal in recent months, sources said.", "url": "https://indianexpress.com/article/world/china-keen-to-improve-ties-with-india-communist-party-leader-tells-nepal-minister-8021394/", "urlToImage": "https://indianexpress.com/wp-content/themes/indianexpress/images/IE-OGimage.jpg", "publishedAt": "2022-07-10T20:08:01Z", "content": "China is keen to improve its relationship with India as it will guarantee “an Asia free from outside interference”.The subtle message, The Indian Expres has learnt, was conveyed by a senior leader of… [+1040 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "MAYURA JANWALKAR", "title": "Amid talk of split in Goa Congress, party accuses senior leaders Lobo, Kamat of conspiring with BJP", "description": "", "url": "https://indianexpress.com/article/cities/goa/amid-talk-of-split-in-goa-congress-party-accuses-senior-leaders-lobo-kamat-of-conspiring-with-bjp-8021377/", "urlToImage": "https://indianexpress.com/wp-content/themes/indianexpress/images/IE-OGimage.jpg", "publishedAt": "2022-07-10T20:03:18Z", "content": "Amid high drama on Sunday, the Congress in Goa accused two of its senior leaders, Micheal Lobo and Digambar Kamat, of allegedly hobnobbing with the BJP and being part of a conspiracy hatched with the… [+6061 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Vallabh Ozarkar", "title": "Matoshree’s doors open for those who want to return; grassroots workers still with us: Aaditya Thackeray", "description": "While addressing party workers in Dahisar, Aaditya said the rebel legislators took advantage of former CM and Sena chief Uddhav Thackeray's illness and betrayed the party for their own “monstrous ambitions”.", "url": "https://indianexpress.com/article/cities/mumbai/matoshrees-doors-open-for-those-who-want-to-return-grassroots-workers-still-with-us-aaditya-8021391/", "urlToImage": "https://images.indianexpress.com/2022/07/Aaditya.jpg", "publishedAt": "2022-07-10T20:03:06Z", "content": "Former Maharashtra minister and Shiv Senas youth wing (Yuva Sena) president Aaditya Thackeray on Sunday said that the doors of Matoshree are open for legislators who wish to return, stressing that th… [+2138 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Would fight next polls under Maha Vikas Aghadi: Sharad Pawar", "description": "Speaking at a press conference in Aurangabad on Sunday, Pawar said it was his personal opinion that the elections must be held under the banner of the MVA, but he would have to consult his party colleagues and later, alliance partners Congress and the Shiv Se…", "url": "https://indianexpress.com/article/cities/mumbai/would-fight-next-polls-under-mva-sharad-pawar-8021388/", "urlToImage": "https://images.indianexpress.com/2022/07/pawar-5-1-1.jpg", "publishedAt": "2022-07-10T19:51:40Z", "content": "Nationalist Congress Party (NCP) patriarch and president Sharad Pawar has said he would like to fight the next elections under the aegis of the Maha Vikas Aghadi (MVA), the alliance of the Shiv Sena,… [+1286 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi Confidential: Travel Put Off", "description": "The fear over the monkey pox threat in San Francisco has caused disruptions in the proposed official visit of Rajeev Chandrasekhar, Minister of State for Skill Development and Entrepreneurship and Minister of State for Electronics and Information Technology.", "url": "https://indianexpress.com/article/cities/delhi/delhi-confidential-travel-put-off-8021387/", "urlToImage": "https://images.indianexpress.com/2022/07/delhi-confidential-1.jpg", "publishedAt": "2022-07-10T19:50:10Z", "content": "AFTER THE Covid pandemic, monkey pox fear is now ruining travel plans of ministers and officials, who had just resumed hectic activities in their respective ministries. The fear over the monkey pox t… [+2049 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sagar Rajput", "title": "Woman ‘dupes’ investment bank of Rs 3.5 cr, arrested", "description": "The woman, Manpreet Shahani, was apprehended from her house in Kandivali. Police said that Shahani was in charge of ordering gift vouchers on behalf of the company.", "url": "https://indianexpress.com/article/cities/mumbai/woman-dupes-investment-bank-of-rs-3-5-cr-arrested/", "urlToImage": "https://images.indianexpress.com/2022/07/arrest-2-7-5.jpeg", "publishedAt": "2022-07-10T19:42:59Z", "content": "THE POWAI police arrested a 40-year-old woman for allegedly duping a multinational investment bank and financial services company of Rs 3.5 crore. The woman, who worked with the company for 16 years … [+2644 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Peter Vidal", "title": "Horoscope Today, July 11, 2022: Gemini, Aries, Pisces and other signs — check astrological prediction", "description": "Leo - The benefits will arrive very soon when a close ally, perhaps a woman, intercedes with someone who has been trying to hold you back.", "url": "https://indianexpress.com/article/horoscope/horoscope-today-july-11-2022-gemini-aries-pisces-and-other-signs-check-astrological-prediction-8006482/", "urlToImage": "https://images.indianexpress.com/2022/07/horoscope_@.jpg", "publishedAt": "2022-07-10T19:30:32Z", "content": "You’ve been through a demanding phase, and you may imagine that certain cares now lie in the past. However, before you are finally free, you will have to face up to old troubles one more time, so tak… [+3426 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Divya Goyal", "title": "Mattewara textile park project passed during Cong govt: Warring says sorry", "description": "During the protest, PPCC chief Amrinder Singh Raja Warring tendered a apology during his speech as the project was approved during the previous Congress government when Captain Amarinder Singh was the chief minister in 2020.", "url": "https://indianexpress.com/article/cities/chandigarh/mattewara-textile-park-project-passed-during-cong-govt-warring-says-sorry/", "urlToImage": "https://images.indianexpress.com/2022/07/punjab-1.jpg", "publishedAt": "2022-07-10T19:25:55Z", "content": "Environmentalists, religious leaders, politicians, farmers, activists and the common people gathered at Sekhowal village near Mattewara forest on the banks of Sutlej river in Ludhiana, Sunday, under … [+3327 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Five-year-old dies after falling off 11th floor of Byculla building", "description": "According to the police, preliminary investigation has revealed that the boy, identified as Sahil Sheikh, was playing with an umbrella and leaning against a window when he allegedly lost balance and fell.", "url": "https://indianexpress.com/article/cities/mumbai/five-year-old-dies-after-falling-off-11th-floor-of-byculla-building-8021376/", "urlToImage": "https://images.indianexpress.com/2022/07/Express-logo.jpg", "publishedAt": "2022-07-10T19:23:50Z", "content": "A five-year-old boy died after falling from an eleventh floor of a residential building in Byculla. The police said the incident took place in Janta housing society around 10am on Sunday.According to… [+533 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "PM invokes Goddess Kali, Mahua hits back at him", "description": "CPM and Cong also slam Modi for invoking religion, say: ‘PM should talk about Constitution and welfare of people instead’", "url": "https://indianexpress.com/article/india/pm-invokes-goddess-kali-mahua-hits-back-at-him-8021364/", "urlToImage": "https://images.indianexpress.com/2022/07/Mahua-Moitra-Sunday-Profile-illustration-2.jpg", "publishedAt": "2022-07-10T19:20:59Z", "content": "Amid the controversy surrounding Trinamool Congress MP Mahua Moitras remarks on a film poster featuring Goddess Kali, Prime Minister Narendra Modi on Sunday invoked the Hindu deity during a speech at… [+3078 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sanjana Bhalerao", "title": "Mumbai receives 70% of average July rainfall in first 6 days of month", "description": "Last year, Mumbai recorded 70 per cent of the average July rainfall in the first 16 days. In comparison, this year, the city received 70 per cent of the July rainfall in the first six days of the month.", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-receives-70-of-average-july-rainfall-in-first-6-days-of-month-8021373/", "urlToImage": "https://images.indianexpress.com/2022/07/July10-BOM-Rain05-5col.jpg", "publishedAt": "2022-07-10T19:19:50Z", "content": "Following the downpour from July 1, the citys average rainfall in July was 40.9 mm short of the average 855.7 mm as of Sunday. From July 1, the city recorded 814.8 mm of rainfall.Last year, Mumbai re… [+1841 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "388 roads closed in Gujarat due to heavy rain; over 3,000 evacuated", "description": "Chief Minister Bhupendra Patel who reached Gandhinagar from Rajkot took stock of the situation even as teams from the National Disaster Response Force (NDRF) and State Disaster Response Force (SDRF) were deployed for rescue and relief operations.", "url": "https://indianexpress.com/article/cities/ahmedabad/388-roads-closed-in-gujarat-due-to-heavy-rain-over-3000-evacuated-8021370/", "urlToImage": "https://images.indianexpress.com/2022/07/rainfall-1.jpg", "publishedAt": "2022-07-10T19:07:47Z", "content": "As many as 388 roads, including state and panchayat highways and other roads, across the state were shut due to heavy rain on Sunday, while over 3,000 persons were evacuated from different districts … [+3963 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Hearing devices given to children", "description": "Sonalben Shah, wife of Union Home & Cooperation Minister Amit Shah, who was the chief guest of the event, said, “It is much appreciated that ‘We Hear’ devices are given by the Society to help children hear with bone conduction. This helps many children to hea…", "url": "https://indianexpress.com/article/cities/ahmedabad/hearing-devices-given-to-children-8021366/", "urlToImage": "https://images.indianexpress.com/2022/07/KIDS-1.jpg", "publishedAt": "2022-07-10T18:58:30Z", "content": "Children with hearing issues in Ahmedabad were provided with hearing devices, under an initiative by a local start-up, We Hear, on Sunday at an event held by the Indian Red Cross Society (IRCS).\r\nSon… [+513 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Namit Kumar", "title": "Depth of return and clutch play: Novak Djokovic trumps Nick Kyrgios’ serve-reliant game to win 7th Wimbledon crown", "description": "Depth of return and clutch play: Novak Djokovic trumps Nick Kyrgios’ serve-reliant game to win seventh Wimbledon crown.", "url": "https://indianexpress.com/article/sports/tennis/depth-of-return-and-clutch-play-novak-djokovic-trumps-nick-kyrgios-serve-reliant-game-to-win-seventh-wimbledon-crown-8021362/", "urlToImage": "https://images.indianexpress.com/2022/07/Djoko-Kyrgios-1.jpg", "publishedAt": "2022-07-10T18:56:06Z", "content": "An aggressive return strategy and subtle adjustments to his baseline game allowed Novak Djokovic to pick up a seventh Wimbledon title, this time against Nick Kyrgios on Sunday. The Serbs well-rounded… [+3350 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Eid: Sweets exchanged on border", "description": "As per a statement released by the BSF Gujarat Frontier on Sunday, “BSF & Pakistan Rangers exchange sweets as a goodwill gesture on various festivals and days of national importance.\"", "url": "https://indianexpress.com/article/cities/ahmedabad/eid-sweets-exchanged-on-border-8021360/", "urlToImage": "https://images.indianexpress.com/2022/07/Guj-sweets-4col.jpg", "publishedAt": "2022-07-10T18:52:30Z", "content": "On the occasion of Eid-al-Adha, the Border Security Force (Gujarat Frontier) officers exchanged sweets and greetings with Pakistani Rangers on the Indo-Pak international borders in Gujarat and Barmer… [+588 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Gopal Kateshiya", "title": "Bhupendra Patel: Pause and look back to ascertain state’s progress", "description": "Addressing a public meeting after laying the foundation stone of Som Pipaliya minor irrigation scheme in nearby Godladhar village in Vinchhiya taluka of Rajkot district, the CM said, “Many a times, we don’t know how far have progressed... we can ascertain how…", "url": "https://indianexpress.com/article/cities/rajkot/bhupendra-patel-pause-and-look-back-to-ascertain-states-progress-8021355/", "urlToImage": "https://images.indianexpress.com/2022/07/Guj-CM-4col.jpg", "publishedAt": "2022-07-10T18:46:12Z", "content": "ONE NEEDS to pause and look back to ascertain progress, Chief Minister Bhupendra Patel said Sunday while claiming that under the Bharatiya Janata Party (BJP) regime, the state has made remarkable pro… [+2836 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sandip G", "title": "India vs England 3rd T20I: Surya shines in defeat", "description": "Yadav’s mesmerising ton can’t get India over the line, as England register consolation win in high-scoring game.", "url": "https://indianexpress.com/article/sports/cricket/india-vs-england-3rd-t20i-surya-shines-in-defeat-8021353/", "urlToImage": "https://images.indianexpress.com/2022/07/SKY-4.jpg", "publishedAt": "2022-07-10T18:44:55Z", "content": "Soaked in sweat and applause, Suryakumar Yadav walked off the ground as a tragic hero. Just when the elusive shores of victory drew closer, the man who had anchored the ship towards the sands drowned… [+5746 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Atri Mitra", "title": "Babul appointed TMC national spokesperson, thanks Mamata & Abhishek", "description": "Party sources said leadership rehabilitated him ahead of 2024 Lok Sabha polls", "url": "https://indianexpress.com/article/cities/kolkata/babul-appointed-tmc-national-spokesperson-thanks-mamata-abhishek-8021349/", "urlToImage": "https://indianexpress.com/wp-content/themes/indianexpress/images/IE-OGimage.jpg", "publishedAt": "2022-07-10T18:38:07Z", "content": "inger-turned politician Babul Supriyo, who recently joined Trinamool Congress, has been appointed the partys national spokesperson.In a tweet, the former BJP leader thanked TMC chief Mamata Banerjee … [+2992 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Ludhiana: Burglars steal gold worth Rs 20 lakh from house", "description": "The SHO added that an FIR under Sections 457 (house-trespass) and 380 (theft) of the IPC has been lodged against unidentified persons. The police are still trying to identify the accused.", "url": "https://indianexpress.com/article/cities/chandigarh/ludhiana-burglars-steal-gold-worth-rs-20-lakh-from-house-8021354/", "urlToImage": "https://images.indianexpress.com/2022/07/Indian-express-logo-1-17.jpeg", "publishedAt": "2022-07-10T18:36:27Z", "content": "A gang of burglars targeted the house of Kanwalpreet Singh, a resident of Ranjit Singh Nagar, Ludhiana, and stole gold jewellery worth at least Rs 20 lakh early on Sunday morning. At the time of the … [+1060 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Diu local body polls: BJP wins all 13 seats", "description": "Three Congress turncoats were also among the six BJP candidates declared winners unopposed last month while Harshida Solanki, the daughter-in-law of former Congress member Bhagyavanti Solanki, was also declared an unopposed winner.", "url": "https://indianexpress.com/article/cities/rajkot/diu-local-body-polls-bjp-wins-all-13-seats-8021348/", "urlToImage": "https://images.indianexpress.com/2022/07/bjp-1.jpeg", "publishedAt": "2022-07-10T18:35:42Z", "content": "The Bharatiya Janata Party (BJP) returned to power in the Diu Municipal Council (DMC) Saturday as the party swept all the 13 seats of the civic body in a poll in which the ruling Congress failed to f… [+2241 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "Ajker Rashifal Bengali, 11 July 2022: প্রেম ভাঙবে এই রাশির জাতকদের, পড়ুন রাশিফল", "description": "আজকের রাশিফল ১১ই জুলাই- জানুন কী আছে ভাগ্যে?", "url": "https://bengali.indianexpress.com/horoscope/ajker-rashifal-july-11-2022-aries-taurus-gemini-cancer-leo-virgo-libra-scorpio-sagittarius-capricorn-aquarius-pisces-467686/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/monday.jpg", "publishedAt": "2022-07-10T18:35:00Z", "content": "/ Aries  Rashifal ( March 21 – April 20 )\r\n/ Taurus  Rashifal ( April 21 – May 21 )\r\n/ Gemini  Rashifal ( May 22 – June 21 )\r\n/ Cancer Rashifal  ( June 22 – July 23 )\r\n/ Leo   Rashifal  ( July 24 – A… [+312 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Jewellery shop robbery: Four including TADA accused arrested", "description": "Daljeet Singh has five FIRs registered against him, including theft, snatching and robbery. Rohit is a pharmacist who was known to Daljeet. Rohit needed money to pay the EMI for his car, for which he agreed to the robbery.", "url": "https://indianexpress.com/article/cities/chandigarh/jewellery-shop-robbery-four-including-tada-accused-arrested-8021351/", "urlToImage": "https://images.indianexpress.com/2022/07/Indian-express-logo-1-17.jpeg", "publishedAt": "2022-07-10T18:34:24Z", "content": "Three days after robbers struck a jewellery shop and stole cash and jewellery at gunpoint in Gobindgarh village near Jugiana railway crossing, Ludhiana, police arrested the accused including one who … [+1654 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Krishna Khaitan Memorial badminton: Unnati progresses; Shettigar shocks top seed Pranav Gandham", "description": "Hooda, already a winner of a senior title in Orissa, is expected to fight for the title, though other seeded rivals also advanced on the day.", "url": "https://indianexpress.com/article/sports/badminton/krishna-khaitan-memorial-badminton-unnati-progresses-shettigar-shocks-top-seed-pranav-gandham-8021344/", "urlToImage": "https://images.indianexpress.com/2022/07/Badminton-1200.jpg", "publishedAt": "2022-07-10T18:19:54Z", "content": "Haryanas highly-rated Unnati Hooda, seeded fifth at the countrys premier junior tournament, Krishna Khaitan Memorial, was ruthless in beating Andhra Pradeshs Durga Isha Kandrapu 21-13, 21-9 in the Ro… [+2709 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Avinash Nair", "title": "Prime Minister to inaugurate Phase I of Ahmedabad Metro in August this year", "description": "Despite its commissioning in August, the 40-kilometre Phase-1 that will criss-cross Ahmedabad will remain incomplete as three metro stations and a 1.4-kilometre route are scheduled to be completed only by January-March 2023.", "url": "https://indianexpress.com/article/cities/ahmedabad/prime-minister-to-inaugurate-phase-i-of-ahmedabad-metro-in-august-this-year-8021341/", "urlToImage": "https://images.indianexpress.com/2022/07/metro.jpg", "publishedAt": "2022-07-10T18:17:37Z", "content": "Twenty years after conceptualisation, multiple route changes and successive cost escalations, cases of irregularities and consequent change of guard, the Phase-I of Ahmedabad Metro is nearing complet… [+10175 chars]"}]}