{"status": "ok", "totalResults": 770, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Raakhi Jagga", "title": "Row over paddy sowing dates: Talks with minister fail, farmers to begin ‘Chandigarh morcha’ May 17", "description": "Earlier on May 8, sixteen farmers' bodies had rejected the electricity supply schedule for the upcoming paddy sowing season issued by the state government and had asserted that they would start transplanting paddy plants from June 10.", "url": "https://indianexpress.com/article/cities/ludhiana/row-over-paddy-sowing-dates-talks-with-minister-fail-farmers-to-begin-chandigarh-morcha-may-17-7910557/", "urlToImage": "https://images.indianexpress.com/2022/02/paddy-1.jpg", "publishedAt": "2022-05-10T22:49:34Z", "content": "Farmers unions on Tuesday announced a pakka morcha in Chandigarh to protest against the paddy sowing schedule announced by the Punjab government. The dharna, set to begin from May 17, was announced a… [+2454 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Construction cost escalates, RMC to penalise design consultant", "description": "The expense was incurred due to change in design and escalation of prices of material but the civic body has recommended penal action against the design consultant of the project.", "url": "https://indianexpress.com/article/cities/rajkot/construction-cost-escalates-rmc-to-penalise-design-consultant-7910560/", "urlToImage": "https://images.indianexpress.com/2020/02/Rajkot-Municipal-Corporation-1200.jpg", "publishedAt": "2022-05-10T22:42:16Z", "content": "THE STANDING committee of the Rajkot Municipal Corporation (RMC) Tuesday approved to pay an additional Rs 25 crore to the contractor involved in the construction of a flyover bridge at Civil Hospital… [+2570 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Rajasthan Police book Punjab cops for abduction after they arrest Kota man in drug case", "description": "The policemen were booked at Kota's Kunharhi Police Station following a local court's order, issued after it heard the petition of Nirmal Singh, the father of the allegedly abducted man.", "url": "https://indianexpress.com/article/cities/jalandhar/rajasthan-police-book-punjab-cops-for-abduction-after-they-arrest-kota-man-in-drug-case-7910558/", "urlToImage": "https://images.indianexpress.com/2022/05/chandigarh-cops.jpg", "publishedAt": "2022-05-10T22:40:12Z", "content": "The Rajasthan Police has booked 14 policemen from Hoshiarpur, including a DSP and an SHO, for allegedly abducting a 21-year-old Kota man in a drug case, the development coming days after Delhi Police… [+3303 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Serivce", "title": "Four booked for ‘beating woman to death’ in Anand", "description": "According to police, Baluben Solanki, a resident of Borsad town, was killed around 11 pm Monday in Indira colony society in Borsad.", "url": "https://indianexpress.com/article/cities/ahmedabad/four-booked-for-beating-woman-to-death-in-anand-7910556/", "urlToImage": "https://images.indianexpress.com/2022/05/arrest-1.jpeg", "publishedAt": "2022-05-10T22:37:56Z", "content": "Four persons were booked Tuesday for allegedly killing a 60-year-old woman in Borsad town of Anand, police said.According to police, Baluben Solanki, a resident of Borsad town, was killed around 11 p… [+1012 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Ahead of Cong’s Chintin Shivir, Bhupinder Singh Hooda meets Yogendra Yadav to discuss farmers’ issues", "description": "Hooda is holding these meeting to prepare an agenda paper on “upliftment of farmers and agriculture” for Congress's “Nav Sankalp Chintan Shivir” to be held in Udaipur from May 13 till May 15.", "url": "https://indianexpress.com/article/cities/chandigarh/ahead-of-congs-chintin-shivir-bhupinder-singh-hooda-meets-yogendra-yadav-to-discuss-farmers-issues-7910386/", "urlToImage": "https://images.indianexpress.com/2022/04/hooda-1.jpeg", "publishedAt": "2022-05-10T22:34:05Z", "content": "Haryana’s Leader of Opposition and former CM Bhupinder Singh Hooda Tuesday met Swaraj Abhiyan leader Yogendra Yadav in his ongoing series of meetings with farmer leaders ahead of Congress’s Chintin S… [+1435 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Amitabh Kundu, P C Mohanan", "title": "Why there’s no agreement on India’s Covid death figures", "description": "In the absence of robust data on deaths due to the pandemic, claims and counterclaims will continue", "url": "https://indianexpress.com/article/opinion/columns/india-covid-death-figures-crs-who-7910407/", "urlToImage": "https://images.indianexpress.com/2021/09/funeral.jpg", "publishedAt": "2022-05-10T22:30:50Z", "content": "With the images from the Covid pandemic, of burning pyres and floating bodies, still fresh in our minds, the current debate on the magnitude of mortality during 2020 and 2021 looks surreal and unsymp… [+6045 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Peter Vidal", "title": "Horoscope Today, May 11, 2022: Libra, Aries, Pisces and other signs — check astrological prediction", "description": "Horoscope Today, May 11, 2022: Taurus, this is a day to accept that your instincts are correct and that logic and reason may in fact be unreliable guides to healthy living.", "url": "https://indianexpress.com/article/horoscope/horoscope-today-may-11-2022-libra-aries-pisces-and-other-signs-check-astrological-prediction/", "urlToImage": "https://images.indianexpress.com/2022/05/HOROROR.jpg", "publishedAt": "2022-05-10T22:30:50Z", "content": "In spite of your best efforts and most carefully-laid plans, domestic affairs seem determined to follow their own independent course. Don’t be distracted, though, as in the long run you’re on the rig… [+3424 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Avijit Pathak", "title": "How Jiddu Krishnamurthy’s thoughts offer an antidote to violence of everyday life", "description": "As we experience violence in the name of religious nationalism, or violence in the name of education, Krishnamurti’s books and talks tend to acquire a new meaning and significance", "url": "https://indianexpress.com/article/opinion/columns/jiddu-krishnamurti-philosophy-everyday-life-conflicts-7910450/", "urlToImage": "https://images.indianexpress.com/2022/05/Jiddu_Krishnamurti.jpg", "publishedAt": "2022-05-10T22:30:49Z", "content": "I never belonged to the exclusivist camp of the followers of Jiddu Krishnamurti; nor did I learn the meaning of studentship from an institution that claims to follow his radical ideas of education. Y… [+4344 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "George Mathew", "title": "Life insurance firms settled 2.2 lakh Covid death claims: Regulator data", "description": "Compensation towards Covid death claims were reported under individual, group policies and the PM Jeevan Jyoti Bima Yojana (PMJJBY). Back-of-the-envelope calculations indicate that the average claim per person was Rs 7,63,965.", "url": "https://indianexpress.com/article/express-exclusive/life-insurance-firms-settled-2-2-lakh-covid-death-claims-regulator-data-7910484/", "urlToImage": "https://images.indianexpress.com/2021/12/covid-death-1.jpg", "publishedAt": "2022-05-10T22:30:38Z", "content": "Life insurance companies settled 2,27,268 Covid death claims, paying Rs 17,362.48 crore since the pandemic hit the country in March 2020, according to data obtained by The Indian Express through a Ri… [+5174 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aditi Nayar", "title": "Equating states’ off-budget borrowings with their debt will clarify extent of indebtedness", "description": "Centre's decision will ensure fiscal transparency in states' finances, an area that has been cloaked in opacity.", "url": "https://indianexpress.com/article/opinion/columns/states-off-budget-borrowings-indebtedness-7910420/", "urlToImage": "https://images.indianexpress.com/2022/04/nirmala-sitharaman-1200.jpg", "publishedAt": "2022-05-10T22:30:33Z", "content": "At the beginning of every year, the Union government communicates to state governments how much they are allowed to borrow (their net borrowing ceiling). Normally, this is a routine affair. But this … [+4354 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Divya A", "title": "Explained: When prayers are allowed, not allowed at protected archaeological sites", "description": "The ASI, which functions under the Ministry of Culture, is the custodian of the protected monument. It deemed the incident to be a violation of its rules. A look at the ASI rules that disallow worship at some monuments under its purview, and why religious rit…", "url": "https://indianexpress.com/article/explained/when-prayers-are-allowed-not-allowed-at-protected-archaeological-sites-martand-sun-temple-in-jammu-and-kashmir-7910452/", "urlToImage": "https://images.indianexpress.com/2022/05/sinha-1.jpg", "publishedAt": "2022-05-10T22:30:19Z", "content": "After prayers were held at the ruins of the eighth-century Martand Sun Temple in Jammu and Kashmirs Anantnag last week, the Archaeological Survey of India (ASI) has expressed its concern to the distr… [+4419 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Over half of India’s population is still under age 30, slight dip in last 5 years", "description": "The age pyramid shows India’s population is young, which, NFHS-5 notes, is typical of developing countries with low life expectancy. The pyramid also shows that fertility has decreased considerably in the last 5 years, it says.", "url": "https://indianexpress.com/article/explained/half-indias-population-under-age-30-nfhs-explained-7910458/", "urlToImage": "https://images.indianexpress.com/2021/12/jobs-2.jpg", "publishedAt": "2022-05-10T22:30:16Z", "content": "Indias population remains young, with more than one-fourth aged under 15 years and less than an eighth over 60. There has been only a slight dip in the young populations share in the last five years:… [+1300 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "Colombo storm", "description": "The events of the last few days have revealed the scale and intensity of the public anger against the Rajapaksas.", "url": "https://indianexpress.com/article/opinion/editorials/colombo-storm-7910434/", "urlToImage": "https://images.indianexpress.com/2022/05/editorial-1-6.jpeg", "publishedAt": "2022-05-10T22:30:11Z", "content": "The crisis in Sri Lanka has turned for the worse, with civic unrest in Colombo turning violent and spreading to the rest of the island nation. On Monday, President Gotabaya Rajapaksa got his brother,… [+2608 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kiran Rathee", "title": "‘Third-party content: Social media cos may face more legal scrutiny’", "description": "A new law — Digital India Act — is in works, which would incorporate all aspects covering cyber security, social media, digital services, personal data protection, etc, sources in the government said.", "url": "https://indianexpress.com/article/cities/delhi/third-party-content-social-media-cos-may-face-more-legal-scrutiny-7910477/", "urlToImage": "https://images.indianexpress.com/2022/05/Social-media-1-1.jpg", "publishedAt": "2022-05-10T22:30:10Z", "content": "For social media firms like Twitter, Facebook, Google, WhatsApp, and over-the-top (OTT) players like Netflix, Amazon, etc, the government plans to further tighten intermediary guidelines in such a ma… [+1601 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Navjeevan Gopal, Jagdeep Singh Deep", "title": "‘Pak-based gangster’ is key suspect in Mohali ‘terror’ attack", "description": "Mohali Police said the launcher used for the attack was found but did not provide further details. “It is definitely a terror attack,” a senior police officer told The Indian Express.", "url": "https://indianexpress.com/article/cities/chandigarh/pak-based-gangster-is-key-suspect-in-mohali-terror-attack-7910475/", "urlToImage": "https://images.indianexpress.com/2022/05/Mohali-terror-attack.jpg", "publishedAt": "2022-05-10T22:30:10Z", "content": "Preliminary investigations indicate that the attack on Punjab Polices Intelligence headquarters in Mohali was allegedly orchestrated by a wanted gangster, Harvinder Singh alias Rinda, who is believed… [+4934 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Udit Misra", "title": "Explained: Making sense of exchange rate", "description": "The rupee’s exchange rate vis-a-vis a particular currency, say the US dollar, tells us how many rupees are required to buy a US dollar.", "url": "https://indianexpress.com/article/explained/explained-making-sense-of-exchange-rate-7910455/", "urlToImage": "https://images.indianexpress.com/2022/05/unnamed-1.jpg", "publishedAt": "2022-05-10T22:30:01Z", "content": "On Monday, during intra-day trade, the Indian rupee hit an all-time low exchange rate of 77.6 against the US dollar. At the time of going to print, it was 77.20 to a dollar. The previous lowest was 7… [+6207 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pranav Mukul", "title": "IndiGo row: DGCA probe team to look at operational and legal norms", "description": "\"Specifically, the applicability of the regulation detailing requirements for carriage of persons with disability or persons with reduced mobility will be studied,\" said the official.", "url": "https://indianexpress.com/article/cities/ahmedabad/dgca-probe-team-to-look-at-operational-and-legal-norms-7910554/", "urlToImage": "https://images.indianexpress.com/2021/08/airport-6.jpg", "publishedAt": "2022-05-10T22:29:38Z", "content": "THE three-member team deputed by the Directorate General of Civil Aviation (DGCA) to probe Saturday’s incident at the Ranchi airport, where IndiGo staff allegedly denied boarding to a specially-abled… [+2912 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Serivce", "title": "One Station One Product: After receiving positive response, Railways set to launch fourth spell", "description": "The ‘One Station One Product’ scheme aims at providing opportunities to local artisans, potters, weavers/ handloom weavers, craftsmen, etc.", "url": "https://indianexpress.com/article/cities/chandigarh/one-station-one-product-after-receiving-positive-response-railways-set-to-launch-fourth-spell-7910552/", "urlToImage": "https://images.indianexpress.com/2022/05/ch1388348.jpg", "publishedAt": "2022-05-10T22:27:23Z", "content": "Encouraged by the positive response from rail passengers to the One Station One Product scheme and the Vocal for Local programme aimed to popularize wooden carving products at the stations, the Railw… [+928 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gujarat should record 14.5 pc growth for India to hit USD 5-tn target: Report", "description": "The report which entails a roadmap for the state was prepared in three months by a task force headed by former finance secretary and Gujarat cadre bureaucrat Hasmukh Adhia.", "url": "https://indianexpress.com/article/cities/ahmedabad/gujarat-should-record-14-5-pc-growth-for-india-to-hit-usd-5-tn-target-report-7910550/", "urlToImage": "https://images.indianexpress.com/2022/04/rupee-pixabay-1200-1.jpg", "publishedAt": "2022-05-10T22:24:28Z", "content": "Gujarat will have to record a Compound Annual Growth Rate (CAGR) of 14.5 per cent for the next five years to ensure that India becomes a USD five trillion economy by 2026-27, stated a report handed o… [+1408 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "For art’s sake: Chandigarh Lalit Kala Akademi to award two printmakers etching machines", "description": "The CLKA had recently introduced Open Hand Scholarships and Awards (2021-22), with two printmaking machines as the first two awards. The competition was open to printmakers from across the country, and the CLKA received an overwhelming response to the scholar…", "url": "https://indianexpress.com/article/cities/chandigarh/for-arts-sake-chandigarh-lalit-kala-akademi-to-award-two-printmakers-etching-machines-7910549/", "urlToImage": "https://images.indianexpress.com/2022/05/NL-exhibition-3col.jpg", "publishedAt": "2022-05-10T22:23:35Z", "content": "IN an effort to encourage artists to pursue their creative pursuits and support them, the Chandigarh Lalit Kala Akademi (CLKA) has introduced several initiatives like scholarships, awards, trips to m… [+2567 chars]"}]}