{"status": "ok", "totalResults": 504, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "‘I have a place that’s mine’: Toni Morrison on the lesson she learnt at 80", "description": "\"I know that what is alive for me, and I have a place that is mine. That's my work.\"", "url": "https://indianexpress.com/article/lifestyle/life-positive/i-have-a-place-thats-mine-toni-morrison-on-the-lesson-she-learnt-at-80-7878824/", "urlToImage": "https://images.indianexpress.com/2022/04/2048px-Toni_Morrison_2008.jpg", "publishedAt": "2022-05-20T02:50:18Z", "content": "One of the most celebrated authors in the world, Toni Morrison‘s words have inspired countless people across the globe.Morrison wrote plays and childrens books but it was her novels that earned her c… [+1136 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Several trapped as under-construction tunnel on Jammu-Srinagar highway collapses", "description": "Those trapped inside the tunnel belong to the company conducting the auditing work of the tunnel at Khoni Nallah in Ramban district.", "url": "https://indianexpress.com/article/cities/jammu/jammu-and-kashmir-tunnel-collapse-ramban-live-updates-7926942/", "urlToImage": "https://images.indianexpress.com/2022/05/Kashmir-tunnel-collapse.jpg", "publishedAt": "2022-05-20T02:39:31Z", "content": "A portion of an under-construction tunnel at Khoni Nallah on the Jammu-Srinagar national highway in Ramban district collapsed on Thursday night, injuring four people and trapping at least seven.An un… [+1141 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Congress holds silent protest against Perarivalan’s release, BJP slams rival for ‘double standards’", "description": "The Congress party said its stand against AG Perarivalan's release and key ally DMK supporting it would not affect ties between the 2 partners.", "url": "https://indianexpress.com/article/cities/chennai/tamil-nadu-congress-protest-perarivalan-release-rajiv-gandhi-assassination-7926940/", "urlToImage": "https://images.indianexpress.com/2022/05/Congress-TN.jpg", "publishedAt": "2022-05-20T02:38:36Z", "content": "Opposing the release of Rajiv Gandhi assassination case convicts, the Tamil Nadu Congress Committee (TNCC) on Thursday held silent protest in several parts of the state while the BJP accused the gran… [+6168 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Monkeypox: Canada confirms first two cases; Australia reports probable case", "description": "Monkeypox, which mostly occurs in west and central Africa, is a rare viral infection similar to human smallpox, though milder.", "url": "https://indianexpress.com/article/world/monkeypox-cases-canada-australia-7926939/", "urlToImage": "https://images.indianexpress.com/2022/05/hospital-1200.jpg", "publishedAt": "2022-05-20T02:35:00Z", "content": "Canada’s public health agency Thursday confirmed the first two cases of monkeypox virus infections in the country after authorities in Quebec province said they were investigating 17 suspected cases.… [+1775 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Gabbeta Ranjith Kumar", "title": "Jr NTR turns 39: Telugu celebrities recall their association with RRR star", "description": "Happy birthday Jr NTR: Telugu celebrities share their thoughts about Jr NTR as an actor as well as a person.", "url": "https://indianexpress.com/article/entertainment/telugu/happy-birthday-jr-ntr-telugu-film-celebrities-recall-their-association-with-rrr-star-7925211/", "urlToImage": "https://images.indianexpress.com/2022/05/Jr-NTR-1200by667.jpeg", "publishedAt": "2022-05-20T02:30:22Z", "content": "Jr NTR aka Tarak, who is basking in the success of RRR, is celebrating his 39th birthday today. Having entered the film industry as the grandson of legendary actor Nandamuri Taraka Ramarao in 2001 wi… [+3774 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Arun Sharma", "title": "Nirmal Singh interview: ‘After Rahul Bhat’s killing, Kashmiris hit roads to protest it… this is a ray of hope… Assembly polls may be held by Oct-Dec’", "description": "The Jammu and Kashmir unit of the BJP feels that apart from the government’s protective measures for the migrant community, their permanent return to their homes in the Valley will be possible only when the local majority community also comes out in their sup…", "url": "https://indianexpress.com/article/india/political-pulse/nirmal-singh-interview-jammu-and-kashmir-migrants-kashmiri-pandits-elections-7926935/", "urlToImage": "https://images.indianexpress.com/2022/05/Nirmal-Singh-1.jpg", "publishedAt": "2022-05-20T02:24:45Z", "content": "Amid the outrage over the recent killing of a migrant Kashmiri Pandit government employee, Rahul Bhat, by militants in central Kashmirs Budgam district, the Jammu and Kashmir unit of the Bharatiya Ja… [+12369 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Tamil Nadu CM MK Stalin opens exhibition on archaeological findings in state", "description": "The seven-day exhibition at the VOC grounds in Coimbatore titled 'Porunai' will be open to students and public.", "url": "https://indianexpress.com/article/cities/chennai/tamil-nadu-cm-mk-stalin-opens-exhibition-on-archaeological-findings-in-state-7926917/", "urlToImage": "https://images.indianexpress.com/2022/05/Stalin-9.jpg", "publishedAt": "2022-05-20T02:05:14Z", "content": "Organised by Archeological department, the exhibition has findings and excavations related to riverside culture of Vaigai and Tamirabharani at Keeladi and Porunai, Sangam age industry in Kodumanal, w… [+597 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rahel Philipose, Sonal Gupta", "title": "Daily Briefing: Debris of old temples, Hindu motifs found in Gyanvapi mosque, says survey report; ISRO to conduct ‘abort missions’", "description": "From the row over Varanasi and Mathura mosques to the latest from the Cannes Film Festival, here are the top reads from today’s edition.", "url": "https://indianexpress.com/article/live-news/top-news-briefing-today-7926927/", "urlToImage": "https://images.indianexpress.com/2022/05/Express-intro-11.jpg", "publishedAt": "2022-05-20T02:01:41Z", "content": "The Big Story\r\nIn claims likely to deepen the Kashi Vishwanath-Gyanvapi row, two reports submitted to the Varanasi court on a videography survey of the mosque complex state that debris of old temples… [+4776 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "James D’Arcy joins the cast of Apple TV+ series Constellation", "description": "James D'Arcy joins previously announced cast Noomi Rapace and Jonathan Banks in Constellation series.", "url": "https://indianexpress.com/article/entertainment/web-series/apple-tv-series-constellation-adds-james-darcy-to-cast-7926005/", "urlToImage": "https://images.indianexpress.com/2022/05/James-DArcy-1200by667.jpg", "publishedAt": "2022-05-20T01:30:14Z", "content": "Six Minutes to Midnight actor James D’Arcy is set to star in the upcoming Apple TV+ series Constellation.He joins previously announced cast Noomi Rapace and Jonathan Banks in the eight-episode conspi… [+842 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Peter Vidal", "title": "Horoscope Today, May 20, 2022: Gemini, Aries, Pisces and other signs — check astrological prediction", "description": "Aquarius-- The time has come to make monetary reward the main priority at work. There is no reason why you should be so idealistic as to give up the chance of the pleasure and prosperity that are yours by right. After all, you can't survive on goodwill and yo…", "url": "https://indianexpress.com/article/horoscope/horoscope-today-may-20-2022-gemini-aries-pisces-and-other-signs-check-astrological-prediction-7926903/", "urlToImage": "https://images.indianexpress.com/2022/05/horoscope-1.jpg", "publishedAt": "2022-05-20T01:11:33Z", "content": "Whats on the cards today for you?Read detailed astrological predictions by western astrologer Peter Vidal below.ARIES (Mar 21 – Apr. 20)Charitable giving is the order of the day. Somehow, in some way… [+3524 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Panvel food stall owner arrested for social media post on Pawar", "description": "According to police, after Marathi actor Ketaki Chitale posted an alleged defamatory post about Pawar on Facebook earlier this month, a similar post was shared by Inamdar on social media.", "url": "https://indianexpress.com/article/cities/mumbai/panvel-food-stall-owner-arrested-for-social-media-post-on-pawar-7926894/", "urlToImage": "https://images.indianexpress.com/2022/05/arresttt-1.jpg", "publishedAt": "2022-05-19T23:52:22Z", "content": "THE PANVEL City Police on Wednesday night arrested a 34-year-old man for allegedly posting objectionable comments on social media against Nationalist Congress Party (NCP) chief Sharad Pawar. This is … [+1921 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Cong organisation: New panel to suggest changes", "description": "Addressing the Congress' Chintan Shivir for Saurashtra zone in Rajkot on Thursday, AICC Gujarat in-charge Raghu Sharma announced formation of a committee to strengthen the party-organisation at grassroots levels.", "url": "https://indianexpress.com/article/cities/rajkot/cong-organisation-new-panel-to-suggest-changes-gujarat-congress-chintan-shivir-7926888/", "urlToImage": "https://images.indianexpress.com/2022/05/Congress-leaders-at-the-Chintan-Shivir.jpg", "publishedAt": "2022-05-19T23:46:12Z", "content": "All India Congress Committee (AICC) incharge of Gujarat Raghu Sharma on Thursday announced a seven-member committee to suggest changes in the partys organisation at lower levels and said that it will… [+2904 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Two policemen electrocuted on paddy field", "description": "Police sources said two local persons were taken into custody for alleged involvement in laying the the wire to trap the wild animals boars that eat up the crop. Initial report of the postmortem said the victims had sustained burns from electric shock.", "url": "https://indianexpress.com/article/cities/thiruvananthapuram/two-policemen-electrocuted-on-paddy-field-7926873/", "urlToImage": "https://images.indianexpress.com/2022/05/death-5-2-4.jpg", "publishedAt": "2022-05-19T23:41:57Z", "content": "Two policemen died of electrocution on a paddy field near their armed police camp in Palakkad on Thursday. The victims came in comntact with a live wire-trap to catch wild boars that get into paddy f… [+411 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Avinash Nair", "title": "Number of families to be displaced for Surat Metro to reduce by 70 pc", "description": "Redesigning the metro stations and bringing about small modifications in the alignment of metro rail route has helped in reducing the displacement of people, said senior officials of Gujarat Metro Rail Corporation (GMRC).", "url": "https://indianexpress.com/article/cities/ahmedabad/number-of-families-to-be-displaced-for-surat-metro-to-reduce-by-70-pc-7926881/", "urlToImage": "https://images.indianexpress.com/2022/05/Surat-metro.jpg", "publishedAt": "2022-05-19T23:37:53Z", "content": "The number of families who stand to lose their livelihoods or get displaced by construction of Surat Metro in Gujarat is expected to reduce by 70 per cent, according to officials of the Gujarat Metro… [+2763 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Take care of youth who lost eyesight: Congress to VMC", "description": "Henil Patel, a diploma student of MSU’s Polytechnic college, was riding a two-wheeler on Waghodia Road on May 11 when he suffered serious eye injuries by the horn of a cow even as his two-wheeler skid, throwing him to the ground.", "url": "https://indianexpress.com/article/cities/baroda/take-care-of-youth-who-lost-eyesight-congress-to-vmc-7926872/", "urlToImage": "https://images.indianexpress.com/2022/05/Vadodara-mayor.jpg", "publishedAt": "2022-05-19T23:27:38Z", "content": "A week after an 18-year-old student of MS University sustained grievous injuries and lost one eye in an incident of stray cattle attack, Congress leader Chandrakant Shrivastav on Thursday urged the V… [+748 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Esha Roy", "title": "S Somanath: ‘Private players in space sector can boost defence, manufacturing’", "description": "ISRO is centrally funded and our annual budget is between Rs 14-15,000 crore and most of this is used in building rockets and satellites.", "url": "https://indianexpress.com/article/india/s-somanath-private-players-in-space-sector-can-boost-defence-manufacturing-7926867/", "urlToImage": "https://images.indianexpress.com/2022/05/S-Somanath-2.jpg", "publishedAt": "2022-05-19T23:21:16Z", "content": "Minister of State for the Department of Space (DOS) Dr Jitendra Singh informed the Lok Sabha in the last Parliament session that the government was looking at opening the space sector to foreign dire… [+4577 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Sarpanch, son arrested on AAP MLA’s complaint; former MLA protests", "description": "On Wednesday, the MLA along with her PA Baljinder Singh and other AAP workers had reached Mothanwali village to get a government veterinary dispensary free from 'illegal occupation' where an argument had ensued between her and the sarpanch Harnek Singh.", "url": "https://indianexpress.com/article/cities/ludhiana/sarpanch-son-arrested-on-aap-mlas-complaint-former-mla-protests-7926870/", "urlToImage": "https://images.indianexpress.com/2022/05/arrest1-11.jpeg", "publishedAt": "2022-05-19T23:15:02Z", "content": "Moga police arrested the sarpanch and his son of Mothanwali village after the local Moga AAP MLA Dr Amandeep Kaur Arora alleged that both men misbehaved with her.On Wednesday, the MLA along with her … [+2863 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kamaldeep Singh Brar", "title": "Black water in Ferozepur canal: Punjab pollution board says water still drinkable", "description": "Shocked green activists challenge state pollution board members to lead by example and drink water first", "url": "https://indianexpress.com/article/cities/amritsar/black-water-in-ferozepur-canal-punjab-pollution-board-says-water-still-drinkable-7926858/", "urlToImage": "https://images.indianexpress.com/2022/05/pune-1-1.jpg", "publishedAt": "2022-05-19T23:12:21Z", "content": "Images of black water being released into the Ferozepur feeder canal from Harike headworks have flooded the Internet in the past few days, with the Punjab Water Resources department issuing an adviso… [+3620 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "TMC cadre meet in Jhargram: Mamata Banerjee lashes out at BJP, Left amid recruitment row", "description": "The CM's comments came in the backdrop of the Calcutta High Court ordering CBI probes into various cases related to alleged recruitment scam between 2014 and 2017.", "url": "https://indianexpress.com/article/cities/kolkata/tmc-cadre-meet-in-jhargram-mamata-banerjee-lashes-out-at-bjp-left-amid-recruitment-row-7926863/", "urlToImage": "https://images.indianexpress.com/2022/05/mamata-2.jpg", "publishedAt": "2022-05-19T23:08:25Z", "content": "Amid the row over irregularities in government teachers’ appointments, West Bengal Chief Minister Mamata Banerjee Thursday slammed the BJP-led government at the Centre and the Opposition Left Front. … [+2797 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Cattle smuggling case: Anubrata Mondal grilled by CBI, taken to hospital over ‘chest pain’", "description": "The 61-year-old was taken to state-run SSKM Hospital from where he was discharged later. The CBI officials said Mondal complained of chest pain and asked the investigators to allow him to visit a doctor. “He was allowed to go while interrogation was on. He wi…", "url": "https://indianexpress.com/article/cities/kolkata/cattle-smuggling-case-anubrata-mondal-grilled-by-cbi-taken-to-hospital-over-chest-pain-7926843/", "urlToImage": "https://images.indianexpress.com/2022/05/Anubrata-CBI-Main-1.jpg", "publishedAt": "2022-05-19T23:04:14Z", "content": "The CBI on Thursday questioned Trinamool Congress Birbhum district president Anubrata Mondal in Kolkata for nearly four hours in connection with the cross-border cattle smuggling case before he was a… [+1959 chars]"}]}