{"status": "ok", "totalResults": 325, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Suraj Yengde", "title": "The caste and politics of Sena’s rise and its crisis", "description": "Suraj Yengde writes: The Shiv Sena has always been an issue-based, reactionary congregation. It adopts issues and works on them till these are used up and moves on to the next.", "url": "https://indianexpress.com/article/opinion/columns/the-caste-and-politics-of-senas-rise-and-its-crisis-7991604/", "urlToImage": "https://images.indianexpress.com/2022/06/uddhav-1-3-1.jpeg", "publishedAt": "2022-06-25T22:39:17Z", "content": "The political situation in Maharashtra is in a state of flux. One of the seniormost Shiv Sena leaders and Thane strongman, Eknath Shinde, has defied the party leadership, exposing the vulnerabilities… [+4078 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "P Chidambaram", "title": "Penny wise, security foolish", "description": "P Chidambaram writes: The burgeoning pension bill is indeed a problem, but there is no evidence that alternative models were examined. The argument that the Agnipath model has been tried and tested in Israel is puerile. Israel has a small population, practica…", "url": "https://indianexpress.com/article/opinion/columns/penny-wise-security-foolish-7991566/", "urlToImage": "https://images.indianexpress.com/2022/06/agnipath-protests-1-2-1.jpeg", "publishedAt": "2022-06-25T22:30:38Z", "content": "During World Wars I and II, an iconic poster came up all over the United States. It read: I Want You For U.S. Army. The figure with the top hat was fondly called Uncle Sam. The government of India co… [+5076 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shubhangi Khapre", "title": "The Sunday Profile | A Maharashtra rerun, and the Comeback Man: Devendra Fadnavis", "description": "As MVA govt totters, one man standing firmer than ever is BJP leader Devendra Fadnavis. SHUBHANGI KHAPRE on how theformer CM prepared the ground", "url": "https://indianexpress.com/article/cities/mumbai/sunday-profile-maharashtra-comeback-man-devendra-fadnavis-7991563/", "urlToImage": "https://images.indianexpress.com/2022/06/Devendra-Fadnavis-Sunday-profile-illustration.jpg", "publishedAt": "2022-06-25T22:30:21Z", "content": "AT 51, Devendra Fadnavis is younger than the number of years Sharad Pawar has spent in electoral politics. Last week, the BJP leader achieved the near impossible in Maharashtra by outsmarting the gra… [+7071 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Iram Siddique", "title": "‘First the country was Partitioned’…", "description": "Signs of April Ram Navami violence lie across Khargone, including the walls and barricades that now separate some of its Hindu, Muslim areas. What means ‘safety’ for some is an everyday price for the others.", "url": "https://indianexpress.com/article/cities/bhopal/first-the-country-was-partitioned-7991588/", "urlToImage": "https://images.indianexpress.com/2022/06/Khargone.jpg", "publishedAt": "2022-06-25T22:28:42Z", "content": "PEHLE desh ka batwara huwa, ab gali aur mohallon ka batwara ho raha hai. Isse hoga kuch nahin, bas nafrat aur badhegi (First the country was Partitioned, now lanes and localities are being divided. N… [+7401 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Jignasa Sinha", "title": "New headache for cops: Cyber criminals buying personal data in bulk", "description": "These are just some of the bulk messages received on thousands of phones every day, sent by fraudsters waiting for people to click on the phishing links and share personal information.", "url": "https://indianexpress.com/article/cities/delhi/new-headache-for-cops-cyber-criminals-buying-personal-data-in-bulk-7991690/", "urlToImage": "https://images.indianexpress.com/2022/06/cyber-women-1.jpg", "publishedAt": "2022-06-25T22:28:24Z", "content": "Dear customer, your account with xxxx has been suspended. Please complete your KYC (know your customer) with this link; Dear user, Please update your KYC for your account with this link/number; Dear … [+7133 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Vallabh Ozarkar", "title": "As Sena empowers Uddhav to act, 16 rebels get notices, Shinde says security cover gone", "description": "Six resolutions were passed including the decision not to allow anyone other than the Shiv Sena to use the name of Balasaheb Thackeray, and to take strict action against the rebel MLAs.", "url": "https://indianexpress.com/article/cities/mumbai/as-sena-empowers-uddhav-to-act-16-rebels-get-notices-shinde-says-security-cover-gone-7991685/", "urlToImage": "https://images.indianexpress.com/2022/06/uddhav-1-6.jpg", "publishedAt": "2022-06-25T22:18:57Z", "content": "Moving to regain control of the Shiv Sena after majority MLAs of the party rallied behind rebel minister Eknath Shinde, Maharashtra Chief Minister and Sena chief Uddhav Thackeray chaired a meeting Sa… [+3215 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Deeptiman Tiwary", "title": "ED seeks details from UP police on Prophet remark protesters, looks at Bihar coaching centres for Agnipath violence", "description": "The ED has sought documents and case papers from UP Police to examine if it can proceed against the accused under provisions of the PMLA. It is similarly examining the role of coaching centres in Bihar in fuelling protests against the Agnipath scheme.", "url": "https://indianexpress.com/article/india/ed-seeks-details-from-up-police-on-prophet-remark-protesters-looks-at-bihar-coaching-centres-for-agnipath-violence-7991659/", "urlToImage": "https://images.indianexpress.com/2022/06/tarins-agnipath-2col.jpg", "publishedAt": "2022-06-25T22:17:54Z", "content": "The Enforcement Directorate has now turned its gaze on people who participated in two recent protests against the Prophet remarks by now-suspended BJP spokesperson Nupur Sharma, and the announcement … [+1830 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sreenivas Janyala", "title": "Take 5 a cinema strike: 4 years since wages hiked… despite Covid, price rise, says V Anil Kumar President, Telugu Film Industry Employees Federation", "description": "Over 20,000 workers of the Telugu film industry called an indefinite strike last week, demanding a rise in wages. After the Telugu Film Chamber of Commerce agreed to set up a coordination committee, they returned to work.", "url": "https://indianexpress.com/article/cities/hyderabad/take-5-cinema-strike-4-yrs-since-wages-hiked-despite-covid-price-rise-7991581/", "urlToImage": "https://images.indianexpress.com/2022/06/commerce-film-nagar-hyderabad-film-production-houses-m6pvbbzd66.jpg", "publishedAt": "2022-06-25T22:13:15Z", "content": "Over 20,000 workers of the Telugu film industry called an indefinite strike last week, demanding a rise in wages. After the Telugu Film Chamber of Commerce agreed to set up a coordination committee, … [+1055 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anisha Dutta", "title": "Explained: For Shinde, road to claim Sena symbol may not be easy", "description": "While Shinde and the Sena rebels wade through legalities of the anti-defection law, another challenge remains: Of convincing the Election Commission who the real Shiv Sena is. Who will claim the party symbol? That’s the question as the crisis in the state dee…", "url": "https://indianexpress.com/article/explained/explained-for-shinde-road-to-claim-sena-symbol-may-not-be-easy-7991680/", "urlToImage": "https://images.indianexpress.com/2022/06/Eknath-Shinde-2-1.jpg", "publishedAt": "2022-06-25T22:12:40Z", "content": "Maharashtra minister Eknath Shinde, who has the support of the majority MLAs of Shiv Sena and is threatening to topple the ruling MVA coalition, may not find it easy to stake claim to the real Sena.W… [+3727 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "George Mathew", "title": "RBI eyes BNPL norms, to rope in fintechs amid concerns over cards by non-bank PPI issuers to extend short-term loans", "description": "The banking regulator is in discussion with fintech players to find a way out and bring the segment under a regulatory framework so that PPIs are used as a payment instrument and not as a credit avenue.", "url": "https://indianexpress.com/article/business/banking-and-finance/rbi-eyes-bnpl-norms-to-rope-in-fintechs-amid-concerns-over-cards-by-non-bank-ppi-issuers-to-extend-short-term-loans-7991632/", "urlToImage": "https://images.indianexpress.com/2022/06/RBi-1-2-1.jpg", "publishedAt": "2022-06-25T22:05:15Z", "content": "After slapping curbs on non-bank buy now pay later (BNPL) companies, the Reserve Bank of India (RBI) is likely to come out with guidelines for the BNPL segment which was using pre-paid instruments (P… [+4628 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sohini Ghosh", "title": "Fresh FIR based on quotes from SC order, annexures", "description": "The burning of Sabarmati Express in which 59 persons, mostly kar sevaks returning from Ayodhya, died took place on February 27, 2002.", "url": "https://indianexpress.com/article/cities/ahmedabad/fresh-fir-based-on-quotes-from-sc-order-annexures-7991714/", "urlToImage": "https://images.indianexpress.com/2022/06/teesta-sreekumar.jpeg", "publishedAt": "2022-06-25T22:02:07Z", "content": "The fresh FIR lodged against retired DGP RB Sreekumar, former IPS officer Sanjiv Bhatt and activist Teesta Setalvad is based on extensive quotes from the SC verdict and its annexures, and mentions th… [+3967 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Blood trail leads Goa police to murder accused", "description": "On Saturday morning, a man was found dead in the rear of a pick-up truck parked outside a hotel in Margao; he had suffered multiple, grievous stab wounds on abdomen and chest.", "url": "https://indianexpress.com/article/cities/goa/blood-trail-leads-goa-police-to-murder-accus-7991712/", "urlToImage": "https://images.indianexpress.com/2022/06/express-photo-13-19.jpeg", "publishedAt": "2022-06-25T21:59:34Z", "content": "A 300-metre trail of blood led Margao police to the man accused of killing a fellow labourer from Jharkhand.On Saturday morning, a man was found dead in the rear of a pick-up truck parked outside a h… [+1161 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Divya A", "title": "Meenakshi Lekhi assures all help for Mehrauli structure’s national monument tag", "description": "On Saturday, the National Monuments Authority (NMA), which operates under the Ministry of Culture, observed the martyrdom day of Banda Bahadur at Red Fort lawns at a function organised in collaboration with the Delhi Sikh Gurdwara Management Committee (DSGMC).", "url": "https://indianexpress.com/article/cities/delhi/lekhi-assures-all-help-for-mehrauli-structures-national-monument-tag-7991708/", "urlToImage": "https://images.indianexpress.com/2022/06/LEKHI.jpeg", "publishedAt": "2022-06-25T21:37:10Z", "content": "Nearly two months after Prime Minister Narendra Modi addressed the nation from the Red Fort to mark the 400th Parkash Purab of Sikh Guru Tegh Bahadur, the 17th century monument witnessed another gove… [+2109 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Man falls off 8th floor of hospital, dies: Police", "description": "According to police, he sustained grievous injuries in his brain and became unconscious. He was rushed to the intensive care unit of the hospital and was put on the ventilator support, but he succumbed to his injuries later, they said.", "url": "https://indianexpress.com/article/cities/kolkata/man-falls-off-8th-floor-of-hospital-dies-police-7991706/", "urlToImage": "https://images.indianexpress.com/2022/06/express-photo-13-18.jpeg", "publishedAt": "2022-06-25T21:32:50Z", "content": "A 33-year-old patient suffering from “severe neurological disorder and depression at a Kolkata hospital sat on the edge of a cornice on the eighth floor of the building for over two hours and alleged… [+2078 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "JU student gets Rs. 1.8-cr job at Facebook in UK", "description": "This is the highest pay package a student from JU received this year, sources said. Previously, nine JU students from various engineering departments had secured overseas jobs with pay packages exceeding Rs 1 crore, the sources added.", "url": "https://indianexpress.com/article/cities/kolkata/ju-student-gets-rs-1-8-cr-job-at-facebook-in-uk-7991701/", "urlToImage": "https://images.indianexpress.com/2022/06/jadavpur-university-fb.jpeg", "publishedAt": "2022-06-25T21:30:11Z", "content": "A STUDENT of Jadavpur University (JU) has bagged a job with an annual pay package of Rs 1.8 crore from Facebook. Bisakh Mondal, a fourth-year student of computer science and engineering at JU, has ac… [+1355 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Kolkata: State-run schools to resume physical classes from Monday", "description": "The government has directed the schools to sanitise their institutions and ensure all teachers and non-teaching staff are fully vaccinated. Use of masks has been made mandatory and everyone has been encouraged to use sanitisers.", "url": "https://indianexpress.com/article/cities/kolkata/kolkata-state-run-schools-to-resume-physical-classes-from-monday-7991699/", "urlToImage": "https://images.indianexpress.com/2022/06/Webp.net-resizeimage-19-11.37.58-AM.jpg", "publishedAt": "2022-06-25T21:27:20Z", "content": "After extended summer vacation, state-run schools to resume physical classes from Monday by adhering to the Covid-19 protocols."}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "West Bengal: Covid cases up, govt tells hospitals to follow protocol", "description": "The health department issued guidelines after medical students at Calcutta Medical College tested positive for Covid-19.", "url": "https://indianexpress.com/article/cities/kolkata/west-bengal-covid-cases-up-govt-tells-hospitals-to-follow-protocol-7991697/", "urlToImage": "https://images.indianexpress.com/2022/06/kolkata-3.jpg", "publishedAt": "2022-06-25T21:23:38Z", "content": "With the Covid-19 cases increasing fast, the state Health Department has alerted all medical colleges and hospitals asking them strictly follow Covid protocols in both indoor and outdoor patient depa… [+1509 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Adrija Roychowdhury", "title": "How DDA offered housing to Delhi’s aspiring middle-class, set example for rest of India", "description": "The DDA had been functioning for two decades by then. It was established in 1957 in the wake of the Partition by the central government to ensure the planned expansion and development of Delhi.", "url": "https://indianexpress.com/article/cities/delhi/how-dda-offered-housing-to-delhis-aspiring-middle-class-set-example-for-rest-of-india-7991692/", "urlToImage": "https://images.indianexpress.com/2022/06/dda.jpg", "publishedAt": "2022-06-25T21:17:50Z", "content": "In the mid-1970s when Reena Ramachandran (81) was working in the Ministry of Science and Technology in the government of India, she came across an advertisement brochure of the Delhi Development Auth… [+6352 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manraj Grewal Sharma", "title": "After Moosewala’s murder, spotlight back on (Punjabi) gangs of Canada", "description": "With Goldy Brar, a gangster who travelled to Canada on a student visa in 2017, claiming responsibility for the killing of Punjabi rapper Sidhu Moosewala last month, Indo-Canadian gangs are once again under the scanner.", "url": "https://indianexpress.com/article/cities/chandigarh/after-moosewalas-murder-spotlight-back-on-punjabi-gangs-of-canada-7991686/", "urlToImage": "https://images.indianexpress.com/2022/06/Sidhu-3.jpg", "publishedAt": "2022-06-25T20:31:45Z", "content": "The Ruffians. Thats the name of a gang in Abbotsford area of British Columbia, Canada, cobbled together by Punjabi-origin people. Kal Dosanjh, a veteran police officer with the Vancouver police, says… [+7077 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Speak to anti-govt NGOs, Goa CM tells industry", "description": "Speaking at the 114th AGM of Goa Chamber of Commerce and Industry, Pramod Sawant said the government spends a lot of time and money on litigation, which comes in the way of infrastructure projects.", "url": "https://indianexpress.com/article/cities/goa/speak-to-anti-govt-ngos-goa-cm-tells-industry-7991682/", "urlToImage": "https://images.indianexpress.com/2022/06/Goa-CM-Pramod-Sawant-1200.jpeg", "publishedAt": "2022-06-25T20:19:07Z", "content": "Goa Chief Minister Pramod Sawant on Saturday urged the states industrialists to sit across the table and talk to anti-government NGOs that, he said, are opposed to infrastructure projects.Speaking at… [+708 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "2 open fire outside house of arhtiya who got threat calls", "description": "Inspector Jaswinder Singh, SHO of Mynah police station, said that the complainant has claimed that at least four rounds were fired outside his home on Saturday morning.", "url": "https://indianexpress.com/article/cities/ludhiana/2-open-fire-outside-house-of-arhtiya-who-got-threat-calls-7991681/", "urlToImage": "https://images.indianexpress.com/2022/06/gun-shot.jpg", "publishedAt": "2022-06-25T20:17:39Z", "content": "Two unidentified men allegedly opened fire outside the house of a commission agent (arhtiya) at Dala village of Moga, Saturday. Police said the agent, Sukhvir Singh, had told them in a complaint that… [+1495 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lalmani Verma", "title": "Bypoll results 2022: Samajvadi Party hopes to retain its ‘strongholds’ as counting of votes to begin at 8 am today", "description": "The SP had won both the seats in 2019 and it is looking to retain both the seats with support of its traditional vote base of Muslims and Yadavs. Counting of votes will take place on June 26.", "url": "https://indianexpress.com/article/cities/lucknow/samajvadi-party-hopes-to-retain-its-strongholds-as-counting-of-votes-to-begin-at-8-am-today-7991675/", "urlToImage": "https://images.indianexpress.com/2022/06/Rampur-1.jpeg", "publishedAt": "2022-06-25T20:01:09Z", "content": "The bypolls in Rampur and Azamgarh Lok Sabha constituencies, where polling was held on Thursday, hold more importance for the Samajwadi Party (SP) than the BSP and the ruling BJP.The SP had won both … [+3782 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Textile weavers’ body warns of protest if fuel surcharge not slashed", "description": "Representatives of 35 industrial societies attended the meeting and decided to make representations.", "url": "https://indianexpress.com/article/cities/surat/textile-weavers-body-warns-of-protest-if-fuel-surcharge-not-slashed-7991673/", "urlToImage": "https://images.indianexpress.com/2022/06/weavers.jpg", "publishedAt": "2022-06-25T20:00:16Z", "content": "Ashok Jirawala, the president of Federation of Gujarat Weavers Association (FOGWA), who was recently inducted into the Bharatiya Janata Party (BJP), said the representative body has decided to carry … [+1135 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Contractor ‘who had 30 cases against him in Bihar’ shot dead in Lucknow", "description": "The contractor, Virendra Thakur, had at least 30 cases including murder and extortion registered against him in Bihar, police said, adding that he had previously been attacked in 2019 at Lucknow's Charbagh railway station over a business rivalry.", "url": "https://indianexpress.com/article/cities/lucknow/contractor-who-had-30-cases-against-him-in-bihar-shot-dead-in-lucknow-7991672/", "urlToImage": "https://images.indianexpress.com/2022/06/express-photo-13-17.jpeg", "publishedAt": "2022-06-25T19:54:56Z", "content": "A 42-year-old railway contractor was shot dead at his house in Lucknows cantonment area on Saturday by unidentified people. Police said the assailants locked the victim’s wife and three children in a… [+2124 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "First batch of 139 students enrolled in ‘Signal Schools’", "description": "‘Signal Schools’ is an AMC-funded project that aims to convert public buses into mobile schools for out-of-school-children at traffic signals across the city.", "url": "https://indianexpress.com/article/cities/ahmedabad/first-batch-of-139-students-enrolled-in-signal-schools-7991666/", "urlToImage": "https://images.indianexpress.com/2022/06/Gujarat-school.jpg", "publishedAt": "2022-06-25T19:51:57Z", "content": "The first batch of Signal Schools run by the Ahmedabad Municipal Corporation (AMC) saw 139 children enrol in the presence of Gujarat High Court Chief Justice Aravind Kumar and Chief Minister Bhupendr… [+2243 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Dirt of the party is gone, Aaditya on rebels", "description": "The rally is part of a series of such meetings to be organised by the Yuva Sena at every party division in Mumbai to keep the cadre intact in the backdrop of Shinde's rebellion and the upcoming civic polls.", "url": "https://indianexpress.com/article/cities/mumbai/dirt-of-the-party-is-gone-aaditya-on-rebels-7991669/", "urlToImage": "https://images.indianexpress.com/2022/06/a-t.jpg", "publishedAt": "2022-06-25T19:43:27Z", "content": "Calling the rebel MLAs traitors, Yuva Sena president and Minister Aaditya Thackeray on Saturday described the Eknath Shinde faction as the dirt of Shiv Sena.The MLAs who have revolted, they were neve… [+1535 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Protests against rebel MLAs across state", "description": "While incidents of violence took place in Pune, Navi Mumbai, Parbhani, Osmanabad, Satara, Thane, Nagpur city, Nanded, Palghar and Kolhapur, a senior state police officer said that except for the cases of violence in Pune and Thane, the rest were “minor” incid…", "url": "https://indianexpress.com/article/cities/mumbai/protests-against-rebel-mlas-across-state-7991665/", "urlToImage": "https://images.indianexpress.com/2022/06/image-1-2.jpg", "publishedAt": "2022-06-25T19:38:47Z", "content": "At least 10 incidents of violence by Shiv Sena workers against rebel MLAs have been reported across Maharashtra till 8 pm on Saturday. This comes amid the Mumbai Police extending its June 4 order of … [+2159 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "We will ensure jobs for all Agniveers: HP", "description": "The cabinet also gave its consent to fill 389 posts of panchayat secretaries in Himachal", "url": "https://indianexpress.com/article/cities/shimla/we-will-ensure-jobs-for-all-agniveers-hp-7991663/", "urlToImage": "https://images.indianexpress.com/2022/02/Jai-Ram-Thakur-1-2.jpg", "publishedAt": "2022-06-25T19:35:22Z", "content": "Amid protests against central government’s Agnipath scheme for armed forces, the Himachal Pradesh (HP) cabinet in its meeting here on Saturday decided that the state government would ensure jobs to t… [+3225 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Shiv Sena needs to be with BJP, do not feel safe to return: Rebels", "description": "The rebels, represented by Sena MLA from Sawantwadi, Deepak Kesarkar, reiterated the need for joining hands with the BJP.", "url": "https://indianexpress.com/article/cities/mumbai/shiv-sena-needs-to-be-with-bjp-do-not-feel-safe-to-return-rebels-7991661/", "urlToImage": "https://images.indianexpress.com/2022/06/Eknath-Main-1.jpeg", "publishedAt": "2022-06-25T19:31:25Z", "content": "The Ekanth Shinde-led Shiv Sena rebel camp, in its first press conference, claimed on Saturday that the legislators who are in Guwahati are not returning to Maharashtra in view of the violence unleas… [+3056 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Peter Vidal", "title": "Weekly Horoscope, June 26, 2022 – July 2, 2022: Scorpio, Aries, Pisces and other signs — check astrological prediction", "description": "Excerpt: Weekly Horoscope, June 26, 2022 – July 2, 2022: Capricorn, Take the lead at work, and propose overdue changes", "url": "https://indianexpress.com/article/horoscope/weekly-horoscope-june-26-2022-july-2-2022-scorpio-aries-pisces-and-other-signs-check-astrological-prediction-7972047/", "urlToImage": "https://images.indianexpress.com/2022/06/horoscope_200_pixabay.jpg", "publishedAt": "2022-06-25T19:30:10Z", "content": "Money matters must take first place. All you can do is try to see that you make all decisions in line with practical choices. Do yourself a favour and let others take the risks. Children, though, rel… [+3927 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Navjeevan Gopal", "title": "Punjab budget session Day 2: AAP, Opposition spar over illegal sand mining issue during Question Hour", "description": "Leader of opposition and Congress MLA from Qadian asked the ruling AAP legislators “not to make sweeping statements” on the issue.", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-budget-session-day-2-aap-opposition-spar-over-illegal-sand-mining-7991652/", "urlToImage": "https://images.indianexpress.com/2022/06/AAP-budge.jpg", "publishedAt": "2022-06-25T19:26:28Z", "content": "The ruling AAP and opposition MLAs were locked in a verbal duel over the issue of illegal sand and gravel mining on the second day of budget session in Punjab Vidhan Sabha during the question hour wi… [+4671 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Looking to attract cadre, rebel group softens stand on Uddhav, attacks NCP", "description": "While MLA Deepak Kesarkar, a part of the rebel group, alleged that NCP was out to finish Shiv Sena, the faction evoked the late Balasaheb Thackeray to gain greater foothold and acceptance within Sainiks by naming itself 'Shiv Sena Balasaheb'.", "url": "https://indianexpress.com/article/cities/mumbai/looking-to-attract-cadre-rebel-group-softens-stand-on-uddhav-attacks-ncp-7991657/", "urlToImage": "https://images.indianexpress.com/2022/06/image-2.jpg", "publishedAt": "2022-06-25T19:21:47Z", "content": "In a bid to not antagonise the party cadre and continuing with their claim that they are still a part of Shiv Sena, rebels led by Eknath Shinde on Saturday appeared to softened their stance against C… [+2886 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pune police begin crackdown on illegal banners, hoardings in city", "description": "The city police, along with the Pune Municipal Corporation authorities, have initiated legal action against these illegal hoardings and banners, it said.", "url": "https://indianexpress.com/article/cities/pune/pune-police-begin-crackdown-on-illegal-banners-hoardings-in-city-7991655/", "urlToImage": "https://images.indianexpress.com/2022/06/Untitled-design-2021-08-19T105531.039.jpg", "publishedAt": "2022-06-25T19:10:38Z", "content": "Pune city police have initiated action against illegal hoardings and banners in the city. A press release issued Saturday stated that as many as 1,400 illegal hoardings and banners were identified in… [+489 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pallavi Smart", "title": "Eight-member panel comes up to help implement NEP", "description": "Even as different state authorities working under the department have been tasked with implementing NEP 2020 recommendations, this eight-member committee is expected to ensure coordination between all to enhance the process.", "url": "https://indianexpress.com/article/cities/mumbai/eight-member-panel-comes-up-to-help-implement-nep-7991653/", "urlToImage": "https://images.indianexpress.com/2022/06/COLLEGE-1-1-1-1.jpeg", "publishedAt": "2022-06-25T19:05:06Z", "content": "The state school education department has set up a committee to ensure the effective implementation of the National Education Policy (NEP), 2020.Even as different state authorities working under the … [+1600 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rupsa Chakraborty", "title": "Only 1,728 Covid-19 cases logged on Saturday; data to be updated", "description": "Due to the incomplete compilation of Covid cases, Mumbai’s caseload also stood at 840, which was 1,898 on Friday.", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-covid-cases-maharashtra-coronavirus-deaths-active-cases-7991648/", "urlToImage": "https://images.indianexpress.com/2022/06/Covid-4-3.jpeg", "publishedAt": "2022-06-25T19:01:17Z", "content": "A day after reporting 4,205 cases, the state registered only 1,728 Covid-19 cases on Saturday, mainly due to a technical glitch on the portal of Indian Council of Medical Research (ICMR). The actual … [+1596 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Navjeevan Gopal", "title": "IAS officer son death: The discrepancies", "description": "There were several discrepancies in the version of officials, including between that of the police and Vigilance Bureau. Police personnel and Popli were accompanying the Vigilance team during the search.", "url": "https://indianexpress.com/article/cities/chandigarh/ias-officer-son-death-the-discrepancies-sanjay-kartik-popli-7991645/", "urlToImage": "https://images.indianexpress.com/2022/06/kartik-popli.jpg", "publishedAt": "2022-06-25T19:00:55Z", "content": "THE PUNJAB government found itself battling another controversy Saturday following the death of IAS officer Sanjay Popli’s son Kartik, even as a team had come to the officer’s home for a search, as p… [+2278 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sohini Ghosh, Sadaf Modak", "title": "Newsmaker | Among first to take up cause of Gujarat riot victims, Teesta is fighting many cases", "description": "Teesta was among the first activists to take up the cases of riot victims in Gujarat in 2002, finally leading the Supreme Court to set up a special investigation team to probe the post-Godhra riots, six years later, under former CBI director R K Raghavan.", "url": "https://indianexpress.com/article/political-pulse/newsmaker-among-first-to-take-up-cause-of-gujarat-riot-victims-teesta-is-fighting-many-cases-7991643/", "urlToImage": "https://images.indianexpress.com/2022/06/Teesta-1.jpg", "publishedAt": "2022-06-25T18:49:57Z", "content": "Teesta Setalvad, a journalist and activist based out of Mumbai and a Padma Shri, is a founding trustee and secretary of the NGO Citizens for Justice and Peace (CJP) established in 2002 in the afterma… [+3392 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aditi Raja", "title": "Shala Praveshotsav: District admin to request for grant to buy school bags for newly enrolled students", "description": "On Saturday, about 20 students enrolling in class I of the primary school in Chisadiya village, wearing welcome caps made of chart paper, received their books in a 'cloth bag' (polypropylene).", "url": "https://indianexpress.com/article/cities/ahmedabad/shala-praveshotsav-district-admin-grant-school-bags-enrolled-students-7991640/", "urlToImage": "https://images.indianexpress.com/2022/06/signal-school.jpg", "publishedAt": "2022-06-25T18:39:41Z", "content": "The Chhota Udepur district administration has decided to request the District Panchayat for a grant to provide school bags to the 11,000 students who were enrolled to Class I in Gujarat in during the… [+4484 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "New Zealand limps to 168-5 and 137-run lead against England", "description": "New Zealand was 168-5 for an overall lead of 137 runs when rain brought an early closure with 17.1 overs remaining in the day.", "url": "https://indianexpress.com/article/sports/cricket/new-zealand-limps-to-168-5-and-137-run-lead-against-england-7991642/", "urlToImage": "https://images.indianexpress.com/2022/06/NZ-ENG-2.jpg", "publishedAt": "2022-06-25T18:35:14Z", "content": "England strangled New Zealand’s top order through pace and spin in the second innings to stay in the ascendency three days into the third test at Headingley on Saturday.New Zealand was 168-5 for an o… [+4175 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "Ajker Rashifal Bengali, 26 June, 2022: চমৎকার কিছু ঘটবে এই রাশির জাতকদের! পড়ুন রাশিফল", "description": "আজকের রাশিফল, Horoscope Today, 26 June 2022: জেনে নিন কী আছে আজ ভাগ্যে", "url": "https://bengali.indianexpress.com/horoscope/ajker-rashifal-june-26-2022-aries-taurus-gemini-cancer-leo-virgo-libra-scorpio-sagittarius-capricorn-aquarius-pisces-461688/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/sunday.jpg", "publishedAt": "2022-06-25T18:35:00Z", "content": "/ Aries  Rashifal ( March 21 – April 20 )\r\n/ Taurus  Rashifal ( April 21 – May 21 )\r\n/ Gemini  Rashifal ( May 22 – June 21 )\r\n/ Cancer Rashifal  ( June 22 – July 23 )\r\n/ Leo   Rashifal  ( July 24 – A… [+319 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Hayley Matthews appointed as new West Indies women’s captain", "description": "Matthews has an impressive international record with 1,764 runs and 78 wickets in 69 ODIs and 1,055 runs and 58 wickets in 61 T20Is.", "url": "https://indianexpress.com/article/sports/cricket/hayley-matthews-appointed-as-new-west-indies-womens-captain-7991635/", "urlToImage": "https://images.indianexpress.com/2022/06/Matthews.jpg", "publishedAt": "2022-06-25T18:26:30Z", "content": "Cricket West Indies (CWI) announced on Saturday that allrounder Hayley Matthews has been appointed as the West Indies womens captain. Matthews will assume the leadership role from former skipper Staf… [+1069 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "G7 summit: Talks on key issues on Modi’s Germany itinerary", "description": "Prime Minister Narendra Modi is visiting Schloss Elmau in southern Germany on June 26 and 27 for the summit of the G7, a grouping of the world's seven richest nations.", "url": "https://indianexpress.com/article/india/g7-summit-talks-on-key-issues-on-modis-germany-itinerary-7991637/", "urlToImage": "https://images.indianexpress.com/2022/06/g20-file.jpg", "publishedAt": "2022-06-25T18:23:13Z", "content": "Ahead of his departure to Germany for the G7 summit, Prime Minister Narendra Modi on Saturday said he will exchange views with the leaders of the grouping and its partner countries on issues such as … [+1947 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "Explained: আমেরিকায় গর্ভপাতে নিষেধাজ্ঞা, যুগান্তকারী রায় সম্পর্কে জানেন কি?", "description": "রো ভার্সেস ওয়েড মামলার রায়ের ১৯ বছর পর ফের গর্ভপাত সংক্রান্ত এক মামলা আমেরিকার সুপ্রিম কোর্টে যায়।", "url": "https://bengali.indianexpress.com/explained/us-supreme-court-has-overturned-461789/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/american-protest.jpg", "publishedAt": "2022-06-25T18:16:12Z", "content": ", . \r\n , , , , , \r\n ?, , , , , , , , \r\n - , , - , , - , - \r\n , , , ’ , - ( ) , - , , ( )\r\n - , \r\n ( ) , , - , \r\n - , , - , -, , , \r\nRead full story in English"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sandip G", "title": "India vs Leicestershire: Kohli gets into groove with a watchful fifty", "description": "Jasprit Bumrah tested his former captain Kohli's patience rather than stroke-play during the tour game", "url": "https://indianexpress.com/article/sports/cricket/india-vs-leicestershire-kohli-gets-into-groove-with-a-watchful-fifty-7991615/", "urlToImage": "https://images.indianexpress.com/2022/06/VK.jpg", "publishedAt": "2022-06-25T18:02:15Z", "content": "Virat Kohli and Jasprit Bumrah averted each others gaze. Kohli turned towards the square-leg umpire and practised a forward defensive; Bumrah strode back to the top of his run-up. As if nothing had h… [+5466 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Leena Misra", "title": "Newsmaker | RB Sreekumar, a decorated cop and thorn in PM Modi’s side", "description": "Sreekumar, who became Gujarat DGP after retirement, wrote affidavits to the Nanavati Commission alleging govt agencies’ complicity in the 2002 riots. On Friday, the Supreme Court called into question his role in the accusations.", "url": "https://indianexpress.com/article/political-pulse/newsmaker-rb-sreekumar-a-decorated-cop-and-thorn-in-pm-modis-side-7991606/", "urlToImage": "https://images.indianexpress.com/2022/06/sreekumarr-logo.jpg", "publishedAt": "2022-06-25T17:54:20Z", "content": "A decorated police officer, R B Sreekumar challenged the Narendra Modi governments claims of peace in Gujarat in the aftermath of the 2002 riots, spoke of the alleged collusion between government age… [+6387 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Wimbledon champ Kvitova, Fritz win Eastbourne titles", "description": "Kvitova earned her first grass-court title in four years — and 29th trophy of her singles career — after breaking Ostapenko, the defending champion, early in both sets of the final and feasting on the Latvian's second serve.", "url": "https://indianexpress.com/article/sports/tennis/wimbledon-champ-kvitova-fritz-win-eastbourne-titles-7991570/", "urlToImage": "https://images.indianexpress.com/2022/06/Petra.jpg", "publishedAt": "2022-06-25T17:09:04Z", "content": "Two-time Wimbledon champion Petra Kvitova tuned up for the Grand Slam tournament by overpowering Jelena Ostapenko 6-3, 6-2 to win the Eastbourne title on Saturday.Also, Taylor Fritz outlasted Maxime … [+2428 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Around 2,000 people arrested for violence over Agnipath, Prophet remark: UP Police", "description": "\"As many as 1,562 persons have been arrested in the state in connection with the 'Agnipath' violence. Of these, 535 arrests were made in Jaunpur, 222 in Ballia, and 210 in Chandauli,\" Additional Director General of Police (Law and Order) Prashant Kumar said.", "url": "https://indianexpress.com/article/cities/lucknow/around-2000-people-arrested-agnipath-prophet-remark-up-police-7991559/", "urlToImage": "https://images.indianexpress.com/2022/06/Agnipath-1-1.jpg", "publishedAt": "2022-06-25T17:03:19Z", "content": "The Uttar Pradesh Police has so far arrested 1,562 people in connection with the violence over the Agnipath military recruitment scheme, a senior officer said on Saturday.Another 424 people have been… [+1001 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Teesta’s arrest: Cautious Congress hopes for due process, Left calls for her release", "description": "Abhishek Manu Singhvi says that as a political party, the Cong can’t comment on a case with which it has no connection, but warns the BJP against ‘reading unconnected clean chits into the Supreme Court verdict’ that was followed by the arrests.", "url": "https://indianexpress.com/article/india/teesta-setalvad-arrest-cautious-congress-hopes-for-due-process-left-calls-for-release-7991516/", "urlToImage": "https://images.indianexpress.com/2022/06/Teesta.jpg", "publishedAt": "2022-06-25T17:00:07Z", "content": "The Left parties, on the other hand, questioned their arrests, which came a day after the Supreme Court upheld the clean chit by the SIT to then chief minister Narendra Modi in the 2002 Gujarat riots… [+3021 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "‘Hacker’ Sriki’s brother must cooperate in ED probe for clearance to leave India: Karnataka HC", "description": "The high court rejected a plea by Sudarshan Ramesh, the elder brother of hacker Srikrishna Ramesh, to quash a Look Out Circular issued by immigration authorities at the instance of the ED, on June 20.", "url": "https://indianexpress.com/article/cities/bangalore/hacker-srikis-brother-cooperate-ed-probe-clearance-leave-india-karnataka-hc-7991544/", "urlToImage": "https://images.indianexpress.com/2022/05/Sirki.jpeg", "publishedAt": "2022-06-25T16:59:51Z", "content": "The Karnataka High Court has upheld a move by the Enforcement Directorate (ED) to prevent the brother of an alleged Bengaluru-based hacker from leaving India during the investigation of a money laund… [+5649 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Putin promises Belarus Iskander-M missiles to counter “aggressive” West", "description": "During a meeting, Belarusian President Alexander Lukashenko told Putin that Belarus was concerned by the \"aggressive\", \"confrontational\" and \"repulsive\" policies of its neighbours Lithuania and Poland.", "url": "https://indianexpress.com/article/world/putin-promises-belarus-iskander-m-missiles-counter-aggressive-west-7991541/", "urlToImage": "https://images.indianexpress.com/2022/06/Lukashenko-Putin.jpg", "publishedAt": "2022-06-25T16:56:51Z", "content": "Russia will supply Belarus with Iskander-M missile systems within a few months, Russian President Vladimir Putin told a televised meeting with Belarusian President Alexander Lukashenko on Saturday.At… [+1831 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Shelling damages Kharkiv nuclear facility in Ukraine, regulator says", "description": "The strike damaged some of the site's buildings and infrastructure but did not affect the area housing nuclear fuel and radiation levels there are within a normal range, it said in an online post.", "url": "https://indianexpress.com/article/world/russia-ukraine-shelling-kharkiv-nuclear-facility-ukraine-7991555/", "urlToImage": "https://images.indianexpress.com/2022/06/russia-ukraine-1.jpg", "publishedAt": "2022-06-25T16:56:06Z", "content": "Russian shelling damaged a nuclear research facility in the northeastern Ukrainian city of Kharkiv on Saturday, the State Nuclear Regulatory Inspectorate said."}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Ukraine confirms fall of Sievierodonetsk after weeks-long fight", "description": "The fall of Sievierodonetsk - once home to more than 100,000 people, now a wasteland - was Russia's biggest victory since capturing the port of Mariupol last month.", "url": "https://indianexpress.com/article/world/ukraine-confirms-fall-of-sievierodonetsk-after-weeks-long-fight-7991536/", "urlToImage": "https://images.indianexpress.com/2022/06/ukraine-1-2.jpg", "publishedAt": "2022-06-25T16:53:42Z", "content": "Pro-Russian separatists said Moscow’s forces were now attacking the last major Ukrainian-held bastion in eastern Luhansk province, Sievierodonetsk’s twin city Lysychansk on the opposite bank of the S… [+6111 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Power tariff hike in Kerala after 3 years", "description": "State Electricity Minister K Krishnankutty said the commission revised the power tariff without incurring huge liabilities to the people.", "url": "https://indianexpress.com/article/cities/thiruvananthapuram/power-tariff-hike-kerala-7991542/", "urlToImage": "https://images.indianexpress.com/2022/06/electricity-consumption-759-1.jpg", "publishedAt": "2022-06-25T16:50:23Z", "content": "The Kerala State Electricity Regulatory Commission on Saturday announced 6.6 per cent hike in power tariffs in the state.Revising the power tariff after three years, the Commission, however, said the… [+511 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Sonia Gandhi, Cong ‘driving force’ behind Teesta Setalvad’s campaign against Modi on riots: BJP", "description": "BJP spokesperson Sambit Patra noted that the apex court had named Teesta Setalvad while blasting those responsible for keeping the \"pot boiling\" for their ulterior designs on the riots.", "url": "https://indianexpress.com/article/india/bjp-sambit-patra-gujarat-riots-teesta-setalvad-modi-congress-7991524/", "urlToImage": "https://images.indianexpress.com/2021/09/sambit-patra-fb.jpeg", "publishedAt": "2022-06-25T16:41:12Z", "content": "The BJP Saturday cited the Supreme Court’s critical comments against Teesta Setalvad to flay her, and alleged the Congress and its president Sonia Gandhi were the “driving force” behind the activist’… [+2714 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "UP govt transfers 11 IAS officers, Ajay Kumar Dwivedi moved to Agra Development Authority", "description": "According to transfers list issued by the government, Gorakhpur Chief Development Officer Indrajit Singh is now the new municipal commissioner of Lucknow Municipal Corporation.", "url": "https://indianexpress.com/article/cities/lucknow/up-govt-transfers-11-ias-officers-ajay-kumar-dwivedi-moved-to-agra-development-authority/", "urlToImage": "https://images.indianexpress.com/2022/06/26-VS-Yogi-Adityanath-Press-03.jpg", "publishedAt": "2022-06-25T16:38:51Z", "content": "The Uttar Pradesh government on Saturday transferred 11 IAS officers, making Lucknow municipal commissioner Ajay Kumar Dwivedi vice-chairman of the Agra Development Authority.According to transfers l… [+805 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Arun Sharma", "title": "Ahead of Amarnath Yatra, Jammu & Kashmir police warn vehicle users of sticky bombs", "description": "For the first time in the Union Territory, fifteen small magnetic IEDs, also known as sticky bombs, were seized by police in Samba district’s Ramban sector in February 2021.", "url": "https://indianexpress.com/article/cities/jammu/amarnath-yatra-jammu-kashmir-police-warn-vehicle-users-sticky-bombs-7991525/", "urlToImage": "https://images.indianexpress.com/2022/06/Amarnath-Yatra.jpg", "publishedAt": "2022-06-25T16:38:45Z", "content": "With magnetic IEDs emerging as a new threat ahead of the Amarnath pilgrimage, the Jammu and Kashmir police are advising people across the Union Territory to thoroughly check their vehicles for any fo… [+3422 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Pak rejects India’s plan to hold meeting of G20 countries in Kashmir: Foreign Office", "description": "Jammu and Kashmir will be hosting the 2023 meetings of G-20, an influential grouping that brings together the world's major economies, with the union territory administration on Thursday setting up a five-member high-level committee for overall coordination.", "url": "https://indianexpress.com/article/world/pak-rejects-indias-plan-meeting-g20-kashmir-foreign-office-7991519/", "urlToImage": "https://images.indianexpress.com/2022/06/g20-file-1.jpg", "publishedAt": "2022-06-25T16:35:12Z", "content": "Pakistan said on Saturday that it rejects India’s attempt to hold a meeting of G20 countries in Kashmir, hoping that members of the grouping will be fully cognisant of the imperatives of law and just… [+2305 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Pakistan Army chief Bajwa meets Musharraf in Dubai", "description": "The family of Musharraf, who has been living in self-exile in Dubai since 2016, has yet not made up their mind to fly him back to Pakistan.", "url": "https://indianexpress.com/article/world/pakistan-army-chief-bajwa-meets-musharraf-dubai-7991510/", "urlToImage": "https://images.indianexpress.com/2022/06/Qamar-Javed-Bajwa.jpg", "publishedAt": "2022-06-25T16:30:46Z", "content": "Pakistan Army chief General Qamar Javed Bajwa recently visited the ailing former president and army chief Gen (retd) Pervez Musharraf in Dubai, the media reported on Saturday.Gen Bajwa, accompanied b… [+3447 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "DGCA stops ops at 2 flying training schools due to safety concerns", "description": "The two schools are Chimes Aviation Academy in Madhya Pradesh and NMIMS Academy of Aviation in Maharashtra, an official statement said.", "url": "https://indianexpress.com/article/business/aviation/dgca-stops-ops-flying-training-schools-safety-concerns-7991509/", "urlToImage": "https://images.indianexpress.com/2022/06/flight-3.jpg", "publishedAt": "2022-06-25T16:27:06Z", "content": "Aviation regulator DGCA has stopped operations of two flying training schools due to serious safety concerns, an official statement said on Saturday.The two schools are Chimes Aviation Academy in Mad… [+1926 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Santosh Singh", "title": "JD(U) thanks Nitish for caste census, miffed BJP claims equal credit", "description": "Party leaders and workers across the state took out an \"Aabhar Yatra\" in all districts Saturday to thank Chief Minister Nitish Kumar.", "url": "https://indianexpress.com/article/political-pulse/jdu-thanks-nitish-for-caste-census-miffed-bjp-claims-equal-credit-7991471/", "urlToImage": "https://images.indianexpress.com/2022/06/jdu.jpg", "publishedAt": "2022-06-25T16:20:55Z", "content": "In an effort to outwit ally BJP and take the credit for the caste census to be conducted in Bihar, Janata Dal (United) leaders and workers across the state took out an “Aabhar Yatra” in all districts… [+2327 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "How Alton Mason Went from ‘Male Model of the Year’ to ‘Elvis’", "description": "Mason was studying acting at the American Musical and Dramatic Academy in Los Angeles and interning for choreographer Laurieann Gibson when he was discovered by a modeling agent on Instagram in 2015.", "url": "https://indianexpress.com/article/lifestyle/fashion/how-alton-mason-went-from-male-model-of-the-year-to-elvis-7991444/", "urlToImage": "https://images.indianexpress.com/2022/06/MODEL-ACTOR-2.jpg", "publishedAt": "2022-06-25T16:10:13Z", "content": "Name: Alton Mason\r\nAge: 24\r\nHometown: Phoenix\r\nNow Lives: A hotel room on the Lower East Side of Manhattan, although he is usually traveling. I live in Terminal 2 in Delta, he said, jokingly. Its jus… [+2810 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Stay in forests for 15 days every month, Karnataka CM tells top officials of forest dept", "description": "The chief minister made the remark while speaking at a function to celebrate the golden jubilee of Karnataka State Forest Development Corporation Limited.", "url": "https://indianexpress.com/article/cities/bangalore/stay-forests-15-days-month-karnataka-cm-forest-dept-7991482/", "urlToImage": "https://images.indianexpress.com/2022/06/ktakaforestdep.jpg", "publishedAt": "2022-06-25T16:10:01Z", "content": "Karnataka Chief Minister Basavaraj Bommai Saturday asked forest department officials from the rank of district forest officers to the principal secretary to stay in forests for 15 days a month.The ch… [+2244 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "13 newborns among several rescued after fire at Ahmedabad hospital", "description": "According to fire safety department officials, the fire started at a Chartered Accountant (CA) firm office situated on the third floor of the four-storey ‘Dev’ complex located at Parimal Garden Crossroads.", "url": "https://indianexpress.com/article/cities/ahmedabad/ahmedabad-hospital-fire-babies-rescued-7991488/", "urlToImage": "https://images.indianexpress.com/2022/06/ahmedabad-hospital-baby-rescue.jpg", "publishedAt": "2022-06-25T15:58:21Z", "content": "As many as 75 persons, including 13 newborn babies at a neonatal hospital, were airlifted and rescued from the terrace of a complex in the Parimal Garden area of Ahmedabad Saturday afternoon after a … [+1499 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Gareth Bale joins Los Angeles FC: Reports", "description": "Bale left Real with 106 goals in 256 appearances, having won three La Liga titles, a Copa del Rey and five Champions Leagues.", "url": "https://indianexpress.com/article/sports/football/gareth-bale-joins-los-angeles-fc-reports-7991429/", "urlToImage": "https://images.indianexpress.com/2022/06/Gareth-Bale.jpg", "publishedAt": "2022-06-25T15:58:06Z", "content": "Former Real Madrid player Gareth Bale has signed with Los Angeles FC according to multiple reports. Bale, who left Real as a free agent this summer, has agreed to join the Major League Soccer (MLS) s… [+1085 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Shehnaaz Gill is enjoying the sunset on a yacht, fans call her ‘gorgeous’", "description": "Shehnaaz Gill's video has received a lot of love from her fans. The actor rose to fame with Bigg Boss 13.", "url": "https://indianexpress.com/article/entertainment/bollywood/shehnaaz-gill-is-enjoying-the-sunset-on-a-yacht-fans-call-her-gorgeous-7991446/", "urlToImage": "https://images.indianexpress.com/2022/06/WhatsApp-Image-2022-06-25-at-9.14.19-PM.jpeg", "publishedAt": "2022-06-25T15:57:17Z", "content": "Shehnaaz Gill on Saturday shared a video in which she was seen dancing and having fun on a yacht. The actor, who rose to fame Bigg Boss 13, was seen dancing around in a black dress. Sharing the video… [+1217 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "উত্তাপ-হীন ধীমাল বস্তি, উপজাতির স্বীকৃতি না পেলেও ভোট দেবেন ধীমালরা", "description": "প্রায় ৩০০ বছর ধরে শিলিগুড়ি মহকুমায় বাস ধীমাল জনজাতির।", "url": "https://bengali.indianexpress.com/west-bengal/siliguri-election-dheemal-basti-voting-461776/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/dheemal_basti.jpg", "publishedAt": "2022-06-25T15:46:32Z", "content": ", - , - , \r\n , , , , , \r\n , , \r\n - - , , , \r\n - , , \r\n , , , , , , , \r\nStay updated with the latest news headlines and all the latest Westbengal news download Indian Express Bengali App.\r\nWeb Title: … [+37 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "UGC-NET December 2021 and June 2022 dates revealed; check schedule here", "description": "The detailed date sheet has not been announced yet, but will soon be updated on the official NTA website -- nta.ac.in.", "url": "https://indianexpress.com/article/jobs/ugc-net-december-2021-and-june-2022-dates-revealed-check-schedule-here-nta-ac-in-7991467/", "urlToImage": "https://images.indianexpress.com/2022/06/UGC-NET.jpg", "publishedAt": "2022-06-25T15:46:21Z", "content": "UGC Chairman, M Jagadesh Kumar, has announced exam dates for UGC-NET December 2021 and June 2022 merged cycles. The Chairman has revealed that the exam will be held on 08, 09, 11, 12 July and 12, 13,… [+711 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Man wanted for Gopal Nagar firing nabbed from Maharashtra", "description": "The accused had been identified as Puneet Soni, a resident of Shaheed Babu Labh Singh Nagar.", "url": "https://indianexpress.com/article/cities/jalandhar/man-gopal-nagar-firing-nabbed-maharashtra-shirdi-7991451/", "urlToImage": "https://images.indianexpress.com/2022/06/shot-dead.jpg", "publishedAt": "2022-06-25T15:44:29Z", "content": "The Jalandhar police commissionerate on Saturday arrested a man from Maharashtra’s Shirdi who was wanted in a firing incident that took place in Gopal Nagar on April 14 this year.The accused had been… [+1015 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Raakhi Jagga", "title": "Sangrur bypoll: 45.30% turnout , the lowest after 1991 parliamentary elections.", "description": "The lowest turnout in Sangrur parliamentary elections was in 1991 when just 10.9% people ventured out to vote. It was the time when terrorism reigned supreme in Punjab.", "url": "https://indianexpress.com/article/cities/chandigarh/sangrur-bypoll-45-30-turnout-the-lowest-after-1991-parliamentary-elections-7991463/", "urlToImage": "https://images.indianexpress.com/2022/06/voting-1200.jpg", "publishedAt": "2022-06-25T15:38:18Z", "content": "A sharp decline in voter turnout marked the bypoll voting exercise that ended with a dismal count in Sangrur Lok Sabha constituency. Just 45.30 % of voters turned out to exercise their franchise in t… [+7245 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Goa: Fitness trainer kills professor, dumps body in jungle", "description": "The police suspect it to be a case of unrequited love.", "url": "https://indianexpress.com/article/cities/goa/goa-fitness-trainer-kills-professor-7991457/", "urlToImage": "https://images.indianexpress.com/2022/06/arrest-21.jpg", "publishedAt": "2022-06-25T15:36:27Z", "content": "The Goa police on Friday arrested a fitness trainer for allegedly kidnapping and killing a professor, the police said, adding that they suspect it to be a case of unrequited love.According to the pol… [+1378 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Newsmakers of the Week | Rebel MLA Eknath Shinde, Presidential candidates Droupadi Murmu & Yashwant Sinha", "description": "From rebel Shiv Sena minister Eknath Shinde who engineered a stunning split in the party, to RJD’s Anant Singh who was sentenced to 10 years in prison in an Arms Act case, here are the Newsmakers of the Week.", "url": "https://indianexpress.com/article/political-pulse/newsmakers-eknath-shinde-droupadi-murmu-yashwant-sinha-anant-singh-7991403/", "urlToImage": "https://images.indianexpress.com/2022/06/Newsmakers-2.jpg", "publishedAt": "2022-06-25T15:32:52Z", "content": "An MLA who led a revolt against Maharashtra Chief Minister and Sena president, Uddhav Thackeray, and engineered a stunning split in the party; a former teacher and tribal leader who is now NDAs candi… [+2933 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Nadal missing old sparring partner Federer on Wimbledon return", "description": "Their epic rivalry includes three successive Wimbledon finals from 2006 -- the first two won by Federer and the last by Nadal in unforgettable fashion in 2008.", "url": "https://indianexpress.com/article/sports/tennis/nadal-missing-old-sparring-partner-federer-on-wimbledon-return-7991452/", "urlToImage": "https://images.indianexpress.com/2022/06/nadal-federer-fb.jpg", "publishedAt": "2022-06-25T15:25:56Z", "content": "Rafa Nadal returns to Wimbledon for the first time in three years but it will feel a little odd for the Spaniard who, for the first time at the All England Club, will not have sparring partner Roger … [+2519 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Sports Desk", "title": "ছাঁটাই হচ্ছেন বাগানের দীর্ঘদিনের এই বিদেশি! কৃষ্ণ-উইলিয়ামসের মতই বাতিলের খাতায় সুপারস্টার", "description": "ইস্টবেঙ্গলের দল বাছাইয়ের স্ট্র্যাটেজি নিয়ে ইতিমধ্যেই প্রশ্ন উঠতে শুরু করেছে। চারজন ডিফেন্ডার রয়েছে স্কোয়াডে।", "url": "https://bengali.indianexpress.com/sports/isl-transfer-atk-mohun-bagan-team-squad-strategy-florentin-pogba-carl-mchugh-brendan-hamill-tiri-461734/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/ATK_Mohun-Bagan.jpeg", "publishedAt": "2022-06-25T15:23:54Z", "content": ", , \r\n :  , \r\n - \r\n , \r\n :  ! \r\n -- \r\n, - , , \r\n, \r\n :  ! ISL \r\n , \r\n, \r\nStay updated with the latest news headlines and all the latest Sports news download Indian Express Bengali App.\r\nWeb Title: Is… [+93 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "You absorb less protein from plant-based meat than from chicken: Research", "description": "New research has found proteins in plant-based meat were not as accessible to cells as those from the real meat", "url": "https://indianexpress.com/article/lifestyle/health/you-absorb-less-protein-from-plant-based-meat-than-from-chicken-research-7991388/", "urlToImage": "https://images.indianexpress.com/2022/06/GettyImages-plant-based-meat-1200.jpg", "publishedAt": "2022-06-25T15:20:10Z", "content": "Plant-based meat is all the rage as it provides an alternative source of protein to vegetarians and satiates the curiosity of people who always wanted to relish meat. Those who are fond of plant-base… [+2492 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "A. Kameshwari", "title": "Shah Rukh Khan says he is ‘too old to do romantic films,’ remembers romancing ‘way younger’ co-star: ‘It is awkward’", "description": "While celebrating 30 years of his journey in the film industry, Shah Rukh Khan remembered how he felt awkward while romancing \"way younger\" co-stars on screen but had to act like their age as part of his job.", "url": "https://indianexpress.com/article/entertainment/bollywood/shah-rukh-khan-says-he-is-too-old-to-do-romantic-films-remembers-romancing-way-younger-co-star-7991426/", "urlToImage": "https://images.indianexpress.com/2022/06/Shah-Rukh-Khan-1200-3.jpg", "publishedAt": "2022-06-25T15:19:20Z", "content": "Be it Kuch Kuch Hota Hai’s Rahul or Dilwale Dulhania Le Jayenge’s Raj, Shah Rukh Khan’s most memorable and cherished characters have been from some of his popular romantic films. However, now he is i… [+2931 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "ED arrests Bengaluru builder Sushil P Mantri in money-laundering case", "description": "Many homebuyers have alleged they were cheated out of more than Rs 1,000 crore after being shown misleading brochures with rosily painted schemes.", "url": "https://indianexpress.com/article/cities/bangalore/ed-arrests-bengaluru-builder-sushil-p-mantri-in-money-laundering-case-7991443/", "urlToImage": "https://images.indianexpress.com/2022/06/ARREST-13-3.jpg", "publishedAt": "2022-06-25T15:14:20Z", "content": "The Enforcement Directorate (ED) has arrested Sushil P Mantri, director of Bengaluru-based Mantri Developers Private Limited, in connection with a money-laundering case.The ED initiated an investigat… [+1580 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "হল না শেষরক্ষা, বাঁচানো গেল না ৮ তলার কার্নিশ থেকে পড়ে যাওয়া রোগীকে", "description": "মল্লিকবাজারের ইনস্টিটিউট অফ নিউরোসায়েন্সের ৮তলা থেকে নীচে পড়ে যান রোগী সুজিত অধিকারী।", "url": "https://bengali.indianexpress.com/west-bengal/sujit-adhikari-patient-who-fell-from-ink-mallickbazar-died-461751/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/sujit-adhikari-patient-who-fell-from-ink-mallickbazar-died.jpg", "publishedAt": "2022-06-25T15:09:17Z", "content": ", \r\n , , \r\n - , , \r\n ? ? ? - \r\n - , , ? \r\nStay updated with the latest news headlines and all the latest Westbengal news download Indian Express Bengali App.\r\nWeb Title: Sujit adhikari patient who fe… [+28 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Karnataka: CM Bommai directs officials to rein in traffic congestion at 10 prominent Bengaluru spots", "description": "The chief minister gave the directions while chairing a meeting on traffic management in Bengaluru with officials of the BBMP, BWSSB, urban development, police and other departments.", "url": "https://indianexpress.com/article/cities/bangalore/karnataka-cm-bommai-officials-rein-traffic-congestion-10-prominent-bengaluru-spots-7991437/", "urlToImage": "https://images.indianexpress.com/2022/06/bommai-1200-1-1-1.jpg", "publishedAt": "2022-06-25T15:07:59Z", "content": "Karnataka Chief Minister Basavaraj Bommai Saturday said he has directed officials to rein in traffic congestion at 10 prominent spots in Bengaluru, like Hebbal, Mahadevapura Outer Ring Road, Silk Boa… [+1925 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Your Daily Wrap: Activist Teesta Setalvad arrested, Section 144 imposed in Mumbai amid political turmoil; and more", "description": "From the arrests of activist Teesta Setalvad and retired DGP RB Sreekumar to the Mumbai police imposing Section 144 banning unlawful assembly in the city, here are the top stories of today.", "url": "https://indianexpress.com/article/india/your-daily-wrap-teesta-setalvad-section-144-mumbai-political-turmoil-7991415/", "urlToImage": "https://images.indianexpress.com/2022/06/your-daily-wrap-4.jpg", "publishedAt": "2022-06-25T15:05:00Z", "content": "A day after the Supreme Court upheld the clean chit given to then Gujarat chief minister Narendra Modi in 2002 riots case, the Gujarat anti-terrorist squad (ATS) arrested activist Teesta Setalvad in … [+5313 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anonna Dutt", "title": "Flown to Delhi for treatment, man shot during Prophet remark protests in Ranchi clings on to life", "description": "According to the family, the bullet had reached Nadeem's carotid artery, with the doctors fearing that his seizures were a result of either oxygen depravation to the brain or a blood clot in the brain.", "url": "https://indianexpress.com/article/cities/delhi/ranchi-nupur-sharma-prophet-remarks-protest-7991420/", "urlToImage": "https://images.indianexpress.com/2022/06/Ranchi-Protester-Main.jpg", "publishedAt": "2022-06-25T14:54:47Z", "content": "Nadeem Ansari, 24, was airlifted to Delhi on Saturday with his condition not improving after days of treatment at Rajendra Institute of Medical Sciences (RIMS)-Ranchi. He was shot at the back of his … [+2684 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Umran Malik should be in T20 World Cup team, feels Vengsarkar", "description": "Umran had picked up 22 wickets in 14 games for Sunrisers Hyderabad in the IPL this year but it is his ability to bowl consistently at 95 miles per hour that has caught the imagination of all.", "url": "https://indianexpress.com/article/sports/cricket/umran-malik-should-be-in-t20-world-cup-team-feels-vengsarkar-7991416/", "urlToImage": "https://images.indianexpress.com/2022/06/Umran.jpg", "publishedAt": "2022-06-25T14:52:58Z", "content": "Impressed by his raw pace, former India skipper Dilip Vengsarkar feels rookie pacer Umran Malik should board the flight to Australia for this year’s T20 World Cup.“I hope so because he (Umran) is a v… [+2980 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Parenting Desk", "title": "How to manage plantar fasciitis during pregnancy", "description": "Certain pains and discomforts need to be resolved so that you can be as comfortable as possible throughout your pregnancy.", "url": "https://indianexpress.com/article/parenting/health-fitness/how-to-manage-plantar-fasciitis-during-pregnancy-7990290/", "urlToImage": "https://images.indianexpress.com/2022/06/close-up-hands-massaging-foot.jpg", "publishedAt": "2022-06-25T14:51:00Z", "content": "Pregnancy comes with a lot of physical and physiological changes in the body, that is the reason why pregnant women feel a lot of pain and discomfort. Certain pains and discomforts need to be resolve… [+4274 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Debraj Deb", "title": "IPFT faction says NC Debbarma is acting as BJP’s B-team, announces merger with TIPRA Motha", "description": "Stating that the IPFT suffered a split at least four to five times before, the outgoing leaders Saturday blamed NC Debbarma for creating an impasse which led to their departure.", "url": "https://indianexpress.com/article/political-pulse/nc-debbarma-ipft-faction-bjp-tipra-motha-7991401/", "urlToImage": "https://images.indianexpress.com/2022/06/NC-Debbarma.jpg", "publishedAt": "2022-06-25T14:45:05Z", "content": "Criticising Indigenous Peoples Front of Tripuras (IPFT) supremo N C Debbarma for acting as the B-team of the ruling BJP, a faction of the party announced that it is joining Tripura ADCs ruling TIPRA … [+4036 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "CAA নিয়ে বঙ্গ বিজেপিতে অসন্তোষ, তার মধ্যেই শুভেন্দুর মুখে NRC-র চড়া দাবি", "description": "স্রেফ ধর্মীয় বা সাম্প্রদায়িক দৃষ্টিতে এনআরসিকে দেখলে হবে না। জাতীয় সুরক্ষার স্বার্থেই ভারতের সীমান্তবর্তী রাজ্যগুলিতে জাতীয় নাগরিকপঞ্জি প্রয়োজন বলে জানান শুভেন্দু অধিকারী।", "url": "https://bengali.indianexpress.com/west-bengal/suvendu-adhikari-on-nrc-461730/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/02/Suvendu-Adhikari-1.jpg", "publishedAt": "2022-06-25T14:44:14Z", "content": "- , \r\n , ‘ , -, , ’\r\n - , - , \r\n , , - \r\n , \r\nStay updated with the latest news headlines and all the latest Westbengal news download Indian Express Bengali App.\r\nWeb Title: Suvendu adhikari on nrc"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Police were mute spectators’: AAP councillors locked up in school, party workers assaulted in Surat", "description": "While two AAP leaders were beaten up, four councillors from the party were locked up in the school and three cars belonging to the leaders were damaged in the clash at municipal school no. 252-343 at Ramnagar Vasahat in the Kapodara area.", "url": "https://indianexpress.com/article/cities/surat/police-mute-spectators-aap-councillors-locked-school-party-workers-assaulted-surat-7991399/", "urlToImage": "https://images.indianexpress.com/2022/06/gujarat-aap.png", "publishedAt": "2022-06-25T14:42:29Z", "content": "The last day of Shala Praveshotsav witnessed unruly scenes at a municipal school in Surat as around 50 youths assaulted local leaders and councillors from the Aam Aadmi Party (AAP) allegedly in the p… [+2442 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "A. Kameshwari", "title": "Shah Rukh Khan calls Pathaan the ‘kind of film I wanted to do for 30 years,’ hints at possibility of sequel", "description": "Shah Rukh Khan calls Pathaan a dream that came true for him, producer Aditya Chopra and director Siddharth Anand. He says the film will see him perform action sequences like the way he always wanted.", "url": "https://indianexpress.com/article/entertainment/bollywood/shah-rukh-khan-calls-pathaan-the-kind-of-film-i-wanted-to-do-for-30-years-hints-at-possibility-of-sequel-7991406/", "urlToImage": "https://images.indianexpress.com/2022/06/PATHAAN-1200.jpg", "publishedAt": "2022-06-25T14:39:57Z", "content": "Shah Rukh Khan is excited for Pathaan, which marks his comeback to films after 2018’s Zero. The actor, who celebrated 30 years of being a Bollywood actor on Saturday, shared with his fans that Pathaa… [+3006 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "India vs Ireland 1st T20 Match Live Streaming: When and where to watch?", "description": "Ind vs IRE Live 1st T20I Match Streaming Details: When And Where To Watch IND vs IRE T20 live Match: A new-look Indian cricket team will face Ireland in the first T20I as Hardik Pandya looks to make a good first impression as captain.", "url": "https://indianexpress.com/article/sports/cricket/india-vs-ireland-1st-t20i-live-streaming-date-time-ist-tv-channels-7991383/", "urlToImage": "https://images.indianexpress.com/2022/06/IND-IRE.jpg", "publishedAt": "2022-06-25T14:34:04Z", "content": "Live Streaming of India Vs Ireland, 1st T20 Match: A new-look Indian cricket team will face Ireland in the first T20I on Sunday as Hardik Pandya looks to make a good first impression as captain.The B… [+1281 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Pet health: Ten foods that you must never give to your dog", "description": "Chocolate tops the list of toxic food for pets!", "url": "https://indianexpress.com/article/lifestyle/health/these-food-items-should-be-kept-at-bay-from-your-dog-7991163/", "urlToImage": "https://images.indianexpress.com/2022/06/Dog-feature.png", "publishedAt": "2022-06-25T14:30:39Z", "content": "Food can be a tricky thing when it comes to your dog. One has to be sure whether the food given to their pet dogs is healthy. Sometimes, people think human foods go well with their pet’s diet, but it… [+3832 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "‘জীবন বাঁচবে’, ঐতিহাসিক আগ্নেয়াস্ত্র নিয়ন্ত্রণ নির্দেশনামায় সাক্ষর করে প্রতিক্রিয়া বাইডেনের", "description": "সম্প্রতি টেক্সাসের একটি প্রাথমিক বিদ্যালয়ে ১৯ জন ছাত্র এবং দুই শিক্ষক খুন হয়েছিলেন। আর, তার পরই আগ্নেয়াস্ত্র নিয়ন্ত্রণ বিধিতে উদ্যোগী হয় মার্কিন প্রশাসন।", "url": "https://bengali.indianexpress.com/general-news/joe-biden-signs-landmark-gun-measure-461721/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/biden.jpg", "publishedAt": "2022-06-25T14:27:51Z", "content": ", ‘ ’ , -, \r\n , , ‘ , ’ \r\n - , \r\n , , , , - , \r\n , , \r\nRead full story in English\r\nStay updated with the latest news headlines and all the latest General news download Indian Express Bengali App.\r\nWe… [+44 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "Tamil Nadu man goes viral after putting up posters looking for bride", "description": "After failing to find a perfect match for five years, a 27-year-old engineer has put up posters with all his details across a town in Madurai.", "url": "https://indianexpress.com/article/trending/trending-in-india/tamil-nadu-man-goes-viral-after-putting-up-posters-looking-for-bride-7991296/", "urlToImage": "https://images.indianexpress.com/2022/06/man-wedding-poster.jpg", "publishedAt": "2022-06-25T14:21:52Z", "content": "Gone are the days when people found their perfect match through “rishta aunties” or newspaper ads. While people perhaps have gone online and veered towards matrimonial sites, it is actually billboard… [+1818 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Ludhiana: AAP leader Ajaypal Singh Gill found dead in house", "description": "Ajaypal Singh Gill was elected the chairman of the Punjab State Cooperative Agricultural Development Bank, Machhiwara branch, only two days ago.", "url": "https://indianexpress.com/article/cities/ludhiana/ludhiana-aap-leader-ajaypal-singh-gill-found-dead-7991387/", "urlToImage": "https://images.indianexpress.com/2022/06/Ajaypal-Singh-Gill.jpg", "publishedAt": "2022-06-25T14:16:47Z", "content": "Aam Aadmi Party (AAP) leader Ajaypal Singh Gill, 62, allegedly died by suicide at his residence in Machhiwara of Ludhiana district, Saturday.He was elected the chairman of the Punjab State Cooperativ… [+1679 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Vaibhav Jha", "title": "Former Gujarat DGP Sreekumar arrested a day after SC upholds clean chit to Modi", "description": "The FIR cites observations from the Supreme Court verdict to the effect that disgruntled officers purposefully made false allegations.", "url": "https://indianexpress.com/article/cities/ahmedabad/former-gujarat-dgp-sreekumar-arrested-after-sc-upholds-clean-chit-modi-7991389/", "urlToImage": "https://images.indianexpress.com/2022/06/sreekumar-1.jpg", "publishedAt": "2022-06-25T14:16:43Z", "content": "The Ahmedabad Detection of Crime Branch (DCB) arrested retired DGP R B Sreekumar, even as another police team from Gujarat reached the house of activist Teesta Setalvad in Mumbai on Saturday, a day a… [+2225 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "J&K: Mehbooba Mufti urges youth to shun militancy", "description": "She emphasised that while the Central government is “taking away our land, jobs and resources, do not let them take away our courage”.", "url": "https://indianexpress.com/article/cities/jammu/jk-mehbooba-mufti-youth-militancy-7991377/", "urlToImage": "https://images.indianexpress.com/2022/06/mehbooba-mufti.jpg", "publishedAt": "2022-06-25T14:12:51Z", "content": "Former J&amp;K chief minister and PDP chief Mehbooba Mufti on Saturday urged the youth to shun violence lest become cannon fodder for the security forces’ anti-militancy operations in Jammu and Kashm… [+2056 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shubhra Gupta", "title": "Shah Rukh Khan: 30 years ago, a star was born and his ‘adaa’ still has it", "description": "On that motorcycle, looking like any of your millions of show-offy young Indian men, leaving the handle-bars, jumping up on the seat, Shah Rukh Khan sang 'Koi na koi chahiye, pyaar karne waala'. And that was that.", "url": "https://indianexpress.com/article/entertainment/bollywood/shah-rukh-khan-30-years-ago-a-star-was-born-and-his-adaa-still-has-it-7991344/", "urlToImage": "https://images.indianexpress.com/2022/06/shah-rukh-khan-1200-2.jpg", "publishedAt": "2022-06-25T14:12:46Z", "content": "Hero ki entry is such a cliche. And Shah Rukh Khan’s entry in Deewana was the mostest of all cliches– bowling along on a motorcycle on Marine Drive. It was 1992. The Raj Kanwar film, headlined by its… [+3401 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tanushree Ghosh", "title": "How the documentary Trans Kashmir individualises a community which is often kept at bay", "description": "A new documentary by S Akmal Hanan and Surbhi Dewan shines a personalised light on a section of Kashmir nobody wants to talk about — its transgender community", "url": "https://indianexpress.com/article/express-sunday-eye/how-the-documentary-trans-kashmir-individualises-a-community-which-is-often-kept-at-bay-7991181/", "urlToImage": "https://images.indianexpress.com/2022/06/Shabnum_1200.jpg", "publishedAt": "2022-06-25T14:07:17Z", "content": "Called Khwaja Sara (in Persian), they enjoyed a certain respect during the Mughal rule in Kashmir, between 1586 and 1751. The Mughals employed hijras in the womens quarters, because their several wiv… [+5840 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Abhishek Purohit", "title": "MP show how to get one hand on Ranji Trophy: Bat over 177 overs and bowl smartly wide outside off", "description": "Rajat Patidar slammed an imperious ton to knock the stuffing out of Mumbai and strengthened MP’s control on the final.", "url": "https://indianexpress.com/article/sports/cricket/mp-show-how-to-get-one-hand-on-ranji-trophy-bat-over-177-overs-and-bowl-smartly-wide-outside-off-7991355/", "urlToImage": "https://images.indianexpress.com/2022/06/Patidar-2.jpg", "publishedAt": "2022-06-25T14:00:32Z", "content": "Mumbai may have had a tiny window of opportunity when they reduced Madhya Pradesh to 430 for 6 a lead of 56 for MP on the fourth morning of the Ranji Trophy final at the Chinnaswamy Stadium in Bengal… [+5712 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sweety Kumari", "title": "GJM leader interview: ‘BJP won’t ever give Gorkhas a separate state …They’ve only taken our votes, not done anything’", "description": "The Bimal Gurung-led GJM is opposing the election and has likened the semi-autonomous body’s polls to a “stillborn baby”. Last month, Gurung wrote to CM Mamata Banerjee, urging her to defer the election.", "url": "https://indianexpress.com/article/political-pulse/gjm-leader-interview-gta-polls-7991308/", "urlToImage": "https://images.indianexpress.com/2022/06/Roshan-Giri.jpg", "publishedAt": "2022-06-25T13:59:38Z", "content": "After 10 years, the Gorkhaland Gorkha Territorial Administration (GTA) election will take place on Sunday. Once where it led the agitation for a separate Gorkhaland state, the Gorkha Janmukti Morcha … [+4292 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rupsa Chakraborty", "title": "Understanding Covid surge: ‘None of the newer Omicron sub-variants appears to be more virulent’", "description": "We need to constantly remind ourselves that vaccines are designed to create an immune response that prevents severe disease, and the present vaccines and boosters appear to be doing an excellent job. Most hospitalised patients have comorbidities and are admit…", "url": "https://indianexpress.com/article/lifestyle/health/dr-lancelot-pinto-covid-surge-omicron-sub-variants-7991346/", "urlToImage": "https://images.indianexpress.com/2022/06/doc-1.jpg", "publishedAt": "2022-06-25T13:55:47Z", "content": "WHY? Dr Lancelot Pinto is a proponent of collaborative self-management for chronic respiratory diseases and works toward empowering patients to best manage their illnesses in collaboration with their… [+5559 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Hardik relishes captaincy, says it brings best out of him", "description": "Playing under two talismanic skippers in Mahendra Singh Dhoni and Virat Kohli has taught Hardik a lot about leadership qualities, but he said every captain has their own style.", "url": "https://indianexpress.com/article/sports/cricket/hardik-relishes-captaincy-says-it-brings-best-out-of-him-7991340/", "urlToImage": "https://images.indianexpress.com/2022/06/hardik-india-t20-world-cup.jpg", "publishedAt": "2022-06-25T13:49:25Z", "content": "He struck gold in his debut season as captain in the IPL, and Hardik Pandya admits that responsibility brings out the best of him on a cricket field.Hardik, who led the Gujarat Titans to the IPL titl… [+1703 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "‘He pulled out a gun, put it on my neck’: Woman shot at by former schoolmate who was stalking her", "description": "In her complaint, the woman, who hails from Ghaziabad, said she stays in a paying guest accommodation in Baskushla, IMT Manesar, and has been working in a private company in Sector 8.", "url": "https://indianexpress.com/article/cities/delhi/he-pulled-out-gun-neck-woman-shot-former-schoolmate-stalking-7991332/", "urlToImage": "https://images.indianexpress.com/2022/06/gun-shot-1-2.jpg", "publishedAt": "2022-06-25T13:44:13Z", "content": "A 19-year-old woman was allegedly shot at by her former schoolmate, who she said had been stalking her for some time, in IMT Manesar on Saturday morning. Police said the woman suffered a bullet wound… [+2136 chars]"}]}