{"status": "ok", "totalResults": 434, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "EC allows counting for RS seats in Haryana, passes order to reject Shiv Sen MLA in Maharashtra and permits counting", "description": "In Maharashtra, the contest for the sixth Rajya Sabha seat turned into a battle between the Shiv Sena’s Sanjay Pawar and Dhananjay Mahadik of the BJP, both of whom are from Kolhapur.", "url": "https://indianexpress.com/article/india/rajya-sabha-elections-haryana-results-ec-shiv-sena-mla-maharashtra-counting-7963757/", "urlToImage": "https://images.indianexpress.com/2022/06/Haryana.jpeg", "publishedAt": "2022-06-11T00:49:01Z", "content": "The Election Commission in its post midnight order noted that it will allow counting of votes to commence in Maharashtra after directing the Returning Officer to reject the vote cast by Shiv Sena MLA… [+2774 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Anubrata Mondal’s bodyguard sent to CBI custody for eight days", "description": "CBI arrested Saigal on Thursday night after nearly five hours of interrogation in the alleged cattle smuggling case. On Friday, Saigal was produced before a special CBI court in Asansol, which remanded him to CBI custody for eight days.", "url": "https://indianexpress.com/article/cities/kolkata/anubrata-mondals-bodyguard-sent-to-cbi-custody-for-eight-days-7963754/", "urlToImage": "https://images.indianexpress.com/2022/06/CBI-2.jpg", "publishedAt": "2022-06-11T00:48:26Z", "content": "Saigal Hossain, the bodyguard of TMC Birbhum district president Anubrata Mondal has been remanded in CBI custody for eight days.CBI arrested Saigal on Thursday night after nearly five hours of interr… [+1282 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Over 100 new Covid cases after 3 months", "description": "The state's daily Covid-19 tally had crossed the century mark for the last time on March 11 when it reported 106 cases.", "url": "https://indianexpress.com/article/cities/kolkata/over-100-new-covid-cases-after-3-months-7963761/", "urlToImage": "https://images.indianexpress.com/2022/02/coronavirus-1-2-3-8.jpg", "publishedAt": "2022-06-11T00:47:10Z", "content": "West Bengal reported over a hundred new Covid-19 cases on Friday after three months, Health Department officials said. The state recorded 107 new cases in the last 24 hours, taking the tally to 20,20… [+15 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "HC orders transfer of defamation suit against Suvendu to Kolkata", "description": "Banerjee filed the defamation suit before the Diamond Harbour court in South 24 Parganas district, alleging that Adhikari had made “unsavoury remarks” against him in a public meeting before the 2021 West Bengal Assembly elections.", "url": "https://indianexpress.com/article/cities/kolkata/hc-orders-transfer-of-defamation-suit-against-suvendu-to-kolkata-7963760/", "urlToImage": "https://images.indianexpress.com/2022/06/Calcutta-HC-1.jpg", "publishedAt": "2022-06-11T00:43:58Z", "content": "THE CALCUTTA High Court on Friday ordered the transfer of a defamation suit filed by Trinamool Congress MP Abhishek Banerjee against Leader of Opposition in West Bengal Assembly Suvendu Adhikari from… [+1215 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Haryana Rajya Sabha polls – Ajay Maken lost to media baron and BJP-backed candidate Kartikeya Sharma", "description": "After the result was announced, Kartikeya Sharma said, “I am extremely thankful to the chief minister Manohar Lal Khattar and everybody else, who supported me and gave me this opportunity to serve the people of Haryana.\"", "url": "https://indianexpress.com/article/cities/chandigarh/haryana-rajya-sabha-polls-ajay-maken-lost-to-media-baron-and-bjp-backed-candidate-kartikeya-sharma-7963756/", "urlToImage": "https://images.indianexpress.com/2022/06/rajya-sabha-cutout.png", "publishedAt": "2022-06-11T00:33:51Z", "content": "Congress in Haryana faced a major setback and was left embarrassed when after a daylong drama, results were announced for the Rajya Sabha polls. Ajay Maken lost to Kartikeya Sharma – media baron and … [+39 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Govt: 1,980 skilled workers registered on Sewa Mitra portal in six months", "description": "The portal was proposed after a large number of skilled workers returned to the state due to the Covid-19 pandemic.", "url": "https://indianexpress.com/article/cities/lucknow/govt-1980-skilled-workers-registered-on-sewa-mitra-portal-in-six-months-7963755/", "urlToImage": "https://images.indianexpress.com/2020/06/industry-2.jpg", "publishedAt": "2022-06-11T00:26:48Z", "content": "Six months after the launch of Sewa Mitra portal for a state-run home services provider agency, the Uttar Pradesh government on Friday said nearly 1,980 skilled professionals have registered with the… [+1268 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Class 12 results announced, 88.44 pass percentage a record", "description": "This year, a record 272 students featured on the top-10 merit list, out of which 144 are males and 128 females.", "url": "https://indianexpress.com/article/cities/kolkata/class-12-results-announced-88-44-pass-percentage-a-record-7963732/", "urlToImage": "https://images.indianexpress.com/2022/06/result.jpg", "publishedAt": "2022-06-11T00:22:02Z", "content": "The West Bengal Council of Higher Secondary Education (WBCHSE) on Friday announced results for the higher secondary (Class 12) examination with a record 88.44 per cent of candidates clearing the exam… [+3149 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Kanpur clash: Four accused sent to three-day police custody", "description": "The Kanpur police arrested all four persons from Lucknow, a day after clashes broke out in Kanpur on June 3 during a protest against statements made against the Prophet by former BJP spokesperson Nupur Sharma during a TV debate on May 27.", "url": "https://indianexpress.com/article/cities/lucknow/kanpur-clash-four-accused-sent-to-three-day-police-custody-7963750/", "urlToImage": "https://images.indianexpress.com/2022/04/police-759-1.jpg", "publishedAt": "2022-06-11T00:21:44Z", "content": "A local court has sent four prime accused for last Friday’s clashes in Kanpur to police custody for three days. The police had sought 14 days’ custody to question them in detail about their links, co… [+691 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Students rejoice, say made the most of online classes", "description": "Adisha Debsarma, a student of Dinhata Soni Debi Jain High School, topped the examination securing 99.6 per cent.", "url": "https://indianexpress.com/article/cities/kolkata/students-rejoice-say-made-the-most-of-online-classes-7963734/", "urlToImage": "https://images.indianexpress.com/2022/06/kolkata.jpg", "publishedAt": "2022-06-11T00:21:07Z", "content": "The West Bengal Council of Higher Secondary Education on Friday declared the Higher Secondary examination results with 272 students featuring on the top-10 merit list by overcoming all hurdles coming… [+2076 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Cop shoots self dead after killing woman, injuring two in Kolkata", "description": "“Two persons, a woman and the policeman, died and two others suffered bullet injuries in the incident,” confirmed Additional Commissioner of Police Praveen Tripathi.", "url": "https://indianexpress.com/article/cities/kolkata/cop-shoots-self-dead-after-killing-woman-injuring-two-in-kolkata-7963738/", "urlToImage": "https://images.indianexpress.com/2022/06/firing.jpg", "publishedAt": "2022-06-11T00:17:47Z", "content": "A police constable allegedly went on a shooting spree, killing a woman and injuring two others before shooting himself dead with his service rifle in a broad daylight near the Bangladesh Deputy High … [+3192 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Amit Sharma", "title": "Uttar Pradesh: Two constables booked for ‘beating up man over accident’", "description": "According to reports, on June 6, the complainant, Komal Singh alias Bijju, was returning home in a tempo when it allegedly hit a motorcycle the two constables were traveling on.", "url": "https://indianexpress.com/article/cities/lucknow/uttar-pradesh-two-constables-booked-for-beating-up-man-over-accident-7963747/", "urlToImage": "https://images.indianexpress.com/2022/05/police-759-1.jpg", "publishedAt": "2022-06-11T00:17:18Z", "content": "DAYS AFTER a man was allegedly beaten up by two police constables after the vehicle he was driving hit the latter’s motorcycle, an FIR was registered against the two cops at Ganganagar police station… [+1870 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Day 1: House adjourned after obituary references", "description": "Making the obituary references, Speaker Biman Banerjee read out accounts of their lives and work. The opposition BJP boycotted the proceedings in protest against the suspension of its five MLAs, including Leader of Opposition Suvendu Adhikari.", "url": "https://indianexpress.com/article/cities/kolkata/day-1-house-adjourned-after-obituary-references-7963739/", "urlToImage": "https://images.indianexpress.com/2022/06/West_Bengal_Assembly-copy.jpg", "publishedAt": "2022-06-11T00:15:07Z", "content": "THE MONSOON Session of the West Bengal assembly was adjourned on the first day on Friday after obituary references to eminent personalities who have passed away, including Bollywood singer KK.Making … [+1374 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gorakhpur SP, Congress involved in divisive politics for electoral gains: Nadda", "description": "Addressing a ‘Garib Kalyan Sabha’ in Gorakhpur, Nadda said, “I don't speak about any caste, faith or anything that might create a division.", "url": "https://indianexpress.com/article/cities/lucknow/gorakhpur-sp-congress-involved-in-divisive-politics-for-electoral-gains-nadda-7963733/", "urlToImage": "https://images.indianexpress.com/2022/06/JP-nadda-kolkata.jpg", "publishedAt": "2022-06-11T00:11:54Z", "content": "Bharatiya Janata Party (BJP) National President Friday lashed out former state chief minister Akhilesh Yadav while calling him an irersponsible leader and said that the Samajwadi Party along with the… [+2760 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Commodore P R Hari takes charge as CMD of GRSE", "description": "He has a vast experience of over 32 years in warship operations, maintenance, design and shipbuilding.", "url": "https://indianexpress.com/article/cities/kolkata/commodore-p-r-hari-takes-charge-as-cmd-of-grse-7963743/", "urlToImage": "https://images.indianexpress.com/2022/06/Indian-expressss-3.jpg", "publishedAt": "2022-06-11T00:11:52Z", "content": "Commodore P R Hari, IN (Retd), took over as the Chairman &amp; Managing Director of Garden Reach Shipbuilders &amp; Engineers (GRSE) Ltd on Friday, said GRSE sources.He has a vast experience of over … [+704 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Appeal to Haryana for water on humanitarian grounds: CM Arvind Kejriwal", "description": "Visiting the Wazirabad barrage on Friday, CM Arvind Kejriwal said the level of water at Wazirabad pond has dropped from the normal of 674.5 ft to 667.7 ft.", "url": "https://indianexpress.com/article/cities/delhi/appeal-to-haryana-for-water-on-humanitarian-grounds-cm-arvind-kejriwal-7963700/", "urlToImage": "https://images.indianexpress.com/2022/05/Kejriwal-1200-3-1.jpg", "publishedAt": "2022-06-10T23:35:29Z", "content": "Delhis water production has fallen by around 100 MGD (million gallons per day), according to Delhi Jal Board (DJB) vice-chairman Saurabh Bharadwaj.Visiting the Wazirabad barrage on Friday, he said th… [+2148 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Einstein Box vs Newton Box: Delhi HC restrains Flipkart from offering educational product", "description": "Justice Jyoti Singh has further restrained the e-commerce platform and others from “copying, reproducing, adapting, altering, rearranging” the ‘Einstein Box’ products.", "url": "https://indianexpress.com/article/cities/delhi/einstein-box-vs-newton-box-delhi-hc-restrains-flipkart-from-offering-educational-product-7963724/", "urlToImage": "https://images.indianexpress.com/2022/05/Delhi-HC-6-1-3.jpeg", "publishedAt": "2022-06-10T23:26:37Z", "content": "In a trademark fight over products named after two world-renowned physicists Albert Einstein and Isaac Newton the Delhi High Court has restrained Flipkart and those associated with it from advertisin… [+3831 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Past decade saw increase in number of women voters: Book", "description": "The book, Women Voters in Indian Elections – Changing Trends and Emerging Patterns, has been edited by Prof Sanjay Kumar of the Centre for the Study of Developing Societies.", "url": "https://indianexpress.com/article/india/past-decade-saw-increase-in-number-of-women-voters-book-7963725/", "urlToImage": "https://images.indianexpress.com/2022/06/voting-1200-4.jpg", "publishedAt": "2022-06-10T23:24:50Z", "content": "The focus of Indias electoral politics over the past decade has shifted towards womens participation, corresponding with a rise in the number of women voters, according to a new book released Friday.… [+2253 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Code of conduct violated: BJP, MVA", "description": "The BJP urged the Election Commission of India (ECI) to declare the votes cast by Jitendra Awadh (NCP), Yashomati Thakur (Congress) and Suhas Kande (Shiv Sena) as invalid.", "url": "https://indianexpress.com/article/cities/mumbai/code-of-conduct-violated-bjp-mva-7963713/", "urlToImage": "https://images.indianexpress.com/2022/06/Uddhav-3col.jpg", "publishedAt": "2022-06-10T23:19:44Z", "content": "The counting for the six Rajya Sabha seats in Maharashtra was abruptly stopped on Friday after both the BJP and the ruling Maha Vikas Aghadi (MVA) objected to votes cast by each other, alleging viola… [+1866 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "54% of transplanted trees have survived, says CM Arvind Kejriwal", "description": "The policy was launched in October 2020 and so far, 54% of transplanted trees have survived, said Kejriwal.", "url": "https://indianexpress.com/article/cities/delhi/54-of-transplanted-trees-have-survived-says-cm-7963717/", "urlToImage": "https://images.indianexpress.com/2022/06/arvind-kejriwal.jpg", "publishedAt": "2022-06-10T23:18:00Z", "content": "After inspecting transplanted trees at Mayur Vihars Gharoli Dairy Park, Chief Minister Arvind Kejriwal Friday said Delhi isthe first and only state in the country to implement a Tree Transplantation … [+1048 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "HSGMC politics: Nalvi launches campaign against Daduwal", "description": "After being involved in Punjab’s religious and political affairs for decades, Daduwal had entered into management of affairs of Haryana Sikhs by getting elected president of HSGMC in August 2020.", "url": "https://indianexpress.com/article/cities/chandigarh/hsgmc-politics-nalvi-launches-campaign-against-daduwal-7963716/", "urlToImage": "https://images.indianexpress.com/2020/08/daduwal.jpg", "publishedAt": "2022-06-10T23:16:43Z", "content": "Less than two years after supporting firebrand preacher Baljit Singh Daduwal for his election as president of Haryana Sikh Gurdwara Management Committee (HSGMC ad hoc), former senior vice-president o… [+1405 chars]"}]}