{"status": "ok", "totalResults": 446, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "While You Were Asleep: Mitchell hits six straight into fan’s beer glass, Murray stuns Tsitsipas, French Open champion Swiatek to skip Berlin Open", "description": "French Open champion Iga Swiatek will not play in the next week's Berlin Open due to a shoulder injury. Andy Murray secured his first victory over a top-five opponent in six years. Daryl Mitchell makes a splash with a six into a fan's beer glass.", "url": "https://indianexpress.com/article/sports/sport-others/while-you-were-asleep-nzs-mitchell-hits-six-into-fans-beer-glass-murray-stuns-tsitsipas-french-open-champion-swiatek-to-skip-berlin-open-7963802/", "urlToImage": "https://images.indianexpress.com/2022/06/While-You-Were-Asleep-4.jpg", "publishedAt": "2022-06-11T02:53:37Z", "content": "New Zealand batsman Daryl Mitchell struck a big six off the bowling of Jack Leach on the opening day of the second Test against England at Trent Bridge and the ball went straight into a fan’s pint of… [+3091 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Punjab Agricultural University issues heatwave alert for livestock, crops", "description": "Animals and pets also require attention in view of the heat load. To avoid heat stress and dehydration, keep the animals indoors with frequent water availability and nutritious diet.", "url": "https://indianexpress.com/article/cities/ludhiana/punjab-agricultural-university-issues-heatwave-alert-for-livestock-crops-weather-maximum-temperature-7963815/", "urlToImage": "https://images.indianexpress.com/2022/06/buffalo.jpg", "publishedAt": "2022-06-11T02:48:32Z", "content": "With Punjab continuously witnessing above normal maximum temperature for June, the Punjab Agricultural University (PAU), Ludhiana, has issued an advisory to caution the state farmers against the detr… [+1457 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Arushi Jain", "title": "Jurassic World Dominion, Ms Marvel, The Broken News: Top shows, films to watch this weekend", "description": "Looking for your weekend binge? For this weekend, we have 7 titles that would be totally worth your time -- from Jurassic World Dominion to Ms Marvel on Disney Plus Hotstar.", "url": "https://indianexpress.com/article/entertainment/web-series/ms-marvel-the-broken-news-jurassic-world-3shows-films-to-watch-this-weekend-7963021/", "urlToImage": "https://indianexpress.com/wp-content/themes/indianexpress/images/IE-OGimage.jpg", "publishedAt": "2022-06-11T02:33:09Z", "content": "Gargantuan beasts living amongst us or the girl-next-door blossoming into a superhero? Trust filmmakers to come up with engaging content week after week. I, for one, still remember the awe I felt whe… [+5270 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Arushi Jain", "title": "Mika Singh rejected over 100 wedding proposals before ‘Swayamvar’: ‘It’s disgusting when a girl comes holding a tray, and you tell her..’", "description": "Mika Singh shares what kind of girl he wants to get married to, his brother Daler Mehndi's reaction to him doing a 'Swayamvar' on national television, and why he has decided to not celebrate his birthday this year.", "url": "https://indianexpress.com/article/entertainment/television/mika-singh-rejected-100-marriage-proposals-before-swayamvar-7961317/", "urlToImage": "https://images.indianexpress.com/2022/06/mika-singh-.jpg", "publishedAt": "2022-06-11T02:33:03Z", "content": "Singer Mika Singh, who unabashedly calls himself a ‘king’, is ‘confused’. These days he often finds himself at crossroads, not for any of his music albums or Bollywood project, but because he is look… [+4568 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Unrest in Howrah as protesters block roads, clash with police", "description": "In Uleberia and Panchla areas, local BJP party offices were also set on fire allegedly by protesters who demanded action against former BJP spokespersons Nupur Sharma and Naveen Kumar Jindal.", "url": "https://indianexpress.com/article/cities/kolkata/unrest-howrah-protesters-prophet-mohammed-remarks-7963797/", "urlToImage": "https://images.indianexpress.com/2022/06/1654865003066.jpeg", "publishedAt": "2022-06-11T02:32:36Z", "content": "Unrest erupted at several places in West Bengals Howrah district for the second consecutive day on Friday with protesters clashing with police personnel, setting kiosks, two-wheelers and several vehi… [+1471 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "পয়গম্বর বিরোধী মন্তব্য: বিক্ষোভে উত্তাল দেশ, নিহত ১, জায়গায় জায়গায় বন্ধ ইন্টারনেট", "description": "দিল্লি, মধ্যপ্রদেশ, তেলেঙ্গানা, গুজরাট, বিহার এবং মহারাষ্ট্রের বেশকিছু অংশে বিক্ষোভ হয়েছে।", "url": "https://bengali.indianexpress.com/general-news/remarks-against-the-prophet-1-killed-protests-erupt-across-country-454965/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/riots.jpg", "publishedAt": "2022-06-11T02:32:19Z", "content": ", , , , , , \r\n, (), ‘ ’ ( ) \r\n , ‘ ’ \r\n, , \r\n , () ,’ , ’ \r\n , \r\n , , ‘ ’\r\n , ‘ ’ () , \r\n , , , , \r\n , \r\n , , , , , \r\n , \r\n , - \r\n , , , \r\nStay updated with the latest news headlines and all the late… [+130 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rahel Philipose", "title": "Daily Briefing: The Rajya Elections 2022 results; What’s behind India’s Environmental Performance Index rating?", "description": "The Rajya Elections 2022 results; Protests break out across the country over Nupur Sharma's comments; What's behind India's Environmental Performance Index rating?; Weekend web series recommendations, and more.", "url": "https://indianexpress.com/article/live-news/top-news-briefing-today-7963796/", "urlToImage": "https://images.indianexpress.com/2022/06/Express-intro.jpg", "publishedAt": "2022-06-11T02:24:57Z", "content": "Get your weekend started with the top 5 story’s from today’s edition:The Rajya Elections 2022 results; Protests break out across the country over Nupur Sharma’s comments; What’s behind India’s Enviro… [+5063 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Rajya Sabha polls: In setback to Shiv Sena, BJP wins three seats in Maharashtra", "description": "The BJP's Dhananjay Mhadik defeated Shiv Sena's Sanjay Pawar in the fiercely contested sixth seat in Rajya Sabha polls.", "url": "https://indianexpress.com/article/cities/mumbai/maharashtra-rajya-sabha-polls-results-7963779/", "urlToImage": "https://images.indianexpress.com/2022/06/BJP-Rajya-Sabha-Maharashtra-Shiv-Sena.jpg", "publishedAt": "2022-06-11T01:51:58Z", "content": "In a major setback to the Shiv Sena, the BJP on Saturday got all of its three candidates elected in the fiercely contested Rajya Sabha elections.The candidates Union Minister Piyush Goyal, Anil Bonde… [+3315 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Chennai power cut: These parts of city to face power disruption today", "description": "Chennai power disruption June 11, Saturday: Parts of Chennai will face a power cut from 9 am to 2 pm for maintenance work today.", "url": "https://indianexpress.com/article/cities/chennai/chennai-power-cut-these-parts-of-city-to-face-power-disruption-today-7963769/", "urlToImage": "https://images.indianexpress.com/2022/06/electricity-reuters-1200-2-1-5.jpeg", "publishedAt": "2022-06-11T01:30:00Z", "content": "The Tamil Nadu Generation and Distribution Corporation (Tangedco) has announced that power will be suspended in parts of Chennai today in  Mylapore and Porur for carrying out maintenance work in the … [+390 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Varinder Bhatia", "title": "Haryana RS polls – Sulking Kuldeep Bishnoi sank Ajay Maken, Congress", "description": "According to the details shared by chief minister Manohar Lal Khattar, while one Congress vote was rejected, Kuldeep Bishnoi (Congress MLA from Adampur) “voted as per his inner conscience” and “did not vote for Congress nominee Ajay Maken”.", "url": "https://indianexpress.com/article/cities/chandigarh/haryana-rs-polls-sulking-kuldeep-bishnoi-sank-ajay-maken-congress-7963764/", "urlToImage": "https://images.indianexpress.com/2022/04/11-46.jpg", "publishedAt": "2022-06-11T00:57:51Z", "content": "The dramatic twists and turns in Rajya Sabha pollingfor two seats in Haryana ended in the wee hours today, with the Election Commission declaring BJPs nominee Krishan Panwar and BJP-JJP backed indepe… [+2991 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "EC allows counting for RS seats in Haryana, passes order to reject Shiv Sen MLA in Maharashtra and permits counting", "description": "In Maharashtra, the contest for the sixth Rajya Sabha seat turned into a battle between the Shiv Sena’s Sanjay Pawar and Dhananjay Mahadik of the BJP, both of whom are from Kolhapur.", "url": "https://indianexpress.com/article/india/rajya-sabha-elections-haryana-results-ec-shiv-sena-mla-maharashtra-counting-7963757/", "urlToImage": "https://images.indianexpress.com/2022/06/Haryana.jpeg", "publishedAt": "2022-06-11T00:49:01Z", "content": "The Election Commission in its post midnight order noted that it will allow counting of votes to commence in Maharashtra after directing the Returning Officer to reject the vote cast by Shiv Sena MLA… [+2774 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Anubrata Mondal’s bodyguard sent to CBI custody for eight days", "description": "CBI arrested Saigal on Thursday night after nearly five hours of interrogation in the alleged cattle smuggling case. On Friday, Saigal was produced before a special CBI court in Asansol, which remanded him to CBI custody for eight days.", "url": "https://indianexpress.com/article/cities/kolkata/anubrata-mondals-bodyguard-sent-to-cbi-custody-for-eight-days-7963754/", "urlToImage": "https://images.indianexpress.com/2022/06/CBI-2.jpg", "publishedAt": "2022-06-11T00:48:26Z", "content": "Saigal Hossain, the bodyguard of TMC Birbhum district president Anubrata Mondal has been remanded in CBI custody for eight days.CBI arrested Saigal on Thursday night after nearly five hours of interr… [+1282 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Over 100 new Covid cases after 3 months", "description": "The state's daily Covid-19 tally had crossed the century mark for the last time on March 11 when it reported 106 cases.", "url": "https://indianexpress.com/article/cities/kolkata/over-100-new-covid-cases-after-3-months-7963761/", "urlToImage": "https://images.indianexpress.com/2022/02/coronavirus-1-2-3-8.jpg", "publishedAt": "2022-06-11T00:47:10Z", "content": "West Bengal reported over a hundred new Covid-19 cases on Friday after three months, Health Department officials said. The state recorded 107 new cases in the last 24 hours, taking the tally to 20,20… [+15 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "HC orders transfer of defamation suit against Suvendu to Kolkata", "description": "Banerjee filed the defamation suit before the Diamond Harbour court in South 24 Parganas district, alleging that Adhikari had made “unsavoury remarks” against him in a public meeting before the 2021 West Bengal Assembly elections.", "url": "https://indianexpress.com/article/cities/kolkata/hc-orders-transfer-of-defamation-suit-against-suvendu-to-kolkata-7963760/", "urlToImage": "https://images.indianexpress.com/2022/06/Calcutta-HC-1.jpg", "publishedAt": "2022-06-11T00:43:58Z", "content": "THE CALCUTTA High Court on Friday ordered the transfer of a defamation suit filed by Trinamool Congress MP Abhishek Banerjee against Leader of Opposition in West Bengal Assembly Suvendu Adhikari from… [+1215 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Haryana Rajya Sabha polls – Ajay Maken lost to media baron and BJP-backed candidate Kartikeya Sharma", "description": "After the result was announced, Kartikeya Sharma said, “I am extremely thankful to the chief minister Manohar Lal Khattar and everybody else, who supported me and gave me this opportunity to serve the people of Haryana.\"", "url": "https://indianexpress.com/article/cities/chandigarh/haryana-rajya-sabha-polls-ajay-maken-lost-to-media-baron-and-bjp-backed-candidate-kartikeya-sharma-7963756/", "urlToImage": "https://images.indianexpress.com/2022/06/rajya-sabha-cutout.png", "publishedAt": "2022-06-11T00:33:51Z", "content": "Congress in Haryana faced a major setback and was left embarrassed when after a daylong drama, results were announced for the Rajya Sabha polls. Ajay Maken lost to Kartikeya Sharma – media baron and … [+39 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Govt: 1,980 skilled workers registered on Sewa Mitra portal in six months", "description": "The portal was proposed after a large number of skilled workers returned to the state due to the Covid-19 pandemic.", "url": "https://indianexpress.com/article/cities/lucknow/govt-1980-skilled-workers-registered-on-sewa-mitra-portal-in-six-months-7963755/", "urlToImage": "https://images.indianexpress.com/2020/06/industry-2.jpg", "publishedAt": "2022-06-11T00:26:48Z", "content": "Six months after the launch of Sewa Mitra portal for a state-run home services provider agency, the Uttar Pradesh government on Friday said nearly 1,980 skilled professionals have registered with the… [+1268 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Class 12 results announced, 88.44 pass percentage a record", "description": "This year, a record 272 students featured on the top-10 merit list, out of which 144 are males and 128 females.", "url": "https://indianexpress.com/article/cities/kolkata/class-12-results-announced-88-44-pass-percentage-a-record-7963732/", "urlToImage": "https://images.indianexpress.com/2022/06/result.jpg", "publishedAt": "2022-06-11T00:22:02Z", "content": "The West Bengal Council of Higher Secondary Education (WBCHSE) on Friday announced results for the higher secondary (Class 12) examination with a record 88.44 per cent of candidates clearing the exam… [+3149 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Kanpur clash: Four accused sent to three-day police custody", "description": "The Kanpur police arrested all four persons from Lucknow, a day after clashes broke out in Kanpur on June 3 during a protest against statements made against the Prophet by former BJP spokesperson Nupur Sharma during a TV debate on May 27.", "url": "https://indianexpress.com/article/cities/lucknow/kanpur-clash-four-accused-sent-to-three-day-police-custody-7963750/", "urlToImage": "https://images.indianexpress.com/2022/04/police-759-1.jpg", "publishedAt": "2022-06-11T00:21:44Z", "content": "A local court has sent four prime accused for last Friday’s clashes in Kanpur to police custody for three days. The police had sought 14 days’ custody to question them in detail about their links, co… [+691 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Students rejoice, say made the most of online classes", "description": "Adisha Debsarma, a student of Dinhata Soni Debi Jain High School, topped the examination securing 99.6 per cent.", "url": "https://indianexpress.com/article/cities/kolkata/students-rejoice-say-made-the-most-of-online-classes-7963734/", "urlToImage": "https://images.indianexpress.com/2022/06/kolkata.jpg", "publishedAt": "2022-06-11T00:21:07Z", "content": "The West Bengal Council of Higher Secondary Education on Friday declared the Higher Secondary examination results with 272 students featuring on the top-10 merit list by overcoming all hurdles coming… [+2076 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Cop shoots self dead after killing woman, injuring two in Kolkata", "description": "“Two persons, a woman and the policeman, died and two others suffered bullet injuries in the incident,” confirmed Additional Commissioner of Police Praveen Tripathi.", "url": "https://indianexpress.com/article/cities/kolkata/cop-shoots-self-dead-after-killing-woman-injuring-two-in-kolkata-7963738/", "urlToImage": "https://images.indianexpress.com/2022/06/firing.jpg", "publishedAt": "2022-06-11T00:17:47Z", "content": "A police constable allegedly went on a shooting spree, killing a woman and injuring two others before shooting himself dead with his service rifle in a broad daylight near the Bangladesh Deputy High … [+3192 chars]"}]}