{"status": "ok", "totalResults": 762, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Jayprakash S Naidu", "title": "Gal Constructor deaths: ‘They took our son’s body by mistake, we didn’t even get his ashes’", "description": "Baljinder, who hailed from a small village near Amritsar, worked as a rigger and foreman on P 305, which sank around 30 nautical miles (around 50 km) from Mumbai’s shore after hitting an oil rig.", "url": "https://indianexpress.com/article/cities/mumbai/gal-constructor-they-took-son-body-mistake-didnt-get-ashes-7922605/", "urlToImage": "https://images.indianexpress.com/2022/05/Baljinder-Singh.jpg", "publishedAt": "2022-05-17T22:48:57Z", "content": "A year after three barges P 305, Support Station 03 and Gal Constructor and tug boat Varaprada that was towing Gal Constructor, went a drift in the Arabian Sea after being caught in Cyclone Tauktae, … [+3041 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pinaki Chakraborty", "title": "How to tackle the inflation spiral", "description": "Fiscal and monetary expansion that happened during the pandemic has triggered an increase in debt and upward spiral of prices across the world. Global economy needs a coordinated policy effort to climb out of it", "url": "https://indianexpress.com/article/opinion/columns/tackle-inflation-spiral-7922509/", "urlToImage": "https://images.indianexpress.com/2022/05/oped-illustration-4.jpg", "publishedAt": "2022-05-17T22:45:28Z", "content": "The global macroeconomic situation is showing signs of macro instability reflected in increasing debt, deficits and inflation global debt has increased sharply during the pandemic, inflation is on th… [+5498 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "As barge Gal Constructor rusts, 137 people ‘safely rescued’ yet to get compensation", "description": "This comes even as the process of compensating the families of 86 people who died and 272 survivors on board barge P 305 and tugboat Varaprada that sunk in the Arabian Sea during the cyclone on May 17, last year, is underway.", "url": "https://indianexpress.com/article/cities/mumbai/barge-gal-constructor-rusts-peopple-safely-rescued-compensation-7922596/", "urlToImage": "https://images.indianexpress.com/2022/05/ship-1.jpg", "publishedAt": "2022-05-17T22:42:56Z", "content": "Accommodation barge Gal Constructor with 137 people on board had drifted over 100 km from Raigad to Palghar where it ran aground on May 18, last year, amid Cyclone Tauktae. A year on, no compensation… [+3610 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "Weak market debut for LIC, lists at 8% discount", "description": "LIC, India’s biggest insurer and domestic financial institution, started trading at Rs 867.20 — at a discount of 8.62 per cent — on the BSE as against the issue price of Rs 949 per share.", "url": "https://indianexpress.com/article/business/companies/weak-market-debut-for-lic-lists-at-8-per-cent-discount-7922600/", "urlToImage": "https://images.indianexpress.com/2022/05/LIC-IPO-ILLUSTRATION-REUTERS-1200-1-2.jpg", "publishedAt": "2022-05-17T22:42:38Z", "content": "Disappointing investors on listing day, shares of Life Insurance Corporation of India (LIC), which mobilised around Rs 20,557 crore through the countrys biggest initial public offering (IPO) recently… [+2583 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Abhishek Tandon", "title": "At 100 years, the University of Delhi is a ‘Mini Bharat’", "description": "Since its inception, the university has cherished the democratic values of free speech and diversity", "url": "https://indianexpress.com/article/opinion/columns/100-years-university-of-delhi-mini-bharat-7922514/", "urlToImage": "https://images.indianexpress.com/2022/05/Delhi-University-1.jpg", "publishedAt": "2022-05-17T22:30:29Z", "content": "From 750 students in 1922 to over 6 lakh students from across India in 2022, the University of Delhi (DU) has come a long way. Not only has the university evolved with the nation, but it has also pla… [+5142 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Ashwani Kumar", "title": "On sedition, the Supreme Court has aligned itself with the collective conscience of India", "description": "Hopefully, the nation will be rid of the last vestiges of colonialism that defy the will of the Age, the promise of our national charter and are at best a painful reminder of the injustices inflicted on our people", "url": "https://indianexpress.com/article/opinion/columns/sedition-supreme-court-aligned-itself-collective-conscience-india-7922511/", "urlToImage": "https://images.indianexpress.com/2022/05/SC-Sedition-2.jpeg", "publishedAt": "2022-05-17T22:30:18Z", "content": "The Supreme Courts seminal intervention in a batch of petitions challenging the constitutional validity of section 124A of the Indian Penal Code is a watershed moment in the progressive expansion of … [+5984 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Ananthakrishnan G, Lalmani Verma", "title": "Secure Shivling claim site, allow namaz: SC on Gyanvapi mosque row", "description": "Plea in Varanasi clearly seeks to change religious character: Masjid committee", "url": "https://indianexpress.com/article/india/secure-shivling-allow-namaz-sc-gyanvapi-mosque-row-7922584/", "urlToImage": "https://images.indianexpress.com/2022/05/Gyanvapi-Mosque.-1jpg-2-1.jpg", "publishedAt": "2022-05-17T22:30:17Z", "content": "Declining to stay proceedings before a Varanasi court on matters related to the Kashi Vishwanath temple-Gyanvapi mosque complex, the Supreme Court Tuesday asked the Varanasi district magistrate to se… [+6227 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "Weak LIC debut due to unfavourable mkt conditions: DIPAM", "description": "Investors should hold on to the stock for long-term value, he said. “Nobody can predict the market. We have been saying that it should not be held for a particular day but for more than a day,” Pandey told reporters after the listing of shares.", "url": "https://indianexpress.com/article/business/market/weak-lic-debut-due-to-unfavourable-mkt-conditions-dipam-7922554/", "urlToImage": "https://images.indianexpress.com/2022/05/bloomberg-lic-ipo-life-insurance-corporation-1200-1-1.jpg", "publishedAt": "2022-05-17T22:26:49Z", "content": "Department of Investment and Public Asset Management (DIPAM) Secretary Tuhin Kanta Pandey on Tuesday said the weak listing debut of the countrys largest insurer Life Insurance Corporation (LIC) on th… [+3641 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pranav Mukul, Anil Sasi", "title": "Sanjiv Bajaj: ‘Like GST Council, need a platform to sort Centre-state issues on land, energy, labour’", "description": "The Chairman and Managing Director of Bajaj Finserv Ltd, the holding group company for all the financial service businesses of the Bajaj group — flags inflation as a concern and calls for smart regulation by the RBI so the innovation in the financial sector i…", "url": "https://indianexpress.com/article/business/sanjiv-bajaj-like-gst-council-need-a-platform-to-sort-centre-state-issues-on-land-energy-labour-7922580/", "urlToImage": "https://images.indianexpress.com/2022/05/sanjiv-1.jpg", "publishedAt": "2022-05-17T22:24:21Z", "content": "Newly-elected CII President Sanjiv Bajaj says that as a country, India is primed for growth and investment, and signs of renewed activity are visible across multiple sectors, such as commodities, con… [+11398 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lalmani Verma", "title": "Gyanvapi mosque row: Survey official removed, two more days to submit report", "description": "The removal of Advocate Commissioner Ajay Kumar Mishra came on an application filed by Vishal Singh, the Special Advocate Commissioner.", "url": "https://indianexpress.com/article/india/gyanvapi-mosque-row-survey-official-removed-two-more-days-submit-report-7922573/", "urlToImage": "https://images.indianexpress.com/2022/05/PTI05_06_2022_000095B-1-1.jpg", "publishedAt": "2022-05-17T22:19:43Z", "content": "The Varanasi court on Tuesday removed the Advocate Commissioner it had appointed initially to oversee the videographic survey of the Gyanvapi mosque complex, stating that he had been highly irrespons… [+3082 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "Global headwinds pose challenges, inflation risks more accentuated: RBI", "description": "The increase in international commodity prices also imparts a net term of trade shock that is widening the trade and current account deficits,” the RBI said in its ‘State of the Economy’ report.", "url": "https://indianexpress.com/article/business/banking-and-finance/global-headwinds-pose-challenges-inflation-risks-more-accentuated-rbi-7922563/", "urlToImage": "https://images.indianexpress.com/2022/05/RBI-1.jpg", "publishedAt": "2022-05-17T22:09:43Z", "content": "The Reserve Bank of India (RBI) has said risks stemming from global developments have thwarted recovery momentum, and inflation risks have become more accentuated in recent months. The Indian economy… [+3160 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuradha Mascarenhas, Esha Roy", "title": "Explained: India topped air pollution death toll in 2019, says report", "description": "Globally, air pollution alone contributes to 66.7 lakh deaths, according to the report, which updates a previous analysis from 2015.", "url": "https://indianexpress.com/article/explained/explained-india-topped-air-pollution-death-toll-2019-7922560/", "urlToImage": "https://images.indianexpress.com/2022/05/air-pollution.jpg", "publishedAt": "2022-05-17T22:08:30Z", "content": "Air pollution was responsible for 16.7 lakh deaths in India in 2019, or 17.8% of all deaths in the country that year. This is the largest number of air-pollution-related deaths of any country, accord… [+4114 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Deeptiman Tiwary", "title": "Explained: Where coal blocks cases stand", "description": "The Supreme Court has asked the Enforcement Directorate to file a status report on over 50 cases by July 15. What cases involving coal blocks allocation are the ED and the CBI investigating, and what is their status?", "url": "https://indianexpress.com/article/explained/supreme-court-enforcement-directorate-coal-blocks-allocation-case-7922550/", "urlToImage": "https://images.indianexpress.com/2022/05/coal.jpg", "publishedAt": "2022-05-17T22:02:59Z", "content": "The Supreme Court last week asked the Enforcement Directorate to file by July 15 a status report on the over 50 cases of money laundering it is probing in connection with the coal blocks allocation s… [+6086 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Hamza Khan", "title": "Nagaur murder: Kin refuse to cremate body, point finger at Cong MLA, brother", "description": "In the FIR, Sarita says that on May 14, after leaving home for a court hearing, Jaipal called her at 3.15 pm to tell her that he had been waylaid by Moolchand Saini, Virendra Saini, and two masked men.", "url": "https://indianexpress.com/article/cities/jaipur/nagaur-murder-kin-refuse-cremate-finger-cong-mla-brother-7922548/", "urlToImage": "https://images.indianexpress.com/2022/05/Indian-express-1-3-14.jpg", "publishedAt": "2022-05-17T21:57:02Z", "content": "Three days after he was shot dead in broad daylight in Nagaur district, salt trader Jaipal Poonias body awaits cremation, with the family demanding a CBI inquiry and arrest of the accused, including … [+2175 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "MSU arson case: Despite bail order, artist unable to secure release, misses hearing", "description": "Chandramohan was arrested on May 10 for allegedly \"failing to appear\" in the ongoing court hearings in the 2018 case of attempted murder and arson when he allegedly set fire to the V-C’s office out of frustration for not getting his marksheet.", "url": "https://indianexpress.com/article/india/msu-arson-case-despite-bail-order-artist-unable-to-secure-release-misses-hearing-7922542/", "urlToImage": "https://images.indianexpress.com/2022/05/gavel-2-6.jpg", "publishedAt": "2022-05-17T21:52:57Z", "content": "The Vadodara sessions court Tuesday adjourned the hearing to a future date after Chandramohanan alumnus at the Faculty of Fine Arts of MS University and accused in the February 2018 case of attempt t… [+1062 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Govt in process of integrating e-Shram portal with One Nation One Ration Card scheme: Bhupender Yadav", "description": "Bhupender Yadav was speaking at an IE THINC Migration webinar on migrant workers and the promise of e-Shram. The webinar was part of a series on migration and there have been seven editions in the past.", "url": "https://indianexpress.com/article/india/govt-integrating-e-shram-portal-one-nation-one-ration-card-scheme-bhupender-yadav-7922540/", "urlToImage": "https://images.indianexpress.com/2022/05/bhupendra-yadav-1-1.jpg", "publishedAt": "2022-05-17T21:47:53Z", "content": "The e-Shram portal of the Ministry of Labour and Employment, which is meant to register workers in the unorganised sector and help them access social security benefits, is being integrated with the O… [+2426 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Iram Siddique", "title": "Day after Neemuch clashes: 10 detained, 5 FIRs filed", "description": "The situation was calm on Tuesday even as Section 144 (CrPC) remained in force. Of the five FIRs, two each were registered at the behest of both communities.", "url": "https://indianexpress.com/article/cities/bhopal/day-after-neemuch-clashes-10-detained-5-firs-filed-7922543/", "urlToImage": "https://images.indianexpress.com/2022/05/police-van.jpg", "publishedAt": "2022-05-17T21:45:03Z", "content": "A day after clashes broke out in Neemuch city of Madhya Pradesh over a Hanuman idol being placed near a dargah in the Old Kacheri locality, police on Tuesday detained 10 people and registered five FI… [+1814 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Assam floods: Death toll goes up to 8, Amit Shah assures help from Centre", "description": "Union Home Minister Amit Shah spoke with Assam Chief Minister Himanta Biswa Sarma to take stock of the situation, and assured that the Centre would provide the state with \"all possible help\".", "url": "https://indianexpress.com/article/cities/guwahati/assam-floods-death-toll-goes-up-to-8-amit-shah-assures-help-from-centre-7922526/", "urlToImage": "https://images.indianexpress.com/2022/05/assam-floods.jpg", "publishedAt": "2022-05-17T21:42:07Z", "content": "As incessant rain continued for the fifth day in Assam and parts of the Northeast, the Assam State Disaster Management Authority (ASDMA) on Tuesday said that one person died in Udalguri district, whi… [+1794 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Uttar Pradesh: 2 cops booked after man dies in custody", "description": "Police said that during the preliminary inquiry, they found that the doctors had advised the police team to admit Kumar to the hospital. However, the police team took him back to the police station, the officer said.", "url": "https://indianexpress.com/article/cities/lucknow/uttar-pradesh-2-cops-booked-after-man-dies-in-custody-7922534/", "urlToImage": "https://images.indianexpress.com/2022/05/UP-police-1200-1-1-2.jpg", "publishedAt": "2022-05-17T21:39:03Z", "content": "A murder FIR has been registered against two policemen and a magisterial inquiry has been ordered into the alleged custodial death of a 52-year-old businessman in Hathras. While two more policemen ha… [+1442 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Collegium nod for High Court CJs: 1 transfer, 5 elevations", "description": "The Collegium, headed by Chief Justice of India N V Ramana, also recommended the elevation of five judges as Chief Justices of High Courts.", "url": "https://indianexpress.com/article/india/collegium-nod-high-court-cj-transfer-elevations-7922537/", "urlToImage": "https://images.indianexpress.com/2022/05/Supreme-court-1100-1.jpg", "publishedAt": "2022-05-17T21:36:25Z", "content": "The Supreme Court Collegium has recommended the appointment of Justice Satish Chandra Sharma, who is currently Chief Justice of the Telangana High Court, as the new Chief Justice of the Delhi High Co… [+695 chars]"}]}