{"status": "ok", "totalResults": 470, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Maulshree Seth", "title": "Pilgrim’s progress: Religious and cultural projects get a lion’s share", "description": "The religious, cultural and regional focus of the Rs 6 lakh crore budget was evident as the CM spoke as how the government aimed at presenting to the world the upcoming Maha Kumbh as a “unique event”, referring to it as the biggest “spiritual and cultural gat…", "url": "https://indianexpress.com/article/cities/lucknow/pilgrims-progress-religious-and-cultural-projects-get-a-lions-share-7938660/", "urlToImage": "https://images.indianexpress.com/2022/05/kumbh.jpg", "publishedAt": "2022-05-27T00:47:39Z", "content": "As soon as the 2022-23 annual Budget was tabled in the Uttar Pradesh Assembly, Chief Minister Yogi Adityanath underlined as how the state government has made a provision of Rs 100 crore for the prepa… [+3212 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Trying to secure MBBS course admission for daughter, man duped of Rs 3 lakh", "description": "The complainant contacted the con man on the phone number posted with the advertisement. The con man claimed to have an office in Thane and sought money from the man for securing his daughter's admission for the MBBS course.", "url": "https://indianexpress.com/article/cities/pune/mbbs-admissions-cyber-fraud-crime-pune-7938662/", "urlToImage": "https://indianexpress.com/wp-content/themes/indianexpress/images/IE-OGimage.jpg", "publishedAt": "2022-05-27T00:42:58Z", "content": "A Pune resident was cheated to the tune of Rs 3 lakh after cyber fraudsters promised to provide admission to a MBBS course for his daughter. Police said the con man had posted a fake advertisement on… [+1178 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Parthasarathi Biswas", "title": "Cane crushing season enters last stage, Maharashtra to produce 138L tonnes of sugar this season", "description": "The total amount of subsidy to be paid to sugar mills would amount to Rs 104 crore as the state government had announced that all mills which have crushing cane from May 1 would be eligible for the subsidy.", "url": "https://indianexpress.com/article/cities/pune/sugar-cane-crushing-maharashtra-sugar-mills-monsoons-7938658/", "urlToImage": "https://images.indianexpress.com/2022/05/sugarcane-1.jpg", "publishedAt": "2022-05-27T00:39:33Z", "content": "The SUGARCANE crushing season of 2021-22 in Maharashtra has entered its last leg with just 10 lakh tonnes of cane remaining to be crushed. Sugar Commissioner Shekhar Gaikwad predicted that the season… [+2246 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Parthasarathi Biswas", "title": "Maharashtra govt writes to Centre seeking extension of deadline to procure chana", "description": "Officials say as many as 1.75 lakh farmers, who had registered for the procurement process, did not get a chance to sell their produce.", "url": "https://indianexpress.com/article/cities/pune/maharashtra-govt-writes-to-centre-seeking-extension-of-deadline-to-procure-chana-msp-rate-7938653/", "urlToImage": "https://images.indianexpress.com/2022/05/chana-dal-1.jpg", "publishedAt": "2022-05-27T00:34:10Z", "content": "Two days after central agencies completed chana procurement in Maharashtra, the state government has written to the Centre, urging it to extend the deadline for the same. Speaking to The Indian Expre… [+1926 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "1,200 state buses to ferry people for PM’s event in Rajkot tomorrow", "description": "Boghra, who is also the vice-president of the Gujarat unit of the Bharatiya Janata Party (BJP), further said the entire event was being organised by SPSST with help from the saffron party and various other organisations.", "url": "https://indianexpress.com/article/cities/rajkot/1200-state-buses-to-ferry-people-for-pms-event-in-rajkot-tomorrow-7938647/", "urlToImage": "https://images.indianexpress.com/2022/05/Guj-hospital-3col.jpg", "publishedAt": "2022-05-27T00:33:02Z", "content": "As many as 1,200 buses of the Gujarat State Road Transport Corporation (GSRTC), 600 buses belonging to private schools and scores of tractors and multi-utility vehicles (MUVs) will ferry people acros… [+3466 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Haryana cops arrest 5 of gang that demanded 50 crore from trader", "description": "A motorcycle, apparently used in the crime, and a country-made pistol has been recovered from the possession of the accused.", "url": "https://indianexpress.com/article/cities/chandigarh/cops-arrest-5-of-gang-that-demanded-50-cr-from-trader-7938648/", "urlToImage": "https://images.indianexpress.com/2022/05/arrest-32-3.jpg", "publishedAt": "2022-05-27T00:18:04Z", "content": "Haryana Police on Thursday said they had busted a gang and arrested five men who had allegedly demanded Rs 50 crore from a trader in Bawal industrial town as extortion money. Police claimed that the … [+1229 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Former Haryana CM Hooda says 7 deaths in 15 days due to ‘drug overdose’ in Sirsa", "description": "Bhupinder Singh Hooda said not only in Sirsa, in cities of Fatehabad, Kaithal, Jind, Ambala, Hisar, Rohtak, Gurgaon too, the menace of addiction was spreading in a worrying manner.", "url": "https://indianexpress.com/article/cities/chandigarh/hooda-says-7-deaths-in-15-days-due-to-drug-overdose-in-sirsa-7938642/", "urlToImage": "https://images.indianexpress.com/2022/05/Hooda-haryana.jpg", "publishedAt": "2022-05-27T00:14:02Z", "content": "Former Haryana Chief Minister, Bhupinder Singh Hooda, on Thursday expressed deep concern over the increasing use of drugs and intoxicants in Haryana and stated that as many as seven deaths had taken … [+3926 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Surat: 2 held for ‘stealing’ gold chain from jewellery store", "description": "According to police, two youths and a minor boy entered into the shop. One of them entered into the counter side and got hold of her, while the other one held her at knife point.", "url": "https://indianexpress.com/article/cities/surat/surat-2-held-for-stealing-gold-chain-from-jewellery-store-7938639/", "urlToImage": "https://images.indianexpress.com/2022/05/handcuff-4-12.jpg", "publishedAt": "2022-05-27T00:13:33Z", "content": "Two persons were arrested for allegedly stealing a gold chain worth Rs. 1.37 lakh from a jewellery shop in Surat holding an employee at knife point Thursday. However, the timely action of the employe… [+800 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kanchan Vasdev", "title": "Punjab: In bypoll to Sangrur Lok Sabha seat, AAP faces its first litmus test", "description": "The Punjab government has not lost the game of perception and lately the sacking of a minister from Mann’s Cabinet on graft charges has left it in a good stead. The party’s stock is believed to have gone up a few notches further.", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-aap-bypolls-sangrur-constituency-bhagwant-mann-7938635/", "urlToImage": "https://images.indianexpress.com/2022/05/mann-kejriwal-1.jpg", "publishedAt": "2022-05-27T00:01:29Z", "content": "With less than a month to go for bypolls to the Sangrur Lok Sabha constituency, the ruling Aam Aadmi Party faces a litmus test as the electoral battle will be its first after the party romped to powe… [+4313 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Survey Vessel built by GRSE for Navy launched", "description": "“This is the second vessel in a series of four such ships being built by GRSE for the Indian Navy and to be launched in less than six months,\" said GRSE officials.", "url": "https://indianexpress.com/article/cities/kolkata/survey-vessel-built-by-grse-for-navy-launched-7938633/", "urlToImage": "https://images.indianexpress.com/2022/05/IE-79-28.jpeg", "publishedAt": "2022-05-26T23:59:42Z", "content": "A Survey Vessel (large) built by Garden Reach Shipbuilders and Engineers (GRSE) Ltd was launched by Sarbani Dasgupta, wife of Vice Admiral Biswajit Dasgupta, Flag Officer Commanding-in-Chief, Eastern… [+1116 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Divya Goyal", "title": "NAS 2021: From ‘below national average’ to national topper, Punjab scripts turnaround in 4 yrs", "description": "NAS, conducted by the Centre in coordination with the CBSE and NCERT to assess learning outcome levels of students of class 3, 5, 8 and 10, was held on November 12 last year.", "url": "https://indianexpress.com/article/cities/ludhiana/national-achievement-survey-nas-2021-punjab-schools-education-7938631/", "urlToImage": "https://images.indianexpress.com/2022/05/school.jpeg", "publishedAt": "2022-05-26T23:47:15Z", "content": "From scoring ‘below national average’ in 11 of 15 subjects in 2017 to being the national topper in 11 subjects four years later, Punjab has scripted a turnaround in the school level education, if the… [+3968 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Coal pilferage ‘scam’: CBI summons TMC’s Canning MLA", "description": "It is alleged that several brick kiln owners in Canning would buy the smuggled coal at a cheaper price.", "url": "https://indianexpress.com/article/cities/kolkata/coal-pilferage-scam-cbi-summons-tmcs-canning-mla-7938630/", "urlToImage": "https://images.indianexpress.com/2022/05/CBI-office-4col-1.jpg", "publishedAt": "2022-05-26T23:46:09Z", "content": "The Central Bureau of Investigation (CBI) has summoned another Trinamool Congress MLA in connection with the ongoing probe into the alleged coal pilferage scam case.The central investigation agency s… [+993 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Model-actor Bidisha De found dead in Kolkata flat", "description": "Bidisha, a popular face in bridal make-up shoots, was found hanging from a ceiling fan after neighbours broke open the door, officials said. She had worked in the 2021 short film 'Bhaar- The Clown' which had popular actor Debraj Mukherjee in the lead role.", "url": "https://indianexpress.com/article/cities/kolkata/model-actor-bidisha-de-found-dead-in-kolkata-flat-7938587/", "urlToImage": "https://images.indianexpress.com/2022/05/IE-79-27.jpeg", "publishedAt": "2022-05-26T23:37:45Z", "content": "Bengali TV actor and model Bidisha De Majumdar (21) was found dead in her rented flat at Nagerbazar locality in Kolkata on Wednesday night, with police terming it a case of suicide.Bidisha, a popular… [+1828 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Chandigarh: Three stop courier delivery agents, snatch 22 parcels of diamond, gold ornaments", "description": "The complainant, Parveen Khatana told the police that his two employees - Shailendra and Rabinder Singh - were on their way to make deliveries in Jalandhar and Ludhiana.", "url": "https://indianexpress.com/article/cities/sas-nagar-mohali/three-stop-courier-delivery-agents-snatch-22-parcels-of-diamond-gold-ornaments-7938623/", "urlToImage": "https://images.indianexpress.com/2022/05/indian-express-crime-1-4.jpg", "publishedAt": "2022-05-26T23:33:37Z", "content": "Two employees of a courier company carrying 22 parcels containing gold and diamond ornaments were stopped and the jewellery was snatched from them by three men in a car in the wee hours of Wednesday.… [+1134 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Peter Vidal", "title": "Horoscope Today, May 27, 2022: Cancer, Leo, Libra and other signs — check astrological prediction", "description": "Horoscope Today, May 27, 2022: Gemini, there does seem to be a real chance that the emotional strain of the current times will have an adverse effect on your health. Bearing in mind that astrology deals with prevention rather than cure, don't let this week's …", "url": "https://indianexpress.com/article/horoscope/horoscope-today-may-27-2022-cancer-leo-libra-and-other-signs-check-astrological-prediction-7938440/", "urlToImage": "https://images.indianexpress.com/2022/03/horo2121-1-1.jpeg", "publishedAt": "2022-05-26T23:30:13Z", "content": "The Moon's entry into a lively region of your chart should come as a welcome relief. You could feel more in control of home and family affairs than may havebeen the case in the recent past, although … [+3359 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gulzarinder Chahal elected as new Punjab Cricket Association president", "description": "Chahal, who was the member of the India's junior world cup winning cricket team in the past, has played for U-16 and U-19 Punjab teams and was also part of Inter-Zonal tournaments and played for Rest Of India.", "url": "https://indianexpress.com/article/cities/sas-nagar-mohali/gulzarinder-chahal-elected-as-new-punjab-cricket-association-president-7938618/", "urlToImage": "https://images.indianexpress.com/2022/05/bindra-stadium.jpg", "publishedAt": "2022-05-26T23:28:35Z", "content": "Former cricketer and actor, Gulzarinder Singh Chahal, was on Thursday elected unopposed as the new Punjab Cricket Association president at the Annual General Meeting of the cricket association held a… [+1409 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Chandigarh: Seven firms booked for taking Rs 1.04 crore loan on fake, forged documents", "description": "The documents submitted by them were found to be fake and forged during the internal survey/audit of the bank.", "url": "https://indianexpress.com/article/cities/chandigarh/seven-firms-booked-for-taking-rs-1-04-crore-loan-on-fake-forged-documents-7938612/", "urlToImage": "https://images.indianexpress.com/2022/05/Cash-1.jpg", "publishedAt": "2022-05-26T23:22:18Z", "content": "The Chandigarh branch of Andhra Bank has filed a complaint with the police, after which seven UT-based firms were booked on Thursday for cheating the bank of Rs 1.04 crore.The bank management, in the… [+987 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "RMO held for defamatory social media posts against Ahmedabad hospital", "description": "According to police, Barot had allegedly created several fake pages on social media websites to post defamatory content against his hospital.", "url": "https://indianexpress.com/article/cities/ahmedabad/rmo-held-for-defamatory-social-media-posts-against-ahmedabad-hospital-7938610/", "urlToImage": "https://images.indianexpress.com/2022/05/handcuff-4-11.jpg", "publishedAt": "2022-05-26T23:22:02Z", "content": "A Resident Medical Officer (RMO) of UN Mehta Institute of Cardiology and Research Centre in Ahmedabad was arrested Thursday by the city cyber crime cell for allegedly posting defamatory content and f… [+1197 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Jagdeep Singh Deep", "title": "11-year-old family dispute case: Sessions Court cites SC ruling in Navjot Sidhu’s case while sentencing AAP MLA Balbir Singh", "description": "While pronouncing the judgement, the court had cited SC’s judgement in the ‘Jaswinder Singh (dead) through legal representatives vs Navjot Singh Sidhu and others'.", "url": "https://indianexpress.com/article/cities/sas-nagar-mohali/navjot-singh-sidhu-supreme-court-aap-mla-balbir-singh-dispute-7938599/", "urlToImage": "https://images.indianexpress.com/2022/05/navjot-sidhu-1.jpg", "publishedAt": "2022-05-26T23:15:00Z", "content": "The Sessions court in Ropar cited the Supreme Court judgment that recently sent Congress leader Navjot Singh Sidhu to one-year in jail while sentencing Aam Aadmi Party (AAP) MLA from Patiala (rural),… [+2249 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Man arrested for ‘looting’ Rs 47 lakh from his company", "description": "According to police, Sharma, a native of Bhind in Madhya Pradesh and resident of Kagdapith, was an employee at Saraogi Super Sales company at Hirabhai Market for the past seven years.", "url": "https://indianexpress.com/article/cities/ahmedabad/man-arrested-for-looting-rs-47-lakh-from-his-company-7938598/", "urlToImage": "https://images.indianexpress.com/2022/05/arrest-1-8-2.jpg", "publishedAt": "2022-05-26T23:12:43Z", "content": "Days after the theft of Rs 47 lakh in cash from a company’s office in Kagdapith of Ahmedabad, the Crime Branch on Thursday arrested the accused, who is an employee of the firm, from the city.The 27-y… [+1182 chars]"}]}