{"status": "ok", "totalResults": 494, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Fans crash into Kartik Aaryan in Europe as he gorges on his meal, internet says ‘let him at least eat’", "description": "Kartik Aaryan is on a holiday in Europe. Fans crashed into the actor as he was enjoying his meal and the internet has diverse opinions about it.", "url": "https://indianexpress.com/article/entertainment/bollywood/fans-crash-into-kartik-aaryan-in-europe-as-he-gorges-on-his-meal-internet-says-let-him-at-least-eat-8016244/", "urlToImage": "https://images.indianexpress.com/2022/07/kartik-aaryan.jpg", "publishedAt": "2022-07-08T04:48:06Z", "content": "After an exhaustive round of promotions for Bhool Bhulaiyaa 2, Kartik Aaryan is enjoying a much-needed break in Europe. The actor has been posting a few photos from his trip and it seems like the bre… [+1705 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Facebook owner Meta announces new virtual reality login system", "description": "The social media giant announced plans to remove the Facebook login requirement last year, after a backlash from users who had previously accessed the headsets using separate accounts from Oculus.", "url": "https://indianexpress.com/article/technology/social/facebook-owner-meta-announces-new-virtual-reality-login-system-8016285/", "urlToImage": "https://images.indianexpress.com/2022/07/facebook-virtual-reality.jpg", "publishedAt": "2022-07-08T04:42:41Z", "content": "Meta Platforms Inc is modifying how users log onto its virtual reality headsets, backtracking on an earlier change to require accounts from the company’s flagship Facebook app on the devices while pr… [+1828 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Ranbir Kapoor wants ‘lots of kids’ with Alia Bhatt, wonders if equation with Rishi Kapoor could impact bond with his own child", "description": "Ranbir Kapoor said that as of right now, he might just imbibe the value system that he has inherited from his family onto his unborn child, but as time goes on, things might change.", "url": "https://indianexpress.com/article/entertainment/bollywood/ranbir-kapoor-wants-lots-of-kids-with-alia-bhatt-equation-with-rishi-kapoor-8016267/", "urlToImage": "https://images.indianexpress.com/2022/04/rishi1200.jpg", "publishedAt": "2022-07-08T04:41:26Z", "content": "Actor Ranbir Kapoor has said in an interview that he wants ‘lots of children’ with wife Alia Bhatt, and that this is something they’ve been discussing. Alia and Ranbir tied the knot earlier this year… [+1599 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anwesh Banerjee", "title": "Mitr, My Friend: Revathy’s National Award-winning directorial debut is an ode to identities lost in transit", "description": "Revathy's directorial debut, starring a career best performance by Shobhana, is a deeply relevant film that talks about immigration, cultural losses and the journey of a woman to find herself in the lonely corridors of virtual chatrooms.", "url": "https://indianexpress.com/article/entertainment/entertainment-others/mitr-my-friend-revathys-national-award-winning-directorial-debut-is-an-ode-to-identities-lost-in-transit-8009641/", "urlToImage": "https://images.indianexpress.com/2022/07/Feature-Image-2-4.png", "publishedAt": "2022-07-08T04:41:06Z", "content": "As I watched Mitr, My friend, lines from Chitra Banerjee Divakarunis poem Indian Movie, New Jersey kept flooding my mind. In the poem, Divakaruni captures the plight of first-generation immigrants li… [+7774 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Rupee falls 12 paise to 79.25 against US dollar in early trade", "description": "At the interbank foreign exchange, the rupee opened at 79.20 against the American dollar, then lost ground to quote at 79.25, registering a fall of 12 paise from the last close.", "url": "https://indianexpress.com/article/business/market/rupee-vs-us-dollar-today-july-8-currency-market-record-low-rbi-norms-8016287/", "urlToImage": "https://images.indianexpress.com/2022/07/indian-rupee-express-archive-1200.jpg", "publishedAt": "2022-07-08T04:40:53Z", "content": "The rupee depreciated 12 paise to 79.25 against the US dollar in early trade on Friday tracking the strength of the American currency and persistent foreign fund outflows.At the interbank foreign exc… [+1927 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Hardik Pandya focussed on white-ball now, but open to playing Test cricket", "description": "All-rounder slammed 51 off 33 balls and then claimed 4 for 33 in India’s 50-run win over England in the first T20I in Southampton", "url": "https://indianexpress.com/article/sports/cricket/hardik-pandya-focussed-on-white-ball-now-but-open-to-playing-test-cricket-8016281/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-4-1.jpg", "publishedAt": "2022-07-08T04:40:07Z", "content": "India all-rounder Hardik Pandya has indicated that he is open to the possibility of playing Test cricket, but has added that with both T20I and ODI World Cups coming up, his focus is on white-ball cr… [+1930 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "FINA to investigate after Tokyo Olympian Mary-Sophie Harvey says she was drugged", "description": "The 22-year-old Canadian wrote on Instagram that she woke up \"completely lost\" with \"dozens of bruises\" on her body after the incident.", "url": "https://indianexpress.com/article/sports/sport-others/fina-to-investigate-after-tokyo-olympian-mary-sophie-harvey-says-she-was-drugged-8016288/", "urlToImage": "https://images.indianexpress.com/2022/07/Mary-Sophie-Harvey.jpg", "publishedAt": "2022-07-08T04:35:21Z", "content": "Swimming’s global governing body FINA said on Thursday it was in contact with Swimming Canada after Tokyo Olympian Mary-Sophie Harvey said she was drugged on the final night of this year’s World Cham… [+728 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Expert who helped Aditya Narayan lose ‘six kg in six weeks’ shares the singer’s diet and fitness routine", "description": "His physician, Dr Vishakha Shivdasani, told indianexpress.com that he wishes to lose 3-4ks more. \"He is extremely motivated,\" she said.", "url": "https://indianexpress.com/article/lifestyle/fitness/aditya-narayan-weight-loss-fitness-diet-dr-vishakha-shivdasani-8009912/", "urlToImage": "https://images.indianexpress.com/2022/07/aditya-narayan_1200_insta.jpg", "publishedAt": "2022-07-08T04:30:09Z", "content": "Aditya Narayan often shares glimpses of his fitness sessions on Instagram. Now, the 34-year-old playback singer, who recently embraced fatherhood, has opened up about looking and feeling “smashing” a… [+3476 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Debraj Deb", "title": "Tripura: With less than 9 months to go for Assembly polls, BJP chalks out strategy to strengthen organisation", "description": "Tripura BJP’s top leadership meets at state-level Karyakarini Sabha held at Udaipur in Gomati district, 50 km from Agartala.", "url": "https://indianexpress.com/article/north-east-india/tripura/tripura-assembly-polls-bjp-strategy-8016275/", "urlToImage": "https://images.indianexpress.com/2022/07/tripura.jpg", "publishedAt": "2022-07-08T04:29:17Z", "content": "With less than nine months to go for the general assembly elections in Tripura, the states ruling Bharatiya Janata Party (BJP) on Thursday said it has taken stock of the partys organisational strengt… [+1713 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Who is Shinzo Abe, Japan’s former prime minister?", "description": "Shinzo Abe shot in Japan: Japan’s longest-serving post-war premier, Abe occupied the top post for eight years between 2012 and 2022, and before that, from 2006 to 2007. The former prime minister announced his resignation in August 2020, citing health concerns.", "url": "https://indianexpress.com/article/world/who-is-shinzo-abe-japan-former-prime-minister-8016251/", "urlToImage": "https://images.indianexpress.com/2022/07/abe-ap.jpg", "publishedAt": "2022-07-08T04:27:41Z", "content": "Japans former Prime Minister Shinzo Abe was rushed to hospital bleeding after he was reportedly shot while delivering a campaign speech in the city of Nara in western Japan, public broadcaster NHK re… [+2119 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Netflix adds spatial audio support for select original shows, movies", "description": "Netflix's new spatial audio feature will work seamlessly with all audio products on supported content, irrespective of what device and what subscription plan you have.", "url": "https://indianexpress.com/article/technology/tech-news-technology/netflix-adds-spatial-audio-support-for-select-original-shows-movies-8016250/", "urlToImage": "https://images.indianexpress.com/2022/07/Netflix-Spatial-Audio.jpg", "publishedAt": "2022-07-08T04:25:00Z", "content": "Netflix has announced that the streaming platform will begin rolling out spatial audio for select original programmes starting from today. The new feature will work without the use of any extra acces… [+1719 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sourav Roy Barman", "title": "UGC’s proposal to permit part-time PhDs: what is it and how does it work?", "description": "A look at eligibility criteria, specification, and provisions of the proposed programme", "url": "https://indianexpress.com/article/education/ugcs-proposal-to-permit-part-time-phds-what-how-it-works-8016268/", "urlToImage": "https://images.indianexpress.com/2022/07/Webp.net-resizeimage-7-2.jpg", "publishedAt": "2022-07-08T04:23:15Z", "content": "The University Grants Commission is finalising the UGC (Minimum Standards and Procedure for Award of Ph.D. Degree) Regulations draft that it proposed in March this year. With the amendments, working … [+5559 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Cristiano Ronaldo will not travel with Manchester United for beginning of pre-season tour: Report", "description": "Recent reports in England suggest that the 37-year-old striker has been pushing for a move away from Old Trafford after moving back to the Manchester club last year.", "url": "https://indianexpress.com/article/sports/football/cristiano-ronaldo-will-not-travel-with-manchester-united-for-beginning-of-pre-season-tour-report-8016269/", "urlToImage": "https://images.indianexpress.com/2022/07/cristiano-ronaldo-manchester-united.jpg", "publishedAt": "2022-07-08T04:21:44Z", "content": "As per The Guardian, Cristiano Ronaldo will not be joining his Manchester United teammates for the beginning of their pre-season tour. The Portuguese striker is reportedly dealing with an ongoing fam… [+1892 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Shinzo Abe shot, Japan PM Fumio Kishida suspends election campaign", "description": "Multiple shots were reportedly fired at Shinzo Abe while he was delivering a speech on the streets of the city. Abe was wounded in his left chest and neck, Reuters reports.", "url": "https://indianexpress.com/article/world/japan-shinzo-abe-shot-fumio-kishida-8016221/", "urlToImage": "https://images.indianexpress.com/2022/07/Shinzo-Abe-Kishida.jpg", "publishedAt": "2022-07-08T04:20:20Z", "content": "Japanese Prime Minister Fumio Kishida suspended his election campaign on Friday after former PM Shinzo Abe was shot at and wounded in Nara. Kishida is on the way to Tokyo from Sagae City in Yamagata … [+700 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Indian shares rise on Mahindra boost; investors eye TCS earnings", "description": "Stock Market And Share Market Today Updates: The NSE Nifty 50 index was up 0.44% at 16,204.5, as of 0352 GMT, while the S&P BSE Sensex rose 0.43% to 54,413.3.", "url": "https://indianexpress.com/article/business/market/share-market-today-july-8-equity-stocks-bse-sensex-nse-nifty-rupee-global-cues-8016219/", "urlToImage": "https://images.indianexpress.com/2022/07/bse-bombay-stock-exchange-express-archive-1200.jpg", "publishedAt": "2022-07-08T04:19:22Z", "content": "Indian shares rose on Friday and were set for a third straight weekly gain, led by automaker Mahindra on securing investment for its electric vehicle unit, while IT major Tata Consultancy Services wa… [+611 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "MAYURA JANWALKAR", "title": "Goa shuts schools today and tomorrow after IMD red alert", "description": "According to the IMD's observation on Friday morning, moderate to heavy rain was seen in both North and South Goa.", "url": "https://indianexpress.com/article/cities/goa/goa-shuts-schools-today-and-tomorrow-after-imd-red-alert-8016208/", "urlToImage": "https://images.indianexpress.com/2022/07/Goa-rain.jpeg", "publishedAt": "2022-07-08T04:10:43Z", "content": "After the India Meteorological Department (IMD) predicted extremely heavy rainfall in some parts of Goa and issued a red warning for Friday, the government declared a school holiday for children betw… [+3177 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Court frames charges of rioting, attempt to murder against 3 in Northeast Delhi riots case", "description": "The FIR was registered on the complaint of one Hamid Ali, who alleged that on February 24, 2020, his son Jafar Jiya was coming home from work when he was attacked by 20-25 men near Khajuri Khas.", "url": "https://indianexpress.com/article/cities/delhi/northeast-delhi-riots-2020-court-frames-charges-8016241/", "urlToImage": "https://images.indianexpress.com/2022/07/NE-Delhi-riots.jpg", "publishedAt": "2022-07-08T04:10:11Z", "content": "A Delhi court has framed charges of rioting and attempt to murder against three persons for allegedly attacking a Muslim man with a sword during the 2020 Northeast Delhi riots.Additional Sessions Jud… [+1565 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Uttarakhand: Nine dead after car gets washed away by Dhela river in Nainital", "description": "The disaster occured after a heavy flow of water was induced by rains early this morning, according to Anand Bharan, DIG of Kumaon Range.", "url": "https://indianexpress.com/article/india/uttarakhand-ramnagar-dhela-river-accident-8016197/", "urlToImage": "https://images.indianexpress.com/2022/07/Uttarakhand-car-accident.jpg", "publishedAt": "2022-07-08T04:06:31Z", "content": "Nine tourists from Punjab drowned on Friday morning as a car fell into the Dhela river in Uttarakhand’s Ramnagar and was washed away by its strong current, news agency PTI quoted the police as saying… [+591 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Chennai News Live Updates: Parts of Chennai to face a power cut today; Tamil Nadu reports 2,765 Covid-19 cases", "description": "Chennai News Live Updates July 8: Parts of Chennai will face a power shutdown from 9 am to 2 pm, with supply expected to resume before 2 pm if the work is completed.", "url": "https://indianexpress.com/article/cities/chennai/chennai-news-live-updates-covid-stalin-tamil-nadu-dmk-aiadmk-traffic-8016203/", "urlToImage": "https://images.indianexpress.com/2022/07/electricity1-reuters-79.jpg", "publishedAt": "2022-07-08T04:06:29Z", "content": "Parts of Chennai to face a power cut today between 9 am to 2 pm (File)Tamil Nadu, Chennai News Live Updates Today: The Tamil Nadu Generation and Distribution Corporation (Tangedco) has announced that… [+1248 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Safety-bid drives Japan’s yen after news of Shinzo Abe being shot", "description": "The yen rose as far as 135.33 per dollar after news that Abe had been taken to hospital after collapsing while delivering a speech in the western city of Nara, after gunshot-like sounds, according to reports by public broadcaster NHK.", "url": "https://indianexpress.com/article/business/world-market/safety-bid-drives-japans-yen-after-news-of-shinzo-abe-being-shot-8016228/", "urlToImage": "https://images.indianexpress.com/2022/07/JAPAN-ABE-REUTERS-1200.jpg", "publishedAt": "2022-07-08T04:04:33Z", "content": "The Japanese yen rose by nearly half a percent against the U.S. dollar on Friday, in what appeared to be safe-haven buying in the minutes after news that former prime minister Shinzo Abe had been sho… [+3225 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Arshdeep Singh breaks 16-year-old record, becomes first Indian bowler to bowl a maiden on T20I debut", "description": "Arshdeep Singh bowled a first over maiden on his T20I debut against England. He became only the third Indian bowler after Jhulan Goswami and Ajit Agarkar to bowl a maiden over in their debut T20I.", "url": "https://indianexpress.com/article/sports/cricket/eng-vs-ind-arshdeep-singh-breaks-16-year-old-record-becomes-first-indian-bowler-to-bowl-a-maiden-on-t20i-debut-8016211/", "urlToImage": "https://images.indianexpress.com/2022/07/Arshdeep-Singh.jpg", "publishedAt": "2022-07-08T04:00:09Z", "content": "Arshdeep Singh had a dream start to his international career against England on Thursday. The yongster tested Jason Roy and almost got his man on the last ball of the over after his LBW appeal was tu… [+4115 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Karnataka police exam scam: HC seeks forensic report on tampering of answer sheets", "description": "In Bengaluru, candidates wrote the PSI recruitment exams at multiple centres and their OMR sheets were modified at the police recruitment cell, the CID investigation has found.", "url": "https://indianexpress.com/article/cities/bangalore/karnataka-police-exam-scam-hc-seeks-forensic-report-on-tampering-of-answer-sheets-8016205/", "urlToImage": "https://images.indianexpress.com/2022/07/psi.jpeg", "publishedAt": "2022-07-08T03:57:20Z", "content": "The Karnataka High Court has sought the details of reports of the State Forensic Science Laboratory (FSL) on the basis of which cases of cheating have been registered against as many as 32 candidates… [+4523 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Shinzo Abe shot: Former Japan PM seen holding chest as he collapsed; cabinet secretary to address media", "description": "Shinzo Abe, former Japan Prime Minister, collapsed on the street, with several security guards running toward him, showed Japanese broadcaster.", "url": "https://indianexpress.com/article/world/shinzo-abe-japan-pm-shot-live-updates-8016196/", "urlToImage": "https://images.indianexpress.com/2022/07/abe-shooting.jpg", "publishedAt": "2022-07-08T03:55:25Z", "content": "Shinzo Abe, then-Prime Minister of Japan, seen with Prime Minister Narendra Modi at New Delhi, on December 12, 2015. (Express Photo by Renuka Puri.)\r\nShinzo Abe comes from a political family. His gra… [+923 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Hrithik Roshan clicks his ‘muse’ Saba Azad in Paris: ‘You’re so beautiful’", "description": "Hrithik Roshan and Saba Azad are not shy about expressing their love for each other on social media, and the couple is now taking over the streets of Paris.", "url": "https://indianexpress.com/article/entertainment/bollywood/hrithik-roshan-is-taking-photos-of-his-muse-saba-azad-in-paris-8016188/", "urlToImage": "https://images.indianexpress.com/2022/07/hrithik-saba.jpg", "publishedAt": "2022-07-08T03:53:12Z", "content": "Actors Hrithik Roshan and Saba Azad, who have been going out for a few months now, are spending some quality time together in Paris. Saba recently took to her social media to share a photo of hers fr… [+1771 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "​​NTA JEE Main 2022 Session 1 result by July 10: NTA official", "description": "JEE Main 2022 result: \"We are almost ready and the result will be out this week,\" the official said. The exam was held online in a computer-based test format from June 23 to 29 at over 500 centers across India and abroad.", "url": "https://indianexpress.com/article/education/%e2%80%8b%e2%80%8bjee-main-2022-session-1-result-by-july-10-nta-official-jeemain-nta-nic-in-8016210/", "urlToImage": "https://images.indianexpress.com/2022/06/ch1013738-1.jpg", "publishedAt": "2022-07-08T03:50:47Z", "content": "JEE Main 2022 session 1 result: The National Testing Agency (NTA) will announce the results of the Joint Entrance Examination or JEE Main 2022 Session 1 by July 10, latest, a senior official told The… [+1268 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "সাংবাদিক গ্রেপ্তার ইস্যুতে বিরোধী শিবিরের রাষ্ট্রপতি পদপ্রার্থীর তোপের মুখে মোদী", "description": "বিতর্কের আগুনে ঘি ঢাললেন বিরোধী শিবিরের রাষ্ট্রপতি পদপ্রার্থী এবং প্রাক্তন কেন্দ্রীয় মন্ত্রী যশবন্ত সিনহা।", "url": "https://bengali.indianexpress.com/general-news/zubairs-arrest-illegal-will-protect-freedom-of-expression-if-elected-sinha-466585/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/cats-32.jpg", "publishedAt": "2022-07-08T03:48:21Z", "content": ", ‘ ’ !\r\n ,   \r\n ()  \r\n : [ , ]\r\n- , , , , \r\n : [ , ]\r\n ,  \r\nStay updated with the latest news headlines and all the latest General news download Indian Express Bengali App.\r\nWeb Title: Zubairs arres… [+60 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "ভরা সভায় গুলি প্রাক্তন প্রধানমন্ত্রীকে, হইচই পড়ে যাওয়া খবরে হুলস্থূল-কাণ্ড", "description": "শুক্রবার সকালেই ওই জনসভায় প্রধান অতিথি হিসেবে উপস্থিত হয়েছিলেন প্রাক্তন প্রধানমন্ত্রী।", "url": "https://bengali.indianexpress.com/world/shinzo-abe-former-japan-pm-shows-no-vital-signs-after-being-shot-466587/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/Shootout.jpg", "publishedAt": "2022-07-08T03:46:01Z", "content": "- \r\n , ” , ’ , \r\n. ( .)- , - , \r\n - , \r\n , , \r\nStay updated with the latest news headlines and all the latest World news download Indian Express Bengali App.\r\nWeb Title: Shinzo abe former japan pm sh… [+34 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Kangana Ranaut claims Dhaakad is victim of ‘negative PR’, asks why people aren’t calling JugJugg Jeeyo and Gangubai Kathiawadi flops as well", "description": "Kangana Ranaut wants to know why people are only pointing fingers at her film Dhaakad, not not saying anything about JugJugg Jeeyo and Gangubai Kathiawadi's performance.", "url": "https://indianexpress.com/article/entertainment/bollywood/kangana-ranaut-on-dhaakad-box-office-flop-8016192/", "urlToImage": "https://images.indianexpress.com/2022/05/kangana-ranaut.jpg", "publishedAt": "2022-07-08T03:45:35Z", "content": "Kangana Ranaut has suggested that reports about her latest film, Dhaakad, bombing at the box office have been motivated by a conscious campaign against her. She cited the example of other recent box … [+1993 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Alia Bhatt wishes ‘soon to be dadi maaaaa’ Neetu Kapoor on birthday, daughter Riddhima gives glimpse of midnight celebration", "description": "Neetu Kapoor brought in her 64th birthday in London with daughter Riddhima and other family members. Daughter-in-law Alia Bhatt posted a special wish for 'soon to be dadi maaaaa'.", "url": "https://indianexpress.com/article/entertainment/bollywood/alia-bhatt-wishes-soon-to-be-dadi-maa-neetu-kapoor-birthday-inside-midnight-celebration-8016157/", "urlToImage": "https://images.indianexpress.com/2022/07/Collage-Maker-08-Jul-2022-08.57-AM.jpg", "publishedAt": "2022-07-08T03:43:25Z", "content": "As Neetu Kapoor turns 64 today, she is celebrating her special day in London with her daughter Riddhima, other members of family and friends. On Friday morning Alia Bhattwished Neetu on social media … [+2078 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Twitter says it removes 1 million spam accounts a day", "description": "Fake social media accounts have been problematic for years, often used to amplify messages and spread disinformation.", "url": "https://indianexpress.com/article/technology/social/twitter-says-it-removes-1-million-spam-accounts-a-day-8016191/", "urlToImage": "https://images.indianexpress.com/2022/07/Twitter-Reuters-1.jpg", "publishedAt": "2022-07-08T03:41:09Z", "content": "Twitter said it removes 1 million spam accounts each day in a call with executives Thursday during a briefing that aimed to shed more light on the company’s fake and bot accounts as it tussles with E… [+2017 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "This healthy kadha will help keep monsoon illnesses at bay", "description": "\"Kadha has a variety of purposes, especially during the monsoon season,\" the expert shared", "url": "https://indianexpress.com/article/lifestyle/health/monsoon-illnesses-healthy-kadha-recipe-8011069/", "urlToImage": "https://images.indianexpress.com/2022/07/GettyImages-kadha-immunity-1200.jpg", "publishedAt": "2022-07-08T03:40:32Z", "content": "Monsoonis finally here! But, along with relief, rains bring with them a number of seasonal illnesses such as dengue, malaria, and diarrhoea, among others. As such, paying extra attention to your heal… [+1575 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "War looms large over G20 event as Russia meets rivals in Bali", "description": "Shouts of \"When will you stop the war\" and \"Why don't you stop the war\" were heard as Russian Foreign Minister Sergei Lavrov shook hands with his Indonesian counterpart Retno Marsudi at the start of the meeting.", "url": "https://indianexpress.com/article/world/g20-russia-bali-ukraine-war-8016178/", "urlToImage": "https://images.indianexpress.com/2022/07/sergei-lavrov-g20.jpg", "publishedAt": "2022-07-08T03:33:12Z", "content": "G20 foreign ministers attended a joint summit on Friday that has put some of the staunchest critics of Russia’s invasion of Ukraine in the same room as Moscow’s top diplomat, the first such meeting s… [+2935 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Al Pacino, Robert De Niro pay tribute to Godfather star James Caan", "description": "Actor James Caan’s death drew tributes and expressions of grief from industry colleagues and fans.", "url": "https://indianexpress.com/article/entertainment/hollywood/celebrities-react-to-godfather-star-james-caan-death-8016156/", "urlToImage": "https://images.indianexpress.com/2022/07/James-Caan-ap-1200by667.jpeg", "publishedAt": "2022-07-08T03:25:15Z", "content": "James Caan, the Oscar-nominated actor known for roles in the The Godfather, Brians Song, Misery, and Elf, died Wednesday at age 82. Caans death drew tributes and expressions of grief from industry co… [+3787 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi: Two held for murdering man with sharp object", "description": "According to police, Piyush said that while he was going to Ganesh Nagar via Samaspur, the victim and his friend abused him after his scooter touched theirs slightly.", "url": "https://indianexpress.com/article/cities/delhi/delhi-news-crime-two-arrested-murdering-man-with-sharp-object-police-8016177/", "urlToImage": "https://images.indianexpress.com/2022/07/arrest-1-8-2.jpg", "publishedAt": "2022-07-08T03:23:45Z", "content": "Two men were arrested for allegedly murdering a man with a sharp object in an apparent road-rage incident near a liquor shop in Samaspur in East Delhi’s Pandav Nagar area. Police said the accused wer… [+1506 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Priyanka Chopra shares new photo of ‘adorable’ baby Malti Marie, spends time with family at Lake Tahoe. See here", "description": "Priyanka Chopra has shared a new picture of her newborn daughter, Malti Marie Chopra Jonas, but as always, she made sure not to reveal her face.", "url": "https://indianexpress.com/article/entertainment/bollywood/priyanka-chopra-new-photo-of-baby-malti-marie-chopra-jonas-8016162/", "urlToImage": "https://images.indianexpress.com/2022/07/priyanka-chopra-malti-marie.jpg", "publishedAt": "2022-07-08T03:20:14Z", "content": "Priyanka Chopra on early Friday shared a new picture of her daughter, Malti Marie Chopra Jonas. Priyanka had previously shared pictures of the newborn with her mother, whom she is named after, and wi… [+1585 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "‘We’ve got an obligation to entertain’: Brendon McCullum on England’s ‘Bazball’ revolution", "description": "In a conversation with Adam Gilchrist on SEN WA Breakfast, the former New Zealand captain said that team’s form can be put down to a culture where players are aiming to produce a 'brand of cricket' that will give themselves and fans.", "url": "https://indianexpress.com/article/sports/cricket/weve-got-an-obligation-to-entertain-brendon-mccullum-on-englands-bazball-revolution-8016165/", "urlToImage": "https://images.indianexpress.com/2022/06/Brendon-McCullum-AP.jpg", "publishedAt": "2022-07-08T03:18:53Z", "content": "Brendon McCullums first four Tests as Englands red-ball coach has offered a glimpse into the future, which is enthralling and his approach has been a box-office hit. If Eoin Morgans England gave worl… [+3293 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "United Arab Emirates set to run Kabul airport in deal with Taliban, sources say", "description": "An agreement would help the Islamist militants ease their isolation from the outside world as they govern an impoverished country beset by drought, widespread hunger and economic crisis.", "url": "https://indianexpress.com/article/world/united-arab-emirates-kabul-airport-taliban-8016163/", "urlToImage": "https://images.indianexpress.com/2022/07/kabul-airport.jpg", "publishedAt": "2022-07-08T03:14:12Z", "content": "The Taliban and the United Arab Emirates are poised to strike a deal for the Gulf nation to run Kabul airport and several others in Afghanistan that could be announced within weeks, according to sour… [+4727 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Sports Desk", "title": "এখনও হারের মুখ দেখেননি! কোহলির কাছ থেকে নেতৃত্ব নিয়ে রেকর্ডের মহা-সিংহাসনে রোহিত", "description": "প্ৰথম ক্যাপ্টেন হিসাবে অনন্য নজির গড়ে ফেললেন রোহিত শর্মা। টানা ১৩ ম্যাচ জেতার বিরল নজির তাঁর।", "url": "https://bengali.indianexpress.com/sports/india-vs-england-rohit-sharma-becomes-first-captain-to-win-13-t20-matches-in-a-row-466564/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/Team-India-1.jpeg", "publishedAt": "2022-07-08T02:56:31Z", "content": "- - \r\n - - , , \r\n :  ! BCCI\r\n , , \r\n, - \r\n , \r\n“ - - , ” \r\n , , , \r\nStay updated with the latest news headlines and all the latest Sports news download Indian Express Bengali App.\r\nWeb Title: India v… [+74 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Former Japan PM Shinzo Abe shot at, taken injured in Nara city", "description": "Abe Shinzo was shot at and collapsed during a speech in the city of Nara, said media report.", "url": "https://indianexpress.com/article/world/former-japan-pm-shinzo-abe-shot-8016155/", "urlToImage": "https://images.indianexpress.com/2020/08/Abe-Tokyo.jpg", "publishedAt": "2022-07-08T02:55:33Z", "content": "Former Japan Prime Minister Shinzo Abe was shot at in western Japan on Friday, reported Japan-based media house NHK. A suspect has been detained and is being questioned, added the report.“Former Japa… [+602 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Lady Gaga shares eight ways to unlock your true potential", "description": "\"It's not just about attracting people's attention but also about creating something that has a meaningful, positive impact on them,\" she said", "url": "https://indianexpress.com/article/lifestyle/life-positive/lady-gaga-inspiring-motivational-message-unlock-true-potential-7982174/", "urlToImage": "https://images.indianexpress.com/2022/06/LadyGaga_Insta1200.jpg", "publishedAt": "2022-07-08T02:50:45Z", "content": "A singer, an idol and an enigma Lady Gaga is many things to many people. Known for her fashion, live performances and self-empowering messages, she shared some crucial ways to unlock your full potent… [+1771 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kamaldeep Singh Brar", "title": "Punjab: Court sends arrested Faridkot DSP to jail, junks police plea for remand", "description": "The police told the court that it wants to question the DSP to find out if more police officers were involved in the nexus. Judge", "url": "https://indianexpress.com/article/cities/amritsar/court-sends-arrested-faridkot-dsp-to-jail-junks-police-plea-for-remand-8016148/", "urlToImage": "https://images.indianexpress.com/2022/07/corruption-2.jpg", "publishedAt": "2022-07-08T02:48:50Z", "content": "In a setback to Punjab Police, a local Tarn Taran court on Thursday junked the police’s plea for remand and sent arrested Faridkot Deputy Superintendent of Police (DSP), Lakhvir Singh, to judicial cu… [+1070 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Disproportionate assets case: Ex-CM Chautala seeks suspension of sentence, Delhi HC seeks CBI response", "description": "While ordering confiscation of his four properties in Delhi, Gurgaon and Panchkula, the lower court also had imposed a fine of Rs 50 Lakh on Haryana ex chief minister Om Prakash Chautala.", "url": "https://indianexpress.com/article/cities/delhi/disproportionate-assets-case-ex-cm-chautala-seeks-suspension-of-sentence-delhi-hc-seeks-cbi-response-8016140/", "urlToImage": "https://images.indianexpress.com/2022/07/OP-Chautala.jpg", "publishedAt": "2022-07-08T02:40:49Z", "content": "The Delhi High Court on Thursday issued a notice to the Central Bureau of Investigation on Former Haryana Chief Minister Om Prakash Chautalas appeal against his conviction by a lower court in a dispr… [+2290 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Bengaluru News Live Updates: Torrential rains continue in several parts of Karnataka", "description": "Karnataka, Bengaluru News Live Updates Today July 8: In a separate development, the Bengaluru Traffic Police Thursday implemented changes in the movement of vehicles near the Hebbal flyover to ease out traffic snarls.", "url": "https://indianexpress.com/article/cities/bangalore/bengaluru-news-live-updates-bommai-karnataka-rains-covid-traffic-8016132/", "urlToImage": "https://images.indianexpress.com/2022/07/landslide_karnataka.jpeg", "publishedAt": "2022-07-08T02:39:43Z", "content": "The schools in Karnataka opened for the new academic year on May 16. Even after 50 days of school reopening, the children go to their classrooms dressed in coloured clothes or old uniforms which hard… [+1103 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Chris Hemsworth went from earning Rs 1 cr for first Thor to over Rs 150 cr for Thor Love and Thunder", "description": "Chris Hemsworth was a relative unknown when he first signed on to play Thor in the Marvel movies, but now commands a $20 million salary.", "url": "https://indianexpress.com/article/entertainment/hollywood/chris-hemsworth-thor-salary-increase-love-and-thunder-8014882/", "urlToImage": "https://images.indianexpress.com/2019/09/avengers-endgame-chris-hemsworth-fat-thor-1200.jpg", "publishedAt": "2022-07-08T02:39:13Z", "content": "Chris Hemsworth was a relatively unknown actor when he was cast as Thor in the Marvel Cinematic Universe. Over the last decade, hes played the character in seven films, including cameo appearances. H… [+3137 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rohan Naahar", "title": "Black Bird review: Taron Egerton’s terrific psychological drama continues Apple’s excellent year", "description": "Black Bird review: Taron Egerton's tremendous new Apple miniseries features a trio of outstanding central performances.", "url": "https://indianexpress.com/article/entertainment/web-series/black-bird-review-taron-egerton-apple-tv-plus-show-8010184/", "urlToImage": "https://images.indianexpress.com/2022/07/black-bird-review.jpg", "publishedAt": "2022-07-08T02:38:58Z", "content": "A pulpy crime drama with the heart of a life-affirming fable, Black Bird ensures that The Apple Spring of 2022 bleeds into the summer. Its the streamers fourth great television show of the year, and … [+4993 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Leela Murali, Rahel Philipose", "title": "Daily Briefing: Boris Johnson resigns; Jaishankar meets Wang Yi; and more", "description": "Boris Johnson resigns as Britain's Prime Minister; Alt News co-founder Mohammed Zubair's petition likely to be heard by Supreme Court today; Twitter tells court the IT Ministry ordered to take down 1,474 accounts, 175 tweets.", "url": "https://indianexpress.com/article/live-news/daily-briefing-top-news-july-8-8016131/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-2021-11-08T081015.674-3-1.jpg", "publishedAt": "2022-07-08T02:36:23Z", "content": "In today’s edition: Boris Johnson resigns as Britain’s Prime Minister; Alt News co-founder Mohammed Zubair’s petition likely to be heard by Supreme Court today; Twitter tells court the IT Ministry or… [+5801 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "When Neetu Kapoor told an ‘anxious’ Rishi Kapoor: ‘How could you have been such a bad kisser?’", "description": "Neetu Kapoor and Rishi Kapoor were married for over 40 years. The couple often spoke about their highs and lows as their relationship evolved.", "url": "https://indianexpress.com/article/entertainment/bollywood/when-neetu-kapoor-told-anxious-rishi-kapoor-such-a-bad-kisser-8014405/", "urlToImage": "https://images.indianexpress.com/2022/07/Neetu-Rishi.jpeg", "publishedAt": "2022-07-08T02:33:59Z", "content": "It is famously known that actor Neetu Kapoor gave up her flourishing career at the age of 22 when she got married to actor Rishi Kapoor, but Neetu has repeatedly shared that since she had been workin… [+2344 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Punjab forest department: Now, Vigilance Bureau arrests IFS officer in corruption case", "description": "An official spokesperson said it has arrested conservator Chauhan after conducting interrogations of arrested Divisional Forest Officer of Mohali Guramanpreet Singh and contractor Harmahinder Singh in the case.", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-forest-department-now-vigilance-bureau-arrests-ifs-officer-in-corruption-case/", "urlToImage": "https://images.indianexpress.com/2022/07/punjab-forest.jpg", "publishedAt": "2022-07-08T02:31:54Z", "content": "The Punjab Vigilance Bureau Thursday said it has arrested Indian Forest Service (IFS) officer Vishal Chauhan, who was posted as conservator of forests planning, in a corruption case.An official spoke… [+1804 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Delhi News Live Updates: Supreme Court to hear Mohammed Zubair’s bail plea; Delhi reels under warm weather after heavy rain", "description": "Delhi news today: Delhi reels under warm weather after heavy rain; Burglary, attempt to murder cases up, according to Delhi Police data; MCD survey says maximum unsafe buildings are in north Delhi.", "url": "https://indianexpress.com/article/cities/delhi/delhi-news-live-updates-arvind-kejriwal-rains-traffic-crime-mohammed-zubair-8016118/", "urlToImage": "https://images.indianexpress.com/2022/07/lodhi-gardens-amit-mehra.jpg", "publishedAt": "2022-07-08T02:31:27Z", "content": "The southwest monsoon hit Delhi on June 30 and brought heavy rainfall for a day. But over the week since then, the weather in the capital has been warm and sultry, with no significant amount of rainf… [+845 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "While You Were Asleep: Rohit Sharma wins 13 successive T20Is as captain, Qatar’s WC stadiums set to be alcohol-free, Indian Women’s hockey team lose 3-4 vs NZ", "description": "Hardik Pandya starred for India as he top-scored with 51 off 33 and then took four wickets to dismantle England.", "url": "https://indianexpress.com/article/sports/sport-others/while-you-were-asleep-rohit-sharma-win-win-13-successive-t20is-as-captain-qatars-world-cup-stadiums-set-to-be-alcohol-free-indian-womens-team-lost-3-4-against-nz-8016116/", "urlToImage": "https://images.indianexpress.com/2022/07/While-you-were-asleep-1.jpg", "publishedAt": "2022-07-08T02:28:43Z", "content": "Rohit Sharma became the first captain to win 13 successive T20Is after India’s dominating 50-run win over England in the first T20I of the three-match series. Milestone Alert \r\nFirst captain to win 1… [+3313 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "In Haryana, a campaign to hoist Indian flag atop every house", "description": "Chief Secretary Sanjeev Kaushal also directed the deputy commissioners to hold meetings with all political parties, public representatives, Zila Parishads etc. to ensure public participation in this campaign.", "url": "https://indianexpress.com/article/cities/chandigarh/in-haryana-a-campaign-to-hoist-tricolour-atop-every-house-8016128/", "urlToImage": "https://images.indianexpress.com/2022/07/indian-flag.jpg", "publishedAt": "2022-07-08T02:24:36Z", "content": "The Haryana government has launched a campaign to ensure that each house in Haryana should have the national flag hoisted from August 11-17. The state government said that this is in sync with the Un… [+2720 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Hardik Pandya brilliance powers India to win over England in first T20", "description": "The visitors then returned to dismiss England for 148 in 19.3 overs with Hardik (4/33) taking four wickets.", "url": "https://indianexpress.com/article/sports/cricket/india-beat-england-by-50-runs-in-first-t20i-8016114/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-3-2.jpg", "publishedAt": "2022-07-08T02:15:25Z", "content": "Hardik Pandya reigned supreme with one of the finest all-round performances in recent times as India bossed England to emerge winners by 50 runs in the first T20 International here.The swashbuckling … [+5007 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Navjeevan Gopal", "title": "Optimum Utilisation of Vacant Government Lands: CAG tears into Punjab govt, most properties under scheme unsold", "description": "PUDA was given complete proprietary rights to sell, lease, mortgage and otherwise dispose of the properties in whatsoever manner deemed fit as per the decision of the empowered committee constituted by the state government.", "url": "https://indianexpress.com/article/cities/chandigarh/optimum-utilisation-of-vacant-government-lands-cag-tears-into-punjab-govt-most-properties-under-scheme-unsold-ouvgl-8016120/", "urlToImage": "https://images.indianexpress.com/2022/07/farm-land-l.jpg", "publishedAt": "2022-07-08T02:12:53Z", "content": "Twenty-three years after it was rolled out, the Optimum Utilisation of Vacant Government Lands (OUVGL) scheme in Punjab is running in losses and a debit balance to the tune of Rs 1,158 crore as of Ma… [+2860 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "US jury convicts Theranos’ Sunny Balwani of fraud", "description": "Theranos founder Elizabeth Holmes, who initially faced the same charges, was convicted on three counts of fraud and one count of conspiracy at a separate trial in January.", "url": "https://indianexpress.com/article/world/theranos-sunny-balwani-convicted-fraud-8016109/", "urlToImage": "https://images.indianexpress.com/2022/07/sunny-balwani.jpg", "publishedAt": "2022-07-08T02:09:01Z", "content": "A US jury on Thursday convicted former Theranos Inc President Ramesh “Sunny” Balwani of defrauding investors and patients about the blood testing startup that was once valued at $9 billion.The San Jo… [+1948 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Shortlisted IAF aspirants move high court, want recruitment initiated in 2019 completed", "description": "The petition added that one of the petitioners had filed an RTI in the office of the respondents seeking information as to why the result is being delayed. “Till date, no reply has been given by the respondents.”", "url": "https://indianexpress.com/article/cities/chandigarh/shortlisted-iaf-indian-air-force-aspirants-move-high-court-want-recruitment-initiated-in-2019-completed-8016108/", "urlToImage": "https://images.indianexpress.com/2022/07/entrance.jpg", "publishedAt": "2022-07-08T02:06:10Z", "content": "A petition has been filed by the shortlisted Indian Air Force (IAF) candidates before the Punjab and Haryana High Court seeking directions to the Ministry of Defence, and Central Airmen Selection Boa… [+1270 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "R Madhavan-starrer Dhokha Round D Corner to release in theatres in Sep", "description": "Dhokha - Round D Corner stars R Madhavan, Aparshakti Khurana, Darshan Kumaar and Khushalii Kumar among others.", "url": "https://indianexpress.com/article/entertainment/bollywood/r-madhavan-starrer-dhokha-round-d-corner-to-release-in-theatres-in-sep-8014531/", "urlToImage": "https://images.indianexpress.com/2022/07/Dhoka-1200by667.jpg", "publishedAt": "2022-07-08T02:05:40Z", "content": "Actor R Madhavan‘s upcoming film Dhokha – Round D Corner will be released theatrically on September 23, the makers announced on Thursday.Also starring Aparshakti Khurana, Darshan Kumaar and Khushalii… [+1180 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Navjeevan Gopal, Sofi Ahsan", "title": "On the run in Punjab: 2,083 booked in drugs cases; 232 of them proclaimed offenders", "description": "At least 11 other accused booked in NDPS cases with recoveries of charas and ganja between 2010 and 2021 (10 hailing from Bihar and one from Haryana) are wanted by the GRP Punjab.", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-drugs-cases-narcotics-ndps-absconders-8016094/", "urlToImage": "https://images.indianexpress.com/2022/07/punjab-drugs.jpg", "publishedAt": "2022-07-08T01:48:59Z", "content": "In Punjabs war against drugs, previous governments led by the Akali Dal and the Congress have come under the scanner with over 2,000 accused booked under the Narcotic Drugs and Psychotropic Substance… [+7809 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Tamil Nadu reports 2,765 new Covid-19 cases, one death; Chennai at 1,011", "description": "Tamil Nadu Covid-19 cases today: An 80-year-old male who tested positive for coronavirus on June 24 succumbed at the government health facility in Tiruvarur in Tamil Nadu due to comorbidities.", "url": "https://indianexpress.com/article/cities/chennai/tamil-nadu-coronavirus-infections-chennai-covid-deaths-active-cases-mask-rules-8016091/", "urlToImage": "https://images.indianexpress.com/2022/07/PTI02_01_2022_000102B-2-1.jpeg", "publishedAt": "2022-07-08T01:30:52Z", "content": "Tamil Nadu reported 2,765 new coronavirus positive cases and one death on Thursday, taking the state-wide tally to 34.93 lakh and the toll to 38,028.An 80-year-old male who tested positive for corona… [+986 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Reese Witherspoon, Will Ferrell to star in untitled wedding comedy", "description": "The plot details of Reese Witherspoon and Will Ferrell-starrer have been kept under wraps but the premise involves two weddings that are booked at the same venue on the same weekend.", "url": "https://indianexpress.com/article/entertainment/hollywood/reese-witherspoon-will-ferrell-to-star-in-untitled-wedding-comedy-8014265/", "urlToImage": "https://images.indianexpress.com/2022/07/Reese-Witherspoon-and-WIll-Ferrell-1200by667.jpg", "publishedAt": "2022-07-08T01:30:00Z", "content": "Hollywood stars Reese Witherspoon and Will Ferrell are set to headline a wedding comedy from director Nick Stoller. According to Variety, the untitled project has landed at Amazon Studios and it will… [+171 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Krishna Khaitan Memorial badminton Tournament: Ishan Rohilla enters qualification 3rd round in boys’ singles’ U-19 category", "description": "The match started on a slow note for Rohilla as he lost the opening game 7-15. The Haryana youngster then made a comeback in the match as he claimed the second game 15-7 to restore parity in the match.", "url": "https://indianexpress.com/article/cities/chandigarh/krishna-khaitan-memorial-badminton-tournament-ishan-rohilla-enters-qualification-in-boys-singles-category-8016084/", "urlToImage": "https://images.indianexpress.com/2022/07/BADMINTON-TOURNAMENT-2.jpg", "publishedAt": "2022-07-08T01:26:59Z", "content": "Ishan Rohilla of Haryana made his way into the qualification third round with a 7-15, 15-7, 15-6 win over Aditya Ranjan Gupta of Chandigarh in the boys singles U-19 category on the opening day of the… [+2307 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Annamalai slams Alagiri, says ‘Tamil Nadu Congress in ICU’", "description": "Asked on TNCC chief KS Alagiri's statement that BJP could never grow in Tamil Nadu, Annamalai said Alagiri has taken the Congress party in Tamil Nadu to the Intensive Care Unit.", "url": "https://indianexpress.com/article/cities/chennai/annamalai-slams-alagiri-says-tamil-nadu-congress-in-icu-8016082/", "urlToImage": "https://images.indianexpress.com/2022/07/Annamalai-1.jpg", "publishedAt": "2022-07-08T01:24:08Z", "content": "Tamil Nadu BJP President K Annamalai on Thursday hit out at the TN Congress Committee, saying it is in the Intensive Care Unit in the state and its oxygen is its Dravidian partner DMK, without which … [+4113 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "AIADMK: EPS faction says OPS can contest for top post, Madras HC adjourns plea against Jul 11 GC meet", "description": "The dominant EPS faction had earlier said the post of general secretary, a powerful position last held by J Jayalalithaa till her death in 2016, will be revived in the July 11 GC meet.", "url": "https://indianexpress.com/article/cities/chennai/aiadmk-panneerselvam-palaniswami-general-council-meet-madras-hc-801607/", "urlToImage": "https://images.indianexpress.com/2022/07/AIADMK-PTI-1-1.jpeg", "publishedAt": "2022-07-08T01:15:43Z", "content": "When the civil suit from OPS came up for hearing, the counsel for former Chief Minister and rival faction leader Edappadi K Palaniswami (EPS) told Justice Krishnan Ramaswamy that Panneerselvam can ve… [+985 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mohali Rains | Car washed away: Police recover woman’s body from Chandigarh, hunt on for driver", "description": "“The driver and the woman were in the car and going towards Himachal Pradesh. We are yet to find out if there was a third occupant in that vehicle,” the SHO said.", "url": "https://indianexpress.com/article/cities/sas-nagar-mohali/mohali-car-washed-away-police-recover-womans-body-from-chandigarh-hunt-on-for-driver-8016073/", "urlToImage": "https://images.indianexpress.com/2022/07/car-chandigarh-1.jpg", "publishedAt": "2022-07-08T01:14:43Z", "content": "A day after a private taxi with all its occupants was washed away in the flooded seasonal rivulet Patiala Ki Rao the police on Thursday managed to recover the body of a woman, who they said was one o… [+2207 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Chennai power cut today: These areas will face a power cut in Chennai", "description": "Chennai power disruption July 8, Friday: Parts of Chennai will face a power cut from 9 am to 2 pm for maintenance work today.", "url": "https://indianexpress.com/article/cities/chennai/chennai-power-cut-today-these-areas-will-face-a-power-cut-in-chennai-8016069/", "urlToImage": "https://images.indianexpress.com/2022/07/electricity-reuters-1200-2-1-6.jpeg", "publishedAt": "2022-07-08T01:08:23Z", "content": "The Tamil Nadu Generation and Distribution Corporation (Tangedco) has announced that power will be suspended in parts of Chennai today in T Nagar, Mylapore, Tambaram, Guindy, KK Nagar, Avadi, Ambattu… [+2379 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Chandigarh Police arrests man for selling fake high security number plates", "description": "Police said that a computer, its CPU, a keyboard, a punching machine, a plotter, and a rabbit machine were also seized.", "url": "https://indianexpress.com/article/cities/chandigarh/man-nabbed-for-selling-fake-high-security-number-plates-8016064/", "urlToImage": "https://images.indianexpress.com/2022/07/number-plates.jpg", "publishedAt": "2022-07-08T01:00:58Z", "content": "Chandigarh Police have arrested a man from Sector 38 for allegedly selling fake high security number plates. According to the police, the suspect, identified as Tushar Aggarwal, a resident of Sector … [+745 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Chandigarh AAP leader booked; party trashes charges", "description": "AAP councillor Ram Chander Yadav said, “Chandigarh police is working under the pressure of the BJP. I was first attacked by the contractor Pardeep Bansal and his two men.", "url": "https://indianexpress.com/article/cities/chandigarh/chandigarh-aap-leader-booked-party-trashes-charges-private-contractor-assault-8016055/", "urlToImage": "https://images.indianexpress.com/2022/07/ram-chander-yadav.jpg", "publishedAt": "2022-07-08T00:54:29Z", "content": "THE Chandigarh Police on Thursday booked an Aam Adami Party (AAP) councillor from Ward Number 15, Ram Chander Yadav, for allegedly assaulting a private contractor, Pardeep Bansal, and his driver on J… [+1853 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Hina Rohtaki", "title": "Rail India Technical and Economic Services survey: Underpasses to help Chandigarh beat traffic at 9 points", "description": "According to details obtained by The Indian Express, at least 15 traffic junctions in the city stayed choked during peak traffic hours at present, with the situation likely to get worse in the next five years as the number of vehicles increase.", "url": "https://indianexpress.com/article/cities/chandigarh/rail-india-technical-economic-services-survey-underpasses-chandigarh-traffic-8016052/", "urlToImage": "https://images.indianexpress.com/2022/07/chandigarh-traffic.jpg", "publishedAt": "2022-07-08T00:42:32Z", "content": "The Rail India Technical and Economic Services (RITES), after a survey, has proposed the building of underpasses at nine of Chandigarh’s 15 major junctions to ease traffic congestions and prevent veh… [+2959 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "বাংলারই সতীপীঠ, যেখানে মন্দিরের জন্ম ইতিহাস আজও রহস্যের চাদরে ঢাকা", "description": "কয়েক দশক আগে লাল শালু পরা এক সাধক এসেছিলেন। তাঁর জটা পা পর্যন্ত ঠেকত।", "url": "https://bengali.indianexpress.com/lifestyle/satipeeth-bhramari-devi-temple-in-jalpaiguri-466543/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/devi-bhramari.jpg", "publishedAt": "2022-07-08T00:30:00Z", "content": ", , , , \r\n , , , , , \r\n - , \r\n, , , , \r\n , , , - \r\nStay updated with the latest news headlines and all the latest Lifestyle news download Indian Express Bengali App.\r\nWeb Title: Satipeeth bhramari de… [+22 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Punjab DSP bribe arrest: Police transfer case to Vigilance Bureau", "description": "As per details, the Tarn Taran district police had arrested a drug supplier — identified as Pishora Singh — from a petrol pump near Patti Morh and recovered 250 gram of opium and Rs 1 lakh in drug money from his possession on Sunday.", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-dsp-bribe-arrest-police-transfer-case-to-vigilance-bureau-8016049/", "urlToImage": "https://images.indianexpress.com/2022/07/corruption-1.jpg", "publishedAt": "2022-07-08T00:28:46Z", "content": "A day after arresting its Faridkot Deputy Superintendent of Police (DSP) for allegedly taking a bribe, Punjab Police on Thursday decided to transfer the case to its Vigilance Bureau to ensure “a free… [+1051 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Zubair arrest illegal, will defend freedom of speech if elected: Sinha", "description": "He held a press conference in the presence of SP president Akhilesh Yadav and RLD chief Jayant Chaudhary even as SP alliance partner Suheldev Bhartiya Samaj Party leader Om Prakash Rajbhar was conspicuous by his absence.", "url": "https://indianexpress.com/article/cities/lucknow/zubair-arrest-illegal-will-defend-freedom-of-speech-if-elected-sinha-8016042/", "urlToImage": "https://images.indianexpress.com/2022/07/Yashwant-Sinha-2.jpeg", "publishedAt": "2022-07-08T00:01:57Z", "content": "Opposition’s joint Presidential candidate and former Union Minister Yashwant Sinha on Thursday said that the arrest of fact-checking website Alt News was najayaz (illegal) and that he would defend th… [+2113 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "TMC Govt Scheme: 8,000 students get credit cards for pursuing higher education", "description": "CM tells students to ‘think positive’, says education standard has improved", "url": "https://indianexpress.com/article/cities/kolkata/tmc-govt-scheme-8000-students-get-credit-cards-for-pursuing-higher-education-8016039/", "urlToImage": "https://images.indianexpress.com/2022/07/Students-4col.jpg", "publishedAt": "2022-07-07T23:42:11Z", "content": "Chief Minister Mamata Banerjee on Thursday distributed student credit cards among 8,000 beneficiaries under her government’s scheme for the pursuance of higher education at a function held at Netaji … [+1803 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "TET ‘scam’: CBI searches houses of WBBPE chief and his predecessor", "description": "According to CBI sources, the sleuths seized incriminating materials, electronic evidence and other material during the searches.", "url": "https://indianexpress.com/article/cities/kolkata/tet-scam-cbi-searches-houses-of-wbbpe-chief-and-his-predecessor-8016037/", "urlToImage": "https://images.indianexpress.com/2022/07/CBI-office-4col.jpg", "publishedAt": "2022-07-07T23:38:10Z", "content": "The Central Bureau of Investigation (CBI) on Thursday carried out searches at seven places, including at the West Bengal Board of Primary Education (WBBPE) office and the houses of its former and inc… [+2204 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Acid fly infection scare in north Bengal", "description": "The infection first appeared in Sikkim and has since been around, officials said. About 100 students of North Bengal University (NBU), Siliguri, are now affected by the virus. The fear and panic has gripped students so much that many left hostels to head back…", "url": "https://indianexpress.com/article/cities/kolkata/acid-fly-infection-scare-in-north-bengal-8016035/", "urlToImage": "https://images.indianexpress.com/2022/07/dengue1.jpg", "publishedAt": "2022-07-07T23:31:17Z", "content": "Acid fly or Nairobi fly infection has created scare in several areas of North Bengal with the Darjeeling district administration issuing an advisory for prevention against the insect.Mainly children … [+1329 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gujarat High Court: Lawyers’ body seeks action over violation of livestreaming rules", "description": "The representation also points out that Rule 4, which enlists various cases which should not be livestreamed such as cases involving matrimonial disputes, cases of offences of sexual assault and under POCSO Act, are being livestreamed and unauthorisedly being…", "url": "https://indianexpress.com/article/cities/ahmedabad/gujarat-high-court-lawyers-body-seeks-action-over-violation-of-livestreaming-rules-8016019/", "urlToImage": "https://images.indianexpress.com/2022/07/Gujarat-HC-2.jpg", "publishedAt": "2022-07-07T22:57:18Z", "content": "Pointing out that the live streaming of the Gujarat High Court proceedings are being used by various persons on social media, the Gujarat High Court Advocates Association Thursday wrote to the Chief … [+1576 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Surat: Fire department saves boy who tried to jump into Tapi river", "description": "According to the fire department officials of the Surat Municipal Corporation (SMC), a passerby while traveling on the newly constructed bridge on Tapi river, spotted the boy who climbed on the protection wall to jump into the river.", "url": "https://indianexpress.com/article/cities/surat/surat-fire-department-saves-boy-who-tried-to-jump-into-tapi-river-8016017/", "urlToImage": "https://images.indianexpress.com/2022/07/IE-79-3.jpeg", "publishedAt": "2022-07-07T22:51:40Z", "content": "The fire department officials Thursday saved a 17-year-old boy in Surat who tried to jump into the Tapi river allegedly to end his life.According to the fire department officials of the Surat Municip… [+721 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sourav Roy Barman", "title": "Presidential poll: TMC watchful about tribal votes, Yashwant Sinha may skip Bengal during campaign tour", "description": "Opposition nominee’s camp cites ‘paucity of time’, says ‘one should not read too much into it’", "url": "https://indianexpress.com/article/political-pulse/presidential-poll-tmc-watchful-about-tribal-votes-yashwant-sinha-may-skip-bengal-8015970/", "urlToImage": "https://images.indianexpress.com/2022/07/Yashwant-Sinha-with-Samajwadi-Party-leader-Akhilesh-Yadav-and-RLD-chief-Jayant-Chaudhary-in-Lucknow.jpg", "publishedAt": "2022-07-07T22:50:49Z", "content": "Trinamool Congress (TMC)-governed West Bengal is not likely to feature in the travel itinerary of joint Opposition nominee for presidential elections Yashwant Sinha, who plans to visit, among other p… [+4331 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Yashwant Sinha to meet Gujarat Congress MLAs today ahead of presidential polls", "description": "Meanwhile, ahead of the Gujarat assembly elections, the Congress appointed as many as 37 observers—mostly ministers in Rajasthan and Chhattisgarh governments—for the 26 parliamentary constituencies of Gujarat.", "url": "https://indianexpress.com/article/cities/ahmedabad/yashwant-sinha-to-meet-gujarat-congress-mlas-today-ahead-of-presidential-polls-8016009/", "urlToImage": "https://images.indianexpress.com/2022/07/Yashwant-Sinha-1.jpeg", "publishedAt": "2022-07-07T22:48:55Z", "content": "Ahead of presidential elections, joint opposition candidate Yashwant Sinha will meet Congress MLAs in Gandhinagar Friday. According to Congress party officials, Sinha is expected to arrive at Ahmedab… [+1576 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shyamlal Yadav", "title": "Explained: Sub-categorising OBCs", "description": "The Justice Rohini Commission for sub-categorisation of OBCs has got yet another extension. Why has it been felt necessary to create categories within OBCs for reservations, and what has the panel found so far?", "url": "https://indianexpress.com/article/explained/sub-categorising-other-backward-classes-8015889/", "urlToImage": "https://images.indianexpress.com/2022/07/reservation.jpg", "publishedAt": "2022-07-07T22:40:52Z", "content": "What is sub-categorisation of OBCs?\r\nThe idea is to create sub-categories within the larger group of OBCs for the purpose of reservation. OBCs are granted 27% reservation in jobs and education under … [+5971 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "George Mathew", "title": "Explained: How your car insurance will factor in your driving behaviour", "description": "The new concepts will enable vehicle owners to take advantage of their driving behaviour patterns, general upkeep of the vehicles, mileage and vehicle usage patterns, leading to cheaper insurance policies for their vehicles.", "url": "https://indianexpress.com/article/explained/car-insurance-factor-driving-behaviour-8015897/", "urlToImage": "https://images.indianexpress.com/2022/07/Car-insurance-exp.png", "publishedAt": "2022-07-07T22:40:22Z", "content": "On Wednesday, the Insurance Regulatory and Development Authority of India (IRDAI) allowed general insurance companies to introduce new technology-enabled concepts called pay as you drive, pay how you… [+5184 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Kutch Branch Canal develops breach during maiden testing", "description": "A major breach in the structure of KBC was reported early morning near Bidada village. Purported photos and videos were circulated on social media, showing water gushing away through the broken lining and the earthen embankment having been washed away.", "url": "https://indianexpress.com/article/cities/rajkot/kutch-branch-canal-develops-breach-during-maiden-testing-8015963/", "urlToImage": "https://images.indianexpress.com/2022/07/kutch-copy-1.jpg", "publishedAt": "2022-07-07T22:37:23Z", "content": "THE KUTCH Branch Canal (KBC) of the Narmada dam project developed a breach near Bidada village on the outskirts of Mandvi taluka of Kutch during its maiden testing by the Sardar Sarovar Narmada Nigam… [+1064 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "July 8, 1982, Forty Years Ago: Opposition Demands", "description": "Opposition parties will press for the introduction of an anti-defection bill during the forthcoming monsoon session of the Lok Sabha. At a meeting of representatives of nine opposition parties, it was agreed that there would be proper floor coordination of op…", "url": "https://indianexpress.com/article/opinion/editorials/forty-years-ago-opposition-demands-8015837/", "urlToImage": "https://images.indianexpress.com/2022/07/08-Jul-1982_IE_001.jpg", "publishedAt": "2022-07-07T22:34:35Z", "content": "Opposition parties will press for the introduction of an anti-defection bill during the forthcoming monsoon session of the Lok Sabha. At a meeting of representatives of nine opposition parties, it wa… [+1511 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Zubair sent to six-day police custody in UP, top court to hear bail plea", "description": "“We sought Zubair’s police custody to recover the device from which he used to tweet, and also his motive for uploading objectionable matter on social media,” said Arvind Singh, Station House Officer, Khairabad (Sitapur), where the case was registered.", "url": "https://indianexpress.com/article/cities/delhi/zubair-sent-to-six-day-police-custody-in-up-8015927/", "urlToImage": "https://images.indianexpress.com/2022/07/zubair-3col-1.jpg", "publishedAt": "2022-07-07T22:34:34Z", "content": "CITING DEATH threats, Mohammed Zubair, the co-founder of fact-checker website Alt News, approached the Supreme Court on Thursday seeking quashing of the FIR and grant of bail urgently in a case filed… [+5332 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Lt Gen S A Cruze, an early pioneer of sports medicine in India, dies", "description": "For his service to sports in the country, he was awarded the Shiv Chhatrapati Award by the Maharashtra government and the Krida Bhushan Award by Symbiosis International University.", "url": "https://indianexpress.com/article/cities/pune/lt-gen-s-a-cruze-an-early-pioneer-of-sports-medicine-in-india-dies-8016001/", "urlToImage": "https://images.indianexpress.com/2022/07/sports-2col.jpg", "publishedAt": "2022-07-07T22:33:45Z", "content": "Considered one of the pioneers in sports medicine in India, Lt Gen S A Cruze, VSM passed away on Thursday following a heart attack. He was 70 and is survived by his wife and two daughters.Lt Gen S A … [+1722 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Amarjeet Sinha", "title": "Welfare of the urban poor cannot be an afterthought in economic growth plans", "description": "The time has come to enforce minimum wages. Master Plans must factor in the housing and welfare needs of the working class.", "url": "https://indianexpress.com/article/opinion/columns/welfare-urban-poor-cannot-afterthought-economic-growth-plans-8015868/", "urlToImage": "https://images.indianexpress.com/2020/07/urban-poor-1200.jpg", "publishedAt": "2022-07-07T22:30:57Z", "content": "To make rapid economic progress, India needs to improve the well-being of the workforce that migrates to cities in the hope of a better life. A large number of migrants who returned to their homes in… [+5641 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shamsul Islam", "title": "Every Indian, not Muslims alone, needs an independent judiciary", "description": "For the Supreme Court, constitutional issues should not be confused with minority issues.", "url": "https://indianexpress.com/article/opinion/columns/indian-muslims-needs-independent-judiciary-8015877/", "urlToImage": "https://images.indianexpress.com/2022/06/supreme-court-1.jpeg", "publishedAt": "2022-07-07T22:30:38Z", "content": "Faizan Mustafa, legal scholar, disclosed in a recent article (Bench above religion, IE, July 5) that in 1997, he refused to undertake a project on the role of Muslim judges as it was against the ingr… [+4421 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Varinder Bhatia", "title": "Dalai Lama to visit Leh on July 15 after four-year gap", "description": "China has always objected to the Tibetan spiritual leader's visits to the region, including during his last visit in 2018.", "url": "https://indianexpress.com/article/india/dalai-lama-to-visit-leh-on-july-15-after-four-year-gap-8015938/", "urlToImage": "https://images.indianexpress.com/2022/07/dalai-lama-759.jpg", "publishedAt": "2022-07-07T22:30:10Z", "content": "The Dalai Lama will be in Leh on July 15 his first visit in around four years that comes amid a deterioration of ties between India and China over the standoff in eastern Ladakh.China has always obje… [+1509 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Partha Sarathi Biswas", "title": "With poll defeat, NCP leader loses control over co-op sugar mill", "description": "For Bhagirath, this is the second setback after losing in the by-elections for the Pandharpur assembly seat which fell vacant due to his father's demise.", "url": "https://indianexpress.com/article/cities/pune/with-poll-defeat-ncp-leader-loses-control-over-co-op-sugar-mill-8015999/", "urlToImage": "https://images.indianexpress.com/2022/07/sugar-1-1.jpg", "publishedAt": "2022-07-07T22:28:04Z", "content": "Bhagirath Bhalke, the son of late NCP MLA Bharat, not only lost his directorship but also the control over the Vithal Cooperative Sugar Mill. Declared on Thursday, the results of elections of this co… [+1510 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "Easing the flow", "description": "As external environment becomes challenging, RBI moves to boost inflows, anticipating pressures ahead", "url": "https://indianexpress.com/article/opinion/editorials/rbi-moves-to-boost-inflows-anticipating-pressures-ahead-8015851/", "urlToImage": "https://images.indianexpress.com/2022/07/edit-7.jpg", "publishedAt": "2022-07-07T22:19:01Z", "content": "Data from the Union ministry of commerce and industry on Monday showed that the merchandise trade deficit had surged to a record high of $25.6 billion in June. For the entire first quarter, the defic… [+2787 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Iram Siddique", "title": "After rail officer killed by train, family alleges negligence, GRP launches criminal probe", "description": "The family’s allegations, including that of mental harassment, are now part of a criminal probe — apart from a separate internal investigation — being carried out by the Jabalpur division of the Government Railway Police.", "url": "https://indianexpress.com/article/cities/bhopal/after-rail-officer-killed-by-train-family-alleges-negligence-grp-launches-criminal-probe-8015985/", "urlToImage": "https://images.indianexpress.com/2022/07/Yadvendra-with-wife-Varsha.jpg", "publishedAt": "2022-07-07T22:18:39Z", "content": "On the evening of June 23, Yadvendra Singh Bhati was overseeing track work near the Amlai railway station in Madhya Pradesh when he was hit by a passenger train, suffering fatal injuries.But this was… [+6140 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuradha Mascarenhas", "title": "BA.2.75 variant in 20 cases from Nagpur division: Study", "description": "State health authorities have undertaken a detailed epidemiological investigation of these patients. Presently, the tally of BA.2.75 variant patients in the state stands at 30.", "url": "https://indianexpress.com/article/cities/pune/ba-2-75-variant-in-20-cases-from-nagpur-division-study-8015995/", "urlToImage": "https://images.indianexpress.com/2022/07/covid-2-3.jpg", "publishedAt": "2022-07-07T22:18:08Z", "content": "A PRELIMINARY clinical study of 75 patients with BA.2.74, BA.2.75, and BA.2.76 sub-variants of the Omicron has shown that a majority had mild symptoms. There were no deaths and none of the patients r… [+2026 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "Boris-exit", "description": "Outgoing British PM took people’s confidence for granted while flouting democratic rules and conventions", "url": "https://indianexpress.com/article/opinion/editorials/boris-took-peoples-confidence-for-granted-while-flouting-democratic-rules-8015847/", "urlToImage": "https://images.indianexpress.com/2022/07/edit-6.jpg", "publishedAt": "2022-07-07T22:15:33Z", "content": "In the end, it was a non-cooperation movement within the ruling party that led to the resignation of the British Prime Minister. The revolt within the Conservative Party-led government against Boris … [+2201 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Jignasa Sinha", "title": "‘My father is innocent; we don’t use newspapers to pack meat, only rotis rolled in them’", "description": "Sambhal man held for packing chicken in paper with God's images", "url": "https://indianexpress.com/article/india/sambhal-man-held-for-packing-chicken-in-newspaper-with-images-of-deities-8015982/", "urlToImage": "https://images.indianexpress.com/2022/07/Tabish-Hussain-at-his-fathers-restaurant.jpg", "publishedAt": "2022-07-07T22:14:26Z", "content": "There were only a handful of customers at Mehak Restaurant in Sambhal, Uttar Pradesh, on Thursday afternoon. But the alarm among the staff could be sensed easily they checked each newspaper piece car… [+4396 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Doctor arrested for minor’s rape at clinic in 2019", "description": "He allegedly raped her multiple times till December 2020 by threatening to make her photographs viral on social media. Police said she shared her ordeal with her family recently.", "url": "https://indianexpress.com/article/cities/pune/doctor-arrested-for-minors-rape-at-clinic-in-2019-8015993/", "urlToImage": "https://images.indianexpress.com/2022/07/arrest1-9.jpeg", "publishedAt": "2022-07-07T22:12:27Z", "content": "PUNE CITY police has arrested a doctor for allegedly raping a minor in 2019. The victim, who is now 19, lodged the FIR in this case at the Kothrud police station on Wednesday."}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "Khaki chic", "description": "Delhi Police’s outreach to youngsters via fashion accessories is a step forward. Now for some reform", "url": "https://indianexpress.com/article/opinion/editorials/delhi-polices-outreach-to-youngsters-via-fashion-accessories-is-a-step-forward-8015844/", "urlToImage": "https://images.indianexpress.com/2022/07/edit-5.jpg", "publishedAt": "2022-07-07T22:12:20Z", "content": "The long arm of the law will now come accessorised with a designer tote. Delhi Police has launched a line of apparel, handbags, backpacks, duffel bags, purses, wallets, belts, caps, cufflinks, keycha… [+1766 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "July 7, 1982, Forty Years Ago: Chaos In Bihar House", "description": "Twenty-one more members of the opposition were suspended by the Bihar Assembly for four days and later carried out of the House one by one. This was in pursuance of the order of the Speaker, Radhanandan Jha, to the marshal following a second day of the uproar…", "url": "https://indianexpress.com/article/opinion/editorials/forty-years-ago-chaos-in-bihar-house-8013547/", "urlToImage": "https://images.indianexpress.com/2022/07/07-Jul-1982_IE_001.jpg", "publishedAt": "2022-07-07T22:10:46Z", "content": "Twenty-one more members of the opposition were suspended by the Bihar Assembly for four days and later carried out of the House one by one. This was in pursuance of the order of the Speaker, Radhanan… [+1598 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Karnataka: After flagging ‘threat’, HC judge says ACB chief doing nothing to protect Bureau", "description": "", "url": "https://indianexpress.com/article/cities/bangalore/karnataka-hc-judge-says-acb-chief-doing-nothing-to-protect-bureau-8015980/", "urlToImage": "https://images.indianexpress.com/2022/07/karnataka-HC.jpg", "publishedAt": "2022-07-07T22:08:31Z", "content": "Three days after a Karnataka High Court judge said he was receiving indirect threat over his intervention in a corruption case, the judge on Thursday said in court that the head of state Ant-Corrupti… [+2044 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "BJP removes Haryana IT cell chief after his old tweet goes viral", "description": "Haryana BJP spokesperson Raman Malik told The Indian Express that he was not fully aware about the reasons behind the move.", "url": "https://indianexpress.com/article/cities/chandigarh/bjp-removes-haryana-it-cell-chief-after-his-old-tweet-goes-viral-8015973/", "urlToImage": "https://images.indianexpress.com/2022/07/bjp-1-1.jpg", "publishedAt": "2022-07-07T22:00:12Z", "content": "The BJP Thursday removed its Haryana IT cell incharge following a sustained campaign on the social media calling for his arrest over a tweet that he had made in 2017 but which went viral now amid the… [+1222 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pune: Rainfall increases water levels in 4 dams", "description": "Storage in the four dams has now increased to 4.93 TMC as the catchment area of these dams have continued to witness rainfall. The IMD has predicted heavy rainfall in the area till the weekend.", "url": "https://indianexpress.com/article/cities/pune/pune-rainfall-increases-water-levels-in-4-dams-8015990/", "urlToImage": "https://images.indianexpress.com/2022/07/PUNE-waterlogging-5col.jpg", "publishedAt": "2022-07-07T21:54:52Z", "content": "With continuous rainfall for the last few days, the water level in four dams supplying water to the city has increased to 4.93 TMC. Water storage in four dams Khadakwasla, Panshet, Varasgaon and Temg… [+787 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Alifiya Khan", "title": "Fergusson College starts own exam guidance centre", "description": "There will be two types of batches. An integrated, 15-month batch for graduate students will be of 800-hour duration, and a basic, 3-month foundation course for first year, second year, and third year students.", "url": "https://indianexpress.com/article/cities/pune/fergusson-college-starts-own-exam-guidance-centre-8015987/", "urlToImage": "https://images.indianexpress.com/2022/07/fergusson-college-main-1.jpg", "publishedAt": "2022-07-07T21:50:41Z", "content": "Fergusson College is starting its own competitive examination guidance centre to provide affordable coaching to aspirants of UPSC/MPSC examinations. From July 4, the centre has started accepting appl… [+1104 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Nupur Sharma row: NIA slams social media posts attributed to it, calls them fake", "description": "The statement came in reaction to social media posts that claimed that the NIA had provided a helpline number to report any Muslim or Muslim organisation making such calls on social media.", "url": "https://indianexpress.com/article/india/nupur-sharma-row-nia-slams-social-media-posts-attributed-to-it-calls-them-fake-8015978/", "urlToImage": "https://images.indianexpress.com/2022/07/nupur-sharma-1-3.jpg", "publishedAt": "2022-07-07T21:08:14Z", "content": "The National Investigation Agency (NIA) on Thursday said that it had not asked the public to inform it about calls for beheading people in connection with remarks against the Prophet made by suspende… [+1086 chars]"}]}