{"status": "ok", "totalResults": 375, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Nalini Singh", "title": "Nalini Singh writes: What would Lord Shiva want?", "description": "As the Gyanvapi dispute picks up, there is a need to make new unities of old fractures.", "url": "https://indianexpress.com/article/opinion/columns/nalini-singh-writes-lord-shiva-gyanvapi-mosque-petition-delhi-archaeological-survey-of-india-7957693/", "urlToImage": "https://images.indianexpress.com/2022/06/Gyanvapi-1.jpg", "publishedAt": "2022-06-07T22:45:13Z", "content": "In the Gyanvapi mosque/temple clash, the Hindu side seems to be winning the perception battle. Claiming their sovereign religious right to offer daily Shringar Gauri prayers on the mosque premises, t… [+5563 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Murder of Gujarat couple: Police say woman was shot with 7mm pistol", "description": "Originally hailing from Rajkot in Gujarat, Ashok, a stock market businessman, and Rashmita, a housewife, used to stay on the first floor of 73-A Harish Mukherjee Road apartment near Mitra Institute in Bhabanipur with their youngest daughter, and two of their …", "url": "https://indianexpress.com/article/cities/kolkata/murder-of-gujarat-couple-police-say-woman-was-shot-with-7mm-pistol-7957873/", "urlToImage": "https://images.indianexpress.com/2022/06/kolkata-murder.jpg", "publishedAt": "2022-06-07T22:43:58Z", "content": "Rashmita Shah (52), the wife of Ashok J Shah (56) the victims of a double murder at south Kolkata’s Bhabanipur Monday evening bore a bullet injury on her head and was shot dead using a 7mm pistol whi… [+1926 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Soumyarendra Barik", "title": "Govt ‘open’ to self-regulatory redressal by social media cos", "description": "Terming the regulations as an \"evolving\" issue, Minister of State for Electronics and IT Rajeev Chandrashekhar said the government is looking for a way to make social media companies more accountable in handling grievances of users.", "url": "https://indianexpress.com/article/india/govt-self-regulatory-redressal-social-media-companies-7957813/", "urlToImage": "https://images.indianexpress.com/2022/06/social-media-759.jpg", "publishedAt": "2022-06-07T22:40:03Z", "content": "WHILE THE Ministry of Electronics and Information Technology (MeitY) has proposed a government-appointed appeals’ committee to look into complaints against social media companies content moderation, … [+3525 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Man murders canteen staffer after argument over tea", "description": "The incident took place on Monday night outside United rubber company in Bhayandar (East) where the complainant Tahir Alam, the victim Sajjad Ali and two others worked in the canteen.", "url": "https://indianexpress.com/article/cities/mumbai/man-murders-canteen-staffer-after-argument-over-tea-7957889/", "urlToImage": "https://images.indianexpress.com/2022/06/Indian-express-1-3-2.jpg", "publishedAt": "2022-06-07T22:38:34Z", "content": "A canteen staffer of a private company was murdered allegedly by a man working for the same firm after they had picked up a fight over serving tasteless tea. After the fight, the staffer complained t… [+1522 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "HC reserves verdict on Tata Motor’s plea against disqualification by BEST", "description": "The plea said the BEST had erroneously declared the bid submitted by Tata Motors as ‘technically non-responsive’ and sought it to be reviewed.", "url": "https://indianexpress.com/article/cities/mumbai/hc-reserves-verdict-on-tata-motors-plea-against-disqualification-by-best-7957887/", "urlToImage": "https://images.indianexpress.com/2022/03/tata-motors-1.jpg", "publishedAt": "2022-06-07T22:36:28Z", "content": "The Bombay High Court on Tuesday reserved its verdict on a plea by Tata Motors Ltd challenging the decision by the Brihanmumbai Electric Supply and Transport Undertaking (BEST) to disqualify the comp… [+2033 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "Single Nodal Agency launch: FM bats for transparent governance", "description": "The SNA dashboard of Public Financial Management System, launched by the Minister as part of the Azadi ka Amrit Mahotsav iconic week celebrations, was put in place in July 2021 and all states got on board by March this year.", "url": "https://indianexpress.com/article/business/single-nodal-agency-launch-fm-transparent-governance-7957821/", "urlToImage": "https://images.indianexpress.com/2022/06/nirmala-sitharamn.jpg", "publishedAt": "2022-06-07T22:35:38Z", "content": "Launching the Single Nodal Agency (SNA) dashboard, a system which tracks transfer of funds to states for Centrally sponsored schemes and utilisation of funds by central agencies, Finance Minister Nir… [+1444 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Vallabh Ozarkar", "title": "MMRDA to conduct study of road networks ahead of MTHL opening", "description": "The MMRDA had decided to extend the MTHL to the Mumbai-Pune Expressway to address the issue of bottleneck at Navi Mumbai caused by the narrow-lane connectivity, leading to smooth traffic movement between Mumbai and Pune.", "url": "https://indianexpress.com/article/cities/mumbai/mmrda-to-conduct-study-of-road-networks-ahead-of-mthl-opening-7957884/", "urlToImage": "https://images.indianexpress.com/2022/03/mmrda-1-2.jpg", "publishedAt": "2022-06-07T22:30:05Z", "content": "The Mumbai Metropolitan Regional Development Authority (MMRDA) is planning to carry out a Traffic Impact and Dispersal Study of road networks and major intersections of the city once the Mumbai Trans… [+2330 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Yogesh Naik", "title": "Sena likely to nominate ordinary Shiv Sainik to Legislative Council", "description": "Of the 10, five seats are falling vacant due to the retirement of BJP leaders on July 7. While two seats each are falling vacant due to the retirement of Shiv Sena and NCP leaders, one Congress leader is also retiring on July 7.", "url": "https://indianexpress.com/article/cities/mumbai/sena-likely-to-nominate-ordinary-shiv-sainik-to-legislative-council-7957883/", "urlToImage": "https://images.indianexpress.com/2022/04/voting-1200.jpg", "publishedAt": "2022-06-07T22:27:05Z", "content": "With the elections for the members of the Legislative Council (MLCs) around the corner, the Shiv Sena is likely to repeat the Rajya Sabha election pattern and nominate an ordinary Shiv Sainik to the … [+2011 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sagar Rajput", "title": "DRI lays trap, nabs Latvia national with 6.8 kg cocaine", "description": "A DRI official said, “We had received reliable inputs from our informers that a person is going to arrive at the airport from a foreign country with a big commercial quantity (of cocaine) and accordingly we laid a trap and caught him.”", "url": "https://indianexpress.com/article/cities/mumbai/dri-lays-trap-nabs-latvia-national-with-6-8-kg-cocaine-7957881/", "urlToImage": "https://images.indianexpress.com/2021/12/mumbai-airport-12.jpeg", "publishedAt": "2022-06-07T22:18:57Z", "content": "The Directorate of Revenue Intelligence (DRI) officials on Monday laid a trap and arrested a 24-year-old Latvia national at the Chhatrapati Shivaji Maharaj International Airport for allegedly trying … [+1439 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Parthasarathi Biswas", "title": "First export release order by Centre since curbs upsets sugar mills", "description": "On May 24, the Centre decided to restrict sugar exports to ensure ample availability at the start of the next season. Exports now require an NOC from the Ministry of Food and Consumer Affairs before it is shipped out of the country.", "url": "https://indianexpress.com/article/cities/pune/first-export-release-order-by-centre-since-curbs-upsets-sugar-mills-7957869/", "urlToImage": "https://images.indianexpress.com/2022/06/Sugar-2.jpg", "publishedAt": "2022-06-07T22:17:10Z", "content": "The first Export Release Order (ERO) issued by the central government after sugar export was moved from open to restricted category has upset sugar mills, which say the order puts them at a disadvant… [+1088 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Yogesh Naik", "title": "Covid-infected legislators to vote separately", "description": "In all, 287 MLAs would vote in the polls, as Andheri East MLA Ramesh Latke had passed away last month and two ministers – Nawab Malik and Anil Deshmukh – are in jail.", "url": "https://indianexpress.com/article/cities/mumbai/covid-infected-legislators-to-vote-separately-7957877/", "urlToImage": "https://images.indianexpress.com/2022/06/evm.jpeg", "publishedAt": "2022-06-07T22:08:17Z", "content": "The State Election Commission is set to make legislators, who test positive for Covid-19, vote separately in the Rajya Sabha polls.The state Chief Electoral Officer, Shirkant Deshpande, said, We will… [+891 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "HSC results to be announced today", "description": "Maharashtra School Education Minister Varsha Gaikwad made the announcement on Tuesday on her official Twitter handle. In a video message, Gaikwad extended good wishes to all candidates waiting for the result.", "url": "https://indianexpress.com/article/cities/mumbai/hsc-results-to-be-announced-today-7957876/", "urlToImage": "https://images.indianexpress.com/2022/03/classroom.jpg", "publishedAt": "2022-06-07T22:02:27Z", "content": "The results of Higher Secondary Certificate (HSC) examinations will be declared at 1 pm on Wednesday, said officials of the Maharashtra State Board of Secondary and Higher Secondary Education. Candid… [+1293 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "HC plea seeks termination of services of SRA staffers over 65 years of age", "description": "The plea claimed that such employees, including some who are 75 years old, have deprived opportunity to newer recruits. It sought that the SRA should terminate the services of such employees and also issue fresh recruitment notices.", "url": "https://indianexpress.com/article/cities/mumbai/hc-plea-seeks-termination-of-services-of-sra-staffers-over-65-years-of-age-7957875/", "urlToImage": "https://images.indianexpress.com/2022/06/bombay-high-court-1200-3-4.jpg", "publishedAt": "2022-06-07T21:58:19Z", "content": "A social activist recently moved a public interest litigation (PIL) in the Bombay High Court seeking termination of services of Slum Rehabilitation Authority (SRA) employees, who are above 65 years o… [+1149 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Hospital seeks dismissal of couple’s plea seeking transfer of preserved embryo", "description": "The couple has sought directions to the hospital to transfer their cryopreserved embryos to a fertility centre in Thane or any other ART clinic in Mumbai, and continue the surrogacy procedure.", "url": "https://indianexpress.com/article/cities/mumbai/hospital-seeks-dismissal-of-couples-plea-seeking-transfer-of-preserved-embryo-7957874/", "urlToImage": "https://images.indianexpress.com/2022/06/Indian-Express-14.jpeg", "publishedAt": "2022-06-07T21:50:13Z", "content": "The PD Hinduja Hospital administration and an IVF consultant affiliated with the hospital on Monday submitted affidavits seeking dismissal of plea by a city couple seeking directions to allow them to… [+2949 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Indian Overseas Bank moves court, seeks to withdraw cheating complaint against BJP leader Mohit Kambo", "description": "The Mumbai Police Economic Offences Wing had booked Kamboj and two others for allegedly causing losses of over Rs 52 crore to the bank. The complainant in the case was the bank's chief regional manager.", "url": "https://indianexpress.com/article/cities/mumbai/indian-overseas-bank-moves-court-seeks-to-withdraw-cheating-complaint-against-bjp-leader-mohit-kambo-7957871/", "urlToImage": "https://images.indianexpress.com/2022/06/mohit-kamboj-1-2.jpeg", "publishedAt": "2022-06-07T21:42:50Z", "content": "After writing to the Mumbai Police last week, the Indian Overseas Bank on Tuesday approached a sessions court, which is hearing the anticipatory bail plea of BJP leader Mohit Kamboj, stating that it … [+1182 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rupsa Chakraborty", "title": "33 districts wasted more Covaxin vials than Maharashtra average of 2.36%", "description": "Health officials attribute this poor turnout in the district as the reason behind the 5.38 per cent and 0.75 per cent wastage of Covaxin and Covishield vaccines, respectively.", "url": "https://indianexpress.com/article/cities/mumbai/33-districts-wasted-more-covaxin-vials-than-maharashtra-average-of-2-36-7957866/", "urlToImage": "https://images.indianexpress.com/2022/04/covaxin-1-1.jpg", "publishedAt": "2022-06-07T21:28:40Z", "content": "Low turnout of beneficiaries has led rural Maharashtra record maximum wastage of vaccines since the start of the mass immunisation programme last year.According to the public health department data, … [+3320 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Granted pardon, Sachin Waze seeks bail in CBI corruption case", "description": "Waze's lawyer Aarti Kalekar moved the plea under Section 167 (2) of the Criminal Procedure Code, under which an accused is entitled to be released if a chargesheet is not filed within the stipulated time. Waze was arrested in April in the case.", "url": "https://indianexpress.com/article/cities/mumbai/granted-pardon-sachin-waze-seeks-bail-in-cbi-corruption-case-7957864/", "urlToImage": "https://images.indianexpress.com/2022/06/sachin-waze-ANI-2.jpg", "publishedAt": "2022-06-07T21:28:22Z", "content": "Dismissed Mumbai Police officer Sachin Waze, who has been pardoned in a case lodged against him by the CBI on charges of corruption, filed for bail on Tuesday. He sought default bail before the court… [+120 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sanjana Bhalerao", "title": "Traders, shopkeepers seek another 6 months to install Marathi signboards", "description": "Say redesigning signboards for shops will require professional help, cite difficulty in carrying out work during monsoon in letter to chief minister on June 4.", "url": "https://indianexpress.com/article/cities/mumbai/traders-shopkeepers-seek-another-6-months-to-install-marathi-signboards-7957846/", "urlToImage": "https://images.indianexpress.com/2022/06/MUMBAI-SHOPS-1-1.jpg", "publishedAt": "2022-06-07T21:25:19Z", "content": "In a letter to Chief Minister Uddhav Thackeray on June 4, an association of traders and shopkeepers has asked for a six-month extension to the June 30 deadline to install Marathi signboards in all sh… [+1883 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kiran Parashar", "title": "Amid textbook row, ‘chaddi’ stir: Cong burns, BJP collects", "description": "Slamming the Congress’s ‘burn the chaddis’ campaign, BJP leader and Union Minister Pralhad Joshi on Monday said: “Their (Siddaramaiah’s and the Congress’s) chaddis have become loose and torn and, thus, they are burning them.”", "url": "https://indianexpress.com/article/cities/bangalore/amid-textbook-row-chaddi-stir-cong-burns-bjp-collects-7957856/", "urlToImage": "https://images.indianexpress.com/2022/06/hee.jpg", "publishedAt": "2022-06-07T21:20:55Z", "content": "As the Karnataka Congress continues its campaign of burning khaki chaddis (shorts) in protests against saffronisation of school books in Karnataka, the BJP has launched a counter, and in a similar fa… [+960 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "QS rankings out on Thursday: India’s score up to 35, IISc among top in world, says President Kovind", "description": "The 2023 edition of the QS or Quacquarelli Symonds world university rankings will be released Thursday.", "url": "https://indianexpress.com/article/education/qs-rankings-out-on-thursday-indias-score-up-to-35-iisc-among-top-in-world-says-president-kovind-7957852/", "urlToImage": "https://images.indianexpress.com/2022/06/kovind.jpg", "publishedAt": "2022-06-07T21:08:33Z", "content": "Indias tally in the QS rankings has risen to 35 this year from 29 in 2021, President Ram Nath Kovind said Tuesday. According to the rankings, the Bengaluru-based Indian Institute of Science (IISc) ha… [+1863 chars]"}]}