{"status": "ok", "totalResults": 305, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Pavneet Singh Chadha, Jignasa Sinha", "title": "Harrowing last calls to kin: ‘Please mujhe bacha lo’", "description": "Of the 27 victims, bodies of only eight had been identified by evening.", "url": "https://indianexpress.com/article/cities/delhi/delhi-mundka-fire-victims-kin-reaction-7917813/", "urlToImage": "https://images.indianexpress.com/2022/05/delhi-fire-2-1.jpeg", "publishedAt": "2022-05-15T00:49:24Z", "content": "Mummy, papa aag lag gayi yahan pe, please call fire brigade, we are all trapped. This was the last call 26-year-old Tania Bhushan made to her parents, minutes before a massive fire killed her and 26 … [+3301 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Remembering Pandit Shivkumar Sharma: The man who made santoor classical", "description": "His contribution in establishing the santoor as a classical instrument of heft made Pandit Shivkumar Sharma, who passed away this week, a man of prodigious talent and determination, writes Aneesh Pradhan", "url": "https://indianexpress.com/article/express-sunday-eye/remembering-pandit-shivkumar-sharma-the-man-who-made-santoor-classical-7916979/", "urlToImage": "https://images.indianexpress.com/2022/05/Pandit-Shivkumar-Sharma-1200.jpg", "publishedAt": "2022-05-15T00:40:26Z", "content": "The history of Hindustani music is replete with instances of experimentation that have shaped its course. These experiments have taken place in the realm of performance practice, pedagogy, modes of d… [+10508 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Harikishan Sharma", "title": "In Khargone, a tale of two PMAY houses: one bulldozed, other vandalised by mob", "description": "In violence that erupted during Ram Navami procession in which at least 10 houses of her neighbours were set ablaze. Her main door’s a gaping hole, so is the window; a lifetime’s assets, including a gas stove, cylinder, water motor pump, fan and television, a…", "url": "https://indianexpress.com/article/express-exclusive/khargone-violence-demolition-pmay-house-mob-vandalism-7917808/", "urlToImage": "https://images.indianexpress.com/2022/05/khargone.jpg", "publishedAt": "2022-05-15T00:34:13Z", "content": "In blue ink, this is scrawled on the wall of the single-storey house at Towerwali Gali at Sanjay Nagar in Khargone. The house, built under the Prime Minister Awas Yojana-Urban, belongs to Leela Bai C… [+4118 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manoj C G", "title": "Chintan Shivir ends today: Hindutva debate in Cong, party ducks hard talk on defeat", "description": "The CWC will finalise the Udaipur declaration Sunday based on inputs from six committees which discussed: political challenges, organisational issues, economic issues, social justice, youth and empowerment; and farmers and agriculture.", "url": "https://indianexpress.com/article/india/congress-chintan-shivir-hindutva-debate-poll-defeat-7917801/", "urlToImage": "https://images.indianexpress.com/2022/05/chintan-shivar.jpg", "publishedAt": "2022-05-15T00:12:09Z", "content": "On the videography survey of the Kashi Vishwanath temple-Gyanvapi mosque complex, the Congress took a categorial stand Saturday that no attempt should be made to change the status of any place of wor… [+3802 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Ashok Gulati, Sanchit Gupta", "title": "Explained: Why ban is knee-jerk reaction, hits farmers and dents policy credibility", "description": "The Government could have announced a bonus of Rs 200-250/quintal on top of MSP to augment its wheat procurement.", "url": "https://indianexpress.com/article/explained/wheat-exports-ban-policy-impact-farmers-explained-7917789/", "urlToImage": "https://images.indianexpress.com/2022/05/wheat-export-ban.jpg", "publishedAt": "2022-05-15T00:06:27Z", "content": "In a knee-jerk reaction, the Government has banned wheat exports with effect from May 13, with some minor exceptions for those who have irrevocable letters of credit or where the governments of impor… [+4020 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "At Chintan Shivir, Hooda says Congress wants to bring ‘Evergreen Revolution’", "description": "The committee, headed by Hooda, was constituted by Congress on farm issues at the Chintin Shivir.", "url": "https://indianexpress.com/article/cities/chandigarh/chintin-shivir-hooda-congress-bring-evergreen-revolution-7917803/", "urlToImage": "https://images.indianexpress.com/2022/05/chintan-shivir-as-14-congress-chintan-shivar-udaipur28-1.jpg", "publishedAt": "2022-05-15T00:00:26Z", "content": "On the lines of green revolution for farmers, the Congress aims to bring evergreen revolution, said Leader of Opposition Bhupinder Singh Hooda during the ongoing Chintin Shivir of Congress in Rajasth… [+2053 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Jignasa Sinha, Pavneet Singh Chadha, Abhinaya Harigovind", "title": "Delhi fire: 21 of 27 dead so far are women, many started work post-pandemic", "description": "Of the 27 confirmed deaths so far, 21 were women. While only eight victims, including five women, have been identified so far, 24 of the 29 in the missing persons’ list prepared by police – who are feared to be among the dead — are women.", "url": "https://indianexpress.com/article/cities/delhi/delhi-mundka-fire-women-victims-covid-pandemic-7917794/", "urlToImage": "https://images.indianexpress.com/2022/05/Delhi-fire-4.jpeg", "publishedAt": "2022-05-14T23:44:14Z", "content": "Most of those killed in the fire at a four-storey office complex in Mundka, West Delhi, on Friday were young women who had taken up jobs to support their families, particularly after the pandemic.Of … [+4261 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Punjab: FIR filed against three for distorting historical facts in books of class XII", "description": "The books were allegedly prescribed in schools affiliated to Punjab School Education Board (PSEB). The case was registered at State Crime Police station in Phase IV.", "url": "https://indianexpress.com/article/cities/sas-nagar-mohali/punjab-fir-filed-against-three-for-distorting-historical-facts-in-books-of-class-xii-7917797/", "urlToImage": "https://images.indianexpress.com/2022/05/arrest-15.jpg", "publishedAt": "2022-05-14T23:41:49Z", "content": "Punjab police on Saturday registered a case against three people in connection with distortion of historical facts of Sikh History in three books of class 12. The books were allegedly prescribed in s… [+1167 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Peter Vidal", "title": "Horoscope Today, May 15, 2022: Taurus, Aries, Pisces and other signs — check astrological prediction", "description": "Horoscope Today, May 15, 2022: Taurus, do try to remember that there are times when you should do what other people want, and times when you should follow your own advice.", "url": "https://indianexpress.com/article/horoscope/horoscope-today-may-15-2022-gemini-aries-pisces-and-other-signs-check-astrological-prediction-7917075/", "urlToImage": "https://images.indianexpress.com/2022/05/horoscope-1-1.jpg", "publishedAt": "2022-05-14T23:30:44Z", "content": "There is nothing you can do to escape the fact that your stars are looking busier than even you are used to. You may as well muck in and realise that time off is bound to be a very rare occurrence in… [+4055 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Tepid response for booster dose shots in Panchkula", "description": "Only 4,759 have been administered the dose so far", "url": "https://indianexpress.com/article/cities/panchkula/tepid-response-for-booster-dose-shots-in-panchkula-7917793/", "urlToImage": "https://images.indianexpress.com/2022/05/Chandigarh-covid-test.jpg", "publishedAt": "2022-05-14T23:29:29Z", "content": "Free immunisation of booster dose for all eligible adults over 18 years announced by the Haryana government from May 4 onwards has met with sluggish response from the general public in Panchkula. Peo… [+3362 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Panchkula: Bhuppi Rana gang member arrested for firing at Balaji mining workers", "description": "The accused was identified as Ravi Saini resident of Raipur Rani’s Guga Madi village.", "url": "https://indianexpress.com/article/cities/panchkula/panchkula-bhuppi-rana-gang-member-arrested-for-firing-at-balaji-mining-workers-7917791/", "urlToImage": "https://images.indianexpress.com/2022/05/arrest-14.jpg", "publishedAt": "2022-05-14T23:14:12Z", "content": "The Sector 19 crime branch arrested a member of the Bhuppi Rana gang on Friday night for firing at workers of the Balaji mining site near Mandalay village Raipur Rani. The incident took place on May … [+1657 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "The Night of Ideas: Knowledge and arts in post-Covid world", "description": "The event included discussions around different issues including a debate on 'rebuilding together' in a post-Covid world.", "url": "https://indianexpress.com/article/cities/chandigarh/the-night-of-ideas-knowledge-and-arts-in-post-covid-world-7917788/", "urlToImage": "https://images.indianexpress.com/2022/05/FSvBLivakAAxpMk.jpg", "publishedAt": "2022-05-14T23:06:20Z", "content": "As part of Bonjour India, the recently concluded Night of Ideas event presented an opportunity to explore the latest discoveries in knowledge and arts.The event included discussions around different … [+2340 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Maulshree Seth", "title": "Nanda Gopal Gupta interview: ‘I told officers to act like luxury car sellers… Show intent, and they are after you to make that purchase… An industry shows interest, give your 100%’", "description": "\"It should be written in black and white that Mulayam Singh Yadav, Mayawati and Akhilesh Yadav are responsible for the lost credibility of NOIDA and its adjoining region in UP,\" said Nanda Gopal Gupta.", "url": "https://indianexpress.com/article/cities/lucknow/up-minister-nanda-gopal-gupta-interview-infrastructure-projects-7917785/", "urlToImage": "https://images.indianexpress.com/2022/05/Nanda-Gopal-Gupta.jpg", "publishedAt": "2022-05-14T22:52:38Z", "content": "As the Uttar Pradesh Infrastructure and Industrial Development Minister, Nanda Gopal Gupta finds himself holding one of the most crucial portfolios in the Yogi Adityanath-II government. On June 3, th… [+7327 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Chandigarh’s architectural heritage: French envoy assures support for restoration and conservation", "description": "Emmanuel Lenain, while interacting with the Administrator, said that the two countries have shared good working relations, and added that finding new solutions in area of mutual interest would further help in strengthen relations.", "url": "https://indianexpress.com/article/cities/chandigarh/chandigarh-architectural-heritage-french-envoy-support-restoration-conservation-7917784/", "urlToImage": "https://images.indianexpress.com/2022/05/emmnuel-2.jpg", "publishedAt": "2022-05-14T22:49:55Z", "content": "The French Ambassador to India, Emmanuel Lenain, called on the Punjab Governor and UT Administrator, Banwarilal Purohit on Saturday during his visit to Chandigarh. The Ambassador assured their suppor… [+2988 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "In search of a house for Mr Wrong Caste", "description": "A joint study from 2015 to 2017, conducted by Savitribai Phule Pune University, Jawaharlal Nehru University and the Indian Institute of Dalit Studies shows that 22.3 per cent of forward caste (FC) Hindus own 41 per cent of the country’s wealth.", "url": "https://indianexpress.com/article/opinion/columns/caste-division-dalits-urbanisation-wealth-7917638/", "urlToImage": "https://images.indianexpress.com/2022/05/real-estate.jpg", "publishedAt": "2022-05-14T22:30:58Z", "content": "Exhorting Dalits to urbanise, Babasaheb Ambedkar had famously said What is a village but a sink of localism, a den of ignorance, narrow mindedness and communalism. While several positive strides have… [+4084 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "Infra for 5G rollout: GatiShakti Sanchar for RoW nod launched", "description": "The GatiShakti Sanchar portal will enable centralised right of way (RoW) approvals for telecom infrastructure projects and can be used by industry players to apply for RoW approvals, including for 5G services.", "url": "https://indianexpress.com/article/business/infra-for-5g-rollout-gatishakti-sanchar-for-row-nod-launched-7917721/", "urlToImage": "https://images.indianexpress.com/2022/05/Ashwini-Vaishnaw-.jpg", "publishedAt": "2022-05-14T22:30:44Z", "content": "Union Minister Ashwini Vaishnaw on Saturday said that legal backing for right of way (RoW) for telecom infrastructure projects will be put in place by December this year, as he launched the GatiShakt… [+2591 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tavleen Singh", "title": "Small things that matter", "description": "When I asked myself why Narendra Modi who has paid so much attention to rectifying negligence of many kinds during Congress rule, I noticed that Gujarat and Uttar Pradesh were the worst offenders when it came to malnutrition in infants.", "url": "https://indianexpress.com/article/opinion/columns/hindutva-communalism-taj-mahal-nfhs-7917708/", "urlToImage": "https://images.indianexpress.com/2022/01/hindu-2.jpg", "publishedAt": "2022-05-14T22:30:37Z", "content": "Once more last week the bulldozers rolled in Delhi destroying the lives and dreams of ordinary people. Once more battles raged over which mosque was once a Hindu temple. Into this rectification of hi… [+4967 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "P Chidambaram", "title": "Good, bad and doubtful", "description": "The big, breaking, bad news is that a little more than one-half of India’s population did not complete 10 years of school education — 59 per cent of women and 49. 8 per cent of men.", "url": "https://indianexpress.com/article/opinion/columns/nfhs-5-data-literacy-health-7917613/", "urlToImage": "https://images.indianexpress.com/2022/05/YOUTH.jpg", "publishedAt": "2022-05-14T22:30:24Z", "content": "The National Family Health Survey-5 was conducted during 2019-21. The previous survey (NHFS-4) was conducted in 2015-16. Both were periods when the NDA government was in office; therefore the changes… [+4960 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Leher Kala", "title": "The toxic glare of limelight", "description": "There is a tendency to believe that those born with the proverbial silver spoon are happily insulated from the vagaries of life.", "url": "https://indianexpress.com/article/opinion/columns/rahul-gandhi-nightclub-limelight-toxic-glare-7917709/", "urlToImage": "https://images.indianexpress.com/2022/04/pti3_31_2019_000164a.jpg", "publishedAt": "2022-05-14T22:30:23Z", "content": "In the last 10 days, the lurid fascination for Rahul Gandhis private life has spurred Op-Ed pieces in newspapers, righteous Tweets and drawing room debates on what exactly constitutes propriety for p… [+3659 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Leena Misra", "title": "MSU, where freedom was once a lived reality", "description": "Acharya Vinoba Bhave, Dadasaheb Phalke, Babasaheb Ambedkar, Kanhaiyalal Munshi, former RBI governor I G Patel and the 2009 Nobel laureate Venkatraman Ramakrishnan are among the university’s distinguished alumni.", "url": "https://indianexpress.com/article/opinion/columns/msu-baroda-history-art-exhibition-attack-7917705/", "urlToImage": "https://images.indianexpress.com/2022/05/MSU-.jpg", "publishedAt": "2022-05-14T22:30:21Z", "content": "A distinct memory for any visitor to Vadodara is likely to be of students of Maharaja Sayajirao University of Baroda (MSUB) with their sketch pads and pencils at the railway station, at Kamatibaug (n… [+5546 chars]"}]}