{"status": "ok", "totalResults": 411, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Mihir Vasavda", "title": "Longs Read: India eyes medals for shooting, but isn’t shooting for medals", "description": "IOA frets over sport’s exclusion from CWG, and is slow to adapt to the changing dynamics of multi-discipline events as well as lacking in participation in major games", "url": "https://indianexpress.com/article/sports/sport-others/longs-read-india-eyes-medals-for-shooting-but-isnt-shooting-for-medals-7894458/", "urlToImage": "https://images.indianexpress.com/2022/04/Olym.jpg", "publishedAt": "2022-04-30T04:45:59Z", "content": "The bizarre sequence of events would have dumbfounded even the best of satirists.In mid-2019, fuming over the exclusion of shooting from the Birmingham Commonwealth Games, Indian Olympic Association … [+10038 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Explained: How did tennis legend Boris Becker land in jail?", "description": "Since he retired in 1999, Boris Becker has struggled with his finances. Now, the German tennis legend has been jailed for two-and-a-half years. What has he been found guilty of? What did the court observe? Will he actually be in jail?", "url": "https://indianexpress.com/article/explained/boris-becker-jail-court-case-explained-7894558/", "urlToImage": "https://images.indianexpress.com/2022/04/becker-2.jpg", "publishedAt": "2022-04-30T04:44:49Z", "content": "Boris Becker is one of the biggest names in tennis known for his flamboyant playing style on court and high-flying life off it. With six Grand Slam singles titles (three at Wimbledon, two Australian … [+5746 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shubhangi Khapre", "title": "Alliance or not, BJP keen to see Raj Thackeray rise to foil Sena", "description": "Raj Thackeray is all set to hold a rally in Aurangabad on May 1 to protest against the use of loudspeakers at mosques.", "url": "https://indianexpress.com/article/india/political-pulse/bjp-mns-raj-thackeray-aurangabad-rally-shiv-sena-7894549/", "urlToImage": "https://images.indianexpress.com/2022/04/Raj-Thackeray-2.jpeg", "publishedAt": "2022-04-30T04:40:28Z", "content": "Ahead of the Raj Thackeray-led Maharashtra Navnirman Sena (MNS)’s Aurangabad rally, one key question doing the rounds in the political circles is whether the BJP will tie up with the MNS for the upco… [+4586 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "অসমে জামিন জিগনেশের, ‘মিথ্যা মামলায় গ্রেফতার’, পুলিশকে তুলোধনা আদালতের", "description": "অসম পুলিশের হেফাজতে থাকাকালীন এক মহিলা পুলিশ আধিকারিককে লাঞ্ছনার অভিযোগে গ্রেফতার হন গুজরাতের বিধায়ক জিগনেশ মেভানি।", "url": "https://bengali.indianexpress.com/general-news/granting-jignesh-mevani-bail-court-raps-assam-police-for-abusing-process-of-court-and-law-437725/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/04/Jignesh-Mevani.jpg", "publishedAt": "2022-04-30T04:39:32Z", "content": "- - , ” - ”\r\n ‘’ , ” - ”\r\n - , \r\n , ” - ” ‘’ \r\n , , ” () ” , , - \r\nRead full story in English\r\nStay updated with the latest news headlines and all the latest General news download Indian Express Beng… [+109 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Heat wave: Punjab govt prepones summer vacations for govt schools", "description": "As per the latest now order, now summer vacations for all students in government schools will commence from May 15 till June 30.", "url": "https://indianexpress.com/article/education/heat-wave-punjab-govt-prepones-summer-vacations-for-govt-schools/", "urlToImage": "https://images.indianexpress.com/2022/04/Heatwave-in-Punjab.jpg", "publishedAt": "2022-04-30T04:19:10Z", "content": "With sweltering heat continuing in the state, Punjab government Friday ordered change in timings for government school students and also announced preponing of summer vacations."}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Mumbai News Live: Woman accuses Shiv Sena MP Rahul Shewale of rape; severe heat likely in parts of Maharashtra", "description": "Mumbai Today News, Maharashtra, Mumbai Latest News, Mumbai Weather, Heat wave Updates, Maharashtra Coronavirus Cases Today Updates, 30 Apr: IMD said that severe heat impact includes high temperature, increased likelihood of heat-related illness.", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-news-live-heatwave-weather-covid-cases-traffic-updates-7894502/", "urlToImage": "https://images.indianexpress.com/2022/04/RAHUL-SHEWAL.jpg", "publishedAt": "2022-04-30T04:16:51Z", "content": "Shiv Sena Lok Sabha MP Rahul Shewale (File Photo)Mumbai Live News: The India Meteorological Department (IMD) has issued an orange alert indicating severe heat for the Wardha, Akola, Chandrapur, and Y… [+1023 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Kartik Aaryan, Sara Ali Khan, Kiara Advani look their stylish best at GQ awards. See photos", "description": "Sara Ali Khan, Siddhant Chaturvedi, Shweta Tripathi, Kartik Aaryan, Kriti Sanon, Tahir Raj Bhasin, Fahadh Faasil, Kiara Advani were among the many who attended the award function.", "url": "https://indianexpress.com/article/entertainment/bollywood/kartik-aaryan-sara-ali-khan-kiara-advani-gq-awards-2022-see-pics-7894468/", "urlToImage": "https://images.indianexpress.com/2022/04/gq-awards-2022.jpg", "publishedAt": "2022-04-30T04:14:12Z", "content": "Friday evening saw Bollywood celebrities put their most stylish foot forward as they arrived for GQ Awards 2022. Kriti Sanon, Kiara Advani, Siddhant Chaturvedi, Sara Ali Khan, and several others look… [+1860 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Heroin worth Rs 450 crore recovered from Gujarat’s Pipavav port", "description": "To dodge the authorities, the drug syndicate had applied a unique modus operandi in which threads were soaked in a solution containing heroin, which were then dried, made into bales and packed in bags for export.", "url": "https://indianexpress.com/article/cities/ahmedabad/heroin-worth-rs-450-crore-recovered-from-gujarats-pipavav-port-7894498/", "urlToImage": "https://images.indianexpress.com/2022/04/heroin-soaked-threads.jpg", "publishedAt": "2022-04-30T04:10:27Z", "content": "In a joint operation, the Gujarat Anti-Terrorist Squad(ATS) and the Directorate of Revenue Intelligence (DRI) have recovered nearly 90 kilogram of heroin worth Rs 450 crore from a shipping container … [+1130 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "‘Haryana govt did not set up any power plant in last 8 years’: Cong blames BJP-JJP for electricity crisis", "description": "“This government did not set up a single power plant in the last eight years and demolished four functional power plants at Panipat,\" Congress leader Randeep Singh Surjewala said.", "url": "https://indianexpress.com/article/cities/chandigarh/haryana-govt-did-not-set-up-any-power-plant-in-last-8-years-cong-blames-bjp-jjp-for-electricity-crisis-7894524/", "urlToImage": "https://images.indianexpress.com/2022/04/surjewala1.jpeg", "publishedAt": "2022-04-30T04:09:36Z", "content": "Saying that digging a well makes little sense when the house is on fire, senior Congress leader and the partys national General Secretary Randeep Singh Surjewala accused the BJP-JJP government in Har… [+2909 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Centre’s mismanagement led to artificial power crisis: Congress", "description": "In a Facebook post, former Congress president Rahul Gandhi too hit out at the government asking it to stop running the \"bulldozer of hatred\" and start running power plants instead.", "url": "https://indianexpress.com/article/india/centres-mismanagement-led-to-artificial-power-crisis-congress-power-cuts-7894519/", "urlToImage": "https://images.indianexpress.com/2022/04/power-plant-1.jpg", "publishedAt": "2022-04-30T04:06:15Z", "content": "WITH SEVERAL states facing long power cuts, the Congress on Friday hit out at the central government for its mismanagement of the situation arguing that the Centre was not providing logistical suppor… [+2261 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "80 homeless people face uncertain future after Delhi govt notice to vacate temporary shelter at Haj manzil", "description": "The Haj Manzil, located near Turkman Gate, has about 60-70 men, including students and daily wagers.", "url": "https://indianexpress.com/article/cities/delhi/80-homeless-people-stranded-after-delhi-govt-notice-to-vacate-temporary-shelter-at-haj-manzil-7894461/", "urlToImage": "https://images.indianexpress.com/2022/04/Delhi-17.jpg", "publishedAt": "2022-04-30T04:03:46Z", "content": "Around 70-80 homeless people staying at the Haj Manzil, a temporary shelter home, have been asked to vacate the premises by May 1, after the Delhi government issued a notice citing arrangements for H… [+2673 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Karnataka, Bengaluru News Live Updates: State to form committee to control hate speeches, CM Bommai says", "description": "Karnataka, Bengaluru News Updates: The Karnataka government withdrew results to the Police Sub-Inspector (PSI) exams that were held in October last year and admitted that malpractice took place at more than one exam centre.", "url": "https://indianexpress.com/article/cities/bangalore/karnataka-bengaluru-news-live-updates-covid-cases-deaths-psi-recruitment-scam-bommai-7894466/", "urlToImage": "https://images.indianexpress.com/2022/04/BOMMAI-2-1-3.jpeg", "publishedAt": "2022-04-30T03:56:09Z", "content": "Former president of the BJPs Kalaburagi district womens unit Divya Hagaragi, an accused in the police sub-inspector recruitment exam scam, was among the five people arrested by the Karnataka Polices … [+1088 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Priyanka Chopra looks stunning as she unwinds in the pool, hubby Nick Jonas’ reaction is priceless", "description": "Priyanka Chopra shared two photos showing herself in an infinity pool. While one photo, she said, is her Instagram look, the other she joked is the reality.", "url": "https://indianexpress.com/article/entertainment/bollywood/priyanka-chopra-looks-stunning-unwinds-pool-nick-jonas-reaction-7894470/", "urlToImage": "https://images.indianexpress.com/2022/04/priyanka-chopra-1200-1.jpg", "publishedAt": "2022-04-30T03:49:16Z", "content": "Priyanka Chopra is loving her time in her swimming pool, and so is her husband Nick Jonas. PC took to Instagram to share two photos of herself soaking in the sun in an infinity pool in her home in Lo… [+1819 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Fitness alert: Count on these yoga poses to help fix your posture", "description": "“We can’t always control our environment but we can at least start taking care of our posture,\" said yoga expert Srishti Kaushik in an Instagram post.", "url": "https://indianexpress.com/article/lifestyle/fitness/fitness-alert-yoga-poses-to-help-fix-your-posture-7797771/", "urlToImage": "https://images.indianexpress.com/2022/03/fitness-1200.jpg", "publishedAt": "2022-04-30T03:40:40Z", "content": "Amidst the hustle and bustle of everyday life, regular physical activity can sometimes take a back seat. Physical inactivity combined with concerns such as an unhealthy diet, irregular meal times,lac… [+2037 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "UK lawmaker from Boris Johnson’s party suspended over porn in parliament case", "description": "Neil Parish, a Conservative member of parliament since 2010, was suspended from the parliamentary party after reporting himself to a standards commissioner.", "url": "https://indianexpress.com/article/world/uk-porn-parliament-case-7894472/", "urlToImage": "https://images.indianexpress.com/2022/04/parish-1200.jpg", "publishedAt": "2022-04-30T03:38:31Z", "content": "British Prime Minister Boris Johnson’s Conservative Party has suspended a lawmaker as it looks into reports that a member of the party watched pornography on his phone in the House of Commons debatin… [+1713 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "‘সন্ত্রাসে মদত বন্ধ করুক পাকিস্তান’, ইসলামাবাদকে কড়া বার্তা নারাভানের", "description": "কয়েক সপ্তাহ আগেই পাকিস্তানের সেনাপ্রধান জেনারেল কামার জাভেদ বাজওয়া জানিয়েছিলেন, কূটনৈতিক পথ ও আলোচনার মাধ্যমেই ভারতের সঙ্গে কাশ্মীর সমস্যার সমাধান করা উচিত।", "url": "https://bengali.indianexpress.com/general-news/keen-on-good-ties-with-pak-but-it-must-end-terror-bids-to-draw-global-attention-to-jk-says-general-naravane-437707/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/04/MM-Naravane.jpg", "publishedAt": "2022-04-30T03:37:12Z", "content": ", “ , () ”\r\n , \r\n - , \r\n , “ , , ”\r\n - , ” , ”\r\nRead full story in English\r\nStay updated with the latest news headlines and all the latest General news download Indian Express Bengali App.\r\nWeb Title… [+108 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rahel Philipose", "title": "Mumbai-based influencer steps up to make fitness sessions accessible from home", "description": "During the lockdown, while balancing a full-time job, Krystal enrolled for a certification course on nutrition and has since been able to build a tight-knit fitness community through group workout classes and one-on-one coaching.", "url": "https://indianexpress.com/article/meta-stories-of-strength-2022/mumbai-based-influencer-steps-up-to-make-fitness-sessions-accessible-from-home-7829215/", "urlToImage": "https://images.indianexpress.com/2022/03/krystal-1200-sos.jpg", "publishedAt": "2022-04-30T03:34:01Z", "content": "VASCO: It was during the early months of the pandemic-induced lockdown that Mumbai-based Krystal Dsouza decided to take the plunge and document her fitness journey. Her goal was simple tracking her p… [+2626 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sandeep Dwivedi", "title": "Umran Malik & Zaman Khan: Two pacers defining the speed rush on either side of India – Pakistan border", "description": "Malik, 22, touches 150 kph everytime he takes the field this IPL. He has electrified the rather low-key season, bumped up the TRPs and given India the outline of a pace muscle they always wanted.", "url": "https://indianexpress.com/article/sports/cricket/weekly-sports-newsletter-umran-malik-zaman-khan-two-pacers-defining-the-speed-rush-on-either-side-of-india-pakistan-border-7894404/", "urlToImage": "https://images.indianexpress.com/2022/04/Umran-Zaman.jpg", "publishedAt": "2022-04-30T03:31:55Z", "content": "One of which goes like this.\r\nFar away from the country’s cricketing hub, a young boy develops a junoon for fast bowling. His family, uninitiated to the world of cricketing riches, discourages him. T… [+6411 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Delhi News Live: Power minister says shortage of coal at Delhi plants, will last only a day", "description": "Delhi power crisis, coal shortage Today, Delhi Power Cut, Delhi heatwave Weather Forecast, Delhi Coronavirus Update, Delhi Crime News Updates, Petrol, CNG, PNG price in Delhi.", "url": "https://indianexpress.com/article/cities/delhi/delhi-news-live-power-cut-coal-covid-cases-weather-heatwave-news-traffic-updates-7894449/", "urlToImage": "https://images.indianexpress.com/2022/04/power-plant.jpg", "publishedAt": "2022-04-30T03:22:44Z", "content": "Days after two labourers died while four others sustained injuries after a three-storey house under renovation collapsed on them in South Delhis Satya Niketan, police arrested the contractor from Bih… [+1018 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Coronavirus News Live Updates: Delhi govt gives Rs 1 crore to family of sanitation worker who died of Covid; China to permit ‘some’ Indian students to return", "description": "Coronavirus Cases Live Updates: Mumbai, in the meantime, on Friday reported 93 Covid-19 cases, taking the tally to 10,59,728, while the death toll remained unchanged at 19,562, a civic official said.", "url": "https://indianexpress.com/article/india/coronavirus-news-updates-live-covid-19-count-deaths-delhi-mumbai-bangalore-cases-restrictions-7894445/", "urlToImage": "https://images.indianexpress.com/2022/04/COVID-14.jpg", "publishedAt": "2022-04-30T03:11:34Z", "content": "In other news, at least 63 per cent parents say schools should make online classes available if district COVID-19 positivity rate crosses 5 per cent so that learning is not disrupted for impacted stu… [+1189 chars]"}]}