{"status": "ok", "totalResults": 520, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Serivce", "title": "Mesut Ozil on India: ‘What is happening to human rights in the so-called largest democracy in the world?’", "description": "The former Real Madrid midfielder is the captain of Turkish Super Lig club Fenerbahce.", "url": "https://indianexpress.com/article/sports/football/mesut-ozil-on-india-what-is-happening-to-human-rights-in-the-so-called-largest-democracy-in-the-world-7890981/", "urlToImage": "https://images.indianexpress.com/2020/04/mesut-ozil-fb.jpg", "publishedAt": "2022-04-28T04:44:23Z", "content": "The outspoken German football World Cupper Mesut Ozil has questioned India’s human rights record.On Wednesday, the 33-year-old footballer, who has been Arsenal’s highest-ever paid footballer, took to… [+2278 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Black Panther Wakanda Forever’s CinemaCon footage reveals how MCU movie will work without Chadwick Boseman", "description": "Black Panther: Wakanda Forever's CinemaCon footage showed Shuri (Letitia Wright), Nakia ( Lupita Nyong'o') and Okoye (Danai Gurira) leading the forces of Wakanda against an unknown enemy.", "url": "https://indianexpress.com/article/entertainment/hollywood/black-panther-wakanda-forever-cinemacon-footage-mcu-movie-chadwick-boseman-7890935/", "urlToImage": "https://images.indianexpress.com/2022/04/black-panther-wakanda-forever-1200.jpg", "publishedAt": "2022-04-28T04:43:53Z", "content": "First footage from the upcoming MCU movie Black Panther: Wakanda Forever was screened at CinemaCon. The film, which brings back the original’s director Ryan Coogler and also his co-writer Joe Robert … [+2699 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Karnataka Bengaluru News Live Updates: CM Bommai says Covid-19 situation in state under control", "description": "Bengaluru, Karnataka News Updates: When asked if there will be further cuts on fuel taxes, Karnataka CM Basavaraj Bommai said, \"We must see our economy also. Based on that, we will decide.\"", "url": "https://indianexpress.com/article/cities/bangalore/karnataka-bengaluru-news-live-updates-covid-19-weather-basavaraj-bommai-7890950/", "urlToImage": "https://images.indianexpress.com/2022/04/Basavaraj-Bommai-5.jpg", "publishedAt": "2022-04-28T04:38:56Z", "content": "The bicycle counter was built by an 18-year-old avid cyclist, Nihar Thakkar, and was installed on Tuesday next to the Outer Ring Road cycle lane in Doddanekundi. (Express Photo)\r\nBengaluru has got In… [+855 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "KGF Chapter 2 Box office: Yash film’s Hindi version to overtake Dangal, continues to sprint towards Rs 1000 crore club globally", "description": "KGF Chapter 2 Box Office: The Hindi version of the Yash starrer is all set to beat Aamir Khan's Dangal record in India. Its Hindi version will emerge as the second highest earner ever.", "url": "https://indianexpress.com/article/entertainment/regional/kgf-chapter-2-box-office-yash-film-breaks-records-1000-crore-7890919/", "urlToImage": "https://images.indianexpress.com/2022/04/yash-1-1.jpg", "publishedAt": "2022-04-28T04:37:56Z", "content": "KGF: Chapter 2 continues to dominate the box office, even two weeks after its release on April 14. The film is inching closer to crossing Rs 1000 crore globally. On Tuesday, the film earned over 19 c… [+1777 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "From Hindustan Unilever to Adani Enterprises: Here are top stocks to watch on April 28", "description": "Stocks to watch: From HDFC Asset Management Company to Indian Hotels Company, here are the key stocks to look out for on Thursday's trade.", "url": "https://indianexpress.com/article/business/market/stocks-to-watch-april-28-hindustan-unilever-hul-hdfc-amc-bajaj-auto-kpit-technologies-adani-enterprises-7890914/", "urlToImage": "https://images.indianexpress.com/2022/03/stocks-pixabay-1200.jpg", "publishedAt": "2022-04-28T04:32:57Z", "content": "Stocks to watch today: The benchmark equity market indices Sensex and Nifty ended nearly 1 per cent lower on Wednesday. The S&amp;P BSE Sensex fell 537.22 points (0.94 per cent) to end at 56,819.39 w… [+4243 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Try this ‘miracle tea’ to keep summer headache, bloating, uneasiness, abdominal pain and heaviness at bay", "description": "\"Works wonderfully for people suffering from migraine, high cholesterol, diabetes, thyroid, acidity, gastric trouble, hormone imbalances, constipation,\" said Ayurvedic expert Dr Dixa Bhavsar on Instagram.", "url": "https://indianexpress.com/article/lifestyle/health/miracle-tea-summer-season-headache-bloating-uneasiness-abdominal-pain-heaviness-hydration-7880412/", "urlToImage": "https://images.indianexpress.com/2022/04/mint-tea-1200.jpg", "publishedAt": "2022-04-28T04:30:38Z", "content": "Summer is upon us, in all its glory (read: sweltering heat)! It goes without saying that keeping yourself hydrated, at all times, is an absolute must to prevent issues such as bloating, nausea, heada… [+1788 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PARIMAL DABHI", "title": "Articulate, Left, self-made Cong asset: BJP may deny but can’t ignore Jignesh Mevani", "description": "A vocal critic of the BJP and its ideological fountainhead RSS not only in Gujarat but also other states, Mevani, 42, had come into the spotlight following an agitation he led on the public flogging of Dalits in Una, Gujarat, in 2016.", "url": "https://indianexpress.com/article/india/political-pulse/congress-bjp-jignesh-mevani-gujarat-7890944/", "urlToImage": "https://images.indianexpress.com/2022/04/Jignesh-Mevani-1200.jpeg", "publishedAt": "2022-04-28T04:30:35Z", "content": "In 2017, when three youths emerged on the political scene of Gujarat as leaders, having led successful agitations, the BJP appeared shaken, given that Assembly elections were scheduled that year’s en… [+7623 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "UK: More links between common virus, hepatitis in children", "description": "The usual viruses that cause infectious liver inflammation -- hepatitis A to E -- weren't detected in any of the 111 cases being investigated in the UK", "url": "https://indianexpress.com/article/parenting/health-fitness/uk-between-common-virus-hepatitis-children-7887892/", "urlToImage": "https://images.indianexpress.com/2021/07/GettyImages-world-hepatitis-day-1200.jpg", "publishedAt": "2022-04-28T04:30:25Z", "content": "British health officials investigating the cause of a spike in acute hepatitis, or liver inflammation, among children said there is increasing evidence that it is linked to a common virus.The UK Heal… [+2381 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "IP protection: India among most challenging economies, says USTR", "description": "In its 2022 Special 301 Report, the USTR designated seven countries in the Priority Watch List. These are Argentina, Chile, China, India, Indonesia, Russia and Venezuela.", "url": "https://indianexpress.com/article/india/ip-protection-india-among-most-challenging-economies-says-ustr-7890940/", "urlToImage": "https://images.indianexpress.com/2022/04/Trade-1200.jpeg", "publishedAt": "2022-04-28T04:30:23Z", "content": "India remains one of the most challenging major economies with respect to protection and enforcement of intellectual property, the office of the US Trade Representative said in a report as it decided… [+2093 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "USCIRF report on religious freedom work of ‘Hinduphobic’ people, alleges Hindu body", "description": "HinduPACT, an initiative of the World Hindu Council of America, in a statement alleged that the USCIRF has been taken over by \"Indophobic and Hinduphobic members\".", "url": "https://indianexpress.com/article/world/uscirf-report-on-religious-freedom-work-of-hinduphobic-people-alleges-hindu-body-7890932/", "urlToImage": "https://images.indianexpress.com/2022/04/indians.jpg", "publishedAt": "2022-04-28T04:28:56Z", "content": "A Hindu body here called the USCIRF report on religious freedom a work of “Hinduphobic” commission members while Muslim and Christian groups hailed the observations made in it, demanding that the US … [+3442 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "YouTube Shorts could get ads soon", "description": "What form the ads on Shorts videos will take remains to be seen.", "url": "https://indianexpress.com/article/technology/social/youtube-shorts-could-get-ads-soon/", "urlToImage": "https://images.indianexpress.com/2022/04/YouTube-Shorts-1.jpg", "publishedAt": "2022-04-28T04:25:47Z", "content": "Introduced about two years ago during the mass rise in popularity of short-format videos, Shorts was meant as a way for YouTube to compete with TikTok and Instagrams Reels. However, not being able to… [+1373 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Twitter needs to be politically neutral to regain public trust, says Elon Musk", "description": "Twitter owner Elon Musk has said that the platform \"needs to be politically neutral’ in order to regain ‘public trust’ and effectively this means “upsetting the far right and the far left equally.”", "url": "https://indianexpress.com/article/technology/social/twitter-elon-musk-comments-tweets-politics-neutral-vijaya-gadde-memes-7890924/", "urlToImage": "https://images.indianexpress.com/2022/04/ElonMusk_Reuters_1_NEW-2.jpg", "publishedAt": "2022-04-28T04:25:39Z", "content": "Newly minted Twitter owner Elon Musk has said that the platform “needs to be politically neutral in order to regain public trust and effectively this means upsetting the far right and the far left eq… [+4522 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Offset requirements in India major hurdle in defence trade: Ex-Pentagon official", "description": "Major American companies like Boeing, Lockheed Martin and General Atomics are eyeing the Indian market now, which is projected to grow exponentially over the next one decade.", "url": "https://indianexpress.com/article/world/offset-requirements-in-india-major-hurdle-in-defence-trade-ex-pentagon-official-7890943/", "urlToImage": "https://images.indianexpress.com/2022/04/india-us.jpg", "publishedAt": "2022-04-28T04:19:41Z", "content": "Offset requirements in India pose a major challenge to the defence trade with the US, a former top Pentagon official told lawmakers.“India has enormous opportunities but also enormous challenges. We … [+2831 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Thai Airways flight lands with deflated tyre at Bengaluru airport, passengers escape unhurt", "description": "After this incident, the scheduled departure of the flight from Bengaluru to Bangkok on Wednesday morning could not take place and flyers boarded the flight early on Thursday.", "url": "https://indianexpress.com/article/cities/bangalore/thai-airways-flight-deflated-tyre-bengaluru-airport-7890938/", "urlToImage": "https://images.indianexpress.com/2022/04/thai-airways-1200.jpg", "publishedAt": "2022-04-28T04:18:33Z", "content": "A Thai Airways flight landed at Kempegowda International Airport on Tuesday night with a deflated tyre, Bangalore International Airport Limited (BIAL) sources revealed, adding that all passengers and… [+657 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Work to remove vilayati kikar to start at Central Ridge", "description": "Last year, the Delhi Cabinet approved a project to restore the biodiversity of 423 hectares of the Central Ridge. But the project had not taken off since members of the committee were at odds over how the vilayati kikar is to be removed.", "url": "https://indianexpress.com/article/cities/delhi/vilayati-kikar-central-ridge-7890921/", "urlToImage": "https://images.indianexpress.com/2022/04/explained_759.jpg", "publishedAt": "2022-04-28T04:06:01Z", "content": "Work is set to begin on 10 hectares of land in the Central Ridge to remove vilayati kikar, an invasive species, and restore the natural biodiversity of the region in a pilot project, according to Env… [+1501 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Officers deny seeing injuries on Amber Heard after fight with Johnny Depp", "description": "Officer Tyler Hadden, one of the officers who responded to the couple’s penthouse apartment on May 21, 2016, said Amber Heard refused to talk to officers and had no signs of an injury, although he acknowledged she’d been crying and was red-faced.", "url": "https://indianexpress.com/article/entertainment/hollywood/officers-no-injuries-on-amber-heard-after-fight-with-johnny-depp-7890868/", "urlToImage": "https://images.indianexpress.com/2022/04/Amber-Heard-ap-1200by667.jpeg", "publishedAt": "2022-04-28T04:04:53Z", "content": "May 27, 2016, was the day that Johnny Depp and Amber Heards marriage went from private misery to public, career-killing spectacle. Heard, who had just filed for divorce, arrived at a Los Angeles cour… [+3106 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Will form committee to examine grievances of nurses’ union: AIIMS tells HC", "description": "The court said the submission to be made by the union will also include the undertaking that the functioning of the institute and the patient services shall not be disrupted in any manner.", "url": "https://indianexpress.com/article/cities/delhi/will-form-committee-to-examine-grievances-of-nurses-union-aiims-tells-hc-7890925/", "urlToImage": "https://images.indianexpress.com/2022/04/AIIMS-5.jpg", "publishedAt": "2022-04-28T04:04:43Z", "content": "The AIIMS administration Wednesday told the Delhi High Court that a committee will be constituted to examine the grievances of members of its nurses union, who had gone on strike on Tuesday morning. … [+2157 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "NASA sees ‘otherworldly’ wreckage on Mars with Ingenuity helicopter", "description": "The object resembles a flying saucer that crashed on Mars.", "url": "https://indianexpress.com/article/technology/science/nasa-sees-otherworldly-wreckage-on-mars-with-ingenuity-helicopter-7890913/", "urlToImage": "https://images.indianexpress.com/2022/04/Mars-Ingenuity-Helicopter.jpg", "publishedAt": "2022-04-28T04:01:03Z", "content": "Written by Kenneth Chang\r\nThe object resembles a flying saucer that crashed on Mars.\r\nAnd indeed it is.\r\nBut it doesnt belong to aliens.\r\nInstead, the wreckage is the work of NASA, a component called… [+3661 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Johnson T A", "title": "PSI scam: Role of Karnataka police recruitment cell comes under scrutiny", "description": "On Wednesday, in a move seen as being linked to the police sub-inspectors recruitment scam, the additional director general of police (ADGP) for the recruitment cell and chairman of the PSI recruitment committee Amrit Paul was transferred out of the cell by t…", "url": "https://indianexpress.com/article/cities/bangalore/psi-scam-role-of-karnataka-police-recruitment-cell-comes-under-scrutiny-7890905/", "urlToImage": "https://images.indianexpress.com/2022/04/Karnataka-cop.jpeg", "publishedAt": "2022-04-28T03:52:58Z", "content": "The role of a recruitment cell of the Karnataka police, headed by a senior official, is under scrutiny in a scam that has surfaced in the conduct of examinations for the hiring of 545 police sub-insp… [+4491 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "James Cameron screens stunning Avatar 2 footage at CinemaCon, movie gets official title", "description": "Footage from James Cameron's upcoming science-fiction film Avatar 2 was screened at CinemaCon, and wowed the audience. The film is set to be released on December 16, 2022.", "url": "https://indianexpress.com/article/entertainment/hollywood/james-cameron-screens-stunning-avatar-way-of-water-footage-cinemacon-official-title-7890876/", "urlToImage": "https://images.indianexpress.com/2022/04/avatar-2-1200.jpg", "publishedAt": "2022-04-28T03:51:59Z", "content": "The title of the much-awaited sequel to James Cameron’s Avatar has been revealed at CinemaCon. The film is called Avatar: The Way of Water. Footage from the science-fiction film was also screened at … [+2258 chars]"}]}