{"status": "ok", "totalResults": 595, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "JD Majethia hints at another season of Sarabhai vs Sarabhai: ‘We have to fulfill fans’ wishes’", "description": "Sarabhai vs Sarabhai starred Satish Shah, Ratna Pathak Shah, Rajesh Kumar, Sumeet Raghavan and Rupali Ganguly. Rupali currently stars in the popular Star Plus show Anupamaa.", "url": "https://indianexpress.com/article/entertainment/television/sarabhai-vs-sarabhai-season-3-in-the-works-7899737/", "urlToImage": "https://images.indianexpress.com/2020/05/sarabhai-vs-sarabhai-best-episodes-1200.jpg", "publishedAt": "2022-05-03T12:41:08Z", "content": "Popular television show Sarabhai vs Sarabhai might be getting a third season, hinted producer JD Majethia in a recent interview. The cult sitcom first aired in 2004 and has since become one of the mo… [+1026 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pune: Man arrested with Mephedrone worth Rs 11 lakh", "description": "The Maharashtra ATS arrested the 43-year-old man and seized 118 gram Mephedrone from him. It launched a search for three other accomplices of the arrested suspect who is from Mumbai", "url": "https://indianexpress.com/article/cities/pune/pune-man-arrested-mephedrone-7899738/", "urlToImage": "https://images.indianexpress.com/2022/05/arrest-7-14.jpg", "publishedAt": "2022-05-03T12:39:40Z", "content": "The Maharashtra Anti Terrorism Squad (ATS) has arrested a 43-year-old man from a road near the Pune railway station and seized from him 118 gram Mephedrone worth over Rs 11 lakh in the illegal market… [+98 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aishwarya Mohanty", "title": "Rejig of Odisha ministry, BJD on cards as Patnaik eyes 2024 polls", "description": "While the BJD exudes confidence about repeating its feat in the next parliamentary and Assembly elections, the principal Opposition BJP plans to target the Patnaik government over “non-implementation” of its 2019 poll promises.", "url": "https://indianexpress.com/article/cities/bhubaneswar/rejig-of-odisha-ministry-bjd-on-cards-as-patnaik-eyes-2024-polls-7899725/", "urlToImage": "https://images.indianexpress.com/2022/03/PATNAIK-1-1.jpg", "publishedAt": "2022-05-03T12:28:55Z", "content": "The elections to the Lok Sabha and the Odisha Assembly might be two years away, but the ruling BJD has already launched preparations to reactivate and rejuvenate the party organisation in an unremitt… [+4984 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manoj C G", "title": "Where’s Rahul? BJP asks a familiar question, Congress fears a familiar reply — from an evening in Kathmandu", "description": "Many of his colleagues int he Congress party have long been worried about the image of Rahul Gandhi as the “reluctant and absentee” leader disinterested in humdrum political work.", "url": "https://indianexpress.com/article/india/political-pulse/rahul-gandhi-nepal-congress-bjp-7899686/", "urlToImage": "https://images.indianexpress.com/2022/05/rahul-gandhi3.jpg", "publishedAt": "2022-05-03T12:28:47Z", "content": "As the Congress prepares for its three-day chintan shivir in Udaipur beginning May 13, the video, purportedly from the wedding of Rahuls friend, has forced the party to scramble for damage control.\r\n… [+6036 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "What’s on Chandigarh: An art exhibition on works by students, professionals", "description": "On display are paintings, sculptures, installations, videos, photographs, and graphics, with the artists experimenting with mediums, materials, forms, and bringing to people the many dimensions of our life.", "url": "https://indianexpress.com/article/cities/chandigarh/whats-on-chandigarh-an-art-exhibition-on-works-by-students-professionals-7899710/", "urlToImage": "https://images.indianexpress.com/2022/05/Suyash-Choyal-Title-Energy.jpg", "publishedAt": "2022-05-03T12:21:47Z", "content": "WHAT: Chandigarh Lalit Kala Akademi’s (CLKA) Annual Art Exhibition showcases works of both students and professional artists in various disciplines, selected by an eminent jury. On display as a part … [+940 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "MP Board Class 10, 12 Compartment schedule released; registration begins tomorrow", "description": "The exam form for compartment exams will be released on May 4. Candidates will have to pay an examination fee of Rs 359 for each subject for which they want to appear.", "url": "https://indianexpress.com/article/education/mp-board-class-10-12-compartment-schedule-released-7899704/", "urlToImage": "https://images.indianexpress.com/2022/03/GUJ-BOARD.jpg", "publishedAt": "2022-05-03T12:14:42Z", "content": "The Madhya Pradesh Board of Secondary Education (MPBSE) has released the class 10 and 12 compartment exam schedule. As per the date sheet, the compartment exam for class 12 will begin for June 20 whi… [+1097 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "Former refugee finds woman who gave her $100 on a plane 23 years ago", "description": "Ayda Zugay's search came to end when #FindTracy became viral on social media.", "url": "https://indianexpress.com/article/trending/trending-globally/former-refugee-finds-woman-who-gave-her-100-on-a-plane-23-years-ago-7899644/", "urlToImage": "https://images.indianexpress.com/2022/05/refugee-letter-found.jpeg", "publishedAt": "2022-05-03T12:14:04Z", "content": "Ayda Zugay, a former Yugoslavian refugee living in the US, has been searching for her saviour who left her a letter with a $100 and dangly earrings as she fled from her war-torn country in 1999 on a … [+3257 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Partha Sarathi Biswas", "title": "Pune: At MahaFPC, QR codes on mangoes are helping buyers check even the tree from which a fruit was picked", "description": "Rahul Godse of MahaFPC said the feature was added to bring transparency in the system.", "url": "https://indianexpress.com/article/cities/pune/pune-mahafpc-mangoes-qr-codes-check-tree-from-which-fruit-was-picked-7899700/", "urlToImage": "https://images.indianexpress.com/2022/05/mango-pune-2.jpg", "publishedAt": "2022-05-03T12:12:54Z", "content": "A software engineer by training, 30-year-old Swapnil Gadis stall in the ongoing Mango Festival organised by the MahaFPC, a consortium of Maharashtra farmer producer companies, at Marketyard in Pune h… [+2571 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "NASA scientists crack 60-year solar flare mystery", "description": "Fully understanding this phenomenon can give new insights into nuclear fusion and will also help provide better predictions for solar particle storms that can affect technology here on Earth.", "url": "https://indianexpress.com/article/technology/science/nasa-mms-scientists-crack-60-year-solar-flare-mystery-7899628/", "urlToImage": "https://images.indianexpress.com/2022/05/Fast-magnetic-explosion-NASA-solar-flares.jpg", "publishedAt": "2022-05-03T12:12:48Z", "content": "In the span of a few minutes, a solar flare can release enough energy to power the whole world for over 20,00 years. These flares are triggered by a process called magnetic reconnection, a phenomenon… [+1766 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Real Madrid hoping for another magical Champions League night", "description": "Madrid lost 4-3 in the first leg in England, when it trailed by two goals three different times.", "url": "https://indianexpress.com/article/sports/football/real-madrid-hoping-for-another-magical-champions-league-night-7899702/", "urlToImage": "https://images.indianexpress.com/2022/04/Karim-Benzema-2.jpg", "publishedAt": "2022-05-03T12:11:11Z", "content": "Real Madrid is hoping to produce one last magical Champions League night at the Santiago Bernabéu this season.After coming from behind at home to get by Paris Saint-Germain in the last 16 and defendi… [+2949 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Khatron Ke Khiladi 12: Bigg Boss 14 winner Rubina Dilaik confirmed as first contestant", "description": "Khatron Ke Khiladi is based on the format of the American series Fear Factor. It first premiered on Sony TV, and was later relaunched on Colors channel.", "url": "https://indianexpress.com/article/entertainment/television/khatron-ke-khiladi-12-bigg-boss-14-winner-rubina-dilaik-confirmed-as-first-contestant-7899692/", "urlToImage": "https://images.indianexpress.com/2022/05/rubina1200.jpg", "publishedAt": "2022-05-03T12:09:30Z", "content": "TV star and Bigg Boss 14 winner Rubina Dilaik has been confirmed as the first contestant of Colors reality show Khatron Ke Khiladi Season 12.The actor said she is excited to be a part of this new jou… [+783 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "PSY says hidden theme of That That is ‘Farewell to Gangnam Style’, explains the slap from BTS’ Suga", "description": "PSY discussed the long gap in recordings, whether he’s still pressured by the global success of “Gangnam Style,” and what he envisions for himself and the Korean pop industry.", "url": "https://indianexpress.com/article/entertainment/music/psy-says-hidden-theme-gangnam-style-suga-bts-7899639/", "urlToImage": "https://images.indianexpress.com/2022/04/psy-suga-bts-1200.jpg", "publishedAt": "2022-05-03T12:07:58Z", "content": "The hidden theme of this music video is Farewell to Gangnam Style”. So, a guy in a blue tuxedo comes out and gets a slap from Suga and goes on his way. There is a hidden theme in the song of me and S… [+2163 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "A. Kameshwari", "title": "Reading Mirzapur 3 and Yeh Kaali Kaali Ankhein 2 scripts, they are better than previous seasons: Shweta Tripathi Sharma", "description": "From voicing Barbara Gordon in Spotify's Batman Ek Chakravyuh to featuring in Kunal Kemmu's out-an-out comedy Kanjoos Makkhichoos, Shweta Tripathi Sharma has her kitty full.", "url": "https://indianexpress.com/article/entertainment/bollywood/shweta-tripathi-sharma-on-husband-chaitnya-sharma-mirzapur-3-yeh-kaali-kaali-ankhein-2-escaype-live-7899124/", "urlToImage": "https://images.indianexpress.com/2022/05/Shweta-1200-1.jpg", "publishedAt": "2022-05-03T12:03:30Z", "content": "Shweta Tripathi Sharma says she was super excited when she received the offer to voice Barbara Gordon in Spotify’s psychological thriller Batman Ek Chakravyuh. “I was looking for the script on my mai… [+3646 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "IPL 2022: Players should be allowed to review wide, high no-balls – Daneil Vettori, Imran Tahir", "description": "Defending 18 runs from the last two overs, Royals skipper Sanju Samson was visibly upset by umpire Nitin Pandit's three wide calls despite considerable movement from the batters -- Rinku Singh and Nitish Rana -- on a couple of occasions in the penultimate ove…", "url": "https://indianexpress.com/article/sports/ipl/ipl-2022-players-should-be-allowed-to-review-wide-high-no-balls-daneil-vettori-imran-tahir-7899677/", "urlToImage": "https://images.indianexpress.com/2022/05/Vettori-and-Tahir.jpg", "publishedAt": "2022-05-03T12:00:27Z", "content": "Former New Zealand captain Daniel Vettori and South African spinner Imran Tahir reckon that wides and height no-balls should also come under the DRS scanner as umpires’ call sparked fresh debate duri… [+2900 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Sustainability at Met Gala: Shawn Mendes, Chloë Grace Moretz lead red carpet looks", "description": "From rewearing clothes (including a wedding dress) to new, custom ones made by upcyling older collections, these stars made a statement on sustainable fashion at the Met Gala", "url": "https://indianexpress.com/article/lifestyle/fashion/shawn-mendes-chloe-grace-moretz-sustainable-fashion-met-gala-2022-red-carpet-7899399/", "urlToImage": "https://images.indianexpress.com/2022/05/page-1.jpg", "publishedAt": "2022-05-03T12:00:19Z", "content": "While discussions on sustainability can hardly be had around an event like the Met Gala, what with its monumental scale, this year, some sparks of a sustainable effort at couture and custom fashion w… [+1630 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Explained Desk", "title": "Explained: Why age is three different numbers in South Korea, and what its govt is doing about it", "description": "We explain the different methods for calculating age prevalent in South Korea, why age is particularly significant in South Korean society, and why the need for a change was felt.", "url": "https://indianexpress.com/article/explained/explained-why-age-south-korea-govt-different-methods-why-7899654/", "urlToImage": "https://images.indianexpress.com/2022/05/Korean-kids-1200.jpg", "publishedAt": "2022-05-03T11:54:34Z", "content": "You may or may not believe that ‘age is just a number’, but in South Korea, age is three numbers. The country has three valid ways to determine a person’s age, something the new government, under Pre… [+5973 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rahul V Pisharody", "title": "Telangana minister wants builders to reduce dependency on migrants, promote local labour", "description": "Migration is a choice and the state should be a facilitator, says activist", "url": "https://indianexpress.com/article/cities/hyderabad/telangana-migrants-local-labour-7899533/", "urlToImage": "https://images.indianexpress.com/2021/09/KT-Rama-Rao.jpg", "publishedAt": "2022-05-03T11:51:25Z", "content": "Assuring Telanganas builders and developers plenty of opportunities in the state for the next 10 to 15 years, IT, Industries and Municipal Administration Minister K T Rama Rao recently asked them to … [+3283 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Harsh Varrdhan Kapoor says that buying a Lamborghini is tough while doing arthouse cinema", "description": "Harsh Varrdhan Kapoor shared that he wants to live the luxurious life but it is difficult to afford that while doing 'arthouse films'.", "url": "https://indianexpress.com/article/entertainment/bollywood/harsh-varrdhan-kapoor-says-that-buying-a-lamborghini-is-tough-while-doing-arthouse-cinema-7899634/", "urlToImage": "https://images.indianexpress.com/2022/05/harsh-varrdhan-kapoor-1.jpg", "publishedAt": "2022-05-03T11:50:53Z", "content": "Actor Harsh Varrdhan Kapoor, who will soon be seen in Thar alongside Anil Kapoor, recently said that while the audience might think that his parents, actor Anil Kapoor and Sunita Kapoor, pamper him w… [+1957 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Explained Desk", "title": "Explained: Who are the anchors, the initial investors in an IPO?", "description": "An anchor investor in an IPO is a qualified institutional buyer (QIB) like a foreign portfolio investor or mutual fund or insurance company which invests before the IPO is made available to the public as per Sebi regulations.", "url": "https://indianexpress.com/article/explained/everyday-explainers/lic-ipo-anchor-investor-explained-7899637/", "urlToImage": "https://images.indianexpress.com/2022/05/LIC-IPO-everyday.jpg", "publishedAt": "2022-05-03T11:48:51Z", "content": "Domestic mutual funds invested Rs 4,002.27 crore, accounting for 71.12 per cent of the total anchor book portion of the initial public offering (IPO) of Life Insurance Corporation(LIC). SBI Mutual Fu… [+2455 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "IPL 2022, GT vs PBKS Live Score Updates: Gujarat-Punjab lock horns in Mumbai", "description": "IPL 2022 GT vs PBKS Live Cricket Score Streaming Online Today Match, Star Sports 1 Hindi, Hotstar IPL Live: Gujarat Titans vs Punjab Kings takes place in Mumbai.", "url": "https://indianexpress.com/article/sports/ipl/ipl-2022-gt-vs-pbks-live-score-online-7899573/", "urlToImage": "https://images.indianexpress.com/2022/05/GT-vs-PBKS-Live.jpg", "publishedAt": "2022-05-03T11:46:01Z", "content": "IPL 2022, GT vs PBKS Live Cricket Score Streaming Online Today Match Updates: Here are the two squads\r\nGujarat Titans: Abhinav Manohar, David Miller, Gurkeerat Singh, B Sai Sudharsan, Shubman Gill, H… [+886 chars]"}]}