{"status": "ok", "totalResults": 572, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "OnePlus 10R, Nord CE 2 Lite launch LIVE updates: Event to begin at 7pm", "description": "Check out LIVE updates from today's OnePlus launch event where we will see the new OnePlus 10R 5G, the OnePlus Nord CE 2 Lite and the OnePlus Nord earbuds.", "url": "https://indianexpress.com/article/technology/mobile-tabs/oneplus-10r-oneplus-nord-ce-2-lite-launch-live-updates-price-specs-7891162/", "urlToImage": "https://images.indianexpress.com/2022/04/OnePlus-launch-event-1.jpg", "publishedAt": "2022-04-28T06:46:33Z", "content": "OnePlus is launching three new products in India during its More Power to You launch event. These include two smartphones and a pair of affordable TWS earbuds. The phones are the OnePlus 10R 5G and t… [+1088 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pranav Mukul", "title": "Explained: Why is WhatsApp Pay offering cashbacks and how does it work?", "description": "Now, you can get cashbacks for your first payments made on WhatsApp Pay. How does it work? Why is this a significant step for the company?", "url": "https://indianexpress.com/article/explained/whatsapp-pay-cashback-scheme-explained-7891118/", "urlToImage": "https://images.indianexpress.com/2022/04/whatsapp-1200.jpg", "publishedAt": "2022-04-28T06:44:05Z", "content": "Meta-owned messaging platform WhatsApp, which operates a UPI-based payments service called WhatsApp Pay in India, has decided to take the cashback route in an effort to expand its user base.According… [+2324 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anjali Marar", "title": "New genetic proof links 246 Indian soldiers killed in Punjab’s Ajnala during 1857 uprising to Gangetic plains", "description": "The study, published in the journal Frontiers in Genetics on Thursday, identified the individual remains as belonging to that of soldiers of the 26th Native Bengal Infantry regiment of the British Indian Army. The new evidence has put a lid on all hypotheses …", "url": "https://indianexpress.com/article/india/genetic-proof-indian-soldiers-punjab-ajnala-gangetic-plains-7891150/", "urlToImage": "https://images.indianexpress.com/2022/04/digging-deep.png", "publishedAt": "2022-04-28T06:42:05Z", "content": "Latest DNA-based evidence confirm the human remains found dumped in an abandoned well in the Ajnala town of Punjabs Amritsar belonged to 246 young Indian soldiers who were brutally killed after they … [+6666 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "‘That’s how to battle climate change’: Anand Mahindra appreciates India’s first ‘carbon neutral panchayat’", "description": "The solar panels will provide electricity to 340 houses. The entire cost of the project was Rs 2.75 crore.", "url": "https://indianexpress.com/article/trending/trending-in-india/anand-mahindra-appreciates-indias-first-carbon-neutral-panchayat-7891011/", "urlToImage": "https://images.indianexpress.com/2022/04/Trending-Card-4.jpg", "publishedAt": "2022-04-28T06:33:06Z", "content": "Business tycoon Anand Mahindra who often promotes environmental conservation on Twitter is delighted with Jammu and Kashmirs Palli becoming Indias first carbon neutral panchayat. Thats how to battle … [+2759 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi: Fake arms licence racket busted, four held", "description": "The arrested men allegedly obtained 15 fake arms licences issued from Jammu and Kashmir and procured ordinance arms, said the police.", "url": "https://indianexpress.com/article/cities/delhi/delhi-fake-arms-licence-racket-busted-four-held-7891055/", "urlToImage": "https://images.indianexpress.com/2022/04/weapons-1.jpg", "publishedAt": "2022-04-28T06:31:54Z", "content": "The Delhi Police’s inter-state crime branch has arrested four men, including a gun house owner, for allegedly operating a fake arms licence racket. The arrested men allegedly obtained 15 fake arms li… [+1726 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "I had self-belief in my batting, I’ve been working on it for the last two years: Rashid Khan", "description": "Rahul Tewatia also echoed Rashid's sentiments and said his earlier experience of finishing matches helped him in such situations.", "url": "https://indianexpress.com/article/sports/cricket/i-had-self-belief-in-my-batting-ive-been-working-on-it-for-the-last-two-years-rashid-7891111/", "urlToImage": "https://images.indianexpress.com/2022/04/Untitled-design-39.jpg", "publishedAt": "2022-04-28T06:31:00Z", "content": "Hitting three sixes in four balls, including the match-winning maximum from the final delivery, is a stupendous achievement for any batter but Afghan star Rashid Khan says he has the self-belief to e… [+3543 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Helen Mirren graces cover of People’s ‘Beautiful Issue’", "description": "The magazine on Wednesday revealed the cover of the annual issue, which hits newsstands Friday.", "url": "https://indianexpress.com/article/lifestyle/life-style/helen-mirren-graces-cover-peoples-beautiful-issue-photos-7891004/", "urlToImage": "https://images.indianexpress.com/2022/04/Helen-Mirren_AP.jpg", "publishedAt": "2022-04-28T06:30:15Z", "content": "Helen Mirren graces People magazines The Beautiful Issue in a cover story that touches on her thoughts of beauty and how the Oscar winner still gets nervous before filming a role.The magazine on Wedn… [+1927 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "IVRS facility, telecounselling available to CBSE candidates as board’s counselling facilities enter 25th year", "description": "The other service is free tele-counselling which is available from 9:30 am to 5:30 pm. This service is provided on a voluntary basis by principals and counsellors and there are 92 such people currently offering counselling.", "url": "https://indianexpress.com/article/cities/delhi/cbse-term-2-board-exams-ivrs-facility-telecounselling-7891122/", "urlToImage": "https://images.indianexpress.com/2022/04/school-students.jpg", "publishedAt": "2022-04-28T06:25:38Z", "content": "With the commencement of the Term II board examinations, the Central Board of Secondary Education (CBSE)s psychological counselling facilities for students have also entered their 25th year.The Term … [+1209 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Ajay Devgn vs Kiccha Sudeep on Hindi as national language debate: From Manoj Bajpayee to Ram Gopal Varma, who said what", "description": "Ajay Devgn stirred a debate on Hindi being the 'national language' of India, after he picked an argument with actor Kiccha Sudeep on Twitter. Several people from the world of politics and entertainment have since weighed in.", "url": "https://indianexpress.com/article/entertainment/bollywood/ajay-devgn-vs-kiccha-sudeep-on-hindi-as-national-language-debate-manoj-bajpayee-kumaraswamy-7890986/", "urlToImage": "https://images.indianexpress.com/2022/04/ajay-devgn-kiccha-sudeep.jpg", "publishedAt": "2022-04-28T06:24:43Z", "content": "Ajay Devgn woke up on Wednesday and chose chaos. Unprompted, the actor shot a tweet at fellow actor Kiccha Sudeep, and erroneously declared that Hindi is the national language. Sudeep had recently  c… [+5951 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "WhatsApp Pay is now offering cashback on payments: How to redeem easily", "description": "Here's how to make use of WhatsApp Pay's new cashback offer and earn Rs 11 three times via cashbacks.", "url": "https://indianexpress.com/article/technology/techook/whatsapp-pay-offers-rs-11-cashback-how-to-redeem-easily-7891099/", "urlToImage": "https://images.indianexpress.com/2022/04/WhatsApp-IE-4.jpg", "publishedAt": "2022-04-28T06:24:13Z", "content": "WhatsApp announced its integrated payment platform years ago, but the feature hasnt had the traction enjoyed by other UPI-based services like Google Pay, Paytm and PhonePe. Now, WhatsApp is resorting… [+2812 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Maharashtra police seize 89 swords from vehicle on Mumbai-Agra highway, 4 arrested", "description": "The incident has sparked a political controversy with opposition leaders questioning why an arms-laden vehicle from a Congress-ruled state was making its way to Mumbai.", "url": "https://indianexpress.com/article/cities/mumbai/maharashtra-police-seize-89-swords-from-vehicle-on-mumbai-agra-highway-4-arrested-7891143/", "urlToImage": "https://images.indianexpress.com/2022/04/swords.jpg", "publishedAt": "2022-04-28T06:24:10Z", "content": "The Maharashtra police seized a stockpile of nearly 90 swords from a Scorpio vehicle in Dhule on Thursday morning and arrested four men. The vehicle was intercepted on the Mumbai-Agra highway and was… [+1202 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Need to prepare for intense, small duration operations: IAF chief", "description": "In an address at a seminar, he also said that there would be a need for the force to prepare for \"short swift wars\" and be ready for long-drawn standoff akin to what has been seen in eastern Ladakh.", "url": "https://indianexpress.com/article/india/indian-air-force-small-duration-operations-iaf-chief-vr-chaudhari-7891113/", "urlToImage": "https://images.indianexpress.com/2022/02/VR-Chaudhari.jpg", "publishedAt": "2022-04-28T06:12:18Z", "content": "The current geopolitical situation necessitates the Indian Air Force to prepare for intense and small duration operations at a short notice, Chief of Air Staff Air Chief Marshal VR Chaudhari said on … [+4102 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aranya Shankar", "title": "DU sets up committee to look into shortfall in SC/ST enrolment of students", "description": "Until last year, DU used to conduct its undergraduate admissions through cut-off lists based on Class 12 marks with separate and usually lower cut-offs released for reserved categories.", "url": "https://indianexpress.com/article/cities/delhi/du-sets-up-committee-to-look-into-shortfall-in-sc-st-enrolment-of-students-7891102/", "urlToImage": "https://images.indianexpress.com/2022/04/DU-Delhi-university-2.jpg", "publishedAt": "2022-04-28T06:11:37Z", "content": "Delhi University (DU) vice-chancellor Yogesh Singh has constituted a committee to look into the “shortfall” in enrolment of Scheduled Caste and Scheduled Tribe students in the past years, and come up… [+1767 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anonna Dutt", "title": "Delhi: More camps, extended timings to increase Covid-19 vaccination coverage among children", "description": "The uptake of the second dose in the 12-14 age category has been slower with schools reopening fully for offline classes from the beginning of April.", "url": "https://indianexpress.com/article/cities/delhi/delhi-covid-19-vaccination-coverage-among-children-7891080/", "urlToImage": "https://images.indianexpress.com/2022/03/bangalore-covid-vaccination.jpeg", "publishedAt": "2022-04-28T06:04:06Z", "content": "To increase Covid-19 vaccination coverage among children between the ages of 12 and 14, Delhi districts have been working on increasing the number of camps in schools and vaccination sites that remai… [+2575 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi: Benito Juarez Marg underpass to be opened in May, says Sisodia", "description": "Delhi news: Deputy Chief Minister Manish Sisodia reviewed ongoing road development works on Thursday.", "url": "https://indianexpress.com/article/cities/delhi/delhi-benito-juarez-marg-underpass-to-be-opened-in-may-says-manish-sisodia-7891106/", "urlToImage": "https://images.indianexpress.com/2022/04/construction.jpg", "publishedAt": "2022-04-28T06:03:34Z", "content": "The much-delayed Benito Juarez Marg underpass will be opened to the public from next month, Delhi Deputy Chief Minister Manish Sisodia said after he inspected and reviewed work on the stretch near So… [+2409 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Chlorinated water: Know about the benefits and risks", "description": "\"Chlorination is a purification technique for safe drinking water. It is recommended by Department of Health amidst possible contamination during calamities,\" read a Twitter post by NDMA", "url": "https://indianexpress.com/article/lifestyle/health/drinking-chlorinated-water-home-effects-7878609/", "urlToImage": "https://images.indianexpress.com/2021/06/GettyImages-drinking-water-1200.jpg", "publishedAt": "2022-04-28T06:00:53Z", "content": "The National Disaster Managment Authority (NDMA) recommends consuming boiled or chlorinated water to prevent water-related illnesses. In a Twitter thread, NDMA mentioned that according to the Health … [+2148 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "PM abdicates responsibility: Rahul attacks Modi over fuel price issue", "description": "His remarks came a day after the prime minister flagged the issue of higher fuel prices in many opposition-ruled states, urging them to reduce VAT in \"national interest\" to benefit the common man and work in the spirit of cooperative federalism in this time o…", "url": "https://indianexpress.com/article/india/pm-modi-rahul-gandhi-fuel-prices-abdicates-responsibility-7891086/", "urlToImage": "https://images.indianexpress.com/2022/04/RAGA-1.jpeg", "publishedAt": "2022-04-28T05:59:18Z", "content": "As fuel prices continue to soar across the country, Congress leader Rahul Gandhi accused Prime Minister Narendra Modi of “abdicating responsibility” by ‘blaming’ states for the inflation despite the … [+1324 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Two killed as cars collide on Pune-Solapur highway", "description": "The accident happened near the Kavadi Pat toll plaza on the Pune-Solapur highway in the early hours of Thursday. Three injured people were admitted to a hospital, said the police.", "url": "https://indianexpress.com/article/cities/pune/two-killed-as-cars-collide-on-pune-solapur-highway-7891091/", "urlToImage": "https://images.indianexpress.com/2022/04/accident-1-1-2-2.jpeg", "publishedAt": "2022-04-28T05:53:33Z", "content": "Two people died and three others were injured in an accident involving two cars near the Kavadi Pat toll plaza on the Pune-Solapur highway in the early hours of Thursday, said the police"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sukhbir Siwach", "title": "42% less wheat procurement in Haryana mandis till now", "description": "The sharp decline in purchase comes at a point amid farmers expecting higher price for their produce in the market in the coming months due to Russia-Ukraine war.", "url": "https://indianexpress.com/article/cities/chandigarh/42-less-wheat-procurement-in-haryana-mandis-till-now-7891085/", "urlToImage": "https://images.indianexpress.com/2022/04/wheat-mandi.jpeg", "publishedAt": "2022-04-28T05:51:08Z", "content": "With the ongoing procurement season nearing its end this year, the mandis in Haryana have registered a 42% downfall in wheat procurement when compared to the corresponding period in 2021.The sharp de… [+3395 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "‘The next for him is the Indian team’: Gavaskar after watching Umran Malik’s breathtaking spell", "description": "Sunil Gavaskar also advised the selectors to \"take Umran Malik to England for one-off Test, limited-overs series\" in June", "url": "https://indianexpress.com/article/sports/ipl/srh-vs-gt-umran-malik-the-indian-team-sunil-gavaskar-umran-breathtaking-spell-7891056/", "urlToImage": "https://images.indianexpress.com/2022/04/Untitled-design-16-1.jpg", "publishedAt": "2022-04-28T05:50:31Z", "content": "The legendary Sunil Gavaskar has pitched for young pace sensation Umran Malik’s inclusion in the Indian team for the upcoming England tour following his stunning five-wicket haul against Gujarat Tita… [+3316 chars]"}]}