{"status": "ok", "totalResults": 411, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "Watch: Khaki Studio plays a cover of ‘An Evening in Paris’", "description": "The Khaki Studio played An Evening in Paris, which is the title track of the 1967 Bollywood movie of the same name.", "url": "https://indianexpress.com/article/trending/trending-in-india/khaki-studio-plays-a-cover-of-an-evening-in-paris-7907971/", "urlToImage": "https://images.indianexpress.com/2022/05/kahki-studio.jpg", "publishedAt": "2022-05-09T08:46:46Z", "content": "To dispel Monday blues, Khaki Studio, the Mumbai polices band, shared a melodious instrumental version of the old Bollywood hit song, An Evening in Paris.The full cover of the song was posted on the … [+1482 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pune: Cloth trader receives rags instead of new clothes for order worth Rs 3 lakh", "description": "The police have registered an offence based on the complaint by cloth trader Ayaz Nazeer Momin who runs a business in the Kapadganj area of Raviwar Peth, which is a hub of cloth trade in Pune city.", "url": "https://indianexpress.com/article/cities/pune/pune-cloth-trader-fraud-case-rs-3-lakh-7907969/", "urlToImage": "https://images.indianexpress.com/2022/05/textile.jpg", "publishedAt": "2022-05-09T08:46:30Z", "content": "A cloth trader from the Raviwar Peth area of Pune was allegedly cheated to the tune of Rs 3 lakh as bags full of rags were delivered to him instead of new clothing against an order placed to a suppli… [+730 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Three killed as gas tanker hits three cars, turns on side on Pune-Mumbai Expressway", "description": "Raigad district police said the accident took place around 12 pm near the Khopoli exit of the Pune-Mumbai Expressway, which is located in Raigad district, when the tanker was going from Pune to Mumbai.", "url": "https://indianexpress.com/article/cities/pune/pune-gas-tanker-hits-three-cars-pune-mumbai-expressway-7907976/", "urlToImage": "https://images.indianexpress.com/2022/05/Pune-blast.jpg", "publishedAt": "2022-05-09T08:45:00Z", "content": "Three people were killed and at least two others were injured Monday after a speeding tanker carrying propylene gas hit three cars as it turned on its side after crossing over to the opposite lane on… [+1102 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anjali Marar", "title": "Explained: Cyclone Asani is on the way, but it won’t be another Fani or Amphan. Here’s why", "description": "Systems formed in the Bay of Bengal during May, the peak of summer, are among the strongest ones to form in the North Indian Ocean region.", "url": "https://indianexpress.com/article/explained/explained-cyclone-asani-different-from-fani-amphan-7907960/", "urlToImage": "https://images.indianexpress.com/2022/05/Cyclone-Asani-Explained.jpg", "publishedAt": "2022-05-09T08:42:51Z", "content": "The severe cyclonic storm Asani lay 550 km southeast of Visakhapatnam and 680 km south-southeast of Puri at 5.30 am on Monday (May 9), and was moving towards the Andhra Pradesh-Odisha coast at about … [+3637 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Cyclone Asani: Dos and don’ts to stay safe before, during, and after it", "description": "Odisha has been put on a high alert ahead of the heavy rain forecast on Tuesday and Wednesday. In West Bengal, disaster management teams, police and KMC employees have been asked to stay prepared", "url": "https://indianexpress.com/article/lifestyle/life-style/cyclone-asani-west-bengal-odisha-dos-and-donts-to-stay-safe-before-during-and-after-it-7907592/", "urlToImage": "https://images.indianexpress.com/2022/05/mumbai-rains-3-fb.jpeg", "publishedAt": "2022-05-09T08:40:44Z", "content": "The Indian Meteorological Department (IMD) has said cyclone Asani — developed over southeast regions of Bay of Bengal — will intensify into a severe cyclone by Monday. According to the projected move… [+2373 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "As poor nations seek Covid pills, officials fear repeat of AIDS crisis", "description": "Now, with that history in mind, global health agencies and the Biden administration are working to bring coronavirus tests and expensive antiviral pills to low- and middle-income nations.", "url": "https://indianexpress.com/article/lifestyle/health/covid-pills-aids-crisis-7907964/", "urlToImage": "https://images.indianexpress.com/2022/05/Virus-drug.jpg", "publishedAt": "2022-05-09T08:40:33Z", "content": "A devastating virus was laying waste to nations that lacked medicines available to Americans. The pills were patented and pricey. Poor countries lacked refrigeration to store them, the thinking went,… [+9003 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Jill Biden’s secret Ukraine trip", "description": "Jill Biden met Ukraine’s first lady, Olena Zelenska, at a school converted to assist refugees who had come from other parts of the country to Uzhhorod, a town of 100,000 people a few miles from the border with Slovakia.", "url": "https://indianexpress.com/article/world/jill-bidens-secret-ukraine-trip-7907700/", "urlToImage": "https://images.indianexpress.com/2022/05/JILL-BIDEN-UKRAINE-1.jpg", "publishedAt": "2022-05-09T08:40:18Z", "content": "Jill Biden, the first lady, traveled to western Ukraine in an unannounced trip Sunday, the latest show of support from the United States, which in recent weeks has significantly increased military ai… [+7268 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Bloomberg", "title": "Foreign investors shun LIC IPO over market risks", "description": "With just hours to go until the end of the subscription period for the $2.7 billion initial public offering of Life Insurance Corporation of India, foreign institutional funds have put in orders for merely 8% of the shares set aside for all institutional buye…", "url": "https://indianexpress.com/article/business/market/foreign-investors-shun-lic-ipo-over-market-risks-7907924/", "urlToImage": "https://images.indianexpress.com/2022/05/LIC-IPO-Bloomberg-1200.jpg", "publishedAt": "2022-05-09T08:39:53Z", "content": "Foreign institutional investors have on the whole steered clear of Indias biggest share sale, deeming it too expensive given currency risks and the global market backdrop.With just hours to go until … [+3542 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aksheev Thakur", "title": "Climate change concern for migratory birds, says research", "description": "The continued growth of human footprint on the natural world, which has led to the degradation and loss of natural habitats, and the direct overexploitation of many species are the key threats to avian biodiversity, says research titled ‘State of the World's …", "url": "https://indianexpress.com/article/cities/bangalore/climate-change-concern-for-migratory-birds-says-research-7907966/", "urlToImage": "https://images.indianexpress.com/2022/05/migratory-birds.jpeg", "publishedAt": "2022-05-09T08:38:51Z", "content": "A new research has claimed that climate change is an important emerging driver of change in bird communities and a particular concern for tropical montane, polar, and migratory species.Global bird po… [+4344 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Hanuman Chalisa row: Mumbai police moves court seeking cancellation of bail to Ranas", "description": "The plea claimed that the couple had violated the restriction on speaking to the media about the case and the bail order had clarified that violation of the condition would amount to cancellation of bail.", "url": "https://indianexpress.com/article/cities/mumbai/hanuman-chalisa-row-mumbai-police-moves-court-seeking-cancellation-of-bail-to-ranas-7907944/", "urlToImage": "https://images.indianexpress.com/2022/04/RaviRanaandNavneetRana01-1.jpg", "publishedAt": "2022-05-09T08:35:46Z", "content": "Mumbai police on Monday approached a special court in the city seeking cancellation of the bail granted to MP Navneet Rana and her husband and MLA Ravi Rana who were arrested on charges including sed… [+2174 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Eid under the Taliban shows a changed Afghanistan", "description": "As Afghans endured the constant and random violence of the last two decades of war, many held hopes that when peace finally came to the country, Eid al-Fitr would be its high-water mark, a day when families long separated by fighting would finally be able to …", "url": "https://indianexpress.com/article/world/eid-taliban-afghanistan-7907954/", "urlToImage": "https://images.indianexpress.com/2022/05/AFGHAN-EID-TALIBAN-9.jpg", "publishedAt": "2022-05-09T08:31:57Z", "content": "Thousands of Afghans had piled into buses and set out down the countrys once-perilous highways bound for relatives they had not seen in years. Afghanistans only national park was filled with tourists… [+7203 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Seizing an Oligarch’s assets is one thing. Giving them to Ukraine is another", "description": "Tango is just a sliver of the $1 billion in yachts, planes and artwork — not to mention hundreds of millions in cash — that the United States has identified as belonging to wealthy allies of Russian President Vladimir Putin since the invasion of Ukraine.", "url": "https://indianexpress.com/article/world/seizing-an-oligarchs-assets-is-one-thing-giving-them-to-ukraine-is-another-7907929/", "urlToImage": "https://images.indianexpress.com/2022/05/RUSSIA-ASSETS-SEIZED.jpg", "publishedAt": "2022-05-09T08:28:04Z", "content": "The US government was so pleased with its swift seizure of a Russian oligarchs 255-foot yacht on the Mediterranean island of Majorca last month that it posted a video on YouTube of the moment FBI age… [+9133 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "Nirmala Sitharaman walks up with a bottle as NSDL CEO requests water from staff mid-speech. Watch viral video", "description": "Union finance minister Nirmala Sitharaman's humble gesture has captured hearts online.", "url": "https://indianexpress.com/article/trending/trending-in-india/nirmala-sitharaman-walks-up-with-a-bottle-as-nsdl-ceo-requests-water-mis-speech-viral-video-7907820/", "urlToImage": "https://images.indianexpress.com/2022/05/Trending-Card-4.jpg", "publishedAt": "2022-05-09T08:22:29Z", "content": "Union finance minister Nirmala Sitharaman has won praise online for getting up from her seat and offering a bottle of water to Padmaja Chunduru, the CEO and Managing Director of NSDL, who was presidi… [+2197 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Actor assault case: Crime branch interrogates Dileep’s wife Kavya Madhavan", "description": "A team of crime branch officials reached Madhavan’s residence near Kochi in Kerala after she refused to turn up before them, officers said.", "url": "https://indianexpress.com/article/india/kerala/dileep-actor-assault-case-kavya-madhavan-7907928/", "urlToImage": "https://images.indianexpress.com/2022/01/Dileep.jpg", "publishedAt": "2022-05-09T08:20:10Z", "content": "The crime branch of Kerala Police on Monday began interrogating Malayalam actor Kavya Madhavan in connection with the actor assault case in which Madhavans husband and actor Dileep is one of the accu… [+1731 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Lock Upp winner Munawar Faruqui posts photo with his ‘Bubby’, fans guess she’s his girlfriend", "description": "Kangana Ranaut and Ekta Kapoor partied with the team and contestants of Lock Upp post the show's finale.", "url": "https://indianexpress.com/article/entertainment/web-series/lock-upp-munawar-faruqui-girlfriend-success-party-kangana-ranaut-photos-7907438/", "urlToImage": "https://images.indianexpress.com/2022/05/munawar-faruqui-girlfriend-1200.jpg", "publishedAt": "2022-05-09T08:17:43Z", "content": "Lock Upp winner Munawar Faruqui had promised fans that he would of telling them more about his girlfriend once the Kangana Ranaut-hosted show ends. And going by his words, the stand-up comedian poste… [+2624 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Instagram to allow posting NFTs from Ethereum, Polygon, Solana, Flow: Report", "description": "Users will have to add their crypto wallets such s Metamask, and prove their NFT ownership before showcasing it on the platform.", "url": "https://indianexpress.com/article/technology/crypto/instagram-to-allow-posting-nfts-from-etehreum-polygon-solana-flow-report-7907854/", "urlToImage": "https://images.indianexpress.com/2022/05/Instagram-AP-1-1.jpg", "publishedAt": "2022-05-09T08:14:21Z", "content": "Instagram users will now be able to showcase their blockchain art in the form of non-fungible-tokens (NFTs) on the platform, says a new report by Coindesk. According to the report, Meta-owned Instagr… [+2287 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Kerala: Savarkar’s image in Thrissur Pooram umbrellas withdrawn after protests", "description": "Paramekkavu temple board, one of the organisers of the festival, prepared umbrellas imprinted with images of historic personalities like Mahatma Gandhi, Swami Vivekananda, Bhagat Singh, Chandra Shekhar Azad, Subhas Chandra Bose, Subrahmania Bharati and Mannat…", "url": "https://indianexpress.com/article/cities/thiruvananthapuram/kerala-savarkars-image-in-thrissur-pooram-umbrellas-withdrawn-after-protests-7907920/", "urlToImage": "https://images.indianexpress.com/2022/05/Thrissur.jpg", "publishedAt": "2022-05-09T08:12:11Z", "content": "The image of Hindutva icon V D Savarkar was removed from parasols to be used for the famous kudamattam (exchange of umbrellas) ceremony, one of the major attractions of the Thrissur Pooram festival i… [+1459 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Reliance Industries shares decline 3% after Q4 earnings; fall nearly 10% in 6 days", "description": "The stock has been quoting lower for the past many days and further slumped 3 per cent to Rs 2,542.10, amid a weak trend in the broader market.", "url": "https://indianexpress.com/article/business/market/reliance-industries-shares-decline-3-pc-after-q4-earnings-fall-nearly-10-pc-in-6-days-7907757/", "urlToImage": "https://images.indianexpress.com/2022/05/RELIANCE-INDUSTRIES-RIL-REUTERS-1200.jpeg", "publishedAt": "2022-05-09T08:08:50Z", "content": "Shares of Reliance Industries Ltd declined 3 per cent in early trade on Monday, after the company’s March quarter earnings failed to cheer investors.The stock has been quoting lower for the past many… [+1077 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Bomb-sniffing dog named Patron received state honors from Zelenskyy", "description": "Patron, whose name means “ammo” in Ukrainian, helps sniff out Russian mines and explosives in the northeastern city of Chernihiv and acts as a mascot of the country’s State Emergency Service.", "url": "https://indianexpress.com/article/world/bomb-sniffing-dog-named-patron-received-state-honors-from-zelenskyy-7907414/", "urlToImage": "https://images.indianexpress.com/2022/05/ukraine-dog2.jpg", "publishedAt": "2022-05-09T08:08:18Z", "content": "President Volodymyr Zelenskyy has routinely ended his nightly wartime addresses by announcing state awards for Ukraines soldiers. On Sunday, he honored a fighter who is perhaps the countrys smallest … [+2192 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Putin evokes World War Two triumph to urge victory in Ukraine", "description": "Putin condemned what he called external threats to weaken and split Russia, and repeated familiar arguments he had used to justify its invasion - that NATO was creating threats right next to its borders.", "url": "https://indianexpress.com/article/world/putin-victory-day-world-war-two-speech-ukraine-7907896/", "urlToImage": "https://images.indianexpress.com/2022/05/Russia-Moscow.jpg", "publishedAt": "2022-05-09T08:08:09Z", "content": "Russian President Vladimir Putin evoked the memory of Soviet heroism in World War Two on Monday to urge his army towards victory in Ukraine.Addressing massed ranks of servicemen on Red Square on the … [+1040 chars]"}]}