{"status": "ok", "totalResults": 592, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Sana Farzeen", "title": "Lock Upp: Munawar Faruqui, Payal Rohatgi or Anjali Arora — who will win? Cast your votes", "description": "Post Saisha Shinde's eviction, Lock Upp got its top six in Prince Narula, Shivam Sharma, Munawar Faruqui, Anjali Arora, Payal Rohatgi and Azma Fallah. Host Kangana Ranaut will announce one among them as the winner in Saturday's finale.", "url": "https://indianexpress.com/article/entertainment/web-series/lock-upp-munawar-faruqui-payal-rohatgi-anjali-arora-poll-votes-7904424/", "urlToImage": "https://images.indianexpress.com/2022/05/lock-upp-finale-vote.jpg", "publishedAt": "2022-05-06T12:50:06Z", "content": "Earlier in the day, indianexpress.com reported about Saisha Shinde’s eviction from Lock Upp, which happened just two days before the finale. While Shivam Sharma and Prince Narula have already been de… [+2218 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Tamil Nadu: Student in Class X for two straight years despite pandemic all-pass", "description": "The matter came to light a few days ago when the government school near Gudiyatham in Vellore district issued hall tickets for Class X students for their board examinations starting on Friday.", "url": "https://indianexpress.com/article/cities/chennai/tamil-nadu-student-in-class-x-for-two-straight-years-despite-pandemic-all-pass-7904486/", "urlToImage": "https://images.indianexpress.com/2021/08/parenting_schools_reopening_1200-6.jpg", "publishedAt": "2022-05-06T12:38:03Z", "content": "A 16-year-old student in Tamil Nadu who, along with all of his classmates, was declared passed in the Class X board examination in 2021 had been studying in the same class this academic year without … [+1302 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "‘Gentlemen’ Bobby Deol and Abhay Deol meet and greet overjoyed kids after dinner, watch video", "description": "Cousins Abhay Deol and Bobby Deol posed with fans on Thursday night, after getting together for dinner.", "url": "https://indianexpress.com/article/entertainment/bollywood/gentlemen-bobby-deol-and-abhay-deol-meet-and-hug-fans-after-dinner-video-7904465/", "urlToImage": "https://images.indianexpress.com/2022/05/abhay1200.jpg", "publishedAt": "2022-05-06T12:35:04Z", "content": "Actors and cousins Bobby Deol and Abhay Deol met for a fun dinner on Thursday. After they stepped out of the restaurant, they were photographed by the paparazzi. Both of them were wearing blue tees a… [+1433 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Explain steps taken to ensure education of kids who lost parents to Covid: Delhi HC to Centre", "description": "The bench took note of the fact that the Ministry of Women and Child Welfare Development and the Ministry of Education on June 16, 2021, had issued a DO letter to the states to ensure continuity of education of students orphaned by Covid.", "url": "https://indianexpress.com/article/cities/delhi/delhi-hc-centre-covid-orphans-education-7904498/", "urlToImage": "https://images.indianexpress.com/2022/04/Delhi-HC-6-1-5.jpeg", "publishedAt": "2022-05-06T12:34:01Z", "content": "The Delhi High Court has directed the Centre to file an affidavit explaining in detail the steps that have been taken for ensuring continued education of children who lost their parents due to Covid-… [+2116 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shubhangi Khapre, Sadaf Modak", "title": "Sharad Pawar ping pong and politics of Bhima Koregaon violence probe", "description": "In 2018, less that 48 hours after the violence breaking out under the BJP government, Pawar had called it the handiwork of “outsiders”, and said he had learnt from some locals that it could be the work of right-wing leaders.", "url": "https://indianexpress.com/article/india/political-pulse/sharad-pawar-ping-pong-and-politics-of-bhima-koregaon-violence-probe-7904447/", "urlToImage": "https://images.indianexpress.com/2022/05/PAWAR.jpg", "publishedAt": "2022-05-06T12:23:58Z", "content": "In 2018, less that 48 hours after the violence breaking out under the BJP government, Pawar had called it the handiwork of outsiders, and said he had learnt from some locals that it could be the work… [+4112 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Gucci jumps on the crypto bandwagon with US project", "description": "Gucci, owned by France's Kering SA, plans to expand the service to its directly-operated North America stores in the near future", "url": "https://indianexpress.com/article/technology/crypto/gucci-jumps-on-the-crypto-bandwagon-with-us-project-7904476/", "urlToImage": "https://images.indianexpress.com/2021/06/bitcoin-crypto-reuters-1200.jpg", "publishedAt": "2022-05-06T12:18:19Z", "content": "Gucci’s high-end handbags and other luxury products can now be bought using cryptocurrencies, including bitcoin, in some U.S. stores, the Italian company said, as digital currencies move to broader a… [+868 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Punjab: 18 students injured, 30 miss Class 10 board exam as van overturns", "description": "According to the police, the small van meant for transporting goods overturned near Hrini village of Kotkapura constituency in Faridkot district.", "url": "https://indianexpress.com/article/cities/ludhiana/punjab-van-accident-students-injury-board-exam-7904433/", "urlToImage": "https://images.indianexpress.com/2022/05/accident-1-1-2-1.jpg", "publishedAt": "2022-05-06T12:17:36Z", "content": "Eighteen children were injured as an overloaded van carrying 30 students overturned in Punjabs Faridkot district on Friday morning, the police said. The students of Government School Koharwala were h… [+793 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Madhuri Dixit steals the show in Raja Kumari’s ‘Made in India’, built for 2022. Watch", "description": "Raja Kumari's latest song, featuring Madhuri Dixit Nene, is an interpolation of Alisha Chinai's 1995 chartbuster \"Made in India\".", "url": "https://indianexpress.com/article/entertainment/music/madhuri-dixit-steals-the-show-in-raja-kumari-made-in-india-watch-7904442/", "urlToImage": "https://images.indianexpress.com/2022/05/made-in-india-madhuri-1.jpg", "publishedAt": "2022-05-06T12:12:14Z", "content": "Indian-American rapper, songwriter, and singer Raja Kumari released her new song “Made in India” on Friday. Through the song, she seems to be paying tribute to Indian culture and heritage. The song i… [+1633 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tora Agarwala", "title": "Once declared Indian, person cannot be tried for being foreigner again: Gauhati HC", "description": "This is significant because till now there have been several instances of a person being tried for their nationality at the tribunals after being already declared an Indian citizen.", "url": "https://indianexpress.com/article/cities/guwahati/once-declared-indian-person-cannot-be-tried-for-being-foreigner-again-gauhati-hc-7904474/", "urlToImage": "https://images.indianexpress.com/2022/05/gavel-2-3.jpg", "publishedAt": "2022-05-06T12:09:34Z", "content": "The Gauhati High Court has ruled that the principle of res judicata was applicable to Assams Foreigners Tribunals. Res judicata bars reopening of the same issue by the same parties once a ruling has … [+1791 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "PSEB Punjab board Class 5 result declared; here’s how to check", "description": "The Class 5 term 2 exams were held from March 15 to March 23. Students can check their result at the official website - pseb.ac.in", "url": "https://indianexpress.com/article/education/pseb-punjab-board-class-5-result-declared-how-to-check-pseb-ac-in-7904468/", "urlToImage": "https://images.indianexpress.com/2022/05/Webp.net-resizeimage-36-10.41.52-PM.jpg", "publishedAt": "2022-05-06T12:08:00Z", "content": "Punjab School Education Board (PSEB) has announced the class 5 board exam results 2022. The Class 5 term 2 exams were held from March 15 to March 23. Students can check their result at the official w… [+730 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Nobody is tough, everybody is beatable: P V Sindhu", "description": "Sindhu said that even after going to the Olympics it was hard because players were being tested every day.", "url": "https://indianexpress.com/article/sports/badminton/nobody-is-tough-everybody-is-beatable-p-v-sindhu-7904470/", "urlToImage": "https://images.indianexpress.com/2022/04/PV-SIndhu.jpg", "publishedAt": "2022-05-06T12:07:32Z", "content": "Double Olympic medallist P V Sindhu says she can’t pick her toughest opponent in the international circuit as all are of the same standard and one has to be always alert irrespective of the world ran… [+1364 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "‘This is so validating to me’: Cara Delevingne praised for not hiding her psoriasis on the Met Gala red carpet", "description": "\"It’s wonderful how Cara Delevigne used a platform like the Met Gala to raise awareness about this chronic condition,\" a user wrote", "url": "https://indianexpress.com/article/lifestyle/health/cara-delevingne-praised-psoriasis-met-gala-red-carpet-7903731/", "urlToImage": "https://images.indianexpress.com/2022/05/Cara-Delevingne-1200.jpg", "publishedAt": "2022-05-06T11:55:17Z", "content": "Every year, the Met Gala serves us some stunning (and bizarre!) looks that are discussed long after the event is over. One such look from the 2022 Met Gala has been of model-actor Cara Delevingne who… [+2383 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Axis AMC conducting suo moto probe; suspends 2 fund managers", "description": "The statement comes in the wake of complaints reportedly being received by Axis Mutual Fund from stock brokers about fund managers punching in trades on behalf of the fund at values much higher than the market.", "url": "https://indianexpress.com/article/business/companies/axis-amc-conducting-suo-moto-probe-suspends-2-fund-managers-7904425/", "urlToImage": "https://images.indianexpress.com/2021/08/axis-bank-express-archieve-1200.jpg", "publishedAt": "2022-05-06T11:51:51Z", "content": "Facing allegations of front running and a reported regulatory probe, Axis Asset Management on Friday said it has been suo moto investigating the case since February and has suspended two fund manager… [+1212 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Dismiss plea for probe into Gujarat BJP’s Remdesivir drive amid shortage, HC urged", "description": "Advocate-general Kamal Trivedi, representing the state government, says the antiviral injections distributed from the Surat BJP office were from the 40% allocated for the private sector and that the party was just facilitating the distribution.", "url": "https://indianexpress.com/article/cities/ahmedabad/dismiss-plea-for-probe-into-gujarat-bjps-remdesivir-drive-amid-shortage-hc-urged-7904325/", "urlToImage": "https://images.indianexpress.com/2022/05/remdesevir.jpg", "publishedAt": "2022-05-06T11:48:29Z", "content": "Gujarat BJP president CR Paatil has requested the Gujarat High Court to dismiss a public-interest petition seeking an inquiry into the illegal” distribution of Remdesivir by him and the party’s Majur… [+3410 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "IPL 2022, GT vs MI Live Score Updates: Gujarat & Mumbai clash for the first time ever", "description": "IPL 2022 GT vs MI Live Cricket Score Streaming Online Today Match, Star Sports 1 Hindi, Hotstar IPL Live: Gujarat Titans vs Mumbai Indians takes place in Mumbai.", "url": "https://indianexpress.com/article/sports/ipl/ipl-2022-gt-vs-mi-live-score-online-7903888/", "urlToImage": "https://images.indianexpress.com/2022/05/GT-vs-MI.jpg", "publishedAt": "2022-05-06T11:45:53Z", "content": "IPL 2022, GT vs MI Live Cricket Score Streaming Online Today Match Updates: Here are the two squads:\r\nGujarat Titans: Abhinav Manohar, David Miller, Gurkeerat Singh, B Sai Sudharsan, Shubman Gill, Ha… [+773 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shaju Philip", "title": "CPI(M)’s Thrikkakara debutant cardiologist Joseph: Politics not about holding party flag", "description": "Soon after the CPM announced his candidature for the May 31 bypoll Thursday, the 43-year-old cardiologist, who is all set for his electoral debut, said he has all along been a “Left fellow- traveller”.", "url": "https://indianexpress.com/article/india/political-pulse/cpim-thrikkakara-debutant-cardiologist-joseph-7904409/", "urlToImage": "https://images.indianexpress.com/2022/05/Dr-Jo-Joseph-1.jpg", "publishedAt": "2022-05-06T11:42:35Z", "content": "By fielding cardiologist Dr Jo Joseph as its candidate for the by-election to Thrikkakara Assembly constituency in Ernakulam district in Kerala, the ruling CPI(M) has entrusted him with the formidabl… [+3103 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aakash Joshi", "title": "When Inder Bhan Madan’s cartoons took on the Indian government and society", "description": "From unbiased political satires to a dig at scientific temper, a late self-taught cartoonist’s biting and unselfconscious works are on display at a Delhi exhibition", "url": "https://indianexpress.com/article/express-sunday-eye/when-inder-bhan-madans-cartoons-took-on-the-indian-government-and-society-7904306/", "urlToImage": "https://images.indianexpress.com/2022/05/IBM.jpg", "publishedAt": "2022-05-06T11:39:06Z", "content": "We live in an age of manufactured confessions. In writing, this has meant the explosion of the first-person singular most pieces are permeated by the perspective of the I. For the young and the conne… [+5709 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anonna Dutt", "title": "‘India too may have acute hepatitis cases… Child specialists must stay alert’", "description": "Over the last three weeks, several cases of acute hepatitis or liver inflammation of unknown origin have been reported among children in the US and Europe. At least 17 of them needed a liver transplant and one died of the disease as per the World Health Organ…", "url": "https://indianexpress.com/article/lifestyle/health/hepatitis-child-specialists-must-doctor-explains-7904120/", "urlToImage": "https://images.indianexpress.com/2022/05/doctor.jpg", "publishedAt": "2022-05-06T11:37:34Z", "content": "Why Dr Sarin: Dr Shiv Kumar Sarin is the vice-chancellor of the Institute of Liver and Biliary Sciences, a stand-alone government hospital dedicated to the treatment and research of liver diseases. H… [+5355 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Shah Rukh Khan hosts diplomats at Mannat, leaves Canada’s consul general impressed by his charm. See pictures", "description": "Shah Rukh Khan on Thursday hosted consul generals of several countries at his home Mannat. The diplomats seemed highly impressed by the superstar's charm. See photos.", "url": "https://indianexpress.com/article/entertainment/bollywood/shah-rukh-khan-hosts-diplomats-at-his-home-mannat-leaves-canadas-consul-general-impressed-by-his-charm-7904259/", "urlToImage": "https://images.indianexpress.com/2022/05/shah-rukh-khan-consul-event.jpg", "publishedAt": "2022-05-06T11:33:31Z", "content": "Bollywood star Shah Rukh Khan recently hosted the consul generals of France, Canada, and Quebec, among others, at his Mumbai home Mannat. Several photos from the meet and greet have been shared on so… [+3734 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rinku Ghosh", "title": "Fauda actor Tsahi Halevi to star in first Indo-Israeli film project", "description": "Actor-musician Tsahi Halevi talks about his Bollywood dream, art opening up a space for much-needed conversations, the Israeli-Palestinian conflict, yoga and, of course, Indian food", "url": "https://indianexpress.com/article/entertainment/entertainment-others/fauda-actor-tsahi-halevi-to-star-in-first-indo-israeli-film-project/", "urlToImage": "https://images.indianexpress.com/2022/05/Tsahi.jpg", "publishedAt": "2022-05-06T11:29:41Z", "content": "Mahatma Gandhi is his ideal and has shaped his compassionate and optimistic worldview. Every day I am inspired by his thinking that we should pursue our actions based on how they would influence some… [+4443 chars]"}]}