{"status": "ok", "totalResults": 375, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Plea to revise sugarcane workers’ minimum wage: Gujarat HC notice to state", "description": "The petitioner union pointed out that the rate for sugarcane harvesters/workers was last revised in 2015 and was due for revision in 2020 but was  not done.", "url": "https://indianexpress.com/article/cities/ahmedabad/plea-to-revise-sugarcane-workers-minimum-wage-gujarat-hc-notice-to-state-7968196/", "urlToImage": "https://images.indianexpress.com/2022/04/Gujarat-HC-1-1-1.jpeg", "publishedAt": "2022-06-14T00:46:43Z", "content": "A division bench of the Gujarat High Court on Monday issued notice to the state government and department of labour in a public interest litigation moved by trade union Mazoor Adhikar Manch seeking t… [+633 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Indo-Asian News Service", "title": "Gujarat govt to hold Vikas Yatra in July, says Vaghani", "description": "Vaghani said 80 chariots will be a part of the yatra which will be carried out in different zones across the state under the leadership of Chef Minister Bhupendra Patel, other ministers, Members of Parliament and Legislative Assembly of the Bharatiya Janata P…", "url": "https://indianexpress.com/article/cities/gandhinagar/state-govt-to-hold-vikas-yatra-in-july-says-vaghani-7968189/", "urlToImage": "https://images.indianexpress.com/2022/02/jitu-vaghani-1.jpg", "publishedAt": "2022-06-14T00:42:31Z", "content": "To disseminate information regarding developmental works done in Gujarat under the Bharatiya Janata Party (BJP) rule in the last two decades, the state government has organised a Vande Gujarat Vikas … [+1399 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Protests against Nupur Sharma: 10 booked in Ahmedabad, five released on bail in Surat", "description": "According to police, an FIR under IPC sections 144 for unlawful assembly and 188 for disobedience to order given by a public servant was lodged on Sunday agai-nst 10 residents of Jamalpur area.", "url": "https://indianexpress.com/article/cities/ahmedabad/protests-against-nupur-sharma-10-booked-in-ahmedabad-five-released-on-bail-in-surat-7968179/", "urlToImage": "https://images.indianexpress.com/2022/06/kol-pro-1.jpg", "publishedAt": "2022-06-14T00:37:01Z", "content": "Ten persons were booked in Jamalpur area of walled city Ahmedabad for unlawful assembly, two days after the June 10 protests over Bharatiya Janata Party (BJP) spokesperson Nupur Sharmas remarks again… [+3217 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "LIC shares tank by 5.85% after anchor lock-in period ends", "description": "Seven schemes of ICICI Prudential Mutual Fund invested Rs 725 crore in the LIC IPO. HDFC Mutual Fund was allocated shares worth Rs 525 crore.", "url": "https://indianexpress.com/article/business/market/lic-ipo-shares-rate-anchor-investors-stocks-market-7968187/", "urlToImage": "https://images.indianexpress.com/2022/06/REUTERS-LIC-IPO-1200.jpeg", "publishedAt": "2022-06-14T00:36:44Z", "content": "Shares of Life Insurance Corporation (LIC), which came out with a Rs 21,000 crore IPO recently, fell by 5.85 per cent to Rs 668.20 on the stock exchanges on Monday as anchor investors unloaded the sh… [+2037 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Owaisi hits out at breakdown of rule of law, tells PM to shut courts", "description": "Owaisi, whose rally  was aimed at campaigning for the upcoming Assembly polls in Gujarat, was referring to former BJP national spokesperson Nupur Sharma’s comments against the Prophet during a television debate.", "url": "https://indianexpress.com/article/cities/ahmedabad/owaisi-hits-out-at-breakdown-of-rule-of-law-tells-pm-to-shut-courts-7968188/", "urlToImage": "https://images.indianexpress.com/2022/05/Owaisi-2.jpg", "publishedAt": "2022-06-14T00:29:13Z", "content": "Hitting out at Prime Minister Narendra Modi over differential treatment of the Muslim community and a breakdown of rule of law, All India Majlis-e-Ittehadul Muslimeen (AIMIM) president Asaduddin Owai… [+2736 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Principal ‘misusing govt grants’: DEO orders probe after villagers lock school", "description": "Officials claimed that government grants can be used only after approval from the school management committees that also includes parents as members, while parents alleged that the principal misused government funds using fake bills.", "url": "https://indianexpress.com/article/cities/ahmedabad/principal-misusing-govt-grants-deo-orders-probe-after-villagers-lock-school-7968184/", "urlToImage": "https://images.indianexpress.com/2021/11/banner-1.jpg", "publishedAt": "2022-06-14T00:25:45Z", "content": "Mehsana District Education Officer (DEO) ordered an inquiry after residents of Sundhiya village in Vadnagar taluka of the district locked Anupam government primary school on Monday, alleging misue of… [+105 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "RBI regulations authority bats for updation, periodic review of returns", "description": "While the revamp of RBI website is expected to be completed soon, the RRA has recommended that all the contents posted on RBI website be updated on real-time basis.", "url": "https://indianexpress.com/article/business/economy/rbi-regulations-authority-bats-for-updation-periodic-review-of-returns-7968182/", "urlToImage": "https://images.indianexpress.com/2022/06/RBI-3-1-2.jpg", "publishedAt": "2022-06-14T00:23:16Z", "content": "The Regulations Review Authority of the Reserve Bank of India (RBI) has recommended withdrawal of 714 regulatory instructions which have either become obsolete or redundant and have not been explicit… [+2366 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "SL Patel school gets redeveloped building", "description": "The building which was in a dilapidated state has got five new classrooms for secondary and higher secondary school.", "url": "https://indianexpress.com/article/cities/ahmedabad/sl-patel-school-gets-redeveloped-building-7968183/", "urlToImage": "https://images.indianexpress.com/2022/06/SOSE-1-1.jpeg", "publishedAt": "2022-06-14T00:19:28Z", "content": "Bharatiya Janata Party (BJP) Member of Legislative Assembly (MLA) from Daskroi, Babubhai Jamnadas Patel, inaugurated the redeveloped building of SL Patel High School in Bhat village on Monday."}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "46 leaders and members of PAAS, SSSS, Congress detained in Surat district", "description": "The PAAS team of Gujarat, and SSSS members had a few days ago organised a meeting in Ahmedabad and planned to take out a yatra protesting   the renaming of Motera Stadium from Sardardham at Bardoli to Sardar Patel stadium at Motera in Ahmedabad on June 12 and…", "url": "https://indianexpress.com/article/cities/ahmedabad/46-leaders-and-members-of-paas-ssss-congress-detained-in-surat-district-7968181/", "urlToImage": "https://images.indianexpress.com/2022/05/pune-police-1-1.jpg", "publishedAt": "2022-06-14T00:14:40Z", "content": "Over 46 people including convenors and members of PAAS (Patidar Anamat Andolan Samithi), Sardar Sanman Sanklap Samithi (SSSS) and Congress leaders of Bardoli were detained on Sunday by police in Sura… [+1478 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Citizens’ group write to PM over dilapidated housing colony", "description": "In the letter to the Prime Minister, Vishwamitri Bachao Samiti said that the PM should order the Vadodara Municipal Corporation (VMC) to reconstruct homes “before a tragedy befalls” on the residents, citing the example of the collapse of Madhavn-agar EWS hous…", "url": "https://indianexpress.com/article/cities/ahmedabad/citizens-group-write-to-pm-over-dilapidated-housing-colony-7968175/", "urlToImage": "https://images.indianexpress.com/2022/06/modi-8.jpg", "publishedAt": "2022-06-14T00:10:00Z", "content": "Ahead of Prime Minister Narendra Modis visit to Vadodara on June 18, where he will address a public gathering at Leprosy Ground on Ajwa Road, a city-based citizens group has written a letter to draw … [+2197 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "‘Liquor party’ busted, 8 arrested in Vadodara", "description": "SM Varotariya, Assistant Com-missioner of Police, B Division, said that the LCB unit of DCP Zone 1 received information about a liquor party at a farmhouse in Dajina Kuva area Sunday night", "url": "https://indianexpress.com/article/cities/ahmedabad/liquor-party-busted-8-arrested-in-vadodara-7968172/", "urlToImage": "https://images.indianexpress.com/2022/06/arrest-6.jpg", "publishedAt": "2022-06-13T23:56:16Z", "content": "Eight persons were arrested under the Prohibition Law in Vadodara on Monday for allegedly holding a liquor party at a farmhouse on the outskirts late Sunday.The party was busted in a joint operation … [+1116 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Congress leaders detained in Ahmedabad; BJP is in panic mode, says Jagdish Thakor", "description": "Police detained several senior leaders including Gujarat Pradesh Congress Committee (GPCC) president Jagdish Thakor, leader of opposition Sukhram Rathva, former GPCC chief Amit Chavda, spokesperson Manish Doshi along with several MLAs from GMDC ground for pro…", "url": "https://indianexpress.com/article/cities/ahmedabad/congress-leaders-detained-in-ahmedabad-bjp-is-in-panic-mode-says-jagdish-thakor-7968169/", "urlToImage": "https://images.indianexpress.com/2021/12/PTI12_03_2021_000253B.jpg", "publishedAt": "2022-06-13T23:52:27Z", "content": "Over 30 Congress leaders were detained in Ahmedabad on Monday after hundreds of party workers staged a protest rally to support senior leader Rahul Gandhi, who was summoned by the Enforcement Directo… [+1296 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Raakhi Jagga", "title": "‘Bandi Singhs’: SAD’s one-note pitch in Sangrur bypoll fray", "description": "Despite the prevalence of a range of issues, from development to ongoing protests by several bodies over various matters, in their bypoll campaign the SAD leaders, including the party's Sangrur candidate Kamaldeep Kaur Rajoana and its president Sukhbir Singh …", "url": "https://indianexpress.com/article/cities/chandigarh/bandi-singhs-sads-one-note-pitch-in-sangrur-bypoll-fray-7968160/", "urlToImage": "https://indianexpress.com/wp-content/themes/indianexpress/images/IE-OGimage.jpg", "publishedAt": "2022-06-13T23:42:57Z", "content": "The release of Bandi Singhs (Sikh prisoners), who have been languishing in various jails for many years, is the sole campaign issue of the Shiromani Akali Dal (Badal) in the June 23 Sangrur Lok Sabha… [+3401 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manoj Dattatrye More", "title": "Another MVA vs BJP battle on the cards, this time for Legislative Council polls", "description": "On the last day of withdrawal of nominations, Sadabhau Khot, who heads the Rayat Krantikari Sanghatana, pulled out of the race. NCP's additional candidate Shivajirao Garje also dropped out.", "url": "https://indianexpress.com/article/cities/pune/another-mva-vs-bjp-battle-on-the-cards-this-time-for-legislative-council-polls-7968163/", "urlToImage": "https://images.indianexpress.com/2022/06/June11-BOM-CelebrationBJP08-4col.jpg", "publishedAt": "2022-06-13T23:37:46Z", "content": "AS 11 candidates remained in the fray for 10 seats on the last day of withdrawal of nominations for the state Legislative Council elections, the ruling MVA and opposition BJP are all set for another … [+3154 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Parthasarathi Biswas", "title": "Farmers urged to undertake germination test before sowing, wait for enough moisture", "description": "Consistent good prices in the wholesale markets have prompted farmers to increase their soyabean acreage. This year, Maharashtra is expected to see 46 lakh hectares of kharif sowing of soyabean as farmers have preferred this crop over pulses or coarse millets.", "url": "https://indianexpress.com/article/cities/pune/farmers-urged-to-undertake-germination-test-before-sowing-wait-for-enough-moisture-7968162/", "urlToImage": "https://images.indianexpress.com/2022/05/farming-3.jpg", "publishedAt": "2022-06-13T23:29:21Z", "content": "SOYABEAN GROWERS in Maharashtra may not have to rely on procured seed this season to take the oil crop. As the wait for ample rain continues, data collated from the Agriculture department shows that … [+2687 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Ajay Jadhav", "title": "Ridership falling, Metro reduces frequency of trains on 2 lines", "description": "“The ridership of Metro rail has been dropping since its launch. There was much excitement initially that made citizens take up the joy ride. However, it has now come down but it is expected to rise again after extension of the routes,” said Hemant Sonawane, …", "url": "https://indianexpress.com/article/cities/pune/ridership-falling-metro-reduces-frequency-of-trains-on-2-lines-7968161/", "urlToImage": "https://images.indianexpress.com/2022/04/05-Pune-Metro-3col.jpeg", "publishedAt": "2022-06-13T23:23:22Z", "content": "WITH STEADY decline in ridership, Pune Metro has reduced the frequency of its services on two short stretches.The ridership of Metro rail has been dropping since its launch. There was much excitement… [+583 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "PM to inaugurate ‘shila’ temple, address devotees at Dehu today", "description": "\"It will not be a political address... It will be more about the warkaris as the 'wari' is set to take off from Dehu on June 20,\" said Landge.", "url": "https://indianexpress.com/article/cities/pune/pm-to-inaugurate-shila-temple-address-devotees-at-dehu-today-7968146/", "urlToImage": "https://images.indianexpress.com/2022/06/modi-7-1.jpg", "publishedAt": "2022-06-13T23:19:50Z", "content": "THE TEMPLE town of Dehu is all ready to receive Prime Minister Narendra Modi, who will be inaugurating a shila (rock) temple at the existing Sant Tukaram Maharaj temple. The Prime Minister is expecte… [+1948 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sourav Roy Barman", "title": "Average maths score of first-year engineering students below 40%: AICTE", "description": "A survey, undertaken to evaluate the quality of technical education and identify learning gaps affecting employment prospects of engineering graduates, found civil engineering students to be the “lowest performers” in “fundamental subjects”.", "url": "https://indianexpress.com/article/education/average-maths-score-first-year-engineering-students-below-40-pc-aicte-7968111/", "urlToImage": "https://images.indianexpress.com/2022/06/exam-represent-1-2-1.jpg", "publishedAt": "2022-06-13T23:05:09Z", "content": "FIRST-YEAR engineering students, across major disciplines, struggle with mathematics more than any other core subject, according to a learning assessment survey carried out by the All India Council f… [+4911 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Vallabh Ozarkar", "title": "Samruddhi Expressway yet to be opened for public, car mishap on it claims one life", "description": "According to local residents, it was raining heavily when the accident took place. They said many motorists have been using the expressway as there is no security to guard the stretch.", "url": "https://indianexpress.com/article/cities/mumbai/samruddhi-expressway-yet-to-be-opened-for-public-car-mishap-on-it-claims-one-life-7968159/", "urlToImage": "https://images.indianexpress.com/2022/05/ROAD-ACCIDENT-1-1.jpeg", "publishedAt": "2022-06-13T23:00:58Z", "content": "While the 701-km Mumbai-Nagpur Samruddhi Expressway is yet to be opened for vehicular traffic, a 45-year-old man died and three others sustained injuries on Sunday when the car they were travelling i… [+2706 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mumbai: Teen dies after beating, live-in partner arrested for murder", "description": "The accused, Stephen Morris, 22, works with an online delivery service. He lives with his mother in a chawl in Mahakali caves. He was in a relationship with the deceased, Rihana Shaikh, 19, for the past year. Shaikh's family did not approve of her relationshi…", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-teen-dies-after-beating-live-in-partner-arrested-for-murder-7968155/", "urlToImage": "https://images.indianexpress.com/2021/11/banner-1.jpg", "publishedAt": "2022-06-13T22:55:18Z", "content": "A 19-year-old woman who was beaten allegedly by her 22-year-old live-in partner late Sunday night in Andheri (east) died in the early hours of Monday. The woman’s partner rushed her to a government h… [+1299 chars]"}]}