{"status": "ok", "totalResults": 371, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Satyendar Jain responds to letter by Union Power Minister", "description": "Jain had written to the Centre last week raising concerns about the coal stock at the NTPC power plants supplying electricity to Delhi. He had requested the Centre to ensure coal availability to these plants.", "url": "https://indianexpress.com/article/cities/delhi/satyendar-jain-responds-to-letter-by-union-power-minister-7898655/", "urlToImage": "https://images.indianexpress.com/2022/02/satyendar-jain12.jpg", "publishedAt": "2022-05-03T00:39:40Z", "content": "A day after Union Power Minister R K Singh said the Delhi Power Minister Satyendar Jains letter to the Union Minister had incorrect figures on the coal stock at plants supplying electricity to Delhi,… [+2107 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Peter Vidal", "title": "Horoscope Today, May 3, 2022: Libra, Aries, Pisces and other signs — check astrological prediction", "description": "Sagittarius- Your creative energy should now be at a peak, but not perhaps because the stars are all on your side. On the contrary, challenging romantic stars remind us of the cliché that all great art stems from suffering!", "url": "https://indianexpress.com/article/horoscope/horoscope-today-may-3-2022-libra-aries-pisces-and-other-signs-check-astrological-prediction-7898653/", "urlToImage": "https://images.indianexpress.com/2022/03/HORO-1.jpeg", "publishedAt": "2022-05-03T00:36:11Z", "content": "Whats on the cards today for you? Aries, hard work seems somewhat inevitable, so please don’t be jealous of people who have it easier. Aquarius, there’s a great deal going on behind the scenes. In fa… [+3658 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sweety Kumari", "title": "‘We thought this was going to be the last day of our life’", "description": "“It turned out to be a nightmare. This was my first flight experience, and it landed me in hospital,” said Ansari, a construction worker hailing from Jharkhand, who suffered a fracture in a right-hand finger and injuries in his back.", "url": "https://indianexpress.com/article/cities/kolkata/we-thought-this-was-going-to-be-the-last-day-of-our-life-7898650/", "urlToImage": "https://images.indianexpress.com/2022/05/iiii.jpg", "publishedAt": "2022-05-03T00:29:44Z", "content": "We thought it was going to be the last day of our life. I will never board a flight again in my life, said 22-year-old Imamul Ansari, a passenger onboard the Spice Jet aircraft from Mumbai to Durgapu… [+2357 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "BJP hits streets, protests 1 year of ‘post-poll violence’", "description": "Addressing a public meeting held after the rally, Leader of Opposition in state Assembly Suvendu Adhikari said unprecedented atrocities were carried out on BJP workers and supporters after the Assembly polls results, which were declared on May 2 last year.”", "url": "https://indianexpress.com/article/cities/kolkata/bjp-hits-streets-protests-1-year-of-post-poll-violence-7898646/", "urlToImage": "https://images.indianexpress.com/2022/05/KOL.jpg", "publishedAt": "2022-05-03T00:12:10Z", "content": "To mark one year of post-assembly poll violence in West Bengal, the BJP on Monday held a protest rally in the heart of the city to establish democracy in the state.Titled Ganatantra Pratistha Sankalp… [+2982 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "One more arrested in Khejuri blast case: NIA", "description": "The investigating agency earlier arrested three people in connection with the blast that took place in Khejuri, Purba Medinipur. They were identified as Saidul Ali Khan, Sheikh Arif Billa and Samar Shankar Mandal.", "url": "https://indianexpress.com/article/cities/kolkata/one-more-arrested-in-khejuri-blast-case-nia-7898644/", "urlToImage": "https://images.indianexpress.com/2022/01/national-investigation-agency-1200.jpg", "publishedAt": "2022-05-03T00:07:50Z", "content": "THE NATIONAL Investigation Agency (NIA) has arrested one more person in connection with the Khejuri blast case, officers said on Monday. This takes the number of arrests in the case to four till date… [+819 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "CBI files status report in HC on Nadia ‘gangrape’", "description": "The CBI recently arrested the local TMC leader and father of the main accused in the alleged gangrape and death of the girl as he allegedly played an “active role” in tampering with evidence and intimidating her family members.", "url": "https://indianexpress.com/article/cities/kolkata/cbi-files-status-report-in-hc-on-nadia-gangrape-7898642/", "urlToImage": "https://images.indianexpress.com/2022/04/Calcutta-HC-1-1.jpg", "publishedAt": "2022-05-02T23:55:41Z", "content": "THE CBI on Monday filed its status report before the Calcutta High Court in connection with the alleged gangrape and death of a minor in Nadia district.A division bench comprising Chief Justice Praka… [+2092 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Map out road routes to speed up coal transport, Adityanath tells officials", "description": "He also asked state energy minister Arvind Kumar Sharma to review the working of the power department and bring about major changes at all levels.", "url": "https://indianexpress.com/article/cities/lucknow/map-out-road-routes-to-speed-up-coal-transport-adityanath-tells-officials-7898625/", "urlToImage": "https://images.indianexpress.com/2022/04/yogi-6.jpg", "publishedAt": "2022-05-02T23:42:53Z", "content": "In the wake of the ongoing power crisis in the state, Uttar Pradesh Chief Minister Yogi Adityanath on Monday directed officials to ensure power supply as per the roster in all 75 districts and to map… [+2609 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Ajay K Sood", "title": "An Expert Explains: ‘Need ease of doing science, wider distribution of grants’", "description": "New Principal Scientific Advisor talks about the elements of his vision — including focus on future vaccinations, and perhaps India’s own SpaceX .", "url": "https://indianexpress.com/article/explained/an-expert-explains-need-ease-of-doing-science-wider-distribution-of-grants-7898508/", "urlToImage": "https://images.indianexpress.com/2022/05/modi-science.jpg", "publishedAt": "2022-05-02T23:36:32Z", "content": "What is the job of the Principal Scientific Advisor (PSA); what will be your focus?The role of the PSA is to coordinate across various science ministries and to advise the right things, not just abou… [+4051 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Fire at SVP Hospital; patients evacuated", "description": "\"No patient was injured. For their safety, we shifted them to other departments of the hospital. We received great cooperation from the hospital staff, paramedics, fire personnel and security staff.\"", "url": "https://indianexpress.com/article/cities/ahmedabad/fire-at-svp-hospital-patients-evacuated-7898623/", "urlToImage": "https://images.indianexpress.com/2019/02/vs-hospital.jpg", "publishedAt": "2022-05-02T23:16:40Z", "content": "As many as 20 patients from the Intensive Care Unit (ICU) and other wards of Sardar Vallabhbhai Patel (SVP) Hospital at the Ellisbridge area of Ahmedabad were evacuated after a fire broke out on the … [+1853 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Retired Justice Shah to mediate in group dispute of Swaminarayan sect", "description": "The two conflicting groups—led by Prabodh Swami and Prem Swaroop Swami—have consented to have the retired judge mediate in the case at the crux of which is the issue of Presidentship of the temple.", "url": "https://indianexpress.com/article/cities/ahmedabad/retired-justice-shah-to-mediate-in-group-dispute-of-swaminarayan-sect-7898622/", "urlToImage": "https://images.indianexpress.com/2022/04/bombay-high-court-7592-3.jpg", "publishedAt": "2022-05-02T23:08:03Z", "content": "The two warring groups of the Akshar Purushottam Swami Temple at Sokhda in Vadodara (Haridham) Monday chose retired Bombay High Court Chief Justice MS Shah to mediate in the ongoing dispute regarding… [+3407 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Cement plaster falls from school lobby roof, four students injured", "description": "“Along with students, their parents, villagers, and members of the school management committee were also sitting in the lobby when a chunk of cement plaster fell from the roof, leaving four students injured,” Modi said.", "url": "https://indianexpress.com/article/cities/ahmedabad/cement-plaster-falls-from-school-lobby-roof-four-students-injured-7898621/", "urlToImage": "https://images.indianexpress.com/2022/05/Indian-express-1.jpg", "publishedAt": "2022-05-02T23:00:10Z", "content": "Four students of a government primary school in Mahisagar district were injured after cement plaster from the roof of the lobby fell on them on Monday, officials said.The incident took place in the m… [+1576 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "SBI issues certificate withheld for non-payment of 31 paise after Gujarat HC ire", "description": "On April 27, SBI had drawn the High Court’s ire during the hearing of a petition moved by two persons -- Rakesh and Manoj Verma -- after the bank failed to issue the required certificate.", "url": "https://indianexpress.com/article/cities/ahmedabad/sbi-issues-certificate-withheld-for-non-payment-of-31-paise-after-gujarat-hc-ire-7898612/", "urlToImage": "https://images.indianexpress.com/2022/05/sbi-1200-1.jpeg", "publishedAt": "2022-05-02T22:50:02Z", "content": "Senior advocate Kamal Trivedi, representing SBI, submitted before the High Court that a confusion had led to the non-issuance of the no dues certificate to the original borrower, that resulted in non… [+2159 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gujarat ATS seizes heroin worth Rs 700 crore from UP house", "description": "This is the latest in a series of drug busts by the ATS in Gujarat, New Delhi and Uttar Pradesh.", "url": "https://indianexpress.com/article/cities/ahmedabad/gujarat-ats-seizes-heroin-worth-rs-700-crore-from-up-house-7898610/", "urlToImage": "https://images.indianexpress.com/2022/05/drugs-1.jpg", "publishedAt": "2022-05-02T22:47:13Z", "content": "The Gujarat Anti Terrorist Squad (ATS) in a joint operation with Delhi Polices Special Cell and UP Polices Special Operations Group (SOG) seized around 155 kilograms of heroin worth over Rs 700 crore… [+1751 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "BSNL, MTNL to switch to 4G by end of this year: Minister", "description": "Interacting with officials of the Department of Telecommunications (DoT) and postal department in Ekta Nagar, Kevadia, the minister said the villages in Gujarat that do not have mobile network connectivity will be covered by the year-end.", "url": "https://indianexpress.com/article/india/bsnl-mtnl-to-switch-to-4g-by-end-of-this-year-minister-7898607/", "urlToImage": "https://images.indianexpress.com/2022/05/BSNL.jpg", "publishedAt": "2022-05-02T22:44:24Z", "content": "State-run telecom companies Bharat Sanchar Nigam Limited (BSNL) and Mahanagar Telephone Nigam Limited (MTNL) are likely to switch to 4G network by the end of 2022, said Minister of State (MoS) for Co… [+1533 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Five of family killed after car, tanker collide in Navsari", "description": "The victims were returning from Surat, where they had gone to shop for the upcoming wedding of Praful’s daughter.", "url": "https://indianexpress.com/article/cities/surat/five-of-family-killed-after-car-tanker-collide-in-navsari-7898608/", "urlToImage": "https://images.indianexpress.com/2022/05/accident-1-1-2.jpg", "publishedAt": "2022-05-02T22:40:57Z", "content": "Five of a family were killed and one was critically injured in a road accident in Navsari on Monday, after the Maruti Eeco car they were travelling in collided with a tanker on National Highway-48.Th… [+862 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Eid, Parshuram Jayanti: 5,000 cops deployed ahead of festivals in Ahmedabad", "description": "Over 5,000 police personnel, including 60 police inspectors, 18 assistant commissioners, 10 deputy commissioners, Additional Commissioner and Joint Commissioner will be deployed Tuesday, he said.", "url": "https://indianexpress.com/article/cities/ahmedabad/eid-parshuram-jayanti-5000-cops-deployed-ahead-of-festivals-in-ahmedabad-7898598/", "urlToImage": "https://images.indianexpress.com/2022/05/cops.jpg", "publishedAt": "2022-05-02T22:37:30Z", "content": "Security will be tightened in Ahmedabad and strict watch will be kept on social media to ensure Eid and Parshuram Jayanti are observed in a peaceful manner, said City Police Commissioner Sanjay Sriva… [+543 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Centralised online admission process launched for 595 ITIs", "description": "Launching the admission portal in Gandhinagar on Monday, Minister for Labour, Skills Development and Employment, Brijesh Merja, said it is to bring transparency in the process as well as to help students save time and money, a release said.", "url": "https://indianexpress.com/article/cities/ahmedabad/centralised-online-admission-process-launched-for-595-itis-7898596/", "urlToImage": "https://images.indianexpress.com/2022/05/exams.jpg", "publishedAt": "2022-05-02T22:37:19Z", "content": "A centralised online admission procedure has been launched for 595 Industrial Training Institutes (ITIs) across the state for the academic session that begins in August 2022.Launching the admission p… [+672 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Krishn Kaushik", "title": "Before Modi meets Macron, French opt out of India project for submarines", "description": "The group, one of the five shortlisted international players for the Rs 43,000-crore project, said it cannot meet conditions of the Request for Proposal (RFP) and will, therefore, not continue with its bid.", "url": "https://indianexpress.com/article/india/india-news-india/before-modi-meets-macron-french-opt-out-of-india-project-for-submarines-7898531/", "urlToImage": "https://images.indianexpress.com/2022/05/modi-macron-2.jpg", "publishedAt": "2022-05-02T22:30:34Z", "content": "Ahead of Prime Minister Narendra Modis scheduled visit to France, French defence major Naval Group has announced that it is unable to participate in the P-75 India (P-75I) project under which six con… [+4279 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "LIC IPO takes off: Demand from anchor investors is very strong", "description": "The LIC, which is planning to raise a total of Rs 21,000 crore through the IPO, has aimed to raise Rs 5,630 crore at the upper end of the price band from anchor investors.", "url": "https://indianexpress.com/article/business/market/lic-ipo-takes-off-demand-from-anchor-investors-is-very-strong-7898503/", "urlToImage": "https://images.indianexpress.com/2022/05/LIC-IPO-REUTERS-1200-1.jpg", "publishedAt": "2022-05-02T22:30:13Z", "content": "The Life Insurance Corporation (LIC) kicked off its mega IPO process Monday with the insurers anchor book getting oversubscribed with bids of over Rs 7,000 crore.The LIC, which is planning to raise a… [+2491 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shubhajit Roy", "title": "No winner in this war, serious impact on developing and poor countries: PM Modi", "description": "Prime Minister Modi, who did not name Russia in his statement, said “there will be no winning party in this war, everyone will suffer”.", "url": "https://indianexpress.com/article/india/modi-german-chancellor-scholz-meeting-russia-ukraine-war-g7-summit-7898521/", "urlToImage": "https://images.indianexpress.com/2022/05/Scholz-Modi-meet.jpg", "publishedAt": "2022-05-02T22:30:05Z", "content": "Underlining that Russia has violated fundamental principles of international law and the UN Charter by attacking Ukraine and its civilian population, German Chancellor Olaf Scholz said Monday that he… [+5912 chars]"}]}