{"status": "ok", "totalResults": 536, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "NASA’s head warned that China may try to claim the Moon: 2 space scholars explain why that’s unlikely to happen", "description": "If China assumes control over some part of the moon, it would be a risky, expensive and extremely provocative action.", "url": "https://indianexpress.com/article/world/nasa-moon-china-claim-space-bill-nelson-south-pole-law-8018723/", "urlToImage": "https://images.indianexpress.com/2022/07/MOON-EXPRESS.jpg", "publishedAt": "2022-07-09T06:46:01Z", "content": "NASA Administrator Bill Nelson recently expressed concerns over China’s aims in space, and in particular, that China would, in some way, claim ownership over the Moon and stop other countries from ex… [+5316 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pallavi Smart", "title": "Art Street: The nameless sculpture that livens up Orlem Church Junction in Mumbai’s Malad", "description": "Sculptor Raju Dattatray Bind, the artist behind the installation, said friction between two local politicians meant that the artwork “remained nameless.” It was installed in 2011 and has since been known as “the-hand-outside-church” among the locals at Orlem.", "url": "https://indianexpress.com/article/cities/mumbai/art-street-the-nameless-sculpture-that-livens-up-orlem-church-junction-in-mumbais-malad-8018724/", "urlToImage": "https://images.indianexpress.com/2022/07/Mumbai-art-streets.jpg", "publishedAt": "2022-07-09T06:44:46Z", "content": "Right at the intersection of four roads at the Orlem Church Junction in Mumbais Malad stands a meaningful artwork that signifies freedom and peace. A white sculpture of an open right hand with a bird… [+2938 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sona Bahadur", "title": "Assam on a Plate: How a Guwahati-based chef is putting Assamese cuisine on India’s culinary map", "description": "A non-stop crusader for Assam’s ethnic culinary traditions for over two decades, chef Atul Lahkar says there is a lot more to Assamese cuisine than pork, bamboo shoots and ghost peppers", "url": "https://indianexpress.com/article/express-sunday-eye/assam-on-a-plate-how-a-guwahati-based-chef-is-putting-assamese-cuisine-on-indias-culinary-map-8018561/", "urlToImage": "https://images.indianexpress.com/2022/07/Atul1200eye.jpg", "publishedAt": "2022-07-09T06:43:14Z", "content": "Youve been travelling to Assamese villages, staying with tribal families and learning about their cuisines for 28 long years. What inspired you to travel so extensively to document these ethnic recip… [+6787 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Birmingham police arrest man following allegations of racism during Edgbaston Test", "description": "Several Indian fans had taken to Twitter to report the racist behaviour they endured during the fourth day's play on Monday night.", "url": "https://indianexpress.com/article/sports/cricket/birmingham-police-arrest-man-following-allegations-of-racism-during-edgbaston-test-ind-vs-eng-bcci-ecb-icc-jasprit-bumrah-ben-stokes-warwickshire-county-cricket-club-8018692/", "urlToImage": "https://images.indianexpress.com/2021/08/india-vs-england-headingley.jpg", "publishedAt": "2022-07-09T06:36:41Z", "content": "Birmingham Police have arrested a man for “racially aggravated public order offence”, following allegations of racist abuse aimed at Indian fans during the rescheduled fifth Test between India and En… [+1727 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "When Alia Bhatt opened up about her equation with ‘mad, crackpot’ Deepika Padukone, if it’s awkward to see her and Ranbir Kapoor together", "description": "On season six of Koffee with Karan, Alia Bhatt had said there is nothing to feel awkward about Deepika Padukone and Ranbir Kapoor's friendship.", "url": "https://indianexpress.com/article/entertainment/bollywood/when-alia-bhatt-opened-up-about-her-equation-with-mad-crackpot-deepika-padukone-8018660/", "urlToImage": "https://images.indianexpress.com/2022/07/alia-bhatt-deepika-padukone.jpg", "publishedAt": "2022-07-09T06:35:48Z", "content": "Alia Bhatt revealed many things about her relationship with husband Ranbir Kapoor during her recent appearance on Karan Johar’s Koffee with Karan 7. She even said that she is friends with his ex-girl… [+2269 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "SBI signs pact with Karnataka to open India’s first branch for startups", "description": "Bangalore news: The collaboration between SBI and the Karnataka Digital Economy Mission will enable startups across the state to access banking facilities, funding, credit facilities.", "url": "https://indianexpress.com/article/cities/bangalore/sbi-signs-pact-with-karnataka-to-open-india-first-branch-for-startups-8018699/", "urlToImage": "https://images.indianexpress.com/2022/07/ch1652132.jpg", "publishedAt": "2022-07-09T06:28:56Z", "content": "Karnataka Digital Economy Mission (KDEM) and State Bank of India Friday signed a Memorandum of Understanding (MoU), which enables SBI to open its countrys first dedicated branch for startups (SBI Sta… [+2367 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Sri Lanka police fire tear gas at anti-government protesters", "description": "In Sri Lanka, protesters blame Rajapaksa for the economic woes and have occupied the entrance to his office for three months.", "url": "https://indianexpress.com/article/world/sri-lanka-police-fire-tear-gas-at-anti-government-protesters-8018689/", "urlToImage": "https://images.indianexpress.com/2022/07/sri-lanka-protesters.jpg", "publishedAt": "2022-07-09T06:28:38Z", "content": "Sri Lankan police fired tear gas Saturday at protesters demanding that President Gotabaya Rajapaksa and his government resign over the island nation’s worst economic crisis in recent memory.Thousands… [+2543 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Neetu Kapoor celebrates 64th birthday with ‘familia’ in London, gorges on Chinese food and misses Alia Bhatt-Ranbir Kapoor", "description": "Neetu Kapoor enjoyed the perfect birthday lunch with her family in London. See pictures from the party here.", "url": "https://indianexpress.com/article/entertainment/bollywood/neetu-kapoor-celebrates-64th-birthday-with-familia-in-london-8018662/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-11-2.jpg", "publishedAt": "2022-07-09T06:28:30Z", "content": "Veteran actor Neetu Kapoor,who celebrated her 64th birthday yesterday with her friends and family in London, has shared some inside pictures of her birthday lunch. The get-together was attended by he… [+1122 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kamaldeep Singh Brar", "title": "Moosewala murder: Allegations of gangster Bhagwanpuria’s ties with SAD leaders resurface", "description": "Sandeep Singh, a relative of SAD leader Nirmal Singh Kahlon, is on the run. He was allegedly working for gangster Jaggu Bhagwanpuria who is in police remand in the Moosewala murder case.", "url": "https://indianexpress.com/article/cities/amritsar/moosewala-murder-allegations-gangster-sad-8018556/", "urlToImage": "https://images.indianexpress.com/2022/07/IMG_1301.jpg", "publishedAt": "2022-07-09T06:26:05Z", "content": "The alleged relations between gangster Jagdeep Singh, also known as Jaggu Bhagwanpuria, and Shiromani Akali Dal (Badal) leaders are under the scanner again. Bhagwanpuria is on remand with the Punjab … [+2517 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Adani Group planning to enter telecom spectrum race; to face Ambani’s Jio, Mittal’s Airtel", "description": "Jio, Airtel and Vodafone Idea -- the three private players in the telecom sector -- applied, three sources with knowledge of the matter said.", "url": "https://indianexpress.com/article/business/adani-group-telecom-spectrum-race-ambani-jio-mittal-airtel-8018656/", "urlToImage": "https://images.indianexpress.com/2022/07/5G_Network_Pixabay.jpg", "publishedAt": "2022-07-09T06:17:13Z", "content": "Billionaire Gautam Adani’s group is said to be planning a surprise entry into the race to acquire telecom spectrum, which will pitch it directly against Mukesh Ambani’s Reliance Jio and telecom czar … [+4038 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "As Russia looms, a Ukrainian city’s loyalties divide", "description": "While many people have already left and others are preparing to flee, some residents are staying put, with many accusing the Ukrainian army of shelling the market to scare the population into leaving or even as a ruse to gain more international support.", "url": "https://indianexpress.com/article/world/ukraine-russia-sloviansk-war-attack-rocket-strikes-luhansk-donetsk-8018639/", "urlToImage": "https://images.indianexpress.com/2022/07/ukraine-market-attack.jpg", "publishedAt": "2022-07-09T06:11:19Z", "content": "A woman berated visiting reporters, accusing them of publishing lies. Others turned away, reluctant to talk. Tensions were running high in the central market of Sloviansk, Ukraine, after rocket strik… [+8235 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Johnson hasn’t left, but jockeying to replace him has begun", "description": "Johnson has promised not to embark on any new policies while he remains in Downing Street, and few are now interested in his thinking. Instead, attention is focused on the contenders jockeying for his position.", "url": "https://indianexpress.com/article/world/johnson-hasnt-left-but-jockeying-to-replace-him-has-begun-8018651/", "urlToImage": "https://images.indianexpress.com/2022/07/BRITAIN-JOHNSON-LIES-1.jpg", "publishedAt": "2022-07-09T06:02:35Z", "content": "On the surface, it looked like business as usual at the heart of British government Friday, a day after Boris Johnson was forced to announce he would resign as prime minister when his party turned ag… [+6308 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "England vs India, 2nd T20I live streaming: When and where to watch", "description": "Having won the first T20I convincingly by 50 runs, India will look to wrap up the series as they play England on Saturday in Edgbaston, Birmingham.", "url": "https://indianexpress.com/article/sports/cricket/england-vs-india-2nd-t20i-live-streaming-when-and-where-to-watch-8018592/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-3-2.jpg", "publishedAt": "2022-07-09T05:59:36Z", "content": "England vs India, 2nd T20I live streaming: Hardik Pandya the all-rounder scored a fifty and picked a four wicket haul to inspire India to a 50 run win against England in the 1st T20I at the Ageas Bow… [+1537 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Eid al-Adha 2022: Date, History, Importance, and Significance", "description": "Happy Eid ul-Adha (Bakrid) 2022 Date, Wishes Images, Quotes: The festival honours Prophet Ibrahim's readiness to sacrifice his beloved son at Allah's command. It occurs after the conclusion of Haj.", "url": "https://indianexpress.com/article/lifestyle/life-style/eid-al-adha-2022-date-history-importance-and-significance-8016501/", "urlToImage": "https://images.indianexpress.com/2022/07/eid-mubarak-inscription-flour-with-eastern-sweets-plate.jpg", "publishedAt": "2022-07-09T05:55:38Z", "content": "Eid al-Adha (Bakrid) 2022 Date India: One of Islam’s most revered holidays, Eid al-Adha honours Prophet Ibrahim’s readiness to sacrifice his beloved son at Allah’s command and occurs after the conclu… [+2243 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Shinzo Abe’s influence was still evident long after he left office", "description": "Shinzo Abe's assassination on Friday was a reminder that he managed, nonetheless, to become perhaps the most transformational politician in Japan’s post-World War II history, even as he spoke in the maddeningly bland terms that Japanese politicians regard as …", "url": "https://indianexpress.com/article/world/shinzo-abes-influence-was-still-evident-long-after-he-left-office-8018640/", "urlToImage": "https://images.indianexpress.com/2022/07/JAPAN-ABE-REUTERS-1200.jpeg", "publishedAt": "2022-07-09T05:54:39Z", "content": "Written by David E. SangerIn his record-breaking run as prime minister, Shinzo Abe never achieved his goal of revising Japans Constitution to transform his country into what the Japanese call a norma… [+7254 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Cloudburst triggers flash floods in Jammu and Kashmir’s Doda", "description": "No casualty has been reported in the incident, an officer said.", "url": "https://indianexpress.com/article/cities/jammu/jammu-and-kashmir-doda-cloudburst-flash-floods-8018644/", "urlToImage": "https://images.indianexpress.com/2022/07/Indian-express-logo-1-16.jpeg", "publishedAt": "2022-07-09T05:54:18Z", "content": "A cloudburst triggered flash floods in Jammu and Kashmir’s Doda district on Saturday, causing minor damage to some vehicles, officials said."}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi: Man killed, 3 arrested after encounter with police", "description": "DCP (North-East) Sanjay Kumar Sain said the deceased was identified as Aakash alias Illu, and was allegedly involved in seven cases of robbery. He was released on bail on June 6.", "url": "https://indianexpress.com/article/cities/delhi/delhi-man-killed-3-arrested-encounter-police-8018512/", "urlToImage": "https://images.indianexpress.com/2022/07/arrest-18.jpg", "publishedAt": "2022-07-09T05:54:09Z", "content": "A 23-year-old man, who is a known felon of North-East Delhis New Usmanpur area, was gunned down after a brief exchange of fire on Friday night at the Yamuna Khadar area. Three of his associates were … [+1771 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "In rare gesture, PM Modi, Biden and Albanese issue joint statement condoling death of Shinzo Abe", "description": "PM Narendra Modi, US President Joe Biden and Australian PM Anthony Albanese said Shinzo Abe was a \"transformative leader\" for Japan and worked tirelessly to advance a shared vision for a free and open Indo-Pacific. The Quad comprised India, the US, Japan and …", "url": "https://indianexpress.com/article/india/shinzo-abe-assassination-quad-leaders-modi-biden-albanese-statement-8018633/", "urlToImage": "https://images.indianexpress.com/2022/07/Shinzo-Abe-4.jpg", "publishedAt": "2022-07-09T05:50:00Z", "content": "In a rare gesture, Prime Minister Narendra Modi, US President Joe Biden and Australian PM Anthony Albanese issued a joint statement on Saturday paying rich tributes to Japanese leader Shinzo Abe and … [+1795 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "No plans to shut schools, colleges: Minister amid Covid-19 spike in West Bengal", "description": "West Bengal reported 2,950 new COVID-19 cases on Friday with a positivity rate of 16.92 per cent. Three more people died in the state, while active cases rose to 18,856, as per the Health Department.", "url": "https://indianexpress.com/article/education/no-plans-to-shut-schools-colleges-minister-amid-covid-19-spike-in-west-bengal-8018638/", "urlToImage": "https://images.indianexpress.com/2022/07/ch1569135-1.jpg", "publishedAt": "2022-07-09T05:49:35Z", "content": "West Bengal Education Minister Bratya Basu on Friday said the state government is not immediately planning to close schools and colleges, as COVID-19 cases continue to rise exponentially in the state… [+1828 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "পয়গম্বরকে নিয়ে বিতর্কিত মন্তব্যের জেরে জোরালো সাইবার হানার মুখে দেশ! মিলল চুড়ান্ত সতর্কবার্তা", "description": "মালয়েশিয়া এবং ইন্দোনেশিয়ার একদল মুসলিম হ্যাকার ভারতের বিরুদ্ধে কার্যত সাইবার যুদ্ধ শুরু করেছে।", "url": "https://bengali.indianexpress.com/general-news/cyber-attack-plot-against-india-post-nupur-sharma-incident-exposed-2000-accounts-hacked-467074/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/Nupur-Sharma-2.jpg", "publishedAt": "2022-07-09T05:48:45Z", "content": "‘ ’ ‘ ’ ‘ ’ ‘ ’ \r\n , \r\n : [ , ]\r\n , \r\n, , , , , “ \r\nStay updated with the latest news headlines and all the latest General news download Indian Express Bengali App.\r\nWeb Title: Cyber attack plot agai… [+64 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Chetan Nayak", "title": "Buying a used iPhone vs a used Android: Keep these important points in mind", "description": "Choosing between an older iPhone and older Android flagship can get confusing. Here are a few pointers to keep in mind when hunting for your next phone from the used phone market.", "url": "https://indianexpress.com/article/technology/techook/buying-a-used-iphone-vs-a-used-android-keep-these-important-points-in-mind-8018523/", "urlToImage": "https://images.indianexpress.com/2022/07/old-iphone-vs-old-android.jpg", "publishedAt": "2022-07-09T05:48:35Z", "content": "Buying a used smartphone is not an easy task. If anything, it’s harder making up your mind on a used smartphone because theres always the possibility of a better deal amidst fluctuating prices and ba… [+3379 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "With fewer cases and low positivity rate, Covid-19 is waning in Delhi", "description": "Delhi reported 531 new cases with a positivity rate of 3.13 per cent on Friday. There was 2,329 active cases reported, with 134 people being hospitalised.", "url": "https://indianexpress.com/article/cities/delhi/with-fewer-cases-and-low-positivity-rate-covid-19-is-waning-in-delhi-8018603/", "urlToImage": "https://images.indianexpress.com/2022/07/punjab-covid.jpg", "publishedAt": "2022-07-09T05:38:45Z", "content": "The current Covid-19 surge in Delhi is likely waning with the absolute number of cases declining along with the positivity rate; lower number of cases with high positivity rate suggests inadequate te… [+1647 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pavneet Singh Chadha", "title": "VHP Haryana releases helpline for Hindu community; will help people to procure arms licences for self defence, lodge FIRs", "description": "VHP Haryana members said that in light of recent incidents such as the murder of a tailor, Kanhaiya Lal, in Udaipur and the rising ‘religious fundamentalism of jihadist forces’, it was imperative to release a helpline to help the Hindu community.", "url": "https://indianexpress.com/article/delhi/vhp-haryana-releases-helpline-for-hindu-community-will-help-people-to-procure-arms-licences-for-self-defence-lodge-first-8018622/", "urlToImage": "https://images.indianexpress.com/2022/07/Gurgaon-protest-2.jpg", "publishedAt": "2022-07-09T05:38:18Z", "content": "Vishva Hindu Parishad (VHP) Haryana has announced a helpline number to provide assistance to the Hindu community to fight against the heretic and anti-national forces. The helpline number was release… [+2676 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Final whistle podu?: Is it over between CSK and Ravindra Jadeja?", "description": "Ravindra Jadeja relinquished the Chennai Super Kings captaincy midway in the IPL 2022 to focus on his game.", "url": "https://indianexpress.com/article/sports/cricket/final-whistle-podu-is-it-over-between-csk-and-ravindra-jadeja-8018608/", "urlToImage": "https://images.indianexpress.com/2022/04/MS-Dhoni-and-Ravindra-Jadeja.jpg", "publishedAt": "2022-07-09T05:34:48Z", "content": "Ravindra Jadeja, who was removed as Chennai Super Kings skipper in the mid season of the Indian Premier League (IPL) 2022, removed all posts related to the team from his official Instagram account, s… [+2591 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Twitter has legal edge in deal dispute with Musk", "description": "Musk's main claim against Twitter is that the San Francisco-based company breached their deal because it will not share with him enough information to back up its claim that spam or fake accounts constitute less than 5% of its active users.", "url": "https://indianexpress.com/article/technology/social/twitter-has-legal-edge-in-deal-dispute-with-musk-8018600/", "urlToImage": "https://images.indianexpress.com/2022/07/Elon-Musk-twitter-reuters-1.jpg", "publishedAt": "2022-07-09T05:33:07Z", "content": "Twitter Inc has a strong legal case against Elon Musk walking away from his $44 billion deal to acquire the U.S. social media company but could opt for a renegotiation or settlement instead of a long… [+4466 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Explained: What’s behind North Macedonia’s long road to the European Union?", "description": "The most recent obstacle is a veto by EU member Bulgaria. A French proposal for a compromise to address Bulgaria’s concerns has divided North Macedonia, sparking the sometimes violent protests.", "url": "https://indianexpress.com/article/explained/north-macedonia-european-union-protests-8018590/", "urlToImage": "https://images.indianexpress.com/2022/07/Explained-main.jpg", "publishedAt": "2022-07-09T05:33:04Z", "content": "Nightly protests in North Macedonia over the past week have left dozens injured. At the heart of the turmoil is the small Balkan countrys long-running quest to join the European Union, a process that… [+6143 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Careers Desk", "title": "Intelligence Bureau Recruitment 2022: Applications invited for 766 officer posts", "description": "A total of 766 vacancies are notified for the recruitment which will be filled on a deputation basis with a minimum tenure lasting three to five years.", "url": "https://indianexpress.com/article/jobs/intelligence-bureau-recruitment-2022-applications-invited-766-posts-sarkari-naukri-mha-gov-in-8018587/", "urlToImage": "https://images.indianexpress.com/2022/07/pexels-startup-stock-photos-7112-1-1.jpg", "publishedAt": "2022-07-09T05:29:17Z", "content": "The Intelligence Bureau, Ministry of Home Affairs is inviting applications for the posts of Assistant Central Intelligence Officer (ACIO), Security Assistant (SA), and Junior Intelligence Officer (JI… [+1083 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Man arrested in Singapore for threatening PM Lee on social media, following assassination of Shinzo Abe", "description": "After investigations, police were able to establish the identity of the Facebook user who incited violence against the Singapore Prime Minister.", "url": "https://indianexpress.com/article/world/singapore-man-arrested-pm-lee-social-media-threats-8018516/", "urlToImage": "https://images.indianexpress.com/2022/07/singapore-police.jpg", "publishedAt": "2022-07-09T05:22:35Z", "content": "Authorities in Singapore have arrested a 45-year-old man for inciting violence by posting a comment on Facebook against Prime Minister Lee Hsien Loong, media reports said on Saturday.The threat was f… [+1179 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "US, Chinese foreign ministers hold first in person talks since October", "description": "US officials say Blinken's meeting with Wang in Bali, Indonesia, including a morning session of talks and a working lunch, is aimed at keeping the difficult US relationship with China stable and preventing it from veering inadvertently into conflict.", "url": "https://indianexpress.com/article/world/us-china-blinken-china-meet-g20-summit-8018565/", "urlToImage": "https://images.indianexpress.com/2022/07/us-china.jpg", "publishedAt": "2022-07-09T05:18:06Z", "content": "US Secretary of State Antony Blinken and China’s Foreign Minister Wang Yi met on Saturday for the first in-person talks since October after attending a G20 summit where the top US diplomat led effort… [+3377 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Raqesh Bapat pens a befitting reply for trolls amid Shamita Shetty breakup rumours: ‘Can we change our self-talk?’", "description": "Raqesh Bapat appeared to hit back at trolls after being asked repeatedly about his rumoured breakup with Shamita Shetty.", "url": "https://indianexpress.com/article/entertainment/television/raqesh-bapat-pens-a-befitting-reply-for-trolls-says-can-we-change-our-self-talk-8018486/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-9-2.jpg", "publishedAt": "2022-07-09T05:18:04Z", "content": "Former Bigg Boss 15 contestant Raqesh Bapat took to Instagram and seemingly responded to trolls questioning him about his personal life. It is rumored that Shamita Shetty and Raqesh Bapat, who starte… [+1485 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Amarnath cloudburst: J & K administration sets up helpline numbers; Check out the full list", "description": "The victims were camping near the Amarnath cave shrine, when the cloudburst occurred around 6 pm Friday. The flash flood washed away a part of the camp.", "url": "https://indianexpress.com/article/india/amarnath-cloudburst-helpline-numbers-8018518/", "urlToImage": "https://images.indianexpress.com/2022/07/Amarnath-3.jpg", "publishedAt": "2022-07-09T05:15:47Z", "content": "The victims were camping near the Amarnath cave shrine, when the cloudburst occurred around 6 pm Friday. The flash flood washed away a part of the camp. At least 15,000 pilgrims, who were stranded ne… [+1199 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Canada: Outage leaves many without mobile, internet service", "description": "The outage began early in the morning and stretched into the evening, interrupting services across retailers and credit card processors, police and courts, airlines and train networks.", "url": "https://indianexpress.com/article/world/canada-outage-leaves-many-without-mobile-internet-service-8018502/", "urlToImage": "https://images.indianexpress.com/2022/07/1000.jpeg", "publishedAt": "2022-07-09T05:13:27Z", "content": "A widespread network outage left many Canadians without mobile and internet service for most of Friday, disrupting police, business and court services as crowds flocked to work at coffee shops with W… [+4951 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Women’s Euro 2022 set to surpass overall attendance for 2005 on day four", "description": "In four matches, the tournament has crossed an attendance of 100,000. UEFA had stated that more than 500,000 of the 700,000 tickets for the competition had been sold before the opening match.", "url": "https://indianexpress.com/article/sports/football/womens-euro-2022-set-to-surpass-the-overall-attendance-for-euro-2005-in-england-on-day-four-8018559/", "urlToImage": "https://images.indianexpress.com/2022/07/Womens-Euro-2022.jpg", "publishedAt": "2022-07-09T05:10:57Z", "content": "The 2022 edition of UEFA Women’s Euro is set to break another attendance record going into the fourth day of the tournament. The competition has already garnered attracted 100,000 people in the stand… [+1525 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "মুর্মু হাতিয়ারেই বিজেপির বাজিমাত, ভেঙে চুরমার বিরোধী ঐক্য", "description": "তীব্র বিজেপি বিরোধী তৃণমূল সুপ্রিমো মমতা বন্দ্যোপাধ্যায় এক সপ্তাহ আগে দ্রৌপদীর জয়ের কথা বলেছিলেন।", "url": "https://bengali.indianexpress.com/politics/national/crack-in-uttar-pradesh-opposition-ranks-as-rajbhar-attends-yogi-dinner-for-murmu-467062/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/droupadi-murmu-bjp-opposition-split.jpg", "publishedAt": "2022-07-09T05:06:26Z", "content": ", \r\n - \r\n , - , \r\n “ ” , “ ”\r\n “ , ”\r\n , “ , ”\r\n -\r\n , - \r\n - , - , “ , ”\r\nStay updated with the latest news headlines and all the latest National news download Indian Express Bengali App.\r\nWeb Title… [+81 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "নয়া প্রজাতিতেই ওঁত পেতে রয়েছে বিপদ? দেশে একদিনে আরও বাড়ল সংক্রমণ-মৃত্যু!", "description": "গত ২৪ ঘণ্টায় নতুন করে করোনা আক্রান্ত হয়েছেন ১৮ হাজার ৮৪০ জন।", "url": "https://bengali.indianexpress.com/general-news/india-reports-18840-fresh-covid-19-cases-43-deaths-467060/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/02/Covid-19-1.jpg", "publishedAt": "2022-07-09T05:01:38Z", "content": ",   , \r\n ,,\r\n . , , \r\n, ,   .   \r\n : [ , ]\r\n - \r\n , - BA.2.75- \r\n : [ , ]\r\n , , ( ) ( ) . \r\n ,, . , ,, ,, \r\nStay updated with the latest news headlines and all the latest General news download Indian… [+83 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "FIFA, Qatar prepare beer policy for soccer fans at World Cup", "description": "FIFA and Qatari organizers are still working on plans to serve all fans who want to drink at games when the tournament starts in November in the Muslim-majority country.", "url": "https://indianexpress.com/article/sports/football/fifa-qatar-prepare-beer-policy-for-soccer-fans-at-world-cup-fifa-2022-fifa-world-cup-qatar-budweiser-zero-anheuser-busch-8018522/", "urlToImage": "https://images.indianexpress.com/2020/10/qatar-2022-world-cup.jpg", "publishedAt": "2022-07-09T05:00:13Z", "content": "Beer with alcohol is expected to be sold at World Cup stadiums in Qatar but fans may be allowed to take only non-alcoholic drinks to their seats. FIFA and Qatari organizers are still working on plans… [+2299 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuradha Mascarenhas", "title": "Know Your City: Behind Pune’s renowned eye hospital, the unfulfilled dream of a father", "description": "A freak accident altered Dr Bhaskar Kelkar’s plans to go to London and pursue a diploma in ophthalmology. But his son, Dr Shreekant, kept his dream alive by becoming an eye surgeon and setting up the National Institute of Ophthalmology.", "url": "https://indianexpress.com/article/cities/pune/pune-know-your-city-national-institute-of-ophthalmology-8018495/", "urlToImage": "https://images.indianexpress.com/2022/07/nio-inaugration.jpg", "publishedAt": "2022-07-09T04:58:41Z", "content": "For 80-year-old Dr Shreekant Kelkar, founder-director of National Institute of Ophthalmology (NIO), preserving and restoring his father Dr Bhaskar Kelkars 101-year-old passport has been a labour of l… [+5445 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gujarat this week: Prayer meet for Shinzo Abe; Storytime for adults", "description": "From a prayer meet for former Japan PM Shinzo Abe, to story time for adults -- here's what's happening in Gujarat this week.", "url": "https://indianexpress.com/article/cities/ahmedabad/gujarat-this-week-shinzo-abe-storytime-for-adults-8018490/", "urlToImage": "https://images.indianexpress.com/2022/07/Gujarat-this-week-collage.png", "publishedAt": "2022-07-09T04:53:17Z", "content": "Here’s what’s happening in Gujarat this week, between July 9 and July 16.Ciné Club- France (in French)\r\nAbout the event: Screening of the 2021-release ‘France’ starrring Lea Seydoux as France de Meur… [+3006 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "Explained: জনসনের ইস্তফা এক রোমহর্ষক কাহিনি,কাহিনিতে রয়েছে বিড়াল-দর্শনও, কী ভাবে?", "description": "কী ভাবে এল শেষ ধাক্কাটা?", "url": "https://bengali.indianexpress.com/explained/boris-johnson-has-finally-resigned-why-467056/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/cats-39.jpg", "publishedAt": "2022-07-09T04:52:20Z", "content": ", , , - ‘ , , , , ’ , \r\n ?( .) , , , , , !\r\n- , , , , , – - , , - - , !\r\n, , , , , - , , ‘ () , ’ , , , !- , ,"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "4-goal wins for Germany, Spain women in Euros openers", "description": "Germany and Spain enjoyed four-goal wins in their opening matches at the Women's European Championship on Friday ahead of their group clash.", "url": "https://indianexpress.com/article/sports/football/4-goal-wins-for-germany-spain-women-in-euros-openers-irene-paredes-lina-magull-lea-schuller-lena-lattwein-alexandra-popp-womens-european-championship-8018489/", "urlToImage": "https://images.indianexpress.com/2022/07/Spain_football_1200x667.jpeg", "publishedAt": "2022-07-09T04:51:19Z", "content": "Germany and Spain enjoyed four-goal wins in their opening matches at the Women’s European Championship on Friday ahead of their group clash. Lina Magull, Lea Schüller, Lena Lattwein and Alexandra Pop… [+2920 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Healthy eating: Try this quick and easy weight loss tikki recipe for breakfast today", "description": "Dietitian Natasha Mohan shared a quick and easy recipe of tikki (patty) on her Instagram account which is less than 100 calories.", "url": "https://indianexpress.com/article/lifestyle/food-wine/try-this-quick-and-easy-weight-loss-tikki-recipe-7993597/", "urlToImage": "https://images.indianexpress.com/2022/07/tikki_1200_getty.jpg", "publishedAt": "2022-07-09T04:50:44Z", "content": "Who does not love to sip on a cup of hot piping tea while it is raining and what better than pairing it with crispy fritters or tikkis? However, many resist the temptation due to the excess oil and m… [+1736 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Shinzo Abe’s assassination was hard to fathom because it involved a gun — a rare type of crime in Japan", "description": "Gun violence is almost unheard-of in Japan. There was only one firearm-related death in all of 2021. Since 2017, there have been 14 gun-related deaths, a remarkably low figure for a country of 125 million people.", "url": "https://indianexpress.com/article/world/shinzo-abes-assassination-hard-to-fathom-rare-crime-japan-8018450/", "urlToImage": "https://images.indianexpress.com/2022/07/shinzo-abe-1200-1.jpg", "publishedAt": "2022-07-09T04:49:37Z", "content": "The assassination of former Prime Minister Shinzo Abe during a campaign rally in western Japan was especially hard to fathom because it involved a gun a type of crime that is extremely rare in a coun… [+5624 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shamik Chakrabarty", "title": "Like Guardiola hated the term tiki-taka, McCullum finds Bazball silly", "description": "England's ultra-attacking cricket has captured the imagination of fans, but coach McCullum finds Bazball, a term coined by the British media silly.", "url": "https://indianexpress.com/article/sports/cricket/like-guardiola-hated-the-term-tiki-taka-mccullum-finds-bazball-silly-8018494/", "urlToImage": "https://images.indianexpress.com/2022/07/McCullum-Guardiola.jpg", "publishedAt": "2022-07-09T04:48:15Z", "content": "Pep Guardiola loathed the term tiki-taka. Brendon McCullum has called Bazball silly.The football analogy is not off the mark, for tiki-taka, a coinage of Guardiolas passing game from the Spanish medi… [+3015 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Even in death, Internet Explorer lives on in South Korea", "description": "South Korea’s fealty to Internet Explorer, 27 years after its introduction and now into its retirement, presents a heavy dose of irony.", "url": "https://indianexpress.com/article/technology/tech-news-technology/even-in-death-internet-explorer-lives-on-in-south-korea-8018491/", "urlToImage": "https://images.indianexpress.com/2022/07/Internet-Explorer-New-York-Times.jpg", "publishedAt": "2022-07-09T04:46:01Z", "content": "In South Korea, one of the worlds most technologically advanced countries, there are few limits to what can be done conveniently online except if you are using the wrong web browser.\r\nOn Google Chrom… [+6130 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Vladimir Putin says Russia just starting in Ukraine, peace talks will get harder", "description": "Russia accuses the West of waging a proxy war against it by hammering its economy with sanctions and stepping up the supply of advanced weapons to Ukraine.", "url": "https://indianexpress.com/article/world/vladimir-putin-russia-ukraine-peace-talks-will-get-harder-8018472/", "urlToImage": "https://images.indianexpress.com/2022/07/putin-military.jpg", "publishedAt": "2022-07-09T04:43:52Z", "content": "President Vladimir Putin said on Thursday that Russia had barely got started in Ukraine and dared the West to try to defeat it on the battlefield, while insisting that Moscow was still open to the id… [+2886 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Russia’s Sergey Lavrov is pariah at Group of 20 event, but only for some", "description": "Russia’s foreign minister, Sergey Lavrov, attended a meeting of finance ministers from the Group of 20 industrialized nations in Bali on Friday, despite his country’s pariah status in Europe and elsewhere over its brutal war in Ukraine.", "url": "https://indianexpress.com/article/world/russia-sergey-lavrov-g20-event-8018471/", "urlToImage": "https://images.indianexpress.com/2022/07/AP22189242796882.jpg", "publishedAt": "2022-07-09T04:43:13Z", "content": "He was like a skunk at the tropical resort party, shunned by many, though by no means all.\r\nRussias foreign minister, Sergey Lavrov, attended a meeting of finance ministers from the Group of 20 indus… [+5699 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Careers Desk", "title": "SSC Constable recruitment 2022: Application process begins, check eligibility criteria", "description": "SSC Constable recruitment 2022: The last date for submission of applications is July 29 till 11 pm and the deadline for fee submission is July 30 till 11 pm.", "url": "https://indianexpress.com/article/jobs/ssc-constable-recruitment-2022-application-process-begins-check-eligibility-criteria-sarkari-naukri-ssc-nic-in-8018492/", "urlToImage": "https://images.indianexpress.com/2022/07/ch1556838-1.jpg", "publishedAt": "2022-07-09T04:37:36Z", "content": "SSC Constable recruitment 2022: The Staff Selection Commission (SSC) begins the application process for the recruitment of Constable (Driver) male, Head Constable {Assistant Wireless Operator (AWO)/T… [+1650 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Debraj Deb", "title": "Is BJP ‘maalik’? Ex-Arunachal MP calls out Congress ‘lack of fight’", "description": "Is BJP 'maalik'? Ex-Arunachal MP calls out Congress 'lack of fight'", "url": "https://indianexpress.com/article/political-pulse/arunchal-pradesh-panchayat-polls-bjp-takram-sanjoy-8018478/", "urlToImage": "https://images.indianexpress.com/2022/07/Arunachal-.jpg", "publishedAt": "2022-07-09T04:30:13Z", "content": "A further 14 seats were won without contest by either the National Peoples’ Party (NPP), which is an ally of the BJP, or the Congress, and Independent candidates. Only 14 gram panchayat seats, apart … [+2382 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Rain expected in Delhi today", "description": "The maximum temperature is likely to be around 38 degree Celsius at the Safdarjung weather observatory, which acts as a marker for the city.", "url": "https://indianexpress.com/article/cities/delhi/rain-delhi-today-weather-traffic-8018476/", "urlToImage": "https://images.indianexpress.com/2022/07/Delhi-Rain.jpeg", "publishedAt": "2022-07-09T04:29:02Z", "content": "Delhi is likely to receive light to moderate rainfall or thundershowers on Saturday, the India Meteorological Department (IMD) predicted.The maximum temperature is likely to be around 38 degree Celsi… [+1103 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Bloomberg", "title": "The fight between Musk and Twitter will come down to three words", "description": "“Material Adverse Effect” was cited by Musk’s lawyers in a regulatory filing Friday which argued that undisclosed information about bots on the social media platform is “fundamental to Twitter’s business and financial performance.”", "url": "https://indianexpress.com/article/technology/social/the-fight-between-musk-and-twitter-will-come-down-to-three-words-8018480/", "urlToImage": "https://images.indianexpress.com/2022/07/Elon-Musk-Twitter-COllage.jpg", "publishedAt": "2022-07-09T04:28:40Z", "content": "Elon Musks attempt to walk away from his $44 billion Twitter Inc. buyout will turn on a three-word phrase thats sometimes asserted in busted mergers — but rarely passes muster with judges.Material Ad… [+1146 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Amarnath cloudburst: Toll rises to 15; yatra temporarily suspended", "description": "The cloudburst occurred around 6 pm on Friday, and the flash flood washed away a part of the camp with officials estimating that at least 25 tents were hit.", "url": "https://indianexpress.com/article/india/amarnath-cloudburst-rescue-operation-casualties-8018434/", "urlToImage": "https://images.indianexpress.com/2022/07/amarnath-rescue-operation.jpg", "publishedAt": "2022-07-09T04:26:25Z", "content": "At least 15 people have died in the flash flood triggered by a cloudburst in Jammu and Kashmir’s Ganderbal district, news agency ANI reported Saturday. The victims were camping near the Amarnath cave… [+2769 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Amitabh Bachchan calls son Abhishek Bachchan his ‘ultimate pride and joy’, hypes teaser of Aishwarya Rai Bachchan’s PS1", "description": "The Bachchan family is full of praise for each other. In a new post, Amitabh Bachchan penned a heartfelt note for son Abhishek, and in another post, shared the teaser for Aishwarya Rai Bachchan's PS1.", "url": "https://indianexpress.com/article/entertainment/amitabh-bachchan-calls-son-abhishek-his-uttaraadhikaari-shares-the-teaser-of-aishwarya-rai-bachchan-ps1-8018409/", "urlToImage": "https://images.indianexpress.com/2022/05/Bachchans-75-Cannes.jpg", "publishedAt": "2022-07-09T04:24:51Z", "content": "It’s raining films and projects for the Bachchans and amid all this, the entire family has come out in support of one another. The father-son duoAmitabh and Abhishek Bachchanshare a close relationshi… [+1680 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Sopranos actor Tony Sirico dies at 79, co-actors Steven Van Zandt, Michael Imperioli pay tribute", "description": "Tony Sirico died at an assisted living facility in Fort Lauderdale, Florida, said his manager, Bob McGowen. There was no immediate information on the cause of death.", "url": "https://indianexpress.com/article/entertainment/television/sopranos-actor-tony-sirico-dies-co-actors-steven-van-zandt-michael-imperioli-pay-tribute-8018462/", "urlToImage": "https://images.indianexpress.com/2022/07/sopranos-actor-.jpg", "publishedAt": "2022-07-09T04:20:55Z", "content": "Tony Sirico, who played the impeccably groomed mobster Paulie Walnuts in The Sopranos and brought his tough-guy swagger to films including Goodfellas, died Friday. He was 79.Sirico died at an assiste… [+2814 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "মুহূর্তেই নদীতে তলিয়ে গেল যাত্রীবোঝাই গাড়ি, দমবন্ধ হয়ে মৃত ৯", "description": "প্রশাসনের তরফে জানানো হয়েছে নিহতদের মধ্যে অধিকাংশই পাঞ্জাবের বাসিন্দা।", "url": "https://bengali.indianexpress.com/general-news/four-from-punjab-among-9-dead-as-taxi-falls-into-river-467050/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/02/Dead-Body.jpg", "publishedAt": "2022-07-09T04:15:21Z", "content": "! \r\n     ,   \r\n : [ , , ]\r\n (), (), () () () (), (), \r\n , \r\nStay updated with the latest news headlines and all the latest General news download Indian Express Bengali App.\r\nWeb Title: Four from punj… [+39 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Twitter workers brace for more ‘circus’ after Elon Musk torpedoes deal", "description": "Musk said Twitter breached multiple provisions of a $44 billion merger agreement struck in April, including by failing to turn over sufficient data on spam accounts and letting go of some executives and recruiters.", "url": "https://indianexpress.com/article/technology/twitter-workers-brace-elon-musk-deal-8017774/", "urlToImage": "https://images.indianexpress.com/2022/06/Elon-Musk-meeting-Twitter-employees.jpg", "publishedAt": "2022-07-09T04:14:17Z", "content": "Twitter Inc employees expressed disbelief and exhaustion on Friday after billionaire entrepreneur Elon Musk said he was terminating a deal to buy the social media company in what could be the start o… [+2980 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Telangana weather: IMD issues red warning for Saturday, Sunday as rain batters state", "description": "Due to incessant rains, rivers are in full spate and reservoirs are filling up fast. Authorities have opened the spillways of Sri Ram Sagar and Kaddam reservoirs in the Godavari basin.", "url": "https://indianexpress.com/article/cities/hyderabad/telangana-imd-issues-red-warning-for-saturday-sunday-as-rain-monsoon-8018402/", "urlToImage": "https://images.indianexpress.com/2022/07/telangana-rains.jpg", "publishedAt": "2022-07-09T04:13:25Z", "content": "Several parts of Telangana were battered by heavy rains on Friday as the India Meteorological Department (IMD) issued a red warning in several parts of the state for Saturday and Sunday.As of 8.30 am… [+2315 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pune: Six people rescued after part of building collapses", "description": "Pune Fire Brigade officials said that they received a call at 7.20 am about the collapse of a part of Karande Wada located near Nehru Chowk at Shukrawar Peth in central Pune and that some residents were trapped on the upper floors of the three-storey structur…", "url": "https://indianexpress.com/article/cities/pune/pune-people-rescued-part-building-collapses-8018415/", "urlToImage": "https://images.indianexpress.com/2022/07/PHOTO-2022-07-09-08-32-07.jpg", "publishedAt": "2022-07-09T04:11:16Z", "content": "Six residents of a dilapidated wada a cluster of houses located in Shukrawar Peth area of Pune were rescued on Saturday morning by the fire brigade personnel after a portion of their house collapsed."}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "‘Hope to see you next year’: Rafael Nadal bids farewell to Wimbledon staff after his withdrawal due to abdominal injury", "description": "Rafael Nadal was forced to withdraw from his Wimbledon semifinal due to the abdominal injury he sustained in the quarterfinal.", "url": "https://indianexpress.com/article/sports/tennis/hope-to-see-you-next-year-rafael-nadal-bids-farewell-to-wimbledon-staff-after-his-withdrawal-due-to-abdominal-injury-8018455/", "urlToImage": "https://images.indianexpress.com/2022/07/Rafael-nadal.jpg", "publishedAt": "2022-07-09T04:07:02Z", "content": "Rafael Nadal, who was forced to retire from the event after suffering an abdominal tear during his five-set win over Taylor Fritz in the quarterfinal bids farewell to the Wimbledon staff. In a video … [+1466 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Alaka Sahani", "title": "Koffee with Karan Season 7 Episode 1 review: Alia Bhatt, Ranveer Singh squeeze in some genuine moments between gossip, innuendos, puns", "description": "Koffee with Karan 7 premiere episode: Ranveer Singh exhibited his boundless energy and whacky sense of humour, while Alia Bhatt shared aww-inducing tales about married life.", "url": "https://indianexpress.com/article/entertainment/web-series/koffee-with-karan-season-7-episode-1-review-alia-bhatt-ranveer-singh-8018441/", "urlToImage": "https://images.indianexpress.com/2022/07/kwk1200.jpg", "publishedAt": "2022-07-09T04:05:56Z", "content": "For a show as irreverent and voyeuristic as Koffee With Karan, stepping into Season 7 must have come with its set of challenges to keep the audience engrossed. That, however, was not the only concern… [+2591 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "US President Biden, Japan Prime Minister Kishida hold phone talks after Abe’s assassination", "description": "Joe Biden, who is dealing with mass shootings in the US, also said “gun violence always leaves a deep scar on the communities that are affected by it.”", "url": "https://indianexpress.com/article/world/shinzo-abe-death-biden-kishida-phone-call-8018440/", "urlToImage": "https://images.indianexpress.com/2022/07/biden-1200.jpg", "publishedAt": "2022-07-09T03:57:41Z", "content": "US President Joe Biden had a telephonic conversation with Prime Minister Fumio Kishida of Japan and discussed how Abe Shinzo’s legacy will live on as they continue the important task of defending pea… [+2292 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "ক্যানিংয়ের ৩ তৃণমূল নেতা হত্যায় কুলতলি থেকে প্রথম গ্রেফতার, রফিকুল এখনও অধরা", "description": "পুলিশ শূত্রে খবর, এই খুনের ঘটনায় এফআইআরে নাম থাকা বসিরউদ্দিনের দাদা ধৃত আফতাবউদ্দিন।", "url": "https://bengali.indianexpress.com/west-bengal/canning-triple-murder-case-police-arrested-a-person-from-kultali-467038/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/canning-triple-murder-case-arrest.jpg", "publishedAt": "2022-07-09T03:57:35Z", "content": "Stay updated with the latest news headlines and all the latest Westbengal news download Indian Express Bengali App.\r\nWeb Title: Canning triple murder case police arrested a person from kultali"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Eagle-eyed fans identify Hrithik Roshan through his ring in Saba Azad’s new video from France. Watch here", "description": "Hrithik Roshan and Saba Azad are enjoying their vacation in France. Saba has been sharing glimpses of their trip on social media.", "url": "https://indianexpress.com/article/entertainment/bollywood/hrithik-roshan-saba-azad-enjoy-picturesque-france-on-wheels-watch-8018437/", "urlToImage": "https://images.indianexpress.com/2022/03/hrithik-saba-1200.jpg", "publishedAt": "2022-07-09T03:57:31Z", "content": "Actor Hrithik Roshan is on a vacation in France with his girlfriend Saba Azad. The duo recently took a road trip to an undisclosed location. A video of them enjoying the scenic beauty of France was s… [+1631 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Khuda Haafiz Chapter 2 box office collection day 1: Vidyut Jammwal-starrer opens on the same level as Aditya Roy Kapur’s Om", "description": "Khuda Haafiz Chapter 2 Agni Pariksha box office collection day 1: Vidyut Jammwal's action sequel has opened to low numbers, as Thor Love and Thunder dominates the marketplace.", "url": "https://indianexpress.com/article/entertainment/bollywood/khuda-haafiz-chapter-2-agni-pariksha-box-office-collection-day-1-vidyut-jammwal-action-film-8018422/", "urlToImage": "https://images.indianexpress.com/2022/07/khuda-haafiz-2-1200.jpeg", "publishedAt": "2022-07-09T03:53:53Z", "content": "Vidyut Jammwal-starrer Khuda Haafiz: Chapter II Agni Pariksha has opened low at the box office. It collected around Rs 1.5 crore on its first day of release, according to a Pinkvilla report. The numb… [+1288 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Monsoon news Live Updates: IMD issues red alert in Pune; parts of North Maharashtra witness drought", "description": "Monsoon in India Live Updates: Meanwhile, parts of Maharastra record incessant rain and flooding, and districts in north Maharashtra see an increase in drought-prone areas.", "url": "https://indianexpress.com/article/india/monsoon-news-live-updates-imd-issues-red-alert-in-pune-parts-of-north-maharashtra-witness-drought-8018360/", "urlToImage": "https://images.indianexpress.com/2022/07/Mumbai-rain-1-1-1.jpg", "publishedAt": "2022-07-09T03:48:04Z", "content": "While an orange alert asks the authorities to be prepared, a red alert is a warning and a call to take action. (File)Monsoon, Weather Updates Today: The India Meteorological Department (IMD) issued a… [+835 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Monsoon news Live Updates: IMD issues red alert in Pune; 16 dead in Amarnath cloudburst", "description": "Monsoon in India Live Updates: At least 16 people have died in the flash flood triggered by a cloudburst in Jammu and Kashmir’s Ganderbal district.", "url": "https://indianexpress.com/article/india/monsoon-news-live-updates-imd-issues-red-alert-in-pune-amarnath-yatra-cloud-burst-death-toll-16-jammu-kashmir-8018360/", "urlToImage": "https://images.indianexpress.com/2022/07/Mumbai-rain-1-1-1.jpg", "publishedAt": "2022-07-09T03:48:04Z", "content": "Rainfall remains on the forecast for Delhi from July 11 to 14. (Express photo by Prem Nath Pandey)\r\nAfter IMDs red alert, Mumbai sees a dry Friday  \r\nThe IMD, in its district forecast, withdrew the r… [+560 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "স্কুল চলাকালীন গাছ উপরে পড়ে নিহত ১, আহত বহু! এলাকায় শোকের ছায়া", "description": "এই ঘটনার ম্যাজিস্ট্রেট পর্যায়ের তদন্তের নির্দেশ দিয়েছে রাজ্য সরকার!", "url": "https://bengali.indianexpress.com/general-news/student-killed-another-loses-arm-as-250-yr-old-tree-falls-on-them467030/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/cats-38.jpg", "publishedAt": "2022-07-09T03:45:28Z", "content": ", , \r\n , , , \r\n : [ , , ]\r\n , “ ”\r\n ,   - , ,”\r\nStay updated with the latest news headlines and all the latest General news download Indian Express Bengali App.\r\nWeb Title: Student killed another los… [+44 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Nick Jonas says daughter Malti is doing ‘amazing’; Priyanka Chopra takes her on an outing", "description": "\"It is certainly life-changing,\" the singer was quoted as saying about fatherhood", "url": "https://indianexpress.com/article/lifestyle/life-style/nick-jonas-daughter-malti-priyanka-chopra-outing-parethood-8017126/", "urlToImage": "https://images.indianexpress.com/2022/07/Priyanka-Nick-Malti-1200.jpg", "publishedAt": "2022-07-09T03:40:43Z", "content": "Buy Now | Our best subscription plan now has a special price\r\nBut, all that is in the past now, for the little one seems to be doing much well, and is healthier, and dad Nick Jonas has confirmed it.\r… [+1447 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Nitin Sharma", "title": "16-year-old Nazrin makes smooth transition from football goal to badminton court", "description": "The 16-year-old from Kerala completed a 15-4, 15-9 win over Pratishtha Rana of Rajasthan to move into the third qualification round of the U-19 category in the 29th Yonex-Sunrise Smt Krishna Khaitan Memorial All India Junior Ranking Selection Tournament", "url": "https://indianexpress.com/article/sports/badminton/16-year-old-nazrin-makes-smooth-transition-from-football-goal-to-badminton-court-8018421/", "urlToImage": "https://images.indianexpress.com/2022/07/Nazrin-Farza.jpg", "publishedAt": "2022-07-09T03:37:22Z", "content": "As a child, Nazrin Farza would often listen to her father Rafeek Mohammad about his days as a goalkeeper for Mohammedan Sporting FC and later Reserve Bank of India. Rafeek, who played in the 2003 Fed… [+3394 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sandeep Dwivedi", "title": "Can coach Dravid of 2022 World T20 learn from captain Dravid of 2007 World Cup?", "description": "Weekly Sports Newsletter: Dravid-Rohit are dealing with the same pre-World Cup dilemma as Dravid-Chappell did in 2007. India are again top-heavy and there are more than one ‘slow coach’ seniors with strike rate issues.", "url": "https://indianexpress.com/article/sports/cricket/weekly-sports-newsletter-can-coach-dravid-of-2022-world-t20-learn-from-captain-dravid-of-2007-world-cup-8018374/", "urlToImage": "https://images.indianexpress.com/2022/06/Untitled-design-14-2.jpg", "publishedAt": "2022-07-09T03:31:08Z", "content": "An unsettled team, question marks over senior players and an ICC event round the corner. Rahul Dravid has walked this maze before – first as captain before the 2007 World Cup and now as coach of the … [+7822 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Gopal Kateshiya", "title": "In rare sighting, three Indian skimmers spotted in Nal Sarovar sanctuary", "description": "The veteran birder, who has spent years in Dehradun, not only could watch the three Indian skimmers but also managed  to photograph them.", "url": "https://indianexpress.com/article/cities/ahmedabad/in-rare-sighting-three-indian-skimmers-spotted-in-nal-sarovar-sanctuary-8018407/", "urlToImage": "https://images.indianexpress.com/2022/07/1657185221635.jpg", "publishedAt": "2022-07-09T03:25:08Z", "content": "Three Indian skimmers, an endangered bird species on the International Union for Conservation of Nature (IUCN) list, were spotted in Nal Sarovar Bird Sanctuary (NSBL)the famous wetland near Ahmedabad… [+3390 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Coronavirus India News Live Updates: Delhi records 531 fresh Covid-19 cases, three deaths", "description": "Coronavirus India, Covid-19 Live News Updates, July 09, 2022:", "url": "https://indianexpress.com/article/lifestyle/health/coronavirus-india-news-live-covid-cases-today-delhi-mumbai-8018388/", "urlToImage": "https://images.indianexpress.com/2022/07/NL-CovidTest-3cols.jpeg", "publishedAt": "2022-07-09T03:22:29Z", "content": "Mumbai, on the other hand, on Friday reported 530 new coronavirus infections with a case positivity rate of 5.25 per cent and two deaths, a civic official said.Covid-19 Live News Updates: Delhi on Fr… [+1346 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "মেঘ ভাঙা বৃষ্টিতে লন্ডভন্ড অমরনাথ, মৃতের সংখ্যা ক্রমশ বাড়ছে, যাত্রা স্থগিত", "description": "আপাতত লন্ডভন্ড অবস্থা। এই পরিস্থিতিতে অমরনাথ যাত্রা সাময়িকভাবে স্থগিত রাখল প্রশাসন।", "url": "https://bengali.indianexpress.com/general-news/amarnath-camp-cloudburst-flash-flood-updates-467019/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/amarnath-1.jpg", "publishedAt": "2022-07-09T03:21:47Z", "content": "() : , \r\n , , \r\n () , - , “ ” “” \r\n “ ” - “ ”\r\n- , “ ” “ ”\r\n- , “ ” “ ”\r\n - \r\nStay updated with the latest news headlines and all the latest General news download Indian Express Bengali App.\r\nWeb Tit… [+47 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Mumbai News Live Updates: CM Eknath Shinde, Dy CM Fadnavis meet Amit Shah in Delhi, to meet PM Modi today", "description": "Mumbai News Today Live Updates, July 09, 2022: In covid-related news, a day after reporting 2,678 Covid-19 cases, Maharashtra recorded a slight increase in the daily tally with 2,944 fresh positive cases on Friday.", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-news-live-updates-eknath-shinde-covid-cases-traffic-maharashtra-rains-8018386/", "urlToImage": "https://images.indianexpress.com/2022/07/WhatsApp-Image-2022-07-08-at-11.56.51-PM-1.jpeg", "publishedAt": "2022-07-09T03:20:49Z", "content": "Despite the ongoing surge in Covid-19 cases in the state only 34.5 per cent of the eligible population above 60 years have taken the precautionary dose or the third dose. The response to the door-to-… [+954 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Alia Bhatt reveals Heart of Stone look in new picture with ‘beautiful Gal Gadot’, says she’s rushing back home to ‘baby’ Ranbir Kapoor", "description": "Alia Bhatt has wrapped work on her debut Hollywood project Heart of Stone, earning huge compliments from her co-star Gal Gadot.", "url": "https://indianexpress.com/article/entertainment/hollywood/alia-bhatt-heart-of-stone-gal-gadot-picture-8018391/", "urlToImage": "https://images.indianexpress.com/2022/07/alia-bhatt-gal-gadot-heart-of-stone.jpg", "publishedAt": "2022-07-09T03:18:05Z", "content": "Alia Bhatt announced the wrap on her debut Hollywood film, Heart of Stone, with a bunch of set pictures on Friday. Alia will star in the Netflix film alongside Gal Gadot and Jamie Dornan.Sharing pict… [+1656 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "After meeting with Amit Shah, Maharashtra CM Eknath Shinde, Devendra Fadanavis to meet PM Modi today", "description": "Although the meetings are being termed as courtesy calls, sources in BJP informed that Shinde and Fadnavis were seeking approvals for a Cabinet expansion which is likely to happen soon.", "url": "https://indianexpress.com/article/cities/mumbai/amit-shah-maharashtra-cm-eknath-shinde-devendra-fadanavis-pm-modi-meet-8018399/", "urlToImage": "https://images.indianexpress.com/2022/07/Shinde-6.jpg", "publishedAt": "2022-07-09T03:13:22Z", "content": "Days after clearing the floor test to prove their governments majority Maharashtra Chief Minister Eknath Shinde and Deputy CM Devendra Fadnavis travelled to New Delhi on Friday for a meeting with Uni… [+1366 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Uttarakhand: Four from Punjab among 9 dead as taxi falls into river", "description": "The accident took place around 5.45 am on Friday, when the car was washed away by strong currents of the river. Uttarakhand Chief Minister Pushkar Singh Dhami expressed his condolences.", "url": "https://indianexpress.com/article/india/uttarakhand-four-from-punjab-among-9-dead-as-taxi-falls-into-river-8018393/", "urlToImage": "https://images.indianexpress.com/2022/07/nainital.jpg", "publishedAt": "2022-07-09T03:09:21Z", "content": "Nine people died and one was rescued after their car fell into the Dhela river at Ramnagar in Uttarakhands Nainital district on Friday after a sudden increase in the water level due to early-morning … [+1441 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mumbai: Bar owner, workers arrested for hiring labour for manual scavenging", "description": "The incident took place on Wednesday 8 pm outside Topaz bar where the three men opened the drainage and one of them went inside to clean it.", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-bar-owner-workers-arrested-for-hiring-labour-for-manual-scavenging-8018392/", "urlToImage": "https://images.indianexpress.com/2022/07/arrest-10.jpg", "publishedAt": "2022-07-09T03:07:43Z", "content": "The DB Marg police arrested the owner of Topaz bar in Grant road (east) and his three employees who allegedly opened the drainage cover outside their bar to clean it thereby endangering lives includi… [+1176 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Divya Goyal", "title": "Punjab: Congress leader who left AAP ahead of polls, his aide arrested in cheating case", "description": "AAP senior leader and now finance minister Harpal Singh Cheema had then said that Banger was “arm twisted by Congress” to join their party as “he was involved in many scams related to his hospital in Moga.”", "url": "https://indianexpress.com/article/cities/ludhiana/congress-leader-aap-moda-amardeep-singh-cheating-case-abroad-8018384/", "urlToImage": "https://images.indianexpress.com/2022/07/Bangar-2col.jpg", "publishedAt": "2022-07-09T03:03:31Z", "content": "The Moga police on Friday arrested Congress leader Amardeep Singh alias Ashu Banger and his accomplice in an alleged cheating and forgery case. An FIR was registered against him, his accomplice Harde… [+2307 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Daily Briefing: PM Modi mourns the death of Japan Ex PM Shinzo Abe; cloudburst in Amarnath", "description": "Get your weekend started with the top 5 stories from today's edition", "url": "https://indianexpress.com/article/cities/daily-briefing-pm-modi-mourns-the-death-of-japan-ex-pm-shinzo-abe-cloudburst-in-amarnath-8018367/", "urlToImage": "https://images.indianexpress.com/2022/07/daily-briefing-2.jpg", "publishedAt": "2022-07-09T03:00:39Z", "content": "Get your weekend started with the top 5 stories from today’s edition: PM Modi remembers his friend Shinzo Abe; 12 killed, 25 injured in cloudburst at Amarnath camp; weekend film recommendations; and … [+5754 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rahel Philipose", "title": "Daily Briefing: PM Modi mourns the death of Japan Ex PM Shinzo Abe; cloudburst in Amarnath", "description": "Get your weekend started with the top 5 stories from today's edition", "url": "https://indianexpress.com/article/cities/top-news-briefing-today-8018367/", "urlToImage": "https://images.indianexpress.com/2022/07/daily-briefing-2.jpg", "publishedAt": "2022-07-09T03:00:39Z", "content": "Get your weekend started with the top 5 stories from today’s edition: PM Modi remembers his friend Shinzo Abe; 12 killed, 25 injured in cloudburst at Amarnath camp; weekend film recommendations; and … [+5754 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Man beaten to death in Rajasthan; daughter, who plotted killing, among 5 held", "description": "Investigation revealed that Shivani, fed up with her alcoholic father and the debt over him, conspired along with her lover to get him killed. The duo hired five people for Rs. 50,000 to do the task, police said.", "url": "https://indianexpress.com/article/cities/jaipur/man-beaten-death-rajasthan-daughter-plotted-killing-held-8018377/", "urlToImage": "https://images.indianexpress.com/2022/07/arrest-17.jpg", "publishedAt": "2022-07-09T02:59:55Z", "content": "A 47-year-old government school teacher has been beaten to death by a few assailants allegedly hired by his daughter who plotted the killing in connivance with her lover, police said on Friday.Shivan… [+1305 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Alaka Sahani", "title": "Taapsee Pannu: ‘Getting into Mithali Raj’s shoes has been the toughest role of my career’", "description": "The actor on waking up to the achievements of cricketer Mithali Raj and women's cricket team, how getting eyeballs in a patriarchal society is a hustle and why female heroes aren’t celebrated enough", "url": "https://indianexpress.com/article/express-sunday-eye/taapsee-pannu-mithali-raj-role-cricket-shabaash-mithu-movie-release-8018315/", "urlToImage": "https://images.indianexpress.com/2022/07/Shabaash-Mithu-Clean-Image_1200_eye.jpg", "publishedAt": "2022-07-09T02:57:06Z", "content": "You have played a sportsperson on the screen before. How different was it to essay the character of Mithali Raj in Shabaash Mithu?I had never played cricket in my life even though I have played other… [+8191 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Varinder Bhatia", "title": "Haryana govt set to audit all 24 private universities amid complaints", "description": "The move comes against the backdrop of state higher education department issuing a show cause notice to Ashoka University, accusing it of \"financial embezzlement\".", "url": "https://indianexpress.com/article/education/haryana-set-to-audit-all-24-private-universities-colleges-8018362/", "urlToImage": "https://images.indianexpress.com/2022/07/ashoka-university-1.jpg", "publishedAt": "2022-07-09T02:56:23Z", "content": "The Haryana government is all set to order a detailed audit of all the 24 private universities in the state amid complaints that some of them were not adhering to the provisions of the law. The move … [+3223 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "NDA Prez nominee Droupadi Murmu’s Jaipur visit has been rescheduled to July 13", "description": "The BJP has 71 MLAs in the 200-seat assembly of Rajasthan. It has 24 Lok Sabha members and four Rajya Sabha members from Rajasthan.", "url": "https://indianexpress.com/article/cities/jaipur/nda-prez-nominee-droupadi-murmu-jaipur-rescheduled-8018371/", "urlToImage": "https://images.indianexpress.com/2022/07/Murmu-latest.jpeg", "publishedAt": "2022-07-09T02:55:20Z", "content": "The visit of NDA presidential nominee Droupadi Murmu to Jaipur has been rescheduled to July 13, BJP sources said on Friday.Murmu will reach a hotel at 8 am on July 13 and will meet BJP MPs and MLAs, … [+421 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Suspected Pak phone numbers recovered from PFI member arrested in Rajasthan: Police", "description": "The local police have alerted the intelligence branch, another official said, adding the matter is being probed further.", "url": "https://indianexpress.com/article/cities/jaipur/suspected-pak-phone-numbers-pfi-member-arrested-rajasthan-police-8018363/", "urlToImage": "https://images.indianexpress.com/2022/07/arrest-16.jpg", "publishedAt": "2022-07-09T02:48:43Z", "content": "Some suspected Pakistani phone numbers were recovered from the mobile phone of a Popular Front of India (PFI) member who was arrested in the Bhilwara district recently, police said on Friday.Accused … [+530 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "While You Were Asleep: Verstappen takes pole in Austria, Birmingham Police arrest fan after racism allegations, Germany thrash Denmark in Women’s Euro 2022", "description": "Lewis Hamilton and George Russell crashed in the top-10 shoot-out at the Spielberg circuit. Germany's bid to win a record ninth European Championship got off to an emphatic start as they beat Denmark 4-0.", "url": "https://indianexpress.com/article/sports/sport-others/while-you-were-asleep-verstappen-takes-pole-in-austria-birmingham-police-arrest-fan-after-racism-allegations-germany-thrash-denmark-in-womens-euro-2022-8018328/", "urlToImage": "https://images.indianexpress.com/2022/07/While-You-Were-Asleep-2-2.jpg", "publishedAt": "2022-07-09T02:46:23Z", "content": "Max Verstappen claimed pole for the Austrian Grand Prix sprint race as Friday qualifying proved a double disaster for Mercedes after Mercedes rivals Lewis Hamilton and George Russell crashed in quali… [+4182 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Sachin Pilot meets slain tailor Kanhaiya Lal’s family in Udaipur, demands death penalty for culprits", "description": "Talking to reporters, Congress leader Sachin Pilot said everyone wants that the accused should be given strict punishment and it should not be less than the death penalty.", "url": "https://indianexpress.com/article/cities/jaipur/sachin-pilot-tailor-family-udaipur-murder-8018292/", "urlToImage": "https://images.indianexpress.com/2022/07/FXJN_3OX0AA3Ft4.jpg", "publishedAt": "2022-07-09T02:41:46Z", "content": "Senior Congress leader Sachin Pilot on Friday met the family of tailor Kanhaiya Lal, who was murdered here days ago, and demanded the death penalty for the culprits.He also called for a speedy trial … [+999 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Punjab Police promotes 101 sub-inspectors, 95 of them woman officers", "description": "Terming “timely promotion as the right of every police officer,” the DGP assured the force their due promotions very soon. He said that all the vacancies at supervisory levels, including head-constable, assistant sub-inspector, and sub-inspector will be fille…", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-police-promotes-101-sub-inspectors-95-of-them-woman-officers-8018350/", "urlToImage": "https://images.indianexpress.com/2022/07/punjab-police-1.jpg", "publishedAt": "2022-07-09T02:40:36Z", "content": "Punjab Director General of Police (DGP) Gaurav Yadav on Friday promoted 101 sub-inspectors, including 95 woman officers, to the rank of inspector. With these promotions, all vacancies of inspector ra… [+1301 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "টুইটারের সঙ্গে চুক্তি বাতিল, বড় ঘোষণা ইলন মাস্কের, পাল্টা মামলার হুঁশিয়ারি সংস্থারও", "description": "চলতি বছর এপ্রিলে ৪৪ বিলিয়ান ডলারের বিশাল অঙ্কে টুইটার কেনার প্রস্তাব দিয়েছিলেন। গত মে মাস থেকে চুক্তিটি চূড়ান্ত হওয়ার অপেক্ষায় ছিল। কিন্তু, তেমন সাড়া দিচ্ছিলেন না ইলন মাস্ক।", "url": "https://bengali.indianexpress.com/general-news/elon-musk-abandons-deal-to-buy-twitter-467004/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/Elon-Musk-abandons-deal-to-buy-Twitter.jpg", "publishedAt": "2022-07-09T02:37:46Z", "content": "The Twitter Board is committed to closing the transaction on the price and terms agreed upon with Mr. Musk and plans to pursue legal action to enforce the merger agreement. We are confident we will p… [+79 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sampada Sharma", "title": "Gulzar’s Aandhi is not just ‘that film on Indira Gandhi’, Sanjeev Kumar-Suchitra Sen explore how lack of ambition can ruin relationships", "description": "Aandhi is remembered for being 'that film based on Indira Gandhi's life' but there is more to this Sanjeev Kumar-Suchitra Sen film.", "url": "https://indianexpress.com/article/entertainment/bollywood/gulzar-aandhi-not-just-that-film-on-indira-gandhi-sanjeev-kumar-suchitra-sen-explore-relationships-8017379/", "urlToImage": "https://images.indianexpress.com/2022/07/Aandhi-1200.jpg", "publishedAt": "2022-07-09T02:31:57Z", "content": "When Gulzar’s Aandhi was up for release in 1975, it was said that the film was based on the life of then PM Indira Gandhi. While the filmmaker kept insisting that the Suchitra Sen, Sanjeev Kumar star… [+5061 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sampada Sharma", "title": "Guru Dutt believed he was making ‘insubstantial’ cinema before Pyaasa, the film released him from ‘solitary confinement’", "description": "On Guru Dutt's 97th birth anniversary, here's revisiting the time when Dutt felt like he had been let out of prison while making Pyaasa.", "url": "https://indianexpress.com/article/entertainment/bollywood/guru-dutt-believed-he-was-making-insubstantial-cinema-before-pyaasa-the-film-released-him-from-solitary-confinement-8016576/", "urlToImage": "https://images.indianexpress.com/2022/07/pyaasa-1.jpg", "publishedAt": "2022-07-09T02:31:46Z", "content": "When Guru Dutt started making movies in the early 1950s, he instantly understood the pulse of his audience. He understood what could be sold to the masses and make money so his initial offerings were… [+4939 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kamaldeep Singh Brar", "title": "After Moosewala’s SYL: YouTube pulls down another Punjabi song on Govt complaint", "description": "The song asked government why it was going against the Sikh community and said that the Punjabis are only asking that Sikh prisoners be released from jails.", "url": "https://indianexpress.com/article/cities/amritsar/youtube-punjabi-song-rihaee-sikh-prisonders-govt-sidhu-moosewala-syl-8018347/", "urlToImage": "https://images.indianexpress.com/2022/07/kanwar-grewal.jpg", "publishedAt": "2022-07-09T02:28:37Z", "content": "Video sharing platform YouTube Friday took down popular Punjabi singer Kanwar Grewal’s song “Rihaee”, which calls for the release of Sikh prisoners, following a complaint from Government of India.“Co… [+3203 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anju Agnihotri Chaba", "title": "Punjab Technical University gets B in first-ever NAAC grading, its colleges ranked A+", "description": "The PTU, established in 1997, which has more than 280 colleges affiliated with it, started classes on its  campus only in 2015. It currently has 1,000 students enrolled in 16 undergraduate, 17 postgraduate, 16 doctorate and three M.Phil programme.", "url": "https://indianexpress.com/article/education/punjab-technical-university-naac-grading-colleges-8018309/", "urlToImage": "https://images.indianexpress.com/2022/07/college8.jpg", "publishedAt": "2022-07-09T02:21:00Z", "content": "Punjab’s first technical university has found itself in a piquant situation with National Assessment and Accreditation Council (NAAC) awarding it grade B in its first-ever inspection for the assessme… [+4706 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anju Agnihotri Chaba", "title": "Punjab Technical University gets B in first-ever NAAC grading, its colleges ranked A+", "description": "The PTU, established in 1997, which has more than 280 colleges affiliated with it, started classes on its  campus only in 2015. It currently has 1,000 students enrolled in 16 undergraduate, 17 postgraduate, 16 doctorate and three M.Phil programme.", "url": "https://indianexpress.com/article/cities/jalandhar/punjab-technical-university-naac-grading-colleges-8018309/", "urlToImage": "https://images.indianexpress.com/2022/07/college8.jpg", "publishedAt": "2022-07-09T02:21:00Z", "content": "Punjab’s first technical university has found itself in a piquant situation with National Assessment and Accreditation Council (NAAC) awarding it grade B in its first-ever inspection for the assessme… [+4710 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Russia trolls US, UK, renames embassy streets to Ukraine’s separatist regions", "description": "The US and Britain have not recognised the Donetsk and Luhansk “people's republics,” but Moscow officials said they will at least have to recognise the new addresses if they want to receive their mail.", "url": "https://indianexpress.com/article/world/russia-ukraine-war-us-uk-embassy-moscow-streets-renamed-8018318/", "urlToImage": "https://images.indianexpress.com/2022/07/embassy-britain.jpg", "publishedAt": "2022-07-09T02:17:43Z", "content": "Moscow has taken a page out of Washington’s playbook to troll both the US and the UK by renaming the streets in front of their embassies in the Russian capital.The streets are now officially named fo… [+1482 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "Former Sebi chief bats for unified G-Secs, corporate bond market", "description": "The unification of the regulatory structure for trading, clearing and settlement of corporate bonds and G-Secs will result in \"economies of scale and scope\" leading to greater competition, innovation and efficiency in the markets.", "url": "https://indianexpress.com/article/business/economy/former-sebi-chief-bats-for-unified-g-secs-corporate-bond-market-8018325/", "urlToImage": "https://images.indianexpress.com/2022/07/sebi.jpg", "publishedAt": "2022-07-09T02:02:00Z", "content": "Former Sebi Chairman Ajay Tyagi has proposed the unification of the bond market for economies of scale and scope in the market.The government securities (G-Secs) market and corporate bond market are … [+2041 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "Amid rising costs, talent churn, TCS Q1 net rises 5.2%", "description": "However, on a quarter-on-quarter basis, net profit fell by 4.5 per cent from Rs 9,926 crore in the March quarter as TCS was hit by increased costs across. The company also declared a dividend of Rs 8 per share.", "url": "https://indianexpress.com/article/business/companies/amid-rising-costs-talent-churn-tcs-q1-net-rises-8018320/", "urlToImage": "https://images.indianexpress.com/2022/07/TCS-1.jpg", "publishedAt": "2022-07-09T01:58:21Z", "content": "Tata Consultancy Services (TCS), Indias largest IT company, posted a 5.2 per cent growth in net profit in the June quarter of FY23 at Rs 9,478 crore as compared to Rs 9,008 crore in the same period o… [+2193 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "Munjal steps down as CII president-designate", "description": "Munjal announced his resignation from the post at CII's National Council Meeting on Thursday, where he pointed out that his commitments towards Hero MotoCorp's new global sustainability fund, in addition to the company itself, was the reason behind him steppi…", "url": "https://indianexpress.com/article/business/companies/munjal-steps-down-as-cii-president-designate-8018314/", "urlToImage": "https://images.indianexpress.com/2022/07/Munjal.jpg", "publishedAt": "2022-07-09T01:55:23Z", "content": "Citing domestic and global business commitments, Hero MotoCorp chairman and CEO Pawan Munjal stepped down as president-designate of the Confederation of Indian Industry (CII) for 2022-23. The industr… [+2333 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Tamil Nadu Covid-19 cases: State reports 2,722 infections, zero deaths; 939 in Chennai", "description": "Chennai, Tamil Nadu Covid-19 news: Chennai which has been adding new cases in four digits for the last few days logged 939 infections followed by Chengalpet 474, Tiruvallur 191, Coimbatore 131 while the remaining was spread across other districts. Ariyalur re…", "url": "https://indianexpress.com/article/cities/chennai/chennai-covid-cases-today-tamil-nadu-coronavirus-infections-deaths-rules-today-8018305/", "urlToImage": "https://images.indianexpress.com/2022/07/Covid-Chennai-1-2.jpeg", "publishedAt": "2022-07-09T01:52:07Z", "content": "Tamil Nadu recorded 2,722 fresh coronavirus infections, pushing the overall caseload to 34,96,321 on Friday.There were no fresh fatalities due to Covid-19 in the last 24 hours and the toll remained u… [+1519 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Online application system for govt rewards and pension started", "description": "Active athletes who seek awards, rewards or any other form of government recognition can log on to the sports ministry portal and upload relevant documents needed for payment.", "url": "https://indianexpress.com/article/sports/sport-others/online-application-system-for-govt-rewards-and-pension-started-8018301/", "urlToImage": "https://images.indianexpress.com/2019/12/rrb-1200.jpg", "publishedAt": "2022-07-09T01:50:43Z", "content": "In a decision that could make life easier for athletes and former sportspersons, they can now apply for their dues and awards online without having to involve national federations or visit government… [+2403 chars]"}]}