{"status": "ok", "totalResults": 280, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Man on way to Golden Temple shot dead in front of wife, children", "description": "The victim, identified as Harinder Singh of Chheharta locality in Amritsar city, was working in Dubai and returned home just five days ago, the police said", "url": "https://indianexpress.com/article/cities/chandigarh/man-on-way-to-golden-temple-shot-dead-in-front-of-wife-children-7966507/", "urlToImage": "https://images.indianexpress.com/2022/06/express-5.jpg", "publishedAt": "2022-06-12T21:54:45Z", "content": "A man was allegedly shot dead in front of his wife and two children in Amritsar on Sunday morning as they were on the way to Harmandir Sahib (Golden Temple), the police said.The victim, identified as… [+1167 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi in deep water due to poor planning: Haryana govt", "description": "The Haryana government said that for the past two years, Delhi has been alleging that Haryana is not releasing Delhi’s full share of water, but the actual facts are totally different.", "url": "https://indianexpress.com/article/cities/chandigarh/delhi-in-deep-water-due-to-poor-planning-haryana-govt-7966506/", "urlToImage": "https://images.indianexpress.com/2022/06/KHATTAR.jpg", "publishedAt": "2022-06-12T21:47:25Z", "content": "Insisting that Haryana is supplying more than the allotted share of drinking water to the national capital, the Manohar Lal Khattar-led government on Sunday alleged that shortage of water in Delhi is… [+1278 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sadaf Modak", "title": "Net of contention: Courts to decide on pleas by ‘mosquito-infested’ Taloja inmates this week", "description": "In May, jail authorities conducted a search of belongings of inmates and seized mosquito nets being used by them. The reason cited by the officials was that the nets have a long string which the prisoners could use to harm themselves or others.", "url": "https://indianexpress.com/article/cities/mumbai/net-of-contention-courts-to-decide-on-pleas-by-mosquito-infested-taloja-inmates-this-week-7966505/", "urlToImage": "https://images.indianexpress.com/2021/11/dengue-1200.jpg", "publishedAt": "2022-06-12T21:46:24Z", "content": "AT THE Taloja Central Jail, the latest cause of a face-off between jail authorities and prison inmates is mosquitoes. At least 15 prisoners have approached various courts seeking access to mosquito n… [+2969 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Man Aman Singh Chhina", "title": "Disabled soldier awaits relief, AFT principal bench upset at orders not being implemented", "description": "The jawan, who belongs to 15 Kumaon, had suffered amputation of his leg below the knee in landmine blast in Jammu and Kashmir in June 2000.", "url": "https://indianexpress.com/article/cities/chandigarh/disabled-soldier-awaits-relief-aft-principal-bench-upset-at-orders-not-being-implemented-7966502/", "urlToImage": "https://images.indianexpress.com/2019/03/armed-forces-tribunal-12001.jpg", "publishedAt": "2022-06-12T21:43:04Z", "content": "The orders issued by Armed Forces Tribunal (AFT) are increasingly being treated in a cavalier manner and this has drawn the ire of the principal bench of the tribunal. In a recent case, the bench com… [+4647 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "SGPC to install suicide bomber Dilawar Singh’s portrait tomorrow at Golden Temple museum", "description": "Singh told The Indian Express that the portrait will be installed in a ceremony organised by the Shiromani Gurdwara Parbandhak Committee (SGPC).", "url": "https://indianexpress.com/article/cities/amritsar/sgpc-to-install-suicide-bomber-dilawar-singhs-portrait-tomorrow-at-golden-temple-museum-7966501/", "urlToImage": "https://images.indianexpress.com/2022/06/SGPC1.jpeg", "publishedAt": "2022-06-12T21:37:05Z", "content": "A portrait of suicide bomber Dilawar Singh, who killed former Punjab chief minister Beant Singh, will be installed at the Central Sikh Museum inside the Golden Temple in Amritsar on Tuesday, said Sul… [+1257 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "National Herald case ED summons to Sonia, Rahul BJP’s tactic to muzzle opp voice: Ranjan", "description": "Addressing a press conference here on Sunday, Ranjan said, “The ED summonses were legally and technically untenable as no case can be made since there was no transaction of money anywhere.”", "url": "https://indianexpress.com/article/chandigarh/national-herald-case-ed-summons-to-sonia-rahul-bjps-tactic-to-muzzle-opp-voice-ranjan-7966500/", "urlToImage": "https://images.indianexpress.com/2022/06/Ranjeet-Ranjan-1.jpg", "publishedAt": "2022-06-12T21:32:38Z", "content": "Senior Congress leader and Rajya Sabha member Ranjeet Ranjan on Sunday alleged that the Enforcement Directorate (ED) summons issued to Congress president Sonia Gandhi and Rahul Gandhi was the BJP gov… [+1864 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Punjab starts procurement of moong on MSP for first time", "description": "As the summer crop is being procured on an MSP of Rs 7,275 per quintal, the farmers will get Rs 36,000 as an additional income for five quintals, the expected yield per acre in between wheat harvest and paddy cultivation.", "url": "https://indianexpress.com/article/chandigarh/punjab-starts-procurement-of-moong-on-msp-for-first-time-7966499/", "urlToImage": "https://images.indianexpress.com/2022/02/green-moong_1200_wikimedia-commons.jpg", "publishedAt": "2022-06-12T21:28:49Z", "content": "For the first time in the history of Punjab, the government has started the procurement of the summer moong crop directly from farmers at a minimum support price (MSP) of Rs 7,275 per quintal. Jagrao… [+1549 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Oppn leaders: BJP outrightly trying to bulldoze democracy & rule of law", "description": "Samajwadi Party chief Akhilesh Yadav said that such proceedings are not allowed by culture, religion, legislation and the country's Constitution.", "url": "https://indianexpress.com/article/cities/lucknow/oppn-leaders-bjp-outrightly-trying-to-bulldoze-democracy-rule-of-law-7966495/", "urlToImage": "https://images.indianexpress.com/2022/06/javed-house.jpg", "publishedAt": "2022-06-12T21:07:31Z", "content": "Leaders of Opposition parties on Sunday questioned the demolition proceedings being undertaken by the BJP government in Uttar Pradesh following protests against the remarks made on Prophet Mohammad.S… [+3182 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Indo-Asian News Service", "title": "Slight spike in Covid cases in Mohali, Civil Surgeon says caution necessary", "description": "The health authorities have asked people to be cautious and follow the guidelines so that the number of cases could not go up in the coming days.", "url": "https://indianexpress.com/article/cities/sas-nagar-mohali/slight-spike-in-covid-cases-in-mohali-civil-surgeon-says-caution-necessary-7966497/", "urlToImage": "https://images.indianexpress.com/2022/06/covid-pti.jpg", "publishedAt": "2022-06-12T21:05:19Z", "content": "The health department has recorded a slight spike in COVID-19 cases. As many as 130 positive cases have been reported this month. The health authorities have asked people to be cautious and follow th… [+756 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Country emerging as new India under Modi: Ravi Kishan", "description": "Bhojpuri artiste and Lok Sabha MP Ravi Kishan participated and addressed the public meeting.", "url": "https://indianexpress.com/article/cities/chandigarh/country-emerging-as-new-india-under-modi-ravi-kishan-7966493/", "urlToImage": "https://images.indianexpress.com/2021/07/ravi-kishan-1200.jpg", "publishedAt": "2022-06-12T21:03:06Z", "content": "A rally and public meeting was organised by the Chandigarh BJP at Mauli Jagaran, Vikas Nagar, to commemorate eight years of the Central government led by Prime Minister Narendra Modi. Bhojpuri artist… [+999 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Protests spread in West Bengal, train vandalised in Nadia", "description": "A group of protesters damaged a local train at Bethuadahari railway station in Nadia district, officials said, adding that no one was severely injured.", "url": "https://indianexpress.com/article/cities/kolkata/protests-spread-in-west-bengal-train-vandalised-in-nadia-7966490/", "urlToImage": "https://images.indianexpress.com/2022/06/trains-1-1.jpg", "publishedAt": "2022-06-12T21:01:38Z", "content": "A day after parts of Howrah were hit by violence, massive protests spread to several parts of West Bengal from South 24 Parganas to Murshidabad on Sunday over the remarks on Prophet Mohammad by now s… [+1014 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "H S Lucky is new UT Congress president", "description": "Lucky had contested the Municipal Corporation polls in December, 2021 but lost to BJP Councillor Mahesh Inder Singh Sidhu by a margin of 11 votes.", "url": "https://indianexpress.com/article/cities/chandigarh/h-s-lucky-is-new-ut-congress-president-7966471/", "urlToImage": "https://images.indianexpress.com/2022/06/NL-Lucky-2cols.jpg", "publishedAt": "2022-06-12T20:58:39Z", "content": "Harmohinder Singh Lucky was appointed as the Chandigarh Congress chief, here on Sunday. Luckys appointment comes a day after Congress leader Subhash Chawla resigned from the post. A statement issued … [+1747 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi Confidential: Race For Raisina", "description": "Ahead of the Presidential polls, activities in the Opposition camp to field a joint consensus candidate are gaining pace. On Sunday, AAP Rajya Sabha MP Sanjay Singh flew down to Mumbai to meet NCP supremo Sharad Pawar.", "url": "https://indianexpress.com/article/delhi-confidential/delhi-confidential-race-for-raisina-sanjay-singh-sharad-pawar-bjp-7966486/", "urlToImage": "https://images.indianexpress.com/2022/06/sanjay-ill.jpg", "publishedAt": "2022-06-12T20:56:01Z", "content": "Ahead of the Presidential polls, activities in the Opposition camp to field a joint consensus candidate are gaining pace. On Sunday, AAP Rajya Sabha MP Sanjay Singh flew down to Mumbai to meet NCP su… [+1921 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Asad Rehman, Sukrita Baruah", "title": "Part of civil society, Javed, Afreen took part in CAA, other protests", "description": "While Javed is the party's central working committee member, Afreen is national secretary of the Fraternity Movement, the student wing of the party.", "url": "https://indianexpress.com/article/cities/lucknow/part-of-civil-society-javed-fatima-took-part-in-anti-caa-stir-7966482/", "urlToImage": "https://images.indianexpress.com/2022/06/888.jpg", "publishedAt": "2022-06-12T20:49:39Z", "content": "MOHAMMAD JAVED and his daughter Afreen Fatima, whose house the Uttar Pradesh administration demolished on Sunday, two days after Prayagraj saw protests over Nupur Sharma’s remarks on the Prophet, are… [+1471 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Zone around Sukhna critical for conservation, will discuss with Amit Shah, says UT Adviser", "description": "While addressing the media about the matter, Pal said, “We have a meeting of the northern zonal council in Jaipur on July 9 where this will be one of the key issues to be taken up in the meeting.", "url": "https://indianexpress.com/article/cities/chandigarh/zone-around-sukhna-critical-for-conservation-will-discuss-with-amit-shah-says-ut-adviser-7966483/", "urlToImage": "https://images.indianexpress.com/2021/12/Sukhna-Lake.jpeg", "publishedAt": "2022-06-12T20:49:08Z", "content": "Chandigarh Adviser Dharam Pal on Sunday said that the UT will bring up the matter of notifying the Eco-Sensitive Zone around Sukhna Wildlife Sanctuary that falls under Punjab and Haryana with Union H… [+2907 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Jagdeep Singh Deep", "title": "Cong councillors to support Sidhu but won’t attend BJP functions: Mohali Deputy Mayor", "description": "Deputy Mayor Kuljeet Singh Bedi said that the Congress councillors would support Sidhu but will not attend any functions of the BJP.", "url": "https://indianexpress.com/article/cities/sas-nagar-mohali/cong-councillors-to-support-sidhu-but-wont-attend-bjp-functions-mohali-deputy-mayor-7966479/", "urlToImage": "https://images.indianexpress.com/2022/06/Amarjit-Singh-Sidhu.jpg", "publishedAt": "2022-06-12T20:44:14Z", "content": "With Mayor Amarjit Singh Sidhu joining the BJP, the Congress is wary of the fact that the partys councillors could switch loyalties. Deputy Mayor Kuljeet Singh Bedi said that the Congress councillors… [+2401 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Woman killed as bus collides with two-wheeler in Siliguri", "description": "The incident happened on Asian Highway-2 near Noukaghat bridge in Kaoakhali in New Jalpaiguri police station area.", "url": "https://indianexpress.com/article/cities/kolkata/woman-killed-as-bus-collides-with-two-wheeler-in-siliguri-7966478/", "urlToImage": "https://images.indianexpress.com/2022/05/death-7592.jpg", "publishedAt": "2022-06-12T20:40:31Z", "content": "A 50-year-old woman was killed and her husband injured when their two-wheeler was hit by a state-run bus in Siliguri in West Bengal on Sunday, police said. The incident happened on Asian Highway-2 ne… [+508 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Covid numbers continue upward surge; no deaths", "description": "Till now, the virus has claimed 21, 205 patients in the state and West Bengal's positivity rate is 1.6 per cent. Over", "url": "https://indianexpress.com/article/cities/kolkata/covid-numbers-continue-upward-surge-no-deaths-7966473/", "urlToImage": "https://images.indianexpress.com/2022/06/Covid-19-2.jpg", "publishedAt": "2022-06-12T20:37:03Z", "content": "West Bengals Covid-19 tally continued to surge on Sunday as the state saw 123 more persons testing positive for the virus, as per the health department bulletin. However, no deaths due to the disease… [+82 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Row over remarks on the Prophet Suvendu stopped from visiting Howrah, says will move court", "description": "The police said that Adhikari was prevented from travelling to Howrah as a \"precautionary measure\" since prohibitory orders under Section 144 of the CrPC have been clamped in many areas in the district and his visit could cause law and order problems.", "url": "https://indianexpress.com/article/cities/kolkata/row-over-remarks-on-the-prophet-suvendu-stopped-from-visiting-howrah-says-will-move-court-7966469/", "urlToImage": "https://images.indianexpress.com/2022/06/suvendu-1.jpg", "publishedAt": "2022-06-12T20:36:21Z", "content": "BJP leader and Leader of the Opposition in Assembly Suvendu Adhikari was on Sunday stopped by the police in Tamluk from visiting violence-hit areas of Howrah, a day after clashes broke out in the wak… [+2862 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Maharashtra now one gold ahead of Haryana", "description": "Haryana is eager to move to the final day as 20 gold medals are up for grabs and the state has 12 boxers in the finals to the four of Maharashtra. Both Maharashtra and Haryana won five gold medals each on Sunday.", "url": "https://indianexpress.com/article/cities/panchkula/maharashtra-now-one-gold-ahead-of-haryana-7966463/", "urlToImage": "https://images.indianexpress.com/2022/06/NL-football-3col.jpg", "publishedAt": "2022-06-12T20:28:23Z", "content": "a day away from the end of the event, Maharashtra has kept its lead in the medal tally with a total of 42 golds; Haryana trails by just 1 gold in the Khelo India Youth Games. But Haryana is eager to … [+960 chars]"}]}