{"status": "ok", "totalResults": 479, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "‘It is not what you go through that determines where you end up; it’s who you listen to’", "description": "\"Every time you break, it's a chance for you to give up. But, there's also opportunity to get stronger and smarter.\"", "url": "https://indianexpress.com/article/lifestyle/life-positive/it-is-not-what-you-go-through-that-determines-where-you-end-up-its-who-you-listen-to-7933801/", "urlToImage": "https://images.indianexpress.com/2022/05/lp.jpg", "publishedAt": "2022-05-26T02:50:28Z", "content": "In life, we are often confronted with situations that test our emotional and physical strength. This inspirational video elaborates how our response to failure determines how we evolve.No matter how … [+1333 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Arushi Jain", "title": "Is Anek harbouring a saviour complex? Ayushmann Khurrana says ‘This is a film about the Northeast, and the protagonists are of the Northeast’", "description": "Ayushmann Khurrana and Andrea Kevichüsa talk about their upcoming release Anek and share if they have faced racial discrimination ever.", "url": "https://indianexpress.com/article/entertainment/bollywood/anek-ayushmann-khurrana-andrea-kevichusa-discrimination-racial-slurs-7936084/", "urlToImage": "https://images.indianexpress.com/2022/05/ayushmann-khurran-anek.jpg", "publishedAt": "2022-05-26T02:35:53Z", "content": "Anubhav Sinha and Ayuhsmann Khurrana fielded questions about harbouring a saviour complex when they collaborated on the 2019 film, Article 15. Then, they were criticised for making an upper-caste pol… [+5405 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rohan Naahar", "title": "Tron Legacy: Before Top Gun Maverick, director Joseph Kosinski made one of the most audacious big-budget debuts of all time", "description": "Post Credits Scene: Director Joseph Kosinski was handpicked by Tom Cruise to helm the long-delayed Top Gun: Maverick, and now is an ideal time to revisit Kosinski's under-appreciated cult hit Tron: Legacy, with which he made one of the most spectacular big-bu…", "url": "https://indianexpress.com/article/entertainment/hollywood/tron-legacy-top-gun-maverick-director-joseph-kosinski-audacious-debut-film-7935233/", "urlToImage": "https://images.indianexpress.com/2022/05/tron-legacy-pcs.png", "publishedAt": "2022-05-26T02:33:13Z", "content": "The common belief these days, as it has been for some years now, is that Tom Cruise no longer works with directors that he cant push around. This didn’t always use to be the case. Early in his career… [+6601 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Chennai: Traffic diversions ahead of PM Narendra Modi’s visit, check which routes to avoid today", "description": "In a press release, the Chennai traffic police said that there will be traffic restrictions on major roads in Chennai, including EVR Road, Madras Medical College junction, Anna Salai, Sardar Patel Road and GST Road.", "url": "https://indianexpress.com/article/cities/chennai/pm-narendra-modi-chennai-visit-traffic-diversions-in-chennai-today-7936624/", "urlToImage": "https://images.indianexpress.com/2022/05/Chennai-COVID-19-18.jpeg", "publishedAt": "2022-05-26T02:30:37Z", "content": "Ahead of Prime Minister Narendra Modi’s visit to Chennai, the Greater Chennai Police has announced traffic diversions in parts of the city today (May 26).The Chennai Traffic Police warned there may b… [+1623 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Karnataka Bengaluru News Live Updates: Son denied MLC candidature, BSY says party will give him ‘big opportunity’", "description": "Karnataka Bengaluru News Live Updates: Karnataka’s team at the World Economic Forum in Davos, led by Chief Minister Basavaraj Bommai, has inked Memorandums of Understanding (MoU) with two major companies, for a total investment flow of Rs 52,000 crore.", "url": "https://indianexpress.com/article/cities/bangalore/karnataka-bengaluru-news-live-updates-bjp-weather-7936657/", "urlToImage": "https://images.indianexpress.com/2021/07/Yediyurappa-4.jpeg", "publishedAt": "2022-05-26T02:27:23Z", "content": "Members of the Aam Aadmi Partys Karnataka unit speak to the media, in Bengaluru on Wednesday.\r\nAmid the Gyanvapi Mosque row, the Mangaluru Police had to clamp Section 144 around the Assaiyeed Adbulla… [+779 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Texas school shooting: Minutes before school attack, Texas gunman sent online warning", "description": "US President Joe Biden said he and first lady Jill Biden will travel to Uvalde, Texas, in the coming days to console families of the young shooting victims killed at an elementary school.", "url": "https://indianexpress.com/article/world/texas-school-shooting-uvalde-gunman-latest-updates-7936641/", "urlToImage": "https://images.indianexpress.com/2022/05/texas-school-1.jpg", "publishedAt": "2022-05-26T02:20:45Z", "content": "The Texas gunman who murdered 19 children and two teachers at the Robb Elementary School in Uvalde posted an online message warning that he was going to shoot up an elementary school minutes before h… [+5553 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rahel Philipose, Sonal Gupta", "title": "Daily Briefing: Yasin Malik handed life term in terrorism case; Kapil Sibal says will ‘unite Opposition to oppose BJP’", "description": "The Office of the Registrar General of India has said that Covid-19 caused 1,60,618 deaths in 2020 and accounted for 8.9 per cent of the total 18.11 lakh medically certified deaths in India.", "url": "https://indianexpress.com/article/live-news/top-news-briefing-today-7936633/", "urlToImage": "https://images.indianexpress.com/2022/05/Express-intro-15.jpg", "publishedAt": "2022-05-26T01:55:52Z", "content": "In today’s edition of The Indian Express, we take a look at the learning crisis set in by the Covid-19 pandemic and offer you a peek into the world of crypto-mining.\r\nThe Big Story\r\nKashmiri separati… [+4207 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "China seeks Pacific islands policing, security cooperation, says document", "description": "China's Foreign Minister Wang Yi will visit eight Pacific island nations that China has diplomatic ties with between May 26 and June 4.", "url": "https://indianexpress.com/article/world/china-pacific-islands-policing-security-cooperation-document-7936638/", "urlToImage": "https://images.indianexpress.com/2021/08/china-foreignminister.jpg", "publishedAt": "2022-05-26T01:48:00Z", "content": "China will seek a region-wide deal with almost a dozen Pacific island countries covering policing, security and data communication cooperation when Foreign Minister Wang Yi hosts a meeting in Fiji ne… [+6225 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Navjeevan Gopal", "title": "Sidhu has new job — clerical assistant in jail", "description": "A Punjab Jails official said Sidhu, who had been awarded one year rigorous imprisonment, had been put on “paper work” job in the light of health complications he has.", "url": "https://indianexpress.com/article/cities/chandigarh/sidhu-has-new-job-clerical-assistant-in-jail-7936631/", "urlToImage": "https://images.indianexpress.com/2022/05/SIDHU-2.jpg", "publishedAt": "2022-05-26T01:42:46Z", "content": "Navjot Singh Sidhu has new job at hands clerical assistant at Patiala Central Jail. Sidhu, who is lodged in Patiala jail after Supreme Court awarded him a year in prison last week while deciding a re… [+209 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Raakhi Jagga", "title": "Committed to make state graft-free: AAP MLAs after minister’s arrest", "description": "Principal Budh Ram, two-time AAP MLA from Budhlada constituency of Mansa district said, “We should all serve with honesty…in the past, many scams would happen due to which people were fed up with the previous governments and hence they chose us.", "url": "https://indianexpress.com/article/cities/ludhiana/committed-to-make-state-graft-free-aap-mlas-after-ministers-arrest-7936620/", "urlToImage": "https://images.indianexpress.com/2022/05/VIJAY-SINGLA-1-3.jpg", "publishedAt": "2022-05-26T01:38:17Z", "content": "AAM AADMI Party (AAP) MLAs have fully supported Punjab Chief Minister Bhagwant Manns decision to sack former minister Vijay Singla saying that the AAP government is committed to make Punjab corruptio… [+2747 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kanchan Vasdev", "title": "Rajinder Singh, the man behind sting op", "description": "A primer on the engineer who effected what Mann called a “historic move”.", "url": "https://indianexpress.com/article/cities/chandigarh/rajinder-singh-the-man-behind-sting-op-7936621/", "urlToImage": "https://images.indianexpress.com/2022/05/RAJINDER-SINGH-1.jpg", "publishedAt": "2022-05-26T01:37:42Z", "content": "Punjab CM Bhagwant Mann on Tuesday sacked Health Minister Dr Vijay Singla on charges of corruption and got him arrested after a sting operation conducted by Rajinder Singh, a technocrat working with … [+1669 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "PM Narendra Modi to inaugurate 1,152 houses constructed under ‘Light House Project — Chennai’", "description": "Prime Minister Narendra Modi will lay the foundation stones of 11 projects worth more than Rs 31,400 crore at JLN Indoor Stadium in Chennai on Thursday.", "url": "https://indianexpress.com/article/cities/chennai/pm-narendra-modi-chennai-visit-to-inaugrate-light-house-project-7936617/", "urlToImage": "https://images.indianexpress.com/2022/05/Modi-17.jpeg", "publishedAt": "2022-05-26T01:26:18Z", "content": "Prime Minister Narendra Modi will on Thursday inaugurate 1,152 houses constructed as part of the ‘Light House Project — Chennai’ built at a cost of Rs 116 crore under the Pradhan Mantri Awas Yojana-U… [+835 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Navjeevan Gopal", "title": "Capt, Randhawa trade barbs over graft, sand mining a day after Singla’s arrest", "description": "", "url": "https://indianexpress.com/article/cities/chandigarh/capt-randhawa-trade-barbs-over-graft-sand-mining-a-day-after-singlas-arrest-7936613/", "urlToImage": "https://images.indianexpress.com/2022/05/CAPT1.jpg", "publishedAt": "2022-05-26T01:21:21Z", "content": "Former Punjab Chief Minister, Captain Amarinder Singh, on Wednesday said that he was ready to reveal names and give details of people involved in corruption and in illegal sand mining, and the list w… [+1824 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "After Cheema’s invitation to discuss demands, ‘chakka jam’ postponed", "description": "", "url": "https://indianexpress.com/article/cities/jalandhar/after-cheemas-invitation-to-discuss-demands-chakka-jam-postponed-7936616/", "urlToImage": "https://images.indianexpress.com/2022/05/CHEEMA-HARPAL-1.jpg", "publishedAt": "2022-05-26T01:21:13Z", "content": "The farmer organisations of Punjab have postponed their chakka jam programme for one day after getting an invitation for a meeting with Punjab Cooperative Minister Harpal Singh Cheema to discuss thei… [+799 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "AIADMK demands action over offensive video on Hindu deity", "description": "The YouTube channel that posted the content should be banned immediately and steps should be taken to prevent recurrence of such incidents as inaction would affect communal harmony and lead to deterioration of law and order situation, the AIADMK said.", "url": "https://indianexpress.com/article/cities/chennai/aiadmk-demands-action-over-offensive-video-on-hindu-deity-7936608/", "urlToImage": "https://images.indianexpress.com/2022/05/OPS.jpeg", "publishedAt": "2022-05-26T01:15:15Z", "content": "Condemning an abusive video on a Hindu deity, the main opposition AIADMK on Wednesday demanded that the DMK regime take legal action against a YouTube channel and those responsible for uploading the … [+1200 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Jagpreet Singh Sandhu", "title": "Punjab and Haryana HC grants bail to two arrested on charges of sedition by UT police", "description": "The HC's move to grant bail follows on the heels of the Supreme Court's recent direction  that all pending trials, appeals and proceedings with respect to the charge framed under Section 124-A of IPC in the country be kept in abeyance.", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-and-haryana-hc-grants-bail-to-two-arrested-on-charges-of-sedition-by-ut-police-7936606/", "urlToImage": "https://images.indianexpress.com/2022/05/PANDH-1.jpg", "publishedAt": "2022-05-26T01:12:31Z", "content": "The Punjab and Haryana High Court has granted bail to two residents of Punjab who were arrested in a case of sedition (section 124 -A) along with other sections of Indian Penal Code and UAPA, for all… [+2165 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kanchan Vasdev", "title": "Legal luminaries divided on strength of Vijay Singla’s corruption case", "description": "Sources said that the complainant, Superintending Rajinder Singh had recorded his conversation with the minister and his OSD Pardeep Kumar on his phone which was handed over to the police as evidence.", "url": "https://indianexpress.com/article/cities/chandigarh/legal-luminaries-divided-on-strength-of-vijay-singlas-corruption-case-7936603/", "urlToImage": "https://images.indianexpress.com/2022/05/JM24VjaySingla-01-1-2.jpeg", "publishedAt": "2022-05-26T01:02:48Z", "content": "A day after Punjab health minister Dr Vijay Singla was booked allegedly for graft after he was recorded seeking bribe, legal luminaries are divided on the strength of the case to withstand legal scru… [+1785 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sukhbir Siwach", "title": "Punjab sees 30.45% rise in stamp duty revenue", "description": "According to details, Salmani — a resident of UP's Saharanpur, who had gone to Panipat in search of work — himself had been allegedly attacked by a group of men on August 23, 2020.", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-sees-30-45-rise-in-stamp-duty-revenue-7936598/", "urlToImage": "https://images.indianexpress.com/2022/05/mann-3.jpg", "publishedAt": "2022-05-26T00:57:31Z", "content": "Punjab Revenue, Rehabilita- tion and Disaster Management Department has registered 30.45 per cent increase in revenue in April 2022 from registration of sale deeds and stamp duty as compared to corre… [+28 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Navjeevan Gopal", "title": "Punjab police analysing Vijay Singla’s bank account details", "description": "A Punjab police officer privy with the investigations told The Indian Express that police were examining the bank account details of Singla, and Pardeep since March 20 after he assumed charge as cabinet minister in the government.", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-police-analysing-vijay-singlas-bank-account-details-7936601/", "urlToImage": "https://images.indianexpress.com/2022/05/JM24VjaySingla-01-1-1.jpeg", "publishedAt": "2022-05-26T00:54:01Z", "content": "A day after arresting Dr Vijay Singla in the corruption case registered against him at phase 8 police station in Mohali on Tuesday, the Punjab police are in the process of analyzing his bank account … [+3734 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kanchan Vasdev", "title": "Vijay Singla not to be disqualified from Vidhan Sabha: Speaker", "description": "Vidhan Sabha Speaker Kultar Singh Sandhwan told The Indian Express that, “A case has been registered by the Police against the minister. Now, the case is in the court and now it is sub-judiced. We cannot take action against him.", "url": "https://indianexpress.com/article/cities/chandigarh/vijay-singla-not-to-be-disqualified-from-vidhan-sabha-speaker-7936597/", "urlToImage": "https://images.indianexpress.com/2022/05/JM24VjaySingla-01-1.jpeg", "publishedAt": "2022-05-26T00:50:37Z", "content": "Even as Punjab Chief Minister Bhagwant Mann sacked health minister Dr Vijay Singla from his Cabinet soon after he was allegedly presented with a sting recording seeking kick-backs, he is not likely t… [+1646 chars]"}]}