{"status": "ok", "totalResults": 292, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Peter Vidal", "title": "Horoscope Today, May 2, 2022: Libra, Aries, Pisces and other signs — check astrological prediction", "description": "Aquarius, both partnership and professional interests are stressed by certain adverse planetary influences - and somehow the two seem to be linked. Libra, you may go about your daily affairs with a spring in your step.", "url": "https://indianexpress.com/article/horoscope/horoscope-today-may-2-2022-libra-aries-pisces-and-other-signs-check-astrological-prediction-7896799/", "urlToImage": "https://images.indianexpress.com/2022/04/horoscope_2-1200-1-1-2-1.jpeg", "publishedAt": "2022-05-02T00:39:52Z", "content": "Whats on the cards today for you? Aries, if you’re looking for love you could be in luck. Sagittarius, financial stars are looking decidedly healthy, and, believe it or not, there are a number of way… [+3709 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "20 CBI law officers to attend training at RRU", "description": "CBI law officers consist of public prosecutors and assistant public prosecutors who work along with CBI sleuths in order to attain better conviction rate in courts.", "url": "https://indianexpress.com/article/cities/ahmedabad/20-cbi-law-officers-to-attend-training-at-rru-7896794/", "urlToImage": "https://images.indianexpress.com/2022/05/cbi.jpg", "publishedAt": "2022-05-02T00:31:09Z", "content": "As many as 20 law officers of the Central Bureau of Investigation (CBI) will undertake a week-long capacity building programme at the Gandhinagar-based Rashtriya Raksha University (RRU) from Monday.A… [+492 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Smriti Irani talks gender inclusivity, lauds state BJP for drive against malnutrition", "description": "", "url": "https://indianexpress.com/article/cities/ahmedabad/smriti-irani-talks-gender-inclusivity-lauds-state-bjp-for-drive-against-malnutrition-7896787/", "urlToImage": "https://images.indianexpress.com/2022/05/smriti-irani-1200-1.jpg", "publishedAt": "2022-05-02T00:21:33Z", "content": "Union Minister for Women and Child Development Smriti Irani Sunday in Ahmedabad brought to attention the issue of the under-representation of women workforce in the pharmaceutical industry in the cou… [+3835 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kamaal Saiyed", "title": "Farming to diamonds to stir: At business meet, PM Modi makes a pitch for Patidar vote", "description": "", "url": "https://indianexpress.com/article/cities/surat/farming-to-diamonds-to-stir-at-business-meet-pm-modi-makes-a-pitch-for-patidar-vote-7896760/", "urlToImage": "https://indianexpress.com/wp-content/themes/indianexpress/images/IE-OGimage.jpg", "publishedAt": "2022-05-02T00:16:09Z", "content": "AMID HARDIK Patel’s murmurs of discontent within the Congress and anticipation of a political debut by prominent Patidar Naresh Patel, Prime Minister Narendra Modi has weighed in for the BJP in the t… [+3542 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Abhishek Angad", "title": "Jharkhand commercial tax mop-up jumps 26% in FY22", "description": "The previous biggest jump in fiscal comparisons happened over FY 18 to FY19 -- an increase of 18.4 percent.", "url": "https://indianexpress.com/article/business/economy/jharkhand-commercial-tax-mop-up-jumps-26-in-fy22-7896783/", "urlToImage": "https://images.indianexpress.com/2022/04/tax-1200-2.jpg", "publishedAt": "2022-05-02T00:07:59Z", "content": "Jharkhand has collected Rs 15,740 crore in financial year 2022 (FY22) as commercial tax amount, around 26 per cent more than the fiscal before, as per the details made available by the states Commerc… [+3823 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "HDFC hikes rates for existing borrowers, EMIs set to go up", "description": "Interest rates are set to go up with the RBI now hinting at withdrawing the accommodative monetary policy to rein in inflation. While the RBI retained the Repo rate at 4 per cent in the last policy review, policy rates are likely to go up in the coming months.", "url": "https://indianexpress.com/article/business/economy/hdfc-hikes-rates-for-existing-borrowers-emis-set-to-go-up-7896781/", "urlToImage": "https://images.indianexpress.com/2022/04/HDFC-2.jpg", "publishedAt": "2022-05-02T00:00:51Z", "content": "HDFC Ltd on Sunday raised its benchmark lending rate by 5 basis points, leading to an increase in equated monthly instalments (EMIs) for existing borrowers.HDFC increases its Retail Prime Lending Rat… [+1579 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Ajitabh Sharma", "title": "India must use markets to decarbonise", "description": "A carbon-trading scheme can generate conditions necessary for the economy’s green transition.", "url": "https://indianexpress.com/article/opinion/columns/india-must-use-markets-to-decarbonise-7896780/", "urlToImage": "https://images.indianexpress.com/2020/02/factory-pollution-1200.jpg", "publishedAt": "2022-05-01T23:55:14Z", "content": "Climate change is bound to impact human lives and the global economy at an exceptionally high scale in the not-so-distant future. The last Conference of Parties (CoP-26) of the UNFCCC held at Glasgow… [+5381 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Heatwave: Centre asks states to review health preparedness, issues dos & don’ts", "description": "While asking healthcare facilities to remain prepared with essential medicines and consumables such as IV fluid, ORS, ice packs and cool drinking water, the Centre has issued a list of guidelines to prevent and manage heat-related problems.", "url": "https://indianexpress.com/article/india/heatwave-centre-asks-states-to-review-health-preparedness-issues-dos-donts-7896777/", "urlToImage": "https://images.indianexpress.com/2022/04/heatwave-4.jpg", "publishedAt": "2022-05-01T23:44:14Z", "content": "As a severe heatwave continues, the Centre has asked states and Union Territories to review their healthcare preparedness and issued a list of dos and don’ts to prevent heat-related illnesses.In a le… [+1982 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gen Pande sets priorities: Resolution to standoff, operational preparedness", "description": "Gen Pande said his “utmost and foremost priority would be to ensure high standards of operational preparedness to face the current, contemporary and the future challenges across the entire spectrum of conflict”.", "url": "https://indianexpress.com/article/india/gen-pande-sets-priorities-resolution-to-standoff-operational-preparedness-7896776/", "urlToImage": "https://images.indianexpress.com/2022/05/nav-dc.jpg", "publishedAt": "2022-05-01T23:33:23Z", "content": "Chief of the Army Staff Gen Manoj Pande Sunday flagged challenges brought about by evolving global geopolitics and stressed that his foremost priority would be to ensure high levels of operational pr… [+4353 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "FIR registered over ‘objectionable’ slogans written on BHU campus wall", "description": "This comes days after a controversy erupted at the varsity over Vice-Chancellor Sudhir Kumar Jain attending an iftar party hosted at a girls' hostel.", "url": "https://indianexpress.com/article/cities/lucknow/fir-registered-over-objectionable-slogans-written-on-bhu-campus-wall-7896763/", "urlToImage": "https://images.indianexpress.com/2018/03/bhu-7593.jpg", "publishedAt": "2022-05-01T23:24:50Z", "content": "A group of students at Banaras Hindu University (BHU) seeking action against those behind objectionable slogan writing outside a hostel on the campus has been staging protests daily since April 28.Al… [+2119 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "Rs 1.68 lakh crore in April, GST collection soars to all-time high", "description": "This marks a 20 per cent increase from the April 2021 level on the back of improved compliance, enforcement action against tax evaders and pick-up in economic activity.", "url": "https://indianexpress.com/article/business/economy/rs-1-68-lakh-crore-in-april-gst-collection-soars-to-all-time-high/", "urlToImage": "https://images.indianexpress.com/2022/05/GST.jpg", "publishedAt": "2022-05-01T23:10:47Z", "content": "REGISTERING THE highest level of collections since its rollout in July 2017, gross Goods and Services Tax (GST) collections rose to Rs 1.68 lakh crore in April, for sales in March, according to data … [+4300 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Vikram S Mehta", "title": "Could S Jaishankar don the Kissingerian mantle?", "description": "If there were an India-led peacemaking initiative, Jaishankar might be the best qualified to crack the Ukrainian diplomatic impasse", "url": "https://indianexpress.com/article/opinion/columns/could-s-jaishankar-don-the-kissingerian-mantle-7896649/", "urlToImage": "https://images.indianexpress.com/2022/05/oped.jpg", "publishedAt": "2022-05-01T22:31:01Z", "content": "aThe Ukrainian crisis has hit an immovable diplomatic roadblock. President Putin has reportedly cloistered himself in a tightly-controlled echo chamber that filters the truth about what is happening … [+5879 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shaju Philip", "title": "Kerala leader PC George arrested over hate speech, Union MoS backs him", "description": "P C George was arrested early on Sunday and lodged at a police camp in the state capital for a few hours before being granted bail by a local court.", "url": "https://indianexpress.com/article/cities/thiruvananthapuram/kerala-leader-pc-george-arrested-over-hate-speech-union-mos-backs-him-7896726/", "urlToImage": "https://images.indianexpress.com/2022/05/pc-george-hate-speech-kerala-police-updates-646131.jpg", "publishedAt": "2022-05-01T22:30:38Z", "content": "TWO DAYS after he delivered a hate speech targeting the Muslim community at an event backed by the Sangh Parivar in Thiruvananthapuram, controversial Kerala politician P C George was arrested early o… [+4638 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shubhajit Roy", "title": "Ukraine, bilateral ties on table for PM Modi in Europe", "description": "This is the Prime Minister's first visit abroad this year, and it includes about two dozen engagements across approximately 65 hours, official sources said. He will hold meetings, bilateral as well as multilateral, with world leaders from seven countries besi…", "url": "https://indianexpress.com/article/india/ukraine-bilateral-ties-on-table-for-pm-modi-in-europe-7896676/", "urlToImage": "https://images.indianexpress.com/2022/05/modi-75914.jpg", "publishedAt": "2022-05-01T22:30:23Z", "content": "PRIME MINISTER Narendra Modi will exchange perspectives on the Ukraine issue and strengthen bilateral partnerships during his three-day, three-nation visit to Europe, newly appointed Foreign Secretar… [+4990 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "‘Work-from-home to work-from-Kerala, it has peace and you can eat anything here’", "description": "Kerala Minister for Law, Industries and Coir, P Rajeeve talks about K-Rail project, strengthening infrastructure, Centre-state relations and why investors should head to Kerala. This session was moderated by MANOJ CG, Associate Editor, The Indian Express", "url": "https://indianexpress.com/article/idea-exchange/idea-exchange-kerala-minister-for-law-p-rajeeve7896674/", "urlToImage": "https://images.indianexpress.com/2022/05/P-Rajeeve-1.jpg", "publishedAt": "2022-05-01T22:30:06Z", "content": "Manoj CG: The CPM has been opposing the bullet-train project, and the south-north corridor proposed by the Oommen Chandy government. So, why is the Pinarayi government insisting on going ahead with t… [+14839 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sandeep Singh", "title": "Can see several large, good groups are going to invest now: Piramal", "description": "'Investments were set to happen, but then the two years of Covid, and the uncertainty after that hit and everyone stopped. If you look at the capacities of most good companies, their capacity utilisations are good and they have done well inspite of Covid.'", "url": "https://indianexpress.com/article/business/interview-piramal-group-seven-months-after-piramal-group-acquired-the-beleaguered-dhfl-for-a-total-consideration-of-rs-34250-crore-piramal-group-has-been-busy-integrating-and-has-hired-4500-new-employ/", "urlToImage": "https://images.indianexpress.com/2022/05/PIRAMAL-1200.jpg", "publishedAt": "2022-05-01T22:25:46Z", "content": "Seven months after Piramal Group acquired the beleaguered DHFL for a total consideration of Rs 34,250 crore, Piramal Group has been busy integrating and has hired 4,500 new employees over and above t… [+5129 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sukhbir Siwach", "title": "Haryana officers turn ‘guardians’ of villages", "description": "Deepika, who studied at JNU, added: “Under this scheme, I along with village sarpanch Nazma Khan ensured that no genuine labourer is left out from the benefit of MGNREGA scheme.", "url": "https://indianexpress.com/article/cities/chandigarh/haryana-officers-turn-guardians-of-villages-7896761/", "urlToImage": "https://images.indianexpress.com/2022/05/chhh.jpg", "publishedAt": "2022-05-01T22:23:50Z", "content": "It was five years ago that a state civil services officer, Deepika Chuadhary, first visited Dhauj village of Faridabad district when the then deputy commissioner Chander Shekhar, an IAS officer, aske… [+3045 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shireen Azam, Srinivas Goli", "title": "Why caste among Muslims must be studied", "description": "It is crucial for understanding Muslims — their impoverishment, educational backwardness and occupational precarity", "url": "https://indianexpress.com/article/opinion/columns/why-caste-among-muslims-must-be-studied-7896667/", "urlToImage": "https://images.indianexpress.com/2022/05/hijab-ban.jpg", "publishedAt": "2022-05-01T22:19:39Z", "content": "For the last two decades, the Indian public sphere has seen a slow but steady rise in discussions on caste among Muslims. A series of events has contributed to this: The influence of Mandal politics … [+5960 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Hooda, Bhan hold ‘Vipaksh Aapke Samaksh’ programme", "description": "“People of Haryana have been hit hard by the acute power crisis in the state caused by the short-sightedness of the anti-people BJP-JJP government. Government has pushed the state into an abyss due to their ill-conceived policies”, Hooda said while launching …", "url": "https://indianexpress.com/article/cities/chandigarh/hooda-bhan-hold-vipaksh-aapke-samaksh-programme-7896759/", "urlToImage": "https://images.indianexpress.com/2022/04/Hooda-Bhan.jpg", "publishedAt": "2022-05-01T22:09:36Z", "content": "In the first display of unity, CLP leader Bhupinder Singh Hooda and HPCC president Udai Bhan held a Vipaksh Aapke Samaksh programme in Faridabad on Sunday.Earlier, Hooda had been conducting these pro… [+3214 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shubhajit Roy", "title": "Explained: The significance of PM Modi’s Europe tour", "description": "Modi will be visiting Germany, Denmark and France from today. What will be on the table in the context of the Ukraine crisis, and economic and defence ties?", "url": "https://indianexpress.com/article/explained/explained-the-significance-of-pm-modis-europe-tour-7896689/", "urlToImage": "https://images.indianexpress.com/2022/05/Modi-3-1-1-2.jpg", "publishedAt": "2022-05-01T22:05:18Z", "content": "Prime Minister Narendra Modi is travelling to Germany, Denmark and France from May 2 to 4. His first foreign trip this year, it comes at a time when a war in the heart of Europe has upended seven dec… [+6588 chars]"}]}