{"status": "ok", "totalResults": 405, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Toppers hail teachers for holding online classes during pandemic", "description": "Schools in the state had reopened in November last year after a gap of 20 months and only students of classes 9 to 12 were allowed to take physical classes. But they were shut again in January following a rapid rise in the infection cases in the state.", "url": "https://indianexpress.com/article/cities/kolkata/toppers-hail-teachers-for-holding-online-classes-during-pandemic-7951980/", "urlToImage": "https://images.indianexpress.com/2022/06/3-KOL-Students-of-Saraswati-Balika-Vidyalaya-and-Shilpa-Sikha-Sadan-4COL-1-1.jpg", "publishedAt": "2022-06-04T00:51:08Z", "content": "Toppers of the class 10 state board examination (Madhyamik), the results for which were declared by the West Bengal Board of Secondary Education (WBBSE) on Friday, credited their teachers for their s… [+2348 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pranav Mukul", "title": "No boarding denial to differently abled sans seeking medical opinion: DGCA draft", "description": "Last month, IndiGo disallowed a specially-abled child from boarding its Hyderabad-bound flight at Ranchi Airport citing potential threat to air safety.", "url": "https://indianexpress.com/article/business/aviation/no-boarding-denial-to-differently-abled-sans-seeking-medical-opinion-dgca-draft-7951975/", "urlToImage": "https://images.indianexpress.com/2022/06/indigo-1200.jpg", "publishedAt": "2022-06-04T00:41:15Z", "content": "In the aftermath of the Ranchi Airport incident, where low-cost airline IndiGo denied boarding to a specially-abled passenger, the countrys aviation safety regulator DGCA has moved to amend its rules… [+2654 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "ISIS operative gets life term for plotting attack on foreigners in Kolkata", "description": "Musa, a resident of Labhpur in West Bengal’s Birbhum district, was arrested on July 4, 2016, from the Burdwan railway station by the state police's CID wing for allegedly radicalising youth to join the ISIS.", "url": "https://indianexpress.com/article/cities/kolkata/isis-operative-gets-life-term-for-plotting-attack-on-foreigners-in-kolkata-7951974/", "urlToImage": "https://images.indianexpress.com/2022/06/gavel-2-3-3.jpg", "publishedAt": "2022-06-04T00:40:13Z", "content": "A special NIA court on Friday sentenced Mohammad Mosiuddin, alias Musa to life imprisonment for plotting an ISIS-style attack on foreigners visiting the headquarters of the Missionaries of Charity in… [+2607 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "Singapore regulator raises issues over Tata takeover of AI", "description": "This is because the CCCS has observed that Air India and Vistara, which is a 51:49 joint venture between Tata Group and Singapore Airlines, are two of the three key market players along overlapping air passenger and air cargo transport routes.", "url": "https://indianexpress.com/article/business/aviation/singapore-regulator-raises-issues-over-tata-takeover-of-ai-7951971/", "urlToImage": "https://images.indianexpress.com/2022/06/air-india.jpg", "publishedAt": "2022-06-04T00:36:50Z", "content": "Tata Group will need to convince Singapores Competition and Consumer Commission (CCCS) that its takeover of Air India does not violate the countrys anti-competition laws.This is because the CCCS has … [+721 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Amid students’ protests, CU syndicate says will go ahead with offline exams", "description": "Although the university is yet to declare the dates for the UG and PG exams, the authorities have directed the affiliated colleges to hold special classes and complete the syllabus before the students take the offline exams.", "url": "https://indianexpress.com/article/cities/kolkata/amid-students-protests-cu-syndicate-says-will-go-ahead-with-offline-exams-7951969/", "urlToImage": "https://images.indianexpress.com/2022/06/calcutta-university-1200.jpg", "publishedAt": "2022-06-04T00:36:07Z", "content": "Despite protests by a section of students seeking online examinations, Calcutta University authorities have decided to continue with the offline exams for the final semesters of undergraduate and pos… [+1875 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Southwest monsoon advances into Bengal", "description": "The weatherman forecast heavy to very heavy rainfall in the districts of Cooch Behar, Jalpaiguri, Alipurduar, Darjeeling and Kalimpong till June 8 morning owing to the onset of the monsoon.", "url": "https://indianexpress.com/article/cities/kolkata/southwest-monsoon-advances-into-bengal-7951965/", "urlToImage": "https://images.indianexpress.com/2022/06/rainfall-759.jpg", "publishedAt": "2022-06-04T00:31:59Z", "content": "The southwest monsoon Friday advanced into West Bengal, at least four days ahead of its normal onset date and has covered some parts of the sub-Himalayan districts of the state, the Met department sa… [+696 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "Demand offsets price rise, services PMI at 11-year high", "description": "The growth was led by substantial pick-up in new business growth amid demand recovering following the reopening of the economy after the Covid lockdowns.", "url": "https://indianexpress.com/article/business/economy/demand-offsets-price-rise-services-pmi-at-11-year-high-7951961/", "urlToImage": "https://images.indianexpress.com/2022/06/sp.jpg", "publishedAt": "2022-06-04T00:26:58Z", "content": "The countrys services sector expanded at the fastest pace in 11 years in May on strong demand and new orders despite inflationary pressures touching new highs, according to a survey."}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Australia seeks framework for univs to set up campuses", "description": "A delegation led by Australian Deputy High Commissioner to India Sarah Storey made the suggestion during a meeting with UGC chairperson Prof M Jagadesh Kumar on Friday, the commission said.", "url": "https://indianexpress.com/article/india/australia-seeks-framework-for-univs-to-set-up-campuses-7951962/", "urlToImage": "https://images.indianexpress.com/2022/06/UGC-2.jpg", "publishedAt": "2022-06-04T00:26:38Z", "content": "Australia has requested the University Grants Commission (UGC) to create a dedicated regulatory framework to allow foreign higher educational institutes set up campuses in India.A delegation led by A… [+868 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "CM inaugurates Hooghly overbridge, row over ‘snub’ to railway minister", "description": "The development came days after the Railway Minister attended a ‘Gareeb Kalyan Sammelan’ in Kolkata to mark the completion of eight years of the Modi government, but the CM or any senior state ministers were \"not invited\".", "url": "https://indianexpress.com/article/cities/kolkata/cm-inaugurates-hooghly-overbridge-row-over-snub-to-railway-minister-7951958/", "urlToImage": "https://images.indianexpress.com/2022/06/Mamata-Banerjee-1.jpg", "publishedAt": "2022-06-04T00:25:58Z", "content": "A controversy erupted after Chief Minister Mamata Banerjee on Friday inaugurated a railway overbridge at Kamarkundu Railway Station in Hooghly without extending an invitation to Union Railway Ministe… [+5781 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "PSI scam affects moral fibre of society: court", "description": "The sessions court has cited a 2017 judgment by the Supreme Court in the State of Bihar vs Amith Kumar alias Bacha Rai case to turn down the bail pleas.", "url": "https://indianexpress.com/article/cities/bangalore/psi-scam-affects-moral-fibre-of-society-court-7951950/", "urlToImage": "https://images.indianexpress.com/2022/06/2021-04-171-4.jpg", "publishedAt": "2022-06-04T00:22:18Z", "content": "It is a case of a recruitment scam by manipulating the OMR sheets to deprive deserving candidates who have honestly worked hard for the examination for selection. Therefore, it is a socio-economic of… [+252 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "West Bengal: Class 10 Madhyamik results out, pass percentage reaches all-time high at 86.6", "description": "A total of 10,98,775 students appeared in the examination that took place from March 7 to 16 this year and out of them, 9,49,927 were declared successful.", "url": "https://indianexpress.com/article/cities/kolkata/bengal-class-10-madhyamik-results-out-pass-percentage-reaches-all-time-high-at-86-6-7951953/", "urlToImage": "https://images.indianexpress.com/2022/06/WBBSE-Madhyamik-Results-2-1.jpg", "publishedAt": "2022-06-04T00:12:03Z", "content": "The first Madhyamik examination conducted post-Covid pandemic by the West Bengal Board of Secondary Education (WBBSE) in March has recorded a pass percentage of 86.6 an all-time high in the history o… [+3490 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "IE Thinc Gender series: ‘Link skills with opportunity to access markets’", "description": "At the second edition of the IE Thinc Gender series, presented by The Indian Express with IWWAGE and Krea University,  panellists argued for talent to be gender-agnostic. The session was moderated by Rinku Ghosh, Editor, Special Projects.", "url": "https://indianexpress.com/article/india/ie-thinc-gender-series-link-skills-with-opportunity-to-access-markets-7951939/", "urlToImage": "https://images.indianexpress.com/2022/06/WhatsApp-Image-2022-05-31-at-10-1.jpg", "publishedAt": "2022-06-04T00:03:22Z", "content": "Abhishek Singh: Only 38 per cent of women have bank accounts because traditionally, they have not been given the opportunity to assert themselves as heads of families or claim land rights. Under gove… [+7881 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Arun Sharma", "title": "Employees start returning to Jammu’s Jagti township", "description": "An employee who reached home in Jagti said there was an atmosphere of fear, making it difficult for the minorities to stay in the Valley. “As we heard about the killing of a bank employee, we immediately left,’’ he said, adding that 40-50 families have return…", "url": "https://indianexpress.com/article/cities/srinagar/employees-start-returning-to-jammus-jagti-township-7951949/", "urlToImage": "https://images.indianexpress.com/2021/10/kashmir-migrants.jpg", "publishedAt": "2022-06-04T00:01:40Z", "content": "Amid a spate of targeted killings, employees belonging to the minority community, especially Kashmiri Pandits posted in the Valley under PMs employment package, have started returning to their homes … [+2622 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "41 elected unopposed to RS; Sibal, Chidambaram, Jayant among them", "description": "Of the 41 candidates who won unopposed, 11 are from Uttar Pradesh – eight from the BJP, one each from SP and RLD and Sibal, an independent backed by the Samajwadi Party.", "url": "https://indianexpress.com/article/india/41-elected-unopposed-to-rs-sibal-chidambaram-jayant-among-them-7951946/", "urlToImage": "https://images.indianexpress.com/2022/06/sibal.jpg", "publishedAt": "2022-06-03T23:56:35Z", "content": "Senior Congress leader P Chidambaram, former Congress leader Kapil Sibal, RLD chief Jayant Chaudhary, RJDs Misa Bharti, BJDs Sasmit Patra and YSRCP’s V Vijayasai Reddy were among the 41 candidates fr… [+2264 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "For first time in two decades, Maharashtra to witness poll for an RS seat", "description": "On Friday, the last day of withdrawing nominations, none of the seven candidates in the fray – four of the MVA and three of BJP – withdrew their nomination.", "url": "https://indianexpress.com/article/cities/mumbai/for-first-time-in-two-decades-maharashtra-to-witness-poll-for-an-rs-seat-7951921/", "urlToImage": "https://images.indianexpress.com/2022/06/parliament-1.jpg", "publishedAt": "2022-06-03T23:55:36Z", "content": "The BJP in Maharashtra Friday refused to withdraw its third candidate for the June 10 Rajya Sabha polls, setting the stage for a contest with the Shiv Sena for the sixth seat. The development is also… [+1132 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "SRINIVAS JANYALA", "title": "KCR lists out state’s achievements, says GSDP doubled in 8 yrs+", "description": "The Chief Minister said since it was formed, Telangana has registered qualitative growth in agriculture, irrigation, power, education and health. “In 2014-15, the state’s per capita income was Rs 1,24,104. It increased to Rs 2,78,833 in 2021-2022,” he said.", "url": "https://indianexpress.com/article/cities/hyderabad/kcr-lists-out-states-achievements-says-gsdp-doubled-in-8-yrs-7951935/", "urlToImage": "https://images.indianexpress.com/2022/05/KCR-1200.jpg", "publishedAt": "2022-06-03T23:43:48Z", "content": "TELANGANA HAS doubled its Gross State Domestic Product (GSDP) from Rs 5,05,849 crore in 2013-14 to Rs 11,54,860 crore in 2021-22, Chief Minister K Chandrashekar Rao has said.On the occasion of the 9t… [+1708 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Certificates issued by Arya Samaj not valid proof of marriage: SC", "description": "The petitioner's counsel contended that the prosecutrix in the rape case was a major, married to the accused. The counsel added the marriage was conducted at the Arya Samaj.", "url": "https://indianexpress.com/article/cities/delhi/certificates-issued-by-arya-samaj-not-valid-proof-of-marriage-sc-7951934/", "urlToImage": "https://images.indianexpress.com/2022/05/supreme-court-1-4.jpg", "publishedAt": "2022-06-03T23:37:05Z", "content": "The Supreme Court on Friday declined to accept a certificate issued by the Arya Samaj as proof of marriage, saying issuing such certificates was not the sect’s job but that of the authorities.A vacat… [+1684 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Journalist shot at in Aligarh: Cops", "description": "The journalist, Mukesh Gupta, was having dinner on Thursday night when he was shot at, they said. He was taken to Jawaharlal Nehru Medical College Hospital, police said.", "url": "https://indianexpress.com/article/cities/lucknow/journalist-shot-at-in-aligarh-cops-7951931/", "urlToImage": "https://images.indianexpress.com/2022/06/Indian-Express-10.jpeg", "publishedAt": "2022-06-03T23:33:59Z", "content": "A journalist with a private news channel was shot at by an unidentified person at a restaurant here, police said on Friday.The journalist, Mukesh Gupta, was having dinner on Thursday night when he wa… [+697 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Gayathri Mani", "title": "Three underpasses to help ease traffic on Outer Ring Road, deadline Sept 2023", "description": "“Two underpasses are for motorised vehicles and one for non-motorised vehicles such as cycles, e-rickshaws and pedestrians,” said the official.", "url": "https://indianexpress.com/article/cities/delhi/three-underpasses-to-help-ease-traffic-on-outer-ring-road-deadline-sept-2023-7951927/", "urlToImage": "https://images.indianexpress.com/2020/11/pollution-delhi-3.jpg", "publishedAt": "2022-06-03T23:33:39Z", "content": "In a bid to decongest the Outer Ring Road area near Mukarba Chowk, the Public Works Department (PWD) is planning to construct three underpasses in the area as well as a ramp from Badli junction to Ha… [+2509 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Cop booked over ‘missing’ history-sheet of ex-MLA, kin", "description": "The move comes on the basis of an inquiry conducted by the Etah police after the history-sheet was untraceable, said an officer.", "url": "https://indianexpress.com/article/cities/lucknow/cop-booked-over-missing-history-sheet-of-ex-mla-kin-7951929/", "urlToImage": "https://images.indianexpress.com/2022/06/cop-2-1-17.jpg", "publishedAt": "2022-06-03T23:29:28Z", "content": "AN FIR was registered against a police constable in Etah after the historysheet of former Samajwadi Party (SP) MLA Rameshwar Singh Yadav and his younger brother Ramnath Yadav, a former block pramukh,… [+1211 chars]"}]}