{"status": "ok", "totalResults": 425, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Yubaraj Ghimire", "title": "Nepal local bodies poll today, violation of code of conduct worries EC", "description": "A little less than 18 million voters will elect around 35,000 office bearers, including mayors and deputy mayors of six metropolitan, 16 sub-metropolitan and 753 'Gaupalikas' (village units)  across the country.", "url": "https://indianexpress.com/article/world/nepal-local-bodies-poll-today-violation-of-code-of-conduct-worries-ec-7914634/", "urlToImage": "https://images.indianexpress.com/2022/05/voting-1200-4.jpg", "publishedAt": "2022-05-12T23:11:26Z", "content": "Nepal  will hold elections to the local bodies for the second time after a new constitution was promulgated in September 2015 on Friday.A little less than 18 million voters will elect around 35,000 o… [+871 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Avinash Nair", "title": "4th hike in 5 months: Gujarat govt raises fuel surcharge to Rs 2.50 per unit", "description": "According to state-run Gujarat Urja Vikas Nigam Limited (GUVNL) the hike in Fuel and Power Purchase Price Adjustment (FPPPA) Charges or the fuel surcharge will be effective from May 1, 2022, and will be recovered from the May-June 2022 electricity bills of co…", "url": "https://indianexpress.com/article/cities/ahmedabad/4th-hike-in-5-months-gujarat-govt-raises-fuel-surcharge-to-rs-2-50-per-unit-7914630/", "urlToImage": "https://images.indianexpress.com/2022/05/electricity.jpg", "publishedAt": "2022-05-12T23:07:29Z", "content": "Gujarat government raised fuel surcharges by 20 paise to Rs 2.50, applicable on every unit of electricity consumed, for the fourth time in the last five months. This hike will impact electricity bill… [+3695 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "BJP MP leaves for Delhi, to discuss issues with Textiles Minister Piyush Goyal", "description": "Goyal's call came just a day after the Calcutta High Court directed the Jute Commissioner to “review and re-fix” the rate of raw jute. “Our discussion will be based on the lines of the court order,” said Singh.", "url": "https://indianexpress.com/article/cities/kolkata/bjp-mp-leaves-for-delhi-to-discuss-issues-with-textiles-minister-piyush-goyal-7914628/", "urlToImage": "https://images.indianexpress.com/2022/05/Arjun-Singh-latest-1.jpg", "publishedAt": "2022-05-12T22:52:49Z", "content": "BJP MP from Barrackpore Arjun Singh left for Delhi on Thursday afternoon following a call from Union Textiles Minister Piyush Goyal to discuss issues concerning the jute price capping.I received a ph… [+1982 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Harish Damodaran, Parthasarathi Biswas", "title": "Glimmer of hope: Pulses, milk prices fall", "description": "The average price of skim milk powder (SMP) at the Global Dairy Trade fortnightly auction platform hit a high of $4,599 per tonne on April 5, almost twice its early-May 2020 low of $2,373. But that price has since eased to $4,130 per tonne in the latest May 3…", "url": "https://indianexpress.com/article/india/glimmer-of-hope-pulses-milk-prices-fall-7914488/", "urlToImage": "https://images.indianexpress.com/2022/05/Pulses.jpg", "publishedAt": "2022-05-12T22:34:02Z", "content": "IS THE worst of food inflation 8.38 per cent year-on-year in April over? Some hope is provided by milk, which has the highest weight among food items in the consumer price index after cereals. And al… [+3833 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Akhilesh meets jailed SP workers, ‘skips’ meeting Azam Khan", "description": "Interestingly, Akhilesh's visit came days after criticism from the camp of jailed senior party leader Azam Khan for not meeting him and helping him in getting released from jail.", "url": "https://indianexpress.com/article/cities/lucknow/akhilesh-meets-jailed-sp-workers-skips-meeting-azam-khan-7914626/", "urlToImage": "https://images.indianexpress.com/2022/05/Akhilesh-Azamgarh.jpg", "publishedAt": "2022-05-12T22:32:44Z", "content": "SAMAJWADI PARTY (SP) president Akhilesh Yadav on Wednesday met party workers who are lodged in Azamgarh district jail in connection with cases related to elections. Interestingly, Akhilesh’s visit ca… [+1399 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "Debating the exception", "description": "Split verdict in high court on marital rape mirrors deep differences. It also opens up a larger conversation", "url": "https://indianexpress.com/article/opinion/editorials/split-verdict-in-high-court-on-marital-rape-mirrors-deep-differences-7914409/", "urlToImage": "https://images.indianexpress.com/2022/05/editorial-7.jpeg", "publishedAt": "2022-05-12T22:31:29Z", "content": "The Delhi High Courts split verdict in the case challenging the validity of the marital rape exemption in law mirrors the deep public divide on an issue that involves not just the letter of the law b… [+2456 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kamaal Saiyed", "title": "Opp leader told me ‘PM twice, what more’, but I can’t rest: Narendra Modi", "description": "Speaking virtually at the Utkarsh Samaroh in Bharuch, where beneficiaries of four Central Government schemes were assembled, Modi said: “Once I met a leader...he is a very senior leader...he has been a political opponent, but I do respect him. One day, he cam…", "url": "https://indianexpress.com/article/india/opp-leader-told-me-pm-twice-what-more-but-i-cant-rest-narendra-modi-7914493/", "urlToImage": "https://images.indianexpress.com/2022/05/Modi-.jpg", "publishedAt": "2022-05-12T22:30:20Z", "content": "Hinting that he was ready for another term, Prime Minister Narendra Modi said on Thursday that a very senior Opposition leader, whom he respects, had once asked what else was left for him to accompli… [+2567 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "FY22: 93.7% rise in new manufacturing projects, says Bank of Baroda study", "description": "'Services and the construction sector still seem to be lagging from losses suffered during multiple waves of Covid-19 pandemic, with new project announcements running below their pre-pandemic levels'", "url": "https://indianexpress.com/article/business/commodities/fy22-93-7-rise-in-new-manufacturing-projects-says-bank-of-baroda-study-7914512/", "urlToImage": "https://images.indianexpress.com/2022/05/factory-output.jpg", "publishedAt": "2022-05-12T22:29:24Z", "content": "New project announcements in the manufacturing sector have improved significantly to Rs 6.2 lakh crore in FY22, a rise of 93.75 per cent, as against Rs 3.2 lakh crore in FY20, a Bank of Baroda (BoB) … [+646 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "‘Low-income strata less impacted by inflation, show consumption trends’", "description": "Data released on Thursday showed that retail inflation surged to a 95-month high of 7.97 per cent in April on the back of high fuel, food prices and services. Rural inflation surged to an 8-year high in April, while urban inflation rose to 18-month high.", "url": "https://indianexpress.com/article/business/commodities/low-income-strata-less-impacted-by-inflation-show-consumption-trends-7914508/", "urlToImage": "https://images.indianexpress.com/2022/05/RBi-1-2-1.jpg", "publishedAt": "2022-05-12T22:28:23Z", "content": "Inflation is expected to be elevated in 2022-23 and mitigating action taken by the government and the Reserve Bank of India (RBI) may reduce its duration, the Finance Ministry said in its monthly eco… [+3315 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "The turtle’s way", "description": "Lessons on how to take it easy from a wandering, meandering seafarer", "url": "https://indianexpress.com/article/opinion/editorials/lessons-on-how-to-take-it-easy-from-a-wandering-meandering-seafarer-7914400/", "urlToImage": "https://images.indianexpress.com/2022/05/editorial-6.jpeg", "publishedAt": "2022-05-12T22:25:46Z", "content": "There’s many a way to navigate the open sea, even sans GPS or a compass. On a clear night, the prow can be steered according to the North Star. During the day, a keen ornithologist can figure out the… [+1640 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "May 13, 1982, Forty Years Ago: Falkland Battle", "description": "Two Argentine military planes were shot while attacking a British ship off the disputed Falkland Islands, the Defence Ministry announced. The ministry spokesperson reporting the action said three planes attacked the ship.", "url": "https://indianexpress.com/article/opinion/editorials/forty-years-ago-falkland-battle-7914394/", "urlToImage": "https://images.indianexpress.com/2022/05/13-May1982_IE_001.jpg", "publishedAt": "2022-05-12T22:21:04Z", "content": "Two Argentine military planes were shot while attacking a British ship off the disputed Falkland Islands, the Defence Ministry announced. The ministry spokesperson reporting the action said three pla… [+473 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Nirupama Subramanian", "title": "Explained: For 5th-time Lanka PM, political and economic challenge like no other", "description": "This is Wickremesinghe’s fifth time in the office. Each of his earlier terms was truncated, and on two of those occasions he was dismissed by the President — by Chandrika Kumaratunga in 2004, and by Maithripala Sirisena in 2018.", "url": "https://indianexpress.com/article/explained/explained-for-5th-time-lanka-pm-political-and-economic-challenge-like-no-other-7914502/", "urlToImage": "https://images.indianexpress.com/2022/05/Ranil-Wickremesinghe.jpg", "publishedAt": "2022-05-12T22:16:39Z", "content": "A month ago, in an interview to The Indian Express, Ranil Wickremesinghe said he would stay out if asked to become Prime Minister of Sri Lanka again, as he did not have the numbers to form a governme… [+5834 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "DYFI meet: Learn from Lanka stir, CPM urges youths", "description": "“This rally has proved that those evicted from their houses by the ruling party after the Assembly election results are still on the road, and they are fighting. Today, we have to take an oath that we will make history in this state,” added Salim.", "url": "https://indianexpress.com/article/cities/kolkata/dyfi-meet-learn-from-lanka-stir-cpm-urges-youths-7914625/", "urlToImage": "https://images.indianexpress.com/2022/05/YechuryDYFI-4col.jpg", "publishedAt": "2022-05-12T22:14:52Z", "content": "Addressing a Democratic Youth Federation of India’s (DYFI) rally just before the inauguration of an all-India conference of its youth wing on Thursday, CPI(M) West Bengal State Secretary Md Salim cal… [+1571 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pune: Con man dupes businessman of Rs 1.25 lakh in online fraud", "description": "The businessman got a call from the con man in October 2021, asking him to create a 'trading account' for investing money through a website.", "url": "https://indianexpress.com/article/cities/pune/pune-con-man-dupes-businessman-of-rs-1-25-lakh-in-online-fraud-7914623/", "urlToImage": "https://images.indianexpress.com/2022/05/cyber-crime.jpg", "publishedAt": "2022-05-12T22:10:41Z", "content": "Online fraudsters duped a Pune-based businessman of Rs 12.5 lakh by making him download a ‘remote desktop’ software on his cell phone after making false promises of huge profits through an online tra… [+1556 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "West Bengal: Sworn in as MLA, Babul Supriyo inducted into 4 Assembly panels", "description": "The former Union minister, who quit the BJP for the TMC last year, was absorbed as member of Home, Personnel and Administrative Reforms, Law and Correctional Administration standing committees of the House.", "url": "https://indianexpress.com/article/cities/kolkata/west-bengal-sworn-in-as-mla-babul-supriyo-inducted-into-4-assembly-panels-7914620/", "urlToImage": "https://images.indianexpress.com/2022/05/Babul-Supriyo-1200.jpg", "publishedAt": "2022-05-12T22:09:48Z", "content": "Day after  being read his oath of office by the Deputy Speaker, TMC MLA Babul Supriyo was on Thursday inducted into four standing committees of the Assembly.The former Union minister, who quit the BJ… [+1419 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Divya A", "title": "Court order on Kashi Vishwanath Temple-Gyanvapi Mosque site in Varanasi: history and context", "description": "The site is currently opened for Hindu prayers once a year — on the fourth day of the chaitra navratri in April. The petitioners have also sought permission to pray to other “visible and invisible deities within the old temple complex”.", "url": "https://indianexpress.com/article/explained/court-order-on-kashi-vishwanath-temple-gyanvapi-mosque-site-in-varanasi-history-and-context-7914495/", "urlToImage": "https://images.indianexpress.com/2022/05/Kashi-Vishwanath-Gyanvapi-1-1.jpg", "publishedAt": "2022-05-12T22:07:45Z", "content": "A Varanasi court on Thursday ordered that the video survey of the Gyanvapi Mosque located next to the Kashi Vishwanath Temple be resumed and a report submitted by May 17. The court had ordered the in… [+3540 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "In a first, India successfully launches Extended Range Version of BrahMos missile from Sukhoi", "description": "“The launch from the aircraft was as planned and the missile achieved a direct hit on the designated target in the Bay of Bengal region. It was the first launch of an Extended Range version of BrahMos missile from Su-30MKI aircraft,” said a statement from the…", "url": "https://indianexpress.com/article/cities/pune/in-a-first-india-successfully-launches-extended-range-version-of-brahmos-missile-from-sukhoi-7914621/", "urlToImage": "https://images.indianexpress.com/2022/05/brahmos-1.jpg", "publishedAt": "2022-05-12T22:04:40Z", "content": "A successful maiden launch of the Extended Range Version of BrahMos Air Launched was carried out by India on Thursday, which saw themissile set off from the Indian Air Force’s frontline fighter Sukho… [+2245 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuradha Mascarenhas", "title": "More Indians are anaemic than before, 67 pc children under 5 affected: NFHS-5", "description": "According to the survey report, at least 67 per cent children (6-59 months) have anaemia as compared to 58.6 per cent in the last survey conducted in 2015-16.", "url": "https://indianexpress.com/article/cities/pune/more-indians-are-anaemic-than-before-67-pc-children-under-5-affected-nfhs-5-7914613/", "urlToImage": "https://images.indianexpress.com/2021/11/kids.jpg", "publishedAt": "2022-05-12T21:57:30Z", "content": "An increasing number of people across all population groups, including children below five years, adolescent girls and boys, and pregnant women, is being affected by anaemia, findings from the fifth … [+4665 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Missing 20-year-old PDEU student’s body found in Narmada canal", "description": "According to police, the victim Aman Das, a resident of Chandkheda in Ahmedabad, who was in his sixth semester of a BTech course at PDEU, had gone missing from his university campus on Wednesday evening.", "url": "https://indianexpress.com/article/cities/ahmedabad/missing-20-year-old-pdeu-students-body-found-in-narmada-canal-7914618/", "urlToImage": "https://images.indianexpress.com/2022/05/IE-79-15.jpeg", "publishedAt": "2022-05-12T21:48:42Z", "content": "The body of a 20-year-old student of Gandhinagar-based Pandit Deendayal Energy University (PDEU) was recovered from Narmada canal in Sughad area on Thursday, a day after he went missing.According to … [+1368 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "14 state leaders in Udaipur to attend Cong’s chintan shivir", "description": "“14 Gujarat Congress senior leaders have already reached Udaipur for the  Chintan Shivir. The camp will focus on the roadmap for the 2024 General elections and various proposals ,” said Manish Doshi, spokesperson, GPCC.", "url": "https://indianexpress.com/article/cities/ahmedabad/14-state-leaders-in-udaipur-to-attend-congs-chintan-shivir-7914616/", "urlToImage": "https://images.indianexpress.com/2022/05/Jagdish-Thakor.jpg", "publishedAt": "2022-05-12T21:45:42Z", "content": "Ahead of the three day ‘Chintan Shivir’ of Congress scheduled in Udaipur of Rajasthan from Friday, as many as 14 senior leaders of Gujarat Congress arrived in the city on Thursday evening for the ses… [+754 chars]"}]}