{"status": "ok", "totalResults": 426, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "‘Passion can tell what one’s purpose in life can be’: Imtiaz Ali", "description": "“In the orderliness, it is usually the ordinariness that is promoted,” Ali says in this speech", "url": "https://indianexpress.com/article/lifestyle/life-positive/imtiaz-ali-life-positive-films-motivational-7971797/", "urlToImage": "https://images.indianexpress.com/2022/06/Imtiaz-Ali-1200.jpg", "publishedAt": "2022-06-16T02:50:37Z", "content": "A general question that has been pestering many humans for a while now is, what is our purpose in life? It is a task that we have been assigned to find. Everyone has dreams and passions to fulfill wh… [+1502 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "National Herald case: BJP misusing central agencies for narrow ends, says Bansal", "description": "Rahul Gandhi ED: “The unending quizzing of Congress leader Rahul Gandhi on the basis of baseless allegations is one such example of unbridled highhandedness of the Enforcement Directorate (ED),\" former union minister Pawan Kumar Bansal said.", "url": "https://indianexpress.com/article/cities/chandigarh/rahul-gandhi-national-herald-case-ed-bjp-congress-central-agencies-7972548/", "urlToImage": "https://images.indianexpress.com/2022/06/PAWAN-KUMAR-BANSAL.jpg", "publishedAt": "2022-06-16T02:32:30Z", "content": "All India Congress Committee (AICC) treasurer and former union minister Pawan Kumar Bansal reprimanded the BJP government alleging misuse of law enforcement agencies just to achieve its narrow and pa… [+1971 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Chennai power cut: These parts of city to face power disruption today", "description": "Chennai power disruption June 16, Thursday: Parts of Chennai will face a power cut from 9 am to 2 pm for maintenance work today.", "url": "https://indianexpress.com/article/cities/chennai/chennai-power-cut-these-parts-of-city-to-face-power-disruption-today-7972538/", "urlToImage": "https://images.indianexpress.com/2022/06/electricity-reuters-1200-2-1-8.jpeg", "publishedAt": "2022-06-16T02:12:01Z", "content": "The Tamil Nadu Generation and Distribution Corporation (Tangedco) has announced that power will be suspended in parts of Chennai today in Mylapore, Ambattur, Porur, Kilpuak and Sembium, Tambaram, Gui… [+2322 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Dakota Johnson-starrer Persuasion sets July 15 premiere date on Netflix", "description": "The story of Persuasion revolves around Anne Elliot (Dakota Johnson), an isolated 27-year-old struggling to move on after she broke her engagement with Frederick Wentworth (Cosmo Jarvis), after being persuaded by family friend Lady Russell (Nikki Amuka-Bird).", "url": "https://indianexpress.com/article/entertainment/hollywood/dakota-johnson-starrer-persuasion-sets-july-15-premiere-date-on-netflix-7971553/", "urlToImage": "https://images.indianexpress.com/2022/06/Persuasion-movie-1200by667.jpg", "publishedAt": "2022-06-16T01:30:12Z", "content": "Streaming service Netflix has announced that Persuasion, the film adaptation of author Jane Austen’s classic novel, will release on its platform on July 15. Hollywood star Dakota Johnson headlines th… [+1930 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Vadodara: Rusticated MSU student writes to PM Modi seeking help", "description": "In his letter addressed to the PM, Kundan Kumar Mahato, who was a student of Masters of Visual Arts of the Sculpture department of the Faculty of Fine Arts, stated that his artwork was intended to be the “voice against the violence and injustice that happen t…", "url": "https://indianexpress.com/article/cities/baroda/vadodara-rusticated-msu-student-writes-to-pm-modi-seeking-help-7972537/", "urlToImage": "https://images.indianexpress.com/2022/05/MSU-.jpg", "publishedAt": "2022-06-16T01:12:08Z", "content": "Former fine arts student of Vadodaras MS University, who was debarred on May 13 following a controversy over his artwork, has written to Prime Minister Narendra Modi, seeking his intervention in the … [+1901 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Drinking coffee does not raise risk during pregnancy: study", "description": "The researchers referred to WHO guidelines that pregnant women should drink less than 300 mg of caffeine (two to three cups) per day.", "url": "https://indianexpress.com/article/explained/drinking-coffee-pregnancy-risk-explained-7972523/", "urlToImage": "https://images.indianexpress.com/2022/06/coffee.jpg", "publishedAt": "2022-06-16T00:34:33Z", "content": "A new genetics-based study from the University of Queensland, published in the International Journal of Epidemiology, has found that drinking coffee during pregnancy didnt increase the risk of miscar… [+36 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "মন্দির দেয় বৃষ্টির নির্ভুল পূর্বাভাস, বুদ্ধিতে যার ব্যাখ্যা মেলে না", "description": "এই মন্দিরের একটা বিশেষত্ব রয়েছে। যা দেখে রীতিমতো তাজ্জব হয়ে যান ভক্তরা।", "url": "https://bengali.indianexpress.com/lifestyle/kanpur-rain-predicting-jagannath-temple-457374/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/kanpur-rain-temple.jpg", "publishedAt": "2022-06-16T00:30:00Z", "content": "- , , , \r\n , - \r\n , , \r\n - , ?\r\n, ? , , , , , , \r\n , , , , , , , , ‘ ’ ‘ ’ \r\nStay updated with the latest news headlines and all the latest Lifestyle news download Indian Express Bengali App.\r\nWeb Ti… [+43 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Primary teacher recruitment scam: Set up SIT led by joint director, HC tells CBI", "description": "The court also directed that the SIT members cannot be transferred until the conclusion of the probe.", "url": "https://indianexpress.com/article/cities/kolkata/primary-techers-recruitment-scam-set-up-sit-led-by-joint-director-hc-tells-cbi-7972508/", "urlToImage": "https://images.indianexpress.com/2022/05/Calcutta-High-Court-2.jpg", "publishedAt": "2022-06-16T00:15:49Z", "content": "THE CALCUTTA High Court on Wednesday ordered that a CBI special investigation team (SIT) under a joint director of its anti-corruption branch be set up to probe alleged irregularities in the recruitm… [+2115 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mohali continues to reel under long power outages", "description": "Due to a fire in the power grid in Phase 1 on Tuesday, the supply was affected in many residential and industrial areas of Mohali, with residents shelling out money for costly diesel for their generators.", "url": "https://indianexpress.com/article/cities/sas-nagar-mohali/mohali-continues-to-reel-under-long-power-outages-7972519/", "urlToImage": "https://images.indianexpress.com/2022/06/electricity-reuters-1200-2-1-2.jpeg", "publishedAt": "2022-06-16T00:09:25Z", "content": "The power supply in many areas of Mohali and Kharar on Wednesday was affected leaving residents irked in the scorching heat.Due to a fire in the power grid in Phase 1 on Tuesday, the supply was affec… [+1639 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "CHANDIGARH", "title": "Sippy Sidhu murder: ‘Step towards justice’ after many ups & downs", "description": "Prior to handing over the investigation to the CBI, accused Kalyani Singh, who was then a prime suspect, was grilled twice by the Chandigarh Police at police lines, Sector 26, in October 2016. The second questioning of Kalyani Singh was videotaped.", "url": "https://indianexpress.com/article/cities/chandigarh/sippy-sidhu-murder-step-towards-justice-after-many-ups-downs-7972514/", "urlToImage": "https://images.indianexpress.com/2022/06/sippy_sidhu_edited.jpg", "publishedAt": "2022-06-16T00:05:17Z", "content": "ALTHOUGH THE family of slain advocate Sukhmanpreet Singh aka Sippy Sidhu, 36, termed the arrest of Kalyani Singh, the daughter of Acting Chief Justice of Himachal Pradesh High Court, Sabina, a step t… [+3186 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Peter Vidal", "title": "Horoscope Today, June 16 2022: Capricorn, Leo, Libra and other signs — check astrological prediction", "description": "Leo-- Daydream to your heart's content, and don't let other people make you feel strange for wanting to spend time by yourself. At work, it's very much who you know rather than what you know that carries you through. There's nothing wrong in exploiting person…", "url": "https://indianexpress.com/article/horoscope/horoscope-today-june-16-2022-capricorn-leo-libra-and-other-signs-check-astrological-prediction-7970272/", "urlToImage": "https://images.indianexpress.com/2022/06/horoscope-1-1.jpg", "publishedAt": "2022-06-15T23:48:58Z", "content": "ARIES (Mar 21 – Apr. 20)It’s a reasonably emotional day when all is said and done, and you may discover rare strains of sentimentality deep in your astrological psyche. Put family members first, and … [+3464 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Coal pilferage case: After Abhishek’s wife, CBI grills TMC MLA", "description": "According to CBI sources, the agency has found “discrepancies” in Saokat Molla's statements.", "url": "https://indianexpress.com/article/cities/kolkata/coal-pilferage-case-after-abhisheks-wife-cbi-grills-tmc-mla-7972506/", "urlToImage": "https://images.indianexpress.com/2022/06/Saokat-Molla.jpg", "publishedAt": "2022-06-15T23:28:56Z", "content": "TMC MLA Saokat Molla appeared before CBI officials at the CBI’s office in Kolkata on Wednesday in connection with an ongoing probe into the alleged coal pilferage case. He arrived at CBI office aroun… [+994 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Vallabh Ozarkar", "title": "MRSDC plans sculptures on mountain ranges to honour state’s heroes", "description": "The plan draws inspiration from Mount Rushmore in the USA, where massive rock sculptures of four American presidents – George Washington, Thomas Jefferson, Theodore Roosevelt and Abraham Lincoln – adorn a mountain range in South Dakota state.", "url": "https://indianexpress.com/article/cities/mumbai/mrsdc-plans-sculptures-on-mountain-ranges-to-honour-states-heroes-7972458/", "urlToImage": "https://images.indianexpress.com/2021/12/Western-Ghats.jpg", "publishedAt": "2022-06-15T23:19:30Z", "content": "Mountain ranges in Maharashtra may soon be dotted with sculptures, carved in rocks, of prominent figures from Indian history, as per the latest plan of the Maharashtra State Road Development Corporat… [+3040 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shubhajit Roy", "title": "Spanish Foreign Minister José Manuel Albares: ‘NATO must reach out to all countries like India which might be good partners’", "description": "Albares, when asked about possible discussions between India and the NATO, said, “It is not for me to decide, it is up to the UN Secretary General to decide that. But of course, a dialogue, certainly between NATO and India, is most welcome.”", "url": "https://indianexpress.com/article/india/spanish-foreign-minister-jose-manuel-albares-interview-nato-reach-out-all-countries-india-good-partners-7972243/", "urlToImage": "https://images.indianexpress.com/2022/06/Albares-Jaishankar.jpg", "publishedAt": "2022-06-15T23:08:47Z", "content": "AHEAD OF the NATO summit in Madrid on June 28, visiting Spanish Foreign Minister José Manuel Albares on Wednesday said that NATO (North Atlantic Treaty Organisation), which traditionally only looked … [+8915 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "West Bengal: Monsoon onset delayed, likely to hit south districts in 3 days, says weather department", "description": "“Conditions are favourable for the advancement of southwest monsoon in south Bengal within the next two to three days. Usually monsoon arrives by June 11, but this time it has been delayed by a few days,” G K Das, Director, Regional Meteorological Centre Kolk…", "url": "https://indianexpress.com/article/cities/kolkata/west-bengal-monsoon-onset-delayed-weather-department-7972496/", "urlToImage": "https://images.indianexpress.com/2022/05/Rain-in-Kolkata.jpg", "publishedAt": "2022-06-15T23:07:55Z", "content": "THE onset of monsoon, which has been delayed in West Bengal, would hit southern parts of the state, including Kolkata, in the next two to three days, the kat said on Wednesday.Conditions are favourab… [+2646 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Harikishan Sharma", "title": "10 lakh jobs: Existing Govt vacancies to account for most, 90% at lowest levels", "description": "Sources said while it is not easy to undertake such large-scale recruitment in a short span of 18 months, the bigger challenge will be post-recruitment training and induction, and later promotions.", "url": "https://indianexpress.com/article/india/10-lakh-jobs-existing-govt-vacancies-to-account-for-most-90-at-lowest-levels-7972429/", "urlToImage": "https://images.indianexpress.com/2022/06/EMPLOYMENT-1.jpg", "publishedAt": "2022-06-15T23:00:21Z", "content": "THE Union government will need to budget about Rs 4,500 crore a year for the 10 lakh jobs it has promised in mission mode over the next 18 months. Almost entirely, these are existing vacancies or pos… [+3345 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "June 10 protest: In Prayagraj, police release photos of 59 suspects", "description": "“Photographs of suspects have been released to seek information from the public. The name and identities of the informers will be kept secret,” SSP (Prayagraj) Ajay Kumar said.", "url": "https://indianexpress.com/article/cities/lucknow/june-10-protest-in-prayagraj-police-release-photos-of-59-suspects-7972495/", "urlToImage": "https://images.indianexpress.com/2022/06/Prayagraj-Poster-4col.jpg", "publishedAt": "2022-06-15T22:53:12Z", "content": "After Kanpur police, Prayagraj police on Wednesday released photographs of 59 suspects allegedly involved in the June 10 clash that broke out during a protest against the remarks on Prophet Mohammad … [+846 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Maharashtra: With roses and chocolates, students get rousing welcome as state schools reopen", "description": "Early on Wednesday, teachers of schools run by the Pune Municipal Corporation (PMC) could be seen decorating the premises with balloons and making rangolis in vibrant colours. The students were greeted with roses and chocolates as they trooped back to their s…", "url": "https://indianexpress.com/article/cities/pune/maharashtra-with-roses-and-chocolates-students-get-rousing-welcome-as-state-schools-reopen-7972493/", "urlToImage": "https://images.indianexpress.com/2022/06/Pune-school.jpg", "publishedAt": "2022-06-15T22:52:39Z", "content": "Schools across Maharashtra reopened on Wednesday after the annual summer break. State Education Minister Varsha Gaikwad had earlier announced the reopening of schools on Twitter and the direction by … [+2446 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Supreme Court to take up Jamiat plea today against UP demolitions", "description": "The plea has sought a stay on any further demolition drive that the authorities may be planning to carry out in Kanpur district, which witnessed violence during the protests earlier this month.", "url": "https://indianexpress.com/article/india/supreme-court-take-up-jamiat-plea-today-up-demolitions-7972421/", "urlToImage": "https://images.indianexpress.com/2022/06/javed-house-1.jpg", "publishedAt": "2022-06-15T22:50:11Z", "content": "The plea has sought a stay on any further demolition drive that the authorities may be planning to carry out in Kanpur district, which witnessed violence during the protests earlier this month.\r\nOn J… [+2556 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "A very big League", "description": "IPL’s soaring revenues will deepen its inroads into overseas markets and increase audience through streaming services", "url": "https://indianexpress.com/article/opinion/editorials/ipls-soaring-revenues-will-deepen-its-inroads-into-overseas-markets-7972315/", "urlToImage": "https://images.indianexpress.com/2022/06/edit-2.jpg", "publishedAt": "2022-06-15T22:47:58Z", "content": "Only 15 years since it became a regular summer spectacle, the Indian Premier League has expanded its vistas at a hurtling pace. The 6.20 billion dollars auction of its media rights makes it the secon… [+1787 chars]"}]}