{"status": "ok", "totalResults": 438, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Asad Rehman", "title": "Gyanvapi case: Varanasi court set to pronounce order today", "description": "On Saturday, the Anjuman Intezamia Masjid Committee had filed an application in the court seeking the replacement of Advocate Commissioner Ajai Kumar Mishra, accusing him of being “biased”.", "url": "https://indianexpress.com/article/cities/lucknow/gyanvapi-case-varanasi-court-set-to-pronounce-order-today-7912540/", "urlToImage": "https://images.indianexpress.com/2022/05/Gyanvapi.jpg", "publishedAt": "2022-05-12T00:11:54Z", "content": "THE ARGUMENTS in the hearing regarding the replacement of a court-appointed Advocate Commissioner concluded in a Varanasi court on Wednesday, with the court reserving its order that will be pronounce… [+3019 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Uttar Pradesh: Proceedings in House set to go digital", "description": "Under “E-vidhan” (digitalisation/digitisation of legislatures) initiative, the MLAs will have electronic tablets installed on their desks at the Assembly to continually update them about the proceedings of the House, the questions undertaken and their answers…", "url": "https://indianexpress.com/article/cities/lucknow/uttar-pradesh-proceedings-in-house-set-to-go-digital-7912539/", "urlToImage": "https://images.indianexpress.com/2022/05/Yogi-9.jpg", "publishedAt": "2022-05-12T00:03:33Z", "content": "The first budget session of the second term of the Yogi Adityanath government in the Uttar Pradesh Assembly from May 23 is likely to be different from the past in many respects.Under E-vidhan (digita… [+2814 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Asani has turned into deep depression, rainfall likely across state: Met", "description": "According to the Met office, the coastal districts such as East Medinipur, North and South 24 Parganas and Nadia, are expected to receive more rainfall by Wednesday. Rains are also likely to lash Kolkata.", "url": "https://indianexpress.com/article/cities/kolkata/asani-has-turned-into-deep-depression-rainfall-likely-across-state-met-7912535/", "urlToImage": "https://images.indianexpress.com/2022/05/Asani-4.jpg", "publishedAt": "2022-05-11T23:53:42Z", "content": "Cyclone Asani has lost its strength, turning into a deep depression, the Alipore meteorological office said on Wednesday, adding that it would result in rainfall across the state.There is a high prob… [+1122 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Central policies behind increase in healthcare costs: Mamata", "description": "It was decided in the meeting police, district administration and youth clubs will organise blood donation camps to meet scarcity of blood, health department officials said.", "url": "https://indianexpress.com/article/cities/kolkata/central-policies-behind-increase-in-healthcare-costs-mamata-7912533/", "urlToImage": "https://images.indianexpress.com/2022/05/mamata-759-1-1-1-5-1.jpg", "publishedAt": "2022-05-11T23:49:28Z", "content": "West Bengal Chief Minister Mamata Banerjee on Wednesday claimed that healthcare cost has spiked due to the Central government’s policies as it increases prices of nearly 800 medicines every six month… [+1764 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "13,000 in Bharuch to get benefits under central govt schemes today", "description": "The district administration launched a drive called ‘Utkarsh’ under which it roped in bodies such as the Ankleshwar Industries Association (AIA) to find beneficiaries, announcing incentives per application.", "url": "https://indianexpress.com/article/cities/surat/13000-in-bharuch-to-get-benefits-under-central-govt-schemes-today-7912531/", "urlToImage": "https://images.indianexpress.com/2022/04/BHUPENDRA-PATEL.jpg", "publishedAt": "2022-05-11T23:45:48Z", "content": "Chief Minister Bhupendra Patel will hand over benefits under various central government schemes to over 13,000 beneficiaries of Bharuch district in the virtual presence of Prime Minister Narendra Mod… [+1964 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Ahead of CPM’s youth wing meet, a bid to regain lost ground in Bengal", "description": "After facing a rout in the 2021 Assembly election last year, the CPIM has been trying to stage a comeback in West Bengal politics through their young faces, who are mainly from its  students wing, Students Federation of India (SFI) and the DYFI.", "url": "https://indianexpress.com/article/cities/kolkata/ahead-of-cpms-youth-wing-meet-a-bid-to-regain-lost-ground-in-bengal-7912510/", "urlToImage": "https://images.indianexpress.com/2022/05/DYFI2-4col.jpg", "publishedAt": "2022-05-11T23:42:40Z", "content": "AHEAD OF an all-India conference of the Democratic Youth Federation of India (DYFI) that begins in Salt Lake on Wednesday, the youth organisations of the CPIM have been trying to connect to different… [+3250 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Development works worth Rs 12.2 cr in Gujarat by Oct: Govt", "description": "Briefing media persons after the weekly cabinet meeting chaired by Chief Minister Bhupendra Patel, spokesperson of the state government and Education Minister Jitu Vaghani said Gujarat has emerged as a top state in the country under the PM Gati-Shakti Yojana.", "url": "https://indianexpress.com/article/cities/gandhinagar/development-works-worth-rs-12-2-cr-in-gujarat-by-oct-govt-7912530/", "urlToImage": "https://images.indianexpress.com/2022/05/Bhupendra-Patel.jpg", "publishedAt": "2022-05-11T23:40:04Z", "content": "By October this year, development works worth Rs 12,200 crore will either be dedicated or their foundation stones be laid in 33 districts, the Gujarat government said Wednesday.Briefing media persons… [+1475 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Two arrested over bid to derail train in Valsad", "description": "According to the Railway police, the incident took place on April 27, when a Bandra Vapi passenger train left Vapi railway station towards Mumbai at 12.30 pm.", "url": "https://indianexpress.com/article/cities/surat/two-arrested-over-bid-to-derail-train-in-valsad-7912524/", "urlToImage": "https://images.indianexpress.com/2022/05/arrest1-6.jpeg", "publishedAt": "2022-05-11T23:34:20Z", "content": "Two youths were arrested Wednesday for allegedly trying to derail the Bandra Vapi passenger train near Umargam railway station in Valsad.According to the Railway police, the incident took place on Ap… [+1164 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Railway station near Somnath temple to be upgraded at Rs 134 cr", "description": "RLDA, a statutory body functioning under the Railways Ministry, has solicited request for proposal (RFP) from private contractors for the work after holding a pre-bid consultation meeting with national and state-level developers.", "url": "https://indianexpress.com/article/cities/rajkot/railway-station-near-somnath-temple-to-be-upgraded-at-rs-134-cr-7912520/", "urlToImage": "https://images.indianexpress.com/2022/05/Somnath-temple.jpg", "publishedAt": "2022-05-11T23:27:36Z", "content": "THE RAILWAY station near the famous Somnath temple near Veraval town in Devbhumi Dwarka district is all set for a major overhaul with the Rail Land Development Authority (RLDA) deciding to upgrade th… [+1828 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "RMC approves Rs 1.90 crore paid for Covid services", "description": "According to the proposals, the RMC purchased total one lakh rapid antigen test kits and 50,000 viral transport media (VTM) kits for collecting samples for RT-PCR tests.", "url": "https://indianexpress.com/article/cities/rajkot/rmc-approves-rs-1-90-crore-paid-for-covid-services-7912513/", "urlToImage": "https://images.indianexpress.com/2021/11/rmc_759.jpg", "publishedAt": "2022-05-11T23:20:51Z", "content": "THE STANDING committee of the Rajkot Municipal Corporation on Tuesday gave approval to five proposals by the administrative wing for Rs 1.90 crore paid to various agencies for providing services duri… [+1541 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Surendranagar records 46 degrees Celsius, heat wave to be on till May 13", "description": "Other centres that witnessed high temperatures were Ahmedabad and Gandhinagar with 45.8 degrees Celsius, Deesa at 45 degrees Celsius, Amreli at 44.8, Bhavnagar 44.5, Rajkot 44.2, Bhuj 43.8, Vallabh Vidyanagar 43.4, Vadodara 43, Kandla Port at 40.2 and Keshod …", "url": "https://indianexpress.com/article/cities/ahmedabad/surendranagar-records-46-degrees-celsius-heat-wave-to-be-on-till-may-13-7912508/", "urlToImage": "https://images.indianexpress.com/2022/04/HEAT-4-1-1.jpg", "publishedAt": "2022-05-11T23:15:05Z", "content": "Reeling under intense heat, Surendranagar district recording 46 degree Celsius on Wednesday even as the India Meteorological Department (IMD) has issued a heat wave warning for Gujarat till May 13.Ot… [+730 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Burglars set house on fire after theft", "description": "The burglars entered the apartment by breaking the lock of the door and then decamped with gold ornaments and cash worth Rs 2 lakh in total. Police said before leaving the spot, the burglars set the apartment on fire to destroy evidence.", "url": "https://indianexpress.com/article/cities/pune/burglars-set-house-on-fire-after-theft-7912507/", "urlToImage": "https://images.indianexpress.com/2022/05/IE-79-11.jpeg", "publishedAt": "2022-05-11T23:09:56Z", "content": "A flat in an apartment building in Mahatma Phule Peth was set on fire after a burglary there earlier this week."}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Parents booked for forcing 11-year-old boy to live with 22 stray dogs for 2 years: Police", "description": "Anuradha Sahasrabuddhe of the childline said, “Local residents used to see the boy at the window of the apartment... they found him mentally disturbed.”", "url": "https://indianexpress.com/article/cities/pune/parents-booked-for-forcing-11-year-old-boy-to-live-with-22-stray-dogs-for-2-years-police-7912504/", "urlToImage": "https://images.indianexpress.com/2022/05/dogs-main.jpg", "publishedAt": "2022-05-11T23:07:59Z", "content": "The parents of an 11-year-old boy have been booked for allegedly confining him with a group of about 22 stray dogs at a building in Kondhwa. An FIR has been lodged in this case at the Kondhwa police … [+2039 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Partha Sarathi Biswas", "title": "Rain in Karnataka may cut short mango season for Pune", "description": "Rohan Ursal, a commission agent working in the city's wholesale market, said the season may end as early as the last week of May if rains continue to batter orchards in Karnataka.", "url": "https://indianexpress.com/article/cities/pune/rain-in-karnataka-may-cut-short-mango-season-for-pune-7912502/", "urlToImage": "https://images.indianexpress.com/2022/05/mango-1200x667_getty.jpg", "publishedAt": "2022-05-11T23:05:28Z", "content": "Rain caused by Cyclone Asani is expected to cut short Pune’s mango season by several weeks. Supply of mangoes from Karnataka will be hit, say farmers and traders, as continuous rain for the past thre… [+2123 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuradha Mascarenhas", "title": "Obesity in women rose by 3%, men 4%, in four years: NFHS-5", "description": "The highest proportion of overweight or obese women is found in Puducherry (46 per cent) followed by Chandigarh (44 per cent), Delhi, Tamil Nadu, and Punjab (41 per cent each), and Kerala and Andaman & Nicobar Islands (38 per cent each), according to the repo…", "url": "https://indianexpress.com/article/cities/pune/obesity-in-women-rose-by-3-men-4-in-four-years-nfhs-5-7912499/", "urlToImage": "https://images.indianexpress.com/2022/05/obesity_getty_200.jpg", "publishedAt": "2022-05-11T22:56:01Z", "content": "The proportion of overweight or obese women in India has increased from 21 per cent in 2015-16 to to 24 per cent in 2019-20, according to the latest National Family Health Survey (NFHS)-5 report.Amon… [+2729 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Will take elderly to Ayodhya for free if voted to power: Arvind Kejriwal in Gujarat", "description": "Adding that over the past three years, the Delhi government took 50,000 elderly persons on pilgrimages, Kejriwal said, “There has been a BJP government in Gujarat for 27 years. Did BJP take any of you to Ayodhya for darshan?”", "url": "https://indianexpress.com/article/cities/rajkot/will-take-elderly-to-ayodhya-for-free-if-voted-to-power-arvind-kejriwal-in-gujarat-7912495/", "urlToImage": "https://images.indianexpress.com/2022/05/Gujarat-AAP.jpg", "publishedAt": "2022-05-11T22:54:39Z", "content": "Aam Aadmi Party (AAP) national convener and Delhi Chief Minister Arvind Kejriwal on Wednesday promised to take every elderly of Gujarat on a pilgrimage to Ayodhya if his party is voted to power in th… [+4606 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Online fraudster cheats Army personnel of Rs 12,000", "description": "Police said the complainant received a call on his cell phone on April 27 from a con man who claimed to be from the call centre of a private courier company.", "url": "https://indianexpress.com/article/cities/pune/online-fraudster-cheats-army-personnel-of-rs-12000-7912497/", "urlToImage": "https://images.indianexpress.com/2022/05/fraud-2-2.jpg", "publishedAt": "2022-05-11T22:51:18Z", "content": "A con man claiming to be the employee of a prominent private courier company cheated a 43-year-old Army personnel from Pune to the tune of Rs 12,000."}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Cheema meets with industrialists, traders to take suggestions", "description": "The minister said that previous governments did not formulate any concrete policy for the development of Punjab due to their narrow political and personal interests due to which Punjab was constantly ruined and millions of crores of debt fell on Punjabis.", "url": "https://indianexpress.com/article/cities/chandigarh/cheema-meets-with-industrialists-traders-to-take-suggestions-7912493/", "urlToImage": "https://images.indianexpress.com/2022/05/cheema-2.jpg", "publishedAt": "2022-05-11T22:43:47Z", "content": "The Punjab government shall present a balanced budget in the coming days and is, for the first time, taking suggestions from the people. Punjab Finance Minister Harpal Cheema held a meeting with indu… [+2645 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gujarat: Arvind SmartSpaces to invest in GIFT City if ‘hurdles’ removed", "description": "GIFT City, which is now fully owned by the Gujarat government is being built on a walk-to-work concept, wherein only those working within the campus were earlier allowed to purchase houses.", "url": "https://indianexpress.com/article/cities/ahmedabad/gujarat-arvind-smartspaces-to-invest-in-gift-city-if-hurdles-removed-7912491/", "urlToImage": "https://images.indianexpress.com/2022/02/gift-city-1.jpg", "publishedAt": "2022-05-11T22:40:44Z", "content": "Arvind SmartSpaces Ltd, a real-estate arm of textile conglomerate Arvind Ltd, is considering to launch a residential project in GIFT City if the Gujarat government eases some of the existing “hurdles… [+2887 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Kota man picked up by Punjab cops seeks independent probe", "description": "While issuing a notice to Punjab Police, the bench of Justice Harnaresh Singh Gill Wednesday directed the trial court to “adjourn the case beyond the date fixed before this court”. The HC will hear the matter again on July 14.", "url": "https://indianexpress.com/article/cities/chandigarh/kota-man-picked-up-by-punjab-cops-seeks-independent-probe-7912490/", "urlToImage": "https://images.indianexpress.com/2022/05/Punjab-HC-2-1.jpeg", "publishedAt": "2022-05-11T22:40:03Z", "content": "Days after Rajasthan Police booked 14 Punjab Police personnel for allegedly abducting a Kota man accused in a drugs case, the Punjab and Haryana High Court took up a plea filed by the 21-year-old see… [+1884 chars]"}]}