{"status": "ok", "totalResults": 558, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "ED quizzes Rahul for 3rd consecutive day in National Herald money laundering case", "description": "A huge contingent of police and paramilitary personnel was deployed around the federal agency's office, and prohibitory orders under section 144 of the Code of Criminal Procedure (CrPC) is in force.", "url": "https://indianexpress.com/article/cities/delhi/rahul-gandhi-ed-national-herald-money-laundering-case-7970658/", "urlToImage": "https://images.indianexpress.com/2022/06/rahul-gandhi-priyanka-gandhi-1.jpg", "publishedAt": "2022-06-15T06:51:25Z", "content": "Congress leader Rahul Gandhi appeared before the Enforcement Directorate (ED) on Wednesday for the third consecutive day of questioning in the National Herald money laundering case.Gandhi (51) arrive… [+1858 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Karan Johar says era of superstardom is over: ‘This generation doesn’t have the magic, aura of Amitabh Bachchan or Shah Rukh Khan’", "description": "Karan Johar thinks superstardom no longer exists because the actors of this generation are so accessible.", "url": "https://indianexpress.com/article/entertainment/bollywood/karan-johar-on-lack-of-superstardom-in-todays-time-srk-amitabh-bachchan-7970397/", "urlToImage": "https://images.indianexpress.com/2022/06/karan1200.jpg", "publishedAt": "2022-06-15T06:44:34Z", "content": "There has often been discussions around how the era of the superstardom is over, that it ended with the Khans of the industry. The topic became a hot one, especially when all their movies started per… [+2081 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Abhinav Rajput", "title": "Delhi: MCDs invite suggestions from public for outreach programme", "description": "The corporation has released a phone number for receiving feedback from citizens regarding 'Jan Sunwaai' so that necessary improvements can be incorporated.", "url": "https://indianexpress.com/article/cities/delhi/delhi-mcds-invite-suggestions-from-public-for-outreach-programme-7970738/", "urlToImage": "https://images.indianexpress.com/2022/06/municipal-corporation-delhi.jpeg", "publishedAt": "2022-06-15T06:40:53Z", "content": "After the initial hiccups in their public outreach programme, the municipal corporations of Delhi (MCDs) have decided to tweak the model and it would now be compulsory to raise a ticket for every com… [+2160 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Saurabh Parashar", "title": "Bird Watch: Sulphur-Bellied Warbler, a songbird with a sharp, distinctive call", "description": "One should have the patience to observe and capture the Sulphur-Bellied Warbler on camera.", "url": "https://indianexpress.com/article/cities/chandigarh/bird-watch-sulphur-bellied-warbler-songbird-7970682/", "urlToImage": "https://images.indianexpress.com/2022/06/warbler.jpg", "publishedAt": "2022-06-15T06:34:46Z", "content": "The Sulphur-Bellied Warbler (phylloscopus griseolus) is a songbird that loves to stay in rocky areas around old buildings, and is often seen creeping on tree trunks, walls or on rocks. The bird is no… [+1675 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Assam: Incessant rain wreaks havoc, Guwahati reels under artificial floods", "description": "While four labourers died in a landslide triggered by torrential showers in the capital Guwahati’s Boragaon area early Tuesday, approximately 8,000 people in seven other districts of Darrang, Dhemaji, Dibrugarh, Dima-Hasao, Goalpara, Nalbari, and South Salmar…", "url": "https://indianexpress.com/article/north-east-india/assam/assam-incessant-rains-guwahati-reels-artificial-floods-7970654/", "urlToImage": "https://images.indianexpress.com/2022/06/Assam-floods.jpg", "publishedAt": "2022-06-15T06:33:55Z", "content": "Barely recovering from the devastation caused by pre-monsoonal rainfall in Assam last month, the flood situation in the state took a turn for the worse Tuesday, following incessant and heavy rainfall… [+1532 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "The Conversation", "title": "Nine vegetables that are healthier for you when cooked", "description": "Not all food is more nutritious when eaten raw. Indeed, some vegetables are actually more nutritious when cooked", "url": "https://indianexpress.com/article/lifestyle/food-wine/nine-vegetables-that-are-healthier-for-you-when-cooked-7967335/", "urlToImage": "https://images.indianexpress.com/2022/06/vegetables.jpg", "publishedAt": "2022-06-15T06:30:44Z", "content": "Raw food diets are a fairly recent trend, including raw veganism. The belief being that the less processed food is, the better. However, not all food is more nutritious when eaten raw. Indeed, some v… [+4713 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Karnataka Bengaluru News Live Updates: Counting of votes cast during MLC polls from graduates’, teachers’ constituencies begins", "description": "Karnataka Bengaluru News Live Updates, June 15: The ruling BJP and the principal opposition Congress had fielded one candidate each in all the four constituencies that went to MLC polls.", "url": "https://indianexpress.com/article/cities/bangalore/karnataka-bengaluru-news-live-updates-covid-mlc-polls-bommai-bjp-7970465/", "urlToImage": "https://images.indianexpress.com/2022/06/voter-1.jpg", "publishedAt": "2022-06-15T06:29:52Z", "content": "After University College of Mangalore, Government First Grade College, Uppinangady, it is now the Government First Grade College in Haleyangadi where 19 Muslim girls are facing loss of education due … [+820 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Pushkar–Gayathri on creating Suzhal for Amazon Prime Video: ‘We made it a point to keep it Indian’", "description": "Pushkar-Gayathri has written and created Tamil web series Suzhal for Amazon Prime Video.", "url": "https://indianexpress.com/article/entertainment/tamil/pushkar-gayathri-on-creating-suzhal-for-amazon-prime-video-7967645/", "urlToImage": "https://images.indianexpress.com/2022/06/Suzhal.jpg", "publishedAt": "2022-06-15T06:27:56Z", "content": "Filmmaker duo PushkarGayathri, who shot to fame nationwide with the success of their 2017 gangster drama Vikram Vedha, is now waiting for the release of their first web series. They have written an 8… [+3402 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "England captain Ben Stokes ‘blown away’ by Test win at Trent Bridge", "description": "Ben Stokes is absolutely thrilled about his team's victory over New Zealand in the second test at Trent Bridge.", "url": "https://indianexpress.com/article/sports/cricket/england-captain-stokes-blown-away-by-test-win-at-trent-bridge-ben-stokes-england-cricket-eng-vs-nz-joe-root-7970563/", "urlToImage": "https://images.indianexpress.com/2022/06/Untitled-design-7-2.jpg", "publishedAt": "2022-06-15T06:26:48Z", "content": "Captain Ben Stokes said England’s victory over New Zealand in the second Test at Trent Bridge was the highlight of his career, surpassing even his Ashes heroics at Headingley in 2019 and his match-wi… [+1527 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Abhishek Bachchan, Saiyami Kher’s first look from Ghoomer out", "description": "Ghoomer marks Abhishek Bachchan's second collaboration with R Balki after their superhit 2009 release Paa. The film also stars Shabana Azmi in the lead role.", "url": "https://indianexpress.com/article/entertainment/bollywood/abhishek-bachchan-saiyami-khers-first-look-from-r-balki-film-ghoomer-out-7970395/", "urlToImage": "https://images.indianexpress.com/2022/06/Abhishek-Bachchan-1200.jpeg", "publishedAt": "2022-06-15T06:16:40Z", "content": "The first look R Balki’s Ghoomer is out in which Abhishek Bachchanis seen sharing the screen space with Saiyami Kher. Flaunting his greys, Abhishek Bachchan leaves us intrigued with his look.Abhishek… [+1019 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Raghava Lawrence to make Chandramuki 2 with Rajinikanth’s blessings", "description": "Chandramukhi 2 stars Raghava Lawrence and Vadivelu in the lead roles.", "url": "https://indianexpress.com/article/entertainment/tamil/raghava-lawrence-to-make-chandramuki-2-with-rajinikanth-blessings-7970599/", "urlToImage": "https://images.indianexpress.com/2022/06/Chandramuki-2.jpg", "publishedAt": "2022-06-15T06:12:22Z", "content": "Actor-filmmaker Raghava Lawrence on Tuesday announced that he will be playing the lead in Chandramukhi 2, which is a sequel to Superstar Rajinikanth’s 2005 hit Chandramukhi. He thanked Rajinikanth an… [+1806 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Covid-19 vaccination remains slow in Delhi despite rise in cases, door-to-door campaign", "description": "Only 3.17 lakh doses were administered in Delhi in the first fourteen days of June as compared to 3.2 lakh doses during the last fourteen days of May.", "url": "https://indianexpress.com/article/delhi/covid-19-vaccination-remains-slow-in-delhi-despite-rise-in-cases-door-to-door-campaign-7970619/", "urlToImage": "https://images.indianexpress.com/2022/06/vaccine-2.jpeg", "publishedAt": "2022-06-15T06:09:36Z", "content": "Despite the increase in Covid-19 cases and the Centre urging states to reach out to 100 per cent eligible population during the ‘Har Ghar Dastak 2.0’ campaign that started in June, Delhis immunisatio… [+1620 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "‘I will solve India-China dispute in my lifetime’ approach won’t work, says Ram Madhav", "description": "Launching a book, \"China Bloodies Bulletless Borders\" by Colonel Anil Bhatt, VSM (retired), detailing the troubled Indo-China relationship since the 1962 war between the two nations, Madhav said one should not make it an \"issue of legacy\" as no one knows who …", "url": "https://indianexpress.com/article/india/india-china-dispute-ram-madhav-7970585/", "urlToImage": "https://images.indianexpress.com/2022/05/ram-madhav-1.jpg", "publishedAt": "2022-06-15T06:06:32Z", "content": "The approach of ‘I should solve this dispute in my lifetime’ will not work in the India-China border issue, said RSS leader Ram Madhav, arguing that any “hurry” in finding a solution to the long-stan… [+3079 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "NCHM JEE 2022 Admit card released; Here’s how to download", "description": "Candidates can download their NCHM JEE 2022 admit card using their application number and date of birth. The examination is scheduled to be held on Saturday, June 18.", "url": "https://indianexpress.com/article/education/nchm-jee-2022-admit-card-released-how-to-download-nchmjee-nta-nic-in-7970520/", "urlToImage": "https://images.indianexpress.com/2022/06/pexels-andrea-piacquadio-935756-1.jpg", "publishedAt": "2022-06-15T06:03:45Z", "content": "NCHM JEE 2022 Admit Card: The National Testing Agency (NTA)  has released the admit card for the National Council of Hotel Management Joint Entrance Examination (NCHM JEE) 2022 today June 14, 2022.  … [+1146 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Russia tells Ukraine to lay down arms in Sievierodonetsk battle", "description": "Ukraine says more than 500 civilians are trapped alongside soldiers inside the Azot chemical factory where its forces have resisted weeks of Russian bombardment and assaults that have reduced much of Sievierodonetsk to ruins.", "url": "https://indianexpress.com/article/world/russia-tells-ukraine-to-lay-down-arms-in-sievierodonetsk-battle-7970579/", "urlToImage": "https://images.indianexpress.com/2022/06/Reuters123.jpg", "publishedAt": "2022-06-15T06:03:24Z", "content": "Russia told Ukrainian forces holed up in a chemical plant in the embattled city of Sievierodonetsk to lay down their arms by early Wednesday, pressing its advantage in the battle for control of easte… [+4763 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Ludhiana: Two men pose as Lawrence Bishnoi gang members, extort crores; arrested", "description": "Ludhiana police commissioner Kaustubh Sharma said that following the gruesome murder of Sidhu Moosewala on May 29 in Mansa, these criminals used to threaten the people in Ludhiana and other districts of Punjab using virtual numbers on WhatsApp.", "url": "https://indianexpress.com/article/cities/ludhiana/lawrence-bishnoi-gang-punjab-ludhiana-extortion-businessmen-crores-7970529/", "urlToImage": "https://images.indianexpress.com/2022/06/lawrence-bishnoi-1.jpg", "publishedAt": "2022-06-15T06:03:00Z", "content": "The Ludhiana police arrested two men Tuesday who allegedly extorted at least Rs 1 crore from businessmen and traders in the city and threatened to kill them while posing as the members of the Lawrenc… [+2410 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Nushrratt Bharuccha plays with prints and colours for ‘Janhit Mein Jaari’ promotions", "description": "Just like her onscreen roles, her offscreen looks reflect her vibrant, fun and versatile personality", "url": "https://indianexpress.com/article/lifestyle/fashion/nushrratt-bharuccha-janhit-mein-jaari-promotions-fashion-looks-7967265/", "urlToImage": "https://images.indianexpress.com/2022/06/nushrratt-1200.jpg", "publishedAt": "2022-06-15T06:00:34Z", "content": "Nushrratt Bharuccha is not just an actor par excellence but also a veritable fashionista, with an impeccable sense of style. Just like her onscreen roles, her offscreen looks reflect her vibrant, fun… [+1315 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Siddhanth Kapoor shares first photo after being detained on drug consumption charges: ‘I have been cooperating’", "description": "Actor Siddhanth Kapoor shared his first photo on Instagram after being released on bail. Siddhanth had participated in a day-long interrogation by the Bengaluru police and gave his official statement.", "url": "https://indianexpress.com/article/entertainment/bollywood/siddhanth-kapoor-shares-first-photo-after-being-detained-on-drug-consumption-charges-7970402/", "urlToImage": "https://images.indianexpress.com/2022/06/siddhant.jpeg", "publishedAt": "2022-06-15T05:53:53Z", "content": "Actor Siddhanth Kapoor, brother of Shraddha Kapoor, shared his first photo and a statement after being released on bail. In the photo he shared with a friend, he added a prayer-sign emoticon and a he… [+1660 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "How to transfer WhatsApp data from Android to iPhone and vice versa", "description": "WhatsApp: Here's how to transfer your data between an Android and iOS device in a few, easy steps.", "url": "https://indianexpress.com/article/technology/techook/how-to-transfer-whatsapp-data-from-android-to-iphone-and-vice-versa-7970409/", "urlToImage": "https://images.indianexpress.com/2022/06/WhatsApp-Express-Photo-1-2.jpg", "publishedAt": "2022-06-15T05:53:49Z", "content": "If youve ever switched between Android and iOS, you know transferring your WhatsApp data between devices can be a painful point. Until recently, transferring a chat backup from an Android to an iOS d… [+3558 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Priya Kumari Shukla", "title": "UPSC ethics simplified: Politics plus or minus ethics", "description": "The General Studies Paper IV, \"Ethics, Integrity, and Aptitude,\" is an essential component of the UPSC Mains Examination. The Indian Express UPSC Ethics Simplified is to help and enable aspirants in decoding, deconstructing, and analysing the \"Ethics, Integri…", "url": "https://indianexpress.com/article/upsc-current-affairs/upsc-ethics-simplified-politics-plus-or-minus-ethics-7970113/", "urlToImage": "https://images.indianexpress.com/2022/06/Screenshot-2022-06-15-at-9.03.41-AM.png", "publishedAt": "2022-06-15T05:48:44Z", "content": "Political ethics, sometimes called political morality or public ethics, is the practice of making moral judgments about political action and the study of that practice. Ethics is usually defined as t… [+3692 chars]"}]}