{"status": "ok", "totalResults": 411, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Four held for staging robbery, siphoning off Rs 11.84 lakh", "description": "According to police, the four accused connived to keep the money from the weekend collection at two petrol pumps belonging to the same owner.", "url": "https://indianexpress.com/article/cities/baroda/four-held-for-staging-robbery-siphoning-off-rs-11-84-lakh-7922704/", "urlToImage": "https://images.indianexpress.com/2022/05/arrest-2-7-4.jpeg", "publishedAt": "2022-05-18T00:40:42Z", "content": "Four persons, including the cashier of a petrol pump, were nabbed by the Dahod district police on Tuesday for allegedly siphoning off Rs 11.84 lakh from the pump by staging a robbery.According to pol… [+1389 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "End female foeticide, appeals Gujarat BJP President CR Paatil", "description": "“Sometimes, daughters worry as their parents often sell their land or house or take loans for their marriage and they (parents) can’t repay the debt during their lifetime,” CR Paatil further said.", "url": "https://indianexpress.com/article/cities/rajkot/end-female-foeticide-appeals-gujarat-bjp-president-cr-paatil-7922702/", "urlToImage": "https://images.indianexpress.com/2022/05/paatil-1.jpg", "publishedAt": "2022-05-18T00:40:33Z", "content": "Gujarat BJP President CR Paatil Tuesday appealed to the society to stop the practice of female foeticide and opt for mass wedding ceremonies to reduce the expense incurred by parents to marry off the… [+2025 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "RBU students demanding online exams gherao V-C, cops called in", "description": "The V-C, however, requested the police to leave the university campus saying he didn’t want any action against his students.", "url": "https://indianexpress.com/article/cities/kolkata/rbu-students-online-exams-gherao-v-c-cops-7922699/", "urlToImage": "https://images.indianexpress.com/2022/05/rabindra-bharati-university-759.jpg", "publishedAt": "2022-05-18T00:36:44Z", "content": "Students of Rabindra Bharati University (RBU) on Tuesday gheraoed the vice-chancellor demanding online exams. A large police force had to be called in to rescue the V-C and restore order.The V-C, how… [+831 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "PM Narendra Modi to inaugurate multi-specialty hospital in Rajkot", "description": "Assembly elections are due in Gujarat later this year and Narendra Modi’s visit to Jasdan, a Congress bastion, is seen as the BJP’s groundwork for the polls.", "url": "https://indianexpress.com/article/cities/rajkot/pm-narendra-modi-to-inaugurate-multi-specialty-hospital-in-rajkot-7922698/", "urlToImage": "https://images.indianexpress.com/2022/05/Modi-PTI-1-1.jpeg", "publishedAt": "2022-05-18T00:33:45Z", "content": "PRIME MINISTER Narendra Modi will inaugurate KD Parvadiya Multi Specialty Hospital, the first multi-specialty hospital in Jasdan taluka, built by a charitable trust headed by former MLA and Bharatiya… [+1802 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "MSU 2018 arson case: Despite bail order, artist unable to secure release, misses hearing", "description": "Chandramohan was arrested on May 10 for allegedly \"failing to appear\" in the ongoing court hearings in the 2018 case of attempted murder and arson when he allegedly set fire to the V-C’s office out of frustration for not getting his marksheet.", "url": "https://indianexpress.com/article/cities/baroda/msu-2018-arson-case-despite-bail-order-artist-unable-to-secure-release-misses-hearing-7922690/", "urlToImage": "https://images.indianexpress.com/2022/05/Gavel-10-12.jpeg", "publishedAt": "2022-05-18T00:32:11Z", "content": "The Vadodara sessions court Tuesday adjourned the hearing to a future date after Chandramohanan alumnus at the Faculty of Fine Arts of MS University and accused in the February 2018 case of attempt t… [+2387 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Procedure not followed during police raid at Anish Khan’s house: West Bengal govt to Calcutta HC", "description": "State advocate general Soumendranath Mukhopadhyay urged the division bench of Justice Rajasekhar Mantha that the police personnel concerned deserved punishment since there were lapses in the legal procedure in conducting the raid.", "url": "https://indianexpress.com/article/cities/kolkata/procedure-not-followed-police-raid-anish-khan-house-west-bengal-govt-calcutta-hc-7922686/", "urlToImage": "https://images.indianexpress.com/2022/05/calcutta-high-court-fb.jpg", "publishedAt": "2022-05-18T00:29:31Z", "content": "The West Bengal government on Tuesday admitted in the Calcutta High Court that the police raid at the residence of now-deceased student leader Anish Khan on February 18 was not conducted with a prope… [+1363 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "UP: Seven get life imprisonment for murder of former MLA, his aide", "description": "Additional District and Sessions Judge Ramanand also imposed a fine of Rs 50,000 on each of them. The MLA and his associate Bharat Rai were killed near the former’s house in Azamgarh on July 19, 2013.", "url": "https://indianexpress.com/article/cities/lucknow/seven-get-life-imprisonment-for-murder-of-former-mla-his-aide-7922688/", "urlToImage": "https://images.indianexpress.com/2022/05/UP-police-1200-1-1-3.jpg", "publishedAt": "2022-05-18T00:27:55Z", "content": "An Azamgarh court on Tuesday handed down life imprisonment to seven persons, including gangster Dhruv Singh alias Kuntu Singh, in the murder case of former MLA and BSP leader Sarvesh Singh Seepu and … [+2501 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "UP ministers congratulate Modi on completing 8 years as Prime Minister", "description": "They also expressed their gratitude to the Prime Minister for interacting with them and guiding them during his stopover in Lucknow en route to Delhi from Lumbini in Nepal on Monday evening, said a government spokesperson.", "url": "https://indianexpress.com/article/cities/lucknow/up-ministers-congratulate-modi-on-completing-8-years-as-prime-minister-7922685/", "urlToImage": "https://images.indianexpress.com/2022/05/modi-yogi-1-1.jpg", "publishedAt": "2022-05-18T00:27:05Z", "content": "The UP Cabinet chaired by Chief Minister Yogi Adityanath on Tuesday congratulated Prime Minister Narendra Modi for completing eight years as the Member of Parliament from Varanasi and thanked him for… [+1646 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "SGST officials: Pvt coaching classes are evading tax", "description": "A total of 54 locations belonging to 10 private coaching classes were searched by the SGST department.", "url": "https://indianexpress.com/article/cities/ahmedabad/sgst-officials-pvt-coaching-classes-are-evading-tax-7922684/", "urlToImage": "https://images.indianexpress.com/2022/05/tax.jpeg", "publishedAt": "2022-05-18T00:25:15Z", "content": "The State Goods and Services Tax (SGST) department in Gujarat claimed to have found Rs 42 crore of unaccounted money from various private coaching classes in the state. The coaching classes were sear… [+914 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "BJP using Gyanvapi to divert attention: Akhilesh Yadav", "description": "“Gyanvapi mosque and other such incidents, the BJP does these things intentionally. Either the BJP does it, or their hidden and invisible friends do such things,” said Akhilesh during his visit to Azamgarh.", "url": "https://indianexpress.com/article/cities/lucknow/bjp-using-gyanvapi-to-divert-attention-akhilesh-yadav-7922661/", "urlToImage": "https://images.indianexpress.com/2022/04/AKHILESH-YADAVv.jpg", "publishedAt": "2022-05-18T00:23:48Z", "content": "SP Chief Akhilesh Yadav Tuesday said the BJP uses its invisible friends to rake up issues like the Gyanvapi mosque to divert peoples attention from issues like price rise and unemployment.Gyanvapi mo… [+1454 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Man booked for taking Rs 2.71 L from student for settling his case", "description": "The complainant in the case said that his friends Karan, Karampal Singh and Neeraj had approached him for his help in sorting out an assault case registered against them.", "url": "https://indianexpress.com/article/cities/sas-nagar-mohali/man-booked-for-taking-rs-2-71-l-from-student-for-settling-his-case-7922672/", "urlToImage": "https://images.indianexpress.com/2022/05/punjab-police.jpg", "publishedAt": "2022-05-18T00:22:57Z", "content": "The Kharar police booked the man who had taken Rs 2.71 lakh from the student of a private university at Gharuan on the pretext of helping them to sort out their case.The complainant in the case, Swar… [+983 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gujarat ATS nabs man wanted in UAPA case from Maharashtra", "description": "According to police, the accused, Akif, was held from Pagdha in Maharashtra and brought to ATS headquarters in Ahmedabad.", "url": "https://indianexpress.com/article/cities/ahmedabad/gujarat-ats-nabs-man-wanted-in-uapa-case-from-maharashtra-7922659/", "urlToImage": "https://images.indianexpress.com/2022/05/arrest-2-7-3.jpeg", "publishedAt": "2022-05-18T00:21:19Z", "content": "The Gujarat Anti Terrorist Squad (ATS) nabbed a man from Maharashtra who was allegedly wanted in an Unlawful Activities Prevention Act (UAPA) case related to a bomb-making training module being probe… [+1086 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "20 injured in fire after blast in Bharuch chemical factory", "description": "According to fire officials, the fire broke out at Bharat Rasayan, a chemicals manufacturing unit, at 3.10 am Tuesday.", "url": "https://indianexpress.com/article/cities/surat/20-injured-in-fire-after-blast-in-bharuch-chemical-factory-7922642/", "urlToImage": "https://images.indianexpress.com/2022/05/Surat.jpg", "publishedAt": "2022-05-18T00:19:31Z", "content": "Around 20 labourers were injured in a major fire triggered by a blast at the reactor of a chemical processing unit at Dahej in Bha-ruch on Tuesday. Immediately after the blast, the workers tried to e… [+1492 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Admin review meet in Paschim Medinipur: Ensure no riots during RSS chief’s visit, CM tells police", "description": "Presiding over an administrative review meeting in the district, the CM also alleged that ‘miscreants’ from neighbouring Jharkhand and Bihar were coming to West Bengal with firearms and committing crimes.", "url": "https://indianexpress.com/article/cities/kolkata/paschim-medinipur-ensure-no-riots-rss-chief-visit-cm-police-7922667/", "urlToImage": "https://images.indianexpress.com/2022/05/mamata-759-1-1-1-5-2.jpg", "publishedAt": "2022-05-18T00:17:58Z", "content": "Chief Minister Mamata Banerjee on Tuesday directed police to ensure that no riots break out during Rashtriya Swayamsevak Sangh (RSS) chief Mohan Bhagwats visit to Paschim Medinipur district from May … [+3561 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Maharashtra: Joint team of rail & civic officials to inspect nullah desilting work", "description": "In Mumbai, there are 116 railway culverts on all three suburban railway lines. While 53 are on the Central Railway, 41 are on the Western Railway and 22 on the Harbour line", "url": "https://indianexpress.com/article/cities/mumbai/maharashtra-joint-team-rail-civic-officials-inspect-nullah-desilting-work-7922658/", "urlToImage": "https://images.indianexpress.com/2022/05/NULLAH-1-1.jpg", "publishedAt": "2022-05-17T23:48:16Z", "content": "The Brihanmumbai Municipal Corporation (BMC) has decided to form a joint team comprising railways and civic officials to inspect ongoing nullah desilting work on railway premises.In Mumbai, there are… [+1179 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Vallabh Ozarkar", "title": "Maharashtra government releases pending funds to MRVC for completion of rail projects", "description": "Earlier this month, the MMRDA had released Rs 150 crore and another instalment of Rs 150 crore was released this week for Mumbai Urban Transport Projects (MUTP) 2 and 3 projects. An official said even though they have received Rs 300 crore so far for the MUTP…", "url": "https://indianexpress.com/article/cities/mumbai/state-government-releases-pending-funds-to-mrvc-for-completion-of-rail-projects-7922656/", "urlToImage": "https://images.indianexpress.com/2022/05/MMRDA.jpg", "publishedAt": "2022-05-17T23:45:42Z", "content": "AFTER A delay of over two years later, the state government has started releasing its share of pending funds to the Mumbai Rail Vikas Corporation (MRVC) for completing the ongoing railway infrastruct… [+1292 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sanjana Bhalerao", "title": "Maharashtra: First Olive Ridley turtle satellite-tagged on state coast returns near nesting beach", "description": "Five Turtles — Prathama, Savani (on January 25), Vanashree, Rewa and Laxmi (on February 13 and 16) — were tagged with platform transmitter terminals (PTTs), which were fitted with epoxy resin on the carapace (hard shell) of the turtle in Ratnagiri district.", "url": "https://indianexpress.com/article/cities/mumbai/maharashtra-first-olive-ridley-turtle-satellite-tagged-on-state-coast-returns-near-nesting-beach-7922650/", "urlToImage": "https://images.indianexpress.com/2022/05/olive-ridley-tag.jpeg", "publishedAt": "2022-05-17T23:44:13Z", "content": "Four months after it became the first Olive Ridley sea turtle to be satellite-tagged on the coast of Maharashtra, Prathama has returned to near its nesting beach Velas in the Ratnagiri district to th… [+2834 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Maharashtra: One booked for duping naval officer of Rs 1 lakh", "description": "As per the complaint, the victim received a text message asking the officer to complete his KYC formalities with the bank, failing which his bank account will be cancelled. Following this, the officer clicked on a link provided in the text message and entered…", "url": "https://indianexpress.com/article/cities/mumbai/maharashtra-one-booked-duping-naval-officer-1-lakh-7922652/", "urlToImage": "https://images.indianexpress.com/2022/05/arrest-22.jpg", "publishedAt": "2022-05-17T23:42:05Z", "content": "The Cuffe Parade police on Monday registered a case against an unidentified person for allegedly duping a senior officer of the Navy.As per the complaint, the victim received a text message asking th… [+779 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Bombay High Court seeks BEST’s reply to Tata Motor’s plea against disqualification", "description": "On February 26, the BEST had published a tender notice for the operation of stage carriage services of 1,400 single decker AC electric buses (with driver) for Mumbai and its suburbs on gross cost contract (GCC) model for 12 years.", "url": "https://indianexpress.com/article/cities/mumbai/bombay-high-court-seeks-bests-reply-to-tata-motors-plea-against-disqualification-7922647/", "urlToImage": "https://images.indianexpress.com/2022/05/cats-4.jpg", "publishedAt": "2022-05-17T23:41:06Z", "content": "The Bombay High Court on Monday directed the Brihanmumbai Electric Supply and Transport (BEST) to reply to a writ petition filed by Tata Motors Limited, challenging BEST’s May 6 decision to disqualif… [+1876 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sadaf Modak", "title": "After 11 years, court frames charges against Pune stud farm owner Hasan Ali Khan", "description": "On Tuesday, the court framed charges against Khan over a video conference, which he attended from Pune.", "url": "https://indianexpress.com/article/cities/mumbai/after-11-years-court-frames-charges-against-pune-stud-farm-owner-hasan-ali-khan-7922645/", "urlToImage": "https://images.indianexpress.com/2022/05/hasan.jpg", "publishedAt": "2022-05-17T23:40:41Z", "content": "OVER A decade after a case was filed against Pune stud farm owner Hasan Ali Khan on charges charges of money-laundering, a special court on Tuesday framed charges against him. Khan was arrested by th… [+2118 chars]"}]}