{"status": "ok", "totalResults": 585, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Sonali Bendre recalls gossip about having secret babies, says she was a ‘pan-India star’ before the term was even coined", "description": "Sonali Bendre recalled the vicious gossip that would be written about actors back in the day, and how easily audiences would believe it.", "url": "https://indianexpress.com/article/entertainment/bollywood/sonali-bendre-recalls-gossip-about-having-secret-babies-7962368/", "urlToImage": "https://images.indianexpress.com/2022/06/sonali-bendre.jpg", "publishedAt": "2022-06-10T08:47:36Z", "content": "Sonali Bendre said that news has always been biased, but that earlier, there weren’t as many outlets for misinformation to be spread so easily. Citing the example of how, back in the day, people were… [+1705 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Sri Lanka creates two new ministries to handle economic crisis", "description": "The new ministry was created after Basil Rajapaksa, former finance minister and one of the Rajapaksa brothers, quit Parliament on Thursday.", "url": "https://indianexpress.com/article/world/sri-lanka-creates-two-new-ministries-to-handle-economic-crisis-7962497/", "urlToImage": "https://images.indianexpress.com/2021/10/sri-lanka.jpg", "publishedAt": "2022-06-10T08:44:20Z", "content": "The role of the new ministry of ‘Technology and Investment Promotion’ will also be to promote foreign direct investment and private sector investment while promoting economic potential in Sri Lanka.\r… [+2773 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Keep constipation, bloating at bay while travelling with these effective tips", "description": "Constipation is a common issue faced by many travellers as there is a change in food, water and sleep timings, apart from several other factors", "url": "https://indianexpress.com/article/lifestyle/health/constipation-bloating-while-travelling-ayurvedic-tips-relief-7943472/", "urlToImage": "https://images.indianexpress.com/2022/05/GettyImages-intestinal-issues_1200.jpg", "publishedAt": "2022-06-10T08:40:08Z", "content": "While travellingis a great way to rejuvenate and unwind yourself, it might turn into a nightmare for people who often complain of nauseaand constipation when on the go. Constipation is a common issue… [+2260 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Iram Siddique", "title": "MP local polls on the horizon, a scramble for tickets underway", "description": "BJP and Congress workers have been making a beeline for party offices since poll dates were announced earlier this month", "url": "https://indianexpress.com/article/political-pulse/madhya-pradesh-local-polls-tickets-7962311/", "urlToImage": "https://images.indianexpress.com/2022/06/ch1604255.jpg", "publishedAt": "2022-06-10T08:28:44Z", "content": "A BJP leader in Ujjain for the last three decades, Gulabchand Bhandari stood outside the office of the partys state president V D Sharma on Thursday, waiting to seek a ticket for the mayoral contest … [+5076 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sana Farzeen", "title": "Om The Battle Within trailer: Aditya Roy Kapur is a commando on a mission to prove his father’s innocence, watch", "description": "Om The Battle Within trailer: Aditya Roy Kapur plays an undefeatable soldier in this Kapil Verma directorial. The action drama also stars Sanjana Sanghi, Jackie Shroff, Ashutosh Rana and Prachi Shah.", "url": "https://indianexpress.com/article/entertainment/bollywood/om-the-battle-within-trailer-aditya-roy-kapur-action-star-jackie-shroff-sanjana-sanghi-ashutosh-rana-7962388/", "urlToImage": "https://images.indianexpress.com/2022/06/aditya-roy-kapur-om-the-battle-within.jpg", "publishedAt": "2022-06-10T08:28:08Z", "content": "The much-anticipated action drama Om: The Battle Within trailer dropped on Friday. Starring Aditya Roy Kapur in the titular role, the film will also star Sanjana Sanghi, Ashutosh Rana, Jackie Shroff,… [+1824 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pune Weekend Listings: Murder mystery immersive experience; heritage walk in old Pune", "description": "From a Marathi drama starring Shweta Pendse, to a heritage walk in the old city of Pune, check out what's happening in your city this weekend.", "url": "https://indianexpress.com/article/cities/pune/pune-weekend-listings-7962444/", "urlToImage": "https://images.indianexpress.com/2022/06/Pune-weekend-listings.jpg", "publishedAt": "2022-06-10T08:25:33Z", "content": "‘Liar Liar – A Murder Mystery Immersive Experience’\r\nA murder case filled with deception, lies, and betrayal; where nothing is as true as it seems. Everyone is lying and no one can be trusted. A myst… [+1450 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Explained: What the WHO says on Covid-19’s origins, how to prepare for next pandemic", "description": "The new panel comes after a WHO-China report on Covid-19, and a US intelligence inquiry, both of which pointed towards a natural origin for the pandemic, likely from bats, rather than a lab leak.", "url": "https://indianexpress.com/article/explained/coronavirus-origins-explained-7962318/", "urlToImage": "https://images.indianexpress.com/2022/06/China-2.jpg", "publishedAt": "2022-06-10T08:24:50Z", "content": "A panel of experts drafted by the World Health Organization (WHO) to investigate the origins of the Covid-19 pandemic and prepare a framework to investigate future outbreaks has published its first r… [+3584 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Protest grows in Kerala against SC directive on eco-sensitive zones, hartal in Idukki today", "description": "The Congress-led UDF has called for another hartal in hilly Idukki district on June 16. In Wayanad district, various political parties, farmers’ outfits and trade bodies have planned agitations in the coming weeks.", "url": "https://indianexpress.com/article/india/kerala/protest-grows-kerala-against-sc-eco-sensitive-zones-hartal-idukki-7962477/", "urlToImage": "https://images.indianexpress.com/2022/06/Kerala-forest.jpg", "publishedAt": "2022-06-10T08:22:28Z", "content": "Protest is mounting in the hilly regions of Kerala against the Supreme Court direction last week that every protected forest tract and wildlife sanctuary must have an eco-sensitive zone (ESZ) of one … [+3406 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Careers Desk", "title": "UPSC EPFO Enforcement officer 2020 interview schedule released; check details", "description": "The interviews will begin on July 4 and will conclude on August 1. The interviews will be conducted in two shifts - the forenoon shift will begin from 9 am and the afternoon shift will begin at 12 pm.", "url": "https://indianexpress.com/article/jobs/upsc-epfo-2020-interview-schedule-released-upsc-gov-in-7962475/", "urlToImage": "https://images.indianexpress.com/2021/10/UPSC.jpg", "publishedAt": "2022-06-10T08:21:49Z", "content": "The Union Public Service Commission (UPSC) has released the interview schedule for the post of Enforcement Officer/Accounts Officer in the Employees Provident Fund Organization (EPFO). Eligible candi… [+982 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Married woman ‘raped’ twice by Facebook friend who promised to help her financially", "description": "An officer said the police is in the process of gathering evidence against the accused, including his call records, CCTV footage from around the lodge, and other technical evidence.", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-facebook-friend-rape-case-7962341/", "urlToImage": "https://images.indianexpress.com/2022/06/WhatsApp-Image-2022-06-10-at-1.23.39-PM.jpeg", "publishedAt": "2022-06-10T08:15:45Z", "content": "The Mumbai police has arrested a Brihanmumbai Municipal Corporation (BMC) employee for befriending a woman on social media and allegedly raping her under the pretext of helping her financially. The a… [+1586 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "RS polls in Rajasthan: BJP banks on ‘miracle’, Congress on numbers", "description": "Rajasthan Chief Minister Ashok Gehlot said the Congress will comfortably win three out of the four seats.", "url": "https://indianexpress.com/article/cities/jaipur/rs-polls-rajasthan-bjp-banks-miracle-cong-numbers-7962424/", "urlToImage": "https://images.indianexpress.com/2022/06/258853145_1902426486607713_9205030579158686867_n.jpg", "publishedAt": "2022-06-10T08:13:21Z", "content": "As voting got underway for the four Rajya Sabha seats in Rajasthan, the ruling Congress on Friday exuded confidence that it has the numbers to win three seats while the opposition BJP said it expects… [+2095 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Bhuvan Bam kickstarts shoot for debut OTT project Taaza Khabar with Shriya Pilgaonkar and Deven Bhojani", "description": "Bhuvan Bam announced the filming of Taaza Khabar with a rather intriguing video where two characters are seen talking about 'magic and miracles'.", "url": "https://indianexpress.com/article/entertainment/web-series/bhuvan-bam-kickstarts-shoot-debut-ott-taaza-khabar-shriya-pilgaonkar-deven-bhojani-7962163/", "urlToImage": "https://images.indianexpress.com/2022/06/bhuvan-bam-debut-ott-taaza-khabar.jpg", "publishedAt": "2022-06-10T08:09:17Z", "content": "Comedian Bhuvan Bam is all set to make his OTT acting debut with Disney+ Hotstar show Taaza Khabar. On Friday, the social media star took to Instagram to announce the project has started filming. Apa… [+1722 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Rajasthan RS polls: BJP MLA allegedly cross votes, party demands rejection; another MLA’s vote doubtful", "description": "Congress state president and polling agent Govind Singh Dotasra demanded that the vote of the BJP's Kailash Chandra Meena be rejected as MLA had erroneously showed him his vote as well.", "url": "https://indianexpress.com/article/cities/jaipur/rajasthan-rajya-sabha-polls-bjp-mla-vote-rejection-7962396/", "urlToImage": "https://images.indianexpress.com/2022/06/Jaipur-Satish-Poonia.jpg", "publishedAt": "2022-06-10T08:07:36Z", "content": "In the ongoing Rajya Sabha elections in Rajasthan, the Bharatiya Janata Party (BJP) demanded that a vote cast by a party MLA be rejected after it was alleged that she cross voted.Dholpur MLA, Shobhar… [+1124 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Kriti Sanon remembers Sushant Singh Rajput as Raabta completes 5 years: ‘Journey close to my heart’", "description": "Kriti Sanon celebrates 5 Years Of Raabta: The actor remembered co-star Sushant Singh Rajput, as she shared an old video where she sang the film's song 'Kuchh To Hai Tujhse Raabta'.", "url": "https://indianexpress.com/article/entertainment/bollywood/kriti-sanon-remembers-sushant-singh-rajput-as-raabta-completes-5-years-watch-video-7961718/", "urlToImage": "https://images.indianexpress.com/2022/06/raabta-5-years-kriti-sushant-1200.jpg", "publishedAt": "2022-06-10T08:06:51Z", "content": "Sushant Singh Rajput and Kriti Sanon-starrer Raabta clocks five years of its release today. The film, which has always been close to actor Kriti‘s heart, found a special mention on her Instagram hand… [+1070 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rahul Pandey", "title": "It’s a very tough ball to hit but he’s only human: van der Dussen on Harshal Patel’s slower ball", "description": "The 33-year old South Africa batsman took the attack to the death over specialist.", "url": "https://indianexpress.com/article/sports/cricket/its-a-very-tough-ball-to-hit-but-hes-only-human-van-der-dussen-on-harshal-patels-slower-ball-7962377/", "urlToImage": "https://images.indianexpress.com/2022/06/ind-vs-sa-2.jpg", "publishedAt": "2022-06-10T08:06:39Z", "content": "Harshal Patel’s slower ball has earned him accolades and he has used it effectively in the IPL. But on Thursday night, South Africa’s Rassie van der Dussen counter attacked the 31-year-old.Ive been w… [+2279 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi: Mehrauli resident applies for ‘Covid vaccine loan’, loses at least Rs 4,000", "description": "According to the complainant, four days after he got the loan of Rs 4,200, he allegedly began to receive threat calls demanding thrice the loan amount.", "url": "https://indianexpress.com/article/delhi/delhi-covid-vaccine-news-loan-mehrauli-extortion-7962372/", "urlToImage": "https://images.indianexpress.com/2022/06/vaccine-1.jpeg", "publishedAt": "2022-06-10T07:56:43Z", "content": "An FIR was registered by the Special Cell on May 28 based on a complaint by a resident of Delhi’s Mehrauli who was allegedly being extorted after he applied for a “3rd Covid dose vaccine loan”, offic… [+1149 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Omkar Gokhale", "title": "RS polls: Bombay HC asks Nawab Malik to move appropriate bench on his plea seeking to vote", "description": "Senior advocate Amit Desai submitted that the NCP leader is not asking for release on bail but, if the court permits, he may go with escort for casting his vote.", "url": "https://indianexpress.com/article/cities/mumbai/nawab-malik-bombay-high-court-rajya-sabha-polls-7962338/", "urlToImage": "https://images.indianexpress.com/2022/03/Nawab-Malik-new-123-1-2-1.jpeg", "publishedAt": "2022-06-10T07:56:20Z", "content": "Justice Prakash D Naik of the Bombay High Court on Friday morning refused to entertain and give immediate relief to NCP leader Nawab Malik in his writ plea challenging the special court order that re… [+2190 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Harikishan Sharma", "title": "Centre releases fresh guidelines for advertisements, bans surrogate ads", "description": "As per the guidelines, surrogate advertisement refers to an advertisement for products or services, whose advertising is otherwise prohibited or restricted by the law.", "url": "https://indianexpress.com/article/india/centre-releases-fresh-guidelines-advertisements-bans-surrogate-ads-7962141/", "urlToImage": "https://images.indianexpress.com/2022/06/WhatsApp-Image-2022-06-04-at-4.04.49-PM-1.jpeg", "publishedAt": "2022-06-10T07:55:38Z", "content": "The Centre on Friday released the Guidelines for Prevention of Misleading Advertisements and Endorsements for Misleading Advertisements, 2022, which prohibits surrogate advertising and prescribes con… [+1183 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Careers Desk", "title": "HP TET 2022 registration begins: Here’s how to apply", "description": "Interested and eligible candidates can apply online at the official website — hpbose.org — July 1. 2022.", "url": "https://indianexpress.com/article/jobs/teachers-jobs/hp-tet-2022-registration-begins-how-to-apply-hpbose-org-7962326/", "urlToImage": "https://images.indianexpress.com/2022/05/Telangana-Police-Recruitment.jpg", "publishedAt": "2022-06-10T07:50:32Z", "content": "The Himachal Pradesh Board of School Education (HPBOSE) has started the registration process for Teacher Eligibility Test (HPTET) today, i.e June 10, 2022. The last date to apply is July 1. Intereste… [+1523 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Britney Spears and Sam Asghari are married: A timeline of their relationship", "description": "The couple had announced their engagement in September 2021, even before the end of the singer's 13-year conservatorship", "url": "https://indianexpress.com/article/lifestyle/feelings/britney-spears-sam-asghari-married-timeline-relationship-7962219/", "urlToImage": "https://images.indianexpress.com/2022/06/Britney-and-Sam-1200.jpg", "publishedAt": "2022-06-10T07:50:24Z", "content": "Britney Spears and Sam Asghari are married. The much-in-love couple, who have been through many hardships together — including recently losing a baby to miscarriage — tied the knot in a close-knit ce… [+1866 chars]"}]}