{"status": "ok", "totalResults": 563, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pune: After a gap of two years, PMC to start operating toy trains in five gardens", "description": "The PMC garden superintendent said the trains will start functioning soon after maintenance works in view of the rise in demand expected once school vacations begin.", "url": "https://indianexpress.com/article/cities/pune/pune-after-a-gap-of-two-years-pmc-to-start-operating-toy-trains-in-five-gardens-7893061/", "urlToImage": "https://images.indianexpress.com/2022/04/toy-train-1.jpg", "publishedAt": "2022-04-29T06:50:33Z", "content": "Having been unable to enjoy rides on toy trains installed in the citys gardens since the pandemic broke out, children are once again set to enjoy the fun activity as the Pune Municipal Corporation (P… [+1788 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Chhavi Mittal pens note for husband on anniversary as she recovers from cancer: ‘We complete 17 years in a hospital’", "description": "Chhavi Mittal, who is presently recovering from surgery after being diagnosed with cancer, penned a long and loving note for her husband on their anniversary.", "url": "https://indianexpress.com/article/entertainment/television/chhavi-mittal-pens-note-for-husband-on-anniversary-as-she-recovers-from-cancer-7892802/", "urlToImage": "https://images.indianexpress.com/2022/04/chhavi.jpg", "publishedAt": "2022-04-29T06:46:48Z", "content": "Actor Chhavi Mittal, who recently opened up about her cancer diagnosis on social media, has been sharing her journey through her treatment and recovery on Instagram. In a recent post, Chhavi penned a… [+1324 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Noida: 5 cops injured after scuffle with VHP members", "description": "According to the cops, the incident took place outside Sector 39 police station after VHP members gathered there seeking the release of their associate.", "url": "https://indianexpress.com/article/cities/delhi/noida-five-cops-injured-scuffle-vhp-7892992/", "urlToImage": "https://images.indianexpress.com/2022/04/Noida-Police-Station.jpeg", "publishedAt": "2022-04-29T06:42:17Z", "content": "Five policemen were injured after a scuffle broke out between the cops and members of the Vishva Hindu Parishad (VHP) in Noida.According to the cops, the incident took place outside Sector 39 police … [+1176 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "‘Entry only. No exit:’ Beijing sees more Covid closures as anger grows in Shanghai", "description": "Chinese health officials did not respond to questions on whether Beijing will go under lockdown or what circumstances might prompt such measures.", "url": "https://indianexpress.com/article/world/china-covid-beijing-shanghai-closed/", "urlToImage": "https://images.indianexpress.com/2022/04/china1.jpg", "publishedAt": "2022-04-29T06:38:20Z", "content": "China’s capital Beijing closed more businesses and residential compounds on Friday, with authorities ramping up contact tracing to contain a Covid-19 outbreak, while resentment at the month-long lock… [+4775 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "MP Board MPBSE 10th, 12th Result 2022: List of websites to check scores", "description": "MP Board Result 2022 Websites: mpbse.nic.in, mpbse.mponline.gov.in, and mpresults.nic.in", "url": "https://indianexpress.com/article/education/mp-board-mpbse-10-12-result-2022-list-of-websites-to-check-scores-mpbse-nic-in-7893002/", "urlToImage": "https://images.indianexpress.com/2021/10/CBSE-exams.jpg", "publishedAt": "2022-04-29T06:37:23Z", "content": "The Madhya Pradesh Board of Secondary Education (MPBSE) will release the class 10 and 12 results today. The result will be announced at1 pm via press conference. Once declared, the link to download s… [+921 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Abhinav Rajput", "title": "Newsmaker | SC case to transfer ‘threats’ to Navratas meat to Shaheen Bagh, a South Delhi Mayor never out of news", "description": "Sources in the South Delhi Municipal Corporation say that much like over the meat ban, there is resistance from within the body against Mayor Mukesh Suryan's latest threat of an anti-encroachment drive under his jurisdiction.", "url": "https://indianexpress.com/article/india/political-pulse/south-delhi-mukesh-suryan-anti-encroachment-drive-shaheen-bagh-meat-ban-7892953/", "urlToImage": "https://images.indianexpress.com/2022/04/shaheen-bagh-eviction-drive.jpeg", "publishedAt": "2022-04-29T06:36:58Z", "content": "The first time Mukesh Suryan, the Mayor of South Delhi Municipal Corporation (SDMC) who has been going about threatening an anti-encroachment drive under his jurisdiction, hit the spotlight was for s… [+4427 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Axis Bank shares tumble over 5% after earnings announcement", "description": "Axis Bank share price: The stock tanked 5.23 per cent to Rs 739.10 on the BSE. At the NSE, it tumbled 5.21 per cent to Rs 739.10 apiece.", "url": "https://indianexpress.com/article/business/market/axis-bank-share-price-today-q4-earnings-net-profit-7892955/", "urlToImage": "https://images.indianexpress.com/2020/07/axis-bank-bloomberg-1200.jpg", "publishedAt": "2022-04-29T06:33:10Z", "content": "Shares of Axis Bank tumbled over 5 per cent in early trade on Friday a day after the company reported a 49.77 per cent jump in its consolidated net profit for the March quarter.The stock tanked 5.23 … [+1038 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Doctor Strange in the Multiverse of Madness new TV spot spoils Captain Carter and the Illuminati. Watch", "description": "The release of Doctor Strange in the Multiverse of Madness is days away, and now Marvel Studios is firing on all cylinders in its marketing and promotion. One of the recent TV spots has confirmed the presence of Hailey Atwell's Captain Carter and also the Ill…", "url": "https://indianexpress.com/article/entertainment/hollywood/doctor-strange-in-multiverse-of-madness-new-tv-spot-spoiler-captain-carter-illuminati-watch-7892839/", "urlToImage": "https://images.indianexpress.com/2022/04/doctor-strange-2-1200.jpg", "publishedAt": "2022-04-29T06:31:19Z", "content": "New TV spots from the upcoming MCU movie, Doctor Strange in the Multiverse of Madness, are spoiling several things about the film. It may be worth avoiding social media sites and perhaps the entire i… [+1868 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Soror Shaiza", "title": "INTACH Delhi Chapter honours its warriors with Heritage Awards 2022", "description": "Writer Sohail Hashmi, Talent Group, and Friends of Heritage Society were recipients of the awards", "url": "https://indianexpress.com/article/lifestyle/art-and-culture/intach-delhi-chapter-honours-its-warriors-with-heritage-awards-2022-sohail-hashmi-7892823/", "urlToImage": "https://images.indianexpress.com/2022/04/Talent-Group-team-with-from-right-Swapna-Liddle-AGK-Menon-Ashok-Vajpeyi.jpg", "publishedAt": "2022-04-29T06:30:00Z", "content": "Writer-filmmaker Sohail Hashmi, who has introduced scores of Delhi denizens to their heritage through his walks, was one of the recipients of the INTACH (Indian National Trust for Art and Cultural He… [+3031 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Serivce", "title": "Assistant professor exam scam: Karnatak University registrar handed over to police custody", "description": "The arrests follow a complaint by the Karnataka Examination Authority (KEA) that the examination conducted to hire assistant professors held in March this year was compromised.", "url": "https://indianexpress.com/article/cities/bangalore/assistant-professor-exam-scam-karnatak-university-registrar-handed-over-to-police-custody-7892976/", "urlToImage": "https://images.indianexpress.com/2022/02/mumbai-police-1-2.jpg", "publishedAt": "2022-04-29T06:29:20Z", "content": "A local court Thursday handed over H Nagaraj, registrar (evaluation) of Karnatak University Dharwad, to 10-day police custody. Nagaraj was arrested after the arrest of one of his students, Sowmya R, … [+903 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Serivce", "title": "Delhi child rights’ panel sets up award to recognise those championing kids", "description": "According to the commission, the aim of the awards is to focus on children’s issues in governance.", "url": "https://indianexpress.com/article/cities/delhi/delhi-child-rights-panel-sets-up-award-to-recognise-those-championing-kids-7892920/", "urlToImage": "https://images.indianexpress.com/2022/04/school-students.jpg", "publishedAt": "2022-04-29T06:29:08Z", "content": "The Delhi Commission for Protection of Child Rights (DCPCR) has constituted a new award to recognise individuals and organisations which have done significant work towards the welfare of children.The… [+1211 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Amid tight security, Chithirai car festival at Srirangam begins", "description": "The festival is being held in the backdrop of the recent Thanjavur tragedy where 11 persons, including three minors, were electrocuted after the temple car they were dragging touched a high-tension wire.", "url": "https://indianexpress.com/article/cities/chennai/amid-tight-security-chithirai-car-festival-at-srirangam-begins-7892940/", "urlToImage": "https://images.indianexpress.com/2022/04/Srirangam-festival.jpg", "publishedAt": "2022-04-29T06:19:40Z", "content": "After a gap of two years, the Chithirai car festival at Srirangams Sri Ranganathaswamy temple in Tiruchirapalli district began Friday morning amid high security after officials inspected the car and … [+1449 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "E Kumar Sharma", "title": "World Malaria Day: ‘Data-driven decision making and tailored approaches crucial now in all efforts to eliminate malaria’", "description": "Dr Corine Karema, a senior Malaria expert and the former Director of the Rwanda National Malaria Control Program (NMCP), in an interview with The Indian Express group talks about eliminating malaria, the impact of Covid-19 on such programmes and the way forwa…", "url": "https://indianexpress.com/article/lifestyle/health/dr-corine-karema-malaria-elimination-covid-impact-7892863/", "urlToImage": "https://images.indianexpress.com/2022/04/ch1570981.jpg", "publishedAt": "2022-04-29T06:16:31Z", "content": "The world has yet to emerge completely out of the long shadow of Covid-19 but the hunt continues to find the most effective ways to eliminate a deadlier disease Malaria one that has grappled health e… [+14027 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "GUJCET 2022 Answer key released: How to download", "description": "GSHSEB has released the provisional answer key of GUJCET 2022 and candidates are now allowed to raise objections, if any. Visit the official website —  gujcet.gseb.org", "url": "https://indianexpress.com/article/education/gujcet-2022-answer-key-released-how-to-download-gujcet-gseb-org-7881794/", "urlToImage": "https://images.indianexpress.com/2022/01/UPTET-answer-key.jpg", "publishedAt": "2022-04-29T06:15:03Z", "content": "GUJCET is a state-level entrance examination conducted for admission to undergraduate-level professional courses at participating institutions in Gujarat. The entrance examination was conducted on Ap… [+498 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Severe heatwave sweeps India; temperatures to rise further over next 5 days", "description": "Large parts of India have been recording higher than normal temperatures since the last week of March, with weather experts attributing it to the absence of periodic light rainfall and thundershowers, typical for this time of the year, due to the lack of acti…", "url": "https://indianexpress.com/article/india/india-weather-forecast-heatwave-7892754/", "urlToImage": "https://images.indianexpress.com/2022/03/delhi-heatwave.jpg", "publishedAt": "2022-04-29T06:13:01Z", "content": "The India Meteorological Department (IMD) has warned that the current spell of heatwave may further intensify over the next five days, with temperatures touching 45 degrees Celsius in some parts of t… [+4154 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "North Korea’s Kim Jong Un calls for stronger military as nuclear test work ‘well underway’", "description": "Kim made the remarks during photo sessions with troops, state media broadcasters, and others involved in a massive military parade staged on Monday, which marked the 90th anniversary of the army's founding.", "url": "https://indianexpress.com/article/world/north-koreas-kim-calls-for-stronger-military-as-nuclear-test-work-well-underway-7892875/", "urlToImage": "https://images.indianexpress.com/2022/04/Kim-Jong-un-1.jpeg", "publishedAt": "2022-04-29T06:08:18Z", "content": "North Korean leader Kim Jong Un called on the country’s military to “bolster up their strength in every way to annihilate the enemy”, state media reported on Friday, as new satellite imagery showed i… [+2217 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Singapore court stays execution of Indian origin man Datchinamurthy Kataiah", "description": "Datchinamurthy Kataiah was scheduled to be hanged on Friday, according to media reports.", "url": "https://indianexpress.com/article/world/singapore-execution-datchinamurthy-kataiah-stayed-7892830/", "urlToImage": "https://images.indianexpress.com/2022/04/singapore-1.jpg", "publishedAt": "2022-04-29T06:07:39Z", "content": "A court in Singapore stayed the execution of an Indian origin man convicted for drug trafficking, pending the conclusion of a civil application that he and other death row inmates filed against the A… [+3119 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Google signs MoU with Telangana govt to support youth, women entrepreneurs with digital skills", "description": "Google will collaborate with the government through its various arms to extend scholarships for Google Career Certificates to Telangana's youth, support women and entrepreneurs.", "url": "https://indianexpress.com/article/education/google-signs-mou-with-telangana-govt-support-youth-women-entrepreneurs-with-digital-skills-7892840/", "urlToImage": "https://images.indianexpress.com/2022/04/Google-AP.jpg", "publishedAt": "2022-04-29T06:06:28Z", "content": "Google on Thursday signed a Memorandum of Understanding with the Telangana government to bring benefits of the digital economy to the youth and women entrepreneurs in the state and kicked off the gro… [+2659 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Serivce", "title": "Speaker Kultar Singh Sandhwan orders probe into Assembly staff hiring during Cong rule", "description": "“We will get this inquired into. Whatever has been done and is not in sync with the law would be probed,” said Punjab Speaker Kultar Singh Sandhwan.", "url": "https://indianexpress.com/article/cities/chandigarh/speaker-kultar-singh-sandhwan-orders-probe-into-assembly-staff-hiring-during-cong-rule-7892884/", "urlToImage": "https://images.indianexpress.com/2022/03/Kultar-Singh-Sandhwan.jpg", "publishedAt": "2022-04-29T06:05:29Z", "content": "Punjab Speaker Kultar Singh Sandhwan Thursday ordered an inquiry into recruitment of staff members in the Punjab Vidhan Sabha during the tenure of the previous Congress government. The probe was orde… [+2912 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Northeast Delhi riots case: Delhi HC adjourns hearing of Umar Khalid’s bail plea to May 6", "description": "The court said that the challenge to the constitutional validity of Section 124A of the Indian Penal Code — one of the provisions invoked against him — is pending before the Supreme Court and listed for hearing on May 5.", "url": "https://indianexpress.com/article/cities/delhi/northeast-delhi-riots-delhi-high-court-umar-khalid-bail-7892907/", "urlToImage": "https://images.indianexpress.com/2021/11/ch1362753.jpg", "publishedAt": "2022-04-29T06:04:35Z", "content": "The Delhi High Court Friday adjourned student activist Umar Khalids bail plea in the conspiracy case related to the 2020 Northeast Delhi riots to May 6, saying that the challenge to the constitutiona… [+924 chars]"}]}