{"status": "ok", "totalResults": 390, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Heavy rains lash parts of Hyderabad; thundershowers likely in Telangana", "description": "According to the IMD, Telangana has recorded a departure of -74 per cent for the season with actual rainfall of 8 mm recorded in the state to date.", "url": "https://indianexpress.com/article/cities/hyderabad/hyderabad-rains-telangana-thundershowers-imd-weather-7900241/", "urlToImage": "https://images.indianexpress.com/2020/10/hyderabad.jpg", "publishedAt": "2022-05-04T02:45:56Z", "content": "Heavy rains, accompanied by gusty winds and lightning, lashed parts of Hyderabad early Wednesday morning. While this brought huge relief from the summer heat, several low-lying areas reported waterlo… [+1407 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Narendra Modi Europe visit Live Updates: PM to attend India-Nordic summit, meet French President Emmanuel Macron", "description": "PM Modi Europe Visit Latest Updates: Denmark's Prime Minister said she “hoped” that “India will influence Russia” to end the war in Ukraine.", "url": "https://indianexpress.com/article/india/narendra-modi-europe-visit-live-updates-india-nordic-summit-denmark-france-emmanuel-macron-7900230/", "urlToImage": "https://images.indianexpress.com/2022/05/PTI05_03_2022_000419B-1.jpg", "publishedAt": "2022-05-04T02:41:42Z", "content": "Prime Minister Narendra Modi greets members of the Indian community during an event, in Copenhagen, Denmark. (PTI Photo)\r\nPrime Minister Narendra Modi in his address on Tuesday to the Indian communit… [+808 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Indians to benefit as US announces extension for expiring immigrant work permits", "description": "The move is expected to benefit those seeking green cards and spouses of H-1B visa holders who get employment authorisation cards.", "url": "https://indianexpress.com/article/world/us-work-permits-extension-immigrants-7900224/", "urlToImage": "https://images.indianexpress.com/2022/05/us-visa.jpg", "publishedAt": "2022-05-04T02:39:29Z", "content": "The Biden administration has announced an automatic extension of expiring work permits for certain categories of immigrants, including those seeking green cards and spouses of H-1B visa holders who g… [+3263 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Abortion-rights protesters rally in US, spurred by draft Supreme Court opinion", "description": "The protests in Washington were a prelude to rallies planned by abortion-rights advocates in cities across the country.", "url": "https://indianexpress.com/article/world/us-abortion-rights-protests-7900213/", "urlToImage": "https://images.indianexpress.com/2022/05/roe.jpg", "publishedAt": "2022-05-04T02:14:13Z", "content": "Protesters rallied under the slogan “off our bodies” in cities across the United States on Tuesday, demanding abortion rights be protected after the leak of a draft Supreme Court opinion that would o… [+4569 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rahel Philipose, Sonal Gupta", "title": "Daily Briefing: PM told in Denmark, ‘hope India influences Russia to end war’; China plans strict Covid curbs for Asian Games", "description": "As the Congress prepares for its three-day “chintan shivir” beginning May 13, a 12-second video shared by the BJP, purportedly from the wedding of Rahul Gandhi’s “friend” in Kathmandu, has the party scrambling for damage control.", "url": "https://indianexpress.com/article/live-news/top-news-today-7900206/", "urlToImage": "https://images.indianexpress.com/2022/05/Express-intro-1.jpg", "publishedAt": "2022-05-04T02:04:57Z", "content": "PM Modis Euro tour, curfew in Rajasthans Jodhpur and the power crisis in India Here are the top reads from todays edition:\r\nThe Big Story\r\nOn the second leg of his Europe trip, Prime Minister Narendr… [+4782 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Navjeevan Gopal", "title": "Remarks on ex-CM Police tell SC panel no case made out against Sunil Jakhar", "description": "Sunil Jakhar has been denying making any casteist remarks, while reiterating that what he said in a TV interview was projected “out of context”.", "url": "https://indianexpress.com/article/cities/chandigarh/remarks-on-ex-cm-police-tell-sc-panel-no-case-made-out-against-sunil-jakhar-7900191/", "urlToImage": "https://images.indianexpress.com/2022/05/Sunil-Jakhar.jpg", "publishedAt": "2022-05-04T01:37:59Z", "content": "Punjab Police have told the National Commission for Scheduled Castes that no case is made out against former Punjab Pradesh Congress Committee (PPCC) chief Sunil Jakhar who was accused of making dero… [+1424 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Hina Rohtaki", "title": "Manish Tewari bid to test Chandigarh water sparks buzz on seat, AAP switch", "description": "In Parliament's recent sessions, Tewari has strongly raised issues pertaining to Chandigarh, whether it was to protest the demolition of Chandigarh’s largest slum colony or to oppose the proposal to privatise Chandigarh's electricity utility department.", "url": "https://indianexpress.com/article/india/political-pulse/manish-tewari-bid-to-test-chandigarh-water-sparks-buzz-on-seat-aap-switch-7899994/", "urlToImage": "https://images.indianexpress.com/2022/05/manish-tewari-2-1.jpg", "publishedAt": "2022-05-04T01:34:16Z", "content": "Senior Congress leader and Anandpur Sahib MP Manish Tewari’s continuing bid to focus on Chandigarh affairs has triggered a buzz in Punjab political circles that he might be exploring the constituency… [+4879 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Jeff Daniels to star in Regina King’s Netflix series A Man in Full", "description": "Netflix's upcoming series A Man in Full is reportedly based on the Tom Wolfe novel of the same name.", "url": "https://indianexpress.com/article/entertainment/web-series/jeff-daniels-star-in-regina-king-netflix-series-a-man-in-full-7899407/", "urlToImage": "https://images.indianexpress.com/2022/05/jeff-daniels.jpg", "publishedAt": "2022-05-04T01:31:20Z", "content": "Veteran actor Jeff Daniels is set to play the lead role in Netflix’s upcoming series A Man in Full, to be directed by Regina King.According to Variety, the drama is based on the Tom Wolfe novel of th… [+592 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "2022 Indian Film Festival of Los Angeles: Chandigarh-based filmmaker’s Punjabi film ‘Jaggi’ wins 2 awards in Los Angeles", "description": "Through Jaggi, played by actor Ramnish Chaudhary, adds Sidhu, he wants to change the perspective of society, so that those who are abused, can have a voice and stand up for themselves.", "url": "https://indianexpress.com/article/cities/chandigarh/2022-indian-film-festival-of-los-angeles-chandigarh-based-filmmakers-punjabi-film-jaggi-wins-2-awards-in-los-angeles-7900183/", "urlToImage": "https://images.indianexpress.com/2022/05/jaggi-movie.jpg", "publishedAt": "2022-05-04T01:30:12Z", "content": "THE 2022 Indian Film Festival of Los Angeles (IFFLA) announced the award winners for its 20th annual edition which featured a celebratory return to in-theatre screenings and presentations. Chandigarh… [+4222 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Deputy Mayor asks GMADA to improve parking, allow four floors, stilt parking", "description": "In his letter, Deputy Mayor Bedi said that Mohali is a constantly evolving city where people are facing huge parking problems. In order to solve this problem, the parking space was created by the Municipal Corporation near parks but still space is not suffici…", "url": "https://indianexpress.com/article/cities/sas-nagar-mohali/deputy-mayor-asks-gmada-to-improve-parking-allow-four-floors-stilt-parking-7900180/", "urlToImage": "https://images.indianexpress.com/2022/05/aprking.jpg", "publishedAt": "2022-05-04T01:19:54Z", "content": "With the parking space shrinking in the city day by day, Deputy Mayor Kuljeet Singh Bedi has written to the Greater Mohali Area Development Authority (GMADA) to take immediate steps to improve parkin… [+1940 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Panchkula: Booster dose for 18+ years from today", "description": "The booster dose is aimed at boosting the immunity, by producing more antibodies against the virus. A prior appointment through Centre's CoWin app is required to be able to avail the dose.", "url": "https://indianexpress.com/article/cities/chandigarh/panchkula-booster-dose-for-18-years-from-today-7900178/", "urlToImage": "https://images.indianexpress.com/2022/05/vax-delhi.jpg", "publishedAt": "2022-05-04T01:16:17Z", "content": "Free Covid -19 booster dose drive for those above 18 years of age will begin at Panchkula government facilities on Wednesday. All adults, who have completed a period of nine months after being admini… [+1303 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "2nd FIR in same offence not maintainable: Punjab & Haryana HC", "description": "The counsel argued that the registration of the second FIR is an abuse of the process of the court, because the first FIR, in which the petitioner now has been acquitted already, stood registered under the identical sections.", "url": "https://indianexpress.com/article/cities/chandigarh/2nd-fir-in-same-offence-not-maintainable-punjab-haryana-hc-7900176/", "urlToImage": "https://images.indianexpress.com/2022/05/PANDH-1-1.jpg", "publishedAt": "2022-05-04T01:08:50Z", "content": "Holding that a second FIR with respect to the same offence/ occurrence/ incident is not maintainable, the Punjab and Haryana High Court quashed an FIR registered by the Chandigarh Police in connectio… [+2461 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Panchkula illegal abortion: Police arrest woman running NGO and clinic", "description": "Accused Sarita Kaushal has been running an NGO and one clinic in Sector 17 Rajiv Colony in Panchkula for the last five years. She was arrested by a team of Sector 16 police post incharge S-I Sushil Kumar.", "url": "https://indianexpress.com/article/cities/chandigarh/panchkula-illegal-abortion-police-arrest-woman-running-ngo-and-clinic-7900174/", "urlToImage": "https://images.indianexpress.com/2022/05/arrest-1-8-8-2.jpg", "publishedAt": "2022-05-04T01:00:46Z", "content": "The PANCHKULA police Tuesday arrested a woman, Sarita Kaushal, of Sector 11, Panchkula, in connection with illegal abortion of a woman who got admitted to PGI in critical condition two days ago. Accu… [+2138 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Is Punjab economy inching towards debt trap, and why it is cause for worry", "description": "Given the multiple challenges faced by the economy, as analyzed above, it is strongly desirable that ever mounting outstanding debt and debt servicing burden be controlled at this stage only before it is too late to mend.", "url": "https://indianexpress.com/article/cities/chandigarh/is-punjab-economy-inching-towards-debt-trap-and-why-it-is-cause-for-worry-7900172/", "urlToImage": "https://images.indianexpress.com/2022/05/punjab-g.jpg", "publishedAt": "2022-05-04T00:53:53Z", "content": "Is Punjab economy inching towards debt trap? Is there really a cause to worry? These are natural questions that should arise inquisitively while having a cursory look at the ever soaring debt burden … [+6499 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "One held after man’s dismembered body found in Ludhiana canal", "description": "Police said that Mehfooz hacked Islam to death with a sharp edged weapon with intention to rob Rs 25,000 in cash from him. The accused then cut the body in pieces with an axe before dumping it in the Sidhwan Canal.", "url": "https://indianexpress.com/article/cities/ludhiana/one-held-after-mans-dismembered-body-found-in-ludhiana-canal-7900170/", "urlToImage": "https://images.indianexpress.com/2022/05/express-photo-13-5-1.jpg", "publishedAt": "2022-05-04T00:47:46Z", "content": "Parts of a man’s dismembered body, allegedly cut into several pieces and stuffed in different bags before being dumped, were recovered from Sidhwan Canal Monday, after which the Ludhiana police arres… [+1568 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Congress calls on Punjab Governor, seeks termination of knowledge sharing pact with Delhi, raises law & order concerns", "description": "The memorandum on law and order mentioned about two groups clashing in Patiala last week over an anti-Khalistan march  said despite advance intelligence inputs, the government failed to take timely action.", "url": "https://indianexpress.com/article/cities/chandigarh/congress-calls-on-punjab-governor-seeks-termination-of-knowledge-sharing-pact-with-delhi-raises-law-order-concerns-7900167/", "urlToImage": "https://images.indianexpress.com/2022/05/Kejriwal-Mann-2.jpg", "publishedAt": "2022-05-04T00:44:30Z", "content": "A Punjab Congress delegation Tuesday met Governor Banwari Lal Purohit and expressed concern over law and order situation in state and seeking the termination of the knowledge-sharing agreement that t… [+3786 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "After bonus for DSR adoption, CM Bhagwant Mann promises MSP for alternative crops", "description": "Under the DSR technique, paddy seeds are drilled into the ground with the help of a machine that does seeding of rice and spraying of herbicide simultaneously.", "url": "https://indianexpress.com/article/cities/ludhiana/bonus-for-dsr-adoption-bhagwant-mann-promises-msp-alternative-crops-paddy-maize-bajra-7900165/", "urlToImage": "https://images.indianexpress.com/2022/05/paddy.jpg", "publishedAt": "2022-05-04T00:37:35Z", "content": "With paddy sowing set to begin in Punjab, CM Bhagwant Mann Tuesday declared that to encourage crop diversification, his government will provide minimum support price (MSP) on alternative crops such a… [+1478 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "AAP issues show-cause notice to 6 councillors, asks why they voted in favour of agenda item", "description": "It was added, “During the discussions on the above-mentioned agenda/item in MC house, our leader of the house Councillor Sh Yogesh Dhingra demanded the poll. As discussed in the House meeting, it was made clear that all councillors shall vote against this age…", "url": "https://indianexpress.com/article/cities/chandigarh/aap-issues-show-cause-notice-to-6-councillors-asks-why-they-voted-in-favour-of-agenda-item/", "urlToImage": "https://images.indianexpress.com/2019/09/aam-aadmi-party-aap-logo-1200.jpg", "publishedAt": "2022-05-04T00:31:34Z", "content": "The city unit of AAP Tuesday issued a show-cause notice to six of its councillors seeking an immediate reply as to why they voted in favour of an agenda item when the party leadership had not said so… [+1378 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anju Agnihotri Chaba", "title": "Punjab to conclude procurement as wheat arrival declines: Centre yet to take call on shrivelled grains, mandis to start shutting from May 5", "description": "There is a huge demand for Indian wheat amid sharp decline in availability of the grain in the global market due to the ongoing conflict between Russia and Ukraine. Both nations are major producers and exporters of wheat.", "url": "https://indianexpress.com/article/cities/jalandhar/punjab-to-conclude-procurement-as-wheat-arrival-declines-centre-yet-to-take-call-on-shrivelled-grains-mandis-to-start-shutting-from-may-5-7900158/", "urlToImage": "https://images.indianexpress.com/2022/05/PUNJAB-WHEAT.jpg", "publishedAt": "2022-05-04T00:27:20Z", "content": "A year after surpassing all previous records in wheat procurement ever during the last Rabi marketing Season (RMS), Punjab has this year hit its lowest procurement figure in that last 15 years with a… [+4726 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "After hitting victim, accused driver crashed his BMW near Burail jail; sent to custody", "description": "The victim Shubham, a resident of Dadu Majra and an employee with a garment shop in Sector 23, had come to Sector 22 along with his three friends. Sources said they had dinner at a restaurant and were waiting for a cab when Swapan Preet stopped his car near t…", "url": "https://indianexpress.com/article/cities/chandigarh/after-hitting-victim-accused-driver-crashed-his-bmw-near-burail-jail-sent-to-custody-7900161/", "urlToImage": "https://images.indianexpress.com/2022/05/accident-1-1-2-1.jpg", "publishedAt": "2022-05-04T00:22:38Z", "content": "The driver of the car that mowed down and dragged a 24-year-old for over 80 metres on the bonnet, also crashed his BMW near Model Jail, Burail, in Sector 22 on Friday night. The incident happened aft… [+1813 chars]"}]}