{"status": "ok", "totalResults": 495, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "Watch: Fan makes cricketer Dinesh Karthik’s portrait with Rubik’s Cubes", "description": "The portrait of Dinesh Karthik was made using 600 Rubik Cubes.", "url": "https://indianexpress.com/article/trending/trending-in-india/fan-makes-dinesh-karthiks-portrait-with-rubiks-cubes-8009671/", "urlToImage": "https://images.indianexpress.com/2022/07/rubiks-cube-cricket.jpg", "publishedAt": "2022-07-05T06:39:41Z", "content": "A fan celebrated cricketer Dinesh Karthiks first match as a captain of the Indian mens cricket team by making his portrait using Rubik’s Cubes.The making of the massive portrait was documented in a v… [+2263 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Immigration detention facility near empty in California", "description": "The Adelanto facility refers to how the US government’s use of guaranteed minimum payments in contracts with private companies to house immigrant detainees might have a potential financial downside.", "url": "https://indianexpress.com/article/world/immigration-detention-facility-near-empty-in-california-8009487/", "urlToImage": "https://images.indianexpress.com/2019/03/us-detention-centre-12.jpg", "publishedAt": "2022-07-05T06:39:09Z", "content": "A sprawling, privately run detention center in the wind-swept California desert town of Adelanto could house nearly 2,000 migrants facing the prospect of deportation. These days, though, its nearly e… [+6276 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Activists with Peng Shuai T-shirts searched at Wimbledon", "description": "Peng is a retired professional tennis player from China who last year accused a former high-ranking member of the country’s ruling Communist Party of sexual assault. She has made very few public appearances since then.", "url": "https://indianexpress.com/article/sports/tennis/activists-with-peng-shuai-t-shirts-searched-at-wimbledon-8009462/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-12-1.jpg", "publishedAt": "2022-07-05T06:38:22Z", "content": "Four activists wearing Where is Peng Shuai? T-shirts were stopped by security at Wimbledon on Monday and had their bags searched.Peng is a retired professional tennis player from China who last year … [+2926 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Heavy rain in Mumbai, neighbouring areas; the IMD forecasts more showers in next 24 hrs", "description": "The local train services, considered as the lifeline of Mumbai, were running normally on both the Central Railway and Western Railway routes, authorities said.", "url": "https://indianexpress.com/article/cities/mumbai/heavy-rain-imd-forecast-mumbai-neighbouring-areas-8009452/", "urlToImage": "https://images.indianexpress.com/2022/06/mumbai_rains-1.jpg", "publishedAt": "2022-07-05T06:37:48Z", "content": "Mumbai and its adjoining areas witnessed heavy downpour on Tuesday morning, and the Indian Meteorological Department (IMD) has predicted moderate to heavy rain in Mumbai and its suburbs over the next… [+1054 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Motive likely not terror-related in ‘brutal’ Danish shooting", "description": "“It was the worst possible nightmare,” Danish Prime Minister Mette Frederiksen said, calling the attack \"unusually brutal.”", "url": "https://indianexpress.com/article/world/motive-likely-not-terror-related-in-brutal-danish-shooting-8009446/", "urlToImage": "https://images.indianexpress.com/2022/07/AP22185392450714-1.jpg", "publishedAt": "2022-07-05T06:34:15Z", "content": "A gunman who killed three people when he opened fire in a crowded shopping mall acted alone and apparently selected his victims at random, Danish police said on Monday, but ruled out that the attack … [+3874 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Adani lowest bidder in Coal India’s maiden import tender, miner may negotiate price", "description": "Adani Group and another 10 companies had shown interests for the miner's maiden coal import tender for supply of the dry fuel on a freight-on-road (FOR) basis, including Mohit Minerals and Chettinad Logistics.", "url": "https://indianexpress.com/article/business/companies/adani-lowest-bidder-in-cils-maiden-coal-import-tender-miner-may-negotiate-price-8009550/", "urlToImage": "https://images.indianexpress.com/2022/07/Reuters-Adani-Group-1200.jpg", "publishedAt": "2022-07-05T06:31:55Z", "content": "Adani Enterprises has emerged as the lowest bidder in Coal India’s tender for imports of the dry fuel with quoting over Rs 4,000 crore for supply of 2.416 million tonne, even though the miner is like… [+1469 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "The Conversation", "title": "Your body has an internal clock that dictates when you eat, sleep and might have a heart attack – all based on time of day", "description": "Your biological clock affects your health by regulating your sleep-wake cycles and fluctuations in blood pressure and body temperature", "url": "https://indianexpress.com/article/lifestyle/health/biological-clock-eat-sleep-heart-attack-health-8008030/", "urlToImage": "https://images.indianexpress.com/2022/06/sleep_1200_getty.jpg", "publishedAt": "2022-07-05T06:30:53Z", "content": "Anyone who has suffered from jet lag or struggled after turning the clock forward or back an hour for daylight saving time knows all about what researchers call your biological clock, or circadian rh… [+5997 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "After Pakistan Army chief, ISI head issues strict orders to his commanders to stay away from politics", "description": "Pakistan Army, which has ruled the coup-prone country for more than half of its 73-plus years of existence, has hitherto wielded considerable power in the matters of security and foreign policy.", "url": "https://indianexpress.com/article/pakistan/pakistan-isi-head-issues-orders-to-stay-away-from-politics-8009596/", "urlToImage": "https://images.indianexpress.com/2022/07/nadeem-1200.jpg", "publishedAt": "2022-07-05T06:29:53Z", "content": "The chief of Pakistan’s spy agency ISI has issued strict orders to all commanders to stay away from politics following directives from Army chief Gen Qamar Javed Bajwa to offset a smear campaign agai… [+3174 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Malaika Arora shares a loved-up post for Arjun Kapoor: ‘This weather is so romantic…’", "description": "Malaika Arora recently shared an adorable post for her partner and Ek Villain Returns actor Arjun Kapoor.", "url": "https://indianexpress.com/article/entertainment/bollywood/malaika-arora-shares-a-loved-up-post-for-arjun-kapoor-watch-video-8009456/", "urlToImage": "https://images.indianexpress.com/2022/07/arjun1200-1.jpg", "publishedAt": "2022-07-05T06:22:25Z", "content": "Malaika Arora on Tuesday took to social media to share an adorable post for her partner and actor Arjun Kapoor. In the video post, she also mentioned her love for Paris, writing, “This weather is so … [+1869 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Sidhu Moose Wala’s Killers Celebrate Inside Car, Flaunt Guns Inside Vehicle", "description": "", "url": "https://indianexpress.com/videos/news-video/sidhu-moose-walas-killers-celebrate-inside-car-flaunt-guns-inside-vehicle/", "urlToImage": "https://images.indianexpress.com/2022/07/Copy-of-Social-Media-Conference-YouTube-Thumbnail-2.jpg", "publishedAt": "2022-07-05T06:14:13Z", "content": "PM Talked Of New Politics, Where Political Ecosystem Transcends Beyond Battering: Ravi Shankar Prasad"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Ranveer Singh says he is learning Konkani for his future children, Deepika Padukone blushes: ‘When we do have children…’", "description": "Ranveer Singh said that he wants to learn Konkani, which is Deepika Padukone's mother tongue, for his future children.", "url": "https://indianexpress.com/article/entertainment/bollywood/ranveer-singh-deepika-padukone-future-children-learning-konkani-8009379/", "urlToImage": "https://images.indianexpress.com/2022/04/Ranveer-Singh-1299.jpg", "publishedAt": "2022-07-05T06:13:19Z", "content": "Actors Deepika Padukone and Ranveer Singh recently attended an NRI convention in San Jose, California which was hosted by the Konkani community of the area. The videos from the event were widely shar… [+2236 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Redmi reveals K-series is coming back to India, could launch K50-series soon", "description": "Redmi's K-series phones are coming back to India soon, perhaps with the K50 and K50 Pro phones.", "url": "https://indianexpress.com/article/technology/mobile-tabs/redmi-reveals-k-series-is-coming-back-to-india-could-launch-k50-series-soon-8009545/", "urlToImage": "https://images.indianexpress.com/2022/07/Redmi-K50-Pro.jpg", "publishedAt": "2022-07-05T06:11:07Z", "content": "Xiaomi sub-brand Redmi is bringing its K-series devices back to India. Previously the Redmi K20 Pro was launched back in 2019, which was a great phone for the price, complete with a flagship chip, a … [+1531 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Canada says its officials were denied access to trial of billionaire in China", "description": "Xiao, who went missing in Hong Kong five years ago, was due to go on trial in China on Monday and Canadian consular officials had been pressing for consular access.", "url": "https://indianexpress.com/article/world/canada-officials-denied-access-trial-of-billionaire-china-8009443/", "urlToImage": "https://images.indianexpress.com/2022/07/china-missing-tycoon-480-1.jpg", "publishedAt": "2022-07-05T06:06:19Z", "content": "Chinese authorities have blocked Canadian government representatives from attending the trial of Chinese-Canadian billionaire Xiao Jianhua, the Canadian embassy said on Tuesday.Xiao, who went missing… [+2681 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "A survivor of the migrant trailer: ‘They couldn’t breathe’", "description": "Guatemala’s Foreign Ministry has said that 20 Guatemalans died in the incident, 16 of whom have been positively identified. Foreign Minister Mario Búcaro said he hoped the first bodies would be repatriated this week.", "url": "https://indianexpress.com/article/world/a-survivor-of-the-migrant-trailer-they-couldnt-breathe-8009555/", "urlToImage": "https://images.indianexpress.com/2022/06/MIGRANT-CARAVAN-1.jpg", "publishedAt": "2022-07-05T06:04:57Z", "content": "Simple advice from a friend to stay near the door may have saved Yenifer Yulisa Cardona Tomás from the deadly fate that befell fifty-three other migrants when they were abandoned and trapped in a swe… [+3462 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Zee TV news anchor Rohit Ranjan detained by UP police over Rahul Gandhi doctored video", "description": "Chhattisgarh Police officials arrived at Ranjan's residence to arrest him in connection with an FIR that was registered against him earlier.", "url": "https://indianexpress.com/article/cities/delhi/zee-tv-news-anchor-rohit-ranjan-detained-rahul-gandhi-doctored-video-8009546/", "urlToImage": "https://images.indianexpress.com/2022/07/WhatsApp-Image-2022-07-05-at-11.16.48-AM.jpeg", "publishedAt": "2022-07-05T06:04:33Z", "content": "Zee TV news anchor, Rohit Ranjan, was detained by the UP police on Tuesday morning after the channel allegedly aired misleading clips about Congress leader Rahul Gandhi.Chhattisgarh Police officials … [+1093 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Passenger vehicle retail sales up 40% in June as chip supply improves", "description": "According to the Federation of Automobile Dealers Associations (FADA), passenger vehicle (PV) registrations rose to 2,60,683 units last month, as compared to 1,85,998 units in June 2021, registering an increase of 40 per cent.", "url": "https://indianexpress.com/article/business/passenger-vehicle-retail-sales-up-40-pc-in-june-as-chip-supply-improves-8009494/", "urlToImage": "https://images.indianexpress.com/2022/07/maruti-ncr-1.jpg", "publishedAt": "2022-07-05T06:02:55Z", "content": "Passenger vehicle retail sales in the country rose 40 per cent in June indicating an improvement in semiconductor supplies even as demand, especially for SUVs, remained robust, auto dealer’ body FADA… [+2346 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Four held for kidnapping caretaker of Gurgaon private firm", "description": "Officials said on Monday that the incident took place on July 2 at around 11 pm in the Farrukhnagar area. The officials said that they received a call from a man called Jaiveer, who works as a driver with the company.", "url": "https://indianexpress.com/article/cities/delhi/four-held-for-kidnapping-in-gurgaon-private-firm-8009547/", "urlToImage": "https://images.indianexpress.com/2022/07/kidnapping.jpg", "publishedAt": "2022-07-05T06:00:30Z", "content": "Four people have been arrested for allegedly kidnapping the caretaker of a warehouse of a private company in Gurgaon last week, said the police.Officials said on Monday that the incident took place o… [+1599 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Five student-led organisations that are fighting to reduce plastic pollution in India", "description": "In the wake of addressing the resolution of managing single-use plastic production, the government has also been taking measures for awareness towards the elimination of single-use plastics", "url": "https://indianexpress.com/article/lifestyle/life-style/govt-bans-single-use-plastic-five-student-led-organisations-battling-plastic-8007621/", "urlToImage": "https://images.indianexpress.com/2022/07/plastic-waste-california-1.jpg", "publishedAt": "2022-07-05T06:00:08Z", "content": "To curb the pollution caused by littered and unmanaged plastic waste, the Government of India has imposed a ban on the manufacture, import, stocking, distribution, sale and use of identified single-u… [+7726 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Xiaomi 12S Ultra sports a stunning camera, but you won’t get to try it", "description": "Xiaomi 12S Ultra is the true successor to the earlier Mi 11 Ultra smartphone. A look at its features, specifications, and everything else to know about this phone.", "url": "https://indianexpress.com/article/technology/mobile-tabs/xiaomi-12s-ultra-features-specifications-availability-8009522/", "urlToImage": "https://images.indianexpress.com/2022/07/Xiaomi12_Ultra2_LEAD.jpg", "publishedAt": "2022-07-05T05:59:20Z", "content": "The camera module at the back is designed to resemble an actual DSLR camera lens. The design also functions as a tribute to Xiaomis partnership with Leica, the German camera-maker. However, the 12S s… [+3739 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Kaali poster row: Delhi, UP police file FIRs against filmmaker Leena Manimekalai", "description": "Independent filmmaker Leena Manimekalai drew flak online days after she tweeted the poster of her latest documentary Kaali.", "url": "https://indianexpress.com/article/india/delhi-up-police-file-firs-kaali-row-8009485/", "urlToImage": "https://images.indianexpress.com/2022/07/Leena-Manimekalai_1200.jpg", "publishedAt": "2022-07-05T05:51:48Z", "content": "The Delhi and Uttar Pradesh police registered FIRs against filmmaker Leena Manimekalai on Tuesday for “hurting religious sentiment” with the poster of her new documentary film Kaali.Delhi police stat… [+2829 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "HC grants bail to Shiv Sena MP’s associate in money laundering case", "description": "The court said it would give a detailed order later.", "url": "https://indianexpress.com/article/cities/mumbai/hc-grants-bail-shiv-sena-mp-associate-money-laundering-8009459/", "urlToImage": "https://images.indianexpress.com/2021/09/bhavana-gawali-shiv-sena.png", "publishedAt": "2022-07-05T05:48:48Z", "content": "The Bombay High Court has granted bail to Saeed Khan, an associate of Shiv Sena MP Bhavana Gawali, arrested by the Enforcement Directorate (ED) in a money laundering case last year.A single bench of … [+618 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "‘Kaali’ director Leena Manimekalai booked in Delhi for hurting religious sentiments", "description": "In the poster of the film Kaali, a woman dressed as the Hindu goddess is seen smoking a cigarette with a pride flag in the background.", "url": "https://indianexpress.com/article/cities/delhi/kaali-director-leena-manimekalai-delhi-religious-sentiments-8009519/", "urlToImage": "https://images.indianexpress.com/2022/07/kaali.jpg", "publishedAt": "2022-07-05T05:47:15Z", "content": "The Delhi Police have registered a case against documentary film Kaali and its director Leena Manimekalai for allegedly hurting religious sentiments with its poster, said officials Tuesday.The police… [+1944 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "S Korea to lift nuclear power share of energy mix to 30% by 2030", "description": "The U-turn in Asia's fourth-largest economy towards a pro-nuclear energy policy comes after Yoon won the March presidential election by the smallest margin in South Korea's democratic history.", "url": "https://indianexpress.com/article/world/s-korea-to-lift-nuclear-power-share-of-energy-mix-to-30-by-2030-8009471/", "urlToImage": "https://images.indianexpress.com/2022/06/Yoon-Suk-yeol-Reuters.jpeg", "publishedAt": "2022-07-05T05:40:35Z", "content": "South Korea plans to increase the contribution of nuclear power in the country’s power source mix to 30% or more by 2030 from 27.4% in 2021, the industry ministry said on Tuesday."}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi Government begins process for mass reshuffling of officers", "description": "Under this mass reshuffling, all personnel and officials working under one department and those working with the HODs, secretaries or ministers as per their choice for several years will be transferred to other departments.", "url": "https://indianexpress.com/article/cities/delhi/delhi-government-begins-process-for-mass-reshuffling-officers-8009477/", "urlToImage": "https://images.indianexpress.com/2022/06/delhi-secretariat.jpg", "publishedAt": "2022-07-05T05:37:43Z", "content": "The Delhi Government has begun the process of mass reshuffling of officials of the Delhi Administration Subordinate Services (DASS), Delhi, Andaman &amp; Nicobar, Lakshadweep, Daman and Diu and Dadra… [+1694 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "RBI gives green signal to HDFC, HDFC Bank merger proposal", "description": "Once the deal is effective, HDFC Bank will be 100 per cent owned by public shareholders, and existing shareholders of HDFC will own 41 per cent of the bank.", "url": "https://indianexpress.com/article/business/banking-and-finance/rbi-gives-green-signal-to-hdfc-hdfc-bank-merger-proposal-8009442/", "urlToImage": "https://images.indianexpress.com/2022/06/hdfc-bank-express-photo-1200.jpg", "publishedAt": "2022-07-05T05:33:53Z", "content": "HDFC Bank on Monday said it has got banking sector regulator RBI’s nod for the merger proposal of its parent HDFC Ltd with itself.Touted as the biggest transaction in India’s corporate history, HDFC … [+2220 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "PSEB Punjab board Class 10th result 2022: How to check score card", "description": "PSEB Punjab Board 10th Result 2022 at www.pseb.ac.in, indiaresults.com: Candidates can check their respective results at the official website —  pseb.ac.in. The PSEB class 10th term I and term II examinations were conducted between March and May 2022.", "url": "https://indianexpress.com/article/education/pseb-punjab-board-class-10th-result-2022-declared-how-to-check-score-card-pass-percentage-pseb-ac-in-indiaresults-in-7931984/", "urlToImage": "https://images.indianexpress.com/2022/06/1-2-2.jpg", "publishedAt": "2022-07-05T05:32:03Z", "content": "The Punjab board class 10 term-II examinations were conducted from April 24 to May 19, 2022, in an offline pen and paper mode by following all the COVID-19 guidelines provided by the government of In… [+1103 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "When Anil Kapoor complained about Shilpa Shetty getting a lip job while working on their film: ‘It threw my continuity for a toss’", "description": "Anil Kapoor wasn't happy about Shilpa Shetty's decision to get lip fillers midway through filming Badhaai Ho Badhaai, because it sent the 'continuity for a toss'.", "url": "https://indianexpress.com/article/entertainment/bollywood/when-anil-kapoor-complained-about-shilpa-shetty-lip-job-on-koffee-with-karan-8009444/", "urlToImage": "https://images.indianexpress.com/2022/07/anil-kapoor-shilpa-shetty-koffee-with-karan.jpg", "publishedAt": "2022-07-05T05:30:39Z", "content": "Actor Anil Kapoor has developed an amiable public persona through his interviews, in which he often highlights the work of others, and the jovial manner with which he conducts himself at industry eve… [+1981 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "লোহার রড নিয়ে মমতার বাড়িতে ঢোকে হাফিজুল, নেপথ্যে কি নাশকতার উদ্দেশ্য?", "description": "ত্রিস্তরীয় নিরাপত্তা বলয় ভেঙে কী ভাবে একজন পাঁচিল টপকে ঢুকে পড়ল তা নিয়ে প্রশ্ন উঠেছে।", "url": "https://bengali.indianexpress.com/west-bengal/mamata-banerjees-security-breach-trespasser-enters-cms-residence-with-iron-rodd-465477/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/05/Mamata-Banerjee-3.jpg", "publishedAt": "2022-07-05T05:30:09Z", "content": "? , ?\r\n , \r\n, , ? \r\n , \r\n, , “ , - , , ?”\r\n , - \r\n , “ , ! ? , ?”\r\nStay updated with the latest news headlines and all the latest Westbengal news download Indian Express Bengali App.\r\nWeb Title: Mama… [+74 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Admissions begin for certificate courses in music at Pune University", "description": "The course will include expert lectures, artist presentations, recordings, and short films. The duration of the course will be for four months and will be conducted online every Monday, Wednesday, and Friday from 6 pm to 8 pm.", "url": "https://indianexpress.com/article/cities/pune/admissions-begin-for-certificate-courses-in-music-at-pune-university-8009468/", "urlToImage": "https://images.indianexpress.com/2022/07/PUNE.jpeg", "publishedAt": "2022-07-05T05:30:08Z", "content": "The Centre for Performing Arts, popularly known as Lalit Kala Kendra, at Savitribai Phule Pune University is offering two certificate courses in music in collaboration with the Maharashtra Cultural C… [+1692 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Debraj Deb", "title": "Tripura’s retrenched school teachers flag attacks, seek security from police", "description": "On March 6 this year, Tripura education minister Ratan Lal Nath said the state government was trying to assure that the teachers get jobs in the different ongoing recruitment processes.", "url": "https://indianexpress.com/article/india/tripuras-retrenched-school-teachers-flag-attacks-seek-security-from-police-8009425/", "urlToImage": "https://images.indianexpress.com/2022/07/tripura-police-1-1.jpg", "publishedAt": "2022-07-05T05:24:41Z", "content": "A group of retrenched school teachers Monday staged a protest and sought the intervention of West Tripura police superintendent J Reddy seeking protection from assaults they have allegedly faced sinc… [+2192 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Patna HC stays demolition drive, DM says already complete", "description": "Directing the authorities not to take any coercive action, the court asked the district administration to file a reply on the next date of the hearing.", "url": "https://indianexpress.com/article/cities/patna-hc-stays-demolition-drive-dm-says-already-complete-8009429/", "urlToImage": "https://images.indianexpress.com/2022/07/patna-demo-PTI.jpg", "publishedAt": "2022-07-05T05:24:04Z", "content": "The Patna High Court has stayed the demolition drive in the city’s Nepali Nagar area, but the district magistrate said that by the time he received the order, the 40-acre land was cleared of encroach… [+1478 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "AI-based tool launched to help cantonment boards detect encroachments on defence land", "description": "Centre of Excellence on Satellite & Unmanned Remote Vehicle Initiative (CoE-SURVEI) has developed the software which can automatically detect changes on the ground, including unauthorised constructions and encroachments in a time series using satellite imager…", "url": "https://indianexpress.com/article/cities/pune/ai-based-tool-cantonment-boards-detect-encroachments-defence-land-8009455/", "urlToImage": "https://images.indianexpress.com/2022/07/forests1-1.jpg", "publishedAt": "2022-07-05T05:21:46Z", "content": "The Union Ministry of Defence ministry has launched an artificial intelligence-based software platform which is expected to help cantonment boards in the country detect unauthorised constructions and… [+2734 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Anne Hathaway reveals her favourite ‘Devil Wears Prada’ outfit", "description": "In the interview, Anne also went on to reveal what she regrets wearing once. \"There was this one time where I was very young...\"", "url": "https://indianexpress.com/article/lifestyle/fashion/anne-hathaway-reveals-favourite-devil-wears-prada-outfit-7992402/", "urlToImage": "https://images.indianexpress.com/2022/06/anne-hathaway-1200.jpg", "publishedAt": "2022-07-05T05:20:36Z", "content": "Anne Hathaway’s 2006 film The Devil Wears Prada, that chronicles the journey of Andy who lands a job as an assistant to Miranda Priestly, editor-in-chief of a high fashion magazine, was a movie that … [+1532 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Darlings teaser: Alia Bhatt, Shefali Shah play the game of life like pros in this intriguing dark comedy", "description": "Darlings teaser: Starring Alia Bhatt, Shefali Shah, Vijay Varma and Roshan Mathew, the film is a dark-comedy that explores the lives of a mother-daughter duo who try to find their place in Mumbai. It'll release on Netflix.", "url": "https://indianexpress.com/article/entertainment/bollywood/darlings-teaser-alia-bhatt-shefali-shah-daughter-mother-game-of-life-intriguing-dark-comedy-watch-8009338/", "urlToImage": "https://images.indianexpress.com/2022/07/darlings-alia-bhatt-shefali-shah-1200.jpg", "publishedAt": "2022-07-05T05:14:35Z", "content": "Alia Bhatt and Shefali Shah are set to take the audience on a thrilling journey in their upcoming film, Darlings. The teaser of their much awaited project has all the elements that would make for a r… [+1923 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Mumbai rains live updates: Amid heavy rainfall, CM Eknath Shinde directs officials to stay alert, NDRF teams deputed", "description": "Mumbai rains live updates, July 5: Parts of Mumbai including Sion, Mulund, Chembur, Andheri East, Patanwadi in Malad East, and Kandivali witnessed flooding after the rains.", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-rains-live-updates-8009415/", "urlToImage": "https://images.indianexpress.com/2022/07/WhatsApp-Image-2022-07-05-at-8.24.24-AM.jpeg", "publishedAt": "2022-07-05T05:04:04Z", "content": "Man walks under an umbrella amid heavy rainfall in Mumbai. (Express Photo by Amit Chakravarty)The National Investigation Agency (NIA) has taken over custody of all the seven accused in the murder of … [+1183 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Minecraft adds in-game tribute to popular YouTuber Technoblade", "description": "Minecraft updated the game with a new splash-screen that honours YouTuber and Minecraft streamer Technoblade, who recently passed away due to cancer.", "url": "https://indianexpress.com/article/technology/gaming/minecraft-adds-in-game-tribute-to-popular-youtuber-technoblade-8009426/", "urlToImage": "https://images.indianexpress.com/2022/07/Minecraft-splash-screen-technoblade-tribute.jpg", "publishedAt": "2022-07-05T04:59:39Z", "content": "Minecraft was recently updated to feature a new tribute to popular YouTube creator and streamer Technoblade, who recently passed away.The games tribute to the creator adds a new crowned pig to the ga… [+1889 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Christian Eriksen set to join Manchester United: Reports", "description": "The Danish midfielder is reported to have a verbal agreement with United and will officially complete his move to Old Trafford after a medical.", "url": "https://indianexpress.com/article/sports/football/christian-eriksen-set-to-join-manchester-united-reports-8009371/", "urlToImage": "https://images.indianexpress.com/2021/06/eriksen-denmark-1.jpg", "publishedAt": "2022-07-05T04:59:36Z", "content": "Denmarks Christian Eriksen has agreed to join Manchester United on a free transfer, according to the reports.Christian Eriksen has communicated to United that he wants to play for the Old Trafford cl… [+1363 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "This ’90s Annual day dance’ recreation has left netizens amused, and nostalgic", "description": "Several actors also responded to the hilarious video. Actor Priya Mani Raj commented, \"this is hilarious !!!!\" while actor Gayathrie Shankar reacted with emojis.", "url": "https://indianexpress.com/article/trending/trending-in-india/this-trios-90s-annual-day-dance-recreation-has-left-netizens-in-splits-8008702/", "urlToImage": "https://images.indianexpress.com/2022/07/hari_._muniyappanTwitter.jpg", "publishedAt": "2022-07-05T04:52:36Z", "content": "Annual days at school or college are eventful and full of funny moments for many. Making netizens reminisce their student lives, three men has shared a video featuring “90s Annual day dance”. Interne… [+991 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "UP: Man held for hurting religious sentiments, attacking cops", "description": "“The incident took place on Sunday when some people complained that Talib Hussain was selling chicken from his shop on a piece of paper carrying a picture of a Hindu god and goddess, hurting their religious feeling,” police said.", "url": "https://indianexpress.com/article/cities/lucknow/up-man-held-for-hurting-religious-sentiments-attacking-cops-8009397/", "urlToImage": "https://images.indianexpress.com/2022/07/WhatsApp-Image-2022-07-05-at-10.15.35-AM-1.jpeg", "publishedAt": "2022-07-05T04:50:45Z", "content": "A man was arrested in Uttar Pradesh, for allegedly hurting religious sentiments by selling chicken on a piece of paper having pictures of Hindu deities, and also attacking a police team.The incident … [+638 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "‘ভিলেন’ বৃষ্টি আর যানজট, ভোট দিতে পারলেন না প্রাক্তন মুখ্যমন্ত্রী-সহ ১১ জন কংগ্রেস বিধায়ক", "description": "উদ্ধবের সমস্ত পরিকল্পনায় জল ঢেলেছে তারই দলের শরিক কংগ্রেস।", "url": "https://bengali.indianexpress.com/politics/maharashtra-floor-test-ashok-chavan-among-11-absent-congress-mlas-we-got-stuck-in-traffic-465470/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/Maharashtra-Floor-test.jpg", "publishedAt": "2022-07-05T04:47:54Z", "content": "- , - \r\n , , , \r\n , , - , , , , , , , , \r\n , \r\n , , “ ”\r\n , “ ”\r\n! , \r\n , “ - ” , “ , ”\r\n ED, \r\n, \r\nStay updated with the latest news headlines and all the latest Politics news download Indian Expres… [+115 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Attack in Highland Park was not the only shooting over violent holiday weekend", "description": "The attack at the Highland Park Fourth of July parade was the largest and highest-profile shooting, but far from the only one, over the holiday weekend.", "url": "https://indianexpress.com/article/world/attack-in-highland-park-was-not-the-only-shooting-over-violent-holiday-weekend-8009364/", "urlToImage": "https://images.indianexpress.com/2022/07/police-chicago.jpg", "publishedAt": "2022-07-05T04:46:57Z", "content": "The attack at the Highland Park Fourth of July parade was the largest and highest-profile shooting, but far from the only one, over the holiday weekend.\r\nIt was one of two mass shootings in the Chica… [+2363 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Rupee falls 9 paise to 79.04 against US dollar in early trade", "description": "At the interbank foreign exchange, the rupee opened at 79.04 against the US dollar, registering a decline of 9 paise over the last close.", "url": "https://indianexpress.com/article/business/market/rupee-vs-us-dollar-today-july-5-currency-market-8009396/", "urlToImage": "https://images.indianexpress.com/2022/05/rupee-express-archieve-1200.jpg", "publishedAt": "2022-07-05T04:44:11Z", "content": "The rupee depreciated 9 paise to 79.04 against the US dollar in opening trade on Tuesday, weighed down by persistent foreign funds outflows.At the interbank foreign exchange, the rupee opened at 79.0… [+1106 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Watch: Kevin Pietersen demonstrates how he worked for months to perfect the switch hit", "description": "The Kevin Pietersen switch hit became popular ever since he played it against Scott Styris.", "url": "https://indianexpress.com/article/sports/cricket/eng-vs-ind-watch-kevin-pietersen-talks-about-how-he-worked-for-months-to-perfect-the-switch-hit-8009360/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-11-1.jpg", "publishedAt": "2022-07-05T04:38:56Z", "content": "Former England cricketer Kevin Pietersen, who is known for his switch hits, talked about how he worked for months to perfect the switch hit before unleashing at Durham against former Kiwi all-rounder… [+1445 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gurdaspur SP arrested for raping pregnant woman", "description": "Gurmeet Singh, the SP (Headquarters) was arrested by two members of the SIT, DSP Ravinder Singh and inspector Harjit Kaur, when he was at a Moga court for a hearing in another case.", "url": "https://indianexpress.com/article/cities/amritsar/gurdaspur-sp-raping-pregnant-woman-8009351/", "urlToImage": "https://images.indianexpress.com/2022/07/arrest-11.jpg", "publishedAt": "2022-07-05T04:36:19Z", "content": "A special investigation team (SIT) of Punjab Police has arrested a superintendent of police (SP) for allegedly raping a pregnant woman at his official residence in Gurdaspur.Gurmeet Singh, the SP (He… [+1585 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Jharkhand’s Fossil Park to ‘portray unveiled stories of the state’", "description": "According to the state's tourism department, it is a one-of-a-kind tourist attraction meant to conserve the rich history of mankind.", "url": "https://indianexpress.com/article/lifestyle/destination-of-the-week/jharkhand-fossil-park-rajmahal-hills-8007639/", "urlToImage": "https://images.indianexpress.com/2022/07/fossil-park-1200.jpg", "publishedAt": "2022-07-05T04:30:56Z", "content": "A 95-acre park on Rajmahal Hills in Sahebganj, built to preserve the Jurassic era fossilsfound at the site, opened its doors for visitors recently.Constructed at a cost of Rs 10.79 crore, it was inau… [+2009 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Xiaomi 12S Ultra to Xiaomi Band 7 Pro: Everything Xiaomi launched at its event", "description": "A look at the Xiaomi 12S series, Xiaomi Band 7 Pro and all other products Xiaomi launched. The highlight of the Xiaomi 12S series is the Leica partnership.", "url": "https://indianexpress.com/article/technology/mobile-tabs/xiaomi-12s-ultra-xiaomi-12s-xiaomi-band-7-pro-price-specifications-features-launch-8009362/", "urlToImage": "https://images.indianexpress.com/2022/07/Xiaomi-12S-Ultra1.jpg", "publishedAt": "2022-07-05T04:27:59Z", "content": "Xiaomi hosted its annual flagship launch event in China recently. The event witnessed the company launching a range of new smartphones across its Xiaomi 12S series as well as some other products. The… [+2820 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Admission process for Karnataka degree colleges starts from July 11: Minister CN Ashwath Narayan", "description": "This year, for the first time, students will be able to seek admission through a single portal", "url": "https://indianexpress.com/article/education/admission-process-for-karnataka-degree-colleges-starts-from-july-11-minister-cn-ashwath-narayan-8009365/", "urlToImage": "https://images.indianexpress.com/2021/10/Ramjas-college-1.jpg", "publishedAt": "2022-07-05T04:23:26Z", "content": "Karnataka’s degree colleges will start their admission process from July 11, the state minister of higher education CN Ashwath Narayan announced Monday.Admission to all colleges, for the first time, … [+2194 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Zayed Khan opens up about sister Sussanne Khan’s rumoured relationship with Arslan Goni, calls him ‘A lovely boy’", "description": "Actor Zayed Khan spoke about Sussanne Khan's rumoured relationship with Arslan Goni and his bond with Hrithik Roshan.", "url": "https://indianexpress.com/article/entertainment/zayed-khan-opens-about-sister-sussanne-khan-and-arslan-goni-8009302/", "urlToImage": "https://images.indianexpress.com/2022/07/sussanne-zayed-759-2.jpeg", "publishedAt": "2022-07-05T04:20:51Z", "content": "Main Hoon Na actor Zayed Khan turned 43 today and he is all set to make his Bollywood comeback after a hiatus of seven years. In an interview with Hindustan Times, the actor opened up about his siste… [+1739 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "‘No attempt to increase TV ratings’: Wimbledon refutes Novak Djokovic’s claim, defends stance on late finishes", "description": "Novak Djokovic said that the start times for the evening sessions at the All England Club were effectively turning Wimbledon into an indoor tournament for players scheduled to play late matches on the main showcourts.", "url": "https://indianexpress.com/article/sports/tennis/no-attempt-to-increase-tv-ratings-wimbledon-refutes-novak-djokovics-claim-defends-late-finishes-with-matches-going-into-the-night-8009335/", "urlToImage": "https://images.indianexpress.com/2022/07/Novak-Djokovic.jpg", "publishedAt": "2022-07-05T04:18:20Z", "content": "A day after reigning champions Novak Djokovic questioned the scheduling of Wimbledon and how it is turning into an indoor tournament, the All England Club has defended their stance on late finishes o… [+2231 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Akshay Kumar denies joining politics, says he is ‘very happy’ making movies", "description": "When asked if he wants to join politics, Akshay Kumar shared that he has no interest in it, and is happy making movies.", "url": "https://indianexpress.com/article/entertainment/bollywood/akshay-kumar-denies-joining-politics-says-he-is-very-happy-making-movies-8009318/", "urlToImage": "https://images.indianexpress.com/2022/05/Akshay-Kumar-1.jpeg", "publishedAt": "2022-07-05T04:12:49Z", "content": "Bollywood actor-producer Akshay Kumar, who was last seen in YRF’s Samrat Prithviraj, was recently asked if he has any ambitions of joining politics, but the actor said that he is “very happy” making … [+1714 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Stock,Share Market News Today: Sensex rises over 300 points in early trade, Nifty above 15,900-mark", "description": "Stock Market And Share Market Today Updates: At 9:21 am, the S&P BSE Sensex was trading at 53,538.86, up 304.09 points (0.57 per cent) while the Nifty 50 was up 96.05 points (0.61 per cent) at 15,931.40.", "url": "https://indianexpress.com/article/business/market/share-market-today-july-5-equity-stocks-bse-sensex-nse-nifty-rupee-global-cues-8009339/", "urlToImage": "https://images.indianexpress.com/2022/01/bombay-stock-exchange-bse-express-archive-1200.jpg", "publishedAt": "2022-07-05T04:09:01Z", "content": "Sensex, Nifty, Share Prices Today: The benchmark equity indices on the BSE and National Stock Exchange (NSE) opened over 0.5 per cent higher on Tuesday aided by energy and metal stocks.At 9:21 am, th… [+2326 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "NIA takes custody of all accused in Amravati chemist’s murder", "description": "Amravati police had found links between social media posts supporting former BJP spokesperson Nupur Sharma and Umesh's murder during the investigation and didn't suppress the case as was alleged, police commissioner Arti Singh said on Monday.", "url": "https://indianexpress.com/article/cities/mumbai/nia-takes-custody-of-all-accused-in-amravati-chemists-murder-amravati-8009345/", "urlToImage": "https://images.indianexpress.com/2022/07/Umesh-kolhe-1.jpeg", "publishedAt": "2022-07-05T04:07:26Z", "content": "The National Investigation Agency (NIA) has taken over custody of all the seven accused in the murder of Amravati-based chemist Umesh Kolhe, a police official said on Tuesday.The NIA took custody of … [+1168 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Jharkhand: 70-year-old woman beaten to death over ‘witchcraft’", "description": "In a complaint, the woman's family alleged that five people dragged her at least 200 metres from her house around 8.30 pm on Sunday, and beat her to death with sticks.", "url": "https://indianexpress.com/article/cities/delhi/jharkhand-woman-beaten-to-death-witchcraft-8009347/", "urlToImage": "https://images.indianexpress.com/2022/07/dead-759.jpg", "publishedAt": "2022-07-05T04:07:19Z", "content": "A 70-year-old woman was beaten to death in Jharkhand’s Garhwa district by villagers, who claimed that she practiced witchcraft, police said on Tuesday.The incident happened in Khuri village in Chiniy… [+542 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sanath Prasad", "title": "Karnataka textbook controversy: The chapter so far…", "description": "The latest revision exercise by the BJP government has snowballed into a political controversy with the Opposition calling it another attempt to “saffronise” curriculum.", "url": "https://indianexpress.com/article/education/karnataka-textbook-controversy-the-chapter-so-far-8009343/", "urlToImage": "https://images.indianexpress.com/2022/07/pexels-lumn-327882-1.jpg", "publishedAt": "2022-07-05T04:04:06Z", "content": "Last week, Karnatakas Education Department ordered eight corrections in school textbooks after writers, academics, religious leaders and Opposition parties objected to revisions by the government-app… [+5238 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Rajasthan: 5 arrested in separate cases for sharing video of Udaipur murder, photos with arms", "description": "Four people, including Akhtari and Mohammad, have been arrested in connection with Lal's murder. They are in the custody of the National Investigation Agency.", "url": "https://indianexpress.com/article/cities/jaipur/rajasthan-arrested-separate-cases-sharing-video-udaipur-murder-photos-arms-8009307/", "urlToImage": "https://images.indianexpress.com/2022/07/arrest-9.jpg", "publishedAt": "2022-07-05T04:00:43Z", "content": "Five people were arrested in separate cases in Rajasthan’s Hanumangarh district on Monday for allegedly circulating the video of the Udaipur tailor murder, and posting photos and videos with arms on … [+954 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Bhim Army chief Azad, 21 released", "description": "They were picked up from a Jaipur hotel on July 1 night", "url": "https://indianexpress.com/article/cities/jaipur/bhim-army-chief-azad-21-released-8009337/", "urlToImage": "https://images.indianexpress.com/2022/07/chandrashekhar-759.jpg", "publishedAt": "2022-07-05T03:54:38Z", "content": "A magistrate ordered the release of Bhim Army Chief Chandra Shekhar Azad and 21 others on Monday, two days after they were allegedly arrested from a Jaipur hotel they were staying.Azad and others had… [+1806 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Singapore-based crypto lender Vauld suspends withdrawals", "description": "Vauld CEO Darshan Bathija said in a blog post that it was facing \"financial challenges\" due to: \"the volatile market conditions, the financial difficulties of our key business partners inevitably affecting us, and the current market climate", "url": "https://indianexpress.com/article/technology/crypto/singapore-based-crypto-lender-vauld-suspends-withdrawals-8009336/", "urlToImage": "https://images.indianexpress.com/2022/07/Bitcoin-.jpeg", "publishedAt": "2022-07-05T03:52:51Z", "content": "Singapore-based crypto lending and trading platform Vauld said on Monday it would suspend withdrawals and trading and seek new investors, the latest sign of stress in the embattled crypto industry.Va… [+1290 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "PSEB Punjab Board 10th Result 2022 Live Updates: Result to be released today at pseb.ac.in", "description": "PSEB Punjab Board 10th Result 2022 declared at www.pseb.ac.in, indiaresults.com, Punjab School Education Board Mohali Class 10th Result 2022: The result will be available at the website- pseb.ac.in. The students have to secure at least 20 per cent marks in pr…", "url": "https://indianexpress.com/article/education/pseb-punjab-board-10th-result-2022-live-updates-result-declared-pseb-ac-in-sarkari-result-toppers-list-pass-percentage-indiaresults-in-7989222/", "urlToImage": "https://images.indianexpress.com/2022/06/3-2-2.jpg", "publishedAt": "2022-07-05T03:45:42Z", "content": "Punjab Board PSEB 10th Result 2022 Live Updates: The Punjab School Education Board (PSEB) will declare the class 10 results today i.e. July 5, 2022. The result will be declared via a press conference… [+1127 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Neha Dhupia celebrates 20 years of Miss India win, jokes she’s ‘a few dress sizes bigger’", "description": "Neha Dhupia was felicitated on the 20th anniversary of her Miss India victory in 2002.", "url": "https://indianexpress.com/article/entertainment/bollywood/neha-dhupia-celebrates-20-years-of-miss-india-win-jokes-shes-a-few-dress-sizes-bigger-8009288/", "urlToImage": "https://images.indianexpress.com/2022/07/neha-dhupia-1200.jpg", "publishedAt": "2022-07-05T03:44:32Z", "content": "Neha Dhupia celebrated 20 years of her Miss India win on Monday, with an emotional post. The model-turned-actor was felicitated at the recently held Miss India contest, where she chose to wear the sa… [+1945 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Pakistan Army chief Gen Bajwa directs military officials to stay away from politics", "description": "Pakistan Army had earlier said that it has nothing to do with politics and it would remain apolitical in the future as well.", "url": "https://indianexpress.com/article/pakistan/pakistan-army-chief-gen-bajwa-directs-military-officials-to-stay-away-from-politics-8009323/", "urlToImage": "https://images.indianexpress.com/2021/03/Bajwa-1.jpg", "publishedAt": "2022-07-05T03:42:49Z", "content": "Pakistan Army chief General Qamar Javed Bajwa has issued fresh directions to his commanders and officers, including from the ISI, to stay away from politics after leaders of ousted prime minister Imr… [+2468 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Anshula Kapoor opens up about diet, fitness, favourite meal, and her height", "description": "Previously, in a March 2022 Instagram post, Anshula had also shared a note on how the meaning of the term ‘healthy’ has changed for her", "url": "https://indianexpress.com/article/lifestyle/fitness/anshula-kapoor-reveal-diet-fitness-dessert-weight-loss-transformation-instagram-ask-me-anything-session-7995230/", "urlToImage": "https://images.indianexpress.com/2022/06/anshula-weight-loss_featured_1200.jpg", "publishedAt": "2022-07-05T03:40:35Z", "content": "After setting major weight loss transformation goals, which she calls a ‘work in progress’, Anshula Kapoor recently took to social media and, for the first time, shared details about her diet, workou… [+4616 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "১০০ দিনেই লক্ষ্যপূরণ! ৮৪৪ কোটি টাকার সম্পত্তি বাজেয়াপ্ত করল যোগী সরকার", "description": "সোমবার ১০০ দিনের রিপোর্ট কার্ড পেশ করে যোগী দাবি করেছেন, তাঁর রাজত্বে সুশাসন এসেছে এবং কুশাসন বিদায় নিয়েছে।", "url": "https://bengali.indianexpress.com/general-news/68k-encroachments-removed-rs-844-crore-property-seized-cm-yogi-adityanath-465465/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/Yogi-Adityanath.jpg", "publishedAt": "2022-07-05T03:38:47Z", "content": ", \r\n , , , , , , , , \r\n , , \r\n , \r\n , . \r\n , \r\n , , ‘ , ’\r\nStay updated with the latest news headlines and all the latest General news download Indian Express Bengali App.\r\nWeb Title: 68k encroachmen… [+57 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "FACTBOX-Mass shootings in the US from Highland Park to Fort Hood", "description": "Below is a list of other recent high-profile mass shootings", "url": "https://indianexpress.com/article/world/factbox-mass-shootings-in-the-u-s-from-highland-park-to-fort-hood-8009304/", "urlToImage": "https://images.indianexpress.com/2022/07/reuters.jpg", "publishedAt": "2022-07-05T03:28:50Z", "content": "Six people were killed and at least three dozen wounded when a man with a high-powered rifle opened fire from a rooftop at a Fourth of July parade in the wealthy Chicago suburb of Highland Park on Mo… [+5348 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Baahubali producer Shobu Yarlagadda calls out Resul Pookutty’s ‘gay love story’ comment on RRR: ‘Is that a bad thing?’", "description": "Baahubali producer Shobu Yarlagadda reacted to Resul Pookutty's 'gay love story' comment about RRR on Twitter.", "url": "https://indianexpress.com/article/entertainment/telugu/baahubali-producer-shobu-yarlagadda-calls-out-resul-pookuttys-gay-love-story-on-rrr-is-gay-love-story-a-bad-thing-8009283/", "urlToImage": "https://images.indianexpress.com/2022/05/RRR-movie-1200by667.jpg", "publishedAt": "2022-07-05T03:27:36Z", "content": "Oscar-winning sound designer Resul Pookutty’s comments calling SS Rajamouli’s RRR a “gay love story” have drawn a severe reaction from Baahubali producer Shobu Yarlagadda. In a series of tweets on Mo… [+2029 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "New Zealand men and women cricketers to receive equal pay in ground-breaking agreement", "description": "NZC and the players' association signed a five-year deal and the agreement will see women's players at both international and domestic level receive the same match fees as men across all formats and competitions.", "url": "https://indianexpress.com/article/sports/cricket/new-zealand-men-and-women-cricketers-to-receive-equal-pay-in-ground-breaking-agreement-8009294/", "urlToImage": "https://images.indianexpress.com/2022/07/New-Zealand-Cricket.jpg", "publishedAt": "2022-07-05T03:19:24Z", "content": "New Zealand Cricket (NZC) on Tuesday announced a ground-breaking agreement, which will see men and women players paid the same match fees.NZC and the players’ association signed a five-year deal and … [+2166 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Coronavirus India Live News Updates: Scientists probing spike in cases look at Omicron sub-variant", "description": "Coronavirus India, Covid-19 Live News Updates, July 05, 2022: The BA.2.75, belonging to the BA.2 sub-lineage which was the dominant strain in India earlier this year, has been found to have an 18 per cent growth advantage over the other currently circulating …", "url": "https://indianexpress.com/article/lifestyle/health/coronavirus-india-live-news-updates-omicron-covid-cases-today-8009240/", "urlToImage": "https://images.indianexpress.com/2022/07/NL-CovidTest-3cols.jpg", "publishedAt": "2022-07-05T03:18:43Z", "content": "Covid-19 Live News Updates: As scientists continue to probe the possible causes for the recent rise in Coronavirus cases in the country, the BA.2.75, one of the several sub-variants of the parent Omi… [+997 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Who is the 22-year-old suspect in Chicago’s July 4 parade shooting?", "description": "Robert E Crimo III, who is from the area, has been taken into custody and charges will be filed, said the police.", "url": "https://indianexpress.com/article/world/chicago-july-4-parade-shooting-suspect-8009270/", "urlToImage": "https://images.indianexpress.com/2022/07/chicago-shooting.jpg", "publishedAt": "2022-07-05T03:15:08Z", "content": "A 22-year-old man has been taken into police custody for his suspected role in the shooting at the Fourth of July parade in the Chicago suburb of Highland Park on Monday. At least six people died and… [+1149 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Who is the 22-year-old suspect in Chicago’s July 4 parade shooting?", "description": "Robert E Crimo III, who is from the area, has been taken into custody and charges will be filed, said the police.", "url": "https://indianexpress.com/article/world/chicago-july-4-shooting-suspect-8009270/", "urlToImage": "https://indianexpress.com/wp-content/themes/indianexpress/images/IE-OGimage.jpg", "publishedAt": "2022-07-05T03:15:08Z", "content": "A 22-year-old man has been taken into police custody for his suspected role in the shooting at the Fourth of July parade in the Chicago suburb of Highland Park on Monday. At least six people died and… [+1149 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Chess: Ian Nepomniachtchi wins 2022 Candidates without a single loss", "description": "Finishing the Candidates in the first place and without a single defeat is a strong statement for Nepomniachtchi who is vying for the title of world champion.", "url": "https://indianexpress.com/article/sports/chess/chess-ian-nepomniachtchi-wins-the-2022-candidates-without-a-single-loss-8009257/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-10-1.jpg", "publishedAt": "2022-07-05T03:07:22Z", "content": "The final and the 14th round of the 2022 Candidates was played on Monday night and Ian Nepomniachtchi win the tournament without a single loss. All four games were calm, the positions even and it see… [+2201 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "As city falls, Ukraine’s last hope in Luhansk falls with it", "description": "As Russia inundated Lysychansk with artillery fire and strangled its supply lines, building on months of bombardment and weeks of ferocious street fighting that reduced both cities to grayed-out husks, Ukrainian defenders were forced to retreat.", "url": "https://indianexpress.com/article/world/as-city-falls-ukraines-last-hope-in-luhansk-falls-with-it-8009273/", "urlToImage": "https://images.indianexpress.com/2022/07/UKRAINE-RUSSIA-4.jpg", "publishedAt": "2022-07-05T03:03:17Z", "content": "The last major city held by Ukraine in the heavily contested eastern province of Luhansk has fallen, military officials on both sides said Sunday, giving Moscow a milestone victory in its campaign to… [+9159 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Racism row: Indian fans called ‘smelly p**’, ‘curry c*’ at Edgbaston during India-England Test", "description": "The Bharat Army, the official India supporters’ group, later reported that “many” of its members at the ground had been targeted by 'a very small minority.'", "url": "https://indianexpress.com/article/sports/cricket/england-vs-india-indian-cricket-fans-face-racist-slurs-in-edgbaston-8009265/", "urlToImage": "https://images.indianexpress.com/2022/07/Edgbaston.jpg", "publishedAt": "2022-07-05T02:51:56Z", "content": "The fifth Test between England and India has been hit by racism. A section of Indian cricket fans were racially abused towards the end of Day 4 of the ongoing India vs England at Edgbaston. An invest… [+3782 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "‘Life is what you make out of it’: Vidisha Baliyan", "description": "“Everything you have in your life is the result of your belief in yourself.”", "url": "https://indianexpress.com/article/lifestyle/life-positive/motivational-speech-vidisha-baliyan-life-positive-8008407/", "urlToImage": "https://images.indianexpress.com/2022/07/vidisha-baliyan-ft.jpg", "publishedAt": "2022-07-05T02:50:06Z", "content": "Born with a hearing impairment, Vidisha Baliyan could have had it any other way, but she chose differently for herself.Bagging the prestigious title of Miss Deaf World 2019, Vidisha became an inspiri… [+1093 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Leela Prasad, Sonal Gupta", "title": "Daily Briefing: BJP-Eknath Shinde coalition wins trust vote in Maharashtra; scientists look at Omicron sub-variant amid spike in Covid cases", "description": "In today's edition: BJP-Shinde coalition clears the floor test in Maharashtra; what's behind the spike in Covid-19 cases; and how residents of a J&K village caught LeT militants", "url": "https://indianexpress.com/article/live-news/top-news-briefing-today-8009266/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-2021-11-08T081015.674-1.jpg", "publishedAt": "2022-07-05T02:48:43Z", "content": "The Big Story\r\nThe BJP-Shinde Sena coalition won the trust vote with 164 votes, the same number it previously garnered in the Speaker’s election. The last day of the special assembly session was mark… [+4779 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Chandigarh: Surprise check of creches throws up discrepancies, vacancies", "description": "During the visit, the secretary reviewed the overall functioning, infrastructure and facilities available in the crèches and found many discrepancies therein.", "url": "https://indianexpress.com/article/cities/chandigarh/surprise-check-of-creches-throws-up-discrepancies-vacancies-8009264/", "urlToImage": "https://images.indianexpress.com/2022/07/Express-Representational-Image-46-8.jpeg", "publishedAt": "2022-07-05T02:45:37Z", "content": "Secretary (Social Welfare) Nitika Pawar conducted a surprise inspection of Bal Bhawan, Sector 23; Working Women Hostel, Sector 23; Crèche, Sector 15; Crèche, Sector 25; Crèche, Sector 37; and Crèche,… [+1886 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "From Devdas’ Chandramukhi to Gangubai Kathiawadi and Heeramandi: The courtesans of Bhansali", "description": "As Heeramandi starts shooting, here is looking at Sanjay Leela Bhansali and his depiction of courtesans - from Devdas' Chandramukhi to Gangubai - in a career that spans more than two decades", "url": "https://indianexpress.com/article/entertainment/bollywood/from-devdas-chandramukhi-to-gangubai-kathiawadi-and-heeramandi-courtesans-of-bhansali-7999197/", "urlToImage": "https://images.indianexpress.com/2022/06/Untitled-design-1-3.png", "publishedAt": "2022-07-05T02:41:59Z", "content": "Cinematographer and a long time associate of the Sanjay Leela Bhansali, Sudeep Chatterjee, recently took to the internet to announce the beginning of the shooting of the directors highly anticipated,… [+8810 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "A. Kameshwari", "title": "Best Hindi web-series of 2022 so far: Rocket Boys, Panchayat 2, Gullak 3 lead the race", "description": "Best Hindi web-series of 2022 so far: From Rocket Boys to Gullak 3, these series were the ones that stayed with us weeks after their release.", "url": "https://indianexpress.com/article/entertainment/web-series/best-hindi-web-series-2022-so-far-rocket-boys-panchayat-2-gullak-3-modern-love-mumbai-8004889/", "urlToImage": "https://images.indianexpress.com/2022/07/Best-web-series-1200.jpg", "publishedAt": "2022-07-05T02:41:47Z", "content": "With the OTT space giving its audience an access to content from all around the world, viewers know how to pick the grain from chaff. The OTT world and the competition on it has encouraged writers, a… [+6092 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lakshana N Palat", "title": "Ji Chang-wook, the earnest romantic and the tough action hero: Revisiting Suspicious Partner, Healer and K2; his best performances", "description": "On Ji Chang-wook's birthday, here's revisiting his best shows, Suspicious Partner, The K2 and Healer.", "url": "https://indianexpress.com/article/entertainment/web-series/ji-chang-wook-birthday-suspicious-partner-k2-healer-8000563/", "urlToImage": "https://images.indianexpress.com/2022/06/changwook2.jpeg", "publishedAt": "2022-07-05T02:41:33Z", "content": "It takes unimaginable skill to play a lovestruck prosecutor in a romantic comedy that deals with a psychopathic serial killer, but Ji Chang-wook does it smoothly. In one scene, hell melt your heart a… [+3521 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Bengaluru, Karnataka Live Updates: State HC judge alleges threat for pulling up ACB officer; Gauri Lankesh was targeted by right-wing, casteist groups: sister in court", "description": "Bengaluru, Karnataka Live Updates: auri Lankesh's sister on Monday said that Gauri was targeted by right-wing and casteist groups for her writings and speeches against Hindutva.", "url": "https://indianexpress.com/article/cities/bangalore/bengaluru-karnataka-news-live-updates-8009227/", "urlToImage": "https://indianexpress.com/wp-content/themes/indianexpress/images/IE-OGimage.jpg", "publishedAt": "2022-07-05T02:32:36Z", "content": "Other news stories from Bengaluru, Karnataka, include: The Anti-Corruption Bureau (ACB) officials in Karnataka arrested IAS officer J Manjunath after the high court pulled up the agency on Monday for… [+1077 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "UT: Attawa locals block road to protest police inaction against rising thefts, burglaries", "description": "The protesters blocked the Sector 36/42 dividing for a while and raised slogans against the personnel from Sector 36 police station for allegedly letting off a man who had been apprehended for theft.", "url": "https://indianexpress.com/article/cities/chandigarh/ut-attawa-locals-block-road-to-protest-police-inaction-against-rising-thefts-burglaries-8009258/", "urlToImage": "https://images.indianexpress.com/2022/07/Attawa.jpg", "publishedAt": "2022-07-05T02:31:04Z", "content": "Dozens of residents of c, Sector 42, hit the streets on Monday to protest what they claimed was police inaction in tackling the increasing number of thefts and burglaries in their area.The protesters… [+1962 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "2015 Police firing case: SIT headed by LK Yadav to conduct probe & submit report, says HC", "description": "The HC has passed the order while hearing the petitions filed by former DGP Punjab Sumedh Singh Saini, former SHO Kotkapura Gurdeep Singh, suspended IG Paramraj Singh Umranangal, and Suhail Brar, who had sought a CBI probe and some other relief in the sacrile…", "url": "https://indianexpress.com/article/cities/chandigarh/hc-sit-headed-by-lk-yadav-to-conduct-probe-submit-report-8009256/", "urlToImage": "https://images.indianexpress.com/2022/07/Punjab-and-Haryana-HC-2.jpg", "publishedAt": "2022-07-05T02:27:23Z", "content": "Disposing of a bunch of petitions over the probe into the Behbal Kalan police firing case, the Punjab and Haryana High Court has said that since investigation in both the cases (Kotkapura and Behbal … [+2142 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "While You Were Asleep: Racism row hit Edgbaston Test, Premier League footballer arrested on suspicion of rape, Nadal reaches Wimbledon quarters", "description": "The Bharat Army, the official India supporters’ group, later reported that “many” of its members at the ground had been targeted by 'a very small minority.'", "url": "https://indianexpress.com/article/sports/sport-others/while-you-were-asleep-racism-row-hit-edgbaston-test-premier-league-footballer-arrested-on-suspicion-of-rape-nadal-reaches-wimbledon-quarters-8009251/", "urlToImage": "https://images.indianexpress.com/2022/07/WHILE-YOU-WERE-ASLEEP-2-1.jpg", "publishedAt": "2022-07-05T02:18:02Z", "content": "The fifth and final Test between England and India has been hit by racism. An investigation is under way into allegations of racist abuse among the crowd on day four of the fifth Test between England… [+5583 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "While You Were Asleep: Nadal reaches Wimbledon quarters, Sania-Pavic reach mixed doubles semis, Premier League footballer arrested on suspicion of rape", "description": "Nadal will face American 11th seed Taylor Fritz for a place in Friday's semi-finals. India's Sania Mirza and her Croatian partner Mate Pavic defeated the fourth-seeded Canadian-Australian duo of Gabriela Dabrowski and John Peers 6-4, 3-6, 7-5.", "url": "https://indianexpress.com/article/sports/sport-others/while-you-were-asleep-nadal-reaches-wimbledon-quarters-sania-pavic-reach-mixed-doubles-semis-premier-league-footballer-arrested-on-suspicion-of-rape-8009251/", "urlToImage": "https://images.indianexpress.com/2022/07/Nadal.jpg", "publishedAt": "2022-07-05T02:18:02Z", "content": "An emotional Rafael Nadal took another step forward in his bid for a rare calendar-year Grand Slam on Monday by booking his spot in the Wimbledon quarter-finals with a thumping 6-4 6-2 7-6(6) win aga… [+3923 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Laboratory, radiological tests for HIV patients to be free in Haryana", "description": "According to government spokesperson, Haryana CM Manohar Lal Khattar has approved a proposal to this effect, making all laboratory & radiological tests — including USG, CT scan and MRI that are provided in government hospitals under PPP mode — free for HIV pa…", "url": "https://indianexpress.com/article/cities/chandigarh/laboratory-radiological-tests-for-hiv-patients-to-be-free-in-haryana-8009247/", "urlToImage": "https://images.indianexpress.com/2022/07/HIV-1200-1.jpg", "publishedAt": "2022-07-05T02:13:58Z", "content": "The Haryana government has decided to provide free health facilities, like radiological tests, to HIV patients in the state under Public Private Partnership (PPP) mode, thereby making it the eighth s… [+2394 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Sydney floods impact 50,000 around Australia’s largest city", "description": "Days of torrential rain have caused dams to overflow and waterways to break their banks, bringing a fourth flood emergency in 16 months to parts of Sydney in Australia", "url": "https://indianexpress.com/article/world/sydney-floods-australia-rains-8009243/", "urlToImage": "https://images.indianexpress.com/2022/07/australia-1200.jpg", "publishedAt": "2022-07-05T02:06:37Z", "content": "Hundreds of homes have been inundated in and around Australia’s largest city in a flood emergency that was impacting 50,000 people, officials said Tuesday.Emergency response teams made 100 rescues ov… [+3671 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kamaldeep Singh Brar", "title": "Radiologist, philanthropist, AAP Sikh face from Amritsar", "description": "Dr Nijjar (66) represents Amritsar South Assembly segment, which is both urban and Panthic constituency. In the 2022 Punjab Assembly elections, he defeated Congress' Inderbir Singh Bolaria, whose family had not lost the seat since 2007.", "url": "https://indianexpress.com/article/cities/amritsar/radiologist-philanthropist-aap-sikh-face-from-amritsar-8009245/", "urlToImage": "https://images.indianexpress.com/2022/07/Inderbir-Singh-Nijjar.jpg", "publishedAt": "2022-07-05T02:04:07Z", "content": "Dr Inderbir Singh Nijjar, Aam Aadmi Party (AAP) MLA from Amritsar South, became a Cabinet minister on Monday.The medico-turned-politician is a baptised Sikh and also president of Chief Khalsa Diwan (… [+1681 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Raakhi Jagga", "title": "Better late than never for MLA who recorded biggest victory margin", "description": "Aam Aadmi Party's Arora had recorded the highest victory margin in the Punjab Assembly elections by defeating Congress candidate Jaswinder Dhiman earlier this year. He won by a margin of 75,277 votes.", "url": "https://indianexpress.com/article/cities/ludhiana/better-late-than-never-for-mla-who-recorded-biggest-victory-margin-8009223/", "urlToImage": "https://images.indianexpress.com/2022/07/aman-arora1200.jpg", "publishedAt": "2022-07-05T01:54:56Z", "content": "Finally, Aman Arora, a two-time MLA from Sunam constituency, is part of the Punjab Cabinet. On Monday, he was administered the oath of office and secrecy by Governor Banwarilal Puruhit.Aam Aadmi Part… [+2910 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Navjeevan Gopal", "title": "Punjab: Bhagwant Mann picks Gaurav Yadav as officiating DGP — 5th police chief in 10 months", "description": "A decorated officer, Gaurav Yadav, who is the son-in-law of former Punjab DGP P C Dogra, had served as the intelligence wing chief during the SAD-BJP regime in 2016.", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-police-chief-bhagwant-mann-ips-officer-gaurav-yadav-dgp-8009222/", "urlToImage": "https://images.indianexpress.com/2022/07/ips-gaurav-yadav-1.jpeg", "publishedAt": "2022-07-05T01:53:25Z", "content": "The Punjab government Monday appointed 1992 batch IPS officer Gaurav Yadav as the officiating state police chief. He is the fifth IPS officer to be appointed as Punjab DGP in less than 10 months.The … [+4714 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Raakhi Jagga", "title": "Punjab: AAP founder member who had once foiled kidnapping attempt, was shot at in neck", "description": "Jouramajra is the founder member of AAP in Punjab. He had earlier been part of Anna Hazare's movement against corruption and that's how, party sources say, he came in contact with AAP supremo Arvind Kejriwal.", "url": "https://indianexpress.com/article/cities/ludhiana/punjab-aap-founder-member-cabinet-8009232/", "urlToImage": "https://images.indianexpress.com/2022/07/274342249_2818070871826541_1256731704088611630_n.jpg", "publishedAt": "2022-07-05T01:49:43Z", "content": "First-time MLA from Samana constituency of Patiala, 55-year-old Chetan Singh Jouramajra was inducted into the Punjab Cabinet on Monday.Jouramajra is the founder member of AAP in Punjab. He had earlie… [+1510 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Raakhi Jagga", "title": "Punjab: Retired cop looking to bring ‘positive change’ in system", "description": "Fauja Singh retired as ASI from Bathinda in 2020 and joined AAP a few months later.", "url": "https://indianexpress.com/article/cities/ludhiana/punjab-retired-positive-change-8007928/", "urlToImage": "https://images.indianexpress.com/2022/07/FW0dQRDacAAC4Kk.jpg", "publishedAt": "2022-07-05T01:43:41Z", "content": "A retired Punjab Police assistant sub-inspector (ASI) Fauja Singh Sarari (62) surprised everyone with a Cabinet berth on Monday.Fauja Singh retired as ASI from Bathinda in 2020 and joined AAP a few m… [+2192 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Singapore President, Parliament Speaker, and minister test positive for Covid", "description": "Over the last 28 days, Singapore has reported 140,965 Covid infections.", "url": "https://indianexpress.com/article/world/singapore-president-parliament-speaker-and-minister-test-positive-for-covid-8009217/", "urlToImage": "https://images.indianexpress.com/2022/07/singapore-pm.jpg", "publishedAt": "2022-07-05T01:37:15Z", "content": "Singapore President Halimah Yacob, Speaker of Parliament Tan Chuan-Jin, and Minister Edwin Tong have tested positive for Covid-19.Madam Halimah, 67, said in a Facebook post on Monday, Just tested pos… [+979 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "PSEB Punjab board Class 10th result 2022: When and where to check", "description": "PSEB 10th Result 2022, Punjab School Education Board Mohali Class 10th Result 2022 at www.pseb.ac.in, indiaresults.in: Students who appeared for the exams can check their results on the board's official website - pseb.ac.in. Check result now.", "url": "https://indianexpress.com/article/education/pseb-punjab-board-class-10th-result-2022-declared-when-and-where-to-check-pseb-ac-in-indiaresults-in-7931985/", "urlToImage": "https://images.indianexpress.com/2022/05/gettyimages-1148232180-612x612-2.jpg", "publishedAt": "2022-07-05T01:30:45Z", "content": "PSEB Punjab Board Class 10th Result 2022: The Punjab School Education Board (PSEB)has announced the class 10 board exam results today (July 5) at 12:15 pm.  All the students who had appeared for the … [+1957 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mithun Chakraborty calls on Bengal BJP chief: ‘Party has given me a big responsibility’", "description": "Sources in the party said that Chakraborty's comeback to Bengal would rejuvenate the party’s rank and file and galvanise them into action.", "url": "https://indianexpress.com/article/cities/kolkata/mithun-chakraborty-calls-on-bengal-bjp-chief-8009215/", "urlToImage": "https://images.indianexpress.com/2022/07/mithun-chakraborty.jpg", "publishedAt": "2022-07-05T01:10:10Z", "content": "Bollywood actor and BJP leader Mithun Chakraborty on Monday made an apparent comeback to Bengal politics, a year after taking part in a high-voltage state Assembly election campaign. Since the partys… [+1915 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Metro Dairy equity transfer case: Will challenge HC order, in top court, says Adhir Chowdhury", "description": "Chowdhury claimed, \"There is a lot of corruption in every recruitment process of the (state) government.\"", "url": "https://indianexpress.com/article/cities/kolkata/metro-dairy-equity-transfer-case-adhir-chowdhury-8009212/", "urlToImage": "https://images.indianexpress.com/2022/07/adhir-chowdhury.jpeg", "publishedAt": "2022-07-05T01:04:34Z", "content": "Congress leader Adhir Chowdhury on Monday said he would challenge a Calcutta High Court order on the Metro Dairy equity transfer case in the Supreme Court.Speaking to mediapersons, he targeted the st… [+965 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Chennai power cut today: These areas will face a power disruption in Chennai", "description": "Chennai power disruption July 5, Tuesday: Parts of Chennai will face a power cut from 9 am to 2 pm for maintenance work today.", "url": "https://indianexpress.com/article/cities/chennai/chennai-power-cut-today-these-areas-will-face-a-power-disruption-in-chennai-8007019/", "urlToImage": "https://images.indianexpress.com/2022/07/electricity-reuters-1200-2-1-3.jpeg", "publishedAt": "2022-07-05T01:00:15Z", "content": "The Tamil Nadu Generation and Distribution Corporation (Tangedco) has announced that power will be suspended in parts of Chennai today in Mylapore, Egmore, Tambaram, Guindy, IT Corridor, Avadi, Velac… [+2019 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mamata Banerjee slams opposition party: ‘BJP targets those who fight for people’", "description": "West Bengal CM Banerjee also questioned why former BJP spokesperson Nupur Sharma, whose derogatory remarks on the Prophet led to widespread protests, had not been arrested yet.", "url": "https://indianexpress.com/article/cities/kolkata/mamata-banerjee-slams-bjp-8009210/", "urlToImage": "https://images.indianexpress.com/2022/07/mamata-banerjee.jpg", "publishedAt": "2022-07-05T00:56:44Z", "content": "Chief Minister Mamata Banerjee on Monday batted for dynasty politics, an issue that the BJP often raises to criticise opposition parties. Addressing a media conclave, Banerjee said, The BJP always ta… [+1380 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manish Sahu", "title": "Uttar Pradesh: Body exhumed for DNA profiling as 2 families lay claim on mortal remains", "description": "“The samples are being sent to the forensic laboratory. The next course of action will be decided on the basis of the laboratory report,” said Sirathu sub-divisional magistrate (SDM) Rahul Deo Bhatt.", "url": "https://indianexpress.com/article/cities/lucknow/uttar-pradesh-body-exhumed-dna-profiling-8009208/", "urlToImage": "https://images.indianexpress.com/2022/07/Indian-express-logo-1-10.jpeg", "publishedAt": "2022-07-05T00:41:08Z", "content": "The body of a man, who was purportedly run over by a train in Sirathu sub-division of Kaushambi district, was exhumed and samples were collected for DNA profiling after two families staked claim on t… [+1912 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "আজও বিপত্তারিণী ব্রত, জেনে নিন এর খুঁটিনাটি", "description": "২০২২ এ ২ জুলাই শনিবার পড়েছিল বিপত্তারিণী ব্রত। ফের ৫ জুলাই, মঙ্গলবার এই ব্রতের দিন পড়েছে।", "url": "https://bengali.indianexpress.com/lifestyle/bipattarini-puja-and-its-process-465446/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/bipod-tarini.jpg", "publishedAt": "2022-07-05T00:30:00Z", "content": ", \r\n , , , ’ \r\n , \r\n - , \r\n , , , , , , \r\n - , , , , , , , , , , , , , ,"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Ahmedabad: Wife, friend held for ‘killing her husband in staged road accident’", "description": "According to police, the woman and her friend had paid Rs 10 lakh to a person named Yasin alias Kanio, a resident of Gomtipur, to murder the victim by staging a road accident.", "url": "https://indianexpress.com/article/cities/ahmedabad/ahmedabad-wife-friend-held-killing-husband-staged-road-accident-8009185/", "urlToImage": "https://images.indianexpress.com/2022/07/arrest-8.jpg", "publishedAt": "2022-07-04T23:23:10Z", "content": "The Ahmedabad Police’s Detection of Crime Branch (DCB) on Monday arrested a woman and her friend in Ahmedabad, for allegedly killing her husband by staging a road accident through contract killing in… [+1618 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kamaal Saiyed", "title": "Gujarat: One held on suspicion of ‘cattle theft’ after tip-off from vigilante group", "description": "Last week police established 17 checkpoints in Valsad and started keeping a strict vigil to prevent incidents of cattle theft by different gangs operating out of Maharashtra as Bakri Eid nears.", "url": "https://indianexpress.com/article/cities/surat/gujarat-cattle-theft-vigilante-group-8009179/", "urlToImage": "https://images.indianexpress.com/2022/07/cattle-theft.jpeg", "publishedAt": "2022-07-04T23:13:22Z", "content": "Valsad police arrested a scrap merchant in Dhimsa Kakariya village of Umargam taluka on Sunday on allegations of suspected cattle theft ahead of the festival of Bakri eid, after receiving a tip-off f… [+3497 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Yogesh Naik", "title": "Ashok Chavan among 11 absent Cong MLAs: ‘We got stuck in traffic’", "description": "While the MVA had polled 107 votes on Sunday during the Speaker’s election, the alliance’s tally fell to 99 on Monday.", "url": "https://indianexpress.com/article/cities/mumbai/ashok-chavan-among-11-absent-cong-mlas-we-got-stuck-in-traffic-8009088/", "urlToImage": "https://images.indianexpress.com/2022/07/25-BOM-Ashok-Chavan-2col.jpg", "publishedAt": "2022-07-04T23:05:20Z", "content": "THE FAILURE of 11 Congress MLAs, including former CM Ashok Chavan, to cast their vote in the floor test held on Monday led to raised eyebrows within the party with senior leaders raising concern and … [+1981 chars]"}]}