{"status": "ok", "totalResults": 418, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Deutsche Welle", "title": "Putin losing confidence in Ukraine war, former Russian PM says", "description": "Mikhail Kasyanov, who served as prime minister under Vladimir Putin in the early 2000s, told DW he believed that the Russian president had \"already started to realize that he's losing this war.\"", "url": "https://indianexpress.com/article/world/putin-losing-confidence-in-ukraine-war-former-russian-pm-says-7916697/", "urlToImage": "https://images.indianexpress.com/2022/05/Mikhail-Kasyanov-reuters.jpg", "publishedAt": "2022-05-14T04:48:15Z", "content": "Former Russian Prime Minister Mikhail Kasyanov said that Vladimir Putin’s confidence in the war in Ukraine has been shaken.In an interview with DW on Friday from an undisclosed location in Europe, he… [+2409 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Novak Djokovic shows what’s been missing in Italian Open win", "description": "Djokovic celebrated the lob winner by raising both of his arms above his head then urged the packed crowd on Campo Centrale to cheer louder by gesturing with his hands.", "url": "https://indianexpress.com/article/sports/tennis/novak-djokovic-shows-whats-been-missing-in-italian-open-win-7916699/", "urlToImage": "https://images.indianexpress.com/2022/05/Novak-Djokovic.jpg", "publishedAt": "2022-05-14T04:36:10Z", "content": "It was just the type of scrambling, wear-down-the-opponent mentality and shot-making that took Novak Djokovic to within one match of a calendar-year Grand Slam in 2021.A spectacle that was missing fo… [+4888 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Anushka Sharma had second thoughts about doing Chakda ‘Xpress after welcoming Vamika: ‘I wasn’t as strong as before’", "description": "Anushka Sharma spoke about returning to acting after becoming a mother. She said that Chakda 'Xpress was an especially demanding film.", "url": "https://indianexpress.com/article/entertainment/bollywood/anushka-sharma-says-you-enjoy-your-work-you-enjoy-your-life-thats-what-youre-supposed-to-do-7916608/", "urlToImage": "https://images.indianexpress.com/2022/01/chakda-xpress-1200-1.jpg", "publishedAt": "2022-05-14T04:35:03Z", "content": "Anushka Sharma is preparing herself to portray former Indian cricket captain Jhulan Goswami in Chakda ‘Xpress, a sports drama which marks her comeback to films after over four years. The actor, in a … [+1776 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anonna Dutt", "title": "Explained: India’s hypertension challenge and why we need to be more alert", "description": "An analysis of data from the health ministry’s India Hypertension Control Initiative (IHCI) shows that 23% known hypertension patients registered with the programme had uncontrolled hypertension. Why is this cause for worry? And what is the government doing?", "url": "https://indianexpress.com/article/explained/india-hypertension-challenge-treatment-7916696/", "urlToImage": "https://images.indianexpress.com/2022/05/hypertensio.jpg", "publishedAt": "2022-05-14T04:31:19Z", "content": "Less than half of those with known hypertension have it under control, with almost one in three not visiting a healthcare facility even once in three months to get it checked, shows an analysis of da… [+3294 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Raghu Malhotra", "title": "Explained: The persistent theory that Taj Mahal was a Hindu temple called ‘Tejo Mahalaya’", "description": "Over the years, several BJP leaders have repeated and amplified unhistorical claims that the Taj is in fact a Hindu temple that was built much before the reign of Shah Jahan. A look at the theory of \"Tejo Mahalaya\".", "url": "https://indianexpress.com/article/explained/taj-mahal-controversy-hindu-temple-tejo-mahalaya-7916684/", "urlToImage": "https://images.indianexpress.com/2022/05/Taj-1.jpg", "publishedAt": "2022-05-14T04:21:19Z", "content": "Allahabad High Court on Thursday (May 12) dismissed a petition filed by BJP leader Rajneesh Singh asking for a fact-finding panel to establish “the real History of Taj Mahal”, and for more than 20 se… [+6210 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "US hails ‘new era’ with ASEAN as summit commits to raise level of ties", "description": "In a joint 28-point \"vision statement\" after a two-day meeting, the two sides took what analysts called a symbolic step of committing to raise their relationship from a strategic partnership to a \"comprehensive strategic partnership\" in November.", "url": "https://indianexpress.com/article/world/us-hails-new-era-with-asean-as-summit-commits-to-raise-level-of-ties-7916667/", "urlToImage": "https://images.indianexpress.com/2022/05/Biden-.jpeg", "publishedAt": "2022-05-14T04:16:22Z", "content": "US President Joe Biden said on Friday a first summit in Washington with leaders from the Association of Southeast Asian Nations (ASEAN) marked the launch of a “new era” in the relationship between th… [+5419 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Serivce", "title": "Haryana human rights panel recommends Rs 25,000 compensation in custodial torture case", "description": "“It is the responsibility of the state authorities to take care of all persons in custody. The police are empowered by the state to enforce laws and maintain public order. They do not have the right to take the law in their hands as they please,” the commissi…", "url": "https://indianexpress.com/article/cities/delhi/haryana-human-rights-panel-recommends-rs-25000-compensation-in-custodial-torture-case-7916672/", "urlToImage": "https://images.indianexpress.com/2022/05/express-5-9.jpg", "publishedAt": "2022-05-14T04:09:31Z", "content": "The Haryana Human Rights Commission on Friday recommended to the state government to pay Rs 25,000 as compensation to a custodial torture victim.It is the responsibility of the state authorities to t… [+2724 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Sri Lanka Economic Crisis Live News Updates: Case filed for arrest of former PM Rajapaksa; Opposition parties in Lanka not to become part of Wickremesinghe Govt", "description": "Sri Lanka Economic Crisis Live News Updates: Most of the Opposition parties in Sri Lanka on Friday announced that they would not join the interim government led by Prime Minister Ranil Wickremesinghe's but agreed to support its economic policies from outside …", "url": "https://indianexpress.com/article/world/sri-lanka-economic-crisis-live-updates-rajapaksa-wickremesingh-7916634/", "urlToImage": "https://images.indianexpress.com/2022/05/Sri-Lanka-live.jpg", "publishedAt": "2022-05-14T04:00:33Z", "content": "President Gotabaya Rajapaksa (right) greets Ranil Wickremesinghe during the latter's oath taking ceremony as the new prime minister, in Colombo on Thursday. (Photo: AP)\r\nThe newly-appointed Prime Min… [+1116 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Soumyarendra Barik", "title": "Explained: Why Luna crash has raised questions about stability of crypto assets", "description": "As investors lost almost all the value of their investments in stablecoins like Terra and Luna, even Indian exchanges WazirX and CoinDCX have delisted the currencies from their platforms so that new investors don’t end up buying them.", "url": "https://indianexpress.com/article/explained/explained-luna-crash-cryptocurrency-stability-7916591/", "urlToImage": "https://images.indianexpress.com/2022/05/terra-1200.jpg", "publishedAt": "2022-05-14T03:48:29Z", "content": "The sharp crash in Luna, the sister cryptocurrency of algorithmic stablecoin Terra, which has rendered it almost worthless, has sent shockwaves throughout the cryptocurrency market, with experts like… [+3888 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Kabir Khan studied from Shah Rukh Khan’s notes during filmmaking course, danced with Gauri Khan in college: ‘She is a fabulous dancer’", "description": "Filmmaker Kabir Khan knew Shah Rukh Khan and his wife Gauri Khan before the superstar made his debut in Bollywood.", "url": "https://indianexpress.com/article/entertainment/bollywood/kabir-khan-studied-shah-rukh-khan-notes-filmmaking-course-danced-with-gauri-khan-7916622/", "urlToImage": "https://images.indianexpress.com/2022/05/shah-rukh-khan-kabir-khan-1.jpg", "publishedAt": "2022-05-14T03:48:05Z", "content": "Filmmaker Kabir Khan directed Shah Rukh Khan in his 2017 film Tubelight, starring Salman Khan in the lead role. Shah Rukh did a cameo in the movie, and also narrated Kabir’s Amazon Prime Video series… [+1607 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Vandana Kalra", "title": "How a 16-year-old is creating work that presents beauty in the everyday", "description": "Thrissur-based Anujath Sindhu Vinaylal has been winning awards for his art that is also finding its way to important publications", "url": "https://indianexpress.com/article/lifestyle/art-and-culture/how-a-16-year-old-is-creating-work-that-presents-beauty-in-the-everyday-anujath-sindhu-vinaylal-7915979/", "urlToImage": "https://images.indianexpress.com/2022/05/Anujath-Sindhu-Vinaylal-4-2022-Jan-14.jpg", "publishedAt": "2022-05-14T03:40:57Z", "content": "Sixteen-year-old artist Anujath Sindhu Vinaylal does not need to look far to find his protagonists what we encounter each day is a subject for contemplation. Through my work, I am also sharing my lif… [+4300 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Coronavirus India Live Updates: Active cases dip to 18,604; Delhi records highest deaths since March 4", "description": "Covid-19 news: Active cases comprise 0.04 per cent of the total infections, while the national recovery rate is at 98.74 per cent. The total number of vaccine doses administered in the country crossed 191 crore on Friday,", "url": "https://indianexpress.com/article/lifestyle/health/coronavirus-india-live-updates-deaths-active-cases-7916588/", "urlToImage": "https://images.indianexpress.com/2022/05/Chennai-1-2.jpg", "publishedAt": "2022-05-14T03:35:58Z", "content": "A healthcare worker administers a dose of Covid-19 vaccine to a student, at a school in Chennai, Wednesday. (PTI)Coronavirus India Live Updates: India recorded 2,841 new Covid-19 infections on Friday… [+1147 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sandeep Dwivedi", "title": "Weekly Sports Newsletter: Hardik Pandya, Sachin Tendulkar and the perks of being the youngest in family", "description": "Sachin Tendulkar, Virat Kohli, Sourav Ganguly, Mohammad Kaif and Wasim Jaffer are some of the youngest, who were also the smartest. Beyond the cricket field, it’s a staggering list: Serena Williams, Usain Bolt, Michael Jordan, Steve Redgrave, Michael Phelps, …", "url": "https://indianexpress.com/article/sports/cricket/weekly-sports-newsletter-hardik-pandya-sachin-tendulkar-and-the-perks-of-being-the-youngest-in-family-7916575/", "urlToImage": "https://images.indianexpress.com/2022/05/Sachin-Hardik-Pandya.jpg", "publishedAt": "2022-05-14T03:31:18Z", "content": "There is an endearing old video of the Pandya brothers on YouTube in which they take liberties with each other like only siblings can. Krunal comes across as the quintessential earnest elder brother … [+7339 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Mumbai News Live: PM Modi, Amit Shah must keep politics aside and ensure safety of Kashmiri Pandits, says Shiv Sena", "description": "Mumbai News Live Updates, Mumbai News Today, Maharashtra News Today, Mumbai Heatwave News, Mumbai Covid Cases Today: A day after the killings of Kashmiri Pandita, Shiv Sena MP Sanjay Raut said that pointing fingers at Pakistan at would not help but it needs t…", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-news-live-weather-forecast-heatwave-covid-cases-traffic-7916595/", "urlToImage": "https://images.indianexpress.com/2022/05/sanjay-raut-1.jpg", "publishedAt": "2022-05-14T03:28:27Z", "content": "Kalina Road dug up for extension of Santa Cruz Link Road (SCLR) to connect it with the Western Express Highway. (Express Photo: Amit Chakravarty)\r\nMumbai is one of the most congested cities in the wo… [+824 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Harish Damodaran", "title": "India bans wheat export citing food security risk", "description": "Export of all wheat, including high-protein durum and normal soft bread varieties, have been moved from \"free\" to the \"prohibited\" category with effect from May 13.", "url": "https://indianexpress.com/article/business/economy/india-bans-wheat-export-citing-food-security-risk-7916598/", "urlToImage": "https://images.indianexpress.com/2022/05/wheat-2.jpg", "publishedAt": "2022-05-14T03:17:31Z", "content": "A day after its data showed annual Consumer Price Inflation hitting a near eight-year-high of 7.79 per cent in April, and retail food inflation surging even higher to 8.38 per cent, the Narendra Modi… [+781 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Serivce", "title": "Gurgaon: DTCP cancels developer’s licence, homebuyers protest outside its office", "description": "Demanding a concrete action plan from the DTCP, homebuyers asked the officials to share a timeline of the takeover of the project for the completion of construction, and a plan of action for the handover of their apartments with the completion of all work.", "url": "https://indianexpress.com/article/cities/delhi/gurgaon-dtcp-cancels-developers-licence-homebuyers-protest-outside-its-office-7916594/", "urlToImage": "https://images.indianexpress.com/2022/05/real-estate-1200.jpg", "publishedAt": "2022-05-14T03:09:58Z", "content": "Days after the Department of Town and Country Planning (DTCP) cancelled the licence of Mahira Infratech Private Limited (formerly known as Sai Aaina Farms Pvt Ltd) for the development of an affordabl… [+3631 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Virat Kohli is seeing lighter side of getting dismissed in every possible manner: Faf du Plessis", "description": "RCB lost to Punjab Kings by 54 runs and Kohli was again out for 20 as he now has only one half-century in 13 games.", "url": "https://indianexpress.com/article/sports/ipl/virat-kohli-is-seeing-lighter-side-of-getting-dismissed-in-every-possible-manner-faf-du-plessis-7916589/", "urlToImage": "https://images.indianexpress.com/2022/05/Virat-Kohli-2.jpg", "publishedAt": "2022-05-14T03:00:58Z", "content": "Adversities can make people see the lighter side of life and that’s what Virat Kohli is doing at the moment while trying to figure out how he is getting dismissed in every possible manner during this… [+1863 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Tamil Nadu CM MK Stalin inaugurates Chennai’s longest unidirectional flyover", "description": "The first flyover spanning 1.06 km helps motorists skip the Medavakkam-Sholinganallur road and Medavakkam-Mambakkam road, and along with it the Koyambedu flyover were inaugurated by the Chief Minister last year.", "url": "https://indianexpress.com/article/cities/chennai/tamil-nadu-cm-mk-stalin-inaugurates-chennais-longest-unidirectional-flyover-7916576/", "urlToImage": "https://images.indianexpress.com/2022/05/Stalin-6.jpg", "publishedAt": "2022-05-14T02:58:35Z", "content": "Tamil Nadu Chief Minister M K Stalin on Friday inaugurated the unidirectional Medavakkam flyover, the longest in Chennai, running for a distance of 2.03 kilometres, connecting Tambaram and Velachery.… [+2195 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Death of 2 in Ghazipur trash mountain collapse: Court asks EDMC to pay families", "description": "Delhi news: The EDMC also submitted that the “trash mountain was maintained with the utmost care” and that heavy rainfall for 2-3 days before the incident increased the risk.", "url": "https://indianexpress.com/article/cities/delhi/death-of-2-in-ghazipur-trash-mountain-collapse-court-asks-edmc-to-pay-families-7916587/", "urlToImage": "https://images.indianexpress.com/2022/05/landfill-ghazipur.jpg", "publishedAt": "2022-05-14T02:57:49Z", "content": "A Delhi court has awarded compensation to the families of two persons who died when a portion of the garbage heap at Ghazipur collapsed and swept them into a canal. The East Delhi Municipal Corporati… [+2188 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "CGBSE Chhattisgarh board Class 10,12 results 2022: When and where to check scorecard", "description": "CGBSE 10th, 12th Result 2022 Time and Direct Link: Students who have appeared for the CGBSE exams can check their results on the official website of the board — cgbse.nic.in.", "url": "https://indianexpress.com/article/education/cgbse-chhattisgarh-board-class-1012-results-2022-when-and-where-to-check-cgbse-nic-in-7915470/", "urlToImage": "https://images.indianexpress.com/2022/05/2-166.jpg", "publishedAt": "2022-05-14T02:51:12Z", "content": "CGBSE Class 10,12 result 2022: The Chhattisgarh Board of Secondary Education (CGBSE), Raipur, will be releasing the results for the class 10 and 12 board examinations on May 14, 2022. Students who ha… [+914 chars]"}]}