{"status": "ok", "totalResults": 147, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "India-Pakistan cricket match to be “one of the highlights” of CWG 2022: CEO Ian Reid", "description": "Women's cricket is making its debut at the Commonwealth Games, and India and Pakistan will be clashing at Edgbaston on July 31", "url": "https://indianexpress.com/article/sports/cricket/india-pakistan-cricket-match-highlights-cwg-2022-8039726/", "urlToImage": "https://images.indianexpress.com/2017/07/india-vs-pakistan-twitter-fb.jpg", "publishedAt": "2022-07-19T14:51:08Z", "content": "As many as 1.2 million tickets have been sold for the Birmingham Commonwealth Games beginning on July 28, the organisers have said, adding that the women’s cricket match between India and Pakistan ha… [+1481 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": null, "title": "Will act on demand for Maratha reservation as per constitutional provisions: Karnataka CM", "description": "Basavaraj Bommai said the Maratha Development Corporation has drawn up many welfare programmes for the community for which the state government has allotted Rs 100 crore.", "url": "https://indianexpress.com/article/cities/bangalore/will-act-on-demand-for-maratha-reservation-as-per-constitutional-provisions-8039660/", "urlToImage": "https://images.indianexpress.com/2022/07/Basavaraj-Bommai-2-1-1-3.jpg", "publishedAt": "2022-07-19T13:51:15Z", "content": "Karnataka Chief Minister Basavaraj Bommai said Tuesday that action would be initiated within the provisions of the Constitution after getting the Backward Classes Commissions report on the Maratha co… [+2287 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Priya Kumari Shukla", "title": "UPSC Key-July 19, 2022: Why you should read ‘Right to MSP’ or ‘Dependency Ratio’ or ‘Chin refugees’ for UPSC CSE", "description": "Exclusive for Subscribers from Monday to Friday: The Indian Express UPSC Key July 19, 2022 will help you prepare for the Civil Services and other competitive examinations with cues on how to read and understand content from the most authoritative news source …", "url": "https://indianexpress.com/article/upsc-current-affairs/upsc-key-july-19-2022-why-you-should-read-right-to-msp-or-dependency-ratio-or-chin-refugees-for-upsc-cse-8039605/", "urlToImage": "https://images.indianexpress.com/2022/06/UPSC-KEY-Pic-With-Logo.jpg", "publishedAt": "2022-07-19T13:31:46Z", "content": "FRONT PAGE\r\nGovt forms panel for more effective MSP, invites three names from SKM\r\nSyllabus:\r\nPreliminary Examination: Economic and Social Development\r\nMain Examination: General Studies III: Issues r… [+15580 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Nihal Koshie", "title": "Moroccan El Bakkali ends Kenyan reign over 3000m steeplechase in the slowest final in history", "description": "India’s Avinash Sable needs to run sub 8:10 to get on the level with the best, feels India’s distance-running foreign coach Simmons who trains Sable.", "url": "https://indianexpress.com/article/sports/sport-others/moroccan-el-bakkali-ends-kenyan-reign-over-3000m-steeplechase-in-the-slowest-final-in-history-8039578/", "urlToImage": "https://images.indianexpress.com/2022/07/Steeplechase-1.jpg", "publishedAt": "2022-07-19T13:12:40Z", "content": "A Moroccan made history and broke the stranglehold of the Kenyans, a cameraman on track was an unusual obstacle and an Indian national record holder was schooled when some of the best runners in the … [+7389 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gujarat ATS arrests Rajasthan gangster wanted in over 35 criminal cases", "description": "Arvind Singh Bika, a resident of Sirohi in Rajasthan, has been accused of murder, loot, assault, rioting, robbery, extortion etc and is wanted in Gujarat, Rajasthan and Kerala, ATS officials said", "url": "https://indianexpress.com/article/india/gujarat-ats-arrests-rajasthan-gangster-8039539/", "urlToImage": "https://images.indianexpress.com/2022/07/guns-2.jpg", "publishedAt": "2022-07-19T13:02:34Z", "content": "The Gujarat Anti-Terrorist Squad (ATS) has arrested a Rajasthan-based gangster, who was wanted in 35 criminal cases, including murder, across three states in India.According to ATS officials, Arvind … [+875 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Oppo Reno8 Pro vs OnePlus 10R vs Realme GT Neo 3 vs Moto Edge 30 Pro: Price, specs compared - The Indian Express", "description": "<ol><li>Oppo Reno8 Pro vs OnePlus 10R vs Realme GT Neo 3 vs Moto Edge 30 Pro: Price, specs compared  The Indian Express\r\n</li><li>Oppo Reno 8 series, Oppo Pad Air, Oppo Enco X2, Oppo, Oppo Reno 8 pro, Oppo Reno 8, Oppo Reno 8 series review, Oppo Pad Air revei…", "url": "https://indianexpress.com/article/technology/mobile-tabs/oppo-reno-8-pro-vs-oneplus-10r-vs-realme-gt-neo-3-vs-moto-edge-30-pro-price-specs-8039467/", "urlToImage": "https://images.indianexpress.com/2022/07/Oppo-Reno-8-Pro-Express-Photo.jpg", "publishedAt": "2022-07-19T12:57:31Z", "content": "The Oppo Reno8 Pro recently launched in India and it is Oppos most powerful Reno-series phone so far. Unlike previous editions of the series which packed a set of specifications more heavily catered … [+3282 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Gauahar Khan, Gulshan Devaiah and Pavan Malhotra to star in MX Player’s Shiksha Mandal", "description": "While Gauahar will be seen as a cop, Gulshan will be playing a hardworking man who runs a coaching centre. Pavan Malhotra is the antagonist in Shiksha Mandal.", "url": "https://indianexpress.com/article/entertainment/web-series/gauahar-khan-gulshan-devaiah-pavan-malhotra-mx-player-shiksha-mandal-8039532/", "urlToImage": "https://images.indianexpress.com/2022/07/shiksha-mandal.jpg", "publishedAt": "2022-07-19T12:53:51Z", "content": "MX Player has announced its upcoming series Shiksha Mandal, starring Gauahar Khan, Gulshan Devaiah and Pavan Malhotra in the lead roles. Shiksha Mandal – Power Paise Ka… Scam Shiksha Ka will focus on… [+1109 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "‘Bring 500 change’: Woman left in splits as she receives cake with delivery instructions", "description": "Instructions turn into icing on a chocolate cake as eatery misunderstands customer’s message", "url": "https://indianexpress.com/article/trending/trending-in-india/woman-left-in-splits-as-she-receives-cake-with-delivery-instructions-8039313/", "urlToImage": "https://images.indianexpress.com/2022/07/cake-wrong-message.jpg", "publishedAt": "2022-07-19T12:15:32Z", "content": "While ordering food online has made our lives easier, satisfying our hunger pangs and cravings within minutes, this is not always the case. Like this customer who ordered a cake recently and was amus… [+1368 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Yogesh Naik", "title": "In six months, Mumbai airport sees 132% growth in passenger traffic", "description": "Mumbai’s Chhatrapati Shivaji Maharaj International Airport has witnessed a robust growth in passenger movement with nearly 1.7 crore passengers travelling between January to June this year", "url": "https://indianexpress.com/article/cities/mumbai/in-six-months-mumbai-airport-sees-132-growth-in-passenger-traffic-8039337/", "urlToImage": "https://images.indianexpress.com/2022/05/Air-India-2.jpg", "publishedAt": "2022-07-19T12:02:04Z", "content": "In the first half of 2022, Mumbais Chhatrapati Shivaji Maharaj International Airport has seen a 132 per cent increase in passenger traffic as compared to the first six months of 2021, airport data ha… [+2081 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Daria Kasatkina comes out as gay as Russia mulls tightening restrictions on discussing LGBTQ+ relationships", "description": "In a YouTube interview with Russian blogger Vitya Kravchenko, Russia's No.1 women's tennis player also called for an end to fighting in Ukraine.", "url": "https://indianexpress.com/article/sports/tennis/daria-kasatkina-comes-out-as-gay-russia-restrictions-on-lgbtq-8039305/", "urlToImage": "https://images.indianexpress.com/2018/06/daria-kasatkina-fb.jpg", "publishedAt": "2022-07-19T11:35:07Z", "content": "Russia’s highest-ranked women’s tennis player, Daria Kasatkina, said in a video interview that she is dating a woman.The French Open semifinalist’s comments come as the Russian parliamentdiscusses ti… [+2040 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "African swine fever reported in Assam: All you need to know about this non-zoonotic disease", "description": "World Health Organisation for Animal Health states that ASF is a highly contagious viral disease of domestic and wild pigs, whose mortality rate can reach 100 per cent", "url": "https://indianexpress.com/article/lifestyle/health/african-swine-fever-pigs-assam-human-risk-symptoms-prevention-8038103/", "urlToImage": "https://images.indianexpress.com/2022/07/swine_200_pexels.jpg", "publishedAt": "2022-07-19T11:30:00Z", "content": "According to reports, a pig tested positive for African swine fever (ASF) in Dibrugarhs Bhogali Pathar village in Assam. According to ANI, villages within 1 km radius were designated as infected zone… [+2012 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gujarat: Ukai dam releases 1.88 lakh cusec water after increased inflow from upper catchment areas", "description": "The administration has also started preparations to counter flood-like situation in Surat resulting from the heavy discharge of water from the dam.", "url": "https://indianexpress.com/article/cities/surat/gujarat-ukai-dam-releases-1-88-lakh-cusec-water-after-increase-8039254/", "urlToImage": "https://images.indianexpress.com/2022/07/tapi-river.jpg", "publishedAt": "2022-07-19T11:23:14Z", "content": "Around 1.88 lakh cusec water has been released from the Ukai dam on Tapi river in Gujarat Tuesday. Dam authorities said they had to release water as the water level in the dam has risen from 315 feet… [+1830 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "The secret to an elephant’s trunk is skin deep", "description": "The elephant's trunk, full of muscle and devoid of bone, can move in a virtually infinite number of directions and is capable of performing an array of tasks, such as tearing up foliage and suctioning up water and tortilla chips.", "url": "https://indianexpress.com/article/technology/science/the-secret-to-an-elephants-trunk-is-skin-deep-8039211/", "urlToImage": "https://images.indianexpress.com/2022/07/Elephant-trunk-secret-18072022.jpg", "publishedAt": "2022-07-19T10:51:04Z", "content": "The elephant has a secret hiding right on its nose.\r\nIts famous trunk, full of muscle and devoid of bone, can move in a virtually infinite number of directions and is capable of performing an array o… [+4593 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Neha Banka", "title": "Explained: A major India-Africa conclave is taking place in New Delhi — why is it important?", "description": "Forty high-level ministers from 17 countries, including Cameroon, Burkina Faso, Eswatini, Republic of the Congo, Nigeria and Sierra Leone, are participating in the two-day summit.", "url": "https://indianexpress.com/article/explained/explained-major-india-africa-conclave-new-delhi-why-is-it-important-8039132/", "urlToImage": "https://images.indianexpress.com/2022/07/Venkaiah.jpg", "publishedAt": "2022-07-19T10:41:48Z", "content": "High-level diplomats from several African nations are currently in New Delhi for a key two-day investment meet that was scheduled to be inaugurated by Vice President Venkaiah Naidu on Tuesday (July 1… [+4979 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pumpkin-size 5.6 kg fibroid removed from 38-year-old’s uterus", "description": "Do not ignore signs like heavy bleeding, pelvic pain, frequent urination, rectum pain, constipation, bloating, periods lasting more than eight days and blood clots, caution experts", "url": "https://indianexpress.com/article/cities/pune/pumpkin-size-5-6-kg-fibroid-removed-38-uterus-8039135/", "urlToImage": "https://images.indianexpress.com/2022/07/GettyImages-reproductive-health-women-1200-1.jpg", "publishedAt": "2022-07-19T10:37:04Z", "content": "After experiencing a bulging belly, severe abdominal pain, heavy menstrual flow, fainting spells and a haemoglobin level of 3.4 mg/dl, 38-year-old Niharika Pandey (name changed) from Pune realised th… [+3017 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Tamil Nadu taking all precautions against monkeypox: Health minister Ma Subramanian", "description": "As the Centre announced that it would establish 15 research centres to study monkeypox, Tamil Nadu sought one in the state. If approved, it will be set up at King’s Institute in Chennai, Subramanian said.", "url": "https://indianexpress.com/article/cities/chennai/tamil-nadu-the-plague-of-covid19-and-monkey-pox-8038530/", "urlToImage": "https://images.indianexpress.com/2022/07/Vaccine-.jpg", "publishedAt": "2022-07-19T10:20:00Z", "content": "Tamil Nadu Minister for Health Ma Subramanian recently said that the state is taking all precautions to prevent the spread of monkeypox and has stepped up monitoring of those coming from abroad at fo… [+2347 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Apurva Vishwanath", "title": "Prophet remarks row: Supreme Court says Nupur Sharma won’t be arrested for now", "description": "The same bench on 1 July had declined to entertain Nupur Sharma's plea, saying she has a “loose tongue” and is “single-handedly responsible for what is happening in the country”.", "url": "https://indianexpress.com/article/cities/delhi/supreme-court-nupur-sharma-bail-hearing-hate-speech-prophet-mohammad-8039060/", "urlToImage": "https://images.indianexpress.com/2022/07/nupur-sharma-1-5-1-1.jpeg", "publishedAt": "2022-07-19T10:10:00Z", "content": "The Supreme Court Tuesday directed that no coercive action can be taken against suspended BJP spokesperson Nupur Sharma till the next date of hearing in connection with the complaints filed against h… [+2325 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Chandrakant Lahariya", "title": "‘The possibility of Monkeypox becoming a pandemic is very low,’ says epidemiologist", "description": "The first Monkeypox case in India was detected because the person affected volunteered to share information about his contact being tested positive. This is an example of how the success of effective disease surveillance is dependent upon citizen participatio…", "url": "https://indianexpress.com/article/lifestyle/health-specials/monkeypox-pandemic-possibility-low-experts-8038881/", "urlToImage": "https://images.indianexpress.com/2022/07/Lahariya-.jpg", "publishedAt": "2022-07-19T09:36:22Z", "content": "Indias first ever Monkeypox disease case was reported from Kerala on July 14 and now we have a second case too. To most public health experts, this has not come as a surprise. Since the first week of… [+5768 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Russian parliament mulls expanding ‘gay propaganda’ law", "description": "A cross-party group of six Communist and socially conservative deputies, the bill would ban public discussion of LGBTQ relationships in a positive or neutral light, and any LGBTQ content in cinemas.", "url": "https://indianexpress.com/article/world/russian-parliament-mulls-expanding-gay-propaganda-law-8038657/", "urlToImage": "https://images.indianexpress.com/2022/07/lgbt-activists_759_jason-ball.jpg", "publishedAt": "2022-07-19T09:25:59Z", "content": "Russian parliament mulls expanding ‘gay propaganda’ law Russias parliament moved Monday to tighten already stringent restrictions on the discussion of LGBTQ rights and relationships. A draft bill cal… [+1659 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rishika Singh", "title": "Explained: Why a late Sultan’s heirs want Malaysia to pay $15bn over a colonial-era land dispute", "description": "Malaysia's state oil and gas producer, Petronas, is being told to pay around $15 billion for settling a colonial-era land dispute of a former kingdom spread across Malaysia and the Philippines. What is the case, and how has the government responded?", "url": "https://indianexpress.com/article/explained/malaysia-petronas-dispute-sulu-kingdom-sultan-8038849/", "urlToImage": "https://images.indianexpress.com/2022/07/petronas.jpg", "publishedAt": "2022-07-19T09:18:51Z", "content": "Malaysias state oil and gas producer, Petronas, is being told to pay around $15 billion for settling a colonial-era land dispute of a former kingdom spread across Malaysia and the Philippines.Petrona… [+3930 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Seeking money for ‘ailing mom’, conman cheats Pune MLA Madhuri Misal", "description": "While Pune MLA Madhuri Misal’s daughter Pooja filed a complaint against Mukesh Rathod at Bibvewadi police station, the police are investigating if MLAs Meghna Bordikar from Jintur, Shweta Mahale from Buldhana, and Devyani Farande from Nashik too were cheated …", "url": "https://indianexpress.com/article/cities/pune/seeking-money-ailing-mom-conman-pune-mla-madhuri-misal-8038854/", "urlToImage": "https://images.indianexpress.com/2022/07/Handcuffs-crime-1200-2-1-10.43.56-AM-1.jpeg", "publishedAt": "2022-07-19T09:18:35Z", "content": "Four BJP MLAs from Maharashtra were allegedly duped into sending money to a conman who approached them saying he needed financial assistance as his mother was ill, the police said.While Pune MLA Madh… [+983 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Chris Evans on his bond with Iron Man star Robert Downey Jr: ‘He has always been in my corner…’", "description": "Chris Evans and Robert Downey Jr have collaborated on multiple Marvel movies, including the likes of Captain America: Civil War, Avengers, and Avengers: Infinity War.", "url": "https://indianexpress.com/article/entertainment/hollywood/chris-evans-on-former-mcu-co-star-robert-downey-jr-rdj-has-always-been-in-my-corner-8038762/", "urlToImage": "https://images.indianexpress.com/2022/07/rdj1200.jpg", "publishedAt": "2022-07-19T09:11:29Z", "content": "It has been a few years since we last saw Chris Evans‘ Captain America and Robert Downey Jr’s Iron Man together on screen. But despite not working together professionally anymore, the two clearly sha… [+1794 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Watch: Niroshan Dickwella’s excellent stumping to dismiss Imam-ul-Haq", "description": "Tucker watched the replay from different angles; the one from the square leg seemed to suggest his foot was in the air.", "url": "https://indianexpress.com/article/sports/cricket/watch-niroshan-dickwellas-excellent-stumping-to-dismiss-imam-ul-haq-8038789/", "urlToImage": "https://images.indianexpress.com/2022/07/Imam.jpg", "publishedAt": "2022-07-19T08:57:26Z", "content": "Sri Lanka’s wicketkeeper Niroshan Dickwella showed great glovework when he stumped Pakistan opening batter Imam-ul-Haq on Day 4 of the first Test match at Galle on Tuesday.Chasing the fourth innings … [+1153 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Man stabbed in Bihar, police deny Nupur Sharma angle", "description": "The incident took place in Nanpur police station area of Sitamarhi district on Sunday where Ankit Jha, 23, was stabbed several times at a betel shop after which he was rushed to a hospital.", "url": "https://indianexpress.com/article/cities/delhi/man-stabbed-in-bihar-police-deny-nupur-sharma-angle-8038776/", "urlToImage": "https://images.indianexpress.com/2022/07/STAB.jpg", "publishedAt": "2022-07-19T08:42:06Z", "content": "A young man was stabbed by people of another community in Bihar for allegedly watching a video of suspended BJP leader Nupur Sharma, though police asserted that the incident had “no communal angle”.T… [+798 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Careers Desk", "title": "Teach For India programme 2022: Apply for paid fellowship; check details", "description": "Teach For India fellowship programme 2022: In order to be eligible to apply to the fellowship, one must be an Indian Citizen or an Overseas Citizen of India, and must have graduated with a minimum of a Bachelor's degree by June/July 2023. The application proc…", "url": "https://indianexpress.com/article/jobs/teach-for-india-programme-2022-apply-for-paid-fellowship-check-details-apply-teachforindia-org-8037095/", "urlToImage": "https://images.indianexpress.com/2022/07/Teach-for-India.jpg", "publishedAt": "2022-07-19T08:42:04Z", "content": "Teach For India fellowship programme 2022: Teach for India is inviting applications for a two-year-long paid fellowship opportunity. Interested candidates can apply for the programme at the official … [+2071 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Kallakurichi violence: SC refuses father’s plea for including doctor of his choice for girl’s postmortem", "description": "The death of the class 12 girl on July 13 in the premises of the residential school had sparked off violence in certain areas of Kallakurichi district in Tamil Nadu.", "url": "https://indianexpress.com/article/cities/delhi/kallakurichi-violence-sc-refuses-fathers-plea-for-including-doctor-of-his-choice-for-girls-postmortem-8038768/", "urlToImage": "https://images.indianexpress.com/2022/07/supreme-court-1-5.jpg", "publishedAt": "2022-07-19T08:36:30Z", "content": "The Supreme Court on Tuesday did not agree to the plea of a man, whose 17-year-old daughter was found dead at a private residential school in Tamil Nadu, that a doctor of his choice is permitted to b… [+1276 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Dbrand’s ‘Something’ skin brings the Nothing phone (1) look to your device", "description": "Nothing phone 1: How to get Nothing phone (1)-like transparent design for your Apple, Google, Samsung smartphone.", "url": "https://indianexpress.com/article/technology/techook/nothing-phone-1-look-dbrand-something-skin-8038760/", "urlToImage": "https://images.indianexpress.com/2022/07/Dbrand-Something-skin.jpg", "publishedAt": "2022-07-19T08:25:35Z", "content": "There may be multiple reasons why the unique Nothing phone (1) transparent design appeals to you, but the rest of the phone doesnt. It could be the mid-range specifications, the uncertainty of a newe… [+1809 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Liz Mathew", "title": "12 Sena MPs write to Lok Sabha Speaker, naming leader and chief whip: LS Secretariat", "description": "12 of the 19 Shiv Sena MPs have requested Lok Sabha Speaker Om Birla to make Rahul Shewale their leader while retaining Bhavana Gawali as the chief whip, sources said", "url": "https://indianexpress.com/article/cities/mumbai/shiv-sena-mps-lok-sabha-speaker-naming-leader-and-chief-whip-ls-secretariat-8038720/", "urlToImage": "https://images.indianexpress.com/2022/07/rahul-shewale.png", "publishedAt": "2022-07-19T08:03:27Z", "content": "Twelve of the 19 Shiv Sena Members of Parliament (MPs) in the Lok Sabha have written to Speaker Om Birla, requesting him to make Rahul Shewale their leader while retaining Bhavana Gawali as the chief… [+925 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Common monsoon skin problems and effective remedies to manage them", "description": "During monsoon, the skin becomes a breeding ground for various bacteria and germs; here's how you can deal with the situation", "url": "https://indianexpress.com/article/lifestyle/life-style/common-monsoon-skin-problems-fix-treatment-solution-8013334/", "urlToImage": "https://images.indianexpress.com/2022/07/Getty-acne-1200.jpg", "publishedAt": "2022-07-19T07:50:24Z", "content": "Monsoon can bring with it a host of worrying skin problems if one is not careful. It must be noted that every skin reacts differently to the monsoon season, and as the weather changes, excessive humi… [+3358 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Sreesanth says India would have won the World Cup thrice if had played under Kohli’s captaincy", "description": "Under the leadership of Kohli, India have faltered at different ICC tournaments beginning with the 2017 Champions Trophy, 2019 ODI World Cup, and the 2021 World Test Championship.", "url": "https://indianexpress.com/article/sports/cricket/sreesanth-says-india-would-have-won-the-world-cup-thrice-if-had-played-under-kohlis-captaincy-8038443/", "urlToImage": "https://images.indianexpress.com/2022/07/sreesanth.jpg", "publishedAt": "2022-07-19T07:28:34Z", "content": "S Sreesanth, who has been part of India’s two World Cup winning teams, has said that India would have won at least three World Cups, if he had played under Virat Kohli’s captaincy.Under the leadershi… [+1583 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "NYT", "title": "A cameraman became accidental obstacle in men’s steeplechase", "description": "The 15 men in the field successfully swerved around the cameraman, who had his back turned to them while he filmed the women’s triple jump nearby.", "url": "https://indianexpress.com/article/sports/sport-others/a-cameraman-became-accidental-obstacle-in-mens-steeplechase-8038618/", "urlToImage": "https://images.indianexpress.com/2022/07/Steeplechase.jpg", "publishedAt": "2022-07-19T07:27:22Z", "content": "Steeplechasers are familiar with obstacles. Over the course of 3,000 meters, they must clear 28 waist-high barriers and seven water pits. On Monday night, though, in the early stages of the mens fina… [+1487 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Watch: Manchester City players pranked by comedy character Troy Hawke", "description": "The Manchester City players were left amused and baffled after being greeted by comedian Milo McCabe", "url": "https://indianexpress.com/article/sports/football/watch-manchester-city-players-pranked-by-comedy-character-troy-hawke-8038463/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-4-12.jpg", "publishedAt": "2022-07-19T07:23:30Z", "content": "A video of comedian Milo McCabe’s Greeters Guild character Troy Hawke has gone viral where he is pranking Manchester City players. In the video, the comedian can be seen greeting the players ahead of… [+1337 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Sena MP Shrirang Barne joins Shinde fold, says he is part of separate group of 12 MPs", "description": "Shrirang Barne is a two-time Sena MP from Pune’s Maval constituency. He said Rahul Shewale, the leader of the 12-member separate group of Sena MPs, will hold a press conference on Tuesday afternoon to clarify their stand.", "url": "https://indianexpress.com/article/cities/pune/sena-mp-shrirang-barne-joins-shinde-fold-says-he-is-part-of-separate-group-of-12-mps-8038309/", "urlToImage": "https://images.indianexpress.com/2022/07/shirang-barne-480.jpg", "publishedAt": "2022-07-19T07:15:50Z", "content": "Shiv Sena’s Maval MP Shrirang Barne on Tuesday said he was part of the 12-member separate group of MPs formed by the rebel faction led by Maharashtra Chief Minister Eknath Shinde. There have been spe… [+2077 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Supreme Court to consider listing woman’s plea seeking termination of 23-week foetus", "description": "The petitioner, a 25-year-old woman, who would complete 24 weeks of gestation on July 18, had told the court that her partner, with whom she was in a consensual relationship, had refused to marry her.", "url": "https://indianexpress.com/article/india/supreme-court-unmarried-women-pregnancy-medical-termination-8038551/", "urlToImage": "https://images.indianexpress.com/2022/07/GettyImages-pregnancy-test-1200.jpg", "publishedAt": "2022-07-19T07:13:50Z", "content": "The Supreme Court on Tuesday agreed to consider listing the plea of an unmarried woman who was not allowed by the Delhi High Court to undergo medical termination of pregnancy at 23 weeks arising out … [+2348 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "ভার্চুয়াল হোক ২১ জুলাইয়ের সমাবেশ, সন্ধেয় মামলার রায় দেবে হাইকোর্ট", "description": "২১ জুলাইয়ের সমাবেশকে ঐতিহাসিক করার সবরকম প্রস্তুতি সারা জোড়াফুল শিবিরের।", "url": "https://bengali.indianexpress.com/west-bengal/21-july-shahid-diwas-pil-in-calcutta-hc-for-virtual-rally-471011/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/Tmc-1.jpg", "publishedAt": "2022-07-19T07:01:18Z", "content": "- \r\n , , , \r\n , , \r\n , , - \r\n- , , \r\n , \r\nStay updated with the latest news headlines and all the latest Westbengal news download Indian Express Bengali App.\r\nWeb Title: 21 july shahid diwas pil in c… [+27 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Janardhan Koushik", "title": "Know Your City: This Chennai shop has been selling ice cream for Rs 2 for over two decades", "description": "Vinu’s Igloo, an ice cream shop founded in 1995 by S Vijayan, is a popular store located near Five Lights in the sleepy neighbourhood of West Mambalam.", "url": "https://indianexpress.com/article/cities/chennai/know-your-city-this-chennai-shop-has-been-selling-ice-cream-for-rs-2-for-over-two-decades-8038388/", "urlToImage": "https://images.indianexpress.com/2022/07/Ice-cream-shop.jpeg", "publishedAt": "2022-07-19T06:41:25Z", "content": "A wise man once said, Change is the only constant in life, which holds true in several situations. However, a shop in Chennai has proved it is not always the case.Vinus Igloo, an ice cream shop found… [+6069 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Agnipath scheme: Delhi HC to hear pleas challenging cancellation of pending defence recruitment processes tomorrow", "description": "A division bench said similar cases are listed for hearing Wednesday and clubbed the petition of a 22-year-old man from Haryana with those.", "url": "https://indianexpress.com/article/cities/delhi/agnipath-scheme-delhi-high-court-pending-defence-recruitment-8038384/", "urlToImage": "https://images.indianexpress.com/2022/07/indian-army-1200-1-2.jpg", "publishedAt": "2022-07-19T06:39:32Z", "content": "The Delhi High Court will hear Wednesday a petition challenging the cancellation of various pending recruitment processes in defence services in light of the introduction of the Agnipath scheme.The d… [+1647 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Bouncer thrashed to death over parking near Delhi’s Saket Metro station, one arrested", "description": "The police said Rohit, 35, was returning with friends after his work at a club in Delhi’s Hauz Khas when the accused attacked him with bricks and stones before fleeing.", "url": "https://indianexpress.com/article/cities/delhi/bouncer-thrashed-to-death-over-parking-near-delhis-saket-metro-station-one-arrested-8038282/", "urlToImage": "https://images.indianexpress.com/2022/07/Saket_metro_station_-_Entrance_board-2-2.jpg", "publishedAt": "2022-07-19T06:25:20Z", "content": "One person was arrested after a bouncer was allegedly thrashed to death by a group of five to six men following a fight over parking a car near Saket Metro station in South Delhi, the police said Tue… [+1652 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Supreme Court transfers pleas challenging Agnipath scheme to Delhi HC", "description": "The Supreme Court directed other high courts to either allow the petitioners to have their pleas on the Agnipath scheme transferred to the Delhi HC or to keep their petitions pending with liberty to petitioners to intervene in Delhi HC.", "url": "https://indianexpress.com/article/india/agnipath-scheme-supreme-court-transfers-plea-delhi-high-court-8038264/", "urlToImage": "https://images.indianexpress.com/2022/07/agnipath.jpg", "publishedAt": "2022-07-19T06:17:50Z", "content": "The Supreme Court Tuesday transferred three petitions filed before it challenging the Centre’s Agnipath recruitment scheme to the Delhi High Court, Bar and Bench reported.A bench comprising Justices … [+1351 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": null, "title": "Pune sees spike in dengue fever, 50 cases confirmed in two weeks - The Indian Express", "description": "Dengue fever is transmitted to humans through the bite of infected mosquitoes. The primary vectors that transmit the disease are Aedes aegypti mosquitoes and breeding occurs mainly through man-made containers, including buckets and discarded containers, offic…", "url": "https://indianexpress.com/article/cities/pune/pune-dengue-spike-8038300/", "urlToImage": "https://images.indianexpress.com/2022/07/dengue.jpg", "publishedAt": "2022-07-19T06:03:48Z", "content": "The health department of the Pune Municipal Corporation has said that there has been a rise in the number of dengue cases in the city. Close to 200 cases of dengue and 72 of chikungunya have been con… [+2267 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Judge reneged on promise in Roman Polanski abuse case, claims prosecutor", "description": "Release of the transcript, which was ordered by a California appeals court Wednesday after Los Angeles District Attorney George Gascón dropped longstanding objections his predecessors made to its release, may support Roman Polanski’s claims that he was going …", "url": "https://indianexpress.com/article/entertainment/hollywood/prosecutor-judge-reneged-on-promise-in-roman-polanski-abuse-case-8038170/", "urlToImage": "https://images.indianexpress.com/2022/07/Roman-Polanski-ap-1200by667-1.jpeg", "publishedAt": "2022-07-19T05:55:01Z", "content": "A Los Angeles judge privately told lawyers he would renege on a promise and imprison Roman Polanski for sexually abusing a 13-year-old girl in 1977, a former prosecutor testified, setting the stage f… [+7434 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Odisha girl jumps off roof to escape gang-rape bid, critically injured", "description": "The incident took place on Sunday night when the girl, a resident of Keonjhar district, along with her brother was going to her sister's place in Sukinda Chromite valley.", "url": "https://indianexpress.com/article/cities/bhubaneswar/odisha-girl-jumps-off-roof-to-escape-gang-rape-bid-critically-injured-8038183/", "urlToImage": "https://images.indianexpress.com/2022/07/Express-Representational-Image-46-15.jpeg", "publishedAt": "2022-07-19T05:38:16Z", "content": "A girl has suffered critical injuries after jumping off the roof of a school building in Odisha’s Jajpur district in a bid to escape a rape attempt by five men, police said.The five accused, who had … [+1246 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Nusrat Jahan says her ‘so-called friends’ have always been the first to run away and judge her in times of trouble", "description": "Nusrat Jahan opened up about the media attention she received after announcing her pregnancy, and said that her silence shouldn't be misconstrued as an admission of guilt.", "url": "https://indianexpress.com/article/entertainment/regional/nusrat-jahan-on-so-called-friends-pregnancy-controversy-8038135/", "urlToImage": "https://images.indianexpress.com/2022/01/nusrat-jahan-yash-dasgupta-1200.jpg", "publishedAt": "2022-07-19T05:31:20Z", "content": "Actor-politician Nusrat Jahan said that she has always been an ‘outspoken’ person, and for her to receive a lot of attention after announcing her pregnancy wasn’t unexpected. Nusrat and her child’s f… [+1534 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Washington Sundar says he loved to be Freddie Flintoff when playing for Lancashire on PlayStation", "description": "Indian all-rounder Washington Sundar will be making his comeback in red-ball cricket since sustaining a finger injury in July last year.", "url": "https://indianexpress.com/article/sports/cricket/washington-sundar-says-he-loved-to-be-freddie-flintoff-when-playing-for-lancashire-on-playstation-8038144/", "urlToImage": "https://images.indianexpress.com/2022/07/Washington-Sundar.jpg", "publishedAt": "2022-07-19T05:25:05Z", "content": "India all-rounder Washington Sundar is set to make his county debut for Lancashire against Northamptonshire, starting from Tuesday.Sundar will be making his comeback in red-ball cricket since sustain… [+3241 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Seven electric two-wheelers gutted in fire at Pune automobile showroom", "description": "As per the information given by Pune Fire Brigade, the fire was reported in a showroom selling electric two-wheelers and accessories next to Gangadham Chowk near Market Yard around 8 pm.", "url": "https://indianexpress.com/article/cities/pune/seven-electric-two-wheelers-gutted-in-fire-at-pune-automobile-showroom-8038155/", "urlToImage": "https://images.indianexpress.com/2022/07/f2006dd9-d274-4f69-88a3-601f1f6bd20a.jpg", "publishedAt": "2022-07-19T05:20:09Z", "content": "Seven electric two-wheelers were gutted in a fire that started in an automobile showroom at Gangadham Chowk in Pune Monday evening, officials said Tuesday. No casualties were reported in the incident."}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Careers Desk", "title": "RRB NTPC CBT 2 result declared for pay level 2 and 5; check details", "description": "RRB NTPC CBT 2 result: Along with the result, RRB has also released the cut-off marks for pay level 2 and 5. The result pdf contains roll numbers of provisionally shortlisted for the CBAT round.", "url": "https://indianexpress.com/article/jobs/rrb-ntpc-cbt-2-result-declared-for-pay-level-2-and-5-sarkari-result-rrbcdg-gov-in-8038180/", "urlToImage": "https://images.indianexpress.com/2021/01/RRBNTPC1.jpg", "publishedAt": "2022-07-19T05:19:56Z", "content": "The Railway Recruitment Board has declared the RRB NTPC 2019 result for pay levels 2 and 5. The results have been announced for  Ahemdabad, Chennai, Bengaluru, Jammu and Srinagar, Kolkata, and Ranchi… [+782 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi weather: Light rain and thunderstorms likely in a few places, says IMD", "description": "The intensity of rainfall is set to increase from Wednesday onwards, when ‘moderate’ rainfall is in the forecast.", "url": "https://indianexpress.com/article/cities/delhi/delhi-weather-light-rain-thunderstorms-imd-8038179/", "urlToImage": "https://images.indianexpress.com/2022/07/delhi-rains-3.jpg", "publishedAt": "2022-07-19T05:12:21Z", "content": "The India Meteorological Department (IMD) forecast for Delhi said that the city could receive light rain or see thunderstorms in a few places Tuesday.Its likely to be another warm day when the maximu… [+1735 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Sajith Premadasa withdraws his candidacy from Sri Lanka presidential election", "description": "Sajith Premadasa, an MP from Colombo, is the current leader of  Samagi Jana Balawegaya and the Leader of Opposition.", "url": "https://indianexpress.com/article/world/sri-lanka-president-election-sajith-premadasa-8038165/", "urlToImage": "https://images.indianexpress.com/2022/07/sajith-1200-1.jpg", "publishedAt": "2022-07-19T05:01:42Z", "content": "Sri Lanka’s Leader of Opposition Sajith Premadasa said Tuesday that he has withdrawn his candidacy for the upcoming Presidential elections.“For the greater good of my country that I love and the peop… [+784 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Markets halt two-day rally in early trade amid weak global equities", "description": "Stock Market Today (July 19): The 30-share BSE benchmark was trading 117.3 points lower at 54,403.85 in early trade. The broader NSE Nifty declined 28.80 points to 16,249.70.", "url": "https://indianexpress.com/article/business/market/share-market-today-july-19-equity-stocks-bse-sensex-nse-nifty-rupee-global-cues-q1-profit-results-8038040/", "urlToImage": "https://images.indianexpress.com/2022/07/bse-bombay-stock-exchange-express-archive-1200.jpeg", "publishedAt": "2022-07-19T04:33:02Z", "content": "Equity benchmark indices Sensex and Nifty started the trade on a tepid note on Tuesday, halting their two-day rally, amid an overall weak trend in global markets.The 30-share BSE benchmark was tradin… [+1100 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Aishwarya Rai holds daughter Aaradhya’s hand as they return from New York with Abhishek Bachchan, fans say ‘Aradhya will soon be taller than her mom’", "description": "Aishwarya Rai Bachchan and Abhishek Bachchan took their daughter Aaradhya to New York for a vacation, the place where Abhishek proposed to Aishwarya 15 years ago.", "url": "https://indianexpress.com/article/entertainment/bollywood/aishwarya-rai-holds-daughter-aaradhyas-hand-as-they-return-from-new-york-with-abhishek-bachchan-fans-taller-than-mom-8038036/", "urlToImage": "https://images.indianexpress.com/2022/07/aishwarya-abhishek.jpg", "publishedAt": "2022-07-19T04:27:35Z", "content": "Bollywood actors Abhishek Bachchan and Aishwarya Rai Bachchan, along with their daughter Aaradhya Bachchan have returned from their New York vacation. A video of them walking out of the Mumbai airpor… [+1589 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Covid rises across US amid muted warnings and murky data", "description": "The latest surge, driven by a spike of BA.5 subvariant cases in this country since May, has sent infections rising in at least 40 states, particularly in the Great Plains, West and South.", "url": "https://indianexpress.com/article/world/covid-rises-across-us-amid-muted-8038054warnings-and-murky-data/", "urlToImage": "https://images.indianexpress.com/2022/07/np_file_171520.jpeg", "publishedAt": "2022-07-19T04:15:37Z", "content": "COVID-19 is surging around the United States again in what experts consider the most transmissible variant of the pandemic yet.\r\nBut something is different this time: The public health authorities ar… [+9691 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Belgium beat Italy to reach Euro 2022 quarterfinals", "description": "Midfielder Tine de Caigny scored in the 49th minute and Belgium clung on to win.", "url": "https://indianexpress.com/article/sports/football/belgium-beat-italy-to-reach-euro-2022-quarterfinals-8038042/", "urlToImage": "https://images.indianexpress.com/2022/07/Belgium-vs-Italy.jpg", "publishedAt": "2022-07-19T03:54:41Z", "content": "Belgium reached the quarterfinals of the Women’s European Championship for the first time after a 1-0 upset win over Italy also eliminated Iceland.Midfielder Tine de Caigny scored in the 49th minute … [+1850 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "‘Strength training helped Shah Rukh look better and bigger’: Trainer on King Khan’s transformation for ‘Pathaan’", "description": "Fitness trainer Prashant Subhash Sawant, who has been working with Shah Rukh Khan for over two-decades, spills the beans on the actor's diet and fitness routine for his much-anticipated film, Pathaan", "url": "https://indianexpress.com/article/lifestyle/fitness/strength-training-shah-rukh-khan-pathaan-transformation-diet-fitness-prashant-sawant-8036218/", "urlToImage": "https://images.indianexpress.com/2022/07/Shah-Rukh-Khan-fitness-pathaan_200_insta.jpg", "publishedAt": "2022-07-19T03:40:33Z", "content": "Shah Rukh Khan‘s chiseled avatar for his new film Pathaan has created a lot of internet frenzy. Proving age is just a number, the 56-year-old can be seen sporting eight-pack abs for which he has been… [+2570 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "subhamay mandal", "title": "লালুর দলে যেতে চান মোদীর মন্ত্রী! তেজস্বীর এক দাবিতে তুমুল শোরগোল", "description": "বিজেপির হাইকম্যান্ডের নির্দেশের পরই আশাভঙ্গ হয়েছে কেন্দ্রীয় মন্ত্রীর।", "url": "https://bengali.indianexpress.com/politics/tejashwi-claims-nityanand-rai-wanted-to-join-rjd-bjp-says-character-assassination-470980/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/01/PM-Narendra-Modi.jpg", "publishedAt": "2022-07-19T03:13:58Z", "content": "Stay updated with the latest news headlines and all the latest Politics news download Indian Express Bengali App.\r\nWeb Title: Tejashwi claims nityanand rai wanted to join rjd bjp says character assas… [+7 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anvita Singh", "title": "Dhanush on working with Russo Brothers in The Gray Man: ‘Felt I had to deliver, so they come for more talent from India’", "description": "Dhanush plays a pivotal role in the upcoming Russo Brothers movie The Gray Man. He speaks to us about his first day on sets, his need to deliver as an actor in the film and collaborating with the Russos.", "url": "https://indianexpress.com/article/entertainment/hollywood/dhanush-on-working-with-russo-brothers-in-the-gray-man-marvel-movies-action-8026490/", "urlToImage": "https://images.indianexpress.com/2022/07/dhanush1200.jpg", "publishedAt": "2022-07-19T03:07:29Z", "content": "Indian star Dhanush, who previously made his Hollywood debut with the 2018 release The Extraordinary Journey of the Fakir, will soon be seen in Netflix’s action-thriller The Gray Man. The actor plays… [+2479 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manoj Kumar R", "title": "Vikrant Rona star Sudeep on breaking the language barrier: ‘I don’t put limitations on myself’", "description": "Sudeep acknowledged that the business of entertainment has undergone a tectonic shift in the last couple of years. And yet he's confident that Vikrant Rona ticks all the right boxes when it comes to the new definition of a movie worthy of the big screen.", "url": "https://indianexpress.com/article/entertainment/regional/vikrant-rona-star-sudeep-on-breaking-language-barrier-in-movies-8037277/", "urlToImage": "https://images.indianexpress.com/2022/06/sudeep.jpg", "publishedAt": "2022-07-19T02:42:15Z", "content": "Sudeep was one of the first contemporary stars to build some serious body of work outside his home ground, the Kannada film industry. He has continued to throw surprises when it comes to the choices … [+3203 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Rishi Sunak tops new UK PM vote as only 4 remain in race", "description": "While the top tier of the voting tally remains largely unchanged, Rishi Sunak has picked up 14 more votes from the previous round of 101.", "url": "https://indianexpress.com/article/world/rishi-sunak-tops-new-uk-pm-vote-8037946/", "urlToImage": "https://images.indianexpress.com/2022/07/rishi-sunak-2.jpg", "publishedAt": "2022-07-19T02:22:33Z", "content": "The British Indian former finance minister received 115 votes in the third round of voting, with Trade Minister Penny Mordaunt holding on to the second spot with 82 votes followed by Foreign Secretar… [+3333 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Debraj Deb", "title": "Arunachal ‘beef order’ turnabout: All-round pushback and a mum BJP", "description": "The town of Naharlagun on July 13 directed eateries to stop advertising ‘beef’ on their signboards. With even the BJP’s ally NPP voicing its opposition, the government announced the order’s withdrawal three days later.", "url": "https://indianexpress.com/article/political-pulse/arunachal-pradesh-beef-hoardings-bjp-npp-8037901/", "urlToImage": "https://images.indianexpress.com/2022/07/arunacha-youth-congress-tarh-johny.jpg", "publishedAt": "2022-07-19T01:32:08Z", "content": "An administrative order issued in the town of Naharlagun near Arunachal Pradeshs capital Itanagar last week caught everyones attention as it mandated eateries to remove the word beef from their hoard… [+4102 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Express Townhall | ‘Play in hope of getting better each day; luck will decide when I make it to India team’", "description": "Sarfaraz Khan, the leading runscorer in this year’s Ranji season, talks about his dream run with the bat, his relationship with his father Naushad, and his dream of making it to the Indian cricket team.", "url": "https://indianexpress.com/article/cities/mumbai/express-townhall-sarfaraz-khan-ranji-trophy-ipl-mumbai-uttar-pradesh-india-cricket-team-8037668/", "urlToImage": "https://images.indianexpress.com/2022/07/Sarfaraz-Khan.jpg", "publishedAt": "2022-07-18T23:20:44Z", "content": "Sarfaraz Khan, 24, the leading runscorer in this years Ranji season, talks about his dream run with the bat, which saw him score 936 runs in six games, his relationship with his father Naushad, who i… [+6342 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Harikishan Sharma", "title": "Govt forms panel for ‘more effective’ MSP, invites three names from SKM", "description": "The committee, headed by former Agriculture Secretary Sanjay Agrawal, has 26 members including farmer representatives.", "url": "https://indianexpress.com/article/india/govt-forms-panel-for-more-effective-msp-invites-three-names-from-skm-8037680/", "urlToImage": "https://images.indianexpress.com/2022/07/farmers-protests-2.jpg", "publishedAt": "2022-07-18T23:14:58Z", "content": "Seven months after farmers ended their protest at the borders of Delhi after forcing the repeal of the new farm laws, the Centre notified a committee Monday to promote zero-budget based farming and t… [+4184 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shyamlal Yadav", "title": "Explained: Clearing CMs’ foreign trips", "description": "Delhi CM Arvind Kejriwal has said the Centre is delaying clearance for his planned trip to Singapore. What kinds of clearances are required by CMs, ministers, MPs and govt servants for foreign trips, and from whom?", "url": "https://indianexpress.com/article/explained/clearing-cms-foreign-trips-8037634/", "urlToImage": "https://images.indianexpress.com/2022/07/kejriwal-explained.jpg", "publishedAt": "2022-07-18T23:12:37Z", "content": "In October 2019, the Centre had not given him approval to attend another conference abroad, which he eventually addressed through videoconferencing.\r\nWhat clearance do Chief Ministers require to trav… [+6478 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "One more held in Landran armed robbery", "description": "According to the police, the accused was identified as Paramdilip Singh alias Pamma, a resident of Kajikot village in Tarn Taran district.", "url": "https://indianexpress.com/article/cities/chandigarh/one-more-held-in-landran-armed-robbery-8037824/", "urlToImage": "https://images.indianexpress.com/2022/07/arrest-4-1.jpg", "publishedAt": "2022-07-18T22:59:48Z", "content": "The district police arrested one more person in connection with an armed robbery case which had happened at Landran on June 11. The accused is said to be a notorious criminal and wanted in a number o… [+902 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "At 2 billion - The Indian Express", "description": "Last week, the Centre began a special 75-day drive in which the third precautionary dose is being administered free at all government vaccination centres.", "url": "https://indianexpress.com/article/opinion/editorials/2-billion-covid-jabs-8037577/", "urlToImage": "https://images.indianexpress.com/2022/07/edit-new-logo-4.jpg", "publishedAt": "2022-07-18T22:30:36Z", "content": "If there’s one thing that puts the significance of India’s 2 billion Covid jabs landmark in perspective, it’s this: Social and economic life has, by all accounts, returned to pre-pandemic normalcy. T… [+3087 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Ritu Sharma", "title": "Cave-in at Vastral is 40-foot deep, will take 15 days to repair: AMC", "description": "The civic officials had on Sunday calculated it to be of 26-foot deep but during an inspection on Monday, it turned out to be of 40 feet. The cave-in that occurred after a sewer line broke was Ahmedabad’s 28th such incident across all seven zones in the past …", "url": "https://indianexpress.com/article/cities/ahmedabad/cave-in-at-vastral-is-40-foot-deep-will-take-15-days-to-repair-amc-8037811/", "urlToImage": "https://images.indianexpress.com/2022/07/Guj-cavein1-3col.jpg", "publishedAt": "2022-07-18T22:07:50Z", "content": "A cave-in that happened on the road at Vastral area of Ahmedabad on July 16 near Metro pillar 129, along the route of the first six kilometres of the Metro rail, was found to be 40-foot deep and woul… [+2270 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mob jostles to take selfies with caged leopard; forest officials shift it 40 km away", "description": "The two-and-a-half year old female leopard was caught in a trap that was laid in Khajod area after a local resident spotted the big cat on July 15, forest officials said.", "url": "https://indianexpress.com/article/cities/surat/mob-jostles-to-take-selfies-with-caged-leopard-forest-officials-shift-it-40-km-away-8037808/", "urlToImage": "https://images.indianexpress.com/2022/07/Guj-leopard-3col.jpg", "publishedAt": "2022-07-18T21:55:45Z", "content": "Around 500 people jostled to take selfies with a leopard caught by the forest department near Surat city on July 17 night, forcing officials to transport the caged animal to a place 40 kilometres awa… [+1227 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Son-in-law of Mindi gang leader shot dead in Surat", "description": "On the basis of a complaint by Yusuf Shaikh with the Lalgate police station, police registered an offence under murder charges and under the Arms Act against Fayyu Sukhri, son of Arif’s sister.", "url": "https://indianexpress.com/article/cities/surat/son-in-law-of-mindi-gang-leader-shot-dead-in-surat-8037802/", "urlToImage": "https://images.indianexpress.com/2022/07/Indian-Express-logo-18.jpeg", "publishedAt": "2022-07-18T21:45:24Z", "content": "The son-in-law of Mindi gang leader was allegedly shot dead in an internal gang war in Nanavat area in Surat lateon Sunday. According to police, Haji Hanjar alias Mohammed Bilal Punawala (40), son-in… [+1307 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "‘Absolutely false’: Teesta denies money exchange allegations", "description": "Opposing Setalvad's bail plea, the SIT's affidavit had, based on a single witness account, alleged that she had received Rs 30 lakh \"on instruction\" from then Congress Rajya Sabha MP late Ahmed Patel.", "url": "https://indianexpress.com/article/cities/ahmedabad/absolutely-false-teesta-denies-money-exchange-allegations-8037793/", "urlToImage": "https://images.indianexpress.com/2022/07/teesta-setalvad-1.jpg", "publishedAt": "2022-07-18T21:30:35Z", "content": "The allegations of money exchange are absolutely false and much has been sought to be made in the public domain to the extent that some money was taken”, arrested activist Teesta Setalvad submitted d… [+2312 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Navjeevan Gopal", "title": "Former CM Channi’s nephew, aide booked in 2017 illegal mining case", "description": "In the fresh case, registered at Rahon police station, the duo has been booked under the section 15 of the Environment Protection Act 1986 and 120 B (Criminal conspiracy) of the IPC.", "url": "https://indianexpress.com/article/cities/chandigarh/former-cm-channis-nephew-aide-booked-in-2017-illegal-mining-case-8037789/", "urlToImage": "https://images.indianexpress.com/2022/07/PTI12_04_2021_000111A.jpg", "publishedAt": "2022-07-18T21:29:17Z", "content": "The Punjab Police Monday booked afresh Bhupinder Singh Honey, nephew of former Chief Minister Charanjit Singh Channi, in an illegal mining case related to an earlier case registered against him. Poli… [+3039 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Apurva Vishwanath", "title": "SC Collegium reiterates names of 5 advocates for Allahabad HC judges", "description": "The collegium recommended names of advocates Shishir Jain, Manu Khare, Rishad Murtuza, Dhruv Mathur and Vimlendu Tripathi for the second time. It had first recommended their names in a list of 13 advocates on August 24 last year.", "url": "https://indianexpress.com/article/india/sc-collegium-reiterates-names-of-5-advocates-for-allahabad-hc-judges-8037672/", "urlToImage": "https://images.indianexpress.com/2022/07/supreme-court.jpeg", "publishedAt": "2022-07-18T20:46:49Z", "content": "The Supreme Court collegium headed by Chief Justice of India N V Ramana has reiterated its recommendations to appoint five advocates as judges of Allahabad High Court.A notification on Monday said th… [+1134 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "HC dismisses plea seeking grounding of SpiceJet flights over glitches", "description": "The division bench of Chief Justice Satish Chandra Sharma and Justice Subramonium Prasad said the Aircraft Act provides for a robust mechanism for aircraft industry and the court cannot stop an airline from operating on the basis of the averments made in the …", "url": "https://indianexpress.com/article/business/aviation/hc-dismisses-plea-seeking-grounding-of-spicejet-flights-over-glitches-8037752/", "urlToImage": "https://images.indianexpress.com/2022/07/Spicejet-file-photo-1.jpg", "publishedAt": "2022-07-18T20:41:44Z", "content": "The Delhi High Court Monday rejected a petition seeking directions to stop operations of SpiceJet in wake of the rising number of air safety incidents with the low-cost airline. The court said the DG… [+169 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "Rupee slides to 80/$ in intra-day trade, closes at record low of 79.98", "description": "The rupee had opened strong at 79.75 but fell again towards the 80 level, this time on the back of a supportive range from crude as Brent breached $100 per barrel on less chance of recession in US.", "url": "https://indianexpress.com/article/business/market/rupee-intra-day-trade-closes-record-low-8037700/", "urlToImage": "https://images.indianexpress.com/2022/07/money-4-1.jpg", "publishedAt": "2022-07-18T20:10:06Z", "content": "The rupee on Monday touched the psychological level of 80 per dollar, but closed just below that mark at 79.98, amid foreign fund outflows and the rise in crude oil prices.The rupee had opened strong… [+2572 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "‘GST on household items based on GoM suggestion’", "description": "Government sources stated that the incidence of tax has not turned higher than the pre-GST regime.", "url": "https://indianexpress.com/article/business/economy/gst-on-household-items-based-on-gom-suggestion-8037695/", "urlToImage": "https://images.indianexpress.com/2022/07/GST-news-1200-2-1.jpg", "publishedAt": "2022-07-18T19:59:01Z", "content": "The recent rate changes taken in the 47th Goods and Services Tax (GST) Council meeting were based on the recommendations of a Group of Ministers. The GoM consisted of members from seven states and th… [+2508 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "5 held for stealing data of share trading company, duping customers of Rs 3.58 cr", "description": "An FIR was registered in the case on June 23 on a complaint by the company.", "url": "https://indianexpress.com/article/cities/mumbai/5-held-for-stealing-data-of-share-trading-company-duping-customers-of-rs-3-58-crore-8037664/", "urlToImage": "https://images.indianexpress.com/2022/07/crime.jpg", "publishedAt": "2022-07-18T18:58:13Z", "content": "OFFICIALS FROM the cyber police of Mumbai Crime Branch arrested five people, including three former employees of a share trading company, for allegedly stealing customer data and duping three of thei… [+52 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Cong Kerala chief makes derogatory remarks, apologises", "description": "Sudhakaran apologised later in the night. He said, “When a comment was made about a person (Mani) who had insulted several people, I reacted emotionally. I don’t want to justify it.”", "url": "https://indianexpress.com/article/cities/thiruvananthapuram/cong-kerala-chief-makes-derogatory-remarks-apologises-8037658/", "urlToImage": "https://images.indianexpress.com/2022/03/nodal-sudhakar-2col.jpg", "publishedAt": "2022-07-18T18:47:47Z", "content": "Congress’s Kerala unit chief K Sudhakaran on Monday justified a Mahila Congress protest march in the state capital with a cut-out of a chimpanzee on senior CPI(M) leader M M Manis face and said that … [+28 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Maken moves HC against Kartikeya Sharma’s win in RS polls", "description": "Speaking to reporters outside the High Court, Maken said he was challenging Sharma's victory because a vote cast by an Independent MLA, which should have been declared invalid, was accepted as valid.", "url": "https://indianexpress.com/article/cities/chandigarh/maken-moves-hc-against-kartikeya-sharmas-win-in-rs-polls-8037646/", "urlToImage": "https://images.indianexpress.com/2022/07/ajay-maken-1200.jpg", "publishedAt": "2022-07-18T18:42:46Z", "content": "Senior Congress leader Ajay Maken Monday moved the Punjab and Haryana High Court, challenging BJP-JJP backed Independent candidate Kartikeya Sharma‘s victory in last month’s Rajya Sabha polls. Sharma… [+2165 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Police bust 3 LeT terror modules in Jammu, arrest 6", "description": "One module was busted in Jammu and two in Rajouri, Jammu Additional Director General of Police Mukesh Singh said. Three militants, one each from Jammu, Samba and Kathua districts, have been arrested in connection with the Jammu terror module, he added.", "url": "https://indianexpress.com/article/india/police-bust-3-let-terror-modules-in-jammu-arrest-6-8037618/", "urlToImage": "https://images.indianexpress.com/2022/04/Encounter.jpeg", "publishedAt": "2022-07-18T18:05:09Z", "content": "Jammu and Kashmir Police on Monday busted three terror modules, arresting six Lashkar-e-Toiba militants and seizing arms, ammunition and explosives from different parts of Jammu province on the basis… [+3555 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Ajit Pawar asks Shinde, Fadnavis to not engage in ‘revenge politics’", "description": "The meeting comes in the backdrop of the Shinde-Fadnavis government reversing policy decisions of the earlier MVA government.", "url": "https://indianexpress.com/article/cities/mumbai/ajit-pawar-asks-shinde-fadnavis-to-not-engage-in-revenge-politics-8037615/", "urlToImage": "https://images.indianexpress.com/2022/07/Pawar-Shinde.jpg", "publishedAt": "2022-07-18T17:51:57Z", "content": "An NCP delegation led by Leader of Opposition Ajit Pawar met Chief Minister Eknath Shinde and Deputy Chief Minister Devendra Fadnavis asking them not to engage in “revenge politics”.\r\nThe meeting com… [+2950 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "After Presidential polls, stage set for cabinet expansion in Maharashtra", "description": "A few insiders were quick to cite the example of the previous Maha Vikas Aghadi (MVA) government which took three months to form the cabinet after assuming power in 2019.", "url": "https://indianexpress.com/article/cities/mumbai/presidential-polls-cabinet-expansion-maharashtra-8037515/", "urlToImage": "https://images.indianexpress.com/2022/07/eknath-4.jpg", "publishedAt": "2022-07-18T17:01:31Z", "content": "With Presidential elections concluding on Monday, the stage is now set for cabinet expansion in Maharashtra. Although the final date for the exercise is still under discussion, insiders in the BJP sa… [+3108 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Lewandowski credits Xavi for ‘easy’ decision on Barcelona move", "description": "Lewandowski, who had 12 months remaining on his Bayern contract, moved to Barcelona in a deal worth 45 million euros ($45.84 million) and has joined the team on their U.S. pre-season tour.", "url": "https://indianexpress.com/article/sports/football/lewandowski-credits-xavi-for-easy-decision-on-barcelona-move-8037529/", "urlToImage": "https://images.indianexpress.com/2022/07/Lewa-Barca.jpg", "publishedAt": "2022-07-18T16:13:27Z", "content": "Polish striker Robert Lewandowski has hailed Barcelona coach Xavi as the main reason for his move to the LaLiga club, saying the former midfielder’s ideas and methods painted an “amazing future” for … [+1713 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Sylvester Stallone criticises producer Irwin Winkler over Rocky franchise ownership dispute", "description": "Sylvester Stallone has once again voiced his frustrations regarding his lack of ownership over the popular film franchises he helped conceive.", "url": "https://indianexpress.com/article/entertainment/hollywood/sylvester-stallone-criticises-producer-irwin-winkler-over-rocky-franchise-ownership-dispute-8037513/", "urlToImage": "https://images.indianexpress.com/2022/07/sly1200.jpg", "publishedAt": "2022-07-18T16:11:35Z", "content": "Veteran action star Sylvester Stallone has called out Irwin Winkler, the producer behind the ”Rocky” films and its sequel series ”Creed”, for allegedly denying him the rights to the franchise for alm… [+2570 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "‘What about climate change?’: Kylie Jenner, Travis Scott face criticism for flaunting private jets", "description": "\"This is completely obnoxious and out of touch,\" a user commented on her post", "url": "https://indianexpress.com/article/lifestyle/life-style/kylie-jenner-travis-scott-backlash-private-jets-environment-climate-change-wealth-8036193/", "urlToImage": "https://images.indianexpress.com/2022/07/kylie-travis.jpg", "publishedAt": "2022-07-18T16:10:08Z", "content": "Kylie Jenner took to Instagram recently to share a love-filled monochrome picture with Travis Scott as they share a hug, standing between two private jets. Their oldest kid Stormi Webster, too, can b… [+1980 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Entertainment Desk", "title": "বানানে অষ্টরম্ভা! চরম ট্রোলড ‘গাঁটছড়া’, প্রোমো নিয়ে হুলুস্থূল কাণ্ড!", "description": "'ভালবাসা পরে বোঝাবেন, আগে বানান ঠিক করুন', চরম কটাক্ষ নেটদুনিয়ার।", "url": "https://bengali.indianexpress.com/entertainment/television/spelling-mistake-in-gaatchoras-new-promo-netizens-trolled-470899/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/gaatchora.jpg", "publishedAt": "2022-07-18T15:21:07Z", "content": "‘’ , ! ‘’\r\n ‘’ , , “ ” !\r\n , , “ , ” - - ?\r\n[ : ?]\r\n ? , “! ?” , “ , “\r\n[ : .., ]\r\n‘’\r\n , \r\nStay updated with the latest news headlines and all the latest Television news download Indian Express Beng… [+77 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Follow these five tips to make your menstrual days easier", "description": "Feeling mild to heavy pain in thighs, abdomen and lower back during menstruation is normal; find out what you can do about it", "url": "https://indianexpress.com/article/lifestyle/health/five-tips-menstrual-days-health-cleanliness-hygiene-8036373/", "urlToImage": "https://images.indianexpress.com/2022/07/GettyImages-period-pain-hot-compress-1200.jpg", "publishedAt": "2022-07-18T15:20:51Z", "content": "Menstrual cycles, while indicative of the health and well-being of a person, can be exhausting. When you are on your periods, it is normal to feel more tired than ever, along with a certain sense of … [+3530 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuradha Mascarenhas", "title": "Is testing fatigue giving a misleading picture of Covid-19 in Maharashtra?", "description": "While 13.31 lakh cases were reported between January and June, the number of casualties was 2,900. In 2021, 47 lakh cases were reported with 92,005 deaths. In 2020, there were 19.32 lakh cases with 49,521 deaths, according to a Maharashtra health department a…", "url": "https://indianexpress.com/article/cities/pune/testing-fatigue-misleading-picture-covid-19-maharashtra-8037470/", "urlToImage": "https://images.indianexpress.com/2022/03/covid-2-3.jpg", "publishedAt": "2022-07-18T15:18:35Z", "content": "The ratio of COVID-19 deaths vis-a-vis the number of infections in the last six months in Maharashtra has fallen drastically compared to similar ratios over the past two years. While 13.31 lakh cases… [+2618 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mohali civil surgeon inspects pace of work, Aam Aadmi Clinics to be up and running from Aug 15", "description": "Stating further she said that the administration will also be focussing on health education, information and awareness through such clinics. Essential drugs and tests will be made available at the Aam Aadmi Clinics, with diagnostic facilities being provided t…", "url": "https://indianexpress.com/article/cities/chandigarh/mohali-civil-surgeon-inspects-pace-of-work-aam-aadmi-clinics-to-be-up-and-running-from-aug-15-8037440/", "urlToImage": "https://images.indianexpress.com/2020/03/mohalla-clinic-1200-2.jpg", "publishedAt": "2022-07-18T15:07:04Z", "content": "Mohali civil surgeon Dr Adarshpal Kaur on Monday reviewed the progress of work of “Aam Aadmi Clinics” that is coming up at Phase 5, Chhaju Majra Colony and Jandpur village in the district and asked o… [+1866 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "After 2 years of pandemic, PAU to organise offline Kisan Melas across state", "description": "PAU Kisan Mela is held in March and September every year and is the most sought-after event for farmers across the northern region", "url": "https://indianexpress.com/article/cities/ludhiana/2-years-pandemic-pau-organise-offline-kisan-melas-state-8037454/", "urlToImage": "https://images.indianexpress.com/2022/07/PAU-kisan-mela.jpg", "publishedAt": "2022-07-18T14:59:59Z", "content": "After two years of the pandemic, the Punjab Agricultural University (PAU), Ludhiana, is all set to organise offline Kisan Melas (farmers’ fairs) across the state.For the last two years, PAU Kisan Mel… [+1559 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "ভারতের স্বার্থকে ক্ষতিগ্রস্ত করার চেষ্টা চলছে, একযোগে রুখতে দেশবাসীকে আহ্বান প্রধানমন্ত্রীর", "description": "প্রধানমন্ত্রী জানান, গত চার-পাঁচ বছরে দেশের প্রতিরক্ষা ক্ষেত্রে বিদেশ থেকে আমদানি ২১ শতাংশ কমেছে।", "url": "https://bengali.indianexpress.com/general-news/attempts-of-forces-to-harm-indias-interests-must-be-thwarted-470888/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/modi-5.jpg", "publishedAt": "2022-07-18T14:58:39Z", "content": ", , ‘ ’\r\n , , ‘ , ’\r\n - , \r\n , - \r\n , - \r\nRead full story in English\r\nStay updated with the latest news headlines and all the latest General news download Indian Express Bengali App.\r\nWeb Title: Atte… [+55 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "SC stays Karnataka HC order against ACB: ‘Irrelevant’ in bail plea hearing", "description": "The issue of the ACB’s conduct had come up when the High Court was hearing the bail plea of a personal assistant of the Bengaluru (Urban) DC, who was recently arrested by the bureau.", "url": "https://indianexpress.com/article/cities/delhi/sc-stays-karnataka-hc-order-acb-bail-plea-8037428/", "urlToImage": "https://images.indianexpress.com/2022/07/supreme-court-sc-bloomberg-1200.jpg", "publishedAt": "2022-07-18T14:40:23Z", "content": "The Supreme Court Monday stayed a Karnataka High Court order censuring the state polices Anti-Corruption Bureau (ACB) and calling for service records of officers, pointing to irrelevant observations.… [+1998 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "La Ganesan takes oath as Bengal governor", "description": "Ganesan, who is also the governor of Manipur, has been given the additional charge of West Bengal.", "url": "https://indianexpress.com/article/cities/kolkata/la-ganesan-oath-bengal-governor-8037391/", "urlToImage": "https://images.indianexpress.com/2022/07/laganes.jpg", "publishedAt": "2022-07-18T14:23:12Z", "content": "La Ganesan on Monday evening took oath as the new governor of West Bengal following the resignation of Jagdeep Dhankhar, who has been nominated by the National Democratic Alliance (NDA) as its vice p… [+102 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "You’re the most competitive bloke I’ve ever played against: Virat Kohli on Stokes’ ODI retirement", "description": "The internet was abuzz soon as plaudits and congratulatory messages poured in from all corners of the world with India's Virat Kohli among the first to wish Stokes.", "url": "https://indianexpress.com/article/sports/cricket/ben-stokes-odi-retirement-reactions-virat-kohli-8037151/", "urlToImage": "https://images.indianexpress.com/2022/07/Kohli-Stokes-2.jpg", "publishedAt": "2022-07-18T14:05:59Z", "content": "England all-rounder Ben Stokes will quit one-day internationals following Tuesday’s match against South Africa, the country’s cricket board said in a statement.“I will play my last game for England i… [+2129 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "‘আমি বিজেপির বিধায়ক নই’, ভোলবদল মুকুল রায়ের", "description": "এসবের মধ্যেই সোমবার রাষ্ট্রপতি নির্বাচনে ভোট দিতে বিধানসভায় এসেছিলেন মুকুল রায়। সেখানে পদ্ম-ফুলের এই প্রবীণতম বিধায়কের দাবি ঘিরে ফের বিভ্রান্তি তৈরি হল।", "url": "https://bengali.indianexpress.com/west-bengal/i-am-not-a-bjp-mla-mukul-roy-said-after-voting-for-presidential-election-2022/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/mukul-roy-1.jpg", "publishedAt": "2022-07-18T13:55:00Z", "content": ", - - \r\n ? ? ‘ ’ ? , ‘ ’\r\n , ? , ‘ ’\r\n , ‘ , ’\r\n -- -, \r\n - - , , \r\n , ‘ ’ , ‘ ’ , , , \r\n -\r\nStay updated with the latest news headlines and all the latest Westbengal news download Indian Express Ben… [+93 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Maharashtra: Two NEET aspirants claim Washim college got them to remove burkha and hijab; approach cops", "description": "Some aggrieved parents have complained to the police and a probe was underway, a police official said, adding that at least two Muslim girls have approached the police.", "url": "https://indianexpress.com/article/cities/mumbai/maharashtra-neet-aspirants-washim-college-burkha-hijab-8037332/", "urlToImage": "https://images.indianexpress.com/2022/07/NEET-rep.jpg", "publishedAt": "2022-07-18T13:49:22Z", "content": "Some Muslim girls have claimed they were made to remove their burkha and hijab when they reached an examination centre to appear for the National Eligibility cum Entrance Test (UG) in Maharashtra’s W… [+1977 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Monsoon session: Here is the list of Bills to be introduced in Parliament", "description": "The Bills listed include the Cantonment Bill, the Multi-State Cooperative Societies (Amendment) Bill and the Insolvency and Bankruptcy Code (Amendment) Bill.", "url": "https://indianexpress.com/article/india/parliament-monsoon-session-bills-to-be-introduced-8037281/", "urlToImage": "https://images.indianexpress.com/2022/07/Parl.jpg", "publishedAt": "2022-07-18T13:46:30Z", "content": "However, proceedings were adjourned in both Lok Sabha and Rajya Sabha by afternoon amid protests by the Opposition over inflation, GST rate hikes, price rise and the Agnipath scheme.\r\nBoth the Houses… [+2383 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Vice Presidential Candidate Jagdeep Dhankhar Files Nomination In Presence Of Narendra Modi", "description": "", "url": "https://indianexpress.com/videos/news-video/vice-presidential-candidate-jagdeep-dhankhar-files-nomination-in-presence-of-narendra-modi/", "urlToImage": "https://images.indianexpress.com/2022/07/Vice-Presidential-Elections-YT.jpg", "publishedAt": "2022-07-18T13:46:02Z", "content": "Sharad Pawar, Mulayam Singh Cast Votes For President Poll At Parliament"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Sanitation Worker Seen Carrying Pictures Of Narendra Modi, Yogi Adityanath In Garbage Cart; Fired", "description": "", "url": "https://indianexpress.com/videos/news-video/sanitation-worker-seen-carrying-pictures-of-narendra-modi-yogi-adityanath-in-garbage-cart-fired/", "urlToImage": "https://images.indianexpress.com/2022/07/Narendra-Modi.jpeg", "publishedAt": "2022-07-18T13:37:51Z", "content": "Sharad Pawar, Mulayam Singh Cast Votes For President Poll At Parliament"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "ICSE Toppers 2022: Meet Pushkar Tripathi, Who Secured A Joint Top Spot", "description": "", "url": "https://indianexpress.com/videos/news-video/icse-toppers-2022-meet-pushkar-tripathi-who-secured-a-joint-top-spot/", "urlToImage": "https://images.indianexpress.com/2022/07/ICSE-Results-2022-YT-copy.jpg", "publishedAt": "2022-07-18T13:33:48Z", "content": "Sharad Pawar, Mulayam Singh Cast Votes For President Poll At Parliament"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Michelle Yeoh-starrer Everything Everywhere All at Once to release in India", "description": "Everything Everywhere All at Once will be released in India by Mumbai-based Impact Films, a leading distributor of foreign language movies in the subcontinent.", "url": "https://indianexpress.com/article/entertainment/hollywood/michelle-yeoh-starrer-everything-everywhere-all-at-once-to-release-in-india-8036826/", "urlToImage": "https://images.indianexpress.com/2022/07/Everything-Everywhere-1200by667.jpg", "publishedAt": "2022-07-18T13:30:49Z", "content": "American absurdist comedy drama Everything Everywhere All at Once, starring renowned actor Michelle Yeoh, will be released in Indian theatres soon.Written and directed by Daniel Kwan and Daniel Schei… [+1659 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Divya A", "title": "New podcast series highlights the cultural connect between India and Pakistan", "description": "In each episode, the interviewee will share anecdotes and their experience with regard to the changes they have seen in India and Pakistan, and how they derive inspiration from their counterparts from across the border", "url": "https://indianexpress.com/article/lifestyle/art-and-culture/border-podcast-series-cultural-connect-india-pakistan-8037160/", "urlToImage": "https://images.indianexpress.com/2022/07/Sunidhi-Chauhan-Varun-Grover-1200.jpg", "publishedAt": "2022-07-18T12:50:05Z", "content": "A new podcast series, titled ‘Baat Sarhad Paar: Conversations across border‘, brings together eminent personalities from the world of art, music and literature from India and Pakistan, as the two cou… [+2796 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Commodity prices today, July 18, 2022: Prices of key vegetables and pulses in major cities", "description": "Commodity prices today news update: Urad dal remained the most expensive pulse in the national capital on Monday.", "url": "https://indianexpress.com/article/business/commodities/commodity-prices-today-july-18-2022-delhi-mumbai-kolkata-chennai-guwahati-8037104/", "urlToImage": "https://images.indianexpress.com/2022/07/retail-inflation-vegetable-express-archieve-1200-1.jpg", "publishedAt": "2022-07-18T12:27:30Z", "content": "Vegetables and pulses price today: Urad dal was the most expensive pulse in the national capital on Monday, July 18, 2022. It was retailing at Rs 115 per kg, as per the data available on the Departme… [+1257 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shamik Chakrabarty", "title": "Rishabh Pant, Hardik Pandya heroics mask India’s batting frailties", "description": "The top order looked jittery in England, and Virat Kohli’s form slump has further weakened a line-up with a wafer-thin tail, with the T20 World Cup months away.", "url": "https://indianexpress.com/article/sports/cricket/rishabh-pant-hardik-pandya-heroics-mask-indias-batting-frailties-8037215/", "urlToImage": "https://images.indianexpress.com/2022/07/INDIA-Batters.jpg", "publishedAt": "2022-07-18T12:26:12Z", "content": "With the gift of timing, Sourav Ganguly was quick to congratulate the Indian team after their 2-1 ODI series win against England. Super performance in england ..not easy in their country ..2-2 test .… [+5424 chars]"}]}