{"status": "ok", "totalResults": 375, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Pranav Mukul", "title": "IndiGo: DGCA to send probe team to Ranchi and Hyderabad", "description": "On Monday, a day after the incident came to light, Union Civil Aviation Minister Jyotiradtiya Scindia tweeted that he would personally probe the incident even as the national child rights panel asked Jharkhand Police to lodge a case against the airline.", "url": "https://indianexpress.com/article/business/aviation/indigo-dgca-to-send-probe-team-to-ranchi-and-hyderabad-7909007/", "urlToImage": "https://images.indianexpress.com/2022/05/indigo-1200-1.jpg", "publishedAt": "2022-05-10T00:34:10Z", "content": "THE DIRECTORATE General of Civil Aviation (DGCA) will depute a three-member fact-finding team to probe Saturday’s incident at the Ranchi airport, where IndiGo staff allegedly denied boarding to a spe… [+4192 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Serivce", "title": "Karnataka CM Bommai to visit Delhi today amid of cabinet rejig speculation", "description": "According to the Chief Minister's office Bommai will be travelling to Delhi on Tuesday morning 8 am and his return schedule to Bengaluru on Wednesday has been kept 'open'.", "url": "https://indianexpress.com/article/cities/bangalore/karnataka-cm-bommai-to-visit-delhi-today-amid-of-cabinet-rejig-speculation-7909055/", "urlToImage": "https://images.indianexpress.com/2022/04/Basavaraj-Bommai-2-1-1-1.jpeg", "publishedAt": "2022-05-10T00:20:35Z", "content": "Karnataka chief minister Basavaraj Bommai on Tuesday morning traveling to New Delhi amid rof speculation on cabinet reshuffle in the BJP government in the state. According to the Chief Minister’s off… [+1556 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Serivce", "title": "Govt should implement law on MSP: Satyapal Malik", "description": "Malik was addressing lawyers at a programme organised by the Meerut Bar Association at the District Collectorate on Monday afternoon.", "url": "https://indianexpress.com/article/cities/lucknow/govt-should-implement-law-on-msp-satyapal-malik-7909045/", "urlToImage": "https://images.indianexpress.com/2018/08/satyapal-singh1.jpg", "publishedAt": "2022-05-10T00:08:02Z", "content": "Meghalaya Governor Satyapal Malik Monday said the farmers’ agitation might have ended but their movement is still on and if the government did not implement a law on Minimum Support Price (MSP), the … [+78 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Serivce", "title": "Industrial investment push: Ground-breaking ceremony on June 3, PM may attend", "description": "Chief Minister Yogi Adityanath held a meeting with senior officials on Monday and issued instructions to make the ceremony a grand affair, sources said.", "url": "https://indianexpress.com/article/cities/lucknow/industrial-investment-push-ground-breaking-ceremony-on-june-3-pm-may-attend-7909049/", "urlToImage": "https://images.indianexpress.com/2022/05/modi-7-1-1.jpg", "publishedAt": "2022-05-09T23:55:40Z", "content": "THE UTTAR Pradesh government is set to organise its third ground-breaking ceremony on June 3. Prime Minister Narendra Modi is expected to attend the proposed event at Lucknow. Chairmen, CEOs, directo… [+1956 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Atri Mitra", "title": "Eye on expansion, Abhishek set to open Assam TMC headquarters", "description": "Sources in the TMC said that because of Sushmita Dev, the former president of Mahila Congress who joined the party last year, the party could expect a strong performance in the state's Cachar and Silchar areas.", "url": "https://indianexpress.com/article/cities/kolkata/eye-on-expansion-abhishek-set-to-open-assam-tmc-headquarters-7909040/", "urlToImage": "https://images.indianexpress.com/2022/03/ABHISHEK-BANERJEE.jpg", "publishedAt": "2022-05-09T23:50:21Z", "content": "The Trinamool Congress (TMC) revived its organisational set-up in Assam last year and has seen some high-profile names join since then. Now, to consolidate its presence in the state, the party has se… [+2044 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Serivce", "title": "Gyanvapi case: Hearing on replacement of court-appointed official to continue today", "description": "On Saturday, the Anjuman Intezamia Masjid Committee filed an application in the court seeking the replacement of Advocate Commissioner Ajai Kumar, accusing him of being “biased”.", "url": "https://indianexpress.com/article/cities/lucknow/gyanvapi-case-hearing-on-replacement-of-court-appointed-official-to-continue-today-7909048/", "urlToImage": "https://images.indianexpress.com/2022/05/Gyanvapi-Mosque-1.jpg", "publishedAt": "2022-05-09T23:50:01Z", "content": "THE HEARING regarding the replacement of a court-appointed Advocate Commissioner for the survey of Kashi Vishwanath Temple-Gyanvapi Mosque complex continued in a Varanasi court on Monday, with the co… [+1853 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Fraud case: Bank manager, trader get five-year jail term", "description": "The Judge also slapped Rs.57,000 and Rs.51,000 fines on Chanda and Chatterjee, respectively.", "url": "https://indianexpress.com/article/cities/kolkata/fraud-case-bank-manager-trader-get-five-year-jail-term-7909039/", "urlToImage": "https://images.indianexpress.com/2022/04/ARREST-1-5-3-6.jpg", "publishedAt": "2022-05-09T23:43:28Z", "content": "A special Judge for CBI cases in Alipore has handed down five years of simple imprisonment to Debatosh Chanda, then branch manager of Bank of Maharashtra, New Alipore Branch, Kolkata, and Indrajit Ch… [+620 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Serivce", "title": "CM: Insult to people of Bengal that stolen Nobel medal not found yet", "description": "The medal and citation were found stolen from the safety vault of the Visva Bharati museum on March 25, 2004. The then Buddhadeb Bhattacharjee-led government had promptly handed over the case to the CBI which closed the probe into the matter in 2009.", "url": "https://indianexpress.com/article/cities/kolkata/cm-insult-to-people-of-bengal-that-stolen-nobel-medal-not-found-yet-7909042/", "urlToImage": "https://images.indianexpress.com/2022/05/mamata-759-1-1-1-5.jpg", "publishedAt": "2022-05-09T23:37:11Z", "content": "West Bengal Chief Minister Mamata Banerjee on Monday said that it was a big insult to the people of the state that Rabindranath Tagore’s stolen Nobel Prize medallion could not be recovered by the CBI… [+2392 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Serivce", "title": "Ahmedabad: Engineering firm employee booked for ‘corporate espionage’", "description": "According to police, an FIR was lodged against Rajnikant Patel, deputy manager at “Heat Department” of AIA Engineering, an Ahmedabad-based company for allegedly sending confidential documents related to R&D related to heat treatment to a rival company of AIA …", "url": "https://indianexpress.com/article/cities/ahmedabad/engineering-firm-employee-booked-for-corporate-espionage-7909034/", "urlToImage": "https://images.indianexpress.com/2022/05/arrest-1.jpeg", "publishedAt": "2022-05-09T23:19:44Z", "content": "The Ahmedabad Cyber Crime Cell has booked an employee of AIA Engineering Limited, a giant in high chromium wear castings, for alleged corporate espionage by divulging secret research and development … [+1965 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Serivce", "title": "Swaminarayan conflict: Warring groups agree to attempt compromise; to meet on May 12", "description": "The meeting, held at the Mediation Centre of the Gujarat High Court, was attended by Prabodh Swami and Premswaroop Swami—the two leaders of the conflicting groups—in the presence of their advocates.", "url": "https://indianexpress.com/article/cities/ahmedabad/swaminarayan-conflict-warring-groups-agree-to-attempt-compromise-to-meet-on-may-12/", "urlToImage": "https://images.indianexpress.com/2022/05/express-5-6.jpg", "publishedAt": "2022-05-09T23:16:00Z", "content": "The two warring factions of the Akshar Purushottam Swami Temple at Sokhda in Vadodara Monday held a preliminary meeting ahead of the arbitration in presence of retired Bombay High Court Chief Justice… [+1691 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Serivce", "title": "‘Depleted’ Cong huddles all MLAs for Rahul Gandhi’s meet in Dahod today", "description": "Gandhi will address the \"Adivasi Satyagraha Rally\" around 11 am Tuesday at Navjivan Arts and Commerce College Ground in Dahod and then chair a meeting with all Congress MLAs at Swami Vivekanand Sankul in Govind Nagar of Dahod at 1:30 pm.", "url": "https://indianexpress.com/article/cities/ahmedabad/depleted-cong-huddles-all-mlas-for-rahul-gandhis-meet-in-dahod-today-7909030/", "urlToImage": "https://images.indianexpress.com/2022/04/RAGA-1.jpeg", "publishedAt": "2022-05-09T23:11:20Z", "content": "Amid factionalism, infighting and constant defection, the Gujarat Congress has huddled its 64 remaining MLAs in Dahod to welcome senior leader Rahul Gandhi who will be on a day-long visit to the stat… [+2907 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Serivce", "title": "Woman, daughter found dead in Tapi river", "description": "According to police, the woman identified as Dipali Sagar Devey (25), a resident of Dindoli area in Surat and a native of Buldana district in Maharashtra, left home on May 6 afternoon with her one-and-a-half-year-old daughter Krisha, without informing her hus…", "url": "https://indianexpress.com/article/cities/ahmedabad/woman-daughter-found-dead-in-tapi-river-7909026/", "urlToImage": "https://images.indianexpress.com/2022/05/dead-4.jpg", "publishedAt": "2022-05-09T23:06:56Z", "content": "Surat: A 25-year-old woman and and her minor daughter were found dead in Tapi river Sunday with Rander police lodging a complaint of accidental death. According to police, the woman identified as Dip… [+1181 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Serivce", "title": "Gujarat govt offers Rs 130-cr aid to onion farmers", "description": "Farmers who have sold onions to any APMCs since April 1 this year will now get Rs 2 assistance from the state government for every kilogram of the crop they sold.", "url": "https://indianexpress.com/article/cities/ahmedabad/gujarat-govt-offers-rs-130-cr-aid-to-onion-farmers-7909029/", "urlToImage": "https://images.indianexpress.com/2018/06/farmer-1200.jpg", "publishedAt": "2022-05-09T23:05:54Z", "content": "Gandhinagar: The Gujarat government has made a special provision of Rs 130 crore to provide financial assistance to onion farmers in the state, Agriculture Minister Raghavji Patel said Monday.Farmers… [+927 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Kharif 2022: State will need 19.95 lakh MT of fertilisers", "description": "Being an election year, the state government has ensured that there is no escalation in cost of fertilisers.", "url": "https://indianexpress.com/article/cities/ahmedabad/kharif-2022-state-will-need-19-95-lakh-mt-of-fertilisers-7909028/", "urlToImage": "https://images.indianexpress.com/2021/09/kharif-2.jpg", "publishedAt": "2022-05-09T23:01:22Z", "content": "Despite the stress on natural farming, it is estimated that farmers in Gujarat will require 19.95 lakh metric tonnes (MT) of chemical fertilisers for Kharif season 2022 that will be almost 19 per cen… [+1478 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Serivce", "title": "BJP MLA uses LAD fund to buy new ortho machines for hospital", "description": "Patel came to know the hospital was in need of an IITV machine during a meeting with the hospital authorities to decide the best possible usage of the MLA-LAD fund.", "url": "https://indianexpress.com/article/cities/ahmedabad/bjp-mla-uses-lad-fund-to-buy-new-ortho-machines-for-hospital-7909027/", "urlToImage": "https://images.indianexpress.com/2022/04/money-2.jpg", "publishedAt": "2022-05-09T22:57:21Z", "content": "Surat: Bharatiya Janata Party (BJP) MLA from Udhna, Vivek Patel, has donated Rs 25 lakh from his MLA-Local Area Development fund (MLA-LAD) to Surats New Civil Hospital (NCH) to help them buy two late… [+966 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Serivce", "title": "Vasant Bhatol quits Congress to rejoin BJP", "description": "Addressing media persons, Vasant said that by doing 'ghar wapsi' to BJP he was correcting a mistake committed a few years back.", "url": "https://indianexpress.com/article/cities/ahmedabad/vasant-bhatol-quits-congress-to-rejoin-bjp-7909025/", "urlToImage": "https://images.indianexpress.com/2022/05/bjp-1-1.jpg", "publishedAt": "2022-05-09T22:45:16Z", "content": "Former MLA and Congress leader from North Gujarat Vasant Bhatol rejoined the Bharatiya Janata Party (BJP) on Monday, in the presence of party president C R Paatil at state party headquarters Shree Ka… [+896 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Khambhat clashes on Ram Navami: Four Muslim residents seek transfer of probe to CID or CBI, compensation", "description": "The petitioners — Vasimbhai Vora (35), Imtiyazbhai Vora (41), Shakirhussein Shaikh (35) and Ismailbhai Vora (64) — submitted that the violence resulted in the looting and burning of four cabin shops, one shop, one building and one house, and that a dargah was…", "url": "https://indianexpress.com/article/cities/ahmedabad/khambhat-clashes-on-ram-navami-four-muslim-residents-seek-transfer-of-probe-to-cid-or-cbi-compensation-7909022/", "urlToImage": "https://images.indianexpress.com/2022/04/Ram-navami-violence.jpg", "publishedAt": "2022-05-09T22:39:02Z", "content": "Four Muslim residents of Khambhat in Anand, whose houses and shops were damaged in the communal clashes during a Ram Navami procession, have moved the Gujarat High Court seeking transfer of probe to … [+3060 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Assault allegations: Gujarat HC refuses to quash plea against Sanjiv Bhatt, Zala", "description": "Refusing to quash the criminal complaint, the court, however, stayed the operation of the verdict for 12 weeks so as to permit Bhatt and Zala to approach a higher forum to appeal against the verdict.", "url": "https://indianexpress.com/article/cities/ahmedabad/assault-allegations-gujarat-hc-refuses-to-quash-plea-against-sanjiv-bhatt-zala-7909024/", "urlToImage": "https://images.indianexpress.com/2022/02/Gujarat-HC-1-1-2.jpg", "publishedAt": "2022-05-09T22:33:28Z", "content": "The Gujarat High Court has refused to quash a private complaint by Mahesh Chitroda who had alleged custodial torture by former IPS officer Sanjiv Bhatt and then constable Pravinsinh Zala. The HC reas… [+3699 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Divya A", "title": "Day after LG Manoj Sinha prays at protected J&K temple, ASI expresses concern", "description": "The ASI, which is the custodian of the protected monument, “deemed the incident as a violation of its rules” in its communication to the administration but has not lodged a formal complaint, the sources said.", "url": "https://indianexpress.com/article/india/day-after-lg-manoj-sinha-prays-at-protected-jk-temple-asi-expresses-concern-7908968/", "urlToImage": "https://images.indianexpress.com/2022/05/sinha.jpg", "publishedAt": "2022-05-09T22:30:59Z", "content": "The ASI, which is the custodian of the protected monument, deemed the incident as a violation of its rules in its communication to the administration but has not lodged a formal complaint, the source… [+1831 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shubhra Gupta", "title": "Don’t step back", "description": "Centre’s plan to relook at sedition law is welcome but Supreme Court must take the review process to its logical conclusion", "url": "https://indianexpress.com/article/opinion/editorials/dont-step-back-7908823/", "urlToImage": "https://images.indianexpress.com/2022/05/editorial-1-1.jpeg", "publishedAt": "2022-05-09T22:30:53Z", "content": "After it upheld the sedition law in 1962, the Supreme Courts decision to revisit the constitutional validity of this colonial provision is a crucial inquiry. Section 124A of the Indian Penal Code, wh… [+2823 chars]"}]}