{"status": "ok", "totalResults": 467, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "‘Your thoughts determine your frequency’: Sofia Khaledi", "description": "“It’s not about how life treats you, it’s about what you think of how it should treat you.”", "url": "https://indianexpress.com/article/lifestyle/life-positive/thoughts-frequency-sofia-khaledi-motivational-life-positive-8013017/", "urlToImage": "https://images.indianexpress.com/2022/07/Pixabay-happiness-1200.jpg", "publishedAt": "2022-07-07T02:50:15Z", "content": "In her speech, Sofia Khaledi talks about how ones perspective of life plays a role in the formation and progression of his/her life. Happiness is lots of joy, contentment, or well-being. But is that … [+1020 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Apple to add ‘lockdown’ mode on iPhones, iPads, Macs against spyware", "description": "Apple said it will roll out a \"lockdown\" option for iPhones, iPads and Mac computers intended to protect against spyware unleashed by state-sponsored hackers", "url": "https://indianexpress.com/article/technology/mobile-tabs/apple-to-add-lockdown-mode-on-iphones-ipads-macs-against-spyware-8013828/", "urlToImage": "https://images.indianexpress.com/2022/07/Apple_AP_1.jpg", "publishedAt": "2022-07-07T02:34:00Z", "content": "Apple said it will roll out a “lockdown” option for iPhones, iPads and Mac computers intended to protect against spyware unleashed by state-sponsored hackers although enabling that protection will al… [+3522 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Raakhi Jagga", "title": "As CM Bhagwant Mann is congratulated, unknown Dr Gurpreet Kaur thanks everyone", "description": "While Twitter was abuzz with congratulatory messages, some didn't shy away from taking potshots. Youth Congress leader Brinder Singh Dhillon in a tweet mentioned AAP's slogan “Ik mauka hor”.", "url": "https://indianexpress.com/article/cities/ludhiana/bhagwant-mann-wedding-dr-gurpreet-kaur-twitter-8013833/", "urlToImage": "https://images.indianexpress.com/2022/07/bhagwant.jpg", "publishedAt": "2022-07-07T02:32:28Z", "content": "As news of Punjab CM Bhagwant Mann’s second wedding scheduled for Thursday broke, congratulatory messages started pouring in from politicians of AAP, Congress and BJP.While this was expected, somethi… [+2122 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Karnataka CM Bommai calls for survey of flood-prone areas to shift residents", "description": "Deputy commissioners of the affected districts were instructed to take up rescue and relief works immediately and those residing in low-lying areas would be shifted to safer places, said Bommai.", "url": "https://indianexpress.com/article/cities/bangalore/karnataka-cm-bommai-flood-prone-areas-survey-8013825/", "urlToImage": "https://images.indianexpress.com/2022/07/Basavaraj-Bommai-2-1-1.jpg", "publishedAt": "2022-07-07T02:31:04Z", "content": "Karnataka Chief Minister Basavaraj Bommai has instructed district authorities to survey the flood-prone coastal areas of the state to assess whether the residents needed to be relocated temporarily o… [+1974 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi: 44k challans issued for violating bus lane discipline enforcement so far", "description": "As per data shared by the department, of the total challans issued till July 4, only 1,591 challans were issued to bus drivers for lane violations, and the remaining 43,003 challans were issued to private vehicle owners for parking in bus lanes.", "url": "https://indianexpress.com/article/cities/delhi/delhi-44k-challans-issued-for-violating-bus-lane-discipline-enforcement-so-far-8013823/", "urlToImage": "https://images.indianexpress.com/2022/07/delhi-bus-1.jpeg", "publishedAt": "2022-07-07T02:28:49Z", "content": "The transport department has challaned a total of 44,594 vehicle drivers over the last two months for violating bus lane discipline enforcement in the capital. As per data shared by the department, o… [+1496 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Bloomberg", "title": "Apple plans extreme sports Watch with larger screen, metal case", "description": "Apple Watch Series 8 extreme sports edition will use a strong metal material rather than aluminum, have a more shatter-resistant screen and include a larger battery compared with standard Apple Watches", "url": "https://indianexpress.com/article/technology/gadgets/apple-plans-extreme-sports-watch-with-larger-screen-metal-case-8013826/", "urlToImage": "https://images.indianexpress.com/2022/07/AppleWatch_Lead.jpeg", "publishedAt": "2022-07-07T02:24:22Z", "content": "Apple Inc. plans its largest smartwatch display to date, a bigger battery and a rugged metal casing as part of the upcoming Apple Watch geared toward extreme sports athletes, according to people with… [+3229 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Raakhi Jagga", "title": "CM Bhagwant Mann: Security up, roads cleaned: Satoj village awaits the newly weds", "description": "A Sangrur-based pediatrician said, “We were initially very excited that she was from here and thought we might have already met her. But soon we got to know that she is from Haryana.", "url": "https://indianexpress.com/article/cities/ludhiana/bhagwant-mann-dr-gurpreet-kaur-wedding-punjab-satoj-village-chandigarh-8013822/", "urlToImage": "https://images.indianexpress.com/2022/07/bhagwant-mann-1.jpg", "publishedAt": "2022-07-07T02:23:44Z", "content": "On Wednesday afternoon when Satoj village in Sunam constituency of Sangrur district saw the news of CM Bhagwant Mann getting married to Dr Gurpreet Kaur on social media, locals couldn’t believe it at… [+1807 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "SGPC lauds Canada move to withdraw its ‘clean shave’ directive", "description": "Toronto’s previous rule stated that security guards in areas where large congregations are held or at homeless shelters must wear an N95 respirator mask.", "url": "https://indianexpress.com/article/cities/amritsar/sgpc-lauds-canada-move-to-withdraw-its-clean-shave-directive-8013818/", "urlToImage": "https://images.indianexpress.com/2022/07/turban.jpg", "publishedAt": "2022-07-07T02:16:07Z", "content": "Shiromani Gurudwara Parbandhak Committee (SGPC) president Harjinder Singh Dhami has lauded the Canadian government for revoking its ‘clean shave’ directive for private security guards on duty.Althoug… [+1085 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "US, UK leaders raise fresh alarms about Chinese espionage", "description": "FBI Director Christopher Wray reaffirmed longstanding concerns in denouncing economic espionage and hacking operations by China as well as the Chinese government's efforts to stifle dissent abroad.", "url": "https://indianexpress.com/article/world/us-uk-leaders-raise-fresh-alarms-about-chinese-espionage-8013788/", "urlToImage": "https://images.indianexpress.com/2020/10/AP20302566293545.jpg", "publishedAt": "2022-07-07T02:16:00Z", "content": "The head of the FBI and the leader of Britain’s domestic intelligence agency raised fresh alarms Wednesday about the Chinese government, warning business leaders that Beijing is determined to steal t… [+4013 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Coronavirus India News Live Updates: Health ministry reduces gap between second and booster doses of Covid-19 vaccine to 6 months", "description": "Coronavirus India, Covid-19 Live News Updates, July 07, 2022: On Wednesday, Union Health Secretary Rajesh Bhushan wrote to the states that a decision has been taken to administer the precaution third dose to the adult population after completion of six months…", "url": "https://indianexpress.com/article/lifestyle/health/coronavirus-india-news-live-covid-cases-today-delhi-mumbai-8013797/", "urlToImage": "https://images.indianexpress.com/2022/07/Covid-19-live.jpg", "publishedAt": "2022-07-07T02:00:23Z", "content": "Covid-19 Live News Updates:  The Union health ministry on Wednesdayreduced the duration between the second dose and the precaution third dose of the Covid-19 vaccine from nine months to six months. O… [+1636 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Divya Goyal", "title": "An Express Investigation- Part 4: No system to keep tabs on open dumping of biomedical waste", "description": "A total of 1,648 healthcare facilities, including government and private hospitals, labs, clinics, nursing homes, etc., are attached with the facility from where the waste is collected every day and processed at Ludhiana plant.", "url": "https://indianexpress.com/article/cities/ludhiana/express-investigation-bio-mecical-waste-municipal-corporation-pollution-8013770/", "urlToImage": "https://images.indianexpress.com/2022/07/bio-medical-waste.jpg", "publishedAt": "2022-07-07T01:58:24Z", "content": "Unlike the citys domestic waste which the Ludhiana Municipal Corporation has failed to process, with its processing plant lying shut for more than a year and more than 21 lakh Metric Tonnes of legacy… [+4076 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Ilayaraja Rajya Sabha nomination: Tamil Nadu Governor, Rajinikanth, Kamal Hassan congratulate music maestro", "description": "Ilayaraja was among four members who were nominated to the Upper House, the others being legendary athlete P T Usha, noted philanthropist Dr Veerendra Heggade and renowned screenwriter K V Vijayendra Prasad.", "url": "https://indianexpress.com/article/cities/chennai/ilayaraja-rajya-sabha-nomination-rajnikanth-kamal-hassan-tamil-nadu-governor-congratulate-8013786/", "urlToImage": "https://images.indianexpress.com/2022/07/ilayaraaja-759.jpeg", "publishedAt": "2022-07-07T01:37:56Z", "content": "Tamil Nadu Governor R N Ravi, and top actors Rajinikanth and Kamal Haasan on Wednesday greeted music maestro Ilayaraaja for being nominated to the Rajya Sabha.The music composer was among four member… [+1134 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Chris Evans to feature with Emily Blunt in Pain Hustlers", "description": "Pain Hustlers film is described as a hilarious, dramatic and wild journey to the corrupt heart of the American dream.", "url": "https://indianexpress.com/article/entertainment/hollywood/chris-evans-to-feature-with-emily-blunt-in-pain-hustlers-8011700/", "urlToImage": "https://images.indianexpress.com/2022/07/Chris-Evans-and-Emily-Blunt-1200by667.jpg", "publishedAt": "2022-07-07T01:30:28Z", "content": "Hollywood star Chris Evans has joined Emily Blunt in Pain Hustlers, a criminal-conspiracy film to be directed by David Yates. Yates, known for directing four films in the Harry Potter series and the … [+1217 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Elon Musk had twins last year with one of his top executives, says report", "description": "The news of the twins' arrival brings billionaire Elon Musk's total count of children to nine.", "url": "https://indianexpress.com/article/world/elon-musk-had-twins-last-year-8013774/", "urlToImage": "https://images.indianexpress.com/2022/07/elon-musk.jpg", "publishedAt": "2022-07-07T01:27:10Z", "content": "Tesla Inc Chief Executive Elon Musk and Shivon Zilis, a top executive at his brain-chip startup Neuralink, had twins in November of 2021, Business Insider reported on Wednesday.In April, Musk and Zil… [+1609 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "AIADMK General Council meet: Madras HC adjourns hearing on O Panneerselvam’s plea", "description": "OPS had earlier filed a civil suit in the HC requesting the court to pass an order of ad-interim injunction restraining the respondents , including Edappadi K Palaniswami (EPS) from convening the GC meet on an anonymous notice dated July 1, 2022 pending dispo…", "url": "https://indianexpress.com/article/cities/chennai/aiadmk-madras-hc-ops-eps-single-leadership-issue-sc-8013775/", "urlToImage": "https://images.indianexpress.com/2022/07/AIADMK-PTI-1.jpeg", "publishedAt": "2022-07-07T01:24:40Z", "content": "The Madras High Court on Wednesday adjourned the hearing into a plea by AIADMK leader O Panneerselvam (OPS) seeking to stall the party’s July 11 General Council meet.Justice Krishnan Ramaswamy posted… [+1233 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Tamil Nadu Covid-19 cases: State records 2,743 new infections, 1,062 in Chennai; active caseload breaches 17,000-mark", "description": "Chennai, Tamil Nadu Covid-19 cases today: Chennai accounted for the majority of new cases with 1,062. Chengalpet reported 403, Coimbatore 127, Vellore 113 while the remaining cases were spread across other districts. Mayiladuthurai recorded the least with two…", "url": "https://indianexpress.com/article/cities/chennai/chennai-covid-cases-today-tamil-nadu-covid-infections-deaths-updates-8013769/", "urlToImage": "https://images.indianexpress.com/2022/07/Mask-Covid-19.jpeg", "publishedAt": "2022-07-07T01:16:58Z", "content": "Tamil Nadu recorded 2,743 new coronavirus cases pushing the statewide tally to 34,90,834 while the death toll remained unchanged at 38,027 as no fatality was registered in the last 24 hours, the heal… [+2021 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sushant Nepta", "title": "Chandigarh: Country’s ‘largest’ bike-sharing system marred by shoddy upkeep", "description": "Currently, Chandigarh has more than 2,500 bicycles, both electric and manual, across 300 plus docking stations.", "url": "https://indianexpress.com/article/cities/chandigarh/countrys-largest-bike-sharing-system-marred-by-shoddy-upkeep-cycling-8013764/", "urlToImage": "https://images.indianexpress.com/2022/07/cycle.jpg", "publishedAt": "2022-07-07T01:06:46Z", "content": "The city that claims to have the largest public bike-sharing system in the country Chandigarh used by an estimated 1,500 people on a daily basis is seemingly struggling with the upkeep and management… [+2460 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Chennai power cut: These areas will face a power cut in Chennai today", "description": "Chennai power disruption July 7, Thursday: Parts of Chennai will face a power cut from 9 am to 2 pm for maintenance work today.", "url": "https://indianexpress.com/article/cities/chennai/chennai-power-cut-these-areas-will-face-a-power-cut-in-chennai-today-8013759/", "urlToImage": "https://images.indianexpress.com/2022/07/electricity-reuters-1200-2-1-5.jpeg", "publishedAt": "2022-07-07T01:03:23Z", "content": "The Tamil Nadu Generation and Distribution Corporation (Tangedco) has announced that power will be suspended in parts of Chennai today in Mylapore, T Nagar, Tambaram, Vysarpadi, Avadi, Ambattur, Poru… [+3802 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Jagdeep Singh Deep", "title": "Punjab: Chief conservator submits inquiry report on illegal felling of 35K trees; babus may face music", "description": "The report had found that the cut trees were sold at 25 per cent lower rates, causing loss to the state exchequer.", "url": "https://indianexpress.com/article/cities/sas-nagar-mohali/chief-conservator-submits-inquiry-report-on-illegal-felling-of-35k-trees-babus-may-face-music-8013755/", "urlToImage": "https://images.indianexpress.com/2022/07/Sangrur.jpg", "publishedAt": "2022-07-07T01:01:55Z", "content": "The Chief Conservator (Forests and Hills), Punjab, Harsh Kumar, submitted an inquiry report on the illegal felling of around 35,000 trees in Bist Doab Canal area to the Vigilance Bureau (VB) and the … [+1594 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Hina Rohtaki", "title": "Chandigarh Rains: Final adieus become tough as rain floods cremation ground", "description": "Leader of Opposition, Aam Aadmi Party's Yogesh Dhingra, said, “How can we call ourselves smart when we dont even have the basic infrastructure? We may have spent over Rs 325 crore on cameras in the city but do we know where we stand?”", "url": "https://indianexpress.com/article/cities/chandigarh/chandigarh-rain-news-weather-floods-cremation-ground-8013751/", "urlToImage": "https://images.indianexpress.com/2022/07/cremation.jpg", "publishedAt": "2022-07-07T00:53:34Z", "content": "It was a tough time for families of people who had passed away, as they were seen wading through water-logged lanes to bid a final adieu to their loved ones, as Chandigarhs cremation ground in Sector… [+2411 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mohali Rains: Students narrowly escape as bus gets stuck in drain due to submerged road", "description": "The residents who gathered at the spot helped the students to come out through the driver’s window. Zirakpur is one of the worst affected areas with internal roads submerged.", "url": "https://indianexpress.com/article/cities/sas-nagar-mohali/mohali-rains-chandigarh-school-bus-floods-waterlogged-roads-8013747/", "urlToImage": "https://images.indianexpress.com/2022/07/school-bus.jpg", "publishedAt": "2022-07-07T00:47:56Z", "content": "A private school bus carrying 15 students was stuck on a water-logged drain, here on Wednesday morning. The students had a miraculous escape as the bus nearly overturned and the local residents helpe… [+581 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mohali Rains: Car washed away in Patiala ki Rao, driver and passenger reported missing", "description": "In Mohali, water logging again chocked the city as many internal roads turned into ponds and water entered houses in low lying areas, forcing people to come out of their homes.", "url": "https://indianexpress.com/article/cities/sas-nagar-mohali/chandigarh-mohali-rain-weather-patiala-ki-rao-accident-8013735/", "urlToImage": "https://images.indianexpress.com/2022/07/car-chandigarh.jpg", "publishedAt": "2022-07-07T00:31:53Z", "content": "A car washed away near Nayagaon after the seasonal rivulet Patiala ki Rao was flooded on Wednesday morning, after heavy rains. The damaged car was recovered but the driver and the passenger are still… [+3795 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Data in Parliament: Chandigarh tops the country in number of students going abroad", "description": "According to data, Chandigarh saw 10,150 students per one lakh population going abroad between January 2016 to February 2021.", "url": "https://indianexpress.com/article/cities/chandigarh/parliament-data-chandigarh-rank-students-studying-abroad-8013732/", "urlToImage": "https://images.indianexpress.com/2022/07/Study-abroad.jpg", "publishedAt": "2022-07-07T00:17:01Z", "content": "Chandigarh has the highest number of students per lakh population going abroad in the entire country. The data of students going abroad from all the states was presented in the Parliament by V Murale… [+2213 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aditi Raja", "title": "MSU to open admissions to country’s first UG course in Hindu studies", "description": "MSU, which is now the first university to offer an undergraduate course in the subject, has also decided to simultaneously offer Masters in Hindu Studies, modelled on the syllabus of the same course of the Benaras Hindu University (BHU).", "url": "https://indianexpress.com/article/cities/baroda/msu-to-open-admissions-to-countrys-first-ug-course-in-hindu-studies-8013725/", "urlToImage": "https://images.indianexpress.com/2022/07/Exam-1.jpg", "publishedAt": "2022-07-06T23:48:26Z", "content": "The Maharaja Sayajirao University (MSU) of Baroda is all set to open admissions to the countrys first undergraduate course in Hindu studies, a day after the university syndicate approved the two self… [+4726 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Row after SEC tells collectors to remove OBC quota in Gujarat gram panchayat polls", "description": "As per the provisions of the Gujarat Panchayats Act, Gujarat has 10 per cent reservation for OBC communities in the elections of gram panchayats. The SEC Secretary also mentioned that this was in view of the order of the Supreme Court dated May 10, 2022.", "url": "https://indianexpress.com/article/cities/gandhinagar/row-after-sec-tells-collectors-to-remove-obc-quota-in-gujarat-gram-panchayat-polls-8013720/", "urlToImage": "https://images.indianexpress.com/2022/07/voting-1200-4-1.jpg", "publishedAt": "2022-07-06T23:43:56Z", "content": "Reservation for Other Backward Class (OBC) communities in the upcoming elections to over 3,200 gram panchayats in Gujarat has become a bone of contention after the Gujarat State Election Commission (… [+4380 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "ED questions Azam son, to call wife next", "description": "The ED had filed a case against Abdullah’s father and senior SP leader Azam Khan in connection with the transfer of funds to Maulana Mohammad Ali Jauhar Trust that runs Mohammad Ali Jauhar University. Azam Khan is the university's founder and chancellor.", "url": "https://indianexpress.com/article/cities/lucknow/ed-questions-azam-son-to-call-wife-next-8013716/", "urlToImage": "https://images.indianexpress.com/2022/07/Abdullah-Azam-2col.jpg", "publishedAt": "2022-07-06T23:27:46Z", "content": "The Enforcement Directorate (ED) on Wednesday recorded the statement of Samajwadi Party MLA Mohammad Abdullah Azam in a money laundering case. Abdullah, who was recently elected from Suar Assembly se… [+1874 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Medical student found hanging in hostel, police say she died by suicide", "description": "According to police, Monika Dubey, who is married, had recently appeared in the final year examination of the Diploma in Medical Radio Diagnosis (DMRD) and returned from her home in Prayagraj on Monday.", "url": "https://indianexpress.com/article/cities/lucknow/medical-student-found-hanging-in-hostel-police-say-she-died-by-suicide-8013714/", "urlToImage": "https://images.indianexpress.com/2022/07/IE-79-2.jpeg", "publishedAt": "2022-07-06T23:22:24Z", "content": "A 28-year-old radiology student at Lala Lajpat Rai Medical College was found hanging from the ceiling fan of her hostel room here late Tuesday night, police said, adding that she died by suicide.Acco… [+663 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Anti-Sikh Riots: SIT arrests four more accused in 2 separate cases in Kanpur", "description": "SIT member Balendu Bhushan said Kanpur police had earlier filed closure reports in both the cases on different grounds", "url": "https://indianexpress.com/article/cities/lucknow/anti-sikh-riots-sit-arrests-four-more-accused-in-2-separate-cases-in-kanpur-8013711/", "urlToImage": "https://images.indianexpress.com/2022/07/arrest1-6.jpeg", "publishedAt": "2022-07-06T23:20:16Z", "content": "The Special Investigation Team (SIT) probing cases related to the 1984 anti-Sikh riots arrested four persons on Wednesday in connection with two separate cases of violence that occurred in Kanpur aft… [+1857 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Stay alert during Kanwar Yatra, Bakrid: CM to police", "description": "“The Sawan Mela will begin in Ayodhya on July 31. Bakrid will be celebrated before that and the month of Muharram will be starting in the meantime. In view of these festivals, the CM in the meeting said that this time would be very sensitive and officials nee…", "url": "https://indianexpress.com/article/cities/lucknow/stay-alert-during-kanwar-yatra-bakrid-cm-to-police-8013709/", "urlToImage": "https://images.indianexpress.com/2022/07/Yogi-9-1.jpg", "publishedAt": "2022-07-06T23:11:57Z", "content": "AT a review meeting on law and order during the upcoming Kanwar Yatra and Bakrid festival, Uttar Pradesh Chief Minister Yogi Adityanath on Wednesday directed the police to stay alert on these occasio… [+2279 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "George Mathew", "title": "New car insurance plan: Premium based on usage, driving behaviour", "description": "In the case of ‘pay as you drive”, as the policy is valid for a specified number of kilometres, the premium will be lower than standard plans for those who use their vehicles infrequently.", "url": "https://indianexpress.com/article/business/new-car-insurance-plan-premium-based-on-usage-driving-behaviour-8013631/", "urlToImage": "https://images.indianexpress.com/2022/07/car-insurance-1200.jpg", "publishedAt": "2022-07-06T23:05:33Z", "content": "WITH THE Insurance Regulatory and Development Authority of India (IRDAI) on Wednesday allowing general insurance companies to introduce tech-enabled concepts of pay as you drive and pay how you drive… [+3841 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Green Move: GRSE signs agreement with Bengal govt to build next-gen electric ferry", "description": "The arrival of the electric ferry shall transform the inland water transport system in National Waterway- 1 (NW-1), which is being developed from Haldia to Varanasi under the Ministry of Shipping,” reads a GRSE statement.", "url": "https://indianexpress.com/article/cities/kolkata/green-move-grse-signs-agreement-with-bengal-govt-to-build-next-gen-electric-ferry-8013707/", "urlToImage": "https://images.indianexpress.com/2022/07/Ferry-2col.jpg", "publishedAt": "2022-07-06T23:02:10Z", "content": "The Garden Reach Shipbuilders and Engineers Ltd, a Mini Ratna Category 1 Defence PSU and a leading warship building company in India, signed a contract with the Government of West Bengal for the desi… [+2312 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "How Omicron evades antibodies in vaccinated and unvaccinated people", "description": "They found that unlike its predecessors, Omicron appears to be able to evade the antibodies generated by all other variants, the University of Geneva said in a press release.", "url": "https://indianexpress.com/article/explained/how-omicron-evades-antibodies-in-vaccinated-and-unvaccinated-people-8013620/", "urlToImage": "https://images.indianexpress.com/2022/07/mumbai-vaccine.jpg", "publishedAt": "2022-07-06T23:00:52Z", "content": "The current wave of Covid-19 highlights a high risk of reinfection by the Omicron variant of SARS-CoV-2. Why is this? Researchers analysed the antibody neutralisation capacity of 120 people infected … [+2103 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "To stem Re slide, boost forex inflows, RBI eases FPI, NRI deposit norms", "description": "Govt, RBI prepare to mitigate volatility and dampen global spillovers by expanding sources of forex funding.", "url": "https://indianexpress.com/article/business/economy/to-stem-re-slide-boost-forex-inflows-rbi-eases-fpi-nri-deposit-norms-8013627/", "urlToImage": "https://images.indianexpress.com/2022/07/Rupee-2-1.jpg", "publishedAt": "2022-07-06T23:00:22Z", "content": "TO prevent the slide in the rupee and shore up foreign exchange reserves, the Reserve Bank of India (RBI) Wednesday announced a series of measures, including relaxation in foreign investment in debt,… [+5041 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Harikishan Sharma", "title": "Less wheat on states’ plate", "description": "Following a revision in May, wheat allocation under NFSA has been slashed for 10 states, of which UP and Gujarat have demanded a rollback. How much wheat do the states consume, what is the revision, and why?", "url": "https://indianexpress.com/article/explained/less-wheat-on-states-plate-national-food-security-act-rice-allocation-8013617/", "urlToImage": "https://images.indianexpress.com/2022/07/wheat-1.jpg", "publishedAt": "2022-07-06T22:55:45Z", "content": "Gujarat and Uttar Pradesh both BJP-ruled states have demanded more wheat in place of rice and asked the Centre to restore their original allocations under the National Food Security Act (NFSA), 2013,… [+7326 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Jimmy Leivon, Nirupama Subramanian", "title": "Two Tamil men from Manipur found dead in Myanmar; community leader alleges hand of pro-junta militia", "description": "The two Moreh town residents, P Mohan, 27, and M Iyarnar, 28, had crossed over into Myanmar’s Tamu on Tuesday morning. According to the Moreh Tamil Sangam secretary, they had gone to meet a friend.", "url": "https://indianexpress.com/article/india/two-tamil-men-manipur-found-dead-myanmar-community-leader-pro-junta-militia-8013604/", "urlToImage": "https://images.indianexpress.com/2022/07/shot-dead.jpg", "publishedAt": "2022-07-06T22:40:22Z", "content": "The bodies of two Tamil men from a Manipur town were found Tuesday with bullet wounds in neighbouring Myanmar, with a pro-junta militia alleged to be behind the killing.The two Moreh town residents, … [+3402 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "BGPM chief invites Mamata to his swearing-in on July 12", "description": "Interacting with reporters after coming out of Nabanna, Thapa said the hill people were with Bengal and that the BJP's demand for a separate state had pushed them back by 20 years.", "url": "https://indianexpress.com/article/cities/kolkata/bgpm-chief-invites-mamata-to-his-swearing-in-on-july-12-8013703/", "urlToImage": "https://images.indianexpress.com/2022/07/ANITTHAPA-MAMATA-4COL.jpg", "publishedAt": "2022-07-06T22:39:45Z", "content": "Bharatiya Gorkha Prajatantrik Morcha (BGPM) chief Anit Thapa on Wednesday met Chief Minister Mamata Banerjee here and invited her to attend his swearing-in ceremony as the Gorkhaland Territorial Admi… [+1542 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Multiple complaints against Moitra over Kali remarks, ‘bring it on,’ she says", "description": "Leader of Opposition in Bengal Assembly Suvendu Adhikari said the party had filed hundreds of police complaints against Moitra across the state.", "url": "https://indianexpress.com/article/cities/kolkata/multiple-complaints-moitra-kali-remarks-bring-it-on-she-says-8013582/", "urlToImage": "https://images.indianexpress.com/2022/07/Moitra.jpg", "publishedAt": "2022-07-06T22:35:01Z", "content": "A day after her remarks on Goddess Kali stirred a controversy, Trianmool Congress MP Mahua Wednesday found herself facing multiple police complaints most of them filed by the Bharatiya Janata Party i… [+2937 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Mihir Mishra", "title": "EV fires: Govt sets up panel to suggest certification, testing SOPs for batteries", "description": "The electric two-wheeler segment has seen many incidents of vehicles catching fire in the recent past. Electric two-wheeler makers such as Ola Electric, Okinawa Autotech and PureEV had recalled their scooters in the wake of separate fire incidents.", "url": "https://indianexpress.com/article/business/commodities/ev-fires-govt-sets-up-panel-to-suggest-certification-testing-sops-for-batteries-8013657/", "urlToImage": "https://images.indianexpress.com/2022/07/ola-scooter-fire-1.jpg", "publishedAt": "2022-07-06T22:30:06Z", "content": "Amid increasing instances of fires in electric vehicles (EVs) being reported from parts of the country, the government has stepped in with a plan to formulate procedures on battery certification and … [+3315 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Dhankhar to Bengali intelligentsia: Break silence on decimation of democracy in Bengal", "description": "People shouldn’t tolerate a nominated head spitting poison against an elected govt: TMC", "url": "https://indianexpress.com/article/cities/kolkata/dhankhar-to-bengali-intelligentsia-break-silence-on-decimation-of-democracy-in-state-8013701/", "urlToImage": "https://images.indianexpress.com/2022/07/KOLGUVADHIKARI-3COL.jpg", "publishedAt": "2022-07-06T22:27:39Z", "content": "West Bengal Governor Jagdeep Dhankhar on Wednesday urged the Bengali intelligentsia to break their silence on what he termed as the “decimation of democratic values” in the state so as to protect dem… [+2658 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "Dolo-650 maker’s premises searched over ‘tax evasion’", "description": "The tax department is looking at financial records and statements of the company as part of the searches, officials said. Further details were not disclosed by the department.", "url": "https://indianexpress.com/article/business/companies/dolo-650-makers-premises-searched-over-tax-evasion-8013652/", "urlToImage": "https://images.indianexpress.com/2022/07/income-tax-dept.jpg", "publishedAt": "2022-07-06T22:20:05Z", "content": "The Income Tax Department on Wednesday conducted searches at the premises of Bengaluru-based pharmaceutical company Micro Labs Ltd, the manufacturer of Dolo-650 tablet for alleged tax evasion. The me… [+688 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "HC lawyer complains of death threats over supporting Nupur, FIR registered", "description": "In his complaint, Raval stated, “On June 13 night, I had kept the picture of Nupur Sharma as my WhatsApp status in solidarity after she and her family received threats in the wake of her statements... However, I pulled down the status three minutes later, thi…", "url": "https://indianexpress.com/article/cities/ahmedabad/hc-lawyer-complains-of-death-threats-over-supporting-nupur-fir-registered-8013697/", "urlToImage": "https://images.indianexpress.com/2022/07/nupur-sharma-1-2.jpg", "publishedAt": "2022-07-06T22:17:51Z", "content": "A case has been lodged after an advocate of the Gujarat High Court filed a complaint stating that he allegedly received death threats from anonymous persons over supporting suspended Bharatiya Janata… [+1519 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Congress ready with fresh blueprint for polls: Leaders after Delhi meet", "description": "Meanwhile, AICC incharge for Gujarat Raghu Sharma maintained that the party will not reveal its chief ministerial face before polls.", "url": "https://indianexpress.com/article/cities/ahmedabad/congress-ready-with-fresh-blueprint-for-polls-leaders-after-delhi-meet-8013692/", "urlToImage": "https://images.indianexpress.com/2022/07/Priyanka-Gandhi-4-1-1.jpg", "publishedAt": "2022-07-06T22:14:23Z", "content": "Days after attending a meet with senior party officials, Gujarat Congress leaders returned to Ahmedabad Wednesday with a fresh blueprint for the upcoming Gujarat Assembly 2022 elections.Meanwhile, AI… [+1950 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Santosh Singh", "title": "Bihar college teacher listens to ‘conscience’, returns 33-month salary of Rs 23 lakh", "description": "While the college’s principal, Manoj Kumar, questioned Kumar’s motive in returning his salary — “it is not just absenteeism [of students] but a pressure tactic to get a transfer to postgraduate department,” he said — BRABU registrar R K Thakur lauded the move.", "url": "https://indianexpress.com/article/education/bihar-college-teacher-listens-to-conscience-returns-33-month-salary-of-rs-23-lakh-8013649/", "urlToImage": "https://images.indianexpress.com/2022/07/Lalan-Kumar-1col.jpg", "publishedAt": "2022-07-06T22:12:10Z", "content": "An assistant professor of Nitisheswar College, in Bihars Muzaffarpur, has returned nearly Rs 24 lakh his total earnings since joining the job in September 2019 as no student turned up for a single cl… [+2376 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "Birmingham letdown", "description": "It may be part of a trend: Much-vaunted Indian pace attack’s inability to strike in the fourth innings of an overseas Test", "url": "https://indianexpress.com/article/opinion/editorials/birmingham-letdown-much-vaunted-indian-pace-attacks-inability-to-strike-in-the-fourth-innings-of-an-overseas-test-8013545/", "urlToImage": "https://images.indianexpress.com/2022/07/edit-4.jpg", "publishedAt": "2022-07-06T22:07:51Z", "content": "Englands newfound, free-flowing style of play, also called Bazball after coach Brendon McCullums nickname, is all the rage in Test cricket. It has now brought about an astonishing four consecutive su… [+1627 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Explained: When shark bites are fatal, and which species kill the most", "description": "Collated by the Taronga Conservation Society Australia, the dataset will be publicly available. It will aid scientists, conservationists, authorities, and members of the public to make informed decisions when implementing or selecting mitigation measures, the…", "url": "https://indianexpress.com/article/explained/explained-when-shark-bites-are-fatal-and-which-species-kill-the-most-8013616/", "urlToImage": "https://images.indianexpress.com/2022/07/shark.jpg", "publishedAt": "2022-07-06T22:07:15Z", "content": "A study in Nature Scientific Data describes the Australian Shark-Incident Database, with comprehensive reports of 1,196 shark bites in Australia over 231 years (17912022). Collated by the Taronga Con… [+1301 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Coast Guard rescues 22 crew members from sinking merchant ship off Porbandar coast", "description": "The incident happened about 185 kilometres off Porbandar where the vessel “Global King-1” reported uncontrolled flooding onboard. A distress call was received by the Coast Guard at 8.20 am.", "url": "https://indianexpress.com/article/cities/ahmedabad/coast-guard-rescues-22-crew-members-from-sinking-merchant-ship-off-porbandar-coast-8013690/", "urlToImage": "https://images.indianexpress.com/2022/07/ship-4col.jpg", "publishedAt": "2022-07-06T22:06:25Z", "content": "The Indian Coast Guard (ICG) rescued 22 crew members from a merchant vessel that got stranded mid-sea off the coast of Porbandar in Gujarat on Wednesday. Those rescued include 20 Indians, one Pakista… [+1666 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Apar Gupta", "title": "Twitter’s legal challenge to Centre’s takedown orders flags issues of free speech", "description": "While Twitter’s case may be painted as a Silicon Valley platform’s defiance of the GoI, at the core of the legal issue is the right to freedom of expression and the future of Digital India", "url": "https://indianexpress.com/article/opinion/columns/twitters-legal-challenge-to-centres-takedown-orders-flags-issues-of-free-speech-8013551/", "urlToImage": "https://images.indianexpress.com/2022/07/Twitter.jpg", "publishedAt": "2022-07-06T22:05:54Z", "content": "As the Ministry of Electronics and IT (MEITY) conducts a week-long celebration to mark eight years of the Digital India programme, Twitter has filed a writ petition in the Karnataka High Court agains… [+6344 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rishabh Bhandari", "title": "Boris Johnson’s failures as a leader are catching up with him as the UK political crisis intensifies", "description": "While Britain has a conservative administration, it lacks conservative policies that are capable of promoting transformative change. It is clear that Britain needs fresh leadership for renewal", "url": "https://indianexpress.com/article/opinion/columns/boris-johnsons-failures-as-a-leader-are-catching-up-with-him-as-the-uk-political-crisis-intensifies-8013556/", "urlToImage": "https://images.indianexpress.com/2022/07/boris-1.jpg", "publishedAt": "2022-07-06T22:05:34Z", "content": "The resignations of Rishi Sunak and Sajid Javid are likely to mark the beginning of the end for Boris Johnsons premiership. Westminster is agog with speculation as Johnson reels from this latest setb… [+4292 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "A longer term focus", "description": "Fall in wheat, rice, sugar production should not detract from goal of cropping and dietary diversification", "url": "https://indianexpress.com/article/opinion/editorials/fall-in-wheat-rice-sugar-production-should-not-detract-from-goal-of-cropping-8013542/", "urlToImage": "https://images.indianexpress.com/2022/07/edit-3.jpg", "publishedAt": "2022-07-06T22:04:54Z", "content": "Union Commerce and Food Minister Piyush Goyal wants state governments to ensure that farmers increase sowing of rice and also area under wheat. Paddy acreage in the ongoing kharif planting season is … [+2299 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sohini Ghosh", "title": "Accused doesn’t seem interested in proceeding with appeals: HC", "description": "The HC bench’s observations came especially in light of a Supreme Court order of August 20, 2020 in a plea by one of the accused-appellant Pravinsinh Zala seeking suspension of his life sentence.", "url": "https://indianexpress.com/article/cities/ahmedabad/accused-doesnt-seem-interested-in-proceeding-with-appeals-hc-8013688/", "urlToImage": "https://images.indianexpress.com/2022/07/Gujarat-HC-1-1.jpg", "publishedAt": "2022-07-06T22:02:00Z", "content": "The Gujarat High Court Wednesday, while taking up the appeals filed by former IPS officer Sanjiv Bhatt and six others convicted by a Jamnagar court in the 1990 custodial torture case, made adverse ob… [+3793 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shoma A. Chatterji", "title": "The magic of Tarun Majumdar’s films: Stories of the common people", "description": "His films narrated the lives, struggles, failures and successes of ordinary men, women and children, enriched with beautiful songs and music, mainly drawn from the creations of Rabindranath Tagore.", "url": "https://indianexpress.com/article/opinion/columns/shoma-a-chatterji-writes-everymans-filmmaker-tarun-majumdar-marxist-art-cinema-8013562/", "urlToImage": "https://images.indianexpress.com/2022/07/Tarun-Majumdar.jpg", "publishedAt": "2022-07-06T22:00:14Z", "content": "Not since the demise of the great Balraj Sahni in 1973 has this happened. Tarun Majumdar, a dedicated Marxist, had wished for his body to not be laid in state or covered by thick garlands. He did not… [+4766 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "Policing Press", "description": "Weaponisation of IPC to set police on journalists cuts across parties — and clamps down on press freedom.", "url": "https://indianexpress.com/article/opinion/editorials/weaponisation-ipc-set-police-on-journalists-cuts-across-parties-clamps-down-press-freedom-8013534/", "urlToImage": "https://images.indianexpress.com/2022/07/edit-2.jpg", "publishedAt": "2022-07-06T21:57:11Z", "content": "The arrest last week of Mohammed Zubair, co-founder of Alt News, and the arrest drama that played out at the Ghaziabad residence of Zee News anchor Rohit Ranjan this week, speak of something similarl… [+3264 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Man duped of Rs 18 lakh over promise of membership in ‘dating’ service", "description": "Police said a few months ago, a woman identifying herself as 'Rina' contacted the complainant on his cell phone and offered to give him membership to a ’dating’ company, which she claimed provides 'sexual services by women'.", "url": "https://indianexpress.com/article/cities/pune/man-duped-of-rs-18-lakh-over-promise-of-membership-in-dating-service-8013685/", "urlToImage": "https://images.indianexpress.com/2022/07/pune-police.jpg", "publishedAt": "2022-07-06T21:55:28Z", "content": "The employee of a private company was cheated to the tune of Rs 18 lakh after he was lured by false assurances about becoming the member of a ‘dating’ service.The victim, a 44-year-old man, lodged th… [+1733 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sukrita Baruah", "title": "Demolition drive resumes near Yamuna, residents say they had protection from HC", "description": "On Wednesday morning, the JCBs returned and tore down more houses. “The court’s order is for a limited number of jhuggis. DDA has not conducted demolition exercise on those,” a DDA spokesperson said, referring to the houses of the 11 residents who were listed…", "url": "https://indianexpress.com/article/cities/delhi/demolition-drive-resumes-near-yamuna-residents-say-they-had-protection-from-hc-8013635/", "urlToImage": "https://images.indianexpress.com/2022/07/yamunna.jpg", "publishedAt": "2022-07-06T21:52:39Z", "content": "Houses were torn down at Gyaspur basti in Sarai Kale Khan on Wednesday as part of a demolition drive by the Delhi Development Authority even though the Delhi High Court bench had ordered status quo i… [+2785 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Varinder Bhatia", "title": "Haryana slaps show cause notice on Ashoka University, accuses it of ‘financial embezzlement’", "description": "The state warned the university of registering a criminal case if it doesn't reply to the show cause within the stipulated time. The Indian Express has learnt that Additional Chief Secretary (Higher Education), Anand Mohan Sharan, issued the show cause to the…", "url": "https://indianexpress.com/article/education/haryana-slaps-show-cause-notice-on-ashoka-university-accuses-it-of-financial-embezzlement-8013626/", "urlToImage": "https://images.indianexpress.com/2022/07/Ashoka-university.jpg", "publishedAt": "2022-07-06T21:47:52Z", "content": "Haryanas higher education department has issued a show cause notice to Ashoka University, accusing it of financial embezzlement by not admitting enough students from Haryana domicile in various cours… [+2946 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Yogesh Naik", "title": "Shinde tells state Covid task force to continue its work", "description": "An official said that Shinde spoke to Dr Sanjay Oak, the head of the state task force, and conveyed that they must continue their work. Shinde discussed the prevailing Covid-19 situation with Oak and gave the necessary directives, a statement from the Chief M…", "url": "https://indianexpress.com/article/cities/mumbai/shinde-tells-state-covid-task-force-to-continue-its-work-8013682/", "urlToImage": "https://images.indianexpress.com/2022/07/Eknath-Shinde-1-2.jpg", "publishedAt": "2022-07-06T21:42:13Z", "content": "Days after members of the Covid-19 pediatric task force quit following the change in the government, Chief Minister Eknath Shinde on Wednesday asked the state Covid-19 task force, which was appointed… [+1145 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pallavi Smart", "title": "After 2 years of lockdown, school and college students embrace festive buzz", "description": "The Immaculata – an inter-school festival by St Mary’s School, saw greater alumni participation as they had missed out on the festival buzz during the pandemic-induced lockdown.", "url": "https://indianexpress.com/article/cities/mumbai/after-2-years-of-lockdown-school-and-college-students-embrace-festive-buzz-8013675/", "urlToImage": "https://images.indianexpress.com/2022/07/immaculata-3col.jpg", "publishedAt": "2022-07-06T21:39:17Z", "content": "THE ICONIC Malhar festival by St Xaviers College will be a two-day event this year instead of three. The Immaculata an inter-school festival by St Marys School, saw greater alumni participation as th… [+2871 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sadaf Modak", "title": "Court rejects plea to de-freeze bank account ‘linked to Waze’", "description": "Money in the account was collected by Waze as extortion amount, says NIA", "url": "https://indianexpress.com/article/cities/mumbai/court-rejects-plea-to-de-freeze-bank-account-linked-to-waze-8013680/", "urlToImage": "https://images.indianexpress.com/2022/07/sachin-waze-ANI.jpg", "publishedAt": "2022-07-06T21:33:51Z", "content": "A SPECIAL court in Mumbai has rejected an application which sought to de-freeze an account linked to dismissed policeman Sachin Waze which has Rs 1.51 crore in it. The National Investigation Agency (… [+2362 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Wimbledon 2022: Injured Rafael Nadal unsure if he can play semis against Kyrgios", "description": "Nadal said he was worried about the injury and he will undergo more scans on Thursday before making a decision about continuing to compete at the grasscourt major.", "url": "https://indianexpress.com/article/sports/tennis/wimbledon-2022-injured-rafael-nadal-unsure-if-he-can-play-semis-against-kyrgios-8013678/", "urlToImage": "https://images.indianexpress.com/2022/07/nadal-1.jpg", "publishedAt": "2022-07-06T21:20:17Z", "content": "Rafa Nadal provided no assurance that he would be able to turn up for his Wimbledon semi-final on Friday against Australian Nick Kyrgios after the Spaniard played through an abdominal injury to beat … [+2330 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Mohamed Thaver", "title": "Arrested for taking bribe, Mumbai cop to be reinstated in force for 2nd time", "description": "Soon after Bhoir was arrested by the Anti Corruption Bureau (ACB) in 2019 for allegedly taking a bribe of Rs 22 lakh, he had been dismissed from the force.", "url": "https://indianexpress.com/article/cities/mumbai/arrested-for-taking-bribe-mumbai-cop-to-be-reinstated-in-force-for-2nd-time-8013674/", "urlToImage": "https://images.indianexpress.com/2022/07/Anand-Bhoir-2col.jpg", "publishedAt": "2022-07-06T21:13:23Z", "content": "MUMBAI POLICE Inspector Anand Bhoir, whose reinstatement had been set aside by the previous Maha Vikas Aghadi (MVA) government last November, will be reinstated in the force for the second time in tw… [+2732 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Omkar Gokhale", "title": "HC relief to man booked for killing mother for making vegetable instead of fish", "description": "Setting aside the life sentence awarded to Pawar under Section 302 (murder) of the IPC, the HC convicted him under Section 304 II (culpable homicide not amounting to murder). It held that the attack was not premeditated and the accused had no intention to kil…", "url": "https://indianexpress.com/article/cities/mumbai/hc-relief-to-man-booked-for-killing-mother-for-making-vegetable-instead-of-fish-8013672/", "urlToImage": "https://images.indianexpress.com/2022/07/bombay-high-court-1200-2.jpg", "publishedAt": "2022-07-06T21:09:30Z", "content": "THE BOMBAY High Court recently granted partial relief to a man booked for killing his mother in Kalyan in 2011 in a “heat of passion” as instead of fish, she served him the same vegetable twice in a … [+1969 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Maharashtra: Amid surge in Covid cases, spike in recovery and doubling rates", "description": "For the second day, the number of new Covid cases in the city was below 700. A day after reporting 659 cases, the city reported 695 cases on Wednesday.", "url": "https://indianexpress.com/article/cities/mumbai/maharashtraamid-surge-in-covid-cases-spike-in-recovery-and-doubling-rates-8013669/", "urlToImage": "https://images.indianexpress.com/2022/07/Covid-4.jpg", "publishedAt": "2022-07-06T21:06:49Z", "content": "AMID A surge in Covid-19 cases in Maharashtra, there has been no Covid-related death in Mumbai in the past 22 days.For the second day, the number of new Covid cases in the city was below 700. A day a… [+745 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Kamala Mills fire: Bail for Mojo’s Bistro co-owner", "description": "Tuli was in custody for 11 months before the Supreme Court granted him interim bail in December 2018, pending his bail plea before the High Court.", "url": "https://indianexpress.com/article/cities/mumbai/kamala-mills-fire-bail-for-mojos-bistro-co-owner-8013668/", "urlToImage": "https://images.indianexpress.com/2022/07/kamala-mills.jpg", "publishedAt": "2022-07-06T21:02:45Z", "content": "THE BOMBAY High Court recently granted bail to Mojos Bistro co-owner Yug Tuli in connection with the Kamala Mills fire that had claimed 14 lives in December 2017.Tuli was in custody for 11 months bef… [+2282 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sanjana Bhalerao, Shubhangi Khapre", "title": "Day after, less rainfall but traffic snarls & waterlogging across Mumbai", "description": "Three persons, including a minor, sustained injuries in a landslide at Chunabhatti. According to BMC, the incident took place at Nagoba chowk in Gorakhnath Mandal's Narayan Hadke chawl around 10.28 am when a part of the hill collapsed on a ground-plus one cha…", "url": "https://indianexpress.com/article/cities/mumbai/day-after-less-rainfall-but-traffic-snarls-waterlogging-across-city-8013665/", "urlToImage": "https://images.indianexpress.com/2022/07/High-Tide1-4col.jpg", "publishedAt": "2022-07-06T20:55:19Z", "content": "A day after incessant and heavy rain threw normal life out of gear, the residents of Mumbai woke up to waterlogging, traffic snarls and potholes on Wednesday.Motorists travelling between Andheri and … [+3618 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sanjana Bhalerao", "title": "Mumbai clocks 43% of avg seasonal rainfall since June 1", "description": "Extremely heavy rain likely in Mumbai, Thane and Palghar till Friday", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-clocks-43-of-avg-seasonal-rainfall-since-june-1-8013659/", "urlToImage": "https://images.indianexpress.com/2022/07/Powai-Lake-4col.jpg", "publishedAt": "2022-07-06T20:49:31Z", "content": "Owing to heavy rain since the beginning of July, Mumbai has till now witnessed 957.9 mm of total rainfall since June 1. The figure is 43 per cent of the average seasonal rainfall (2,205 mm) the city … [+3311 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Bashaarat Masood", "title": "Ghulam Mir resigns as J&K Congress chief", "description": "Mir’s resignation is likely to put an end to rifts within the Congress.", "url": "https://indianexpress.com/article/cities/srinagar/ghulam-mir-resigns-as-jk-congress-chief-8013660/", "urlToImage": "https://images.indianexpress.com/2022/07/ga-mir759-1.jpg", "publishedAt": "2022-07-06T20:45:47Z", "content": "Ghulam Ahmad Mir resigned as Jammu and Kashmir Pradesh Congress Committee (PCC) president on Wednesday, paving the way for the appointment of a new UT chief of the party.While Mirs supporters called … [+802 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Congress says BJP organising personal attacks on judges", "description": "The Congress charge came a day after a group of “concerned citizens”, including former judges and bureaucrats, criticised the recent SC observations against suspended BJP member Nupur Sharma.", "url": "https://indianexpress.com/article/india/congress-says-bjp-organising-personal-attacks-on-judges-8013654/", "urlToImage": "https://images.indianexpress.com/2022/07/Singhvi.jpg", "publishedAt": "2022-07-06T20:29:12Z", "content": "The Congress Wednesday accused the BJP of encouraging and endorsing personal attacks on judges. It said the objective behind such campaigns is to demoralise, pressure and terrorise the judiciary.The … [+1525 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Liz Mathew, Esha Roy", "title": "Sub-categorisation of OBCs: Govt extends term again without panel asking for it", "description": "The commission was set up on October 2, 2017 under Article 340 of the Constitution. It was tasked with sub-categorisation of the OBCs and equitable distribution of benefits reserved for them.", "url": "https://indianexpress.com/article/india/sub-categorisation-obcs-govt-extends-term-panel-8013650/", "urlToImage": "https://images.indianexpress.com/2022/07/gavel-2-3-1.jpg", "publishedAt": "2022-07-06T20:21:59Z", "content": "The Union Cabinet on Wednesday gave the 13th extension to the Justice Rohini Commission, giving it time until January 31, 2023 to submit its report.With the move coming even without the commission se… [+2691 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Liz Mathew, Esha Roy", "title": "Sub-categorisation of OBCs: Govt extends term again without panel asking for it", "description": "The commission was set up on October 2, 2017 under Article 340 of the Constitution. It was tasked with sub-categorisation of the OBCs and equitable distribution of benefits reserved for them.", "url": "https://indianexpress.com/article/political-pulse/sub-categorisation-obcs-govt-extends-term-panel-8013650/", "urlToImage": "https://images.indianexpress.com/2022/07/g-rohini.jpg", "publishedAt": "2022-07-06T20:21:59Z", "content": "With the move coming even without the commission seeking an extension, it betrays the ruling BJP’s fears that the report could politically boomerang and affect its efforts to keep its OBC support bas… [+2543 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "SC stays HC order, paves way for EPS faction to alter structure of party leadership", "description": "“The matters require consideration. Issue notice, returnable in two weeks...Operation and effect of the impugned order dated 23.06.2022 shall remain stayed,” the top court said.", "url": "https://indianexpress.com/article/india/sc-stays-hc-order-paves-way-for-eps-faction-to-alter-structure-of-party-leadership-8013646/", "urlToImage": "https://images.indianexpress.com/2022/07/Supreme-court-new-1.jpg", "publishedAt": "2022-07-06T20:08:51Z", "content": "The Supreme Court on Wednesday stayed the Madras High Court division benchs June 23 order that restrained the passing of any unannounced resolutions in the AIADMK’s general and executive council meet… [+1320 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Udaipur case: Tailor’s sons to get govt jobs", "description": "Kanhaiyalal Teli was hacked to death by Mohammad Riyaz and Ghouse Mohammad on June 28 for allegedly sharing remarks made by former BJP spokesperson Nupur Sharma on the Prophet, leading to a nationwide outrage.", "url": "https://indianexpress.com/article/cities/jaipur/udaipur-case-tailors-sons-to-get-govt-jobs-8013641/", "urlToImage": "https://images.indianexpress.com/2022/07/gehlot-uadipur-1.jpg", "publishedAt": "2022-07-06T20:07:00Z", "content": "The Rajasthan Cabinet on Wednesday decided to give government jobs to Yash Teli and Tarun Teli, the sons of Udaipur tailor Kanhaiyalal Teli.A government statement on the meeting chaired by Chief Mini… [+720 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi Confidential: Green Tick", "description": "The Centre’s ban on single-use plastic got its first celebrity endorsement today — UN Secretary-General's Advocate for Sustainable Development, Bollywood actor Dia Mirza.", "url": "https://indianexpress.com/article/delhi-confidential/delhi-confidential-green-tick-8013644/", "urlToImage": "https://images.indianexpress.com/2022/07/Dia.jpg", "publishedAt": "2022-07-06T20:02:56Z", "content": "The Centres ban on single-use plastic got its first celebrity endorsement today UN Secretary-General’s Advocate for Sustainable Development, Bollywood actor Dia Mirza, took a proactive role to spell … [+2132 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "From film to digital, Chandni Chowk’s camera market adapts to the new", "description": "While the stores display old manual analog cameras, most of their work now deals with repairing and selling digital ones. All surviving shops have adapted with time to the technological shift in photography – from black and white film to colour to digital.", "url": "https://indianexpress.com/article/cities/delhi/from-film-to-digital-chandni-chowks-camera-market-adapts-to-the-new-8013639/", "urlToImage": "https://images.indianexpress.com/2022/07/shops.jpg", "publishedAt": "2022-07-06T19:57:57Z", "content": "Photography is no longer an art, it used to be, says Rajkumar Kapoor, owner of Madanjee &amp; Co, a camera store in Chandni Chowks camera market. One of the oldest camera stores here, it was founded … [+2606 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "25 MCD-run schools to get revamp: L-G", "description": "Saxena visited Nagar Nigam Pratibha Vidyalaya in H-Block, Ashok Vihar, along with officials of the MCD, the Raj Niwas said in a statement. The visit was to carry forward his “agenda of taking the MCD and the institutions under it to newer heights,” it said.", "url": "https://indianexpress.com/article/cities/delhi/25-mcd-run-schools-to-get-revamp-l-g-8013630/", "urlToImage": "https://images.indianexpress.com/2022/07/Vinai-Kumar-Saxena-2-4.jpg", "publishedAt": "2022-07-06T19:52:30Z", "content": "Lieutenant Governor V K Saxena Saturday said that to upgrade teaching, technological and physical infrastructure, 25 schools run by the MCD have been identified to be modified as a pilot project.Saxe… [+657 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Multiple complaints against Moitra over Kali remarks, ‘bring it on,’ she says", "description": "In Bengal, the Bharatiya Janata Party also held protests at several places including Kolkata, demanding her arrest for “hurting religious sentiments”.", "url": "https://indianexpress.com/article/cities/kolkata/multiple-complaints-against-moitra-over-kali-remarks-bring-it-on-she-says-8013623/", "urlToImage": "https://images.indianexpress.com/2022/07/Parl-Mahua-3col.jpg", "publishedAt": "2022-07-06T19:35:04Z", "content": "In Bengal, the Bharatiya Janata Party also held protests at several places including Kolkata, demanding her arrest for hurting religious sentiments.\r\nLeader of Opposition in state Assembly Suvendu Ad… [+2595 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Peter Vidal", "title": "Horoscope Today, July 7, 2022: Gemini, Aries, Pisces and other signs — check astrological prediction", "description": "Leo - You have survived one emotional challenge, although there may well be ripples for some time yet", "url": "https://indianexpress.com/article/horoscope/horoscope-today-july-7-2022-gemini-aries-pisces-and-other-signs-check-astrological-prediction-7998549/", "urlToImage": "https://images.indianexpress.com/2022/06/horoscope_4.jpg", "publishedAt": "2022-07-06T19:30:13Z", "content": "The overall picture suggests that this is a busy day, if an expensive one. However, there doesn’t seem to be any real obligation on you towards anything which can’t be left to others. This should sui… [+3495 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "In three-day event at BHU, heads of 400 institutions to brainstorm over NEP implementation", "description": "A press conference was convened on Wednesday at BHU by University Grants Commission (UGC) chairman M Jagadesh Kumar and BHU Vice-Chancellor C Sudhir K Jain to give out the details of Akhil Bhartiya Shiksha Samagam, which will be inaugurated by the PM.", "url": "https://indianexpress.com/article/education/in-three-day-event-at-bhu-heads-of-400-institutions-to-brainstorm-over-nep-implementation-8013614/", "urlToImage": "https://images.indianexpress.com/2022/07/modi-7-1.jpg", "publishedAt": "2022-07-06T19:07:06Z", "content": "Prime Minister Narendra Modi will on Thursday inaugurate a three-day seminar at Banaras Hindu University (BHU) which will see participation of more than 400 academic experts and heads of higher educa… [+3396 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "In three-day event at BHU, heads of 400 institutions to brainstorm over NEP implementation", "description": "A press conference was convened on Wednesday at BHU by University Grants Commission (UGC) chairman M Jagadesh Kumar and BHU Vice-Chancellor C Sudhir K Jain to give out the details of Akhil Bhartiya Shiksha Samagam, which will be inaugurated by the PM.", "url": "https://indianexpress.com/article/cities/lucknow/in-three-day-event-at-bhu-heads-of-400-institutions-to-brainstorm-over-nep-implementation-8013614/", "urlToImage": "https://images.indianexpress.com/2022/07/modi-7-1.jpg", "publishedAt": "2022-07-06T19:07:06Z", "content": "Prime Minister Narendra Modi will on Thursday inaugurate a three-day seminar at Banaras Hindu University (BHU) which will see participation of more than 400 academic experts and heads of higher educa… [+3396 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Woman’s family kills her alleged molester, father held: Police", "description": "Woman’s family killed the man after police didn’t act against him, say villagers; police deny charge", "url": "https://indianexpress.com/article/cities/lucknow/womans-family-kills-her-alleged-molester-father-held-police-8013603/", "urlToImage": "https://images.indianexpress.com/2022/07/arrest1-5.jpeg", "publishedAt": "2022-07-06T19:03:06Z", "content": "A 26-year-old man was beaten to death allegedly by the father and two brothers of an 18-year-old woman, who was allegedly molested by him.The incident took place at a village in Aligarh district on M… [+1889 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "First visit after BJP’s return to power in U.P. PM in Varanasi today, to inaugurate & lay foundation of several projects", "description": "Will lay foundation stone for projects worth Rs 1,200 cr, to inaugurate three-day seminar on education at BHU", "url": "https://indianexpress.com/article/education/pm-modi-in-varanasi-today-to-inaugurate-rs-590-cr-worth-projects-8013610/", "urlToImage": "https://images.indianexpress.com/2022/07/Modi-1-1.jpg", "publishedAt": "2022-07-06T19:02:05Z", "content": "Prime Minister Narendra Modi will visit his Lok Sabha constituency of Varanasi on Thursday to inaugurate and lay the foundation of various development and infrastructure projects.This will be PM Modi… [+3057 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "PM Modi in Varanasi today, to inaugurate Rs 590 cr worth projects", "description": "The PM will also lay the foundation stone of projects worth more than Rs 1,200 crores, inaugurate convention on NEP 2020.", "url": "https://indianexpress.com/article/cities/lucknow/pm-modi-in-varanasi-today-to-inaugurate-rs-590-cr-worth-projects-8013610/", "urlToImage": "https://images.indianexpress.com/2022/07/Modi-1-1.jpg", "publishedAt": "2022-07-06T19:02:05Z", "content": "Prime Minister Narendra Modi will visit his Lok Sabha constituency of Varanasi on Thursday to inaugurate and lay the foundation of various development and infrastructure projects.This will be PM Modi… [+3057 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sandeep Dwivedi", "title": "Roger Bannister to Rafael Nadal: The triumphs of the greats may not be possible without the pain", "description": "Like so many times in his career, the Spainard does it again at Wimbledon. Hobbling in pain and on the verge of withdrawal, Rafa turns the tide by looking the bull in the eyes and saying, 'What's pain?'", "url": "https://indianexpress.com/article/sports/tennis/roger-bannister-to-rafael-nadal-the-triumphs-of-the-greats-may-not-be-possible-without-the-pain-8013605/", "urlToImage": "https://images.indianexpress.com/2022/07/roger-ban-nadal.jpg", "publishedAt": "2022-07-06T18:55:06Z", "content": "But for a singular moment while on the train to Oxford for an important athletic meet, Roger Bannister had a rather uninspiring start to what eventually would be the most memorable day of his life. I… [+8722 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Farmers happy with this year’s Kharif sowing, says Gujarat agri minister", "description": "“Due to good rains, farmers are happy. Normally, Kharif crops are sown between June 20 and July 10. So according to me, the monsoon has been on time... The status of Kharif sowing is also good,\" said Patel told mediapersons Wednesday.", "url": "https://indianexpress.com/article/cities/ahmedabad/farmers-happy-with-this-years-kharif-sowing-says-gujarat-agri-minister-8013601/", "urlToImage": "https://images.indianexpress.com/2022/07/Kharif-crops.jpg", "publishedAt": "2022-07-06T18:38:36Z", "content": "Despite a 13 per cent deficit in rainfall, and 25 per cent less sowing during the ongoing Kharif season, Gujarats Agriculture Minister Raghavji Patel on Wednesday said farmers were happy and the sowi… [+1916 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Nihal Koshie", "title": "How the wrong shoe resulted in triple jump champ Rojas being barred from long jump at the Worlds", "description": "The thickness of the sole of her shoes when she jumped 6.93 metres to qualify in June was 5 millimetres more than what is allowed in long jump.", "url": "https://indianexpress.com/article/explained/wrong-shoe-triple-jump-champ-rojas-barred-long-jump-worlds-8013573/", "urlToImage": "https://images.indianexpress.com/2022/07/Yulimar-Rojas.jpg", "publishedAt": "2022-07-06T18:38:27Z", "content": "Yulimar Rojas, the 26-year-old Venezuelan triple jump world record holder, wanted to win a medal in long jump at this months World Championships in Eugene. But her dream was dashed even before she re… [+5078 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "Ajker Rashifal Bengal, 7 July 2022: দাম্পত্য কলহে জেরবার হবে এই রাশির জাতকরা!", "description": "৭ই জুলাই, আজকের রাশিফল- জেনে নিন কী \nআছে ভাগ্যে?", "url": "https://bengali.indianexpress.com/horoscope/ajker-rashifal-july-7-2022-aries-taurus-gemini-cancer-leo-virgo-libra-scorpio-sagittarius-capricorn-aquarius-pisces-465924/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/thursday-2.jpg", "publishedAt": "2022-07-06T18:35:00Z", "content": "/ Aries  Rashifal ( March 21 – April 20 )\r\n/ Taurus  Rashifal ( April 21 – May 21 )\r\n/ Gemini  Rashifal ( May 22 – June 21 )\r\n/ Cancer Rashifal  ( June 22 – July 23 )\r\n/ Leo   Rashifal  ( July 24 – A… [+316 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Canal fully functional; villagers cheer as Narmada water approaches Kutch", "description": "The development marked the completion of the KBC, the only branch canal which was incomplete, and Narmada waters reaching 750 kilometres from Narmada dam, authorities of the Sardar Sarovar Narmada Nigam Limited (SSNNL) said.", "url": "https://indianexpress.com/article/cities/rajkot/canal-fully-functional-villagers-cheer-as-narmada-water-approaches-kutch-8013596/", "urlToImage": "https://images.indianexpress.com/2022/07/kutch-copy.jpg", "publishedAt": "2022-07-06T18:34:43Z", "content": "HUNDREDS OF people lined up and cheered wildly along the bank of Kutch Branch Canal (KBC) as Narmada water approached Mod Kuba, the village marking the tail-end of KBC in Mandvi taluka of Kutch distr… [+3158 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "UK court fines firm over Republic TV show", "description": "The claimant, Aneel Mussarat, a British businessman of Pakistani origin, was referred to as an “ISI stooge” on the show on July 22, 2020. His photograph was also broadcast.", "url": "https://indianexpress.com/article/india/uk-court-fines-firm-over-republic-tv-show-8013594/", "urlToImage": "https://images.indianexpress.com/2022/07/arnab.jpg", "publishedAt": "2022-07-06T18:30:29Z", "content": "A LONDON court has fined the company, which has the licence to broadcast Arnab Goswamis Republic TV in the UK, £37,500 for defaming a British businessman who was called a ISI stooge on the news show.… [+1925 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Yogesh Naik", "title": "Former MP Adsul resigns from Sena", "description": "His son Abhijit Adsul told The Indian Express: “My father has resigned from the leader's post. But we continue to be Shiv Sainiks. He has sent a letter to party chief Uddhav Thackeray on the details on his resignation as leader.”", "url": "https://indianexpress.com/article/cities/mumbai/former-mp-adsul-resigns-from-sena-8013591/", "urlToImage": "https://images.indianexpress.com/2022/07/Anandrao-Adsul.jpg", "publishedAt": "2022-07-06T18:27:23Z", "content": "Shiv Sena leader Anand Adsul, a former MP from Amravati, has resigned from his position as a leader of the party.His son Abhijit Adsul told The Indian Express: My father has resigned from the leader’… [+1102 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Shashi Tharoor backs Mahua Moitra: ‘She wasn’t trying to offend anyone’", "description": "The Trinamool Congress has already distanced itself from Moitra’s remarks, saying the views expressed by her have been made in her personal capacity and not endorsed by the party.", "url": "https://indianexpress.com/article/india/shashi-tharoor-backs-mahua-moitra-she-wasnt-trying-to-offend-anyone-8013590/", "urlToImage": "https://images.indianexpress.com/2022/07/Tharoor-moitra.jpg", "publishedAt": "2022-07-06T18:24:39Z", "content": "ON A day a complaint was filed against TMC MP Mahua Moitra in Bhopal over her comments on Goddess Kali, Congress Lok Sabha MP Shashi Tharoor came out in support of her even as the Congress said the h… [+1396 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Soumyarendra Barik", "title": "Kaali poster controversy: Twitter withholds post by filmmaker after govt order", "description": "The tweet in question included an image of the poster of Manimekalai’s latest documentary Kaali, which depicted a woman dressed as Goddess Kaali smoking a cigarette and holding a pride flag, according to a disclosure made by Twitter to the Lumen database — an…", "url": "https://indianexpress.com/article/india/kaali-poster-controversy-twitter-withholds-post-by-filmmaker-after-govt-order-8013587/", "urlToImage": "https://images.indianexpress.com/2022/07/Leena-Manimekali-twt-1200-1.jpg", "publishedAt": "2022-07-06T18:16:05Z", "content": "Twitter, which moved the Karnataka High Court against some content blocking orders issued by the Ministry of Electronics and IT, has withheld a tweet of Toronto-based filmmaker Leena Manimekalai afte… [+4301 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Andrew Amsan", "title": "‘Athletes’ job is to train, not fight court cases’: High jumper Tejaswin relieved after CWG inclusion", "description": "Tejaswin Shankar hopes legal battle removes ‘arbitrariness’ in AFI selection policy.", "url": "https://indianexpress.com/article/sports/sport-others/high-jumper-tejaswin-relieved-after-cwg-inclusion-8013588/", "urlToImage": "https://images.indianexpress.com/2018/04/tejaswin-shankar-fb.jpg", "publishedAt": "2022-07-06T18:16:03Z", "content": "Indias leading high jumper Tejaswin Shankar has hardly got any sleep in the last few weeks. Ever since taking the Athletics Federation of India (AFI) to court over his exclusion from the 2022 Commonw… [+3746 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Omkar Gokhale, Mohamed Thaver", "title": "PE in extortion case against Navlani closed, no truth found in allegations: SIT to HC", "description": "The Mumbai Police had formed an SIT under instructions from former Mumbai Police Commissioner Sanjay Pandey when the previous Maha Vikas Aghadi (MVA) government was in power. Shiv Sena leader Sanjay Raut had alleged that a few BJP leaders like Kirit Somaiya w…", "url": "https://indianexpress.com/article/cities/mumbai/pe-in-extortion-case-against-navlani-closed-no-truth-found-in-allegations-sit-to-hc-8013584/", "urlToImage": "https://images.indianexpress.com/2022/07/bombay-high-court-1200.jpg", "publishedAt": "2022-07-06T18:06:03Z", "content": "The Special Investigation Team (SIT) of the Mumbai Police on Wednesday told the Bombay High Court that it has closed preliminary enquiry (PE) against businessman Jitendra Navlani, a builder and an ow… [+4335 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Man held for killing wife, hiding her body underneath stones for 40 days", "description": "On Tuesday, a team of Vinchhiya PS apprehended Rajesh for interrogation and later the accused revealed the location of the victim's skeletal body in a secluded area outside Dokalva village in Chotila Taluka.", "url": "https://indianexpress.com/article/cities/ahmedabad/man-held-for-killing-wife-hiding-her-body-underneath-stones-for-40-days-8013581/", "urlToImage": "https://images.indianexpress.com/2022/07/arrest1-4.jpeg", "publishedAt": "2022-07-06T18:01:32Z", "content": "Police Wednesday arrested a man for allegedly killing his wife and hiding her body for 40 days underneath a pile of stones at a deserted area in Suredranagar.According to police, Ranjan Ben Odakhia, … [+1295 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Yubaraj Ghimire", "title": "Budget leak: Nepal’s Finance Minister quits after Parliament Speaker orders probe", "description": "There are speculation that the tax proposals were changed at the last minute to suit three or four business houses on the direct intervention of Sharma.", "url": "https://indianexpress.com/article/world/budget-leak-nepals-finance-minister-quits-after-parliament-speaker-orders-probe-8013577/", "urlToImage": "https://images.indianexpress.com/2022/07/deuba.jpg", "publishedAt": "2022-07-06T17:57:38Z", "content": "Nepal’s Finance Minister Janardan Sharma on Wednesday resigned from the post after the government yielded to the pressure to form an all-party parliamentary probe committee to go into the budget leak… [+1417 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Take up pro bono work, work for the marginalised: Justice Chandrachud to law students", "description": "“Fraternity is important for structuring our democracy to recognise and accept the plurality of people,” Justice Chandrachud said,  according to a press release issued by the university.", "url": "https://indianexpress.com/article/cities/mumbai/take-up-pro-bono-work-work-for-the-marginalised-justice-chandrachud-to-law-students-8013574/", "urlToImage": "https://images.indianexpress.com/2022/07/Chandrachud.jpg", "publishedAt": "2022-07-06T17:51:46Z", "content": "Supreme Court judge Justice D Y Chandrachud has advised law students to take up pro bono work and work for the marginalised even if they are employed in high-paying jobs.Addressing students of the Ma… [+722 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Teacher acquitted of charges of raping minor daughter", "description": "In her complaint, she had alleged that for last two years at different time intervals, she was sexually molested by her father.", "url": "https://indianexpress.com/article/cities/teacher-acquitted-of-charges-of-raping-minor-daughter-8013559/", "urlToImage": "https://images.indianexpress.com/2022/07/2021-04-171-4-2.jpg", "publishedAt": "2022-07-06T17:47:58Z", "content": "A Valsad court on Tuesday acquitted a Sanskrit scholar and school teacher of charges of raping his minor daughter.According to the prosecution, a 14-year-old girl from Valsad, who is a native of Biha… [+2033 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "England [T20] is a different side, a lot of the guys who won the Test match are not here” Rohit Sharma", "description": "Since both teams field vastly different T20 teams from their Test side, the Indian captain hopeful there won't be any adverse impact from the brutal defeat at Edgbaston", "url": "https://indianexpress.com/article/sports/cricket/england-t20-is-a-different-side-rohit-sharma-eng-vs-ind-t20-8013563/", "urlToImage": "https://images.indianexpress.com/2022/07/rohit-sharma-1.jpg", "publishedAt": "2022-07-06T17:46:21Z", "content": "India captain Rohit Sharma was asked the inevitable question on the eve of the first Twenty20 international against England in Southampton – what impact would the adverse result in the Birmingham Tes… [+3244 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Ukrainians hope embattled UK PM ‘Johnsoniuk’ can cling on", "description": "Johnson is facing a growing rebellion within his own Conservative Party after a slew of ministerial resignations, but Ukrainians fete him as one of their most vocal supporters.", "url": "https://indianexpress.com/article/world/ukrainians-hope-embattled-uk-pm-johnsoniuk-can-cling-on-8013557/", "urlToImage": "https://images.indianexpress.com/2022/07/UK-PM-1.jpg", "publishedAt": "2022-07-06T17:28:25Z", "content": "As Boris Johnson’s tenure as British Prime Minister hangs by a thread, Ukrainians are hoping the man who some have affectionately taken to calling “Borys Johnsoniuk” can cling on.Johnson is facing a … [+1949 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Why music maestro Ilayaraja’s Rajya Sabha nomination appeared like a foregone conclusion", "description": "While his words of praise for Modi in April appeared to many critics as a harbinger of some major recognition from Delhi coming the music great’s way, even they would not dispute that Ilayaraja is deserving of the Rajya Sabha nomination.", "url": "https://indianexpress.com/article/cities/chennai/music-maestro-ilayaraja-rajya-sabha-nomination-foregone-conclusion-8013548/", "urlToImage": "https://images.indianexpress.com/2022/07/ilayaraja-1200.jpg", "publishedAt": "2022-07-06T17:20:32Z", "content": "Modi said of the singer in a tweet, The creative genius of @ilaiyaraaja Ji has enthralled people across generations. His works beautifully reflect many emotions. What is equally inspiring is his life… [+2842 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Johannes Vetter out of World Athletics Championships with shoulder injury", "description": "Johannes Vetter's absence greatly improves Neeraj's chance for gold at Worlds.", "url": "https://indianexpress.com/article/sports/sport-others/johannes-vetter-out-of-world-athletics-championships-with-shoulder-injury-8013522/", "urlToImage": "https://images.indianexpress.com/2021/08/vetter.jpg", "publishedAt": "2022-07-06T17:15:40Z", "content": "Johannes Vetter, the 2017 Javelin world champion, will not be participating in the upcoming World Athletics Championships in Oregon.Vetter confirmed the development in an Instagram post on Wednesday.… [+984 chars]"}]}