{"status": "ok", "totalResults": 339, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Kanchan Vasdev", "title": "Centre’s help welcome but state faces challenges in procuring record yield", "description": "The centre has put a rider that the state government would have to keep a revolving fund equivalent to at least 15% of procurement cost of sanctioned quantity and ensure that the payment is made directly into the bank accounts of the farmers within three days…", "url": "https://indianexpress.com/article/cities/chandigarh/centres-help-welcome-but-state-faces-challenges-in-procuring-record-yield-7929847/", "urlToImage": "https://images.indianexpress.com/2022/05/India-Wheat.jpg", "publishedAt": "2022-05-22T02:46:19Z", "content": "Even as the Centre has agreed to implement Price Support Scheme (PSS) for procurement of moong crop in Punjab, it would be too little for the state farmers who are expected to produce 4.75 lakh metri… [+2051 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Leela Prasad, Rahel Philipose", "title": "Daily Briefing: Govt cuts excise on fuel; Modi-Biden talks to look at global issues, says govt", "description": "Nikhat started her boxing journey in earnest in 2009, won the youth world championship in 2011, fell in the quarters of the senior world championship in 2016, and has now won the gold.", "url": "https://indianexpress.com/article/live-news/top-news-briefing-today-7929846/", "urlToImage": "https://images.indianexpress.com/2022/04/Express-intro-10.jpg", "publishedAt": "2022-05-22T02:38:53Z", "content": "To cool retail inflation, which surged to an eight-year high, the government announced a series of measures including a reduction in excise duty on petrol by Rs 8 per litre and on diesel by Rs 6 per … [+4770 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Connecting facts in events at Kotkapura and Behbal Kalan: SIT to HC", "description": "The report which has been filed by way of an affidavit of IG-cum-SIT chairman Naunihal Singh, stated that, “It is a matter of record that the agitation(s) against the sacrilege of Shri Guru Granth Sahib were held at Kotkapura and Behbal Kalan.\"", "url": "https://indianexpress.com/article/cities/chandigarh/connecting-facts-in-events-at-kotkapura-and-behbal-kalan-sit-to-hc-7929843/", "urlToImage": "https://images.indianexpress.com/2021/11/GS-8-BEHBAL1.jpg", "publishedAt": "2022-05-22T02:32:33Z", "content": "The SIT (Special Investigation Team) investigating the Behbal Kalan firing case, has submitted before the Punjab and Haryana High Court that there are interconnecting facts between the occurrence tha… [+1436 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Tamil Nadu CM MK Stalin lays foundation stone for 20 projects in Nilgiris", "description": "MK Stalin also inaugurated 28 completed projects worth Rs 56.20 crore at a function organised at Government Arts College here.", "url": "https://indianexpress.com/article/cities/chennai/tamil-nadu-cm-mk-stalin-lays-foundation-stone-for-20-projects-in-nilgiris-7929839/", "urlToImage": "https://images.indianexpress.com/2022/05/stalin-12.jpg", "publishedAt": "2022-05-22T02:29:39Z", "content": "Tamil Nadu Chief Minister M K Stalin on Saturday laid foundation stones for 20 projects in Nilgiris district at a cost of Rs 34.30 crore.He also inaugurated 28 completed projects worth Rs 56.20 crore… [+1164 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Centre okays moong procurement, a shot in the arm for Punjab", "description": "The letter further mentioned that the date of procurement will be decided by the state government and the procurement period will remain 90 days from that date.", "url": "https://indianexpress.com/article/cities/chandigarh/centre-okays-moong-procurement-a-shot-in-the-arm-for-punjab-7929836/", "urlToImage": "https://images.indianexpress.com/2022/05/Mann-3col.jpg", "publishedAt": "2022-05-22T02:25:43Z", "content": "TWO days after Punjab Chief Minister Bhagwant Mann met Union home minister Amit Shah and sought MSP on moong dal, the Centre on Saturday agreed to implement Price Support Scheme (PSS) for procurement… [+1593 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Raakhi Jagga", "title": "Singla gives `25L to kin of five who died in farm stir", "description": "According to the figure recorded by the Samyukta Kisan Morcha(SKM), nearly 714 farmers of Punjab, Haryana, Delhi, Uttar Pradesh and Uttrakhand had died during this agitation and a majority of them - exactly 619 - were from Punjab.", "url": "https://indianexpress.com/article/cities/chandigarh/singla-gives-25l-to-kin-of-five-who-died-in-farm-stir-7929822/", "urlToImage": "https://images.indianexpress.com/2022/05/singhla.jpg", "publishedAt": "2022-05-22T02:15:04Z", "content": "A day before Telangana Chief Minister K Chandrasekhar Raos scheduled visit to Chandigarh to provide relief to families of farmers who had died while protesting farm laws at the Delhi borders, Health … [+1925 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Tamil Nadu CM MK Stalin orders opening of Mettur dam on May 24 ahead of schedule", "description": "The water level in the reservoir is rapidly rising owing to rains in the catchment areas. Due to copious inflows, the level of water in the dam on Saturday stood at 115.35 feet against a full reservoir level of 120 feet.", "url": "https://indianexpress.com/article/cities/chennai/tamil-nadu-cm-mk-stalin-orders-opening-of-mettur-dam-on-may-24-ahead-of-schedule-7929816/", "urlToImage": "https://images.indianexpress.com/2022/05/stalin6-1-1.jpeg", "publishedAt": "2022-05-22T01:37:28Z", "content": "Tamil Nadu Chief Minister M K Stalin on Saturday ordered the Public Works Department (PWD) officials to release water from the Mettur dam on May 24, instead of the customary water release on June 12,… [+2077 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Haryana to celebrate Maharishi Kashyap Jayanti on May 24", "description": "Chief Minister Manohar Lal Khattar shall be the chief guest and the government says it expect thousands of people to reach Karnal for attending the programme.", "url": "https://indianexpress.com/article/cities/chandigarh/haryana-to-celebrate-maharishi-kashyap-jayanti-on-may-24-7929809/", "urlToImage": "https://images.indianexpress.com/2022/05/khattar-2.jpg", "publishedAt": "2022-05-22T01:17:28Z", "content": "The Haryana government shall be officially celebrating Maharishi Kashyap Jayanti, this time. A state level function shall be held in Karnal on May 24.The Haryana government is paying tribute to relig… [+574 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Varinder Bhatia", "title": "Decisions in party being made under pressure: Bishnoi targets Congress", "description": "In a tweet posted Saturday morning, Bishnoi wrote, “Like late Indira ji, late Rajiv ji too had an eye for talent and took decisions on merits, that is why Congress was an undefeated force.", "url": "https://indianexpress.com/article/cities/chandigarh/decisions-in-party-being-made-under-pressure-bishnoi-targets-congress-7929808/", "urlToImage": "https://images.indianexpress.com/2022/04/11-46.jpg", "publishedAt": "2022-05-22T01:06:56Z", "content": "Haryana Congress MLA from Adampur, Kuldeep Bishnoi, fired a fresh salvo at the party high command, hinting that the party is making decisions under pressure and the influence of money. In a tweet pos… [+3069 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Varinder Bhatia", "title": "Explained: The assets case that led to Om Prakash Chautala’s conviction", "description": "The Rouse Avenue court at New Delhi, pronounced the verdict holding Om Prakash Chautala guilty of amassing assets disproportionate to his known sources of income.", "url": "https://indianexpress.com/article/explained/explained-the-assets-case-that-led-to-om-prakash-chautalas-conviction-7929806/", "urlToImage": "https://images.indianexpress.com/2022/05/OP-Chautala.jpg", "publishedAt": "2022-05-22T00:49:09Z", "content": "Indian National Lok Dal’s supremo and Haryana’s four-time chief minister Om Prakash Chautala was pronounced guilty by a Delhi court, Saturday, in over a decade old disproportionate assets case. The q… [+4928 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aakash Joshi", "title": "The pandemic’s unusual epiphany: it’s only the daily hustle that makes us enjoy our inadequate holidays", "description": "For those wedded to the rat race, the pandemic hasn't changed the way we take a vacation", "url": "https://indianexpress.com/article/express-sunday-eye/the-pandemics-unusual-epiphany-its-only-the-daily-hustle-that-makes-us-enjoy-our-inadequate-holidays-7929282/", "urlToImage": "https://images.indianexpress.com/2022/05/aakash-eye.jpg", "publishedAt": "2022-05-22T00:45:56Z", "content": "In late 2020, when the tragedy of the first wave the overnight lockdown and watching those who make our cities run, flee to rural India had begun to ebb, I was sent on a well-deserved guilt trip. The… [+4597 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Suvir Saran", "title": "With great love comes great responsibility", "description": "We must acknowledge the sacrifices others have made and their acts of kindness that make our journey possible", "url": "https://indianexpress.com/article/express-sunday-eye/great-love-responsibility-suvir-saran-column-7928744/", "urlToImage": "https://images.indianexpress.com/2022/05/eye-copy.jpg", "publishedAt": "2022-05-22T00:40:25Z", "content": "Karun Deep Sagar is my soon-to-be 22-year-old nephew. Born in Dallas, Texas, he has blessed us with joy, happiness, tutelage, angst, comfort, distraction, love, and responsibility. His journey, thus … [+5724 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "‘My dream, my goal is to win an Olympic gold for my country’: Nikhat Zareen", "description": "That became a reality in Istanbul on May 19, when she won the Women’s World Boxing Championships in the flyweight (52 kg) category. Nikhat (25) couldn’t sleep a wink that night as congratulatory messages and requests poured in.", "url": "https://indianexpress.com/article/cities/mumbai/my-dream-my-goal-is-to-win-an-olympic-gold-for-my-country-nikhat-zareen-7929805/", "urlToImage": "https://images.indianexpress.com/2022/05/Zareen-1200.jpg", "publishedAt": "2022-05-22T00:37:51Z", "content": "WHEN NIKHAT Zareen was a young girl interested in boxing, she remembers people telling her father, Mohammad Jameel, why have you put her in boxing? Its a mens sport (mardon ka khel hai), who will mar… [+2930 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shyam Saran", "title": "On a trek through Uttarakhand, a former diplomat muses on the unprecedented scale of developmental activity in the region", "description": "Travelling through the vulnerable landscape brings on the sobering realisation that the snows on the Himalayas may not be eternal after all", "url": "https://indianexpress.com/article/express-sunday-eye/trek-uttarakhand-former-diplomat-unprecedented-scale-developmental-activity-region-7928971/", "urlToImage": "https://images.indianexpress.com/2022/05/GettyImages-Precarious-at-the-Top-Eye-1200.jpg", "publishedAt": "2022-05-22T00:30:06Z", "content": "I have been trekking the Uttarakhand and Himachal Himalayas for several years now. These are unique and breathtakingly beautiful landscapes. No matter how many times I have returned to explore these … [+6255 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Three arrested for impersonating candidates", "description": "Sources said that during the verification, it was found that the face of the candidates Aman, Vikram Singh and Anand, from Haryana, did not match with the photo on the admit card issued by the Punjab University.", "url": "https://indianexpress.com/article/cities/chandigarh/three-arrested-for-impersonating-candidates-7929803/", "urlToImage": "https://images.indianexpress.com/2022/05/arrest-27.jpg", "publishedAt": "2022-05-22T00:29:17Z", "content": "THREE MEN were caught for appearing on the behalf of real candidates during the physical test for the recruitment of firemen in the Chandigarh Municipal Corporation at Police Lines, Sector 26, on Sat… [+1113 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Divya Goyal", "title": "A sinking INLD receives another jolt with its supremo Om Prakash Chautala’s conviction", "description": "Having won the polls two times from Moga and once from Dharamkot, he was a close confidant of SAD patron Parkash Singh Badal. He had also participated in several “morchas” led by Akali Dal for rights of Punjab and had also spent jail term.", "url": "https://indianexpress.com/article/cities/chandigarh/a-sinking-inld-receives-another-jolt-with-its-supremo-om-prakash-chautalas-conviction-7929800/", "urlToImage": "https://images.indianexpress.com/2021/09/Om-Prakash-Chautala-1.jpg", "publishedAt": "2022-05-22T00:28:16Z", "content": "The fresh conviction of its supremo, 87-year-old Om Prakash Chautala in a disproportionate assets case is all set to further dent the already sinking Indian National Lok Dal party in Haryana, which i… [+3973 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Shahpur Colony demolition: HC issues notice to UT Administration", "description": "The petitioner, Rajinder Kumar and others, through counsel GP Vashisht, argued that the petitioners are residing in their houses in their area which have been provided house numbers and they also have ration cards, Aadhar cards and are registered voters.", "url": "https://indianexpress.com/article/cities/chandigarh/shahpur-colony-demolition-hc-issues-notice-to-ut-administration-7929802/", "urlToImage": "https://images.indianexpress.com/2022/03/Punjab-and-Haryana-HC-2.jpeg", "publishedAt": "2022-05-22T00:18:56Z", "content": "The Punjab and Haryana High Court have issued notice to the Chandigarh Administration over a petition filed by the residents of Shahpur Colony, Sector 38-A West, Chandigarh, seeking to quash the demo… [+685 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Three, including lawyer, fall prey to cyber crime", "description": "Police have registered three FIRs and started investigation.", "url": "https://indianexpress.com/article/cities/chandigarh/three-including-lawyer-fall-prey-to-cyber-crime-7929799/", "urlToImage": "https://images.indianexpress.com/2022/05/cyber-crime-2.jpg", "publishedAt": "2022-05-22T00:04:36Z", "content": "THREE PEOPLE including a practicing advocate and a woman fell prey to online fraudsters. Police said that Advocate Sukhbir Singh of Sector 38A received a call on about an update of his credit card of… [+1301 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Probe finds fraud in widow pension scheme in Panchkula", "description": "Officials said that most of the beneficiaries who are under the scanner are from Mauli, Jatwal, Raipurrani villages and from areas near Barwala.", "url": "https://indianexpress.com/article/cities/chandigarh/probe-finds-fraud-in-widow-pension-scheme-in-panchkula-7929796/", "urlToImage": "https://images.indianexpress.com/2019/10/pension-1200-1.jpg", "publishedAt": "2022-05-21T23:57:48Z", "content": "A probe by Panchkulas Social Welfare Department has found that at least 24 beneficiaries of Haryanas widow pension scheme have been withdrawing money fraudulently every month on the basis of fake dea… [+2391 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "FPIs net sellers in equities on Re fall, US rate hike prospects", "description": "Foreign investors sell Rs 35,137 crore of equities during May 2-20", "url": "https://indianexpress.com/article/business/economy/fpis-net-sellers-in-equities-on-re-fall-us-rate-hike-prospects-7929789/", "urlToImage": "https://images.indianexpress.com/2022/05/foreign-exchange-2-2.jpg", "publishedAt": "2022-05-21T23:47:33Z", "content": "The outflux of foreign funds from domestic equity markets continued steadily, with FPIs having pulled out more than Rs 35,000 crore so far this month, according to depositories data.The outflow by fo… [+2904 chars]"}]}