{"status": "ok", "totalResults": 389, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Central bank unveils Payments Vision 2025: RBI bats for CBDC, regulation of fintechs, BNPL", "description": "The RBI document has proposed enabling of geotagging of digital payment infrastructure and transactions and revisiting guidelines for prepaid payment instruments (PPIs), including closed system PPIs.", "url": "https://indianexpress.com/article/business/banking-and-finance/rbi-payments-system-cbdc-india-regulations-fintechs-bnpl-big-tech-companies-digital-payments-7976340/", "urlToImage": "https://images.indianexpress.com/2022/06/RBI-Reserve-Bank-of-India-Reuters-1200-6.jpeg", "publishedAt": "2022-06-18T00:32:49Z", "content": "The Reserve Bank of India (RBI) has unveiled the Payments Vision 2025 document which proposes a host of innovative payment systems and regulation of BigTechs, fintechs, buy-now-pay-later (BNPL) syste… [+2007 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "‘Geopolitical climate poses near-term challenges for Indian economy’: Chief Economic Adviser", "description": "On the state of the banking sector, the Chief Economic Adviser noted that the banking sector balance sheets are in good shape with well-capitalised banks and lower bad loan ratios.", "url": "https://indianexpress.com/article/business/economy/geopolitical-climate-poses-near-term-challenges-7976330/", "urlToImage": "https://indianexpress.com/wp-content/themes/indianexpress/images/IE-OGimage.jpg", "publishedAt": "2022-06-18T00:05:18Z", "content": "Chief Economic Adviser (CEA) V Anantha Nageswaran has said the threats and global headwinds from geopolitical conditions are the near-term challenges for the Indian economy, and may remain for 6-12 m… [+1255 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Peter Vidal", "title": "Horoscope Today, June 18 2022: Capricorn, Leo, Libra and other signs — check astrological prediction", "description": "Libra-- Some sort of financial crisis is looming, so fancy footwork will be necessary if you want to avoid bad feeling and save yourself some of your hard-earned cash. If you're in the housing market, or otherwise contemplating large domestic purchases, follo…", "url": "https://indianexpress.com/article/horoscope/horoscope-today-june-18-2022-capricorn-leo-libra-and-other-signs-check-astrological-prediction-7970275/", "urlToImage": "https://images.indianexpress.com/2022/04/horo2121.jpg", "publishedAt": "2022-06-17T23:30:49Z", "content": "ARIES (Mar 21 – Apr. 20)You could soon be ready to make your move – at last. Your stars are adopting a position which is frankly more favourable than for some weeks, and the best thing you can do is … [+3270 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kanchan Vasdev", "title": "Punjab: Bhagwant Mann set to review Channi’s decision to give extension to agri colleges", "description": "Channi had before elections allowed extension of another year to such colleges. However, before the file was down marked to agriculture department, code of conduct had come into place.", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-chief-minister-bhagwant-mann-review-channis-decision-agri-colleges-7976317/", "urlToImage": "https://images.indianexpress.com/2022/06/Mann-1-2-1.jpg", "publishedAt": "2022-06-17T23:17:33Z", "content": "Punjab Chief Minister Bhagwant Mann will review former CM Charanjit Singh Channis decision on giving extension to private colleges offering bachelors degree in agriculture without complying with the … [+1687 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kanchan Vasdev", "title": "Under contractors’ pressure, Punjab may amend liquor policy", "description": "The government, it is learnt, has decided to agree to the contractors' demands. These demands are the bone of contention between the contractors and the government.", "url": "https://indianexpress.com/article/cities/chandigarh/under-contractors-pressure-punjab-may-amend-liquor-policy-7976314/", "urlToImage": "https://images.indianexpress.com/2022/06/Mann-3.jpg", "publishedAt": "2022-06-17T23:14:22Z", "content": "After getting a lukewarm response from liquor contractors on Thursday as only 14 groups of liquor vends attracted bids out of 64, the Punjab government has decided to make amendments to the liquor po… [+2016 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Allahabad HC temporarily halts demolition drive along Yamuna floodplains", "description": "Responding to a petition by Harit Kisan Kalyan Samiti, the court in its order issued on Tuesday stated that the petitioners and the respondents, the Noida Authority, will maintain status quo till June 24.", "url": "https://indianexpress.com/article/cities/lucknow/allahabad-hc-temporarily-halts-demolition-yamuna-floodplains-7976313/", "urlToImage": "https://images.indianexpress.com/2022/06/alahanad-HC.jpg", "publishedAt": "2022-06-17T23:12:53Z", "content": "Issuing a temporary halt on the demolition drive being carried out by the Noida Authority along the Yamuna floodplains, the Allahabad High Court has given 10 days time to property owners to file obje… [+1600 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Raakhi Jagga", "title": "Back on Sangrur campaign trail, Bhagwant Mann shows lighter side of old political self", "description": "At times, the CM was spotted standing up through his car's open sunroof to greet and meet people, while at some other instances he also got down from his vehicle to shake hands with a few.", "url": "https://indianexpress.com/article/cities/ludhiana/back-on-sangrur-campaign-trail-bhagwant-mann-shows-lighter-side-of-old-political-self-7976310/", "urlToImage": "https://images.indianexpress.com/2022/06/Mann-4.jpg", "publishedAt": "2022-06-17T23:10:35Z", "content": "After a tepid response to his maiden roadshow, Punjab Chief Minister, Bhagwant Mann, was back on the campaign trail for the Sangrur Parliamentary bypolls on Friday, showing glimpses of his 2019 self.… [+3497 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Row over remarks on the prophet: Will recover cost of damage to properties from accused, says govt", "description": "Several government and private properties were allegedly damaged in the violence.", "url": "https://indianexpress.com/article/cities/lucknow/row-over-remarks-on-the-prophet-will-recover-cost-of-damage-to-properties-from-accused-says-govt-7976307/", "urlToImage": "https://images.indianexpress.com/2022/06/prayagraj-violence-3.jpeg", "publishedAt": "2022-06-17T23:03:12Z", "content": "The State government has decided to recover damages for the destruction caused to public and government property from the accused booked for their alleged involvement in the violence that took place … [+2569 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Haryana Vigilance Bureau nabs eight people in 24 hours for accepting bribes worth Rs 2.62 lakh", "description": "According to vigilance bureau officials, those arrested in the last 24 hous included a sub-divisional officer (SDO), two police officers and two junior engineers, among others.", "url": "https://indianexpress.com/article/cities/chandigarh/haryana-vigilance-bureau-nabs-eight-people-in-24-hours-for-accepting-bribes-worth-rs-2-62-lakh-7976309/", "urlToImage": "https://images.indianexpress.com/2022/06/handcuff-4-11.jpeg", "publishedAt": "2022-06-17T22:58:37Z", "content": "The Haryana State Vigilance Bureau has nabbed as many as eight people from Karnal, Kurukshetra and Faridabad districts in the last 24 hours for accepting bribes worth Rs 2.62 lakh (total) in seperate… [+2933 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Power employees’ body threatens stir if electricity Bill passed in haste", "description": "V K Gupta, a spokesperson of AIPEF, said that they oppose the announcement made by Union Power Minister R K Singh to pass the Electricity (Amendment) Bill 2021 in the monsoon session of Parliament.", "url": "https://indianexpress.com/article/cities/jalandhar/power-employees-body-threatens-stir-if-electricity-bill-passed-in-haste-7976305/", "urlToImage": "https://images.indianexpress.com/2022/06/essar-adani-transmission-deal-1200.jpg", "publishedAt": "2022-06-17T22:55:37Z", "content": "If there is any unilateral move to rush through the Electricity (Amendment) Bill, 2021, in Parliament without taking stakeholders into confidence, power employees across the country will be forced to… [+1489 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Man Aman Singh Chhina", "title": "Calm prevails in Punjab even as neighbouring states see violence over Agnipath", "description": "A protest march was organised by Army aspirants in Talwara in Hoshiarpur district this evening. These youth had cleared their physical examinations and were waiting to appear in written exams under the old recruitment scheme.", "url": "https://indianexpress.com/article/cities/chandigarh/calm-prevails-in-punjab-even-as-neighbouring-states-see-violence-over-agnipath-7976300/", "urlToImage": "https://images.indianexpress.com/2022/06/agnipath-protests.jpeg", "publishedAt": "2022-06-17T22:51:33Z", "content": "Amid arson and protests in several states across the country over Agnipath recruitment scheme, Punjab has remained calm with the youth of the state staying away from any kind of violence in the state… [+4160 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "UP BJP leaders appeal to youth: Don’t buy ‘myths’ about Agnipath scheme", "description": "On Friday, Chief Minister Yogi Adityanath tweeted, “The move to increase the maximum age for Agnipath scheme-2022 from 21 years to 23 years under the guidance of Prime Minister, is a welcome decision. Grateful to the Prime Minister for such a gift that genera…", "url": "https://indianexpress.com/article/cities/lucknow/up-bjp-leaders-appeal-youth-myths-agnipath-scheme-7976283/", "urlToImage": "https://images.indianexpress.com/2022/06/train-fire-1-1.jpg", "publishedAt": "2022-06-17T22:50:27Z", "content": "Amid protests against the Agnipath recruitment scheme for the armed forces in several districts of the state, MPs and MLAs of the ruling BJP on Friday urged the public to not fall for myths about the… [+2218 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "Financial Express Modern BFSI Summit: Shifted focus to inflation after growth hit pre-Covid level, says Das", "description": "During the pandemic, the RBI’s Monetary Policy Committee (MPC) consciously decided to tolerate an inflation which was higher than 4 per cent, up to 6 per cent because the situation required that.", "url": "https://indianexpress.com/article/business/economy/financial-express-modern-bfsi-summit-shifted-focus-to-inflation-after-growth-hit-pre-covid-level-says-das-7976299/", "urlToImage": "https://images.indianexpress.com/2022/06/das-BFSISummit03.jpg", "publishedAt": "2022-06-17T22:49:50Z", "content": "Reserve Bank of India (RBI) Governor Shaktikanta Das on Friday said the central banks focus was to ensure that growth in the economy reached a stage the pre-pandemic level before it started withdrawi… [+4777 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Agnipath scheme: Protests in Haryana, Jind-Bathinda railway track blocked for three hours", "description": "A number of youths squatted on rail tracks at Narwana railway station blocking the Jind-Bathinda railway track for three hours, while some youths burnt tyres in Rohtak, while over 40 youths were rounded up in Faridabad's Ballabhgarh for resorting to stone pel…", "url": "https://indianexpress.com/article/cities/chandigarh/agnipath-scheme-protests-in-haryana-jind-bathinda-railway-track-blocked-for-three-hours-7976301/", "urlToImage": "https://images.indianexpress.com/2022/06/Agnipath-protest.jpg", "publishedAt": "2022-06-17T22:43:54Z", "content": "Youths pelted stones at vehicles in Ballabhgarh, squatted on railway tracks in Jind and burnt tyres in Rohtak as protests broke out in Haryana for the second day on Friday against the Centre’s Agnipa… [+4730 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "June 18, 1982, Forty Years Ago: Presidential Polls", "description": "Ten opposition parties have formally suggested to the Prime Minister that Vice-President M. Hidayatullah “offers a very good choice for a consensus candidate” for the presidency.", "url": "https://indianexpress.com/article/opinion/editorials/forty-years-ago-presidential-polls-7976133/", "urlToImage": "https://images.indianexpress.com/2022/06/18-Jun-1982_IE_001.jpg", "publishedAt": "2022-06-17T22:36:01Z", "content": "Ten opposition parties have formally suggested to the Prime Minister that Vice-President M. Hidayatullah offers a very good choice for a consensus candidate for the presidency. In a letter to Indira … [+765 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Parul", "title": "Chandigarh among the top 11 Eat Smart Cities in country", "description": "The Eat Smart Cities challenge was launched by the Ministry of Housing and Urban Affairs (MoHUA) in April, 2021 in collaboration with the FSSAI to scale up the Eat Right India approach to city level.", "url": "https://indianexpress.com/article/cities/chandigarh/chandigarh-among-the-top-11-eat-smart-cities-in-country-7976296/", "urlToImage": "https://images.indianexpress.com/2022/04/CHD-2.jpg", "publishedAt": "2022-06-17T22:34:02Z", "content": "WE ARE what we eat is the motto that is guiding initiatives of the Food Safety Administration, Chandigarh. The different steps taken in this direction have made Chandigarh win three awards: Among the… [+4176 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "20 MGD groundwater being drawn from borewells: Chandigarh MC Commissioner", "description": "The commissioner also stated that rejuvenation of seven water bodies in various villages, laying of the Tertiary Treated Water in Industrial Area and other out areas in city, 24x7 water supply scheme in pan city, installation of recharging wells in community …", "url": "https://indianexpress.com/article/cities/chandigarh/20-mgd-groundwater-being-drawn-from-borewells-chandigarh-mc-commissioner-7976294/", "urlToImage": "https://images.indianexpress.com/2022/06/delhi-water-rep.jpg", "publishedAt": "2022-06-17T22:31:14Z", "content": "Chandigarh Municipal Corporation Commissioner Anindita Mitra, on Friday, stated that 20 millions of gallons (MGD) groundwater is being drawn from the bore wells, supplementing the canal water for dri… [+1714 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aanchal Magazine", "title": "GST panel to draw up interim report, seek tenure extension", "description": "No consensus on final report within GoM on tweaking slabs", "url": "https://indianexpress.com/article/business/economy/gst-panel-to-draw-up-interim-report-seek-tenure-extension-7976295/", "urlToImage": "https://images.indianexpress.com/2022/06/bommai-2.jpg", "publishedAt": "2022-06-17T22:30:33Z", "content": "The Group of Ministers (GoM), constituted to review the current rate slab structure under the Goods and Services Tax (GST) regime, will prepare an interim report and will seek an extension of its ten… [+2597 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Krishn Kaushik", "title": "Agnipath scheme: Why age relaxation can also become a problem", "description": "Recruitment data shows that the intake of 46,000 recruits this year -- that's the number specified for recruitment in the first year of the Agnipath programme -- will be the lowest since 2015 for the three services together.", "url": "https://indianexpress.com/article/explained/agnipath-scheme-why-age-relaxation-can-also-become-a-problem-7976158/", "urlToImage": "https://images.indianexpress.com/2022/06/indian-army-expl.jpg", "publishedAt": "2022-06-17T22:30:30Z", "content": "Moving to allay concerns and dial down anger on the streets over the short-term Agnipath recruitment scheme for the armed forces, the government announced a one-time relaxation in the upper age limit… [+3010 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sriram Veera", "title": "The way we watched the game", "description": "Watching sports is becoming a solitary experience. It wasn't always so", "url": "https://indianexpress.com/article/opinion/columns/indian-cricket-broadcasting-rights-streaming-platforms-sports-watching-experience-7976120/", "urlToImage": "https://images.indianexpress.com/2022/05/IPL-ground.jpg", "publishedAt": "2022-06-17T22:30:30Z", "content": "Of all the mind-boggling figures that have popped up during the current conversations on broadcasting rights of Indian cricket, one stat stands out: Television viewership is dropping, and digital str… [+5193 chars]"}]}