{"status": "ok", "totalResults": 540, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Kamal Haasan on Vikram’s box office success: ‘I will replay all my loans and eat to my heart’s content’", "description": "Kamal Haasan’s latest movie Vikram has captured the imagination of movie patrons across south India, especially in Tamil Nadu and Kerala.", "url": "https://indianexpress.com/article/entertainment/tamil/kamal-haasan-on-vikram-box-office-success-7968956/", "urlToImage": "https://images.indianexpress.com/2021/11/Kamal-Haasan.jpg", "publishedAt": "2022-06-14T08:49:25Z", "content": "Tamil superstar Kamal Haasans latest movie Vikram is going from strength to strength. The film beat the Monday blues at the box office in its second week too. It has captured the imagination of movie… [+2008 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi court reserves order on Satyendar Jain’s bail plea in money laundering case", "description": "The ED had arrested Satyendar Jain on May 30 in an Enforcement Case Information Report (ECIR) registered by it on the basis of a case lodged by the CBI in August 2017 under the Prevention of Corruption Act.", "url": "https://indianexpress.com/article/cities/delhi/delhi-court-satyendar-jain-bail-plea-money-laundering-case-7968931/", "urlToImage": "https://images.indianexpress.com/2022/06/Satyender-Jain-1200-1.jpg", "publishedAt": "2022-06-14T08:43:45Z", "content": "A court in Delhi Tuesday reserved its order on AAP minister Satyendar Jains bail plea in the money laundering case being investigated by the Enforcement Directorate. The court will pronounce the orde… [+2511 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shahid Pervez", "title": "From Nupur unrest and bulldozer politics to AIMPLB shun-TV pitch to waiting for Rahul", "description": "‘A bulldozer has been turned into a symbol of the politics of fear,’ the Hyderabad-based daily Siasat says, stressing that the victims should take legal recourse and move courts and human rights panels to challenge it.", "url": "https://indianexpress.com/article/political-pulse/from-nupur-unrest-and-bulldozer-politics-to-aimplb-shun-tv-pitch-to-waiting-for-rahul-7968811/", "urlToImage": "https://images.indianexpress.com/2022/06/AP06_10_2022_000319B.jpg", "publishedAt": "2022-06-14T08:40:48Z", "content": "As street protests erupted in towns and cities across the country amid unrest over derogatory references made to the Prophet by ex-BJP spokespersons, Nupur Sharma and Naveen Jindal, which led to viol… [+9462 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Haryana man held for gold theft on Jaipur Superfast Express train", "description": "Search is on for three of his accomplices in connection with the theft that took place in the first class compartment.", "url": "https://indianexpress.com/article/cities/mumbai/haryana-man-held-for-gold-theft-on-jaipur-superfast-express-train-7969040/", "urlToImage": "https://images.indianexpress.com/2022/06/train-1.jpeg", "publishedAt": "2022-06-14T08:40:15Z", "content": "In a train robbery that took place in the first class compartment of Jaipur Superfast Express last month, a man from Haryana was arrested and gold worth Rs 12.50 lakh was recovered from him. The sear… [+925 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Shenaz Treasurywala on learning about ‘acclimatisation and altitude sickness the hard way’: ‘My oxygen levels are too low’", "description": "\"My heart is pumping too fast...\" Shenaz Treasurywala added while sharing that she also has chest pain and breathlessness", "url": "https://indianexpress.com/article/lifestyle/health/shenaz-treasurywala-leh-ladakh-acclimatisation-altitude-sickness-symptoms-causes-treatment-prevention-7967000/", "urlToImage": "https://images.indianexpress.com/2022/06/shenaz_final.jpg", "publishedAt": "2022-06-14T08:40:06Z", "content": "Shenaz Treasurywala loves to travel across the globe and explore new destinations. The former VJ also ensures to document her journeys — the highs and the lows — for her followers on Instagram. Shari… [+4040 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mumbai: Traffic restrictions in Bandra and BKC ahead of PM Modi’s visit", "description": "The PM will be attending Samachar Dwishatabdi programme at Bandra Kurla Complex (BKC) that comes under BKC traffic division limits.", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-pm-modi-visit-bandra-bkc-restrictions-7969037/", "urlToImage": "https://images.indianexpress.com/2022/06/modi-7-1.jpg", "publishedAt": "2022-06-14T08:39:33Z", "content": "Vehicular restrictions have been imposed in Bandra (West) and Bandra Kurla Complex in Bandra (East) regions of Mumbai as part of Prime Minister Narendras Modi visit to the city Tuesday. The Prime Min… [+1849 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "Hrithik Roshan is riled as he lands up in fast food major’s ad due to ‘jugaad’, netizens are all for this cheat meal", "description": "Hrithik Roshan reacted to the Burger King India ad and said, \"This is not done.\" However, fans and other brands are having a blast using memes and jokes online.", "url": "https://indianexpress.com/article/trending/trending-in-india/burger-king-uses-jugaad-to-feature-hrithik-roshan-in-ads-he-says-not-done-796866/", "urlToImage": "https://images.indianexpress.com/2022/06/hrithik-burger-king.jpg", "publishedAt": "2022-06-14T08:35:57Z", "content": "Getting a celebrity to endorse your product might be harder than one can think. However, trust desi folks to work around it, using some fantastic jugaad. Now, in a hilarious example, famous Bollywood… [+2615 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Bitcoin ATMs witness surge in installations amid crypto market meltdown", "description": "Bitcoin ATMs are dispensers where users can liquidate their cryptocurrencies in fiat directly.", "url": "https://indianexpress.com/article/technology/crypto/bitcoin-atm-witness-surge-in-installations-amid-crypto-market-meltdown-7968709/", "urlToImage": "https://images.indianexpress.com/2022/04/Untitled-design-2022-04-06T162353.656.jpg", "publishedAt": "2022-06-14T08:32:22Z", "content": "While the price of Bitcoin is falling sharply touching the $23,000 mark, as more and more investors lose trust in what’s called the ‘gold’ of the crypto market, ever since the stablecoin meltdown of … [+1811 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Appointment of Chief of Defence Staff will be made soon: Rajnath Singh", "description": "This comes six months after General Bipin Rawat, India's first Chief of Defence Staff, died in a helicopter crash in December 2021.", "url": "https://indianexpress.com/article/india/appointment-of-chief-of-defence-staff-will-be-made-soon-rajnath-singh-7969031/", "urlToImage": "https://images.indianexpress.com/2022/05/rajnath-singh-1200-3-1.jpg", "publishedAt": "2022-06-14T08:30:48Z", "content": "Union Defence Minister Rajnath Singh Tuesday said that the appointment of Chief of Defence Staff will be made soon.This comes six months after General Bipin Rawat, India’s first Chief of Defence Staf… [+1268 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Bajrang Dal to hold nationwide protest against violence over remarks against Prophet: VHP", "description": "The RSS affiliate said its youth wing activists will hold a sit-in in district administration headquarters across the country on Thursday against the \"growing extremist incidents by Islamic Jihadi fundamentalists\", and also submit a memorandum to President Ra…", "url": "https://indianexpress.com/article/delhi/bajrang-dal-to-hold-nationwide-protest-against-violence-over-remarks-against-prophet-vhp-7968971/", "urlToImage": "https://images.indianexpress.com/2022/06/nupur-sharma-protest-1.jpeg", "publishedAt": "2022-06-14T08:30:41Z", "content": "Bajrang Dal activists will hold a nationwide protest this week against the recent incidents of violence in parts of the country over remarks against Prophet Mohammad, the Vishva Hindu Parishad (VHP) … [+3132 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "‘Star performance’: Video shows leopard striking poses", "description": "In the clip, the big cat is seen walking near a tarred road and sitting for a while. It then stares ahead and sits on its hind legs with the other two in the air as if striking a pose.", "url": "https://indianexpress.com/article/trending/trending-in-india/video-shows-leopard-striking-poses-7969010/", "urlToImage": "https://images.indianexpress.com/2022/06/Leopard-posing.jpg", "publishedAt": "2022-06-14T08:26:41Z", "content": "Videos featuring delightful moments of big cats in the wild impress netizens, especially wildlife conservationists and nature lovers, every time they emerge on social media. Often, many marvel at the… [+1679 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "INS Vikrant cheating: Bombay HC extends interim protection from arrest to BJP leader Kirit Somaiya, son till July 7", "description": "A single-judge bench of Justice Bharati H Dangre extended the time to be given to Mumbai Police for filing its affidavit in reply to Somaiya’s plea.", "url": "https://indianexpress.com/article/cities/mumbai/ins-vikrant-cheating-bombay-hc-bjp-leader-kirit-somaiya-7968926/", "urlToImage": "https://images.indianexpress.com/2022/06/Kirit-Somaiya-1.jpg", "publishedAt": "2022-06-14T08:19:28Z", "content": "The Bombay High Court on Tuesday extended till July 7 an interim protection from arrest to BJP leader Kirit Somaiya and his son Neil Somaiya in connection with a cheating case alleging swindling of f… [+2170 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Soumyarendra Barik", "title": "Explained: Sequoia Capital’s startup funding boost for India", "description": "The venture capital fund has been an early backer of some of the biggest tech companies in the world including Apple, Google and WhatsApp.", "url": "https://indianexpress.com/article/explained/explained-sequoia-capitals-startup-funding-boost-for-india-7968743/", "urlToImage": "https://images.indianexpress.com/2022/06/Explained-2.jpg", "publishedAt": "2022-06-14T08:14:51Z", "content": "Sequoia Capital has raised $2.85 billion to invest in startups in India and Southeast Asia. Of this, the venture capital firm will deploy about $2 billion in Indian startups while the remaining $850 … [+2373 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Careers Desk", "title": "SSC MTS 2021 exam from July 5; check syllabus, exam pattern", "description": "The examination is popularly referred to as SSC MTS which is scheduled to be held from July 5 to July 22. 2022. The admit card for the examination will be released soon by the SSC at the official website — ssc.nic.in", "url": "https://indianexpress.com/article/jobs/ssc-mts-2021-admit-card-exam-from-july-5-check-syllabus-exam-pattern-ssc-nic-in-7968887/", "urlToImage": "https://images.indianexpress.com/2022/06/gettyimages-1300319705-612x612-1.jpg", "publishedAt": "2022-06-14T08:14:06Z", "content": "The Staff Selection Commission conducts the Multi-Tasking (Non-Technical) Staff to fill up group C posts in various departments/ agencies of the government. The examination is popularly referred to a… [+1642 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shashank Nair", "title": "Possible FIFA ban, future of coach Stimac and over-reliance on Chhetri: As India qualify for Asian Cup, focus shifts on other pressing issues", "description": "The road to the Asian Cup though, was made needlessly hard by an Indian team that underperformed against teams ranked below them.", "url": "https://indianexpress.com/article/sports/football/possible-fifa-ban-future-of-coach-stimac-and-over-reliance-on-chhetri-as-india-qualify-for-asian-cup-focus-shifts-on-other-pressing-issues-7968948/", "urlToImage": "https://images.indianexpress.com/2022/06/Untitled-design-3-2.jpg", "publishedAt": "2022-06-14T08:05:41Z", "content": "The Indian national football team qualified for the 2023 AFC Asian Cup as one of the eleven teams that could have gone through in the third round of the qualifiers. Their qualification was confirmed … [+5487 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Russian forces cut off last routes out of eastern Ukraine city", "description": "Late on Monday, President Volodymyr Zelenskiy said the battle for the eastern Donbas would go down as one of the most brutal in European history.", "url": "https://indianexpress.com/article/world/russian-forces-cut-off-last-routes-out-of-eastern-ukraine-city-volodymyr-zelenskiy-putin-invasion-war-7968904/", "urlToImage": "https://images.indianexpress.com/2022/06/Ukraine-Russia-weapons-featured-image-1.jpg", "publishedAt": "2022-06-14T08:01:26Z", "content": "Russian forces cut off the last routes for evacuating citizens from the eastern Ukrainian city of Sievierodonetsk, a Ukrainian official said, as the Kremlin pushed for victory in the Donbas region. T… [+4750 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Police investigating killings of 12,000 Ukrainians in war", "description": "Ukraine's national police chief says authorities are investigating the killings of more than 12,000 Ukrainians nationwide in the war Russia is waging.", "url": "https://indianexpress.com/article/world/police-investigating-killings-of-12000-ukrainians-in-war-7968839/", "urlToImage": "https://images.indianexpress.com/2022/06/APTOPIX_Russia_Ukraine_War_27383.jpg", "publishedAt": "2022-06-14T07:54:26Z", "content": "The lush green beauty of a pine forest and singing birds contrasted with the violent deaths of newly discovered victims of Russia’s war in Ukraine, as workers exhumed bodies from another burial site … [+7466 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "Kerala SSLC 10th Result 2022 Date, Time and Websites announced", "description": "Kerala Pareeksha Bhavan to Announce Kerala SSLC Result 2022 on June 15: Students who appeared for the class 10 board examinations will be able to check their respective results at the official website — results.kerala.nic.in or kerala.gov.in.", "url": "https://indianexpress.com/article/education/kerala-sslc-10th-result-date-time-websites-announced-saphlam-results-kerala-gov-in-7959112/", "urlToImage": "https://images.indianexpress.com/2022/06/UK-result-1-1.jpg", "publishedAt": "2022-06-14T07:53:55Z", "content": "DHSE Kerala board SSLC 10th result 2022: Kerala Board of Public Examinations (KBPE) will announce the results for the Secondary School Leaving Certificate (SSLC) or class 10 on June 15, 2022. Student… [+1783 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Delhi Police stops Rajasthan Congress chief Dotasra from entering capital, says party spokesperson", "description": "The move by the Delhi Police comes at a time when Congress leaders and workers are staging protests at several places, including Delhi, against the Enforcement Directorate notices to Congress president Sonia Gandhi and party leader Rahul Gandhi.", "url": "https://indianexpress.com/article/cities/jaipur/delhi-police-stops-rajasthan-congress-dotasra-entering-spokesperson-7968846/", "urlToImage": "https://images.indianexpress.com/2022/06/Capture-12.jpg", "publishedAt": "2022-06-14T07:53:07Z", "content": "The Delhi Police on Tuesday stopped Rajasthan Congress chief Govind Singh Dotasra from entering the national capital even as a party spokesperson claimed that he was on a personal visit."}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Justin Bieber shares health update amid facial paralysis struggle: ‘Found comfort in the one who designed me’", "description": "Justin Bieber had recently revealed that he's suffering from Ramsay Hunt syndrome, which has caused partial face paralysis.", "url": "https://indianexpress.com/article/entertainment/music/justin-bieber-health-update-facial-paralysis-ramsay-hunt-syndrome-7968782/", "urlToImage": "https://images.indianexpress.com/2022/06/justin1200.jpg", "publishedAt": "2022-06-14T07:52:27Z", "content": "A few days after Canadian pop singer Justin Bieber revealed that he’s suffering from Ramsay Hunt syndrome, which has caused partial face paralysis, the artiste recently took to social media once agai… [+1603 chars]"}]}