{"status": "ok", "totalResults": 544, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Durgapur flight incident: DGCA begins inspection of entire SpiceJet aircraft fleet", "description": "The Directorate General of Civil Aviation (DGCA) also took off the roster the flight's crew, aircraft maintenance engineer (AME) and in-charge of SpiceJet's maintenance control centre, pending a probe.", "url": "https://indianexpress.com/article/india/india-news-india/durgapur-flight-incident-dgca-begins-inspection-of-entire-spicejet-aircraft-fleet-7898245/", "urlToImage": "https://images.indianexpress.com/2022/03/spicejet-express-archieve-1200.jpg", "publishedAt": "2022-05-02T14:50:15Z", "content": "India’s aviation regulator DGCA on Monday announced that it is carrying out an inspection of the entire SpiceJet aircraft fleet after its Mumbai-Durgapur plane ran into a severe turbulence leading to… [+1077 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Evelyn Sharma on new life in Australia’s countryside: ‘Glamorous life, I do miss it sometimes…’", "description": "Evelyn Sharma has been a part of movies like Yaariyaan, Kuch Kuch Locha Hai, Yeh Jawaani Hai Deewani, Main Tera Hero among others. She currently lives in Australia with her husband and daughter.", "url": "https://indianexpress.com/article/entertainment/bollywood/evelyn-sharma-on-new-life-in-australias-countryside-glamorous-life-i-do-miss-it-sometimes-7898229/", "urlToImage": "https://images.indianexpress.com/2022/05/sharma1200.jpg", "publishedAt": "2022-05-02T14:37:44Z", "content": "Actor Evelyn Sharma is enjoying her cosy home in Australia’s countryside, Chinchilla, with husband Tushaan Bhindi and daughter Ava Rania Bhindi.Recently, the former model and actor, spoke to Australi… [+1250 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kamaldeep Singh Brar", "title": "Told police you stop march, we won’t come out of gurdwara: Patiala clash ‘mastermind’ to web channel", "description": "In the interview, Parwana said, “It is a common practice that police keep Sikh leaders under house arrest in view of Operation Blue Star anniversary on June 6. Police could have done the same with the Shiv Sena leaders to avoid trouble.”", "url": "https://indianexpress.com/article/cities/amritsar/told-police-you-stop-march-we-wont-come-out-of-gurdwara-mastermind-web-channel-7898231/", "urlToImage": "https://images.indianexpress.com/2022/05/Patiala-clashes.jpg", "publishedAt": "2022-05-02T14:34:15Z", "content": "In an interview to a Punjabi web channel before his arrest on Sunday, Barjinder Singh Parwana, the mastermind of the Patiala clash which happened on April 29, claimed that he was not in favour of ste… [+1554 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Coal block allocation corruption case: Chargesheet accuses ex-coal secy of misleading PMO, CBI court takes cognisance", "description": "This case relates to the allocation of a coal block in Jharkhand to the accused company, Contisteel Limited. The CBI alleged the company “furnished false information to the Screening Committee so as to induce it to allot a coal block in Jharkhand to it”.", "url": "https://indianexpress.com/article/india/coal-block-allocation-corruption-case-accuses-ex-coal-secy-misleading-pmo-cbi-7898180/", "urlToImage": "https://images.indianexpress.com/2022/05/COAL22.jpg", "publishedAt": "2022-05-02T14:32:17Z", "content": "A special CBI court recently took cognisance of a supplementary chargesheet filed by the Central Bureau of Investigation (CBI) that has accused the former coal secretary HC Gupta of misleading the th… [+2261 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Eid Mubarak 2022: Wishes images, quotes, Whatsapp messages, status, photos and greetings", "description": "Happy Eid-ul-Fitr, Eid Mubarak 2022 Wishes Images HD, Status, Quotes, Shayari, Messages, GIF Pics, Photos: As you celebrate this auspicious occasion, don't forget to spread the festive cheer with your loved ones", "url": "https://indianexpress.com/article/lifestyle/life-style/eid-mubarak-2022-wishes-images-quotes-whatsapp-messages-status-photos-and-greetings-7886635/", "urlToImage": "https://images.indianexpress.com/2022/04/eid-mubarak.jpg", "publishedAt": "2022-05-02T14:30:27Z", "content": "Happy Eid-ul-Fitr 2022 (Eid Mubarak) Wishes Images, SMS, Messages, Status, Photos, Quotes:Eid ul Fitr, which commemorates the conclusion of the holy month of Ramadan, has finally arrived and will be … [+1676 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shubhajit Roy", "title": "PM Modi discusses strategic ties, global challenges with German Chancellor Scholz", "description": "In their first meeting in the German capital since Chancellor Scholz assumed office, both leaders hold a bilateral meeting, just before the sixth round of the biennial Inter-Governmental Consultations.", "url": "https://indianexpress.com/article/india/pm-modi-german-chancellor-scholz-discusses-strategic-ties-global-challenges-7898227/", "urlToImage": "https://images.indianexpress.com/2022/05/Modi-scholz-1200.jpg", "publishedAt": "2022-05-02T14:26:36Z", "content": "In their first meeting in Berlin since German Chancellor Olaf Scholz assumed office in December last year, Prime Minister Narendra Modis discussions with the German leader covered key areas of bilate… [+4360 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Janardhan Koushik", "title": "Tamil Nadu: FSSAI cracks down on manufacture, sale of non-licensed drinks", "description": "In the past few years, there have been several instances of children developing symptoms of nausea, vomiting, abdominal pain, and dyspnoea after consuming non-licensed aerated drinks.", "url": "https://indianexpress.com/article/cities/chennai/tamil-nadu-fssai-cracks-down-on-manufacture-sale-of-non-licensed-drinks-7898221/", "urlToImage": "https://images.indianexpress.com/2022/05/Shop-feature.jpeg", "publishedAt": "2022-05-02T14:25:41Z", "content": "With the India Meteorological Department (IMD) predicting sweltering heat in the coming days for much of Tamil Nadu, Food Safety and Standards Authority of India (FSSAI) officials in the southern sta… [+3091 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Villarreal’s European hopes hanging on win over Liverpool", "description": "Villarreal is only seventh in the Spanish league, nine points from the final qualification place for the European competition with four rounds to go.", "url": "https://indianexpress.com/article/sports/football/villarreals-european-hopes-hanging-on-win-over-liverpool-7898223/", "urlToImage": "https://images.indianexpress.com/2022/05/LIV-VILL.jpg", "publishedAt": "2022-05-02T14:22:36Z", "content": "The small Spanish city of Villarreal could be facing its last Champions League night in a while if it doesnt pull off another upset on Tuesday against Liverpool.The modest club ousted Juventus and Ba… [+3528 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Abhinav Rajput", "title": "Loudspeaker politics reaches Delhi, BJP MP asks L-G to check religious places", "description": "West Delhi MP and BJP leader Parvesh Sahib Singh Verma Monday requested L-G Anil Baijal for action in Delhi along the lines of Uttar Pradesh.", "url": "https://indianexpress.com/article/cities/delhi/loudspeaker-politics-reaches-delhi-bjp-mp-l-g-check-religious-places-7898222/", "urlToImage": "https://images.indianexpress.com/2022/04/loudspeaker-1200-2-1.jpg", "publishedAt": "2022-05-02T14:20:58Z", "content": "As the row over the use of loudspeakers at religious places in Maharashtra simmers, West Delhi MP and BJP leader Parvesh Sahib Singh Verma Monday requested L-G Anil Baijal for action in Delhi along t… [+2133 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Bengaluru study evaluates performance of low-cost particulate matter sensors", "description": "The Google-funded study, conducted by the Center for Study of Science, Technology and Policy and ILK Labs, has found that PM2.5, temperature, and relative humidity measurements of LCSs can be used to identify specific days or locations that are more polluted …", "url": "https://indianexpress.com/article/cities/bangalore/bengaluru-study-evaluates-performance-of-low-cost-particulate-matter-sensors-7898204/", "urlToImage": "https://images.indianexpress.com/2022/05/particulates.jpg", "publishedAt": "2022-05-02T14:10:58Z", "content": "A study to evaluate the performance of low-cost sensors (LCS) that measure PM 2.5 (particulate matter with a size less than or equal to 2.5 microns) has found that PM2.5, temperature, and relative hu… [+2298 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Mammootty’s Rorschach look is unsettling", "description": "Mammootty has unveiled the first look poster of his upcoming film Rorschach.", "url": "https://indianexpress.com/article/entertainment/malayalam/mammootty-rorschach-look-is-unsettling-7898196/", "urlToImage": "https://images.indianexpress.com/2022/05/Mammootty.jpg", "publishedAt": "2022-05-02T14:10:33Z", "content": "Malayalam superstar Mammootty on Monday unveiled the first look of his upcoming movie titled Rorschach. The poster is rather unsettling, suggesting that the movie is likely to be a crime thriller. We… [+1059 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Amitabh Bachchan found Alia Bhatt ‘beyond magnificent’ in Gangubai Kathiawadi, actor shares note she received from Big B", "description": "Alia Bhatt has received a letter of appreciation from superstar Amitabh Bachchan. Bachchan penned the complimentary words after watching Bhatt perform in Gangubai Kathiawadi.", "url": "https://indianexpress.com/article/entertainment/bollywood/amitabh-bachchan-found-alia-bhatt-beyond-magnificent-in-gangubai-kathiawadi-7898207/", "urlToImage": "https://images.indianexpress.com/2022/05/Alia-Bhatt.jpg", "publishedAt": "2022-05-02T14:09:51Z", "content": "Alia Bhatt received a heap of praise from Amitabh Bachchan for her performance in Sanjay Leela Bhansali’s Gangubai Kathiawadi. On Monday, Alia treated fans to a couple of her seflies, which were take… [+1620 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "French to be introduced in 30 Delhi govt schools", "description": "In the pilot phase, French will be introduced in the 30 SOSEs and is supposed to expand further to other schools depending on student interest.", "url": "https://indianexpress.com/article/cities/delhi/french-to-be-introduced-in-30-delhi-govt-schools-7898212/", "urlToImage": "https://images.indianexpress.com/2022/05/1-42.jpg", "publishedAt": "2022-05-02T14:08:25Z", "content": "The Delhi Board of School Education (DBSE) has signed an MoU with Institut Français en Inde (IFI) to introduce French in schools affiliated with it.The DBSE, launched last year by the Delhi governmen… [+1640 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Sports Desk", "title": "KKR-এ বাতিলের খাতায় ভেঙ্কটেশ! বদলের পর বদল ঘটিয়ে রাজস্থান ম্যাচে নামল নাইটরা", "description": "মাস্ট উইন ম্যাচে কেকেআর মুখোমুখি হয়েছে রাজস্থান রয়্যালসের বিরূদ্ধে। গুরুত্বপূর্ণ ম্যাচে কেমন দল সাজায় কেকেআর, সেটাই ছিল দেখার।", "url": "https://bengali.indianexpress.com/sports/ipl/ipl-2022-venkatesh-iyer-left-out-anukul-roy-in-kkr-xi-against-rajasthan-royals-438698/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/04/KKR.jpeg", "publishedAt": "2022-05-02T14:01:19Z", "content": ", \r\n- -, -, -, - - \r\n :  ! \r\n, \r\n : , , , , , , , , , , \r\nStay updated with the latest news headlines and all the latest Ipl news download Indian Express Bengali App.\r\nWeb Title: Ipl 2022 venkatesh i… [+57 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Britain’s Princess Charlotte marks seventh birthday", "description": "Three new photographs of Princess Charlotte, the daughter of Prince William and Kate Middleton, have been released by Britain's royal family to mark her seventh birthday on Monday.", "url": "https://indianexpress.com/article/lifestyle/life-style/britains-princess-charlotte-marks-seventh-birthday7898040/", "urlToImage": "https://images.indianexpress.com/2022/05/279471979_1001085537442662_531483623580879730_n.jpg", "publishedAt": "2022-05-02T14:00:52Z", "content": "Taken by her mother, the photographs show her sitting among bluebells in a cable knit blue jumper that matches the colour of the flowers around her. Charlotte’s birthday comes after Prince William an… [+1645 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "UAE-based Indian entrepreneur announces cash reward for Kerala if they win Santosh Trophy", "description": "Dr Shamsheer tweeted that he will offer Kerala football team a cash prize of Rs 1 crore if they lift the trophy.", "url": "https://indianexpress.com/article/sports/football/uae-based-indian-entrepreneur-announces-cash-reward-for-kerala-if-they-win-santosh-trophy-7898200/", "urlToImage": "https://images.indianexpress.com/2022/05/Shamsheer.jpg", "publishedAt": "2022-05-02T14:00:49Z", "content": "As Kerala waits with bated breath for the Santosh Trophy final on Monday night against Bengal, a UAE-based Indian entrepreneur Dr Shamsheer Vayalil has announced a cash reward if Kerala win the tourn… [+1669 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Priya Kumari Shukla", "title": "UPSC CSE Key – May 2, 2022: What you need to read today", "description": "Exclusive for Subscribers from Monday to Friday: The Indian Express UPSC Key May 2, 2022 will help you prepare for the Civil Services and other competitive examinations with cues on how to read, how to connect the dots and understand content from the most aut…", "url": "https://indianexpress.com/article/upsc-current-affairs/upsc-cse-key-may-2-2022-what-you-need-to-read-today-7898190/", "urlToImage": "https://images.indianexpress.com/2022/02/UPSC-Key-New.jpg", "publishedAt": "2022-05-02T13:54:42Z", "content": "FRONT PAGE\r\nRs 1.68 lakh crore in Apr, GST collection soars to all-time high\r\nSyllabus:\r\nPreliminary Examination: Economic and Social Development\r\nMains Examination: General Studies III: Inclusive gr… [+5085 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sukrita Baruah", "title": "Explained: 100 years of DU, the story of a university’s birth", "description": "The idea for the university began taking shape in 1911 when it was decided to shift the capital of India to Delhi from Calcutta. The onset of World War I, differences over the nature of the would-be university, and lack of funds kept the idea from coming to f…", "url": "https://indianexpress.com/article/explained/explained-delhi-university-100-years-birth-anniversary-7898189/", "urlToImage": "https://images.indianexpress.com/2022/05/delhi-university-100-years.jpg", "publishedAt": "2022-05-02T13:53:54Z", "content": "Between its inception with three colleges and 750 students in 1922 to its 90 colleges and 86 departments today with over 6 lakh students from across India, the 100-year story of the University of Del… [+5384 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Centre seeks more time from SC to respond to petitions challenging constitutional validity of sedition law", "description": "In an application filed before the court, the Centre said that while the draft of the affidavit is ready, it is still awaiting confirmation from the competent authority.", "url": "https://indianexpress.com/article/india/india-news-india/centre-seeks-more-time-sc-respond-petitions-challenging-constitutional-validity-of-sedition-law-7898199/", "urlToImage": "https://images.indianexpress.com/2022/04/supreme-court-1-9.jpg", "publishedAt": "2022-05-02T13:51:36Z", "content": "The Centre sought more time from the Supreme Court to submit its written response to petitions challenging the constitutional validity of section 124A of the Indian Penal Code dealing with the offenc… [+2515 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Border row: Karnataka CM Bommai says Ajit Pawar’s statement aims at political survival", "description": "Speaking on Maharashtra Day, the state’s Deputy CM had expressed regret that several Marathi-speaking villages in Karnataka were not part of Maharashtra.", "url": "https://indianexpress.com/article/cities/bangalore/border-row-karnataka-cm-bommai-says-ajit-pawars-statement-aims-at-political-survival-7898195/", "urlToImage": "https://images.indianexpress.com/2022/04/bommai-2-1.jpeg", "publishedAt": "2022-05-02T13:43:57Z", "content": "Karnataka Chief Minister Basavaraj Bommai on Monday slammed Maharashtra Deputy Chief Minister Ajit Pawars remarks on the border row between the two states and termed it a ploy by the Maharashtra gove… [+1130 chars]"}]}