{"status": "ok", "totalResults": 489, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Two held in Mumbai for raping woman at knifepoint, filming her", "description": "The police said they scanned footage from over a hundred CCTV cameras before zeroing in on the accused.", "url": "https://indianexpress.com/article/cities/mumbai/two-held-in-mumbai-for-raping-woman-at-knifepoint-filming-her-7921498/", "urlToImage": "https://images.indianexpress.com/2022/05/Indian-express-1-3-12.jpg", "publishedAt": "2022-05-17T06:50:55Z", "content": "The Mumbai police on Monday arrested two brothers for allegedly raping a 20-year-old woman at knifepoint at her residence and filming the act to threaten her, officers said.The police said an FIR was… [+1156 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "US Air Force says it conducted successful hypersonic weapon test", "description": "The test was conducted on Saturday off the coast of Southern California when a B-52 bomber released an Air-launched Rapid Response Weapon (ARRW), the Air Force said in a statement.", "url": "https://indianexpress.com/article/world/us-air-force-says-it-conducted-successful-hypersonic-weapon-test-7921475/", "urlToImage": "https://images.indianexpress.com/2021/10/57a74e6c2bad4d9f94b8e96b696e06c5-57a74e6c2bad4d9f94b8e96b696e06c5-92c9a2d2aa4a4894a970330071155fc2.jpg", "publishedAt": "2022-05-17T06:37:59Z", "content": "The US Air Force said on Monday it had conducted a successful test of a hypersonic weapon, which flew at five times the speed of sound.The test was conducted on Saturday off the coast of Southern Cal… [+659 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mumbai: Woman clicks on link to update PAN card, loses Rs 1.80 lakh", "description": "The woman told the police that on May 9, she received a text message on her phone that contained a link and asked her to update her PAN card details.", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-woman-clicks-on-link-to-update-pan-card-loses-rs-1-80-lakh-7921370/", "urlToImage": "https://images.indianexpress.com/2022/05/Pune-police-2.jpg", "publishedAt": "2022-05-17T06:34:25Z", "content": "A 34-year-old woman who works as an account officer in a private company in Mumbai was duped of Rs 1.80 lakh by a cyber-fraudster who sent her a text message with a phishing link asking her to update… [+123 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sana Farzeen", "title": "Taarak Mehta Ka Ooltah Chashmah: Shailesh Lodha aka Taarak Mehta quits show, producer trying hard to make him stay", "description": "Taarak Mehta Ka Ooltah Chashmah actor Shailesh Lodha has decided to quit the sitcom and even stopped shooting for it. Producer Asit Kumarr Modi, however, is trying to convince him to stay on.", "url": "https://indianexpress.com/article/entertainment/television/taarak-mehta-ka-ooltah-chashmah-shailesh-lodha-taarak-mehta-quits-producer-convince-him-7921365/", "urlToImage": "https://images.indianexpress.com/2022/05/shailesh-lodha-taarak-mehta.jpg", "publishedAt": "2022-05-17T06:34:05Z", "content": "India’s longest-running sitcom Taarak Mehta Ka Ooltah Chashmah is facing a crisis at present. Shailesh Lodha, who plays the character of Taarak in the show has decided to quit. As per sources, the po… [+2007 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Rajasthan’s Ramgarh Vishdhari Sanctuary notified as tiger reserve", "description": "According to \"Status of Tigers in India\" report released in 2019, there are 2,967 tigers in 20 states across the country.", "url": "https://indianexpress.com/article/lifestyle/destination-of-the-week/rajasthan-ramgarh-vishdhari-sanctuary-notified-tiger-reserve-7921245/", "urlToImage": "https://images.indianexpress.com/2022/05/tiger-reserve_1200_express-archives.jpg", "publishedAt": "2022-05-17T06:30:13Z", "content": "The Ramgarh Vishdhari Sanctuary in Rajasthanwas notified as India’s 52nd tiger reserve on Monday, Union Environment Minister Bhupender Yadav said.This is Rajasthan’s fourth tiger reserve after Rantha… [+1749 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "#InstagramDown: Users vent with memes, wonder if they should uninstall", "description": "According to Down Detector, Instagram recorded nearly 1,200 reports in India with users unable to load Reels or failing to upload anything on Stories.", "url": "https://indianexpress.com/article/trending/trending-in-india/instagram-down-again-people-vent-with-memes-7921254/", "urlToImage": "https://images.indianexpress.com/2022/05/instagram-down-memes.jpg", "publishedAt": "2022-05-17T06:28:08Z", "content": "Instagram again went down for a number of users on Monday, with many rushing over to Twitter to complain and ask what was wrong with the photo-sharing app this time. It has suffered a number of outag… [+2745 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "When Ajay Devgn appeared on Pakistani chat show, was asked by drag queen host if he imposes restrictions on Kajol", "description": "Ajay Devgn went on the Pakistani chat show Late Night with Begum Nawazish Ali in 2007, after the release of his film Omkara. He was also asked about his relationship with his wife, Kajol.", "url": "https://indianexpress.com/article/entertainment/bollywood/ajay-devgn-pakistani-chat-show-begum-nawazish-ali-kajol-7921426/", "urlToImage": "https://images.indianexpress.com/2022/05/ajay-devgn-pakistan-chat-show.jpg", "publishedAt": "2022-05-17T06:21:25Z", "content": "Actor Ajay Devgn fielded questions about his relationship with wife Kajol in a 2007 appearance on a Pakistani chat show hosted by drag queen Begum Nawazish Ali, the alter ego of Ali Saleem. Saleem ap… [+2109 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Mimansa Shekhar", "title": "The Boys 3 trailer: Billy Butcher is a supe as Homelander turns psychopathic", "description": "The Boys season 3 trailer suggests that the latest Prime Video series is a gore-fest, with new supes, new battles and characters changing sides.", "url": "https://indianexpress.com/article/entertainment/web-series/the-boys-3-official-trailer-billy-butcher-homelander-soldier-boy-fans-watch-amazon-prime-video-7921213/", "urlToImage": "https://images.indianexpress.com/2022/05/the-boys-3-12003.jpg", "publishedAt": "2022-05-17T06:15:22Z", "content": "There’s something wrong with the Homelander in the upcoming season three of The Boys, at least that’s what the trailer suggests. The fact that Billy Butcher is now a supe is also a trigger. But, what… [+2322 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "No dengue deaths in TN, but over 2,400 cases detected, says Health Minister", "description": "Last year, there were eight deaths due to the vector-borne disease and the toll peaked to 65, the maximum in the country, in 2017, the Minister said. However, awareness measures and prompt detection helped diagnose dengue at an early stage, he said.", "url": "https://indianexpress.com/article/cities/chennai/no-dengue-deaths-in-tn-but-over-2400-cases-detected-says-health-minister-7921444/", "urlToImage": "https://images.indianexpress.com/2021/11/dengue1-3.jpg", "publishedAt": "2022-05-17T06:15:21Z", "content": "Tamil Nadu registered zero death due to dengue fever and 2,485 confirmed cases since January this year, State Health and Family Welfare Minister Ma Subramanian said on Monday and expressed hope that … [+1668 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Amber Heard claims her role in Aquaman and the Lost Kingdom has been reduced, calls Elon Musk a ‘gentleman’", "description": "Amber Heard confirmed longstanding suspicions when she said that during her ongoing defamation trial against Johnny Depp that her role in the upcoming Aquaman sequel has been reduced.", "url": "https://indianexpress.com/article/entertainment/hollywood/amber-heard-claims-her-role-in-aquaman-and-the-lost-kingdom-has-been-reduced-johnny-depp-trial-7921292/", "urlToImage": "https://images.indianexpress.com/2021/07/amber-heard-1200.jpg", "publishedAt": "2022-05-17T06:12:15Z", "content": "Actor Amber Heard, confirming suspicions, said that she will appear in ‘a very pared-down version’ of her role as Mera in Aquaman and the Lost Kingdom. Heard appeared as the female lead in the first … [+1955 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "FYJC admissions delayed, registration was scheduled to start from today", "description": "As per the detailed schedule issued by the education department for the process, the mock round was expected to start on May 1 to go on till May 14.", "url": "https://indianexpress.com/article/education/fyjc-admissions-delayed-registration-was-scheduled-to-start-from-today-7921436/", "urlToImage": "https://images.indianexpress.com/2021/07/FYJC-1200.jpeg", "publishedAt": "2022-05-17T06:09:29Z", "content": "The process of First Year Junior College (FYJC=Class XI) admissions which was supposed to start on Tuesday is now postponed. Students will have to wait till May 23 for the mock round to start after w… [+1217 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "‘America better positioned to lead the world in 21st century’, Biden tells Indian-American social worker", "description": "Senators Jack Reed and Jeanne Shaheen sent special messages felicitating India and praising contributions made by the Indian-American community to the United States.", "url": "https://indianexpress.com/article/world/america-better-positioned-to-lead-the-world-in-21st-century-biden-tells-indian-american-social-worker-7921374/", "urlToImage": "https://images.indianexpress.com/2022/05/Biden-.jpeg", "publishedAt": "2022-05-17T06:06:33Z", "content": "The US is better positioned than any other country to lead the world in the 21st century, President Joe Biden has said, expressing hope that Americans will work together to find a common ground to ma… [+2131 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Odisha Mining Corporation to set up 5 model schools, skill academy", "description": "Odisha Chief Minister Naveen Patnaik said OMC has pioneered many developmental initiatives, steering positive changes in improving the quality of life of the people.", "url": "https://indianexpress.com/article/education/odisha-mining-corporation-announced-to-set-up-5-model-schools-skill-academy-7921344/", "urlToImage": "https://images.indianexpress.com/2022/04/delhi-schools-1.jpg", "publishedAt": "2022-05-17T06:05:42Z", "content": "The Odisha Mining Corporation (OMC) announced that it will set up five model schools and a skill academy in its operation area. OMC signed an agreement with Odisha Adarsha Vidyalaya Sangathan to set … [+1078 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Land deal goes wrong, Pune lawyer murdered; 4 held", "description": "The Pune Rural police have arrested four people, including a 22-year-old prime suspect, in the case.", "url": "https://indianexpress.com/article/cities/pune/land-deal-goes-wrong-pune-lawyer-murdered-4-held-7921428/", "urlToImage": "https://images.indianexpress.com/2022/05/arrest-12.jpg", "publishedAt": "2022-05-17T06:01:09Z", "content": "The investigation into a missing persons case involving a 60-year-old lawyer from Pune has revealed that he was abducted and murdered and his body was thrown into a hilly area in Lonavala after a dis… [+1109 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Try this refreshing drink to beat dehydration in summer (recipe inside)", "description": "Coconut drink with orange, lemon with peel and honey contains essential electrolytes, potassium and sodium to rehydrate the body, said fitness trainer Yasmin Karachiwala", "url": "https://indianexpress.com/article/lifestyle/food-wine/refreshing-drink-beat-dehydration-summer-recipe-7863961/", "urlToImage": "https://images.indianexpress.com/2022/04/GettyImages-coconut-water-coconut-drink-1200.jpg", "publishedAt": "2022-05-17T06:00:00Z", "content": "While it is advisable to drink water and keep yourself hydrated all throughout the year, the summer season is when the body can quickly lose its water content in the form of sweat.Which is why, it is… [+1104 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Moga: Youth dies of shock after ‘injecting drugs’, 4 booked", "description": "Police later booked and arrested four persons — Gagandeep Singh, Surya, Khali and Mani Singh, all from Sadhan Wali Basti, the infamous colony in Moga known for its drug trade — under Section 304 (culpable homicide not amounting to murder) of IPC.", "url": "https://indianexpress.com/article/cities/chandigarh/moga-youth-dies-of-shock-after-injecting-drugs-4-booked-7921408/", "urlToImage": "https://images.indianexpress.com/2022/05/Indian-express-1-3-12.jpg", "publishedAt": "2022-05-17T05:51:34Z", "content": "Ludhiana police has booked four people and arrested two mmen from Sadhan Wali Basti for allegedly supplying drugs to a youth, who died from alleged shock after injecting narcotics in his body in Moga… [+1370 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Raakhi Jagga", "title": "DSR will render farm labourers jobless, say unions; demand govt to step in", "description": "The Punjab government recently announced Rs 1,500 incentive per acre for farmers opting for Direct Seeding of Rice (DSR), which is known for saving water, during the paddy sowing season that starts from May 20.", "url": "https://indianexpress.com/article/cities/chandigarh/dsr-will-render-farm-labourers-jobless-say-unions-demand-govt-to-step-in-7921393/", "urlToImage": "https://images.indianexpress.com/2022/05/wheat-2-1.jpg", "publishedAt": "2022-05-17T05:38:05Z", "content": "There are murmurs of protest among the ranks of farm labourers of Punjab, who say that the government’s famed Direct Sowing of Rice (DSR) technique, once implemented, will potentially render them job… [+3757 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mumbai: Online booking for helicopter rides to Kedarnath goes wrong, woman duped of Rs 2.87 lakh", "description": "The woman told the police that the fraudster also asked her to pay Rs 32,207 as the insurance amount but she refused. She, however, claimed that after her conversation on the phone she received messages from her bank informing her that another Rs 1.98 lakh we…", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-online-booking-for-helicopter-rides-to-kedarnath-goes-wrong-woman-duped-of-rs-2-87-lakh-7921383/", "urlToImage": "https://images.indianexpress.com/2022/05/helicopter-1200.jpg", "publishedAt": "2022-05-17T05:37:22Z", "content": "A woman who tried booking tickets online for helicopter rides for 19 people from Mumbai for the Char Dham Yatra was duped by a cyber-fraudster. The fraudster impersonated an agent providing helicopte… [+1643 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "EC, AC members write to Delhi University VC against College of Art", "description": "The members said the college, which was yet to be de-affiliated from DU, had started its admission process for the 2022-23 academic year under Ambedkar University Delhi.", "url": "https://indianexpress.com/article/cities/delhi/ec-ac-members-write-to-delhi-university-vc-against-college-of-art-7921339/", "urlToImage": "https://images.indianexpress.com/2022/05/delhi-uni.jpg", "publishedAt": "2022-05-17T05:34:51Z", "content": "Eleven teachers of Delhi Universitys (DU) Academics for Action and Development, including Executive Council (EC) and Academic Council (AC) members, have written to the vice-chancellor seeking interve… [+2345 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Parthasarathi Biswas", "title": "Explained: Crop loan targets and why cooperative banks want action against commercial banks over not meeting it?", "description": "As of January 31, 2022, commercial banks, who had a target of Rs 36,571 crore, had disbursed Rs loans worth 22,837 crore (62 per cent). On the other hand, cooperative banks, whose target was Rs 20,584 crore, had lent Rs 15,555 crore (76 per cent).", "url": "https://indianexpress.com/article/explained/explained-crop-loan-targets-cooperative-commercial-banks-7921363/", "urlToImage": "https://images.indianexpress.com/2022/05/Farming-2.jpg", "publishedAt": "2022-05-17T05:34:32Z", "content": "While addressing the media in April, Vidyadhar Anaskar, the administrator of the Maharashtra State Cooperative (MSC) Bank had sought action against scheduled commercial banks for not adhering to the … [+5903 chars]"}]}