{"status": "ok", "totalResults": 572, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "‘Practical, sustainable’: Netizens all praise for Akasa Air’s comfy crew uniform", "description": "While the fabric of Mumbai-headquartered Akasa Air’s crew uniform is made of recycled material, the entire outfit – which includes sneakers – focuses on comfort.", "url": "https://indianexpress.com/article/trending/trending-in-india/netizens-all-praise-for-akasa-airs-comfy-crew-uniform-8008721/", "urlToImage": "https://images.indianexpress.com/2022/07/AIRLINE-UNIFORM.jpg", "publishedAt": "2022-07-04T12:52:21Z", "content": "When one thinks of crew uniforms for airlines, stiff skirts, crisp suits and pointy shoes come to mind. However, newly launched Akasa Air is changing this with its sustainable and comfortableuniforms… [+3773 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Search efforts resume after glacier collapse in Italian Alps", "description": "The avalanche took place on the Marmolada, which at more than 3,300 metres is the highest peak in the Dolomites, a range in the eastern Italian Alps straddling the regions of Trento and Veneto.", "url": "https://indianexpress.com/article/world/search-efforts-resume-after-glacier-collapse-in-italian-alps-8008714/", "urlToImage": "https://images.indianexpress.com/2022/07/glacier-1.jpg", "publishedAt": "2022-07-04T12:52:04Z", "content": "Search and rescue operations resumed on Monday in the Italian Alps with 17 people missing, authorities said, after part of a mountain glacier collapsed, killing at least six people and injuring eight… [+1097 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Lalu Prasad Yadav suffers a fracture after fall from stairs; expert shares tips for recovery", "description": "Shoulder fractures occur as a result of trauma or injury to the shoulder from a fall, sports injury, car accident or any direct blow", "url": "https://indianexpress.com/article/lifestyle/health/lalu-prasad-yadav-fracture-fall-stairs-dos-and-donts-recovery-8007401/", "urlToImage": "https://images.indianexpress.com/2022/07/lalu-prasad-yadav_200_express-photo-prashant-ravi.jpg", "publishedAt": "2022-07-04T12:50:51Z", "content": "Former chief minister of Bihar Lalu Prasad Yadav fractured his shoulder and injured his back after falling down from stairs at wife Rabri Devi’s house. Quoting a close aid, PTI reported that the “tes… [+5027 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Arun Janardhanan", "title": "DMK MP Raja’s heated pitch on ‘separate Tamil Nadu’, autonomy sets off fiery row", "description": "A Raja, has sparked a controversy by asking the BJP-ruled Centre not to compel the Dravidian party to revive the demand for a “separate Tamil Nadu” by denying state autonomy.", "url": "https://indianexpress.com/article/political-pulse/dmk-mp-raja-heated-pitch-on-separate-tamil-nadu-autonomy-8008646/", "urlToImage": "https://images.indianexpress.com/2022/07/A-Raja-1.jpg", "publishedAt": "2022-07-04T12:41:35Z", "content": "The DMK MP and ex-Union minister, A Raja, has sparked a controversy by asking the BJP-ruled Centre not to compel the Dravidian party to revive the demand for a separate Tamil Nadu by denying state au… [+6807 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manas Srivastava", "title": "UPSC Essentials: One word a day- TiHAN", "description": "What is TiHAN? Aspirants must take a note of this term in news for UPSC- CSE. Do not miss to solve the MCQ below the article.", "url": "https://indianexpress.com/article/upsc-current-affairs/upsc-essentials/upsc-essentials-one-word-a-day-tihan-8008568/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-45-1.jpg", "publishedAt": "2022-07-04T12:35:39Z", "content": "Subject: Science and Technology\r\n(Relevance: Technology is one of the favourite areas of UPSC for prelims. Often they ask what is in the news especially if there is a government initiative involved. … [+2083 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sanskriti Falor", "title": "Days after Udaipur Murder, market on Maldas Street open but no customers show up", "description": "Businesses on Maldas Street have taken a hit for the past few days as the curfew was imposed and the shops were shut for almost a week.", "url": "https://indianexpress.com/article/cities/jaipur/days-udaipur-murder-market-maldas-street-open-customers-8008600/", "urlToImage": "https://images.indianexpress.com/2022/07/udaipur-1-pti.jpg", "publishedAt": "2022-07-04T12:32:39Z", "content": "Almost a week after Udaipur tailor Kanhaiya Lal Teli was hacked to death, the situation in the city began to return to normalcy. With the curfew in Udaipur being relaxed for 12 hours on Monday, after… [+2911 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kanchan Vasdev", "title": "In first expansion, five new ministers join Punjab CM Mann’s Cabinet", "description": "Punjab, which has 117 members in its Assembly, can have up to 18 ministers, including the chief minister. Now three Cabinet berths remain vacant.", "url": "https://indianexpress.com/article/cities/chandigarh/expansion-five-new-ministers-join-punjab-cm-mann-cabinet-8008640/", "urlToImage": "https://images.indianexpress.com/2022/07/Punjab-pic.jpg", "publishedAt": "2022-07-04T12:32:10Z", "content": "Punjab Governor Banwarilal Purohit on Monday administered the oath of office and secrecy to five new ministers inducted by Chief Minister Bhagwant Mann into his Cabinet. The five who took oath includ… [+2393 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Voting starts in Papua New Guinea general elections", "description": "Amidst concerns of citizens selling their votes to candidates, the voting for Papua New Guinea's general elections started on July 4th; the elections will decide the coalition government for the next five years.", "url": "https://indianexpress.com/article/world/papua-new-guinea-general-elections-8008619/", "urlToImage": "https://images.indianexpress.com/2019/05/james-marape-fb-1200.jpg", "publishedAt": "2022-07-04T12:28:40Z", "content": "Voters started casting ballots on Monday in Papua New Guineas general elections to decide the coalition government that will rule one of the South Pacifics most populous and diverse nations for the n… [+926 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Tamil Nadu signs MoUs worth Rs 1.25 lakh crore, expected to generate 75,000 jobs", "description": "Chief Minister MK Stalin said during ‘Investment Concave 2022’ that the state should aspire to become the best investment destination in South Asia.", "url": "https://indianexpress.com/article/cities/chennai/tamil-nadu-signs-mous-worth-rs-1-25-lakh-crore-expected-to-generate-75000-jobs-8008657/", "urlToImage": "https://images.indianexpress.com/2022/07/chennai-2.jpg", "publishedAt": "2022-07-04T12:28:38Z", "content": "The Tamil Nadu government signed 60 memorandums of understanding (MoU) worth a cumulative investment of Rs 1,25,244 crore and an employment potential of 74,898 jobs at the Investment Concave 2022 in … [+1684 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Almost five years on, trial begins in Bengaluru for 18 accused of killing journalist Gauri Lankesh", "description": "An outspoken critic of Hindutva, the 55-year-old editor of Kannada tabloid Lankesh Patrike was shot dead outside her west Bengaluru home by two motorcycle-borne assassins on September 5, 2017.", "url": "https://indianexpress.com/article/cities/bangalore/gauri-lankesh-murder-trial-accused-8008655/", "urlToImage": "https://images.indianexpress.com/2021/09/Gauri-Lankesh.jpg", "publishedAt": "2022-07-04T12:26:37Z", "content": "The trial in the Gauri Lankesh murder case began on Monday at a sessions court in Bengaluru with the recording of the statements of a witness who met several of the accused two months after the murde… [+11934 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Harikishan Sharma", "title": "Hotels and restaurants can’t force customers to pay service charge, says Centre", "description": "Aggrieved consumers may lodge complaints on the National Consumer Helpline by calling 1915 or through the NCH mobile app or the e-daakhil portal.", "url": "https://indianexpress.com/article/india/hotels-restaurants-cant-force-customers-to-pay-service-charge-centre-8008561/", "urlToImage": "https://images.indianexpress.com/2022/07/restaurant-1.jpg", "publishedAt": "2022-07-04T12:18:42Z", "content": "The Central Consumer Protection Authority (CCPA), the governments top consumer watchdog, on Monday issued guidelines for preventing unfair trade practices and violation of consumer rights with regard… [+2324 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Christian Bale on playing Gorr the Butcher: ‘Taika made it bloody hilarious and moving’", "description": "Christian Bale is making his entry into the Marvel Cinematic Universe with Thor: Love and Thunder. The film releases on July 7 in India.", "url": "https://indianexpress.com/article/entertainment/hollywood/thor-4-star-christian-bale-on-being-gorr-the-butcher-mcu-7996763/", "urlToImage": "https://images.indianexpress.com/2022/06/bale1200.jpg", "publishedAt": "2022-07-04T12:18:40Z", "content": "Oscar-winning actor Christian Bale is making his entry into the Marvel Cinematic Universe with Thor: Love and Thunder. Bale will be playing the main antagonist Gorr the God Butcher in the Taika Waiti… [+1593 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Akasa Air unveils first look of its crew uniform", "description": "The airline, backed by ace stock market investor Rakesh Jhunjhunwala, is likely to start services by the end of this month.", "url": "https://indianexpress.com/article/business/aviation/akasa-air-unveils-first-look-of-its-crew-uniform-8008596/", "urlToImage": "https://images.indianexpress.com/2022/07/akasa-air-01-07-22_431461group-shot-min.jpg", "publishedAt": "2022-07-04T12:17:14Z", "content": "Akasa Air on Monday unveiled the first look of its crew uniform as the startup carrier prepares for take-off in the coming weeks.The airline, backed by ace stock market investor Rakesh Jhunjhunwala, … [+2220 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "China retrieves dozen bodies after typhoon Chaba sinks ship", "description": "Seven planes and hundreds of boats and fishing vessels are joining the search effort, state television said.", "url": "https://indianexpress.com/article/world/china-retrieves-dozen-bodies-after-typhoon-chaba-sinks-ship-8008457/", "urlToImage": "https://images.indianexpress.com/2020/09/Japan-Typhoon-Haishen.jpg", "publishedAt": "2022-07-04T12:14:09Z", "content": "Chinese search and rescue officials pulled 12 bodies on Monday from waters southwest of Hong Kong after an engineering vessel snapped in two as tropical storm Chaba passed through, state television s… [+1050 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Madras HC refuses to interfere with July 11 AIADMK general council meet", "description": "The petitioner can, at the best, approach Justice Krishnan Ramasamy, with the prayer to stall the conduct of the meeting, the bench said and adjourned further hearing on the plea for contempt to July 7.", "url": "https://indianexpress.com/article/cities/chennai/madras-hc-refuses-to-interfere-with-july-11-aiadmk-meet-8008289/", "urlToImage": "https://images.indianexpress.com/2022/07/AIADMK-1.jpg", "publishedAt": "2022-07-04T12:12:54Z", "content": "Madras High Court on Monday declined to interfere with the decision to conduct the general council meeting of the AIADMK on July 11, called for by the dominant Edappady K Palaniswami (EPS) camp.A div… [+4135 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "A polarized US celebrates Independence Day", "description": "As much of the nation takes a day off for backyard barbecues, Main Street parades, and fireworks displays, some Americans see democracy in peril and others see it as ascendant.", "url": "https://indianexpress.com/article/world/a-polarized-u-s-celebrates-independence-day-8008398/", "urlToImage": "https://images.indianexpress.com/2022/07/GettyImages-fourth-of-july-1200.jpg", "publishedAt": "2022-07-04T12:12:04Z", "content": "DeShanna Neal’s 7-year-old son stopped standing for the Pledge of Allegiance to the U.S. flag in school, questioning whether the United States of America really stood for, as the pledge says, “libert… [+3694 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Ajay Jadhav", "title": "Pune Municipal Corporation receives over 4,000 objections against draft electoral roll", "description": "The PMC has undertaken the exercise of finalizing the electoral roll for the forthcoming civic polls on the directions of the State Election Commission. It had published the draft electoral roll on June 23 and sought suggestions and objections of voters by Ju…", "url": "https://indianexpress.com/article/cities/pune/pune-mc-objections-draft-electoral-roll-8008634/", "urlToImage": "https://images.indianexpress.com/2022/06/PMC-1.jpeg", "publishedAt": "2022-07-04T12:11:47Z", "content": "The Pune Municipal Corporation (PMC) received 4,273 objections against the draft electoral roll published last month. The least number of objections came from the Aundh-Balewadi ward, while the maxim… [+2444 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Dutch farmers block entrances to supermarket warehouses", "description": "The unrest among Dutch farmers was triggered by a government proposal to slash emissions of some pollutants", "url": "https://indianexpress.com/article/world/dutch-farmers-block-supermarket-warehouses-8008529/", "urlToImage": "https://images.indianexpress.com/2022/07/dutchfarm.jpeg", "publishedAt": "2022-07-04T12:10:03Z", "content": "Dutch farmers, angry at government plans to slash emissions, used tractors and trucks Monday to blockade supermarket distribution centers, the latest actions in a summer of discontent in the country’… [+2313 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Telecom industry alerts against mobile tower installation fraud", "description": "The Telecom industry is cautioning the public against fraudsters who might approach them under the pretence of installing a mobile tower on their property.", "url": "https://indianexpress.com/article/technology/tech-news-technology/telecom-industry-alerts-dipa-coai-8008500/", "urlToImage": "https://images.indianexpress.com/2022/07/Tower-installation-fraudster-scam-telecon-industry.jpg", "publishedAt": "2022-07-04T12:09:34Z", "content": "DIPA (Digital Infrastructure Providers Association) and COAI (Cellular Operators Association of India), two telecom industry representative bodies, have issued a caution notice to the public against … [+2208 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "Watch: Leopard skillfully lands on feet after falling from tree", "description": "The video was shot in Panna Tiger Reserve in Madhya Pradesh.", "url": "https://indianexpress.com/article/trending/trending-globally/leopard-skillfully-lands-on-feet-after-falling-from-tree-8008615/", "urlToImage": "https://images.indianexpress.com/2022/07/leoprad-flying-jump.jpg", "publishedAt": "2022-07-04T12:08:38Z", "content": "All big cats like tigers and leopards are known for their sleath movements and speed, but a recent video, that is going viral on social media, shows that they are also capable of withstanding high fa… [+2635 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Karnataka: Science and technology minister lays foundation for anti-venom research centre in Bengaluru", "description": "The centre would be built at a cost of Rs 7 crore, officials said. It will come up on a total built-up area of about 16,000 sqft.", "url": "https://indianexpress.com/article/cities/bangalore/karnataka-science-and-technology-minister-foundation-anti-venom-research-centre-bengaluru-8008588/", "urlToImage": "https://images.indianexpress.com/2022/07/IMG-20220704-WA0065.jpg", "publishedAt": "2022-07-04T12:04:56Z", "content": "Science and Technology Minister Dr CN Ashwath Narayan laid the foundation for the Anti-Venom Research and Development Centre (AVRDC) at the Institute of Bioinformatics and Applied Biotechnology (IBAB… [+3283 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "This job seeker delivers ‘resume’ in box of pastries wearing Zomato uniform; food delivery company isn’t impressed", "description": "Khandelwal’s tweet triggered mixed reactions on the social media platform. Some were impressed with his antics while others pointed out that it was not the right way.", "url": "https://indianexpress.com/article/trending/trending-in-india/this-job-seeker-delivers-resume-in-box-of-pastries-wearing-zomato-uniform-8008569/", "urlToImage": "https://images.indianexpress.com/2022/07/Trending-Card-8-2.jpg", "publishedAt": "2022-07-04T12:01:27Z", "content": "It can be tough for job seekers to get the attention of recruiters. A Twitter user Aman Khandelwal did something quirky to get noticed among the crowd of job seekers and his tweet has gone viral.Khan… [+3333 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "July 4 celebrations in the US: From food to fireworks, know more about the traditions", "description": "On this day, United States officially became its own nation after the Declaration of Independence was adopted on July 4, 1776", "url": "https://indianexpress.com/article/lifestyle/life-style/july-4-celebrations-in-the-us-from-food-to-fireworks-traditions-8007640/", "urlToImage": "https://images.indianexpress.com/2022/07/GettyImages-fourth-of-july-1200.jpg", "publishedAt": "2022-07-04T12:00:48Z", "content": "July 4 celebrations in the US — also known as ‘Fourth of July’ — mark an incredibly significant moment in American history: it was the day the United States officially became its own nation after the… [+2282 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "GST on pre-packed labelled food items to increase traders’ compliance burden, raise prices: CAIT", "description": "CAIT Secretary General Praveen Khandelwal said that to protest against this decision of the GST Council, the traders' delegation will meet state finance ministers and hand over a memorandum to them.", "url": "https://indianexpress.com/article/business/business-others/gst-on-pre-packed-labelled-food-items-to-increase-traders-compliance-burden-raise-prices-cait-8008179/", "urlToImage": "https://images.indianexpress.com/2022/07/gst-759211.jpg", "publishedAt": "2022-07-04T11:57:40Z", "content": "Traders’ body CAIT on Monday said the decision to levy 5 per cent GST on pre-packed and labelled food items will cause loss of business to foodgrain traders, increase compliance burden and raise the … [+2179 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Foreign funds charges false, attempt to shut us down: Alt News", "description": "The Delhi Police had said that Pravda Media, under which Alt News operates, received over Rs two lakh through various transactions where either the mobile phone number or the IP address was of foreign countries.", "url": "https://indianexpress.com/article/cities/delhi/foreign-funds-charges-false-attempt-to-shut-us-down-alt-news-8008504/", "urlToImage": "https://images.indianexpress.com/2022/07/zubair.jpeg", "publishedAt": "2022-07-04T11:56:14Z", "content": "Fact-checking website Alt-News on Monday rejected allegations of the Delhi Police that it had received funds from foreign sources in violation of the law.The website also claimed that the multiple al… [+1596 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Kessie joins Barcelona as free agent after leaving AC Milan", "description": "The 25-year-old left AC Milan at the end of his contract in June after helping the Italian club win their first Serie A title in 11 years last season.", "url": "https://indianexpress.com/article/sports/football/kessie-joins-barcelona-as-free-agent-after-leaving-ac-milan-8008579/", "urlToImage": "https://images.indianexpress.com/2022/07/Kessie.jpg", "publishedAt": "2022-07-04T11:55:41Z", "content": "Ivory Coast midfielder Franck Kessie has joined Barcelona on a free transfer after leaving AC Milan, the LaLiga club announced on Monday.Barcelona said Kessie has signed a contract until June 2026 an… [+482 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Bloomberg", "title": "Geely chairman eyes phone-making by acquiring Meizu Tech", "description": "Founded nearly 20 years ago, Meizu was one of the pioneers of China’s fast-follower cadre of phone makers who built up their market by closely imitating the look and feel of Apple's iPhone", "url": "https://indianexpress.com/article/technology/tech-news-technology/geely-chairman-eyes-phone-making-by-acquiring-meizu-tech-8008570/", "urlToImage": "https://images.indianexpress.com/2022/07/Li-Shufu-Geely.jpg", "publishedAt": "2022-07-04T11:54:10Z", "content": "Li Shufu, founder and chairman of carmaker Zhejiang Geely Holding Group Co., is expanding his manufacturing empire to include smartphones and consumer electronics by acquiring a majority of shares in… [+2020 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sreenivas Janyala", "title": "PM Modi unveils 30-ft statue of freedom fighter Alluri Sitarama Raju in Andhra Pradesh", "description": "Hailing Alluri Sitarama Raju as an “inspiration” and “a symbol of bravery and courage of tribals”, Prime Minister Narendra Modi announced a museum and a tribal research institute in his memory.", "url": "https://indianexpress.com/article/cities/hyderabad/pm-modi-unveils-30-ft-statue-of-freedom-fighter-alluri-sitarama-raju-in-andhra-pradesh-8008564/", "urlToImage": "https://images.indianexpress.com/2022/07/Modi-2.jpg", "publishedAt": "2022-07-04T11:53:12Z", "content": "Prime Minister Narendra Modi unveiled a 30-feet bronze statue of Alluri Sitarama Raju at Bhimavaram in Andhra Pradeshs East Godavari district on Monday, the 125th birth anniversary of the freedom fig… [+3216 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Digital, smart cloakrooms operational at two railway stations in Bengaluru", "description": "Passengers at the KSR Bengaluru City and Bengaluru Cantonment stations can use the KLOAK app to operate the lockers and pay online.", "url": "https://indianexpress.com/article/cities/bangalore/digital-smart-cloakrooms-railway-stations-bengaluru-8008580/", "urlToImage": "https://images.indianexpress.com/2022/07/IMG-20220630-WA0012.jpg", "publishedAt": "2022-07-04T11:52:19Z", "content": "The Bengaluru division of the South Western Railway has started digital, smart cloakrooms (Digilockers) at the KSR Bengaluru City and Bengaluru Cantonment railway stations under the new, innovative n… [+815 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Dia Mirza shares lovely note for Neha Dhupia as she completes 20 years of Miss India win: ‘Celebrating this fierce, authentic…’", "description": "Neha Dhupia was crowned Miss India on this day two decades ago. Her colleague and actor Dia Mirza took to her social media handles to celebrate the occasion.", "url": "https://indianexpress.com/article/entertainment/bollywood/dia-mirza-shares-lovely-note-for-neha-dhupia-20-years-of-miss-india-8008378/", "urlToImage": "https://images.indianexpress.com/2022/07/dia1200.jpg", "publishedAt": "2022-07-04T11:50:50Z", "content": "Actor, activist and former beauty pageant winner Dia Mirza on Monday penned a short but lovely note for her colleague Neha Dhupia. It was on this day twenty years ago that Dhupia was crowned Miss Ind… [+1023 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Finally, openers fire as all-round India seal ODI series with 10-wicket drubbing", "description": "It is worth mentioning that the Indian team's openers fired for the first time on the tour, sharing a partnership of 174 runs to see the visitors home in just 25.4 overs and finally managing to silence their detractors after being pilloried for their below-pa…", "url": "https://indianexpress.com/article/sports/cricket/finally-openers-fire-as-all-round-india-seal-odi-series-with-10-wicket-drubbing-8008428/", "urlToImage": "https://images.indianexpress.com/2022/07/IND-SL-W-2.jpg", "publishedAt": "2022-07-04T11:40:59Z", "content": "The Indian women’s team dominated from start to finish, with both the bat and ball, to hammer Sri Lanka by 10 wickets in the second ODI and claim an unassailable 2-0 in the three-match series here on… [+2011 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "NASA satellite breaks from orbit around Earth, heads to moon", "description": "A satellite the size of a microwave oven successfully broke free from its orbit around Earth and is headed toward the moon.", "url": "https://indianexpress.com/article/technology/science/nasa-satellite-breaks-from-orbit-earth-heads-to-moon-8008552/", "urlToImage": "https://images.indianexpress.com/2022/06/Capstone-moon-mission-featured.jpg", "publishedAt": "2022-07-04T11:39:03Z", "content": "A satellite the size of a microwave oven successfully broke free from its orbit around Earth on Monday and is headed toward the moon, the latest step in NASA’s plan to land astronauts on the lunar su… [+2781 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "UPI transactions remain above Rs 10 lakh crore in June for second month in a row: NPCI data", "description": "The transaction value under Unified Payments Interface (or BHIM UPI) digital payments in June 2022 stood at Rs 10,14,384 crore, down by 2.6 per cent from the previous month, the National Payments Corporation of India (NPCI) data showed.", "url": "https://indianexpress.com/article/business/banking-and-finance/upi-transactions-remain-above-rs-10-lakh-crore-in-june-for-second-month-in-a-row-npci-data-8008531/", "urlToImage": "https://images.indianexpress.com/2022/07/bhim-upi-express-photo-1200.jpg", "publishedAt": "2022-07-04T11:34:07Z", "content": "UPI-enabled digital transaction remained above Rs 10 lakh crore in June for the second month in a row, data from NPCI showed on Friday.However, it was down by nearly 3 per cent from the previous mont… [+571 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Madhavan: ‘I was offered Ghajini, I didn’t like the story’", "description": "Madhavan reveals that he was director AR Murugadoss' first choice to play the blockbuster role of a man with a faulty memory, who goes on a killing spree to avenge his lover in Ghajini (2005). The film eventually landed in Suriya's lap.", "url": "https://indianexpress.com/article/entertainment/tamil/when-suriya-made-madhavan-question-his-life-choices-i-was-offered-ghajini-i-didnt-like-the-story-8008368/", "urlToImage": "https://images.indianexpress.com/2022/07/maddy-suriya.jpg", "publishedAt": "2022-07-04T11:31:57Z", "content": "Actor-producer Suriya last week hosted R Madhavan on a live Instagram session to promote the latter’s latest movie Rocketry: The Nambi Effect. During the conversation, the two had no hesitation in sh… [+2731 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sanjana Chawla", "title": "From Stree to Bhool Bhulaiyaa 2: The successful recipe of fun and fright", "description": "From Stree to Bhool Bhulaiyya 2—here are films which offer comedy and horror at the same time.", "url": "https://indianexpress.com/article/entertainment/bollywood/from-stree-to-bhool-bhulaiyaa-2-the-successful-recipe-of-fun-and-fright-8003655/", "urlToImage": "https://images.indianexpress.com/2022/07/stree-and-Bhool-Bhulaiyaa-2-1200.jpg", "publishedAt": "2022-07-04T11:31:47Z", "content": "From family dramas and romantic comedies to sci-fi and action films, the filmscape is constantly expanding. A new addition to the wagon of genres in the Hindi film industry is horror-comedy.A juxtapo… [+3222 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "NCP leader Ajit Pawar new Oppn leader in Maharashtra Assembly", "description": "Speaker Rahul Narvekar announced Ajit Pawar will take over as Leader of Opposition in the Assembly, adding that NCP has emerged as the single-largest Opposition party in the 288-member House.", "url": "https://indianexpress.com/article/cities/mumbai/ncp-leader-ajit-pawar-new-oppn-leader-in-maharashtra-assembly-8008432/", "urlToImage": "https://images.indianexpress.com/2022/06/pawar-1-1.jpeg", "publishedAt": "2022-07-04T11:31:11Z", "content": "Nationalist Congress Party (NCP) leader Ajit Pawar was named the Leader of Opposition in Maharashtra Assembly on Monday. He succeeds BJP’s Devendra Fadnavis, who was sworn in as Deputy CM on June 30,… [+795 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Chhavi Mittal emphasises on the importance of early detection of breast cancer", "description": "\"To do your self-examination is the first step. Mammograms are, of course, the second step. There's so much you can do to check yourself. Just be informed. Don't close your eyes to symptoms,\" the actor said", "url": "https://indianexpress.com/article/lifestyle/health/chhavi-mittal-early-detection-breast-cancer-importance-8005153/", "urlToImage": "https://images.indianexpress.com/2022/07/chhavi-1200.jpg", "publishedAt": "2022-07-04T11:30:36Z", "content": "Ever since Chhavi Mittal was diagnosed with breast cancer in April this year, she has been actively spreading awareness about the disease through her social media handles. From her diet and fitness r… [+1955 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "‘World’s deadliest garden’: This garden in England has over 100 poisonous plants that can kill", "description": "The 600,000 annual visitors that come to see the Alnwick Garden are only allowed access through guided tours, where they are strictly warned against “touching, smelling or tasting any plants”, according to the garden’s official website.", "url": "https://indianexpress.com/article/trending/trending-globally/worlds-deadliest-garden-england-8008464/", "urlToImage": "https://images.indianexpress.com/2022/07/POISON-FLOWER.jpg", "publishedAt": "2022-07-04T11:27:39Z", "content": "The world’s “deadliest” garden, dubbed the Poison Garden, can easily be mistaken for an immaculately manicured attraction at Alnwick in Northumberland. But on closer look, one would find over 100 var… [+2687 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Australia, India strengthen clean energy deal", "description": "Demand for critical metals like lithium and cobalt has soared in recent times due to their usage in electric vehicles amid a global push towards cleaner sources of energy to tackle climate change.", "url": "https://indianexpress.com/article/india/australia-india-clean-energy-deal-8008377/", "urlToImage": "https://images.indianexpress.com/2022/07/IND-AUS.jpg", "publishedAt": "2022-07-04T11:26:57Z", "content": "Australia and India on Monday agreed to a partnership to strengthen their co-operation in developing critical metal projects and supply chains, Australia’s resources minister said.Demand for critical… [+1022 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "“I have been cropped out of Ravi Shastri’s life,” Nasser Hussain jokes about been cut from photo shared on Shastri’s Twitter", "description": "Hussain referred to a past incident between the two on air. \"Ravi, you even put your arms on my shoulder and said we have put the past behind us!\"", "url": "https://indianexpress.com/article/sports/cricket/i-have-been-cropped-out-of-ravi-shastris-life-nasser-hussain-jokes-about-been-cut-from-photo-shared-on-shastris-twitter-8008362/", "urlToImage": "https://images.indianexpress.com/2022/07/Tweets.jpg", "publishedAt": "2022-07-04T11:23:19Z", "content": "The India vs England 5th Test has been ripe with a plethora of memorable moments, be it Rishabh Pant’s century in India’s first innings or Bairstow’s berserker form after a spat with Virat Kohli duri… [+2197 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "‘While in MVA, couldn’t laud Savarkar’: Eknath Shinde says development, Hindutva on his govt’s agenda", "description": "Shinde also claimed to have destroyed 16 dance bars that were \"spoiling the life of the youth\". \"I am the one who has vandalised 16 ladies' bars. Hundred cases are registered against me. (However) I ensured the ladies' bars remain shut.\"", "url": "https://indianexpress.com/article/cities/mumbai/eknath-shinde-maharashtra-assembly-speech-floor-test-shiv-sena-mva-8008338/", "urlToImage": "https://images.indianexpress.com/2022/07/shinde-2.jpg", "publishedAt": "2022-07-04T11:22:41Z", "content": "As the Shiv-Sena-BJP government in Maharashtra cleared the floor test with a majority of 164 votes in the 288-member House, Chief Minister Eknath Shinde said development and Hindutva are on the new r… [+2269 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Salary hike okayed, Delhi MLAs, ministers will be paid 67% more", "description": "The basic pay of the MLAs and ministers will now increase from Rs 12,000 to Rs 30,000 and allowances like travelling, telephone bills and others will go up to Rs 90,000.", "url": "https://indianexpress.com/article/cities/delhi/salary-hike-okayed-delhi-mlas-ministers-will-be-paid-67-more-8008430/", "urlToImage": "https://images.indianexpress.com/2022/07/manish-siso-delhi-pti-759.jpg", "publishedAt": "2022-07-04T11:21:29Z", "content": "The Delhi Assembly Monday passed five bills to increase the salaries and allowances of ministers, MLAs, and others by 66.67 per cent. The proposal will now be sent to the President and once it is app… [+2081 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kiran Parashar", "title": "Karnataka PSI recruitment scam: Senior IPS officer Amrit Paul arrested", "description": "Paul was ADGP of state police recruitment wing when the scam took place", "url": "https://indianexpress.com/article/cities/bangalore/karnataka-psi-recruitment-scam-senior-ips-officer-amrit-paul-arrested-8008437/", "urlToImage": "https://images.indianexpress.com/2022/07/arrest-1-2.jpg", "publishedAt": "2022-07-04T11:11:27Z", "content": "Written by Kiran Parashar\r\n | Bengaluru | Updated: July 4, 2022 4:45:04 pm\r\nSenior IPS officer Amrit Paul was arrested (Representational)In a major development in Karnataka’s Police Sub-Inspector sca… [+612 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "North Korea blames ‘alien things’ for Covid-19 outbreak in country", "description": "The North Korean authorities ordered its citizens “to vigilantly deal with alien things coming by wind and other climate phenomena and balloons in the areas along the demarcation line and borders,\" according to KCNA.", "url": "https://indianexpress.com/article/world/north-korea-blames-alien-things-for-covid-19-outbreak-in-country-8008436/", "urlToImage": "https://images.indianexpress.com/2022/06/north-korea.jpeg", "publishedAt": "2022-07-04T11:10:59Z", "content": "People touching alien things that fell near the border with South Korea led to the Covid-19 outbreak in North Korea, alleges a news report by a Pyongyang-backed agency.KCNA agency, announcing the fin… [+1666 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Best Weight Loss Pills: 4 Top OTC-Natural Diet Supplements for 2022", "description": "Choosing a weight loss tablet may be a difficult and time-consuming endeavor. Therefore, we decided to save you time and money by doing all the research.", "url": "https://indianexpress.com/article/lifestyle/best-weight-loss-pills-4-top-otc-natural-diet-supplements-for-2022/", "urlToImage": "https://images.indianexpress.com/2022/07/IE-Lead-Image-1200x667-1.jpg", "publishedAt": "2022-07-04T11:08:36Z", "content": "Weight loss is not an easy feat. You must exercise often, have a low-fat diet, and record your daily calorie intake. Therefore, numerous weight reduction drugs facilitate rapid weight loss and long-t… [+31752 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Stray dog attacks 13 people, including eight kids, in Surat", "description": "The injured children and adults were rushed to a hospital in Surat and given anti-rabies shots. Hospital authorities said their condition is normal.", "url": "https://indianexpress.com/article/cities/surat/stray-dog-attacks-13-people-including-eight-kids-in-surat-8008403/", "urlToImage": "https://images.indianexpress.com/2022/07/Stray-dog-File-Photo.jpg", "publishedAt": "2022-07-04T11:07:24Z", "content": "Thirteen people, including eight children below 10 years, were attacked by a stray dog in the walled city area in Surat Monday morning. The injured were rushed to New Civil Hospital for treatment.On … [+889 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Manchester City sign Kalvin Phillips from Leeds United", "description": "Phillips joined Leeds' academy at the age of 14 before making his senior debut in the 2014-15 season.", "url": "https://indianexpress.com/article/sports/football/manchester-city-sign-phillips-from-leeds-kalvin-phillips-manchester-city-leeds-united-pep-guardiola-english-premier-league-8008385/", "urlToImage": "https://images.indianexpress.com/2022/07/Kalvin_1200x667.jpeg", "publishedAt": "2022-07-04T11:02:49Z", "content": "Manchester City have signed England international midfielder Kalvin Phillips from Leeds United on a six-year contract, the Premier League champions announced on Monday. Financial details of the deal … [+2096 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "BSE Odisha Class 10 board result 2022: Date, time and websites announced", "description": "BSE Odisha Board 10th Result 2022 Date and Time: All those students who appeared for the examination can check their results at the official website — bseodisha.ac.in.", "url": "https://indianexpress.com/article/education/bse-odisha-class-10-board-result-2022-date-time-announced-bseodisha-ac-in-indiaresults-in-7957214/", "urlToImage": "https://images.indianexpress.com/2022/06/BSE-Odisha-Class-10-result-2022-2.jpg", "publishedAt": "2022-07-04T11:01:47Z", "content": "BSE Odisha Class 10 Result 2022: The Board of Secondary Education (BSE), Odisha will release the results for class 10 board examination on July 6 at 1 pm. All those students who appeared for the exam… [+1611 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Serivce", "title": "Hardeep Singh Puri at Express Adda: Time has come to tweak world order established after World War II", "description": "At a recent Express Adda in Delhi, Hardeep Singh Puri, Union Minister of Housing and Urban Affairs and Petroleum and Natural Gas, spoke about a changing world order, India’s dependency on oil, and the need for government intervention in real estate", "url": "https://indianexpress.com/article/india/time-has-come-to-tweak-the-world-order-established-after-world-war-ii-8008319/", "urlToImage": "https://images.indianexpress.com/2022/07/Hardeep-Singh-Puri-Express-Adda.jpeg", "publishedAt": "2022-07-04T11:01:31Z", "content": "At a recent Express Adda in Delhi, Hardeep Singh Puri, Union Minister of Housing and Urban Affairs and Petroleum and Natural Gas, spoke about a changing world order, Indias dependency on oil and the … [+10435 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "The Conversation", "title": "Four ways to stop thinking the worst will happen when you’re stressed", "description": "Catastrophising is a tendency to assume the worst will happen when imagining a future situation – even if you have evidence that this is not the most likely outcome", "url": "https://indianexpress.com/article/lifestyle/health/catastrophising-four-ways-to-stop-thinking-the-worst-will-happen-when-youre-stressed-8002946/", "urlToImage": "https://images.indianexpress.com/2022/05/mental-health-1200.jpg", "publishedAt": "2022-07-04T11:00:05Z", "content": "Imagine you have an interview for a new job tomorrow. Some people might think about what kind of questions they will be asked so that they can prepare, or imagine the interviewgoing well. For others,… [+5517 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Iram Siddique", "title": "2013 bid a failure, AAP tries new push in MP via civic polls", "description": "Party claims it has over 2.5 lakh workers, fields candidates in 14 of 16 municipal corporations", "url": "https://indianexpress.com/article/political-pulse/2013-bid-a-failure-aap-tries-new-push-in-mp-via-civic-polls-8008256/", "urlToImage": "https://images.indianexpress.com/2022/07/Kejriwal-1.jpg", "publishedAt": "2022-07-04T10:59:06Z", "content": "The Aam Aadmi Party (AAP) is all set to make an entry in Madhya Pradesh in the coming local body elections and has fielded candidates in 14 of the 16 municipal corporations. It has promised the elect… [+3669 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "মর্মান্তিক! কেদারনাথের পথে ‘পিঠু’ থেকে গভীর খাদে পড়ে মৃত্যু শিশুর", "description": "শিশুটি পরিবারের সঙ্গেই কেদারনাথে যাচ্ছিল। পরিবারের অন্যরা হেঁটে উঠলেও শিশুটিকে এক ব্যক্তির 'পিঠু'-তে বসিয়েছিলেন বাবা-মা।", "url": "https://bengali.indianexpress.com/general-news/five-year-old-boy-dies-after-falling-off-pithoo-during-kedarnath-pilgrimage-465319/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/Kedarnath.jpg", "publishedAt": "2022-07-04T10:58:06Z", "content": "! ‘’ ‘’- ‘’ ‘’ ‘’ \r\n , , , \r\n - ! , \r\n , , - \r\n - , \r\n , ” , \r\n, , \r\nStay updated with the latest news headlines and all the latest General news download Indian Express Bengali App.\r\nWeb Title: Five … [+69 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "NCW seeks action against Akhilesh Yadav for remarks on Nupur Sharma", "description": "In a tweet, Yadav said, \"Not only the face but the body should also apologise and should also be punished for disturbing the harmony of the country.\"", "url": "https://indianexpress.com/article/india/ncw-seeks-action-against-akhilesh-yadav-for-remarks-on-nupur-sharma-8007919/", "urlToImage": "https://images.indianexpress.com/2022/07/Akhilesh-Yadav-11-1.jpg", "publishedAt": "2022-07-04T10:51:01Z", "content": "The National Commission for Women (NCW), on Monday asked police in Uttar Pradesh to take action against Samajwadi Party Chief, Akhilesh Yadav for allegedly instigating hatred and ill-will against sus… [+1323 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Mimansa Shekhar", "title": "Stranger Things 4 Volume 2 ending explained: Vecna’s fate, major death, season 5 tease and more", "description": "Stranger Things Season 4 Volume 2 ends on an emotional note, with the entire gang reuniting in Hawkins, post attempting to take down Vecna. But is the supervillain really dead? The Netflix show's season 5 will mark its finale.", "url": "https://indianexpress.com/article/entertainment/web-series/stranger-things-4-volume-2-ending-explained-vecna-fate-eddie-death-season-5-tease-eleven-max-and-more-8007361/", "urlToImage": "https://images.indianexpress.com/2022/07/stranger-things-4-ending-eleven-eddie-vecna-1200.jpg", "publishedAt": "2022-07-04T10:48:30Z", "content": "The fact that Netflix briefly crashed minutes after the release of Stranger Things Season 4 Volume 2 on Friday, proves the excitement with which fans were awaiting for its last two episodes to begin … [+5646 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Punjab vet varsity GADVASU produces first OPU IVF calf in state", "description": "GADVASU vice-chancellor Dr Inderjeet Singh said that a team of scientists under Dr Narinder Singh and Gurjot Kaur Mavi achieved the feat.", "url": "https://indianexpress.com/article/cities/ludhiana/punjab-vet-varsity-gadvasu-produces-first-opu-ivf-calf-8008358/", "urlToImage": "https://images.indianexpress.com/2022/07/calfgadvasu.jpg", "publishedAt": "2022-07-04T10:39:06Z", "content": "Punjab’s state vet varsity Guru Angad Dev Veterinary and Animal Sciences University, (GADVASU) Ludhiana, said Monday that its scientists have produced the state’s first elite female Sahiwal calf usin… [+2001 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "লোহার রড নিয়ে বেধড়ক মার কুকুরকে, ভিডিও ভাইরাল হতেই সক্রিয় পুলিশ", "description": "লোহার রড দিয়ে আঘাত করতেই মাটিতে লুটিয়ে পড়ে কুকুরটি।", "url": "https://bengali.indianexpress.com/viral/barking-dog-leads-to-brawl-as-man-hits-three-people-in-delhis-paschim-vihar-465295/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/delhi-dog.jpg", "publishedAt": "2022-07-04T10:36:19Z", "content": "The police have registered a case against Dharamvir Dahiya, who attacked the residents and struck the pet dog with an iron pipe on Sunday morning.\r\nRead: https://t.co/qQ0qrqTUhj\r\nTrigger Warning: Vis… [+130 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sohini Ghosh", "title": "Express Impact: NGT panel disallows discharge of treated sewage to protected wetland in Gujarat", "description": "The committee was formed after The Indian Express reported that a proposed sewage treatment plant of the Kalol municipality in Gandhinagar district had been allowed to discharge treated sewage to the Thol lake, designated a Ramsar wetland site in 2017.", "url": "https://indianexpress.com/article/cities/ahmedabad/express-impact-ngt-panel-discharge-treated-sewage-protected-wetland-gujarat-8008330/", "urlToImage": "https://images.indianexpress.com/2017/11/ngt-pti_l-1200.jpg", "publishedAt": "2022-07-04T10:32:43Z", "content": "A committee constituted by the National Green Tribunal (NGT) after The Indian Express reported that a proposed sewage treatment plant of the Kalol municipality in Gujarats Gandhinagar district had be… [+3758 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "‘Rubber stamp Rashtrapati’ remark: BJP slams Yashwant Sinha, says his appeal to Murmu depicts ‘nasty mindset’", "description": "BJP's C T Ravi was reacting to a question regarding Sinha urging BJP-led NDA's nominee Droupadi Murmu, who belongs to a tribal community in Odisha, to make an affirmation that she will not be a \"rubber stamp Rashtrapati\".", "url": "https://indianexpress.com/article/cities/bangalore/rubber-stamp-rashtrapati-bjp-slams-yashwant-sinha-droupadi-murmu-8008249/", "urlToImage": "https://images.indianexpress.com/2022/07/Yashwant-Sinha.jpeg", "publishedAt": "2022-07-04T10:28:39Z", "content": "Hitting back at joint opposition candidate for Presidential polls Yashwant Sinha for his “rubber stamp Rashtrapati” comments, BJP national General Secretary C T Ravi on Monday said a feeling that an … [+1753 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Workout tips for men over 40", "description": "\"With the right plan, the right actions, and the right determination, you can achieve your dream body at any age,\" said Miten Kakaiya, a fitness coach", "url": "https://indianexpress.com/article/lifestyle/fitness/workout-tips-men-over-40-gym-fitness-7972605/", "urlToImage": "https://images.indianexpress.com/2022/02/GettyImages-body-weight-fat-exercise-1200-1.jpg", "publishedAt": "2022-07-04T10:20:11Z", "content": "“One of the biggest myths is that you need to be in your 20s to achieve your dream body,” said Miten Kakaiya, fitness coach and founder of Miten Says Fitness. But, “the truth is,” he continued, “that… [+2534 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Entertainment Desk", "title": "তনুকাকু কান ধরে দাঁড় করিয়ে রাখতেন আমাকে: মৌসুমী চট্টোপাধ্যায়", "description": "তরুণ মজুমদারের প্রয়াণে মুম্বই থেকে স্মৃতিচারণায় অভিনেত্রী।", "url": "https://bengali.indianexpress.com/entertainment/balika-badhu-moushumi-chatterjee-on-tarun-majumdars-demise-465286/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/mousumi.jpg", "publishedAt": "2022-07-04T10:20:06Z", "content": "‘ ’ (Moushumi Chatterjee on Tarun Majumdar’s Demise) , , , (Bengali Director Tarun Majumdar Death) ‘ ’ \r\n ‘ ’ (Balika Badhu 1967) ! , “ , - ”\r\n[ : ! , ]\r\n“ ‘ ’ , ”, \r\n‘ ’ ‘ ’ \r\n ,"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aksheev Thakur", "title": "EV batteries should be locally manufactured keeping in mind India’s weather conditions, say industry experts", "description": "Notably, Log9 Materials unveiled India’s first indigenously-developed cell manufacturing facility in Bengaluru in April. The state-of-the-art cell manufacturing facility built by Log9 is touted to be South East Asia’s largest cell production line.", "url": "https://indianexpress.com/article/cities/bangalore/ev-batteries-should-be-locally-manufactured-industry-experts-say-8008299/", "urlToImage": "https://images.indianexpress.com/2022/07/EV-batteries.jpg", "publishedAt": "2022-07-04T10:17:40Z", "content": "The Union governments recent approval of the Production Linked Incentive (PLI) scheme — National Programme on Advanced Chemistry Cell (ACC) Battery Storage — will encourage more local production of b… [+3539 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Bengaluru: Citizens’ forum calls for bandh on July 12 over Idgah ground ownership row", "description": "Chamarajpet Citizens' Federation plans to launch a door-to-door campaign and hold a massive rally from Sirsi Circle to Idgah Maidan.", "url": "https://indianexpress.com/article/cities/bangalore/bengaluru-citizens-forum-calls-for-bandh-on-july-12-over-idgah-ground-ownership-row-8008290/", "urlToImage": "https://images.indianexpress.com/2022/06/bbmp-office-1200-1-1-2.jpg", "publishedAt": "2022-07-04T10:09:14Z", "content": "Despite Bruhat Bengaluru Mahanagara Palike (BBMP) stating that the Idgah Maidan at Chamarajpet is not its property, the controversy surrounding its ownership has not died down. A residents’ forum has… [+1910 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "After ‘Kaali’ poster sparks outrage online, filmmaker asks to use #loveyouLeenamanimekalai", "description": "The 'Kaali' poster sparked outrage online with many demanding her arrest, accusing her of hurting religious sentiments.", "url": "https://indianexpress.com/article/trending/trending-in-india/after-kaali-poster-sparks-outrage-online-filmmaker-asks-to-use-loveyouleenamanimekalai-8008260/", "urlToImage": "https://images.indianexpress.com/2022/07/Trending-Card-7-4.jpg", "publishedAt": "2022-07-04T10:09:02Z", "content": "Independent filmmaker Leena Manimekalai drew flak online days after she tweeted the poster of her latest documentary Kaali. The poster tweeted last Saturday shows a woman dressed as the Hindu Goddess… [+1670 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kamaldeep Singh Brar", "title": "Australian business delegation to visit Punjab, strengthening industry connections on agenda", "description": "Dr Parwinder Kaur, an award-winning scientist of Indian origin, and Punjabi writer Mintu Brar are part of the delegation and they expressed hope that the visit would prove to be fruitful for both Punjab and Western Australia.", "url": "https://indianexpress.com/article/cities/amritsar/australian-business-delegation-punjab-connections-agenda-8008229/", "urlToImage": "https://images.indianexpress.com/2022/07/parwinder-kaur-mintu-brar.jpg", "publishedAt": "2022-07-04T10:05:20Z", "content": "A part of an Australian delegation led by Western Australia deputy premier Roger Hugh Cook will be on a three-day Punjab visit from July 6 to 8, according to sources. The delegation will visit the Go… [+1826 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Bloomberg", "title": "Many major economies to hit recession in next year, Nomura says", "description": "High inflation is likely to persist as price pressures have spread beyond commodities to services items, rentals and wages", "url": "https://indianexpress.com/article/world/many-major-economies-to-hit-recession-in-next-year-nomura-says-8008137/", "urlToImage": "https://images.indianexpress.com/2022/07/economy-2.jpg", "publishedAt": "2022-07-04T09:57:52Z", "content": "Many major economies will enter recessions over the next 12 months amid tightening government policies and rising living costs, pushing the global economy into a synchronized growth slowdown, accordi… [+1755 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Supreme Court to hear on July 6 plea on AIADMK leadership row", "description": "Senior advocate CS Vaidyanathan, appearing for the EPS faction, mentioned the matter for urgent listing, saying that the High Court division bench held an extraordinary sitting past midnight and passed the order at 4 am on June 23.", "url": "https://indianexpress.com/article/india/supreme-court-to-hear-on-july-6-plea-on-aiadmk-leadership-row-8008165/", "urlToImage": "https://images.indianexpress.com/2022/07/AIADMK-PTI.jpg", "publishedAt": "2022-07-04T09:57:04Z", "content": "The Supreme Court Monday said that it would hear on July 6, a plea filed by former Tamil Nadu Chief Minister Edappadi K Palaniswami (EPS) challenging the Madras High Court order staying the passing o… [+4116 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Asus ROG Phone 6 series launching tomorrow: How to watch livestream", "description": "Here is how you can livestream the launch of the Asus ROG Phone 6 series", "url": "https://indianexpress.com/article/technology/mobile-tabs/asus-rog-phone-6-rog-phone-6-pro-launch-india-livestream-price-specification-8008235/", "urlToImage": "https://images.indianexpress.com/2022/07/ASUS-ROG-Phone-6-featured.jpg", "publishedAt": "2022-07-04T09:55:46Z", "content": "Asus will launch the ROG Phone 6 and ROG Phone 6 Pro smartphpones at its For those who dare virtual event which will start streaming from 5.20 PM on July 5. You can watch the event live as it happens… [+1548 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "JugJugg Jeeyo box office collection: Varun Dhawan-Kiara Advani movie jumps ahead, earns Rs 67.54 cr", "description": "JugJugg Jeeyo box office collection: Raj Mehta-directed family entertainer is on a roll. Despite new releases like Rashtra Kavach Om and Rocketry: The Nambi Effect, the film continues to do well at the box office. Here's how much it's minted till now.", "url": "https://indianexpress.com/article/entertainment/bollywood/box-office-collection/jugjugg-jeeyo-box-office-collection-varun-dhawan-kiara-advani-movie-continues-its-strong-hold-8008032/", "urlToImage": "https://images.indianexpress.com/2022/07/jjjBO1200.jpg", "publishedAt": "2022-07-04T09:52:02Z", "content": "Anil Kapoor, Neetu Kapoor, Varun Dhawan and Kiara Advani’s family entertainer JugJugg Jeeyois still minting money at the box office, considering it released two weeks ago. The Raj Mehta directorial e… [+1947 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Apple’s iPhone 14 ‘Pro’ lineup could cost more, report says", "description": "If leaks are correct, the iPhone 14 Pro and iPhone 14 Pro Max could cost way more than their predecessors.", "url": "https://indianexpress.com/article/technology/mobile-tabs/apple-iphone-14-pro-lineup-could-cost-more-report-says-8008118/", "urlToImage": "https://images.indianexpress.com/2022/07/iphone-14.jpeg", "publishedAt": "2022-07-04T09:51:53Z", "content": "Apple is expected to launch the new iPhone 14 series in September, and just as expected, the lineup will offer massive upgrades, especially the high-end Pro models. But all these upgrades will come a… [+1657 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sport Desk", "title": "Watch: India captain Rohit Sharma hits the nets after recovering from Covid-19", "description": "Rohit Sharma missed the rescheduled fifth Test against England at Edgbaston due to Covid-19.", "url": "https://indianexpress.com/article/sports/cricket/watch-india-captain-rohit-sharma-hits-the-nets-after-recovering-from-covid-19-8008221/", "urlToImage": "https://images.indianexpress.com/2022/07/Rohit-Sharma.jpg", "publishedAt": "2022-07-04T09:44:31Z", "content": "Indian captain Rohit Sharma, who missed the rescheduled fifth Test against England at Edgbaston due to Covid-19 has recovered and is finally out of isolation..@ImRo45 – out and about in the nets! \r\nG… [+1151 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manas Srivastava", "title": "UPSC Essentials: Key terms of the past week", "description": "From Iskander-M, Kihoto Hollohan to Anthrax  — many key terms were in the news last week. Here's a highlight of some of the important terms useful for UPSC CSE Prelims and Mains preparation.", "url": "https://indianexpress.com/article/upsc-current-affairs/upsc-essentials/upsc-essentials-key-terms-of-the-past-week-8007398/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-44.jpg", "publishedAt": "2022-07-04T09:41:46Z", "content": "Essential key terms from the last weeks news categorised as per the relevance in the UPSC-CSE syllabus.Iskander-M missile system\r\nWhy in news?\r\n Russia has promised its ally Belarus a delivery of nuc… [+14355 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Rajinikanth praises Madhavan’s Rocketry: ‘I thank him for giving us such a film’", "description": "Superstar Rajinikanth is mighty impressed with Madhavan's directorial debut Rocketry: The Nambi Effect.", "url": "https://indianexpress.com/article/entertainment/tamil/rajinikanth-praises-madhavan-rocketry-i-thank-him-for-giving-us-such-a-film-8008097/", "urlToImage": "https://images.indianexpress.com/2021/09/Rajinikanth-1-1.jpg", "publishedAt": "2022-07-04T09:33:32Z", "content": "Superstar Rajinikanth on Monday heaped praises on Madhavan’s directorial debut Rocketry: The Nambi Effect. He said that it is a movie that everyone should watch while congratulating Madhavan for deli… [+1618 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "চরম বিপাকে উদ্ধব-ঘনিষ্ঠ সাংসদ, শিণ্ডে আস্থা ভোটে জিততেই গ্রেফতারি পরোয়ানা জারি", "description": "তাঁকে কাঠগড়ায় টেনে নিয়ে গিয়েছেন কিরীট সোমাইয়ার স্ত্রী। ১২ এপ্রিল আদালতে অভিযোগ দায়ের করেছেন।", "url": "https://bengali.indianexpress.com/politics/national/bailable-warrant-issued-against-shiv-sena-mp-sanjay-465220/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/01/Uddhav-Thackeray.jpg", "publishedAt": "2022-07-04T09:32:46Z", "content": ", ‘’ ‘ ’ \r\n , , -, - \r\n - ‘ ’ , , \r\n - , BJP- - \r\n ‘’ , \r\n, \r\nRead full story in English\r\nStay updated with the latest news headlines and all the latest National news download Indian Express Bengali … [+67 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Your next big star might come from public ground: HC tells BCCI; asks it to provide basic facilities to budding cricketers", "description": "The court  said cricket associations and the BMC could not cite lack of funds as a reason for not providing basic facilities.", "url": "https://indianexpress.com/article/sports/cricket/hc-tells-bcci-to-provide-basic-facilities-to-budding-cricketers-8008148/", "urlToImage": "https://images.indianexpress.com/2019/02/bcci-logo-1200.jpg", "publishedAt": "2022-07-04T09:30:23Z", "content": "“Your next big star might come from a public ground,” the Bombay High Court told the BCCI, the Maharashtra Cricket Association (MCA) and state authorities on Monday, while holding that these bodies m… [+2517 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Dermatologist tries Priyanka Chopra’s DIY lip scrub; gives verdict on its effectiveness", "description": "While lip scrubs can make your lips look hydrated and bright, the effects can be temporary, the dermatologist said", "url": "https://indianexpress.com/article/lifestyle/life-style/priyanka-chopra-diy-lip-scrub-benefits-dermatologist-answers-8003142/", "urlToImage": "https://images.indianexpress.com/2022/07/Priyanka-Chopra-1200-1.jpg", "publishedAt": "2022-07-04T09:30:18Z", "content": "Indians love using DIY masksand scrubs to give their skin a natural glow. While most of us take extra care of our face, we often forget our lips — one of the most delicate features.According to derma… [+1458 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "On trolls over ‘I will return’ remark, Fadnavis says forgiveness is his revenge", "description": "Fadnavis made the statement in the state Assembly after Chief Minister Eknath Shinde won the floor test", "url": "https://indianexpress.com/article/cities/mumbai/trolls-i-will-return-fadnavis-forgiveness-revenge-8008184/", "urlToImage": "https://images.indianexpress.com/2022/07/fadnavis-5.jpg", "publishedAt": "2022-07-04T09:30:17Z", "content": "Maharashtra Deputy Chief Minister Devendra Fadnavis, who faced trolling over his impassioned “I will return” assertion before the 2019 state Assembly polls, on Monday said he will avenge such trolls … [+1537 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Bombay HC seeks Maharashtra reply to plea against metro station renaming", "description": "The petition alleges the name was changed from Pathanwadi to Dindoshi under undue pressure from MLAs Atul Bhatkhalkar and Sunil Prabhu despite Dindoshi not being the nearest wadi.", "url": "https://indianexpress.com/article/cities/mumbai/bombay-hc-seeks-maharashtra-reply-to-plea-against-metro-station-renaming-8008058/", "urlToImage": "https://images.indianexpress.com/2022/07/Bombay-HC.jpg", "publishedAt": "2022-07-04T09:23:01Z", "content": "The Bombay High Court asked the Maharashtra government on Monday to reply within two weeks to a public-interest petition opposing the changing of a metro station’s name from Pathanwadi to Dindoshi.Th… [+1057 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "OnePlus TV 50 Y1S Pro launched, comes with 4K resolution: Details on price, offers", "description": "OnePlus TV 50 Y1S Pro: The latest mid-range TV from OnePlus has launched, and here's a look at specifications and other details.", "url": "https://indianexpress.com/article/technology/gadgets/oneplus-tv-50-y1s-pro-launched-comes-with-4k-resolution-details-on-price-offers-8008131/", "urlToImage": "https://images.indianexpress.com/2022/07/OnePlusTVY1SPro.jpg", "publishedAt": "2022-07-04T09:19:52Z", "content": "OnePlus is expanding its Y series lineup for smart televisions further with a new TV 50 Y1S Pro. The new TV has a starting price of Rs 32,999 and will go on sale on Amazon India as well as the OnePlu… [+2762 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "sandipta.bhanja", "title": "‘শেষ দেখা হল না’, স্বামী তরুণের প্রয়াণে হাউহাউ করে কাঁদছেন স্ত্রী সন্ধ্যা রায়", "description": "কিছুতেই বাঁধ মানছে না বর্ষীয়াণ অভিনেত্রীর চোখের জল।", "url": "https://bengali.indianexpress.com/entertainment/wife-sandhya-roy-breaks-down-on-tarun-majumdars-demise-465251/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/sandhya.jpg", "publishedAt": "2022-07-04T09:19:46Z", "content": "(Tarun Majumdar’s Death) - - - , , - , , (Actress Sandhya Roy) \r\n (Sandhya Roy on Tarun Majumdar) , “ , , ! , ”\r\n , “ ? ?”, \r\n[ : , ]\r\n - - (Tarun-Sandhya) , , , - \r\n - - ‘’- , \r\n ,"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Five-year-old Agra boy dies after falling off ‘pithoo’ during Kedarnath pilgrimage", "description": "Pithoo refers to a person who carries a pilgrim on his back during the trek. An FIR has been registered against an unidentified labourer from Nepal for causing the boy’s death due to negligence, the police said.", "url": "https://indianexpress.com/article/india/five-year-old-agra-boy-dies-after-pithoo-kedarnath-8008073/", "urlToImage": "https://images.indianexpress.com/2022/07/Amarnath.jpg", "publishedAt": "2022-07-04T09:15:25Z", "content": "A five-year-old boy who was travelling with his family to the Kedarnath shrine in Uttarakhand died after falling off his pithoo into a deep gorge, the police said. Pithoo refers to a person who carri… [+1573 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Arsenal sign striker Jesus from Manchester City", "description": "25-year-old Brazil international was signed in a deal worth 45 million pounds by the Gunners", "url": "https://indianexpress.com/article/sports/football/arsenal-sign-striker-jesus-from-manchester-city-gabriel-jesus-manchester-city-arsenal-mikel-arteta-english-premier-league-pep-guardiola-8008052/", "urlToImage": "https://images.indianexpress.com/2022/07/GJ_1200x667.jpeg", "publishedAt": "2022-07-04T09:13:00Z", "content": "Arsenal have signed Brazilian striker Gabriel Jesus from Manchester City on a long-term contract, the north London Premier League club announced on Monday.Financial details of the deal were not discl… [+785 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pimpri-Chinchwad: Four suspects nabbed eleven months after murder of property dealer", "description": "The police said seven men had been keeping a watch on the woman as she was a property dealer and moneylender, and also wore a lot of gold ornaments.", "url": "https://indianexpress.com/article/cities/pune/pimpri-chinchwad-four-suspects-nabbed-eleven-months-murder-property-dealer-8008116/", "urlToImage": "https://images.indianexpress.com/2022/07/pimprimurderteam.jpg", "publishedAt": "2022-07-04T09:11:32Z", "content": "Almost 11 months after a 53-year-old property dealer was found strangled to death with her limbs tied and mouth taped at her house in Chikhali, the crime branch of the Pimpri-Chinchwad police has arr… [+1387 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Santosh Singh", "title": "Former Bihar minister Narendra Singh, a product of ‘JP movement’, dies at 75", "description": "Singh was one of the few Bihar politicians who worked with all three stalwarts of state politics - Nitish Kumar, Lalu Prasad Yadav and the late Ram Vilas Paswan.", "url": "https://indianexpress.com/article/cities/patna/narendra-singh-former-bihar-minister-dies-8008063/", "urlToImage": "https://images.indianexpress.com/2022/07/bihar-minister-narendra-singh.jpg", "publishedAt": "2022-07-04T09:06:38Z", "content": "Narendra Singh, former Bihar agriculture minister and one of the key political leaders who emerged from the ‘JP movement’ in the state in the 1970s, died in Patna on Monday after a period of prolonge… [+2807 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Madhubala and Dilip Kumar’s fairytale romance ended because of ‘one sorry’: ‘Humari zindagi barbaad ho jayegi’", "description": "Dilip Kumar and Madhubala dated for nine years, before parting ways, ending one of the most popular Bollywood real-life romances.", "url": "https://indianexpress.com/article/entertainment/bollywood/madhubala-and-dilip-kumar-fairytale-romance-ended-because-of-one-sorry-madhur-bhushan-naya-daur-8007624/", "urlToImage": "https://images.indianexpress.com/2022/07/mughal-e-azam-1200.jpg", "publishedAt": "2022-07-04T09:00:22Z", "content": "Madhubala and Dilip Kumar’s love story is nothing short of a movie screenplay in itself. From romance to tragedy and heartbreak, it had all the elements. In fact, Madhubala’s sister Madhur Bhushan cl… [+1611 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "নিয়োগ ‘দুর্নীতি’, কারও বাবা তৃণমূল নেতা, কারও স্বামী সিপিএম, কেউবা প্রাথমিক শিক্ষকদের নেতা!", "description": "প্রাথমিকে চাকরি খুইয়ে কেউ ঘরছাড়া, কেউ বা ঘরবন্দি, তিন জেলায় ঘুরে দেখল ইন্ডিয়ান এক্সপ্রেস।", "url": "https://bengali.indianexpress.com/west-bengal/bengal-teacher-recruitment-shock-denial-at-homes-of-those-sacked-by-hc-465230/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/SSC-Candidate-Protest.jpg", "publishedAt": "2022-07-04T08:57:34Z", "content": ", \r\n - ’-’ - , ‘-’ ‘’ - \r\n‘’ , () , , , TET- \r\n - , ()- \r\n , \r\n - , !\r\n:\r\n , , ” ” \r\n , ” ? ”\r\n , , ( ) , \r\n , ” , , - - , , , ”\r\n - \r\n , , ”\r\n:\r\n , , \r\n , , , \r\n , ”\r\n , \r\n , ” , ”\r\n :\r\n ’ - () \r\n ,… [+256 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "PM Talked Of New Politics, Where Political Ecosystem Transcends Beyond Battering: Ravi Shankar Prasad", "description": "", "url": "https://indianexpress.com/videos/news-video/pm-talked-of-new-politics-where-political-ecosystem-transcends-beyond-battering-ravi-shankar-prasad/", "urlToImage": "https://images.indianexpress.com/2022/07/Copy-of-Social-Media-Conference-YouTube-Thumbnail-1.jpg", "publishedAt": "2022-07-04T08:57:22Z", "content": "As Uddhav Thackeray Quits As Chief Minister, All Eyes On Eknath Shinde, BJP"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Delhi Man Violently Attacks Neighbours With Iron Rod Over Barking Pet Dog", "description": "", "url": "https://indianexpress.com/videos/news-video/delhi-man-violently-attacks-neighbours-with-iron-rod-over-barking-pet-dog/", "urlToImage": "https://images.indianexpress.com/2022/07/Delhi-man-1.jpg", "publishedAt": "2022-07-04T08:52:38Z", "content": "As Uddhav Thackeray Quits As Chief Minister, All Eyes On Eknath Shinde, BJP"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "কিশোরীকে প্রাণে বাঁচিয়ে শিরোনামে ডেলিভারি বয়, আদায় করলেন কুর্ণিশ", "description": "সময়মত হাসপাতালে নিয়ে যাওয়াতে প্রাণে বাঁচেন মেয়েটি।", "url": "https://bengali.indianexpress.com/viral/amazon-delivery-man-hailed-for-saving-12-year-old-girl-from-horrific-injury-465226/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/amajon-delivery-exuctive.jpg", "publishedAt": "2022-07-04T08:52:28Z", "content": "Ravi, delivery boy of @amazonIN helped a girl who fet with a freak incident in Thane. She was playing on her school gate when it gave away and a part of iron pierced through her cheek, missing her ri… [+156 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Maharashtra CM Eknath Shinde wins floor test", "description": "The trust vote comes a day after BJP’s Rahul Narwekar was elected the Assembly Speaker with a majority of 164 votes in the 287-member House.", "url": "https://indianexpress.com/article/cities/mumbai/maharashtra-floor-test-eknath-shinde-shiv-sena-bjp-8007829/", "urlToImage": "https://images.indianexpress.com/2022/07/Eknath-1.jpg", "publishedAt": "2022-07-04T08:50:51Z", "content": "The five-day old Shiv Sena-BJP government led by Chief Minister Eknath Shinde comfortably won the floor test today, ending two weeks of political turmoil in Maharashtra. In the 288-member House, 164 … [+1607 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Motorola will launch the Moto G42 on July 11: Price, availability and specifications", "description": "Motorola has announced that the Moto G42 will launch on July 11. Here is everything you need to know about the device.", "url": "https://indianexpress.com/article/technology/mobile-tabs/motorola-moto-g42-india-launch-price-specifications-discount-offer-8008033/", "urlToImage": "https://images.indianexpress.com/2022/07/Moto-g42-India-launch-price-specifications.jpg", "publishedAt": "2022-07-04T08:49:00Z", "content": "Motorola announced the Moto G42, which will go on sale in the country on July 11. The phone will be powered by a Qualcomm Snapdragon 680 chipset. The smartphone will weigh about 174.5 grams and is IP… [+1601 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Expert shares important dos and don’ts in case of a dog bite", "description": "A man in Delhi was allegedly bitten by a dog following which he hit the canine with an iron pipe.", "url": "https://indianexpress.com/article/lifestyle/health/dog-bite-tips-treatment-8007947/", "urlToImage": "https://images.indianexpress.com/2022/07/dog-bite-main.jpg", "publishedAt": "2022-07-04T08:40:52Z", "content": "A man in Delhi was recently booked for allegedly attacking three people and striking a pet dog with iron pipe after it barked at him. According to the police, he was walking on the street when a pet … [+1795 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Careers Desk", "title": "UGC NET 2022: Subject-wise exam schedule released; check dates here", "description": "UGC NET 2022 is the eligibility test for Junior Research Fellowship (JRF) and Lectureship/Assistant Professors in universities and colleges in India", "url": "https://indianexpress.com/article/jobs/ugc-net-2022-subject-wise-exam-schedule-released-ugcnet-nta-nic-in-8008046/", "urlToImage": "https://images.indianexpress.com/2022/03/CSIR-UGC-NET.jpg", "publishedAt": "2022-07-04T08:40:44Z", "content": "The National Testing Agency (NTA) has released the UGC-National Eligibility Test (NET) schedule for December 2021 and June 2022 merged cycles. The schedule is available at the official website – ugcn… [+735 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Serivce", "title": "After cholera outbreak, Puducherry declares public emergency in Karaikal", "description": "People have been advised to follow hygiene practices like consuming boiled water for drinking, washing hands regularly, taking safe drinking water in public places and hotels, using a public toilet and avoiding open-air defecation, reporting any local governm…", "url": "https://indianexpress.com/article/cities/chennai/cholera-outbreak-puducherry-public-emergency-karaikal-8007969/", "urlToImage": "https://images.indianexpress.com/2022/07/pondy-cholera.jpg", "publishedAt": "2022-07-04T08:40:30Z", "content": "Puducherrys health department has declared a public health emergency in the Karaikal district following the outbreak of cholera in the region and said that it is taking all remedial and management me… [+3347 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Ranveer Singh says ‘I’m so scared of my mother-in-law’ as he joins Deepika Padukone, her family at Shankar Mahadevan’s concert", "description": "Ranveer Singh and Deepika Padukone were seen letting their hair down at Shankar Mahadevan's concert in the US. Watch all videos here", "url": "https://indianexpress.com/article/entertainment/bollywood/ranveer-singh-deepika-padukone-family-shankar-mahadevans-concert-scared-of-my-mother-in-law-8007934/", "urlToImage": "https://images.indianexpress.com/2022/07/ranveer-singh-deepika-padukone-shankar-mahadevan-concert.jpg", "publishedAt": "2022-07-04T08:37:33Z", "content": "Deepika Padukone and Ranveer Singh were captured having a fun time in the United States as they attended a concert by Shankar Mahadevan. The couple was also accompanied by Deepika’s parents Prakash P… [+2111 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "‘People always read books; the habit has only increased post pandemic’", "description": "\"Reading has been good in the last 10 years. Ever since the millennials came in, reading habit has gone up by about 30 to 35 per cent,\" says Anuj Bahrison, owner of Bahrisons Booksellers", "url": "https://indianexpress.com/article/books-and-literature/reading-books-habit-post-pandemic-e-book-printed-books-readers-millennials-8006807/", "urlToImage": "https://images.indianexpress.com/2022/07/book.jpg", "publishedAt": "2022-07-04T08:32:46Z", "content": "“Hi, I’m looking for A Good Girl’s Guide to Murder,” a young girl says to an attendant at a book store.\r\nFrom the towering stacks lining the insides of Bahrisons Booksellers, the attendant pulls the … [+5658 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "HDFC Bank records 21.5% loan growth in Q1", "description": "Gross transfers through inter-bank participation certificates and bills rediscounted, the bank's advances grew by around 22.5 per cent over June 30, 2021, HDFC Bank said in a regulatory filing.", "url": "https://indianexpress.com/article/business/banking-and-finance/hdfc-bank-records-21-5-loan-growth-in-q1-8007994/", "urlToImage": "https://images.indianexpress.com/2021/03/hdfc-bank-express-photo-1200.jpg", "publishedAt": "2022-07-04T08:29:24Z", "content": "Private sector HDFC Bank on Monday said the bank has registered a 21.5 per cent rise in loans to Rs 13,95,000 crore in the first quarter this fiscal.The credit book was Rs 11,47,700 crore as of June … [+1159 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "#Indigo trends on Twitter, memes poke fun at ‘mass bunk’", "description": "The Directorate General of Civil Aviation (DGCA) has sought a report from IndiGo on the delays.", "url": "https://indianexpress.com/article/trending/trending-in-india/indigo-trends-on-twitter-memes-poke-fun-at-mass-bunk-8007858/", "urlToImage": "https://images.indianexpress.com/2022/07/Trending-Card-2-4.jpg", "publishedAt": "2022-07-04T08:27:06Z", "content": "Notably, Tata Group-owned Air India’s recruitment drive for cabin crew members also started on the same day. The Directorate General of Civil Aviation (DGCA) has sought a report from IndiGo on the de… [+2518 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "ENG vs IND 5th Test Day 4 Live Score, Updates: Pant and Pujara to begin", "description": "ENG vs IND 5th Test Day 4 Live Cricket Score Streaming Online Today Match, Sony Ten 3, Sony Six, Sony Liv Live: India will be eyeing a win", "url": "https://indianexpress.com/article/sports/cricket/eng-vs-ind-5th-test-day-4-live-score-updates-8007796/", "urlToImage": "https://images.indianexpress.com/2022/07/eng-vs-ind-day-4.jpg", "publishedAt": "2022-07-04T08:25:15Z", "content": "Jasprit Bumrah: Right arm fast and awesome\r\nJasprit Bumrah: Right Arm Fast. The categorisation is oversimplifying Bumrah. He is many in onea versatile new-ball merchant; an old-ball virtuoso, a seam … [+895 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Gold, silver prices today: Gold surges Rs 548/10 gms, silver climbs Rs 240 per kg", "description": "Gold, Silver Rates Today News Update: The opening price for 999 purity gold was Rs 52,339 per 10 grams, up Rs 548 from Friday's closing price of Rs 51,791, while that for 999 purity silver was Rs 58,013 per kg, up Rs 240 from Rs 57,773. Click here to find out…", "url": "https://indianexpress.com/article/business/commodities/gold-silver-prices-today-july-4-bullion-mcx-8007740/", "urlToImage": "https://images.indianexpress.com/2022/07/gold-price-bullion-reuters-1200.jpeg", "publishedAt": "2022-07-04T08:24:19Z", "content": "Gold Silver prices today, July 04, 2022: Prices of gold and silver opened higher in the major spot markets on Monday, July 4, 2022.The opening price for the 999 purity gold was Rs 52,339 per 10 grams… [+2539 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Dr Samir Parikh", "title": "Six ways to fix your baby blues", "description": "The stigma around mental health, and perinatal mental health in particular, continues to prevent people from speaking up and reaching out for help, says Dr Samir Parikh, Director, Fortis, National Mental Health Programme", "url": "https://indianexpress.com/article/lifestyle/health/six-ways-to-fix-your-baby-blues-8007787/", "urlToImage": "https://images.indianexpress.com/2020/02/pregnancy-depression_1200.jpg", "publishedAt": "2022-07-04T08:23:51Z", "content": "We all speak about the joys of pregnancy and childbirth, looking forward to the arrival of the new-born with keen anticipation. The mental health challenges that expecting and new parents can experie… [+3628 chars]"}]}