{"status": "ok", "totalResults": 437, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Rohan Naahar", "title": "The Man from Toronto movie review: Kevin Hart’s new Netflix action-comedy is an assault on the senses", "description": "The Man from Toronto movie review: Featuring a grating performance by Kevin Hart, who is clearly overcompensating for co-star Woody Harrelson's utter disinterest in the entire thing, the new Netflix comedy is a chore to sit through.", "url": "https://indianexpress.com/article/entertainment/movie-review/the-man-from-toronto-movie-review-kevin-hart-woody-harrelson-netflix-action-comedy-7988804/", "urlToImage": "https://images.indianexpress.com/2022/06/the-man-from-toronto-movie-review.jpg", "publishedAt": "2022-06-24T10:49:59Z", "content": "In India, they say that every film has its destiny. This is usually used as an excuse to explain flops; when a movie is a hit, they throw success parties. Had The Man from Toronto been made in India,… [+4796 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Careers Desk", "title": "RSMSSB recruitment 2022: Applications invited for 5546 physical training instructors", "description": "Commencing from June 23, the registration period will last through July 22, 2022. The test will be conducted on September 25, 2022.", "url": "https://indianexpress.com/article/jobs/rsmssb-recruitment-2022-applications-invited-for-5546-physical-training-instructors-rsmssb-rajasthan-gov-in-7988879/", "urlToImage": "https://images.indianexpress.com/2022/06/pexels-startup-stock-photos-7112-1-2-1.jpg", "publishedAt": "2022-06-24T10:42:47Z", "content": "Rajasthan Subordinate and Ministerial Services Selection Board has invited applications for the post of Physical training instructors. Interested candidates can apply online at the official site of R… [+875 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Stunning close-up of Mercury captured by European-Japanese BepiColombo", "description": "BepiColombo is the European Space Agency's mission to Mercury, in collaboration with the Japan Aerospace Exploration Agency.", "url": "https://indianexpress.com/article/technology/science/stunning-close-up-of-mercury-captured-by-european-japanese-bepicolombo-7988779/", "urlToImage": "https://images.indianexpress.com/2022/06/BepiColombo-mercury-close-up-image.jpg", "publishedAt": "2022-06-24T10:41:33Z", "content": "The BepiColombo mission, a collaboration between the European Space Agency (ESA) and Japan Aerospace Exploration Agency (JAXA) captured this beautiful image of Mercurys crater-marked surface as the s… [+2453 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "German lawmakers vote to end ban on ‘advertising’ abortions", "description": "Under a compromise deal in 2019, former Chancellor Angela Merkel's government left the ban formally in place but allowed doctors and hospitals for the first time to say on their websites that they perform abortions.", "url": "https://indianexpress.com/article/world/german-lawmakers-vote-to-end-ban-on-advertising-abortions-7988798/", "urlToImage": "https://images.indianexpress.com/2022/06/abortion-1.jpeg", "publishedAt": "2022-06-24T10:40:37Z", "content": "German lawmakers voted Friday to end the country’s ban on advertising abortions, which has in the past led to doctors being prosecuted for providing information about the procedure to potential patie… [+1193 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shalini Langer", "title": "Elvis movie review: Flashy, frenetic and flamboyant retelling of Presley, the persona", "description": "Elvis movie review: You won't be able to look away from star Austin Butler as he takes to the stage as the King of Rock and Roll, even though Baz Luhrmann's film is told from the perspective of Tom Hanks' character.", "url": "https://indianexpress.com/article/entertainment/movie-review/elvis-movie-review-austin-butler-tom-hanks-baz-luhrmann-7988920/", "urlToImage": "https://images.indianexpress.com/2022/05/elvis1200-1.jpg", "publishedAt": "2022-06-24T10:35:27Z", "content": "Before Elvis, said John Lennon, there was nothing. This flashy, frenetic, typically flamboyant film by Baz Luhrmann gives you a good glimpse of why. When the wondrously Austin Butler takes to the sta… [+4896 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "UN rights office: Findings suggest Al Jazeera journalist killed by Israeli forces", "description": "\"It is deeply disturbing that Israeli authorities have not conducted a criminal investigation,\" Ravina Shamdasani, a spokesperson for the U.N. human rights office told a briefing in Geneva.", "url": "https://indianexpress.com/article/world/al-jazeera-journalist-shireen-abu-akleh-killed-un-rights-israeli-forces-7988860/", "urlToImage": "https://images.indianexpress.com/2022/06/akleh.jpg", "publishedAt": "2022-06-24T10:35:13Z", "content": "Findings show that Israeli security forces fired the bullets that killed Palestinian-American reporter Shireen Abu Akleh in May, and not indiscriminate firing from Palestinians, a spokesperson for th… [+139 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Maharashtra: Man from Beed writes to governor, demands to be made acting CM", "description": "The Shiv Sena-led MVA dispensation is currently facing a survival crisis due to a rebellion by Sena minister Eknath Shinde, who is camping in Guwahati along with 37 Sena legislators and 10 independents.", "url": "https://indianexpress.com/article/cities/mumbai/maharshtra-political-crisis-beed-man-letter-to-governor-acting-cm-7988795/", "urlToImage": "https://images.indianexpress.com/2022/06/uddhav-7.jpg", "publishedAt": "2022-06-24T10:27:52Z", "content": "In the midst of the political turmoil in Maharashtra, a man from Beed district has written to Governor Bhagat Singh Koshyari seeking that he be made the acting chief minister of the state.The Shiv Se… [+1015 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Esha Roy", "title": "‘Muslims increasingly under pressure’, Jamiat factions look to reunite", "description": "One of the largest bodies representing Indian Muslims, Jamiat Ulama-i-Hind split in 2008 over a leadership divide.", "url": "https://indianexpress.com/article/political-pulse/muslims-increasingly-under-pressure-jamiat-factions-look-to-reunite-7988871/", "urlToImage": "https://images.indianexpress.com/2022/06/Maulana-Mahmood-Madani.jpg", "publishedAt": "2022-06-24T10:25:30Z", "content": "Fourteen years after the Jamiat Ulama-i-Hind (JUH) split, the two factions of the influential Muslim religious organisation led by Deobandi clerics are working towards a merger.The split happened in … [+3979 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Kartik Aaryan gets McLaren GT, worth Rs 3.2 cr, as gift from Bhool Bhulaiyaa 2 producer Bhushan Kumar", "description": "Kartik Aaryan starrer Bhool Bhulaiyaa 2 has earned Rs 184.32 crore in India. Even on Thursday, its 35th day, the film managed to do a business of Rs 51 lakhs.", "url": "https://indianexpress.com/article/entertainment/bollywood/kartik-aaryan-mclaren-gt-rs-3-crore-car-gift-bhushan-kumar-bhool-bhulaiyaa-2-success-7988770/", "urlToImage": "https://images.indianexpress.com/2022/06/kartik-aaryan-bhushan-kumar.jpg", "publishedAt": "2022-06-24T10:23:13Z", "content": "Bollywood actor Kartik Aaryan has become the first Indian owner of the swanky McLaren GT. The car, which approximately costs Rs 3.2 crore, has been gifted to him by producer Bhushan Kumar following t… [+1470 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Ayurvedic remedies to soothe dry cough naturally", "description": "According to experts, while there are no specific causes, a dry cough can get triggered due to allergies or irritants", "url": "https://indianexpress.com/article/lifestyle/health/ayurvedic-remedies-soothe-dry-cough-7983473/", "urlToImage": "https://images.indianexpress.com/2021/09/cough_Tb_Getty1200.jpeg", "publishedAt": "2022-06-24T10:20:09Z", "content": "Dry cough or cough that doesn’t produce phlegm or mucus can be extremely troubling. According to experts, while there are no specific causes, a dry cough can get triggered due to allergies or irritan… [+973 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Nothing phone (1): How to pre-book the phone ahead of launch", "description": "Here's how you can pre-book the Nothing phone (1) ahead of its launch via the company's invite-only waitlist system.", "url": "https://indianexpress.com/article/technology/techook/nothing-phone-1-how-to-pre-book-the-phone-ahead-of-launch-7988830/", "urlToImage": "https://images.indianexpress.com/2022/06/Nothing-phone-1-pre-order.jpg", "publishedAt": "2022-06-24T10:11:52Z", "content": "Nothing has now confirmed that users will be able to get their hands on the Nothing phone (1) before it goes on sale via a new pre-order invite only system. The invite-only system, a similar mechanis… [+1905 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "KVPY 2022 result declared: How to check", "description": "KVPY 2022 result: The students who appeared in the exam can check their respective result through the official website — kvpy.iisc.ac.in.", "url": "https://indianexpress.com/article/education/iisc-kvpy-2022-result-declared-how-to-check-kvpy-iisc-ac-in-7935721/", "urlToImage": "https://images.indianexpress.com/2021/03/JAM-score-card-1200.jpg", "publishedAt": "2022-06-24T10:06:02Z", "content": "KVPY examinations were conducted on May 22, 2022. The answer keys were released on May 25 and the candidates were given the time to raise objections till May 27. \r\n“The marks of all the candidates wh… [+899 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Vallabh Ozarkar", "title": "Explained: Why local people want Navi Mumbai airport to be named after DB Patil, not Bal Thackeray", "description": "Massive protests against a proposal to name the upcoming Navi Mumbai international airport after Bal Thackeray have rocked Navi Mumbai, Raigad, Thane, and Palghar. Who was DB Patil, and why is he such a hero in this area?", "url": "https://indianexpress.com/article/explained/why-local-people-want-navi-mumbai-airport-to-be-named-after-db-patil-not-bal-thackeray-7988589/", "urlToImage": "https://images.indianexpress.com/2022/06/Navi-Mumbai-Airport.jpg", "publishedAt": "2022-06-24T10:04:42Z", "content": "The Navi Mumbai International Airport, said to be one of the largest greenfield airport projects in the world, is being built in Panvel. The airport, which is aimed at easing congestion at Mumbai’s C… [+3752 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Group of prominent citizens writes to Karnataka CM Bommai against ‘alienating communities’", "description": "\"Divisive actions aimed at alienating particular communities” will hamper development and hurt our state’s reputation, said the letter written by concerned citizens, including former IAS, IPS officers, artists, and writers to Karnataka Chief Minister Basavara…", "url": "https://indianexpress.com/article/cities/bangalore/prominent-citizens-write-to-karnataka-cm-bommai-against-alienating-communities-7988486/", "urlToImage": "https://images.indianexpress.com/2022/06/Basavaraj-Bommai-2-1-1.jpg", "publishedAt": "2022-06-24T10:02:03Z", "content": "A group of concerned citizens in Karnataka, including former IAS, IPS officers, artists, writers, and intellectuals, have written to chief minister Basavaraj Bommai to prevent the targeting of minori… [+3057 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Man Aman Singh Chhina", "title": "Man from Kasauli launched online hunt for stolen heritage thermometer", "description": "For years, passers-by on the Lower Mall could glance at the large ‘Stephens’ Inks’ thermometer hanging outside Hotel Alasia and know the temperature.", "url": "https://indianexpress.com/article/cities/shimla/man-from-kasauli-launched-online-hunt-for-stolen-heritage-thermometer-7988605/", "urlToImage": "https://images.indianexpress.com/2022/06/kasauli_1-horz_final.jpg", "publishedAt": "2022-06-24T09:58:04Z", "content": "In Himachal Pradeshs Kasauli, a priceless heritage item has been stolen and an online hunt has been started to locate it and inform potential auction houses abroad about its theft.For years, passers-… [+3117 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Veteran Odia actor Raimohan Parida found dead at his home, suicide suspected", "description": "Known for essaying negative roles, Raimohan Parida has acted in over 100 Odia films and 15 Bengali movies. He is survived by his wife and two daughters.", "url": "https://indianexpress.com/article/entertainment/regional/veteran-odia-actor-raimohan-parida-found-dead-at-his-home-suicide-suspected-7988761/", "urlToImage": "https://images.indianexpress.com/2022/06/raimohan-parida-suicide.jpg", "publishedAt": "2022-06-24T09:57:37Z", "content": "Veteran Odia film and theatre artiste Raimohan Parida was found dead at his residence in Prachi Vihar area of Bhubaneswar on Friday, police said.He was 58. Parida is survived by his wife and two daug… [+1223 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "IIM-Bangalore only Indian institute in top 50 B-schools category: QS Global Executive MBA Rankings", "description": "IIM Bangalore is the only Indian institute to have featured in the top 50 Business school list followed by the Indian School of Business, Hyderabad which ranked in the 111-120 group of the QS Global Executive MBA Rankings this year.", "url": "https://indianexpress.com/article/education/qs-global-executive-mba-rankings-two-indian-institutes-in-global-top-50-list-7988358/", "urlToImage": "https://images.indianexpress.com/2022/06/IIM-Bangalore.jpg", "publishedAt": "2022-06-24T09:56:55Z", "content": "The Indian Institute of Management (IIM) Bangalore is the only Indian institute to have featured in the top 50 of this year’s Quacquarelli Symonds (QS) Global Executive MBA Rankings. The institute ha… [+1884 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Malayalam actor Khalid dies", "description": "Khalid, known for his role in a popular Malayalam comedy serial, was acting in a Tovino Thomas-starrer at Vaikom near Kottayam, sources said.", "url": "https://indianexpress.com/article/entertainment/malayalam/actor-khalid-dead-7988674/", "urlToImage": "https://images.indianexpress.com/2022/06/Khalid-1200by667.jpg", "publishedAt": "2022-06-24T09:52:44Z", "content": "Theatre and film artiste Khalid died on a movie set near Vaikom on Friday, police said. He was 70. Khalid, known for his role in a popular Malayalam comedy serial, was acting for a Tovino-starrer at … [+132 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Court orders police case against UP MLA for insulting national flag", "description": "The complaint pertains to Anil Kumar hoisting the national flag upside down at a petrol pump on Independence Day last year.", "url": "https://indianexpress.com/article/india/court-orders-police-case-against-up-mla-for-insulting-national-flag-7988667/", "urlToImage": "https://images.indianexpress.com/2022/06/indian-flag-11.jpg", "publishedAt": "2022-06-24T09:45:06Z", "content": "A special MP-MLA court in Muzzafarnagar has directed police to register a case against RLD MLA from Purkazi constituency Anil Kumar on charges of insulting the national flag on Independence Day last … [+541 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Hyderpora encounter: SC to hear plea of man seeking exhumation of son’s body", "description": "Grover sought urgent listing of the plea, saying that with every passing day, it would get more difficult to exhume the body and that he has several judgements of the top court in his favour.", "url": "https://indianexpress.com/article/cities/jammu/hyderpora-encounter-sc-plea-exhumation-sons-body-7988684/", "urlToImage": "https://images.indianexpress.com/2022/06/SC-9.jpg", "publishedAt": "2022-06-24T09:36:33Z", "content": "The Supreme Court on Friday agreed to hear on June 27 a plea filed by a man seeking a direction to exhume the body of his son, who was dubbed a terrorist and killed in an encounter in November 2021, … [+2308 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mumbai businessman’s flat burglarized of Rs 54.14-lakh gold, diamond by former driver and aide", "description": "According to police, the driver had worked for the businessman for one year but was sacked because of inefficiency and he had made a duplicate key to his former employer’s flat.", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-businessmans-flat-burglarized-rs-54-14-lakh-gold-diamond-former-driver-and-aide-7988554/", "urlToImage": "https://images.indianexpress.com/2022/06/juhu_burglary.jpg", "publishedAt": "2022-06-24T09:36:05Z", "content": "A 34-year-old driver and his aide have been arrested for allegedly stealing gold and diamond ornaments worth Rs 54.14 lakh from the flat of a businessman at Juhu in Mumbai. All the stolen valuables h… [+1306 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "SL vs AUS 5th ODI Live Score Updates: Sri Lanka lose openers cheaply", "description": "SL vs AUS 5th ODI Live Cricket Score Streaming Online Today Match, Star Sports 1 Hindi, Hotstar Live: Sri Lanka opted to bat first against Australia.", "url": "https://indianexpress.com/article/sports/cricket/sl-vs-aus-5th-odi-live-score-updates-7988696/", "urlToImage": "https://images.indianexpress.com/2022/06/SL-vs-AUS-9.jpg", "publishedAt": "2022-06-24T09:35:00Z", "content": "SL vs AUS 5th ODI Live Cricket Score Streaming Online Today Match Updates: Here are the playing XIs:\r\nSri Lanka XI:\r\nDanushka Gunathilaka, Pathum Nissanka, Charith Asalanka, Kusal Mendis (wk), Dinesh… [+317 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Mira Kapoor shares photographs from Switzerland’s St. Moritz; know more about the place", "description": "The social media influencer shared pictures from St. Moritz in Switzerland, where she seems to be holidaying with her family. Her son, Zain, also made an appearance in one of the photos", "url": "https://indianexpress.com/article/lifestyle/destination-of-the-week/mira-kapoor-photographs-switzerland-st-moritz-town-tourism-7984283/", "urlToImage": "https://images.indianexpress.com/2022/06/Mira-Rajput-1200.jpg", "publishedAt": "2022-06-24T09:30:32Z", "content": "Mira Kapoor is on a dreamy vacation and has taken to social media to tease her followers with pictures from the idyllic Swiss countryside. So, if you were feeling mid-week blues, these photographs ma… [+2011 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Debraj Deb", "title": "Left trade unions in Tripura hold rally against Agnipath scheme, say it’s against national security", "description": "Trade union leaders cited the examples of three farm bills which had to be rolled back earlier in the face of continued protests", "url": "https://indianexpress.com/article/north-east-india/tripura/tripura-agnipath-protests-trade-unions-7988571/", "urlToImage": "https://images.indianexpress.com/2022/06/tripura-trade-unions-1200.jpg", "publishedAt": "2022-06-24T09:30:19Z", "content": "Tripura Left trade unions Friday organised a rally demanding the rollback of the Agnipath scheme, which is facing protests across the country for the past few days.Former Tripura transport minister a… [+2824 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Komal RJ Panchal", "title": "Ranbir Kapoor on marriage with Alia Bhatt: ‘Couldn’t ask for a better life partner, she’s my dal, tadka, pickle’", "description": "Ranbir Kapoor said that his life is perfect with Alia Bhatt as he spoke about getting married earlier this year.", "url": "https://indianexpress.com/article/entertainment/bollywood/ranbir-kapoor-on-marriage-with-alia-bhatt-couldnt-ask-for-a-better-life-partner-shes-my-dal-tadka-pickle-7988676/", "urlToImage": "https://images.indianexpress.com/2022/06/ranbir-alia-1200.jpg", "publishedAt": "2022-06-24T09:28:40Z", "content": "Actor Ranbir Kapoor launched the trailer of his upcoming dacoit drama Shamshera on Friday. Also present at the trailer launch were his co-stars Sanjay Dutt and Vani Kapoor. The actor, who reached lat… [+1851 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Yogesh Naik", "title": "MVA crisis: Uddhav frequently skipped intel briefings, say top police officers", "description": "Covid-19, surgeries, and postoperative recovery kept Maharashtra CM Uddhav Thackeray away from regular police briefings, say senior officers", "url": "https://indianexpress.com/article/cities/mumbai/mva-crisis-eknath-shinde-uddhav-thackeray-intel-briefings-police-shiv-sena-7988478/", "urlToImage": "https://images.indianexpress.com/2021/10/Uddhav-5.jpeg", "publishedAt": "2022-06-24T09:21:48Z", "content": "With the Maha Vikas Aghadi (MVA) leadership caught unawares by the rebellion in the Shiv Sena, many in Maharashtras political circles are upset about the intelligence failurethat left the government … [+2913 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "SC dismisses Zakia Jafri’s plea against clean chit to Narendra Modi in 2002 riots case: A timeline of how it played out", "description": "Ehsan Jafri, a former MP, was among 68 killed at Gulberg Society in Ahmedabad on February 28, 2002, a day after a coach of the Sabarmati Express was burnt at Godhra, killing 59 people and triggering riots in the state.", "url": "https://indianexpress.com/article/india/sc-zakia-jafri-plea-clean-chit-narendra-modi-timeline-7987980/", "urlToImage": "https://images.indianexpress.com/2022/06/ch511521.jpg", "publishedAt": "2022-06-24T09:14:55Z", "content": "The Supreme Court Friday dismissed a plea filed by Zakia Jafri, widow of former Congress MP Ehsan Jafri, challenging a clean chit given by the Special Investigation Team (SIT) to then Gujarat chief m… [+8171 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "‘This is insane’: Tweet complaining about YouTube ads goes viral", "description": "Twitter user complains about having to watch 3 YouTube ads before a video, gets over 3 lakh likes and over 23,000 retweets.", "url": "https://indianexpress.com/article/trending/trending-globally/tweet-complaining-about-youtube-ads-goes-viral-7988393/", "urlToImage": "https://images.indianexpress.com/2022/06/youtube-ads.jpg", "publishedAt": "2022-06-24T09:11:49Z", "content": "With more than 2.5 billion active users, YouTube is one of the most popular social media websites in the world. While people across the world rely on the video-sharing platform for entertainment, and… [+3182 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Chiranjeevi starrer Mega154 to hit screens on Sankranthi 2023", "description": "Directed by Bobby, Mega154 stars Chiranjeevi and Shruti Haasan in the lead roles.", "url": "https://indianexpress.com/article/entertainment/telugu/chiranjeevi-starrer-mega154-to-hit-screens-on-sankranthi-2023-7988264/", "urlToImage": "https://images.indianexpress.com/2022/06/Mega154-1200by667.jpg", "publishedAt": "2022-06-24T09:11:23Z", "content": "The makers of Chiranjeevis 154th film on Friday announced that the actioner will release on Sankranthi 2023. Director KS Ravindra aka Bobby took to his social media handles and announced the films re… [+901 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Death toll from Afghanistan’s quake rises to 1,150 people", "description": "The magnitude 6 quake on Wednesday struck in the night as people were sleeping, leaving thousands who survived without shelter, about 3000 homes were left badly damaged.", "url": "https://indianexpress.com/article/world/death-toll-from-afghanistans-quake-rises-to-1150-people-7988427/", "urlToImage": "https://images.indianexpress.com/2022/06/afghan-earthquake-1200-1.jpg", "publishedAt": "2022-06-24T09:09:32Z", "content": "The death toll from a devastating earthquake in Afghanistan continued to climb days after it turned brick and stone homes into rubble, killing 1,150 people and wounding scores more, according to the … [+4829 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Fears of waterborne disease rise in Bangladesh as floods recede", "description": "More than 4,000 people have contracted waterborne illnesses, including diarrhea, in flood-hit districts", "url": "https://indianexpress.com/article/world/fears-of-waterborne-disease-rise-in-bangladesh-as-floods-recede-7988531/", "urlToImage": "https://images.indianexpress.com/2022/06/bangaldesh.jpg", "publishedAt": "2022-06-24T09:08:20Z", "content": "Authorities in Bangladesh are bracing for the spread of waterborne diseases and racing to get drinking water to people stranded in their homes by flooding across a quarter of the country, an official… [+2524 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Chetan Nayak", "title": "iQOO Neo 6 review: A hot flagship, for the right reasons", "description": "iQOO Neo 6 review: The iQOO Neo 6 is one of the most powerful and feature-packed smartphones under Rs 30,000, but is that enough for you to pick up this phone? Find out in our full review below.", "url": "https://indianexpress.com/article/technology/tech-reviews/iqoo-neo-6-review-7988376/", "urlToImage": "https://images.indianexpress.com/2022/06/iQOO-Neo-6-review-1.jpg", "publishedAt": "2022-06-24T09:01:49Z", "content": "When iQOO sent me the iQOO Neo 6 for review, I was excited to review it for two reasons. One, this phone is powered by the Snapdragon 870, which has much better thermals than some of its successors. … [+7497 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "PCB introduces separate red-ball white ball contracts, to pay extra for denying offers from foreign leagues", "description": "From July 1, separate red and white-ball contracts will be given with increased retainers. The number of centrally contracted players has been increased from 20 to 33.", "url": "https://indianexpress.com/article/sports/cricket/pcb-introduces-separate-red-ball-white-ball-contracts-to-pay-extra-for-denying-offers-from-foreign-leagues-7988582/", "urlToImage": "https://images.indianexpress.com/2021/09/pcb-fb.jpg", "publishedAt": "2022-06-24T09:00:43Z", "content": "The Pakistan Cricket Board (PCB) on Friday introduced separate red ball and white ball central contracts for its players with increased retainers but would discourage its elite players from competing… [+3207 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Gold, silver prices today: Gold rate slips Rs 77/10 gm, while silver declines Rs 333/kg", "description": "Gold Silver Live Update 24 June 2022: The opening price for 999 purity gold was Rs 50,776 per 10 grams, down Rs 77 from Thursday's closing price of Rs 50,853, while 999 purity silver opened at Rs 59,666 per kg, dropping Rs 333 from Rs 59,999. Read below to fi…", "url": "https://indianexpress.com/article/business/commodities/gold-silver-prices-today-june-24-2022-bullion-market-mcx-7988160/", "urlToImage": "https://images.indianexpress.com/2021/06/gold-jewellery_1200-Copy.jpg", "publishedAt": "2022-06-24T08:59:45Z", "content": "Gold, Silver Rates Today News Updates: Prices of gold and silver opened lower in the major spot markets of India on Friday, June 24, 2022.The 999 purity gold opened at Rs 50,776 per 10 grams, droppin… [+2262 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Entertainment Desk", "title": "ডাকাত থেকে রক্ষাকর্তা, ‘সামশেরা’র ট্রেলারে রণবীরের মধ্যে ‘বাহুবলী’র ছায়া", "description": "কর্মে ডাকাত, ধর্মে আজাদ - সামশেরা আসছে!", "url": "https://bengali.indianexpress.com/entertainment/shamshera-trailer-launch-ranbir-kapoor-sanjay-dutt-461076/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/samshera.jpg", "publishedAt": "2022-06-24T08:56:00Z", "content": "– , – ‘’ ( Ranbir Kapoor ) \r\n ‘’ , , ‘’ , \r\n[ IIFA- ! -, ] \r\n, ( Sanjay Dutt ) ‘’, ‘ ’ ‘ ’- , - \r\n, ‘’"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Star survives supernova explosion to become even brighter", "description": "Despite being vitally important to astronomy, thermonuclear supernovae’s origins are still poorly understood.", "url": "https://indianexpress.com/article/technology/science/star-survives-supernova-explosion-to-become-even-brighter-7988419/", "urlToImage": "https://images.indianexpress.com/2022/06/Star-survives-supernova.jpg", "publishedAt": "2022-06-24T08:55:36Z", "content": "A supernova is the biggest kind of explosion that mankind has ever observed in the universe. A small per cent of massive stars end their life with this massive explosion, mostly leaving next-to-nothi… [+2699 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Amitabh Bachchan’s hilarious take on fan kissing his photo: ‘Aree, par devi ji…’", "description": "Bollywood superstar Amitabh Bachchan gave a glimpse of his fun side in his latest Instagram post.", "url": "https://indianexpress.com/article/entertainment/bollywood/amitabh-bachchan-hilarious-take-fan-kissed-photo-7988325/", "urlToImage": "https://images.indianexpress.com/2022/06/amitabh-bachchan-kisses-fan.jpg", "publishedAt": "2022-06-24T08:55:01Z", "content": "Amitabh Bachchans social media game is way too cool for his age. And the superstar gave a glimpse of his fun side in his latest Instagram post. He posted his photo, which a female fan seemed to have … [+904 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "‘PM and President have to visit Bengaluru often for civic agencies to do their duty?’, asks Karnataka HC", "description": "The chiding came during the hearing of a contempt petition against Bangalore Development Authority (BDA) and Bangalore Water Supply and Sewerage Board (BWSSB) officers.", "url": "https://indianexpress.com/article/cities/bangalore/pm-president-bengaluru-visit-often-civic-agencies-karnataka-hc-7988440/", "urlToImage": "https://images.indianexpress.com/2022/06/bengaluru_road_edited-2.jpg", "publishedAt": "2022-06-24T08:54:42Z", "content": "The Karnataka High Court, on Thursday, taking a jibe at Bangalores civic body said  “Maybe the condition of roads will improve if the PM and President visit Bengaluru often. Last week you spent Rs 23… [+1280 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "India stands in solidarity with Afghan people: MEA on quake in Afghanistan", "description": "India has already dispatched 27 tons of relief material in two flights for the people of Afghanistan as a \"true first responder\" to address their difficulties, the Ministry of External Affairs said.", "url": "https://indianexpress.com/article/india/afghan-quake-india-sends-relief-material-7988479/", "urlToImage": "https://images.indianexpress.com/2022/06/afghan-earthquake-1200-1.jpg", "publishedAt": "2022-06-24T08:49:33Z", "content": "A day after sending relief material to earthquake-hit Afghanistan, India on Friday said it stands in solidarity with the Afghan people and remains firmly committed to providing them with required rel… [+2053 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Flood situation in Assam critical as Silchar remains under water, toll rises to 108", "description": "The Brahmaputra and Barak rivers along with their tributaries are in spate, even as floodwaters started receding from a few areas, they said.", "url": "https://indianexpress.com/article/north-east-india/assam/assam-floods-silchar-death-toll-7988423/", "urlToImage": "https://images.indianexpress.com/2022/06/Assam-1-1-2-1.jpeg", "publishedAt": "2022-06-24T08:48:30Z", "content": "The flood situation in Assam was critical on Friday with with 45.34 lakh people reeling under the deluge, officials said.The Brahmaputra and Barak rivers along with their tributaries are in spate, ev… [+2035 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Pune Campus Watch: CBSE, ICSE students complain of unfair treatment as Pune colleges go ahead with admissions without them", "description": "A large section of students belonging to boards other than Maharashtra state board is unable to participate in the admissions process. The deadline has either passed or will soon get over at several colleges, even as CBSE and ICSE boards are yet to declare th…", "url": "https://indianexpress.com/article/cities/pune/pune-campus-watch-cbse-icse-students-complain-unfair-treatment-pune-colleges-admissions-7988418/", "urlToImage": "https://images.indianexpress.com/2022/06/fergusson-college-759-1.jpg", "publishedAt": "2022-06-24T08:46:25Z", "content": "Nearly 10 days have passed since the online admission process for undergraduate admissions started at Fergusson College in Pune where Class XII student Sai Matekar hopes to take admission to a BA Eng… [+3725 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "The tiny mites living on your face may soon reach their dead-end; will it impact skin health?", "description": "These face mites, which live in the hair follicles on the face and eat dead skin, are not visible to the naked eye", "url": "https://indianexpress.com/article/lifestyle/life-style/study-face-mites-good-skin-eroding-dna-genome-humans-7986518/", "urlToImage": "https://images.indianexpress.com/2022/06/face-mite_1200_skincare.jpg", "publishedAt": "2022-06-24T08:40:43Z", "content": "Just like the gut and the body, there are microscopic organisms living on your face, too. Called mites or demodex folicular, these have thrived on humanfaces forever. In fact, they share a symbiotic … [+2079 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "World Bank approves USD 562 million funding for 3 projects in India", "description": "The project will help microenterprises access working capital by connecting them with government schemes that provide financial support to farmers such as the Kisan Credit Card and the Micro Units Development and Refinance Agency Limited (MUDRA).", "url": "https://indianexpress.com/article/world/world-bank-approves-usd-562-million-funding-3-projects-india-7988189/", "urlToImage": "https://images.indianexpress.com/2022/06/world-bank-1.jpg", "publishedAt": "2022-06-24T08:39:14Z", "content": "World Bank has approved three loans totalling USD 562 million (about Rs 4,393.70 crore) to fund an education project in Gujarat, a social protection programme in Tamil Nadu and a project to help reco… [+2691 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Automobiles in India to be accorded ‘Star Ratings’ based on performance in crash tests: Nitin Gadkari", "description": "In a series of tweets, Gadkari said the Bharat New Car Assessment Programme (Bharat NCAP) will serve as a consumer-centric platform, allowing customers to opt for safer cars based upon their Star-Ratings, while promoting a healthy competition among original e…", "url": "https://indianexpress.com/article/business/business-others/indian-automobiles-to-be-accorded-star-ratings-based-on-crash-tests-bharat-ncap-nitin-gadkari-7988303/", "urlToImage": "https://images.indianexpress.com/2022/04/nitin-gadkari-1200-1.jpg", "publishedAt": "2022-06-24T08:38:22Z", "content": "Union minister Nitin Gadkari on Friday said the new car assessment program — Bharat NCAP, proposes a mechanism wherein automobiles in India shall be accorded ‘Star Ratings’ based upon their performan… [+1458 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "UK PM Johnson’s party loses previously safe parliamentary seat", "description": "The centrist Liberal Democrats party candidate, Richard Foord, won the Tiverton and Honiton seat by a majority of nearly 6,144 votes.", "url": "https://indianexpress.com/article/world/uk-pm-johnsons-party-loses-parliamentary-seat-7987929/", "urlToImage": "https://images.indianexpress.com/2022/06/Boris-Johnson-1.jpg", "publishedAt": "2022-06-24T08:37:53Z", "content": "British Prime Minister Boris Johnson’s Conservative Party lost a previously safe parliamentary seat in southern England on Friday, a sign of the depth of voter discontent after months of scandals and… [+334 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Z category security cover for Yashwant Sinha", "description": "The squad has taken over the task after the Union home ministry directed the Central Reserve Police Force (CRPF) VIP security wing to ensure protection to the 84-year-old Sinha.", "url": "https://indianexpress.com/article/india/z-category-security-cover-for-yashwant-sinha-7988454/", "urlToImage": "https://images.indianexpress.com/2022/06/Yashwant-Sinha-PTI.jpg", "publishedAt": "2022-06-24T08:32:44Z", "content": "The Centre has extended a Z category cover of armed CRPF commandos to the opposition’s presidential candidate Yashwant Sinha, officials said on Friday.The squad has taken over the task after the Unio… [+678 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Thor Love And Thunder first reactions: Chris Hemsworth film ‘doubles down on the Ragnarok charm’", "description": "Chris Hemsworth starrer Thor Love and Thunder had its premiere in Los Angeles, and the initial reactions seem positive.", "url": "https://indianexpress.com/article/entertainment/hollywood/thor-love-and-thunder-first-reactions-chris-hemsworth-film-doubles-down-ragnarok-charm-7988148/", "urlToImage": "https://images.indianexpress.com/2022/06/thor-love-and-thunder-1200-2.jpg", "publishedAt": "2022-06-24T08:29:06Z", "content": "Chris Hemsworth starrer Thor Love and Thunder had its premiere in Los Angeles and the first reactions from the screening seem extremely positive. These are not the official reviews of the film but th… [+2232 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "JEE Main 2022 Session-1 Day 2 Paper Analysis: Students find questions moderately difficult, check subject-wise topics asked", "description": "The paper was considered to be somewhat difficult according to the experts. Unit dimension, communication, the mole idea, chemistry in real life, set, and other subjects were among the key ones covered in the exam.", "url": "https://indianexpress.com/article/education/jee-main-2022-session-1-day-2-paper-analysis-students-find-questions-moderately-difficult-check-subject-wise-topics-asked-7988401/", "urlToImage": "https://images.indianexpress.com/2022/01/JEE-Main-2022-Live-card-2.jpg", "publishedAt": "2022-06-24T08:28:50Z", "content": "The National Testing Agency (NTA) is conducting the first session of JEE Main 2022 from June 23 to June 29. The first shift began at 9 am and ended at 12 noon. The second shift will begin at 3 pm and… [+1360 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Govt to move NDPS from FinMin to MHA", "description": "Transfer of administration of the two Acts from DoR to MHA is under deliberation, two sources briefed on the matter said. E-mails sent to Ministry of Finance and MHA for comments remained unanswered.", "url": "https://indianexpress.com/article/india/govt-to-move-ndps-from-finmin-to-mha-7988315/", "urlToImage": "https://images.indianexpress.com/2022/06/Capture-34.jpg", "publishedAt": "2022-06-24T08:28:41Z", "content": "The government is considering transferring the administration of the Narcotic Drugs and Psychotropic Substances Act, 1985 and Prevention of Illicit Traffic in Narcotic Drugs and Psychotropic Substanc… [+2639 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Tamil Nadu: DMK MP Tiruchi Siva’s son Suriya arrested for threatening bus owner, hijacking bus", "description": "Close to 60 BJP workers besieged Cantonment police station in Tamil Nadu claiming that a false case had been booked against Suriya Siva. Police registered cases against them too.", "url": "https://indianexpress.com/article/cities/chennai/tamil-nadu-dmk-mp-tiruchi-siva-son-arrested-threatening-bus-owner-hijacking-7988402/", "urlToImage": "https://images.indianexpress.com/2022/06/tiruchi-mp.jpg", "publishedAt": "2022-06-24T08:26:01Z", "content": "Dravida Munnetra Kazhagam (DMK) MP Tiruchi Sivas son Suriya, the general secretary of Tamil Nadu BJPs OBC wing, was arrested by the Tamil Nadu police on Thursday for allegedly intimidating a private … [+1991 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Hero MotoCorp to hike motorcycle, scooter prices by up to Rs 3,000 from Jul 1", "description": "Hero MotoCorp sells a range of models, ranging from entry-level HF100 with prices starting at Rs 51,450, while Xpulse 200 4V tagged at Rs 1.32 lakh (ex-showroom Delhi).", "url": "https://indianexpress.com/article/business/hero-motorcycle-scooter-prices-hike-rs-3000-jul-1-7988224/", "urlToImage": "https://images.indianexpress.com/2022/06/Hero-MotoCorp.jpg", "publishedAt": "2022-06-24T08:22:51Z", "content": "Two-wheeler maker Hero MotoCorp on Thursday said it will hike prices of motorcycles and scooters by up to Rs 3,000 from July 1 to partially offset the steadily growing overall cost inflation, includi… [+475 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Govt-appointed panel on EV fire cases to submit report this month", "description": "Road Transport and Highways Minister Nitin Gadkari had recently said companies found negligent will be penalised and a recall of all defective vehicles will be ordered after the expert panel submits its report.", "url": "https://indianexpress.com/article/india/govt-appointed-panel-on-ev-fire-cases-to-submit-report-this-month-7988248/", "urlToImage": "https://images.indianexpress.com/2022/04/Nitin-Gadkari.jpg", "publishedAt": "2022-06-24T08:21:57Z", "content": "An expert committee set up by the road transport ministry to investigate cases of electric two-wheelers catching fire and suggest remedial measures is likely to submit its report this month, a senior… [+282 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "‘ঘোমটা তুলুন’, ভরা মঞ্চে পঞ্চায়েত সদস্যাকে ‘বিনয়ী’ আবেদন শিক্ষামন্ত্রীর", "description": "একটি অনুষ্ঠানে গ্রামে গিয়ে স্থানীয় মহিলা পঞ্চায়েত সদস্যকে এমনই বলেছেন রাজ্যের শিক্ষামন্ত্রী।", "url": "https://bengali.indianexpress.com/general-news/drop-the-veil-minister-tells-woman-sarpanch-in-gujarat-461023/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/Indian-women-in-gunghat.jpg", "publishedAt": "2022-06-24T08:20:52Z", "content": "‘ ’, \r\n , - \r\n , , ‘’ \r\n , ” , () ” , ”, ” , , ” ? , , ”\r\n , ” , ( ) - , ” \r\n - ? \r\n - , \r\n , ” () - ” \r\n, .- \r\n - , ?\r\n , - - , ” , - ”"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "মমতা-সনিয়া-শরদের সঙ্গে ফোনে কথা দ্রৌপদীর, সমর্থনের আর্জি", "description": "লক্ষ্মীবারে দিল্লি পৌঁছেই জানিয়েছিলেন যে, বিরোধী শিবিরের সকল সাংসদের কাছেই ভোট প্রার্থনা করবেন দ্রৌপদী মুর্মু।", "url": "https://bengali.indianexpress.com/politics/national/droupadi-murmu-calls-mamata-banerjee-sonia-gandhi-sharad-pawar-461030/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/droupadi-murmu-calls-mamata-banerjee-sonia-gandhi-sharad-pawar.jpg", "publishedAt": "2022-06-24T08:20:23Z", "content": "NDA's Presidential election candidate Droupadi Murmu speaks with Congress interim-President Sonia Gandhi, West Bengal CM Mamata Banerjee &amp; NCP chief Sharad Pawar seeking their party's support for… [+81 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Southern Railways cancels 12 suburban trains in Chennai", "description": "According to a release issued by Southern Railway, the trains will be canceled till June 27 due to ongoing works in the Chennai Egmore-Villupuram section at Tambaram Yard.", "url": "https://indianexpress.com/article/cities/chennai/southern-railways-chennai-train-cancellation-7988271/", "urlToImage": "https://images.indianexpress.com/2022/06/Chennai-MRTS.jpg", "publishedAt": "2022-06-24T08:18:59Z", "content": "The Chennai division of Southern Railway has cancelled as many as 12 suburban trains due to ongoing engineering works in the Chennai Egmore-Villupuram section at Tambaram Yard. According to a release… [+635 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Entertainment Desk", "title": "শিক্ষকদের অপমান! রোষের মুখে বাংলা ধারাবাহিক, নেটপাড়ায় ছিঃ ছিঃ করছেন দর্শকরা", "description": "ইংরেজির বহরে থমকে গেছেন দর্শকরা", "url": "https://bengali.indianexpress.com/entertainment/television/colors-bangla-serial-wrong-english-tumi-je-amar-ma-461011/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/serial-tumi-je-amar-ma.jpg", "publishedAt": "2022-06-24T08:18:41Z", "content": "! , \r\n ‘ ’ ! Good good-better-best good-gooder-goodest! ? , , ! , ‘ , ’ , ‘ ?’ \r\n– / \r\n[ , ! ? ] \r\n , , – \r\n , ! , , , -"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kamal Saiyed", "title": "As rebel Sena MLAs transited Surat, CR Paatil ran show from behind the scenes", "description": "Sources said that nearly 32 rebel MLAs from Shiv Sena reached Surat on the night of June 20 after being driven from Maharashtra, and six others joined them on early June 21 morning.", "url": "https://indianexpress.com/article/political-pulse/rebel-sena-mlas-surat-cr-paatil-ran-show-from-behind-the-scenes-7988367/", "urlToImage": "https://images.indianexpress.com/2022/06/Chandrakant-Raghunath-Paatil-.jpg", "publishedAt": "2022-06-24T08:18:29Z", "content": "Hours ahead of June 21 morning, when the International Yoga Day was celebrated, a luxury hotel on the Surat-Dumas Road came under a tight police cordon. At least 30 Shiv Sena MLAs from Maharashtra, l… [+5630 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shubhra Gupta", "title": "Sherdil The Pilibhit Saga movie review: Pankaj Tripathi deserved a better film", "description": "Sherdil The Pilibhit Saga movie review: Done well, this could have been a strong satire, but it turns into a listless saga, with only Pankaj Tripathi and its lovely music by Shantanu Moitra standing out.", "url": "https://indianexpress.com/article/entertainment/movie-review/sherdil-movie-review-pankaj-tripathi-7988386/", "urlToImage": "https://images.indianexpress.com/2022/06/sherdil-review-.jpg", "publishedAt": "2022-06-24T08:17:57Z", "content": "Sherdil The Pilibhit Saga movie cast: Pankaj Tripathi, Neeraj Kabi, Sayani GuptaSherdil The Pilibhit Saga movie director: Srijit MukherjiSherdil Srijit Mukherji movie rating: 1.5 starsBased on a true… [+1968 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "PM Modi exhorts exporters to set long-term export targets", "description": "Inaugurating the new Vanijya Bhawan here, he said that the exports play a critical role in the transition of a country from developing to developed status.", "url": "https://indianexpress.com/article/business/pm-modi-exporters-to-set-long-term-export-targets-7988269/", "urlToImage": "https://images.indianexpress.com/2022/06/download-10.jpg", "publishedAt": "2022-06-24T08:15:32Z", "content": "Prime Minister Narendra Modi on Thursday appealed to exporters and the industry to fix long-term export targets for themselves and suggest ways to the government to achieve those goals.Inaugurating t… [+4286 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "In record, Florida biologists capture nearly 100-kg Burmese python with 122 eggs", "description": "The Burmese python, an invasive species introduced in the US as an exotic pet in the 1970s, is known for rapid reproduction and capturing the wild, leading to the depletion of native wildlife.", "url": "https://indianexpress.com/article/trending/trending-globally/in-record-florida-biologists-capture-nearly-100-kg-burmese-python-with-122-eggs-7988087/", "urlToImage": "https://images.indianexpress.com/2022/06/biggest-burmese-python-florida.jpg", "publishedAt": "2022-06-24T08:13:51Z", "content": "In a spectacular research moment, biologists captured the biggest Burmese python ever recorded in the state of Florida, USA. The humongous snake caught by the Conservancy of Southwest Florida measure… [+3115 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Explained: What is Title IX and what impact has it had?", "description": "Title IX explained: Title IX, the law best known for its role in gender equity in athletics and preventing sexual harassment on campuses, is turning 50. What does it say? How does it affect athletics? What about sexual harassment allegations?", "url": "https://indianexpress.com/article/explained/what-is-title-ix-7988369/", "urlToImage": "https://images.indianexpress.com/2022/06/title-ix-1.jpg", "publishedAt": "2022-06-24T08:06:14Z", "content": "Title IX, the law best known for its role in gender equity in athletics and preventing sexual harassment on campuses, is turning 50.It was signed into law by President Richard Nixon on June 23, 1972,… [+6688 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "CBI searches 5 locations in bank fraud case worth 69.33 crore against Delhi company", "description": "This included diversion of funds, fabrication of account books and forgery in account books to defraud the banks during 2011-16, the officials said.", "url": "https://indianexpress.com/article/cities/delhi/delhi-news-cbi-search-bank-fraud-packaging-company-rave-scans-7988378/", "urlToImage": "https://images.indianexpress.com/2022/06/money-5-2.jpg", "publishedAt": "2022-06-24T08:04:07Z", "content": "The CBI on Friday conducted searches at five locations in Delhi after registering an FIR against Delhi-based packaging company Rave Scans Pvt Ltd for allegedly defrauding a consortium of banks to the… [+890 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kanchan Vasdev", "title": "Heatwave, paddy transplantation led to low voter turnout in Sangrur, says Punjab CM Bhagwant Mann", "description": "While it is generally perceived that a low turnout favours the ruling party and a high turnout indicates anti-incumbency, the opposition parties say that Sangrur is a peculiar case.", "url": "https://indianexpress.com/article/cities/chandigarh/heatwave-paddy-transplantation-led-to-low-voter-turnout-in-sangrur-says-punjab-cm-7988198/", "urlToImage": "https://images.indianexpress.com/2022/06/voting-1200.jpg", "publishedAt": "2022-06-24T08:01:49Z", "content": "Punjab Chief Minister Bhagwant Mann on Friday said that heatwave and paddy transplantation was responsible for the low turnout of voters in Sangrur Lok Sabha by-election held Thursday.On the sideline… [+1503 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "India eye improved top-order show in 2nd T20I against Sri Lanka", "description": "India will be eying early series victory when they will face Sri Lanka on Saturday", "url": "https://indianexpress.com/article/sports/cricket/india-eye-improved-top-order-show-in-2nd-t20i-against-sri-lanka-ind-vs-sl-harmanpreet-kaur-bcci-smriti-mandhana-jemimah-rodrigues-7988349/", "urlToImage": "https://images.indianexpress.com/2022/03/Harmanpreet-Kaur.jpg", "publishedAt": "2022-06-24T07:59:22Z", "content": "Eyeing a series-clinching victory, the Indian women’s cricket team would expect a better showing from its top-order when it takes on Sri Lanka in the second T20 International, here on Saturday.The In… [+3226 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Who is Zakia Jafri?", "description": "Zakia Jafri is the widow of Congress MP Ehsan Jafri who along with 68 others was killed inside the gated Gulberg Society, a day after the 2002 Godhra riots in Gujarat.", "url": "https://indianexpress.com/article/india/who-is-zakia-jafri-gujarat-riots-sc-verdict-7988071/", "urlToImage": "https://images.indianexpress.com/2022/06/zakia-jafri.jpg", "publishedAt": "2022-06-24T07:57:03Z", "content": "Zakia is the widow of Congress MP Ehsan Jafri who along with 68 others was killed inside the gated Gulberg Society, a lower-middle-class Muslim neighbourhood in Chamanpura, Ahmedabad, a day after the… [+1460 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "BJP national meet: Hyderabad police gears up ahead of PM Modi’s visit next week", "description": "The BJP is holding its national executive meeting at HICC Novotel in Hyderabad on July 2-3 and Prime Minister Narendra Modi is scheduled to address a rally at the parade grounds.", "url": "https://indianexpress.com/article/cities/hyderabad/pm-modi-visit-hyderabad-bjp-nationa-meet-police-security-secunderabad-7988339/", "urlToImage": "https://images.indianexpress.com/2022/06/modi-bjp.jpg", "publishedAt": "2022-06-24T07:53:13Z", "content": "The Hyderabad city police, along with state government departments, have put elaborate security arrangements in place ahead of Prime Minister Narendra Modi’s visit to Hyderabad to attend the party’s … [+2651 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Mizoram govt launches ‘Super IAS 40’ to sponsor coaching for UPSC civil services exam", "description": "Faced with an acute shortage of IAS officers, the Mizoram government has decided to sponsor the coaching of 40 UPSC aspirants from the state for the civil services examination, they said.", "url": "https://indianexpress.com/article/jobs/mizoram-govt-to-sponsor-coaching-for-upsc-civil-services-7988223/", "urlToImage": "https://images.indianexpress.com/2022/06/ch1045132-1.jpg", "publishedAt": "2022-06-24T07:51:25Z", "content": "Over 500 candidates appeared for an entrance test on Friday for the ‘Super IAS 40’ programme, through which the Mizoram government will sponsor the coaching of 40 aspirants for the UPSC civil service… [+2450 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Kate Middleton wears heirloom accessory in first portrait with Prince William; know more about it", "description": "The Cambridge royals visited the Fitzwilliam Museum to view their first-ever joint portrait, which will be on display to the public for three years", "url": "https://indianexpress.com/article/lifestyle/life-style/kate-middleton-heirloom-accessory-brooch-first-portrait-prince-william-duke-and-duchess-cambridge-7988043/", "urlToImage": "https://images.indianexpress.com/2022/06/william-and-kate-portrait-1200.jpg", "publishedAt": "2022-06-24T07:50:18Z", "content": "Prince William and Kate Middleton, the Duke and Duchess of Cambridge and key members of the British royal family, got their portrait unveiled at Cambridges Fitzwilliam Museum on Thursday.Buy Now | Ou… [+1996 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "The Conversation", "title": "Poliovirus in London sewage – what you need to know", "description": "There are three types of poliovirus, and infection or immunisation by one type does not protect against another. Here's what you need to know.", "url": "https://indianexpress.com/article/world/poliovirus-in-london-sewage-what-you-need-to-know-7988259/", "urlToImage": "https://images.indianexpress.com/2022/06/polio-virus.jpg", "publishedAt": "2022-06-24T07:50:06Z", "content": "Written by Zania Stamataki, Senior Lecturer in Viral Immunology, University of Birmingham Just as we thought that monkeypox would be the new virus scare for 2022, the UK Health Security Agency (UKHSA… [+4673 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Google Chrome: Check these 6 new features coming to iOS", "description": "Here are six new useful features coming soon to Google Chrome on iOS.", "url": "https://indianexpress.com/article/technology/tech-news-technology/google-chrome-check-these-6-new-features-coming-to-ios-7988351/", "urlToImage": "https://images.indianexpress.com/2022/06/Google-Chrome.jpg", "publishedAt": "2022-06-24T07:46:04Z", "content": "Chrome has been updating its iOS browser app to bring new features to iPhone and iPad users. New updates coming to Chrome on iOS over the next few weeks will bring six new features to the popular bro… [+2195 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "Busking artist plays Kabir Singh’s ‘Tujhe Kitna Chaahne Lage Hum’ in US, Shahid Kapoor says ‘brilliant’", "description": "While Shahid Kapoor was impressed by the saxophonist's rendition of Kabir Singh song, film's composer Mithoon said the American man got the notes of the song absolutely right.", "url": "https://indianexpress.com/article/trending/viral-videos-trending/shahid-kapoor-reacts-busking-artist-plays-tujhe-kitna-chaahne-lage-hum-in-us-7987885/", "urlToImage": "https://images.indianexpress.com/2022/06/kabir-singh-sax-cover.jpg", "publishedAt": "2022-06-24T07:44:32Z", "content": "It’s not every day when you’re away from home in a foreign land and something familiar comes your way. Something similar happened when walking down a US street, a man heard an artist playing a Hindi … [+2749 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "J&K L-G reviews security arrangements for upcoming Amarnath Yatra", "description": "Security for the yatra that is scheduled to begin on June 30 was reviewed with senior police, paramilitary, army and intelligence officials of the UT.", "url": "https://indianexpress.com/article/cities/srinagar/jj-l-g-reviews-security-arrangements-for-upcoming-amarnath-yatra-7987873/", "urlToImage": "https://images.indianexpress.com/2022/06/amarnath-7597.jpg", "publishedAt": "2022-06-24T07:30:57Z", "content": "Jammu and Kashmir Lieutenant Governor Manoj Sinha on Thursday reviewed the security arrangements and preparations for the upcoming Amarnath Yatra at a Unified Command Meeting in Srinagar. This years … [+1510 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Careers Desk", "title": "SSC CHSL Tier 1 answer key released; here’s how to download", "description": "SSC CHSL Answer key: The candidate response sheet along with the tentative answer key is available on the official website - ssc.in.in", "url": "https://indianexpress.com/article/jobs/ssc-chsl-tier-1-answer-key-released-heres-how-to-download/", "urlToImage": "https://images.indianexpress.com/2021/03/answer-key-1200-1-2.jpg", "publishedAt": "2022-06-24T07:30:54Z", "content": "Staff Selection Commission (SSC) has released the answer key for the Combined Higher Secondary Level (10+2) Tier-I examination. The exam was conducted from May 24 to June 10, 2022, at different centr… [+862 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Careers Desk", "title": "SSC CHSL Tier 1 answer key released; here’s how to download", "description": "SSC CHSL Answer key: The candidate response sheet along with the tentative answer key is available on the official website - ssc.in.in", "url": "https://indianexpress.com/article/jobs/ssc-chsl-tier-1-answer-key-released-heres-how-to-download-ssc-nic-in-7988117/", "urlToImage": "https://images.indianexpress.com/2021/03/answer-key-1200-1-2.jpg", "publishedAt": "2022-06-24T07:30:54Z", "content": "Staff Selection Commission (SSC) has released the answer key for the Combined Higher Secondary Level (10+2) Tier-I examination. The exam was conducted from May 24 to June 10, 2022, at different centr… [+862 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Psychosis, addiction, chronic vomiting: As weed becomes more potent, teens are getting sick", "description": "Although recreational cannabis is illegal in the United States for those younger than 21, it has become more accessible as many states have legalized it.", "url": "https://indianexpress.com/article/lifestyle/health/psychosis-addiction-chronic-vomiting-weed-potent-teens-sick-us-7988247/", "urlToImage": "https://images.indianexpress.com/2022/06/cannabis-teen.jpg", "publishedAt": "2022-06-24T07:30:18Z", "content": "Elysse was 14 when she first started vaping cannabis.\r\nIt did not smell, which made it easy to hide from her parents. And it was convenient; just press a button and inhale. After the second or third … [+9601 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rahul V Pisharody", "title": "In Hyderabad, online music lessons help a group of women keep their life in tune", "description": "“When my husband was in ICU during the third wave, I got a lot of strength and inner peace only because of this group and the hymns we learnt. In difficult times, we had each other.”", "url": "https://indianexpress.com/article/meta-stories-of-strength-2022/in-hyderabad-online-music-lessons-help-a-group-of-women-keep-their-life-in-tune/", "urlToImage": "https://images.indianexpress.com/2022/06/IMG-20220623-WA0223.jpg", "publishedAt": "2022-06-24T07:29:35Z", "content": "HYDERABAD: Had it not been for this group of women, 63-year-old N Ramamani says she would have gone insane during the pandemic. These friends from her music class, many of them suffering from solitud… [+4171 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Rocketry new trailer: Madhavan looks promising as Nambi Narayanan in the intriguing biopic", "description": "Rocketry is based on the life of Nambi Narayanan, a former scientist and aerospace engineer of the Indian Space Research Organisation. The film is written and directed by R Madhavan.", "url": "https://indianexpress.com/article/entertainment/bollywood/rocketry-new-trailer-madhavan-looks-promising-as-nambi-narayanan-intriguing-biopic-7988201/", "urlToImage": "https://images.indianexpress.com/2022/06/rocketry-trailer-.jpg", "publishedAt": "2022-06-24T07:28:18Z", "content": "The makers of Rocketry The Nambi Effecthave released a new trailer of the film ahead of its release on July 1. The first trailer of the biopic was launched on April 1. The film is written and directe… [+1290 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi: Active Covid-19 cases remain over 5,000 for nearly a week", "description": "The positivity rate in Delhi has remained over 5% for eleven days. After a dip in Covid cases due to fewer tests conducted, Delhi saw the number of fresh cases increase to 1,934 on Thursday.", "url": "https://indianexpress.com/article/cities/delhi/delhi-covid-news-active-cases-corona-updates-latest-hospitals-positivity-rate-7988128/", "urlToImage": "https://images.indianexpress.com/2022/06/covid-test-3.jpg", "publishedAt": "2022-06-24T07:27:58Z", "content": "The number of active Covid-19 cases in Delhi has remained over 5,000 for six days in a row, with an average of 234 people in the hospital during the period. There are almost 9,500 beds earmarked for … [+1617 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sanath Prasad", "title": "Sexual harassment case: NLSUI clarifies on disciplinary action against student facilitators", "description": "After alumni of NLSIU condemned the disciplinary action it took against student facilitators for reporting a sexual harassment case, the university explained that the facilitators had bypassed its mechanism for dealing with sexual harassment cases.", "url": "https://indianexpress.com/article/cities/bangalore/sexual-harassment-case-nlsui-clarifies-disciplinary-action-against-student-facilitators-7988222/", "urlToImage": "https://images.indianexpress.com/2022/06/nlsiu-1200.jpg", "publishedAt": "2022-06-24T07:27:20Z", "content": "Following an open letter by 200 alumni of National Law School of India University (NLSIU) Bengaluru condemning the disciplinary action against student facilitators for reporting a sexual harassment c… [+2672 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Shamshera trailer: Ranbir Kapoor film wants to be Baahubali, but it could just as easily be Thugs of Hindostan", "description": "Shamshera trailer: Starring Ranbir Kapoor, Sanjay Dutt and Vaani Kapoor, Karan Malhotra's Shamshera releases in theatres on July 22.", "url": "https://indianexpress.com/article/entertainment/bollywood/shamshera-trailer-ranbir-kapoor-watch-video-baahubali-thugs-of-hindostan-7987995/", "urlToImage": "https://images.indianexpress.com/2022/06/Shamshera-1200.jpg", "publishedAt": "2022-06-24T07:23:22Z", "content": "SS Rajamouli has clearly had an impact on this generation of filmmakers and the same is evident from the trailer of Ranbir Kapoor starrer Shamshera. The trailer introduces the audience to a ‘lootera’… [+1590 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sethu Pradeep", "title": "This fabric can generate electricity from your movements to power wearables", "description": "Tapping a 3x4 cm piece of stretchable and washable fabric generated enough electricity to light up to 100 LEDs.", "url": "https://indianexpress.com/article/technology/science/this-fabric-can-generate-electricity-from-your-movements-to-power-wearables-7988229/", "urlToImage": "https://images.indianexpress.com/2022/06/Stretchable-fabric-power-electricity.jpg", "publishedAt": "2022-06-24T07:22:05Z", "content": "Scientists at the Nanyang Technological University, (NTU) Singapore have developed a technology that can create a stretchable and waterproof fabric that can generate energy from your body movements. … [+3763 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Careers Desk", "title": "MPSC Recruitment 2022: Apply for 800 vacancies; check details", "description": "Interested candidates can apply for these vacancies on the official MPSC website — mpsc.gov.in — from tomorrow (June 25) till July 15. The MPSC Group B prelim exam 2022 will be held on October 8, 2022.", "url": "https://indianexpress.com/article/jobs/mpsc-recruitment-2022-apply-for-800-vacancies-check-details-sarkari-naukri-mpsc-gov-in-7988192/", "urlToImage": "https://images.indianexpress.com/2022/06/MPSC-2022.jpg", "publishedAt": "2022-06-24T07:21:38Z", "content": "The Maharashtra Public Service Commission (MPSC) is inviting application for the Group B Subordinate Services (Non-Gazetted) officers. Interested candidates can apply for these vacancies on the offic… [+1278 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rahul Pandey", "title": "Cold, slow pitches, beanies, hand-warmers: Ireland coach lists out what awaits India", "description": "The 41-year old Heinrich Malan opens up on his new job, the two-match series against India, fresh names in the Ireland squad and how Ireland should take a page out of India's itinerary for red-ball cricket.", "url": "https://indianexpress.com/article/sports/cricket/cold-slow-pitches-beanies-hand-warmers-ireland-coach-lists-out-what-awaits-india-7988216/", "urlToImage": "https://images.indianexpress.com/2022/06/Heinrich-Malan.jpg", "publishedAt": "2022-06-24T07:15:57Z", "content": "Heinrich Malan began his cricketing journey in South Africa, making 10 first class and nine List-A appearances for the Northerns cricket team between 2005 to 2009. He then moved to New Zealand, switc… [+6697 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Careers Desk", "title": "Agnipath scheme: Registration process for Agnivir Vayu recruitment begins today", "description": "The candidate must pay a sum of Rs.250 as an examination fee while registering for the online examination. The online examinations will start on July 24, 2022", "url": "https://indianexpress.com/article/jobs/agnipath-scheme-iaf-begins-registration-process-agnivir-vayu-recruitment-agnipathvayu-cdac-in-7988199/", "urlToImage": "https://images.indianexpress.com/2022/05/Telangana-Police-Recruitment.jpg", "publishedAt": "2022-06-24T07:15:40Z", "content": "The Indian Air Force (IAF) will begin the registration for Agnivir Vayu posts under the Agnipath recruitment scheme. The registration process begins on June 24 and the last date to apply is July 5 ti… [+1673 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Expatriate’s entry into Kerala Assembly complex: 4 contract Sabha TV staff removed from service", "description": "Speaker M B Rajesh says Anitha Pullayil, an expatriate with links to fraudster Monson Mavunkal, had entered the Assembly complex during the Loka Kerala Sabha with the employees’ help.", "url": "https://indianexpress.com/article/cities/thiruvananthapuram/kerala-news-loka-sabha-tv-legislature-expatriate-illegal-fraudster-cheating-7988196/", "urlToImage": "https://images.indianexpress.com/2022/06/kerala-legislative-assembly.jpg", "publishedAt": "2022-06-24T07:14:19Z", "content": "Four contract employees of Sabha TV, the online video streaming platform of the Secretariat of the Kerala Legislature, were removed from service on Friday on charges of permitting an expatriate from … [+1346 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "From taking notes on iPad to scoring runs, Sangakkara dissects the Mitchell method", "description": "Mitchell so far has scored 451 runs in the on-going three-match series, including two centuries in the first two Tests. On Day One at Headingley, he remained unbeaten on 78.", "url": "https://indianexpress.com/article/sports/cricket/from-taking-notes-on-ipad-to-scoring-runs-sangakkara-dissects-the-mitchell-method-7988209/", "urlToImage": "https://images.indianexpress.com/2021/09/sangakkara.jpg", "publishedAt": "2022-06-24T07:12:17Z", "content": "On a day when Daryl Mitchell, along with Tom Blundell, yet again carried the New Zealand batting, Kumar Sangakkara gave an insight into the former’s preparation. For more than two months, Sangakkara … [+1973 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Info Desk", "title": "Western Railways to extend summer special trains to Rajasthan", "description": "The weekly summer train running from Bandra Terminus to Jaipur has been extended till July 28 and the one running between Bandra Terminus and Ajmer has been extended to August 1.", "url": "https://indianexpress.com/article/india/western-railways-to-extend-summer-special-trains-from-bandra-terminus-to-jaipur-ajmer-7988070/", "urlToImage": "https://images.indianexpress.com/2022/01/railways-7591.jpeg", "publishedAt": "2022-06-24T07:08:06Z", "content": "Western Railway Friday announced the extension of trips of summer special trains that run between Bandra Terminus – Jaipur, and Bandra Terminus – Ajmer. In a tweet, the railway division said the exte… [+878 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Goa police to transfer cases of land irregularities to SIT: DGP", "description": "The SIT arrested a man from Karnataka for allegedly illegally transferring 60-70 properties in Goa using forged documents.", "url": "https://indianexpress.com/article/cities/goa/goa-police-land-irregularities-transferred-to-sit-7988098/", "urlToImage": "https://images.indianexpress.com/2022/04/goa-police-12-1-e1656052558345.jpg", "publishedAt": "2022-06-24T07:07:25Z", "content": "Goa Director General of Police Jaspal Singh has said that all the cases of land irregularities in the state will be transferred to the newly-formed Special Investigation Team (SIT).Talking to reporte… [+1080 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Ritvik Chaturvedi", "title": "Why EAT-Lancet’s diet to save the planet remains inaccessible in rural India", "description": "The EAT-Lancet Commission recommends the least expensive, sustainable, nutrition-rich diet for various parts of the globe but it remains inaccessible for rural India.", "url": "https://indianexpress.com/article/technology/science/eat-lancet-diet-inaccessible-unaffordable-rural-india-7988187/", "urlToImage": "https://images.indianexpress.com/2022/06/EAT-Lancet-diet-inaccessible-1.jpg", "publishedAt": "2022-06-24T07:04:08Z", "content": "In a 2019 report, the EAT-Lancet Commission a group of public health experts, environmental scientists and policymakers from 16 countries had recommended the least expensive, sustainable, nutrition-r… [+6495 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Assam floods: Dos and don’ts to follow before, after, and during the natural disaster to stay safe", "description": "NDMA recently listed some important things you must do before, after, and during the floods. Also, it shared some tips to follow in case of evacuation", "url": "https://indianexpress.com/article/lifestyle/life-style/assam-floods-dos-donts-before-after-during-floods-ndma-7987917/", "urlToImage": "https://images.indianexpress.com/2022/06/assam-floods-1.jpg", "publishedAt": "2022-06-24T07:00:55Z", "content": "Floodsand rain-induced landslides have wreaked havoc across Assam as nearly 100 people have lost their lives with over 54.5 lakh people still affected. The Brahmaputraand Barak rivers, along with the… [+2509 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "AP Open school SSC, Inter results 2022 declared; how to check", "description": "AP SSC and Intermediate (APOSS) Public Examinations, April / May - 2022 are released and hosted in the website. Candidates can download the mark memo at apopenschool.ap.gov.in/", "url": "https://indianexpress.com/article/education/ap-open-school-ssc-inter-results-2022-declared-how-to-check-apopenschool-ap-gov-in-7988186/", "urlToImage": "https://images.indianexpress.com/2022/06/ch1165308-1-4.jpg", "publishedAt": "2022-06-24T06:59:54Z", "content": "The Andhra Pradesh Open School Society (APOSS) has declared the results for SSC and inter board exams 2022. Candidates can check the result at the official website – apopenschool.ap.gov.in/SSC and In… [+854 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rahul Pandey", "title": "“That’s the full monty!” Shastri details his iconic commentary stint during Yuvraj’s six sixes", "description": "The former India coach shared his experience of hitting six 6s as well as being on air when Yuvraj Singh did the same.", "url": "https://indianexpress.com/article/sports/cricket/thats-the-full-monty-shastri-details-his-iconic-commentary-stint-during-yuvrajs-six-sixes-7988145/", "urlToImage": "https://images.indianexpress.com/2022/06/Yuvraj-and-Shastri.jpg", "publishedAt": "2022-06-24T06:59:07Z", "content": "Ravi Shastri didnt even tell his mother that he had hit six sixes in an over. She would come to know from a Bhelpuri wala the next day. Out of the many memorable cricket moments featuring Shastri, as… [+3619 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Bloomberg", "title": "Three charts show trouble for Indian stocks nearing a bear market", "description": "The S&P BSE Sensex Index has fallen more than 15% from its October high, nearing the 20% loss that denotes a bear market.", "url": "https://indianexpress.com/article/business/market/three-charts-show-trouble-for-indian-stocks-nearing-a-bear-market-7988028/", "urlToImage": "https://images.indianexpress.com/2022/06/bse-bombay-stock-exchange-bloomberg-1200.jpg", "publishedAt": "2022-06-24T06:55:06Z", "content": "As surging inflation and the end of global easy-money policies send Indian stocks spiraling down from all-time highs, three charts show the pain is unlikely to end anytime soon.The S&amp;P BSE Sensex… [+2250 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Myanmar’s Suu Kyi moved to solitary confinement in jail: Military", "description": "Suu Kyi has been charged with about 20 criminal offences carrying a combined maximum jail term of nearly 190 years since she was toppled by the military in February 2021.", "url": "https://indianexpress.com/article/world/myanmars-suu-kyi-moved-to-solitary-confinement-in-jail-military-7987992/", "urlToImage": "https://images.indianexpress.com/2022/06/Aung-San-Suu-Kyi-1.jpg", "publishedAt": "2022-06-24T06:49:31Z", "content": "Myanmar military authorities have transferred deposed leader Aung San Suu Kyi to a prison in the capital from an undisclosed location where she had been held since she and her government were ousted … [+3576 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "Over 65 universities to participate in CUET-PG 2022; NTA releases list of courses to be offered", "description": "A total of 36 central universities including Babasaheb Bhimrao Ambedkar University, Banaras Hindu University, Central Tribal University of Andhra Pradesh, Central University of Andhra Pradesh, Central University of South Bihar, Central University of Gujarat a…", "url": "https://indianexpress.com/article/education/over-65-universities-to-participate-in-cuet-pg-2022-nta-releases-list-of-courses-to-be-offered-7988114/", "urlToImage": "https://images.indianexpress.com/2022/05/MPSC-1200-1.jpg", "publishedAt": "2022-06-24T06:49:00Z", "content": "The National Testing Agency (NTA) has announced that Suresh Gyan Vihar University, Jaipur, is the latest addition to the list of universities that will be accepting CUET-PG 2022 scores for admission … [+1311 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Saurabh Kapoor", "title": "Explained: Another failure extends the elusive search for Alzheimer’s ‘silver bullet’", "description": "What is Alzheimer's disease, and why has finding a 'silver bullet' cure proved elusive?", "url": "https://indianexpress.com/article/explained/alzheimers-disease-experimental-drug-crenezumab-clinical-trials-7988106/", "urlToImage": "https://images.indianexpress.com/2022/06/Alzheimers.jpeg", "publishedAt": "2022-06-24T06:47:20Z", "content": "An experimental Alzheimers drug aimed at slowing or preventing cognitive decline in people at risk of developing the disease early has failed in clinical trials, landing a blow to efforts aimed at fi… [+6768 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Police did not follow procedure while arresting Marathi actor Ketaki Chitale: Court", "description": "Ketaki Chitale was arrested a month ago for allegedly posting a defamatory poem on Facebook purported to be against NCP chief Sharad Pawar.", "url": "https://indianexpress.com/article/cities/mumbai/police-did-not-follow-procedure-arresting-marathi-actor-ketaki-chitale-7988110/", "urlToImage": "https://images.indianexpress.com/2022/06/Ketaki-Chitale-1.jpg", "publishedAt": "2022-06-24T06:47:11Z", "content": "In its detailed order granting bail to Marathi actor Ketaki Chitale, the Thane sessions court in Maharashtra said the police did not comply with procedures while arresting her. Chitale was arrested a… [+1440 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Chiranjeevi, Pawan Kalyan, Venkatesh Daggubati and Nagarjuna come together to attend grand wedding in Hyderabad. See photos, videos", "description": "Film distributor Sunil Narang's daughter Jahnvi Narang's wedding was attended by the stars of the Telugu film industry including Pawan Kalyan, Chiranjeevi, Nagarjuna and Venkatesh Daggubati.", "url": "https://indianexpress.com/article/entertainment/telugu/chiranjeevi-pawan-kalyan-venkatesh-daggubati-nagarjuna-come-together-for-a-wedding-in-hyderabad-see-photos-videos-7988026/", "urlToImage": "https://images.indianexpress.com/2022/06/pawan-kalyan-chiranjeevi.jpg", "publishedAt": "2022-06-24T06:46:17Z", "content": "The wedding of Telugu film distributor Sunil Narang’s daughter Jahnvi Narang witnessed the coming together of the who’s who of the South film industry. While Pawan Kalyan came along with his elder br… [+3208 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "‘Don’t expect people to stay quiet’: Kapil Dev blasts Virat Kohli on his lean patch", "description": "Kapil feels the lack of runs from the Virat Kohli's bat is a big concern for Indian cricket", "url": "https://indianexpress.com/article/sports/cricket/dont-expect-people-to-stay-quiet-kapil-dev-blasts-virat-kohli-on-his-lean-patch-7988113/", "urlToImage": "https://images.indianexpress.com/2020/11/virat-kohli-kapil-dev.jpg", "publishedAt": "2022-06-24T06:44:02Z", "content": "The long and tedious wait for Virat Kohlis 75th international century dragged on for past two and half years. Since he has scored his last international century, Kohli became a father, forsook captai… [+2388 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Charlie Puth and BTS’ Jungkook’s ‘Left and Right’ out now, ARMY rejoices", "description": "Days after the BTS announced a hiatus, Jungkook's new solo with Charlie Puth came as a relief to fans.", "url": "https://indianexpress.com/article/entertainment/music/charlie-puth-bts-jungkook-left-and-right-out-now-army-rejoices-7988034/", "urlToImage": "https://images.indianexpress.com/2022/06/BTS1200-3.jpeg", "publishedAt": "2022-06-24T06:39:06Z", "content": "Weeks after sharing details of their upcoming collaboration and its teaser, Charlie Puth and BTS’s Jungkook’s upbeat new single ‘Left and Right‘ is finally out. The quirky music video of this groovy … [+1238 chars]"}]}