{"status": "ok", "totalResults": 429, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Power supply hit in Zirakpur yet again; feeders, tubewells unable to function", "description": "Power department officials said that it will take at least 24 hours more to restore the power supply; at least a hundred residential colonies are currently facing a power outage apart from several villages on the periphery of Zirakpur", "url": "https://indianexpress.com/article/cities/sas-nagar-mohali/power-supply-hit-in-zirakpur-yet-again-feeders-tubewells-unable-to-function-7974365/", "urlToImage": "https://images.indianexpress.com/2022/06/power22-5.jpg", "publishedAt": "2022-06-16T22:39:47Z", "content": "The power supply in many areas of Zirakpur remained disrupted on Thursday as the three electricity towers were damaged on Wednesday night and could not be repaired on time.Power department officials … [+1270 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Don’t take any coercive steps till July 27: HC to Punjab", "description": "Accepting notice on behalf of the state of Punjab, the Additional Advocate General of Punjab, S P S Tinna, submitted that the challenged communication was only regarding “possession to be taken of those lands whereby there has been a decision in favour of the…", "url": "https://indianexpress.com/article/cities/sas-nagar-mohali/dont-take-any-coercive-steps-till-july-27-hc-to-punjab-7974362/", "urlToImage": "https://images.indianexpress.com/2022/06/Punjab-HC-2-1-2.jpeg", "publishedAt": "2022-06-16T22:36:01Z", "content": "Hearing a petition challenging the letter issued by Additional Deputy Commissioner (Development) of Mohali wherein the authorities of Mullanpur Garibdas at Kharar have been directed to take possessio… [+1948 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Nirupama Subramanian", "title": "Explained: 2 years after Galwan clash, where India-China relations stand today", "description": "Further, India’s trade with China in the calendar year 2021 was $125 billion, higher than in the previous year, and higher than pre-pandemic, pre-Ladakh standoff levels.", "url": "https://indianexpress.com/article/explained/explained-2-years-after-galwan-clash-where-india-china-relations-stand-today-7974230/", "urlToImage": "https://images.indianexpress.com/2022/06/ladakhborderdispute.jpg", "publishedAt": "2022-06-16T22:33:29Z", "content": "Two years after the Galwan clash in the Ladakh heights, in which 20 Indian soldiers were killed, and which plunged India-China relations to their lowest in decades, the two sides are normalising rela… [+6649 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "World Kidney Cancer Day: People over 40 must get screened yearly, says doctor", "description": "Dr Priyadarshi Ranjan, Director, Urology, Robotics and Kidney Transplant Surgery, Fortis Mohali, explains in an advisory the causes and ways to detect renal cancer.", "url": "https://indianexpress.com/article/cities/chandigarh/world-kidney-cancer-day-people-over-40-must-get-screened-yearly-says-doctor-7974357/", "urlToImage": "https://images.indianexpress.com/2022/06/kidney_1200_getty.jpg", "publishedAt": "2022-06-16T22:32:00Z", "content": "Although, kidney cancer (also known as renal cancer) is one of the deadliest malignancies affecting humankind at a productive age group, awareness about the disease continues to be low. If not diagno… [+2327 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sandeep Singh", "title": "Fed rate hike: Likely impact on India, and what investors should do", "description": "Economists, who had been expecting an additional rate hike of 75-100 basis points over the next three quarters in India, now say the RBI could go for additional rate hike of up to 125 basis points this fiscal, taking the overall rate hike to over 200 basis po…", "url": "https://indianexpress.com/article/explained/fed-rate-hike-impact-indian-economy-investors-explained-7974228/", "urlToImage": "https://images.indianexpress.com/2022/06/market-1.jpg", "publishedAt": "2022-06-16T22:30:53Z", "content": "Experts say that the aggressive Fed rate hike of 75 basis points is likely to push the Reserve Bank of India for more rate hikes in the coming two or three quarters, and thereby will have a direct be… [+2724 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Krishn Kaushik", "title": "Behind protest: Temporary stint, no pension or health benefit", "description": "For those protesting on the streets or watching from the sidelines, the primary concerns and insecurity have to do with the temporary nature of the new scheme -- service is only for four years; pension has been removed; and there is no lifelong healthcare ben…", "url": "https://indianexpress.com/article/explained/behind-protest-temporary-stint-no-pension-or-health-benefit-7974267/", "urlToImage": "https://images.indianexpress.com/2022/06/Palwal-Protest-1.jpeg", "publishedAt": "2022-06-16T22:30:43Z", "content": "Hours after protests erupted in several parts of the country against the short-term Agnipath scheme for the armed forces, officials sought to allay concerns and circulated a Myth vs Fact document to … [+3970 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "At the helm of oil and urban affairs, Hardeep Singh Puri is Adda guest today", "description": "As a diplomat and a former Union Minister of Civil Aviation, Puri — the guest at Express Adda on Friday —  was one of the four Cabinet ministers tasked with coordinating the government’s massive efforts towards evacuating Indian students stranded in Ukraine a…", "url": "https://indianexpress.com/article/india/housing-urban-affairs-minister-hardeep-singh-puri-express-adda-7974261/", "urlToImage": "https://images.indianexpress.com/2022/05/Hardeep-singh-puri.jpg", "publishedAt": "2022-06-16T22:30:23Z", "content": "As Union Minister of Housing and Urban Affairs and Petroleum and Natural Gas with Cabinet rank, diplomat-turned-politician Hardeep Singh Puri is at the helm of departments and ministries that play a … [+3368 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Devendra Pandey", "title": "Batting for Bengal: Ranji team star by day, minister and TMC MLA at night", "description": "An aggressive right-handed batsman who represented India in 12 one-day internationals and three T20s, Tiwary is fully aware that his Team India dream is over, and his non-selection in the last IPL auction has also brought down the curtains on his participatio…", "url": "https://indianexpress.com/article/sports/cricket/batting-for-bengal-ranji-team-star-by-day-minister-and-tmc-mla-at-night-7974260/", "urlToImage": "https://images.indianexpress.com/2021/03/Screenshot-2021-03-15T225939.782.png", "publishedAt": "2022-06-16T22:30:12Z", "content": "FROM RESCUING the Bengal Ranji team by hitting a century during the day, to wading through files of official documents, as West Bengals Minister for Youth Affairs and Sports and Trinamool Congress ML… [+3565 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "India-ASEAN conclave: Foreign ministers agree on unified response to global issues", "description": "Jaishankar said that India fully supports a strong, unified and prosperous ASEAN with a central role in the Indo-Pacific and both sides should identify a new set of priorities while navigating the “arduous path” arising from developments in Ukraine.", "url": "https://indianexpress.com/article/india/india-asean-conclave-foreign-ministers-agree-on-unified-response-to-global-issues-7974312/", "urlToImage": "https://images.indianexpress.com/2022/06/India-ASEAN-conclave.jpg", "publishedAt": "2022-06-16T22:27:56Z", "content": "As External Affairs minister S Jaishankar flagged the geopolitical headwinds triggered by the Ukraine crisis and its knock-on effects on food, energy security, prices of fertilisers and commodities a… [+2259 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Kanpur Protests: Notice to kin of accused on ‘illegal building’", "description": "Hayat Zafar Hashmi, who is the chief of a local outfit – Maulana Mohammad Ali (MMA) Jauhar Fans Association – was arrested along with three others from Lucknow on June 4, a day after clashes erupted in Kanpur over former BJP spokespersons’ remark against the …", "url": "https://indianexpress.com/article/cities/lucknow/kanpur-protests-notice-to-kin-of-accused-on-illegal-building-7974344/", "urlToImage": "https://images.indianexpress.com/2022/06/Hayat-Zafar.jpg", "publishedAt": "2022-06-16T22:23:06Z", "content": "The Kanpur Development Authority (KDA) has served a notice to the mother of Hayat Zafar Hashmi, arrested in connection with the June 3 violence, asking why a building in her name should not be demoli… [+1835 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anup Surendranath", "title": "Justice more complete", "description": "Recent intervention by the Supreme Court suggests that there is a concerted effort to plug procedural gaps in death penalty sentencing, building on the vision outlined in ‘Bachan Singh’", "url": "https://indianexpress.com/article/opinion/columns/supreme-court-death-penalty-criminal-justice-7974153/", "urlToImage": "https://images.indianexpress.com/2022/06/Death-penalty-.jpg", "publishedAt": "2022-06-16T22:20:46Z", "content": "In a judgment delivered last month, the Supreme Court, in Manoj &amp; others v. State of MP, embarked on a significant attempt to reform the administration of the death penalty. Though the constituti… [+6318 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Sidhu’s kin to approach CJI, Union Law minister", "description": "The Central Bureau of Investigation (CBI) on Wednesday arrested a woman identified as Kalyani Singh in connection with the murder of Sippy Sidhu. Sippy was murdered in a public park in sector three Chandigarh on the night of September 20, 2015.", "url": "https://indianexpress.com/article/cities/sas-nagar-mohali/sidhus-kin-to-approach-cji-union-law-minister-7974353/", "urlToImage": "https://images.indianexpress.com/2022/06/Sippy-mother.jpg", "publishedAt": "2022-06-16T22:20:40Z", "content": "The family members of national-level shooter and advocate Sukhmanpreet Singh alias Sippy Sidhu, who was killed in 2015, on Thursday demanded that the acting Chief Justice of Himachal Pradesh High Cou… [+2195 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Deepika Saraswat", "title": "In The Shadow Of Sanctions", "description": "Iran foreign minister’s visit reaffirms resolve of two countries to strengthen ties", "url": "https://indianexpress.com/article/opinion/columns/iran-foreign-ministers-visit-reaffirms-resolve-of-two-countries-to-strengthen-ties-7974160/", "urlToImage": "https://images.indianexpress.com/2022/06/modi-iran-1200-1.jpg", "publishedAt": "2022-06-16T22:20:38Z", "content": "Irans Foreign Minister Hossein Amir-Abdollahians three-day visit to India, last week, was the first ministerial-level visit from Iran since Ebrahim Raisi assumed the Iranian presidency in August last… [+3963 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rakhshanda Jalil", "title": "An ustad of our times", "description": "Scholar and teacher Gopichand Narang believed in Urdu’s ability to build bridges", "url": "https://indianexpress.com/article/opinion/columns/gopichand-narang-death-urdu-studies-7974181/", "urlToImage": "https://images.indianexpress.com/2022/06/Gopi-Chand-Narang-1200.jpeg", "publishedAt": "2022-06-16T22:20:22Z", "content": "Gopichand Narang passed away on Wednesday in Charlotte, USA, surrounded by his family. He was 92. With him an era of Urdu studies ends, for he was the last of the great Urdu ustads of modern times. I… [+4840 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Govt raises Agnipath upper age to 23 for this year after protests", "description": "Trains, BJP offices attacked in Bihar; govt vehicles set on fire in Haryana; key BJP ally JD(U) leads calls for review of scheme", "url": "https://indianexpress.com/article/india/govt-raises-agnipath-upper-age-to-23-for-this-year-after-protests-7974259/", "urlToImage": "https://images.indianexpress.com/2022/06/bihar-protest.jpg", "publishedAt": "2022-06-16T22:18:59Z", "content": "WITH key NDA ally JD(U) leading calls for an immediate review of Agnipath, the new short-term recruitment policy for the Armed Forces, after violent protests seeking a rollback erupted in several sta… [+7670 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Saurabh Parashar", "title": "‘iPhone found near his body was gifted to Kalyani by Sippy a few months before murder’", "description": "As per officers involved in the probe, Sippy Sidhu allegedly could access all the digital contents of the gifted iPhone remotely, which was one of the prime reasons why Kalyani had stopped using the device.", "url": "https://indianexpress.com/article/cities/chandigarh/iphone-found-near-his-body-was-gifted-to-kalyani-by-sippy-a-few-months-before-murder-7974350/", "urlToImage": "https://images.indianexpress.com/2022/06/sippy-sidhu-3.jpg", "publishedAt": "2022-06-16T22:14:56Z", "content": "Investigators probing the 2015 murder of national-level shooter and advocate Sukhmanpreet Singh alias Sippy Sidhu said that an iPhone found near the body was the same one that Sippy had gifted to Kal… [+2340 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "UP: Jump in Covid infections, active cases near 2,000", "description": "In the last two days, the state reported 318 and 286 new cases on Wednesday and Tuesday, respectively.", "url": "https://indianexpress.com/article/cities/lucknow/up-jump-in-covid-infections-active-cases-near-2000-7974341/", "urlToImage": "https://images.indianexpress.com/2022/04/PTI04_20_2022_000117B.jpg", "publishedAt": "2022-06-16T22:10:56Z", "content": "There has been a steady increase in the number of Covid-19 cases in Uttar Pradesh in the last few days. The Thursday bulletin of the state Health Department reported 413 new cases in the last 24 hour… [+1250 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anonna Dutt", "title": "Rise in booster dose numbers as cases spike across country", "description": "Official figures show that around 47.5 lakh third doses were administered in the first 15 days of June compared with 41.5 lakh during the last 15 days of May.", "url": "https://indianexpress.com/article/india/rise-in-booster-dose-numbers-as-cases-spike-across-country-7974224/", "urlToImage": "https://images.indianexpress.com/2022/06/Vaccine-3.jpeg", "publishedAt": "2022-06-16T22:10:17Z", "content": "WITH A fresh surge in Covid cases across the country, there was a 44.3 per cent increase in the number of precautionary or booster doses administered during the past week as compared to the week befo… [+2352 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tushar Bhaduri", "title": "Explained: How Saudi big money has shaken up golf’s status quo", "description": "With hundreds of millions on offer, several top golfers have left the PGA Tour for the Arabian kingdom’s LIV Golf venture", "url": "https://indianexpress.com/article/explained/explained-how-saudi-big-money-has-shaken-up-golfs-status-quo-7974182/", "urlToImage": "https://images.indianexpress.com/2022/06/Golf-Explained.jpg", "publishedAt": "2022-06-16T22:08:49Z", "content": "This week, Brookline, Massachusetts is hosting the toughest test in golf, as the US Open is often described as. But the last few weeks can also be referred to as the toughest test of golf as developm… [+5506 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "Life, not-life", "description": "Google engineer’s claim that LaMDA is sentient AI touches off questions about humanity’s relationship with machines", "url": "https://indianexpress.com/article/opinion/editorials/google-engineer-claim-lamda-ai-questions-about-humanitys-relationship-with-machines-google-engineers-claim-that-lamda-is-sentient-ai-touches-off-questions-about-humanitys-re/", "urlToImage": "https://images.indianexpress.com/2022/06/edit-3.jpg", "publishedAt": "2022-06-16T22:02:28Z", "content": "Viktor Frankensteins monster could just as easily have been his friend. The creature from Mary Shelleys 1818 novel wanted more than anything to be accepted, to have a companion. And he continues to b… [+1591 chars]"}]}