{"status": "ok", "totalResults": 572, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Pratyush Raj", "title": "Ranji Trophy: Top guns disappoint on Day 1", "description": "Gill, Agarwal and Shaw fail to shine on first day of quarterfinals.", "url": "https://indianexpress.com/article/sports/cricket/ranji-trophy-top-guns-disappoint-on-day-1-7955933/", "urlToImage": "https://images.indianexpress.com/2022/06/Mayank-5.jpg", "publishedAt": "2022-06-06T14:44:35Z", "content": "For Punjabs Shubman Gill, it was a golden chance to get some runs against the red ball before the Edgbaston Test against England starting July 1. But he failed to capitalise on the opportunity, manag… [+4333 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Santosh Singh", "title": "Invoking Opp unity, Lalu calls for another fight against civil war and Emergency-like situation under BJP", "description": "Cautioning the Bihar Opposition parties and targeting the Bharatiya Janata Party at the Centre, Lalu underlined the need for opposition unity to take on \"firkaparast taakate” (communal forces).", "url": "https://indianexpress.com/article/cities/patna/opp-unity-lalu-fight-against-civil-war-emergency-like-situation-bjp-7955941/", "urlToImage": "https://images.indianexpress.com/2022/06/lalu-prasad-yadav759.jpg", "publishedAt": "2022-06-06T14:40:04Z", "content": "A week after veteran socialist and RJD leader Sharad Yadav asked for the urgent need for Opposition unity and said taking up the Kashi-Vishwanath Temple-Gyanvapi mosque issue would only cause communa… [+3111 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "‘After watching James Bond movies…,’ bird stalks cat and turns back when caught", "description": "The video shared on Twitter by IFS officer Susanta Nanda has got more than 55,000 views and thousands of likes.", "url": "https://indianexpress.com/article/trending/trending-in-india/bird-stalks-cat-video-7955939/", "urlToImage": "https://images.indianexpress.com/2022/06/Trending-card-3.jpg", "publishedAt": "2022-06-06T14:39:35Z", "content": "Cats are often seen chasing and hunting birds, but an odd video that is making the rounds on social media shows just the opposite.In an undated video, a bird can be seen carefully following a cat. Ju… [+1817 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Divya A", "title": "Explained: Tamil Nadu sculptures recovered from Australia, US", "description": "Union Culture Minister G Kishan Reddy said at the event, “Bringing Our Gods Home is an initiative by the government that is rooted in preserving, promoting and propagating our heritage”.", "url": "https://indianexpress.com/article/explained/tamil-nadu-sculptures-australia-us-7955935/", "urlToImage": "https://images.indianexpress.com/2022/06/explained-culture.jpg", "publishedAt": "2022-06-06T14:39:26Z", "content": "Ten antiquities (sculptures) retrieved from Australia and the United States were handed over to the Government of Tamil Nadu in Delhi last week. Union Culture Minister G Kishan Reddy said at the even… [+3043 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "Assam SEBA HSLC 10th Result 2022: When and where to check score", "description": "Students can check their results on the official website of SEBA — sebaonline.org and resultsassam.nic.in.", "url": "https://indianexpress.com/article/education/assam-seba-hslc-10th-result-2022-declared-when-and-where-to-check-sebaonline-org-resultsassam-nic-in-7870682/", "urlToImage": "https://images.indianexpress.com/2022/04/cbse2.jpg", "publishedAt": "2022-06-06T14:30:55Z", "content": "The practical exams were conducted from March 4 to 5, 2022 and the theory exams were held between March 15 till March 31, 2022. The practical exams were conducted from 9 am to 12 noon, whereas the th… [+994 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Why you mustn’t ignore symptoms like dizziness, loss of balance, numbness in one side of the body", "description": "Symptoms can last a lifetime. Long-term effects may include pneumonia and the inability to regulate one’s bladder, said Dr Nitin Dange", "url": "https://indianexpress.com/article/lifestyle/health/stroke-awareness-emergency-home-measures-condition-symptoms-7922392/", "urlToImage": "https://images.indianexpress.com/2021/10/pixabay_brain-stroke_1200-1.jpeg", "publishedAt": "2022-06-06T14:30:43Z", "content": "A stroke is a medical disorder in which the blood supply to the brain gets disrupted, resulting in cell death. According to experts, the risk factors for a stroke increase with unhealthy lifestyle ha… [+3965 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Karnataka road named after Gandhi assassin Godse, removed after criticism", "description": "The signboard, put up in Bola grama panchayat of Karkala taluk, had the same colours and fonts as generally used by zilla panchayats across the state.", "url": "https://indianexpress.com/article/cities/bangalore/karnataka-road-named-after-gandhi-assassin-godse-removed-criticism-7955918/", "urlToImage": "https://images.indianexpress.com/2022/06/Capture-4.jpg", "publishedAt": "2022-06-06T14:20:31Z", "content": "The administration in Karnatakas communally sensitive Udupi district woke up to a rude shock on Monday: a signboard naming a road after Mahatma Gandhi assassin Nathuram Godse had been installed in a … [+1178 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rahul Pandey", "title": "The Re-inventor, season finale", "description": "Dinesh Karthik was the star of India’s first T20 game in 2006 against South Africa. As the two teams meet again, the format and the man have drastically changed.", "url": "https://indianexpress.com/article/sports/cricket/the-re-inventor-season-finale-7955907/", "urlToImage": "https://images.indianexpress.com/2022/06/Karthik-2.jpg", "publishedAt": "2022-06-06T14:17:33Z", "content": "“When I went in I just wanted to play out all the overs, as that’s what my captain wanted me to do,” said Dinesh Karthik after the match.He had just helped India win their first ever T20I, against So… [+5114 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "As Apple upgrades its software, developers hunt for headset hints", "description": "The Apple headset is likely to use cameras to pass a view of the outside world into a high-resolution display that can overlay digital objects on physical surroundings and could arrive in March of next year.", "url": "https://indianexpress.com/article/technology/tech-news-technology/as-apple-upgrades-its-software-developers-hunt-for-headset-hints-7955919/", "urlToImage": "https://images.indianexpress.com/2022/06/Apple-Generic-reuters.jpg", "publishedAt": "2022-06-06T14:17:25Z", "content": "As Apple Inc rolls out its usual stream of upgrades to operating systems for its iPhones, iPads and Macs at its annual software developer conference Monday, analysts and developers will be scouring b… [+3655 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuradha Mascarenhas", "title": "Maharashtra steps up surveillance measures to curb cases of vector-borne diseases", "description": "State surveillance officer Dr Pradeep Awate said guidelines have been issued to each district to prepare action plans to check vector-borne diseases.", "url": "https://indianexpress.com/article/cities/pune/maharashtra-surveillance-measures-curb-cases-vector-borne-diseases-7955911/", "urlToImage": "https://images.indianexpress.com/2022/06/disease.jpg", "publishedAt": "2022-06-06T14:08:38Z", "content": "There has been a rise in vector-borne diseases like dengue and chikungunya in Maharashtra in the last three years, official data revealed. In 2019, there were 2,064 cases of dengue and three deaths, … [+2083 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Jimmy Leivon", "title": "COHSEM Manipur Class 12 results declared, 90% pass percentage recorded", "description": "As many as 28,166 appeared in the examinations and 25,374 students qualified. The total number of female candidates is 13881 and 14285 are male.", "url": "https://indianexpress.com/article/education/manipur-class-12-results-declared-90-pass-percentage-recorded-manresults-nic-in-cohsem-nic-in-7955898/", "urlToImage": "https://images.indianexpress.com/2022/06/Webp.net-resizeimage-39-10.41.52-PM.jpg", "publishedAt": "2022-06-06T14:07:57Z", "content": "The Council of Higher Secondary School Manipur (COHSEM) on Monday declared the class 12 results with an overall pass percentage of 90.09 per cent. The result is available at manresults.nic.in and coh… [+2031 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Avaneesh Mishra", "title": "Bus accident: Uttarakhand orders probe, PM Modi announces Rs 2 lakh for kin of deceased", "description": "Twenty-five people died Sunday when a bus carrying pilgrims from Madhya Pradesh plunged into a gorge in Uttarakhand’s Uttarkashi. The MP government has announced Rs 5 lakh each for the families of the deceased.", "url": "https://indianexpress.com/article/india/bus-accident-uttarakhand-probe-pm-modi-2-lakh-kin-deceased-7955846/", "urlToImage": "https://images.indianexpress.com/2022/06/PTI06_05_2022_000289B.jpg", "publishedAt": "2022-06-06T14:01:38Z", "content": "The Uttarakhand government has ordered a magisterial inquiry into the accident in Uttarkashi district in which 25 persons from Madhya Pradeshs Panna district died after the bus carrying them fell int… [+3744 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "In Bali, bird sellers help endangered mynah make a comeback", "description": "Experts say more research and monitoring is needed, but the conservation model has shown promise over the past 10 years and could be replicated for other vulnerable birds in Indonesia.", "url": "https://indianexpress.com/article/lifestyle/life-style/in-bali-bird-sellers-help-endangered-mynah-make-a-comeback-7955150/", "urlToImage": "https://images.indianexpress.com/2022/06/MynahBali_AP1.jpg", "publishedAt": "2022-06-06T14:00:14Z", "content": "Tossing flowing crests back and forth, three snow-white Bali mynahsshare a branch, squawking and looking around with the trademark blue patches around their eyes catching sunlight. Minutes later, fou… [+5881 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Elon Musk threatens to walk away from Twitter deal", "description": "The lawyers say that based on Twitter’s latest correspondence, Musk believes the company is resisting and thwarting his information rights under the April merger agreement.", "url": "https://indianexpress.com/article/technology/tech-news-technology/elon-musk-threatens-to-walk-away-from-twitter-deal-7955878/", "urlToImage": "https://images.indianexpress.com/2022/06/Elon-Musk-twitter-reuters.jpg", "publishedAt": "2022-06-06T13:56:10Z", "content": "Elon Musk is threatening to end his $44 billion agreement to buy Twitter, accusing the company of refusing to give him information about its spam bot accounts. Lawyers for the Tesla and SpaceX CEO ma… [+1119 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Liz Mathew", "title": "Sharma, Jindal ignored warnings, dented image, action to draw the line: BJP", "description": "Leaders said the party was busy with its activities for the Modi government's eighth anniversary celebrations \"showcasing its Garib Kalyan programmes”, and both Nupur Sharma, its national spokesperson, and Naveen Kumar Jindal, head of the Delhi BJP's media un…", "url": "https://indianexpress.com/article/political-pulse/nupur-sharma-naveen-jindal-warnings-dented-image-swift-action-bjp-7955875/", "urlToImage": "https://images.indianexpress.com/2022/06/sharma-jindal-1200.jpg", "publishedAt": "2022-06-06T13:54:27Z", "content": "THERE may be rumblings in a section of the rank and file of the local Delhi BJP but in the party’s senior level, most leaders say that the suspension of the two spokespersons for their derogatory ref… [+3495 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Shaheer Sheikh reveals daughter Anaya’s face, puts shoes on her feet. Watch adorable video", "description": "Television actor Shaheer Sheikh shared a cute video with his daughter Anaya on Instagram.", "url": "https://indianexpress.com/article/entertainment/television/shaheer-sheikh-reveals-daughter-anayas-face-in-new-video-7955855/", "urlToImage": "https://images.indianexpress.com/2022/06/shaheer.jpg", "publishedAt": "2022-06-06T13:53:27Z", "content": "Television actor Shaheer Sheikh has shared a new video with his daughter, Anaya. The actor, who welcomed his daughter with Ruchikaa Kapoor last year, had avoided sharing photos of her on social media… [+1400 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Priya Kumari Shukla", "title": "UPSC Key-June 6, 2022: Why and What to know about ‘Black Money’ to ‘Gait Test’ for UPSC CSE", "description": "Exclusive for Subscribers from Monday to Friday: The Indian Express UPSC Key June 6, 2022 will help you prepare for the Civil Services and other competitive examinations with cues on how to read, how to connect the dots and understand content from the most au…", "url": "https://indianexpress.com/article/upsc-current-affairs/upsc-key-june-6-2022-why-and-what-to-know-about-black-money-to-gait-test-for-upsc-cse-7955859/", "urlToImage": "https://images.indianexpress.com/2022/06/IMG-20220526-WA0002.jpg", "publishedAt": "2022-06-06T13:44:52Z", "content": "FRONT PAGE\r\nBlack Money Act order against Anil Ambani: offshore assets Rs 800 cr\r\nSyllabus:\r\nPreliminary Examination: Current events of national and international importance.\r\nMains Examination: Gene… [+9431 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Blatter, Platini finally going to court in FIFA fraud trial", "description": "The fallout from the case ousted Blatter ahead of schedule as president of FIFA and ended Platini’s campaign to succeed his former mentor. It also removed Platini as president of UEFA, the governing body of European soccer.", "url": "https://indianexpress.com/article/sports/football/blatter-platini-finally-going-to-court-in-fifa-fraud-trial-7955874/", "urlToImage": "https://images.indianexpress.com/2022/06/Blatter-Platini.jpg", "publishedAt": "2022-06-06T13:43:00Z", "content": "Sepp Blatter and Michel Platinis 11-day trial on charges of defrauding FIFA starts Wednesday finally bringing the epic downfall of soccers former world leaders into criminal court.The fallout from th… [+5935 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Bengaluru: Doddamara residents’ repeated pleas over pressing civic woes go unheard", "description": "Locals pointed out that the lack of a proper drainage system has damaged the road while stagnant water and improper garbage disposal ups the risk of diseases. The condition of the road has led to accidents and cabs refuse to operate in Doddamara.", "url": "https://indianexpress.com/article/cities/bangalore/bengaluru-doddamara-residents-pressing-civic-woes-7955867/", "urlToImage": "https://images.indianexpress.com/2022/06/doddamara.jpg", "publishedAt": "2022-06-06T13:39:56Z", "content": "Despite writing over 30 letters to political representatives and government officials highlighting the perils of poor civic infrastructure and mismanagement of solid waste, residents in Doddamara con… [+1943 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "‘I didn’t do anything unhealthy’: Kim Kardashian defends Met Gala weight loss", "description": "\"To me, it was like, ‘OK, Christian Bale can do it for a movie role and that is acceptable.’ Even Renée Zellweger gained weight for a role. It’s all the same to me,\" she said", "url": "https://indianexpress.com/article/lifestyle/fitness/kim-kardashian-defends-met-gala-weight-loss-marilyn-monroe-dress-7952393/", "urlToImage": "https://images.indianexpress.com/2022/06/Kim-Kardashian-1200.jpg", "publishedAt": "2022-06-06T13:30:23Z", "content": "Kim Kardashian left everyone astonished at this year’s Met Gala when she turned up in the iconic Marilyn Monroe dress that the latter wore in 1962 to sing ‘Happy Birthday’ to former US President JF K… [+1640 chars]"}]}