{"status": "ok", "totalResults": 569, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Maruti Kharkhoda plant to produce its first electric car in 2025: Punjab Deputy CM Dushyant Chautala", "description": "At this plant, Suzuki will make motorcycles in 100 acres while Maruti will make electric vehicles in 800 acres.", "url": "https://indianexpress.com/article/cities/chandigarh/maruti-kharkhoda-plant-to-produce-its-first-electric-car-in-2025-punjab-deputy-cm-dushyant-chautala-7919074/", "urlToImage": "https://images.indianexpress.com/2022/05/maruti-ncr-1.jpg", "publishedAt": "2022-05-15T22:34:10Z", "content": "The Maruti Suzuki’s plant at Sonipat’s Kharkhoda will manufacture its first electric car in 2025, Punjab deputy CM Dushyant Chautala said on Sunday. At this plant, Suzuki will make motorcycles in 100… [+1344 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Yubaraj Ghimire, Divya A", "title": "With Buddhist centre, India looks to bolster cultural ties to Nepal", "description": "Sources said PM Modi’s brief visit to Lumbini — he is expected to be here between 10.30 am and 3.30 pm — is focused on bringing soft power to the centrestage of India-Nepal relations while also marking India’s formal presence at the holy site that’s barely 10…", "url": "https://indianexpress.com/article/india/with-buddhist-centre-india-looks-to-bolster-cultural-ties-to-nepal-7918966/", "urlToImage": "https://images.indianexpress.com/2022/05/Buddhist-cultural-centre.jpg", "publishedAt": "2022-05-15T22:30:54Z", "content": "Prime Minister Narendra Modi will Monday travel to Lumbini in Nepal to participate in a ceremony to lay the foundation stone for a Buddhist cultural centre to coincide with Buddha Purnima.Sources sai… [+3986 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manoj C G", "title": "Congress Chintan Shivir: Rahul admits people connect lost, Sonia announces all-India yatra", "description": "To reestablish that connection, Sonia announced the party will undertake a Bharat yatra from October 2 this year. The party also announced a series of organisational reforms at the end of its three-day chintan shivir here to bring new and young faces into lea…", "url": "https://indianexpress.com/article/india/congress-chintan-shivir-rahul-admits-people-connect-lost-sonia-announces-all-india-yatra-7918969/", "urlToImage": "https://images.indianexpress.com/2022/05/sonia-1200-1-1.jpg", "publishedAt": "2022-05-15T22:30:40Z", "content": "Having suffered staggering election defeats since 2014 under his leadership and that of his mother Sonia Gandhi, Rahul Gandhi on Sunday admitted that the Congresss connection with the people is broke… [+5122 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "UP: FIR against ex-MLA, wife, daughter for conspiring to kill Gyanpur MLA", "description": "Vijay Mishra, a four-time MLA from Gyanpur, lost to Dubey in the recently concluded Assembly elections in the state. While Mishra contested from jail on Pragatisheel Manav Samaj Party ticket, Dubey contested as NISHAD party nominee.", "url": "https://indianexpress.com/article/cities/lucknow/up-fir-against-ex-mla-wife-daughter-for-conspiring-to-kill-gyanpur-mla-7919006/", "urlToImage": "https://images.indianexpress.com/2022/05/UP-police-1200-1-1.jpg", "publishedAt": "2022-05-15T22:30:30Z", "content": "Bhadohi police on Sunday registered an FIR against former MLA Vijay Mishra, his wife and daughter and three others for allegedly hatching a conspiracy to kill Gyanpur MLA Vipul Dubey.Mishra, a four-t… [+1161 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Who is Devasahayam Pillai, first Indian layman to be declared a saint by Vatican?", "description": "Pope Francis canonised Blessed Devasahayam during the Canonisation Mass in St Peter's Basilica, which was attended by over 50,000 faithful from all over the world, as well as government delegations honouring him and nine other new saints, PTI reported.", "url": "https://indianexpress.com/article/explained/who-is-devasahayam-pillai-first-indian-layman-to-be-declared-a-saint-by-vatican-7918938/", "urlToImage": "https://images.indianexpress.com/2022/05/Devasahayam.jpg", "publishedAt": "2022-05-15T22:30:10Z", "content": "Pope Francis canonised Blessed Devasahayam during the Canonisation Mass in St Peter’s Basilica, which was attended by over 50,000 faithful from all over the world, as well as government delegations h… [+2427 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Biggest infra materials deal: Holcim’s India biz is Adani’s for $10.5 billion", "description": "Through its subsidiaries, Holcim holds 63.19% in Ambuja Cements Ltd and 54.53% in ACC Ltd (of which 50.05% is held through Ambuja Cements). This is the largest ever acquisition by Adani, which beat the JSW and Aditya Birla groups to the deal.", "url": "https://indianexpress.com/article/business/companies/biggest-infra-materials-deal-holcims-india-biz-is-adanis-for-dollar-10-5-billion-7918999/", "urlToImage": "https://images.indianexpress.com/2022/05/Gautam-Adani.jpg", "publishedAt": "2022-05-15T22:30:04Z", "content": "The Adani group has acquired Zurich-based Holcims cement business in India for $10.5 billion (about Rs 81,000 crore) in Indias largest ever M&amp;A transaction in the infrastructure and materials spa… [+3431 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Varinder Bhatia", "title": "Chintels Paradiso roof collapse: Groundwork done, Haryana to hand over case to CBI", "description": "Sources told The Indian Express that all the legal modalities have been worked out by the state government and procedures completed to hand over the case to the independent investigating agency.", "url": "https://indianexpress.com/article/cities/chandigarh/chintels-paradiso-roof-collapse-groundwork-haryana-hand-over-case-cbi-7919069/", "urlToImage": "https://images.indianexpress.com/2022/05/Gurugram-apartment-collapse.jpg", "publishedAt": "2022-05-15T22:24:57Z", "content": "It was in February when the ceilings of multiple flats collapsed at a posh housing society Chintels Paradiso in Gurgaon’s Sector 109, resulting in the death of two people. Now three months later, the… [+2945 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "170 properties belonging to former BSP MLC, family and aides seized", "description": "The police have also the opened history-sheet of Iqbal.", "url": "https://indianexpress.com/article/cities/lucknow/170-properties-belonging-to-former-bsp-mlc-family-and-aides-seized-7919067/", "urlToImage": "https://images.indianexpress.com/2022/05/UP-police-1200-1-1-1.jpg", "publishedAt": "2022-05-15T22:19:12Z", "content": "Saharanpur Police have seized 170 properties of former BSP MLC and history-sheeter Haji Iqbal alias Bala, his family and associates under the Uttar Pradesh Gangsters and Anti-Social Activities (Preve… [+869 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Man Aman Singh Chhina", "title": "Military Digest | Uphill battle of veterans & kin to get dues continues", "description": "The pension imbroglio has shown that if even senior officers are not spared the ignominy of running around for their dues then what may be the case with junior officers and other ranks and their widows/next of kin settled in remote areas.", "url": "https://indianexpress.com/article/cities/chandigarh/military-digest-battle-veterans-kin-dues-7919058/", "urlToImage": "https://images.indianexpress.com/2022/05/Aujla-2col.jpg", "publishedAt": "2022-05-15T22:14:38Z", "content": "The official apathy towards veterans and their dependents is nothing new but every now and then there comes welcome news where some veteran or dependent wins the legal battle finally in face of stiff… [+4220 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "2 Bowbazar houses to be demolished partly, decision on other buildings after expert opinion: KMRCL", "description": "KMRCL managing director (MD) Chandranath Jha said this after a meeting with officials of the Kolkata Municipal Corporation (KMC), and representatives of the ruling Trinamool Congress over the cracks in buildings and rehabilitation of the residents of Durga Pi…", "url": "https://indianexpress.com/article/cities/kolkata/2-bowbazar-houses-to-be-demolished-partly-decision-on-other-buildings-after-expert-opinion-kmrcl-7919061/", "urlToImage": "https://images.indianexpress.com/2022/05/Workers-install-support-pillars-to-prevent-widening-of-cracks-caused-by-Metro-railway-construction-in-Kolkata-Sunday.jpg", "publishedAt": "2022-05-15T22:10:43Z", "content": "The Kolkata Metro Rail Corporation (KMRCL) on Sunday said that two of the houses that developed cracks in the city’s Bowbazar area due to underground construction work will be demolished partly and e… [+2009 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Fake call centre racket: Woman associate of ‘kingpin’ held", "description": "“The arrested woman is one of the main associates of Sandip Biswas, the kingpin of the racket. She has been sent to 12 days of police custody,” said Meeraj Khalid, DIG (CID Operations).", "url": "https://indianexpress.com/article/cities/kolkata/fake-call-centre-racket-woman-associate-of-kingpin-held-7919043/", "urlToImage": "https://images.indianexpress.com/2022/05/call-cnctre.jpg", "publishedAt": "2022-05-15T22:00:37Z", "content": "In its ongoing probe into a fake call centre racket, the Criminal Investigation Department (CID) of the Kolkata Police on Sunday arrested a woman.The arrested woman is one of the main associates of S… [+927 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Rahim re-elected DYFI chief, Himaghnaraj new gen secy", "description": "Himaghnaraj, who replaced Abhoy Mukhopadhyay, started with CPIM's student wing in South 24 Parganas.", "url": "https://indianexpress.com/article/cities/kolkata/rahim-re-elected-dyfi-chief-himaghnaraj-new-gen-secy-7919054/", "urlToImage": "https://images.indianexpress.com/2022/05/Tripura-voting-1.jpg", "publishedAt": "2022-05-15T21:59:43Z", "content": "The CPI(M)s youth wing DYFI on Sunday re-elected AA Rahim, a Rajya Sabha member from Kerala, as its as its national president and made Himaghnaraj Bhattacharya of West Bengal its new general secretar… [+1473 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Prayer meet on first barsi of Milkha Singh, Nirmal Milkha Singh: Jeev remembers parents says, ‘Mawan thandian chhawan, Peo tatte gheo’", "description": "The Milkha couple, who breathed their last within one week of each other on June 13 and June 18 respectively last year due to Covid-19, were remembered by family and friends during a ceremony on Sunday afternoon.", "url": "https://indianexpress.com/article/cities/chandigarh/prayer-meet-first-barsi-milkha-singh-nirmal-milkha-singh-jeev-remembers-parents-7919052/", "urlToImage": "https://images.indianexpress.com/2022/05/NL-Milkha-3cols.jpg", "publishedAt": "2022-05-15T21:54:15Z", "content": "A prayer meet and remembrance meeting was conducted by the Milkha family on the occasion of the first barsi of Flying Sikh Milkha Singh and former Indian volleyball captain Nirmal Milkha Singh in Cha… [+2979 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sourav Roy Barman", "title": "Tie-ups between Indian, foreign varsities: UGC begins outreach", "description": "The commission now plans to hold a meeting with the heads of foreign missions in India to discuss the possibilities of tie-ups in step with the recently notified regulations on twinning programmes, joint degree and dual degree programmes that will be applicab…", "url": "https://indianexpress.com/article/education/tie-ups-between-indian-foreign-varsities-ugc-begins-outreach-7919048/", "urlToImage": "https://images.indianexpress.com/2018/08/jnu-story-1200.jpg", "publishedAt": "2022-05-15T21:50:01Z", "content": "IN A major push to scale up collaborations between Indian and foreign institutions in higher education, the University Grants Commission (UGC) has reached out to nearly 500 foreign universities, loca… [+2125 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Dera Bassi: Farmer booked for burning stubble", "description": "According to the FIR, farmer Jeet Singh, ignited the fire to burn the stubble without checking the direction of the wind and his negligence led to 45 shanties being gutted, resulting in the death of a toddler as well.", "url": "https://indianexpress.com/article/cities/sas-nagar-mohali/dera-bassi-farmer-booked-for-burning-stubble-7919050/", "urlToImage": "https://images.indianexpress.com/2022/05/arrest-17.jpg", "publishedAt": "2022-05-15T21:42:33Z", "content": "A day after a toddler died in the fire caused by stubble burning at Sundaran village, Dera Bassi, on Saturday, the police booked the farmer who had burnt the stubble in his fields, on Sunday.Accordin… [+1160 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Panchkula: Parking row turns ugly, cross-FIRs filed", "description": "The cases were registered against a 57-year-old Aashu Varun and two others, and Chetna Munshi and her husband Anubhav Mishra.", "url": "https://indianexpress.com/article/cities/panchkula/panchkula-parking-row-turns-ugly-cross-fir-7919047/", "urlToImage": "https://images.indianexpress.com/2022/05/aprking-1.jpg", "publishedAt": "2022-05-15T21:34:48Z", "content": "Row over parking turned ugly when two parties, residents of same colony, fought over a wrongly parked car, on Saturday night. Cross FIRs were registered by the Panchkula police. The cases were regist… [+1577 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mohali sanitation woes: Facing residents’ ire, MC allots contracts to maintain parks", "description": "The MC has around 600 parks under its jurisdiction in the city. Out of these, around 100 are being maintained by the Resident Welfare Associations (RWA) in different areas.", "url": "https://indianexpress.com/article/cities/sas-nagar-mohali/mohali-sanitation-woes-residents-ire-mc-contracts-maintain-parks-7919038/", "urlToImage": "https://images.indianexpress.com/2022/05/NL-Mohalipark-2cols.jpg", "publishedAt": "2022-05-15T21:22:50Z", "content": "Mohali Municipal Corporation (MC) allotted the work of maintaining parks in the city to contractors, on Saturday. The work will start within the next two days. Residents in many areas have been criti… [+1617 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Arun Sharma", "title": "Article 370 basis for accession of J&K to India, could not be removed: Omar Abdullah", "description": "The statement assumes significance as it has come when the Supreme Court has agreed to consider listing after summer vacation the petitions challenging Centre’s decision to abrogate Article 370, which gave special status to the erstwhile state of Jammu and Ka…", "url": "https://indianexpress.com/article/cities/jammu/article-370-basis-for-accession-of-jk-to-india-could-not-be-removed-omar-abdullah-7919037/", "urlToImage": "https://images.indianexpress.com/2022/05/Omar-1.jpg", "publishedAt": "2022-05-15T21:20:40Z", "content": "National Conference (NC) vice-president Omar Abdullah on Sunday said Article 370 had been a temporary provision in the Constitution, but it could not have been removed as it formed the basis for acce… [+2232 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Harikishan Sharma", "title": "Centre relaxes procurement norms for shrivelled, broken wheat grains", "description": "The move is aimed at providing relief to Punjab and Haryana farmers during the ongoing rabi marketing season.", "url": "https://indianexpress.com/article/india/centre-relaxes-procurement-norms-for-shrivelled-broken-wheat-grains-7919031/", "urlToImage": "https://images.indianexpress.com/2022/05/wheat-3.jpg", "publishedAt": "2022-05-15T21:15:14Z", "content": "The Centre on Sunday announced a major relaxation in the Fair and Average Quality (FAQ) norms of wheat by raising the maximum permissible limit of shrivelled and broken grains to 18 per cent from the… [+3404 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Saurabh Parashar", "title": "Tricity grapples with a new epidemic: Cyber crime", "description": "In the first four months of this year itself, the city police has registered 70 per cent FIRs related to cyber crimes, compared to 2021.", "url": "https://indianexpress.com/article/cities/chandigarh/tricity-grapples-new-epidemic-cyber-crime-7919032/", "urlToImage": "https://images.indianexpress.com/2022/05/cyber-crime-2.jpg", "publishedAt": "2022-05-15T21:08:05Z", "content": "Not a day goes by when the UT police does not register a case of cyber crime. Police officers say if this carries on, cyber crimes will be on top of the crime chart in Chandigarh. In the first four m… [+10594 chars]"}]}