{"status": "ok", "totalResults": 377, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Gayathri Mani", "title": "Delhi Government to conduct special drive to resolve pending pension cases", "description": "The main reason behind the delay in deciding pension matters are delays in the issuance of retirement orders and submitting pension papers to the Principal Accounts Office.", "url": "https://indianexpress.com/article/delhi/delhi-government-to-conduct-special-drive-to-resolve-pending-pension-cases-7991926/", "urlToImage": "https://images.indianexpress.com/2022/06/arvind-kejriwal-1.jpeg", "publishedAt": "2022-06-26T04:47:30Z", "content": "To address issues being faced by pensioners due to administrative delays, the Delhi Government has decided to organise a special drive to resolve all pending cases related to pensions and avoid litig… [+3370 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sridhar V", "title": "Explained: Why Toyota fears wheels may come off its flagship electric vehicle", "description": "According to a spokesperson for Toyota, the hub bolts on the wheels of the concerned bZ4X battery EVs run the risk of loosening “to the point where the wheel can detach from the vehicle” after “low-mileage use”.", "url": "https://indianexpress.com/article/explained/explained-toyota-fears-wheels-may-come-off-flagship-electric-vehicle-7991913/", "urlToImage": "https://images.indianexpress.com/2022/06/explained-toyota.png", "publishedAt": "2022-06-26T04:46:29Z", "content": "Less than three months after it launched the bZ4X SUV globally, Toyota Motor Corporation has issued a recall of nearly 2,700 units of the new electric vehicle (EV) following concerns that its loose w… [+3429 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shamik Chakrabarty", "title": "View Review: Why India will face a braver England in the 5th Test at Edgbaston", "description": "Since new coach Brendon MCullum took over and the Test team's reins were handed over to captain Ben Stokes, England have played an aggressive brand of cricket; India, meanwhile, will hope their best batters return to form", "url": "https://indianexpress.com/article/sports/cricket/view-review-why-india-will-face-a-braver-england-in-the-5th-test-at-edgbaston-7991900/", "urlToImage": "https://images.indianexpress.com/2022/06/WhatsApp-Image-2022-06-26-at-10.05.07-AM.jpeg", "publishedAt": "2022-06-26T04:44:31Z", "content": "That was the only time when Jamie Overton looked nervy, after moving into the 90s in his debut Test. Eventually he fell for 97, got a bear hug from Jonny Bairstow and left to a standing ovation from … [+5092 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "The rise of the 0.5 selfie", "description": "The 0.5 selfies are showing up on Instagram, proliferating in group chats, becoming the talk of parties and often being snapped to chronicle the minutiae of daily life.", "url": "https://indianexpress.com/article/technology/tech-news-technology/the-rise-of-the-0-5-selfie-7991916/", "urlToImage": "https://images.indianexpress.com/2022/06/NYT_Selfie_1.jpg", "publishedAt": "2022-06-26T04:36:17Z", "content": "Julia Herzig, a 22-year-old from Larchmont, New York, has an obsession. Its with taking a new kind of selfie one that doesnt exactly conform.\r\nIn some of these selfies, Herzigs forehead bulges across… [+5376 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "BTS: V takes Paris by storm with his swag and plays basketball; J-Hope to drop new album Jack In The Box", "description": "BTS' Kim Taehyung, born V, has been sharing photos of his Paris trip. On the other hand, J-Hope recently announced his new album, Jack In The Box.", "url": "https://indianexpress.com/article/entertainment/music/bts-v-france-fashion-show-j-hope-new-album-7991833/", "urlToImage": "https://images.indianexpress.com/2022/06/BTSV1200.jpeg", "publishedAt": "2022-06-26T04:35:15Z", "content": "BTS on a break, what? The band might have collectively decided to take some time off, but the individual members are churning out something new for ARMY practically every second day. After Jungkook’s… [+1875 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Registration for admissions to DU’s NCWEB begins", "description": "While DU has adopted the Common University Entrance Test (CUET) for admissions to all its undergraduate programmes, admissions to the NCWEB and the School of Open Learning will continue to be conducted on the ‘merit’ of school-leaving examination marks.", "url": "https://indianexpress.com/article/delhi/registration-for-admissions-to-dus-ncweb-begins-7991909/", "urlToImage": "https://images.indianexpress.com/2022/06/DU-Delhi-university-3.jpg", "publishedAt": "2022-06-26T04:27:26Z", "content": "Registrations for admissions to Delhi Universitys Non-Collegiate Womens Education Board (NCWEB) for the upcoming academic session have begun."}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "CLAT 2022 counselling process: Registration begins, check schedule here", "description": "Candidates can apply on the Consortium of National Law Universities' official website, consortiumofnlus.ac.in. The deadline for counselling registration, according to the official announcement, is June 27, 2022.", "url": "https://indianexpress.com/article/education/clat-2022-counselling-process-registration-schedule-consortiumofnlus-ac-in-7991896/", "urlToImage": "https://images.indianexpress.com/2022/05/gettyimages-1143715629-612x612-2.jpg", "publishedAt": "2022-06-26T04:17:29Z", "content": "The registration procedure for CLAT Counseling 2022 has begun, according to the Consortium of National Law Universities (CNLU). The registration windown opened on June 25. The dates for the counselli… [+1667 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "WHO says monkeypox is not yet a health emergency", "description": "The \"global emergency\" label currently only applies to the coronavirus pandemic and ongoing efforts to eradicate polio, and the U.N. agency has stepped back from applying it to the monkeypox outbreak.", "url": "https://indianexpress.com/article/world/who-says-monkeypox-is-not-yet-a-health-emergency-7991898/", "urlToImage": "https://images.indianexpress.com/2022/06/monkey.jpg", "publishedAt": "2022-06-26T04:17:08Z", "content": "Monkeypox is not yet a global health emergency, the World Health Organization (WHO) ruled on Saturday, although WHO Director-General Tedros Adhanom Ghebreyesus said he was deeply concerned about the … [+2402 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "On Arjun Kapoor’s birthday, his 5 honest statements on Malaika Arora, Boney Kapoor and body positivity: ‘Hate creating fake perception we’re one happy family’", "description": "On Arjun Kapoor's birthday, here are some of the most candid statements he has made on people close to him, including his father Boney Kapoor and his partner Malaika Arora.", "url": "https://indianexpress.com/article/entertainment/bollywood/on-arjun-kapoors-birthday-his-5-honest-statements-on-malaika-arora-boney-kapoor-and-body-positivity-janhvi-kapoor-7980625/", "urlToImage": "https://images.indianexpress.com/2022/06/kapoor1200-1.jpg", "publishedAt": "2022-06-26T04:04:46Z", "content": "It can be argued that actor Arjun Kapoor makes as much of an impact with his interviews as he does in a good meaty role. On screen, he might take up any avatar depending upon the script, but off scre… [+6377 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Deaths rise to 23 from mass attempt to enter Spanish enclave", "description": "Spanish Prime Minister Pedro Sánchez on Saturday condemned what he described as a \"violent assault\" and an \"attack on the territorial integrity\" of Spain.", "url": "https://indianexpress.com/article/world/deaths-rise-to-23-from-mass-attempt-to-enter-spanish-enclave-7991878/", "urlToImage": "https://images.indianexpress.com/2022/06/1000-3.jpg", "publishedAt": "2022-06-26T04:03:29Z", "content": "The number of people who were killed after they tried to scale a border fence between Morocco and a Spanish enclave in North Africa rose to 23 Saturday as human rights organizations in Spain and Moro… [+4838 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Bloomberg", "title": "Crypto exchanges hunker down as everything goes wrong in India", "description": "With token prices plummeting, customers unable to transfer money to their accounts and a dreaded transaction tax on cryptocurrencies just around the corner, exchanges in India are bracing for a drawn-out crypto winter", "url": "https://indianexpress.com/article/technology/crypto/crypto-exchanges-hunker-down-as-everything-goes-wrong-in-india-7991890/", "urlToImage": "https://images.indianexpress.com/2022/06/Bitcoin-.jpeg", "publishedAt": "2022-06-26T04:02:23Z", "content": "Indias largest digital assets exchanges are bracing for a drawn-out crypto winter one with some unwelcome local twists.With token prices plummeting, customers unable to transfer money to their accoun… [+3917 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Debraj Deb", "title": "Tripura bypolls result: Counting of votes begins, CM Manik Saha’s fate hangs in balance among others", "description": "Officials said 78.58 per cent of votes were cast in these four Assembly seats in Tripura on June 23 as opposition political parties alleged violence on the day.", "url": "https://indianexpress.com/article/north-east-india/tripura/tripura-bypolls-results-live-updates-manik-saha-7991880/", "urlToImage": "https://images.indianexpress.com/2022/06/IMG_20220623_084359.jpg", "publishedAt": "2022-06-26T04:01:11Z", "content": "Counting of votes for seats in four assembly segments of Tripura began at 8 am Sunday at three locations in the state.As per the schedule of the Election Commission of India (ECI), votes cast for the… [+2078 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pratyush Raj", "title": "35 years after Kapil Dev, Bumrah to be the rare fast bowler to lead India Test side", "description": "Pace spearhead likely to be officially designated as captain for July 1 to 5 Edgbaston game after Rohit tests covid positive.", "url": "https://indianexpress.com/article/sports/cricket/35-years-after-kapil-dev-bumrah-to-be-the-rare-fast-bowler-to-lead-india-test-side-7991871/", "urlToImage": "https://images.indianexpress.com/2022/06/Bumrah.jpg", "publishedAt": "2022-06-26T03:54:57Z", "content": "Rarely has a fast bowler been picked to lead the side in Indian cricket. Kapil Dev was a glorious exception. No fast bowler has led India since Kapil Dev in March 1987. 35 years later Jasprit Bumrah … [+4616 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Kareena Kapoor and Saif Ali Khan turn Taimur into a ‘Rolling Stones baby’ as they head for concert in London, see photos", "description": "Kareena Kapoor took to Instagram and shared several photos with Taimur and Saif Ali Khan before a Rolling Stones concert.", "url": "https://indianexpress.com/article/entertainment/bollywood/kareena-kapoor-and-saif-ali-khan-turn-taimur-into-a-rolling-stones-baby-as-they-head-for-concert-in-london-7991835/", "urlToImage": "https://images.indianexpress.com/2022/06/kareena1200.jpeg", "publishedAt": "2022-06-26T03:52:22Z", "content": "Actors Kareena Kapoor and Saif Ali Khan decided to treat Taimur to a Rolling Stones concert. The couple is currently in London and Kareena took to Instagram and shared a photo with the family in matc… [+1575 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Prime Minister Narendra Modi arrives in Germany to attend G7 summit", "description": "The G7 leaders are expected to focus on the Ukraine crisis that has triggered geopolitical turmoil besides fuelling a global food and energy crisis.", "url": "https://indianexpress.com/article/india/prime-minister-narendra-modi-arrives-germany-g7-summit-7991869/", "urlToImage": "https://images.indianexpress.com/2022/06/Modi-g7.jpeg", "publishedAt": "2022-06-26T03:48:32Z", "content": "Prime Minister Modi is attending the G7 summit, to be held on June 26 and 27, following an invitation by German Chancellor Olaf Scholz. The summit is being hosted by Germany in its capacity as the ch… [+1639 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ADAM LIPTAK", "title": "June 24, 2022: The day Chief Justice Roberts lost his court", "description": "The chief justice is now in many ways a marginal figure. The five other conservatives are impatient and ambitious, and they do not need his vote to achieve their goals.", "url": "https://indianexpress.com/article/world/june-24-2022-the-day-chief-justice-roberts-roev-swade-overturn-us-abortion-law-7991851/", "urlToImage": "https://images.indianexpress.com/2022/06/SCOTUS-ABORTION-40.jpg", "publishedAt": "2022-06-26T03:46:50Z", "content": "In the most important case of his 17-year tenure, Chief Justice John Roberts found himself entirely alone.He had worked for seven months to persuade his colleagues to join him in merely chipping away… [+9045 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Senators seek update on US security review of TikTok", "description": "TikTok said it has completed migrating information on its US users to servers at Oracle Corp, as it seeks to address US concerns over data integrity.", "url": "https://indianexpress.com/article/technology/tech-news-technology/senators-seek-update-on-us-security-review-of-tiktok-7991866/", "urlToImage": "https://images.indianexpress.com/2022/06/TikTok_Reuters_2.jpg", "publishedAt": "2022-06-26T03:44:50Z", "content": "A group of six Republican senators on Friday asked US Treasury Secretary Janet Yellen about an ongoing Biden administration national security review of social media platform TikTok.The US government’… [+2086 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Namit Kumar", "title": "Andy Murray – ‘People know what to expect at Wimbledon, and with all the uncertainty in the world, they like that’", "description": "In the build-up to the Championships, the Scot speaks to Namit Kumar about how, with or without ranking points, the event remains special for players and fans alike. He also weighs in on his own preparations and fitness, and how his life outside tennis has ch…", "url": "https://indianexpress.com/article/sports/tennis/andy-murray-people-know-what-to-expect-at-wimbledon-and-with-all-the-uncertainty-in-the-world-they-like-that-7991853/", "urlToImage": "https://images.indianexpress.com/2022/06/Untitled-design-58.jpg", "publishedAt": "2022-06-26T03:40:36Z", "content": "After a controversial build-up, claims and counter-claims, Wimbledon is set to begin on Monday. The familiar sights of the perfectly-manicured lawns, players wearing pristine whites and spectators in… [+5996 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Sunday Zodiac: These signs are likely to be shopaholics", "description": "Astrologer Pandit Jagannath Guruji tells us about zodiacs who love to shop and just can’t control themselves", "url": "https://indianexpress.com/article/lifestyle/life-style/sunday-zodiac-these-are-the-zodiac-signs-which-are-likely-to-be-shopaholic-7987438/", "urlToImage": "https://images.indianexpress.com/2022/06/horoscope1200.jpg", "publishedAt": "2022-06-26T03:40:30Z", "content": "Some people are good at saving money and are borderline stingy, too. But, there are some others who are so crazy about shopping that they live like a pauper by the end of each month.Zodiac signs play… [+1501 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Varun Dhawan reveals he fought with Kiara Advani during JugJugg Jeeyo shoot: ‘She said I am chauvinistic’", "description": "In a recent interview, Varun Dhawan opened up about his equation with Kiara Advani and shared how the two fought during the shoot of JugJugg Jeeyo.", "url": "https://indianexpress.com/article/entertainment/bollywood/varun-dhawan-reveals-fought-with-kiara-advani-during-jugjugg-jeeyo-shoot-called-me-chauvinistic-7991847/", "urlToImage": "https://images.indianexpress.com/2022/06/jugjugg-jeeyo.jpg", "publishedAt": "2022-06-26T03:39:53Z", "content": "While fans have been loving the chemistry between Varun Dhawan and Kiara Advani in JugJugg Jeeyo, things weren’t all smooth between the two during the shoot. In a recent interview, Varun revealed tha… [+1502 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Saurabh Parashar", "title": "In 5 yrs, 18 CCTV cams at UT Police HQ had no glitches", "description": "At least eight CCTV cameras are installed in the office of Ranjan and nine in the office of Chahal. The reply to the RTI filed by The Indian Express revealed that no CCTV cameras have been installed in the office of Deputy Inspector General (DIG) (UT), Deepak…", "url": "https://indianexpress.com/article/cities/chandigarh/in-5-yrs-18-cctv-cams-at-ut-police-hq-had-no-glitches-7991850/", "urlToImage": "https://images.indianexpress.com/2022/06/CCTV-1.jpg", "publishedAt": "2022-06-26T03:35:29Z", "content": "CONTRARY TO the 157 CCTV cameras installed across police stations and posts which developed 13,699 faults in the last five years, the 18 cameras installed at the office of Director General of Police … [+2333 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Two involved in cyber fraud arrested in Chandigarh", "description": "The Angadia system is a parallel banking system where traders send cash from one state to another through a person called Angadia that stands for courier. It is used in the jewellery business with Mumbai – Surat being the most popular route.", "url": "https://indianexpress.com/article/cities/chandigarh/two-involved-in-cyber-fraud-arrested-in-chandigarh-7991845/", "urlToImage": "https://images.indianexpress.com/2022/06/arrest-21.jpg", "publishedAt": "2022-06-26T03:29:45Z", "content": "THE UT Police arrested two men, part of a large-scale cyber fraudsters network, in Chandigarh on Saturday. The two were identified as Chauhan Ratan and Parmar Rajeshji of Gujarat, who stayed in a ren… [+1871 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Arjun Kapoor celebrates birthday with Malaika Arora, shares romantic selfies from Paris vacation. See pics", "description": "Arjun Kapoor took to Instagram and shared several selfies with Malaika Arora from their Paris vacation.", "url": "https://indianexpress.com/article/entertainment/bollywood/arjun-kapoor-shares-romantic-selfies-with-malaika-arora-from-paris-vacation-7991814/", "urlToImage": "https://images.indianexpress.com/2022/06/arjunmalaika1200.jpg", "publishedAt": "2022-06-26T03:28:32Z", "content": "Actors Arjun Kapoor and Malaika Arora shared photos from their Paris vacation on Instagram. The couple is in the city to ring in Arjun Kapoor’s birthday (June 26). In the photos, Arjun and Malaika po… [+1446 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Novak Djokovic doubles down on anti-vaccination stance, says US ban is fuelling his motivation for Wimbledon", "description": "The Serb revealed in his pre-Wimbledon press conference that he has completely closed his mind to getting vaccinated against COVID-19, which could mean the Championships will be the last Major he plays until next year's French Open.", "url": "https://indianexpress.com/article/sports/tennis/novak-djokovic-doubles-down-on-anti-vaccination-stance-says-us-ban-is-fuelling-his-motivation-for-wimbledon-7991844/", "urlToImage": "https://images.indianexpress.com/2022/05/Novak-Djokovic.jpg", "publishedAt": "2022-06-26T03:28:28Z", "content": "Defending champion Novak Djokovic says he will be extra motivated to claim a fourth successive Wimbledon title as it could be his last Grand Slam action of the year.The 35-year-old Serb missed the Au… [+2924 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rahel Philipose", "title": "Explained: Abortion laws around the world", "description": "Very often limits are placed on when an abortion is permitted, generally around gestational time limits. We take a look at some of the abortion policies in countries across the globe.", "url": "https://indianexpress.com/article/explained/explained-abortion-laws-around-the-world-7991798/", "urlToImage": "https://images.indianexpress.com/2022/06/Abortion-4-1.jpg", "publishedAt": "2022-06-26T03:19:42Z", "content": "With the US Supreme Court overturning the landmark 1973 Roe v Wade decision that established a constitutional right to an abortion, the United States is now among the few dozen countries that have se… [+5724 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Saurabh Parashar", "title": "For years, Tricity caught in middle of gang wars", "description": "In August 2021, Vikramajeet Singh (aka Vicky Middukhera), a Youth Akali Dal leader and one close to Lawrence Bishnoi, was chased and shot dead in Mohali. The Mohali police investigation revealed that Shubhmanpreet Singh, manager of late Sidhu Moosewala, was b…", "url": "https://indianexpress.com/article/chandigarh/for-years-tricity-caught-in-middle-of-gang-wars-7991750/", "urlToImage": "https://images.indianexpress.com/2022/06/shot-dead.jpg", "publishedAt": "2022-06-26T03:11:28Z", "content": "Investigation of the murder of Punjabi singer Shubdeep Singh Sidhu Moosewala has revealed several links to the Tricity and gang wars between the Bishnoi and Bambiha groups. A number of people from or… [+2235 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anvita Singh", "title": "96 director on Vijay Sethupathi-Trisha’s cruel fate in the film: ‘I very badly want them to meet again but…’ | Scene Stealer", "description": "In today's installment of Scene Stealer, we revisit the heart-wrenching climax of Vijay Sethupathi-Trisha film 96. The romantic drama released in 2018 and was directed by Prem Kumar.", "url": "https://indianexpress.com/article/entertainment/tamil/96-film-vijay-sethupathi-trisha-climax-scene-stealer-video-7984481/", "urlToImage": "https://images.indianexpress.com/2022/06/961200.jpg", "publishedAt": "2022-06-26T03:02:46Z", "content": "Once all the vogue, out and out romantic movies are no longer to be found in western or Hindi cinema. Their disappearance from mainstream films has caused some heartbreak to cinephiles, who flocked t… [+2956 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sana Farzeen", "title": "Masoom actor Samara Tijori says father Deepak Tijori’s struggles taught her the importance of patience: ‘He said…’", "description": "Samara Tijori, who plays the lead in Masoom, talks about lessons she learned from her father Deepak Tijori and why being a star-kid is subjective.", "url": "https://indianexpress.com/article/entertainment/web-series/masoom-actor-samara-father-deepak-tijori-struggles-nepotism-star-kids-7988973/", "urlToImage": "https://images.indianexpress.com/2022/06/samara-deepak-tojori-masoom.jpg", "publishedAt": "2022-06-26T03:02:27Z", "content": "Deepak Tijori’s daughter Samara Tijori made her acting debut with Bob Biswas last year. While she had a small yet significant part, it’s Disney Plus Hotstar’s Masoom that has brought her into the lim… [+3050 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Bengaluru’s National Gallery of Modern Art: Tracing India’s artistic essence over the years", "description": "From paintings by Rabindranath Tagore, Raja Ravi Varma, Jamini Roy to post-independence art works, the Manikyavelu Mansion unveils artistry that has evolved over many years", "url": "https://indianexpress.com/article/cities/bangalore/national-gallery-of-modern-art-bengaluru-india-art-history-7991167/", "urlToImage": "https://images.indianexpress.com/2022/06/bangalore-kyc-1.jpeg", "publishedAt": "2022-06-26T03:00:47Z", "content": "This palatial mansion is a treat for your eyes as its walls are simply draped in rich history and treasures of art. The National Gallery of Modern Art (NGMA) on the premises of the Manikyavelu Mansio… [+4817 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aksheev Thakur", "title": "Lakes of Bengaluru: As Konanakunte lake dies a slow death, Bengaluru civic body gears up to restore it", "description": "More than two acres of the lake is encroached by a private distillery company, houses and a school. The document also states that a road and graveyard have also eaten away portions of the water body.", "url": "https://indianexpress.com/article/cities/bangalore/lakes-of-bengaluru-konanakunte-lake-slow-death-bengaluru-civic-body-restore-7991479/", "urlToImage": "https://images.indianexpress.com/2022/06/FotoJet-2022-06-25T212736.013-logo-1.jpg", "publishedAt": "2022-06-26T03:00:41Z", "content": "While moving towards Konanakunte Cross in Bengaluru city one would seldom notice the dying Konanakunte lake also known as Ganapathipura lake. Strangely, many residents with whom The Indian Express sp… [+3929 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Ghislaine Maxwell put on suicide watch, may seek sentencing delay, lawyer says", "description": "Prosecutors have said Ghislaine Maxwell should spend at least 30 years in prison, citing her \"utter lack of remorse.\" Maxwell wants a term shorter than 20 years.", "url": "https://indianexpress.com/article/world/ghislaine-maxwell-suicide-watch-sentencing-delay-7991802/", "urlToImage": "https://images.indianexpress.com/2022/06/reuters-ghislaine-maxwell.jpg", "publishedAt": "2022-06-26T02:48:46Z", "content": "In a letter to the judge overseeing Maxwell’s case, Maxwell’s lawyer, Bobbi Sternheim, said her client is “unable to properly prepare, for sentencing,” after officials at the Metropolitan Detention C… [+1618 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Mumbai vs Madhya Pradesh, Ranji Trophy Final Day 5 Live Score Updates: MP on cusp of history", "description": "Ranji Trophy Final, Day 5 Live Cricket Score Streaming Online Today Match, Star Sports 1, Hotstar Live: Madhya Pradesh vs Mumbai takes place in Bengaluru.", "url": "https://indianexpress.com/article/sports/cricket/ranji-trophy-final-day-5-madhya-pradesh-vs-mumbai-live-score-7991646/", "urlToImage": "https://images.indianexpress.com/2022/06/Ranji-Final-Day-5-Live.jpg", "publishedAt": "2022-06-26T02:39:26Z", "content": "Mumbai vs Madhya Pradesh, Ranji Trophy Final, Day 5 Live Cricket Score Streaming Online Today Match Updates:\r\nMP show how to get one hand on Ranji Trophy: Bat over 177 overs and bowl smartly wide out… [+989 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Delhi News Live: Rajinder Nagar polls results to be declared today", "description": "At the constituency, the contest was mainly between AAP and BJP. The Congress was largely missing, and their volunteers’ absence at many polling booths was conspicuous.", "url": "https://indianexpress.com/article/cities/delhi/delhi-news-live-rajinder-nagar-polls-results-7991787/", "urlToImage": "https://images.indianexpress.com/2022/06/raghav-chadha-1.jpg", "publishedAt": "2022-06-26T02:29:36Z", "content": "Voting trends through the day signalled that the voter turnout would be low. In the first four hours, for example, the voter turnout was only 14.85%. The voter turnout is low. We have tried out best … [+943 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "While You Were Asleep: Bale joins Los Angeles FC, Liverpool in race to sign Bellingham, McLaughlin smashes her own world record", "description": "Bale had won three La Liga titles, five Champions League trophies - winning one of each last season - plus three UEFA Super Cups, three FIFA Club World Cups, the Copa Del Rey and Spanish Super Cup during his time in Real Madrid.", "url": "https://indianexpress.com/article/sports/sport-others/while-you-were-asleep-gareth-bale-joins-los-angeles-fc-liverpool-in-race-to-sign-jude-bellingham-sydney-mclaughlin-breaks-own-world-record-7991785/", "urlToImage": "https://images.indianexpress.com/2022/06/While-You-Were-asleep-11.jpg", "publishedAt": "2022-06-26T02:27:39Z", "content": "Former Real Madrid forward and Wales captain Gareth Bale has joined MLS side Los Angeles FC on a free transfer. Bale confirmed the move on his social media pages, saying: “See you soon, Los Angeles”.… [+3736 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Administration initiates process for structural audit of 60 societies in Gurgaon, seeks consultants", "description": "The DC said that once the panel is finalised, the financial statement will be prepared by the district administration and the cost involved in conducting the structural audit will be borne by the developer concerned.", "url": "https://indianexpress.com/article/delhi/administration-initiates-process-for-structural-audit-of-60-societies-in-gurgaon-seeks-consultants-7991784/", "urlToImage": "https://images.indianexpress.com/2022/06/gurgaon.jpg", "publishedAt": "2022-06-26T02:21:59Z", "content": "The Gurgaon deputy commissioner (DC) Saturday said the district administration has initiated a process and sought expression of interest from private firms and agencies for a structural audit of more… [+1657 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Bypoll results 2022 Live Updates: Counting of votes in 3 Lok Sabha, 7 assembly seats today", "description": "Bypoll Results 2022 Live: The fate of newly appointed Tripura Chief Minister Manik Saha among others will be decided today.", "url": "https://indianexpress.com/article/india/bypoll-results-2022-live-uttar-pradesh-punjab-delhi-jharkhand-andhra-pradesh-tripura-7991343/", "urlToImage": "https://images.indianexpress.com/2022/06/UP-polls.jpg", "publishedAt": "2022-06-26T01:30:30Z", "content": "People queue up at a polling station to cast their votes for the Sangrur Lok Sabha bypolls, in Sangrur, Thursday. (PTI)\r\nWhile Sangrur in Punjab recorded 45.3 per cent voter turnout, the polling perc… [+1228 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Rainwater must be tapped optimally in urban & rural areas: Farm unions", "description": "The farmers' unions demanded to repeal the dam safety Act and also asked the state to pass a resolution in the assembly in this regard.", "url": "https://indianexpress.com/article/cities/chandigarh/rainwater-must-be-tapped-optimally-in-urban-rural-areas-farm-unions-7991762/", "urlToImage": "https://images.indianexpress.com/2022/06/pune-1-1.jpg", "publishedAt": "2022-06-26T01:16:05Z", "content": "A pilot project must be initiated to recharge the groundwater, and rainwater must be tapped optimally in both urban and rural areas, according to 22 farmers’ organisations of Punjab.They were speakin… [+1495 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Sunday Long Reads: Meherwan Irani’s Chai Pani restaurant, Kashmir’s transgender community, exotic food, Sahitya Akademi Lit Fest, and more", "description": "Here are much interesting reads of the week!", "url": "https://indianexpress.com/article/express-sunday-eye/sunday-long-reads-of-everyday-exotic-food-ranjit-lal-7990089/", "urlToImage": "https://images.indianexpress.com/2022/06/Fritters_1200_.jpg", "publishedAt": "2022-06-26T01:15:59Z", "content": "When chef Radhika Khandelwal stirs her pot of memories, she stops at the moment when she sat with her grandmother under the winter sun shelling peas. Wed snack on some and keep the pods away because … [+5127 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kamaldeep Singh Brar", "title": "Woman from MP going to Pak with legal visa stopped at Attari border", "description": "The woman was handed over to Rewa police after a “missing person” complaint was registered by her parents.", "url": "https://indianexpress.com/article/cities/chandigarh/woman-from-mp-going-to-pak-with-legal-visa-stopped-at-attari-border-7991755/", "urlToImage": "https://images.indianexpress.com/2020/01/mahatma-1200-1.jpg", "publishedAt": "2022-06-26T01:11:15Z", "content": "A 24-year-old woman from Madhya Pradesh on her way to Pakistan with a valid visa to marry her boyfriend was detained at the Attari border by the Punjab Police for handing her over to her parents in R… [+585 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Badri Narayan", "title": "Is literature possible without the presence of the State in our literary imagination?", "description": "Organised by the Sahitya Akademi, the recent Unmesha was a literature festival that showcased multiple voices and ideological viewpoints. An academic reflects on the State’s role in such a literary event", "url": "https://indianexpress.com/article/books-and-literature/is-literature-imagination-importance-presence-7990094/", "urlToImage": "https://images.indianexpress.com/2022/06/The_Ridge_Shimla-Wikimedia-Commons_200.jpg", "publishedAt": "2022-06-26T00:50:46Z", "content": "Literature is the domain of multiple voices, which we realised while participating in Unmesha, an international literary festival organised by Sahitya Akademi in Shimla between June 16 and 18, with t… [+2656 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shubhra Gupta", "title": "‘My life is resistance’: Pa Ranjith", "description": "Tamil filmmaker Pa Ranjith, who unveiled the poster of his upcoming movie at the 75th Cannes Film Festival, talks about spotlighting caste inequalities and creating his brand of cinema as counterculture", "url": "https://indianexpress.com/article/express-sunday-eye/my-life-is-resistance-pa-ranjith-films-7991481/", "urlToImage": "https://images.indianexpress.com/2022/06/pa-ranjith-1200.jpg", "publishedAt": "2022-06-26T00:40:50Z", "content": "Among the sizeable Indian contingent at the 75th Cannes Film Festival last month was Pa Ranjith, whom I met in a very Cannes setting: on the upper deck of a swish yacht, where the poster of his upcom… [+7661 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rinku Ghosh", "title": "Eat Root to Tip: How chefs make the everyday exotic", "description": "The idea of a zero-waste diet may be an answer to climate change but it has been de rigueur in Indian homes for generations", "url": "https://indianexpress.com/article/express-sunday-eye/eat-root-to-tip-chefs-make-the-everyday-exotic-7990078/", "urlToImage": "https://images.indianexpress.com/2022/06/Fritters_1200_.jpg", "publishedAt": "2022-06-26T00:40:49Z", "content": "When chef Radhika Khandelwal stirs her pot of memories, she stops at the moment when she sat with her grandmother under the winter sun shelling peas. Wed snack on some and keep the pods away because … [+11685 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Committed to eliminate gangster culture from Punjab, says Mann", "description": "He was addressing the House while winding up discussion on Governor’s address during the Budget session of Punjab Vidhan Sabha amid protests by Opposition Congress as the Congress members staged a walkout alleging that they were not given enough time to speak…", "url": "https://indianexpress.com/article/chandigarh/committed-to-eliminate-gangster-culture-from-punjab-says-mann-7991749/", "urlToImage": "https://images.indianexpress.com/2022/06/AAP-budge.jpg", "publishedAt": "2022-06-26T00:36:43Z", "content": "Stating that he was committed to eliminate gangster culture from the state, Punjab CM Bhagwant Mann on Saturday announced to introduce comprehensive law and order reforms in the state.He was addressi… [+4299 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Jayprakash Naidu", "title": "Replica of ship that helped liberate Bangladesh displayed at Regal Circle", "description": "A team of 10 to 12 artists from the Indian Navy led by Nageshkumar (48), a civilian technical staff in the Navy, had a challenge on their hands as the ship was scrapped and they had to rely on photographs in the public domain to make a model.", "url": "https://indianexpress.com/article/cities/mumbai/replica-of-indian-warship-used-partition-indian-navy-7991671/", "urlToImage": "https://images.indianexpress.com/2022/06/June25-BOM-ArtStreet-3col.jpg", "publishedAt": "2022-06-25T23:55:56Z", "content": "AS A tribute to Indias first aircraft carrier Indian Naval Ship (INS) Vikrant, which helped our country in the 1971 Indo-Pak war to liberate Bangladesh, the Indian Navy has installed a replica of the… [+3311 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Jayprakash Naidu", "title": "Replica of ship that helped liberate Bangladesh displayed at Regal Circle", "description": "A team of 10 to 12 artists from the Indian Navy led by Nageshkumar (48), a civilian technical staff in the Navy, had a challenge on their hands as the ship was scrapped and they had to rely on photographs in the public domain to make a model.", "url": "https://indianexpress.com/article/cities/mumbai/replica-of-ship-that-helped-liberate-bangladesh-displayed-at-regal-circle-7991671/", "urlToImage": "https://images.indianexpress.com/2022/06/June25-BOM-ArtStreet-3col.jpg", "publishedAt": "2022-06-25T23:55:56Z", "content": "AS A tribute to Indias first aircraft carrier Indian Naval Ship (INS) Vikrant, which helped our country in the 1971 Indo-Pak war to liberate Bangladesh, the Indian Navy has installed a replica of the… [+3311 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "L-G advises MCD to bring all properties under tax net", "description": "Expressing concern over the fact that properties, commercial establishments as well as people in as much as 65% of the geographical area of Delhi did not pay any property tax, Saxena said it was an unfortunate, unfair, and unviable situation.", "url": "https://indianexpress.com/article/cities/delhi/l-g-advises-mcd-to-bring-all-properties-under-tax-net-7991744/", "urlToImage": "https://images.indianexpress.com/2022/06/Vinai-Kumar-Saxena-2.jpg", "publishedAt": "2022-06-25T23:50:14Z", "content": "Delhi L-G Vinai Kumar Saxena has advised that all properties within the city limits commercial as well as residential be brought under the tax net so that the MCDs income increases and it is able to … [+1142 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Amid crisis, only 18% of treated waste water being reused in Delhi", "description": "Increasing the quantity of water that is reused would need a parallel network across the city to carry the treated water to areas where it can be used, like the agricultural land on the city’s outskirts, the official said. The cost for a system of that sort i…", "url": "https://indianexpress.com/article/cities/delhi/amid-crisis-only-18-of-treated-waste-water-being-reused-in-delhi-7991694/", "urlToImage": "https://images.indianexpress.com/2022/06/pune-1-1-3.jpg", "publishedAt": "2022-06-25T23:40:26Z", "content": "While the reuse of treated waste water can lower the pressure on freshwater sources in the city, only a small fraction of the waste water that Delhi currently generates is reused.According to Delhi J… [+2934 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shalini Langer", "title": "How about a blog of the mother as, first, a person", "description": "Shalini Langer writes: If that didn’t have me thinking of motherhood and all that it comes endowed with, almost always by other people, came the US Supreme Court judgment telling women they had virtually no right to decide whether they wanted to bear a child …", "url": "https://indianexpress.com/article/opinion/columns/how-about-a-blog-of-the-mother-as-first-a-person-7991586/", "urlToImage": "https://images.indianexpress.com/2022/06/Untitled-design-57.jpg", "publishedAt": "2022-06-25T23:12:32Z", "content": "Without us getting into how old I am, why is it that I feel 100 already? One reason of course is the mirror, a cruel, cruel friend. The second is what I have been telling myself, ever since Prime Min… [+3841 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Leher Kala", "title": "The digital avatar’s new clothes", "description": "Leher Kala writes: There is always a bewildering amount of technological advancement to catch up on. I suspect many people know the buzzwords but lack any genuine understanding like me.", "url": "https://indianexpress.com/article/opinion/columns/the-digital-avatars-new-clothes-7991592/", "urlToImage": "https://images.indianexpress.com/2022/06/Untitled-design-2022-06-18T135414.216-1.jpg", "publishedAt": "2022-06-25T23:00:55Z", "content": "On that first day of the year, when the world vows to undertake determined self-improvement, my humble resolutions for 2022 were to figure out what a podcast is, and to understand what metaverse, a t… [+3773 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tavleen Singh", "title": "A disgraceful saga", "description": "Tavleen Singh writes: Why are we no longer shocked by the amorality that has come to characterise our political culture? Why does the Election Commission not ask some questions?", "url": "https://indianexpress.com/article/opinion/columns/a-disgraceful-saga-shiv-sena-maharashtra-crisis-7991582/", "urlToImage": "https://images.indianexpress.com/2022/06/Eknath-Main.jpeg", "publishedAt": "2022-06-25T22:45:55Z", "content": "Almost more squalid than the squalid shenanigans in Maharashtra last week is the casual manner in which we have accepted this new normal. It no longer surprises us that our elected representatives be… [+4939 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Suraj Yengde", "title": "The caste and politics of Sena’s rise and its crisis", "description": "Suraj Yengde writes: The Shiv Sena has always been an issue-based, reactionary congregation. It adopts issues and works on them till these are used up and moves on to the next.", "url": "https://indianexpress.com/article/opinion/columns/the-caste-and-politics-of-senas-rise-and-its-crisis-7991604/", "urlToImage": "https://images.indianexpress.com/2022/06/uddhav-1-3-1.jpeg", "publishedAt": "2022-06-25T22:39:17Z", "content": "The political situation in Maharashtra is in a state of flux. One of the seniormost Shiv Sena leaders and Thane strongman, Eknath Shinde, has defied the party leadership, exposing the vulnerabilities… [+4078 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "P Chidambaram", "title": "Penny wise, security foolish", "description": "P Chidambaram writes: The burgeoning pension bill is indeed a problem, but there is no evidence that alternative models were examined. The argument that the Agnipath model has been tried and tested in Israel is puerile. Israel has a small population, practica…", "url": "https://indianexpress.com/article/opinion/columns/penny-wise-security-foolish-7991566/", "urlToImage": "https://images.indianexpress.com/2022/06/agnipath-protests-1-2-1.jpeg", "publishedAt": "2022-06-25T22:30:38Z", "content": "During World Wars I and II, an iconic poster came up all over the United States. It read: I Want You For U.S. Army. The figure with the top hat was fondly called Uncle Sam. The government of India co… [+5076 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shubhangi Khapre", "title": "The Sunday Profile | A Maharashtra rerun, and the Comeback Man: Devendra Fadnavis", "description": "As MVA govt totters, one man standing firmer than ever is BJP leader Devendra Fadnavis. SHUBHANGI KHAPRE on how theformer CM prepared the ground", "url": "https://indianexpress.com/article/cities/mumbai/sunday-profile-maharashtra-comeback-man-devendra-fadnavis-7991563/", "urlToImage": "https://images.indianexpress.com/2022/06/Devendra-Fadnavis-Sunday-profile-illustration.jpg", "publishedAt": "2022-06-25T22:30:21Z", "content": "AT 51, Devendra Fadnavis is younger than the number of years Sharad Pawar has spent in electoral politics. Last week, the BJP leader achieved the near impossible in Maharashtra by outsmarting the gra… [+7071 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shubhangi Khapre", "title": "The Sunday Profile | A Maharashtra rerun, and the Comeback Man: Devendra Fadnavis", "description": "As MVA govt totters, one man standing firmer than ever is BJP leader Devendra Fadnavis. SHUBHANGI KHAPRE on how theformer CM prepared the ground", "url": "https://indianexpress.com/article/political-pulse/sunday-profile-maharashtra-comeback-man-devendra-fadnavis-7991563/", "urlToImage": "https://images.indianexpress.com/2022/06/fadnavis.png", "publishedAt": "2022-06-25T22:30:21Z", "content": "AT 51, Devendra Fadnavis is younger than the number of years Sharad Pawar has spent in electoral politics. Last week, the BJP leader achieved the near impossible in Maharashtra by outsmarting the gra… [+7071 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Iram Siddique", "title": "‘First the country was Partitioned’…", "description": "Signs of April Ram Navami violence lie across Khargone, including the walls and barricades that now separate some of its Hindu, Muslim areas. What means ‘safety’ for some is an everyday price for the others.", "url": "https://indianexpress.com/article/cities/bhopal/first-the-country-was-partitioned-7991588/", "urlToImage": "https://images.indianexpress.com/2022/06/Khargone.jpg", "publishedAt": "2022-06-25T22:28:42Z", "content": "PEHLE desh ka batwara huwa, ab gali aur mohallon ka batwara ho raha hai. Isse hoga kuch nahin, bas nafrat aur badhegi (First the country was Partitioned, now lanes and localities are being divided. N… [+7401 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Jignasa Sinha", "title": "New headache for cops: Cyber criminals buying personal data in bulk", "description": "These are just some of the bulk messages received on thousands of phones every day, sent by fraudsters waiting for people to click on the phishing links and share personal information.", "url": "https://indianexpress.com/article/cities/delhi/new-headache-for-cops-cyber-criminals-buying-personal-data-in-bulk-7991690/", "urlToImage": "https://images.indianexpress.com/2022/06/cyber-women-1.jpg", "publishedAt": "2022-06-25T22:28:24Z", "content": "Dear customer, your account with xxxx has been suspended. Please complete your KYC (know your customer) with this link; Dear user, Please update your KYC for your account with this link/number; Dear … [+7133 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Vallabh Ozarkar", "title": "As Sena empowers Uddhav to act, 16 rebels get notices, Shinde says security cover gone", "description": "Six resolutions were passed including the decision not to allow anyone other than the Shiv Sena to use the name of Balasaheb Thackeray, and to take strict action against the rebel MLAs.", "url": "https://indianexpress.com/article/cities/mumbai/as-sena-empowers-uddhav-to-act-16-rebels-get-notices-shinde-says-security-cover-gone-7991685/", "urlToImage": "https://images.indianexpress.com/2022/06/uddhav-1-6.jpg", "publishedAt": "2022-06-25T22:18:57Z", "content": "Moving to regain control of the Shiv Sena after majority MLAs of the party rallied behind rebel minister Eknath Shinde, Maharashtra Chief Minister and Sena chief Uddhav Thackeray chaired a meeting Sa… [+3215 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Deeptiman Tiwary", "title": "ED seeks details from UP police on Prophet remark protesters, looks at Bihar coaching centres for Agnipath violence", "description": "The ED has sought documents and case papers from UP Police to examine if it can proceed against the accused under provisions of the PMLA. It is similarly examining the role of coaching centres in Bihar in fuelling protests against the Agnipath scheme.", "url": "https://indianexpress.com/article/india/ed-seeks-details-from-up-police-on-prophet-remark-protesters-looks-at-bihar-coaching-centres-for-agnipath-violence-7991659/", "urlToImage": "https://images.indianexpress.com/2022/06/tarins-agnipath-2col.jpg", "publishedAt": "2022-06-25T22:17:54Z", "content": "The Enforcement Directorate has now turned its gaze on people who participated in two recent protests against the Prophet remarks by now-suspended BJP spokesperson Nupur Sharma, and the announcement … [+1830 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sreenivas Janyala", "title": "Take 5 a cinema strike: 4 years since wages hiked… despite Covid, price rise, says V Anil Kumar President, Telugu Film Industry Employees Federation", "description": "Over 20,000 workers of the Telugu film industry called an indefinite strike last week, demanding a rise in wages. After the Telugu Film Chamber of Commerce agreed to set up a coordination committee, they returned to work.", "url": "https://indianexpress.com/article/cities/hyderabad/take-5-cinema-strike-4-yrs-since-wages-hiked-despite-covid-price-rise-7991581/", "urlToImage": "https://images.indianexpress.com/2022/06/commerce-film-nagar-hyderabad-film-production-houses-m6pvbbzd66.jpg", "publishedAt": "2022-06-25T22:13:15Z", "content": "Over 20,000 workers of the Telugu film industry called an indefinite strike last week, demanding a rise in wages. After the Telugu Film Chamber of Commerce agreed to set up a coordination committee, … [+1055 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anisha Dutta", "title": "Explained: For Shinde, road to claim Sena symbol may not be easy", "description": "While Shinde and the Sena rebels wade through legalities of the anti-defection law, another challenge remains: Of convincing the Election Commission who the real Shiv Sena is. Who will claim the party symbol? That’s the question as the crisis in the state dee…", "url": "https://indianexpress.com/article/explained/explained-for-shinde-road-to-claim-sena-symbol-may-not-be-easy-7991680/", "urlToImage": "https://images.indianexpress.com/2022/06/Eknath-Shinde-2-1.jpg", "publishedAt": "2022-06-25T22:12:40Z", "content": "Maharashtra minister Eknath Shinde, who has the support of the majority MLAs of Shiv Sena and is threatening to topple the ruling MVA coalition, may not find it easy to stake claim to the real Sena.W… [+3727 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "George Mathew", "title": "RBI eyes BNPL norms, to rope in fintechs amid concerns over cards by non-bank PPI issuers to extend short-term loans", "description": "The banking regulator is in discussion with fintech players to find a way out and bring the segment under a regulatory framework so that PPIs are used as a payment instrument and not as a credit avenue.", "url": "https://indianexpress.com/article/business/banking-and-finance/rbi-eyes-bnpl-norms-to-rope-in-fintechs-amid-concerns-over-cards-by-non-bank-ppi-issuers-to-extend-short-term-loans-7991632/", "urlToImage": "https://images.indianexpress.com/2022/06/RBi-1-2-1.jpg", "publishedAt": "2022-06-25T22:05:15Z", "content": "After slapping curbs on non-bank buy now pay later (BNPL) companies, the Reserve Bank of India (RBI) is likely to come out with guidelines for the BNPL segment which was using pre-paid instruments (P… [+4628 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sohini Ghosh", "title": "Fresh FIR based on quotes from SC order, annexures", "description": "The burning of Sabarmati Express in which 59 persons, mostly kar sevaks returning from Ayodhya, died took place on February 27, 2002.", "url": "https://indianexpress.com/article/cities/ahmedabad/fresh-fir-based-on-quotes-from-sc-order-annexures-7991714/", "urlToImage": "https://images.indianexpress.com/2022/06/teesta-sreekumar.jpeg", "publishedAt": "2022-06-25T22:02:07Z", "content": "The fresh FIR lodged against retired DGP RB Sreekumar, former IPS officer Sanjiv Bhatt and activist Teesta Setalvad is based on extensive quotes from the SC verdict and its annexures, and mentions th… [+3967 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Blood trail leads Goa police to murder accused", "description": "On Saturday morning, a man was found dead in the rear of a pick-up truck parked outside a hotel in Margao; he had suffered multiple, grievous stab wounds on abdomen and chest.", "url": "https://indianexpress.com/article/cities/goa/blood-trail-leads-goa-police-to-murder-accus-7991712/", "urlToImage": "https://images.indianexpress.com/2022/06/express-photo-13-19.jpeg", "publishedAt": "2022-06-25T21:59:34Z", "content": "A 300-metre trail of blood led Margao police to the man accused of killing a fellow labourer from Jharkhand.On Saturday morning, a man was found dead in the rear of a pick-up truck parked outside a h… [+1161 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Divya A", "title": "Meenakshi Lekhi assures all help for Mehrauli structure’s national monument tag", "description": "On Saturday, the National Monuments Authority (NMA), which operates under the Ministry of Culture, observed the martyrdom day of Banda Bahadur at Red Fort lawns at a function organised in collaboration with the Delhi Sikh Gurdwara Management Committee (DSGMC).", "url": "https://indianexpress.com/article/cities/delhi/lekhi-assures-all-help-for-mehrauli-structures-national-monument-tag-7991708/", "urlToImage": "https://images.indianexpress.com/2022/06/LEKHI.jpeg", "publishedAt": "2022-06-25T21:37:10Z", "content": "Nearly two months after Prime Minister Narendra Modi addressed the nation from the Red Fort to mark the 400th Parkash Purab of Sikh Guru Tegh Bahadur, the 17th century monument witnessed another gove… [+2109 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Man falls off 8th floor of hospital, dies: Police", "description": "According to police, he sustained grievous injuries in his brain and became unconscious. He was rushed to the intensive care unit of the hospital and was put on the ventilator support, but he succumbed to his injuries later, they said.", "url": "https://indianexpress.com/article/cities/kolkata/man-falls-off-8th-floor-of-hospital-dies-police-7991706/", "urlToImage": "https://images.indianexpress.com/2022/06/express-photo-13-18.jpeg", "publishedAt": "2022-06-25T21:32:50Z", "content": "A 33-year-old patient suffering from “severe neurological disorder and depression at a Kolkata hospital sat on the edge of a cornice on the eighth floor of the building for over two hours and alleged… [+2078 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "JU student gets Rs. 1.8-cr job at Facebook in UK", "description": "This is the highest pay package a student from JU received this year, sources said. Previously, nine JU students from various engineering departments had secured overseas jobs with pay packages exceeding Rs 1 crore, the sources added.", "url": "https://indianexpress.com/article/cities/kolkata/ju-student-gets-rs-1-8-cr-job-at-facebook-in-uk-7991701/", "urlToImage": "https://images.indianexpress.com/2022/06/jadavpur-university-fb.jpeg", "publishedAt": "2022-06-25T21:30:11Z", "content": "A STUDENT of Jadavpur University (JU) has bagged a job with an annual pay package of Rs 1.8 crore from Facebook. Bisakh Mondal, a fourth-year student of computer science and engineering at JU, has ac… [+1355 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Kolkata: State-run schools to resume physical classes from Monday", "description": "The government has directed the schools to sanitise their institutions and ensure all teachers and non-teaching staff are fully vaccinated. Use of masks has been made mandatory and everyone has been encouraged to use sanitisers.", "url": "https://indianexpress.com/article/cities/kolkata/kolkata-state-run-schools-to-resume-physical-classes-from-monday-7991699/", "urlToImage": "https://images.indianexpress.com/2022/06/Webp.net-resizeimage-19-11.37.58-AM.jpg", "publishedAt": "2022-06-25T21:27:20Z", "content": "After extended summer vacation, state-run schools to resume physical classes from Monday by adhering to the Covid-19 protocols."}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "West Bengal: Covid cases up, govt tells hospitals to follow protocol", "description": "The health department issued guidelines after medical students at Calcutta Medical College tested positive for Covid-19.", "url": "https://indianexpress.com/article/cities/kolkata/west-bengal-covid-cases-up-govt-tells-hospitals-to-follow-protocol-7991697/", "urlToImage": "https://images.indianexpress.com/2022/06/kolkata-3.jpg", "publishedAt": "2022-06-25T21:23:38Z", "content": "With the Covid-19 cases increasing fast, the state Health Department has alerted all medical colleges and hospitals asking them strictly follow Covid protocols in both indoor and outdoor patient depa… [+1509 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Adrija Roychowdhury", "title": "How DDA offered housing to Delhi’s aspiring middle-class, set example for rest of India", "description": "The DDA had been functioning for two decades by then. It was established in 1957 in the wake of the Partition by the central government to ensure the planned expansion and development of Delhi.", "url": "https://indianexpress.com/article/cities/delhi/how-dda-offered-housing-to-delhis-aspiring-middle-class-set-example-for-rest-of-india-7991692/", "urlToImage": "https://images.indianexpress.com/2022/06/dda.jpg", "publishedAt": "2022-06-25T21:17:50Z", "content": "In the mid-1970s when Reena Ramachandran (81) was working in the Ministry of Science and Technology in the government of India, she came across an advertisement brochure of the Delhi Development Auth… [+6352 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manraj Grewal Sharma", "title": "After Moosewala’s murder, spotlight back on (Punjabi) gangs of Canada", "description": "With Goldy Brar, a gangster who travelled to Canada on a student visa in 2017, claiming responsibility for the killing of Punjabi rapper Sidhu Moosewala last month, Indo-Canadian gangs are once again under the scanner.", "url": "https://indianexpress.com/article/cities/chandigarh/after-moosewalas-murder-spotlight-back-on-punjabi-gangs-of-canada-7991686/", "urlToImage": "https://images.indianexpress.com/2022/06/Sidhu-3.jpg", "publishedAt": "2022-06-25T20:31:45Z", "content": "The Ruffians. Thats the name of a gang in Abbotsford area of British Columbia, Canada, cobbled together by Punjabi-origin people. Kal Dosanjh, a veteran police officer with the Vancouver police, says… [+7077 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Speak to anti-govt NGOs, Goa CM tells industry", "description": "Speaking at the 114th AGM of Goa Chamber of Commerce and Industry, Pramod Sawant said the government spends a lot of time and money on litigation, which comes in the way of infrastructure projects.", "url": "https://indianexpress.com/article/cities/goa/speak-to-anti-govt-ngos-goa-cm-tells-industry-7991682/", "urlToImage": "https://images.indianexpress.com/2022/06/Goa-CM-Pramod-Sawant-1200.jpeg", "publishedAt": "2022-06-25T20:19:07Z", "content": "Goa Chief Minister Pramod Sawant on Saturday urged the states industrialists to sit across the table and talk to anti-government NGOs that, he said, are opposed to infrastructure projects.Speaking at… [+708 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "2 open fire outside house of arhtiya who got threat calls", "description": "Inspector Jaswinder Singh, SHO of Mynah police station, said that the complainant has claimed that at least four rounds were fired outside his home on Saturday morning.", "url": "https://indianexpress.com/article/cities/ludhiana/2-open-fire-outside-house-of-arhtiya-who-got-threat-calls-7991681/", "urlToImage": "https://images.indianexpress.com/2022/06/gun-shot.jpg", "publishedAt": "2022-06-25T20:17:39Z", "content": "Two unidentified men allegedly opened fire outside the house of a commission agent (arhtiya) at Dala village of Moga, Saturday. Police said the agent, Sukhvir Singh, had told them in a complaint that… [+1495 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lalmani Verma", "title": "Bypoll results 2022: Samajvadi Party hopes to retain its ‘strongholds’ as counting of votes to begin at 8 am today", "description": "The SP had won both the seats in 2019 and it is looking to retain both the seats with support of its traditional vote base of Muslims and Yadavs. Counting of votes will take place on June 26.", "url": "https://indianexpress.com/article/cities/lucknow/samajvadi-party-hopes-to-retain-its-strongholds-as-counting-of-votes-to-begin-at-8-am-today-7991675/", "urlToImage": "https://images.indianexpress.com/2022/06/Rampur-1.jpeg", "publishedAt": "2022-06-25T20:01:09Z", "content": "The bypolls in Rampur and Azamgarh Lok Sabha constituencies, where polling was held on Thursday, hold more importance for the Samajwadi Party (SP) than the BSP and the ruling BJP.The SP had won both … [+3782 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Textile weavers’ body warns of protest if fuel surcharge not slashed", "description": "Representatives of 35 industrial societies attended the meeting and decided to make representations.", "url": "https://indianexpress.com/article/cities/surat/textile-weavers-body-warns-of-protest-if-fuel-surcharge-not-slashed-7991673/", "urlToImage": "https://images.indianexpress.com/2022/06/weavers.jpg", "publishedAt": "2022-06-25T20:00:16Z", "content": "Ashok Jirawala, the president of Federation of Gujarat Weavers Association (FOGWA), who was recently inducted into the Bharatiya Janata Party (BJP), said the representative body has decided to carry … [+1135 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Contractor ‘who had 30 cases against him in Bihar’ shot dead in Lucknow", "description": "The contractor, Virendra Thakur, had at least 30 cases including murder and extortion registered against him in Bihar, police said, adding that he had previously been attacked in 2019 at Lucknow's Charbagh railway station over a business rivalry.", "url": "https://indianexpress.com/article/cities/lucknow/contractor-who-had-30-cases-against-him-in-bihar-shot-dead-in-lucknow-7991672/", "urlToImage": "https://images.indianexpress.com/2022/06/express-photo-13-17.jpeg", "publishedAt": "2022-06-25T19:54:56Z", "content": "A 42-year-old railway contractor was shot dead at his house in Lucknows cantonment area on Saturday by unidentified people. Police said the assailants locked the victim’s wife and three children in a… [+2124 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "First batch of 139 students enrolled in ‘Signal Schools’", "description": "‘Signal Schools’ is an AMC-funded project that aims to convert public buses into mobile schools for out-of-school-children at traffic signals across the city.", "url": "https://indianexpress.com/article/cities/ahmedabad/first-batch-of-139-students-enrolled-in-signal-schools-7991666/", "urlToImage": "https://images.indianexpress.com/2022/06/Gujarat-school.jpg", "publishedAt": "2022-06-25T19:51:57Z", "content": "The first batch of Signal Schools run by the Ahmedabad Municipal Corporation (AMC) saw 139 children enrol in the presence of Gujarat High Court Chief Justice Aravind Kumar and Chief Minister Bhupendr… [+2243 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Vallabh Ozarkar", "title": "Dirt of the party is gone, Aaditya on rebels", "description": "The rally is part of a series of such meetings to be organised by the Yuva Sena at every party division in Mumbai to keep the cadre intact in the backdrop of Eknath Shinde's rebellion and the upcoming civic polls.", "url": "https://indianexpress.com/article/cities/mumbai/mvacrisis-maharashtra-political-crisis-uddhav-thackeray-eknath-shinde-mumbai-dirt-of-the-party-is-gone-aaditya-thackeray-on-rebels-7991669/", "urlToImage": "https://images.indianexpress.com/2022/06/a-t.jpg", "publishedAt": "2022-06-25T19:43:27Z", "content": "Calling the rebel MLAs traitors, Yuva Sena president and Minister Aaditya Thackeray on Saturday described the Eknath Shinde faction as the dirt of Shiv Sena.The MLAs who have revolted, they were neve… [+1535 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Dirt of the party is gone, Aaditya on rebels", "description": "The rally is part of a series of such meetings to be organised by the Yuva Sena at every party division in Mumbai to keep the cadre intact in the backdrop of Shinde's rebellion and the upcoming civic polls.", "url": "https://indianexpress.com/article/cities/mumbai/dirt-of-the-party-is-gone-aaditya-on-rebels-7991669/", "urlToImage": "https://images.indianexpress.com/2022/06/a-t.jpg", "publishedAt": "2022-06-25T19:43:27Z", "content": "Calling the rebel MLAs traitors, Yuva Sena president and Minister Aaditya Thackeray on Saturday described the Eknath Shinde faction as the dirt of Shiv Sena.The MLAs who have revolted, they were neve… [+1535 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Protests against rebel MLAs across state", "description": "While incidents of violence took place in Pune, Navi Mumbai, Parbhani, Osmanabad, Satara, Thane, Nagpur city, Nanded, Palghar and Kolhapur, a senior state police officer said that except for the cases of violence in Pune and Thane, the rest were “minor” incid…", "url": "https://indianexpress.com/article/cities/mumbai/protests-against-rebel-mlas-across-state-7991665/", "urlToImage": "https://images.indianexpress.com/2022/06/image-1-2.jpg", "publishedAt": "2022-06-25T19:38:47Z", "content": "At least 10 incidents of violence by Shiv Sena workers against rebel MLAs have been reported across Maharashtra till 8 pm on Saturday. This comes amid the Mumbai Police extending its June 4 order of … [+2159 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "We will ensure jobs for all Agniveers: HP", "description": "The cabinet also gave its consent to fill 389 posts of panchayat secretaries in Himachal", "url": "https://indianexpress.com/article/cities/shimla/we-will-ensure-jobs-for-all-agniveers-hp-7991663/", "urlToImage": "https://images.indianexpress.com/2022/02/Jai-Ram-Thakur-1-2.jpg", "publishedAt": "2022-06-25T19:35:22Z", "content": "Amid protests against central government’s Agnipath scheme for armed forces, the Himachal Pradesh (HP) cabinet in its meeting here on Saturday decided that the state government would ensure jobs to t… [+3225 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Shiv Sena needs to be with BJP, do not feel safe to return: Rebels", "description": "The rebels, represented by Sena MLA from Sawantwadi, Deepak Kesarkar, reiterated the need for joining hands with the BJP.", "url": "https://indianexpress.com/article/cities/mumbai/shiv-sena-needs-to-be-with-bjp-do-not-feel-safe-to-return-rebels-7991661/", "urlToImage": "https://images.indianexpress.com/2022/06/Eknath-Main-1.jpeg", "publishedAt": "2022-06-25T19:31:25Z", "content": "The Ekanth Shinde-led Shiv Sena rebel camp, in its first press conference, claimed on Saturday that the legislators who are in Guwahati are not returning to Maharashtra in view of the violence unleas… [+3056 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Peter Vidal", "title": "Weekly Horoscope, June 26, 2022 – July 2, 2022: Scorpio, Aries, Pisces and other signs — check astrological prediction", "description": "Excerpt: Weekly Horoscope, June 26, 2022 – July 2, 2022: Capricorn, Take the lead at work, and propose overdue changes", "url": "https://indianexpress.com/article/horoscope/weekly-horoscope-june-26-2022-july-2-2022-scorpio-aries-pisces-and-other-signs-check-astrological-prediction-7972047/", "urlToImage": "https://images.indianexpress.com/2022/06/horoscope_200_pixabay.jpg", "publishedAt": "2022-06-25T19:30:10Z", "content": "Money matters must take first place. All you can do is try to see that you make all decisions in line with practical choices. Do yourself a favour and let others take the risks. Children, though, rel… [+3927 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Navjeevan Gopal", "title": "Punjab budget session Day 2: AAP, Opposition spar over illegal sand mining issue during Question Hour", "description": "Leader of opposition and Congress MLA from Qadian asked the ruling AAP legislators “not to make sweeping statements” on the issue.", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-budget-session-day-2-aap-opposition-spar-over-illegal-sand-mining-7991652/", "urlToImage": "https://images.indianexpress.com/2022/06/AAP-budge.jpg", "publishedAt": "2022-06-25T19:26:28Z", "content": "The ruling AAP and opposition MLAs were locked in a verbal duel over the issue of illegal sand and gravel mining on the second day of budget session in Punjab Vidhan Sabha during the question hour wi… [+4671 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Looking to attract cadre, rebel group softens stand on Uddhav, attacks NCP", "description": "While MLA Deepak Kesarkar, a part of the rebel group, alleged that NCP was out to finish Shiv Sena, the faction evoked the late Balasaheb Thackeray to gain greater foothold and acceptance within Sainiks by naming itself 'Shiv Sena Balasaheb'.", "url": "https://indianexpress.com/article/cities/mumbai/looking-to-attract-cadre-rebel-group-softens-stand-on-uddhav-attacks-ncp-7991657/", "urlToImage": "https://images.indianexpress.com/2022/06/image-2.jpg", "publishedAt": "2022-06-25T19:21:47Z", "content": "In a bid to not antagonise the party cadre and continuing with their claim that they are still a part of Shiv Sena, rebels led by Eknath Shinde on Saturday appeared to softened their stance against C… [+2886 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pune police begin crackdown on illegal banners, hoardings in city", "description": "The city police, along with the Pune Municipal Corporation authorities, have initiated legal action against these illegal hoardings and banners, it said.", "url": "https://indianexpress.com/article/cities/pune/pune-police-begin-crackdown-on-illegal-banners-hoardings-in-city-7991655/", "urlToImage": "https://images.indianexpress.com/2022/06/Untitled-design-2021-08-19T105531.039.jpg", "publishedAt": "2022-06-25T19:10:38Z", "content": "Pune city police have initiated action against illegal hoardings and banners in the city. A press release issued Saturday stated that as many as 1,400 illegal hoardings and banners were identified in… [+489 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pallavi Smart", "title": "Eight-member panel comes up to help implement NEP", "description": "Even as different state authorities working under the department have been tasked with implementing NEP 2020 recommendations, this eight-member committee is expected to ensure coordination between all to enhance the process.", "url": "https://indianexpress.com/article/cities/mumbai/eight-member-panel-comes-up-to-help-implement-nep-7991653/", "urlToImage": "https://images.indianexpress.com/2022/06/COLLEGE-1-1-1-1.jpeg", "publishedAt": "2022-06-25T19:05:06Z", "content": "The state school education department has set up a committee to ensure the effective implementation of the National Education Policy (NEP), 2020.Even as different state authorities working under the … [+1600 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rupsa Chakraborty", "title": "Only 1,728 Covid-19 cases logged on Saturday; data to be updated", "description": "Due to the incomplete compilation of Covid cases, Mumbai’s caseload also stood at 840, which was 1,898 on Friday.", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-covid-cases-maharashtra-coronavirus-deaths-active-cases-7991648/", "urlToImage": "https://images.indianexpress.com/2022/06/Covid-4-3.jpeg", "publishedAt": "2022-06-25T19:01:17Z", "content": "A day after reporting 4,205 cases, the state registered only 1,728 Covid-19 cases on Saturday, mainly due to a technical glitch on the portal of Indian Council of Medical Research (ICMR). The actual … [+1596 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Navjeevan Gopal", "title": "IAS officer son death: The discrepancies", "description": "There were several discrepancies in the version of officials, including between that of the police and Vigilance Bureau. Police personnel and Popli were accompanying the Vigilance team during the search.", "url": "https://indianexpress.com/article/cities/chandigarh/ias-officer-son-death-the-discrepancies-sanjay-kartik-popli-7991645/", "urlToImage": "https://images.indianexpress.com/2022/06/kartik-popli.jpg", "publishedAt": "2022-06-25T19:00:55Z", "content": "THE PUNJAB government found itself battling another controversy Saturday following the death of IAS officer Sanjay Popli’s son Kartik, even as a team had come to the officer’s home for a search, as p… [+2278 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sohini Ghosh, Sadaf Modak", "title": "Newsmaker | Among first to take up cause of Gujarat riot victims, Teesta is fighting many cases", "description": "Teesta was among the first activists to take up the cases of riot victims in Gujarat in 2002, finally leading the Supreme Court to set up a special investigation team to probe the post-Godhra riots, six years later, under former CBI director R K Raghavan.", "url": "https://indianexpress.com/article/political-pulse/newsmaker-among-first-to-take-up-cause-of-gujarat-riot-victims-teesta-is-fighting-many-cases-7991643/", "urlToImage": "https://images.indianexpress.com/2022/06/Teesta-1.jpg", "publishedAt": "2022-06-25T18:49:57Z", "content": "Teesta Setalvad, a journalist and activist based out of Mumbai and a Padma Shri, is a founding trustee and secretary of the NGO Citizens for Justice and Peace (CJP) established in 2002 in the afterma… [+3392 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aditi Raja", "title": "Shala Praveshotsav: District admin to request for grant to buy school bags for newly enrolled students", "description": "On Saturday, about 20 students enrolling in class I of the primary school in Chisadiya village, wearing welcome caps made of chart paper, received their books in a 'cloth bag' (polypropylene).", "url": "https://indianexpress.com/article/cities/ahmedabad/shala-praveshotsav-district-admin-grant-school-bags-enrolled-students-7991640/", "urlToImage": "https://images.indianexpress.com/2022/06/signal-school.jpg", "publishedAt": "2022-06-25T18:39:41Z", "content": "The Chhota Udepur district administration has decided to request the District Panchayat for a grant to provide school bags to the 11,000 students who were enrolled to Class I in Gujarat in during the… [+4484 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "New Zealand limps to 168-5 and 137-run lead against England", "description": "New Zealand was 168-5 for an overall lead of 137 runs when rain brought an early closure with 17.1 overs remaining in the day.", "url": "https://indianexpress.com/article/sports/cricket/new-zealand-limps-to-168-5-and-137-run-lead-against-england-7991642/", "urlToImage": "https://images.indianexpress.com/2022/06/NZ-ENG-2.jpg", "publishedAt": "2022-06-25T18:35:14Z", "content": "England strangled New Zealand’s top order through pace and spin in the second innings to stay in the ascendency three days into the third test at Headingley on Saturday.New Zealand was 168-5 for an o… [+4175 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "Ajker Rashifal Bengali, 26 June, 2022: চমৎকার কিছু ঘটবে এই রাশির জাতকদের! পড়ুন রাশিফল", "description": "আজকের রাশিফল, Horoscope Today, 26 June 2022: জেনে নিন কী আছে আজ ভাগ্যে", "url": "https://bengali.indianexpress.com/horoscope/ajker-rashifal-june-26-2022-aries-taurus-gemini-cancer-leo-virgo-libra-scorpio-sagittarius-capricorn-aquarius-pisces-461688/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/sunday.jpg", "publishedAt": "2022-06-25T18:35:00Z", "content": "/ Aries  Rashifal ( March 21 – April 20 )\r\n/ Taurus  Rashifal ( April 21 – May 21 )\r\n/ Gemini  Rashifal ( May 22 – June 21 )\r\n/ Cancer Rashifal  ( June 22 – July 23 )\r\n/ Leo   Rashifal  ( July 24 – A… [+319 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Hayley Matthews appointed as new West Indies women’s captain", "description": "Matthews has an impressive international record with 1,764 runs and 78 wickets in 69 ODIs and 1,055 runs and 58 wickets in 61 T20Is.", "url": "https://indianexpress.com/article/sports/cricket/hayley-matthews-appointed-as-new-west-indies-womens-captain-7991635/", "urlToImage": "https://images.indianexpress.com/2022/06/Matthews.jpg", "publishedAt": "2022-06-25T18:26:30Z", "content": "Cricket West Indies (CWI) announced on Saturday that allrounder Hayley Matthews has been appointed as the West Indies womens captain. Matthews will assume the leadership role from former skipper Staf… [+1069 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "G7 summit: Talks on key issues on Modi’s Germany itinerary", "description": "Prime Minister Narendra Modi is visiting Schloss Elmau in southern Germany on June 26 and 27 for the summit of the G7, a grouping of the world's seven richest nations.", "url": "https://indianexpress.com/article/india/g7-summit-talks-on-key-issues-on-modis-germany-itinerary-7991637/", "urlToImage": "https://images.indianexpress.com/2022/06/g20-file.jpg", "publishedAt": "2022-06-25T18:23:13Z", "content": "Ahead of his departure to Germany for the G7 summit, Prime Minister Narendra Modi on Saturday said he will exchange views with the leaders of the grouping and its partner countries on issues such as … [+1947 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "Explained: আমেরিকায় গর্ভপাতে নিষেধাজ্ঞা, যুগান্তকারী রায় সম্পর্কে জানেন কি?", "description": "রো ভার্সেস ওয়েড মামলার রায়ের ১৯ বছর পর ফের গর্ভপাত সংক্রান্ত এক মামলা আমেরিকার সুপ্রিম কোর্টে যায়।", "url": "https://bengali.indianexpress.com/explained/us-supreme-court-has-overturned-461789/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/american-protest.jpg", "publishedAt": "2022-06-25T18:16:12Z", "content": ", . \r\n , , , , , \r\n ?, , , , , , , , \r\n - , , - , , - , - \r\n , , , ’ , - ( ) , - , , ( )\r\n - , \r\n ( ) , , - , \r\n - , , - , -, , , \r\nRead full story in English"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sandip G", "title": "India vs Leicestershire: Kohli gets into groove with a watchful fifty", "description": "Jasprit Bumrah tested his former captain Kohli's patience rather than stroke-play during the tour game", "url": "https://indianexpress.com/article/sports/cricket/india-vs-leicestershire-kohli-gets-into-groove-with-a-watchful-fifty-7991615/", "urlToImage": "https://images.indianexpress.com/2022/06/VK.jpg", "publishedAt": "2022-06-25T18:02:15Z", "content": "Virat Kohli and Jasprit Bumrah averted each others gaze. Kohli turned towards the square-leg umpire and practised a forward defensive; Bumrah strode back to the top of his run-up. As if nothing had h… [+5466 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Leena Misra", "title": "Newsmaker | RB Sreekumar, a decorated cop and thorn in PM Modi’s side", "description": "Sreekumar, who became Gujarat DGP after retirement, wrote affidavits to the Nanavati Commission alleging govt agencies’ complicity in the 2002 riots. On Friday, the Supreme Court called into question his role in the accusations.", "url": "https://indianexpress.com/article/political-pulse/newsmaker-rb-sreekumar-a-decorated-cop-and-thorn-in-pm-modis-side-7991606/", "urlToImage": "https://images.indianexpress.com/2022/06/sreekumarr-logo.jpg", "publishedAt": "2022-06-25T17:54:20Z", "content": "A decorated police officer, R B Sreekumar challenged the Narendra Modi governments claims of peace in Gujarat in the aftermath of the 2002 riots, spoke of the alleged collusion between government age… [+6387 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Wimbledon champ Kvitova, Fritz win Eastbourne titles", "description": "Kvitova earned her first grass-court title in four years — and 29th trophy of her singles career — after breaking Ostapenko, the defending champion, early in both sets of the final and feasting on the Latvian's second serve.", "url": "https://indianexpress.com/article/sports/tennis/wimbledon-champ-kvitova-fritz-win-eastbourne-titles-7991570/", "urlToImage": "https://images.indianexpress.com/2022/06/Petra.jpg", "publishedAt": "2022-06-25T17:09:04Z", "content": "Two-time Wimbledon champion Petra Kvitova tuned up for the Grand Slam tournament by overpowering Jelena Ostapenko 6-3, 6-2 to win the Eastbourne title on Saturday.Also, Taylor Fritz outlasted Maxime … [+2428 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Around 2,000 people arrested for violence over Agnipath, Prophet remark: UP Police", "description": "\"As many as 1,562 persons have been arrested in the state in connection with the 'Agnipath' violence. Of these, 535 arrests were made in Jaunpur, 222 in Ballia, and 210 in Chandauli,\" Additional Director General of Police (Law and Order) Prashant Kumar said.", "url": "https://indianexpress.com/article/cities/lucknow/around-2000-people-arrested-agnipath-prophet-remark-up-police-7991559/", "urlToImage": "https://images.indianexpress.com/2022/06/Agnipath-1-1.jpg", "publishedAt": "2022-06-25T17:03:19Z", "content": "The Uttar Pradesh Police has so far arrested 1,562 people in connection with the violence over the Agnipath military recruitment scheme, a senior officer said on Saturday.Another 424 people have been… [+1001 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Teesta’s arrest: Cautious Congress hopes for due process, Left calls for her release", "description": "Abhishek Manu Singhvi says that as a political party, the Cong can’t comment on a case with which it has no connection, but warns the BJP against ‘reading unconnected clean chits into the Supreme Court verdict’ that was followed by the arrests.", "url": "https://indianexpress.com/article/india/teesta-setalvad-arrest-cautious-congress-hopes-for-due-process-left-calls-for-release-7991516/", "urlToImage": "https://images.indianexpress.com/2022/06/Teesta.jpg", "publishedAt": "2022-06-25T17:00:07Z", "content": "The Left parties, on the other hand, questioned their arrests, which came a day after the Supreme Court upheld the clean chit by the SIT to then chief minister Narendra Modi in the 2002 Gujarat riots… [+3021 chars]"}]}