{"status": "ok", "totalResults": 456, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Sedition law must not be stuck down, guidelines against misuse be laid down, AG tells SC; next hearing on May 10", "description": "The top court will be hearing arguments on whether the plea challenging the constitutional validity of Section 124 A of the Indian Penal Code that deals with sedition should be heard by a larger bench.", "url": "https://indianexpress.com/article/india/supreme-court-constitutional-validity-sedition-law-may-10-7902431/", "urlToImage": "https://images.indianexpress.com/2022/04/supreme-court-3.jpg", "publishedAt": "2022-05-05T06:46:40Z", "content": "Attorney General of India KK Venugopal on Thursday told the Supreme Court that sedition law should not be stuck down, but only guidelines for misuse be laid down. “What is permissible, what is imperm… [+1430 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "New subvariant of Covid-19 spreading rapidly in the United States", "description": "Experts say a new form, BA.2.12.1, is spreading rapidly and will likely in the next weeks become the dominant form of the virus in the United States. There’s no indication yet that causes more severe disease.", "url": "https://indianexpress.com/article/world/new-subvariant-of-covid-19-spreading-rapidly-in-the-united-states-7902305/", "urlToImage": "https://images.indianexpress.com/2022/01/VIRUS-VACATION-RETURN-6-3.jpg", "publishedAt": "2022-05-05T06:40:58Z", "content": "First came omicron, then came its highly contagious subvariant, BA.2. That subvariant gave rise to its own subvariants, whose share of new coronavirus cases in the United States is growing.\r\nThe coro… [+4027 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Will Henry Cavill return as Superman in DCEU? Here is why he should", "description": "There has been no confirmation or denial from Warner Bros regarding the fate of Cavill’s Superman. Henry Cavill appeared in the role for the first time in 2013’s Man of Steel and reprised the role in Batman v Superman in 2016. Will he be back? Well, he should.", "url": "https://indianexpress.com/article/entertainment/hollywood/henry-cavill-return-as-superman-in-dceu-why-he-should-7901827/", "urlToImage": "https://images.indianexpress.com/2022/05/henry-cavill-superman-1200.jpg", "publishedAt": "2022-05-05T06:36:35Z", "content": "Henry Cavill turns 39 today. The British actor is best known for playing the role of DC superhero Superman. He is also known for essaying the titular role in Netflix’s popular fantasy TV series The W… [+3605 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Abhishek Angad", "title": "Newsmaker | Saryu Roy, the Independent Jharkhand MLA and politician-activist who loves a good fight", "description": "Saryu Roy recently alleged that the Jharkhand Health Minister Banna Gupta had disbursed Covid incentives equivalent to a month’s basic salary to 60 employees, including himself.", "url": "https://indianexpress.com/article/india/political-pulse/saryu-roy-independent-jharkhand-mla-corruption-documents-7902381/", "urlToImage": "https://images.indianexpress.com/2022/05/saryu-roy-twitter.jpg", "publishedAt": "2022-05-05T06:36:02Z", "content": "Jharkhand Independent MLA Saryu Roy, 70, takes his crusader role seriously. The ‘giantkiller’, whose allegations are said to have brought down two chief ministers, was in the spotlight recently when … [+2745 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "IPL 2022 DC vs SRH playing XI, match prediction, pitch report: Delhi face a must-win situation vs Hyderabad", "description": "IPL 2022 DC vs SRH Playing 11 Prediction: Delhi Capitals vs Sunrisers Hyderabad Playing XI Updates for Today's IPL Match", "url": "https://indianexpress.com/article/sports/ipl/ipl-2022-dc-vs-srh-playing-xi-match-prediction-pitch-report-7902334/", "urlToImage": "https://images.indianexpress.com/2022/04/Delhi-Capitals.jpg", "publishedAt": "2022-05-05T06:33:39Z", "content": "Delhi Capitals vs Sunrisers Hyderabad (DC vs SRH) Players List: Rishabh Pant’s Delhi Capitals are locking horns with Kane Williamson’s Sunrisers Hyderabad at the Brabourne Stadium on Thursday. DC fac… [+3174 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "TN court orders FIR against Suriya, Jyothika, Jai Bhim director TJ Gnanavel", "description": "A court in Chennai has ordered the police to file an FIR against Suriya, Jyothika and Jai Bhim's director TJ Gnanavel.", "url": "https://indianexpress.com/article/entertainment/tamil/tn-court-orders-fir-against-suriya-jyothika-jai-bhim-director-gnanavel-7902335/", "urlToImage": "https://images.indianexpress.com/2021/10/suriya-jai-bhim.jpg", "publishedAt": "2022-05-05T06:33:08Z", "content": "A Chennai court has directed the police to file an FIR against Suriya, his wife Jyothika and director Gnanavel for allegedly misrepresenting the Vanniyar community in their film Jai Bhim (2021). Rudr… [+2028 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "US and Ukrainian drone enthusiasts turn hobby into weapon of war", "description": "Two American businesspeople, who had arrived from the United States with a donation of a dozen similar drones, watched.", "url": "https://indianexpress.com/article/world/us-and-ukrainian-drone-enthusiasts-turn-hobby-into-weapon-of-war-7902395/", "urlToImage": "https://images.indianexpress.com/2022/05/UKRAINE-23.jpg", "publishedAt": "2022-05-05T06:30:21Z", "content": "In a workshop in western Ukraine, a group of hobby drone pilots gathered around a table recently as a technician fitted a racing drone to carry a grenade, turning an aircraft found in hobby stores in… [+4019 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "The Conversation", "title": "Fiji is officially ‘open for happiness’ — will that apply to its tourism workers too?", "description": "Fiji, in particular, has wasted no time mounting a major campaign targeting New Zealand and Australian tourists. Fronted by celebrity Rebel Wilson, the ads promise the island nation is \"open for happiness\".", "url": "https://indianexpress.com/article/lifestyle/life-style/fiji-is-officially-open-for-happiness-will-that-apply-to-its-tourism-workers-too7893905/", "urlToImage": "https://images.indianexpress.com/2022/05/fiji-pixabay.jpg", "publishedAt": "2022-05-05T06:30:18Z", "content": "As daylight hours shorten and temperatures drop, and with borders reopening across the Pacific, many will be tempted to escape pandemic fatigue by flying somewhere warm and welcoming.Fiji, in particu… [+4891 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "PM Modi to chair meeting on heatwave, monsoon season today", "description": "Prime Minister Narendra Modi is set to chair a meeting to review the preparedness to deal with the rise in temperatures as well as the upcoming monsoon season", "url": "https://indianexpress.com/article/india/pm-modi-chair-meeting-heatwave-monsoon-season-7902394/", "urlToImage": "https://images.indianexpress.com/2022/04/modi-7-1-1.jpg", "publishedAt": "2022-05-05T06:29:02Z", "content": "PM Narendra Modi (File)As several states across the country grapple with intense heatwaves, Prime Minister Narendra Modi is set to chair a meeting to review the preparedness to deal with the rise in … [+234 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Japan says it needs nuclear power, can host towns ever trust it again?", "description": "After the disaster 11 years ago at a nuclear power station in Fukushima, where an earthquake and tsunami led to a triple meltdown, Japan took most of its nuclear plants offline.", "url": "https://indianexpress.com/article/world/japan-says-it-needs-nuclear-power-can-host-towns-ever-trust-it-again-7902333/", "urlToImage": "https://images.indianexpress.com/2022/05/JAPAN-NUCLEAR.jpg", "publishedAt": "2022-05-05T06:24:04Z", "content": "Growing up, Mika Kasahara saw the nuclear power plant that hugs the coast of her hometown simply as the place where her father worked, a familiar fortress of cooling tanks and steel lightning towers … [+8102 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Nearly 3 dozen bureaucrats reshuffled in Jammu and Kashmir", "description": "Atal Dulloo, Financial Commissioner (Additional Chief Secretary), Finance Department, has been transferred and posted as Financial Commissioner (Additional Chief Secretary), Agriculture Production Department.", "url": "https://indianexpress.com/article/cities/jammu/nearly-3-dozen-bureaucrats-reshuffled-in-jammu-and-kashmir-7902373/", "urlToImage": "https://images.indianexpress.com/2022/05/jammu-kashmir.jpg", "publishedAt": "2022-05-05T06:20:25Z", "content": "Two additional chief secretaries, three principal secretaries were among nearly three dozen senior All India Service and J&amp;K Administrative Service officers who were transferred in Jammu and Kash… [+7283 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "I have threat to my life, going to meet PM Modi, says Madurai mutt chief amid row over ritual ban", "description": "The issue reached the state assembly Wednesday where Leader of Opposition Edappadi K Palaniswami moved a special calling attention motion and said that the government should withdraw the ban on the ritual.", "url": "https://indianexpress.com/article/cities/chennai/i-have-threat-to-my-life-going-to-meet-pm-modi-says-madurai-mutt-chief-amid-row-over-ritual-ban-7902367/", "urlToImage": "https://images.indianexpress.com/2022/05/CHENNAI-3.jpg", "publishedAt": "2022-05-05T06:17:37Z", "content": "Amid the controversy surrounding the ban on the Pattina Pravesam ritual at the Dharmapuram mutt in Tamil Nadu, the chief of another mutt Madurai adheenam has alleged that there is a threat to his lif… [+2240 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "The Vanishing variants: Lessons from Gamma, Iota and Mu", "description": "Because gamma never came to dominate worldwide, studying its spread provided a “cleaner” picture of the effectiveness of travel bans, said Tetyana Vasylyeva, a molecular epidemiologist at the University of California, San Diego and an author of the study.", "url": "https://indianexpress.com/article/world/the-vanishing-covid-variants-lessons-from-gamma-iota-and-mu-coronavirus-cases-7902343/", "urlToImage": "https://images.indianexpress.com/2022/05/VIRUS-EXPOSURE-2.jpg", "publishedAt": "2022-05-05T06:10:43Z", "content": "In early 2021, scientists in Colombia discovered a worrisome new coronavirus variant. This variant, eventually known as mu, had several troubling mutations that experts believed could help it evade t… [+9410 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Cyclonic circulation over South Andaman Sea could develop into low pressure area: IMD", "description": "IMD Director General Mrutyunjay Mohapatra Wednesday said, “As of today, we have not made any forecast regarding landfall of the system and probable area to be affected.”", "url": "https://indianexpress.com/article/india/odisha-cyclone-asani-south-andaman-sea-7902301/", "urlToImage": "https://images.indianexpress.com/2022/03/cyclone-storm.jpg", "publishedAt": "2022-05-05T06:07:46Z", "content": "The cyclonic circulation over South Andaman Sea and its neighbouring area could develop into a low pressure area by May 6, the India Meteorological Department (IMD) said Wednesday. The weather system… [+1528 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Rising violence by separatists adds to Pakistan’s lethal instability", "description": "Baluch separatism is just one of the forces threatening the nation’s already tenuous unity and stability, including violent insurgencies by the Islamic State group affiliate known as ISIS-K and the resurgent Pakistani Taliban.", "url": "https://indianexpress.com/article/world/rising-violence-separatists-pakistan-lethal-instability-7902321/", "urlToImage": "https://images.indianexpress.com/2022/05/pakistan-police.jpeg", "publishedAt": "2022-05-05T06:02:21Z", "content": "Shari Baluch was a 30-year-old mother of two children and a schoolteacher. Late last month, on a university campus in Karachi, Pakistans biggest city, she detonated a suicide bomb, killing herself an… [+7229 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Children’s health: Dos and don’ts to protect kids from heatwave", "description": "On Twitter, the National Disaster Management Authority (NDMA) shared some safety points for kids, mostly infants; read on.", "url": "https://indianexpress.com/article/lifestyle/health/children-health-ndma-dos-donts-protect-kids-from-heatwave-7900934/", "urlToImage": "https://images.indianexpress.com/2022/05/GettyImages-heatwave-kids-1200.jpg", "publishedAt": "2022-05-05T06:00:54Z", "content": "The topic of heatwave is currently being discussed, owing to the rise in temperature in parts of the country. It should be noted that heat waves can bring with it a host of health problems, like dehy… [+1222 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Prashant Kishor announces ‘padyatra’ in Bihar amid speculations of new party", "description": "Prashant Kishor said that if a new political party is formed in Bihar, it won't be under his name but he will collaborate with those who form it.", "url": "https://indianexpress.com/article/india/prashant-kishor-padyatra-bihar-political-party-7902317/", "urlToImage": "https://images.indianexpress.com/2022/05/Prashant-Kishor-2.jpg", "publishedAt": "2022-05-05T05:58:20Z", "content": "Political strategist Prashant Kishor announced a 3,000 km “padyatra” in Bihar, stating that he won’t be forming a political party as of now.He said that in line with his previous announcement about w… [+930 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Anek trailer: Ayushmann Khurrana jumps into Hindi language debate in Anubhav Sinha’s film", "description": "Anek trailer: Ayushmann Khurrana makes his action debut in his second collaboration with director Anubhav Sinha, after Article 15. The film, after the critically acclaimed Article 15, asks the question 'what makes one Indian'.", "url": "https://indianexpress.com/article/entertainment/bollywood/anek-trailer-ayushmann-khurrana-anubhav-sinha-north-east-india-7902224/", "urlToImage": "https://images.indianexpress.com/2022/05/anek-trailer-ayushmann-khurrana.jpg", "publishedAt": "2022-05-05T05:53:26Z", "content": "The first trailer for Ayushmann Khurrana’s upcoming film Anek has been released. The film will be released in theatres on May 27, after it was pushed by a week to avoid a clash with the Ranveer Singh… [+2016 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Zelenskyy calls for ceasefire to allow evacuation in Mariupol; EU proposes Russian oil ban: Top developments", "description": "Russia has vowed to pause military activity at the Azovstal plant in Mariupol during Thursday daytime and the following two days to allow civilians to get out.", "url": "https://indianexpress.com/article/world/russia-ukraine-war-top-developments-mariupol-oil-ban-7902203/", "urlToImage": "https://images.indianexpress.com/2022/05/fa308e81b3fc4560942fa7c0ee1ac33e-fa308e81b3fc4560942fa7c0ee1ac33e-60a85673bbb744da9f29bb1957f46639.jpg", "publishedAt": "2022-05-05T05:51:40Z", "content": "With Russia concentrating its war efforts in eastern Ukraine, fighting escalated at Mariupol’s steel plant. Ukrainian President Volodymyr Zelenskyy has called for a prolonged ceasefire in the city to… [+2765 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "‘Loyalty guaranteed’: Woman proposes RCB fan in the stands, netizens cheer with jokes", "description": "As cameras panned to show the moment on big screens and to the audience watching at home, many couldn't stop sharing their amusement.", "url": "https://indianexpress.com/article/trending/trending-in-india/loyalty-guaranteed-woman-proposes-rcb-fan-in-the-stands-7902235/", "urlToImage": "https://images.indianexpress.com/2022/05/rcb-fan-proposal.jpg", "publishedAt": "2022-05-05T05:47:21Z", "content": "Days after a fan went viral for waving a banner saying she will not get married until Royal Challengers Bangalore (RCB) win an IPL trophy, another woman proposed marriage to her boyfriend in the stan… [+3250 chars]"}]}