{"status": "ok", "totalResults": 395, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "India stands in solidarity with Afghan people: MEA on quake in Afghanistan", "description": "India has already dispatched 27 tons of relief material in two flights for the people of Afghanistan as a \"true first responder\" to address their difficulties, the Ministry of External Affairs said.", "url": "https://indianexpress.com/article/india/afghan-quake-india-sends-relief-material-7988479/", "urlToImage": "https://images.indianexpress.com/2022/06/afghan-earthquake-1200-1.jpg", "publishedAt": "2022-06-24T08:49:33Z", "content": "A day after sending relief material to earthquake-hit Afghanistan, India on Friday said it stands in solidarity with the Afghan people and remains firmly committed to providing them with required rel… [+2053 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Pune Campus Watch: CBSE, ICSE students complain of unfair treatment as Pune colleges go ahead with admissions without them", "description": "A large section of students belonging to boards other than Maharashtra state board is unable to participate in the admissions process. The deadline has either passed or will soon get over at several colleges, even as CBSE and ICSE boards are yet to declare th…", "url": "https://indianexpress.com/article/cities/pune/pune-campus-watch-cbse-icse-students-complain-unfair-treatment-pune-colleges-admissions-7988418/", "urlToImage": "https://images.indianexpress.com/2022/06/fergusson-college-759-1.jpg", "publishedAt": "2022-06-24T08:46:25Z", "content": "Nearly 10 days have passed since the online admission process for undergraduate admissions started at Fergusson College in Pune where Class XII student Sai Matekar hopes to take admission to a BA Eng… [+3725 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "The tiny mites living on your face may soon reach their dead-end; will it impact skin health?", "description": "These face mites, which live in the hair follicles on the face and eat dead skin, are not visible to the naked eye", "url": "https://indianexpress.com/article/lifestyle/life-style/study-face-mites-good-skin-eroding-dna-genome-humans-7986518/", "urlToImage": "https://images.indianexpress.com/2022/06/face-mite_1200_skincare.jpg", "publishedAt": "2022-06-24T08:40:43Z", "content": "Just like the gut and the body, there are microscopic organisms living on your face, too. Called mites or demodex folicular, these have thrived on humanfaces forever. In fact, they share a symbiotic … [+2079 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "World Bank approves USD 562 million funding for 3 projects in India", "description": "The project will help microenterprises access working capital by connecting them with government schemes that provide financial support to farmers such as the Kisan Credit Card and the Micro Units Development and Refinance Agency Limited (MUDRA).", "url": "https://indianexpress.com/article/world/world-bank-approves-usd-562-million-funding-3-projects-india-7988189/", "urlToImage": "https://images.indianexpress.com/2022/06/world-bank-1.jpg", "publishedAt": "2022-06-24T08:39:14Z", "content": "World Bank has approved three loans totalling USD 562 million (about Rs 4,393.70 crore) to fund an education project in Gujarat, a social protection programme in Tamil Nadu and a project to help reco… [+2691 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "UK PM Johnson’s party loses previously safe parliamentary seat", "description": "The centrist Liberal Democrats party candidate, Richard Foord, won the Tiverton and Honiton seat by a majority of nearly 6,144 votes.", "url": "https://indianexpress.com/article/world/uk-pm-johnsons-party-loses-parliamentary-seat-7987929/", "urlToImage": "https://images.indianexpress.com/2022/06/Boris-Johnson-1.jpg", "publishedAt": "2022-06-24T08:37:53Z", "content": "British Prime Minister Boris Johnson’s Conservative Party lost a previously safe parliamentary seat in southern England on Friday, a sign of the depth of voter discontent after months of scandals and… [+334 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Z category security cover for Yashwant Sinha", "description": "The squad has taken over the task after the Union home ministry directed the Central Reserve Police Force (CRPF) VIP security wing to ensure protection to the 84-year-old Sinha.", "url": "https://indianexpress.com/article/india/z-category-security-cover-for-yashwant-sinha-7988454/", "urlToImage": "https://images.indianexpress.com/2022/06/Yashwant-Sinha-PTI.jpg", "publishedAt": "2022-06-24T08:32:44Z", "content": "The Centre has extended a Z category cover of armed CRPF commandos to the opposition’s presidential candidate Yashwant Sinha, officials said on Friday.The squad has taken over the task after the Unio… [+678 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Thor Love And Thunder first reactions: Chris Hemsworth film ‘doubles down on the Ragnarok charm’", "description": "Chris Hemsworth starrer Thor Love and Thunder had its premiere in Los Angeles, and the initial reactions seem positive.", "url": "https://indianexpress.com/article/entertainment/hollywood/thor-love-and-thunder-first-reactions-chris-hemsworth-film-doubles-down-ragnarok-charm-7988148/", "urlToImage": "https://images.indianexpress.com/2022/06/thor-love-and-thunder-1200-2.jpg", "publishedAt": "2022-06-24T08:29:06Z", "content": "Chris Hemsworth starrer Thor Love and Thunder had its premiere in Los Angeles and the first reactions from the screening seem extremely positive. These are not the official reviews of the film but th… [+2232 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "JEE Main 2022 Session-1 Day 2 Paper Analysis: Students find questions moderately difficult, check subject-wise topics asked", "description": "The paper was considered to be somewhat difficult according to the experts. Unit dimension, communication, the mole idea, chemistry in real life, set, and other subjects were among the key ones covered in the exam.", "url": "https://indianexpress.com/article/education/jee-main-2022-session-1-day-2-paper-analysis-students-find-questions-moderately-difficult-check-subject-wise-topics-asked-7988401/", "urlToImage": "https://images.indianexpress.com/2022/01/JEE-Main-2022-Live-card-2.jpg", "publishedAt": "2022-06-24T08:28:50Z", "content": "The National Testing Agency (NTA) is conducting the first session of JEE Main 2022 from June 23 to June 29. The first shift began at 9 am and ended at 12 noon. The second shift will begin at 3 pm and… [+1360 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Govt to move NDPS from FinMin to MHA", "description": "Transfer of administration of the two Acts from DoR to MHA is under deliberation, two sources briefed on the matter said. E-mails sent to Ministry of Finance and MHA for comments remained unanswered.", "url": "https://indianexpress.com/article/india/govt-to-move-ndps-from-finmin-to-mha-7988315/", "urlToImage": "https://images.indianexpress.com/2022/06/Capture-34.jpg", "publishedAt": "2022-06-24T08:28:41Z", "content": "The government is considering transferring the administration of the Narcotic Drugs and Psychotropic Substances Act, 1985 and Prevention of Illicit Traffic in Narcotic Drugs and Psychotropic Substanc… [+2639 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Tamil Nadu: DMK MP Tiruchi Siva’s son Suriya arrested for threatening bus owner, hijacking bus", "description": "Close to 60 BJP workers besieged Cantonment police station in Tamil Nadu claiming that a false case had been booked against Suriya Siva. Police registered cases against them too.", "url": "https://indianexpress.com/article/cities/chennai/tamil-nadu-dmk-mp-tiruchi-siva-son-arrested-threatening-bus-owner-hijacking-7988402/", "urlToImage": "https://images.indianexpress.com/2022/06/tiruchi-mp.jpg", "publishedAt": "2022-06-24T08:26:01Z", "content": "Dravida Munnetra Kazhagam (DMK) MP Tiruchi Sivas son Suriya, the general secretary of Tamil Nadu BJPs OBC wing, was arrested by the Tamil Nadu police on Thursday for allegedly intimidating a private … [+1991 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Hero MotoCorp to hike motorcycle, scooter prices by up to Rs 3,000 from Jul 1", "description": "Hero MotoCorp sells a range of models, ranging from entry-level HF100 with prices starting at Rs 51,450, while Xpulse 200 4V tagged at Rs 1.32 lakh (ex-showroom Delhi).", "url": "https://indianexpress.com/article/business/hero-motorcycle-scooter-prices-hike-rs-3000-jul-1-7988224/", "urlToImage": "https://images.indianexpress.com/2022/06/Hero-MotoCorp.jpg", "publishedAt": "2022-06-24T08:22:51Z", "content": "Two-wheeler maker Hero MotoCorp on Thursday said it will hike prices of motorcycles and scooters by up to Rs 3,000 from July 1 to partially offset the steadily growing overall cost inflation, includi… [+475 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Govt-appointed panel on EV fire cases to submit report this month", "description": "Road Transport and Highways Minister Nitin Gadkari had recently said companies found negligent will be penalised and a recall of all defective vehicles will be ordered after the expert panel submits its report.", "url": "https://indianexpress.com/article/india/govt-appointed-panel-on-ev-fire-cases-to-submit-report-this-month-7988248/", "urlToImage": "https://images.indianexpress.com/2022/04/Nitin-Gadkari.jpg", "publishedAt": "2022-06-24T08:21:57Z", "content": "An expert committee set up by the road transport ministry to investigate cases of electric two-wheelers catching fire and suggest remedial measures is likely to submit its report this month, a senior… [+282 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Southern Railways cancels 12 suburban trains in Chennai", "description": "According to a release issued by Southern Railway, the trains will be canceled till June 27 due to ongoing works in the Chennai Egmore-Villupuram section at Tambaram Yard.", "url": "https://indianexpress.com/article/cities/chennai/southern-railways-chennai-train-cancellation-7988271/", "urlToImage": "https://images.indianexpress.com/2022/06/Chennai-MRTS.jpg", "publishedAt": "2022-06-24T08:18:59Z", "content": "The Chennai division of Southern Railway has cancelled as many as 12 suburban trains due to ongoing engineering works in the Chennai Egmore-Villupuram section at Tambaram Yard. According to a release… [+635 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Entertainment Desk", "title": "শিক্ষকদের অপমান! রোষের মুখে বাংলা ধারাবাহিক, নেটপাড়ায় ছিঃ ছিঃ করছেন দর্শকরা", "description": "ইংরেজির বহরে থমকে গেছেন দর্শকরা", "url": "https://bengali.indianexpress.com/entertainment/television/colors-bangla-serial-wrong-english-tumi-je-amar-ma-461011/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/serial-tumi-je-amar-ma.jpg", "publishedAt": "2022-06-24T08:18:41Z", "content": "! , \r\n ‘ ’ ! Good good-better-best good-gooder-goodest! ? , , ! , ‘ , ’ , ‘ ?’ \r\n– / \r\n[ , ! ? ] \r\n , , – \r\n , ! , , , -"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kamal Saiyed", "title": "As rebel Sena MLAs transited Surat, CR Paatil ran show from behind the scenes", "description": "Sources said that nearly 32 rebel MLAs from Shiv Sena reached Surat on the night of June 20 after being driven from Maharashtra, and six others joined them on early June 21 morning.", "url": "https://indianexpress.com/article/political-pulse/rebel-sena-mlas-surat-cr-paatil-ran-show-from-behind-the-scenes-7988367/", "urlToImage": "https://images.indianexpress.com/2022/06/Chandrakant-Raghunath-Paatil-.jpg", "publishedAt": "2022-06-24T08:18:29Z", "content": "Hours ahead of June 21 morning, when the International Yoga Day was celebrated, a luxury hotel on the Surat-Dumas Road came under a tight police cordon. At least 30 Shiv Sena MLAs from Maharashtra, l… [+5630 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shubhra Gupta", "title": "Sherdil The Pilibhit Saga movie review: Pankaj Tripathi deserved a better film", "description": "Sherdil The Pilibhit Saga movie review: Done well, this could have been a strong satire, but it turns into a listless saga, with only Pankaj Tripathi and its lovely music by Shantanu Moitra standing out.", "url": "https://indianexpress.com/article/entertainment/movie-review/sherdil-movie-review-pankaj-tripathi-7988386/", "urlToImage": "https://images.indianexpress.com/2022/06/sherdil-review-.jpg", "publishedAt": "2022-06-24T08:17:57Z", "content": "Sherdil The Pilibhit Saga movie cast: Pankaj Tripathi, Neeraj Kabi, Sayani GuptaSherdil The Pilibhit Saga movie director: Srijit MukherjiSherdil Srijit Mukherji movie rating: 1.5 starsBased on a true… [+1968 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "PM Modi exhorts exporters to set long-term export targets", "description": "Inaugurating the new Vanijya Bhawan here, he said that the exports play a critical role in the transition of a country from developing to developed status.", "url": "https://indianexpress.com/article/business/pm-modi-exporters-to-set-long-term-export-targets-7988269/", "urlToImage": "https://images.indianexpress.com/2022/06/download-10.jpg", "publishedAt": "2022-06-24T08:15:32Z", "content": "Prime Minister Narendra Modi on Thursday appealed to exporters and the industry to fix long-term export targets for themselves and suggest ways to the government to achieve those goals.Inaugurating t… [+4286 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "In record, Florida biologists capture nearly 100-kg Burmese python with 122 eggs", "description": "The Burmese python, an invasive species introduced in the US as an exotic pet in the 1970s, is known for rapid reproduction and capturing the wild, leading to the depletion of native wildlife.", "url": "https://indianexpress.com/article/trending/trending-globally/in-record-florida-biologists-capture-nearly-100-kg-burmese-python-with-122-eggs-7988087/", "urlToImage": "https://images.indianexpress.com/2022/06/biggest-burmese-python-florida.jpg", "publishedAt": "2022-06-24T08:13:51Z", "content": "In a spectacular research moment, biologists captured the biggest Burmese python ever recorded in the state of Florida, USA. The humongous snake caught by the Conservancy of Southwest Florida measure… [+3115 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Explained: What is Title IX and what impact has it had?", "description": "Title IX explained: Title IX, the law best known for its role in gender equity in athletics and preventing sexual harassment on campuses, is turning 50. What does it say? How does it affect athletics? What about sexual harassment allegations?", "url": "https://indianexpress.com/article/explained/what-is-title-ix-7988369/", "urlToImage": "https://images.indianexpress.com/2022/06/title-ix-1.jpg", "publishedAt": "2022-06-24T08:06:14Z", "content": "Title IX, the law best known for its role in gender equity in athletics and preventing sexual harassment on campuses, is turning 50.It was signed into law by President Richard Nixon on June 23, 1972,… [+6688 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "CBI searches 5 locations in bank fraud case worth 69.33 crore against Delhi company", "description": "This included diversion of funds, fabrication of account books and forgery in account books to defraud the banks during 2011-16, the officials said.", "url": "https://indianexpress.com/article/cities/delhi/delhi-news-cbi-search-bank-fraud-packaging-company-rave-scans-7988378/", "urlToImage": "https://images.indianexpress.com/2022/06/money-5-2.jpg", "publishedAt": "2022-06-24T08:04:07Z", "content": "The CBI on Friday conducted searches at five locations in Delhi after registering an FIR against Delhi-based packaging company Rave Scans Pvt Ltd for allegedly defrauding a consortium of banks to the… [+890 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kanchan Vasdev", "title": "Heatwave, paddy transplantation led to low voter turnout in Sangrur, says Punjab CM Bhagwant Mann", "description": "While it is generally perceived that a low turnout favours the ruling party and a high turnout indicates anti-incumbency, the opposition parties say that Sangrur is a peculiar case.", "url": "https://indianexpress.com/article/cities/chandigarh/heatwave-paddy-transplantation-led-to-low-voter-turnout-in-sangrur-says-punjab-cm-7988198/", "urlToImage": "https://images.indianexpress.com/2022/06/voting-1200.jpg", "publishedAt": "2022-06-24T08:01:49Z", "content": "Punjab Chief Minister Bhagwant Mann on Friday said that heatwave and paddy transplantation was responsible for the low turnout of voters in Sangrur Lok Sabha by-election held Thursday.On the sideline… [+1503 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "India eye improved top-order show in 2nd T20I against Sri Lanka", "description": "India will be eying early series victory when they will face Sri Lanka on Saturday", "url": "https://indianexpress.com/article/sports/cricket/india-eye-improved-top-order-show-in-2nd-t20i-against-sri-lanka-ind-vs-sl-harmanpreet-kaur-bcci-smriti-mandhana-jemimah-rodrigues-7988349/", "urlToImage": "https://images.indianexpress.com/2022/03/Harmanpreet-Kaur.jpg", "publishedAt": "2022-06-24T07:59:22Z", "content": "Eyeing a series-clinching victory, the Indian women’s cricket team would expect a better showing from its top-order when it takes on Sri Lanka in the second T20 International, here on Saturday.The In… [+3226 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Who is Zakia Jafri?", "description": "Zakia Jafri is the widow of Congress MP Ehsan Jafri who along with 68 others was killed inside the gated Gulberg Society, a day after the 2002 Godhra riots in Gujarat.", "url": "https://indianexpress.com/article/india/who-is-zakia-jafri-gujarat-riots-sc-verdict-7988071/", "urlToImage": "https://images.indianexpress.com/2022/06/zakia-jafri.jpg", "publishedAt": "2022-06-24T07:57:03Z", "content": "Zakia is the widow of Congress MP Ehsan Jafri who along with 68 others was killed inside the gated Gulberg Society, a lower-middle-class Muslim neighbourhood in Chamanpura, Ahmedabad, a day after the… [+1460 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "BJP national meet: Hyderabad police gears up ahead of PM Modi’s visit next week", "description": "The BJP is holding its national executive meeting at HICC Novotel in Hyderabad on July 2-3 and Prime Minister Narendra Modi is scheduled to address a rally at the parade grounds.", "url": "https://indianexpress.com/article/cities/hyderabad/pm-modi-visit-hyderabad-bjp-nationa-meet-police-security-secunderabad-7988339/", "urlToImage": "https://images.indianexpress.com/2022/06/modi-bjp.jpg", "publishedAt": "2022-06-24T07:53:13Z", "content": "The Hyderabad city police, along with state government departments, have put elaborate security arrangements in place ahead of Prime Minister Narendra Modi’s visit to Hyderabad to attend the party’s … [+2651 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Mizoram govt launches ‘Super IAS 40’ to sponsor coaching for UPSC civil services exam", "description": "Faced with an acute shortage of IAS officers, the Mizoram government has decided to sponsor the coaching of 40 UPSC aspirants from the state for the civil services examination, they said.", "url": "https://indianexpress.com/article/jobs/mizoram-govt-to-sponsor-coaching-for-upsc-civil-services-7988223/", "urlToImage": "https://images.indianexpress.com/2022/06/ch1045132-1.jpg", "publishedAt": "2022-06-24T07:51:25Z", "content": "Over 500 candidates appeared for an entrance test on Friday for the ‘Super IAS 40’ programme, through which the Mizoram government will sponsor the coaching of 40 aspirants for the UPSC civil service… [+2450 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Kate Middleton wears heirloom accessory in first portrait with Prince William; know more about it", "description": "The Cambridge royals visited the Fitzwilliam Museum to view their first-ever joint portrait, which will be on display to the public for three years", "url": "https://indianexpress.com/article/lifestyle/life-style/kate-middleton-heirloom-accessory-brooch-first-portrait-prince-william-duke-and-duchess-cambridge-7988043/", "urlToImage": "https://images.indianexpress.com/2022/06/william-and-kate-portrait-1200.jpg", "publishedAt": "2022-06-24T07:50:18Z", "content": "Prince William and Kate Middleton, the Duke and Duchess of Cambridge and key members of the British royal family, got their portrait unveiled at Cambridges Fitzwilliam Museum on Thursday.Buy Now | Ou… [+1996 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "The Conversation", "title": "Poliovirus in London sewage – what you need to know", "description": "There are three types of poliovirus, and infection or immunisation by one type does not protect against another. Here's what you need to know.", "url": "https://indianexpress.com/article/world/poliovirus-in-london-sewage-what-you-need-to-know-7988259/", "urlToImage": "https://images.indianexpress.com/2022/06/polio-virus.jpg", "publishedAt": "2022-06-24T07:50:06Z", "content": "Written by Zania Stamataki, Senior Lecturer in Viral Immunology, University of Birmingham Just as we thought that monkeypox would be the new virus scare for 2022, the UK Health Security Agency (UKHSA… [+4673 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Google Chrome: Check these 6 new features coming to iOS", "description": "Here are six new useful features coming soon to Google Chrome on iOS.", "url": "https://indianexpress.com/article/technology/tech-news-technology/google-chrome-check-these-6-new-features-coming-to-ios-7988351/", "urlToImage": "https://images.indianexpress.com/2022/06/Google-Chrome.jpg", "publishedAt": "2022-06-24T07:46:04Z", "content": "Chrome has been updating its iOS browser app to bring new features to iPhone and iPad users. New updates coming to Chrome on iOS over the next few weeks will bring six new features to the popular bro… [+2195 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "Busking artist plays Kabir Singh’s ‘Tujhe Kitna Chaahne Lage Hum’ in US, Shahid Kapoor says ‘brilliant’", "description": "While Shahid Kapoor was impressed by the saxophonist's rendition of Kabir Singh song, film's composer Mithoon said the American man got the notes of the song absolutely right.", "url": "https://indianexpress.com/article/trending/viral-videos-trending/shahid-kapoor-reacts-busking-artist-plays-tujhe-kitna-chaahne-lage-hum-in-us-7987885/", "urlToImage": "https://images.indianexpress.com/2022/06/kabir-singh-sax-cover.jpg", "publishedAt": "2022-06-24T07:44:32Z", "content": "It’s not every day when you’re away from home in a foreign land and something familiar comes your way. Something similar happened when walking down a US street, a man heard an artist playing a Hindi … [+2749 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "J&K L-G reviews security arrangements for upcoming Amarnath Yatra", "description": "Security for the yatra that is scheduled to begin on June 30 was reviewed with senior police, paramilitary, army and intelligence officials of the UT.", "url": "https://indianexpress.com/article/cities/srinagar/jj-l-g-reviews-security-arrangements-for-upcoming-amarnath-yatra-7987873/", "urlToImage": "https://images.indianexpress.com/2022/06/amarnath-7597.jpg", "publishedAt": "2022-06-24T07:30:57Z", "content": "Jammu and Kashmir Lieutenant Governor Manoj Sinha on Thursday reviewed the security arrangements and preparations for the upcoming Amarnath Yatra at a Unified Command Meeting in Srinagar. This years … [+1510 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Careers Desk", "title": "SSC CHSL Tier 1 answer key released; here’s how to download", "description": "SSC CHSL Answer key: The candidate response sheet along with the tentative answer key is available on the official website - ssc.in.in", "url": "https://indianexpress.com/article/jobs/ssc-chsl-tier-1-answer-key-released-heres-how-to-download/", "urlToImage": "https://images.indianexpress.com/2021/03/answer-key-1200-1-2.jpg", "publishedAt": "2022-06-24T07:30:54Z", "content": "Staff Selection Commission (SSC) has released the answer key for the Combined Higher Secondary Level (10+2) Tier-I examination. The exam was conducted from May 24 to June 10, 2022, at different centr… [+862 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Careers Desk", "title": "SSC CHSL Tier 1 answer key released; here’s how to download", "description": "SSC CHSL Answer key: The candidate response sheet along with the tentative answer key is available on the official website - ssc.in.in", "url": "https://indianexpress.com/article/jobs/ssc-chsl-tier-1-answer-key-released-heres-how-to-download-ssc-nic-in-7988117/", "urlToImage": "https://images.indianexpress.com/2021/03/answer-key-1200-1-2.jpg", "publishedAt": "2022-06-24T07:30:54Z", "content": "Staff Selection Commission (SSC) has released the answer key for the Combined Higher Secondary Level (10+2) Tier-I examination. The exam was conducted from May 24 to June 10, 2022, at different centr… [+862 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Psychosis, addiction, chronic vomiting: As weed becomes more potent, teens are getting sick", "description": "Although recreational cannabis is illegal in the United States for those younger than 21, it has become more accessible as many states have legalized it.", "url": "https://indianexpress.com/article/lifestyle/health/psychosis-addiction-chronic-vomiting-weed-potent-teens-sick-us-7988247/", "urlToImage": "https://images.indianexpress.com/2022/06/cannabis-teen.jpg", "publishedAt": "2022-06-24T07:30:18Z", "content": "Elysse was 14 when she first started vaping cannabis.\r\nIt did not smell, which made it easy to hide from her parents. And it was convenient; just press a button and inhale. After the second or third … [+9601 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rahul V Pisharody", "title": "In Hyderabad, online music lessons help a group of women keep their life in tune", "description": "“When my husband was in ICU during the third wave, I got a lot of strength and inner peace only because of this group and the hymns we learnt. In difficult times, we had each other.”", "url": "https://indianexpress.com/article/meta-stories-of-strength-2022/in-hyderabad-online-music-lessons-help-a-group-of-women-keep-their-life-in-tune/", "urlToImage": "https://images.indianexpress.com/2022/06/IMG-20220623-WA0223.jpg", "publishedAt": "2022-06-24T07:29:35Z", "content": "HYDERABAD: Had it not been for this group of women, 63-year-old N Ramamani says she would have gone insane during the pandemic. These friends from her music class, many of them suffering from solitud… [+4171 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Rocketry new trailer: Madhavan looks promising as Nambi Narayanan in the intriguing biopic", "description": "Rocketry is based on the life of Nambi Narayanan, a former scientist and aerospace engineer of the Indian Space Research Organisation. The film is written and directed by R Madhavan.", "url": "https://indianexpress.com/article/entertainment/bollywood/rocketry-new-trailer-madhavan-looks-promising-as-nambi-narayanan-intriguing-biopic-7988201/", "urlToImage": "https://images.indianexpress.com/2022/06/rocketry-trailer-.jpg", "publishedAt": "2022-06-24T07:28:18Z", "content": "The makers of Rocketry The Nambi Effecthave released a new trailer of the film ahead of its release on July 1. The first trailer of the biopic was launched on April 1. The film is written and directe… [+1290 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi: Active Covid-19 cases remain over 5,000 for nearly a week", "description": "The positivity rate in Delhi has remained over 5% for eleven days. After a dip in Covid cases due to fewer tests conducted, Delhi saw the number of fresh cases increase to 1,934 on Thursday.", "url": "https://indianexpress.com/article/cities/delhi/delhi-covid-news-active-cases-corona-updates-latest-hospitals-positivity-rate-7988128/", "urlToImage": "https://images.indianexpress.com/2022/06/covid-test-3.jpg", "publishedAt": "2022-06-24T07:27:58Z", "content": "The number of active Covid-19 cases in Delhi has remained over 5,000 for six days in a row, with an average of 234 people in the hospital during the period. There are almost 9,500 beds earmarked for … [+1617 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sanath Prasad", "title": "Sexual harassment case: NLSUI clarifies on disciplinary action against student facilitators", "description": "After alumni of NLSIU condemned the disciplinary action it took against student facilitators for reporting a sexual harassment case, the university explained that the facilitators had bypassed its mechanism for dealing with sexual harassment cases.", "url": "https://indianexpress.com/article/cities/bangalore/sexual-harassment-case-nlsui-clarifies-disciplinary-action-against-student-facilitators-7988222/", "urlToImage": "https://images.indianexpress.com/2022/06/nlsiu-1200.jpg", "publishedAt": "2022-06-24T07:27:20Z", "content": "Following an open letter by 200 alumni of National Law School of India University (NLSIU) Bengaluru condemning the disciplinary action against student facilitators for reporting a sexual harassment c… [+2672 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Shamshera trailer: Ranbir Kapoor film wants to be Baahubali, but it could just as easily be Thugs of Hindostan", "description": "Shamshera trailer: Starring Ranbir Kapoor, Sanjay Dutt and Vaani Kapoor, Karan Malhotra's Shamshera releases in theatres on July 22.", "url": "https://indianexpress.com/article/entertainment/bollywood/shamshera-trailer-ranbir-kapoor-watch-video-baahubali-thugs-of-hindostan-7987995/", "urlToImage": "https://images.indianexpress.com/2022/06/Shamshera-1200.jpg", "publishedAt": "2022-06-24T07:23:22Z", "content": "SS Rajamouli has clearly had an impact on this generation of filmmakers and the same is evident from the trailer of Ranbir Kapoor starrer Shamshera. The trailer introduces the audience to a ‘lootera’… [+1590 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sethu Pradeep", "title": "This fabric can generate electricity from your movements to power wearables", "description": "Tapping a 3x4 cm piece of stretchable and washable fabric generated enough electricity to light up to 100 LEDs.", "url": "https://indianexpress.com/article/technology/science/this-fabric-can-generate-electricity-from-your-movements-to-power-wearables-7988229/", "urlToImage": "https://images.indianexpress.com/2022/06/Stretchable-fabric-power-electricity.jpg", "publishedAt": "2022-06-24T07:22:05Z", "content": "Scientists at the Nanyang Technological University, (NTU) Singapore have developed a technology that can create a stretchable and waterproof fabric that can generate energy from your body movements. … [+3763 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Careers Desk", "title": "MPSC Recruitment 2022: Apply for 800 vacancies; check details", "description": "Interested candidates can apply for these vacancies on the official MPSC website — mpsc.gov.in — from tomorrow (June 25) till July 15. The MPSC Group B prelim exam 2022 will be held on October 8, 2022.", "url": "https://indianexpress.com/article/jobs/mpsc-recruitment-2022-apply-for-800-vacancies-check-details-sarkari-naukri-mpsc-gov-in-7988192/", "urlToImage": "https://images.indianexpress.com/2022/06/MPSC-2022.jpg", "publishedAt": "2022-06-24T07:21:38Z", "content": "The Maharashtra Public Service Commission (MPSC) is inviting application for the Group B Subordinate Services (Non-Gazetted) officers. Interested candidates can apply for these vacancies on the offic… [+1278 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rahul Pandey", "title": "Cold, slow pitches, beanies, hand-warmers: Ireland coach lists out what awaits India", "description": "The 41-year old Heinrich Malan opens up on his new job, the two-match series against India, fresh names in the Ireland squad and how Ireland should take a page out of India's itinerary for red-ball cricket.", "url": "https://indianexpress.com/article/sports/cricket/cold-slow-pitches-beanies-hand-warmers-ireland-coach-lists-out-what-awaits-india-7988216/", "urlToImage": "https://images.indianexpress.com/2022/06/Heinrich-Malan.jpg", "publishedAt": "2022-06-24T07:15:57Z", "content": "Heinrich Malan began his cricketing journey in South Africa, making 10 first class and nine List-A appearances for the Northerns cricket team between 2005 to 2009. He then moved to New Zealand, switc… [+6697 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Careers Desk", "title": "Agnipath scheme: Registration process for Agnivir Vayu recruitment begins today", "description": "The candidate must pay a sum of Rs.250 as an examination fee while registering for the online examination. The online examinations will start on July 24, 2022", "url": "https://indianexpress.com/article/jobs/agnipath-scheme-iaf-begins-registration-process-agnivir-vayu-recruitment-agnipathvayu-cdac-in-7988199/", "urlToImage": "https://images.indianexpress.com/2022/05/Telangana-Police-Recruitment.jpg", "publishedAt": "2022-06-24T07:15:40Z", "content": "The Indian Air Force (IAF) will begin the registration for Agnivir Vayu posts under the Agnipath recruitment scheme. The registration process begins on June 24 and the last date to apply is July 5 ti… [+1673 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Expatriate’s entry into Kerala Assembly complex: 4 contract Sabha TV staff removed from service", "description": "Speaker M B Rajesh says Anitha Pullayil, an expatriate with links to fraudster Monson Mavunkal, had entered the Assembly complex during the Loka Kerala Sabha with the employees’ help.", "url": "https://indianexpress.com/article/cities/thiruvananthapuram/kerala-news-loka-sabha-tv-legislature-expatriate-illegal-fraudster-cheating-7988196/", "urlToImage": "https://images.indianexpress.com/2022/06/kerala-legislative-assembly.jpg", "publishedAt": "2022-06-24T07:14:19Z", "content": "Four contract employees of Sabha TV, the online video streaming platform of the Secretariat of the Kerala Legislature, were removed from service on Friday on charges of permitting an expatriate from … [+1346 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "From taking notes on iPad to scoring runs, Sangakkara dissects the Mitchell method", "description": "Mitchell so far has scored 451 runs in the on-going three-match series, including two centuries in the first two Tests. On Day One at Headingley, he remained unbeaten on 78.", "url": "https://indianexpress.com/article/sports/cricket/from-taking-notes-on-ipad-to-scoring-runs-sangakkara-dissects-the-mitchell-method-7988209/", "urlToImage": "https://images.indianexpress.com/2021/09/sangakkara.jpg", "publishedAt": "2022-06-24T07:12:17Z", "content": "On a day when Daryl Mitchell, along with Tom Blundell, yet again carried the New Zealand batting, Kumar Sangakkara gave an insight into the former’s preparation. For more than two months, Sangakkara … [+1973 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Info Desk", "title": "Western Railways to extend summer special trains to Rajasthan", "description": "The weekly summer train running from Bandra Terminus to Jaipur has been extended till July 28 and the one running between Bandra Terminus and Ajmer has been extended to August 1.", "url": "https://indianexpress.com/article/india/western-railways-to-extend-summer-special-trains-from-bandra-terminus-to-jaipur-ajmer-7988070/", "urlToImage": "https://images.indianexpress.com/2022/01/railways-7591.jpeg", "publishedAt": "2022-06-24T07:08:06Z", "content": "Western Railway Friday announced the extension of trips of summer special trains that run between Bandra Terminus – Jaipur, and Bandra Terminus – Ajmer. In a tweet, the railway division said the exte… [+878 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Goa police to transfer cases of land irregularities to SIT: DGP", "description": "The SIT arrested a man from Karnataka for allegedly illegally transferring 60-70 properties in Goa using forged documents.", "url": "https://indianexpress.com/article/cities/goa/goa-police-land-irregularities-transferred-to-sit-7988098/", "urlToImage": "https://images.indianexpress.com/2022/04/goa-police-12-1-e1656052558345.jpg", "publishedAt": "2022-06-24T07:07:25Z", "content": "Goa Director General of Police Jaspal Singh has said that all the cases of land irregularities in the state will be transferred to the newly-formed Special Investigation Team (SIT).Talking to reporte… [+1080 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Ritvik Chaturvedi", "title": "Why EAT-Lancet’s diet to save the planet remains inaccessible in rural India", "description": "The EAT-Lancet Commission recommends the least expensive, sustainable, nutrition-rich diet for various parts of the globe but it remains inaccessible for rural India.", "url": "https://indianexpress.com/article/technology/science/eat-lancet-diet-inaccessible-unaffordable-rural-india-7988187/", "urlToImage": "https://images.indianexpress.com/2022/06/EAT-Lancet-diet-inaccessible-1.jpg", "publishedAt": "2022-06-24T07:04:08Z", "content": "In a 2019 report, the EAT-Lancet Commission a group of public health experts, environmental scientists and policymakers from 16 countries had recommended the least expensive, sustainable, nutrition-r… [+6495 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Assam floods: Dos and don’ts to follow before, after, and during the natural disaster to stay safe", "description": "NDMA recently listed some important things you must do before, after, and during the floods. Also, it shared some tips to follow in case of evacuation", "url": "https://indianexpress.com/article/lifestyle/life-style/assam-floods-dos-donts-before-after-during-floods-ndma-7987917/", "urlToImage": "https://images.indianexpress.com/2022/06/assam-floods-1.jpg", "publishedAt": "2022-06-24T07:00:55Z", "content": "Floodsand rain-induced landslides have wreaked havoc across Assam as nearly 100 people have lost their lives with over 54.5 lakh people still affected. The Brahmaputraand Barak rivers, along with the… [+2509 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "AP Open school SSC, Inter results 2022 declared; how to check", "description": "AP SSC and Intermediate (APOSS) Public Examinations, April / May - 2022 are released and hosted in the website. Candidates can download the mark memo at apopenschool.ap.gov.in/", "url": "https://indianexpress.com/article/education/ap-open-school-ssc-inter-results-2022-declared-how-to-check-apopenschool-ap-gov-in-7988186/", "urlToImage": "https://images.indianexpress.com/2022/06/ch1165308-1-4.jpg", "publishedAt": "2022-06-24T06:59:54Z", "content": "The Andhra Pradesh Open School Society (APOSS) has declared the results for SSC and inter board exams 2022. Candidates can check the result at the official website – apopenschool.ap.gov.in/SSC and In… [+854 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rahul Pandey", "title": "“That’s the full monty!” Shastri details his iconic commentary stint during Yuvraj’s six sixes", "description": "The former India coach shared his experience of hitting six 6s as well as being on air when Yuvraj Singh did the same.", "url": "https://indianexpress.com/article/sports/cricket/thats-the-full-monty-shastri-details-his-iconic-commentary-stint-during-yuvrajs-six-sixes-7988145/", "urlToImage": "https://images.indianexpress.com/2022/06/Yuvraj-and-Shastri.jpg", "publishedAt": "2022-06-24T06:59:07Z", "content": "Ravi Shastri didnt even tell his mother that he had hit six sixes in an over. She would come to know from a Bhelpuri wala the next day. Out of the many memorable cricket moments featuring Shastri, as… [+3619 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Bloomberg", "title": "Three charts show trouble for Indian stocks nearing a bear market", "description": "The S&P BSE Sensex Index has fallen more than 15% from its October high, nearing the 20% loss that denotes a bear market.", "url": "https://indianexpress.com/article/business/market/three-charts-show-trouble-for-indian-stocks-nearing-a-bear-market-7988028/", "urlToImage": "https://images.indianexpress.com/2022/06/bse-bombay-stock-exchange-bloomberg-1200.jpg", "publishedAt": "2022-06-24T06:55:06Z", "content": "As surging inflation and the end of global easy-money policies send Indian stocks spiraling down from all-time highs, three charts show the pain is unlikely to end anytime soon.The S&amp;P BSE Sensex… [+2250 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Myanmar’s Suu Kyi moved to solitary confinement in jail: Military", "description": "Suu Kyi has been charged with about 20 criminal offences carrying a combined maximum jail term of nearly 190 years since she was toppled by the military in February 2021.", "url": "https://indianexpress.com/article/world/myanmars-suu-kyi-moved-to-solitary-confinement-in-jail-military-7987992/", "urlToImage": "https://images.indianexpress.com/2022/06/Aung-San-Suu-Kyi-1.jpg", "publishedAt": "2022-06-24T06:49:31Z", "content": "Myanmar military authorities have transferred deposed leader Aung San Suu Kyi to a prison in the capital from an undisclosed location where she had been held since she and her government were ousted … [+3576 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "Over 65 universities to participate in CUET-PG 2022; NTA releases list of courses to be offered", "description": "A total of 36 central universities including Babasaheb Bhimrao Ambedkar University, Banaras Hindu University, Central Tribal University of Andhra Pradesh, Central University of Andhra Pradesh, Central University of South Bihar, Central University of Gujarat a…", "url": "https://indianexpress.com/article/education/over-65-universities-to-participate-in-cuet-pg-2022-nta-releases-list-of-courses-to-be-offered-7988114/", "urlToImage": "https://images.indianexpress.com/2022/05/MPSC-1200-1.jpg", "publishedAt": "2022-06-24T06:49:00Z", "content": "The National Testing Agency (NTA) has announced that Suresh Gyan Vihar University, Jaipur, is the latest addition to the list of universities that will be accepting CUET-PG 2022 scores for admission … [+1311 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Saurabh Kapoor", "title": "Explained: Another failure extends the elusive search for Alzheimer’s ‘silver bullet’", "description": "What is Alzheimer's disease, and why has finding a 'silver bullet' cure proved elusive?", "url": "https://indianexpress.com/article/explained/alzheimers-disease-experimental-drug-crenezumab-clinical-trials-7988106/", "urlToImage": "https://images.indianexpress.com/2022/06/Alzheimers.jpeg", "publishedAt": "2022-06-24T06:47:20Z", "content": "An experimental Alzheimers drug aimed at slowing or preventing cognitive decline in people at risk of developing the disease early has failed in clinical trials, landing a blow to efforts aimed at fi… [+6768 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Police did not follow procedure while arresting Marathi actor Ketaki Chitale: Court", "description": "Ketaki Chitale was arrested a month ago for allegedly posting a defamatory poem on Facebook purported to be against NCP chief Sharad Pawar.", "url": "https://indianexpress.com/article/cities/mumbai/police-did-not-follow-procedure-arresting-marathi-actor-ketaki-chitale-7988110/", "urlToImage": "https://images.indianexpress.com/2022/06/Ketaki-Chitale-1.jpg", "publishedAt": "2022-06-24T06:47:11Z", "content": "In its detailed order granting bail to Marathi actor Ketaki Chitale, the Thane sessions court in Maharashtra said the police did not comply with procedures while arresting her. Chitale was arrested a… [+1440 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Chiranjeevi, Pawan Kalyan, Venkatesh Daggubati and Nagarjuna come together to attend grand wedding in Hyderabad. See photos, videos", "description": "Film distributor Sunil Narang's daughter Jahnvi Narang's wedding was attended by the stars of the Telugu film industry including Pawan Kalyan, Chiranjeevi, Nagarjuna and Venkatesh Daggubati.", "url": "https://indianexpress.com/article/entertainment/telugu/chiranjeevi-pawan-kalyan-venkatesh-daggubati-nagarjuna-come-together-for-a-wedding-in-hyderabad-see-photos-videos-7988026/", "urlToImage": "https://images.indianexpress.com/2022/06/pawan-kalyan-chiranjeevi.jpg", "publishedAt": "2022-06-24T06:46:17Z", "content": "The wedding of Telugu film distributor Sunil Narang’s daughter Jahnvi Narang witnessed the coming together of the who’s who of the South film industry. While Pawan Kalyan came along with his elder br… [+3208 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "‘Don’t expect people to stay quiet’: Kapil Dev blasts Virat Kohli on his lean patch", "description": "Kapil feels the lack of runs from the Virat Kohli's bat is a big concern for Indian cricket", "url": "https://indianexpress.com/article/sports/cricket/dont-expect-people-to-stay-quiet-kapil-dev-blasts-virat-kohli-on-his-lean-patch-7988113/", "urlToImage": "https://images.indianexpress.com/2020/11/virat-kohli-kapil-dev.jpg", "publishedAt": "2022-06-24T06:44:02Z", "content": "The long and tedious wait for Virat Kohlis 75th international century dragged on for past two and half years. Since he has scored his last international century, Kohli became a father, forsook captai… [+2388 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Charlie Puth and BTS’ Jungkook’s ‘Left and Right’ out now, ARMY rejoices", "description": "Days after the BTS announced a hiatus, Jungkook's new solo with Charlie Puth came as a relief to fans.", "url": "https://indianexpress.com/article/entertainment/music/charlie-puth-bts-jungkook-left-and-right-out-now-army-rejoices-7988034/", "urlToImage": "https://images.indianexpress.com/2022/06/BTS1200-3.jpeg", "publishedAt": "2022-06-24T06:39:06Z", "content": "Weeks after sharing details of their upcoming collaboration and its teaser, Charlie Puth and BTS’s Jungkook’s upbeat new single ‘Left and Right‘ is finally out. The quirky music video of this groovy … [+1238 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sanskriti Falor", "title": "Explained: US passes bill for gun safety, what’s in it?", "description": "The bill was passed exactly a month after a mass shooting in Uvalde, Texas, where a gunman stormed an elementary school and killed 21 people, including 19 children.", "url": "https://indianexpress.com/article/explained/explained-us-passes-bill-gun-safety-whats-in-it-7987940/", "urlToImage": "https://images.indianexpress.com/2022/06/AP22174852939766.jpg", "publishedAt": "2022-06-24T06:38:31Z", "content": "The United States Senate has passed a gun safety bill, the most significant action against rising gun violence in the country. The bill was passed on Thursday (June 23), hours after the US Supreme Co… [+6322 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Neha Mehta, former Anjali Mehta, says Taarak Mehta Ka Ooltah Chashmah maker yet to pay her 6-month dues", "description": "Neha Mehta, who played Anjali Mehta for 12 years, spoke about how her six months payment hasn't been cleared by the Taarak Mehta Ka Ooltah Chashmah makers.", "url": "https://indianexpress.com/article/entertainment/television/taarak-mehta-ka-ooltah-chashmah-anjali-neha-mehta-payment-due-7988042/", "urlToImage": "https://images.indianexpress.com/2022/06/neha-mehta-taarak-mehta-ka-ooltah-chashmah.jpg", "publishedAt": "2022-06-24T06:34:54Z", "content": "Stating that she doesn’t like complaining but given it’s her hard-earned money, she hopes the makers will clear off her dues. “I live a very dignified life and don’t believe in complaining about anyt… [+1301 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Startup in Bengal develops a device to produce oxygen from water", "description": "The device was selected by the Department of Biotechnology for showcasing and launch on its 10th foundation day and at the 1st Bio-Tech Expo 2022.", "url": "https://indianexpress.com/article/technology/science/startup-in-bengal-develops-a-device-to-produce-oxygen-from-water-7988094/", "urlToImage": "https://images.indianexpress.com/2022/06/OM-Redox.jpg", "publishedAt": "2022-06-24T06:34:47Z", "content": "A startup in West Bengal has come out with a device that produces oxygen from water just by pressing of a switch, the founders of the technology claimed. ‘OM Redox’, the device developed by Solaire I… [+2979 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Petrol and diesel prices today, June 24, 2022: Check fuel prices in Delhi, Mumbai, Bengaluru and other major cities", "description": "Petrol & Diesel Rates Today in Delhi, Mumbai, Banglore, Chennai:....", "url": "https://indianexpress.com/article/business/commodities/petrol-diesel-prices-today-june-24-check-fuel-prices-delhi-mumbai-bengaluru-other-cities-7987942/", "urlToImage": "https://images.indianexpress.com/2022/03/petrol-diesel-price-pti-1200.jpg", "publishedAt": "2022-06-24T06:33:53Z", "content": "Petrol &amp; Diesel Prices Today in Delhi, Mumbai, Bengaluru, Chennai: Petrol and diesel prices remained steady across the country for the 33rd day in a row on Friday, June 24, 2022.In Delhi, petrol … [+2375 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "‘Good or bad, it’s Hong Kong history’, says British colonial museum founder", "description": "A partially burnt British flag recovered from a War World Two battle in Hong Kong, when Japanese forces captured the city, is among the museum's most precious items", "url": "https://indianexpress.com/article/lifestyle/art-and-culture/good-or-bad-its-hong-kong-history-says-british-colonial-museum-founder-7987842/", "urlToImage": "https://images.indianexpress.com/2022/06/1HONGKONG-ANNIVERSARY-COLLECTOR.jpeg", "publishedAt": "2022-06-24T06:30:33Z", "content": "Bryan Ong has made it his mission to preserve items that tell the story of Hong Kong’s British colonial past even as Beijing increasingly shapes life in the city that is firmly back in the fold of th… [+2258 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "R Madhavan on north-south debate: ‘If KGF and RRR worked, so did Kashmir Files and Bhool Bhulaiyaa 2’", "description": "R Madhavan believes the popularity of south films does not mean that Hindi are not doing well at the box office.", "url": "https://indianexpress.com/article/entertainment/bollywood/r-madhavan-on-north-south-debate-if-kgf-and-rrr-worked-so-did-kashmir-files-and-bhool-bhulaiyaa-2-7988020/", "urlToImage": "https://images.indianexpress.com/2022/06/R-Madhavan-1200by667.jpg", "publishedAt": "2022-06-24T06:27:40Z", "content": "Actor R Madhavan says it is futile to get into north-south cinema debate as things are constantly changing in the film industry and no one can predict how a film will be received by the people. In 20… [+3265 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "No hand in Shiv Sena turmoil, says Maharashtra BJP chief Chandrakant Patil", "description": "Maharashtra BJP chief Chandrakant Patil termed the Delhi trip of former CM Devendra Fadnavis a “routine visit” and said the BJP has received no offer from the rebel Sena MLAs to form the government in Maharashtra.", "url": "https://indianexpress.com/article/cities/pune/eknath-shinde-shiv-sena-bjp-chandrakant-patil-devendra-fadnavis-maharashtra-crisis-uddhav-thackeray-7988046/", "urlToImage": "https://images.indianexpress.com/2022/06/chandrakant-patil.jpg", "publishedAt": "2022-06-24T06:27:16Z", "content": "A day after Eknath Shinde, who is heading a group of rebel Shiv Sena MLAs, claimed that a national party was supporting them, Maharashtra BJP chief Chandrakant Patil on Friday denied that the saffron… [+1267 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Ukrainian forces will have to leave embattled Sievierodonetsk -governor", "description": "The battle for the city is key for Russia to establish control over the last remaining Ukrainian-held sliver of the Luhansk region, with only the city of Lysychansk left in Ukrainian hands if Sievierodonetsk were to fall.", "url": "https://indianexpress.com/article/world/ukrainian-forces-leave-embattled-sievierodonetsk-governor-7988064/", "urlToImage": "https://images.indianexpress.com/2022/06/ukraine-russia.jpg", "publishedAt": "2022-06-24T06:27:09Z", "content": "Ukrainian troops will “have to be withdrawn” from the mostly Russian-occupied battleground city of Sievierodonetsk, the regional governor said on Friday. Some of the heaviest fighting of the entire R… [+1003 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Raghu Malhotra", "title": "Explained: What are Eco-Sensitive Zones and why are there protests in Kerala against them?", "description": "The Supreme Court has ordered the establishment of 1-km Eco-Sensitive Zones around all protected areas, wildlife sanctuaries and national parks. What are Eco-Sensitive Zones, and how are they created? Why are people protesting the court's order?", "url": "https://indianexpress.com/article/explained/everyday-explainers/eco-sensitive-zones-supreme-court-verdict-kerala-protests-7988081/", "urlToImage": "https://images.indianexpress.com/2022/06/western-ghats-new.jpg", "publishedAt": "2022-06-24T06:23:11Z", "content": "Farmers in Kerala continue to protest across several high ranges of the state against the Supreme Courts recent order to establish 1-km Eco-Sensitive Zones around all protected areas, wildlife sanctu… [+5114 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Raghu Malhotra", "title": "Explained: What are Eco-Sensitive Zones and why are there protests in Kerala against them?", "description": "The Supreme Court has ordered the establishment of 1-km Eco-Sensitive Zones around all protected areas, wildlife sanctuaries and national parks. What are Eco-Sensitive Zones, and how are they created? Why are people protesting the court's order?", "url": "https://indianexpress.com/article/explained/eco-sensitive-zones-supreme-court-verdict-kerala-protests-7988081/", "urlToImage": "https://images.indianexpress.com/2022/06/western-ghats-explained.jpg", "publishedAt": "2022-06-24T06:23:11Z", "content": "Farmers in Kerala continue to protest across several high ranges of the state against the Supreme Courts recent order to establish 1-km Eco-Sensitive Zones around all protected areas, wildlife sanctu… [+5114 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "COAL India- তে বিপুল নিয়োগ! সুযোগ হাতছাড়া করলেই মুশকিল", "description": "জানুন বিস্তারিত", "url": "https://bengali.indianexpress.com/jobs/coal-india-recruitment-government-jobs-460934/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/coal-india.jpg", "publishedAt": "2022-06-24T06:21:28Z", "content": ", COAL \r\n ?\r\n :\r\n ?\r\nCoal India – GATE 2022 \r\n :- BTech, BE, Bsc – mining, electronics and telecommunication \r\nSystem EDP : % , BE/BTech / Bsc or computer science \r\n :-\r\n :- \r\n :-\r\n , \r\n :-\r\n :-\r\n<ul… [+254 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Wildfire in southwest Turkey enters third day", "description": "Scenes of burning woodland near the Aegean coastal resort of Marmaris sparked fears of a repeat of last year's fires that devastated some 140,000 hectares (345,950 acres) across the region.", "url": "https://indianexpress.com/article/world/wildfire-in-southwest-turkey-enters-third-day-7988069/", "urlToImage": "https://images.indianexpress.com/2022/06/Turkey-Wildfire-Reuters-1.jpg", "publishedAt": "2022-06-24T06:21:14Z", "content": "Firefighters sought to contain a wildfire in southwestern Turkey from land and air on Friday as the blaze raged on for a third day, with windy conditions fanning the flames and spreading them through… [+1708 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "RCS Lab hack: How Android, iOS users in Italy and Kazakhstan were spied on", "description": "Google recently detailed how commercial spyware by Milan's RCS Lab compromised both Android and iOS users in Italy and Kazakhstan in a new report.", "url": "https://indianexpress.com/article/technology/tech-news-technology/rcs-lab-hack-how-android-ios-users-in-italy-and-kazakhstan-were-spied-on-7988039/", "urlToImage": "https://images.indianexpress.com/2022/06/Hackers-Pixabay-1.jpg", "publishedAt": "2022-06-24T06:15:58Z", "content": "Google recently revealed in a new blog post that it has been tracking the activities of commercial spyware vendors, including Italy-based RCS Lab, which was found to be targeting mobile users in Ital… [+3816 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "‘প্রয়োজনে কর্মীরা পথে নামবেন’, সংকট আরও বাড়ছে বুঝেই ঢোক গিললেন রাউত?", "description": "মহা সংকট মহারাষ্ট্রে। সরকার টিকিয়ে রাখাই এখন মস্ত চ্যালেঞ্জ উদ্ধব ঠাকরেদের কাছে।", "url": "https://bengali.indianexpress.com/general-news/if-need-be-shiv-sena-workers-will-come-out-on-roads-sanjay-raut-warns-shinde-460937/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/Sanjay-Raut-Shiv-Sena.jpg", "publishedAt": "2022-06-24T06:15:00Z", "content": ", ‘ ’, ?\r\n - - \r\n - , \r\n , ” , , ” , ” ”\r\n - ! \r\n , , - \r\nStay updated with the latest news headlines and all the latest General news download Indian Express Bengali App.\r\nWeb Title: If need be shiv … [+59 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Punjab Vidhan Sabha pays tributes to slain singer Sidhu Moosewala, SAD’s Tota Singh", "description": "Others paid tributes included Arjuna awardees Gurcharan Singh Bhangu and Hari Chand. Congress’s Raj Kumar Chabbewal suggested that farmers who committed suicides should also be paid tributes.", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-vidhan-sabha-pays-tributes-to-slain-singer-sidhu-moosewala-sads-tota-singh-7988078/", "urlToImage": "https://images.indianexpress.com/2022/06/House-5col.jpg", "publishedAt": "2022-06-24T06:13:31Z", "content": "Punjab Vidhan Sabha on Friday paid tributes to singer-turned politician Shubhdeep Singh Sidhu, popular as Sidhu Moosewala, who was shot dead in Mansa last month."}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Neetu Kapoor says she was drunk during pheras, both she and Rishi Kapoor fainted at their wedding: ‘We got stones, chappals in gifts’", "description": "Neetu Kapoor recalled that at her wedding with Rishi Kapoor, they both fainted because there was a large crowd of people.", "url": "https://indianexpress.com/article/entertainment/bollywood/neetu-kapoor-was-drunk-at-wedding-pheras-rishi-kapoor-fainted-7987944/", "urlToImage": "https://images.indianexpress.com/2022/06/rishi-neetu.jpg", "publishedAt": "2022-06-24T06:13:02Z", "content": "Neetu Kapoor, who is making her comeback with JugJugg Jeeyo, recently shared that her wedding to the late Rishi Kapoor was a massive affair that saw many gatecrashers. In a video segment for Swiggy, … [+1406 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "A world apart, Lebanon and Sri Lanka share economic collapse", "description": "The toxic combinations that led to disaster for both Sri Lanka and Lebanon: Currency collapse, shortages, triple-digit inflation and growing hunger.", "url": "https://indianexpress.com/article/world/lebanon-and-sri-lanka-economic-collapse-7987989/", "urlToImage": "https://images.indianexpress.com/2022/06/2022-04-05T115836Z_1924247038_RC2XGT9MUB62_RTRMADP_3_SRI-LANKA-CRISIS.jpg", "publishedAt": "2022-06-24T06:10:46Z", "content": "Lebanon and Sri Lanka may be a world apart, but they share a history of political turmoil and violence that led to the collapse of once-prosperous economies bedeviled by corruption, patronage, nepoti… [+7136 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "‘Open category’ proposal faces questions over fairness and viability", "description": "FINA have received criticism regarding their decision to create an open category for trans athletes.", "url": "https://indianexpress.com/article/sports/open-category-proposal-faces-questions-over-fairness-and-viability-7988037/", "urlToImage": "https://images.indianexpress.com/2022/06/FINA-trans-athletes.jpg", "publishedAt": "2022-06-24T06:09:54Z", "content": "World swimming’s governing body FINA is setting up a working group to look into creating an ‘open category’ to ensure inclusivity after voting to restrict transgender women from competing in elite wo… [+3478 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Watch: Miss Universe Harnaaz Sandhu shows how to get gorgeous soft curls", "description": "\"I put on some serum and a hair protector. Every weekend, I do hair oiling. That's how I take care of my hair,\" Harnaaz revealed", "url": "https://indianexpress.com/article/lifestyle/life-style/miss-universe-harnaaz-sandhu-soft-curls-hair-tutorial-7981819/", "urlToImage": "https://images.indianexpress.com/2022/06/harnaaz-sandhu-1200-1.jpg", "publishedAt": "2022-06-24T06:00:22Z", "content": "Your hairstyle can help complete a look, thus making it an important part of getting ready that you mustn’t ignore. But if you are someone who does not like to spend a lot of time trying out a new ha… [+2170 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Yogesh Naik", "title": "MVA crisis: As Shiv Sena’s Dadar MLA joins Shinde faction, party workers take stock at Sena Bhavan", "description": "In two shakhas on Thursday, Sarvankar’s men obstructed Sainiks, prompting Raut to react. “These shakhas don’t belong to Sarvankar. These belong to the party and our property,” Raut said.", "url": "https://indianexpress.com/article/cities/mumbai/mva-crisis-workers-take-stock-at-sena-bhavan-7987955/", "urlToImage": "https://images.indianexpress.com/2022/06/sada-mla.jpg", "publishedAt": "2022-06-24T06:00:17Z", "content": "The Shiv Sena unit of the Dadar-Mahim area met at the Shiv Sena Bhavan in Mumbai on Thursday as Dadar MLA Sada Sarvankar joined the Eknath Shinde-led rebel faction at Guwahati.We called for a meeting… [+827 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "SI, aides booked in Delhi for trying to extort lakhs from businessman in judicial custody", "description": "In his letter to the Delhi Police commissioner, the businessman said he had been facing threats and harassment in jail because of the sub-inspector and his two aides (also policemen).", "url": "https://indianexpress.com/article/cities/delhi/si-aides-booked-extort-lakhs-businessman-judicial-custody-7988024/", "urlToImage": "https://images.indianexpress.com/2022/06/cash-money-1.jpg", "publishedAt": "2022-06-24T05:49:26Z", "content": "The Delhi Polices vigilance department registered a case against a sub-inspector and his associates for allegedly running an extortion racket. The matter came to light when a Delhi-based businessman,… [+2086 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Presidential polls: NDA’s candidate Droupadi Murmu to file nomination today", "description": "In a brief statement on Thursday, Droupadi Murmu had said, “I thank all and seek cooperation from everyone for the presidential election. I will meet all voters (lawmakers) and seek their support before July 18.”", "url": "https://indianexpress.com/article/india/nda-presidential-candidate-droupadi-murmu-file-nomination-today-7987988/", "urlToImage": "https://images.indianexpress.com/2022/06/President-Ram-Nath-Kovind-with-Droupadi-Murmu-2.jpg", "publishedAt": "2022-06-24T05:47:29Z", "content": "Droupadi Murmu will Friday file her nomination for the presidential election as a candidate for the ruling NDA coalition. This morning, Murmu was seen departing from Odisha Bhavan to Parliament, wher… [+1093 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Sports Desk", "title": "ভারত সিরিজে ‘না’! হজ করতে যাচ্ছেন ইংল্যান্ডের তারকা ক্রিকেটার", "description": "ভারতের বিরুদ্ধে সীমিত ওভারের সিরিজে আদিল রশিদকে পাবে না ইংল্যান্ড। তিনি যাচ্ছেন হজে।", "url": "https://bengali.indianexpress.com/sports/englands-adil-rashid-to-miss-india-series-as-he-decides-to-perform-haj-460920/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/India-Eng.jpg", "publishedAt": "2022-06-24T05:37:33Z", "content": ", \r\n : ! \r\n , “ , ”\r\n , “ ”\r\n , “ , , , ”\r\n - \r\nStay updated with the latest news headlines and all the latest Sports news download Indian Express Bengali App.\r\nWeb Title: Englands adil rashid to mis… [+42 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "‘Kareena Kapoor will run away’: Why Aamir Khan is concerned about his Laal Singh Chaddha heroine", "description": "In a new behind-the-scenes video from Laal Singh Chaddha, Kareena Kapoor Khan shares her favourite song from the film.", "url": "https://indianexpress.com/article/entertainment/kareena-kapoor-will-run-away-why-aamir-khan-is-concerned-about-his-laal-singh-chaddha-heroine-7987772/", "urlToImage": "https://images.indianexpress.com/2022/05/kkk.jpg", "publishedAt": "2022-06-24T05:34:29Z", "content": "Ever since the trailer of Aamir Khan and Kareena Kapoor Khan starrer Laal Singh Chaddha dropped, fans are eagerly awaiting to witness the duo’s chemistry on screen. To increase the anticipation, Aami… [+1343 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Australia looks to mend French ties on PM visit after submarine row", "description": "Australia cancelled the multi-billion-dollar order with France's Naval Group and chose an alternative deal with the United States and Britain to buy nuclear submarines, angering France.", "url": "https://indianexpress.com/article/world/australia-mend-french-ties-pm-visit-submarine-row-7987918/", "urlToImage": "https://images.indianexpress.com/2022/06/2021-09-21T091333Z_707357796_RC29UP9DZOLU_RTRMADP_3_AUKUS-SECURITY-AUSTRALIA-PARLIAMENT-1.jpg", "publishedAt": "2022-06-24T05:34:12Z", "content": "Australian Prime Minister Anthony Albanese will visit France next week as his new Labor government looks to repair relations strained last year when Australia scrapped a French submarine deal. Austra… [+1636 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Barcelona make €40 million Robert Lewandowski offer, Bayern could line up Cristiano Ronaldo as replacement: Reports", "description": "The German club has been firm in their stand of the Polish international not leaving, at least until his contract expires in 2023.", "url": "https://indianexpress.com/article/sports/football/barca-to-offer-e35m-with-add-ons-for-lewandowski-bayern-can-sign-ronaldo-for-reinforcements-7987891/", "urlToImage": "https://images.indianexpress.com/2022/06/Lewandowski-and-Ronaldo.jpg", "publishedAt": "2022-06-24T05:29:17Z", "content": "The talks of Football Club Barcelona and Polish striker Robert Lewandowski marrying just get bigger every minute. Reports now suggest that the Spanish club is looking to offer 35m with add-ons for th… [+1763 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "PWD to repair key roads in East, Central Delhi; tenders floated", "description": "Officials said the roads set for revamp include Sameer Bhan Marg, Bhagwan Mahavir Swami Marg, stretches on Avenue Marg, Sekhrita Marg, Sadhbhawana Marg, Ambedkar Marg and Khudiram Bhose Marg, among others.", "url": "https://indianexpress.com/article/cities/delhi/pwd-repair-roads-east-central-delhi-7987932/", "urlToImage": "https://images.indianexpress.com/2022/06/pothole-delhi.jpg", "publishedAt": "2022-06-24T05:22:55Z", "content": "In order to ensure smooth and safe roads for commuters ahead of the monsoon season, the Public Works Department (PWD) is going to repair and strengthen several key arterial roads in East and Central … [+1641 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "George RR Martin confirms Jon Snow spin-off show in development, says Kit Harington brought the idea", "description": "George RR Martin has confirmed that a Jon Snow spin-off is in development at HBO. He mentioned that apart from this, three other shows are being developed from the Game of Thrones universe.", "url": "https://indianexpress.com/article/entertainment/television/george-rr-martin-confirms-jon-snow-spin-off-kit-harington-brought-the-idea-7987859/", "urlToImage": "https://images.indianexpress.com/2022/06/kit-harington.jpeg", "publishedAt": "2022-06-24T05:21:19Z", "content": "A Song of Ice and Fire writer George RR Martin has confirmed that there is a Jon Snow spin-off show in development at HBO, as reported a few days ago by The Hollywood Reporter. Martin shared that the… [+2469 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Should diabetics have jackfruit or kathal?", "description": "Packed with vitamins, trace minerals, and antioxidants, jackfruits are an excellent source of fibre. But, should diabetics consume it?", "url": "https://indianexpress.com/article/lifestyle/health/diabetes-jackfruit-katahal-kathal-benefits-blood-sugar-health-7986574/", "urlToImage": "https://images.indianexpress.com/2022/06/jackfruit1200.jpg", "publishedAt": "2022-06-24T05:20:56Z", "content": "According to the World Health Organization, diabetes — a chronic, metabolic disease — “is a growing challenge in India with an estimated 8.7 per cent diabetic population in the age group of 20 and 70… [+2648 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Paris Olympics: Organisers in fix on where to host shooting at the 2024 Games", "description": "Chateauroux, which is 170 miles from Paris has now been a preferred venue for shooting at 2024 Olympic", "url": "https://indianexpress.com/article/sports/sport-others/paris-olympics-organisers-in-fix-on-where-to-host-shooting-at-the-2024-games-7987948/", "urlToImage": "https://images.indianexpress.com/2017/02/dr-karni-singh-shooting-range1200.jpg", "publishedAt": "2022-06-24T05:19:13Z", "content": "Paris Olympics organisers are in a fix over where to host shooting at the 2024 Games. The organisers have confirmed that shooting will now be moved from Seine-Saint-Denis.Chateauroux, which is 170 mi… [+1299 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "2002 Gujarat riots: SC dismisses Zakia Jafri’s plea challenging SIT clean chit to Modi, others", "description": "Gujarat riots case: Zakia Jafri, widow of former Congress MP Ehsan Jafri, had challenged a clean chit given by the Special Investigation Team (SIT) to then Gujarat chief minister Narendra Modi and several others in the 2002 Gujarat riots.", "url": "https://indianexpress.com/article/india/2002-gujarat-riots-sc-dismisses-zakia-jafri-plea-sit-clean-chit-modi-7987962/", "urlToImage": "https://images.indianexpress.com/2022/06/zakia-jafri-1200-gulberg.jpg", "publishedAt": "2022-06-24T05:17:56Z", "content": "The Supreme Court Friday dismissed a plea filed by Zakia Jafri, widow of former Congress MP Ehsan Jafri, challenging a clean chit given by the Special Investigation Team (SIT) to then Gujarat chief m… [+1941 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "J&K to host G-20 meetings in 2023", "description": "This will be the first major international summit to be held in Jammu and Kashmir after the erstwhile state's special status guaranteed under Article 370 of the Constitution was withdrawn", "url": "https://indianexpress.com/article/india/jammu-and-kashmir-g20-meeting-7987895/", "urlToImage": "https://images.indianexpress.com/2022/06/JK-Art-370.jpg", "publishedAt": "2022-06-24T05:16:20Z", "content": "In a significant development, Jammu and Kashmir will be hosting the 2023 meetings of G-20, an influential grouping that brings together the world’s major economies, with the Union Territory governmen… [+2364 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "UK Conservatives lose two by-elections, dealing blow to PM Johnson", "description": "The Conservatives lost a majority of more than 24,000 votes in Tiverton and Honiton, in a deeply Conservative part of southwest England, defeated by the centrist Liberal Democrats who secured a majority of more than 6,000.", "url": "https://indianexpress.com/article/world/uk-conservatives-lose-two-by-elections-dealing-blow-to-pm-johnson-7987926/", "urlToImage": "https://images.indianexpress.com/2022/06/UK-PM-2.jpg", "publishedAt": "2022-06-24T05:15:08Z", "content": "British Prime Minister Boris Johnson’s Conservative Party was defeated in two parliamentary by-elections on Friday after a historic collapse in support, in a fresh blow for the embattled leader that … [+2894 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi SCERT to conduct a State Achievement Survey this year", "description": "Survey will be conducted in October for students of classes III, V, VIII and X in Delhi government, government-aided and private schools in the city", "url": "https://indianexpress.com/article/cities/delhi/delhi-scert-to-conduct-state-achievement-survey-7987928/", "urlToImage": "https://images.indianexpress.com/2022/06/students.jpeg", "publishedAt": "2022-06-24T05:14:57Z", "content": "The Delhi State Council for Education Research and Training (SCERT) will conduct a State Achievement Survey (SAS) later this year.This achievement survey will be conducted in October for students of … [+901 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gurgaon: After spate of thefts from cash vans, police direct banks, private agencies to step up security", "description": "On April 18, a group of robbers had snatched Rs 96.93 lakh from the employees of a cash collection firm after throwing chilli powder on Sohna Road in Gurgaon.", "url": "https://indianexpress.com/article/cities/delhi/gurgaon-news-robbery-theft-case-cash-vans-police-banks-security-7987921/", "urlToImage": "https://images.indianexpress.com/2022/06/cash-money.jpg", "publishedAt": "2022-06-24T05:14:13Z", "content": "Taking cognisance of recent incidents of robberies and thefts from cash vans, the Gurgaon police on Thursday issued several directives to banks, private security agencies and cash-handling agencies f… [+2502 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Iram Siddique", "title": "Madhya Pradesh railway officer hit by MEMU train while on duty, dies", "description": "The accident took place when Yogendra Singh Batia, who was the area manager for Baikuntpur, was supervising a pre-non-interlocking between tracks.", "url": "https://indianexpress.com/article/cities/bhopal/madhya-pradesh-railway-officer-hit-by-memu-train-dies-7987831/", "urlToImage": "https://images.indianexpress.com/2022/06/Railways-759.jpg", "publishedAt": "2022-06-24T05:13:08Z", "content": "An officer of the Indian Railway Traffic Service (IRTS) died after being hit by a MEMU train at around 7.45 pm Thursday while he was supervising track repair work near Amlai station in Annupur distri… [+1221 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Nobody gave me chance to do action before HIT The First Case, says Rajkummar Rao", "description": "Rajkummar Rao, a trained martial artist, said he had a lot of fun doing action in HIT.", "url": "https://indianexpress.com/article/entertainment/bollywood/nobody-gave-me-chance-to-do-action-before-hit-the-first-case-says-rajkummar-rao-7987786/", "urlToImage": "https://images.indianexpress.com/2022/06/Rajkummar-Rao-1200by667.jpg", "publishedAt": "2022-06-24T05:05:06Z", "content": "Actor Rajkummar Rao on Thursday said he is excited about his upcoming film HIT The First Case, which gave him the opportunity to try his hands on the action genre for the first time. The suspense thr… [+2697 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "EU grants Ukraine candidate status, ‘beginning a long journey together’", "description": "Although it could take Ukraine more than a decade to eventually join the bloc, the decision to officially accept it as a candidate is a symbol of the EU's intention to reach deep into the former Soviet Union.", "url": "https://indianexpress.com/article/world/eu-grants-ukraine-candidate-status-beginning-a-long-journey-together-7987846/", "urlToImage": "https://images.indianexpress.com/2022/06/Ukraine-APPhoto.jpg", "publishedAt": "2022-06-24T05:04:27Z", "content": "European Union leaders on Thursday granted Ukraine the coveted status of official candidate to join their 27-nation club, a bold geopolitical step hailed by Kyiv and the EU itself as a “historic mome… [+3953 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "John Williams, 90, steps away from film, but not music", "description": "The late chapter in John Williams’ career is in some ways a chance to place his mammoth legacy not just in connection with cinema but among the classical legends.", "url": "https://indianexpress.com/article/entertainment/hollywood/john-williams-90-steps-away-from-film-but-not-music-7987838/", "urlToImage": "https://images.indianexpress.com/2022/06/John-Williams-ap-1200by667.jpeg", "publishedAt": "2022-06-24T05:04:02Z", "content": "After more than six decades of making bicycles soar, sending panicked swimmers to the shore and other spellbinding close encounters, John Williams is putting the final notes on what may be his last f… [+8334 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Mihir Mishra", "title": "Explained: Why was there a fuel shortage in India this month?", "description": "Fuel shortages were reported in several cities earlier this month, forcing the government to intervene. What led to the shortages? Why was there a bigger problem in states with more retail outlets by private companies? When will the situation ease?", "url": "https://indianexpress.com/article/explained/india-fuel-shortage-explained-7987850/", "urlToImage": "https://images.indianexpress.com/2022/06/fuel-2.jpg", "publishedAt": "2022-06-24T05:03:30Z", "content": "This month, multiple cities across the country witnessed petrol pumps rationing supplies or getting shut due to non-availability of fuel, leading to concerns about fuel shortages and triggering panic… [+5141 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi: Two held, three minors apprehended for robbing dairy shop owner in Uttam Nagar", "description": "The police had registered a case after the shop owner in Dwarka's Uttam Nagar complained that he was chased by three youths and robbed of Rs 3.7 lakh.", "url": "https://indianexpress.com/article/cities/delhi/two-held-three-minors-apprehended-robbing-dairy-shop-owner-uttam-nagar-7987906/", "urlToImage": "https://images.indianexpress.com/2022/06/uttam-nagar.jpg", "publishedAt": "2022-06-24T05:02:43Z", "content": "Two men were arrested and three juveniles apprehended for allegedly being involved in robbing a dairy shop owner in Dwarka’s Uttam Nagar area on Sunday, the police said, adding that one of the juveni… [+1949 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Hysterical fans howl as they spot Sidharth Malhotra, beg airport security for a photo. Netizens feel actor was ‘clearly not comfortable’", "description": "Sidharth Malhotra patiently posed for selfies with overwhelmed fans as they could not stop howling after spotting the actor at the airport.", "url": "https://indianexpress.com/article/entertainment/bollywood/hysterical-fans-howl-as-they-spot-sidharth-malhotra-at-airport-watch-video-7987804/", "urlToImage": "https://images.indianexpress.com/2022/06/SidharthMalhotra-1200.jpg", "publishedAt": "2022-06-24T05:00:38Z", "content": "Film actors often encounter weird fans and one such incident with actor Sidharth Malhotra has been doing the rounds of the internet. In what looks like an older video of the Student of the Year actor… [+1607 chars]"}]}