{"status": "ok", "totalResults": 481, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pune: Sassoon hospital employee booked for issuing fake disability certificate", "description": "The police said that the accused worked as a data operator at a hospital department which issues disability certificates after collecting essential documents from applicants.", "url": "https://indianexpress.com/article/cities/pune/pune-sassoon-hospital-employee-booked-for-issuing-fake-disability-certificate-7948549/", "urlToImage": "https://images.indianexpress.com/2022/04/Sassoon-hospital.jpg", "publishedAt": "2022-06-02T04:51:09Z", "content": "The Pune police on Monday booked a Sassoon hospital employee for allegedly issuing a fake disability certificate to a person, based on a complaint from the hospital authorities."}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "UP: Power discom officer suspended for placing Laden’s pic in office", "description": "Ravindra Prakash Gautam, sub-divisional officer (SDO) with the Dakshinanchal Vidyut Vitran Nigam Ltd (DVVNL), placed a picture of Laden in his office, with a note below it that read \"Respected Osama bin Laden, world's best junior engineer”, the officials said.", "url": "https://indianexpress.com/article/cities/lucknow/up-power-discom-officer-suspended-for-placing-ladens-pic-in-office-7948501/", "urlToImage": "https://images.indianexpress.com/2022/06/Bin-Laden.jpg", "publishedAt": "2022-06-02T04:42:16Z", "content": "An officer of a state-run power distribution company was suspended on Wednesday over having a picture of Osama bin Laden in his office describing the slain Al-Qaeda founder as “world’s best junior en… [+867 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Overflowing sewers draw Chandigarh Municipal Commissioner’s ire; disconnect water supply if needed, she says", "description": "The Commissioner also gave directions on several issues, such as garbage dumping in Sector 45, proper garbage collections from hotels and dhabas, and parking issues near Sampark Building.", "url": "https://indianexpress.com/article/cities/chandigarh/overflowing-sewers-draw-chandigarh-commissioners-ire-disconnect-water-supply-if-needed-she-says-7948495/", "urlToImage": "https://images.indianexpress.com/2022/06/Chandigarh-Commissioner-Anindita-Mitra.jpg", "publishedAt": "2022-06-02T04:41:47Z", "content": "Chandigarh Municipal Commissioner Anindita Mitra inspected sectors 45 and 46 to take stock of the ongoing development works and address residents’ grievances, here on Wednesday. The on foot visit beg… [+1940 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Sensex tanks 246 points in early trade amid weak Asian markets", "description": "The 30-share BSE Sensex was trading 246.06 points lower at 55,135.11. The broader NSE Nifty declined 79.7 points to 16,443.05.", "url": "https://indianexpress.com/article/business/market/share-market-stocks-equity-bse-sensex-nse-nifty-crude-oil-price-rupee-global-cues-june-2-7948507/", "urlToImage": "https://images.indianexpress.com/2021/11/bse-bombay-stock-exchange-reuters-1200.jpeg", "publishedAt": "2022-06-02T04:35:27Z", "content": "Equity benchmarks continued to fall for the third day running on Thursday, with the Sensex tanking 246 points in early trade, amid weak Asian markets.The 30-share BSE Sensex was trading 246.06 points… [+1069 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Centre hands over 10 stolen antiquities retrieved from US, Australia to Tamil Nadu govt", "description": "The collection of antiquities handed over to the Tamil Nadu government included figurines named Dwarapala, Nataraja, Kankalamurti Kadayam, Nadikeswara Kadayam, Four-Armed Vishnu, Sri Devi, Siva and Parvati, Standing Child Sambandar and Child Sambandar.", "url": "https://indianexpress.com/article/cities/chennai/centre-hands-over-10-stolen-antiquities-retrieved-from-us-australia-to-tamil-nadu-govt-7948519/", "urlToImage": "https://images.indianexpress.com/2022/06/idols.jpg", "publishedAt": "2022-06-02T04:35:11Z", "content": "The Centre will take initiatives to bring back antiquities from abroad and hand those over to the states from where these articles were stolen, Culture and Tourism Minister G Kishan Reddy said at a f… [+2839 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Cong turned cremation into political gimmick: AAP MLA", "description": "AAP MLA Gurpreet Singh Banawali also reached Dayanand Medical College and Hospital (DMCH), Ludhiana, to meet the two friends of Moosewala who were also injured in the incident. “The government will bear all expenses of the treatment of the both injured people…", "url": "https://indianexpress.com/article/cities/chandigarh/cong-turned-cremation-into-political-gimmick-aap-mla-7948462/", "urlToImage": "https://images.indianexpress.com/2022/06/hospital123.jpg", "publishedAt": "2022-06-02T04:33:53Z", "content": "A day after singer-turned-politician Shubhdeep Singh alias Sidhu Moosewala was cremated at Moosa village in Mansa and the ruling AAP government led by CM Bhagwant Mann faced flak for not attending hi… [+2570 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Google Meet and Duo will soon be one app for video calling", "description": "Google’s Duo app will soon merge into the main Google Meet video meeting app. This will mean that Google will have one video calling solution for both personal and enterprise users.", "url": "https://indianexpress.com/article/technology/social/google-meet-and-duo-will-soon-be-one-app-for-video-calling-7948505/", "urlToImage": "https://images.indianexpress.com/2022/06/GoogleMeet_NEW1.jpg", "publishedAt": "2022-06-02T04:31:18Z", "content": "Googles Duo app will soon merge into the Google Meet, the company announced in a blog post. Reports had indicated this would happen back in 2020, and it is now official. Google Meet is the companys a… [+2821 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "BJP to intensify protest against water shortage in Delhi", "description": "BJP West Delhi MP Parvesh Sahib Singh Verma hit out at Delhi Chief Minister Arvind Kejriwal saying that the Delhi government has a Rs 75,000 crore budget but Delhiites are still crying for water.", "url": "https://indianexpress.com/article/cities/delhi/delhi-water-shortage-crisis-bjp-protests-aap-govt-arvind-kejriwal-7948512/", "urlToImage": "https://images.indianexpress.com/2022/06/water-delhi-protests.jpg", "publishedAt": "2022-06-02T04:30:53Z", "content": "The Delhi unit of the BJP is planning to intensify its campaign against the water shortage in Delhi and has hit out at the Aam Aadmi Party (AAP) government for failing to address the issue.BJP West D… [+1296 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Fitness alert: Ankita Konwar performs one of her ‘favourite asanas’; shares benefits", "description": "Sharing the many benefits of the asana, she wrote, \"It’s a great stretch for groins, spine, waist and shoulders\"", "url": "https://indianexpress.com/article/lifestyle/fitness/ankita-konwar-parsvakonasana-method-benefits-yoga-asana-7915327/", "urlToImage": "https://images.indianexpress.com/2022/05/ankita-konwar-1200-1.jpg", "publishedAt": "2022-06-02T04:30:36Z", "content": "There are many ways you can work on your fitness — from striking a perfect balance in your diet and lifestyle to keeping your body active and agile. And, what better than yoga to maintain overall wel… [+1969 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gurgaon: Man held for kidnapping woman at gun point outside college", "description": "When the accused saw the police chasing him, he dropped the victim at the Rampura flyover and escaped.", "url": "https://indianexpress.com/article/cities/delhi/gurgaon-man-held-kidnapping-woman-at-gun-point-7948524/", "urlToImage": "https://images.indianexpress.com/2022/06/arrest.jpg", "publishedAt": "2022-06-02T04:29:28Z", "content": "A 30-year-old man was arrested for allegedly kidnapping a woman college student at gunpoint in Gurgaon, said the police on Wednesday. According to the police, the incident took place around 2.45 pm o… [+1641 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "While you were asleep: Ruud stops Rune to reach French Open last four, Petrakov dedicates Ukraine win to those fighting Russia and Argentina outclass Italy to win ‘Finalissima’", "description": "Argentina marked the revival of the Cup of Champions in style as an inspired Lionel Messi helped them outclass Italy 3-0 in a heavyweight clash billed as the 'Finalissima' at a raucous Wembley Stadium on Wednesday.", "url": "https://indianexpress.com/article/sports/while-you-were-asleep-ruud-stops-rune-to-reach-french-open-last-four-petrakov-dedicates-ukraine-win-to-those-fighting-russia-and-argentina-outclass-italy-to-win-finalissima-7948451/", "urlToImage": "https://images.indianexpress.com/2022/06/Untitled-design-14.jpg", "publishedAt": "2022-06-02T04:27:09Z", "content": "Eighth seed Casper Ruud battled past teenager Holger Rune 6-1 4-6 7-6(2) 6-3 on Wednesday to reach the French Open semi-finals and become the first Norwegian to reach this stage in any Grand Slam. He… [+3825 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Pune Infra Watch: PMC to use solar power for reducing expenditure on power supply for civic facilities", "description": "The Pune Municipal Corporation has to pay around Rs 300 crore every year to meet the power supply needs of civic facilities. It has made a budgetary provision of Rs 293 crore for paying power charges in 2022-23.", "url": "https://indianexpress.com/article/cities/pune/solar-power-electricity-pune-power-supply-pmc-renewable-power-maharashtra-7948496/", "urlToImage": "https://images.indianexpress.com/2022/06/solar-power.jpg", "publishedAt": "2022-06-02T04:11:33Z", "content": "Going for an open-access power purchase to reduce the increasing expenditure on electricity for civic facilities, the Pune Municipal Corporation (PMC) has decided to purchase renewable power at a rat… [+3167 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gurgaon: Two labourers killed after soil caves in at under-construction plot", "description": "A police officer, requesting anonymity, said, “The basement had been dug over 10 feet below the ground level. After digging, the two labourers were putting pillars and filling the foundation when a mound of soil collapsed on them and they were trapped underne…", "url": "https://indianexpress.com/article/cities/delhi/gurgaon-two-labourers-killed-after-soil-caves-in-at-under-construction-plot-7948500/", "urlToImage": "https://images.indianexpress.com/2022/06/express-photo-13-2.jpeg", "publishedAt": "2022-06-02T04:07:02Z", "content": "Two labourers were killed after soil at an under-construction plot in Gurgaons Sector 56 caved in on Wednesday, the police said Thursday.They said the accident took place around 4 pm on Wednesday whe… [+924 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "‘Small soldier in nation’s service under PM Modi’: Hardik Patel makes entry into BJP official", "description": "Ahead of the 2019 Lok Sabha elections, Hardik joined the Congress in the presence of Rahul Gandhi. However, on May 18, he resigned from the Congress, alleging that it was the “most casteist” and “anti-Gujarati” party.", "url": "https://indianexpress.com/article/cities/ahmedabad/hardik-patel-joins-bjp-prime-minister-narendra-modi-7948492/", "urlToImage": "https://images.indianexpress.com/2022/06/Hardik-Patel.jpg", "publishedAt": "2022-06-02T04:04:18Z", "content": "With Gujarat headed to the Assembly elections later this year, Patidar leader Hardik Patel made his joining the BJP official on Thursday morning via a tweet.With the feelings of national interest, st… [+2408 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Akshay Kumar says he and Twinkle Khanna ‘don’t interfere’ in each other’s lives: ‘We think in two opposite directions’", "description": "Akshay Kumar has opened up about his marriage with Twinkle Khanna. He shared how the two \"don't interfere in each other's lives.\" Read more", "url": "https://indianexpress.com/article/entertainment/bollywood/akshay-kumar-on-marriage-with-twinkle-khanna-7948433/", "urlToImage": "https://images.indianexpress.com/2022/05/Akshay-Kumar.jpeg", "publishedAt": "2022-06-02T03:58:56Z", "content": "Actor Akshay Kumar in a recent interview opened up about the secret of his successful marriage with wife, actor-turned-author Twinkle Khanna. Akshay spoke about how he and Twinkle navigate through th… [+1706 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "28 year old biker mowed down by CTU bus, dies", "description": "The driver, Baldev Singh, allegedly changed into a wrong lane and hit Ashu, the motorcyclist from the right side", "url": "https://indianexpress.com/article/cities/chandigarh/28-year-old-biker-mowed-down-by-ctu-bus-dies-7948482/", "urlToImage": "https://images.indianexpress.com/2022/06/Representational-Image-Chandigarh-Road-Accident.jpg", "publishedAt": "2022-06-02T03:58:48Z", "content": "A 28-year-old motorcyclist was killed after being hit by a speeding Chandigarh Transport Undertaking (CTU) bus in Sector 47, on Wednesday.The victim was identified Ashu, a resident of Ram Darbar area… [+500 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Three soldiers injured in blast in J-K’s Shopian", "description": "The nature of the blast is being investigated, Inspector General of Police, Kashmir, Vijay Kumar said.", "url": "https://indianexpress.com/article/cities/jammu/three-soldiers-injured-in-blast-in-j-ks-shopian-7948447/", "urlToImage": "https://images.indianexpress.com/2022/04/jammu-police7.jpg", "publishedAt": "2022-06-02T03:58:20Z", "content": "Three soldiers were injured in a blast inside their private hired vehicle in Shopian district of Jammu and Kashmir on Thursday, police said."}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Neena Gupta on being trolled for meeting Gulzar in shorts: ‘Unko batana chahungi…’", "description": "Neena Gupta had gone to Gulzar's to gift him a copy of her autobiography, titled Sach Kahun Toh. She was trolled for her choice of attire.", "url": "https://indianexpress.com/article/entertainment/bollywood/neena-gupta-on-those-who-trolled-her-for-meeting-gulzar-in-shorts-7948467/", "urlToImage": "https://images.indianexpress.com/2022/06/canva-photo-editor-2-3.jpg", "publishedAt": "2022-06-02T03:55:51Z", "content": "Actor Neena Gupta, who can currently be seen in the second season of the Amazon Prime Video series Panchayat, has responded to trolls who criticised her choice of wearing shorts when she met veteran … [+131 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Parthasarathi Biswas", "title": "Pimpri Chinchwad SME association wants action against ‘unauthorised’ Mathadi workers", "description": "Pune news: Industries have often complained of harassment by unauthorised loaders who obstruct work and try to extract money from businesses.", "url": "https://indianexpress.com/article/cities/pune/pimpri-chinchwad-sme-unauthorised-mathadi-workers-7948474/", "urlToImage": "https://images.indianexpress.com/2022/06/mathadiworkers-759.jpg", "publishedAt": "2022-06-02T03:47:54Z", "content": "Small and medium scale (SME) enterprises in Pimpri Chinchwad have demanded action against unauthorised Mathadi workers or head-loaders who they say have created an atmosphere of fear in the industria… [+2087 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "KK heard saying ‘Mar jaaon yahin pe’ in a video from Kolkata concert. Fans express dismay", "description": "KK died of a suspected heart attack on Tuesday. He is survived by his wife Jyothy and their two children, a son and a daughter.", "url": "https://indianexpress.com/article/entertainment/music/kk-heard-saying-mar-jaaon-yahin-pe-in-a-video-from-kolkata-concert-7948434/", "urlToImage": "https://images.indianexpress.com/2022/06/kk1200-3.jpg", "publishedAt": "2022-06-02T03:41:18Z", "content": "Videos of the late singer KK in Kolkata, at what would be his last-ever concert, have been going viral. One clip in particular seems to have caught the internet’s attention. In it, KK asks the audien… [+1085 chars]"}]}