{"status": "ok", "totalResults": 416, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Balbir Punj", "title": "Balbir Punj writes: Old establishment in the dock", "description": "It is not in office, but is still in power. That’s the real problem.", "url": "https://indianexpress.com/article/opinion/columns/balbir-punj-writes-old-establishment-in-the-dock-nupur-sharma-naveen-jindal-modi-media-hate-speech-7997149/", "urlToImage": "https://images.indianexpress.com/2022/06/freedom-of-speech-indian-express.jpg", "publishedAt": "2022-06-28T22:30:40Z", "content": "The article Media In The Dock by John Brittas (IE, June 9) is in part laced with innuendo and partly a veiled account of his exasperation with the common peoples temerity to think for themselves and … [+4683 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Mohan Kumar", "title": "Not yesterday’s club", "description": "G7 has declined but is still powerful. India’s participation in the meeting as an observer serves to advance its foreign and security policy.", "url": "https://indianexpress.com/article/opinion/columns/g7-leaders-meet-germany-russia-ukraine-war-coronavirus-climate-change-7997117/", "urlToImage": "https://images.indianexpress.com/2022/06/Modi-g7-1-1.jpg", "publishedAt": "2022-06-28T22:30:14Z", "content": "The meeting of G7 leaders that concluded in Bavaria in Germany on Monday was an important one since it took place against the backdrop of a triple crisis: The war in Ukraine, the challenge of post-pa… [+5836 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Recruitment process for constables tweaked, physical exam before written test", "description": "Earlier, a candidate had to first clear the written exams before taking physical exams to qualify for police postings.", "url": "https://indianexpress.com/article/cities/mumbai/recruitment-process-for-constables-tweaked-physical-exam-before-written-test-7997280/", "urlToImage": "https://images.indianexpress.com/2022/06/gujarat-police-1.jpg", "publishedAt": "2022-06-28T22:22:32Z", "content": "MAHARASHTRA HOME Minister Dilip Walse Patil on Tuesday said the recruitment process for 7,231 police constables in the state will begin with physical examinations being conducted prior to written exa… [+863 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi: L-G replies to Manish Sisodia’s letter on hospitals probe, says ‘misleading public’", "description": "Saxena had granted ACB permission to investigate the case, a complaint for which was filed by BJP MP Manoj Tiwari. Sisodia has called the complaint frivolous, and had said the L-G did not have authority to give sanction for the investigation. “You are bulldoz…", "url": "https://indianexpress.com/article/cities/delhi/delhi-l-g-replies-to-manish-sisodias-letter-on-hospitals-probe-says-misleading-public-7997277/", "urlToImage": "https://images.indianexpress.com/2022/06/lg-delhi-1.jpg", "publishedAt": "2022-06-28T22:17:47Z", "content": "Delhi Lieutenant Governor V K Saxena Tuesday said that Deputy Chief Minister Manish Sisodia was trying to mislead the public regarding the enquiry initiated against Public Works Department (PWD) offi… [+2037 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Elgaar Parishad case: Court rejects default bail pleas of 5 accused", "description": "In 2020, the case was transferred to the National Investigation Agency (NIA) and the case moved to a special court in Mumbai, but their plea remained pending. The special court decided on it on Tuesday.", "url": "https://indianexpress.com/article/cities/mumbai/elgaar-parishad-case-court-bail-accused-jail-7997273/", "urlToImage": "https://images.indianexpress.com/2022/06/bhima-koregaon.jpg", "publishedAt": "2022-06-28T22:16:33Z", "content": "A SPECIAL court on Tuesday rejected the default bail applications of five accused in the Elgaar Parishad case Sudhir Dhawale, Rona Wilson, Surendra Gadling, Shoma Sen and Mahesh Raut who have been in… [+1707 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Kanpur violence: 3 food outlets of accused sealed over quality test", "description": "The owner of Baba Biryani, Mukhtar Baba, is accused of financing Hayat Zafar Hashmi, the alleged “main conspirator” behind the June 3 violence in Kanpur’s Beckonganj area over remarks against Prophet Muhammad by a former BJP spokesperson.", "url": "https://indianexpress.com/article/cities/lucknow/kanpur-violence-3-food-outlets-of-accused-sealed-over-quality-test-7997176/", "urlToImage": "https://images.indianexpress.com/2022/06/kanpur-violence-1-1.jpg", "publishedAt": "2022-06-28T22:11:02Z", "content": "Three outlets of food chain Baba Biryani were sealed by the administration in Kanpur city stating that samples collected from them allegedly failed the quality test in an Agra laboratory.The owner of… [+1347 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "With 3,482 new Covid cases, Maharashtra sees 47% surge in 24 hrs", "description": "With the upward spiral of Covid cases, the total active cases in Maharashtra stood at 25,481 as of June 28. Out of the five deaths reported in the state on the day, two were from Mumbai.", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-covid-cases-new-maharashtra-coronaviurs-deaths-7997264/", "urlToImage": "https://images.indianexpress.com/2022/06/covid-vaccine-2.jpg", "publishedAt": "2022-06-28T22:10:10Z", "content": "A DAY after reporting 2,369 new Covid-19 cases, the state recorded 3,482 cases on Tuesday with a surge of 47 per cent in the last 24 hours. Also, for the third consecutive day, five Covid fatalities … [+1128 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "States asked to step up Covid vigil as season of yatras approaches", "description": "To prepare for the upcoming yatras, states have been asked to publicise that all individuals planning to participate in these events should be symptom-free and preferably fully vaccinated.", "url": "https://indianexpress.com/article/india/covid-news-cases-yatra-vaccination-testing-7997262/", "urlToImage": "https://images.indianexpress.com/2022/06/covid-19.jpeg", "publishedAt": "2022-06-28T22:03:42Z", "content": "Union Health Secretary Rajesh Bhushan has asked states to step up vigil and prepare for mass gatherings or yatras in the coming months in order to ensure that participants travelling within the state… [+2259 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Harikishan Sharma", "title": "Jump in demand for NREGS: 2.6 cr families covered in May", "description": "The data, obtained from the NREGA portal, shows that 2.61 crore households worked under the scheme in May 2022, which is 39 lakh – or 17.39 per cent – higher than 2.22 crore in the corresponding month of last year.", "url": "https://indianexpress.com/article/india/jump-in-demand-for-nregs-2-6-cr-families-covered-in-may-7997175/", "urlToImage": "https://images.indianexpress.com/2022/06/NREGS.jpg", "publishedAt": "2022-06-28T22:03:08Z", "content": "AFTER A dip in April, the demand for work under Mahatma Gandhi National Rural Employment Guarantee Scheme (MG-NREGS) has again seen a rise. According to an analysis of official data, 39 lakh more fam… [+2750 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi confidential: Mounting pressure", "description": "RLD chief Jayant Chaudhary, a Rajya Sabha member, addressed the first such gathering in Shamli on Tuesday, while 11 more are scheduled to be held across as many districts over the next fortnight.", "url": "https://indianexpress.com/article/delhi-confidential/delhi-confidential-uttar-pradesh-agnipath-protests-rld-uttarakhand-high-court-single-use-plastic-7997260/", "urlToImage": "https://images.indianexpress.com/2022/06/cats-41.jpg", "publishedAt": "2022-06-28T21:54:48Z", "content": "WESTERN UTTAR Pradesh recently saw widespread protests against the Centre’s new soldier recruitment scheme Agnipath. Sensing discontent over the scheme, the Rashtriya Lok Dal (RLD) has launched a ser… [+1681 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Divya A", "title": "Gulabi meenakari brooch to ittar bottles: PM Modi’s gifts to G7 leaders a slice of Indian crafts", "description": "Prime Minister Narendra Modi had taken along a plethora of such artistic gifts for each of the G7 leaders.", "url": "https://indianexpress.com/article/india/g7-summit-germany-pm-modi-joe-biden-gift-indian-crafts-7997256/", "urlToImage": "https://images.indianexpress.com/2022/06/Ram-Darbar.jpg", "publishedAt": "2022-06-28T21:48:20Z", "content": "During the G7 meet in Germany, Prime Minister Narendra Modi gifted a gulabi meenakari brooch and cufflink set to US President Joe Biden. The cufflinks were specially prepared for the President with a… [+2462 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Liz Mathew", "title": "BJP: Setalvad, Zubair arrests’ critics part of poisonous ecosystem", "description": "", "url": "https://indianexpress.com/article/india/teesta-setalvad-mohammed-zubair-alt-news-arrest-bjp-opposition-7997254/", "urlToImage": "https://images.indianexpress.com/2022/06/Setalvad-Zubair.jpg", "publishedAt": "2022-06-28T21:39:57Z", "content": "WITH OPPOSITION leaders criticising the BJP over the arrests in separate cases of activist Teesta Setalvad and AltNews co-founder Mohammed Zubair, the ruling party hit back on Tuesday and accused the… [+2577 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Vallabh Ozarkar", "title": "Maharashtra political crisis: Amid CM Uddhav’s emotional call to rebels, Sena flip flops on Shinde camp", "description": "Addressing the rebels, Thackeray asked them to come and sit in front of him. \"... Don't fall prey to anyone's missteps and false assurances.\"", "url": "https://indianexpress.com/article/cities/mumbai/maharashtra-crisis-mva-eknath-shinde-rebel-mla-uddhav-thackeray-shiv-sena-7997252/", "urlToImage": "https://images.indianexpress.com/2022/06/eknath-3.jpg", "publishedAt": "2022-06-28T21:23:46Z", "content": "Maharashtra Chief Minister Uddhav Thackeray on Tuesday made an emotional appeal to rebel MLAs of Shiv Sena, who are camping in Guwahati, to return to the party and have a dialogue with him to sort ou… [+3231 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Arnav Chandrasekhar", "title": "Changing Demographic: At Delhi’s libraries, leisure reading gives way to competitive exam prep", "description": "Civil Services aspirant Sunil says it is easy to study in a quiet library environment. “It’s also very useful for me when I need new reference material,” he adds.", "url": "https://indianexpress.com/article/cities/delhi/changing-demographic-at-delhis-libraries-leisure-reading-gives-way-to-competitive-exam-prep-7997250/", "urlToImage": "https://images.indianexpress.com/2022/06/library.jpg", "publishedAt": "2022-06-28T21:12:53Z", "content": "On a sunny weekday afternoon, the Dyal Singh public library in Central Delhi looked oddly deserted from the outside, but a glimpse of the rooms inside proved otherwise. The tables were lined with rea… [+2977 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi: Day after Zubair arrest, police allege Rs 50 lakh transactions in account, counsel says false", "description": "Zubair’s counsel also said the organisation receives money through open-source crowdfunding. “Everything is in the public domain. The police are making false allegations,” said Kawalpreet Kaur.", "url": "https://indianexpress.com/article/cities/delhi/mohammed-zubair-arrest-alt-news-website-delhi-police-7997248/", "urlToImage": "https://images.indianexpress.com/2022/06/zubair-3.jpg", "publishedAt": "2022-06-28T21:05:09Z", "content": "A day after arresting Mohammed Zubair, co-founder of fact-checking website AltNews, over a 2018 tweet, officers at the Delhi Polices Cyber Crime Unit say they plan to look into his bank transactions … [+2123 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pavneet Singh Chadha", "title": "‘Deemed illegal’: Homebuyers panic as tower at Gurgaon’s M3M project is halted", "description": "The project M3M Merlin was announced in 2011 and the brochure mentioned that the project area would be 13.344 acres with 10 towers to be constructed with world-class amenities.", "url": "https://indianexpress.com/article/cities/delhi/homebuyers-panic-as-tower-at-gurgaons-m3m-project-is-halted-housing-real-estate-7997244/", "urlToImage": "https://images.indianexpress.com/2022/06/m3m-gurgaon.jpg", "publishedAt": "2022-06-28T20:54:58Z", "content": "Days after the National Consumer Disputes Redressal Commission (NCDRC) ordered real estate developer M3M to halt construction of an eleventh tower in its residential project M3M Merlin in Gurgaons se… [+3261 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aanchal Magazine", "title": "Pre-packaged food under GST, 12% tax on hotels with tariff up to Rs 1,000", "description": "According to sources, the GST Council has also approved compliance measures for high-risk taxpayers including mandatory biometric authentication, inclusion of electricity bill data, real-time validation of all bank accounts against a particular PAN and geo-ta…", "url": "https://indianexpress.com/article/cities/chandigarh/pre-packaged-food-under-gst-12-tax-on-hotels-with-tariff-up-to-rs-1000-7997241/", "urlToImage": "https://images.indianexpress.com/2022/06/packaged.jpg", "publishedAt": "2022-06-28T20:44:54Z", "content": "BRINGING pre-packaged and labelled food items such as wheat flour, puffed rice, curd/ lassi/ buttermilk and paneer under the GST net, withdrawing exemption for hotels with rent below Rs 1,000 a day a… [+3735 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Coomi Kapoor", "title": "Pallonji Mistry: ‘Phantom of Bombay House’, looked beyond India & construction", "description": "In the early 1970s, when India was still a closed economy, Pallonji looked overseas to expand. He built the ceremonial palace in Muscat for the Sultan of Oman and later executed many large projects in Abu Dhabi, Qatar and Dubai.", "url": "https://indianexpress.com/article/india/pallonji-mistry-shapoor-cyrus-construction-real-estate-shapoorji-7997234/", "urlToImage": "https://images.indianexpress.com/2022/06/mistry-pallonji.jpg", "publishedAt": "2022-06-28T20:35:32Z", "content": "THE LAST years of construction and real estate magnate, Pallonji Mistry, 93, were indeed unfortunate. Ill health rendered him incommunicado, and his sons, Shapoor and Cyrus, who rashly dared to take … [+4299 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Nadal overcomes third set wobble to reach second round", "description": "Nadal won the first set after uncharacteristically coming into the net and forcing Cerundolo to hit a forehand wide. A little skip and a fist pump and the Spaniard was on his way.", "url": "https://indianexpress.com/article/sports/football/nadal-overcomes-third-set-wobble-to-reach-second-round-7997218/", "urlToImage": "https://images.indianexpress.com/2022/06/Nadal-8.jpg", "publishedAt": "2022-06-28T20:21:21Z", "content": "Rafael Nadal made a stuttering but rousing return to the grass on Tuesday, beating 41st-ranked Argentine Francisco Cerundolo 6-4 6-3 3-6 6-4 in Wimbledon’s first round to begin his campaign for a thi… [+2083 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rupsa Chakraborty, Jayprakash S Naidu", "title": "Mumbai building collapse: A worker loses 3 brothers, an entire family wiped out", "description": "Of the 10 men sleeping in the room, seven died and only four, including Majhi, survived the collapse.", "url": "https://indianexpress.com/article/cities/mumbai/a-worker-loses-3-brothers-an-entire-family-wiped-out-7997222/", "urlToImage": "https://images.indianexpress.com/2022/06/mumbai-7.jpg", "publishedAt": "2022-06-28T20:20:37Z", "content": "When the four-storey building in Kurla East collapsed partially on Monday night, two flats on each floor remained intact while the other two flats on the same floor collapsed, leading to the deaths o… [+4590 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Court rejects Indrani’s plea to cross-examine Bora’s fiance herself", "description": "Indrani had sought permission to cross-examine Rahul herself. The court said that since Indrani has an advocate-on-record representing her, she cannot herself cross-examine a witness.", "url": "https://indianexpress.com/article/cities/mumbai/indrani-mukerjea-sheena-bora-murder-accused-rahul-7997211/", "urlToImage": "https://images.indianexpress.com/2022/06/Indrani.jpg", "publishedAt": "2022-06-28T20:13:37Z", "content": "A special court on Tuesday rejected an application filed by former media executive Indrani Mukerjea — who is facing trial for the alleged murder of her daughter Sheena Bora — seeking permission to he… [+1036 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Rupee hits record low on capital outflows", "description": "The domestic currency nosedived to a fresh low of 78.84 during the day as against the previous day's close of 78.34.", "url": "https://indianexpress.com/article/business/economy/rupee-hits-record-low-on-capital-outflows-7997215/", "urlToImage": "https://images.indianexpress.com/2022/06/money-3-3.jpg", "publishedAt": "2022-06-28T20:09:10Z", "content": "The rupee plunged to a fresh intra-day low of 78.84 against the US dollar before closing at a record low of 78.77 as capital outflows and global risk aversion kept the investors on their toes even as… [+1698 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "5G captive networks: 10-year renewable licence, no permit fee", "description": "The norms for captive non-public networks call for enterprises wanting to obtain spectrum directly from the government to take a 10-year renewable licence, for which the government won't charge any licence fee.", "url": "https://indianexpress.com/article/technology/5g-captive-networks-10-year-renewable-licence-no-permit-fee-7997213/", "urlToImage": "https://images.indianexpress.com/2022/06/5g-spectrum-1-1-1.jpg", "publishedAt": "2022-06-28T20:05:09Z", "content": "The Department of Telecommunications (DoT) has issued a set of guidelines for rollout of captive private 5G networks, alongside fresh guidelines to facilitate spectrum leasing for the first time in I… [+2142 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Devendra Pandey", "title": "Uttarakhand’s secretary named in FIR after cricketer complains of threats", "description": "According to the FIR registered June 20, complainant Virendra Sethi has alleged that his son was given death threats.", "url": "https://indianexpress.com/article/sports/cricket/uttarakhands-secretary-named-in-fir-after-cricketer-complains-of-threats-7997210/", "urlToImage": "https://images.indianexpress.com/2022/06/bat-and-ball-1200.jpg", "publishedAt": "2022-06-28T19:59:07Z", "content": "Cricket Association of Uttarakhand (CAU) secretary Mahim Verma and six others from the state cricket unit have been named in an FIR following a complaint filed by the father of former Under-19 cricke… [+3259 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gujarat: Sanghavi inspects Rath Yatra route", "description": "Lakhs of devotees will walk 18 kilometres along the route of Lord Jagannath from Jamalpur Darwaza to Saraspur to the \r\nLord Jagannath temple.", "url": "https://indianexpress.com/article/cities/ahmedabad/sanghavi-inspects-rath-yatra-route-7997207/", "urlToImage": "https://images.indianexpress.com/2022/06/police-yatra.jpg", "publishedAt": "2022-06-28T19:55:28Z", "content": "Gujarat Home Minister Harsh Sanghavi conducted an inspection of the Rath yatra route along with senior police officials, priests, and local Member of Legislative Assemblys (MLAs), on Tuesday morning,… [+2794 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mumbai police chief holds meet with leaders of Sena & BJP", "description": "Those who attended the meeting included BJP MLAs Mihir Kotecha, Parag Alavani and party corporator Atul Shah, among others. The Shiv Sena was represented by some of the party's corporators.", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-police-chief-holds-meet-with-leaders-of-sena-bjp-7997205/", "urlToImage": "https://images.indianexpress.com/2022/06/Sanjay-Pandey-1-1.jpg", "publishedAt": "2022-06-28T19:54:05Z", "content": "MUMBAI POLICE Commissioner Sanjay Pandey on Tuesday called legislators from the Shiv Sena and BJP to his office in order to discuss the law and order situation in the city in light of the current pol… [+1328 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Co-op banks will be allowed to use DBT for govt schemes: Amit Shah - The Indian Express", "description": "Speaking in Gujarati, Amit Shah also praised Kheti Bank for its financial performance. He said the bank, set up in 1951, currently has more than 3 lakh farmers as its members.", "url": "https://indianexpress.com/article/cities/ahmedabad/co-op-banks-will-be-allowed-to-use-dbt-for-govt-schemes-amit-shah-7997203/", "urlToImage": "https://images.indianexpress.com/2022/06/amit-shah-6.jpg", "publishedAt": "2022-06-28T19:49:53Z", "content": "The Central government will soon permit cooperative banks to implement government schemes using Direct Benefit Transfer (DBT), said Union Minister for Co-operatives Amit Shah Tuesday.Currently, 52 mi… [+1446 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sriram Veera", "title": "Ireland give mighty scare to India but lose after winning hearts", "description": "Deepak Hooda became the fourth Indian to hit a T20 ton and along with Samson powered India to 225 but Ireland refused to fade away. Stirling walloped, Balbirnie smashed, and Dockrell nearly dragged them home before Umran held his nerve for a final-over thrill…", "url": "https://indianexpress.com/article/sports/cricket/ireland-give-mighty-scare-to-india-but-lose-after-winning-hearts-7997202/", "urlToImage": "https://images.indianexpress.com/2022/06/IND-IRE-3.jpg", "publishedAt": "2022-06-28T19:47:34Z", "content": "It came to 17 runs from the final over and the choice in front of Hardik Pandya was to either bowl himself, give Axar Patel a go, or have the young Umran Malik. Unfortunately, or so it seemed initial… [+8080 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "ED arrests Pune builder Avinash Bhosale in Yes Bank-DHFL case", "description": "Pune-based builder Avinash Bhosale was produced before a special court and sent to ED's custody till July 5. The central agency had on Monday taken a production warrant for Bhosale from a CBI court as he was earlier arrested in a similar offence by the agency.", "url": "https://indianexpress.com/article/cities/mumbai/ed-arrests-pune-builder-in-yes-bank-dhfl-case-7997198/", "urlToImage": "https://images.indianexpress.com/2022/06/Avinash-Bhosale-2.jpg", "publishedAt": "2022-06-28T19:36:43Z", "content": "Pune-based builder Avinash Bhosale was arrested by the Enforcement Directorate (ED) on Tuesday in the Yes Bank-DHFL  case.Bhosale was produced before a special court and sent to ED’s custody till Jul… [+1549 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shamik Chakrabarty", "title": "England keen to keep attacking", "description": "Under McCullum & Stokes, team prepared to stay on offensive with bat & ball regardless of match situation.", "url": "https://indianexpress.com/article/sports/cricket/england-keen-to-keep-attacking-7997179/", "urlToImage": "https://images.indianexpress.com/2022/06/ENG-2.jpg", "publishedAt": "2022-06-28T19:34:15Z", "content": "During Indias tour of Australia in 2018-19, when Cheteshwar Pujara had faced 1,258 balls for his 521 runs in four Tests to become the cornerstone of Indias first-ever series win Down Under, he made e… [+4762 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Peter Vidal", "title": "Horoscope Today, June 29 2022: Leo, Libra, Virgo and other signs — check astrological prediction", "description": "Libra - Your social life is about to be revived and reinvigorated in a rather surprising manner", "url": "https://indianexpress.com/article/horoscope/horoscope-today-june-29-2022-leo-libra-virgo-and-other-signs-check-astrological-prediction-7991616/", "urlToImage": "https://images.indianexpress.com/2022/06/horoscope_@.jpg", "publishedAt": "2022-06-28T19:30:39Z", "content": "If relationships with children or younger relatives have been complicated, put the past behind you and concentrate on having a simple and fulfilling time from here on. There will be more tension, but… [+3391 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pallavi Smart", "title": "Two Mumbai colleges declare 1st list for admissions, mark drop in cut-offs", "description": "According to the colleges, this is a result of the beginning of admission process though CBSE and ISC results haven’t been declared. Most city colleges will declare their first merit list on Wednesday.", "url": "https://indianexpress.com/article/cities/mumbai/two-mumbai-colleges-declare-1st-list-for-admissions-mark-drop-in-cut-offs-7997196/", "urlToImage": "https://images.indianexpress.com/2022/06/exam-3.jpg", "publishedAt": "2022-06-28T19:29:18Z", "content": "The KC and HR College, which are now part of HSNC University, declared their first merit list on Tuesday, becoming the first Mumbai colleges to do so. The cut-off score in almost all courses has seen… [+1486 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Avinash Nair", "title": "Gujarat: Kheti Bank declares record 20% dividend for farmer members", "description": "Kheti Bank disbursed total loans worth Rs 158.28 crore during the financial year 2021-22. Officials from the bank said it disburses loans for more than 300 activities under the farm and non-farm sectors.", "url": "https://indianexpress.com/article/cities/ahmedabad/gujarta-kheti-bank-declares-record-20-dividend-for-farmer-members-loan-gold-7997185/", "urlToImage": "https://images.indianexpress.com/2022/06/farming-paddy.jpg", "publishedAt": "2022-06-28T19:23:05Z", "content": "Ahmedabad-based Gujarat State Cooperative Agriculture and Rural Development Bank Ltd, popularly known as Kheti Bank, Tuesday declared a 20 per cent dividend–the highest yet in its 70-year history. It… [+2031 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Meena’s husband Vidyasagar passes away", "description": "Vidyasagar is survived by wife Meena and daughter Nainika.", "url": "https://indianexpress.com/article/entertainment/tamil/meena-husband-vidyasagar-passes-away-7997177/", "urlToImage": "https://images.indianexpress.com/2022/06/meena-husband-1200.jpg", "publishedAt": "2022-06-28T19:21:37Z", "content": "Actor Meena’s husband Vidyasagar passed away on Monday in a private hospital in Chennai. He was said to have been suffering from severe lung infection and was reportedly under treatment for the same … [+1386 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Actor Suraj Pancholi seeks NBW against Jiah Khan’s mother for not appearing before court", "description": "Pancholi, through his lawyer Prashant Patil, submitted that Rabia, the original complainant in the case, was summoned to appear as a witness but she was not doing so.", "url": "https://indianexpress.com/article/cities/mumbai/actor-suraj-pancholi-seeks-nbw-against-jiah-khans-mother-for-not-appearing-before-court-7997187/", "urlToImage": "https://images.indianexpress.com/2022/06/sooraj-jiah-khan-759.jpg", "publishedAt": "2022-06-28T19:21:28Z", "content": "Actor Suraj Pancholi, who is an accused in the abetment to suicide case of actor Jiah Khan, on Tuesday sought a non-bailable warrant against Rabia, Khan’s mother, claiming that she was not appearing … [+934 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Partha Sarathi Biswas", "title": "Don’t force farmers to buy mineral mixtures, micro nutrients with fertilizers: Agri commissioner to companies", "description": "Agriculture commissioner Dheeraj Kumar said he had received complaints about such linkage sales from farmers in Nanded and Buldhana, which prompted him to take action.", "url": "https://indianexpress.com/article/cities/pune/dont-force-farmers-to-buy-mineral-mixtures-micro-nutrients-with-fertilizers-agri-commissioner-to-companies-7997183/", "urlToImage": "https://images.indianexpress.com/2022/06/fertilizer-1.jpg", "publishedAt": "2022-06-28T19:12:43Z", "content": "Maharashtras agriculture commissioner Dheeraj Kumar has directed fertilizer companies not to force farmers to buy mineral mixtures or micro nutrients while buying fertilizers from shops. Kumar said h… [+2278 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Apurva Vishwanath", "title": "Explained: Speaker’s powers in a rebellion", "description": "In Monday’s interim order on Sena rebels, the SC has sought a counter-affidavit from the Maharashtra Deputy Speaker. What are the Speaker’s powers under law, and how has the SC interpreted these?", "url": "https://indianexpress.com/article/explained/speaker-powers-constitution-shiv-sena-mlas-rebel-maharashtra-crisis-floor-test-7997172/", "urlToImage": "https://images.indianexpress.com/2022/06/Supporters-of-Shiv-Sena-rebel-leader-Eknath-Shinde.jpg", "publishedAt": "2022-06-28T19:07:17Z", "content": "While granting interim relief to rebel MLAs of the Shiv Sena on Monday, the Supreme Court made a crucial but unusual judicial intervention that raises questions on the powers of the Speaker under the… [+6104 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "After Udaipur tailor’s murder, Delhi Police asks DCPs to be on high alert", "description": "DCPs have also been asked by the senior officers from Delhi Police headquarters to take extra police force and deploy them in all sensitive areas.", "url": "https://indianexpress.com/article/cities/delhi/after-udaipur-tailors-murder-delhi-police-asks-dcps-to-be-on-high-alert-7997178/", "urlToImage": "https://images.indianexpress.com/2022/06/Udaipur.jpg", "publishedAt": "2022-06-28T19:06:50Z", "content": "Hours after a man was hacked to death in Udaipur, DCPs of all 15 districts in Delhi were asked to make security arrangements and be on high alert. They were also asked to meet with Aman committees of… [+1425 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "Telangana SSC 10th Result 2022: Date, time and result websites announced", "description": "TS SSC Results 2022 Date, Time: The results will be available on www.bse.telangana.gov.in and www.bseresults.telangana.gov.in. The  Secondary School Certificate (SSC) board examinations were conducted from May 23 to June 1, 2022. The exams were held from 9:30…", "url": "https://indianexpress.com/article/education/ts-telangana-ssc-class-10th-board-exam-result-2022-date-time-and-result-websites-announced-bse-telangana-gov-in-manabadi-7951117/", "urlToImage": "https://images.indianexpress.com/2022/03/BSEB-Class-12-Intermediate-result-scrutiny.jpg", "publishedAt": "2022-06-28T18:39:26Z", "content": "TS SSC 10th results 2022: The Board School Education, Telangana, and state education minister Patlolla Sabitha Indra Reddywill release the board exam results for the Secondary School Certificate (SSC… [+1723 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Trump tried to grab steering wheel to go to US Capitol Jan 6: Witness", "description": "\"I'm the effing president, take me up to the Capitol now,\" Trump was quoted as saying by former White House aide Cassidy Hutchinson in testimony to the congressional panel investigating the Jan. 6 assault on the Capitol", "url": "https://indianexpress.com/article/world/trump-tried-to-grab-steering-wheel-to-go-to-us-capitol-witness-7997166/", "urlToImage": "https://images.indianexpress.com/2022/06/Cassidy-Hutchinson.jpg", "publishedAt": "2022-06-28T18:37:03Z", "content": "Then-President Donald Trump became irate and tried to grab the steering wheel of the Secret Service limousine when told he would not be joining supporters moving on the U.S. Capitol on Jan. 6, 2021, … [+871 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "Ajker Rashifal Bengali, 29 June 2022: বড় বিপদ! সাবধানে থাকুন এই রাশির জাতকরা, পড়ুন রাশিফল", "description": "আজকের রাশিফল, ২৯ জুন - জেনে নিন কী আছে ভাগ্যে?", "url": "https://bengali.indianexpress.com/horoscope/ajker-rashifal-june-29-2022-aries-taurus-gemini-cancer-leo-virgo-libra-scorpio-sagittarius-capricorn-aquarius-pisces-462920/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/IMG-20220628-WA0019.jpg", "publishedAt": "2022-06-28T18:35:00Z", "content": "/ Aries Rashifal ( March 21 – April 20 )\r\n/ Taurus Rashifal ( April 21 – May 21 )\r\n/ Gemini Rashifal ( May 22 – June 21 )\r\n/ Cancer Rashifal ( June 22 – July 23 )\r\n/ Leo Rashifal ( July 24 – August 2… [+319 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Dera Bassi firing: Mohali SSP orders FIR against sub-inspector, others", "description": "The video of a man being shot in his leg by a police team at Derabassi went viral on Monday, with police later issuing a statement that the man was shot in 'self defence' after he indulged in a spat with policemen.", "url": "https://indianexpress.com/article/cities/sas-nagar-mohali/dera-bassi-firing-mohali-ssp-orders-fir-against-sub-inspector-others-7997161/", "urlToImage": "https://images.indianexpress.com/2022/06/police-3.jpg", "publishedAt": "2022-06-28T18:27:55Z", "content": "A day after a 24-year-old was shot in his leg by a police team, Mohali Senior Superintendent of Police (SSP), Vivek Sheel Soni, on Tuesday ordered action, including the registration of an FIR, agains… [+2150 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Nitin Sharma", "title": "Contemporaries mourn World Cup winner Varinder’s demise", "description": "Singh, 75, was a gold medallist at the 1975 Kuala Lumpur Hockey World Cup and won bronze at the 1972 Munich Olympics.", "url": "https://indianexpress.com/article/sports/hockey/contemporaries-mourn-world-cup-winner-varinders-demise-7997150/", "urlToImage": "https://images.indianexpress.com/2022/06/Varinder.jpg", "publishedAt": "2022-06-28T18:18:16Z", "content": "One of the best right-halves of the 1970s, Varinder Singh breathed his last in Jalandhar on Tuesday.Singh, 75, was a gold medallist at the 1975 Kuala Lumpur Hockey World Cup and won bronze at the 197… [+3410 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Esha Roy", "title": "Govt to set up control rooms to enforce single-use plastic ban: Minister", "description": "The list of banned items include ear buds with plastic sticks, plastic sticks for balloons, plastic flags, candy sticks, ice-cream\r\nsticks, polystyrene (thermocol) for decoration, plastic plates, among many others.", "url": "https://indianexpress.com/article/india/centre-govt-single-use-plastic-ban-pollution-7997153/", "urlToImage": "https://images.indianexpress.com/2022/06/plastic-use.jpg", "publishedAt": "2022-06-28T18:15:02Z", "content": "WITH THE ban on single-use plastic coming into force on July 1, the government will be setting up control rooms at national and state levels to ensure its effective enforcement, Environment, Forests … [+3458 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "DCGI approves indigenous mRNA Covid jab for emergency use in 18 yrs & above; Covovax for 7-11 yrs", "description": "While other mRNA vaccines require to be stored at sub-zero temperatures, Gennova's mRNA vaccine can be stored at 2-8 degrees, an official source told PTI.", "url": "https://indianexpress.com/article/india/dcgi-indigenous-mrna-covid-jab-emergency-use-covovax-7997142/", "urlToImage": "https://images.indianexpress.com/2022/06/Chennai-1-2-1.jpg", "publishedAt": "2022-06-28T18:02:16Z", "content": "The Drugs Controller General of India (DCGI) on Tuesday approved India’s first indigenously developed mRNA vaccine against COVID-19 manufactured by Gennova Biopharmaceuticals for restricted emergency… [+2447 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pune: Bank staffer injured in chain-snatching incident on Lahuji Vastad bridge", "description": "Police said the complainant is a bank staffer who is also pursuing higher studies. She was going to the Navi Peth area via Lahuji Vastad bridge to withdraw some cash on Sunday night.", "url": "https://indianexpress.com/article/cities/pune/pune-bank-staffer-injured-in-chain-snatching-incident-on-lahuji-vastad-bridge-7997146/", "urlToImage": "https://images.indianexpress.com/2022/06/Express-Representational-Image-46-6.jpeg", "publishedAt": "2022-06-28T18:01:59Z", "content": "A 25-year-old woman who works for a bank was left injured after two motorcycle-borne youngsters pulled her down while snatching her gold chain as she was riding a two-wheeler on the Lahuji Vastad bri… [+861 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Raghu Malhotra", "title": "Explained: As NATO meets in Madrid, the Russia, China challenges before the alliance", "description": "The NATO was first established by the United States, Canada, and some other Western countries in 1949, in response to the perceived threat of the Soviet Union’s expansion in post-war Europe.", "url": "https://indianexpress.com/article/explained/explained-as-nato-meets-in-madrid-the-russia-china-challenges-before-the-alliance-7997139/", "urlToImage": "https://images.indianexpress.com/2022/06/NATO.jpg", "publishedAt": "2022-06-28T17:58:17Z", "content": "Representatives of NATO member states gathered in Madrid on Tuesday (June 28) for a summit that will go on till Thursday. They will be finalising their first strategic concept document since 2010, wh… [+5136 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "At 23%, Pune weekly Covid positivity rate almost double of Maharashtra’s average", "description": "Pune has shown a 66 per cent rise in new Covid infections in the week June 21-27 with 3,583 cases being detected as compared to 2,157 in the preceding week.", "url": "https://indianexpress.com/article/cities/pune/pune-covid-cases-positivity-rate-maharashtra-news-fresh-cases-7997136/", "urlToImage": "https://images.indianexpress.com/2022/06/vaccine-covid.jpeg", "publishedAt": "2022-06-28T17:55:43Z", "content": "At 23 per cent, the Covid positivity rate in Pune in the week ending June 27 was twice that of Maharashtra, according to a state health department report. The Covid weekly positivity rate for Mumbai … [+1486 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Debraj Deb", "title": "Tripura govt to fill up 1,386 vacancies by August, create 228 new posts", "description": "The announcement came with barely nine months left for the next Assembly polls in Tripura and just days after new Chief Minister Dr Manik Saha won the bye-election from the Town Bardowali.", "url": "https://indianexpress.com/article/north-east-india/tripura/tripura-govt-to-fill-up-1386-vacancies-by-august-create-228-new-posts-7997134/", "urlToImage": "https://images.indianexpress.com/2022/06/IMG_20220628_191627.jpg", "publishedAt": "2022-06-28T17:47:44Z", "content": "The Tripura cabinet Tuesday announced that 1,386 vacant posts across government departments in the state will be filled up by August this year. In addition, the cabinet also decided to create 228 new… [+2146 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Deepak Hooda, Sanju Samson register highest T20I partnership for India", "description": "In the match, opting to bat, India posted 227 for seven in the second and final T20 International against Ireland.", "url": "https://indianexpress.com/article/sports/cricket/deepak-hooda-sanju-samson-register-highest-t20i-partnership-for-india-7997088/", "urlToImage": "https://images.indianexpress.com/2022/06/Hooda-Sanju.jpg", "publishedAt": "2022-06-28T17:40:33Z", "content": "Deepak Hooda and Sanju Samson on Friday registered the highest T20I partnership for India with 176 runs, breaking the record of the 165-run stand of Rohit Sharma and KL Rahul against Sri Lanka in Ind… [+1463 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sreenivas Janyala", "title": "KCR inaugurates tech hub, says next big breakthrough in startup innovation to come from Hyderabad", "description": "Principal Secretary, IT and Industries Jayesh Ranjan said that the idea of T-hub was first launched in 2015 when startups were facing challenges as they could not afford to hire big office spaces in the IT corridor and Cyberabad.", "url": "https://indianexpress.com/article/cities/hyderabad/kcr-inaugurates-tech-hub-says-next-big-breakthrough-in-startup-innovation-to-come-from-hyderabad-7997124/", "urlToImage": "https://images.indianexpress.com/2022/06/T-Hub-1.jpg", "publishedAt": "2022-06-28T17:39:59Z", "content": "Inaugurating the T-hub 2.0 (Technology Hub), the second edition of the innovation and business incubator, at Raidurg here on Tuesday, Telangana Chief Minister K Chandrashekar Rao said that the next b… [+2396 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shaju Philip", "title": "Gold Smuggling Case: Opp moves adjournment motion, CM denies Suresh’s charges", "description": "After a lengthy debate, the Assembly rejected the adjournment motion, moved by Congress legislator Shafi Parambil, who alleged that the state government was trying to scuttle the probe.", "url": "https://indianexpress.com/article/cities/thiruvananthapuram/gold-smuggling-case-opp-moves-adjournment-motion-cm-denies-sureshs-charges-7997121/", "urlToImage": "https://images.indianexpress.com/2022/06/Pinarayi.jpg", "publishedAt": "2022-06-28T17:31:44Z", "content": "The Opposition, Congress-led United Democratic Front, on Tuesday moved an adjournment motion in the Kerala assembly and asked Chief Minister Pinarayi Vijayan why he did not file a defamation case aga… [+2633 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "Explained: জার্মানিতে রাশিয়ার বিরুদ্ধে আরও আক্রমণে শক্তিধর-রা, হ্যান্ডশেকে নজর কাড়লেন মোদী, কী হল জি-৭ সম্মেলনে", "description": "সোমবার তাঁর দিকে খানিকটা হেঁটে এসে পিঠে হাত দিয়ে ডেকে করমর্দন করলেন আমেরিকার প্রেসিডেন্ট জো বাইডেন।", "url": "https://bengali.indianexpress.com/explained/who-are-the-g7-462964/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/G7_Leaders.jpg", "publishedAt": "2022-06-28T17:23:26Z", "content": "’ - , , , , , – – , , \r\n , ! , - \r\n - . . , ( ) , \r\n , - ( ) , , \r\n - , , \r\n , - , – , , , – \r\n, , , , , , , \r\n , , \r\n , , ‘ ’, , \r\nRead full story in English\r\nStay updated with the latest news headl… [+101 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Credit card spend crosses Rs 1.13 lakh Cr in May: RBI data", "description": "The latest data from the Reserve Bank of India (RBI) showed that 7.68 crore credit card holders spent about Rs 71,429 crore for buying online, while the amount was spent through swipes at Point of Sale (PoS) machines stood at Rs 42,266 crore in May.", "url": "https://indianexpress.com/article/business/banking-and-finance/credit-card-spend-crosses-rs-1-13-lakh-cr-in-may-rbi-data-7996822/", "urlToImage": "https://images.indianexpress.com/2022/06/money-3-2.jpg", "publishedAt": "2022-06-28T17:20:09Z", "content": "Credit card spending has crossed Rs 1.13 lakh crore in May compared to Rs 1.05 lakh crore in the previous month according to official data.The month-on-month rise in spending through cards indicates … [+1715 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "AFI shows camper door for possessing needles", "description": "The Uttar Pradesh athlete was taken into the national camp after clocking decent timings of 46.58s (personal best) and 46.68 at the U23 Nationals and Open Nationals respectively in September last year.", "url": "https://indianexpress.com/article/sports/sport-others/afi-shows-camper-door-for-possessing-needles-7997101/", "urlToImage": "https://images.indianexpress.com/2022/06/Doping-File_571_855.jpg", "publishedAt": "2022-06-28T17:10:42Z", "content": "Ayush Dabas, a 22-year-old 400m runner, has been removed from the national camp in Trivandrum after syringes and needles were found in his room during a routine check, the Athletics Federation of Ind… [+1960 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Jimmy Leivon", "title": "Children among 80 Myanmar nationals arrested in Manipur", "description": "The police suspect that the Myanmar nationals could have been brought to Manipur to be engaged in weaving activities as most of them were found in rooms crammed with handlooms and other weaving machines.", "url": "https://indianexpress.com/article/north-east-india/manipur/children-among-80-myanmar-nationals-arrested-in-manipur-7997080/", "urlToImage": "https://images.indianexpress.com/2022/06/manipur.jpeg", "publishedAt": "2022-06-28T17:06:17Z", "content": "The Manipur Police Tuesday arrested 80 Myanmar nationals, including women and children, who were illegally staying in the Churachandpur district of Manipur.The police said the Myanmar nationals were … [+2638 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Mr Happy Face, a Chihuahua mix with a mohawk, named world’s ugliest dog", "description": "“I vowed that day, he would be so loved that he would never remember how awful his previous life had been,” Benally wrote. In his new home, Mr. Happy Face has already made it to 10 months", "url": "https://indianexpress.com/article/lifestyle/life-style/mr-happy-face-a-chihuahua-mix-with-a-mohawk-named-worlds-ugliest-dog-7992506/", "urlToImage": "https://images.indianexpress.com/2022/06/Chihuahua_200_pixabay.jpg", "publishedAt": "2022-06-28T17:00:28Z", "content": "Out of a field that included a hairless mutant with no teethand a crooked face, a creature that resembled a hyena or mandrill baboon and a canine with a gorilla-looking head, a Chihuahua mix named Mr… [+2543 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "দাঙ্গা নিয়ে সুপ্রিম রায় ‘নৈতিক জয়’, বাড়িয়েছে মনোবল, ধারণা বিজেপি নেতৃত্বের", "description": "গুজরাটের তৎকালীন মুখ্যমন্ত্রী মোদীর 'মানহানি' করার অভিযোগে সমাজকর্মী তিস্তা শীতলবাদ, অবসরপ্রাপ্ত ডিজিপি আর বি শ্রীকুমার, বরখাস্ত আইপিএস অফিসার সঞ্জীব ভাট এবং অন্যদের ভূমিকার নিন্দা করে বিজেপির প্রায় সব শীর্ষ নেতাই বিবৃতি দিয়েছেন।", "url": "https://bengali.indianexpress.com/politics/national/bjp-says-supreme-court-order-is-moral-victory-462958/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/modi-7.jpg", "publishedAt": "2022-06-28T16:52:03Z", "content": ", , , ‘ ’ , , ‘’ \r\n , , ‘ ’ , ‘’ -, \r\n ‘’ , , \r\n, ‘ ’ , ‘ ’ \r\n - ! , \r\n , - ‘, ’ , ‘’ \r\n , , - - \r\nRead full story in English\r\nStay updated with the latest news headlines and all the latest National … [+98 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Former champion Halep makes winning return to Wimbledon", "description": "The cancellation of the tournament in 2020 because of the COVID-19 pandemic and a calf injury last year meant the 30-year-old Romanian never got to defend the Venus Rosewater Dish.", "url": "https://indianexpress.com/article/sports/tennis/former-champion-halep-makes-winning-return-to-wimbledon-7997073/", "urlToImage": "https://images.indianexpress.com/2022/06/Halep.jpg", "publishedAt": "2022-06-28T16:48:47Z", "content": "Former world number one Simona Halep returned to Wimbledon for the first time since winning the 2019 title and picked up exactly where she left off with an impressive 6-3 6-2 win over dangerous Czech… [+1658 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Northeast floods: 5 more die in Assam, 3 in Arunachal", "description": "In Assam, most of the rivers are now flowing below the danger level, aside from Kopili at Dharamtul (Morigaon), Beki at Road Bridge (Barpeta) and the Brahmaputra at Nimatighat (Jorhat).", "url": "https://indianexpress.com/article/india/northeast-floods-5-die-assam-3-arunachal-7997068/", "urlToImage": "https://images.indianexpress.com/2022/06/assam-floods-1-1-1.jpg", "publishedAt": "2022-06-28T16:45:51Z", "content": "Two weeks after the second wave of floods hit Assam, 24 lakh people across 28 districts in the state remain affected. While the situation is gradually improving, several localities of Cachar district… [+1924 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rishika Singh", "title": "Explained: What is the GST Council, what does it do?", "description": "The members of the Council include the Union Finance Minister (chairperson), the Union Minister of State (Finance) from the Centre. Each state can nominate a minister in-charge of finance or taxation or any other minister as a member.", "url": "https://indianexpress.com/article/explained/everyday-explainers/explained-what-is-gst-council-7997061/", "urlToImage": "https://images.indianexpress.com/2022/06/GST-council.jpg", "publishedAt": "2022-06-28T16:43:49Z", "content": "The 47th meeting of the Goods and Services Tax Council began in Chandigarh Tuesday, almost marking five years of the tax system coming into effect on July 1, 2017.Over these five years, the GST setup… [+2552 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Video recording, circulation of protest inside Kerala Assembly ‘condemnable’: Speaker", "description": "The Speaker said it has been found that not only members of opposition, but reporters in the media gallery also recorded the protests and circulated it to news channels", "url": "https://indianexpress.com/article/cities/thiruvananthapuram/video-recording-circulation-of-protest-kerala-assembly-condemnable-speaker-7996263/", "urlToImage": "https://images.indianexpress.com/2022/06/Kerala-Assembly-PTI-1.jpg", "publishedAt": "2022-06-28T16:35:03Z", "content": "The Kerala Legislative Assembly Speaker on Tuesday ruled that the protests during the session a day ago were found to be video recorded and circulated in the media by members of the opposition as wel… [+3203 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Former Nazi guard, 101, jailed for aiding murder", "description": "The Neuruppin Regional Court sentenced him to five years in prison.", "url": "https://indianexpress.com/article/world/former-nazi-guard-murder-7996590/", "urlToImage": "https://images.indianexpress.com/2022/06/nazi-convict-ap.jpg", "publishedAt": "2022-06-28T16:28:18Z", "content": "A 101-year-old man was convicted in Germany of 3,518 counts of accessory to murder on Tuesday for serving at the Nazis’ Sachsenhausen concentration camp during World War II.The Neuruppin Regional Cou… [+4092 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Hocus Pocus 2 set for September premiere on Disney Plus", "description": "Hocus Pocus 2 is set 29 years after the events of the original and follows three high-school students who must work together to stop the Sanderson sisters who have returned to present-day Salem.", "url": "https://indianexpress.com/article/entertainment/hollywood/hocus-pocus-2-set-for-september-premiere-on-disney-plus-7997050/", "urlToImage": "https://images.indianexpress.com/2022/06/hocus-pocus-2-1200-1.jpg", "publishedAt": "2022-06-28T16:21:57Z", "content": "The sequel to 1993 fantasy comedy film Hocus Pocus will be released on Disney+ on September 30, the streaming service announced on Tuesday.Directed by Anne Fletcher, Hocus Pocus 2 brings back the ico… [+965 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Emmanuel Macron says Russia can’t win in Ukraine after strike on mall", "description": "Ukrainian leaders denounced the strike, which killed 18 in the central city of Kremenchuk, as a war crime and a terrorist attack, and it drew swift condemnation from the Group of Seven leaders meeting.", "url": "https://indianexpress.com/article/world/france-emmanuel-macron-russia-cant-win-ukraine-strike-on-mall-7997047/", "urlToImage": "https://images.indianexpress.com/2022/06/ukraine-10.jpg", "publishedAt": "2022-06-28T16:20:15Z", "content": "France’s president said Tuesday that Russia cannot and should not win in Ukraine, voicing the West’s continued support for Kyiv following Moscow’s horrific missile attack on a shopping mall that unde… [+5991 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Takumi Minamino joins AS Monaco from Liverpool", "description": "The 27-year-old Japan international scored 14 goals in 55 games overall for Liverpool after joining from Red Bull Salzburg.", "url": "https://indianexpress.com/article/sports/football/takumi-minamino-joins-as-monaco-from-liverpool-7997010/", "urlToImage": "https://images.indianexpress.com/2022/06/Minamino-2.jpg", "publishedAt": "2022-06-28T16:14:22Z", "content": "French club AS Monaco on Tuesday announced the transfer of out-of-favour Liverpool player Takumi Minamino on a 4-year-deal.The 27-year-old Japan international scored 14 goals in 55 games overall for … [+1335 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Kendrick Lamar wears diamond-studded ‘crown of thorns’ to put spotlight on women’s rights", "description": "The headpiece by Tiffany & Co. weighs around 200g and required more than 1,300 hours of work by four craftsmen", "url": "https://indianexpress.com/article/lifestyle/life-style/kendrick-lamar-diamond-crown-thorns-women-rights-glastonbury-music-festival-roe-v-wade-7995899/", "urlToImage": "https://images.indianexpress.com/2022/06/Kendrick-Lamar-1200.jpg", "publishedAt": "2022-06-28T16:10:12Z", "content": "Amid the ongoing women’s-rights protests in the US following the overturning of Roe v. Wade — a landmark decision of the US Supreme Court in 1973, which struck down many federal and state abortion la… [+2272 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Mira Rajput calls out Sicily resort for being insensitive to dietary requirements: ‘Removing meat from any dish does not make you accommodating’", "description": "Shahid Kapoor and Mira Rajput are upset at the lack of vegetarian food in Sicily and took to Instagram to express their disappointment.", "url": "https://indianexpress.com/article/entertainment/bollywood/shahid-kapoor-and-mira-rajput-vacation-posts-slam-hotel-7997028/", "urlToImage": "https://images.indianexpress.com/2022/04/sk1200.jpg", "publishedAt": "2022-06-28T16:04:47Z", "content": "Actor Shahid Kapoor and his wife Mira Rajput are having a tough time finding vegetarian food in Sicily. Mira took to Instagram and mentioned that the resort they were staying in had limited food opti… [+1447 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Neetu Kapoor remembers Raj Kapoor, Krishna Raj Kapoor after Alia-Ranbir’s pregnancy announcement; calls the baby ‘their blessings’", "description": "Neetu Kapoor shared a photo of late filmmaker Raj Kapoor and Krishna Raj Kapoor after Alia Bhatt and Ranbir Kapoor's pregnancy announcement.", "url": "https://indianexpress.com/article/entertainment/bollywood/neetu-kapoor-remembers-raj-kapoor-krishna-raj-kapoor-after-alia-ranbirs-pregnancy-announcement-7997034/", "urlToImage": "https://images.indianexpress.com/2022/06/alia-ranbir-1200-2.jpg", "publishedAt": "2022-06-28T16:03:33Z", "content": "Neetu Kapoor took to Instagram on Tuesday and shared a photo of her late in-laws Raj Kapoor and Krishna Raj Kapoor. The post comes a day after Alia Bhatt and Ranbir Kapoor’s pregnancy announcement. S… [+1161 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Sarkeguda ‘fake’ encounter: Villagers gather on 10th anniversary, demand justice", "description": "The people who came from villages in Bijapur, Sukma and Dantewada raised slogans demanding justice after observing silence for two minutes at the memorial for the victims built in the village.", "url": "https://indianexpress.com/article/india/sarkeguda-fake-encounter-villagers-gather-10th-anniversary-demand-justice-7997036/", "urlToImage": "https://images.indianexpress.com/2022/06/crpf-assam-copy.jpg", "publishedAt": "2022-06-28T15:58:42Z", "content": "PEOPLE BELONGING to tribal communities of more than 30 villages on Tuesday gathered at Sarkeguda in Chhattisgarh’s Bijapur district on the 10th anniversary of an alleged fake encounter that claimed 1… [+1744 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Iran, Argentina seek BRICS membership", "description": "Ahead of the summit, Saudi Arabia too expressed interest to join the grouping.", "url": "https://indianexpress.com/article/world/iran-argentina-seeks-brics-membership-7996664/", "urlToImage": "https://images.indianexpress.com/2022/06/brics-2017-1.jpg", "publishedAt": "2022-06-28T15:51:50Z", "content": "Iran and Argentina have applied to join the BRICS mechanism, the Russian state media reported, days after a summit of the five-nation bloc during which the leaders agreed to continue to discuss the p… [+2990 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Your Daily Wrap: Udaipur tense after man hacked to death, Mukesh Ambani resigns as Reliance Jio’s director; and more", "description": "From Delhi police getting custody of Alt News co-founder Mohammed Zubair to Maharashtra CM Uddhav Thackeray appealing to rebel Shiv Sena MLAs to return, here are the top stories of today.", "url": "https://indianexpress.com/article/india/your-daily-wrap-udaipur-man-hacked-to-death-mukesh-ambani-reliance-jio-7997012/", "urlToImage": "https://images.indianexpress.com/2022/06/Untitled-design-68.jpg", "publishedAt": "2022-06-28T15:41:00Z", "content": "A tailor in Udaipur was hacked to death today by two persons allegedly for posting a social media statement in favour of suspended BJP spokesperson Nupur Sharma, who had made controversial remarks ab… [+4910 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Shabaash Mithu song Fateh: Taapsee Pannu leads the women in blue", "description": "Shabaash Mithu is a biopic based on the life of ace cricketer Mithali Raj, the former captain of the Indian cricket team.", "url": "https://indianexpress.com/article/entertainment/bollywood/shabaash-mithu-song-fateh-taapsee-pannu-leads-the-women-in-blue-7997024/", "urlToImage": "https://images.indianexpress.com/2022/06/taapsee-pannu-1.jpg", "publishedAt": "2022-06-28T15:40:52Z", "content": "The first song of Taapsee Pannu starrer Shabaash Mithu, titled Fateh, was released on Tuesday. The energetic song, that plays in the background of a training montage, seems like the inspiration anthe… [+1389 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "A Look At PM Modi’s Gifts For World Leaders At G7 Meet", "description": "", "url": "https://indianexpress.com/videos/news-video/a-look-at-pm-modis-gifts-for-world-leaders-at-g7-meet/", "urlToImage": "https://images.indianexpress.com/2022/06/G7-Summit-1.jpg", "publishedAt": "2022-06-28T15:36:28Z", "content": "Pallonji Mistry, Chairman Of Shapoorji Pallonji Group, Passes Away At 93"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Pallonji Mistry, Chairman Of Shapoorji Pallonji Group, Passes Away At 93", "description": "", "url": "https://indianexpress.com/videos/news-video/pallonji-mistry-chairman-of-shapoorji-pallonji-group-passes-away-at-93/", "urlToImage": "https://images.indianexpress.com/2022/06/Mistry-YT.jpg", "publishedAt": "2022-06-28T15:34:16Z", "content": "1 dead, Several Feared Trapped As Four-Storey Building Collapses In Kurla, Mumbai"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Schools Poor In Digital Learning, 180 Districts Score Less Than 10 Percent", "description": "", "url": "https://indianexpress.com/videos/news-video/schools-poor-in-digital-learning-180-districts-score-less-than-10-percent/", "urlToImage": "https://images.indianexpress.com/2022/06/school-YT.jpg", "publishedAt": "2022-06-28T15:32:36Z", "content": "Pallonji Mistry, Chairman Of Shapoorji Pallonji Group, Passes Away At 93"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "চরম নৃশংসতা! নুপুর শর্মাকে সমর্থন দর্জির, খুন করে ভিডিও বানাল দুই আততায়ী", "description": "দর্জি যখন ওই যুবকের পোশাকের মাপ নিচ্ছিলেন, সেই সময় ধারাল অস্ত্র বের করে তাঁর গলা কেটে দেয় হামলাকারী।", "url": "https://bengali.indianexpress.com/general-news/udaipur-tailor-killed-for-support-nupur-sharma-462918/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/udaipur_tension.jpg", "publishedAt": "2022-06-28T15:31:24Z", "content": ", \r\n , ‘ ’ \r\n, ‘ , , ’ \r\n- (-) , , \r\n - , \r\n , , , , ‘ , , !’ , \r\nRead full story in English\r\nStay updated with the latest news headlines and all the latest General news download Indian Express Benga… [+65 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "UPSC Essentials: Breaking The “Maternity Jinx” At The Workplace", "description": "", "url": "https://indianexpress.com/videos/news-video/upsc-essentials-breaking-the-maternity-jinx-at-the-workplace/", "urlToImage": "https://images.indianexpress.com/2022/06/IE-thumb-temp-psd-copy.jpg", "publishedAt": "2022-06-28T15:30:52Z", "content": "Pallonji Mistry, Chairman Of Shapoorji Pallonji Group, Passes Away At 93"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Joyprakash Das", "title": "বেহাত হচ্ছে জমি, হেলায় ফিকে ইতিহাস, অনাদরে ‘পথের পাঁচালি’র পটভূমি", "description": "বিভূতিভূষণ বন্দ্যোপাধ্যায়ের পৈতৃক ভিটে থেকে গায়েব হচ্ছে মাটি। অনাদরে রয়েছে সাহিত্যিকের বসতবাড়িটিও।", "url": "https://bengali.indianexpress.com/west-bengal/demands-preservation-of-bibhutibhushan-banerjees-ancestral-home-462927/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/B-1.jpg", "publishedAt": "2022-06-28T15:28:51Z", "content": "- , , , , , , - - \r\n , , , - \r\n - , - , \r\n - , ‘ - ’\r\n , ‘ ’\r\n - - \r\n , , ‘ , ’\r\n , ‘ , ’\r\n , ‘ , , , , , , ’\r\nStay updated with the latest news headlines and all the latest Westbengal news download … [+102 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Zeeshan Shaikh", "title": "Maharashtra cabinet to decide on renaming Aurangabad city to Sambhaji Nagar: Anil Parab", "description": "“In today's cabinet, I have raised the issue of renaming Aurangabad city to Sambhaji Nagar. A resolution to this effect will be discussed in the next cabinet meeting that will be held on Wednesday,” minister Anil Parab said after the cabinet meeting Tuesday.", "url": "https://indianexpress.com/article/cities/mumbai/maharashtra-cabinet-renaming-aurangabad-city-sambhaji-nagar-anil-parab-7997008/", "urlToImage": "https://images.indianexpress.com/2022/05/Parab-new.jpg", "publishedAt": "2022-06-28T15:22:16Z", "content": "The Shiv Sena Tuesday raised the issue of renaming of Aurangabad city to Sambhaji Nagar and said the state cabinet will take a decision on the matter Wednesday.In today’s cabinet, I have raised the i… [+2053 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Make ‘tamatar ke papad’ at home with this easy recipe", "description": "If you think it's hard, check out this recipe by 'Amma ki Thaali' that is naturally vegan and gluten-free", "url": "https://indianexpress.com/article/lifestyle/food-wine/ever-wondered-how-you-can-make-papad-at-home-check-this-recipe-out-7815529/", "urlToImage": "https://images.indianexpress.com/2022/03/1024px-Masala_Papads.jpg", "publishedAt": "2022-06-28T15:20:23Z", "content": "Eaten as a snack or with meals, papad can be enjoyed fried or roasted. But, most of us buy papad — which our grandmothers once used to prepare at home — from the grocery store.So, why not try your ha… [+1411 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Associated Press", "title": "Scottish leader to give route map to new independence vote", "description": "Opposition parties have criticised Sturgeon for her “obsession” with holding a new independence vote and say she should instead be focused on more practical matters such as tackling the soaring cost of living.", "url": "https://indianexpress.com/article/world/scottish-leader-route-map-new-independence-vote-7996992/", "urlToImage": "https://images.indianexpress.com/2022/06/Nicola-Sturgeon.jpg", "publishedAt": "2022-06-28T15:17:04Z", "content": "Scottish First Minister Nicola Sturgeon is set to deliver a statement on Tuesday setting out how she believes a new referendum on Scottish independence could be held.Scottish voters rejected independ… [+1722 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "How long COVID impacts your menstrual health", "description": "During stress, the HPA axis stimulates the release of the stress hormone cortisol to help the body fight off a threat. Increased cortisol levels can affect a woman’s menstrual cycle, explains Dr Sarika Gupta, Senior Consultant, Oncology and Robotic Gynaecolog…", "url": "https://indianexpress.com/article/lifestyle/health/long-covid-menstrual-health-impact-7996993/", "urlToImage": "https://images.indianexpress.com/2022/05/GettyImages-teenagers-puberty-periods-1200.jpg", "publishedAt": "2022-06-28T15:13:57Z", "content": "For the past two years since the pandemic emerged, scientists have been continuously researching COVID-19. While the virus itself has proven to be highly problematic, there have been several cases wo… [+4897 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Taapsee Pannu on her Dunki co-star Shah Rukh Khan: ‘Even before I met him, his journey felt too personal…’", "description": "Taapsee Pannu and Shah Rukh Khan film Dunki will reportedly highlight the rampant use of an illegal backdoor route called 'Donkey Flight' by Indians to immigrate to countries like Canada and USA.", "url": "https://indianexpress.com/article/entertainment/bollywood/taapsee-pannu-on-teaming-up-with-shah-rukh-khan-in-rajkumar-hirani-film-dunki-7996966/", "urlToImage": "https://images.indianexpress.com/2022/06/Shah-Rukh-Khan-1200-4.jpg", "publishedAt": "2022-06-28T14:58:05Z", "content": "Bollywood star Taapsee Pannu says for an ardent fan like her, working in Shah Rukh Khan-led movie Dunki is a personal achievement. Filmmaker Rajkumar Hirani is directing the movie from a script he co… [+2023 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anonna Dutt", "title": "Alzheimer’s detection now easier at one shot", "description": "Using an algorithm able to select texture and subtle structural features in the brain that are affected by Alzheimer’s could really enhance the information we can gain from standard imaging techniques, says Dr Paresh Malhotra of Imperial College, London", "url": "https://indianexpress.com/article/lifestyle/health/alzheimers-detection-study-mri-scan-7996971/", "urlToImage": "https://images.indianexpress.com/2022/06/Alzheimers-1.jpg", "publishedAt": "2022-06-28T14:56:46Z", "content": "A single MRI scan may be used to diagnose Alzheimers disease a progressive condition that slowly destroys memory and thinking skills even in the early stages, according to a study from the Imperial C… [+4266 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "RK/RKAY teaser: Rajat Kapoor film leaves viewers intrigued, fans are happy to see Mallika Sherawat back on screens", "description": "RK/RKAY stars Rajat Kapoor, Ranvir Shorey, Mallika Sherawat, Kubbra Sait, Manu Rishi Chadha, Chandrachoor Rai, Abhijeet Deshpande, Abhishek Sharrma, Grace Girdhar and Vaishali Malhara.", "url": "https://indianexpress.com/article/entertainment/bollywood/rk-rkay-teaser-rajat-kapoor-mallika-sherawat-7996739/", "urlToImage": "https://images.indianexpress.com/2022/06/Rajat-Kapoor-1200.jpg", "publishedAt": "2022-06-28T14:49:47Z", "content": "Actor Rajat Kapoor is gearing up to release his directorial venture RK/RKAY. The makers on Tuesday launched the teaser of the film, which has left fans intrigued. Going by the teaser, Rajat seems to … [+1110 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Vellore: Bike found stuck in fresh concrete, civic body says it did not order remaking of road", "description": "Vellore, a smart city, is seeing several of its roads being rebuilt.", "url": "https://indianexpress.com/article/cities/chennai/vellore-bike-stuck-fresh-concrete-civic-body-order-remaking-road-7996968/", "urlToImage": "https://images.indianexpress.com/2022/06/cementbikevellore.jpeg", "publishedAt": "2022-06-28T14:44:13Z", "content": "Amid a spree of remaking roads in parts of Vellore, the wheels of a two-wheeler were found stuck in freshly laid concrete in the Kaligambal street, leaving the civic body red-faced and netizens laugh… [+1304 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Kamal Haasan sweats it out on Vikram set; director Lokesh Kanagaraj says ‘eagle has landed’. Watch video", "description": "Helmed by Lokesh Kanagaraj, actioner Vikram has collected over Rs 400 crore at the global box office. The movie also stars Fahadh Faasil and Vijay Sethupathi in pivotal roles.", "url": "https://indianexpress.com/article/entertainment/tamil/kamal-haasan-push-ups-video-vikram-set-watch-7996957/", "urlToImage": "https://images.indianexpress.com/2022/06/kamal1200-1.jpg", "publishedAt": "2022-06-28T14:43:05Z", "content": "Director Lokesh Kanagaraj on Tuesday released a short clip of superstar Kamal Haasan performing push-ups on the sets of action blockbuster Vikram.Lokesh had earlier promised fans that he would let th… [+1359 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "PM Modi meets UAE President Sheikh Mohamed in Abu Dhabi", "description": "Modi met Sheikh Mohamed during a brief stopover here on his way to India to personally convey his condolences on the demise of former president of the Gulf nation Sheikh Khalifa bin Zayed Al Nahyan.", "url": "https://indianexpress.com/article/india/pm-modi-uae-president-sheikh-mohamed-abu-dhabi-7996962/", "urlToImage": "https://images.indianexpress.com/2022/06/Modi-new.jpg", "publishedAt": "2022-06-28T14:42:18Z", "content": "Prime Minister Narendra Modi on Tuesday met UAE’s newly-appointed President and Ruler of Abu Dhabi Sheikh Mohamed bin Zayed Al Nahyan here and the two leaders reiterated their commitment to further d… [+3367 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Udaipur murder: Internet snapped, police ramp up security as city remains tense", "description": "Udaipur murder: Rajasthan Chief Minister Ashok Gehlot has condemned the \"heinous murder\", terming it as a proof of the gruesome form of bigotry.", "url": "https://indianexpress.com/article/cities/jaipur/tailor-hacked-to-death-in-rajasthans-udaipur-top-developments-live-updates-7996918/", "urlToImage": "https://images.indianexpress.com/2022/06/Udaipur-new.jpg", "publishedAt": "2022-06-28T14:38:53Z", "content": "A tailor in Rajasthan’s Udaipur was hacked to death on Tuesday by two persons allegedly for posting a social media statement in favour of suspended BJP spokesperson Nupur Sharma, who had made controv… [+2107 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Dipika Jain", "title": "In overturning Roe v. Wade, US Supreme Court has shown lack of constitutional courage", "description": "The disregard for legal precedent, as well as the elimination of a constitutional regime that weighed both federal and pregnant persons’ interest has serious implications for sexual and reproductive health rights", "url": "https://indianexpress.com/article/opinion/columns/roe-v-wade-us-supreme-court-constitutional-courage-7996930/", "urlToImage": "https://images.indianexpress.com/2022/06/Reuters-1-1-1.jpg", "publishedAt": "2022-06-28T14:35:45Z", "content": "On 24 June 2022, the Supreme Court of the United States (SCOTUS) overturned the landmark Roe v Wade case, which guaranteed abortion as a constitutionally protected right in 1973. The reversal took pl… [+6467 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "দ্রৌপদী মুর্মুর রাষ্ট্রপতি হওয়া আগামী দিনেও এনডিএকে সুবিধা দেবে, জেনে নিন কীভাবে", "description": "নির্বাচিত হওয়ার পর দ্রৌপদী মুর্মুই হবেন দেশের প্রথম আদিবাসী রাষ্ট্রপতি।", "url": "https://bengali.indianexpress.com/general-news/droupadi-murmu-and-future-of-democracy-462899/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/droupadi_murmu.jpg", "publishedAt": "2022-06-28T14:35:18Z", "content": ", , \r\n - ‘’ \r\n , , -\r\n - , Alt News- \r\n, , , , , - \r\n , \r\nRead full story in English\r\nStay updated with the latest news headlines and all the latest General news download Indian Express Bengali App.\r… [+49 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sanath Prasad", "title": "Bengaluru space startup team upbeat as ‘Digantara’ finds mention in PM Modi’s ‘Mann Ki Baat’", "description": "Digantara team all geared up to launch their satellite on PSLV C53 on June 30 to understand radiation in space", "url": "https://indianexpress.com/article/cities/bangalore/bengaluru-space-startup-team-digantara-modi-mann-ki-baat-7996954/", "urlToImage": "https://images.indianexpress.com/2022/06/From-left-Tanveer-Ahmed-Anirudh-Sharma-and-Rahul-Rawat.jpg", "publishedAt": "2022-06-28T14:35:09Z", "content": "Anirudh Sharma and his team were pleasantly surprised after Prime Minister Narendra Modi himself announced their much-awaited first space mission during his monthly Mann Ki Baat episode Sunday. Found… [+2439 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "TikTok couple’s choreography for all iPhone text tones wows netizens", "description": "The husband-wife duo of Austin and Marideth Telenko has left netizens mesmerised across social media platforms with their crisp and eccentric dance moves to ringtones.", "url": "https://indianexpress.com/article/trending/trending-globally/tiktok-couples-choreography-for-all-iphone-text-tones-wows-all-online-7996845/", "urlToImage": "https://images.indianexpress.com/2022/06/ringtone-dance.jpg", "publishedAt": "2022-06-28T14:33:21Z", "content": "Playing your favourite music on your phone and dancing to it might seem nothing special and may spark not enough interest for people online. But how about dancing to the ringtones and tones of text m… [+1456 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Vallabh Ozarkar", "title": "Its chief from the start, Aaditya Thackeray deploys Yuva Sena in the battle over cadre", "description": "Created by Bal Thackeray as vehicle for Aaditya, Yuva Sena is part of the Sena's problems, as per rebels", "url": "https://indianexpress.com/article/political-pulse/chief-from-start-aaditya-thackeray-deploys-yuva-sena-in-the-battle-over-cadre-7996758/", "urlToImage": "https://images.indianexpress.com/2022/06/Aaditya-2.jpg", "publishedAt": "2022-06-28T14:32:33Z", "content": "The youth wing of the party founded by Balasaheb Thackeray as the vehicle for grandson Aaditya in October 2010, who was then just 20, the Yuva Sena continues to be his baby. And as Aaditya takes on t… [+2799 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Priyanka Chopra, Nick Jonas holiday in Turks and Caicos Islands; know more about the place", "description": "Chopra took to Instagram to share a few stunning pictures from their little break in the tropical islands", "url": "https://indianexpress.com/article/lifestyle/destination-of-the-week/priyanka-chopra-nick-jonas-holiday-turks-and-caicos-islands-7993662/", "urlToImage": "https://images.indianexpress.com/2022/06/Priyanka-and-Nick-1200.jpg", "publishedAt": "2022-06-28T14:30:16Z", "content": "Many celebrities are holidaying overseas at the moment, but there is no one like Priyanka Chopra and Nick Jonas, who definitely know how to set travel goals and do it in style, too.Buy Now | Our best… [+2315 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Parimal A Dabhi", "title": "Supreme Court 2002 riots order: BJP says not poll issue, but ‘moral victory’ set to boost party", "description": "As Prime Minister, Modi has chosen not to react to the verdict of a three-judge Bench of the Supreme Court on the same complaint, which upheld the clean chit to his administration for alleged role in “the larger conspiracy” related to the 2002 Gujarat riots.", "url": "https://indianexpress.com/article/political-pulse/supreme-court-2002-riots-order-bjp-elections-7996945/", "urlToImage": "https://images.indianexpress.com/2022/06/Modi-1200-2.jpg", "publishedAt": "2022-06-28T14:28:17Z", "content": "On September 12, 2011, when the Supreme Court had sent the complaint filed by Zakia Jafri against then chief minister Narendra Modi and 62 others back to the Metropolitan Magistrate’s court in Ahmeda… [+5180 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Iga Swiatek extends winning streak to 36", "description": "The 2018 junior champion, who exited the grasscourt Grand Slam in the fourth round last year, had the honour of opening the second day's play on Centre Court in the absence of the retired Ash Barty who won the 2021 title.", "url": "https://indianexpress.com/article/sports/tennis/wimbledon-swiatek-extends-winning-streak-to-36-7996951/", "urlToImage": "https://images.indianexpress.com/2022/06/Swiatek-3.jpg", "publishedAt": "2022-06-28T14:25:04Z", "content": "World number one Iga Swiatek recovered from a dip in her level in the second set to see off Croatian qualifier Jana Fett 6-0 6-3 at Wimbledon on Tuesday and extend her winning run to 36 matches.The 2… [+1024 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "MAYURA JANWALKAR", "title": "Assembly archives intact, CM misguided: Goa Speaker", "description": "On June 17, Sawant had said that records of the Assembly's first session in 1963, and up to 2000, were destroyed when the Assembly was relocated from Adil Shah Palace in Panaji to Porvorim in 2000.", "url": "https://indianexpress.com/article/cities/goa/assembly-archives-intact-cm-misguided-goa-speaker-7996943/", "urlToImage": "https://images.indianexpress.com/2022/06/Tawadkar-Sawant.jpg", "publishedAt": "2022-06-28T14:24:04Z", "content": "Goa Assembly Speaker Ramesh Tawadkar on Tuesday said that archives of the state Assembly were intact and that Chief Minister Pramod Sawant may have been misguided when he said that records of the Hou… [+1247 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Johnny Depp’s spokesperson clears the air on actor’s return to Pirates of the Caribbean franchise", "description": "Recently, there were reports claiming that Johnny Depp was going to sign a 301 million dollar deal to return to the Pirates of the Caribbean franchise.", "url": "https://indianexpress.com/article/entertainment/hollywood/johnny-depps-spokesperson-clears-the-air-on-actors-return-to-pirates-of-the-caribbean-franchise-7996711/", "urlToImage": "https://images.indianexpress.com/2022/06/johny-depp.jpg", "publishedAt": "2022-06-28T14:22:01Z", "content": "Hollywood star Johnny Depp’s future in the Pirates Of The Caribbean franchise remains uncertain, contrary to speculation. Recently, there were reports claiming that the actor was going to sign a 301 … [+1321 chars]"}]}