{"status": "ok", "totalResults": 572, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "CBSE Class 10 English Exam Analysis: Paper rated easy but lengthy, direct questions asked", "description": "The paper was rated easy by experts and students. Some students said that question paper contained direct questions but were lengthy and time consuming.", "url": "https://indianexpress.com/article/education/cbse-class-10-english-exam-analysis-paper-rated-easy-but-lengthy-direct-questions-asked-7889682/", "urlToImage": "https://images.indianexpress.com/2022/04/CBSE-Board-exams.jpg", "publishedAt": "2022-04-27T08:46:14Z", "content": "The Central Board of Secondary Education (CBSE) conducted the Class 10 English term-2 board exam on April 27, 2022. The paper was rated easy by experts and students. Some students that question paper… [+1294 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Chhavi Mittal makes a post-surgery update on her health: ‘I woke up cancer free’", "description": "The 41-year-old mentioned that it was a six-hour-long surgery: \"The worst is over\"", "url": "https://indianexpress.com/article/lifestyle/health/chhavi-mittal-post-surgery-update-health-cancer-free-breast-cancer-7889648/", "urlToImage": "https://images.indianexpress.com/2022/04/Chhavi-Mittal-1200-5.jpg", "publishedAt": "2022-04-27T08:40:26Z", "content": "Chhavi Mittal, who was scheduled to undergo a surgery for her breast cancer, has shared an encouraging update with her fans — she is now cancer-free.The actor, who has been documenting the process on… [+1433 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Mimansa Shekhar", "title": "Zohra Sehgal thought she was ‘ugly’ and not sexy, yet taught us how to live life: ‘She tried hard to attract attention’", "description": "On Zohra Sehgal's 110th birth anniversary, remembering the legend and her impeccable enthusiasm, and how she took unconventional decisions all her life.", "url": "https://indianexpress.com/article/entertainment/bollywood/zohra-sehgal-life-career-inspired-her-fans-defied-age-7888447/", "urlToImage": "https://images.indianexpress.com/2022/04/zohra-sehgal-1200.jpg", "publishedAt": "2022-04-27T08:37:21Z", "content": "“Mujhse kaha hai abhi toh main jawan hoon. Sharam nahi aati? Itni buddhi aurat se kehte ho ‘Abhi toh main jawan hoon’ recite karo. Magar main tumse zyada besharam hoon (I was told to recite ‘Abhi toh… [+5103 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Domestic violence charges on Michael Slater dismissed on mental health grounds", "description": "The 52-year-old Slater, who worked as a television commentator after retiring from international cricket, was charged by New South Wales state police last October with stalking and intimidation of his ex-partner.", "url": "https://indianexpress.com/article/sports/cricket/domestic-violence-charges-on-michael-slater-dismissed-on-mental-health-grounds-7889694/", "urlToImage": "https://images.indianexpress.com/2021/05/michael-slater.jpg", "publishedAt": "2022-04-27T08:34:52Z", "content": "Former Australian Test batter Michael Slater had charges of domestic violence dismissed on mental health grounds in a Sydney local court on Wednesday.Magistrate Ross Hudson ordered Slater to undergo … [+1127 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sofi Ahsan", "title": "Umar Khalid bail plea: Is it proper to use word ‘jumla’ for the PM, asks Delhi High Court", "description": "Delhi High Court said that there has to be “a line” or a “Lakshman rekha” when it comes to criticism of the government.", "url": "https://indianexpress.com/article/cities/delhi/umar-khalid-bail-plea-delhi-high-court-pm-jumla-term-7889686/", "urlToImage": "https://images.indianexpress.com/2022/04/umar-khalid.jpg", "publishedAt": "2022-04-27T08:33:56Z", "content": "While hearing the bail application of student activist Umar Khalid in the larger conspiracy case of northeast Delhi riots, the Delhi High Court on Wednesday asked whether it was proper to use the ter… [+3685 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sanjana Bhalerao", "title": "Mumbai again records over 100 Covid-19 cases, number of tests stagnant", "description": "All the 24 ward officers have been asked to keep an eye on Covid-19 cases and trace up to 15 high-risk contacts of patients and enforce home or institutional quarantine.", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-again-records-over-100-covid-19-cases-number-of-tests-stagnant-7889619/", "urlToImage": "https://images.indianexpress.com/2022/04/mumbai-testing.jpg", "publishedAt": "2022-04-27T08:33:06Z", "content": "After the third wave of Covid-19 ebbed, Mumbai recorded over 100 cases for the first time on Tuesday. However, in the last week, the number of tests conducted in a day have remained stagnant.All the … [+2294 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "‘I just want to help’: Amid chaos, Shanghai residents band together", "description": "In its relentless effort to stamp out the virus, China has relied on hundreds of thousands of low-level party officials in neighborhood committees to arrange mass testing and coordinate transport to hospitals and isolation facilities", "url": "https://indianexpress.com/article/world/i-just-want-to-help-amid-chaos-shanghai-residents-band-together-covid-china-7889671/", "urlToImage": "https://images.indianexpress.com/2022/04/china-covid-2.jpg", "publishedAt": "2022-04-27T08:33:01Z", "content": "Four days into a coronavirus lockdown in her Shanghai neighborhood, Ding Tingting began to worry about the old man who lived alone in the apartment below her. She knocked on his door and found that h… [+6729 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Teen who tracks Musk’s private jet suspects his account will be shut down", "description": "Jack Sweeney, the teenager who built the bot that tracks Musk's jet, says that he will be publishing the same data through Discord and Telegram.", "url": "https://indianexpress.com/article/technology/tech-news-technology/twitter-could-shut-down-jack-sweeney-elon-musk-jet-tracking-bot-elonjet-7889623/", "urlToImage": "https://images.indianexpress.com/2022/04/Jack-sweeney-tracks-Elon-Musk-jet-twitter-elonjet-shut-down-featured.jpg", "publishedAt": "2022-04-27T08:32:50Z", "content": "The bot created by Sweeney uses publicly available ADS-B (Automatic Dependent Surveillance-Broadcast) Exchange and automatically sends out tweets when the billionaire tech entrepreneurs private jet m… [+2211 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "Man appears for an interview during chemo session, photo goes viral", "description": "Calling him an \"inspiration\", many assured him that he'll find his dream job soon adding that the right employer will see his worth.", "url": "https://indianexpress.com/article/trending/trending-in-india/man-appears-for-an-interview-during-chemo-session-photo-goes-viral-7889471/", "urlToImage": "https://images.indianexpress.com/2022/04/man-chemo-therapy-interview.jpg", "publishedAt": "2022-04-27T08:23:09Z", "content": "For most, appearing for a job interview is quite stressful, let alone doing it from a hospital. Showing remarkable resilience, a man has gone viral on LinkedIn for refusing to bow down as he battles … [+1614 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Kerala chief secy to visit Gujarat to study CM dashboard for governance", "description": "The decision to send a high-level delegation to Gujarat to study its \"good governance tool\" comes two weeks after the CPI(M) party congress decided to take the \"Kerala model of development and governance\" across the country.", "url": "https://indianexpress.com/article/india/kerala/kerala-cpim-delegation-in-gujarat-7889615/", "urlToImage": "https://images.indianexpress.com/2022/04/kerala.jpg", "publishedAt": "2022-04-27T08:22:24Z", "content": "In a move that could have political implications, the CPI(M) government in Kerala is sending a high-level delegation to BJP-ruled Gujarat to study its Chief Minister’s Dashboard system for project im… [+1854 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "IPL 2022 GT vs SRH playing XI, match prediction, pitch report: Will GT, SRH continue with their last match Playing XI?", "description": "IPL 2022 GT vs SRH Playing XI Prediction: Gujarat Titans vs Sunrisers Hyderabad Playing XI Updates for Today's IPL Match", "url": "https://indianexpress.com/article/sports/ipl/ipl-2022-gt-vs-srh-playing-xi-match-prediction-pitch-report-7889610/", "urlToImage": "https://images.indianexpress.com/2022/04/GT-vs-SRH.jpg", "publishedAt": "2022-04-27T08:21:08Z", "content": "Gujarat Titans vs Sunrisers Hyderabad (GT vs SRH) Players List: The speed gun radar will be functioning over time when Lockie Fergusons 150 click thunderbolts meet its match in rising pace sensation … [+2471 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Poco F4 GT launched with Snapdragon 8 Gen 1, shoulder triggers and more", "description": "The Poco F4 GT is powered by the Snapdragon 8 Gen 1 chipset and succeeds the Dimensity 1200-powered Poco F3 GT from last year.", "url": "https://indianexpress.com/article/technology/mobile-tabs/poco-f4-gt-launched-with-snapdragon-8-gen-1-shoulder-triggers-and-more-7889652/", "urlToImage": "https://images.indianexpress.com/2022/04/Poco-F4-GT.jpg", "publishedAt": "2022-04-27T08:09:40Z", "content": "Poco announced the Poco F4 GT smartphone earlier this week. The new F-series phone is a performance-oriented phone that is powered by the Snapdragon 8 Gen 1 and targeted at gamers. The phone succeeds… [+2170 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Ludhiana: Five killed as SUV falls into canal, one injured", "description": "The accident happened near the Malaud police station as the car fell into the Sidhwan canal in the intervening night of Monday and Sunday.", "url": "https://indianexpress.com/article/cities/ludhiana/ludhiana-five-killed-as-suv-falls-into-canal-one-injured-7889608/", "urlToImage": "https://images.indianexpress.com/2022/04/Indian-Express-logo-13-4-6.jpg", "publishedAt": "2022-04-27T08:06:43Z", "content": "A car fell into the Sidhwan canal near the Malaud police station in Ludhiana in the intervening night of Monday and Tuesday, killing five of the passengers inside it and injuring the sixth, said the … [+1130 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Leopard spotted in airport area, Daman on alert", "description": "Forest department sources said that this was the first time a leopard was being spotted in Daman and speculated that it probably entered from Gujarat’s Valsad district, where leopards are seen.", "url": "https://indianexpress.com/article/cities/ahmedabad/leopard-spotted-in-airport-area-daman-on-alert-7889552/", "urlToImage": "https://images.indianexpress.com/2022/04/leopard.jpg", "publishedAt": "2022-04-27T08:06:15Z", "content": "A leopard has been sighted in the airport area of the Union Territory of Daman, prompting the district authorities to issue an advisory asking people in the area to be vigilant until the big cat is c… [+5 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Despite tax rebate, women property owners increase only marginally in Pimpri-Chinchwad", "description": "Pune news: According to the PCMC, of the 3.79 lakh people who paid property tax for 2021-22, only 7,992 (2.1 per cent) are women. Of the Rs 633 crore received as property tax for the financial year ended on March 31, women accounted for only Rs 2.2 crore.", "url": "https://indianexpress.com/article/cities/pune/tax-rebate-women-property-owners-pimpri-chinchwad-pune-7889620/", "urlToImage": "https://images.indianexpress.com/2022/04/dda-flat-fb.jpg", "publishedAt": "2022-04-27T08:05:35Z", "content": "Despite Pimpri-Chinchwad Municipal Corporation’s (PCMC) rebate in tax for women property owners, properties registered in the name of women have not increased substantially in areas under its jurisdi… [+1755 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Janardhan Koushik", "title": "Chennai: Fire breaks at Rajiv Gandhi hospital, no injuries", "description": "Tamil Nadu Health and Family Welfare Minister Ma Subramanian and Health Secretary J Radhakrishan reached the spot to oversee rescue work and to ensure that hospital services are not disrupted.", "url": "https://indianexpress.com/article/cities/chennai/chennai-fire-breaks-at-rajiv-gandhi-hospital-no-injuries-7889649/", "urlToImage": "https://images.indianexpress.com/2022/04/Chennai-rajiv-gandhi-fire.jpg", "publishedAt": "2022-04-27T08:02:03Z", "content": "A fire broke out at the Rajiv Gandhi Government General Hospital in Chennai Wednesday morning. Multiple fire tenders were pressed into service to douse the flame. There were no reports of injury in t… [+1270 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "ECB advertises for separate red and white-ball coaching job", "description": "The split in roles is on expected lines as Rob Key had previously called for it while working as a pundit.", "url": "https://indianexpress.com/article/sports/cricket/ecb-advertises-for-separate-red-and-white-ball-coaching-job-7889639/", "urlToImage": "https://images.indianexpress.com/2021/09/ECB-office-_800x600.jpg", "publishedAt": "2022-04-27T07:55:11Z", "content": "England are set to return to a split-coaching structure after ECB’s new Managing Director Rob Key made his first major decision by advertising for two new head coaches.The split in roles is on expect… [+1256 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Effective ways to manage health problems in children during summer", "description": "Summer can be worrisome not only for adults but even for children too. There are a plethora of health problems that children can encounter during those sunny days.", "url": "https://indianexpress.com/article/lifestyle/health/manage-health-problems-children-summer-heat-7882669/", "urlToImage": "https://images.indianexpress.com/2022/03/GettyImages-children-COVID19-symptoms_1200.jpg", "publishedAt": "2022-04-27T07:50:19Z", "content": "Summercan be worrisome not only for adults but also for children. There are numerous health problems that children can encounter during the hot and humid season, and these include certain allergies a… [+3001 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Komal RJ Panchal", "title": "Fact check: Will Smith did not meet Sadhguru in Mumbai on his recent trip to India", "description": "After several reports claimed that Hollywood star Will Smith was recently in India to meet Sadhguru, the latter's team has confirmed that the news is not true.", "url": "https://indianexpress.com/article/entertainment/hollywood/fact-check-will-smith-did-not-meet-sadhguru-in-mumbai-on-his-recent-trip-to-india-7889250/", "urlToImage": "https://images.indianexpress.com/2022/04/Will-Smith-Sadhguru-J.-Vasudeva.jpeg", "publishedAt": "2022-04-27T07:43:48Z", "content": "Ever since pictures of Hollywood star Will Smith exiting Kalina airport in Mumbai surfaced on the internet, there has been speculation that the actor had come to India to meet spiritual guru Sadhguru… [+2719 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Thanjavur temple accident: PM Modi, Tamil Nadu CM MK Stalin announce compensation to families of deceased", "description": "Tamil Nadu Chief Minister M K Stalin, who left Chennai to meet the injured at Thanjavur, announced Rs 5 lakh as solatium from the Chief Minister’s Public Relief Fund to the families of the deceased.", "url": "https://indianexpress.com/article/cities/chennai/thanjavur-temple-chariot-procession-accident-modi-stalin-announce-compensation-7889607/", "urlToImage": "https://images.indianexpress.com/2022/04/Thanjavur-1.jpg", "publishedAt": "2022-04-27T07:38:33Z", "content": "Tamil Nadu Chief Minister M K Stalin, who left Chennai to meet the injured at Thanjavur, announced Rs 5 lakh as solatium from the Chief Ministers Public Relief Fund to the families of the deceased. T… [+2655 chars]"}]}