{"status": "ok", "totalResults": 396, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "On Sushant Singh Rajput’s second death anniversary, all the major players from Rhea Chakraborty to Siddharth Pithani and where they are now", "description": "Two weddings, a career comeback, and many broken hearts. On the second death anniversary of Sushant Singh Rajput, here's looking at some of the people who became household names in the aftermath of his death, and what they're doing now.", "url": "https://indianexpress.com/article/entertainment/bollywood/sushant-singh-rajput-death-anniversary-siddharth-pithani-rhea-chakraborty-samuel-haokip-where-are-they-now-7962769/", "urlToImage": "https://images.indianexpress.com/2022/06/sushant-singh-rajput-death-anniversary.jpg", "publishedAt": "2022-06-14T02:50:46Z", "content": "June 14th marks the second death anniversary of actor Sushant Singh Rajput, who died at the age of 34 in 2020. He was found hanging in the bedroom of his Mumbai apartment, and his death was initially… [+5736 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sushant Kulkarni", "title": "Named in Sidhu Moosewala’s killing, Pune man held in Kutch, had a makeover", "description": "Pune Police investigation has also revealed that the Lawrence Bishnoi gang, which is suspected to have orchestrated Sidhu Moosewala's murder, has its footprints in Maharashtra as well.", "url": "https://indianexpress.com/article/cities/pune/named-in-sidhu-moosewalas-killing-pune-man-held-in-kutch-had-a-makeover-7968267/", "urlToImage": "https://images.indianexpress.com/2022/06/cats-25.jpg", "publishedAt": "2022-06-14T02:46:02Z", "content": "DAYS after he was named as one of the alleged shooters in the murder of Sidhu Moosewala in Punjab last month, Pune Rural Police on Sunday arrested 23-year-old Santosh Jadhav from a small village in K… [+4946 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "When Kirron Kher revealed she divorced her husband to marry Anupam Kher: ‘He had nothing then’", "description": "On Kirron Kher's birthday, here's looking back at her marriage with Anupam Kher.", "url": "https://indianexpress.com/article/entertainment/bollywood/when-kirron-kher-revealed-she-divorced-her-husband-to-marry-anupam-kher-7966988/", "urlToImage": "https://images.indianexpress.com/2021/08/Anupam-Kher-wishes-wife-Kirron-Kher-a-happy-36th-wedding-anniversary-1200.jpg", "publishedAt": "2022-06-14T02:45:25Z", "content": "Veteran actors Kirron Kher and Anupam Kher have been married since 1985 and are parents to son Sikandar, from Kirron’s first marriage with Gautam Bery. The couple has weathered innumerable storms in … [+3414 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Rajasthan: BJP councillor resigns from party over Nupur Sharma’s Prophet remark", "description": "Tabassum Mirza, BJP's councillor from ward number 14 of Kota Municipal Corporation, South, on Monday sent her resignation letter to party's state unit chief Satish Poonia and Kota district president Krishan Kumar Soni, mentioning the reason behind her resigna…", "url": "https://indianexpress.com/article/cities/jaipur/rajasthan-bjp-councillor-resigns-nupur-sharma-prophet-remark-7968224/", "urlToImage": "https://images.indianexpress.com/2022/06/279093882_1445146752603338_5686282835462058302_n-3.jpg", "publishedAt": "2022-06-14T02:43:09Z", "content": "Tabassum Mirza, BJP’s councillor from ward number 14 of Kota Municipal Corporation, South, on Monday sent her resignation letter to party’s state unit chief Satish Poonia and Kota district president … [+1036 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "US: Floods at Yellowstone National Park wipe out roads, bridges, strand visitors", "description": "Flooding has wiped out roads and bridges and closed off all entrances to Yellowstone National Park at the onset of the busy summer tourist season", "url": "https://indianexpress.com/article/world/yellowstone-national-park-floods-united-states-7968254/", "urlToImage": "https://images.indianexpress.com/2022/06/yellowstone.jpg", "publishedAt": "2022-06-14T02:40:55Z", "content": "Massive floodwaters ravaged Yellowstone National Park and nearby communities Monday, washing out roads and bridges, cutting off electricity and forcing visitors to evacuate parts of the iconic park a… [+5515 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "How Covid did away with the sick day in America", "description": "In the United States, a survey of hourly workers this spring found that two-thirds of those who had been sick with Covid-19 or other illnesses went to work while sick, according to the Shift Project at Harvard, a research project on work scheduling.", "url": "https://indianexpress.com/article/world/how-covid-did-away-with-the-sick-day-in-america-7968256/", "urlToImage": "https://images.indianexpress.com/2022/06/America-covid-sick-days.jpg", "publishedAt": "2022-06-14T02:39:55Z", "content": "The tone of the typical isolation postcard is sunny, insistent and aspirational as a holiday greeting: Thanks to everyone who sent well wishes for @VP, wrote Doug Emhoff, the second gentleman, on Twi… [+7586 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kamaldeep Singh Brar", "title": "No info on ban on hoisting foreign flag or cheering foreign team: Ministry of Home Affairs", "description": "Kashmiri students and others were booked and arrested under sedition in Uttar Pradesh for allegedly celebrating Pakistan's win over India in T20 World Cup cricket match in October last year.", "url": "https://indianexpress.com/article/cities/chandigarh/no-info-on-ban-on-hoisting-foreign-flag-or-cheering-foreign-team-ministry-of-home-affairs-7968233/", "urlToImage": "https://images.indianexpress.com/2022/06/indian-flag-1.jpg", "publishedAt": "2022-06-14T02:29:52Z", "content": "The Centre has said that it has no information about any ban on hoisting a foreign flag within the Union of India. Also, there is no information if there is any list of foreign sports teams or indivi… [+2420 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "As China rattles sabres, Taiwan asks: are we ready for war?", "description": "To many in Taiwan, Ukraine has been a lesson in the tactics and weaponry that could slow a more powerful invading force. It has also been a stark warning that the island may be inadequately prepared for a full-scale attack.", "url": "https://indianexpress.com/article/world/as-china-rattles-sabres-taiwan-asks-are-we-ready-for-war7968205/", "urlToImage": "https://images.indianexpress.com/2022/06/TAIWAN-MILITARY-STRATEGY-2.jpg", "publishedAt": "2022-06-14T02:26:26Z", "content": "Russias brutal war in Ukraine has jolted Taiwan into confronting the spectre of a sudden attack from the islands own larger and more powerful neighbour: China.The invasion has given new weight to the… [+11180 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "While You Were Asleep: Australia qualify for Qatar 2022, Croatia shock winless France, Ronaldo pens down heartfelt note to Marcelo", "description": "More than a teammate, a brother that football gave me, wrote Cristiano Ronaldo in an emotional note to former Real Madrid teammate Marcelo; Australia have reached their fifth consecutive World Cup.", "url": "https://indianexpress.com/article/sports/football/while-you-were-asleep-cristiano-pens-down-heartfelt-note-to-marcelo-australia-qualify-for-qatar-2022-croatia-shock-winless-france-7968240/", "urlToImage": "https://images.indianexpress.com/2022/06/While-You-Were-Asleep-7.jpg", "publishedAt": "2022-06-14T02:21:59Z", "content": "Australia have qualified for the 2022 World Cup following a 5-4 penalty shootout win over Peru in their intercontinental playoff on Monday.\r\nThe moment that the @Socceroos qualified for their fifth c… [+3078 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Toronto van attacker sentenced to life in prison", "description": "Alek Minassian, 29, was found guilty last year of murdering 10 people and attempting to murder 16 in the Toronto van attack in 2018.", "url": "https://indianexpress.com/article/world/canada-toronto-van-attacker-2018-sentenced-to-life-in-prison-7968211/", "urlToImage": "https://images.indianexpress.com/2022/06/toronto-van.jpg", "publishedAt": "2022-06-14T02:18:57Z", "content": "Alek Minassian, 29, was found guilty last year of murdering 10 people and attempting to murder 16. One of the 16 later died in connection with injuries she suffered in the attack and a judge said on … [+1960 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Ukraine’s grip on key eastern city appears to slip further", "description": "The Ukrainian government has poured troops and resources into its effort to hold on to Sievierodonetsk, a strategically important, industrial city and the last major urban center in the region of Luhansk that has not yet fallen.", "url": "https://indianexpress.com/article/world/ukraines-grip-on-key-eastern-city-appears-to-slip-further-russia-7968235/", "urlToImage": "https://images.indianexpress.com/2022/06/Ukraine-eastern-city-slips-further.jpg", "publishedAt": "2022-06-14T02:18:47Z", "content": "Russian forces have pushed Ukrainian troops from the center of Sievierodonetsk, the Ukrainian military said Monday, as Ukraines grip on the strategic eastern city appeared to weaken further.\r\nThe Ukr… [+2875 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Rahul Gandhi questioned: Chandigarh Congress protests at ED office", "description": "The Congress party alleged \"Misuse of the law enforcement agencies by the BJP led union government and unwarranted and unnecessary summoning of Rahul Gandhi by the Enforcement Directorate, New Delhi in the National Herald\" case.", "url": "https://indianexpress.com/article/cities/chandigarh/rahul-gandhi-ed-summon-national-herald-case-congress-party-protests-punjab-7968228/", "urlToImage": "https://images.indianexpress.com/2022/06/chandigarh-congress.jpg", "publishedAt": "2022-06-14T02:04:54Z", "content": "Many workers and activists of the Chandigarh Congress staged a peaceful protest in front of the office of the Enforcement Directorate (ED), Sector 18, Chandigarh, since 10 am on Monday.The Congress p… [+1069 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Nitin Sharma", "title": "Khelo India: Haryana girls shine as boxers help state lift the championship trophy, prize money doubled", "description": "At the end of the day, the biggest cheer was reserved for the boxers when Union minister of sports Anurag Thakur handed over the trophy to boxers and other players at the Fourth Khelo India Youth Games at the Indradhanush Auditorium in Sector 5.", "url": "https://indianexpress.com/article/cities/panchkula/khelo-india-haryana-girls-shine-as-boxers-help-state-lift-the-championship-trophy-7968219/", "urlToImage": "https://indianexpress.com/wp-content/themes/indianexpress/images/IE-OGimage.jpg", "publishedAt": "2022-06-14T01:53:20Z", "content": "Haryana boxers hogged the limelight on the last day of the Khelo India Youth Games here on Monday, with a few more girls becoming the state’s pride and joy by bagging gold medals in different boxing … [+2620 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Punjab: Two more arrested in Dera Bassi robbery case", "description": "On June 10, four persons snatched Rs 1 crore from Nagpal, a Dera Bassi-based property dealer, and shot at a fruit vendor who had tried to nab the culprits.", "url": "https://indianexpress.com/article/cities/sas-nagar-mohali/two-more-arrested-in-dera-bassi-robbery-case-7968216/", "urlToImage": "https://images.indianexpress.com/2022/06/robbery.jpg", "publishedAt": "2022-06-14T01:41:33Z", "content": "Mohali police on Monday arrested two more persons in the armed robbery case at Dera Bassi and and have now recovered a total Rs 68 lakh from the accused. The arrested were identified as Maninderjeet … [+1249 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "On school bus association’s petition, HC issues contempt notice to Chandigarh Advisor", "description": "The order came after a contempt petition was filed by the Chandigarh School Bus Operator Welfare Association, through its president, Manjit Singh Saini, for non-compliance with an earlier judgment passed on February 10, 2022.", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-haryana-high-court-chandigarh-advisor-covid-schools-buses-contempt-notice-7968210/", "urlToImage": "https://images.indianexpress.com/2022/06/Dharam-Pal-2.jpg", "publishedAt": "2022-06-14T01:31:37Z", "content": "The Punjab and Haryana High Court issued notice to the UT Advisor Dharam Pal, to show cause as to why contempt proceedings under the Contempt of Courts Act, 1971 be not initiated against him. The not… [+2125 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Uma Thurman, Henry Golding board The Old Guard 2", "description": "Uma Thurman and Henry Golding join previously announced returning cast members Theron, KiKi Layne, Matthias Schoenaerts, Marwan Kenzari, Luca Marinelli, Veronica Ngo and Chiwetel Ejiofor, who reprise their roles from the 2020 movie The Old Guard.", "url": "https://indianexpress.com/article/entertainment/hollywood/uma-thurman-henry-golding-board-the-old-guard-2-7966731/", "urlToImage": "https://images.indianexpress.com/2022/06/Uma-Thurman-and-Henry-Golding-n-1200by667.jpg", "publishedAt": "2022-06-14T01:30:52Z", "content": "Hollywood icon Uma Thurman and Crazy Rich Asians star Henry Golding are set to join Netflix film The Old Guard 2, fronted by Charlize Theron.The duo join previously announced returning cast members T… [+1263 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mayawati: Bulldozing houses unlawful, targeted against one community", "description": "Mayawati also demanded the “immediate arrest” of Nupur Sharma and Naveen Jindal for their remarks on the Prophet.", "url": "https://indianexpress.com/article/cities/lucknow/mayawati-bulldozing-houses-unlawful-targeted-one-community-7968208/", "urlToImage": "https://images.indianexpress.com/2022/06/mayawati-2.jpg", "publishedAt": "2022-06-14T01:30:15Z", "content": "Accusing the BJP government in Uttar Pradesh of targeting one particular community, Bahujan Samaj Party (BSP) chief Mayawati on Monday called the use of bulldozers to demolish properties unjust and u… [+1567 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Chennai power cut today: These parts of city to face power disruption", "description": "Chennai power disruption June 14, Tuesday: Parts of Chennai will face a power cut from 9 am to 2 pm for maintenance work today.", "url": "https://indianexpress.com/article/cities/chennai/chennai-power-cut-today-these-parts-of-city-to-face-power-disruption-7965790/", "urlToImage": "https://images.indianexpress.com/2022/06/electricity-reuters-1200-2-1-6.jpeg", "publishedAt": "2022-06-14T01:30:04Z", "content": "The Tamil Nadu Generation and Distribution Corporation (Tangedco) has announced that power will be suspended in parts of Chennai today in Anna Nagar, Mylapore, Ambattur, Porur, Guindy, Perungudi, KK … [+1712 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Peter Vidal", "title": "Horoscope Today, June 14 2022: Leo, Libra, Virgo and other signs — check astrological prediction", "description": "Daily Horoscope, June 14, 2022: Leo, don't expect any let-up of daily pressures in the long-term, even if today's stars are more relaxed than usual.", "url": "https://indianexpress.com/article/horoscope/horoscope-today-june-14-2022-leo-libra-virgo-and-other-signs-check-astrological-prediction-7968206/", "urlToImage": "https://images.indianexpress.com/2022/06/horoscope-1-1.jpg", "publishedAt": "2022-06-14T01:16:58Z", "content": "Mars has now commenced a new cycle which is going to lift your morale and give you a massive shot in the arm – but only if you turn your attention to all unfinished business and left-over tasks. The … [+3463 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mohali reports month’s first Covid death; Chandigarh Admin asks people to mask up", "description": "Chandigarh has seen a significant increase in Covid-19 cases in the past week. The administration has been encouraging people to get their booster dose and has also directed for children to be vaccinated.", "url": "https://indianexpress.com/article/cities/panchkula/punjab-news-covid-cases-deaths-chandigarh-mohali-panchkula-masks-coronavirus-7968202/", "urlToImage": "https://images.indianexpress.com/2022/06/covid-19-3.jpg", "publishedAt": "2022-06-14T01:06:36Z", "content": "A day after the health department had warned of a spike in the number of Covid-19 cases in the district, one death was reported due to the infection on Monday. The last death due to Covid-19 in Mohal… [+1870 chars]"}]}