{"status": "ok", "totalResults": 908, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Heatwave in Bengal, Met says no respite till this weekend", "description": "Purulia’s maximum temperature of 44.3 degrees Celsius meant a departure of 6.5 degrees above normal, while that of Asansol (42.6 degrees C) in Paschim Bardhaman, Jhargram (42 degrees C) and Bankura (42.4 degrees C) was 4.5 notches above average.", "url": "https://indianexpress.com/article/cities/kolkata/heatwave-in-bengal-met-says-no-respite-till-this-weekend-7892480/", "urlToImage": "https://images.indianexpress.com/2022/04/HEAT-4-1-2.jpg", "publishedAt": "2022-04-28T22:50:05Z", "content": "Purulia at the edge of Chota Nagpur plateau recorded a searing 44.3 degrees Celsius, the highest maximum temperature on Thursday in West Bengal, as its neighbouring districts of Bankura, Jhargram and… [+1489 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Will think of cutting fuel tax when we get remaining GST share: Aaditya Thackeray", "description": "“Once that is (GST) received the state can think of reducing VAT,” he said.", "url": "https://indianexpress.com/article/cities/mumbai/will-think-of-cutting-fuel-tax-when-we-get-remaining-gst-share-aaditya-thackeray-7892484/", "urlToImage": "https://images.indianexpress.com/2022/04/AADITYA-1.jpg", "publishedAt": "2022-04-28T22:43:19Z", "content": "A day after Prime Minister Narendra Modi raised the issue of high fuel prices in opposition-ruled states which did not heed the Centres call to reduce Value Added Tax on petrol and diesel, State Envi… [+504 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mumbai: 22-year-old man arrested for murder of pregnant woman", "description": "The incident took place at around 1.30 pm on Wednesday. The police said that the accused, Arjun Sonkar, and his cousin Sanjay worked for a prominent tea vendor at Kalachowkie.", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-22-year-old-man-arrested-for-murder-of-pregnant-woman-7892468/", "urlToImage": "https://images.indianexpress.com/2022/04/Express-Representational-Image-31.jpeg", "publishedAt": "2022-04-28T22:33:11Z", "content": "The Kurla police has arrested a 22-year-old man for allegedly killing an eight-month pregnant woman. The police said that the accused, a cousin of the 20-year-old deceased’s husband, confessed to the… [+1724 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Displaced tribals awarded land lease deeds in Dang villages", "description": "The plots were leased for 99 years at a token amount of Re 1. The families have been staying in houses built on the land for long but had no documents. As per the lease agreement, the descendents cannot sell the houses to others.", "url": "https://indianexpress.com/article/cities/surat/displaced-tribals-awarded-land-lease-deeds-in-dang-villages-7892477/", "urlToImage": "https://images.indianexpress.com/2022/04/Gujarat-dang-4col.jpg", "publishedAt": "2022-04-28T22:32:12Z", "content": "State tribal minister Naresh Patel Thursday distributed hakk patrak (lease deeds) to 242 families who are the descendants of 42 families displaced from Saputara to the neighbouring Navagam village in… [+2440 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "From environmental concern to practical use: study shows old masks can strengthen cement", "description": "Production of cement is a carbon-intensive process, responsible for 8% of carbon emissions worldwide. If concrete is reinforced with microfibres, it can potentially reduce the amount of cement needed for a project, or make the concrete last longer, saving car…", "url": "https://indianexpress.com/article/explained/study-shows-old-masks-can-strengthen-cement-7892297/", "urlToImage": "https://images.indianexpress.com/2022/04/Explained-paperclip.jpg", "publishedAt": "2022-04-28T22:32:01Z", "content": "With single-use masks during the pandemic now presenting an environmental problem, researchers have demonstrated the idea of incorporating old masks into a cement mixture to create stronger, more dur… [+2466 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aashish Aryan", "title": "‘106 net shutdowns in India in 2021’", "description": "There were at least 182 documented internet shutdowns during 2021in 34 countries, as against 159 documented across 29 nations in 2020, as per the report.", "url": "https://indianexpress.com/article/business/commodities/106-net-shutdowns-in-india-in-2021-7892346/", "urlToImage": "https://images.indianexpress.com/2022/04/internet-1.jpg", "publishedAt": "2022-04-28T22:31:09Z", "content": "India enforced as many as 106 internet shutdowns last year and was on top of the list of nations that applied internet shutdowns for the fourth year in a row, as per a report published by Access Now … [+1427 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pranav Mukul", "title": "In a first, IndiGo uses Indian navigation system to land aircraft", "description": "The test flight that landed at Kishangarh is a part of the approval process with aviation safety regulator DGCA, which includes training of pilots, validation of approach and simulator sessions.", "url": "https://indianexpress.com/article/business/aviation/in-a-first-indigo-uses-indian-navigation-system-to-land-aircraft-7892360/", "urlToImage": "https://images.indianexpress.com/2022/04/indigo-1200.jpg", "publishedAt": "2022-04-28T22:30:38Z", "content": "An IndiGo-operated ATR 72-600 aircraft landed at Kishangarh airport Thursday, using an approach process guided by India’s own satellite-based augmentation system named GAGAN, or GPS-aided GEO Augment… [+3937 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sourav Roy Barman", "title": "From Vedic maths to zoonotic diseases: What ministries want in school curriculum", "description": "The suggestions are being examined by experts involved in revising the National Curriculum Framework (NCF), which will subsequently inform the changes in the NCERT textbooks. Education Minister Dharmendra Pradhan is in Bengaluru to hold discussions with membe…", "url": "https://indianexpress.com/article/education/from-vedic-maths-to-zoonotic-diseases-new-school-curriculum-national-curriculum-framework-ncert-textbooks-7892321/", "urlToImage": "https://images.indianexpress.com/2022/04/books759.jpg", "publishedAt": "2022-04-28T22:30:33Z", "content": "AN ONGOING inter-ministerial consultation on revising the countrys school curriculum has seen a push to incorporate emerging topics such as catastrophic consequences of zoonotic diseases, vedic mathe… [+3757 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sandeep Singh, George Mathew", "title": "Explained: After revised pricing, should you invest in LIC’s IPO?", "description": "LIC on Wednesday priced its IPO, the largest in the history of the capital market despite a reduction in size, at Rs 902-949 per share. LIC has offered a discount of Rs 60 for policyholders and Rs 45 for retail investors and employees. The IPO will open on Ma…", "url": "https://indianexpress.com/article/explained/after-revised-pricing-should-you-invest-in-lics-ipo-7892264/", "urlToImage": "https://images.indianexpress.com/2022/04/LIC-IPO.jpeg", "publishedAt": "2022-04-28T22:30:20Z", "content": "How is the IPO priced?\r\nLIC on Wednesday priced its IPO, the largest in the history of the capital market despite a reduction in size, at Rs 902-949 per share. LIC has offered a discount of Rs 60 for… [+5307 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aanchal Magazine, Karunjit Singh", "title": "Explained: States vs Centre on fuel taxes petrol diesel price hike", "description": "The Prime Minister has noted that certain states have not reduced VAT; states have attributed rising fuel prices to central taxes. How is fuel taxed, and how are collections shared between the Centre and states?", "url": "https://indianexpress.com/article/explained/states-vs-centre-on-fuel-taxes-petrol-diesel-price-hike-7892286/", "urlToImage": "https://images.indianexpress.com/2022/04/fuel-price.jpeg", "publishedAt": "2022-04-28T22:30:03Z", "content": "The Centre and the states are at loggerheads over taxes and duties on petrol and diesel. While the Centre feels the states are not reducing VAT in line with the Centre’s cut in excise duty, the state… [+6826 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Nirupama Subramanian", "title": "Need more India visas… Afghans feel abandoned: Saad Mohseni, business baron", "description": "Mohseni, whose Moby Group is based in Dubai, said the Afghan people had always believed they shared a special bond with India. “They are now feeling quite betrayed, they are feeling abandoned” he said.", "url": "https://indianexpress.com/article/india/need-more-india-visas-afghans-feel-abandoned-saad-mohseni-7892394/", "urlToImage": "https://images.indianexpress.com/2022/04/Afghan-media-baron-Saad-Mohseni.jpg", "publishedAt": "2022-04-28T22:29:15Z", "content": "The Afghan people are feeling betrayed by Delhi shutting its doors on them, allowing just a few to enter India in the last eight months since the Taliban takeover of the country, said Saad Mohseni, t… [+4533 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Laxman Singh", "title": "Mumbai needs single planning authority for long-term development: Aaditya Thackeray", "description": "Considering increase in extreme weather events like heavy rainfall and flooding faced by the city, the development of Mumbai should be planned for the next 50 years, he added.", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-needs-single-planning-authority-for-long-term-development-aaditya-thackeray-7892467/", "urlToImage": "https://images.indianexpress.com/2022/04/AADITYA.jpg", "publishedAt": "2022-04-28T22:28:45Z", "content": "For long-term sustainable development and to curtail delay in execution of projects, Mumbai needs a single planning authority, state environment minister Aaditya Thackeray said on Thursday. Consideri… [+2662 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "Reporting cyber incidents in 6 hrs mandatory", "description": "The new guidelines issued by CERT-In to companies operating in India say that service providers, intermediaries, data centres, companies and government organisations must mandatorily report such incidents within six hours.", "url": "https://indianexpress.com/article/business/reporting-cyber-incidents-in-6-hrs-mandatory-7892344/", "urlToImage": "https://images.indianexpress.com/2022/04/cyber-women.jpg", "publishedAt": "2022-04-28T22:27:54Z", "content": "The Indian Computer Emergency Response Team (CERT-In) has mandated that all cybersecurity incidents such as targeted scanning or probing of critical networks and systems, compromise of critical syste… [+1595 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Rajkot civic body launches drive to check illegal pumping of water", "description": "As per the latest data shared by the RMC, teams of the civic body have checked a total 9,163 water connections, including 4,041 in a single day on April 25. In all, the teams detected 144 cases of people pumping water directly from distribution lines with the…", "url": "https://indianexpress.com/article/cities/rajkot/rajkot-civic-body-launches-drive-to-check-illegal-pumping-of-water-7892475/", "urlToImage": "https://images.indianexpress.com/2022/04/RMC-3col.jpg", "publishedAt": "2022-04-28T22:27:11Z", "content": "WITH THE summer peaking and water demand going up in the city, the Rajkot Municipal Corporation (RMC) has launched a drive to check illegal drawal of water and are fining those found wasting water fr… [+1342 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "George Mathew", "title": "To plug support package loopholes, Nabard plans farmer distress index", "description": "Index won’t be uniform since stress levels vary", "url": "https://indianexpress.com/article/business/banking-and-finance/nabard-plans-farmer-distress-index-7892329/", "urlToImage": "https://images.indianexpress.com/2022/04/farming.jpg", "publishedAt": "2022-04-28T22:25:41Z", "content": "The National Bank for Agriculture and Rural Development (Nabard) is planning to formulate a farmer distress index (FDI) to track, identify and support needy and distressed farmers.Depending on the le… [+2741 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Congress charges baseless, targeting me due to my popularity: Rupani on Rs 27,000-cr ‘land scam’ in Surat", "description": "According to Congress, Rupani signed the note on November 21, 2019, giving instruction to reserve 75.35 lakh square metres of land, out of the 1.66 crore square metres proposed to be kept reserved under civic amenities as per the development plan prepared by …", "url": "https://indianexpress.com/article/cities/ahmedabad/congress-charges-baseless-rupani-on-rs-27000-cr-land-scam-in-surat-7892474/", "urlToImage": "https://images.indianexpress.com/2022/04/Vijay-Rupani-2.jpg", "publishedAt": "2022-04-28T22:21:40Z", "content": "A day after Congress accused former Gujarat Chief Minister Vijay Rupani of being part of a Rs 27,000-crore land scam regarding government land offered to builders, Rupani Thursday termed the allegati… [+3083 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Soumyarendra Barik", "title": "Support plan for chip companies: Import curbs, local sourcing for electronics", "description": "“Apart from offering financial incentives to companies to set up semiconductor fabs in the country, we could potentially encourage that products made in India will have to use semiconductors made here,” the official said.", "url": "https://indianexpress.com/article/business/companies/support-plan-for-chip-companies-import-curbs-local-sourcing-for-electronics-7892338/", "urlToImage": "https://images.indianexpress.com/2022/04/Semiconductors-Reuters-2col.jpg", "publishedAt": "2022-04-28T22:21:28Z", "content": "In addition to the financial incentives being provided to set up semiconductor manufacturing capacity in the country, the government could encourage manufacturers of electronic products to use made-i… [+2069 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "Let them learn", "description": "Kerala move to study Gujarat scheme stokes political controversy. But states must share ideas to improve governance", "url": "https://indianexpress.com/article/opinion/editorials/kerala-move-to-study-gujarat-scheme-stokes-political-controversy-7892236/", "urlToImage": "https://images.indianexpress.com/2022/04/editorial-34.jpeg", "publishedAt": "2022-04-28T22:17:22Z", "content": "Kerala’s Pinarayi Vijayan-led government has done well to ignore the Opposition’s barbs on sending the chief secretary, V P Joy, to Gujarat to study the latter’s dashboard scheme. Joy, who arrived in… [+2148 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Surat gas leak: HC notice to govt authorities on PIL seeking panel to probe", "description": "The petitioner is also seeking the court's direction to invoke Prevention of Corruption Act in the FIR against police officials and other government officials who may be found in the investigation to have colluded with the erring companies and individuals.", "url": "https://indianexpress.com/article/cities/ahmedabad/surat-gas-leak-hc-notice-to-govt-authorities-on-pil-seeking-panel-to-probe-7892472/", "urlToImage": "https://images.indianexpress.com/2022/04/2021-04-171-4.jpg", "publishedAt": "2022-04-28T22:17:04Z", "content": "A division bench of the Gujarat High Court on Thursday issued notice to multiple government authorities and others on a public interest litigation seeking to form a committee to inquire the death of … [+1723 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aditi Raja", "title": "Central team begins scrutiny of Covid-19 ex gratia applications", "description": "On Wednesday, the three-member team went through 350 files of applications received at the Vadodara district collectorate from individuals seeking the Rs 5,0000 ex gratia compensation directed by the Supreme Court in November last year.", "url": "https://indianexpress.com/article/cities/baroda/central-team-begins-scrutiny-of-covid-19-ex-gratia-applications-7892466/", "urlToImage": "https://images.indianexpress.com/2022/04/covid-death-1.jpg", "publishedAt": "2022-04-28T22:14:21Z", "content": "A three-member team of the Central government has begun random scrutiny of Covid-19 ex gratia applications in various districts of Gujarat to ascertain if any fake compensation claims were approved b… [+3350 chars]"}]}