{"status": "ok", "totalResults": 383, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Days before bypoll, Tripura Congress nominee attacked with bricks", "description": "The incident took place late on Sunday when the nominee, Sudip Roy Barman, visited the house of Congress worker Alok Goswami, whose house came under attack by a group of youths on Sunday night, a police officer said.", "url": "https://indianexpress.com/article/india/agartala-bypoll-tripura-congress-nominee-attacked-bricks-7979673/", "urlToImage": "https://images.indianexpress.com/2022/06/tripura-congress.jpg", "publishedAt": "2022-06-20T06:43:25Z", "content": "Congress nominee from Agartala Assembly constituency for an upcoming by-election, Sudip Roy Barman, suffered injuries after miscreants attacked him with bricks at Ujan Abjoynagar here, police said on… [+1785 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "Watch: Assam man builds mobile shop on banana plant raft to earn a living in floods", "description": "Carrying essential items like water and candles along with tamul (betel nut) leaves, Dhaneshwar Das has been floating on his movable shop in the inundated areas of Rukmini Goan.", "url": "https://indianexpress.com/article/trending/trending-in-india/assam-man-builds-mobile-shop-on-banana-plant-raft-to-earn-a-living-in-floods-7979538/", "urlToImage": "https://images.indianexpress.com/2022/06/assam-mobile-shop.jpg", "publishedAt": "2022-06-20T06:35:59Z", "content": "Heavy flooding has disrupted the lives of people in Assam and residents have been grappling with new challenges every day. However, showing a resilient side with a dash of creativity, a paan shop own… [+1992 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Petrol and diesel prices on June 20: Check out fuel rates in your city", "description": "Petrol and diesel prices: In Delhi, a litre of petrol costs Rs 96.72, while that of diesel costs Rs 89.62. In Mumbai petrol stands at Rs 111.35 per litre, while diesel is available for Rs 97.28. Keep reading to find out fuel prices in your city today.", "url": "https://indianexpress.com/article/business/commodities/petrol-diesel-fuel-prices-today-june-20-7979520/", "urlToImage": "https://images.indianexpress.com/2022/05/petrol.jpg", "publishedAt": "2022-06-20T06:33:28Z", "content": "Petrol Diesel Prices Today: For the 29th day in a row, petrol and diesel prices remained steady across the country on Monday, June 20, 2022.The rates of the two motor fuels were last changed on May 2… [+2364 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "IMF delegation visits crisis-hit Sri Lanka with time running out", "description": "Prime Minister Ranil Wickremesinghe said this month an IMF programme is crucial to access bridge financing from sources such as the World Bank and Asian Development Bank.", "url": "https://indianexpress.com/article/world/imf-delegation-visits-crisis-hit-sri-lanka-with-time-running-out-7979451/", "urlToImage": "https://images.indianexpress.com/2022/06/srilanka.jpg", "publishedAt": "2022-06-20T06:33:14Z", "content": "An International Monetary Fund (IMF) team arrives in Sri Lanka on Monday for talks on a bailout programme, but time is short for a country just days from running out of fuel and likely months from ge… [+2696 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "CLAT 2022 concludes: Check exam analysis; answer key release date", "description": "CLAT 2022: As per experts, overall difficulty level of the exam was moderate provided the candidates had good time management skills and if sufficient attention was given to all the questions considering the length of the paper.", "url": "https://indianexpress.com/article/education/clat-2022-exam-analysis-answer-key-release-consortiumofnlus-ac-in-7979659/", "urlToImage": "https://images.indianexpress.com/2020/10/clat-4.jpg", "publishedAt": "2022-06-20T06:33:12Z", "content": "The Consortium of NLUs successfully conducted the Common Law Admission Test (CLAT) 2022 on June 19. The provisional answer key and master question paper will be released on June 20 in the forenoon ti… [+1712 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "The Conversation", "title": "Why stress-related illness is so hard to diagnose, and how a patient-centred playful approach can help", "description": "While it is known that stress and social and economic disparities make people sick, physicians do not have the necessary tools to fix those causes of illness", "url": "https://indianexpress.com/article/lifestyle/health/why-stress-related-illness-is-so-hard-to-diagnose-and-how-a-patient-centred-playful-approach-can-help-7947395/", "urlToImage": "https://images.indianexpress.com/2022/04/stress_1200_getty.jpg", "publishedAt": "2022-06-20T06:30:55Z", "content": "For at least three decades, researchers have gathered evidence that chronic stressputs pressure on the body to constantly adjust itself to restore physiological stability. This process is known as al… [+7169 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Vignesh Shivan and Nayanthara honeymoon in Thailand, click selfies with fans. See photos", "description": "Vignesh Shivan and Nayanthara are spending their honeymoon in Thailand. Vignesh Shivan had shared photos on his Instagram account.", "url": "https://indianexpress.com/article/entertainment/tamil/vignesh-shivan-and-nayanthara-honeymoon-in-thailand-7979591/", "urlToImage": "https://images.indianexpress.com/2022/06/vignesh3.jpeg", "publishedAt": "2022-06-20T06:30:43Z", "content": "Actor Vignesh Shivan and Nayanthara are at a private resort in Thailand for their honeymoon. The couple had tied the knot on June 9 in the presence of close friends, family and a handful of colleague… [+1694 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Bharat Bandh: Delhi Police make special traffic arrangements to avert congestion", "description": "Delhi news: Traffic is being diverted near Janpath and other roads. Stretches that have been barricaded include Tughlaq Road, Gol Methi Junction, Claridges Junction, Q-point Junction, Sunehri Masjid Junction and Maulana Azad Road Junction.", "url": "https://indianexpress.com/article/cities/delhi/delhi-bharat-bandh-traffic-diversions-7979661/", "urlToImage": "https://images.indianexpress.com/2022/06/delhi-traffic.jpeg", "publishedAt": "2022-06-20T06:28:18Z", "content": "In view of the Bharat Bandh called on Monday against the Centres Agnipath scheme for recruitment to the armed forces, the Delhi Police made special traffic arrangements in and around the city in anti… [+1246 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Anushka Sharma starts shooting for Chakda Xpress, Virat Kohli and Ranveer Singh react", "description": "Anushka Sharma took to social media to announce that she has started shooting for her next film Chakda Xpress, a biopic of cricketer Jhulan Goswami.", "url": "https://indianexpress.com/article/entertainment/bollywood/anushka-sharma-starts-shooting-for-chakda-xpress-virat-kohli-and-ranveer-singh-react-7979606/", "urlToImage": "https://images.indianexpress.com/2022/06/Anushka-Sharma-1200by667.jpg", "publishedAt": "2022-06-20T06:25:00Z", "content": "After a hiatus of almost four years, actor Anushka Sharma is back on the sets as she started shooting for her next, Chakda Xpress. A feature film based on the former captain of the Indian women’s cri… [+1271 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Ajay Jadhav", "title": "Pune fire dept gets Rs 80 lakh to purchase fibre boats for flood rescue operations", "description": "The funds have been diverted from the disaster management department’s kitty on an emergency basis considering the flood-like situations that Pune has experienced during the previous monsoon seasons.", "url": "https://indianexpress.com/article/cities/pune/pune-fire-dept-gets-rs-80-lakh-to-purchase-fibre-boats-for-flood-rescue-operations-7979512/", "urlToImage": "https://images.indianexpress.com/2022/06/pune-rains-1.jpg", "publishedAt": "2022-06-20T06:24:03Z", "content": "With the city witnessing flood-like situations during monsoon over the last few years, the Pune Municipal Corporation (PMC) has decided to purchase fiber boats on an emergency basis to replace the ex… [+1798 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Careers Desk", "title": "HPPSC Administrative CCE application process begins: Check eligibility, how to apply", "description": "Interested and eligible candidates can apply online for the Combined Competitive Examination (CCE) 2021 through the official website — hppsc.hp.gov.in.", "url": "https://indianexpress.com/article/jobs/hppsc-administrative-cce-application-process-begins-eligibility-how-to-apply-hppsc-hp-gov-in-7979552/", "urlToImage": "https://images.indianexpress.com/2022/06/gettyimages-1310796071-612x612-3.jpg", "publishedAt": "2022-06-20T06:19:05Z", "content": "The Himachal Pradesh Public Service Commission (HPPSC) is inviting applications for the various posts in different departments of the Government of HP to be filled up through HP administrative servic… [+1446 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Aishwarya Sakhuja reveals she suffered from Ramsay Hunt syndrome 8 years back: ‘I am sure Justin Bieber will bounce back too’", "description": "TV actor Aishwarya Sakhuja has opened up about suffering from face paralysis when she was doing Main Naa Bhoolungi in 2014.", "url": "https://indianexpress.com/article/entertainment/television/aishwarya-sakhuja-ramsay-hunt-syndrom-facial-paralysis-justin-bieber-7979497/", "urlToImage": "https://images.indianexpress.com/2022/06/aishwarya-sakhuja-1200.jpg", "publishedAt": "2022-06-20T06:11:10Z", "content": "Actor Aishwarya Sakhuja suffered from Ramsay Hunt Syndrome eight years ago. Recalling the difficult phase, Aishwarya said more than physical, it was an emotional turmoil she had to fight. This comes … [+1220 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "After skipping own wedding, BJD MLA says ready to marry fiancée in 60 days", "description": "Sources close to the MLA's family said that Das, son of late BJD leader and former minister Bishnu Charan Das, was in a relationship with the woman for quite some time.", "url": "https://indianexpress.com/article/cities/bhubaneswar/after-skipping-own-wedding-bjd-mla-says-ready-to-marry-fiancee-in-60-days-7979438/", "urlToImage": "https://images.indianexpress.com/2022/06/BJP-MLA-1.jpg", "publishedAt": "2022-06-20T06:07:02Z", "content": "A day after his fiancée lodged a complaint of cheating as he failed to turn up at their wedding, ruling BJD’s Tirtol MLA Bijaya Shankar Das on Sunday said that he is ready to marry her in the next 60… [+1900 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Black Americans living abroad reflect on Juneteenth holiday", "description": "While there are no official statistics tracking Black Americans moving abroad, many are discussing it more openly after the police killing of George Floyd. In the aftermath, many African Americans saw the U.S. “from the outside in” and made up their minds not…", "url": "https://indianexpress.com/article/world/black-americans-living-abroad-reflect-on-juneteenth-holiday-7979490/", "urlToImage": "https://images.indianexpress.com/2022/06/Juneteenth-1.jpg", "publishedAt": "2022-06-20T06:04:49Z", "content": "As the United States marks only the second federally recognized Juneteenth, Black Americans living overseas have embraced the holiday as a day of reflection and an opportunity to educate people in th… [+5930 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "This summer, prevent weight gain with these Ayurvedic tips", "description": "These tips will also help you lose the excess weight you gained due to eating and resting more and being less active physically, Dr Dixa Bhavsar wrote on Instagram.", "url": "https://indianexpress.com/article/lifestyle/health/tips-prevent-weight-gain-during-summers-7960955/", "urlToImage": "https://images.indianexpress.com/2022/06/weight_200_getty.jpg", "publishedAt": "2022-06-20T06:00:56Z", "content": "The scorching summer heat can make one feel lethargic, in turn, making them skip their daily workouts. Add to this, heavy meals and mindless bingeing. The result — unwanted weight gain. So what can y… [+2730 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Singer Perrie Edwards, soccer star Alex Oxlade-Chamberlain are engaged", "description": "Perrie Edwards and Alex Oxlade-Chamberlain, first began dating in 2016, but made their relationship public a year later.", "url": "https://indianexpress.com/article/entertainment/music/perrie-edwards-soccer-star-alex-oxlade-chamberlain-are-engaged-7979549/", "urlToImage": "https://images.indianexpress.com/2022/06/Alex-Oxlade-Chamberlain-and-Perrie-Edwards-1200by667.jpg", "publishedAt": "2022-06-20T05:58:54Z", "content": "Little Mix singer Perrie Edwards and soccer player Alex Oxlade-Chamberlain are engaged and will soon tie the knot. Edwards, 28, announced their engagement in an Instagram post over the weekend.\r\n“Las… [+437 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Maha MLC polls: Malik, Deshmukh not allowed to vote akin to ‘trampling’ on their rights, claims Sena", "description": "Maharashtra minister Malik and former state home minister Deshmukh, both arrested by the Enforcement Directorate in separate money laundering cases, are currently lodged in jail.", "url": "https://indianexpress.com/article/india/maha-mlc-polls-malik-deshmukh-not-allowed-to-vote-trampling-rights-claims-sena-7979539/", "urlToImage": "https://images.indianexpress.com/2022/06/anil-deshmukh-nawab-malik-1.jpg", "publishedAt": "2022-06-20T05:57:35Z", "content": "The Shiv Sena on Monday claimed that jailed NCP MLAs Nawab Malik and Anil Deshmukh not being allowed to vote in the state Legislative Council polls was like “trampling” on the rights of the two elect… [+2183 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi: Man arrested for stealing 1,206 pairs of jeans from laundry workshop", "description": "The accused committed the theft from a laundry workshop in the Baprola area of Delhi's Outer District along with his brother, who is absconding.", "url": "https://indianexpress.com/article/delhi/delhi-man-arrested-for-stealing-1206-pairs-of-jeans-from-laundry-workshop-7979603/", "urlToImage": "https://images.indianexpress.com/2022/06/jeans759.jpg", "publishedAt": "2022-06-20T05:57:01Z", "content": "A man has been arrested for allegedly stealing 1,206 pairs of jeans from a laundry workshop in the Baprola area of Delhi’s Outer District on June 13. The arrested accused has been identified as Sanje… [+1642 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Pierre Gasly to return to Alpha Tauri as F1 ‘silly season’ begins", "description": "Pierre Gasly is “100% confirmed” to return to AlphaTauri next season, says the team's principal Franz Tost", "url": "https://indianexpress.com/article/sports/sport-others/gasly-to-return-to-alpha-tauri-as-f1-silly-season-begins-pierre-gasly-alphatauri-franz-toast-formula-1-oscar-piastri-nicholas-latifi-zak-brown-canadian-gp-7979541/", "urlToImage": "https://images.indianexpress.com/2020/09/pierre-gasly.jpg", "publishedAt": "2022-06-20T05:55:19Z", "content": "Pierre Gasly is 100% confirmed to return to AlphaTauri next season, and teams believe Oscar Piastri is ready for a promotion into a Formula One seat. But Williams expects its lineup to remain unchang… [+3718 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "WhatsApp might allow users to see Status updates straight from chat list like Instagram", "description": "Soon, users will be able to view others' status updates straight from the chat list, just like how it is possible with Instagram stories in the private message list of the app.", "url": "https://indianexpress.com/article/technology/social/whatsapp-status-update-directly-from-chat-list-like-instagram-stories-7979545/", "urlToImage": "https://images.indianexpress.com/2022/06/Whatsapp-status-update-visible-from-chat.jpg", "publishedAt": "2022-06-20T05:50:36Z", "content": "WhatsApp is reportedly working on introducing a feature that will allow users to view the Status updates right within the chat list. This would be similar to how Instagram Stories of users can be vie… [+1316 chars]"}]}