{"status": "ok", "totalResults": 588, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi HC directs Twitter to take down tweets of historian Audrey Truschke", "description": "The order was passed after historian Dr Vikram Sampath moved a fresh application seeking a direction for taking down of further “defamatory tweets” posted by Dr Audrey Truschke.", "url": "https://indianexpress.com/article/cities/delhi/delhi-hc-historian-audrey-truschke-tweets-7901543/", "urlToImage": "https://images.indianexpress.com/2022/02/Dr-Audrey-Truschke.jpg", "publishedAt": "2022-05-04T12:45:59Z", "content": "With historian Dr Audrey Truschke not appearing in the proceedings initiated against her by historian Dr Vikram Sampath, the Delhi High Court has directed Twitter to take down five more tweets of her… [+1673 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "IPL 2022 RCB vs CSK Live Score Updates: Bangalore battles Dhoni-led Chennai", "description": "IPL 2022 RCB vs CSK Live Score Updates, 4 May  Match 49, Check IPL 2022 Cricket Match Score Online:  Royal Challengers Bangalore vs Chennai Super Kings.", "url": "https://indianexpress.com/article/sports/ipl/ipl-2022-rcb-vs-live-score-7901067/", "urlToImage": "https://images.indianexpress.com/2022/05/CSK-vs-RCB.jpeg", "publishedAt": "2022-05-04T12:40:36Z", "content": "IPL 2022, RCB vs CSK Live Cricket Score Streaming Online Today Match: Here are the two squads\r\nRoyal Challengers Bangalore Squad: Faf du Plessis(c), Anuj Rawat, Virat Kohli, Dinesh Karthik(w), Glenn … [+810 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shaju Philip", "title": "AAP may enter Kerala fray via a by-poll with SilverLine on agenda", "description": "Kejriwal-led party has joined hands with Twenty20, the Kitex CSR wing fighting polls; may field candidate from Thrikkakara", "url": "https://indianexpress.com/article/india/political-pulse/aap-kerala-fray-by-poll-silverline-agenda-7901485/", "urlToImage": "https://images.indianexpress.com/2022/05/Pinarayi-Kejriwal.jpg", "publishedAt": "2022-05-04T12:37:10Z", "content": "A year since the Pinarayi Vijayan-led Left Democratic Front (LDF) government returned to power in Kerala, it faces a crucial by-poll in Thrikkakara in Ernakulam district on May 31 that is being seen … [+2856 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "No country for women", "description": "Possible undoing of Roe vs Wade in US will not just curtail right to abortion. It will signal a dangerous backsliding on hard-won freedoms", "url": "https://indianexpress.com/article/opinion/editorials/roe-vs-wade-judgment-us-supreme-court-abortion-laws-women-rights-7901468/", "urlToImage": "https://images.indianexpress.com/2022/05/US-roewade-protest.jpeg", "publishedAt": "2022-05-04T12:27:49Z", "content": "In 1973, in the landmark Roe vs Wade judgment, the Supreme Court of the United States made the right to abortion constitutional up to the point of foetal viability, establishing a benchmark for abort… [+3047 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "May the 4th be with you: How Skywalker Sound is powered by Apple", "description": "Skywalker Sound, where the audio for iconic franchises like Star Wars and Indiana Jones is created, is powered by over 130 Mac Pro racks, 40 iMacs, 50 MacBook Pros, and 50 Mac mini computers running Pro Tools.", "url": "https://indianexpress.com/article/technology/tech-news-technology/may-the-4th-be-with-you-how-skywalker-sound-is-powered-by-apple-7901469/", "urlToImage": "https://images.indianexpress.com/2022/05/Skywalker-sound-may-the-fourth-star-wars-apple-featured.jpg", "publishedAt": "2022-05-04T12:21:51Z", "content": "On Star Wars day, Apple has published a blog post that details how Skywalker Sound, a sound design, editing, mixing and audio post-production division of Lucasfilm, is powered by over 130 Mac Pro rac… [+2109 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Benita Fernando", "title": "Explained: The story of Marilyn Monroe’s dress worn by Kim Kardashian at the Met Gala", "description": "The dress was made especially for Monroe, and Kim Kardashian had to make adjustments to her body to fit into it, rather than alter the dress.", "url": "https://indianexpress.com/article/explained/explained-story-marilyn-monroes-dress-worn-kim-kardashian-met-gala-7901279/", "urlToImage": "https://images.indianexpress.com/2022/05/Kim-Marilyn.jpg", "publishedAt": "2022-05-04T12:17:36Z", "content": "Kim Kardashian had to lose 16 pounds (7.25 kg) in three weeks to fit into Marilyn Monroes dress for the Met Gala 2022. The golden gown, which is also the worlds most expensive dress, is a fashion his… [+4838 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "IPL showed people have different ways to succeed, can’t be just one template, says Virat Kohli", "description": "Kohli is the only player who has been with the same franchise from the very beginning of the IPL.", "url": "https://indianexpress.com/article/sports/ipl/ipl-showed-people-have-different-ways-to-succeed-cant-be-just-one-template-says-virat-kohli-7901465/", "urlToImage": "https://images.indianexpress.com/2022/04/Kohli-20.jpg", "publishedAt": "2022-05-04T12:17:04Z", "content": "IPL’s all-time leading scorer, Virat Kohli, feels playing in the lucrative league for 14 years has made him realise that there is not just one template to succeed in the game in which he has attained… [+3811 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Karnataka: Siddaramaiah hits out at govt, demands judicial probe into PSI exam scam", "description": "Attacking the government, Siddaramaiah alleged that the conspiracy had taken place much before the examination", "url": "https://indianexpress.com/article/cities/bangalore/karnataka-siddaramaiah-govt-judicial-probe-psi-exam-scam-7901459/", "urlToImage": "https://images.indianexpress.com/2022/05/Siddaramaiah.jpg", "publishedAt": "2022-05-04T12:15:37Z", "content": "Former Karnataka chief minister and Congress leader Siddaramaiah alleged Wednesday that the police sub-inspector (PSI) recruitment scam in the state was worth Rs 300 crore and demanded a judicial pro… [+1638 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Parenting Desk", "title": "Five Things: Vaccines for kids below 12; an animation film to initiate conversation about puberty; podcast workshop, and more", "description": "A weekly curation of news, events and activities appropriate for your child", "url": "https://indianexpress.com/article/parenting/five-things-vaccines-for-kids-below-12-an-animation-film-to-initiate-conversation-about-puberty-podcast-workshop-and-more-7901286/", "urlToImage": "https://images.indianexpress.com/2022/05/GettyImages-children-podcast-activities-1200.jpg", "publishedAt": "2022-05-04T12:15:03Z", "content": "Pixars coming-of-age film Turning Red, available on Disney Hotstar, is a perfect family unwinding option if you are preparing to have that conversation about puberty with your child. Mei Lee is an ac… [+4427 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Parthasarathi Biswas", "title": "A start-up that earned more during pandemic, thanks to its problem-solving approach", "description": "A mechanical engineer by training, Arham Pratap Jain got interested in the logistic sector thanks to his exposure in the sector through his family business which dealt in chemicals and fuel.", "url": "https://indianexpress.com/article/cities/pune/start-up-trucknetic-logistics-sector-covid-19-pandemic-7901309/", "urlToImage": "https://images.indianexpress.com/2022/05/Arham-Pratap-Jain.jpg", "publishedAt": "2022-05-04T12:11:51Z", "content": "When in 2019 Arham Pratap Jain, the founder and chief trucking officer of Trucknetic, started his technology-first company in the logistics sector, he had not factored in the Covid-19 pandemic and it… [+2944 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Athiya Shetty and KL Rahul are engaged? Here’s what brother Ahan Shetty said", "description": "Athiya Shetty and KL Rahul have been hogging headlines since 2019. After months of staying tight-lipped, the two attended the premiere of Ahan Shetty's Tadap together, making their relationship official.", "url": "https://indianexpress.com/article/entertainment/bollywood/athiya-shetty-kl-rahul-engagement-wedding-ahan-suniel-shetty-7901044/", "urlToImage": "https://images.indianexpress.com/2022/05/ahan-athiya-shetty-kl-rahul-1200.jpg", "publishedAt": "2022-05-04T12:09:04Z", "content": "Amid reports about preparations for Athiya Shetty’s impending wedding with cricketer KL Rahul, brother Ahan Shetty has cleared the air. Calling it rumours, he said no prep is on.Suniel Shetty’s son A… [+1737 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Komal RJ Panchal", "title": "Kartik Aaryan opens up about fall out with Karan Johar’s Dharma Productions", "description": "Just around the fall out between Kartik Aaryan and Karan Johar, there were reports that a few industry insiders are creating a lobby against the Bhool Bhulaiyaa 2 actor to sabotage his career.", "url": "https://indianexpress.com/article/entertainment/bollywood/kartik-aaryan-opens-up-about-fall-out-with-karan-johars-dharma-productions-7901319/", "urlToImage": "https://images.indianexpress.com/2022/05/kartik-aaryan-karan-johar-1200.jpg", "publishedAt": "2022-05-04T12:04:12Z", "content": "Kartik Aaryan, who is busy promoting his upcoming horror comedy film Bhool Bhulaiyaa 2, recently opened up about the fall out with Karan Johar’s Dharma Productions. The actor and the production house… [+1236 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "NIMCET 2022 application deadline extended; here’s how to apply", "description": "Admit cards for NIMCET 2022 will be available on the website from June 6 to June 19, 2022 on the official website. The exam is scheduled to take place on June 20, 2022 and the results are expected on July 5.", "url": "https://indianexpress.com/article/education/nimcet-2022-application-deadline-extended-how-to-apply-nimcet-in-7901445/", "urlToImage": "https://images.indianexpress.com/2021/04/BPSC-1200x667-3-1.jpg", "publishedAt": "2022-05-04T12:02:20Z", "content": "The National Institute of Technology (NIT), Jamshedpur has extended the deadline to app;y for NIMCET 2022. Candidates can now register till May 9 on the official NIMCET website nimcet.in.Earlier, the… [+1513 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Free speech to charging for tweets: Everything Elon Musk said about changing Twitter", "description": "From explaining his stance on free speech to saying that Twitter could look at charging select users for tweets, here’s a look at everything Musk has said so far.", "url": "https://indianexpress.com/article/technology/social/free-speech-to-charging-for-tweets-everything-elon-musk-about-he-will-change-twitter-7901327/", "urlToImage": "https://images.indianexpress.com/2022/05/musk-1.jpg", "publishedAt": "2022-05-04T12:01:51Z", "content": "Since Elon Musks deal to acquire Twitter became public last week, the Tesla co-founder has been busy posting all of his ideas on what he intends to do with the platform. Musk has insisted that Twitte… [+4880 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Allergic rhinitis: From symptoms to diagnosis and prevention — all you need to know", "description": "Patients with allergic rhinitis have symptoms including nasal congestion, sneezing, ear blockage and breathing difficulties, itchy eyes and nose, and sore throat, says a doctor", "url": "https://indianexpress.com/article/lifestyle/health/allergic-rhinitis-symptoms-prevention-triggers-management-treatment-7892845/", "urlToImage": "https://images.indianexpress.com/2022/04/GettyImages-allergic-rhinitis-1200.jpg", "publishedAt": "2022-05-04T12:00:38Z", "content": "To understand how one can manage allergic rhinitis, it needs to be understood what this condition really is. Also commonly known as ‘hay fever’, allergic rhinitis is a form of allergic reaction that … [+2004 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "‘Itna Sun aata Kun hai bhai?’: Amul shares quirky topical on heatwave", "description": "The IMD has said that April this year was the third-warmest in India in 122 years and March was the warmest over the same period.", "url": "https://indianexpress.com/article/trending/trending-in-india/amul-shares-quirky-topical-on-heatwave-memes-7901289/", "urlToImage": "https://images.indianexpress.com/2022/05/amul-heatwave.jpg", "publishedAt": "2022-05-04T11:57:16Z", "content": "As scorching heat has been sweeping across several places in the country, people have been struggling to find a respite. While netizens shared memes on the heatwave, the diary brand Amul’s latest top… [+2252 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Samsung launches Jet 70, Jet 75 and Jet 90 vacuum cleaners in India", "description": "The vacuum cleaners will be available on Samsung’s online store starting May 4 and will soon be available on Flipkart as well.", "url": "https://indianexpress.com/article/technology/gadgets/samsung-launches-jet-70-jet-75-and-jet-90-vacuum-cleaners-in-india-7901296/", "urlToImage": "https://images.indianexpress.com/2022/05/Samsung-Jet-70-Jet-75-Jet-90-launched-featured.jpg", "publishedAt": "2022-05-04T11:51:12Z", "content": "Samsung has announced the launch of a new range of Jet cordless stick vacuum cleaners: the Jet 70, Jet 75 and Jet 90. They generate up to 200W of suction power. The vacuum cleaners will be available … [+1676 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aksheev Thakur", "title": "Growing trees outside forests can offer environmental, socio-economic benefits: WRI India research", "description": "The researchers analysed the incentives of the implementation of trees outside forests in six states -- Gujarat, Karnataka, Maharashtra, Odisha, Punjab and Telangana -- to identify enabling conditions that can spur its expansion as well as the impediments.", "url": "https://indianexpress.com/article/cities/bangalore/growing-trees-outside-forests-environmental-socio-economic-benefits-wri-7901359/", "urlToImage": "https://images.indianexpress.com/2022/05/FOREST-1-1.jpg", "publishedAt": "2022-05-04T11:49:55Z", "content": "A new paper by research organisation World Resources Institute (WRI) India shows how growing trees outside forests (ToF), particularly agroforestry, a landscape technique where farmers add trees to t… [+5040 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi: Two minors sexually assaulted at MCD-run school; DCW sends notice to police, civic body", "description": "The Delhi Police said they registered a case under sections of the Protection of Children from Sexual Offences, or POCSO Act and that raids are being conducted to arrest the accused.", "url": "https://indianexpress.com/article/cities/delhi/delhi-two-minors-sexually-assaulted-school-dcw-notice-police-civic-body-7901304/", "urlToImage": "https://images.indianexpress.com/2022/05/delhi-police.jpg", "publishedAt": "2022-05-04T11:44:47Z", "content": "Two girls were allegedly undressed and sexually assaulted by an unknown man inside the classroom of a civic body-run school in Delhi, said officials Wednesday. No arrests have been made in the case y… [+1671 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "RBI hikes repo rate by 40 bps: Here’s how market analysts, economists, experts reacted", "description": "The sudden hike in RBI's key interest rates led to a sharp reaction in the domestic stock market where the S&P BSE Sensex crashed 1,306.96 points (2.29 per cent) to end at 55,669.03 while the Nifty 50 fell to 391.50 points (2.29 per cent) to settle at 16,677.…", "url": "https://indianexpress.com/article/business/economy/rbi-interest-rate-hiked-40-bps-here-is-how-market-analysts-economists-experts-reacted-7901244/", "urlToImage": "https://images.indianexpress.com/2022/05/rbi-Das-2col.jpg", "publishedAt": "2022-05-04T11:35:57Z", "content": "The Monetary Policy Committee (MPC) of the Reserve Bank of India (RBI) in a sudden move on Wednesday hiked the policy repo rate by 40 basis points (bps) to 4.40 per cent with immediate effect. Conseq… [+5593 chars]"}]}