{"status": "ok", "totalResults": 542, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Johnny-Depp-Amber Heard case: Should a society amuse itself with TikToks about trauma?", "description": "A trial about alleged domestic violence and abuse can be triggering for the victims of such crimes and must be handled with respect and sensitivity", "url": "https://indianexpress.com/article/opinion/johnny-depp-amber-heard-case-tiktoks-trauma-7933486/", "urlToImage": "https://images.indianexpress.com/2022/05/johnny-depp-amber-heard.jpg", "publishedAt": "2022-05-24T08:48:18Z", "content": "In 2014, a delightful film written and directed by Rajat Kapoor, Ankhon Dekhi, introduced the world to Raje Bauji. The movie opens with Bauji, played by Sanjay Mishra, recounting a recurring dream wh… [+5490 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Moscow not sure it needs resumed ties with West, will work on ties with China: Lavrov", "description": "Sergei Lavrov, in a question and answer session at an event in Moscow, said Western countries had espoused \"russophobia\" since Russia launched its incursion into Ukraine - described by Moscow as a \"special military operation\".", "url": "https://indianexpress.com/article/world/moscow-not-sure-it-needs-resumed-ties-with-west-will-work-on-ties-with-china-lavrov-7933507/", "urlToImage": "https://images.indianexpress.com/2022/05/putin-1200.jpg", "publishedAt": "2022-05-24T08:47:23Z", "content": "Russia’s foreign minister said on Monday that Moscow would consider offers from the West to re-establish ties and determine whether that is needed, but will focus on developing relations with China.S… [+2047 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Jio, Airtel in position to buy pan-India spectrum, uncertainty on VIL bid", "description": "Research analysts at BofA were of the view that Vodafone Idea (VIL) management has focused on top core circles and the company may selectively bid in their core 3G and 4G circles.", "url": "https://indianexpress.com/article/technology/techook/jio-airtel-in-position-to-buy-pan-india-spectrum-uncertainty-on-vil-bid-7933495/", "urlToImage": "https://images.indianexpress.com/2022/05/jio-airtel-vi-1.jpg", "publishedAt": "2022-05-24T08:45:54Z", "content": "Reliance Jio and Bharti Airtel are in a position to buy pan-India 5G spectrum but uncertainty remains around Vodafone Idea’s bids for the radiowaves, according to a BofA Securities report released on… [+2980 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sayak Dutta", "title": "Manchester United 0, Man City 73", "description": "Manchester United finished a disastrous season with a goal difference of 0 , conceding as many goals as they scored. In contrast Man City ended with +73 and Liverpool +68.", "url": "https://indianexpress.com/article/sports/football/manchester-united-0-man-city-73-7933447/", "urlToImage": "https://images.indianexpress.com/2022/04/Untitled-design-3-11.jpg", "publishedAt": "2022-05-24T08:45:37Z", "content": "Manchester United scripted another unwanted record in the 2021/22 season as they finished with a goal difference of 0 at the end of the campaign. This basically means that they have conceded as many … [+5078 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "Beggar buys motorcycle worth Rs 90,000 for his wife. Watch video", "description": "After his wife Munni complained of backache while travelling in their tricycle, the destitute man bought the two-wheeler.", "url": "https://indianexpress.com/article/trending/trending-in-india/beggar-buys-motorcycle-worth-rs-90000-for-his-wife-7933417/", "urlToImage": "https://images.indianexpress.com/2022/05/Beggar-buys-motorcycle-for-his-wife.jpg", "publishedAt": "2022-05-24T08:42:05Z", "content": "A beggarfrom Chhindwara in Madhya Pradesh bought a motorcycle worth Rs 90,000 for his ailing wife. After his wife Munni complained of backache while travelling in their tricycle, the destitute man bo… [+1559 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Deepika Padukone stuns in yet another black ensemble on the Cannes red carpet", "description": "From pantsuits to skirts, saris to timeless gowns, Deepika has sported it all this year. And her latest red carpet look only takes the glam quotient higher.", "url": "https://indianexpress.com/article/lifestyle/fashion/deepika-padukone-stuns-in-yet-another-black-ensemble-at-the-cannes-red-carpet-7933068/", "urlToImage": "https://images.indianexpress.com/2022/05/dp-cannes-3-1.jpg", "publishedAt": "2022-05-24T08:40:42Z", "content": "Buy Now | Our best subscription plan now has a special price\r\nFrom pantsuits to skirts, saris to timeless gowns, Deepika has sported it all this year. And the Louis Vuitton ambassadors’ latest red ca… [+945 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manoj Kumar R", "title": "Kamal Haasan on his 40-year friendship with Rajinikanth: ‘At 25, we predicted how our journey should end’", "description": "At the Vikram audio and trailer launch, Kamal Haasan talked about his over 40-year friendship with Rajinikanth.", "url": "https://indianexpress.com/article/entertainment/tamil/vikram-star-kamal-haasan-on-40-year-friendship-with-rajinikanth-beyond-politics-7933322/", "urlToImage": "https://images.indianexpress.com/2022/05/kamal-haasan-vikram.jpg", "publishedAt": "2022-05-24T08:31:33Z", "content": "Tamil superstar Kamal Haasan touched upon various topics during his speech at the audio and trailer launch of his upcoming film Vikram. The audio and trailer launch, which was held recently, was Kama… [+2406 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sakshi Saroha", "title": "DU, Jamia, AMU to not take up CUET for PG admissions this academic year", "description": "The University Grants Commission (UGC) last week announced that a common entrance test will be held for admission to postgraduate programmes in 42 central universities in the upcoming academic year.", "url": "https://indianexpress.com/article/education/du-jamia-amu-not-take-up-cuet-pg-admissions-this-academic-year-7933440/", "urlToImage": "https://images.indianexpress.com/2022/05/ch901669-1-2.jpg", "publishedAt": "2022-05-24T08:28:47Z", "content": "A total of 35 central universities will be admitting students through the newly introduced Common University Entrance Test (CUET) for postgraduate courses, the information bulletin released by the Na… [+1785 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "Central University of Haryana to adopt CUET-PG 2022, check course-wise eligiblity criteria", "description": "CUET PG 2022 Admissions: The university on Monday released an official confirmation on its website i.e cuh.ac.in. Interested candidates can apply through the NTA portal at cuet.nta.nic.in.", "url": "https://indianexpress.com/article/education/central-university-of-haryana-to-adopt-cuet-pg-2022-course-wise-eligiblity-criteria-7933411/", "urlToImage": "https://images.indianexpress.com/2022/05/1cuhadm_n.png", "publishedAt": "2022-05-24T08:24:12Z", "content": "The Central University of Haryana will conduct all postgraduate (PG) admissions through the Common University Entrance Test (CUET-PG) 2022. The university on Monday released an official confirmation … [+2130 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Janardhan Koushik", "title": "Tamil Nadu: 1,000 kg of meat, meant for wedding biryani, seized by food safety officials", "description": "Dr Satheesh Kumar, the designated officer for Food Safety in Chennai, said the department inspected the meat based on the complaint filed by the management of RR Biryani.", "url": "https://indianexpress.com/article/cities/chennai/tamil-nadu-wedding-meat-biryani-seized-7933341/", "urlToImage": "https://images.indianexpress.com/2022/05/meat-1.jpg", "publishedAt": "2022-05-24T08:20:01Z", "content": "Tamil Nadu’s Food Safety Department Monday seized 800 kg of mutton and 200 kg of chicken that had been bought from a slaughter house in Karnataka’s Mandya district to feed a wedding party in Mannargu… [+1480 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pune: C-DAC’s mobile app gives virtual access to artefacts of national museums", "description": "Union Minister for Culture and Tourism Kishan Reddy launched the app at a special event organised to celebrate International Museum Day at National Gallery of Modern Art in New Delhi on May 18.", "url": "https://indianexpress.com/article/cities/pune/pune-c-dac-mobile-app-national-museums-7933310/", "urlToImage": "https://images.indianexpress.com/2022/05/museum-app.jpg", "publishedAt": "2022-05-24T08:11:55Z", "content": "Now, get a glimpse of artefacts preserved inside India’s national museums with a click using the Museums of India mobile app. The app, developed by Pune-headquartered Centre for Development of Advanc… [+1102 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "SC refuses to entertain plea for fixing cut-off date for eligibility in domestic cricket tournaments", "description": "The apex court was hearing a plea filed by an under 19-year-old player Rhitwicq Additya Sharma seeking directions to the BCCI to fix the cut-off date for eligibility in domestic tournaments.", "url": "https://indianexpress.com/article/sports/cricket/sc-refuses-to-entertain-plea-for-fixing-cut-off-date-for-eligibility-in-domestic-cricket-tournaments-7933412/", "urlToImage": "https://images.indianexpress.com/2018/11/ranji-trophy-stock-fb.jpg", "publishedAt": "2022-05-24T08:11:10Z", "content": "The Supreme Court on Tuesday refused to entertain a plea seeking directions to the BCCI to fix the cut-off date for age eligibility in domestic cricket tournaments.A bench of Justices S A Nazeer and … [+1381 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sofi Ahsan", "title": "Bagga arrest: HC asks Delhi Police to reply to Punjab Police plea seeking to quash FIR", "description": "Additional Solicitor General Sanjay Jain, representing Delhi Police, had submitted that the police commissioner needs to be separately made a party to the case as allegations have been made against the police in the plea filed by Mohali SSP.", "url": "https://indianexpress.com/article/cities/delhi/bagga-arrest-hc-asks-delhi-police-to-reply-to-punjab-police-plea-seeking-to-quash-fir-7933414/", "urlToImage": "https://images.indianexpress.com/2022/05/bagga-4.jpg", "publishedAt": "2022-05-24T08:06:01Z", "content": "Additional Solicitor General Sanjay Jain, representing Delhi Police, earlier submitted that the police commissioner needs to be separately made a party to the case as allegations have been made again… [+5473 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Careers Desk", "title": "RBI Assistant 2022 prelims scorecard released; here’s how to download", "description": "As per the notice, selection for the post will be through a country-wide competitive examination in two phases i.e. preliminary and main examination followed by a Language Proficiency Test (LPT).", "url": "https://indianexpress.com/article/jobs/rbi-assistant-2022-prelims-scorecard-released-how-to-download-rbi-org-in-7933400/", "urlToImage": "https://images.indianexpress.com/2022/05/Webp.net-resizeimage-59.jpg", "publishedAt": "2022-05-24T08:04:11Z", "content": "The Reserve Bank of India (RBI) has released the scorecards of  RBI Assistant recruitment examination 2022. The exam was conducted on March 26 and 27 and the result was declared on April 22. Candidat… [+940 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Aishwarya Rai’s Rs 1500 modelling bill from 1992 unearthed, she looks unrecognisable in photoshoot", "description": "Aishwarya Rai won the Miss World title in 1994, but just two years before that, she was paid Rs 1500 for a modelling assignment. See pictures from the shoot here.", "url": "https://indianexpress.com/article/entertainment/bollywood/aishwarya-rai-1992-modelling-assignment-bill-rs-1500-7933311/", "urlToImage": "https://images.indianexpress.com/2022/05/aishwarya-rai.jpg", "publishedAt": "2022-05-24T08:02:46Z", "content": "Aishwarya Rai has achieved the most that both the modelling and acting professions have to offer, but like everybody else, she started out doing low-paying gigs. It has been exactly 30 years since Ai… [+2690 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "DC sues Zuckerberg over Cambridge Analytica privacy breach", "description": "The lawsuit maintains that Mark Zuckerberg directly participated in important company decisions and was aware of the potential dangers of sharing users’ data.", "url": "https://indianexpress.com/article/technology/social/dc-sues-zuckerberg-over-cambridge-analytica-privacy-breach-7933389/", "urlToImage": "https://images.indianexpress.com/2022/05/Mark-zuckerberg-sued-DC-Cambridge-Analytica-featured.jpg", "publishedAt": "2022-05-24T08:01:24Z", "content": "The District of Columbia on Monday sued Meta chief Mark Zuckerberg, seeking to hold him personally liable for the Cambridge Analytica scandal, a privacy breach of millions of Facebook users personal … [+2673 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "People in Brazil’s Amazon rainforest again reel from floods", "description": "In Brazil’s Amazonas state alone, an estimated 367,000 people have been affected by rising waters, the state’s civil defense authority says.", "url": "https://indianexpress.com/article/world/people-in-brazils-amazon-rainforest-again-reel-from-floods-7933390/", "urlToImage": "https://images.indianexpress.com/2022/05/brazil.jpg", "publishedAt": "2022-05-24T07:58:19Z", "content": "For the second straight year, inhabitants of Brazils Amazon rainforest are being overwhelmed by flooding, with hundreds of thousands of people already affected by waters that are still rising.Heavy r… [+2087 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "ED records statement of ex-NSE MD Chitra Ramkrishna in money laundering case", "description": "The statement has been recorded under the criminal sections of the Prevention of Money Laundering Act (PMLA), they said.", "url": "https://indianexpress.com/article/india/ed-records-statement-of-ex-nse-md-chitra-ramkrishna-in-money-laundering-case-7933330/", "urlToImage": "https://images.indianexpress.com/2022/05/CHITRA.jpeg", "publishedAt": "2022-05-24T07:56:16Z", "content": "The Enforcement Directorate has recently recorded the statement of former NSE managing director and chief executive officer Chitra Ramkrishna, lodged inside Delhi’s Tihar jail, as part of a money lau… [+3289 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Hyderabad: Telangana govt to protect Osmania hospital’s heritage block while building new infrastructure", "description": "Health Minister Harish Rao on Monday met the committee of engineers along with other ministers and Hyderabad MP Asaduddin Owaisi who has been vouching for the construction of a new building.", "url": "https://indianexpress.com/article/cities/hyderabad/telangana-osmania-hospitals-heritage-block-protection-7933343/", "urlToImage": "https://images.indianexpress.com/2022/05/owaisi-1200.jpg", "publishedAt": "2022-05-24T07:55:19Z", "content": "The Telangana government will protect the century-old Osmania General Hospital’s heritage block, an iconic Nizam-era monument in Hyderabad, Health Minister Harish Rao announced after a meeting with t… [+2636 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "IPL 2022 Qualifier 1 GT vs RR playing XI, match prediction, pitch report: How will Gujarat Titans and Rajasthan Royals tweak their Playing 11", "description": "IPL 2022 GT vs RR Qualifier 1 playing xi Prediction: Gujarat Titans vs Rajastan Royals Playing XI Updates for Today's IPL Match", "url": "https://indianexpress.com/article/sports/ipl/ipl-2022-qualifier-1-gt-vs-rr-playing-xi-match-prediction-pitch-report-7933255/", "urlToImage": "https://images.indianexpress.com/2022/05/Untitled-design-18-4.jpg", "publishedAt": "2022-05-24T07:53:23Z", "content": "Gujarat Titans vs Rajasthan Royals (GT vs RR) Qualifier 1 Players List: Equipped with a lethal bowling attack and boasting a number of quality finishers, debutants Gujarat Titans will start as favour… [+2228 chars]"}]}