{"status": "ok", "totalResults": 494, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Panvel food stall owner arrested for social media post on Pawar", "description": "According to police, after Marathi actor Ketaki Chitale posted an alleged defamatory post about Pawar on Facebook earlier this month, a similar post was shared by Inamdar on social media.", "url": "https://indianexpress.com/article/cities/mumbai/panvel-food-stall-owner-arrested-for-social-media-post-on-pawar-7926894/", "urlToImage": "https://images.indianexpress.com/2022/05/arresttt-1.jpg", "publishedAt": "2022-05-19T23:52:22Z", "content": "THE PANVEL City Police on Wednesday night arrested a 34-year-old man for allegedly posting objectionable comments on social media against Nationalist Congress Party (NCP) chief Sharad Pawar. This is … [+1921 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Cong organisation: New panel to suggest changes", "description": "Addressing the Congress' Chintan Shivir for Saurashtra zone in Rajkot on Thursday, AICC Gujarat in-charge Raghu Sharma announced formation of a committee to strengthen the party-organisation at grassroots levels.", "url": "https://indianexpress.com/article/cities/rajkot/cong-organisation-new-panel-to-suggest-changes-gujarat-congress-chintan-shivir-7926888/", "urlToImage": "https://images.indianexpress.com/2022/05/Congress-leaders-at-the-Chintan-Shivir.jpg", "publishedAt": "2022-05-19T23:46:12Z", "content": "All India Congress Committee (AICC) incharge of Gujarat Raghu Sharma on Thursday announced a seven-member committee to suggest changes in the partys organisation at lower levels and said that it will… [+2904 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Two policemen electrocuted on paddy field", "description": "Police sources said two local persons were taken into custody for alleged involvement in laying the the wire to trap the wild animals boars that eat up the crop. Initial report of the postmortem said the victims had sustained burns from electric shock.", "url": "https://indianexpress.com/article/cities/thiruvananthapuram/two-policemen-electrocuted-on-paddy-field-7926873/", "urlToImage": "https://images.indianexpress.com/2022/05/death-5-2-4.jpg", "publishedAt": "2022-05-19T23:41:57Z", "content": "Two policemen died of electrocution on a paddy field near their armed police camp in Palakkad on Thursday. The victims came in comntact with a live wire-trap to catch wild boars that get into paddy f… [+411 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Avinash Nair", "title": "Number of families to be displaced for Surat Metro to reduce by 70 pc", "description": "Redesigning the metro stations and bringing about small modifications in the alignment of metro rail route has helped in reducing the displacement of people, said senior officials of Gujarat Metro Rail Corporation (GMRC).", "url": "https://indianexpress.com/article/cities/ahmedabad/number-of-families-to-be-displaced-for-surat-metro-to-reduce-by-70-pc-7926881/", "urlToImage": "https://images.indianexpress.com/2022/05/Surat-metro.jpg", "publishedAt": "2022-05-19T23:37:53Z", "content": "The number of families who stand to lose their livelihoods or get displaced by construction of Surat Metro in Gujarat is expected to reduce by 70 per cent, according to officials of the Gujarat Metro… [+2763 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Take care of youth who lost eyesight: Congress to VMC", "description": "Henil Patel, a diploma student of MSU’s Polytechnic college, was riding a two-wheeler on Waghodia Road on May 11 when he suffered serious eye injuries by the horn of a cow even as his two-wheeler skid, throwing him to the ground.", "url": "https://indianexpress.com/article/cities/baroda/take-care-of-youth-who-lost-eyesight-congress-to-vmc-7926872/", "urlToImage": "https://images.indianexpress.com/2022/05/Vadodara-mayor.jpg", "publishedAt": "2022-05-19T23:27:38Z", "content": "A week after an 18-year-old student of MS University sustained grievous injuries and lost one eye in an incident of stray cattle attack, Congress leader Chandrakant Shrivastav on Thursday urged the V… [+748 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Esha Roy", "title": "S Somanath: ‘Private players in space sector can boost defence, manufacturing’", "description": "ISRO is centrally funded and our annual budget is between Rs 14-15,000 crore and most of this is used in building rockets and satellites.", "url": "https://indianexpress.com/article/india/s-somanath-private-players-in-space-sector-can-boost-defence-manufacturing-7926867/", "urlToImage": "https://images.indianexpress.com/2022/05/S-Somanath-2.jpg", "publishedAt": "2022-05-19T23:21:16Z", "content": "Minister of State for the Department of Space (DOS) Dr Jitendra Singh informed the Lok Sabha in the last Parliament session that the government was looking at opening the space sector to foreign dire… [+4577 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Sarpanch, son arrested on AAP MLA’s complaint; former MLA protests", "description": "On Wednesday, the MLA along with her PA Baljinder Singh and other AAP workers had reached Mothanwali village to get a government veterinary dispensary free from 'illegal occupation' where an argument had ensued between her and the sarpanch Harnek Singh.", "url": "https://indianexpress.com/article/cities/ludhiana/sarpanch-son-arrested-on-aap-mlas-complaint-former-mla-protests-7926870/", "urlToImage": "https://images.indianexpress.com/2022/05/arrest1-11.jpeg", "publishedAt": "2022-05-19T23:15:02Z", "content": "Moga police arrested the sarpanch and his son of Mothanwali village after the local Moga AAP MLA Dr Amandeep Kaur Arora alleged that both men misbehaved with her.On Wednesday, the MLA along with her … [+2863 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kamaldeep Singh Brar", "title": "Black water in Ferozepur canal: Punjab pollution board says water still drinkable", "description": "Shocked green activists challenge state pollution board members to lead by example and drink water first", "url": "https://indianexpress.com/article/cities/amritsar/black-water-in-ferozepur-canal-punjab-pollution-board-says-water-still-drinkable-7926858/", "urlToImage": "https://images.indianexpress.com/2022/05/pune-1-1.jpg", "publishedAt": "2022-05-19T23:12:21Z", "content": "Images of black water being released into the Ferozepur feeder canal from Harike headworks have flooded the Internet in the past few days, with the Punjab Water Resources department issuing an adviso… [+3620 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "TMC cadre meet in Jhargram: Mamata Banerjee lashes out at BJP, Left amid recruitment row", "description": "The CM's comments came in the backdrop of the Calcutta High Court ordering CBI probes into various cases related to alleged recruitment scam between 2014 and 2017.", "url": "https://indianexpress.com/article/cities/kolkata/tmc-cadre-meet-in-jhargram-mamata-banerjee-lashes-out-at-bjp-left-amid-recruitment-row-7926863/", "urlToImage": "https://images.indianexpress.com/2022/05/mamata-2.jpg", "publishedAt": "2022-05-19T23:08:25Z", "content": "Amid the row over irregularities in government teachers’ appointments, West Bengal Chief Minister Mamata Banerjee Thursday slammed the BJP-led government at the Centre and the Opposition Left Front. … [+2797 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Cattle smuggling case: Anubrata Mondal grilled by CBI, taken to hospital over ‘chest pain’", "description": "The 61-year-old was taken to state-run SSKM Hospital from where he was discharged later. The CBI officials said Mondal complained of chest pain and asked the investigators to allow him to visit a doctor. “He was allowed to go while interrogation was on. He wi…", "url": "https://indianexpress.com/article/cities/kolkata/cattle-smuggling-case-anubrata-mondal-grilled-by-cbi-taken-to-hospital-over-chest-pain-7926843/", "urlToImage": "https://images.indianexpress.com/2022/05/Anubrata-CBI-Main-1.jpg", "publishedAt": "2022-05-19T23:04:14Z", "content": "The CBI on Thursday questioned Trinamool Congress Birbhum district president Anubrata Mondal in Kolkata for nearly four hours in connection with the cross-border cattle smuggling case before he was a… [+1959 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Nirupama Subramanian", "title": "Explained: NATO expansion & Russia", "description": "Finland and Sweden have applied for membership of NATO. What has been their stand on the alliance over the years, what obstacles do they face, and what would their joining mean for geopolitics around Russia?", "url": "https://indianexpress.com/article/explained/explained-nato-expansion-russia-7926669/", "urlToImage": "https://images.indianexpress.com/2022/05/NATO-expansion-and-Russia.jpg", "publishedAt": "2022-05-19T23:01:38Z", "content": "After nearly three months of debate within the two countries, Finland and Sweden have formally applied for membership of the North Atlantic Treaty Organization (NATO), the US-led security alliance fo… [+7595 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Explained: Respiratory syncytial virus and the toll it takes on young children", "description": "The study is the first to examine RSV disease burden in narrow age brackets. For example, there were over 45,000 deaths in infants under six months old in 2019, with one in five of the total global cases of RSV occurring in this age group.", "url": "https://indianexpress.com/article/explained/explained-respiratory-syncytial-virus-and-the-toll-it-takes-on-young-children-7926666/", "urlToImage": "https://images.indianexpress.com/2022/05/respiratory-virus.jpg", "publishedAt": "2022-05-19T23:00:48Z", "content": "Lower respiratory infection attributable to respiratory syncytial virus (RSV) was responsible for more than 1,00,000 deaths in children under five worldwide in 2019, according to a new estimate publi… [+2290 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "George Mathew", "title": "Explained | Your Money: Where the rupee is headed, and what its fall means to consumers, markets", "description": "The depreciation is expected to impact the economy in general and various segments such as imports, mainly fuel prices, and push up inflation.", "url": "https://indianexpress.com/article/explained/where-rupee-headed-what-its-fall-means-7926662/", "urlToImage": "https://images.indianexpress.com/2022/05/explained-money.jpg", "publishedAt": "2022-05-19T22:59:46Z", "content": "The rupee closed at a record low of 77.72 against the dollar on Thursday, a loss to over 6% in the last one year as it gets weighed down by rising inflation, interest rates, exit of foreign investors… [+4633 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Grishma murder case: HC issues notice to Goyani on confirmation of death sentence", "description": "The division bench of Justices Biren Vaishnav and Sandeep Bhatt admitted the confirmation of death sentence case and have kept the notice returnable for June 28.", "url": "https://indianexpress.com/article/cities/ahmedabad/grishma-murder-case-hc-issues-notice-to-goyani-on-confirmation-of-death-sentence-7926860/", "urlToImage": "https://images.indianexpress.com/2022/04/Gujarat-HC-1-1-1-1.jpg", "publishedAt": "2022-05-19T22:59:39Z", "content": "A division bench of the Gujarat High Court on Thursday issued notice to 20-year-old Fenil Goyani, who was sentenced to death for the murder of 21-year-old Grishma Vekhariya, in the application seekin… [+1133 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Alifiya Khan", "title": "FYJC admission process may begin next week", "description": "According to an earlier schedule shared by the deputy director of education department, the process of filing Part 1 of the form for FYJC admission was scheduled to begin from May 17.", "url": "https://indianexpress.com/article/cities/pune/fyjc-admission-process-may-begin-next-week-7926859/", "urlToImage": "https://images.indianexpress.com/2021/07/students-1.jpg", "publishedAt": "2022-05-19T22:52:00Z", "content": "Even as the state education department is likely to face a delay and the final results of Class X, Secondary School Certificate (SSC), are likely to be released only by June 20, the centralised admis… [+1432 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Partha Sarathi Biswas", "title": "Afghan economy in tatters, relations on hold, Delhi and Kabul trade via Dubai", "description": "Afghanistan has been a major destination for Indian sugar, and India one of the biggest importers of Afghan spices and dried fruits, especially apricots and figs.", "url": "https://indianexpress.com/article/india/afghan-economy-in-tatters-relations-on-hold-delhi-and-kabul-trade-via-dubai-7926769/", "urlToImage": "https://images.indianexpress.com/2022/05/Kabul-trade-via-Dubai.jpg", "publishedAt": "2022-05-19T22:48:01Z", "content": "The chaos that followed the Taliban takeover of Kabul in August last year saw India shutting down its mission and pulling out of Afghanistan. With the countrys economy in a shambles and diplomatic ti… [+3901 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Sanjay colony residents approach High Court to stall demolition", "description": "On the other hand, the petitioners, Mohan Sahni and others, through counsel Rohit Joshi and Sanjeev K Yadav, contended that the colony’s water tank has been demolished and even the toilets are being dismantled and removed.", "url": "https://indianexpress.com/article/cities/chandigarh/sanjay-colony-residents-approach-high-court-to-stall-demolition-7926856/", "urlToImage": "https://images.indianexpress.com/2022/05/Punjab-HC-2-1-2.jpeg", "publishedAt": "2022-05-19T22:42:54Z", "content": "Residents of Sanjay labour colony at Industrial Area, Chandigarh have filed a petition before the Punjab and Haryana High Court, seeking to quash the notice issued by the Chandigarh Administration an… [+1218 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "22-year-old dies at Panchkula hospital, family cries foul, creates ruckus", "description": "As per officials, the victim, one Mahesh (22), a resident of Indira Colony, had been brought to Civil Hospital on May 18 around 6:30 pm  by his friends after he complained of a severe headache , stomach ache and vomiting", "url": "https://indianexpress.com/article/cities/panchkula/22-year-old-dies-at-panchkula-hospital-family-cries-foul-creates-ruckus-7926854/", "urlToImage": "https://images.indianexpress.com/2022/05/doctor-759-4-3.jpg", "publishedAt": "2022-05-19T22:40:33Z", "content": "A 22-year-old man died during treatment at Panchkula’s Civil Hospital, Sector 6, on Wednesday night, following which the kin of the patient created a ruckus on the premises of the health hub alleging… [+1537 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "16.48 gm heroin case: Panchkula crime branch nabs Nigerian", "description": "During the interrogation, he told them that he had bought the substance from Vishal, who was taken into police custody on May 18. Vishal informed the crime branch that he purchased the drugs from Delhi-based Kanu.", "url": "https://indianexpress.com/article/cities/panchkula/16-48-gm-heroin-case-panchkula-crime-branch-nabs-nigerian-7926852/", "urlToImage": "https://images.indianexpress.com/2022/05/handcuff-4-8.jpg", "publishedAt": "2022-05-19T22:38:04Z", "content": "The crime branch team arrested three accused including a Nigerian in a heroin smuggling case. The accused have been identified as Vishal of Sector 19, Gopal Singh of Sector 4 and a Nigerian national,… [+11 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "State to raise loan worth Rs 2,000 crore to fund development projects", "description": "The government stock, up to 10 per cent of the notified amount of the sale, will be alloted to eligible individuals and institutions subject to 1 per cent of the notified amount for a single bid.", "url": "https://indianexpress.com/article/cities/mumbai/state-to-raise-loan-worth-rs-2000-crore-to-fund-development-projects-7926847/", "urlToImage": "https://images.indianexpress.com/2022/01/Ajit-Pawar.jpeg", "publishedAt": "2022-05-19T22:36:48Z", "content": "The state Finance Department has decided to raise a loan of Rs 2,000 crore to fund the developmental programmes of the state.The government stock, up to 10 per cent of the notified amount of the sale… [+566 chars]"}]}