{"status": "ok", "totalResults": 471, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Abhinav Rajput", "title": "High voltage campaign ends for Rajinder Nagar bypoll", "description": "There have been several violations of the election procedure reported in the area, with 36,390 cases of defacement being recorded since May 25. There have been police complaints in 23 cases, including 12 against AAP and nine against BJP, said Singh.", "url": "https://indianexpress.com/article/cities/delhi/high-voltage-campaign-ends-for-rajinder-nagar-bypoll-7982835/", "urlToImage": "https://images.indianexpress.com/2022/06/Rajinder-Nagar-bypoll.jpg", "publishedAt": "2022-06-21T14:33:50Z", "content": "The campaign for the Rajinder Nagar bypoll ended at 6 pm Tuesday, with restrictions in place to ensure voters are not influenced afterward. Fifteen teams from the police and central forces were stati… [+2941 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Deeptiman Tiwary", "title": "Bribery case: Biocon Biologics senior executive among 5 arrested", "description": "According to the CBI FIR, Eswara Reddy had three files of Biocon Biologics pending with him for clearance and bribes had been allegedly negotiated for clearing all of them. Biocon, a company founded by industrialist Kiran Mazumdar Shaw, has denied the CBI all…", "url": "https://indianexpress.com/article/india/bribery-case-biocon-biologics-senior-executive-among-5-arrested-7982774/", "urlToImage": "https://images.indianexpress.com/2022/06/CBI-1.jpg", "publishedAt": "2022-06-21T14:26:58Z", "content": "The CBI on Tuesday arrested five persons, including Biocon Biologics Associate Vice-President L Praveen Kumar, in connection with the bribery case in which S Eswara Reddy, the Joint Drug Controller (… [+2741 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Vikrant Massey recalls he got his first break when he was standing in the washroom queue: ‘She asked will you act?’", "description": "Vikrant Massey, in a recent interview, recalled how he landed his first break on television when he was only 16 years old.", "url": "https://indianexpress.com/article/entertainment/bollywood/vikrant-massey-recalls-first-break-standing-in-the-washroom-queue-7982489/", "urlToImage": "https://images.indianexpress.com/2022/06/vikrant-massey.jpg", "publishedAt": "2022-06-21T14:25:46Z", "content": "Actor Vikrant Massey worked in television for many years before he moved on to movies. He landed his first show Kahaan Hoon Main when he was still a teenager. In a recent interview with Mashable Indi… [+1412 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Jagdeep Singh Deep", "title": "Sangrur bypolls halts Cong’s plan to remove Mohali municipality mayor", "description": "A senior Congress councillor, requesting anonymity, said that the leadership of party at the moment was busy in preparing for the Sangrur byelections, after which the politics in the civic body may witness significant political developments.", "url": "https://indianexpress.com/article/cities/chandigarh/sangrur-bypolls-halts-congs-plan-to-remove-mohali-municipality-mayor-7982680/", "urlToImage": "https://images.indianexpress.com/2022/06/Amarjit-Singh-Sidhu.jpg", "publishedAt": "2022-06-21T13:51:16Z", "content": "The June 23 Sangrur bypolls has temporarily put on hold the Mohali Congress’ plan of ousting the civic body mayor, Amarjit Singh Sidhu, who had switched over to the Bharatiya Janata Party (BJP) last … [+2108 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Rajeev Khandelwal returns as a cop in comedy thriller Miya Biwi Aur Murder. Watch video", "description": "Starring Rajeev Khandelwal and Manjari Fadnnis in the lead, Miya Biwi Aur Murder releases on July 1.", "url": "https://indianexpress.com/article/entertainment/web-series/rajeev-khandelwal-returns-as-a-cop-in-comedy-thriller-miya-biwi-aur-murder-watch-video-mx-player-7982744/", "urlToImage": "https://images.indianexpress.com/2022/06/rajeev1200.jpg", "publishedAt": "2022-06-21T13:47:15Z", "content": "MX Player on Tuesday released the trailer of their upcoming series Miya Biwi Aur Murder. The show stars Rajeev Khandelwal and Manjari Fadnnis in the lead roles.Rajeev and Manjari are Priya and Jayesh… [+1490 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Yashwant Sinha, BJP Detractor, Opposition Face For Presidential Election", "description": "", "url": "https://indianexpress.com/videos/news-video/yashwant-sinha-bjp-detractor-opposition-face-for-presidential-election/", "urlToImage": "https://images.indianexpress.com/2022/06/1-181.jpg", "publishedAt": "2022-06-21T13:28:30Z", "content": "Hardeep Puri Defends Central Vista, Calls Criticism “B S, With Capital B and Capital S”"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Hansal Mehta to direct SonyLIV series based on RAW founder Rameshwar Nath Kao", "description": "The series will trace the journey and exploits of Rameshwar Nath Kao, the first chief of RAW.", "url": "https://indianexpress.com/article/entertainment/web-series/hansal-mehta-to-direct-sony-liv-series-raw-founder-7982372/", "urlToImage": "https://images.indianexpress.com/2022/04/Hansal-Mehta-1200.jpg", "publishedAt": "2022-06-21T12:09:57Z", "content": "Hansal Mehta is set to direct a SonyLIV series based on RK Yadav’s book Mission R&amp;AW. The show will trace the journey and exploits of Rameshwar Nath Kao, the first chief of Indias foreign intelli… [+1047 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kamal Saiyed", "title": "Explained: How Gujarat’s first multi-layer flyover will help ease Surat’s traffic woes?", "description": "This three-level bridge was planned by the Surat Municipal Corporation (SMC) to ease the traffic at Sahara Darwaza on the city's ring road, where the textile markets are located.", "url": "https://indianexpress.com/article/explained/explained-how-gujarats-first-multi-layer-flyover-will-help-ease-surats-traffic-woes-7982349/", "urlToImage": "https://images.indianexpress.com/2022/06/gujarat-flyover.jpg", "publishedAt": "2022-06-21T11:42:41Z", "content": "Gujarat Sunday inaugurated the state’s first multi-level railway-over-bridge and flyover built at the cost of Rs 133.50 crore. A look at the three-level bridge, its features and how it will change li… [+2303 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "R Mahalakshmi", "title": "Deletions in social science textbooks: History in the service of politics", "description": "Revision of school curriculum is necessary. But changes proposed by NCERT in history textbooks undermine critical inquiry", "url": "https://indianexpress.com/article/opinion/columns/deletions-in-social-science-textbooks-history-in-the-service-of-politics-7982177/", "urlToImage": "https://images.indianexpress.com/2022/06/book-2.jpg", "publishedAt": "2022-06-21T11:22:38Z", "content": "A common refrain when talking of changes in curriculum is reducing the content load on students. The recent notification on the rationalisation of content in the textbooks by the NCERT begins with th… [+6252 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manas Srivastava", "title": "UPSC Essentials: Reports, policies and data on your tips- Global Trends Report 2021", "description": "What are the key points of recently released Global Trends Report ? Since global refugee crisis is a burning issue, aspirants must go through the essential points of this UN report for UPSC-CSE.", "url": "https://indianexpress.com/article/upsc-current-affairs/upsc-essentials/upsc-essentials-reports-policies-and-data-on-your-tips-global-trends-report-2021-7982168/", "urlToImage": "https://images.indianexpress.com/2022/06/Untitled-design-31-1.jpg", "publishedAt": "2022-06-21T11:13:27Z", "content": "Essential data, facts and figures from reports, policies, schemes and important documents for UPSC-CSE.Global Trends Report 2021\r\nSyllabus-\r\nPreliminary Examination: Current events of national and in… [+4967 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "BJP filing false complaints to stall work being done by AAP in various sectors: Sisodia", "description": "Sisodia's comments came days after Lt Governor V K Saxena gave his nod to the Anti-Corruption Branch to probe allegations of irregularities in the construction of seven temporary hospitals here during the Covid pandemic.", "url": "https://indianexpress.com/article/cities/delhi/bjp-false-complaints-stall-work-aap-sisodia-7982244/", "urlToImage": "https://images.indianexpress.com/2022/06/manish-sisodia-7591.jpg", "publishedAt": "2022-06-21T10:42:00Z", "content": "Delhi Deputy Chief Minister Manish Sisodia on Tuesday accused the BJP of filing false complaints to stall the work being done by the ruling Aam Aadmi Party in the capital.Sisodia’s comments came days… [+1002 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "After a Pivotal Period in Ukraine, U.S. Officials Predict the War’s Path", "description": "Several military analysts say Russia is at peak combat effectiveness in the east, as long-range artillery systems promised to Ukraine from NATO countries are still trickling in.", "url": "https://indianexpress.com/article/world/pivotal-period-ukraine-u-s-officials-predict-wars-path-7982141/", "urlToImage": "https://images.indianexpress.com/2022/06/UKRAINE-RUSSIA-9-3.jpg", "publishedAt": "2022-06-21T10:27:06Z", "content": "Written by Helene Cooper, Eric Schmitt and Julian E. BarnesWhen Russia shifted its military campaign to focus on eastern Ukraine this spring, senior officials in the Biden administration said the nex… [+9435 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Beautiful images created using retired telescope data reveals space dust mysteries - The Indian Express", "description": "<ol><li>Beautiful images created using retired telescope data reveals space dust mysteries  The Indian Express\r\n</li><li>See our galactic neighbors as you’ve never seen them before  Digital Trends\r\n</li><li>View Full coverage on Google News</li></ol>", "url": "https://indianexpress.com/article/technology/science/beautiful-images-created-using-retired-telescope-data-reveals-space-dust-mysteries-7982090/", "urlToImage": "https://images.indianexpress.com/2022/06/Andromeda-herschel-image-space-dust.jpg", "publishedAt": "2022-06-21T10:20:37Z", "content": "New images that use data from retired ESA (European Space Agency) and NASA missions show the dust that fills the space between stars in four galaxies closest to our own Milky Way. The striking pictur… [+3708 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pranav Mukul", "title": "Explained: Why RBI has stopped credit lines from fintech firms like Simpl and Amazon Pay", "description": "The banking regulator has clarified that its master direction on prepaid payment instruments (PPIs) does not permit loading of PPIs from credit lines -- a practice being undertaken by several fintech credit card companies.", "url": "https://indianexpress.com/article/explained/everyday-explainers/what-is-the-rbi-credit-line-notification-7982135/", "urlToImage": "https://images.indianexpress.com/2022/06/RBI-1-3.jpg", "publishedAt": "2022-06-21T10:08:17Z", "content": "The Reserve Bank of India (RBI) has issued a notification disallowing non-bank prepaid wallets and prepaid cards from loading credit lines — preset borrowing limits — into these platforms.This comes … [+2357 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "‘Will never cheat for power, we are staunch Shiv Saniks’: Eknath Shinde", "description": "\"We have never and will never cheat for power regarding Balasaheb's thoughts and Dharmaveer Anand Dighe Saheb's teachings,\" Shinde said.", "url": "https://indianexpress.com/article/cities/mumbai/will-never-cheat-for-power-we-are-staunch-shiv-saniks-eknath-shinde-7982025/", "urlToImage": "https://images.indianexpress.com/2022/06/shinde12.jpg", "publishedAt": "2022-06-21T10:02:45Z", "content": "“We are Balasaheb’s staunch Shiv Sainiks … Balasaheb has taught us Hindutva. We have never and will never cheat for power regarding Balasaheb’s thoughts and Dharmaveer Anand Dighe Saheb’s teachings,”… [+1061 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "J&K police crack Kathua bank robbery case; 2 held, Rs 1.45 cr seized", "description": "Police sources said that one of the robbers had hidden the cash in a water tank at his house.", "url": "https://indianexpress.com/article/cities/jammu/jk-police-crack-kathua-bank-robbery-case-2-held-rs-1-45-cr-seized-7981704/", "urlToImage": "https://images.indianexpress.com/2022/06/kashmir-police-759-1.jpeg", "publishedAt": "2022-06-21T10:00:13Z", "content": "Within 24 hours of the case being registered, the Jammu and Kashmir police cracked the HDFC Bank robbery case in Kathua on Tuesday by arresting two people, including a former bank employee, and seizi… [+125 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Amit Shah, J P Nadda to discuss Maharashtra development with Fadnavis in Delhi", "description": "The move by Eknath Shinde and other MLAs to move to a BJP-ruled state is being seen as a threat to the Maha Vikas Aghadi government in Maharashtra and BJP leaders said that the top leadership is reflecting on its next move.", "url": "https://indianexpress.com/article/cities/mumbai/amit-shah-j-p-nadda-to-discuss-maharashtra-development-with-fadnavis-7982024/", "urlToImage": "https://images.indianexpress.com/2022/06/fadnavis-shah-759.jpg", "publishedAt": "2022-06-21T09:40:54Z", "content": "Union Home Minister Amit Shah and BJP president J P Nadda will hold a meeting Tuesday with partys Maharashtra leader Devendra Fadnavis to discuss the developments in the state after senior Shiv Sena … [+1274 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "When can women start with prenatal yoga, and what are its benefits?", "description": "Prenatal yoga concentrates on positions that are especially meant for pregnant women, Dr Swati Gaikwad, consultant obstetrician and gynaecologist, Motherhood Hospital, Pune told indianexpress.com", "url": "https://indianexpress.com/article/lifestyle/health/survey-pregnant-women-prenatal-yoga-benefits-7980480/", "urlToImage": "https://images.indianexpress.com/2022/06/PRENATAL-yoga_200_getty.jpg", "publishedAt": "2022-06-21T09:30:17Z", "content": "Ahead of International Day of Yoga, a prenatal yoga survey conducted amongst 6,000 expecting and new mothers revealed that while 91 per cent said that prenatal exercise is healthy during pregnancy, o… [+2645 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Akasa Air’s first Boeing aircraft lands at IGI airport", "description": "Akasa Air, last August, received a no-objection certificate from the Ministry of Civil Aviation in August 2021 to launch commercial flight operations", "url": "https://indianexpress.com/article/business/aviation/akasa-air-receives-first-boeing-aircraft-7981633/", "urlToImage": "https://images.indianexpress.com/2022/06/Akasa-air-1200-twitter.jpg", "publishedAt": "2022-06-21T08:57:08Z", "content": "Billionaire investor Rakesh Jhunjhunwala-promoted Akasa Air on Tuesday received its first plane from American aerospace company Boeing.Boeing’s 737 Max aircraft, which flew from Seattle, touched down… [+1672 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "BTS’ V takes cheeky dig at fan who asks him whether ARMY is more fun than the band; says a video made him cry", "description": "BTS' V took to Weverse and responded to several fans about his recent photos, and even took a playful dig at them.", "url": "https://indianexpress.com/article/entertainment/music/bts-v-takes-cheeky-dig-at-fan-who-asks-him-whether-army-is-more-fun-than-the-band-reveals-video-7981648/", "urlToImage": "https://images.indianexpress.com/2022/06/BTSV.jpg", "publishedAt": "2022-06-21T08:56:19Z", "content": "BTS’ V(born Kim Taehyung) playfully teased a fan on Weverse, leaving ARMY in splits with his reply. The vocalist took to the website and responded to several fans about his recent almost-shirtless ph… [+1683 chars]"}]}