{"status": "ok", "totalResults": 687, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Ex-CBI interim director approaches court over Twitter blue tick, Delhi HC imposes Rs 10,000 fine on him", "description": "Delhi HC on M Nageswara Rao: Justice Yashwant Varma said there was “absolutely no justification” which warranted filing of the petition when a similar plea was disposed of by the court on April 7.", "url": "https://indianexpress.com/article/cities/delhi/ex-cbi-interim-director-approaches-court-over-twitter-blue-tick-delhi-hc-imposes-rs-10000-fine-on-him-7922304/", "urlToImage": "https://images.indianexpress.com/2022/05/CBI-RAO-1.jpg", "publishedAt": "2022-05-17T14:35:14Z", "content": "Delhi High Court Tuesday imposed a cost of Rs 10,000 on former CBI interim Director and retired IPS officer M Nageswara Rao in connection with his petition against Twitters decision to withdraw the b… [+1383 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Tamim ton puts Bangladesh in charge of 1st test on Day 3", "description": "Bangladesh started the day on 76 without loss, and Tamim on 35. He went after the Sri Lankan bowlers aggressively, hitting Vishwa Fernando for consecutive boundaries in the first two balls he faced.", "url": "https://indianexpress.com/article/sports/cricket/tamim-ton-puts-bangladesh-in-charge-of-1st-test-on-day-3-7922302/", "urlToImage": "https://images.indianexpress.com/2022/05/SL-BAN-2.jpg", "publishedAt": "2022-05-17T14:33:06Z", "content": "Opener Tamim Iqbal’s first century against Sri Lanka put Bangladesh in charge of the first test after three days on Tuesday.Bangladesh was 318-3, only 79 runs behind Sri Lanka’s 397.\r\nTamim made 133 … [+2706 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Deepika Padukone wows in Mysore silk shirt, deconstructed Maharani necklace at Cannes 2022; see pics", "description": "Jury member Deepika Padukone stole the show at the 75th annual Cannes Film Festival as she made a stunning appearance on Day 1", "url": "https://indianexpress.com/article/lifestyle/fashion/deepika-padukone-day-1-cannes-2022-sabyasachi-fashion-looks-pictures-7922211/", "urlToImage": "https://images.indianexpress.com/2022/05/Deepika-13.jpg", "publishedAt": "2022-05-17T14:30:03Z", "content": "The much-awaited 75th edition of the annual Cannes Film Festival has officially kickstarted, and we cannot wait to see Indian stars make dazzling appearances on the red carpet. Putting an end to fans… [+1396 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shivani Naik", "title": "Thomas Cup win is a high for Indian badminton – challenge is to stay on top", "description": "The badminton fraternity will have to start preparing for those years of silent training that will not be streamed live or trend on social media", "url": "https://indianexpress.com/article/opinion/thomas-cup-win-badminton-next-challenge-7922276/", "urlToImage": "https://images.indianexpress.com/2022/05/AP05_15_2022_000153B.jpg", "publishedAt": "2022-05-17T14:27:08Z", "content": "In sport, tomorrow always comes. And it brings both promises and pressures of a brand new title to fight for. India’s victorious Thomas Cup team will be feted, hailed and will go down in the pages of… [+4162 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "Watch: Baby elephant competes with the caretaker to lay on his mattress", "description": "In the undated video, that was shared by Indian Forest Services officer Samrat Gowda, one can see a young elephant calf nudging a man who is lying down on what appears to be an inflatable mattress.", "url": "https://indianexpress.com/article/trending/trending-in-india/baby-elephant-competes-with-the-caretaker-to-lay-on-his-mattress-7922293/", "urlToImage": "https://images.indianexpress.com/2022/05/elephant-matress-man.jpg", "publishedAt": "2022-05-17T14:26:01Z", "content": "Elephants are arguably the most gentle and lovable of all wild animals. Their adorable interactions with humans and other animals often win over the internet.Recently, such a video of a baby elephant… [+2462 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "After Gyanvapi “Shivling” claim, Opposition Parties Hit Back", "description": "", "url": "https://indianexpress.com/videos/news-video/after-gyanvapi-shivling-claim-opposition-parties-hit-back/", "urlToImage": "https://images.indianexpress.com/2022/05/Gyanvapi-Mosque-YT-copy.jpg", "publishedAt": "2022-05-17T14:25:21Z", "content": "PM arrives in Lumbini, Nepal to lay foundation stone of Buddhist Centre"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Sainik Farms regularisation: Delhi HC says repairs should be permitted, raps Centre for indecision", "description": "Delhi HC on Sainik farms: The court said the authorities should look into the aspect of allowing repairs as the prohibition may put the residents at risk.", "url": "https://indianexpress.com/article/cities/delhi/sainik-farms-regularisation-delhi-hc-says-repairs-should-be-permitted-raps-centre-for-indecision-7922287/", "urlToImage": "https://images.indianexpress.com/2022/05/SAINIK-FARMS-1.jpg", "publishedAt": "2022-05-17T14:25:11Z", "content": "The Delhi High Court Tuesday pulled up the Centre for its indecision on the proposed regularisation of Sainik Farms and said that a strict embargo even on carrying out repairs to the existing structu… [+3120 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "As CBI raids properties linked to Chidambaram’s, Congress lashes out at BJP", "description": "", "url": "https://indianexpress.com/videos/news-video/as-cbi-raids-properties-linked-to-chidambarams-congress-lashes-out-at-bjp/", "urlToImage": "https://images.indianexpress.com/2022/05/Chidambaram-YT-copy.jpg", "publishedAt": "2022-05-17T14:21:18Z", "content": "After Gyanvapi Shivling claim, Opposition Parties Hit Back"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Omkar Gokhale, Hamza Khan", "title": "Collegium recommends two Bombay HC judges as Chief Justices of Rajasthan, Himachal courts", "description": "Justice S S Shinde, with Arnab Goswami, Elgar Parishad cases behind him, is cleared for Rajasthan.", "url": "https://indianexpress.com/article/india/political-pulse/collegium-recommends-two-bombay-hc-judges-as-chief-justices-of-rajasthan-himachal-courts-7922278/", "urlToImage": "https://images.indianexpress.com/2022/05/supreme-court-4.jpg", "publishedAt": "2022-05-17T14:19:27Z", "content": "The Supreme Court Collegium has recommended the name of Bombay High Court judge Justice S S Shinde as the new Chief Justice of the Rajasthan High Court. In the past few years, Justice Shinde has deal… [+4461 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Provoking EU, UK sets out new law to fix post-Brexit North Ireland trade", "description": "UK Foreign Secretary Liz Truss said planned legislation would ease the movement of goods, apply Britain's tax regime in Northern Ireland and hand London more say over the laws governing the province.", "url": "https://indianexpress.com/article/world/north-ireland-uk-trade-brexit-deal-7922265/", "urlToImage": "https://images.indianexpress.com/2022/05/liz-truss.jpg", "publishedAt": "2022-05-17T14:14:34Z", "content": "Britain set out steps on Tuesday to try to break the deadlock with the European Union on trade with Northern Ireland, lining up a new law that would effectively override parts of a Brexit deal and fu… [+4875 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "F3 song Life Ante Itta Vundaala: This Venkatesh, Varun Tej and Pooja Hegde track makes you want to groove", "description": "F3 song Life Ante Itta Vundala is a fun track that makes you want to groove. Venkatesh, Varun Tej and Pooja Hegde are in top form in the music video of Life Ante Itta Vundala.", "url": "https://indianexpress.com/article/entertainment/telugu/f3-song-life-ante-itta-vundaala-venkatesh-varun-tej-and-pooja-hegde-song-7922252/", "urlToImage": "https://images.indianexpress.com/2022/05/F3-song.jpg", "publishedAt": "2022-05-17T14:13:13Z", "content": "Trust Devi Sri Prasad to give you a song that will make you want to hit the dance floor. The music composer, who made the country groove to Oo Antava Oo Oo Antava from Pushpa The Rise, has composed y… [+1300 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kamaldeep Singh Brar", "title": "Ahead of Sangrur bypoll, a happy photograph and talk of panthic unity", "description": "Bitter rivals not too long ago, factions of the Shiromani Akali Dal have come together on a common platform. But for how long, ask sceptics", "url": "https://indianexpress.com/article/india/political-pulse/ahead-of-sangrur-bypoll-a-happy-photograph-and-talk-of-panthic-unity-7922257/", "urlToImage": "https://images.indianexpress.com/2022/05/BADAL.jpg", "publishedAt": "2022-05-17T14:10:42Z", "content": "A photograph from May 11 of Shiromani Akali Dal (Badal) president Sukhbir Singh Badal with SAD (Amritsar) president Simranjit Singh Mann and SAD (Delhi) president Paramjit Singh Sarna arch rivals of … [+3820 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Explained Desk", "title": "Explained: Why did Railways abolish 72,000 posts", "description": "The Indian Railways is the country's biggest job provider employing an estimated 1.4 million people. It also attracts applicants in droves with almost all recruitment drives seeing a massive rush.", "url": "https://indianexpress.com/article/explained/railways-abolish-posts-explained-7922247/", "urlToImage": "https://images.indianexpress.com/2022/05/Indian-railway-.jpg", "publishedAt": "2022-05-17T14:06:37Z", "content": "Rajya Sabha MP from Kerala, Dr V Sivadasan, has written to Union Rail Minister Ashwini Vaishnaw asking him to reinstate around 72,000 positions that the Railways, country’s biggest employer, has abol… [+2605 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "SA batter Zubayr Hamza suspended by ICC for doping violation", "description": "Hamza provided an out-of-competition sample on January 17, 2022 in Paarl, South Africa, in which the prohibited substance Furosemide - which is a specified substance in Section S5 of the 2022 WADA Prohibited List - was found.", "url": "https://indianexpress.com/article/sports/cricket/sa-batter-zubayr-hamza-suspended-by-icc-for-doping-violation-7922263/", "urlToImage": "https://images.indianexpress.com/2022/05/Hamza.jpg", "publishedAt": "2022-05-17T14:04:47Z", "content": "The ICC on Tuesday suspended South African batter Zubayr Hamza from all cricket-related activities for a period of nine months after he admitted to an anti-doping rule violation under the apex body’s… [+1402 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Liz Mathew", "title": "Needle moves within BJP on Kashi, Mathura: ‘Shivling changes everything… Ayodhya context invalid’", "description": "Senior BJP leaders, including some office-bearers, told The Indian Express that “new developments” have triggered fresh debate within that could also include a relook at the Places of Worship (Special Provisions) Act 1991.", "url": "https://indianexpress.com/article/india/political-pulse/gyanvapi-bjp-on-kashi-mathura-shivling-7922250/", "urlToImage": "https://images.indianexpress.com/2022/05/gyanvapi-1200.jpg", "publishedAt": "2022-05-17T14:01:54Z", "content": "When the Supreme Court ruled in favour of the Ram temple in Ayodhya on November 9, 2019, Prime Minister Narendra Modi called it a day to forget any bitterness one may have. The same day, responding t… [+4923 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sohini Ghosh", "title": "Kannada actor Chetana Raj’s death: How safe is fat removal surgery?", "description": "When it comes to fat removal surgery, a thorough pre-operative check-up is just as important as strict follow-up and a healthy diet regimen, says Dr Pinal Shah, bariatrics counsellor at KD Hospital in Ahmedabad.", "url": "https://indianexpress.com/article/lifestyle/health/kannada-actor-chetana-rajs-death-how-safe-is-fat-removal-surgery-7922210/", "urlToImage": "https://images.indianexpress.com/2022/05/chetna.jpg", "publishedAt": "2022-05-17T14:01:30Z", "content": "Kannada actor Chetana Raj, 22, died following post-operative complications after she underwent a fat removal surgery at a private hospital in Bengaluru on Monday. Her parents have since alleged that … [+3322 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Burkina Faso fashion designers: More to nation than conflict", "description": "When the capital was hit by frequent power cuts, models and designers used the lights of their cell phones to put on makeup and fix their hair.", "url": "https://indianexpress.com/article/lifestyle/fashion/burkina-faso-fashion-designers-more-to-nation-than-conflict-7921773/", "urlToImage": "https://images.indianexpress.com/2022/05/Ouaga-Fashion-Week_AP1200.jpg", "publishedAt": "2022-05-17T14:00:14Z", "content": "Vibrant African clothes, both traditional and contemporary, enlivened the catwalk in Burkina Fasos fashion week.Designers say they are striving to make the West African country become known as an eme… [+3174 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "‘This is honestly so cute’: Cab driver’s honesty about being late for eating paratha wins internet", "description": "Impressed by the driver's candid reply, Twitter user Karishma Mehrotra shared a screenshot of her conversation with the Uber driver.", "url": "https://indianexpress.com/article/trending/trending-in-india/cab-driver-honesty-about-being-late-for-eating-paratha-7922168/", "urlToImage": "https://images.indianexpress.com/2022/05/paratha-taxi.jpg", "publishedAt": "2022-05-17T13:59:16Z", "content": "Thanks to online taxi services, booking a cab may seem to have become easy. But ask any Indian, they’ll share a long list of stories when drivers have cancelled the ride even after making them wait f… [+2755 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Seville on alert as fans arrive for Europa League final", "description": "Both clubs are hoping to end decades of European despair by winning the final of the second-tier continental competition at Sevilla’s Ramón Sánchez-Pizjuán Stadium.", "url": "https://indianexpress.com/article/sports/football/seville-on-alert-as-fans-arrive-for-europa-league-final-7922254/", "urlToImage": "https://images.indianexpress.com/2022/05/UEL.jpg", "publishedAt": "2022-05-17T13:56:11Z", "content": "More than 5,000 police officers and security personnel are on high alert in Seville as the Spanish city braces for the throngs of Rangers and Eintracht Frankfurt fans arriving for the Europa League f… [+3115 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "64 police personnel now guard Arvind Kejriwal, proposal to curb public outside his house being considered: Police to court", "description": "Delhi news: On April 25, the court had rapped the police for its “failure” to prevent vandalism outside CM Arvind Kejriwal’s residence and said that the force needs to seriously look at its efficiency and functioning.", "url": "https://indianexpress.com/article/cities/delhi/cm-arvind-kejriwal-security-residence-aap-delhi-police-7922245/", "urlToImage": "https://images.indianexpress.com/2022/05/arvind-kejriwal-2.jpg", "publishedAt": "2022-05-17T13:55:53Z", "content": "The Delhi Police Tuesday told the Delhi High Court that the security at Delhi Chief Minister Arvind Kejriwals residence has been increased and a proposal to curtail public entry on the road outside i… [+2557 chars]"}]}