{"status": "ok", "totalResults": 604, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Jawan teaser: Shah Rukh Khan goes pan-India in Atlee’s action-packed thriller. Watch announcement video", "description": "Shah Rukh Khan's next Jawan, to be directed by Atlee, was announced on Friday. SRK's last starring role came in 2018's critical and commercial disappointment Zero. He is now planning a major comeback, with three films lined up.", "url": "https://indianexpress.com/article/entertainment/bollywood/jawan-shah-rukh-khan-atlee-film-announcement-action-pan-india-7950558/", "urlToImage": "https://images.indianexpress.com/2022/06/jawan-teaser-shah-rukh-khan-atlee.jpg", "publishedAt": "2022-06-03T08:42:45Z", "content": "Red Chillies Entertainment on Friday announced Shah Rukh Khan’s new film, Jawan. Directed by Atlee, the action-thriller has reportedly been in production for a while now, with several set leaks makin… [+3168 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Taj Mahal is third most-viewed tourist destination on Google Street View; top spot taken by…", "description": "\"With so many places and landmarks at your fingertips, three spots, in particular, piqued your interest over the past year,\" Google wrote in a blog", "url": "https://indianexpress.com/article/lifestyle/destination-of-the-week/taj-mahal-most-viewed-tourist-spot-google-street-view-burj-khalifa-eiffel-tower-7950354/", "urlToImage": "https://images.indianexpress.com/2022/06/taj-mahal-1200.jpg", "publishedAt": "2022-06-03T08:40:44Z", "content": "Google Street View, a technology that enabled us to traverse places miles away while sitting in our homes, completed 15 years recently. Since 2007, it has captured over 220 billion images and more th… [+1958 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Janardhan Koushik", "title": "Nearly 60 kg expired meat seized from Chennai restaurant", "description": "Food safety department shuts down kitchen for 15 days, asks restaurant to upgrade facilities", "url": "https://indianexpress.com/article/cities/chennai/expired-meat-chennai-restaurant-food-safety-department-7950806/", "urlToImage": "https://images.indianexpress.com/2022/06/WhatsApp-Image-2022-06-02-at-7.33.47-PM.jpeg", "publishedAt": "2022-06-03T08:39:47Z", "content": "Food safety department officials on Thursday raided a popular restaurant on 100 Feet Road in Chennais Vadapalani after a complaint from a customer that they had been served stale meat and found close… [+1978 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Johnson T A", "title": "Unlike BSY, Karnataka CM Bommai bowing to RSS: Former Congress minister Mahadevappa", "description": "The remarks come at a time when right-wing groups have targeted minorities in the state on issues like the wearing of hijab, the presence of non-Hindu traders at temple fairs and alleged illegal conversions.", "url": "https://indianexpress.com/article/cities/bangalore/unlike-bsy-karnataka-cm-bommai-bowing-to-rss-former-congress-minister-mahadevappa-7950805/", "urlToImage": "https://images.indianexpress.com/2022/06/bommai-3-2.jpeg", "publishedAt": "2022-06-03T08:35:14Z", "content": "A former Congress minister has claimed that unlike former chief minister B S Yediyurappa, the current BJP chief minister of Karnataka Basavaraj Bommai has become subservient to the BJP’s ideological … [+2770 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "‘It’s gotten easier with time’: Marnus Labuschagne on coping with scrutiny", "description": "The Australia cricketer Marnus Labuschagne in his latest newsletter talks about his mannerisms, Jacques Kallis, and Test wickets in England.", "url": "https://indianexpress.com/article/sports/cricket/its-gotten-easier-with-time-marnus-labuschagne-on-coping-with-scrutiny-7950426/", "urlToImage": "https://images.indianexpress.com/2021/12/Labuschagne.jpg", "publishedAt": "2022-06-03T08:34:58Z", "content": "Not many can claim they know how it feels to be in Marnus Labuschagne’s shoes. Not because in a short Test career he has scored 6 hundreds and 13 fifties. That he is brilliant is not the primary reas… [+3895 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sanath Prasad", "title": "UPSC CSE Result: AIR 191 Apoorva Basur wants to revamp healthcare infrastructure in North Karnataka", "description": "Hailing from the North Karnataka region that is facing a dire health infrastructure, Basur wants to improve and revamp the health infrastructure when she takes charge.", "url": "https://indianexpress.com/article/jobs/upsc-cse-result-air-191-dr-apoorva-basur-revamp-healthcare-infrastructure-in-north-karnataka-7950786/", "urlToImage": "https://images.indianexpress.com/2022/06/Apoorva-1.jpg", "publishedAt": "2022-06-03T08:25:21Z", "content": "Apoorva Basur was going through a mixed bag of emotions ahead of her UPSC Civil Service exam results, however, she is now soaked in excitement after securing 191 rank in her second attempt. A graduat… [+301 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Kartik Aaryan on being celebrated for saving Bollywood amid the success of South films: ‘Miles to go…’", "description": "Kartik Aaryan, post the success of his horror comedy, Bhool Bhulaiyaa 2, is being hailed as one of the most successful stars in Bollywood.", "url": "https://indianexpress.com/article/entertainment/bollywood/kartik-aaryan-on-being-hailed-for-saving-bollywood-in-the-times-of-south-indian-films-reigning-the-box-office-miles-to-go-and-lots-more-to-do-7950380/", "urlToImage": "https://images.indianexpress.com/2022/05/bhool-bhulaiyaa-2-kartik-aaryan.jpg", "publishedAt": "2022-06-03T08:21:13Z", "content": "Rising superstar Kartik Aaryan’s Bhool Bhulaiyaa 2 is unstoppable at the box office. The horror comedy, directed by Anees Bazmee, also starring Kiara Advani and Tabu, is eyeing Rs 150 crore-mark at t… [+2250 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Won’t forgive guilty at any cost: Punjab CM Bhagwant Mann meets Moosewala’s family", "description": "“I assure you that the culprits would be caught soon. We will not forgive the guilty at any cost. Justice will be done,” Chief Minister Mann told Moosewala’s family at their home in Moosa village, days after the Punjabi singer was shot dead.", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-cm-bhagwant-mann-sidhu-moosewala-family-7950769/", "urlToImage": "https://images.indianexpress.com/2022/06/Mann-Moosewala-1.jpg", "publishedAt": "2022-06-03T08:18:42Z", "content": "Punjab Chief Minister Bhagwant Mann on Friday met late singer-turned-politician Sidhu Moosewalas family and conveyed his condolences, promising to take action against those responsible for his murder… [+1218 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "সাড়ে চার হাজার বছরের প্রাচীন উদ্ভিদের সন্ধান, চমকে গেলেন বিজ্ঞানীরা", "description": "অস্ট্রেলিয়ার পার্থ শহর থেকে ৮০০ কিলোমিটার দূরের শার্ক বে এলাকায় হঠাৎ করেই এই উদ্ভিদের সন্ধান পান গবেষকরা।", "url": "https://bengali.indianexpress.com/world/researchers-discover-worlds-largest-plant-in-australia-451363/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/australia.jpg", "publishedAt": "2022-06-03T08:08:15Z", "content": "Our researchers have discovered the world's largest plant in our very own Shark Bay. The seagrass is dated to be 4,500 years old, stretching across 180km #UWApic.twitter.com/EgQu8ETBSF\r\n— UWA (@uwane… [+15 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Avaneesh Mishra", "title": "Champawat bypoll: Winning with a margin of over 55,000 votes, Dhami saves face, retains Uttarakhand CM post", "description": "With BJP reposing faith in him and Pushkar Singh Dhami returning as chief minister, it was imperative that he get elected to the Uttarakhand Assembly within six months from the date he took over", "url": "https://indianexpress.com/article/india/political-pulse/champawat-bypoll-pushkar-singh-dhami-wins-uttarakhand-7950715/", "urlToImage": "https://images.indianexpress.com/2022/06/dhami-1.jpg", "publishedAt": "2022-06-03T08:03:48Z", "content": "In the Champawat bypoll, Dhami received 58,258 votes (92.94 per cent) in total and confirmed victory with a margin of over 55,000 votes over Congress candidate Nirmala Gahtori. Voting for the Champaw… [+3042 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Priya Kumari Shukla", "title": "Explained: How barcodes differ from radio-frequency identification tags", "description": "Baggage tags equipped with radio-frequency identification will soon be available at Delhi's Indira Gandhi International Airport. How is RFID different from a barcode? Is RFID an enhanced version of the barcode?", "url": "https://indianexpress.com/article/explained/everyday-explainers/barcode-radio-frequency-identification-explained-7950305/", "urlToImage": "https://images.indianexpress.com/2022/06/barcode-vs-rfid.jpg", "publishedAt": "2022-06-03T08:03:47Z", "content": "Baggage tags equipped with radio-frequency identification (RFID) will soon be available at Delhi’s Indira Gandhi International Airport, marking a first of its kind for the country.What is RFID techno… [+4362 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pimpri-Chinchwad: In fresh jolt to BJP, party leader Babu Nair joins Congress", "description": "A former corporator of the Pimpri-Chinchwad Municipal Corporation, Babu Nair claimed he left the BJP as it veered away from the politics of development that it had promised in 2014.", "url": "https://indianexpress.com/article/cities/pune/pimpri-chinchwad-in-fresh-jolt-to-bjp-party-leader-babu-nair-joins-congress-7950600/", "urlToImage": "https://images.indianexpress.com/2022/06/IMG-20220603-WA0005.jpg", "publishedAt": "2022-06-03T08:00:17Z", "content": "In yet another blow to the Pimpri-Chinchwad unit of the BJP ahead of the civic elections, general secretary Babu Nair quit the party and joined the Congress on Thursday evening.Nairs induction into t… [+2208 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Arun Sharma", "title": "Bhim Singh, the man who knew Saddam, Arafat & Castro", "description": "Internationalism too is part of the legacy of J&K Panthers Party founder Bhim Singh who died on May 31.", "url": "https://indianexpress.com/article/india/political-pulse/bhim-singh-death-legacy-7950719/", "urlToImage": "https://images.indianexpress.com/2022/06/Bhim-1.jpg", "publishedAt": "2022-06-03T07:58:13Z", "content": "When Iraqi dictator Saddam Hussein was facing trial in 2005 for committing crimes against humanity, he wanted Jammu and Kashmir leader Bhim Singh to be one of the 11 lawyers on his defence team. Afte… [+4770 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Avijit Pathak", "title": "That which dies when a teacher is killed", "description": "Avijit Pathak writes: The killing of Rajni Bala ought to disturb all those who value the healing power of education", "url": "https://indianexpress.com/article/opinion/columns/jammu-kashmir-teacher-shot-that-which-dies-when-a-teacher-is-killed-7950710/", "urlToImage": "https://images.indianexpress.com/2022/06/jammu-kashmir-school-teacher.jpeg", "publishedAt": "2022-06-03T07:54:07Z", "content": "At a time when the age of violence has reduced death to just a number to be added to the official statistics, we will soon forget Rajni Bala, the 36-year-old teacher who was shot by terrorists in Jam… [+5804 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Hailey Bieber opens up about mental health journey, says therapy has been a ‘game-changer’", "description": "\"It's a space where I feel really safe, to be able to talk about what's going on in my mind, say things out loud and not feel judged,\" she said", "url": "https://indianexpress.com/article/lifestyle/health/hailey-bieber-therapy-mental-health-journey-social-media-7949204/", "urlToImage": "https://images.indianexpress.com/2022/06/Hailey-Bieber-1200.jpg", "publishedAt": "2022-06-03T07:50:33Z", "content": "Mental health conversations have finally entered the mainstream with people opening up about their struggles with depression and anxiety. As such, recently, Hailey Biebershared her mental healthcare … [+2609 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Who is Javier Olivan, Meta’s new COO? A look at his early life and career", "description": "As Olivan takes on new responsibility as the COO, we take a look at his early life and career at Meta.", "url": "https://indianexpress.com/article/technology/social/who-is-javier-olivian-metas-new-coo-a-look-at-his-early-life-and-career-7950420/", "urlToImage": "https://images.indianexpress.com/2022/06/Untitled-design-2022-06-03T123802.331.jpg", "publishedAt": "2022-06-03T07:44:58Z", "content": "Javier Olivan will be the new chief operating officer (COO) at Meta (formerly Facebook). The announcement was confirmed after Sheryl Sandberg announced she was stepping downas the COO after 14 years … [+3746 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "UP will give momentum to India’s growth story: PM Modi at investors’ summit", "description": "\"We recently completed eight years of governance at the Centre. In these years, we progressed on the mantra of 'reform, perform, transform', focused on policy stability, coordination and ease of doing business,\" PM Modi said.", "url": "https://indianexpress.com/article/india/pm-narendra-modi-uttar-pradesh-investors-summit-7950593/", "urlToImage": "https://images.indianexpress.com/2022/06/modi-3.jpg", "publishedAt": "2022-06-03T07:43:30Z", "content": "Prime Minister Narendra Modi Friday said that Uttar Pradesh will be a driving force for India in the next 10 years, giving momentum to India’s growth story. He was speaking at the Uttar Pradesh Inves… [+1025 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Could Johnny Depp return as Jack Sparrow in Pirates of the Caribbean? A former Disney executive says ‘absolutely’", "description": "As per former Disney executive, there is a chance that the defamation trial verdict's impact may be that Johnny Depp can come back as Jack Sparrow in Pirates of the Caribbean film series, perhaps in a reboot.", "url": "https://indianexpress.com/article/entertainment/hollywood/johnny-depp-return-as-jack-sparrow-pirates-of-the-caribbean-7950603/", "urlToImage": "https://images.indianexpress.com/2022/06/pirates-of-the-caribbean-johnny-depp-1200.jpg", "publishedAt": "2022-06-03T07:43:23Z", "content": "Johnny Depp came out on top in his recently concluded $50 million defamation trial against ex-wife Amber Heard. In a statement he shared on Instagram after the verdict, Depp claimed Heard’s accusatio… [+2005 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Airtel, Jio, Vodafone Idea: How to set caller tunes on your number", "description": "Want to set up a caller tune on your number? Here's how you can do so on your Airtel, Jio or Vodafone Idea number.", "url": "https://indianexpress.com/article/technology/techook/airtel-jio-vodafone-idea-how-to-set-caller-tunes-on-your-number-7950479/", "urlToImage": "https://images.indianexpress.com/2022/06/jio-airtel-vi.jpg", "publishedAt": "2022-06-03T07:36:31Z", "content": "Caller tunes are a neat feature that allows your callers to listen to a pre-selected section of a song of your choice while they wait for you to pick up the phone. Listening to a song while waiting c… [+3177 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "From Pride walk to solving a murder, here’s the pick of happenings in Pune this weekend", "description": "Keep your calendar free for the 10th Pune LGBTIQ Pride Walk, screening at RAAH cultural centre, urban sketching events, immersive theatre experience and a lot more.", "url": "https://indianexpress.com/article/cities/pune/from-pride-walk-to-solving-a-murder-heres-the-pick-of-happenings-in-pune-this-weekend-7950425/", "urlToImage": "https://images.indianexpress.com/2022/06/lgbtq-PUNE.jpeg", "publishedAt": "2022-06-03T07:36:29Z", "content": "Pride month is here, and Pune will host its 10th Pune LGBTIQ Pride Walk from Sambhaji Maharaj Garden at 9 am. Among the issues that the march will highlight is same-sex marriage, which as a case is b… [+2448 chars]"}]}