{"status": "ok", "totalResults": 588, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Alaka Sahani", "title": "Modern love: When the stars align", "description": "Worldwide people are fascinated with celebrities. They have been unofficial influencers for ages.", "url": "https://indianexpress.com/article/opinion/columns/modern-love-stars-align-aamirkhan-kiranrao-7952843/", "urlToImage": "https://images.indianexpress.com/2021/07/aamir-khan-kiran-rao-1200.jpg", "publishedAt": "2022-06-04T12:51:58Z", "content": "THERE was quite a flutter on social media over the visuals of Aamir Khan and Kiran Rao casually walking to Karan Johar’s 50th birthday bash together and posing for photographs. But if people got past… [+4635 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Deep Mukherjee", "title": "Now, Rajasthan govt plans a Bill to take chancellor role from Governor", "description": "If the new legislation -- titled Rajasthan State Funded Universities Act – comes into effect, the Governor will also have no say in the selection process of vice-chancellors of state-funded universities.", "url": "https://indianexpress.com/article/india/political-pulse/rajasthan-govt-chancellor-governor-kalraj-mishra-ashok-gehlot-7952816/", "urlToImage": "https://images.indianexpress.com/2022/06/kalraj-mishra.jpg", "publishedAt": "2022-06-04T12:36:43Z", "content": "The Rajasthan government is considering bringing in legislation to give the Chief Minister the power to appoint chancellors for the 28 state-funded universities. As per the Bill, the Governor, who is… [+4139 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Sisodia accuses Himanta Sarma of giving govt PPE kit deals to firms of wife, son’s business partners", "description": "At a press conference, he claimed that while the Assam government procured PPE kits for Rs 600 a piece from other companies, Sarma gave urgent supply orders to the firms of his wife and son's business partners for Rs 990 a piece \"taking advantage of the Covid…", "url": "https://indianexpress.com/article/cities/delhi/sisodia-accuses-himanta-sarma-govt-ppe-kit-deals-firms-wife-sons-business-partners-7952828/", "urlToImage": "https://images.indianexpress.com/2022/06/manish-sisodia-2-1.jpg", "publishedAt": "2022-06-04T12:32:31Z", "content": "As India battled the Covid pandemic in 2020, then Assam health minister Himanta Biswa Sarma gave contracts to companies of his wife and son’s business partners to supply PPE kits above market rates, … [+1600 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Tickets for India’s Asian Cup qualifying round match sold out in 10 minutes, AIFF issues more", "description": "While the All India Football Federation has made all the tickets \"complimentary\", the state government has \"allowed just 12,000 tickets\" in the 70,000-capacity Salt Lake Stadium to avoid any law and order problem.", "url": "https://indianexpress.com/article/sports/football/tickets-for-indias-asian-cup-qualifying-round-match-sold-out-in-10-minutes-aiff-issues-more-7952821/", "urlToImage": "https://images.indianexpress.com/2021/12/Untitled-design-96.png", "publishedAt": "2022-06-04T12:27:40Z", "content": "Tickets for India’s upcoming Asian Cup qualifying round match against Cambodia at the Salt Lake Stadium on June 8 were sold out within 10 minutes, forcing the AIFF to issue more. Chhetri had on Frida… [+1884 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sadaf Modak", "title": "Gait analysis explained: How the way you walk can point to your role in crime", "description": "A Mumbai court relied upon the report of an analysis of a suspect’s gait in its order in the rape and murder of a Dalit woman in Saki Naka in September 2021. Such an analysis has been carried out earlier in the Sachin Waze-Antilia terror scare and the Gauri L…", "url": "https://indianexpress.com/article/explained/everyday-explainers/gait-analysis-explained-walk-can-point-role-crime-saki-naka-rape-murder-7952768/", "urlToImage": "https://images.indianexpress.com/2022/06/Gait-explainer.jpeg", "publishedAt": "2022-06-04T12:22:11Z", "content": "AMONG THE evidence relied upon by a special court in Mumbai while giving the death sentence to a 44-year-old man for the rape and murder of a woman in the Saki Naka area of the city, is a gait analys… [+6632 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "The Nadal-Zverev image they’ll talk about till sport endures", "description": "Tennis took back seat at the French Open men's singles semi-final as the 25-year old German international suffered a horrific ankle injury.", "url": "https://indianexpress.com/article/sports/tennis/the-nadal-zverev-image-theyll-talk-about-till-sport-endures-7952607/", "urlToImage": "https://images.indianexpress.com/2022/06/Nadal-and-Zverev-French-Open.jpg", "publishedAt": "2022-06-04T12:16:50Z", "content": "The game was over. Rafael Nadal had made it to the French Open Final for a record 14th time. But there were no celebrations. Not because this was Nadal winning Tennis on clay. All the eyes, including… [+2552 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "India approves Biological E. Covid shot as a booster", "description": "This means those who have received Covishield or Covaxin for their first two doses can take Corbevax for their third shot. So far, mixing and matching Covid vaccines was not allowed in India.", "url": "https://indianexpress.com/article/india/india-approves-biological-e-covid-shot-booster-7952793/", "urlToImage": "https://images.indianexpress.com/2022/06/Covid-shot-1.jpg", "publishedAt": "2022-06-04T12:09:04Z", "content": "Hyderabad-based vaccine manufacturer BiologicalEs protein subunit Covid-19 vaccine Corbevax has become the first to be approved by the countrys drug regulator as a heterologous booster in adults, mea… [+2098 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manas Srivastava", "title": "UPSC Essentials: Weekly news express — Unicorn startups to RFID technology", "description": "A news-laden week comes to an end. Check out the essential weekly news, categorised as per the UPSC syllabus and consolidate your CSE preparation.", "url": "https://indianexpress.com/article/upsc-current-affairs/upsc-essentials/upsc-essentials-weekly-news-express-from-unicorn-startups-to-rfid-technology-7952600/", "urlToImage": "https://images.indianexpress.com/2022/05/UPSC-essentials.jpg", "publishedAt": "2022-06-04T12:02:56Z", "content": "The Indian Express’ UPSC Essentials brings you a weekly news express, which covers the most important topics of current affairs news from this week.General Studies II: Statutory, regulatory and vario… [+25728 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shreya Agrawal", "title": "Meet Mansukhbhai Prajapati, a rural innovator who started an eco-friendly revolution with clay products", "description": "World Environment Day 2022: The work of this famous rural innovator -- credited for his earthen clay-based functional products like refrigerators, filters, tawa and cookers, among others -- boasts of high efficiency and eco-friendliness", "url": "https://indianexpress.com/article/lifestyle/life-style/mansukhbhai-prajapati-mitticool-clay-products-world-environment-day-eco-friendly-healthy-7950709/", "urlToImage": "https://images.indianexpress.com/2022/06/mansukhbhai-1200.jpg", "publishedAt": "2022-06-04T12:00:47Z", "content": "The tradition of cooking in earthenware is not alien to India, but the age-old practice is slowly being overshadowed by technological advancements. And as we swiftly moved towards the stainless steel… [+6741 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "How air pollution causes cancer", "description": "Particulate matter build-up in the lungs changes how cells replicate, causing DNA damage. This, studies have shown, triggers cancerous growth, says Dr M S Kanwar, Senior Consultant, Department of Pulmonology, Critical Care and Sleep Medicine, Indraprastha Apo…", "url": "https://indianexpress.com/article/lifestyle/health/air-pollution-causes-cancer-7952696/", "urlToImage": "https://images.indianexpress.com/2022/06/pollution.jpg", "publishedAt": "2022-06-04T11:59:32Z", "content": "Outdoor air pollution causes roughly one in 10 cases of lung cancer. Though our respiratory system is fairly resilient and ups its defence mechanisms, a prolonged exposure to elevated particle pollut… [+2385 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Anupam Kher shares his conversation with autorickshaw driver, promises job to young man on streets: ‘Laga raha hu kahin par…’", "description": "Anupam Kher shared a video of his autorickshaw ride on Saturday morning. During the ride, he met four young kids when the autorickshaw stopped at a traffic signal.", "url": "https://indianexpress.com/article/entertainment/bollywood/anupam-kher-autorickshaw-driver-conversation-video-7952716/", "urlToImage": "https://images.indianexpress.com/2022/06/Anupam-Kher.jpg", "publishedAt": "2022-06-04T11:57:45Z", "content": "Actor Anupam Kher often shares videos of himself talking to kids at traffic signals or around his apartment. On Saturday, after his morning walk, Anupam Khertook an autorickshaw ride. He shared a vid… [+1813 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Six killed in boiler explosion at factory in UP’s Hapur", "description": "Some other workers suffered injuries in the explosion that took place at the factory located in the Dholana area of the district.", "url": "https://indianexpress.com/article/cities/lucknow/six-killed-in-boiler-explosion-at-factory-in-ups-hapur-7952787/", "urlToImage": "https://images.indianexpress.com/2022/06/BOILER.jpg", "publishedAt": "2022-06-04T11:56:21Z", "content": "At least six workers died after a boiler exploded at a chemical factory in western Uttar Pradesh’s Hapur district on Saturday afternoon, officials said.Some other workers suffered injuries in the exp… [+981 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Heatwave conditions likely in Northwest, Central India in next 2-3 days: IMD", "description": "The national capital is likely to witness clear skies in the day and heatwave conditions are expected at a few places, the weather office said.", "url": "https://indianexpress.com/article/india/imd-india-heatwave-delhi-weather-7952687/", "urlToImage": "https://images.indianexpress.com/2022/05/heatwave-1-1.jpg", "publishedAt": "2022-06-04T11:52:51Z", "content": "Parts of Northwest, Central and East India will be experiencing heatwave conditions in the next 2-3 days, the India Meteorological Department (IMD) said Saturday.“Heatwave conditions are likely in is… [+1104 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Salman Khan excited for ‘jawan bhai’ Shah Rukh Khan’s film with Atlee, fans want the ‘superstars’ to collaborate", "description": "Salman Khan shared a special message for Shah Rukh Khan, expressing his excitement for his film Jawan.", "url": "https://indianexpress.com/article/entertainment/bollywood/salman-khan-excited-for-shah-rukh-khan-film-with-atlee-jawan-7952722/", "urlToImage": "https://images.indianexpress.com/2022/06/Collage-Maker-04-Jun-2022-05.04-PM.jpg", "publishedAt": "2022-06-04T11:47:20Z", "content": "Salman Khan has shared his excitement for Shah Rukh Khan’s film with Atlee, Jawan. The film’s release date and title were announced in a teaser video on Friday. Salman took to his social media platfo… [+1319 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Thousands swept up as Kremlin clamps down on Ukraine war criticism", "description": "Three months ago, President Vladimir Putin signed a law designed to silence war against Ukraine criticizers; now, at least 50 people face years-long prison.", "url": "https://indianexpress.com/article/world/thousands-swept-up-as-kremlin-clamps-down-on-war-criticism-russia-ukraine-war-7952265/", "urlToImage": "https://images.indianexpress.com/2022/06/Russia-Kremlin-protests-dissent.jpg", "publishedAt": "2022-06-04T11:43:42Z", "content": "Vladimir Efimov, a local politician on the Kamchatka Peninsula in Russias Far East, was charged with discrediting the army and ordered to pay a $500 fine three times in recent months over anti-war im… [+8634 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Dipanita Nath", "title": "Know Your City: Pune’s Tambat Ali is home to a vanishing Peshwa-era tradition", "description": "The 400-year-old community of coppersmiths first sprang up in the era of Sawai Madhavrao, when the Peshwas were developing Pune as their capital and attracting craftsmen to sustain the society.", "url": "https://indianexpress.com/article/cities/pune/know-your-city-pune-tambat-ali-peshwa-era-7952533/", "urlToImage": "https://images.indianexpress.com/2022/06/Pune-tumbat-Ali.jpeg", "publishedAt": "2022-06-04T11:33:17Z", "content": "The first sign in Kasba Peth that one is near Tambat Ali reverberates through the air the sound of hammers striking metal with force and without pause. Individual beats merge and undulate in an impro… [+6631 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Nayanika Mukherjee", "title": "Can you solve the world’s oldest crossword puzzle from 1913?", "description": "The world’s first crossword puzzle came out in 1913. Do you think you can solve it in 2022? Try it out on our play link.", "url": "https://indianexpress.com/article/puzzles-and-games/info/play-worlds-oldest-crossword-puzzle-history-7952701/", "urlToImage": "https://images.indianexpress.com/2022/06/Untitled-design-3-1.jpg", "publishedAt": "2022-06-04T11:31:51Z", "content": "Note: Scroll to the bottom for direct crossword play link.At the beginning of this year, Wordle exploded. Scores flooded social media, a hundred spinoffs launched every week, and news sites rushed to… [+2843 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "French Open 2022 Women’s Final, Iga Swiatek vs Coco Gauff Live Score Updates: Can Gauff break Swiatek’s streak?", "description": "French Open Women's Final 2022, Iga Swiatek vs Coco Gauff Live Tennis Score Streaming Online Today Match: If Swiatek beats Gauff, she will equal a 35-match run by Venus Williams in 2000 for the longest unbeaten streak this century.", "url": "https://indianexpress.com/article/sports/tennis/french-open-2022-women-final-iga-swiatek-vs-coco-gauff-live-score-streaming-7952412/", "urlToImage": "https://images.indianexpress.com/2022/06/French-Open-2022-Womens-Final-Live.jpg", "publishedAt": "2022-06-04T11:31:19Z", "content": "French Open 2022 Women's Final, Iga Swiatek vs Coco Gauff Live Tennis Score Streaming Online Today Match Updates.\r\n French Open 2022 Women's Final, Iga Swiatek vs Coco Gauff Live Tennis Score Streami… [+458 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "‘End of algo stablecoins’: Tether co-founder on Luna-Terra fiasco", "description": "In an interview with CNBC at the World Economic Forum in Davos, Switzerland, Collins said that “It’s unfortunate that the money ... was lost, however, it’s not a surprise.\"", "url": "https://indianexpress.com/article/technology/crypto/end-of-algo-stablecoins-tether-co-founder-on-luna-terra-fiasco-7952475/", "urlToImage": "https://images.indianexpress.com/2022/05/Terra-Luna-Bitcoin-Reserve-disappeared.jpg", "publishedAt": "2022-06-04T11:30:32Z", "content": "Luna-Terra fiascohas raised several questions about the future of algorithmically designed stablecoins. The Terra-Luna crash could be the end of the algo stablecoins, according to Tether cofounder Re… [+1973 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sanath Prasad", "title": "UPSC CSE result 2021: Karnataka topper Avinash V was inspired by Sushma Swaraj", "description": "While the coronavirus lockdown brought a dark cloud in many people's lives, it proved to be a turning point in Avinash's life.", "url": "https://indianexpress.com/article/jobs/upsc-cse-result-2021-karnataka-topper-avinash-v-was-inspired-by-sushma-swaraj-7952677/", "urlToImage": "https://images.indianexpress.com/2022/06/UPSC-AVinash.jpg", "publishedAt": "2022-06-04T11:24:52Z", "content": "Inspired by the late foreign minister Sushma Swaraj, Avinash V from Davengere is finally on an endeavor to make his mark in the Indian Foreign Services after securing the 31st rank in India in the UP… [+2225 chars]"}]}