{"status": "ok", "totalResults": 592, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Express Townhall: To keep BJP away from power, set the narrative first and work together with opposition parties, says MVA minister Satej Patil", "description": "At Express Townhall, Congress leader Satej Patil talks of the ‘Kolhapur formula’, the nitty-gritties of running a coalition government in Maharashtra, and the issues of fake narratives and vindictive politics.", "url": "https://indianexpress.com/article/cities/pune/express-townhall-bjp-opposition-parties-maharashtra-congress-mva-minister-satej-patil-7933483/", "urlToImage": "https://images.indianexpress.com/2022/05/satej-patil.jpg", "publishedAt": "2022-05-24T10:44:55Z", "content": "Congress leader and Maha Vikas Aghadi (MVA) minister Satej Patil played a key role in the victory of the ruling MVA alliance in the recent by-elections in Kolhapur. In this Townhall, moderated by Man… [+14665 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Santosh Singh", "title": "JD(U) chief Lalan Singh interview: ‘It’s not about upper hand or lower hand in alliance… We are talking about Bihar, and BJP in Bihar was part of House resolution on caste census’", "description": "As CM Nitish Kumar is all set to hold an all-party meeting on the caste census before his Cabinet considers it for approval, his party chief Lalan Singh speaks on the issue and whether it is a bid to gain an upper hand over the party's senior ally, the BJP.", "url": "https://indianexpress.com/article/india/political-pulse/jdu-chief-lalan-singh-interview-bihar-caste-census-7933790/", "urlToImage": "https://images.indianexpress.com/2022/05/Lalan-Singh.jpg", "publishedAt": "2022-05-24T10:42:47Z", "content": "Bihar Chief Minister Nitish Kumar seems to be pressing ahead with the proposal to conduct a caste census in the state even though the BJP-ruled Centre continues to remain non-committal over it. As Ni… [+3352 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manas Srivastava", "title": "UPSC Essentials: Data on your tips – Lancet Report on pollution and health", "description": "What does the Lancet Planetary Health Report say about pollution, death, GDP and India's policies? UPSC aspirants must have knowledge of some very essential data from this report and its analysis.", "url": "https://indianexpress.com/article/upsc-current-affairs/upsc-essentials/upsc-essentials-data-on-your-tips-lancet-report-on-pollution-health-7933816/", "urlToImage": "https://images.indianexpress.com/2022/05/Untitled-design-10-3.jpg", "publishedAt": "2022-05-24T10:41:43Z", "content": "Essential data, facts and figures from reports and important documents for UPSC-CSE.Syllabus: Prelims- General issues on Environmental Ecology, Biodiversity and Climate Change that do not require sub… [+5714 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "In 15-18 years age group, over 80% got first dose of Covid vaccine: Mandaviya", "description": "The total number of Covid vaccine doses administered in India exceeded 192.52 crore till Tuesday 7 am, according to a provisional report.", "url": "https://indianexpress.com/article/india/age-group-15-18-over-80-pc-first-dose-covid-vaccine-mandaviya-7933805/", "urlToImage": "https://images.indianexpress.com/2022/05/Covid-vaccines-1.jpg", "publishedAt": "2022-05-24T10:41:30Z", "content": "Over 80 per cent of people aged between 15 and 18 years have received the first dose of Covid vaccine, Union Health Minister Mansukh Mandaviya said on Tuesday.The total number of Covid vaccine doses … [+2114 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Abhay Deol on Jungle Cry: World Cup victory of underprivileged kids need to be celebrated", "description": "Directed by Sagar Ballary, Abhay Deol's Jungle Cry will release on Lionsgate Play on June 3.", "url": "https://indianexpress.com/article/entertainment/bollywood/world-cup-victory-of-underprivileged-kids-deserves-a-mention-abhay-deol-on-jungle-cry-7933433/", "urlToImage": "https://images.indianexpress.com/2022/05/Abhay-Deol-n-1200by667.jpg", "publishedAt": "2022-05-24T10:38:54Z", "content": "Actor Abhay Deol says he came on board Jungle Cry as he believed the “underdog” story of tribal kids winning the Rugby World Cup was a tale worth telling.Jungle Cry, directed by Sagar Ballary of Bhej… [+2814 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mumbai police commissioner to interact live with citizens on social media", "description": "Mumbai Police Commissioner Sanjay Pandey conducts a Facebook live session every Sunday wherein he discusses policing-related issues with the common people and also announces several initiatives.", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-police-commissioner-interact-live-social-media-7933806/", "urlToImage": "https://images.indianexpress.com/2022/05/Sanjay-Pandey.jpg", "publishedAt": "2022-05-24T10:33:51Z", "content": "Mumbai Police Commissioner Sanjay Pandey will interact with citizens during a live session on Facebook and YouTube Wednesday evening (May 25) to listen to policing-related issues and complaints.The a… [+1678 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aksheev Thakur", "title": "Researchers warn about perils of mass drives to plant trees", "description": "Experts point out that if tree-planting initiatives are not scientifically sound, it may even lead to a reduction in the water table. The approach should rather be based on restoring the local ecosystem.", "url": "https://indianexpress.com/article/cities/bangalore/researchers-perils-mass-drives-to-plant-trees-7933723/", "urlToImage": "https://images.indianexpress.com/2022/05/tree-plantation.jpg", "publishedAt": "2022-05-24T10:25:18Z", "content": "Researchers at Ashoka Trust for Research in Ecology and the Environment (ATREE) have cautioned on the perils of tree planting drives undertaken annually during World Environment Day on June 5.While s… [+3998 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "‘Even when I was at my thinnest, I felt fat’: Vidya Balan opens up about being fat-shamed", "description": "Even when I was at my thinnest, I felt fat, said Vidya Balan in a conversation with Namita Thapar", "url": "https://indianexpress.com/article/lifestyle/feelings/vidya-balan-weight-loss-crash-diets-fat-shaming-7933028/", "urlToImage": "https://images.indianexpress.com/2022/05/vidya-balan_1200_1.jpg", "publishedAt": "2022-05-24T10:20:18Z", "content": "Vidya Balan, who has often spoken up about being fat shamed and her struggle with body image. Now, in a new interview the actor has revealed how, despite being at her thinnest she would “feel fat”.Bu… [+1429 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shruti Dhapola", "title": "Running out of space on your iPhone? Here are tips you need to free up some GBs", "description": "If you are an Apple iPhone users facing a space issue on the device, it is time to clean up. Here are tips for Apple iPhone users in India on how they can free up some storage space", "url": "https://indianexpress.com/article/technology/techook/apple-iphone-tips-how-to-free-up-space-whatsapp-data-delete-7933066/", "urlToImage": "https://images.indianexpress.com/2022/05/Apple_iPhone_Storage_1.jpg", "publishedAt": "2022-05-24T10:17:10Z", "content": "Every time someone asks me to help save space on their iPhone, Im secretly crying inside. Because I know this is a task that requires time, patience, and effort. And running out of space on an iPhone… [+7603 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gujarat: Former Congress MLA’s son joins BJP along with supporters", "description": "Anil Joshiyara was a veteran Congress leader who was elected as MLA five times from the tribal belt in North Gujarat. He passed away in March this year while battling with post-Covid complications.", "url": "https://indianexpress.com/article/cities/gandhinagar/gujarat-former-congress-mla-son-supporters-join-bjp-7933744/", "urlToImage": "https://images.indianexpress.com/2022/05/Keval.jpg", "publishedAt": "2022-05-24T10:15:34Z", "content": "Keval, son of former Congress MLA Anil Joshiyara, joined BJP along with around 1,300 supporters in Bhiloda of Aravalli district Tuesday in the presence of Gujarat party president C R Paatil.Joshiyara… [+1266 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Raakhi Jagga", "title": "Two months ago, sacked Punjab minister Vijay Singla had warned of zero tolerance for corruption", "description": "A dentist from Mansa who joined AAP in 2016, Singla's elevation to Cabinet status had surprised many", "url": "https://indianexpress.com/article/india/political-pulse/sacked-punjab-minister-vijay-singla-had-warned-of-zero-tolerance-for-corruption-7933741/", "urlToImage": "https://images.indianexpress.com/2022/05/Vijay-Singla.jpg", "publishedAt": "2022-05-24T10:13:47Z", "content": "On March 23, days after he was sworn in as Health Minister in the Bhagwant Mann-led Cabinet, Vijay Singla, 52, held a meeting of health officials in Chandigarh, where he said the government would hav… [+3209 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuj Bhatia", "title": "LG bets on OLED TVs to stay ahead in the premium TV segment in India", "description": "LG has launched its new range of OLED TV lineup, with five different series and sizes ranging from 42 to 97-inches. The prices start at Rs 89,990.", "url": "https://indianexpress.com/article/technology/gadgets/lg-bets-on-oled-tvs-to-stay-ahead-in-the-premium-tv-segment-in-india-7933712/", "urlToImage": "https://images.indianexpress.com/2022/05/LG_Signature_OLEDR_1.jpg", "publishedAt": "2022-05-24T10:12:52Z", "content": "LG is betting heavily on OLED (organic light-emitting diode) TVs as it plans to increase its footprint in Indias growing premium TV segment. The company has launched its new range of OLED TV lineup, … [+2846 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Dipanita Nath", "title": "Pune Inc: Homegrown fitness app to use $11.5 million funding to go global, generate jobs", "description": "Fittr plans to become a one-stop fitness platform as India's fitness app market witnesses high growth in the post-Covid world.", "url": "https://indianexpress.com/article/cities/pune/pune-inc-homegrown-fitness-app-funding-global-generate-jobs-7933200/", "urlToImage": "https://images.indianexpress.com/2022/05/Fittr-Founders-L-R-Rohit-Chattopadhyay-Bala-Krishna-Reddy-Jitendra-Chouksey-Suniel-Shetty-owns-minority-stake-in-Fittr-Sonal-Singh-and-Jyoti-Dabas-1.jpg", "publishedAt": "2022-05-24T10:04:59Z", "content": "Operating out of Viman Nagar in Pune, Fittr has become one of Indias largest fitness apps, with the latest statistics showing more than 40 lakh members across the country as well as cities in the US,… [+3498 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Chennai: 6 students test Covid-19 positive at Anna University", "description": "“We have asked the officials to increase testing in some of the areas inside Anna University. Step by step, we will be carrying out the saturation tests,” Health Secretary J Radhakrishnan said.", "url": "https://indianexpress.com/article/cities/chennai/6-students-test-covid-19-positive-chennai-anna-university-7933689/", "urlToImage": "https://images.indianexpress.com/2022/05/Anna-university.jpeg", "publishedAt": "2022-05-24T10:04:29Z", "content": "Just a month after a cluster was detected at IIT Madras where more than 180 students tested positive, six students at Anna University campus in Guindy have tested positive for Covid-19.Health Secreta… [+2213 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Farah Khan wishes husband Shirish Kunder on birthday with throwback photos: ‘So annoying that he still looks like a boy’", "description": "Farah Khan and Shirish Kunder got married in 2004. They have three kids.", "url": "https://indianexpress.com/article/entertainment/bollywood/farah-khan-wishes-husband-shirish-kunder-on-birthday-with-throwback-photos-7933469/", "urlToImage": "https://images.indianexpress.com/2022/05/Farah-Khan-1200.jpg", "publishedAt": "2022-05-24T09:57:19Z", "content": "Farah Khan on Tuesday took to Instagram to wish husband Shirish Kunder on his birthday. The choreographer-turned-filmmaker shared a throwback picture in which a young Farah is seen posing with Shiris… [+1484 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Bashaarat Masood", "title": "Erect banners welcoming Amarnath pilgrims, Kashmir divisional commissioner tells officials", "description": "The order asks officials to send samples of these welcome banners for approval before installing them.", "url": "https://indianexpress.com/article/india/political-pulse/erect-banners-welcoming-amarnath-pilgrims-kashmir-divisional-commissioner-7933637/", "urlToImage": "https://images.indianexpress.com/2022/05/amarnath-yatra.jpg", "publishedAt": "2022-05-24T09:56:18Z", "content": "The Kashmir divisional commissioner has directed officials to install banners welcoming Amarnath pilgrims in all panchayats in the Valley that fall on the route from Qazigund to the cave shrine.The o… [+2039 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "After 3 months of war, life in Russia has profoundly changed", "description": "Moscow's vast shopping malls have turned into eerie expanses of shuttered storefronts once occupied by Western retailers.", "url": "https://indianexpress.com/article/world/three-months-war-life-russia-profoundly-changed-7933701/", "urlToImage": "https://images.indianexpress.com/2022/05/Russia-1-1.jpg", "publishedAt": "2022-05-24T09:54:11Z", "content": "When Vladimir Putin announced the invasion of Ukraine, war seemed far away from Russian territory. Yet within days the conflict came home not with cruise missiles and mortars but in the form of unpre… [+5788 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Uttar Pradesh: Two siblings, elderly woman killed in two separate wall-collapse incidents", "description": "In Amtamau village, Sudama (1) and Keshkali (3) were killed while their mother and elder sister were injured when a wall collapsed due to heavy rains on Monday, officials said.", "url": "https://indianexpress.com/article/india/uttar-pradesh-siblings-elderly-woman-killed-separate-wall-collapse-incidents-7933709/", "urlToImage": "https://images.indianexpress.com/2022/05/Indian-express-1-3-16.jpg", "publishedAt": "2022-05-24T09:52:49Z", "content": "Two siblings were killed when a wall collapsed on them in Amtamau village following heavy rains while a woman died in Hargaon in a similar incident, police said on Tuesday.In Amtamau village, Sudama … [+453 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "OFT-2: Boeing’s Starliner to return to Earth on May 26, details on how to watch live", "description": "You can watch NASA's live coverage of OFT-2's Boeing Starliner Spacecraft returning to earth after a successful deployment to the International Space Station.", "url": "https://indianexpress.com/article/technology/science/oft-2-boeings-starliner-to-return-to-earth-on-may-26-watch-nasas-live-coverage-7933700/", "urlToImage": "https://images.indianexpress.com/2022/05/Starliner-capsule-International-Space-Station-Boeing-featured.jpg", "publishedAt": "2022-05-24T09:52:25Z", "content": "Boeings CST-100 Starliner spacecraft will depart from the International Space Station on Wednesday for a landing in the western United States. NASA will provide live coverage of the event through NAS… [+1411 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Having sneaked into IPL play-offs, RCB pose serious threat to top-heavy LSG", "description": "Virat Kohli's return to form will be a big plus to their top-order which often has struggled to get going in the power-play.", "url": "https://indianexpress.com/article/sports/ipl/having-sneaked-into-ipl-play-offs-rcb-pose-serious-threat-to-top-heavy-lsg-7933690/", "urlToImage": "https://images.indianexpress.com/2022/05/RCB-GT.jpg", "publishedAt": "2022-05-24T09:51:23Z", "content": "Virat Kohli’s return to form and a rather dramatic entry into the IPL play-offs will make Royal Challengers Bangalore a more confident unit when they meet a top-heavy Lucknow Super Giants in the Elim… [+4560 chars]"}]}