{"status": "ok", "totalResults": 283, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "কী আছে কেদারনাথে, যার জন্য দূর-দূরান্ত থেকে ছুটে আসেন ভক্তরা?", "description": "কেদারনাথ মন্দিরের উচ্চতা ৮৫ ফুট। চওড়া ১৮৭ ফুট। ছয় ফুট উঁচু ভিতের ওপর মন্দিরটি তৈরি।", "url": "https://bengali.indianexpress.com/lifestyle/hindu-temple-kedarnath-and-its-mystery-452468/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/Kedarnath_Temple_2.jpg", "publishedAt": "2022-06-06T00:30:00Z", "content": ", ? - ? , \r\n , ‘’ , \r\n , \r\n - - \r\n, , \r\n ‘’ , \r\n - : , \r\n , , , \r\nStay updated with the latest news headlines and all the latest Lifestyle news download Indian Express Bengali App.\r\nWeb Title: Hindu … [+31 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "WWE Hell in a Cell 2022 Live Results: The battle begins in the wicked fortress", "description": "WWE Hell in a Cell 2022 Live Updates, Results and Streaming Online Telecast on Sony Ten 1, Sony Ten 3, Sony Liv Live Match Online: Hell in a Cell is one of the biggest pay-per-view of the year for WWE.", "url": "https://indianexpress.com/article/wwe/wwe-hell-in-a-cell-2022-live-streaming-results-winners-7954633/", "urlToImage": "https://images.indianexpress.com/2022/06/wwe-hell-in-a-cell-live-1.jpg", "publishedAt": "2022-06-05T23:53:16Z", "content": "WWE Hell in a Cell Live Results, Updates Online: At Hell in a Cell, Cody Rhodes will be in action with several other superstars. (wwe.com)WWE Hell in a Cell 2022 Live Updates and Results Online: Rumo… [+503 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Divestment: CPSEs to execute sale of Cabinet-cleared units", "description": "However, those transactions for which expression of interest (EoI) have been issued will continue to be handled by the Department of Investment and Public Asset Management (DIPAM), it added.", "url": "https://indianexpress.com/article/business/economy/divestment-cpses-to-execute-sale-of-cabinet-cleared-units-7954528/", "urlToImage": "https://images.indianexpress.com/2022/05/diap.jpg", "publishedAt": "2022-06-05T23:16:44Z", "content": "The Finance Ministry has said that the strategic sale of units of central public sector enterprises (CPSEs) for which clearance of the Cabinet is already in place will have to be executed by the resp… [+96 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Kanpur Clash: Police form four SITs, arrest 7 more", "description": "4 'main conspirators' sent to judicial custody, police say will seek custody for questioning", "url": "https://indianexpress.com/article/cities/lucknow/kanpur-clash-police-form-four-sits-arrest-7-more-7954614/", "urlToImage": "https://images.indianexpress.com/2022/06/handcuff-4-1.jpg", "publishedAt": "2022-06-05T23:07:31Z", "content": "Kanpur Police on Sunday constituted an eight-member Special Investigation Team (SIT), led by DCP Sanjeev Tyagi, to investigate the Friday’s clashes in the city. Police also constituted three more SIT… [+2930 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "18 injured as vehicle crashes into median", "description": "The accident took place due to “reckless driving” and the driver of the Tata Ace is absconding, said police.", "url": "https://indianexpress.com/article/cities/kolkata/18-injured-as-vehicle-crashes-into-median-7954620/", "urlToImage": "https://images.indianexpress.com/2022/06/Indian-Express-13.jpeg", "publishedAt": "2022-06-05T23:06:12Z", "content": "At least 18 persons were injured, two of them critically, when a vehicle they were travelling in hit a median in the Hastings area of Kolkata city on Sunday morning."}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Row over singer KK’s death: Overcrowding at such events natural, says TMC MP", "description": "“People gather in large numbers out of their love for their favourite artists. If the police are expected to stop a music show for overcrowding, then they will have to stop political rallies too where the gatherings are more than expected,” he added.", "url": "https://indianexpress.com/article/cities/kolkata/row-over-singer-kks-death-overcrowding-at-such-events-natural-says-tmc-mp-7954616/", "urlToImage": "https://images.indianexpress.com/2022/06/KK-oped-1-1.jpg", "publishedAt": "2022-06-05T23:01:38Z", "content": "A day after West Bengal Governor Jagdeep Dhankhar hit out at the state government over singer KKs death, Trinamool Congress (TMC) MP Dev, or Deepak Adhikari, came in support of the police and civil a… [+1919 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Soumyarendra Barik", "title": "‘Network of fake accounts inflated BJP MP posts; staffer prompted, but FB took no action for months’", "description": "The documents consist of internal conversations between Zhang and several staffers at Facebook between December 2019 and September 2020. The staffers she was speaking to during that time are responsible for monitoring and acting on inauthentic activity on Fac…", "url": "https://indianexpress.com/article/technology/tech-news-technology/network-of-fake-accounts-inflated-bjp-mp-posts-staffer-prompted-but-fb-took-no-action-for-months-7954524/", "urlToImage": "https://images.indianexpress.com/2022/06/Facebook-AP.jpg", "publishedAt": "2022-06-05T22:55:56Z", "content": "Facebook did not take down an alleged network of fake accounts that was engaged in inflating posts shared by Vinod Sonkar, BJP MP from Kaushambi, after it realised that the lawmakers own account migh… [+6950 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pranav Mukul", "title": "Explained: What 46-km flight in Gujarat could mean for future of drone delivery", "description": "Last month, the company launched a hybrid-electric vertical take-off and landing drone with a payload capacity of 3 kg, a range of 100 km and a top speed of 120 kph. The VTOL drone has the capability to take off and land vertically like a helicopter from a sm…", "url": "https://indianexpress.com/article/explained/explained-what-46-km-flight-in-gujarat-could-mean-for-future-of-drone-delivery-7954521/", "urlToImage": "https://images.indianexpress.com/2022/06/Vertiplane-X3-is-a-hybrid-VTOL-drone.-TechEagle.jpg", "publishedAt": "2022-06-05T22:55:25Z", "content": "In what potentially lays the ground for postal delivery by drones, Gurugram-based drone startup TechEagle delivered a parcel this week in Gujarat under a pilot project in collaboration with India pos… [+1963 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Yogesh Naik", "title": "Shirdi Trust to draw up plan to renovate main temple complex", "description": "The Shirdi Sai Sansthan Trust has also called for a panel of architects to beautify the temple premises and have vertical gardens, Banayat said.", "url": "https://indianexpress.com/article/cities/mumbai/shirdi-trust-to-draw-up-plan-to-renovate-main-temple-complex-7954610/", "urlToImage": "https://images.indianexpress.com/2022/06/Indian-Express-13.jpeg", "publishedAt": "2022-06-05T22:52:05Z", "content": "The Shirdi Sai Sansthan Trust will soon draw up a plan to strengthen the main temple housing the Sai Baba Samadhi. The temple was last restored by Larsen and Toubro in 1999-2000. Saibaba, the saint, … [+1904 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Explained: How ceramic implants can regenerate broken bones", "description": "Calcium phosphate ceramics, the Tokyo Medical and Dental University (TMDU) noted in a press release, are in principle an ideal alternative to conventional metals because bone can eventually replace the ceramic and regrow.", "url": "https://indianexpress.com/article/explained/explained-how-ceramic-implants-can-regenerate-broken-bones-7954526/", "urlToImage": "https://images.indianexpress.com/2022/06/bone-implant.jpg", "publishedAt": "2022-06-05T22:50:50Z", "content": "When people need a bone replacement following a fracture, it is often based on a metal part. But metal parts are sometimes toxic over time, and will not help the original bone regrow.Calcium phosphat… [+2479 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "1,000 trees planted at INS Shivaji", "description": "The event saw an overwhelming response from station personnel and their families and cadets from the local units of the National Cadet Corps.", "url": "https://indianexpress.com/article/cities/pune/1000-trees-planted-at-ins-shivaji-7954612/", "urlToImage": "https://images.indianexpress.com/2022/06/tree-plantatio.jpg", "publishedAt": "2022-06-05T22:49:07Z", "content": "INS Shivaji, Indian Navy’s premier marine engineering training institute located in Lonavala, marked the World Environment Day on Sunday under the theme One Earth and focusing on ‘Living Sustainably … [+52 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "FPIs pull out of equities for eighth straight month", "description": "According to depositories data, the net outflow by foreign portfolio investors (FPIs) from equities reached Rs 1.69 lakh crore so far in 2022, after the outflux in May", "url": "https://indianexpress.com/article/business/market/fpis-pull-out-of-equities-for-eighth-straight-month-7954514/", "urlToImage": "https://images.indianexpress.com/2022/06/foreign-exchange-2-1.jpg", "publishedAt": "2022-06-05T22:48:46Z", "content": "As fears of a rate hike by the US Federal Reserve weighed heavily on market sentiment, foreign investors maintained their selling spree in the Indian equities last month, having pulled out pulled out… [+1398 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Ruchika Goswamy", "title": "Sangli’s Kajol Sargar bags gold at Khelo India Youth Games", "description": "Training under Mayur Sinhanse at the Digvijay Institute of Weight Lifting in Sangli, Kajol lifted a total of 113 kg (Snatch-50kg; Clean and Jerk-63kg) in the women’s 40kg category and kicked off the medal tally for the defending champion state of Maharashtra.", "url": "https://indianexpress.com/article/cities/pune/sanglis-kajol-sargar-bags-gold-at-khelo-india-youth-games-7954609/", "urlToImage": "https://images.indianexpress.com/2022/06/kajol-3-1.jpg", "publishedAt": "2022-06-05T22:43:59Z", "content": "Celebration for Kajol Sargar translates to a small break she will get from her controlled diet. The 17-year-old from Sangli clinched the first gold at the Khelo India Youth Games, 2021 being held at … [+1909 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "17 inmates, including Youth Congress leader, booked; 28 cellphones recovered", "description": "In a clash on June 2 that reportedly started from the de-addiction ward inside the jail, Arora was injured after being allegedly attacked with an ice-prick and other sharp-edged weapons by the rival group.", "url": "https://indianexpress.com/article/cities/chandigarh/17-inmates-including-youth-congress-leader-booked-28-cellphones-recovered-7954601/", "urlToImage": "https://images.indianexpress.com/2019/07/ludhiana-central-jail1-1200.jpeg", "publishedAt": "2022-06-05T22:42:35Z", "content": "Three days after two groups of inmates clashed in Ludhiana central jail, the Ludhiana police registered an FIR against 17 inmates, including Youth Congress leader Shubham Arora alias Mota who is lodg… [+1659 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "MANOJ MORE", "title": "Sena supremo would have been happy with MVA government, says Pawar", "description": "Raut said, “Till Sharad Pawar takes the initiative, the BJP government at the Centre will not get an alternative...Had Sena chief Balasaheb Thackeray been alive, BJP would not have dared to do what it is doing today.”", "url": "https://indianexpress.com/article/cities/pune/sena-supremo-would-have-been-happy-with-mva-government-says-pawar-7954605/", "urlToImage": "https://images.indianexpress.com/2022/06/pawar-5-1-1-1-1.jpg", "publishedAt": "2022-06-05T22:40:05Z", "content": "NCP chief Sharad Pawar has claimed that had Shiv Sena supremo Balasaheb Thackeray been alive today, he would have been happy with the experiment of a three-party government coming to power in Maharas… [+1728 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "MANOJ MORE", "title": "Rajya Sabha polls: BJP MLAs in touch with us, CM to redress grievances of independent MLAs today: MVA", "description": "“Independent MLAs who have been supporting the MVA regime for the past two-and-a-half years are very much with us. Don't go by what the BJP is claiming or is trying to do. Our MVA leaders are constantly in touch with independent MLAs,” Patil told this newspap…", "url": "https://indianexpress.com/article/cities/pune/rajya-sabha-polls-bjp-mlas-in-touch-with-us-cm-to-redress-grievances-of-independent-mlas-today-mva-7954600/", "urlToImage": "https://images.indianexpress.com/2022/06/pawar.jpg", "publishedAt": "2022-06-05T22:36:36Z", "content": "WHILE Chief Minister Uddhav Thackeray is set to hold a meeting with independent MLAs at his official Varsha bungalow on Monday ahead of the elections to six seats of Rajya Sabha from the state, MVA M… [+2450 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Man Aman Singh Chhina", "title": "Veterans protest move to exclude defence services from RTI Act", "description": "This exemption will also lead to a cloak of secrecy on other matters such as procurements, Military Engineer Services (MES), constructions and defence deals etc.", "url": "https://indianexpress.com/article/cities/chandigarh/veterans-protest-move-to-exclude-defence-services-from-rti-act-7954599/", "urlToImage": "https://images.indianexpress.com/2021/12/Rawat-1-4.jpg", "publishedAt": "2022-06-05T22:32:44Z", "content": "It has been reported that the government is on the cusp of exempting the Army, Navy and the Air Force from the operation of the RTI Act on a proposal initiated by Late General Bipin Rawat. The move h… [+3284 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "George Mathew", "title": "Eye on return to pre-Covid rates: Markets brace for ‘no-brainer’ hike", "description": "RBI MPC likely to raise repo rate by up to 50 bps at upcoming meet", "url": "https://indianexpress.com/article/business/economy/eye-on-return-to-pre-covid-rates-markets-brace-for-no-brainer-hike-7954506/", "urlToImage": "https://images.indianexpress.com/2022/06/das.jpg", "publishedAt": "2022-06-05T22:31:13Z", "content": "After the 40-bp hike in repo rate to 4.40 per cent last month, the Monetary Policy Committee (MPC) of the Reserve Bank of India (RBI) is set to go for another rate hike to tackle the elevated inflati… [+5052 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Ritu Sarin", "title": "Black Money Act order against Anil Ambani: offshore assets Rs 800 crore", "description": "The order lists offshore entities and details of transactions in linked bank accounts adding up to over Rs 800 crore. This figure, sources said, was calculated on the basis of the current rupee-dollar exchange rate.", "url": "https://indianexpress.com/article/india/black-money-act-order-against-anil-ambani-offshore-assets-rs-800-crore-7954541/", "urlToImage": "https://images.indianexpress.com/2022/06/anil-ambani.jpg", "publishedAt": "2022-06-05T22:30:59Z", "content": "ALLEGING detection of undeclared offshore assets and investments, the Mumbai unit of the Income Tax Investigation Wing passed a final order in March 2022 against Anil Ambani, Chairman of the Reliance… [+2486 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sukrita Baruah", "title": "Stories they bring to class: Broken homes, lost jobs, troubled lives", "description": "As schools reopened, to full capacity, on April 1, the Delhi government had decided that until mid-June, classes 3 to 9 would set aside the syllabus and focus on the basics of reading, writing and maths.", "url": "https://indianexpress.com/article/education/an-express-investigation-part-3-stories-they-bring-to-class-broken-homes-lost-jobs-troubled-lives-7954511/", "urlToImage": "https://images.indianexpress.com/2022/06/kirti.jpg", "publishedAt": "2022-06-05T22:30:36Z", "content": "Harishs father is a daily-wage worker who says he needs to take his wife once a month to a dargah to treat her mental illness. When they are out, no ones there to ensure Harish goes to school. Siddha… [+8098 chars]"}]}