{"status": "ok", "totalResults": 679, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "7 IndiGo pilots under DGCA scanner for ‘abusing’ on emergency frequency", "description": "On April 9, these pilots were allegedly found venting their ire over low salaries by using offensive language on 121.5 MHz frequency, which is used for emergency communications only for the aircraft in distress.", "url": "https://indianexpress.com/article/india/7-indigo-pilots-under-dgca-scanner-for-abusing-on-emergency-frequency-7891671/", "urlToImage": "https://images.indianexpress.com/2020/06/indigo-1200.jpg", "publishedAt": "2022-04-28T10:51:23Z", "content": "At least seven IndiGo pilots were allegedly found using offensive language over salary issues on a frequency used for emergency communications, sources said on Thursday.On April 9, these pilots were … [+1126 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "What Musk’s past tweets reveal about Twitter’s next owner", "description": "Musk joined Twitter in 2009 and now has more than 85 million followers.", "url": "https://indianexpress.com/article/technology/social/what-musks-past-tweets-reveal-about-twitters-next-owner-7891637/", "urlToImage": "https://images.indianexpress.com/2022/04/Elon-Musk-3.jpg", "publishedAt": "2022-04-28T10:48:55Z", "content": "Three days before Elon Musk agreed to buy Twitter, the world’s richest man tweeted a photo of Bill Gates and used a crude term to make fun of his belly.Playful, aggressive and often juvenile, Musk’s … [+4724 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "Education Minister to launch NCF mandate document tomorrow", "description": "The mandate document describes the development process of the NCF, its expected structure and objectives, and some of the basic principles from the NEP 2020 that will inform the development of the four NCFs.", "url": "https://indianexpress.com/article/education/education-minister-to-launch-mandate-document-of-national-curriculum-framework-ncf-7891593/", "urlToImage": "https://images.indianexpress.com/2022/04/dharmendra-pradhan.jpeg", "publishedAt": "2022-04-28T10:46:47Z", "content": "Union Education Minister Shri Dharmendra Pradhan will be launching the mandate document of National Curriculum Framework (NCF) on April 29, 2022. The National Education Policy (NEP), 2020 recommends … [+1152 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Ananthakrishnan G", "title": "Explained: As Delhi Govt, Centre return to court, what are the issues in their long-running dispute?", "description": "Article 239 AA was inserted in the Constitution by The Constitution (69th Amendment) Act, 1991 to give Special Status to Delhi following the recommendations of the S Balakrishnan Committee that was set up to look into demands for statehood for Delhi.", "url": "https://indianexpress.com/article/explained/explained-delhi-centre-dispute-statehood-7891644/", "urlToImage": "https://images.indianexpress.com/2022/04/kejriwal-baijal-1200.jpg", "publishedAt": "2022-04-28T10:41:01Z", "content": "The Supreme Court has started hearing the dispute between the Delhi government and the Centre over the control of administrative services in the national capital.What are the legal issues before the … [+5180 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Virat Kohli needs to ‘become a free-flowing personality’, says Yuvraj Singh", "description": "The former left-hander said Kohli’s work ethic is what will help him come out of his bad form.", "url": "https://indianexpress.com/article/sports/cricket/virat-kohli-needs-to-become-a-free-flowing-personality-says-yuvraj-singh-7891631/", "urlToImage": "https://images.indianexpress.com/2022/04/Kohli-20.jpg", "publishedAt": "2022-04-28T10:37:15Z", "content": "Former India cricketer Yuvraj Singh reckons Virat Kohli needs to “become a free-flowing personality” like he used to be in order to regain his form back. The last time Virat Kohli amassed a century w… [+911 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mumbai: BJP to hold ‘Booster Dose’ rally on Maharashtra Day to train guns at MVA leaders", "description": "BJP leader Ashish Shelar said, “Devendra Fadnavis’ speech will be a booster dose for the BJP workers in order to boost their morale and also an apt ‘dose’ for the leaders of the Maha Vikas Aghadi government.”", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-bjp-hold-booster-dose-rally-maharashtra-day-train-guns-mva-leaders-7891627/", "urlToImage": "https://images.indianexpress.com/2022/03/Fadnavis-1-1.jpg", "publishedAt": "2022-04-28T10:31:35Z", "content": "The state unit of the BJP Thursday announced that while celebrating Maharashtra Day and Labour Day on May 1, the party will organise a Booster Dose rally where former Chief Minister Devendra Fadnavis… [+1045 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Loudspeaker row: MVA leaders to hold rally in Pune to counter MNS, BJP", "description": "Pune city Congress spokesperson Ramesh Iyer said that the rally will be held at Tilak chowk. Chief Minister Uddhav Thackeray will not attend the rally, he said", "url": "https://indianexpress.com/article/cities/pune/loudspeaker-row-mva-rally-pune-mns-bjp-7891623/", "urlToImage": "https://images.indianexpress.com/2022/04/loudspeaker-1200-2-1.jpg", "publishedAt": "2022-04-28T10:28:54Z", "content": "Pune city Congress spokesperson Ramesh Iyer said that the ‘sadhbhavan niradha sabha’ will be held at Tilak chowk, which is close to Alankar theatre chowk. “The rally is organised to counter the bitte… [+896 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Seo Ye-ji makes deadly comeback after controversy in new Eve poster as a vengeful heiress: ‘Will take you down in the coldest way…’", "description": "Seo Ye-ji will now be seen in the revenge drama Eve. In the first photo of the show, she seems menacing and cold.", "url": "https://indianexpress.com/article/entertainment/web-series/seo-ye-ji-controversy-eve-poster-comeback-7891040/", "urlToImage": "https://images.indianexpress.com/2022/04/seoyeji.jpg", "publishedAt": "2022-04-28T10:25:34Z", "content": "South Korean star Seo Ye-ji has kept a low profile ever since being embroiled in a controversy last year. The actor is making a comeback with the romance drama Eve, which is the story of a rich heire… [+1656 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Bharat Ek Khoj actor Salim Ghouse passes away at 70", "description": "Salim Ghouse has passed away in Mumbai. The actor was known for his performances in Bharat Ek Khoj, Saaransh and Manthan.", "url": "https://indianexpress.com/article/entertainment/bollywood/bharat-ek-khoj-actor-salim-ghouse-passes-away-at-70-7891607/", "urlToImage": "https://images.indianexpress.com/2022/04/salim-ghouse-.jpg", "publishedAt": "2022-04-28T10:24:47Z", "content": "Film and TV actor Salim Ghouse passed away on Thursday in Mumbai. He was 70. The Family Man actor Sharib Hashmi condoled the death and tweeted, “Pehli baar #SalimGhouse Sahab ko tv serial #Subah mein… [+1043 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Money laundering case: Maha minister Nawab Malik seeks interim bail on medical ground", "description": "The NCP leader, who is currently in judicial custody, was arrested on February 23 by the ED in connection with a money laundering probe linked to the activities of fugitive gangster Dawood Ibrahim and his aides, under provisions of the Prevention of Money Lau…", "url": "https://indianexpress.com/article/cities/mumbai/money-laundering-case-maha-minister-nawab-malik-seeks-interim-bail-on-medical-ground-7891626/", "urlToImage": "https://images.indianexpress.com/2022/04/nawab.jpeg", "publishedAt": "2022-04-28T10:24:01Z", "content": "Maharashtra minister Nawab Malik, arrested by the Enforcement Directorate in a money laundering case, sought interim bail on medical ground from a special PMLA court here on Thursday.Malik (62) had e… [+1160 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Soaked raisins or fresh grapes: Nutritionist explains which is healthier and why", "description": "Nutritionist Bhuvan Rastogi shared that \"dried fruits, in general, are a convenient source of nutrients in harsh weather conditions\"", "url": "https://indianexpress.com/article/lifestyle/health/are-soaked-raisins-healthier-than-fresh-grapes-nutritionist-explains-busts-myth-7876494/", "urlToImage": "https://images.indianexpress.com/2022/04/Raisins-1200-getty.jpg", "publishedAt": "2022-04-28T10:20:25Z", "content": "Soaked dry fruits – such as almonds, walnuts and raisins – are known to have several health benefits and experts often suggest starting the day with a handful of nuts. Raisins or dried grapes, especi… [+1774 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Warrants against ‘Bluetooth cheating expert’, ex-BJP leader and three others in Karnataka scam", "description": "Assistant executive engineer Manjunath Malekundi and ex-BJP women’s wing chief Divya Hagaragi are among the five against whom arrest warrants were issued in the sub-inspector recruitment scam case, in which 12 accused have so far been arrested.", "url": "https://indianexpress.com/article/cities/bangalore/warrants-against-bluetooth-cheating-expert-ex-bjp-leader-three-others-karnataka-scam-7891563/", "urlToImage": "https://images.indianexpress.com/2022/01/bangalore-police.jpeg", "publishedAt": "2022-04-28T10:12:26Z", "content": "A government engineer said to be an expert in using Bluetooth devices for cheating on examinations is among five persons, including a former BJP functionary, against whom arrest warrants were issued … [+2542 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sweety Kumari", "title": "Bengal BJP MP interview: ‘Party is very weak … did not fight enough during post-poll violence, workers felt abandoned’", "description": "Arjun Singh blames poor candidate selection for BJP’s loss in Assembly elections last year, says no one can stop him if he wants to  rejoin Trinamool", "url": "https://indianexpress.com/article/india/political-pulse/bengal-bjp-mp-arjun-singh-interview-party-weak-post-poll-violence-7891559/", "urlToImage": "https://images.indianexpress.com/2022/04/Arjun-Singh.jpg", "publishedAt": "2022-04-28T10:10:22Z", "content": "Of the seven Assembly seats in your constituency, the BJP lost six in the elections last year. Are you insecure about the BJP’s performance and changing strategies before the general elections?\r\nThe … [+5533 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manoj Kumar R", "title": "Kaathuvaakula Rendu Kadhal movie review: Samantha Ruth Prabhu, Vijay Sethupathi, Nayanthara film is a colossal mess", "description": "Kaathuvaakula Rendu Kadhal movie review: This film is Vignesh's wishful dream about an average Joe becoming a chick magnet.", "url": "https://indianexpress.com/article/entertainment/movie-review/kaathuvaakula-rendu-kadhal-movie-review-samantha-ruth-prabhu-nayanthara-vijay-sethupathi-film-colossal-mess-7891520/", "urlToImage": "https://images.indianexpress.com/2022/04/samantha-nayanthara.jpg", "publishedAt": "2022-04-28T10:08:25Z", "content": "Kaathuvaakula Rendu Kadhal movie cast: Vijay Sethupathi, Nayanthara and Samantha Ruth Prabhu\r\nKaathuvaakula Rendu Kadhal movie rating:  2 stars\r\nDirector Vignesh Shivan’s latest romantic comedy Kaath… [+4131 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Partha Sarthi Biswas", "title": "In Pune, a housing federation helps societies tackle chronic defaulters", "description": "Payment of maintenance charges was one of the fundamental duties of society members, said Suhas Patwardhan, chairman of the federation. Without timely payment of these charges, no society can function as it is the primary source of income for them, he added.", "url": "https://indianexpress.com/article/cities/pune/in-pune-a-housing-federation-helps-societies-tackle-chronic-defaulters-7891581/", "urlToImage": "https://images.indianexpress.com/2022/04/oune.jpg", "publishedAt": "2022-04-28T10:08:15Z", "content": "The Pune District Cooperative Housing Federation is on a mission this summer: to help societies tackle the problem of chronic defaulters. Accordingly, the federation has organised a series of special… [+1258 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuradha Mascarenhas", "title": "Stricter Covid-19 measures linked with negative mental health: Lancet study", "description": "Policies that led to loss in social connection were associated with greater psychological distress, data reveals", "url": "https://indianexpress.com/article/cities/pune/covid-19-measures-negative-mental-health-lancet-study-7891568/", "urlToImage": "https://images.indianexpress.com/2022/04/mental-health-file.jpg", "publishedAt": "2022-04-28T10:05:55Z", "content": "Stricter pandemic policy measures often implemented by countries that tried to control, rather than eliminate Covid-19 are associated with slightly worse mental health, according to two new studies p… [+3474 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Abhinaya Harigovind", "title": "Explained: Why Delhi is sweltering hot, and can we expect any respite?", "description": "Delhi heatwave explained: The national capital region is in the midst of a third heatwave this summer. What's the forecast? Why have temperatures remained persistently high? Is this normal?", "url": "https://indianexpress.com/article/explained/delhi-heatwave-explained-weather-forecast-temperature-7891557/", "urlToImage": "https://images.indianexpress.com/2022/04/Delhi-2.jpeg", "publishedAt": "2022-04-28T10:04:31Z", "content": "Delhi-NCR is in the midst of another heatwave, with the maximum temperature at some weather observatories likely to hit 45 degrees Celsius on Thursday. This is the third heatwave spell the city is wi… [+3128 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rahul V Pisharody", "title": "Two-year-old mauled to death by stray dogs in Hyderabad; residents allege official apathy", "description": "Anas Ahmed was playing outside his home near Golconda’s Bada Bazar when dogs attacked him around 9.45 pm on Tuesday. He suffered severe injuries to his neck and head and was rushed to a government hospital, where doctors declared him ‘brought dead’.", "url": "https://indianexpress.com/article/cities/hyderabad/two-year-old-mauled-death-stray-dogs-hyderabad-residents-allege-official-apathy-7891552/", "urlToImage": "https://images.indianexpress.com/2022/04/Stray-dogs.jpeg", "publishedAt": "2022-04-28T09:59:20Z", "content": "After a two-year-old was mauled to death by a pack of stray dogs in Golconda on Tuesday night, residents have pointed fingers at the municipal corporation and alleged that the Greater Hyderabad Munic… [+3307 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Microsoft researchers discover Linux vulnerability that allows root access", "description": "The Nimbuspwn vulnerabilities could potentially be leveraged to carry out sophisticated threats using malware and ransomware to create great impacts on vulnerable devices.", "url": "https://indianexpress.com/article/technology/tech-news-technology/microsoft-researchers-discover-nimbuspwn-linux-vulnerability-that-allows-root-access-7891546/", "urlToImage": "https://images.indianexpress.com/2022/04/Microsoft-discoversNimbuspwn-Linux-vulnerability.jpeg", "publishedAt": "2022-04-28T09:58:36Z", "content": "Microsoft has discovered a set of vulnerabilities, that it collectively refers to as Nimbuspwn, which could allow attackers to escalate to root privileges on Linux systems. This would allow attackers… [+1198 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sreenivas Janyala", "title": "Target 151, Jagan Mohan Reddy sets targets, scores for party leaders", "description": "Reddy said the target of 151 seats was achievable as the government had fulfilled “95% of its poll promises” and “credited over Rs 1.37 lakh crore through DBT (direct benefit transfer), without any corruption”.", "url": "https://indianexpress.com/article/india/political-pulse/andhra-pradesh-jagan-mohan-reddy-sets-targets-for-party-leaders-7891553/", "urlToImage": "https://images.indianexpress.com/2022/04/Jagan-Reddy.jpg", "publishedAt": "2022-04-28T09:58:01Z", "content": "Two years to go for the Andhra Pradesh Assembly elections, YSR Congress Party leader and Chief Minister Y S Jagan Mohan Reddy has laid out a roadmap for his party leaders and MLAs, with a warning tha… [+2226 chars]"}]}