{"status": "ok", "totalResults": 503, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Careers Desk", "title": "SSC CGL tier 1 answer key 2021 released: How to download", "description": "Candidates can download their answer key from the official website of SSC — ssc.nic.in. The candidates may take a printout of their respective answer sheets, as the same will not be available after the specified time limit.", "url": "https://indianexpress.com/article/jobs/ssc-cgl-tier-1-answer-key-2021-released-how-to-download-ssc-nic-in-7899163/", "urlToImage": "https://images.indianexpress.com/2022/04/pexels-startup-stock-photos-7112-1.jpg", "publishedAt": "2022-05-03T08:44:50Z", "content": "SSC CGL Tier 1 Answer Key 2021: The Staff Selection Commission has uploaded the answer keys of the Combined Graduate Level (CGL) examination tier-1 -2021.  Candidates can download their answer key fr… [+984 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mumbai: Four arrested for ATM card cloning", "description": "Mumbai News: The police seized three laptops, four ATM card cloners, eight ATM card skimming devices, five mobile phones and 103 cloned ATM cards of different banks from the accused.", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-four-arrested-for-atm-card-cloning-7899284/", "urlToImage": "https://images.indianexpress.com/2022/05/ARREST-1-1.jpg", "publishedAt": "2022-05-03T08:41:13Z", "content": "The Mira Bhayandar Vasai Virar (MBVV) police have arrested four men for allegedly making cloned ATM cards and withdrawing money using them.Acting on a tip-off, the Manikpur police on April 30 arreste… [+1193 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Haryana clerk recruitment exam: HC quashes results, directs preparation of fresh merit list", "description": "During the proceedings in the court, the commission admitted that there were mistakes on the part of the examiner during evaluation of the answer sheets.", "url": "https://indianexpress.com/article/jobs/haryana-clerk-recruitment-exam-hc-quashes-results-directs-preparation-of-fresh-merit-list-7899279/", "urlToImage": "https://images.indianexpress.com/2022/05/ch1556838-1.jpg", "publishedAt": "2022-05-03T08:40:13Z", "content": "The Punjab and Haryana High Court while quashing the resultdeclared by the Haryana Staff Selection Commission (HSSC), dated September 3, 2020, for the clerk recruitment examination, directed the comm… [+2377 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "‘You are a diamond’: Palak Tiwari’s Pilates coach lauds her dedication to fitness", "description": "For the unversed, Pilates exercises are designed to be rhythmic and dynamic in nature. Hence, establishing a set breathing pattern while practicing Pilates helps to recruit every tiny little muscle in the body, making it a full-body workout.", "url": "https://indianexpress.com/article/lifestyle/fitness/palak-tiwari-pilates-fitness-coach-benefits-7887926/", "urlToImage": "https://images.indianexpress.com/2022/04/palak1200.jpg", "publishedAt": "2022-05-03T08:40:00Z", "content": "Consistency and variation play an extremely important role when it comes to reaching one’s fitness goals. Giving us a glimpse of how Palak Tiwari keeps fit, her fitness coach Praveen Nair shared a vi… [+1086 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Darshan Devaiah BP", "title": "Karnataka: Amit Shah in town, big JD(S) Lingayat name joins BJP", "description": "Basavaraj Horatti said he continues to respect the JD(S), \"but due to the changed situation and voters' response, I have joined the BJP\".", "url": "https://indianexpress.com/article/india/political-pulse/karnataka-amit-shah-jds-lingayat-basavaraj-horatti-bjp-7899265/", "urlToImage": "https://images.indianexpress.com/2022/05/basavaraj-horatii.jpg", "publishedAt": "2022-05-03T08:39:02Z", "content": "The much-watched trip of Union Home Minister Amit Shah to Karnataka kicked off Tuesday with the induction of senior Janata Dal (S) leader and Lingayat face Basavaraj Horatti into the BJP.Horatti, who… [+2563 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Mumbai civic body issues notice for inspection of Navneet Rana, Ravi Rana’s home over ‘illegal’ construction", "description": "Mumbai news: The Mumbai police had registered an FIR against them on charges of sedition and promoting enmity following their public declaration of reciting the Hanuman Chalisa outside Maharashtra Chief Minister Uddhav Thackeray's private residence 'Matoshree…", "url": "https://indianexpress.com/article/cities/mumbai/bmc-navneet-rana-ravi-rana-hanuman-chalisa-arrest-illegal-construction-7899275/", "urlToImage": "https://images.indianexpress.com/2022/05/rana-couple-1200-3.jpg", "publishedAt": "2022-05-03T08:38:46Z", "content": "The Brihanmumbai Municipal Corporation (BMC) has issued a notice for inspection of the residence of jailed independent MP Navneet Rana and her MLA-husband Ravi Rana in Khar area here in connection wi… [+1868 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Johnny Depp’s agent says Amber Heard’s op-ed piece alleging abuse damaged actor’s career: ‘Catastrophic’", "description": "Johnny Depp is suing Amber Heard for libel in Fairfax County Circuit Court, saying her article defamed him when she described herself as “a public figure representing domestic abuse.”", "url": "https://indianexpress.com/article/entertainment/hollywood/johnny-depp-agent-calls-amber-heard-op-ed-piece-on-abuse-catastrophic-7899174/", "urlToImage": "https://images.indianexpress.com/2022/05/Johnny-Depp-ap-1200by667.jpeg", "publishedAt": "2022-05-03T08:35:03Z", "content": "Johnny Depps agent testified Monday that his ex-wifes 2018 op-ed piece in The Washington Post describing herself as a victim of domestic abuse was catastrophic to his career and coincided with the lo… [+3315 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Covid worsens asthma in children; booster after infection not as beneficial vs Omicron", "description": "Results of earlier studies showing improvement in asthma control in the early part of the pandemic were likely due to public health measures like staying home and masking, which curbed exposure to asthma triggers, she said.", "url": "https://indianexpress.com/article/world/covid-worsens-asthma-in-children-booster-after-infection-not-as-beneficial-vs-omicron-7899257/", "urlToImage": "https://images.indianexpress.com/2022/05/VACCINATION-2-1.jpg", "publishedAt": "2022-05-03T08:34:59Z", "content": "The following is a summary of some recent studies on Covid-19. They include research that warrants further study to corroborate the findings and that has yet to be certified by peer review.Covid-19 w… [+2826 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Loudspeaker row: Action against Raj Thackeray today itself, says Maharashtra DGP", "description": "Raj Thackeray gave the state government an ultimatum during his speech in Aurangabad on May 1 to remove loudspeakers from mosques by May 4, failing which “Hanuman Chalisa will be played at a louder volume (than azaan) in front of the mosques”.", "url": "https://indianexpress.com/article/cities/mumbai/loudspeaker-row-action-against-raj-thackeray-today-itself-says-maharashtra-dgp-7899267/", "urlToImage": "https://images.indianexpress.com/2022/05/WhatsApp-Image-2022-05-01-at-9.27.48-PM.jpeg", "publishedAt": "2022-05-03T08:32:42Z", "content": "Maharashtra director general of police (DGP) Rajnish Seth said that the state police are prepared to deal with any law and order issues arising out of agitations called by Maharashtra Navnirman Sena … [+1943 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Eid 2022: Dia Mirza shares adorable photo with son Avyaan Azaad, Priyanka Chopra is missing biryani and sevaiya", "description": "From Priyanka Chopra, Sanjay Dutt to Dia Mirza, here's how your favourite celebrities are ringing in this special day of Eid.", "url": "https://indianexpress.com/article/entertainment/bollywood/eid-2022-dia-mirza-fahadh-faasil-nazriya-priyanka-chopra-sanjay-dutt-srk-salman-khan-ajay-devgn-photos-wishes-7899161/", "urlToImage": "https://images.indianexpress.com/2022/05/dia1200.jpg", "publishedAt": "2022-05-03T08:30:58Z", "content": "Every festival sees social media flooded with celebrities’ wishes and posts for fans on the special day, and today is no different. Bollywood celebs are busy celebrating the festival of Eid, as they … [+1770 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Kangana Ranaut says she was ‘banned’ by Bollywood after supporting victims in MeToo: ‘Sexual exploitation is common in film industry’", "description": "Kangana Ranaut shared her opinion after Saisha Shinde opened up about getting sexually abused by a leading designer during her initial days in the fashion industry.", "url": "https://indianexpress.com/article/entertainment/bollywood/kangana-ranaut-banned-me-too-sexual-exploitation-film-industry-lock-upp-saisha-shinde-7899075/", "urlToImage": "https://images.indianexpress.com/2022/05/kangana-lock-upp-1200.jpg", "publishedAt": "2022-05-03T08:30:39Z", "content": "Kangana Ranaut said sexual exploitation of young people is not a rare thing in Bollywood and fashion industry. “No matter how much we defend the industry, it’s the truth. While it gives so many oppor… [+2103 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Gayathri Mani", "title": "Delhi transport department’s ‘tactical urbanism’ trials improved pedestrian safety: Study", "description": "Delhi news: Transport Minister Kailash Gahlot last November inaugurated the 'tactical urbanism' trials to improve safety for pedestrians, cyclists, and other road users at Rajghat intersections.", "url": "https://indianexpress.com/article/cities/delhi/delhi-transport-departments-tactical-urbanism-trials-improved-pedestrian-safety-study-7899188/", "urlToImage": "https://images.indianexpress.com/2022/05/traffic-people.jpg", "publishedAt": "2022-05-03T08:28:06Z", "content": "After the implementation of ‘tactical urbanism’ trials at Rajghat intersections, pedestrian safety on roads has improved, finds a study by SaveLIFE foundation which implemented the trials along with … [+2494 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuradha Mascarenhas", "title": "Music therapy: Pune-based doctors’ orchestra performs for right causes", "description": "With more than 200 music programmes under its belt, the 17-member team is now looking forward to another one on May 8 (World Thalassemia Day) to raise funds for thalassemia patients.", "url": "https://indianexpress.com/article/cities/pune/music-therapy-pune-based-doctors-orchestra-performs-for-right-causes-7899190/", "urlToImage": "https://images.indianexpress.com/2022/05/VideoCapture_20220502-193826.jpg", "publishedAt": "2022-05-03T08:24:44Z", "content": "A consulting radiologist as the lead playback singer, an oral cancer surgeon as the bass guitarist, a paediatric surgeon as the rhythmist; the Pune-based Doctors’ Orchestra for Charity and Social ser… [+3746 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "Mattresses fly off from a truck in UK. Watch video", "description": "A clip showing the mattresses blowing off a truck has now surfaced online.", "url": "https://indianexpress.com/article/trending/trending-globally/mattresses-fly-off-from-a-truck-in-uk-7899231/", "urlToImage": "https://images.indianexpress.com/2022/05/nowthisnews.jpg", "publishedAt": "2022-05-03T08:18:14Z", "content": "Motorists in Ashford, England were left stunned as more than 20 mattresses flew off from a truck. The motorists managed to avoid getting hit by the flying mattresses. A clip showing the mattresses bl… [+1621 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "When Akshay Kumar told Karan Johar about ‘stupid’ rumours of him being gay: ‘Have you seen my face, you think?’", "description": "Akshay Kumar in his first appearance on Koffee with Karan said that it is 'terrible' of Karan Johar to stoke controversies.", "url": "https://indianexpress.com/article/entertainment/bollywood/akshay-kumar-karan-johar-gay-rumours-koffee-with-karan-7899204/", "urlToImage": "https://images.indianexpress.com/2022/05/akshay-kumar-karan-johar.jpg", "publishedAt": "2022-05-03T08:10:37Z", "content": "Akshay Kumar in an appearance on Koffee with Karan in 2014 revealed the ‘stupidest’ rumour that he’s heard about himself. Akshay said that he once read that he was in a homosexual relationship with T… [+1759 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Explained Desk", "title": "Explained: What is Roe v. Wade, which the US Supreme Court seems poised to overturn — and why is it significant?", "description": "The US Supreme Court is set to overturn the landmark 1973 Roe v. Wade judgment that legalised abortion in the country, according to a report in Politico. What is Roe v Wade? Why is this decision important? Is a leak from the Supreme Court such as this unusual?", "url": "https://indianexpress.com/article/explained/roe-v-wade-us-supreme-court-abortion-judgment-explained-7899208/", "urlToImage": "https://images.indianexpress.com/2022/05/sc.jpg", "publishedAt": "2022-05-03T08:05:09Z", "content": "The US Supreme Court has decided by an internal majority to overturn Roe v. Wade, the courts landmark 1973 judgment that made abortion a constitutional right, Politico reported on May 3.Politico scoo… [+8074 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "‘Gigi Hadid wore her sofa’: Met Gala 2022 memes feed of Kylie Jenner, her best friend’s outfits", "description": "Met Gala, the star-studded event that is known for celebrating the best in art and design, is also known to trigger a plethora of memes online every year, and this year was no different.", "url": "https://indianexpress.com/article/trending/trending-globally/met-gala-2022-supermodels-kylie-jenner-and-gigi-hadids-looks-spark-meme-fest-7898985/", "urlToImage": "https://images.indianexpress.com/2022/05/met-gala-2022-memes-kylie-jenner.jpg", "publishedAt": "2022-05-03T08:01:27Z", "content": "Its finally the first Monday in May, and the fashion world’s biggest event — the Met Gala — has returned to the Metropolitan Museum of Modern Art in New York City. And while there were some exquisite… [+3231 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Sports Desk", "title": "অন্যায্য ওয়াইড রাজস্থানকে, আম্পায়ারের ভুলের পুরো ফায়দা নিল KKR, দেখুন বিতর্কিত ঘটনা", "description": "আম্পায়ারিং নিয়ে বারেবারেই বিতর্ক বেঁধেছে চলতি আইপিএলে। কেকেআর বনাম রাজস্থান ম্যাচেও সেই একই ঘটনা ঘটল।", "url": "https://bengali.indianexpress.com/sports/ipl/ipl-2021-wide-ball-umpiring-controversy-kkr-vs-rr-match-prasidh-krishna-438904/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/05/Wide.jpg", "publishedAt": "2022-05-03T07:58:56Z", "content": "What kind of Umpiring was that man! Nithin Pandit is his name He's Umpiring in a freaking International Level IPL that is so intense &amp; he does that?! So LocalIt cost RR an Easy Win! Even Umpires … [+141 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Chandigarh: Parents hesitant, schools want more time", "description": "At the same time, private schools, most of those who have decided not to go ahead with hybrid mode(offline plus online education) want Chandigarh Administration to relook and defer its orders restricting unvaccinated children from attending classes.", "url": "https://indianexpress.com/article/cities/chandigarh/chandigarh-parents-hesitant-schools-want-more-time-7899217/", "urlToImage": "https://images.indianexpress.com/2022/05/CHILDREN-PARENTS.jpg", "publishedAt": "2022-05-03T07:53:45Z", "content": "Parents have expressed hesitation to get their children vaccinated and urged the schools to allow online mode of education for unvaccinated students.\r\nAt the same time, private schools, most of those… [+1281 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Entertainment Desk", "title": "হন্তদন্ত হয়ে এয়ারপোর্টে দৌড়চ্ছেন আলিয়া! চোখ কপালে যাত্রীদের, হলটা কী?", "description": "আলিয়া ভাটকে দেখতে ভীড়! দেখুন ভিডিও।", "url": "https://bengali.indianexpress.com/entertainment/worried-alia-bhatt-runs-with-luggage-trolley-at-delhi-airport/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/05/alia-bhatt.jpg", "publishedAt": "2022-05-03T07:53:39Z", "content": "- ? ? !\r\n , ‘ ’ \r\n, - ‘ ’ , , , - - , \r\n[ : ! ]\r\n‘ ’ , \r\n - - -, -, -, , - - - ‘’- \r\n , \r\nStay updated with the latest news headlines and all the latest Entertainment news download Indian Express Ben… [+82 chars]"}]}