{"status": "ok", "totalResults": 428, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Bombay HC seeks Maharashtra home dept response to PIL seeking resumption of voice, video calling facilities for inmates", "description": "The organisation also sought to declare the telephone and electronic modes of communication to be covered under the scope of “interviews” as per Prisons (Facilities to Prisoners) Rules, 1962.", "url": "https://indianexpress.com/article/cities/mumbai/bombay-hc-maharashtra-home-dept-voice-video-calling-facilities-for-inmates-7897764/", "urlToImage": "https://images.indianexpress.com/2022/04/bombay-high-court-1-11.jpg", "publishedAt": "2022-05-02T08:50:53Z", "content": "The Bombay High Court Monday sought Maharashtra home departments response to the public interest litigation (PIL) seeking immediate installation of telephones and other electronic modes of communicat… [+3828 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "In Egypt’s big Ramadan TV drama, the President is the hero", "description": "The government-produced hit Ramadan TV series “The Choice 3” purports to truthfully chronicle the 2013 rise to power of el-Sissi, Egypt’s authoritarian president, but critics say it is a rewriting of history.", "url": "https://indianexpress.com/article/world/egypt-ramadan-tv-the-choice-3-sissi-7897726/", "urlToImage": "https://images.indianexpress.com/2022/05/EGYPT-GOVT-TV-SHOW-2.jpg", "publishedAt": "2022-05-02T08:49:01Z", "content": "At the height of the traditional Ramadan TV season, big-budget, star-studded shows captivate millions of Egyptians every night of the holy month with high drama and low comedy. But one episode of the… [+7832 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Raj Thackeray’s speech aimed at dividing society: Maha home minister; hints at action against MNS chief", "description": "The minister also said the Aurangabad police commissioner will see what conditions laid down by the police, while granting permission for Raj Thackeray's rally, were violated.", "url": "https://indianexpress.com/article/cities/mumbai/raj-thackeray-speech-maharashtra-home-minister-mns-chief-7897721/", "urlToImage": "https://images.indianexpress.com/2022/04/dilip-patil-11.jpeg", "publishedAt": "2022-05-02T08:46:33Z", "content": "Maharashtra Home Minister Dilip Walse Patil on Monday said MNS chief Raj Thackeray’s speech in Aurangabad, wherein he remained firm on the May 3 deadline for removal of loudspeakers from mosques, was… [+1921 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "IPL 2022 KKR vs RR Playing XI, Match Prediction, Pitch Report: Will Kolkata drop V Iyer from their Playing 11?", "description": "IPL 2022 PBKS vs SRH Dream 11 Prediction: Kolkata Knight Riders vs Rajasthan Royals Playing XI Updates for Today's IPL Match", "url": "https://indianexpress.com/article/sports/ipl/ipl-2022-kkr-vs-rr-prediction-fantasy-cricket-tips-playing-xi-pitch-report-injury-7897702/", "urlToImage": "https://images.indianexpress.com/2022/05/kkr-vs-rr.jpg", "publishedAt": "2022-05-02T08:43:37Z", "content": "Kolkata Knight Riders vs Rajasthan Royals (KKR vs RR) Players List: Guilty of making too many changes at the top, Kolkata Knight Riders would like to find a winning combination against Rajasthan Roya… [+2412 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "From Bolani in Afghanistan to Lokum in Turkey, here is what the world feasts on Eid-Ul-Fitr", "description": "Just like the celebrations of Eid-ul-Fitr differ in various parts of the world, so does the food that is enjoyed on this auspicious day.", "url": "https://indianexpress.com/article/lifestyle/food-wine/bolani-afghanistan-lokum-turkey-here-is-what-the-world-feasts-on-eid-ul-fitr-7896251/", "urlToImage": "https://images.indianexpress.com/2022/05/eid-feast.jpg", "publishedAt": "2022-05-02T08:40:36Z", "content": "Being celebrated on May 2-3 this year, Eid-ul-Fitr commemorates the end of the 30 days of fasting from dawn to sunset observed by Muslims around the world. Besides offering prayers, wearing new cloth… [+1916 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "US talk of ‘victory’ against Russia has some allies nervous", "description": "With each visit — the secretaries of state and defense traveled to Kyiv last weekend — the promise of US commitment to a Ukrainian victory appears to grow, even as how the US defines victory has remained uncertain.", "url": "https://indianexpress.com/article/world/us-talk-of-victory-against-russia-has-some-allies-nervous-7897715/", "urlToImage": "https://images.indianexpress.com/2022/05/NANCY-PELOSI.jpeg", "publishedAt": "2022-05-02T08:37:55Z", "content": "House Speaker Nancy Pelosi traveled to Ukraines capital over the weekend, leading the second senior US delegation to meet with President Volodymyr Zelenskyy in a week and declare support for his coun… [+10252 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Kaathuvaakula Rendu Kaadhal box office: Samantha Ruth Prabhu is ‘grateful’ as movie’s collection remains steady", "description": "Kaathuvaakula Rendu Kaadhal stars Vijay Sethupathi, Nayanthara and Samantha Ruth Prabhu in the lead roles.", "url": "https://indianexpress.com/article/entertainment/tamil/kaathuvaakula-rendu-kaadhal-box-office-samantha-ruth-prabhu-is-grateful-as-movies-collection-remains-steady-7897625/", "urlToImage": "https://images.indianexpress.com/2022/04/krk-trailer-.jpg", "publishedAt": "2022-05-02T08:33:56Z", "content": "Director Vignesh Shivans latest romantic comedy Kaathuvaakula Rendu Kaadhal is holding its ground well at the box office in Tamil Nadu, despite getting mixed reviews. The film, starring Vijay Sethupa… [+2017 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "New FIR in Karnataka police exam scam accuses seven of top-10 rankers from Bengaluru of fraud", "description": "The FIR named 22 candidates who took the exam in seven centres in Bengaluru as accused. The police have arrested nine of the 22 candidates and are expected to take the others into custody soon.", "url": "https://indianexpress.com/article/cities/bangalore/karnataka-police-exam-fir-scam-7897668/", "urlToImage": "https://images.indianexpress.com/2022/05/bangalore-police.jpeg", "publishedAt": "2022-05-02T08:29:42Z", "content": "A new first information report (FIR) filed by Karnataka Police criminal investigation department (CID) on the alleged police-sub inspector recruitment exam scam has named seven of the top 10 state-wi… [+4583 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Ranveer Singh calls Jayeshbhai Jordaar co-star Ratna Pathak Shah ‘absolute magic’, says he has ‘affection’ for Shalini Pandey", "description": "Ranveer Singh talks about his Jayeshbhai Jordaar co-stars Ratna Pathak Shah and Shalini Pandey.", "url": "https://indianexpress.com/article/entertainment/bollywood/ranveer-singh-jayeshbhai-jordaar-ratna-pathak-shah-7897624/", "urlToImage": "https://images.indianexpress.com/2022/05/ranveer1200.jpg", "publishedAt": "2022-05-02T08:29:32Z", "content": "Ranveer Singh, who is awaiting the release of his upcoming film, Jayeshbhai Jordaar, is full of praise for his co-stars. In the film, Ranveer plays the role of a man, who has to protect his unborn ch… [+1963 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "“Need To Focus On Non-Kinetic Means Of Warfare”: Army Chief On Russia-Ukraine Conflict", "description": "", "url": "https://indianexpress.com/videos/news-video/need-to-focus-on-non-kinetic-means-of-warfare-army-chief-on-russia-ukraine-conflict/", "urlToImage": "https://images.indianexpress.com/2022/05/WhatsApp-Image-2022-05-02-at-11.29.48-AM.jpeg", "publishedAt": "2022-05-02T08:27:47Z", "content": "As farmers, dealers avoid Mamata govts flagship mandis, dept rents out space"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Netflix drops Meghan Markle’s animated series Pearl", "description": "The Pearl series was to be centered on the adventures of a 12-year-old girl who is inspired by influential women from history.", "url": "https://indianexpress.com/article/entertainment/web-series/netflix-drops-meghan-markle-animated-series-pearl-7897634/", "urlToImage": "https://images.indianexpress.com/2022/05/markle1200.jpeg", "publishedAt": "2022-05-02T08:26:50Z", "content": "Streaming platform Netflix Inc said on Sunday it had decided to stop work on Meghan Markles family series Pearl as it reviewed animated content.Dropping several projects, including Markles, was part … [+1330 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "IUCAA scientists featured on cover of international journal, detect jets from a supermassive blackhole blowing out gas from a galaxy", "description": "An official statement issued by IUCAA has said that astronomers have found that gas is steadily being blown away from the central regions of the galaxy, pushed by the relativistic jet.", "url": "https://indianexpress.com/article/cities/pune/iucaa-scientists-featured-on-cover-of-international-journal-detect-jets-from-a-supermassive-blackhole-blowing-out-gas-from-a-galaxy-7897666/", "urlToImage": "https://images.indianexpress.com/2022/05/blackholes-1200.jpg", "publishedAt": "2022-05-02T08:23:57Z", "content": "Supermassive black holes at the centres of galaxies are known to give rise to fast moving jets of relativistic particles that can traverse large distances through the galaxy and beyond. An internatio… [+2636 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Inside China’s zero-Covid fortress, Xi admits no doubts", "description": "But there was a revealing gap in Xi’s busy April itinerary, exposing the predicament that Covid is creating in a politically crucial year when he hopes to extend his hold on power.", "url": "https://indianexpress.com/article/world/inside-chinas-zero-covid-fortress-xi-admits-no-doubts-7897677/", "urlToImage": "https://images.indianexpress.com/2022/05/XI-PING.jpg", "publishedAt": "2022-05-02T08:21:04Z", "content": "Chinas leader, Xi Jinping, waved at crowds of giddily cheering students. He held meetings with Olympic Games officials, economic policymakers and European leaders. He toured a tropical island.But the… [+8991 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Deeksha Teri", "title": "Ukraine-returned MBBS students complain about quality of online lectures", "description": "The students who came back to India are still enrolled in the Ukraine-based universities, and to continue their education they have been paying the tuition fees.", "url": "https://indianexpress.com/article/education/ukraine-returned-mbbs-students-complain-about-quality-of-online-lectures-7896502/", "urlToImage": "https://images.indianexpress.com/2022/05/MBBS.jpg", "publishedAt": "2022-05-02T08:17:04Z", "content": "When Russia launched a war on Ukraine and Indian medical students in the country under attack were asked to hide in bunkers, all they prayed was to get back home safely and soon. They did reach India… [+4070 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Alifiya Khan", "title": "Pune Campus Watch: From tuition and transport fees to book price, parents to face rising school costs", "description": "As far as school fees are concerned, most city schools which did not raise tuition fees during the pandemic have increased them from 10 to 20 per cent.", "url": "https://indianexpress.com/article/cities/pune/pune-campus-watch-tuition-transport-fees-rising-school-costs-7897635/", "urlToImage": "https://images.indianexpress.com/2022/05/classroom-pune-1.jpg", "publishedAt": "2022-05-02T08:14:43Z", "content": "As the coronavirus pandemic is finally ebbing and students are set to return to classrooms, parents will have to brace themselves for a different challenge altogether. From June, when the new academi… [+4133 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Gold, Silver Prices Today: Gold declines Rs 649/10 gm, silver crashes Rs 1,954/kg", "description": "Gold, Silver Rates Today News: The opening price for 999 purity gold was Rs 51,406 per 10 grams, down Rs 649 from Friday’s closing price of Rs 52,055, while that of 999 purity silver was Rs 62,820 per kg, down Rs 1,954 from Rs 64,774. Click here to find out b…", "url": "https://indianexpress.com/article/business/commodities/gold-silver-price-today-may-2-latest-check-bullion-rates-7897628/", "urlToImage": "https://images.indianexpress.com/2022/05/GOLD-BULLION-REUTERS-1200.jpg", "publishedAt": "2022-05-02T08:13:30Z", "content": "Gold, Silver Rates Today News Updates: Prices of gold and silver in the key spot markets of the country opened sharply lower on Monday, May 2, 2022.The opening price for 999 purity gold was Rs 51,406… [+2107 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Beant Singh assassination: SC asks Centre to decide Rajoana’s plea for commutation of death penalty", "description": "The top court has been hearing Balwant Singh Rajoana's plea seeking commutation of the death sentence to life term on the ground that he has been in jail for 26 years.", "url": "https://indianexpress.com/article/india/beant-singh-assassination-sc-centre-balwant-singh-rajoana-plea-death-penalty-7897675/", "urlToImage": "https://images.indianexpress.com/2022/05/balwant-singh-rajoana-copy.jpg", "publishedAt": "2022-05-02T08:11:24Z", "content": "The Supreme Court Monday directed the Centre to decide within two months Balwant Singh Rajoana‘s plea that his death penalty in the 1995 assassination of former Punjab chief minister Beant Singh be c… [+703 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Laxman Singh", "title": "Mumbai: In pedestrian-friendly push, BMC to boost last-mile connectivity", "description": "Minister Aaditya Thackeray said that following global road safety practices, the civic body is planning roads that will allow citizens to walk from the nearest transit stations to their homes.", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-in-pedestrian-friendly-push-bmc-to-boost-last-mile-connectivity-7897664/", "urlToImage": "https://images.indianexpress.com/2022/03/BMC-2-1-2.jpg", "publishedAt": "2022-05-02T08:09:59Z", "content": "The Brihanmumbai Municipal Corporation (BMC) will now push for improved last-mile connectivity to provide pedestrian-friendly roads in the city in accordance with global standards. The corporation is… [+1714 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "US: Final day of Mississippi fest cancelled after fatal shooting", "description": "A police officer said two or three people exchanged gunfire at about 10 pm on Saturday in and around a vehicle at the fairgrounds parking lot during the Mississippi Mudbug Festival in Jackson.", "url": "https://indianexpress.com/article/world/us-mississippi-fest-cancelled-fatal-shooting-7897656/", "urlToImage": "https://images.indianexpress.com/2022/05/d1cd7a5d67214a90a795c88f648da4c3-d1cd7a5d67214a90a795c88f648da4c3-31b644c7e19c4f0db8cf783d978ddfc5.jpg", "publishedAt": "2022-05-02T08:03:30Z", "content": "A law enforcement officer shot and killed one of the people suspected of firing shots at a festival in Mississippi, a sheriff said.Organisers said on Sunday that in response to the shootings, they ca… [+2547 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Maala Parvathi resigns from AMMA’s internal complaints committee following inaction against Vijay Babu", "description": "Maala Parvathi said it was totally unacceptable on the part of Vijay Babu to name the survivor on his FB live when the law clearly says that you can’t reveal the name of the rape survivor in public.", "url": "https://indianexpress.com/article/entertainment/malayalam/maala-parvathi-resigns-from-ammas-icc-following-inaction-against-vijay-babu-7897587/", "urlToImage": "https://images.indianexpress.com/2022/05/Maala-Parvathi-1200by667.jpg", "publishedAt": "2022-05-02T08:01:31Z", "content": "Actress Maala Parvathi has resigned from AMMAs (Association of Malayalam Movie Artists) internal complaints committee in protest against the associations inaction against rape accused Vijay Babu.Vija… [+1549 chars]"}]}