{"status": "ok", "totalResults": 660, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi court rejects bail plea of Chitra Ramakrishna, Anand Subramanian in NSE co-location case", "description": "Delhi News: Special Judge Sanjeev Aggarwal refused to grant bail to the two accused after the Central Bureau of Investigation (CBI) had opposed their bail claiming that they were involved in a serious offence affecting the integrity of the financial system.", "url": "https://indianexpress.com/article/cities/delhi/delhi-court-rejects-bail-plea-of-chitra-ramakrishna-anand-subramanian-in-nse-co-location-case-7913674/", "urlToImage": "https://images.indianexpress.com/2022/05/CHITRA.jpg", "publishedAt": "2022-05-12T10:49:23Z", "content": "A Delhi court on Thursday rejected the bail plea of National Stock Exchange’s (NSE) former managing director Chitra Ramkrishna and former group operating officer (GOO) Anand Subramanian in a 2018 cas… [+1543 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Sri Lankan court imposes overseas travel ban on former PM Mahinda Rajapaksa, 16 others", "description": "The Fort Magistrate's Court asked them to surrender their passports to the court due to the investigations taking place on the attacks on the GotaGoGama and MynaGoGama peaceful protest sites.", "url": "https://indianexpress.com/article/world/sri-lankan-court-overseas-travel-ban-mahinda-rajapaksa-others-7913561/", "urlToImage": "https://images.indianexpress.com/2022/05/SL-1-1.jpg", "publishedAt": "2022-05-12T10:30:28Z", "content": "A Sri Lankan court on Thursday imposed a ban on overseas travel on former prime minister Mahinda Rajapaksa, his son and MP Namal Rajapaksa and 15 others in view of investigations against them for the… [+3169 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Mayawati comes out in support of Azam Khan, accuses UP govt of targeting opponents", "description": "Mayawati also hit out at the BJP government for allegedly targeting the poor, Dalits, tribals and Muslims and harassment of its political opponents.", "url": "https://indianexpress.com/article/cities/lucknow/mayawati-support-azam-khan-accuses-up-government-targeting-opponents-7913553/", "urlToImage": "https://images.indianexpress.com/2022/04/mayawati-1-4-1.jpeg", "publishedAt": "2022-05-12T10:28:54Z", "content": "Coming out in support of senior Samajwadi Party leader Azam Khan, BSP supremo Mayawati on Thursday said his continued incarceration is being regarded as a “strangulation of justice” by the common man… [+1704 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manoj Kumar R", "title": "Sarkaru Vaari Paata movie review: Mahesh Babu’s boyish charm can’t save this misfire", "description": "Sarkaru Vaari Paata movie review: The Mahesh Babu starrer talks about the growing menace of rich people defaulting on bank loans, the government-corporate nexus that enables such financial crimes and how the burden inflicted on the banking system by bad loans…", "url": "https://indianexpress.com/article/entertainment/movie-review/sarkaru-vaari-paata-movie-review-mahesh-babu-7913402/", "urlToImage": "https://images.indianexpress.com/2022/03/Sarkaru-Vaari-Paata-1200by667.jpg", "publishedAt": "2022-05-12T10:25:20Z", "content": "In Sarkaru Vaari Paata, Mahesh (played by Mahesh Babu) makes a living by lending loans in Miami. When Mahesh was young, he saw his family getting crushed under the weight of unpaid dues on the loans … [+3615 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Spinal fluid from young mice sharpened memories of older rodents", "description": "The finding was the latest indication that making brains resistant to the unrelenting changes of older age might depend less on interfering with specific disease processes and more on trying to restore the brain’s environment to something closer to its youthf…", "url": "https://indianexpress.com/article/technology/science/spinal-fluid-from-young-mice-sharpened-memories-of-older-rodents-7913550/", "urlToImage": "https://images.indianexpress.com/2022/05/Spinal-fluid-from-young-mouse-older-mouse.jpg", "publishedAt": "2022-05-12T10:21:12Z", "content": "Five years ago, Tal Iram, a young neuroscientist at Stanford University, approached her supervisor with a daring proposal: She wanted to extract fluid from the brain cavities of young mice and to inf… [+7483 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Thinking about food all the time? Here’s how to break the thought pattern", "description": "While there is nothing wrong with embracing food, this constant pattern of only ever thinking about meals can cause some kind of guilt", "url": "https://indianexpress.com/article/lifestyle/food-wine/thinking-about-food-break-thought-pattern-7902380/", "urlToImage": "https://images.indianexpress.com/2022/05/GettyImages-food-eating-thinking-1200.jpg", "publishedAt": "2022-05-12T10:20:41Z", "content": "Are you thinking about food all the time? There are people who are occupied mentally with thoughts about food: what they have just eaten, what they might be eating next, when to eat which food, from … [+1009 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manoj Jha", "title": "Hindutva and Fascism: They may not be identical, but why suspend a teacher who asked students to compare the two?", "description": "The thinking citizens of this country ought to wonder about the answers of the students if they had been allowed to attempt the exam question on Hindutva and Fascism", "url": "https://indianexpress.com/article/opinion/columns/hindutva-and-fascism-they-may-not-be-identical-but-why-suspend-a-teacher-who-asked-students-to-compare-the-two-7913525/", "urlToImage": "https://images.indianexpress.com/2022/05/HINDUTVA-1.jpg", "publishedAt": "2022-05-12T10:19:54Z", "content": "A question in an undergraduate examination of political science comparing two ideologies appeared to have alarmed the powers that be. The University Grants Commission (UGC) has reprimanded the Sharda… [+4822 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Kiara Advani ‘disappointed’ by lack of depth in comedy films for female actors: ‘That’s how script is written’", "description": "Kiara Advani said the fact that female actors can't compare with what their male counterparts get to do in comedies is because sometimes \"unfortunately that's how (the script) is written\".", "url": "https://indianexpress.com/article/entertainment/bollywood/kiara-advani-disappointed-by-lack-of-depth-in-comedy-films-for-female-actors-7913107/", "urlToImage": "https://images.indianexpress.com/2022/05/Kiara-Advani-1200by667.jpg", "publishedAt": "2022-05-12T10:18:21Z", "content": "Actor Kiara Advani says it’s rare for a female protagonist to do the heavy lifting in comedy films as most of the punches and jokes are reserved for male characters.Advani, who made her debut in 2014… [+3031 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "Watch: ‘Land kare de bhai’ meme guys recreates paragliding video with Alia Bhatt, here’s why", "description": "Donning the same pale green shirt, he took on a flight once again. Alia Bhatt filled in for the instructor this time around.", "url": "https://indianexpress.com/article/trending/trending-in-india/land-kare-de-bhai-meme-guys-recreates-paragliding-video-with-alia-bhatt-7913266/", "urlToImage": "https://images.indianexpress.com/2022/05/alia-bhat-paragliding-guy.jpg", "publishedAt": "2022-05-12T10:08:50Z", "content": "While fame is short-lived on the internet, it’s hard to tap out if you become immortalised through memes. The ‘paragliding guy’ should know. The man whose ‘Bhai land kara de’ meme became quite the ra… [+1987 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Kerala governor hits out at Muslim cleric for ‘insulting’ Class X girl student", "description": "Two days ago, a video from Malappuram showed Sunni Muslim scholar M T Abdulla Musaliyar publicly scolding organisers of a madrassa function after they invited a girl, a Class X student, to the stage for receiving an award.", "url": "https://indianexpress.com/article/cities/thiruvananthapuram/kerala-governor-hits-out-muslim-cleric-insulting-class-x-girl-student-7913510/", "urlToImage": "https://images.indianexpress.com/2022/01/Mohammed-Khan.jpg", "publishedAt": "2022-05-12T10:04:46Z", "content": "Kerala Governor Arif Mohammad Khan on Thursday questioned the states silence on a recent incident in which a minor Muslim girl was insulted by a prominent cleric for having stepped on to a public sta… [+2458 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Knight Riders acquire Abu Dhabi franchise in UAE’s T20 League", "description": "The UAE’s T20 League is Emirates Cricket Board’s sanctioned, flagship professional T20 League.", "url": "https://indianexpress.com/article/sports/cricket/knight-riders-acquire-abu-dhabi-franchise-in-uaes-t20-league-7913499/", "urlToImage": "https://images.indianexpress.com/2022/05/Untitled-design-11-1.jpg", "publishedAt": "2022-05-12T10:02:24Z", "content": "Indian Premier League (IPL) franchise Kolkata Knight Riders (KKR) will now have a sister franchise in UAE’s flagship T20 league as the Knight Riders Group has acquired the rights to own and operate t… [+1682 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Knight Riders acquire Abu Dhabi franchise in UAE’s T20 League", "description": "The UAE’s T20 League is Emirates Cricket Board’s sanctioned, flagship professional T20 League.", "url": "https://indianexpress.com/article/sports/cricket/knight-riders-acquire-abu-dhabi-franchise-in-uaes-t20-league/", "urlToImage": "https://images.indianexpress.com/2022/05/Untitled-design-11-1.jpg", "publishedAt": "2022-05-12T10:02:24Z", "content": "Indian Premier League (IPL) franchise Kolkata Knight Riders (KKR)will now have a sister franchise in UAE’s flagship T20 league as the Knight Riders Group has acquired the rights to own and operate th… [+1523 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gangsters throw Molotov cocktails at police in Tamil Nadu, arrested", "description": "According to the police, on Wednesday morning, they visited an abandoned petroleum refinery at Periyakuppam in Cuddalore after being informed that the gang with the support of locals had engaged in the theft of scrap materials.", "url": "https://indianexpress.com/article/cities/chennai/gangsters-molotov-cocktails-police-tamil-nadu-7913488/", "urlToImage": "https://images.indianexpress.com/2022/05/crime-1.jpg", "publishedAt": "2022-05-12T09:56:56Z", "content": "Five members of a gang that allegedly hurled Molotov cocktails at police at an abandoned petroleum refinery in Tamil Nadus Cuddalore district were arrested on Thursday.According to the police, on Wed… [+1014 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Tata Sons appoints Campbell Wilson as CEO and MD of Air India", "description": "Campbell Wilson appointed as CEO and Managing Director of Air India: Tata Sons statement.", "url": "https://indianexpress.com/article/business/companies/campbell-wilson-appointed-air-india-ceo-md-tata-sons-7913494/", "urlToImage": "https://images.indianexpress.com/2022/01/air-india-express-photo-1200-1.jpg", "publishedAt": "2022-05-12T09:55:39Z", "content": "In 1953, Air India was nationalised and for the next over four decades it remained the prized possession for India, controlling the majority of the domestic airspace. (File express photo)Tata Sons on… [+463 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pranav Mukul", "title": "Tata Sons appoints Campbell Wilson as CEO and MD of Air India", "description": "Earlier this year, Tata Group had named Turkish Airlines Chairman Ilker Ayci as Air India's CEO & MD, but he subsequently denied the position.", "url": "https://indianexpress.com/article/business/aviation/campbell-wilson-appointed-air-india-ceo-md-tata-sons-7913494/", "urlToImage": "https://images.indianexpress.com/2022/05/Campbell-Wilson.jpg", "publishedAt": "2022-05-12T09:55:39Z", "content": "The Tata Group has appointed Campbell Wilson as CEO &amp; MD of Air India. Wilson is currently CEO of Singapore Airline’s low-cost subsidiary Scoot.Earlier this year, Tata Group had named Turkish Air… [+728 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Jharkhand govt suspends mining secy Pooja Singhal, held in money laundering case", "description": "The ED arrested Pooja Singhal in a case involving the alleged diversion of MGNREGA funds during her tenure as deputy commissioner in Khunti in 2009-2010.", "url": "https://indianexpress.com/article/india/jharkhand-govt-suspends-mining-secretary-pooja-singhal-arrested-in-money-laundering-case-7913414/", "urlToImage": "https://images.indianexpress.com/2022/05/FSYHcTAaAAANIkP.png", "publishedAt": "2022-05-12T09:55:37Z", "content": "The Jharkhand government Thursday suspended mining secretary Pooja Singhal, a day after she was arrested by the Enforcement Directorate (ED) in connection with its probe into a money laundering case.… [+1056 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Guru Prakash Paswan", "title": "Hindutva and Fascism: Attempt to put them in the same bracket is intended to insult the civilisational wisdom of our nation", "description": "The University Grants Commission has rightly initiated action against the setting of a question paper in a private university that targets the faith of the majority community.", "url": "https://indianexpress.com/article/opinion/columns/hindutva-and-fascism-attempt-to-put-them-in-the-same-bracket-is-intended-to-insult-the-civilisational-wisdom-of-our-nation-7913455/", "urlToImage": "https://images.indianexpress.com/2022/05/unnamed-file.png", "publishedAt": "2022-05-12T09:54:37Z", "content": "The unfortunate incident at Sharda University over the setting of a question paper is problematic at multiple levels. Linking Hindutva to Fascism has been one of the tried, tested and failed textbook… [+3284 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "New Mexico wildfire grows; California fire destroys mansions", "description": "More people in northern New Mexico are being warned they might have to flee as a wildfire heads toward mountain resort towns", "url": "https://indianexpress.com/article/world/new-mexico-california-wildfire-7913431/", "urlToImage": "https://images.indianexpress.com/2022/05/wildfire-1200.jpg", "publishedAt": "2022-05-12T09:53:03Z", "content": "The largest wildfire in the US was spreading toward mountain resort towns in northern New Mexico, prompting officials to issue another set of warnings for more people to evacuate.Meanwhile, a wildfir… [+5366 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Kangana Ranaut says she can’t get married because of rumours about her beating up men, Arjun Rampal quips ‘Soch samajhkar…’", "description": "Kangana Ranaut says that she's above the stage where she asks other Bollywood celebrities to root for her films and share the promotional videos on Instagram.", "url": "https://indianexpress.com/article/entertainment/bollywood/kangana-ranaut-rumours-getting-married-arjun-rampal-7912729/", "urlToImage": "https://images.indianexpress.com/2022/05/kangana-ranaut.jpg", "publishedAt": "2022-05-12T09:50:01Z", "content": "Actor Kangana Ranaut has never held back from expressing her disillusion with Bollywood celebrities, saying that they do not root for her in the same way she has rooted for many of them. During the r… [+1613 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "HashtagPolitics: Kiren Rijiju, P Chidambaram spar over sedition law", "description": "The Congress on Wednesday had hailed the Supreme Court’s decision to put on hold the sedition law, saying a clear cut message has gone to subjugators of dissent that “you can no longer suppress the voice of truth” and those critical of the government must be …", "url": "https://indianexpress.com/article/india/political-pulse/hashtagpolitics-kiren-rijiju-p-chidambaram-sedition-law-7913416/", "urlToImage": "https://images.indianexpress.com/2022/05/Rijiju-vs-Chidambaram.jpg", "publishedAt": "2022-05-12T09:48:09Z", "content": "Union Law Minister Kiren Rijiju, while hitting out at Senior Congress leader P Chidambaram over his remarks regarding Section 124 A, said that while the UPA government had the worst track record when… [+2283 chars]"}]}