{"status": "ok", "totalResults": 551, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Yogesh Naik", "title": "Lata Mangeshkar foundation to be launched today, to build old-age home for artists", "description": "Lata Mangeshkar’s niece Rachana Khadikar Shah said, “This foundation will further begin the work to build an old-age home primarily for those artists who are left to their peril in the evening of their lives.”", "url": "https://indianexpress.com/article/cities/mumbai/lata-mangeshkar-foundation-to-be-launched-today-to-build-old-age-home-for-artists-8026321/", "urlToImage": "https://images.indianexpress.com/2022/07/lata-mangeshkar-1200.jpg", "publishedAt": "2022-07-13T06:39:03Z", "content": "The Swar Mauli Foundation, a dream project of Lata Mangeshkar, will be launched Wednesday on the occasion of Guru Poornima, a relative of the legendary singer said.Speaking to The Indian Express, Lat… [+1295 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Pune: Rain continues, water storage in Mutha river dams rises to 12.23 TMC", "description": "Heavy rainfall in catchment areas of Panshet, Varasgaon, Temghar and Khadakwasla dams leads to increased water storage. Water from Khadakwasla dam released into Mutha river.", "url": "https://indianexpress.com/article/cities/pune/pune-rains-weather-monsoon-water-storage-damn-tmc-8026287/", "urlToImage": "https://images.indianexpress.com/2022/07/pune-rains-dam.jpg", "publishedAt": "2022-07-13T06:38:20Z", "content": "With Pune district continuing to witness heavy rain, the water storage in the catchment areas of all four dams upstream of Mutha river has now increased to 12.23 TMC as of Wednesday morning. Last yea… [+1075 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Dior withdraws Valentino compensation demand over glitzy Rome show, source says", "description": "Citing a letter from Dior, the source familiar with the matter said the French label was backing down \"in light of the friendly relationship between the two Maisons\".", "url": "https://indianexpress.com/article/lifestyle/fashion/dior-withdraws-valentino-compensation-demand-over-glitzy-rome-show-source-says-8026100/", "urlToImage": "https://images.indianexpress.com/2022/07/Reutersfashion-rome-valentino-dior.jpg", "publishedAt": "2022-07-13T06:30:39Z", "content": "LVMH-owned Dior has withdrawn a request for 100,000 euros in compensation from rival fashion label Valentino for allegedly blocking access to its Rome store with a celebrity-packed runway show on the… [+1295 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "YouTuber Gaurav Taneja shares photo from controversial birthday party, makes light of his arrest", "description": "Gaurav Taneja runs a YouTube channel that has over 75 lakh subscribers. He was recently arrested for celebrating his birthday inside a Noida metro coach, and was later released on bail.", "url": "https://indianexpress.com/article/entertainment/entertainment-others/youtuber-gaurav-taneja-photo-controversial-birthday-party-light-of-his-arrest-8026123/", "urlToImage": "https://images.indianexpress.com/2022/07/taneja1200.jpg", "publishedAt": "2022-07-13T06:24:11Z", "content": "Popular YouTuber Gaurav Taneja, also known to his fans as Flying Beast, recently took to his social media to make light of the fact that he was arrested for celebrating his birthday inside a Noida me… [+1986 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Petrol Diesel Prices Today: Check fuel rates in Mumbai, Delhi and other cities", "description": "Petrol-Diesel Rates Today (July 13): In Mumbai, petrol retails at Rs 111.35 per litre, while diesel costs Rs 97.28 per litre. In Delhi, petrol is available for Rs 96.72 per litre, while diesel costs Rs 89.62 per litre. Read further to check out fuel rates in …", "url": "https://indianexpress.com/article/business/commodities/petrol-diesel-prices-today-july-13-2022-delhi-mumbai-chennai-bengaluru-8026148/", "urlToImage": "https://images.indianexpress.com/2022/07/petrol-diesel-price-reuters-1200-1.jpeg", "publishedAt": "2022-07-13T06:18:58Z", "content": "Fuel Prices Today Latest Updates: The prices of petrol and diesel remained unchanged across the nation for the 52nd consecutive day on Wednesday, July 13, 2022.In Mumbai, petrol is available for Rs 1… [+2261 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "BJP only national party today, others reduced to families, individuals: JP Nadda", "description": "Being a national party, the BJP works on national interests and fulfilling local aspirations, he told the Rajasthan state BJP training camp at Mount Abu in Sirohi district.", "url": "https://indianexpress.com/article/cities/jaipur/bjp-only-national-party-today-others-reduced-to-families-individuals-jp-nadda-8026258/", "urlToImage": "https://images.indianexpress.com/2022/07/FXeckW-akAA-5Wv.jpeg", "publishedAt": "2022-07-13T06:15:05Z", "content": "The BJP is the only national party in India today as other parties have been reduced to just families and individuals, BJP president JP Nadda said Tuesday.Being a national party, the BJP works on nat… [+2313 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pune city receives over 100 mm rainfall in two days, more spells predicted today", "description": "The IMD has forecast that rainfall activity will peak today and will continue over Pune and Maharashtra for another 48 hours.", "url": "https://indianexpress.com/article/cities/pune/pune-rains-weather-news-imd-forecast-monsoons-8026254/", "urlToImage": "https://images.indianexpress.com/2022/07/pune-rains-1.jpg", "publishedAt": "2022-07-13T06:13:10Z", "content": "The India Meteorological Department (IMD) Wednesday warned of moderate to intense rain spells over Pune city and district. The Nowcast warning lasting till 12 pm was issued on Wednesday morning. For … [+1567 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Karan Mehra reunites with his Yeh Rishta Kya Kehlata Hai co-stars, fans ask ‘where is Hina Khan?’", "description": "Karan Mehra essayed the lead role of Naitik Singhania in the longest-running show on Indian television, Yeh Rishta Kya Kehlata Hai. He was paired opposite Hina Khan in the show.", "url": "https://indianexpress.com/article/entertainment/television/karan-mehra-reunites-yeh-rishta-kya-kehlata-hai-co-stars-fans-wanted-hina-khan-to-join-too-see-photos-8026151/", "urlToImage": "https://images.indianexpress.com/2022/07/karan-mehra.jpg", "publishedAt": "2022-07-13T06:10:24Z", "content": "Television actor Karan Mehra, who essayed the role of Naitik Singhania in the popular Hindi daily, Yeh Rishta Kya Kehlata Hai for almost eight years, had a reunion with his co-actors from the show. H… [+1480 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "Stranger saves family from house fire; camera captures heroic moment", "description": "Josh Ellis and his wife Brittany Downing were watching Stranger Things as their eight kids were sleeping on July 5. The family was unaware that a fire had erupted in their garage.", "url": "https://indianexpress.com/article/trending/trending-globally/stranger-saves-family-from-house-fire-8026234/", "urlToImage": "https://images.indianexpress.com/2022/07/Stranger-helps-family.jpg", "publishedAt": "2022-07-13T06:07:18Z", "content": "A family was saved from a fire at their house after a woman who was passing by knocked at their door to alert them. Moss Strong had spotted the fire a mile away while she was driving by the familys h… [+1324 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Kannada actor Shivaranjan Bolannavar shot at, escapes unhurt Belagavi", "description": "Kannada actor Shivaranjan Bolannavar has escaped an attempt on his life.", "url": "https://indianexpress.com/article/entertainment/regional/kannada-actor-shivaranjan-bolannavar-shot-at-escapes-unhurt-belagavi-8026200/", "urlToImage": "https://images.indianexpress.com/2022/07/Shivaranjan-Bolannavar.jpeg", "publishedAt": "2022-07-13T06:06:19Z", "content": "Kannada actor Shivaranjan Bolannavar escaped unhurt when unknown assailants fired three rounds at him near his residence in Bailhongal and fled, police said on Wednesday. “The actor was the target, b… [+680 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Careers Desk", "title": "UPPSC PCS Mains 2021 result declared; here’s how to check", "description": "UPPSC PCS mains exams were conducted from March 23 to March 27 in subjective mode. A total of 5957 candidates had appeared in the exam out of which 1285 have qualified who will now appear for the interview.", "url": "https://indianexpress.com/article/jobs/uppsc-pcs-mains-2021-result-declared-how-to-check-sarkari-result-uppsc-up-nic-in-8026224/", "urlToImage": "https://images.indianexpress.com/2019/12/uppsc.jpg", "publishedAt": "2022-07-13T06:04:47Z", "content": "UPPSC PCS Mains result: Uttar Pradesh Public Service Commission (UPPSC) Tuesday declared the results of Provincial Civil Service (PCS) mains exam 2021. The result has been declared in the form of pdf… [+842 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "YouTube Premium brings Picture-in-Picture mode to all iPhone, iPad users", "description": "The PiP feature lets users watch a supported YouTube video in a small, minimised floating window that can be resized and moved around.", "url": "https://indianexpress.com/article/technology/tech-news-technology/youtube-premium-brings-picture-in-picture-mode-to-all-iphone-ipad-users-8026202/", "urlToImage": "https://images.indianexpress.com/2022/07/YouTube-Picture-in-Picture.jpg", "publishedAt": "2022-07-13T06:04:44Z", "content": "Apple’s iPhone and iPad users across the globe will now be able to enjoy the video streaming app with its popular PiP (Picture-in-Picture) feature. This lets users watch videos while accessing other … [+1527 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "India trump Pakistan in latest ICC ODI Team Rankings", "description": "India could stretch their lead even further with the two remaining ODIs against England and the three-match series against West Indies later this month.", "url": "https://indianexpress.com/article/sports/cricket/india-trump-pakistan-in-latest-icc-odi-team-rankings-8026236/", "urlToImage": "https://images.indianexpress.com/2022/06/SA-IND-5.jpg", "publishedAt": "2022-07-13T06:03:49Z", "content": "India have moved to the third spot, surpassing Pakistan in the ICC ODI Team Rankings after their emphatic win in the first game of the three-match series against England at The Oval. India were place… [+1002 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "UG admissions: Wait for CBSE Class 12 results, UGC tells universities", "description": "“It has come to the notice that some universities have started registration in UG courses for the season 2022-23. In this scenario, the students from CBSE will be deprived of admission in the undergraduate courses if the last date is fixed by the universities…", "url": "https://indianexpress.com/article/education/ug-admissions-cbse-class-12-results-ugc-universities-8026205/", "urlToImage": "https://images.indianexpress.com/2022/07/UGC-2.jpeg", "publishedAt": "2022-07-13T06:03:09Z", "content": "The University Grants Commission (UGC) has directed universities to fix the last date of undergraduate admissions after the declaration of CBSE Class 12 results.On June 28, the CBSE approached the UG… [+1447 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Ananthakrishnan G", "title": "Explained: The Abu Salem extradition case, its background, and what SC has said", "description": "The Supreme Court has said the Centre is bound to release gangster Abu Salem after he has served 25 years in prison, in keeping with the sovereign assurance given by the Government of India to Portugal from where he was extradited. A look at the ruling, and i…", "url": "https://indianexpress.com/article/explained/abu-salem-extradition-case-background-supreme-court-verdict-explained-8026163/", "urlToImage": "https://images.indianexpress.com/2022/07/Abu-Salem.jpg", "publishedAt": "2022-07-13T06:02:32Z", "content": "The Supreme Court on Monday (July 11) said the central government is bound to advise the President to exercise his powers of remission to release gangster and 1993 Bombay serial blasts convict Abu Sa… [+8135 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mumbai student on a picnic in Lonavala drowns in waterfall", "description": "Officials at the Lonavala town police station said the deceased has been identified as Sahil Saroj, 20, a resident of Santacruz.", "url": "https://indianexpress.com/article/cities/pune/mumbai-student-on-a-picnic-in-lonavala-drowns-in-waterfall-8026211/", "urlToImage": "https://images.indianexpress.com/2022/07/DROWN.jpg", "publishedAt": "2022-07-13T06:01:39Z", "content": "A student from Mumbai, who had come for a picnic to Lonavala with a group of other students, drowned near a waterfall near the Bhushi dam Monday evening and his body was recovered Tuesday afternoon, … [+710 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "‘Losing weight is easy for me, putting it on is hard’: Ranbir Kapoor opens up about his transformation for ‘Shamshera’", "description": "Calling it an \"occupational hazard\", Ranbir admitted to finding this \"whole bodybuilding business\" extremely complicated", "url": "https://indianexpress.com/article/lifestyle/fitness/ranbir-kapoor-physical-transformation-shamshera-bodybuilding-8023902/", "urlToImage": "https://images.indianexpress.com/2022/07/ranbir-1200.jpg", "publishedAt": "2022-07-13T06:00:11Z", "content": "Dad-to-be Ranbir Kapoor, who is all set to make a comeback after four years with Shamshera, surprised everyone with his rugged look in the film trailer — which is far removed from his otherwise boy-n… [+1843 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "SC to hear next week pleas against Karnataka HC order refusing to lift ban on hijab", "description": "A bench comprising Chief Justice N V Ramana and Justices Krishna Murari and Hima Kohli took note of the submissions of lawyer Prashant Bhushan that the matters were filed long back but were yet to be listed for hearing.", "url": "https://indianexpress.com/article/india/sc-to-hear-next-week-pleas-against-karnataka-hc-order-refusing-to-lift-ban-on-hijab-8026219/", "urlToImage": "https://images.indianexpress.com/2022/07/hijab-ban-5.jpeg", "publishedAt": "2022-07-13T05:59:33Z", "content": "The Supreme Court on Wednesday agreed to hear next week a batch of pleas challenging the Karnataka High Court verdict refusing to lift the ban on hijab in educational institutions of the state.Appeal… [+596 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "How to save an ancient, giant tree from a wildfire", "description": "In the past several days, however, the Grizzly Giant has been threatened by the Washburn fire, which has torn through more than 3,000 acres of brush and timber in the southern part of the national park, and prompted evacuation orders for the tourist-driven co…", "url": "https://indianexpress.com/article/world/how-to-save-ancient-giant-tree-wildfire-8026208/", "urlToImage": "https://images.indianexpress.com/2022/07/forest-fire.jpg", "publishedAt": "2022-07-13T05:57:12Z", "content": "More than a century ago, naturalist John Muir took President Theodore Roosevelt to camp beneath an ancient, gnarled tree in Yosemite National Park.\r\nThe tree, known as the Grizzly Giant, was more tha… [+5020 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Maldivian Parliament Speaker Nasheed negotiated President Rajapaksa’s escape from Sri Lanka: Sources", "description": "The Maldivian government's argument is that Gotabaya Rajapaksa is still the President of Sri Lanka, and that he hasn't resigned or handed over his powers to a successor.", "url": "https://indianexpress.com/article/world/sri-lanka-president-gotabaya-rajapaksa-escape-maldives-8026191/", "urlToImage": "https://images.indianexpress.com/2022/07/gotabaya-wife.jpg", "publishedAt": "2022-07-13T05:52:30Z", "content": "The 73-year-old President fled to the Maldives along with his wife and two security officers on a military jet early Wednesday in the face of a public revolt against his government for mishandling th… [+2313 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Raj govt will study recruitment examination models of Kerala & Tamil Nadu: Gehlot", "description": "Speaking on the occasion, Gehlot said recruitment examinations are being conducted by the government with secrecy, yet incidents of paper leaks have happened but such problems will be resolved soon.", "url": "https://indianexpress.com/article/cities/jaipur/raj-govt-will-study-recruitment-examination-models-of-kerala-tamil-nadu-gehlot-8026194/", "urlToImage": "https://images.indianexpress.com/2022/07/ashok-1.jpg", "publishedAt": "2022-07-13T05:52:19Z", "content": "The Rajasthan government will study recruitment examination models of Kerala and Tamil Nadu for smooth conduct of such tests in the state, Chief Minister Ashok Gehlot said here on Tuesday.He said a h… [+812 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "New Brahmastra video introduces ‘secret society’ of sages, makes Ranbir Kapoor’s movie sound a lot like Marvel’s Eternals", "description": "Ayan Mukerji has shared a new video that introduces audiences to the lore of his upcoming fantasy epic, Brahmastra, starring Ranbir Kapoor, Alia Bhatt and Amitabh Bachchan.", "url": "https://indianexpress.com/article/entertainment/bollywood/new-brahmastra-makes-ranbir-kapoor-movie-sound-like-marvel-eternals-8026139/", "urlToImage": "https://images.indianexpress.com/2022/07/brahmastra-video.jpg", "publishedAt": "2022-07-13T05:51:29Z", "content": "On the occasion of Guru Purnima on Wednesday, director Ayan Mukerji has shared a new behind-the-scenes featurette introducing audiences to the lore of his upcoming film, Brahmastra. The fantasy epic … [+2147 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sriram Veera", "title": "The death of bilateral ODI cricket is here. With South Africa’s withdrawal of ODI series with Australia due to their new T20 franchise league, the economics of cricket has spoken", "description": "With South Africa willing to put their direct qualification to the next year’s ODI world cup at risk by their withdrawal, the future of cricket’s monogamous relationship with T20 Franchise leagues is loud and clear.", "url": "https://indianexpress.com/article/sports/cricket/south-africas-withdrawal-of-odi-series-with-australia-due-to-their-new-t20-franchise-league-the-economics-of-cricket-has-8026165/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-14-2.jpg", "publishedAt": "2022-07-13T05:43:21Z", "content": "The end of bilateral cricket series, especially in ODIs, is here. South Africa have withdrawn from their ODI series in Australia as it clashes with their new T20 franchise league. With the mushroomin… [+4115 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Debraj Deb", "title": "Tripura Police train staff in drone technology to boost digital surveillance", "description": "KTD Singh Police Training Academy organised the training, along with the state forensic science lab and National Forensic sciences University, at the Tripura State Rifles (TSR) 2nd battalion headquarters in RK Nagar, in the outskirts of Agartala.", "url": "https://indianexpress.com/article/india/tripura-police-train-staff-in-drone-technology-to-boost-digital-surveillance-8026098/", "urlToImage": "https://images.indianexpress.com/2022/07/tripura-drone1.jpg", "publishedAt": "2022-07-13T05:38:20Z", "content": "The Tripura Police Tuesday held drone surveillance training for personnel of the state police, Border Security Force (BSF) and other security agencies in collaboration with state forensic science lab… [+1807 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "NYT", "title": "Hard Truths From Mo Farah Put Spotlight on U.K.’s Hard-line Migration Policy", "description": "McNeil said he doubted that the outpouring of reaction to Farah’s story would affect the government’s policy of transferring asylum-seekers to Rwanda.", "url": "https://indianexpress.com/article/sports/hard-truths-from-mo-farah-put-spotlight-on-u-k-s-hard-line-migration-policy-8026159/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-13-2.jpg", "publishedAt": "2022-07-13T05:35:25Z", "content": "The harrowing revelation by Mo Farah, the Olympic track and field star, that he was trafficked to Britain as a young child has reverberated widely in his adopted country, where immigration remains a … [+7344 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Greater Chennai Corporation fines 87 parks for lack of maintenance", "description": "Maintenance works on 571 of the 738 parks under the corporation's jurisdiction have been given to private contractors on a contract basis.", "url": "https://indianexpress.com/article/cities/chennai/greater-chennai-corporation-fines-87-parks-for-lack-of-maintenance-8026160/", "urlToImage": "https://images.indianexpress.com/2022/07/parks-1.jpeg", "publishedAt": "2022-07-13T05:33:21Z", "content": "The Greater Chennai Corporation on Tuesday fined 87 parks for a combined sum of Rs 1,35,590 due to lack of maintenance. In a press release, the corporation noted that 18 contractors were fined Rs 28,… [+327 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Markets bounce back after 2-day fall", "description": "Among the Sensex constituents, Hindustan Unilever, Asian Paints, Bajaj Finserv, Power Grid, Larsen & Toubro and Bajaj Finance were the major gainers.", "url": "https://indianexpress.com/article/business/economy/markets-bounce-back-after-2-day-fall-8026153/", "urlToImage": "https://images.indianexpress.com/2022/07/sensex-1-1.jpg", "publishedAt": "2022-07-13T05:32:11Z", "content": "Benchmark indices bounced back on Wednesday after two days of decline with the Sensex climbing 324.61 points in early trade amid positive trends in Asian markets.The 30-share BSE Sensex opened on a p… [+1446 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Rupee almost flat against US dollar in early trade", "description": "On the domestic equity front, the 30-share Sensex was trading 206.14 points or 0.38 per cent higher at 54,092.75, while the broader NSE Nifty rose 61.65 points or 0.38 per cent to 16,119.95.", "url": "https://indianexpress.com/article/business/rupee-almost-flat-against-us-dollar-in-early-trade-8026156/", "urlToImage": "https://images.indianexpress.com/2022/07/sensex-1.jpg", "publishedAt": "2022-07-13T05:31:08Z", "content": "The rupee started the session on a flat note against the US dollar on Wednesday amid a rally in the equity markets and easing retail inflation.A strong greenback against major currencies and foreign … [+1641 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "JEE Main 2022: Coimbatore girl Deeksha Dhiwakar is Tamil Nadu topper, says followed teacher’s advice religiously", "description": "JEE Main 2022 Tamil Nadu topper Deeksha Dhiwakar scored 100 in Physics, 99.98 in Chemistry, and 99.97 in Mathematics in her first attempt.", "url": "https://indianexpress.com/article/education/jee-main-2022-coimbatore-girl-deeksha-dhiwakar-tamil-nadu-topper-8026152/", "urlToImage": "https://images.indianexpress.com/2022/07/JEE-main-TN-topper.jpg", "publishedAt": "2022-07-13T05:30:25Z", "content": "Deeksha Dhiwakar from Coimbatore in Tamil Nadu secured the 99.99 percentile in JEE Main 2022 for admissions to engineering colleges across the country.Speaking to indianexpress.com, Dhiwakar said the… [+1514 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Sonam Kapoor-Anand Ahuja to host grand baby shower, video of customised invites goes viral. Watch", "description": "Sonam Kapoor and Anand Ahuja will host a baby shower from their Bollywood friends in London for their close friends and a few family members.", "url": "https://indianexpress.com/article/entertainment/bollywood/sonam-kapoor-anand-ahuja-to-host-grand-baby-shower-video-of-customised-invites-goes-viral-watch-8026054/", "urlToImage": "https://images.indianexpress.com/2022/07/sonam-kapoor-anand-ahuja-1.jpg", "publishedAt": "2022-07-13T05:24:21Z", "content": "Bollywood actor Sonam Kapoor and her husband Anand Ahuja are all set to host their second baby shower, this time in India. The couple threw a baby shower in London that was attended by her closest fr… [+1969 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Fix the last date of undergraduate admissions after declaration of CBSE Class 12 results: UGC tells universities", "description": "UGC's advisory comes after CBSE flagged that many versities had started admissions to undergraduate programmes without waiting for the announcement of its Class 12 Board results.", "url": "https://indianexpress.com/article/education/fix-last-date-of-undergraduate-admissions-after-cbse-class-12-results-ugc-universities-8026117/", "urlToImage": "https://images.indianexpress.com/2022/06/UGC-2.jpg", "publishedAt": "2022-07-13T05:22:26Z", "content": "Higher education regulator University Grants Commission (UGC) has directed universities to fix the last date of undergraduate admissions after declaration of CBSE class 12 results.On June 28, the CBS… [+3974 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Watch: This viral recipe for ice pizza has left netizens puzzled", "description": "\"Showed this to my Italian friend, he died,\" a user wrote", "url": "https://indianexpress.com/article/lifestyle/food-wine/ice-pizza-recipe-viral-video-8004641/", "urlToImage": "https://images.indianexpress.com/2022/07/pizza_1200_getty.jpg", "publishedAt": "2022-07-13T05:20:37Z", "content": "If you are on social media, you would have definitely come across some bizarre food videos that left you scratching your head. The latest addition to such food experiments is the ‘ice pizza’. Yes, yo… [+1347 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi sees less than 2,000 active Covid cases for two days in a row", "description": "The low number of active cases, and daily incidence, also coincide with fewer tests being conducted.", "url": "https://indianexpress.com/article/cities/delhi/delhi-sees-less-than-2000-active-covid-cases-for-two-days-in-a-row-8026101/", "urlToImage": "https://images.indianexpress.com/2022/07/Basavaraj-Bommai-2-1-1-1-1.jpg", "publishedAt": "2022-07-13T05:13:53Z", "content": "Delhi has seen less than 2,000 active cases of Covid-19 or those with current infection for two days in a row, according to the daily health bulletin released by the government. There were 1,960 acti… [+1659 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Man stabbed to death in Rajasthan", "description": "There might be some monetary dispute between them but it would be clear after the accused is arrested, Station House Officer, Mangroop, Moti Lal said.", "url": "https://indianexpress.com/article/cities/jaipur/man-stabbed-to-death-in-rajasthan-8026116/", "urlToImage": "https://images.indianexpress.com/2022/07/STAB.jpeg", "publishedAt": "2022-07-13T05:11:52Z", "content": "A 35-year-old grocery shop owner was stabbed to death in Rajasthan’s Bhilwara district on Tuesday night, police said.Station House Officer, Mangroop, Moti Lal said Sanjay Somani and Rahul Raiger were… [+516 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Kareena Kapoor treats us with Taimur’s ‘first’ cricket outing photos as he attends India vs England match in London", "description": "Kareena Kapoor Khan and Saif Ali Khan's son Taimur Ali Khan got to see his 'first' match and it was India vs England.", "url": "https://indianexpress.com/article/entertainment/bollywood/taimur-ali-khan-first-cricket-match-photos-india-vs-england-london-saif-kareena-share-photos-8025912/", "urlToImage": "https://images.indianexpress.com/2022/07/taimur-saif-1200.jpg", "publishedAt": "2022-07-13T05:10:18Z", "content": "The Pataudi family is having a gala time in London and the trip was made even more special as Kareena Kapoor Khan and Saif Ali Khan’s elder child Taimur Ali Khan got to see his first match and it was… [+1250 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "দু’বছর পরেও নতুন করে ভাবাচ্ছে করোনা, নয়া স্ট্রেন নিয়ে উদ্বেগ WHO প্রধানের", "description": "WHO প্রধান বলেন, ভারত সহ একাধিক দেশে করোনার বাড়বাড়ন্ত নিয়ে আমি উদ্বিগ্ন!", "url": "https://bengali.indianexpress.com/general-news/two-years-later-covid-19-is-nowhere-near-over-warns-who-chief-468455/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/cats-69.jpg", "publishedAt": "2022-07-13T05:06:13Z", "content": ", - BA.2.75-  \r\n ()       \r\nWHO , ! \r\n : [ , ]\r\nBA.4 BA.5 , , \r\n , \r\nStay updated with the latest news headlines and all the latest General news download Indian Express Bengali App.\r\nWeb Title: Two y… [+55 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Saurabh Parashar", "title": "Birdwatch: Grey-headed swamphen or purple swamphen is known for its unique plumage", "description": "The sighting of a pair of purple swamphens chasing each other on the widespread leaves in water bodies is unforgettable. I sighted at least three fully grown pairs of purple swamphens on the banks of Mottemajra on a sunny day in January this year.", "url": "https://indianexpress.com/article/chandigarh/birdwatch-grey-headed-swamphen-or-purple-swamphen-is-known-for-its-unique-plumage-8026096/", "urlToImage": "https://images.indianexpress.com/2022/07/IMG_9857.jpg", "publishedAt": "2022-07-13T05:03:59Z", "content": "The grey-headed swamphen, also known as a purple swamphen, is a waterbird with a red bill and forehead shield. It is a resident bird found commonly in the margins of lakes, ponds, and small water bod… [+1391 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rohan Naahar", "title": "Ms Marvel: How the MCU show uses music as a balm for the pain of Partition, Indo-Pak tensions", "description": "No matter how cynical you’ve become, the sight of a Pakistani-American superhero rubbing shoulders (potentially) with the Avengers seems almost unreal. And its deft use of music, a la Coke Studio, makes it an experience that crosses borders", "url": "https://indianexpress.com/article/entertainment/web-series/ms-marvel-mcu-partition-indo-pak-tensions-8026076/", "urlToImage": "https://images.indianexpress.com/2022/07/MsMarvel_DW1200.jpg", "publishedAt": "2022-07-13T05:03:25Z", "content": "On the most difficult days the days on which you can sense the moral fabric of our nation being ripped apart the best thing you can do is to play a popular Coke Studio Pakistan video and scroll throu… [+6061 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi: Man attacks policemen with shaving razor in Dwarka, arrested", "description": "When the policemen caught the accused, he allegedly assaulted them with the razor. Jitender was injured on the head while Mukesh suffered injuries to his hand.", "url": "https://indianexpress.com/article/delhi/delhi-man-attacks-policemen-with-shaving-razor-in-dwarka-arrested-8026078/", "urlToImage": "https://images.indianexpress.com/2022/07/Delhi-Police-1-2.jpg", "publishedAt": "2022-07-13T04:55:08Z", "content": "Two Delhi Police head constables were injured while arresting a man who was chasing another person with a shaving razor in the Capitals Dwarka area Tuesday, said officials.They said that head constab… [+1059 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Priyanka Chopra feels ‘blessed’ to have mother-in-law Denise Jonas in her life, promises to always be there for brother Siddharth Chopra", "description": "Priyanka Chopra took to Instagram to wish a happy birthday to her brother Siddharth and her mother-in-law Denise.", "url": "https://indianexpress.com/article/entertainment/bollywood/priyanka-chopra-mother-in-law-denise-jonas-brother-siddharth-chopra-birthday-posts-8025994/", "urlToImage": "https://images.indianexpress.com/2022/07/priyanka-chopra-denise-jonas.jpg", "publishedAt": "2022-07-13T04:52:47Z", "content": "Priyanka Chopra on late Tuesday evening took to Instagram to wish her brother, Siddharth Chopra, and mother-in-law Denise Jonas a happy birthday. Tagging them in pictures on Instagram, Priyanka made … [+1509 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Chetan Nayak", "title": "‘DearNothing’ controversy: Why Nothing’s South Indian fanbase is unhappy", "description": "Here's why '#DearNothing' has been trending on Twitter and why many users in Southern states of India are unhappy with the London-based startup.", "url": "https://indianexpress.com/article/technology/social/dearnothing-controversy-twitter-what-happened-backlash-nothing-phone-1-8026018/", "urlToImage": "https://images.indianexpress.com/2022/07/Nothing-phone-1-Nothing-white.jpg", "publishedAt": "2022-07-13T04:52:11Z", "content": "Hours after London-based startup Nothing launched its phone (1), the hashtag #DearNothing began quickly trending in India. Unrelated to the smartphones sale, launch event or specifications, the hasht… [+2877 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "MCD issues four new control room numbers for East Delhi residents", "description": "Citizens can now call on 66667391, 66667392, 66667393 and 66667394 for any of their complaints/problems and suggestions.", "url": "https://indianexpress.com/article/cities/delhi/mcd-new-control-room-east-delhi-8026064/", "urlToImage": "https://images.indianexpress.com/2022/07/Delhi-MCD.jpeg", "publishedAt": "2022-07-13T04:50:41Z", "content": "The Municipal Corporation of Delhi (MCD) at Shahdara South Zone has issued four new control room numbers for the convenience of the citizens after its headquarters were shifted, said officials Wednes… [+756 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Karnataka government cancels nominations to boards and corporations", "description": "According to BJP sources, this move is also to pacify disgruntled leaders who have been waiting for the cabinet expansion.", "url": "https://indianexpress.com/article/cities/bangalore/karnataka-government-cancels-nominations-to-boards-and-corporations-8026046/", "urlToImage": "https://images.indianexpress.com/2022/07/Basavaraj-Bommai-2-1-1-1.jpg", "publishedAt": "2022-07-13T04:49:51Z", "content": "The Karnataka Government has cancelled nominations of heads to state-owned boards, corporations, and authorities, following the direction of Chief Minister Basavaraj Bommai Tuesday, in order to give … [+946 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Watch Umesh Yadav’s ripper to snare his first wicket for Middlesex against Worcestershire", "description": "Umesh Yadav conceded 25 runs in 9 overs and finished the day with an economy rate of 2.77.", "url": "https://indianexpress.com/article/sports/cricket/watch-umesh-yadavs-ripper-to-snare-his-first-wicket-for-middlesex-against-worcestershire-in-county-division-2-8026026/", "urlToImage": "https://images.indianexpress.com/2022/07/umesh-yadav.jpg", "publishedAt": "2022-07-13T04:46:32Z", "content": "Indian speedster Umesh Yadav scalped his maiden wicket in the County Championship for Middlesex against Worcestershire. He took the wicket of Taylor Cornall to start off his County stint.Yadav has be… [+969 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Khaled Hosseini’s daughter comes out as transgender; author says ‘never been prouder of her’", "description": "\"I will be by her side every step of the way, as will our family. We stand behind her,\" the author wrote", "url": "https://indianexpress.com/article/lifestyle/life-style/khaled-hosseini-daughter-haris-comes-out-transgender-8026006/", "urlToImage": "https://images.indianexpress.com/2022/07/Khaled-Hosseini-daughter-coming-out-1200.jpg", "publishedAt": "2022-07-13T04:30:35Z", "content": "Khaled Hosseini, an Afghan-American novelist, who has written books like ‘The Kite Runner‘ and ‘A Thousand Splendid Suns‘ took to his social media account to announce that his daughter, Haris, has co… [+2173 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gurgaon: Desilting of master stormwater drains underway to curb waterlogging during monsoon", "description": "Officials said debris, fallen leaves, garbage, silt and other foreign particles tend to clog drains which inhibit the free flow of stormwater during the monsoon leading to waterlogging.", "url": "https://indianexpress.com/article/cities/delhi/gurgaon-desilting-stormwater-drains-underway-waterlogging-monsoon-8025999/", "urlToImage": "https://images.indianexpress.com/2022/07/flooding-highway-1.jpg", "publishedAt": "2022-07-13T04:24:25Z", "content": "The Gurugram Metropolitan Development Authority (GMDA) Tuesday said it was carrying out extensive work pertaining to desilting of the citys master stormwater drains along with regular cleaning of wat… [+1480 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "ব্রেন ডেড রোগীর শরীরে বসল শূকরের হৃৎপিণ্ড, নজির গড়লেন চিকিৎসকরা", "description": "ভবিষ্যতের চিকিৎসা বিজ্ঞানের ক্ষেত্রে এক নতুন দরজা খুলে দিতে পারে এই সাফল্য", "url": "https://bengali.indianexpress.com/general-news/two-pig-heart-transplants-succeed-in-brain-dead-recipients-468442/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/cats-68.jpg", "publishedAt": "2022-07-13T04:24:20Z", "content": "Doctors transplanted genetically modified pig hearts into two brain dead patients at NYU Langone Health, the researchers announced Tuesday, in an encouraging step for the growing medical field months… [+135 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Baseless, speculative: India denies reports that it helped Sri Lanka President flee to Maldives", "description": "In a brief statement, the Sri Lankan Air Force said that under the Constitution granted to an Executive President, Rajapaksa was flown to the Maldives onboard an Air Force plane Wednesday morning.", "url": "https://indianexpress.com/article/world/gotabaya-rajapaksa-maldives-sri-lanka-india-denies-reports-8026011/", "urlToImage": "https://images.indianexpress.com/2022/07/rajapaksa.jpg", "publishedAt": "2022-07-13T04:21:01Z", "content": "Hours after Sri Lankas President Gotabaya Rajapaksa fled the country with his wife amid widespread protests sparked by a crippling economic crisis, India on Wednesday categorically denied “baseless a… [+2072 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aranya Shankar", "title": "St Stephen’s, AUD College of Art admissions in limbo over court tussles with DU", "description": "Delhi University has challenged the admission process of the two colleges, but for different reasons, in the High Court. Both matters will be heard this week.", "url": "https://indianexpress.com/article/education/st-stephens-aud-college-of-art-admissions-in-limbo-over-court-tussles-with-du-8025990/", "urlToImage": "https://images.indianexpress.com/2022/07/Campis-season.jpg", "publishedAt": "2022-07-13T04:12:15Z", "content": "The 2022-23 academic years admission process for St Stephens College in Delhi University (DU) and Ambedkar University Delhis (AUD) College of Art (CoA) which was earlier under DU could be affected as… [+3348 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Who is Watkinson, the PE teacher who saved the Olympic champion Mo Farah’s life?", "description": "Farah has said that without Watkinson’s help and mentorship, he wouldn’t have been able to erase the trauma of trafficking or recognised he could run", "url": "https://indianexpress.com/article/sports/sport-others/who-is-watkinson-the-pe-teacher-who-saved-the-olympic-champion-mo-farahs-life-8025964/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-13-2.jpg", "publishedAt": "2022-07-13T04:12:11Z", "content": "If it wasn’t for [my PE teacher] Alan [Watkinson] who supported me throughout my childhood then maybe I wouldn’t even have the courage to do this. Mo Farah, who opened up about being illegally traffi… [+4112 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "নয়া অশোক স্তম্ভের সিংহ ‘হিংস্র’! বিরোধীদের জবাব দিতে আসরে কেন্দ্র", "description": "প্রধানমন্ত্রী নরেন্দ্র মোদীর বিরুদ্ধে দেশের জাতীয় প্রতীক অবমাননার অভিযোগে সরগরম জাতীয় রাজনীতি।", "url": "https://bengali.indianexpress.com/general-news/opposition-says-emblem-distorted-hardeep-puri-counters-perfect-replica-468436/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/National-Emblem-1.jpg", "publishedAt": "2022-07-13T04:07:44Z", "content": "? - , , \r\n , “ , . . , , , ”\r\n, , , , , , \r\nExplained: , - ?\r\n , “ ! , ” , “ , ! , , , , , ”"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "UGC issues guidelines for better inclusion of learners with disabilities on campuses", "description": "The guidelines are specific in nature, including a suggestion for unviersities to number choices for a multiple-choice question with capital letters such as A, B, C, D so that dyslexic students dont confuse 'b' and 'd'", "url": "https://indianexpress.com/article/education/ugc-issues-guidelines-for-better-inclusion-learners-with-disabilities-on-campuses-8025966/", "urlToImage": "https://images.indianexpress.com/2022/07/pexels-marcus-aurelius-4064231-1.jpg", "publishedAt": "2022-07-13T04:00:47Z", "content": "The UGC has issued guidelines to higher educational institutions across the country to ensure the seamless inclusion of learners with various forms of disabilitiesphysical or mental.The ‘Accessibilit… [+2679 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Should you drink water even before brushing your teeth?", "description": "\"Drink water right after you wake up in the morning, even before brushing your teeth!\" said Dr Noopor Rohatgi on Instagram", "url": "https://indianexpress.com/article/lifestyle/health/water-before-brushing-waking-up-benefits-constipation-bad-breath-8018474/", "urlToImage": "https://images.indianexpress.com/2022/07/drinking-water_200_getty.jpg", "publishedAt": "2022-07-13T04:00:17Z", "content": "Many of us like to start our day with a hot cuppa, which is enjoyed after brushing our teeth. But Dr Noopor Rohatgi, certified yoga instructor and homeopathic doctor, recently took to Instagram to sh… [+1635 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Why Elon Musk can’t back out of buying Twitter, according to Twitter", "description": "Twitter was unsparing, calling his escape strategy a “model of hypocrisy” and a “model of bad faith.” It backed up its argument with numerous tweets from the billionaire.", "url": "https://indianexpress.com/article/technology/tech-news-technology/why-elon-musk-cant-back-out-of-buying-twitter-according-to-twitter-8025957/", "urlToImage": "https://images.indianexpress.com/2022/07/ElonMusk_Reuters_NEW3.jpg", "publishedAt": "2022-07-13T03:57:37Z", "content": "In a 62-page lawsuit filed on Tuesday, Twitter accused Elon Musk of breaching an agreement to buy the social media company for $44 billion. Musk, the worlds richest man, has tried to back out of the … [+4468 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Greater Noida: Woman’s body found near posh residential apartment complex", "description": "The woman's body was found lying in a service lane opposite AWHO Apartments in Sector Chi-IV, according to the police.", "url": "https://indianexpress.com/article/cities/delhi/greater-noida-womans-body-found-near-posh-residential-apartment-complex-8025908/", "urlToImage": "https://images.indianexpress.com/2022/07/crime-tape.jpg", "publishedAt": "2022-07-13T03:56:59Z", "content": "The body of an unidentified woman with injuries on her body was found near a posh residential apartment complex in Greater Noida Tuesday, said the police.The woman’s body was found lying in a service… [+705 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Apple ends consulting agreement with Jony Ive, its former design leader", "description": "Ive and Apple have agreed to stop working together, ending a three-decade run during which the designer helped define many iconic Apple products.", "url": "https://indianexpress.com/article/technology/tech-news-technology/apple-ends-consulting-agreement-with-jony-ive-its-former-design-leader-8025941/", "urlToImage": "https://images.indianexpress.com/2022/07/Jony-Ive-NYT.jpg", "publishedAt": "2022-07-13T03:52:23Z", "content": "When Jony Ive, Apples influential design leader, exited the company in 2019, Tim Cook, its chief executive, reassured customers that Ive, the man who gave the world candy-colored computers, would wor… [+4024 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Iron Man 2’s Mickey Rourke calls Tom Cruise ‘irrelevant’, says he has ‘no respect’ for Top Gun star", "description": "Oscar nominee Mickey Rourke slammed Tom Cruise for failing to push the boundaries as an actor.", "url": "https://indianexpress.com/article/entertainment/hollywood/iron-man-2-mickey-rourke-calls-tom-cruise-irrelevant-says-he-has-no-respect-for-top-gun-star-8025951/", "urlToImage": "https://images.indianexpress.com/2022/07/mickey-rourke-tom-cruise.jpg", "publishedAt": "2022-07-13T03:51:54Z", "content": "Calling Tom Cruise ‘irrelevant’, actor Mickey Rourke said in a new interview that he has ‘no respect’ for the Top Gun star because he hasn’t been pushing himself as an actor. Rourke, himself an Oscar… [+1431 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Aishwarya Rai celebrates 20 years of Devdas with gorgeous photo, Abhishek Bachchan showers love", "description": "Sanjay Leela Bhansali's magnum opus Devdas released on July 12, 2002. It starred Shah Rukh Khan, Aishwarya Rai and Madhuri Dixit in the lead roles.", "url": "https://indianexpress.com/article/entertainment/bollywood/aishwarya-rai-celebrates-20-years-of-devdas-with-gorgeous-photo-abhishek-bachchan-showers-love-8025930/", "urlToImage": "https://images.indianexpress.com/2022/07/aishwarya-rai-devdas.jpg", "publishedAt": "2022-07-13T03:41:23Z", "content": "Sanjay Leela Bhansali’s Devdas, an adaptation of Sarat Chandra Chattopadhyays novel of the same name, completed 20 years of release on Tuesday. On the occasion, one of the film’s lead actors, Aishwar… [+2581 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "SA withdraw from 3-match ODI series vs Australia, puts their 2023 World Cup qualification hopes in doubt", "description": "Proteas currently languishing in the 11th spot with 49 points.", "url": "https://indianexpress.com/article/sports/cricket/sa-withdraw-from-3-match-series-vs-australia-puts-their-2023-world-cup-qualification-hopes-in-doubt-8025913/", "urlToImage": "https://images.indianexpress.com/2022/06/ind-vs-sa-2022.jpg", "publishedAt": "2022-07-13T03:31:34Z", "content": "South Africa have opted to back out from the 3-match ODI series against Australia which was scheduled to take place from January 12-17, 2023. The move could be a major setback for the Proteas’ hopes … [+281 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Ahmedabad, Kerala among TIME magazine’s list of world’s greatest places of 2022", "description": "The list also includes Ras Al Khaimah, UAE; Park City, Utah; Seoul; Great Barrier Reef, Australia; The Arctic; Valencia, Spain; Trans Bhutan Trail, Bhutan; International Space Station; Bogota; Lower Zambezi National Park, Zambia; Istanbul and Kigali, Rwanda", "url": "https://indianexpress.com/article/lifestyle/destination-of-the-week/ahmedabad-kerala-among-time-magazines-list-of-worlds-greatest-places-of-2022-8025931/", "urlToImage": "https://images.indianexpress.com/2022/07/ScienceCity_Ahmedabad.jpg", "publishedAt": "2022-07-13T03:28:42Z", "content": "Ahmedabad city and the state of Kerala have been listed by TIME magazine among the 50 extraordinary destinations to explore in its list of the world’s greatest places of 2022.As persistent as the cha… [+2755 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Jan. 6 takeaways: ‘Screaming’ and a Trump tweet never sent", "description": "At its seventh hearing, the US House January 6 panel showed further evidence that Donald Trump was told, repeatedly, that his claims of fraud were false — but that he continued to push them anyway.", "url": "https://indianexpress.com/article/world/jan-6-takeaways-donald-trump-capitol-riots-8025884/", "urlToImage": "https://images.indianexpress.com/2022/07/trump-video.jpg", "publishedAt": "2022-07-13T03:27:15Z", "content": "A presidential tweet that some saw as a call to arms. An unhinged meeting in the White House. Violent extremists planning to storm the Capitol as President Donald Trump pushed lies about election fra… [+8474 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Coronavirus India Live Updates: Odisha records first Covid death after 2 months; Covid has reached ‘endemic stage’, says Telangana health official", "description": "Covid News India, Coronavirus in India Live Updates: In other news, the Biden administration is calling on people to exercise renewed caution about Covid-19.", "url": "https://indianexpress.com/article/lifestyle/health/coronavirus-india-live-updates-new-cases-deaths-booster-vaccines-8025914/", "urlToImage": "https://images.indianexpress.com/2022/07/virus.jpg", "publishedAt": "2022-07-13T03:23:35Z", "content": "A healthcare worker collects swab from a woman for a RT-PCR test coronavirus disease (COVID-19) in New Delhi. (Express Photo By Amit Mehra 05 04 2022)\r\nWith India reporting 13,615 new Coronavirus cas… [+1004 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Sara Ali Khan says she goes to the temple, wears bikinis at the beach: ‘Both are the same girl’", "description": "Sara Ali Khan recalled her childhood trips to Europe, where she'd accompany dad Saif Ali Khan to museums and drag her parents along with her to watch The Lion King on Broadway.", "url": "https://indianexpress.com/article/entertainment/bollywood/sara-ali-khan-says-she-goes-to-the-temple-wears-bikinis-at-the-beach-8025897/", "urlToImage": "https://images.indianexpress.com/2022/01/Sara-Ali-Khan-1200-2.jpg", "publishedAt": "2022-07-13T03:20:09Z", "content": "Actor Sara Ali Khan referred to herself in the third person as she described her own duality. In a new interview with Elle, she said that there are multiple sides to her personality, but that she is … [+1603 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "St Stephen’s writ plea at HC: Teacher writes to GB chairperson, asks why body was kept in dark", "description": "Initiation of legal proceedings in the matter of admissions without the prior approval of the College Governing body is, in my view, in gross violation of Clause 15 of our College Constitution,” Narain, a member of Governing Body wrote.", "url": "https://indianexpress.com/article/delhi/st-stephens-writ-plea-at-hc-teacher-writes-to-gb-chairperson-asks-why-body-was-kept-in-dark-8025911/", "urlToImage": "https://images.indianexpress.com/2022/07/st-stephens.jpg", "publishedAt": "2022-07-13T03:19:11Z", "content": "St Stephens College teacher and a member of the Governing Body (GB) Nandita Narain has written to the GB chairperson asking why the body was not informed of the colleges decision to file a writ petit… [+1974 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "টানা বৃষ্টিতে ডুবল মোদীর রাজ্য! গুজরাটে একদিনে মৃত ৬", "description": "রাজ্যে ভারী বৃষ্টিপাত, বন্যার কারণে মৃতের সংখ্যা বেড়ে হয়েছে ৬৯।", "url": "https://bengali.indianexpress.com/general-news/gujarat-rain-kills-6-in-past-24-hours-468423/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/modi-flood.jpg", "publishedAt": "2022-07-13T03:17:36Z", "content": "! , \r\n , ” \r\n , \r\n - \r\n : [}\r\n , , , , , , , , , , NDRF \r\n , , , \r\nStay updated with the latest news headlines and all the latest General news download Indian Express Bengali App.\r\nWeb Title: Gujarat… [+29 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Chennai News Live: EPS, OPS move HC against sealing of AIADMK headquarters; Stalin tests positive for Covid-19", "description": "Tamil Nadu, Chennai News Live Updates 13 July 2022: While interim General Secretary Palaniswami has apprised the EC about the July 11 General Council meeting and the changes effected, Panneerselvam has written to the poll panel arguing that the proceedings an…", "url": "https://indianexpress.com/article/cities/chennai/chennai-tamil-nadu-news-live-today-dmk-aiadmk-rains-traffic-covid-stalin-8025876/", "urlToImage": "https://images.indianexpress.com/2022/07/aiadmk-4.jpg", "publishedAt": "2022-07-13T03:16:00Z", "content": "Chennai, Tamil Nadu Live Updates today: AIADMK interim General Secretary Edappadi K Palaniswami (EPS) and ousted party leader O Panneerselvam on Tuesday moved the Madras High Court against the sealin… [+1101 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "ইস্তফা দেওয়ার আগেই বউকে নিয়ে শ্রীলঙ্কা ছেড়ে পালালেন গোটাবায়া", "description": "তাঁকে কি গ্রেফতার করা হতে পারে বা খুন হতে পারেন এমনটা আঁচ করেছেন প্রেসিডেন্ট?", "url": "https://bengali.indianexpress.com/general-news/sri-lanka-crisis-president-gotabaya-rajapaksa-wife-flees-to-male-speaker-yet-to-receive-resignation-letter-468418/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/Gotabaya-Rajapaksha-1.jpg", "publishedAt": "2022-07-13T03:12:51Z", "content": ", , , , , \r\n, , , ? , \r\n, , \r\n ! \r\n , \r\nStay updated with the latest news headlines and all the latest General news download Indian Express Bengali App.\r\nWeb Title: Sri lanka crisis president gotabay… [+71 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Twitter sues Elon Musk to hold him to $44 billion deal", "description": "\"Musk apparently believes that he - unlike every other party subject to Delaware contract law - is free to change his mind, trash the company, disrupt its operations, destroy stockholder value, and walk away,\" said the complaint.", "url": "https://indianexpress.com/article/technology/twitter-sues-elon-musk-44-billion-deal-8025905/", "urlToImage": "https://images.indianexpress.com/2022/06/Elon-Musk-meeting-Twitter-employees.jpg", "publishedAt": "2022-07-13T03:09:59Z", "content": "“Musk apparently believes that he – unlike every other party subject to Delaware contract law – is free to change his mind, trash the company, disrupt its operations, destroy stockholder value, and w… [+4030 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Euro 2022: Clinical Germany beat Spain 2-0 to roll into the quarter-finals", "description": "Germany were gifted a goal in the third minute after a blunder by Spain goalkeeper Sandra Panos, whose attempted clearance went straight to Klara Buehl for her to slot home.", "url": "https://indianexpress.com/article/sports/football/euro-2022-clinical-germany-beat-spain-2-0-to-roll-into-the-quarter-finals-8025894/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-12-3.jpg", "publishedAt": "2022-07-13T03:05:02Z", "content": "Eight-times women’s European champions Germany cruised clinically into the Euro 2022 quarter-finals as Group B winners with a game to spare on Tuesday after beating Spain 2-0 at Brentford’s Community… [+1548 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Mumbai News Live Updates: At least six dead, 95 evacuated in Maharashtra due to heavy rain; red alert issued in Palghar, Raigad", "description": "Mumbai, Maharashtra Rains News Live Updates, July 13, 2022: An orange alert for Mumbai and Thane is in place till Thursday while a red alert has been issued for Palghar and Raigad for the same period, indicating extremely heavy rainfall.", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-news-live-maharashtra-rains-monsoon-floods-red-alert-uddhav-covid-8025883/", "urlToImage": "https://images.indianexpress.com/2022/07/mumbai2-1.jpeg", "publishedAt": "2022-07-13T03:04:33Z", "content": "The Mumbai Police on Tuesday issued a fresh circular cancelling the two orders issued last month by then Mumbai Police Commissioner Sanjay Pandey. The two orders, that currently stand cancelled, pert… [+1486 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rohan Naahar", "title": "Ms Marvel: How the MCU show uses music to cure generational pain, repair cross-border tensions", "description": "Ms Marvel: Combining the Gen-Z sounds of Ritviz and Hasan Raheem with songs from icons such as Abida Parveen and AR Rahman, the new MCU show uses music as a diplomatic tool to unite generations and nations.", "url": "https://indianexpress.com/article/entertainment/web-series/ms-marvel-how-the-mcu-show-uses-music-to-cure-generational-pain-pasoori-tu-jhoom-8024786/", "urlToImage": "https://images.indianexpress.com/2022/07/ms-marvel-pcs.png", "publishedAt": "2022-07-13T03:03:17Z", "content": "On the most difficult days the days on which you can sense the moral fabric of our nation is being ripped apart the best thing you can do is to play a popular Coke Studio Pakistan video and scroll th… [+6326 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rohan Naahar", "title": "Ms Marvel: How the MCU show uses music to cure generational pain, repair cross-border tensions", "description": "Ms Marvel: Combining the Gen-Z sounds of Ritviz and Hasan Raheem with songs from icons such as Abida Parveen and AR Rahman, the new MCU show uses music as a diplomatic tool to unite generations and nations.", "url": "https://indianexpress.com/article/entertainment/web-series/ms-marvel-how-the-mcu-show-uses-music-to-cure-generational-pain-pasoori-jhoom-lo-8024786/", "urlToImage": "https://images.indianexpress.com/2022/07/ms-marvel-pcs.png", "publishedAt": "2022-07-13T03:03:17Z", "content": "On the most difficult days the days on which you can sense the moral fabric of our nation is being ripped apart the best thing you can do is to play a popular Coke Studio Pakistan video and scroll th… [+6326 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Ahead of Taapsee Pannu’s Shabaash Mithu, revisiting the incredible story of former Indian captain Mithali Raj", "description": "As we get ready for the release of Taapsee Pannu-starrer sports biopic Shabaash Mithu, here's a quick recap of the incredible real-life story of Mithali Raj.", "url": "https://indianexpress.com/article/entertainment/bollywood/ahead-of-taapsee-pannus-shabaash-mithu-revisiting-the-incredible-story-of-former-indian-captain-mithali-raj-8022758/", "urlToImage": "https://images.indianexpress.com/2022/07/mithu1200.jpg", "publishedAt": "2022-07-13T03:02:56Z", "content": "While many might know of Mithali Raj, a good section of people might not be familiar with her achievements and how did she get into the game of cricket. Even as Taapsee Pannu’s film Shabaash Mithu pr… [+3297 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Gunbir Singh", "title": "Mattewara a game changer?", "description": "The scrapping of the proposed textile park project signifies the signs of a thinking government responsive to grassroot voices and environmental needs.", "url": "https://indianexpress.com/article/opinion/columns/mattewara-a-game-changer/", "urlToImage": "https://images.indianexpress.com/2022/07/forest-1.jpg", "publishedAt": "2022-07-13T03:02:55Z", "content": "The scrapping of the proposed textile park project adjacent to the Mattewara forest and contiguous to River Sutlej signifies the signs of a thinking government responsive to grassroot voices and envi… [+2252 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Gunbir Singh", "title": "Mattewara a game changer?", "description": "The scrapping of the proposed textile park project signifies the signs of a thinking government responsive to grassroot voices and environmental needs.", "url": "https://indianexpress.com/article/cities/chandigarh/mattewara-a-game-changer/", "urlToImage": "https://images.indianexpress.com/2022/07/forest-1.jpg", "publishedAt": "2022-07-13T03:02:55Z", "content": "The scrapping of the proposed textile park project adjacent to the Mattewara forest and contiguous to River Sutlej signifies the signs of a thinking government responsive to grassroot voices and envi… [+2252 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "While You Were Asleep: Germany beat Spain 2-0 in Women’s Euro, Botswana’s Amos suspended for doping and NBA stiffens take foul penalty", "description": "Amos was notified of the result while in Eugene, Oregon, where he was scheduled to compete in the 800m heats on July 20.", "url": "https://indianexpress.com/article/sports/while-you-were-asleep-germany-topped-spain-2-0-in-womens-euro-botswanas-amos-suspended-for-doping-and-nba-stiffens-take-foul-penalty-8025882/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-2022-07-13T081420.504.jpg", "publishedAt": "2022-07-13T03:00:25Z", "content": "Eight-time womens European champions Germany outplayed Spain 2-0 at Brentfords Community Stadium on Tuesday. Germany were given an easy goal in the third minute after a mistake by Spain goalkeeper Sa… [+1709 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Is it wrong to be motivated by jealousy? Find out", "description": "Sadhguru believes there are several appropriate techniques to motivate yourself", "url": "https://indianexpress.com/article/lifestyle/life-positive/sadhguru-jealousy-life-positive-motivation-7984500/", "urlToImage": "https://images.indianexpress.com/2022/06/jealous-sadhguru.jpg", "publishedAt": "2022-07-13T02:50:06Z", "content": "‘Jealousy’ is a complex human emotion, which touches everyone’s ego. Be it in the workplace, friendships or in relationships, jealousy finds a way to sneak in. While some may perceive it as a negativ… [+1770 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Monsoon News Live Updates: Monsoon to remain active till July 15; Pune water crisis may soon be over", "description": "Monsoon News Live Updates: Pune water crisis may soon be over as the storage in four dams have increased; Monsoon rains over the past month have killed at least 150 people in Pakistan", "url": "https://indianexpress.com/article/india/monsoon-news-live-updates-monsoon-to-remain-active-till-july-15-pune-water-crisis-delhi-rains-weather-update-8025880/", "urlToImage": "https://images.indianexpress.com/2022/07/WhatsApp-Image-2022-07-12-at-10.03.51-PM.jpeg", "publishedAt": "2022-07-13T02:45:50Z", "content": "At least six persons died in rain-related incidents over the past 24 hours and 95 people were evacuated as heavy rain battered Gadchiroli, Nandurbar, Nashik and Palghar districts of Maharashtra. Most… [+481 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rahel Philipose, Srishti Kapoor", "title": "Daily Briefing: Shiv Sena extends support to presidential candidate Draupadi Murmu; SIT to probe cases against Mohammad Zubair", "description": "In today's edition: Shiv Sena extends support to presidential candidate Draupadi Murmu; SIT set up to probe cases lodged against Alt News co-founder Mohammad Zubair; and more", "url": "https://indianexpress.com/article/live-news/daily-briefing-top-news-july-13-8025852/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-2021-11-08T081015.674-5.jpg", "publishedAt": "2022-07-13T02:21:53Z", "content": "Big Story\r\nIn a fresh setback for Yashwant Sinhas already-faltering presidential bid, the Shiv Sena has extended its support to the NDAs presidential candidate, Droupadi Murmu. Shiv Sena chief and fo… [+5591 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "For a Sikh to carry, wear ‘Kirpan’, ‘Kara’ is pious: Delhi HC", "description": "The court passed the order Monday in a case filed in 2021 by a woman, an Amritdhari Sikh, who was not permitted by the DSSSB and the examination centre to appear for the PGT-Economics (Female) examination held on July 17 last year.", "url": "https://indianexpress.com/article/cities/delhi/for-a-sikh-to-carry-wear-kirpan-kara-is-pious-delhi-hc-8025842/", "urlToImage": "https://images.indianexpress.com/2022/07/kirpan.jpg", "publishedAt": "2022-07-13T02:16:48Z", "content": "The Delhi High Court has directed the Delhi Subordinate Services Selection Board to ensure that adequate notice is given well in advance on the additional requirement of reaching the examination cent… [+1314 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Tamil Nadu govt accuses Governor of trying to infuse politics, minister to boycott university convocation", "description": "The Governor is only a nominal executive appointed by the Central government and his duty is to meet the aspirations of state where he serves, Higher Education Minister K Ponmudi said,", "url": "https://indianexpress.com/article/cities/chennai/tamil-nadu-rn-ravi-ponmudi-boycott-madurai-kamaraj-university-convocation-ceremony-8025866/", "urlToImage": "https://images.indianexpress.com/2022/07/K-Ponmudy.jpeg", "publishedAt": "2022-07-13T02:16:15Z", "content": "Tamil Nadu Higher Education Minister K Ponmudi on Tuesday accused Governor R N Ravi of attempting to infuse politics among the students under the guise of convocation at the Madurai Kamaraj Universit… [+2414 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Battle in AIADMK shifts to Election Commission, banks", "description": "While interim General Secretary Palaniswami has apprised the EC about the July 11 General Council meeting and the changes effected, Panneerselvam has written to the poll panel arguing that the proceedings and its decisions were null and void.", "url": "https://indianexpress.com/article/cities/chennai/aiadmk-panneerselvam-palaniswami-election-commission-tamil-nadu-8025843/", "urlToImage": "https://images.indianexpress.com/2022/07/EPS-OPS-4.jpeg", "publishedAt": "2022-07-13T02:10:46Z", "content": "While interim General Secretary Palaniswami has apprised the EC about the July 11 General Council meeting and the changes effected, Panneerselvam has written to the poll panel arguing that the procee… [+3424 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Sri Lankan president flees country hours before he was due to step down", "description": "The immigration official said authorities could not under law prevent a sitting president from leaving the country.", "url": "https://indianexpress.com/article/world/sri-lankan-president-gotabaya-rajapaksa-flees-hours-before-he-was-due-to-step-down-8025844/", "urlToImage": "https://images.indianexpress.com/2022/07/gotabaya.jpg", "publishedAt": "2022-07-13T02:00:51Z", "content": "Sri Lankan President Gotabaya Rajapaksa fled the country early on Wednesday, two sources told Reuters, hours before he was due to step down amid widespread protests over his handling of a devastating… [+2728 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Google Doodle celebrates NASA’s images of the unseen universe", "description": "Dubbed the 'golden eye' by scientists, the Google doodle shows the gold-coated, flower-shaped mirror of the James Webb Space Telescope perched atop a spacecraft, capturing images of the cosmos.", "url": "https://indianexpress.com/article/trending/trending-globally/google-doodle-nasa-universe-images-james-webb-telescope-8025827/", "urlToImage": "https://images.indianexpress.com/2022/07/google-doodle.jpg", "publishedAt": "2022-07-13T01:58:25Z", "content": "Dubbed the ‘golden eye’by scientists, the doodle shows the gold-coated, flower-shaped mirror of the telescope perched atop a spacecraft. The doodle then shows the images captured by the JWST includin… [+971 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Tamil Nadu Covid-19 update: Infections continue to decline as state records 2,280 cases", "description": "Chennai, Tamil Nadu Covid-19 cases: Chennai accounted for the majority of new Covid-19 infections at 755 in the last 24 hours", "url": "https://indianexpress.com/article/cities/chennai/tamil-nadu-covid-cases-today-chennai-covid-infections-deaths-updates-8025438/", "urlToImage": "https://images.indianexpress.com/2022/07/PTI02_01_2022_000102B-2-1-1.jpeg", "publishedAt": "2022-07-13T01:49:05Z", "content": "Tamil Nadu on Tuesday recorded 2,280 new coronavirus cases pushing the caseload 35,06,257 till date while death toll stood at 38,028 with nil fatalities being reported in the last 24 hours, the Healt… [+707 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Bloomberg", "title": "Google to slow hiring for rest of year, says Alphabet CEO Sundar Pichai", "description": "Historically, Google has remained relatively immune to the economic dips of the technology sector.", "url": "https://indianexpress.com/article/technology/google-slows-hiring-2022-2023-ceo-sundar-pichai-8025820/", "urlToImage": "https://images.indianexpress.com/2022/07/sundar-pichai.jpg", "publishedAt": "2022-07-13T01:42:13Z", "content": "Alphabet Inc.s Google plans to slow hiring for the remainder of the year in the face of a potential economic recession, Chief Executive Officer Sundar Pichai said Tuesday in an email to staff.Pichai … [+4545 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "I-T dept detects Rs 500-crore black income after raids on two Tamil Nadu groups", "description": "The searches were carried out at over 40 premises in Chennai, Coimbatore and Madurai on July 6.", "url": "https://indianexpress.com/article/cities/chennai/i-t-dept-detects-rs-500-crore-black-income-after-raids-on-two-tamil-nadu-groups-8025829/", "urlToImage": "https://images.indianexpress.com/2022/07/TAX-1.jpeg", "publishedAt": "2022-07-13T01:41:30Z", "content": "The Income Tax Department has detected “undisclosed” income of more than Rs 500 crore after it recently raided two Tamil Nadu-based business groups engaged in real estate advertising and civil contra… [+1325 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Sam Taylor-Johnson tapped to direct Amy Winehouse biopic", "description": "Sam Taylor-Johnson hopes to cast a relative newcomer to play Amy Winehouse in the film.", "url": "https://indianexpress.com/article/entertainment/hollywood/sam-taylor-johnson-tapped-to-direct-amy-winehouse-biopic-8024126/", "urlToImage": "https://images.indianexpress.com/2022/07/Sam-Taylor-Johnson-1200by667.jpg", "publishedAt": "2022-07-13T01:33:38Z", "content": "Sam Taylor-Johnson, best known for Nowhere Boy and Fifty Shades of Grey, is set to direct a biopic about singer and close friend Amy Winehouse. European studio Studiocanal is producing the film title… [+1231 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anju Agnihotri Chaba", "title": "Explained: Punjab’s moong MSP experiment, its impact on state finances", "description": "Due to stringent conditions imposed for MSP purchase, farmers have been selling their moong produce to private players below MSP.", "url": "https://indianexpress.com/article/explained/explained-punjabs-moong-msp-impact-state-finances-8025375/", "urlToImage": "https://images.indianexpress.com/2022/07/moong-pulses-1.jpeg", "publishedAt": "2022-07-13T01:30:39Z", "content": "The Punjab government for the first time this season introduced a policy to procure summer moong on MSP, subject to some stringent rules. But with private players purchasing more, the government now … [+2299 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Two pig heart transplants succeed in brain-dead recipients", "description": "The move is a step closer to a long-term goal of using pig parts to address the shortage of human organs for transplant.", "url": "https://indianexpress.com/article/world/two-pig-heart-transplants-succeed-in-brain-dead-recipients-8025819/", "urlToImage": "https://images.indianexpress.com/2022/07/pig-heart.jpg", "publishedAt": "2022-07-13T01:27:37Z", "content": "Surgeons at New York University (NYU) have successfully transplanted genetically-engineered pig hearts into two brain-dead people, researchers said on Tuesday, moving a step closer to a long-term goa… [+2795 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Edapaddi Palaniswami, O Pannerselvam move Madras HC against sealing of AIADMK headquarters", "description": "Following a violent clash between the supporters of EPS and OPS at the party headquarters on July 11, ahead of the party's General Council that elected Palaniswami to the present position and booted out OPS and his supporters from the AIADMK, the Revenue depa…", "url": "https://indianexpress.com/article/cities/chennai/edapaddi-palaniswami-o-pannerselvam-move-madras-hc-against-sealing-of-aiadmk-headquarters-8025805/", "urlToImage": "https://images.indianexpress.com/2022/07/AIADMK-hq-1.jpg", "publishedAt": "2022-07-13T01:15:15Z", "content": "AIADMK interim General Secretary Edappadi K Palaniswami (EPS) and ousted party leader O Panneerselvam on Tuesday moved the Madras High Court against the sealing of the party headquarters by the Tamil… [+1586 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Nirupama Subramanian", "title": "Explained: Gotabaya Rajapaksa is set to resign, what happens in Sri Lanka now?", "description": "This is the second time in 44 years of Sri Lanka's executive presidency that the office will fall vacant midstream. The first time was when Ranasinghe Premadasa was assassinated by the LTTE in 1993. The PM at the time, Dingiri Bandara Wijetunga, became acting…", "url": "https://indianexpress.com/article/explained/explained-gotabaya-rajapaksa-resign-what-happens-in-sri-lanka-now-8025567/", "urlToImage": "https://images.indianexpress.com/2022/07/got.jpg", "publishedAt": "2022-07-13T01:00:44Z", "content": "As Sri Lanka waits for President Gotabaya Rajapaksa to resign as promised on Wednesday (July 13), hectic efforts are ongoing in various political camps to lay claim to the office. Meanwhile, GoGotaGo… [+5034 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Chennai power cut today: Check the list of affected areas that will face a power cut in Chennai", "description": "Chennai power disruption July 13, Wednesday: Parts of Chennai will face a power cut from 9 am to 2 pm for maintenance work today.", "url": "https://indianexpress.com/article/cities/chennai/chennai-power-cut-today-check-the-list-of-affected-areas-that-will-face-a-power-cut-in-chennai-8025799/", "urlToImage": "https://images.indianexpress.com/2022/07/electricity-reuters-1200-2-1-11.jpeg", "publishedAt": "2022-07-13T00:58:21Z", "content": "The Tamil Nadu Generation and Distribution Corporation (Tangedco) has announced that power will be suspended in parts of Chennai today in T Nagar, Mylapore, Tambaram, Porur, Vysarpadi, Perambur, KK N… [+3161 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Happy Guru Purnima 2022: Wishes Images, Whatsapp messages, quotes, status and photos", "description": "Happy Guru Purnima 2022 Wishes Images, Messages, Status, Quotes, Photos, Pics, Wallpapers:  Show gratitude to your gurus and seek their blessings on this wonderful day.", "url": "https://indianexpress.com/article/lifestyle/life-style/happy-guru-purnima-2022-wishes-images-quotes-status-messages-photos-and-greetings-8023907/", "urlToImage": "https://images.indianexpress.com/2020/07/guru-purnima-1200-1.jpg", "publishedAt": "2022-07-13T00:30:14Z", "content": "Happy Guru Purnima 2022 Wishes Images, Messages, Status, Photos, Quotes: A significant festival, Guru Purnima is celebrated across the country with much fervour by Buddhists, Hindus, and Jains every … [+1373 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "এই সতীপীঠে পড়েছে দেবীর তৃতীয় নয়ন, কুণ্ডে স্নানে ঘটে রোগমুক্তি", "description": "দুধকুণ্ডের তাপমাত্রাও থাকে ৬৬ ডিগ্রি সেলসিয়াস। সকালের দিকে এই কুণ্ডের জলে ওজোন ঘনীভূত হয়ে সাদা সরের মত পদার্থ তৈরি করে।", "url": "https://bengali.indianexpress.com/lifestyle/satipeeth-bakreshwar-in-birbhum-468409/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/BAKRESHWAR.jpg", "publishedAt": "2022-07-13T00:30:00Z", "content": ", , , , - , , , , , , , , \r\n , , , \r\n , , , , , \r\n - ? \r\n , \r\n , ,"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "Privatise all PSBs except SBI for now, says report", "description": "The report says that the government should start privatisation exercises with two strong banks.", "url": "https://indianexpress.com/article/business/banking-and-finance/privatise-all-psbs-except-sbi-for-now-says-report-8025676/", "urlToImage": "https://images.indianexpress.com/2022/07/sbi-state-bank-of-india-reuters.jpg", "publishedAt": "2022-07-13T00:15:11Z", "content": "The Centre should privatise all public sector banks (PSBs) but State Bank of India (SBI), said a report on privatisation of PSBs prepared by National Council of Applied Economic Research (NCAER) Dire… [+1149 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "‘Q1: Rising yields may deal Rs 13K-crore MTM loss to banks’", "description": "Rating agency Icra has estimated MTM losses on bond portfolios at Rs 8,000-10,000 crore for public sector banks and Rs 2,400-3,000 crore for private banks in Q1 (June quarter) of FY2023.", "url": "https://indianexpress.com/article/business/banking-and-finance/q1-rising-yields-may-deal-rs-13k-cr-mtm-loss-to-banks/", "urlToImage": "https://images.indianexpress.com/2022/07/money-3.jpg", "publishedAt": "2022-07-13T00:00:58Z", "content": "The banking sector is likely to witness mark-to-market (MTM) losses of Rs 10,000-13,000 crore in the first quarter of FY23 in the wake of the rising bond yields.Rating agency Icra has estimated MTM l… [+2447 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "MAYURA JANWALKAR", "title": "Goa: Day after skipping meet with Wasnik, ex-CM Kamat says he was not invited", "description": "Cut up about being divested of his responsibilities, Kamat said he was the only MLA from the previous Assembly who was left in the Congress before the 2022 polls. “If I had to go (to BJP) I could have gone before the election,” he said.", "url": "https://indianexpress.com/article/cities/goa/day-after-skipping-meet-with-wasnik-ex-cm-kamat-says-he-was-not-invited-congress-bjp-8025781/", "urlToImage": "https://images.indianexpress.com/2022/07/digambar-kamat.jpg", "publishedAt": "2022-07-13T00:00:55Z", "content": "A day after the crisis in the Goa Congress seemed to have been averted, the party may still have a lot of damage control to do. Former Chief Minister Digambar Kamat, the only MLA who did not meet AIC… [+2708 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "New India Assurance General Manager get additional CMD charge", "description": "While Bhaskar was shifted from GIC Re to NIA in March to be an acting CMD of the company, she was not given the necessary power to function as the CMD of the company.", "url": "https://indianexpress.com/article/business/economy/new-india-assurance-general-manager-get-additional-cmd-charge/", "urlToImage": "https://images.indianexpress.com/2022/07/Indian-Express-6.jpeg", "publishedAt": "2022-07-12T23:57:56Z", "content": "The government has given Madhulika Bhaskar, General Manager, New India Assurance (NIA), the additional power of the Chairman &amp; Managing Director (CMD) of the company for a period of three months … [+971 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "DICGC settles Rs 8,516 crore depositors claims, collects Rs 19,491 cr premium", "description": "The Deposit Insurance Fund (DIF) stood at Rs 1.47 lakh crore, yielding a reserve ratio (ratio of DIF to insured deposits) of 1.81 per cent, the RBI said.", "url": "https://indianexpress.com/article/business/economy/dicgc-settles-rs-8516-crore-depositors-claims-collects-rs-19491-cr-premium-8025783/", "urlToImage": "https://images.indianexpress.com/2021/12/Cash-2.jpg", "publishedAt": "2022-07-12T23:52:31Z", "content": "The Deposit Insurance and Credit Guarantee Corporation (DICGC), which extends insurance cover to depositors, settled aggregate claims of Rs 8,516.6 crore under different channels during 2021-22.Durin… [+2055 chars]"}]}