{"status": "ok", "totalResults": 302, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Rohan Naahar", "title": "Raman Raghav 2.0: Vicky Kaushal slayed Anurag Kashyap’s film, and his face was barely even visible in the best scene", "description": "Post Credits Scene: Director Anurag Kashyap's underrated masterpiece Raman Raghav 2.0 is a stern indictment of toxic Indian masculinity, and it wouldn't have been as effective without Vicky Kaushal's searing performance.", "url": "https://indianexpress.com/article/entertainment/bollywood/raman-raghav-2-0-vicky-kaushal-slayed-anurag-kashyap-film-best-scene-7916912/", "urlToImage": "https://images.indianexpress.com/2022/05/raman-raghav-pcs.png", "publishedAt": "2022-05-16T02:50:25Z", "content": "Vicky Kaushal barely appears in the first hour of Raman Raghav 2.0, a film in which he ostensibly plays the protagonist, Raghav. While Nawazuddin Siddiquis Ramanna undoubtedly has the bigger scenes, … [+5756 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "‘If you spend time doing inventory on what you lost, you will never count what you have left’: Thomas Dexter Jakes", "description": "\"You are stronger, you are wiser, you have proven things to yourself that you could not have learned any other way,\" he said", "url": "https://indianexpress.com/article/lifestyle/life-positive/if-you-spend-all-your-time-doing-inventory-in-what-what-you-lost-you-will-never-count-up-what-you-have-left-thomas-dexter-jakes7913385/", "urlToImage": "https://images.indianexpress.com/2022/05/WhatsApp-Image-2022-05-12-at-3.00.24-PM.jpeg", "publishedAt": "2022-05-16T02:50:08Z", "content": "American Bishop, author and filmmaker Thomas Dexter Jakes talks about different life aspects based on ‘your time’ to move ahead.According to him, if you spend “all of your time doing inventory on wha… [+1863 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mumbai confidential: Security issues", "description": "Finally, one of his body guards stopped another two-wheeler owner and followed the bike on which Shinde was travelling.", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-confidential-security-issues-7919204/", "urlToImage": "https://images.indianexpress.com/2022/03/shinde12.jpg", "publishedAt": "2022-05-16T02:38:48Z", "content": "While heading to the recent mega rally of the Shiv Sena, Urban Development Minister Eknath Shinde got stuck in the traffic and decided to take a ride on a Shiv Sainiks two-wheeler. Since Shinde comma… [+970 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Folk singer booked for using casteist slur during performance", "description": "According to police, an FIR was lodged against Gadhvi under sections of the Scheduled Caste and Scheduled Tribe (Prevention of Atrocities) Act at the behest of a complaint lodged by Vishal Garva, a Bhuj-based Dalit rights activist.", "url": "https://indianexpress.com/article/cities/ahmedabad/folk-singer-booked-for-using-casteist-slur-during-performance-7919187/", "urlToImage": "https://images.indianexpress.com/2022/05/hhh-1.jpg", "publishedAt": "2022-05-16T02:25:09Z", "content": "Popular folk and devotional singer Yogesh Gadhvi, also known as Yogesh Boxa, was booked for allegedly using a casteist slur against the Dalit community during his performance at a public event, where… [+1391 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Don’t undermine my political weight; will bring down Babri power structure in Maharashtra: Fadnavis", "description": "Devendra Fadnavis said, “Yes, when I participated in Ayodhya movement, I was already the youngest elected corporator at 21 years. My weight was 128 kg. And now I am 102 kg…I would like to warn Thackeray not to undermine my political weight.\"", "url": "https://indianexpress.com/article/cities/mumbai/dont-undermine-my-political-weight-will-bring-down-babri-power-structure-in-maharashtra-fadnavis-7919179/", "urlToImage": "https://images.indianexpress.com/2022/04/devendra-fadnavis-759.jpg", "publishedAt": "2022-05-16T02:16:01Z", "content": "Asking chief minister Uddhav Thackeray not to undermine his political weight, senior Bharatiya Janata Party (BJP) leader and Opposition leader Devendra Fadnavis on Sunday said he would soon demolish … [+3153 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Partha Sarathi Biswas", "title": "Food inflation spirals, but dal prices stay off the boil", "description": "The July 2 order imposed stock limits (“on all pulses put together, except moong”) of 200 tonnes for wholesalers, 5 tonnes for retailers, and last three months’ production or 25% of annual installed capacity (whichever was higher) for millers.", "url": "https://indianexpress.com/article/cities/pune/food-inflation-spirals-but-dal-prices-stay-off-the-boil-7919160/", "urlToImage": "https://images.indianexpress.com/2022/02/food-inflation-PTI-1200.jpg", "publishedAt": "2022-05-16T01:40:58Z", "content": "Roti (wheat) is becoming dearer on the back of soaring global prices and a heat wave-affected domestic crop but that isnt the case with dal (pulses), whose retail prices are lower than a year ago des… [+3240 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "SBI hikes MCLR again, second in 1 month", "description": "SBI recently increased interest rate on its bulk term deposits (Rs 2 crore and above) by 40 – 90 basis points, with effect from May 10.", "url": "https://indianexpress.com/article/business/banking-and-finance/sbi-hikes-mclr-again-second-in-1-month-7919119/", "urlToImage": "https://images.indianexpress.com/2022/05/SBI.jpg", "publishedAt": "2022-05-16T01:06:32Z", "content": "State Bank of India (SBI), Indias largest bank, has hiked its marginal cost of funds-based lending rate (MCLR) by 10 basis points across tenures with effect from May 15. This is SBIs second hike in M… [+1322 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Karunjit Singh, Aanchal Magazine", "title": "Logistics overhang: Rupee fall unlikely to boost exports", "description": "The rupee has depreciated by 4.18 per cent since the beginning of the year and closed Friday’s trading session at 77.44 against the greenback.", "url": "https://indianexpress.com/article/business/economy/rupee-fall-unlikely-boost-exports-7919143/", "urlToImage": "https://images.indianexpress.com/2022/05/rupee-bloomberg.jpeg", "publishedAt": "2022-05-16T01:04:17Z", "content": "The rupees depreciation against the US dollar may hold little upside for India as exports seem unlikely to benefit, amid global supply chain constraints and fall in currency values of competitors, ev… [+3484 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Banikinkar Pattanayak", "title": "RBI to review asset quality of PSBs tomorrow", "description": "The Governor will also review PSBs’ collection efficiencies, consumer grievance redress mechanism, digital banking units, lending to government entities, IT infrastructure and cyber security framework and any issue that the lenders may like to present", "url": "https://indianexpress.com/article/business/economy/rbi-to-review-asset-quality-of-psbs-tomorrow-7919140/", "urlToImage": "https://images.indianexpress.com/2022/05/RBi-1-2-1-1.jpg", "publishedAt": "2022-05-16T00:58:56Z", "content": "Days after the Reserve Bank of India (RBI) hiked the repo rate for the first time in almost four years, governor Shaktikanta Das will meet chiefs of public sector banks (PSBs) on May 17 to review cre… [+834 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "George Mathew", "title": "Irdai douses ‘Burning Cost’, premiums may fall for India Inc", "description": "Bhupinder Singh Hooda talks about what the Congress needs to do to give a good fight to the BJP, preparing for the 2024 elections and giving farmers their due. This session was moderated by Manraj Grewal Sharma, Resident Editor (Chandigarh), The Indian Express", "url": "https://indianexpress.com/article/business/economy/irdai-douses-burning-cost-premiums-may-fall-for-india-inc-7919132/", "urlToImage": "https://images.indianexpress.com/2022/05/irda.jpg", "publishedAt": "2022-05-16T00:54:33Z", "content": "Paving the way for lower insurance premiums for India Inc, insurance regulator Irdai has said that Burning Cost cant be quoted by general insurers as a mandated minimum rate to charge premiums to cus… [+2710 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Bhupinder Singh Hooda at Idea Exchange: The only way out is to fight for the cause of the people; a leader then emerges automatically", "description": "One of the tallest Congress leaders, and leader of Opposition in the Haryana Assembly, Bhupinder Singh Hooda was chief minister of Haryana from 2005 to 2014.", "url": "https://indianexpress.com/article/idea-exchange/bhupinder-singh-hooda-at-idea-exchange-the-only-way-out-is-to-fight-for-the-cause-of-the-people-a-leader-then-emerges-automatically-7919115/", "urlToImage": "https://images.indianexpress.com/2022/05/Bhupinder-Singh-Hooda-1.jpg", "publishedAt": "2022-05-16T00:48:32Z", "content": "Bhupinder Singh Hooda talks about what the Congress needs to do to give a good fight to the BJP, preparing for the 2024 elections and giving farmers their due. This session was moderated by Manraj Gr… [+15775 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Mahender Singh Manral", "title": "Mundka fire: Building owner held, had applied for factory licence in 2016, says police", "description": "Police also found that the Goel brothers, who ran the company Cofe Impex Private Limited where the fire started, were shifting operations to a new, bigger office in Noida. The duo have been arrested as well.", "url": "https://indianexpress.com/article/cities/delhi/mundka-fire-building-owner-held-had-applied-for-factory-licence-in-2016-says-police-7919126/", "urlToImage": "https://images.indianexpress.com/2022/05/Mundka-Fire-featured-1-1.jpg", "publishedAt": "2022-05-16T00:25:02Z", "content": "The Delhi Police Sunday arrested Manish Lakra, owner of the four-storey commercial building in Mundka where 27 people died in a fire on Friday. Initial investigation revealed that Lakra had applied f… [+2192 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Abhinav Rajput", "title": "Mundka fire: In 2015, building was rented by BJP man as poll office", "description": "In the run-up to the 2015 Delhi Assembly polls, BJP candidate from Mundka, Master Azad Singh, had used the building as his poll office.", "url": "https://indianexpress.com/article/cities/delhi/mundka-fire-building-rented-bjp-man-poll-office-7919122/", "urlToImage": "https://images.indianexpress.com/2022/05/Mundka-fire-5-1.jpeg", "publishedAt": "2022-05-16T00:19:17Z", "content": "Before it housed a commercial unit, the Mundka building where a fire broke out on Friday, killing 27 people, was temporarily used by a BJP member in 2015 as an election office taken on rent.In the ru… [+4788 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "State-level function on birth anniversary of Shaheed Sukhdev: Real tribute to martyrs if we can eradicate social evils, says Bains", "description": "Harjot Singh Bains was attending the state-level function organised on the birth anniversary of Shaheed Sukhdev at Guru Nanak Dev Bhawan in Ludhiana.", "url": "https://indianexpress.com/article/cities/ludhiana/state-level-function-on-birth-anniversary-of-shaheed-sukhdev-real-tribute-to-martyrs-if-we-can-eradicate-social-evils-says-bains-7919116/", "urlToImage": "https://images.indianexpress.com/2022/05/FSz_A4oUAAA4b1c.jpg", "publishedAt": "2022-05-16T00:08:41Z", "content": "Punjab Jails and Tourism Minister Harjot Singh Bains Sunday said that the Aam Aadmi Party government is committed to preserving the legacy of freedom fighters and our martyrs, due to whose sacrifices… [+2122 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pavneet Singh Chadha", "title": "Among dead: Motivational speaker called to address company employees, his son", "description": "“We were not aware of the fire. When our family members did not return, we tried calling them but the phones were switched off,” said Kailash’s nephew Bhupender.", "url": "https://indianexpress.com/article/india/among-dead-motivational-speaker-called-to-address-company-employees-his-son/", "urlToImage": "https://indianexpress.com/wp-content/themes/indianexpress/images/IE-OGimage.jpg", "publishedAt": "2022-05-16T00:02:26Z", "content": "On Friday, motivational speaker Kailash Jyani (62) was invited to deliver a lecture to the staff of a commercial unit in Mundka. His son, Amit Jyani (37), had accompanied him for the event. Later tha… [+2092 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Arun Prakash", "title": "For a stronger navy, India needs to fast-track the submarine project", "description": "India should seek a foreign collaborator to make necessary adjustments, conduct collaborative trials.", "url": "https://indianexpress.com/article/opinion/columns/induction-of-submarines-project-75-i-indian-navy-7919079/", "urlToImage": "https://images.indianexpress.com/2022/05/oped-1.jpg", "publishedAt": "2022-05-16T00:02:16Z", "content": "A day before Prime Minister Narendra Modi was due to visit Paris to meet President Macron, the French defence major, Naval Group, announced its inability to participate in Indias Project 75-I, under … [+6220 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anju Agnihotri Chaba", "title": "Despite doubled MSP, target to sow cotton on 4L ha, experts unhappy", "description": "Experts believe that this target is far from Punjab’s potential, claiming that almost double the area was used to grow cotton in the state three decades ago.", "url": "https://indianexpress.com/article/cities/jalandhar/despite-doubled-msp-target-to-sow-cotton-on-4l-ha-experts-unhappy-7919109/", "urlToImage": "https://images.indianexpress.com/2022/05/cotton-1.jpg", "publishedAt": "2022-05-15T23:57:52Z", "content": "Despite farmers selling cotton at double the MSP set by the Centre and talks to bring more area under the crop as an alternative to paddy, the state only is targeting over 4-lakh hectares of land thi… [+3049 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Pranav Mukul", "title": "Vistara could merge with Air India, decision likely by end of 2023", "description": "SIA is learnt to have asked for time until the end of next year to decide whether it wants to go ahead. Tata Sons is the holding company of the Tata Group, which took over Air India from the government earlier this year. Vistara is the only other full-service…", "url": "https://indianexpress.com/article/business/aviation/vistara-could-merge-with-air-india-decision-likely-by-end-of-2023-7919104/", "urlToImage": "https://images.indianexpress.com/2022/05/air-india-1.jpg", "publishedAt": "2022-05-15T23:56:35Z", "content": "Tata Sons has held exploratory talks with Singapore Airlines (SIA), its joint-venture partner in Vistara, for a potential merger of the airline with Air India, multiple sources told The Indian Expres… [+4777 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Punjab, Haryana to restart wheat procurement", "description": "The decision was announced by CM Manohar Lal Khattar while speaking at “Haryana Pragati Rally” at Yamunanagar on Sunday.", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-haryana-to-restart-wheat-procurement-7919101/", "urlToImage": "https://images.indianexpress.com/2022/05/wheat-4.jpg", "publishedAt": "2022-05-15T23:53:09Z", "content": "Punjab and Haryana governments have decided that the wheat procurements in the two states will continue and the markets will remain open till May 31. The decision was announced by CM Manohar Lal Khat… [+1882 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anju Agnihotri Chaba", "title": "After announcement of MSP for moong: Summer moong cultivation touches 8-year high, a 42,000-acre jump from last fiscal", "description": "Agricultural experts said that the area being used to grow moong would have increased manifold if Punjab Chief Minister Bhagwant Mann had announced providing a Minimum Support Price (MSP) on moong before the sowing phase in April.", "url": "https://indianexpress.com/article/cities/jalandhar/after-announcement-of-msp-for-moong-summer-moong-cultivation-touches-8-year-high-a-42000-acre-jump-from-last-fiscal-7919097/", "urlToImage": "https://images.indianexpress.com/2022/05/indian-farmer2.jpg", "publishedAt": "2022-05-15T23:45:20Z", "content": "Summer moong cultivation in Punjab has touched an eight-year high of 96,000 acres (38,900 hectares) this year, an increase of around 42,000 acres (16,196 hectares) from the previous season.This is qu… [+3275 chars]"}]}