{"status": "ok", "totalResults": 305, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Kamaal Saiyed", "title": "Gujarat police most successful in busting drug rackets: Sanghavi", "description": "The home minister urged Gujarat residents to work together to make the state more safe and sound.", "url": "https://indianexpress.com/article/cities/surat/gujarat-police-most-successful-in-busting-drug-rackets-sanghavi-7895531/", "urlToImage": "https://images.indianexpress.com/2022/05/police-1-3.jpg", "publishedAt": "2022-05-01T00:25:41Z", "content": "The success rate of Gujarat police is highest in the country when it comes to busting big rackets of drugs, said state Home Minister Harsh Sanghavi in Surat Saturday. The state cops have done a treme… [+1661 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Lehripura Gate slab collapse: Mayor warns ASI of criminal prosecution if gate not restored", "description": "Some parts of the then derelict structure had fallen in 2013-14. The VMC had then safeguarded the structure to avoid casualty during traffic movement and approached the ASI for repairs.", "url": "https://indianexpress.com/article/cities/baroda/lehripura-gate-slab-collapse-mayor-warns-asi-of-criminal-prosecution-if-gate-not-restored-7895511/", "urlToImage": "https://images.indianexpress.com/2022/05/slab.jpeg", "publishedAt": "2022-05-01T00:18:51Z", "content": "Seven months after a major slab of the pre-Mughal historic Lehripura Gate in Vadodara came crashing down, Mayor Keyur Rokadia on Saturday issued a notice to the Archaeological Survey of India (ASI), … [+2857 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Peter Vidal", "title": "Weekly Horoscope, May 1, 2022 – May 7, 2022: Libra, Aries, Pisces and other signs — check astrological prediction", "description": "Leo, you'll be brimming over with sensible ideas for improving your domestic situation this week, although, in some strange way, anything that happens is strangely linked to professional affairs. Aquarius, friendly arrangements will bring practical gains assu…", "url": "https://indianexpress.com/article/horoscope/weekly-horoscope-may-1-2022-may-7-2022-libra-aries-pisces-and-other-signs-7895524/", "urlToImage": "https://images.indianexpress.com/2022/02/GettyImages-Pisces-zodiac-1200.jpg", "publishedAt": "2022-05-01T00:08:27Z", "content": "ARIES (Mar 21 – Apr. 20)If you’ve been sitting on the fence and generally prevaricating, seize an overdue chance to settle a personal matter. Helpful movements by Saturn will counteract Mercury’s obs… [+3722 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Trinamool MLA’s PA, 2 aides held for duping people of Rs 16 cr: Cops", "description": "Earlier, several alleged victims had written to TMC general secretary Abhishek Banerjee in this regard, it is learnt. The complainants are from Palashipara, Tehatta and Karimpur assembly constituencies. They wanted their money back since they got no job.", "url": "https://indianexpress.com/article/cities/kolkata/trinamool-mlas-pa-2-aides-held-for-duping-people-of-rs-16-cr-cops-7895518/", "urlToImage": "https://images.indianexpress.com/2022/04/indian-express-crime-1-2.jpg", "publishedAt": "2022-05-01T00:03:20Z", "content": "Trinamool Congress (TMC) MLA Tapas Saha’s personal assistant and two of his accomplices were arrested for allegedly duping people of Rs 16 crore by promising them jobs, police said.Saha, who is MLA f… [+969 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Oppn slams CM, Kolkata Police over ‘fabrication of court order’", "description": "ED officials, in their FIR registered on April 20 with the Delhi Police, have claimed that a court order was tampered with in a bid to make its Joint Director Kapil Raj provide a voice sample without his consent.", "url": "https://indianexpress.com/article/cities/kolkata/oppn-slams-cm-kolkata-police-over-fabrication-of-court-order-7895517/", "urlToImage": "https://images.indianexpress.com/2022/04/SU.jpeg", "publishedAt": "2022-04-30T23:52:50Z", "content": "Leader of Opposition in the state Assembly Suvendu Adhikari on Saturday slammed Chief Minister Mamata Banerjee and the police administration following the reports that the Enforcement Directorate (ED… [+1867 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "BJP MP Arjun Singh called to Delhi day after his letter to CM", "description": "The development comes in the backdrop of Singh relentlessly “targeting” the Centre for allegedly neglecting the jute industry's interest in West Bengal.", "url": "https://indianexpress.com/article/cities/kolkata/bjp-mp-arjun-singh-called-to-delhi-day-after-his-letter-to-cm-7895516/", "urlToImage": "https://images.indianexpress.com/2022/04/WB-Arjunn-2col.jpg", "publishedAt": "2022-04-30T23:49:53Z", "content": "A day after he wrote a letter to Chief Minister Mamata Banerjee, seeking her intervention in the raw jute price capping issue, BJP MP Arjun Singh was on Saturday called to Delhi.The development comes… [+1903 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Relief from heat wave as rain lashes south Bengal", "description": "The Alipore meteorological office said that there will be no heatwave in the next four to five days. Temperature in the western districts will remain below 40 degrees, the weather officials said.", "url": "https://indianexpress.com/article/cities/kolkata/relief-from-heat-wave-as-rain-lashes-south-bengal-7895515/", "urlToImage": "https://images.indianexpress.com/2022/04/Kolkata-rains.jpg", "publishedAt": "2022-04-30T23:46:52Z", "content": "People in south Bengal got some relief from an intense heatwave with first rain and thunderstorm of the season lashing Kolkata and surrounding areas on Saturday evening.Temperatures dropped by 4-5 de… [+861 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Amit Shah on 3-day Bengal visit from May 4", "description": "Since winning 77 seats in the Assembly polls last year and becoming the main Opposition in the state, the BJP has failed to win a single election in Bengal.", "url": "https://indianexpress.com/article/cities/kolkata/amit-shah-on-3-day-bengal-visit-from-may-4-7895512/", "urlToImage": "https://images.indianexpress.com/2022/04/Nodal-amit-shah-2col.jpg", "publishedAt": "2022-04-30T23:44:19Z", "content": "Union Home Minister Amit Shah will be on a three-day visit to West Bengal from May 4 in a bid to rejuvenate the BJP cadres and stop infighting in the party’s state unit ahead of the 2024 Lok Sabha el… [+2181 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "SP MLA booked for assaulting power station staffer: Police", "description": "But the power station worker says that the MLA started misbehaving with him and beat him up, the ASP said. “We are investigation the matter further,” he added.", "url": "https://indianexpress.com/article/cities/lucknow/sp-mla-booked-for-assaulting-power-station-staffer-police-7895509/", "urlToImage": "https://images.indianexpress.com/2022/04/Indian-expressss-1.jpg", "publishedAt": "2022-04-30T23:31:31Z", "content": "A Samajwadi Party (SP) MLA and his supporters were booked for allegedly assaulting an employee at a power sub-station in Budaun district late Thursday.Sub-station operator Abhishek Mishra lodged a co… [+1192 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Santosh Singh, Nihal Koshie", "title": "Pinarayi writes to Nitish on basketball player’s suicide, her coach is named in case", "description": "Lithara, 23, from Kunumal village in Vadakara, Kozhikode, was employed by the Railways under the sports quota and was posted at the Divisional Railway Manager’s office in Danapur, Bihar.", "url": "https://indianexpress.com/article/india/pinarayi-writes-to-nitish-on-basketball-players-suicide-her-coach-is-named-in-case-7895508/", "urlToImage": "https://images.indianexpress.com/2022/05/Pinarayi.jpg", "publishedAt": "2022-04-30T23:23:02Z", "content": "A DAY after Kerala Chief Minister Pinarayi Vijayan wrote to his Bihar counterpart Nitish Kumar asking for a comprehensive and fair investigation into the alleged suicide of a national level basketbal… [+2513 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "2nd phase of gold hallmarking from June 1", "description": "AHC stands for Assaying and Hallmarking Centres where a consumer can get the purity of their unhallmarked gold jewellery tested.", "url": "https://indianexpress.com/article/business/commodities/2nd-phase-of-gold-hallmarking-from-june-1-7895503/", "urlToImage": "https://images.indianexpress.com/2022/05/goldie.jpg", "publishedAt": "2022-04-30T23:13:39Z", "content": "The second phase of the mandatory hallmarking of gold jewellery and gold artefacts will come into force from June 1, the Union Ministry of Consumer Affairs, Food and Public Distribution said on Satur… [+3 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Panchayat minister forced admin officials to not hold elections, alleges Sukhpal Khaira", "description": "", "url": "https://indianexpress.com/article/cities/chandigarh/panchayat-minister-forced-admin-officials-to-not-hold-elections-alleges-sukhpal-khaira-7895506/", "urlToImage": "https://images.indianexpress.com/2021/11/sukhbir.jpg", "publishedAt": "2022-04-30T23:10:39Z", "content": "Bholath MLA and former Leader of Opposition Sukhpal Singh Khaira levelled serious allegations against Panchayat Minister Kuldeep Dhaliwal, saying that he put pressure on the Kapurthala district admin… [+152 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Divya Goyal", "title": "Why in land of Guru Nanak, Patiala clash is an aberration", "description": "Centuries later, even as India and Pakistan became two different countries, the followers of Nanak, irrespective of being Hindu or Sikh, continued to follow his ideals and call themselves 'Nanakpanthis' or 'Guru Nanak Naam Lewas'.", "url": "https://indianexpress.com/article/cities/chandigarh/why-in-land-of-guru-nanak-patiala-clash-is-an-aberration-7895501/", "urlToImage": "https://images.indianexpress.com/2022/05/ch.jpg", "publishedAt": "2022-04-30T23:07:40Z", "content": "It was October 14, 2015 and for several days after, the angry residents of Punjab were on the roads. The roads in entire state — from villages to highways– were blocked protests raged against the sac… [+6391 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Amil Bhatnagar", "title": "Take 5: I keep lemons in thermocol box with ice so they don’t go stale, says lemonade seller in Delhi", "description": "A lemonade seller was beaten to death in Ghaziabad allegedly for using stale lemons to make the drink.  Lemon prices have seen an unprecedented surge, with a single lemon retailing between Rs 10-15 in markets", "url": "https://indianexpress.com/article/india/take-5-lemonade-seller-in-delhi-interview-7895448/", "urlToImage": "https://images.indianexpress.com/2022/05/TAKEFIVEXZ1.jpg", "publishedAt": "2022-04-30T22:57:51Z", "content": "A lemonade seller was beaten to death in Ghaziabad allegedly for using stale lemons to make the drink. Lemon prices have seen an unprecedented surge, with a single lemon retailing between Rs 10-15 in… [+1301 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Cops on Gorakhpur Temple attack: Accused had links with IS sympathisers", "description": "On the state government's order, the state police’s Anti-Terrorist Squad (ATS) is investigating the case. The agency had invoked different sections of the Unlawful Activities Prevention Act (UAPA) against Murtaza.", "url": "https://indianexpress.com/article/cities/lucknow/cops-on-gorakhpur-temple-attack-accused-had-links-with-is-sympathisers-7895499/", "urlToImage": "https://images.indianexpress.com/2022/05/cop-2-1.jpg", "publishedAt": "2022-04-30T22:56:37Z", "content": "The Uttar Pradesh Police claimed that Gorakhpur Temple attack accused Ahmed Murtaza Abbasi was in touch with ISIS sympathisers and fighters and was preparing to carry out a big incident after snatchi… [+2447 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Raakhi Jagga", "title": "Mann’s big push for saving water: Rs 1,500 per acre bonus to farmers adopting DSR", "description": "Under the DSR technique, paddy seeds are drilled into the field with the help of a machine that also sprays herbicide simultaneously. In the traditional method, paddy saplings are raised in nurseries and then uprooted and transplanted in a puddled field.", "url": "https://indianexpress.com/article/cities/chandigarh/manns-big-push-for-saving-water-rs-1500-per-acre-bonus-to-farmers-adopting-dsr-7895500/", "urlToImage": "https://images.indianexpress.com/2022/04/BHAGWANT-MANNNN.jpg", "publishedAt": "2022-04-30T22:50:05Z", "content": "In a move aimed at checking the depleting groundwater table, Punjab Chief Minister Bhagwant Mann Saturday announced a bonus of Rs 1500 per acre to those farmers who will take up direct sowing of rice… [+3166 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Jagpreet Singh Sandhu", "title": "‘Kids can’t be allowed to be the score to settle personal egos of parents’", "description": "While disposing her plea, the single bench had directed the Police Commissioner, Amritsar to decide her representation within a period of wight weeks, as her application with similar grievance was pending before the Punjab Police.", "url": "https://indianexpress.com/article/cities/chandigarh/kids-cant-be-allowed-to-be-the-score-to-settle-personal-egos-of-parents-7895497/", "urlToImage": "https://images.indianexpress.com/2022/04/Punjab-and-Haryana-HC-2.jpeg", "publishedAt": "2022-04-30T22:45:08Z", "content": "Holding that the custody of the children cannot be allowed to be the score to settle personal egos of parents, the Punjab and Haryana High Court has dismissed an appeal filed by woman challenging a s… [+3321 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "FISME plans collateral-free MSME lending platform", "description": "The platform is being set up by the Federation of Indian Micro and Small & Medium Enterprises (FISME) and Eqaro Surety Pvt Ltd, a provider of financial guarantees.", "url": "https://indianexpress.com/article/business/commodities/fisme-plans-collateral-free-msme-lending-platform-7895496/", "urlToImage": "https://images.indianexpress.com/2022/05/pexels-digital-banking-1200.jpg", "publishedAt": "2022-04-30T22:39:11Z", "content": "Aimed at fulfilling the need for urgent funds, a digital lending platform is being created to provide access to collateral-free capital up to Rs  25 lakh to micro, small and medium enterprises (MSMEs… [+1086 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Raakhi Jagga", "title": "Punjab: 33% more demand for power in April this year; PSPCL says didn’t falter in supply", "description": "Unscheduled power cuts and curbs on industry were imposed during these days only, they claimed.", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-33-more-demand-for-power-in-april-this-year-pspcl-says-didnt-falter-in-supply-7895494/", "urlToImage": "https://images.indianexpress.com/2022/04/power22-5-1-1.jpg", "publishedAt": "2022-04-30T22:31:49Z", "content": "Punjab witnessed a 33% surge in its power demand in April (between April 1 and April 28) this year, as compared to the same period last year, with Punjab State Power Corporation Limited (PSPCL) claim… [+3280 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Ankita Dwivedi Johri", "title": "Eat. Pray. Study. Repeat.", "description": "Every weekend, Puja Sharma turns up at Patna’s Kali Ghat by the Ganga to appear for free mock tests that she hopes will help her take a shot at a government job. The schedule is punishing, but like hundreds of other students, Puja knows a sarkari job is “all …", "url": "https://indianexpress.com/article/cities/patna/express-exclusive-sarkari-job-gujarat-eat-pray-study-repeat-7895441/", "urlToImage": "https://images.indianexpress.com/2022/05/sunday-1.jpg", "publishedAt": "2022-04-30T22:31:19Z", "content": "For as long as she can remember, Puja Sharma has had a craze for a government job. And a spot in the Railways is her ekdum dream job (just my dream job).A year ago, that craze is what brought her to … [+5949 chars]"}]}