{"status": "ok", "totalResults": 419, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "‘Growing discontent’: ‘Denied’ party posts, 20 local BJP leaders resign in Jalpaiguri", "description": "Local TMC leader Mohua Gope said, “BJP is no longer in Jalpaiguri. Everyone is leaving the party here. Those who helped the party grow in the district were denied posts.”", "url": "https://indianexpress.com/article/cities/kolkata/growing-discontent-denied-party-posts-20-local-bjp-leaders-resign-in-jalpaiguri-7934562/", "urlToImage": "https://images.indianexpress.com/2022/05/Arjun-Singh-Main-1.jpeg", "publishedAt": "2022-05-25T00:40:33Z", "content": "Days after BJP MP Arjun Singh returned to TMC, the ongoing infighting in the BJP has intensified with around 20 local leaders tendering a mass resignation after they could not find posts in the local… [+1252 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Post-poll violence case: Anubrata skips CBI questioning, cites poor health, say officials", "description": "Mondal had on May 21 returned to his hometown Bolpur in Birbhum district after a stay of around one-and-half months in the city where he had arrived to appear before the CBI for questioning in another case on cattle smuggling.", "url": "https://indianexpress.com/article/cities/kolkata/west-bengal-post-poll-violence-elections-cbi-anubrata-mondal-7934556/", "urlToImage": "https://images.indianexpress.com/2022/05/ANUBRATA-MONDAL-1.jpg", "publishedAt": "2022-05-25T00:35:46Z", "content": "Trinamool Birbhum district president Anubrata Mondal, who is being grilled in connection with alleged trans-border cattle smuggling and post-poll violence cases, didn’t appear before the agency on Tu… [+758 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Hina Rohtaki", "title": "General House meeting: Agenda to restore fuel limit for official cars to be tabled", "description": "An agenda will be brought in the House for final approval, in this regard. The meeting is scheduled to take place on May 27.", "url": "https://indianexpress.com/article/cities/chandigarh/general-house-meeting-agenda-to-restore-fuel-limit-for-official-cars-to-be-tabled-7934542/", "urlToImage": "https://images.indianexpress.com/2022/05/fuel.jpg", "publishedAt": "2022-05-25T00:35:30Z", "content": "The General House will discuss the restoring fuel limit for official staff cars of the Municipal Corporation. There was a 20 per cent cut done for the provision of fuel of employees during Covid.An a… [+1648 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Hina Rohtaki", "title": "‘Redevelopment’ project: MC to fritter away nearly a crore to dismantle, redo parts of green belt", "description": "Agenda to be tabled in the upcoming Finance and Contract Committee meeting on May 31", "url": "https://indianexpress.com/article/cities/chandigarh/redevelopment-project-mc-to-fritter-away-nearly-a-crore-to-dismantle-redo-parts-of-green-belt-7934547/", "urlToImage": "https://images.indianexpress.com/2022/05/CHD-REDEVELOPMENT.jpg", "publishedAt": "2022-05-25T00:35:22Z", "content": "The Chandigarh civic body will be redeveloping what seems to an already developed green belt including the plush Bougainvillea Garden citing that “the sites need development”. Agendas for the same wi… [+2074 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "History-sheeter killed by wife, her brother in Mehsana: Police", "description": "According to police, the victim Gopal Rathod, a resident of Gopinala, was found dead with severe injuries at his residence on Tuesday morning.", "url": "https://indianexpress.com/article/cities/ahmedabad/history-sheeter-killed-by-wife-her-brother-in-mehsana-police-7934557/", "urlToImage": "https://images.indianexpress.com/2022/05/arrest-2-7-9.jpeg", "publishedAt": "2022-05-25T00:32:35Z", "content": "A 40-year-old man, who was accused in several criminal cases, was allegedly killed by his wife and brother-in-law in Mehsana on Monday night.According to police, the victim Gopal Rathod, a resident o… [+731 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Cong’s Solanki faces heat for Ram temple remarks, says BJP ‘siphoned’ donations", "description": "Bharatsinh Solanki was speaking at the Other Backward Caste (OBC) Sammelan of the Congress at Dholka of Ahmedabad Tuesday.", "url": "https://indianexpress.com/article/cities/ahmedabad/congs-solanki-faces-heat-for-ram-temple-remarks-says-bjp-siphoned-donations-7934550/", "urlToImage": "https://images.indianexpress.com/2022/05/Bharatsinh-Solanki-1200.jpeg", "publishedAt": "2022-05-25T00:29:19Z", "content": "Former Gujarat Congress president Bharatsinh Solanki was on the receiving end Tuesday for his controversial statement about the under-construction Ram Temple in Ayodhya. He also accused the BJP of du… [+2399 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "SSC job ‘scam’: Education minister Adhikary ‘defies CBI directive’, leaves Kolkata for Cooch Behar", "description": "Adhikary left the Forward Bloc and joined TMC in 2018. Incidentally, his daughter was recruited as a teacher the same year.", "url": "https://indianexpress.com/article/cities/kolkata/west-bengal-teachers-recruitment-scam-ssc-job-7934545/", "urlToImage": "https://images.indianexpress.com/2022/05/adhikary.jpg", "publishedAt": "2022-05-25T00:29:00Z", "content": "Minister of State for Education Paresh Chandra Adhikary, who is under the CBI scanner over his alleged involvement in the illegal appointment of his daughter Ankita Adhikary as an assistant teacher i… [+2424 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "AAP, BTP carry out joint rally in Bharuch, Narmada", "description": "AAP has started conducting Parivartan Yatras in tribal districts of the state along with BTP from May 15 onwards, starting from Umargam in Valsad district. On Monday the yatra entered Narmada and Bharuch districts.", "url": "https://indianexpress.com/article/cities/surat/aap-btp-carry-out-joint-rally-in-bharuch-narmada-7934543/", "urlToImage": "https://images.indianexpress.com/2022/05/Kejriwal-Gujarat-1.jpeg", "publishedAt": "2022-05-25T00:25:58Z", "content": "Leaders of the Aam Aadmi Party (AAP) and the Bharatiya Tribal Party (BTP) jointly carried out a Parivartan Yatra in talukas of Bharuch and Narmada districts Monday and Tuesday, ahead of the upcoming … [+2023 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Suvendu slams TMC: ‘Govt attitude biased, BJP MLAs will approach HC’", "description": "Adhikari also said the BJP MLAs from Purba Medinipur district who were not invited for Tuesday's meeting would move the Calcutta High Court against this “discriminatory” attitude of the state government.", "url": "https://indianexpress.com/article/cities/kolkata/suvendu-slams-tmc-govt-attitude-biased-bjp-mlas-will-approach-hc-bjp-7934534/", "urlToImage": "https://images.indianexpress.com/2022/05/Suvendu.jpg", "publishedAt": "2022-05-25T00:21:05Z", "content": "LEADER OF Opposition in the state Assembly Suvendu Adhikari on Tuesday targeted the TMC government in the state for its discriminatory attitude and alleged that the government did not invite the BJP … [+1581 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "AMC officials ‘instructed’ to withhold birth, death figures: PIO tells SIC", "description": "The Public Information Officer (PIO), in response to an appeal filed before the Gujarat Information Commissioner (GIC), has submitted that the information was refused by officials who anticipated that the data would “create an atmosphere of fear”.", "url": "https://indianexpress.com/article/cities/ahmedabad/amc-officials-instructed-to-withhold-birth-death-figures-pio-tells-sic-7934533/", "urlToImage": "https://images.indianexpress.com/2022/05/amc-1.jpeg", "publishedAt": "2022-05-25T00:19:59Z", "content": "There was verbal instruction from higher authorities of the Ahmedabad Municipal Corporation (AMC) to withhold the birth and death registrations from 2019 to June 2021 to preempt any fear among citize… [+4279 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Raju Bhargava appointed Rajkot police commissioner", "description": "An IPS officer of the 1995 batch, Bhargava is currently an officer of the ADGP rank. He was serving as the Additional Director General of Police (Armed Units) of Gujarat in Gandhinagar prior to the new appointment.", "url": "https://indianexpress.com/article/cities/rajkot/raju-bhargava-appointed-rajkot-police-commissioner-7934531/", "urlToImage": "https://images.indianexpress.com/2022/05/express-photo-13-8.jpeg", "publishedAt": "2022-05-25T00:12:57Z", "content": "The state government has appointed Raju Bhargava the new commissioner of the Rajkot city police Tuesday, around two months after Manoj Agarwal was transferred amid allegations of corruption."}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manoj Dattatrye More", "title": "As Sena fields Kolhapur leader for sixth RS seat, ‘betrayed’ Sambhajiraje slams party", "description": "The Shiv Sena will be fielding two candidates for two RS seats, Sanjay Raut and Sanjay Pawar, said party leaders.", "url": "https://indianexpress.com/article/cities/pune/as-sena-fields-kolhapur-leader-for-sixth-rs-seat-betrayed-sambhajiraje-slams-party-7934524/", "urlToImage": "https://images.indianexpress.com/2022/05/Sambhajiraje-Chhatrapati-2.jpg", "publishedAt": "2022-05-25T00:10:53Z", "content": "AFTER THE Shiv Sena on Tuesday said Sanjay Pawar will be its candidate for the sixth Rajya Sabha (RS) seat from Maharashtra, former RS MP Sambhajiraje Chhatrapati slammed the Sena and claimed that he… [+1966 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Avinash Nair", "title": "Subsidised seeds and fertilisers kits: Gujarat govt targets 1.2 L tribal farmers; highest in 7 years", "description": "On Tuesday, the government began distributing kits containing fertilisers and seeds. The estimated cost of one kit is Rs 3,240, but the beneficiaries are charged Rs 250, said officials.", "url": "https://indianexpress.com/article/cities/ahmedabad/subsidised-seeds-and-fertilisers-kits-gujarat-govt-targets-1-2-l-tribal-farmers-highest-in-7-years-7934525/", "urlToImage": "https://images.indianexpress.com/2022/05/fertiliser.jpeg", "publishedAt": "2022-05-25T00:10:39Z", "content": "With the assembly elections around the corner, the Gujarat government has targeted to provide seeds and fertilisers at highly subsidised rates to 1.23 lakh tribal farmers as part of the Krushi Vaivid… [+2515 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Gopal B Kateshiya", "title": "Will take all communities along for Project Lion, says Bhupendra Yadav", "description": "The Union Minister wound up his two-day long visit to Gir forest in Junagadh for firming up the plan for the proposed Project Lion.", "url": "https://indianexpress.com/article/cities/ahmedabad/will-take-all-communities-along-for-project-lion-says-bhupendra-yadav-7934516/", "urlToImage": "https://images.indianexpress.com/2022/05/bhupendra-yadav-1-1.jpeg", "publishedAt": "2022-05-25T00:05:41Z", "content": "The Centre will draw up plans for conservation of Gir ecosystem in the coming days by taking along local communities and stakeholders, Union Minister of Environment Forest and Climate Change Bhupendr… [+3965 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Parthasarathi Biswas", "title": "Maharashtra’s chana procurement all set to cross target of 6.8-lakh tonne", "description": "One of the main issues which marked this year’s procurement was the extra long window given to farmers to register for the process.", "url": "https://indianexpress.com/article/cities/pune/maharashtras-chana-procurement-all-set-to-cross-target-of-6-8-lakh-tonne-7934521/", "urlToImage": "https://images.indianexpress.com/2022/05/chana-dal.jpg", "publishedAt": "2022-05-25T00:04:59Z", "content": "AT the fag end of Maharashtras chana procurement season, the state looks set to cross the 6.89 lakh tonnes of target given to it under the Price Support Scheme (PSS). In some districts, sub agents of… [+2814 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Pune Knowledge Cluster to offer scholarships to help girl students", "description": "Pune news: Over the next two years, PKC will provide scholarships for three, six or nine months to 43 women from under privileged backgrounds to work in this field under the WEnyan (Women in Education) scholarship.", "url": "https://indianexpress.com/article/cities/pune/pune-knowledge-cluster-to-offer-scholarships-to-help-girl-students-7934515/", "urlToImage": "https://images.indianexpress.com/2022/05/girls-school.jpg", "publishedAt": "2022-05-24T23:57:04Z", "content": "NEXT MONTH, the Pune Knowledge Cluster (PKC) is going to launch its maiden scholarship programme for girls in Maharashtra who are keen on pursuing higher studies, and research in chemistry and its al… [+1070 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Yogesh Naik", "title": "Mumbai civic polls: Campaign yet to take off, Congess leaders worried over strategy", "description": "Mumbai news: Mumbai Congress working president Charansingh Sapra said, “We are aggressive in the run-up to the election. We are exposing Sena's corruption in project-affected persons’ accommodation and sewage treatment plant scam.", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-civic-polls-campaign-yet-to-take-off-congess-leaders-worried-over-strategy-7934511/", "urlToImage": "https://images.indianexpress.com/2022/05/express-photo-13-5-4.jpg", "publishedAt": "2022-05-24T23:40:18Z", "content": "Even as the Bharatiya Janata Party (BJP) and the Shiv Sena have been publicly battling it out for the upcoming BMC elections with allegations and counter allegations, Congress campaign has yet to tak… [+3703 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sadaf Modak", "title": "Elgaar Parishad accused Gorkhe goes on hunger strike", "description": "Apart from this, Gorkhe’s hunger strike is also against alleged harassment caused due to jail administration, a letter written by him to the state’s home minister stated.", "url": "https://indianexpress.com/article/cities/mumbai/elgaar-parishad-accused-sagar-gorkhe-goes-on-hunger-strike-taloja-jail-7934505/", "urlToImage": "https://images.indianexpress.com/2022/05/jails-759.jpg", "publishedAt": "2022-05-24T23:30:08Z", "content": "Marking his protest against the jail authorities for seizing mosquito nets of undertrials at Taloja Central jail along with other issues at the prison, Elgaar Parishad accused and activist Sagar Gork… [+2209 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Leena Misra", "title": "(Joining) BJP an option, AAP has better strategy than Congress: Hardik Patel", "description": "According to him, the Gujarat elections will “not be interesting as it will be one-sided” but he would “play a better role” than in 2017.", "url": "https://indianexpress.com/article/cities/ahmedabad/joining-bjp-an-option-aap-has-better-strategy-than-congress-hardik-patel-7934468/", "urlToImage": "https://images.indianexpress.com/2022/05/hardik-2-1.jpg", "publishedAt": "2022-05-24T23:26:58Z", "content": "DAYS AFTER resigning from the Congress in Gujarat, Patidar leader Hardik Patel told The Indian Express on Tuesday that he would play an important role in the Assembly elections later this year which,… [+2997 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mumbai: Development authority hands over information house to DGIPR", "description": "Chief Minister Uddhav Thackeray was the chief guest at the event that saw the MoU being signed between DGIPR principal secretary Deepak Kapoor and CIDCO managing director Sanjay Mukherjee at Sahyadri Guest House.", "url": "https://indianexpress.com/article/cities/mumbai/development-authority-hands-over-information-house-to-dgipr-7934503/", "urlToImage": "https://images.indianexpress.com/2022/05/express-photo-13-5-3.jpg", "publishedAt": "2022-05-24T23:21:57Z", "content": "A memorandum of understanding (MoU) regarding handing over of Information House (Mahiti Bhavan) at Nerul in Navi Mumbai from City Industrial Development Corporation (CIDCO) to Directorate General of … [+1785 chars]"}]}