{"status": "ok", "totalResults": 784, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Local body polls: Maharashtra govt to seek SC order on lines of MP for OBC quota, says MVA", "description": "Mumbai news: On May 18, the Supreme Court had allowed Madhya Pradesh to hold local body elections with OBC quota after the government submitted the backward class commission’s empirical data report specifying the OBC population in the poll-bound local bodies …", "url": "https://indianexpress.com/article/cities/mumbai/local-body-polls-state-govt-to-seek-sc-order-on-lines-of-mp-for-obc-quota-mva-7934493/", "urlToImage": "https://images.indianexpress.com/2022/05/voting-1200-3.jpg", "publishedAt": "2022-05-24T22:47:21Z", "content": "A day after the state election commission asked the Brihanmumbai Municipal Corporation (BMC) and 13 other civic bodies to hold reservation lottery without OBC seats, leaders of the Maha Vikas Aghadi … [+2582 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "Sebi to Chitra Ramkrishna: Pay Rs 3.1 crore or face arrest, asset attachment", "description": "The notice came after Ramkrishna failed to pay the fine imposed on her by the regulator.", "url": "https://indianexpress.com/article/business/sebi-to-chitra-ramkrishna-pay-rs-3-1-crore-or-face-arrest-asset-attachment-7934337/", "urlToImage": "https://images.indianexpress.com/2022/05/chitra-1-1.jpg", "publishedAt": "2022-05-24T22:45:11Z", "content": "The Securities and Exchange Board of India (Sebi) on Tuesday sent a notice to former MD &amp; CEO of NSE, Chitra Ramkrishna, asking her to pay Rs 3.12 crore in a case related to governance lapses at … [+1329 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shubhajit Roy", "title": "Biden to Modi: Thank you for your commitment to make democracies deliver", "description": "“There’s so much that our countries can and will do together, and I am committed to making the US-India partnership among the closest we have on Earth,” Biden said as the bilateral began.", "url": "https://indianexpress.com/article/india/biden-to-modi-thank-you-for-your-commitment-to-make-democracies-deliver-7934394/", "urlToImage": "https://images.indianexpress.com/2022/05/modi-biden-5.jpg", "publishedAt": "2022-05-24T22:41:14Z", "content": "Setting aside their differences over the Russian invasion of Ukraine, Prime Minister Narendra Modi told US President Joe Biden in Tokyo Tuesday that the India-US strategic partnership is truly a part… [+4597 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "As CVSL shuts, parents struggle for alternatives for wards", "description": "Mumbai news: While the parents are still exploring the possibility of legal action, the focus right now is to ensure no academic loss of children.", "url": "https://indianexpress.com/article/cities/mumbai/as-cvsl-shuts-parents-struggle-for-alternatives-for-wards-7934491/", "urlToImage": "https://images.indianexpress.com/2022/05/CathedralVidyaSchoolLonavala-3col-1.jpg", "publishedAt": "2022-05-24T22:32:57Z", "content": "Even as the management of the Cathedral Vidya School in Lonavala (CVSL) has decided to shut the school, the parents are not ready to accept it yet. They are demanding that the school should run at le… [+2563 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Badri Narayan", "title": "What wins votes today is ‘trust capital’", "description": "Unlike charisma, which denotes the magical pull of a political leader, trust capital is acquired slowly by building connections and delivering on promises.", "url": "https://indianexpress.com/article/opinion/columns/what-wins-votes-today-is-trust-capital-elections-india-7934403/", "urlToImage": "https://images.indianexpress.com/2022/05/voting.jpg", "publishedAt": "2022-05-24T22:30:58Z", "content": "The most valuable asset in the political arena today is trust capital. It has emerged as the key factor in ensuring the winnability in elections. This trust is acquired as a result of the intricate w… [+4216 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anand Mohan J", "title": "Qutub Minar plea: ASI says worship can’t be allowed; court verdict June 9", "description": "Additional District Judge Nikhil Chopra flagged two key aspects in the case — the right to worship and the character of the structure. The district court questioned how one can claim a legal right for restoration for something that happened 800 years ago.", "url": "https://indianexpress.com/article/cities/delhi/qutub-minar-plea-asi-says-worship-cant-be-allowed-court-verdict-june-9-7934427/", "urlToImage": "https://images.indianexpress.com/2022/05/Qutub-Minar-1-1.jpg", "publishedAt": "2022-05-24T22:30:51Z", "content": "With the Archeological Survey of India (ASI) maintaining that the Qutub Minar complexs status cannot be changed to allow worship, a Delhi court Tuesday reserved till June 9 its order on a plea seekin… [+4879 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Jignasa Sinha", "title": "Gmail to CCTV, a family’s frantic search for singer ends with her body buried near Haryana highway", "description": "According to the police, the charge of gangrape is yet to be proved, but they have information to suggest that the singer was drugged, kidnapped and strangled.", "url": "https://indianexpress.com/article/cities/delhi/gmail-to-cctv-a-familys-frantic-search-for-singer-ends-with-her-body-buried-near-haryana-highway-7934422/", "urlToImage": "https://images.indianexpress.com/2022/05/dalit-singer-death.jpg", "publishedAt": "2022-05-24T22:30:47Z", "content": "SHE WAS a civil defence volunteer who started uploading music videos on YouTube to support her family. Soon, she began performing at shows, making her mark in the local circuit. Until she disappeared… [+4197 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shubhajit Roy", "title": "Quad signs off on Indo-Pacific: Split on Russia, unity on China", "description": "Significantly, while Washington and Tokyo were vocal in their criticism of Moscow — both US President Joe Biden and Japanese PM Fumio Kishida named Russia in their public statements — India and Australia did not do so in their opening statements at the summit.", "url": "https://indianexpress.com/article/india/quad-signs-off-on-indo-pacific-split-on-russia-unity-on-china-7934390/", "urlToImage": "https://images.indianexpress.com/2022/05/quad-4.jpg", "publishedAt": "2022-05-24T22:30:23Z", "content": "At the fourth Quad summit the second since the Russian invasion of Ukraine there were divergences among the leaders of Australia, India, Japan and US on the war in Europe but unanimity in their respo… [+7010 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Peter Vidal", "title": "Horoscope Today, May 25, 2022: Cancer, Leo, Libra and other signs — check astrological prediction", "description": "Horoscope Today, May 25, 2022: Gemini, The correct way for you to go at the moment is towards ethical actions and high standards.", "url": "https://indianexpress.com/article/horoscope/horoscope-today-may-25-2022-cancer-leo-libra-and-other-signs-check-astrological-prediction-7933437/", "urlToImage": "https://images.indianexpress.com/2022/05/HORO.jpg", "publishedAt": "2022-05-24T22:30:15Z", "content": "The risky planetary situation is compounded by lunar formations which create confusion. One option you may wish to consider today is to turn down lively opportunities and go for peace and quiet. A fe… [+3353 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Nirupama Subramanian", "title": "Explained: The new Indo-Pacific bloc", "description": "12 countries including India have agreed to join the Indo-Pacific Economic Framework launched by the US. Why has Washington felt the need for such a framework, and what is in it for those who are part of it?", "url": "https://indianexpress.com/article/explained/indo-pacific-economic-framework-launched-by-the-us-joe-biden-modi-meet-7934369/", "urlToImage": "https://images.indianexpress.com/2022/05/biden-modi-4col-1.jpg", "publishedAt": "2022-05-24T22:30:10Z", "content": "The Indo-Pacific Economic Framework, launched by United States President Joe Biden on Monday and being joined by 12 other countries including India, is Washingtons answer to the Trans Pacific Partner… [+5931 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "George Mathew", "title": "Rising global rates, Re fall may scale down India Inc ECB plans", "description": "The weighted average cost had come down to 1.2 per cent over LIBOR in FY19, but has started increasing subsequently and was at 1.81 per cent in FY22. This is expected to increase further in the coming months with global central banks planning to hike the rate…", "url": "https://indianexpress.com/article/business/economy/rising-global-rates-re-fall-may-scale-down-india-inc-ecb-plans-7934334/", "urlToImage": "https://images.indianexpress.com/2022/05/indian-rupee-bloomberg-759.jpg", "publishedAt": "2022-05-24T22:30:02Z", "content": "The rise in global interest rates and the depreciation of the rupee is likely to reduce the appetite of India Inc to mobilise funds through external commercial borrowings (ECBs) in the coming months.… [+4422 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mumbai: Statements from Dawood kin in ED chargesheet claim he lives in Karachi", "description": "Mumbai news: The ED has recorded the statements of Alishah Kaskar, Ibrahim’s nephew and son of his sister, Haseena Parkar, brother Iqbal Kaskar and brother-in-law of Dawood’s aide Chhota Shakeel, among others.", "url": "https://indianexpress.com/article/cities/mumbai/statements-from-dawood-ibrahim-kin-in-ed-chargesheet-claim-he-lives-in-karachi-7934489/", "urlToImage": "https://images.indianexpress.com/2022/05/dawood-ibrahim-1200-2.jpg", "publishedAt": "2022-05-24T22:24:34Z", "content": "Statements part of the Enforcement Directorate (ED) chargesheet in the money laundering case filed in connection with a property in Kurla, claim that international fugitive gangster Dawood Ibrahim li… [+1710 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Complaint filed: Thane prison constable ‘goes missing’ after making graft allegations against superior", "description": "Mumbai news: When Pallewad did not return home from work on Saturday, his wife Mamta approached the Thane Nagar police where a missing persons complaint was registered.", "url": "https://indianexpress.com/article/cities/mumbai/thane-central-prison-mumbai-constable-missing-7934487/", "urlToImage": "https://images.indianexpress.com/2022/05/express-photo-13-5-2.jpg", "publishedAt": "2022-05-24T22:19:06Z", "content": "A CONSTABLE from Thane Central Prison, who had recently made allegations against the jail superintendent, has been missing since Saturday, according to his family members. The kin of constable Ashok … [+1730 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Court directs Rana couple: ‘Propose regularisation of unauthorised structure to BMC’", "description": "Mumbai news: The BMC has alleged that there has been 'unauthorised' construction by the couple at their Khar residence and a notice was issued to them under the Mumbai Municipal Corporation (MMC) Act.", "url": "https://indianexpress.com/article/cities/mumbai/court-navneet-ravi-rana-couple-propose-regularisation-of-unauthorised-structure-to-bmc-hanuman-chalisa-7934485/", "urlToImage": "https://images.indianexpress.com/2022/05/navneet-ravi-rana-1.jpg", "publishedAt": "2022-05-24T22:13:50Z", "content": "A Mumbai civil court Tuesday directed Navneet Rana and Ravi Rana to make a proposal to the BMC within a month for regularisation of a structure over which the civic body had sent them a notice.The BM… [+1067 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "The $1,600 question", "description": "How to charge an absurd amount of money for a terribly mundane item: Slap a snobby logo on it", "url": "https://indianexpress.com/article/opinion/editorials/the-1600-question-umbrella-china-social-media-gucci-adidas-parasol-7934424/", "urlToImage": "https://images.indianexpress.com/2022/05/editorial-11-3.jpeg", "publishedAt": "2022-05-24T22:00:21Z", "content": "Would you spend $1,600 on a non-waterproof umbrella? It might help to know that it will probably keep out the sun. On the other hand, the fact that it has the bare minimum functionality to qualify as… [+1665 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sanjana Bhalerao", "title": "Mumabi: Sloth bear Shiva delights visitors at Byculla zoo", "description": "Mumbai news: The sloth bear and a pair of leopards were brought to Byculla zoo from Nagpur’s Gorewada zoo.", "url": "https://indianexpress.com/article/cities/mumbai/sloth-bear-shiva-delights-visitors-at-byculla-zoo-7934483/", "urlToImage": "https://images.indianexpress.com/2022/05/sloth-bear.jpg", "publishedAt": "2022-05-24T21:58:28Z", "content": "CITIZENS CAN now see Shiva, a two-year-old male sloth bear that recently arrived at the Byculla zoo after travelling 832 km from Nasik. The bear was released into its exhibit for public viewing on Mo… [+1305 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Investment commitments worth Rs 30,379 crore signed in Davos: Maharashtra govt", "description": "The MoUs signed in the Maharashtra Pavilion at Davos will potentially generate more than 66,000 jobs, said a statement issued by the government.", "url": "https://indianexpress.com/article/cities/mumbai/maharashtra-govt-davos-world-economic-forum-2022-investments-7934481/", "urlToImage": "https://images.indianexpress.com/2022/05/davos-maha-govt.jpg", "publishedAt": "2022-05-24T21:53:12Z", "content": "THE DELEGATION of ministers and officers from the Maharashtra government, who are in Davos for the World Economic Forum, 2022 in the 10th edition of its Magnetic Maharashtra 2.0 programme, signed 23 … [+1741 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "Kerala warning", "description": "The PFI first caught national attention in July 2010, when eight of its activists chopped off the hands of a college professor, T J Joseph, for allegedly insulting the Prophet.", "url": "https://indianexpress.com/article/opinion/editorials/kerala-warning-popular-front-of-india-7934418/", "urlToImage": "https://images.indianexpress.com/2022/05/editorial-11-2.jpeg", "publishedAt": "2022-05-24T21:50:16Z", "content": "The Kerala police has booked two senior leaders of the Popular Front of India (PFI) after video clips from a rally held on Saturday featured a boy perched on the shoulders of an adult raising highly … [+2326 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "Closer together", "description": "Undoubtedly, what has given the Quad a sharper edge in its objective of ensuring a “rules based order” and an “open and free” region — not so coded references to Beijing — is the launch of the US Indo-Pacific Economic Framework.", "url": "https://indianexpress.com/article/opinion/editorials/closer-together-tokyo-quad-summit-russia-ukraine-war-7934410/", "urlToImage": "https://images.indianexpress.com/2022/05/editorial-11-1.jpeg", "publishedAt": "2022-05-24T21:45:39Z", "content": "The Tokyo summit of the Quadrilateral Security Dialogue comes at a time of momentous geopolitical changes triggered by Russia’s invasion of Ukraine. It has reaffirmed that the grouping of four import… [+2658 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mumbai: Man ‘thrown off’ bridge in Vasai Creek over affair, one arrested", "description": "Mumbai news: On May 12, the girl’s relative and arrested accused Suraj Vishwakarma called Deepak at around 8 pm and requested to meet him at Kandivali railway station.", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-man-thrown-off-bridge-in-vasai-creek-over-affair-one-arrested-7934479/", "urlToImage": "https://images.indianexpress.com/2022/05/arrest-13-10.jpg", "publishedAt": "2022-05-24T21:41:49Z", "content": "THE KANDIVALI police on Tuesday arrested a 27-year-old bank employee for allegedly throwing a 20-year-old man from a bridge into Vasai creek on May 12 as the latter was having an affair with his rela… [+1773 chars]"}]}