{"status": "ok", "totalResults": 482, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Amber Heard’s rep denies she’s fired from Aquaman and the Lost Kingdom, criticises ‘inaccurate and insensitive’ coverage", "description": "Amber Heard briefly appeared in 2017's Justice League in the role of Mera, who is a princess from the underwater kingdom of Xebel, opposite Jason Momoa's titular half-human and half-Atlantean superhero. She then played the female lead in standalone Aquaman mo…", "url": "https://indianexpress.com/article/entertainment/hollywood/amber-heard-rep-denies-fired-from-aquaman-2-criticises-inaccurate-insensitive-coverage-7972916/", "urlToImage": "https://images.indianexpress.com/2022/06/Amber-Heard-ap-1200by667-3.jpeg", "publishedAt": "2022-06-16T06:48:12Z", "content": "After reports suggested that Amber Heardhas been cut entirely from the second Aquaman movie, titled Aquaman and the Lost Kingdom, the actor’s spokesperson has denied them. Publications like Just Jare… [+1201 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Bill Cosby lawyer urges jurors to consider only proof from trial", "description": "Huth’s case represents one of the last remaining legal claims against Bill Cosby once regarded as “America’s dad” after the removal of his Pennsylvania conviction and the settlement of many other lawsuits, negotiated by his insurer against his will.", "url": "https://indianexpress.com/article/entertainment/hollywood/bill-cosby-lawyer-urges-jurors-to-consider-only-proof-from-trial-7972578/", "urlToImage": "https://images.indianexpress.com/2022/06/Bill-Cosby-ap-1200by667-1.jpeg", "publishedAt": "2022-06-16T06:47:00Z", "content": "A lawyer for Bill Cosby told jurors they need to look past years of public accusations against the actor and comedian and consider only the evidence presented by a woman who says he sexually abused h… [+4409 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Jagpreet Singh Sandhu", "title": "Court can’t ask probe agencies to submit final report within a time frame: Punjab and Haryana HC", "description": "While junking the petition, the bench said, “The HC cannot direct the investigating agency to submit a final report within a particular time frame as that would amount to unwarranted interference with the investigation.”", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-haryana-high-court-cbi-chargesheet-fir-investigation-7972917/", "urlToImage": "https://images.indianexpress.com/2022/06/punjab-haryana-high-court-1.jpg", "publishedAt": "2022-06-16T06:45:56Z", "content": "The Punjab and Haryana High Court has dismissed a plea seeking a CBI probe into a cheating case wherein the petitioners have alleged that the investigating agency has not conducted a fair probe and h… [+1857 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "Watch: Tigress, cubs cool off in waterhole", "description": "The forest department fills up man-made waterholes during the summer months to aid animals.", "url": "https://indianexpress.com/article/trending/trending-in-india/watch-tigress-cubs-cool-off-in-waterhole-7972668/", "urlToImage": "https://images.indianexpress.com/2022/06/tiger-playing-waterhole-video.jpg", "publishedAt": "2022-06-16T06:45:42Z", "content": "With temperatures soaring, natural sources of water in forested areas dry up. This makes it hard for wildlife to quench their thirst. To make summer heat bearable for wild animals, the forest departm… [+1902 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi: 22-year-old arrested for murdering food delivery executive", "description": "Police said that the arrested man, along with a second accused, allegedly got into a quarrel with the deceased, 29-year-old Sagar Singh, when they saw him smoking in front of a house.", "url": "https://indianexpress.com/article/cities/delhi/delhi-22-year-old-arrested-for-murdering-food-delivery-executive-7972909/", "urlToImage": "https://images.indianexpress.com/2022/06/arrest-2-7-5.jpeg", "publishedAt": "2022-06-16T06:42:04Z", "content": "A 22-year-old man was arrested for allegedly murdering an on-duty food delivery executive who lived in West Delhis Tilak Nagar early on Wednesday morning. Police said that the arrested man, along wit… [+1438 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "DU extends last date for Centenary Chance registration to June 24", "description": "The Centenary Chance Examination is open to all former students who were in the final year of their undergraduate, postgraduate or professional courses and who could not complete their degrees within the stipulated period.", "url": "https://indianexpress.com/article/cities/delhi/du-extends-last-date-for-centenary-chance-registration-to-june-24-7972903/", "urlToImage": "https://images.indianexpress.com/2022/06/delhi-university-1.jpeg", "publishedAt": "2022-06-16T06:39:52Z", "content": "Delhi University has extended the last date to register for its Centenary Chance, a second opportunity for its former students who had not been able to complete their degrees, to June 24.Registration… [+958 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Amid rumours of Deepika Padukone’s cameo, Ayan Mukerji confirms Brahmastra sequels ‘will introduce new characters, perspectives’", "description": "Brahmastra director Ayan Mukerji commented on the planned sequels, and how they'll expand the scope of the franchise.", "url": "https://indianexpress.com/article/entertainment/bollywood/brahmastra-deepika-padukone-cameo-ayan-mukerji-sequels-7972697/", "urlToImage": "https://images.indianexpress.com/2022/06/brahmastra-trailer-Alia-ranbir-1200.jpg", "publishedAt": "2022-06-16T06:39:51Z", "content": "Director Ayan Mukerji said in an interview that work on future Brahmastra movies will commence after the first instalment is released. Titled Brahmastra – Part One: Shiva, the first film in the plann… [+1441 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Disney’s Lightyear faces backlash over same-sex kiss", "description": "The international backlash against Lightyear is a fresh public relations headache for Disney, whose growing willingness to publicly defend LGBTQ people has made it a somewhat unlikely cultural lightning rod in the United States.", "url": "https://indianexpress.com/article/entertainment/hollywood/disneys-lightyear-faces-backlash-over-same-sex-kiss-7972653/", "urlToImage": "https://images.indianexpress.com/2022/06/lightyear-1200-1.jpg", "publishedAt": "2022-06-16T06:38:03Z", "content": "Disneys new movie Lightyear, an offshoot of the Toy Story franchise, faces bans or restrictions in parts of Southeast Asia and the Middle East over a scene that features a kiss between two women. The… [+4710 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "George Mathew", "title": "BBB’s powers nixed: Top brass selection of PSU insurers stuck", "description": "With the BBB not allowed to select top officials of public sector insurers, the government is now getting ready to activate an alternative mechanism to conduct the exercises for selecting the top management of PSU insurers.", "url": "https://indianexpress.com/article/business/bbbs-powers-nixed-top-brass-selection-of-psu-insurers-stuck/", "urlToImage": "https://images.indianexpress.com/2022/06/indian-express-logo-6.jpg", "publishedAt": "2022-06-16T06:36:18Z", "content": "The selection process of top officials of public sector insurance companies is in limbo in the wake of the Delhi High Court decision to strike down the power of Banks Board Bureau (BBB) to select dir… [+4218 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "EXPRESS FEATURES SERVICE", "title": "Gopi Chand Narang, the Renaissance Man of Urdu, passes away", "description": "He worked extensively on explaining and analysing the works of Ghalib, Mir Taqi Mir and later Faiz Ahmad Faiz and Firaq Gorakhpuri beyond thematic and typical writings, penned about 60 books in his career and made every attempt to keep the language beyond com…", "url": "https://indianexpress.com/article/books-and-literature/gopi-chand-narang-the-renaissance-man-of-urdu-passes-away-7972863/", "urlToImage": "https://images.indianexpress.com/2022/06/gopi-chand-narang.jpg", "publishedAt": "2022-06-16T06:34:10Z", "content": "Eminent Urdu scholar, linguist, literary critic, and former Chairperson of Sahitya Akademi, Gopi Chand Narang passed away last night at 91 He was living with his son Tarun Narang in Charlotte, North … [+3000 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi weather: Light rainfall likely today, maximum temperature to be around 39 degrees", "description": "Delhi weather today: Rainfall on Wednesday night brought the minimum temperature down to 23.8 degrees Celsius, four degrees below the normal for this time of the year. The minimum temperature had remained above 30 degrees from May 12 to 14, and was a little b…", "url": "https://indianexpress.com/article/cities/delhi/delhi-weather-imd-rainfall-heatwate-maximum-temperature-7972870/", "urlToImage": "https://images.indianexpress.com/2022/06/Delhi-heat-wave-live-weather-updates.jpeg", "publishedAt": "2022-06-16T06:34:03Z", "content": "Cloudy skies accompanied by light rainfall and a maximum temperature of 39 degrees Celsius are on the India Meteorological Department (IMD) forecast for Delhi Thursday.Brought by a western disturbanc… [+2307 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Why Ranbir Kapoor refused to appear on Koffee With Karan: ‘I have to pay the price for this for too long’", "description": "Karan Johar has said that Ranbir Kapoor refused to appear on Koffee With Karan, saying he has paid the price for it for too long.", "url": "https://indianexpress.com/article/entertainment/bollywood/why-ranbir-kapoor-refused-to-appear-on-koffee-with-karan-i-have-to-pay-the-price-for-this-for-too-long-7972793/", "urlToImage": "https://images.indianexpress.com/2022/06/Karan-Johar-Ranbir-Kapoor.jpg", "publishedAt": "2022-06-16T06:31:01Z", "content": "From the time Karan Johar announced that the new season of his celebrity chat show Koffee With Karan will stream on Disney+ Hotstar, fans have been waiting for Ranbir Kapoor and Alia Bhatt to appear … [+1230 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "The Conversation", "title": "Has Covid affected your sleep? Here’s how viruses can change our sleeping patterns", "description": "While we are still learning about the specific effects of COVID on sleep, we do know about what happens to sleep with other viral infections.", "url": "https://indianexpress.com/article/lifestyle/health/covid-sleep-viruses-can-change-sleeping-patterns-7970880/", "urlToImage": "https://images.indianexpress.com/2021/05/sleep_1200_getty.jpg", "publishedAt": "2022-06-16T06:30:16Z", "content": "During the early phases of the pandemic, and especially during lockdowns and stay-at-home orders, many people reported disruptions to sleep and their sleeping patterns. As COVID infections have incre… [+5207 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "‘That’s not the cutting chai we like’: Pak minister urges public to cut back on tea, irks all online", "description": "Minister for Planning Ahsan Iqbal sent chai lovers into a frenzy online asking them to drink less tea, arguing that it will help the government reduce import payments.", "url": "https://indianexpress.com/article/trending/trending-globally/pak-minister-urges-public-to-cut-back-on-tea-irks-all-online-7972837/", "urlToImage": "https://images.indianexpress.com/2022/06/pak-minister-cut-chai-intake.jpg", "publishedAt": "2022-06-16T06:27:05Z", "content": "Ask any desi folk and theyll tell you about their love for cutting chai. Its no wonder then that a Pakistani ministers statement urging people to cut down on their tea intake purportedly to tackle th… [+3203 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "‘Expectations hurt’: Rahul Tewatia tweets after Team India snub for Ireland tour", "description": "Hardik Pandya was named as the captain of Team India’s squad. Bhuvneshwar Kumar will be Pandya’s deputy as the vice-captain of the side.", "url": "https://indianexpress.com/article/sports/cricket/expectations-hurt-rahul-tewatia-tweets-after-team-india-snub-for-ireland-tour-7972836/", "urlToImage": "https://images.indianexpress.com/2022/06/Rahul-Tewatia.jpg", "publishedAt": "2022-06-16T06:25:47Z", "content": "The IPL 2022 winning side Gujarat Titans’ key player Rahul Tewatia’s latest tweet has taken social media by storm. on Wednesday, just a few hours after getting ignored for the upcoming Ireland T20I s… [+1361 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "ATM dispenses 5 times extra cash in Maharashtra; people rush to withdraw money", "description": "The ATM experienced a technical glitch and was dispensing currency notes of Rs 500 denomination instead of Rs 100 denomination.", "url": "https://indianexpress.com/article/cities/nagpur/nagpur-atm-dispenses-extra-cash-causes-public-rush-7972715/", "urlToImage": "https://images.indianexpress.com/2018/05/bank-strike-759.jpg", "publishedAt": "2022-06-16T06:24:46Z", "content": "A man was in for a pleasant surprise when he tried to withdraw Rs 500 from an ATM, but got five currency notes of Rs 500 denomination from the cash dispenser in Maharashtra’s Nagpur district.He repea… [+767 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Why Vaghela not named accused in dispute on his residential premises, asks Gujarat High Court", "description": "The Gujarat High Court was hearing pleas for anticipatory bail by two accused in the dispute involving former assistant solicitor general (ASG) to Gujarat HC and senior advocate IH Syed also as accused.", "url": "https://indianexpress.com/article/cities/ahmedabad/gujarat-high-court-shankersinh-vahgela-accused-case-7972675/", "urlToImage": "https://images.indianexpress.com/2022/04/Gujarat-HC-1-1-1.jpeg", "publishedAt": "2022-06-16T06:24:40Z", "content": "The Gujarat High Court on Wednesday questioned the advocate representing the complainant in a business dispute that is said to have taken place on the residential premises of former chief minister Sh… [+2124 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Rupee gains 15 paise against US dollar in early trade", "description": "The rupee strengthened by fifteen paise to 78.07 against the US dollar in opening trade today. In the previous session, the rupee had closed at a record low of 78.22 against the US dollar.", "url": "https://indianexpress.com/article/business/market/rupee-gains-15-paise-against-us-dollar-in-early-trade-7972811/", "urlToImage": "https://images.indianexpress.com/2022/06/indian-rupee-us-dollar-1.jpeg", "publishedAt": "2022-06-16T06:24:07Z", "content": "The rupee strengthened by fifteen paise to 78.07 against the US dollar in opening trade today. This happened after the US Federal Reserve hiked interest rate by seventy-five basis points and signalle… [+1647 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Two arrested after shots fired in Pune’s Fashion Street area, search on for key accused", "description": "Officials said they suspect the incident was a fallout of an internal rivalry between some of the office-bearers and members of the Fashion Street Association.", "url": "https://indianexpress.com/article/pune/two-arrested-after-shots-fired-in-punes-fashion-street-area-search-on-for-key-accused-7972815/", "urlToImage": "https://images.indianexpress.com/2022/06/Pune-Police-2.jpg.jpg", "publishedAt": "2022-06-16T06:23:06Z", "content": "The Pune city police have arrested two people and looking for one more accused in connection with the incident of firing at the crowded Fashion Street area in Pune Camp, in which a local businessman … [+1115 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Glenmark Pharm launches asthma drug Indamet", "description": "Indamet will help in the management of uncontrolled asthma by improving lung function, better symptom control and reducing exacerbations.", "url": "https://indianexpress.com/article/india/glenmark-pharm-launches-indamet-for-asthma-patients-7972744/", "urlToImage": "https://images.indianexpress.com/2022/05/asthma_759getty.jpg", "publishedAt": "2022-06-16T06:21:27Z", "content": "Glenmark Pharmaceuticals on Thursday said it has launched a novel fixed-dose combination (FDC) drug in the country for patients with uncontrolled asthma.The Mumbai-based drug major has launched – Ind… [+1647 chars]"}]}