{"status": "ok", "totalResults": 412, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Sampada Sharma", "title": "Why Rajesh Khanna, Sharmila Tagore’s Avishkaar is the antithesis of Bollywood romcoms", "description": "Hindi cinema has made rom-coms by the dozen, but inspecting the ugly reality of a close relationship has always made us extremely uncomfortable. Basu Bhattacharya's 1974 film Avishkaar does this in a delicate way.", "url": "https://indianexpress.com/article/entertainment/bollywood/rajesh-khanna-sharmila-tagore-avishkaar-antithesis-of-bollywood-romcoms-7975632/", "urlToImage": "https://images.indianexpress.com/2022/06/avishkaar-1200.jpg", "publishedAt": "2022-06-18T02:48:46Z", "content": "In the early 1970s, Rajesh Khanna’s career was going through a strange lull. He had been a superstar for a few years, but the newer stars of the time were catching up. His signature style had run its… [+4364 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rahel Philipose", "title": "Daily Briefing: How social science textbooks have been amended since 2014; latest on Agnipath protests", "description": "In the first part of the latest Indian Express Investigation, we scrutinised 21 current history, political science and sociology textbooks for Classes 6 to 12 and matched their content with tables circulated within NCERT on the proposed changes.", "url": "https://indianexpress.com/article/live-news/daily-briefing-how-social-science-textbooks-have-been-amended-since-2014-latest-on-agnipath-protests-7976422/", "urlToImage": "https://images.indianexpress.com/2022/06/expressintro-1-1-1-1-1-1.jpeg", "publishedAt": "2022-06-18T02:47:07Z", "content": "Get your weekend started with the top 5 stories from today’s edition: How social science textbooks have been amended since 2014; the latest on the Agnipath protests; what to watch this weekend; and m… [+5093 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "PM Modi celebrates mother’s 100th birthday at her Gandhinagar residence", "description": "Modi, who is staying at the Raj Bhavan in Gandhinagar, is expected to travel to Pavagadh in Panchmahal district for inaugurating the redeveloped Kalika Mata temple, and then head to Vadodara for inauguration and laying the foundation of several projects under…", "url": "https://indianexpress.com/article/cities/ahmedabad/pm-narendra-modi-mother-100th-birthday-gujarat-7976423/", "urlToImage": "https://images.indianexpress.com/2022/06/Modi-with-Mom.jpeg", "publishedAt": "2022-06-18T02:42:33Z", "content": "Prime Minister Narendra Modi kicked off his visit to Gujarat by meeting his mother early on Saturday to celebrate her 100th birthday. She stays in Gandhinagar with her youngest son Pankaj.A statement… [+1400 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Agnipath scheme an attack on ‘jawani’ after ‘kisaani’: Punjab CM Bhagwant Mann", "description": "Punjab CM Bhagwant Mann said that through this ‘Agnipath’ move the Centre is allowing a youth to serve the Army merely for four years and that too without pension.", "url": "https://indianexpress.com/article/cities/chandigarh/agnipath-scheme-yojana-protests-indian-army-recruitment-punjab-cm-bhagwant-mann-7976415/", "urlToImage": "https://images.indianexpress.com/2022/06/agnipath-protests-1.jpg", "publishedAt": "2022-06-18T02:38:47Z", "content": "Condemning the recent decision of the NDA government to implement Agnipath scheme in the Indian Army as a retrogressive step, Punjab Chief Minister Bhagwant Mann on Friday asked the Union government … [+1623 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Raghu Malhotra", "title": "Explained: Ukraine is one step closer to joining the EU. What happens next?", "description": "European Union leaders will decide whether to grant Ukraine candidate status at a summit next week. What is the requirement for joining the EU? What is the process of joining? What happens with Ukraine's application hereon?", "url": "https://indianexpress.com/article/explained/ukraine-european-union-membership-explained-7976408/", "urlToImage": "https://images.indianexpress.com/2022/06/EU-1-1.jpg", "publishedAt": "2022-06-18T02:37:17Z", "content": "The European Commission, the executive arm of the European Union, recommended on Friday (June 17) that Ukraine be formally granted candidate status in the EU, the first step in the long journey to be… [+5663 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "India Weather Live Updates: Mawsynram sets new June rainfall record; Delhi records lowest maximum temperature in 20 days", "description": "Weather News Live Updates, India Weather Updates, IMD Weather Forecast, Delhi Weather Today, Mumbai Weather News: Delhi sees lowest max temp in 20 days; Heavy rainfall to continue over NE states and sub-Himalayan West Bengal and Sikkim for 4 days.", "url": "https://indianexpress.com/article/weather/india-weather-live-updates-monsoon-imd-rains-7976389/", "urlToImage": "https://images.indianexpress.com/2022/06/Tripura-rains.jpeg", "publishedAt": "2022-06-18T02:34:59Z", "content": "22 dead in Meghalaya, Assam as rains continue to lash northeast\r\nAs rains continued in the northeast for the fourth day, at least 22 people 13 in Meghalaya and 9 in Assam were killed in flood and lan… [+313 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "As Tamil Nadu reports 589 new Covid-19 cases, active cases cross 2500-mark", "description": "Chennai, Tamil Nadu Covid-19 cases: Meanwhile, Minister for Health and Family Welfare Ma Subramanian said there is no necessity as of now to impose restrictions in the wake of a rise in new coronavirus cases in the state.", "url": "https://indianexpress.com/article/cities/chennai/chennai-covid-case-updates-today-tamil-nadu-covid-deaths-7976414/", "urlToImage": "https://images.indianexpress.com/2022/06/Covid-Chennai-1-1.jpeg", "publishedAt": "2022-06-18T02:34:54Z", "content": "Tamil Nadu, witnessing a surge in new coronavirus cases, added 589 infections on Friday, which include four returnees from domestic and overseas, pushing the caseload to 34,59,586, the health departm… [+2552 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Moosewala murder: Teen apprehended for ‘issuing threats’ to gangster Lawrence Bishnoi on social media", "description": "Police said that after Moosewala was murdered in Punjab on May 29, several social media accounts, including new ones, have been issuing threats to VIPs and members of the public which is dangerous.", "url": "https://indianexpress.com/article/cities/delhi/moosewala-murder-teen-apprehended-for-issuing-threats-to-gangster-lawrence-bishnoi-on-social-media-7976418/", "urlToImage": "https://images.indianexpress.com/2022/05/lawrence-bishnoi.jpg", "publishedAt": "2022-06-18T02:31:23Z", "content": "The Delhi Police has apprehended a 17-year-old, who claims he is a fan of slain singer Sidhu Moosewala, for allegedly issuing threats to gangster Lawrence Bishnoi and a leading Punjabi singer on soci… [+992 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Punjab: Former Congress MLA arrested for illegal mining, Warring cries vendetta politics", "description": "The PCC president Amrinder Singh Raja Warring told Chief Minister Bhagwant Mann that he \"cannot camouflage political vendetta as war against corruption.", "url": "https://indianexpress.com/article/cities/chandigarh/former-congress-mla-arrested-for-illegal-mining-warring-cries-vendetta-politics-7976374/", "urlToImage": "https://images.indianexpress.com/2022/06/congress-mla.jpg", "publishedAt": "2022-06-18T02:19:47Z", "content": "Former Congress MLA from Bhoa, Joginder Pal, was on Friday arrested in connection to an illegal mining case in Pathankot district, drawing a sharp reaction from Punjab Congress chief, Amrinder Singh … [+2756 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Agnipath recruitment scheme: Protesters detained at ITO Metro station", "description": "According to a statement from the SFI Delhi Committee, the Agnipath scheme will “weaken the armed forces” and will “create dire situations for the youth of this country”.", "url": "https://indianexpress.com/article/delhi/agnipath-recruitment-scheme-protesters-detained-at-ito-metro-station-7976359/", "urlToImage": "https://images.indianexpress.com/2022/06/Untitled-design-3.png", "publishedAt": "2022-06-18T02:13:57Z", "content": "Protesters who were at the ITO Metro station to demand the rollback of the Agnipath recruitment scheme were detained by the Delhi Police on Friday morning. The protesters included members of the All … [+1760 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Russia Ukraine War News Live Updates: Putin seeks to play down EU issue as Ukraine’s candidacy signals major shift in European geopolitics", "description": "Russia Ukraine War News Today, Russia Ukraine Zelenskyy News Updates", "url": "https://indianexpress.com/article/world/russia-ukraine-war-news-european-union-putin-zelenskyy-live-updates-7976372/", "urlToImage": "https://images.indianexpress.com/2022/06/ukraine-1200-1.jpg", "publishedAt": "2022-06-18T02:07:05Z", "content": "With the war in Ukraine's east raging on, Kyiv received a major boost when the European Union recommended that it become a candidate to join the bloc, in what would be a dramatic geopolitical shift f… [+1431 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Palaniswami holds show of strength amid AIADMK leadership row", "description": "Edappadi K Palaniswamy who participated in a string of events in Tiruvannamalai District was accorded a rousing reception by his followers, the district party unit and supporters showered petals on his car and hailed him as the 'future general secretary.'", "url": "https://indianexpress.com/article/cities/chennai/aiadmk-palaniswami-panneerselvam-tamil-nadu-leadership-row-7976346/", "urlToImage": "https://images.indianexpress.com/2022/06/TN1.jpeg", "publishedAt": "2022-06-18T01:50:55Z", "content": "While followers of both Palaniswami (EPS) and Panneerselvam (OPS) were engaged in backroom negotiations to mobilise the support of party functionaries for their respective leaders, parleys continued … [+2630 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Google Doodle pays tribute to Romanian physicist Stefania Maracineanu on her 140th birth anniversary", "description": "Stefania Mărăcineanu graduated with a physical and chemical science degree in 1910, and began her career as a teacher at the Central School for Girls in Bucharest.", "url": "https://indianexpress.com/article/trending/google-doodle-romanian-physicist-stefania-maracineanu-7976364/", "urlToImage": "https://images.indianexpress.com/2022/06/Untitled-design-41.jpg", "publishedAt": "2022-06-18T01:40:53Z", "content": "Google on Saturday celebrated the 140th birth anniversary of tefania Mrcineanu, one of the pioneering women in the discovery and research of radioactivity.Mrcineanu graduated with a physical and chem… [+1643 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Ethan Hawke to star in Showtime’s limited series The Whites", "description": "The Whites series is based on novelist-screenwriter Richard Price's book of the same name.", "url": "https://indianexpress.com/article/entertainment/television/ethan-hawke-to-star-in-showtimes-limited-series-the-whites-7974717/", "urlToImage": "https://images.indianexpress.com/2022/06/Ethan-Hawke-1200by667.jpg", "publishedAt": "2022-06-18T01:38:36Z", "content": "Hollywood star Ethan Hawke has been roped in to play the lead role in limited series The Whites set at Showtime. According to Variety, the series is based on novelist-screenwriter Richard Price’s boo… [+926 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Remains of British journalist Dom Phillips found in Amazon, police name new suspect", "description": "Pereira and Phillips vanished on June 5 in the remote Javari Valley bordering Peru and Colombia. Earlier this week, police recovered human remains from a grave in the jungle where they were led by a fisherman, Amarildo da Costa Oliveira, who confessed to kill…", "url": "https://indianexpress.com/article/world/british-journalist-dom-phillips-brazil-amazon-rainforest-killing-police-suspect-7976365/", "urlToImage": "https://images.indianexpress.com/2022/06/2022-06-07T171259Z_704771742_RC2W4678MNAN_RTRMADP_3_BRAZIL-JOURNALIST-1.jpg", "publishedAt": "2022-06-18T01:33:41Z", "content": "A forensic exam carried out on human remains found in the Amazon rainforest confirmed on Friday that they belonged to British journalist Dom Phillips, Brazil’s federal police said, adding that a sear… [+2553 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "UPMSP UP board Class 10, 12 result 2022: When and where to check", "description": "When and Where to Check UP Board Class 10th, 12th Result 2022: Students can check their board results by visiting the official website – upmsp.edu.in. On the homepage, students must click on the ‘Madhyamik exam result’ for class 12 results.", "url": "https://indianexpress.com/article/education/upmsp-up-board-class-10-12-result-2022-when-and-where-to-check-upmsp-edu-in-upresult-nic-in-sarkariresult-indiaresults-in-7927722/", "urlToImage": "https://images.indianexpress.com/2022/05/SSLC-Karnataka.jpg", "publishedAt": "2022-06-18T01:30:54Z", "content": "UPMSP HS, Inter Results 2022:The Uttar Pradesh Secondary Education Councilwill declare the class 10 and 12 board exam results today. The class 10 result will be available from 2 pm and class 12 resul… [+1511 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Agnipath protests: Southern Railway cancels several trains from Chennai", "description": "Due to the agitation in South Central Railway and East Coast Railway Hyderabad zones-Dr MGR Chennai Central Express, Hyderabad Tambaram-Charminar Express, Bengaluru-Danapur Express, MGR Chennai Central-Hyderabad Express and Tambaram-Hyderabad Charminar Expres…", "url": "https://indianexpress.com/article/cities/chennai/agnipath-protests-southern-railway-cancels-trains-chennai-secunderabad-7976349/", "urlToImage": "https://images.indianexpress.com/2022/06/railways-7591.jpeg", "publishedAt": "2022-06-18T01:30:31Z", "content": "Several trains were either fully or partially cancelled in the region due to the protest against theCentre’s ‘Agnipath’ scheme for recruitment in the defence services, Southern Railway said on Friday… [+1208 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "Karnataka PUC II boards results 2022: When and where to check", "description": "The students can also check their board results via SMS or from the official website. To check the Karnataka II PUC result via text message students need to send the text in the given format.", "url": "https://indianexpress.com/article/education/karnataka-ii-puc-boards-results-2022-when-and-where-to-check-karresults-nic-in-7941385/", "urlToImage": "https://images.indianexpress.com/2022/06/3-2-1.jpg", "publishedAt": "2022-06-18T01:30:18Z", "content": "Karnataka PUC II board result 2022:The Department of Pre-University Education (DPUE) will release the Pre-university course (PUC) II 2022 board exam results on June 18 at 11 am. Students who had appe… [+1549 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Texas school shooting: 2 officers had chance to shoot Uvalde gunman", "description": "ince the shooting, Republican leaders in Texas have called for more mental health funding but not new gun restrictions. Authorities say the 18-year-old gunman used and AR-15-style semi-automatic rifle.", "url": "https://indianexpress.com/article/world/texas-school-shooting-gunman-robb-elementary-school-gun-violence-killings-7976357/", "urlToImage": "https://images.indianexpress.com/2022/06/texas-gun.jpg", "publishedAt": "2022-06-18T01:16:46Z", "content": "Two Uvalde city police officers passed up a fleeting chance to shoot a gunman outside Robb Elementary School before he went on to kill 21 people inside the school, a senior sheriff’s deputy told The … [+3351 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Chennai power cut today: These areas in Chennai will face a power cut", "description": "Chennai power disruption June 18, Saturday: Parts of Chennai will face a power cut from 9 am to 2 pm for maintenance work today.", "url": "https://indianexpress.com/article/cities/chennai/chennai-power-cut-today-these-areas-in-chennai-will-face-a-power-cut-7976356/", "urlToImage": "https://images.indianexpress.com/2022/06/electricity-reuters-1200-2-1-10.jpeg", "publishedAt": "2022-06-18T01:15:33Z", "content": "The Tamil Nadu Generation and Distribution Corporation (Tangedco) has announced that power will be suspended in parts of Chennai today in Mylapore, Tambaram, Egmore, Avadi/Pattabiram, Ambattur, Porur… [+2393 chars]"}]}