{"status": "ok", "totalResults": 662, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "US ambassador for religious freedom concerned over the treatment of religious communities in India", "description": "“India now has a citizenship law that's on the books. We've had open calls for genocide in India. We've had attacks on churches. We have had a ban on the hijab. We've had demolitions of homes,\" the Indian-American diplomat said.", "url": "https://indianexpress.com/article/world/us-ambassador-for-religious-freedom-concerned-over-the-treatment-of-religious-communities-in-india-8003258/", "urlToImage": "https://images.indianexpress.com/2022/06/Antony.jpg", "publishedAt": "2022-07-01T10:46:34Z", "content": "The US ambassador at large for international religious freedom Rashad Hussain has voiced concern over the treatment of a number of religious communities in India and said Washington was dealing direc… [+5544 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "New Maharashtra CM reprimands rebel MLAs over their dance at Goa hotel", "description": "On Thursday, the rebel Shiv Sena MLAs broke into a dance in the lobby of a luxury hotel in Goa, where they are currently staying, when they heard that Shinde was going to be the next chief minister of Maharashtra.", "url": "https://indianexpress.com/article/cities/goa/maharashtra-cm-eknath-shinde-reprimands-rebel-mlas-dance-goa-hotel-8002932/", "urlToImage": "https://images.indianexpress.com/2022/07/Eknath-Shinde-3.jpg", "publishedAt": "2022-07-01T10:38:25Z", "content": "On Thursday, the rebel Shiv Sena MLAs broke into a dance in the lobby of a luxury hotel in Goa, where they are currently staying, when they heard that Shinde was going to be the next chief minister o… [+1184 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "EU agrees rules to tame ‘Wild West’ crypto market", "description": "\"Today we put order in the Wild West of crypto assets and set clear rules for a harmonised market,\" said Stefan Berger, a centre-right lawmaker who led negotiations on behalf of the parliament.", "url": "https://indianexpress.com/article/technology/crypto/eu-agrees-rules-tame-wild-west-crypto-market-8003176/", "urlToImage": "https://images.indianexpress.com/2022/07/bitcoin-1-2.jpg", "publishedAt": "2022-07-01T10:38:02Z", "content": "Cryptocurrency companies will need a licence and customer safeguards to issue and sell digital tokens in the European Union under groundbreaking new rules agreed by the bloc to tame a volatile “Wild … [+3576 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "PM Modi speaks to Putin, reiterates India’s position to solve Ukraine crisis through dialogue, diplomacy", "description": "Prime Minister Narendra Modi spoke to Russian President Vladimir Putin on Friday", "url": "https://indianexpress.com/article/india/narendra-modi-vladimir-putin-russia-ukraine-dialogue-diplomacy-8003237/", "urlToImage": "https://images.indianexpress.com/2022/06/modi-putin-759.jpg", "publishedAt": "2022-07-01T10:37:21Z", "content": "Prime Minister Narendra Modi with Russian President Vladimir Putin (PTI Photo/File)Prime Minister Narendra Modi, while speaking to Russian President Vladimir Putin on Friday over the ongoing situatio… [+349 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Simbu’s Maha, Vendhu Thanindhathu Kaadu and Pathu Thala get release dates", "description": "Simbu's first big release of this year will be Vendhu Thanindhathu Kaadu. The film marks Simbu's reunion with director Gautham Menon after a gap of six years.", "url": "https://indianexpress.com/article/entertainment/tamil/simbu-maha-vendhu-thanindhathu-kaadu-pathu-thala-have-release-dates-8003067/", "urlToImage": "https://images.indianexpress.com/2022/07/simbu-movies1.jpg", "publishedAt": "2022-07-01T10:34:48Z", "content": "Tamil actor Simbu has three films that are getting ready to hit cinema halls at quick intervals this year. His long-delayed movie Maha, which also stars Hansika Motwani in the lead role, is due to ar… [+1816 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sana Farzeen", "title": "Aneri Vajani says people will be sorry they underestimated her in Khatron Ke Khiladi 12: ‘Flower nahi, fire hu main’", "description": "Aneri Vajani, who was last seen in Anupamaa, talks about taking a new challenge in Khatron Ke Khiladi 12. She also reveals people will be surprised to see her performance and would realise they 'underestimated' her.", "url": "https://indianexpress.com/article/entertainment/television/aneri-vajani-khatron-ke-khiladi-12-underestimate-anupamaa-8002738/", "urlToImage": "https://images.indianexpress.com/2022/07/aneri-vajani-khatron-ke-khiladi-12.jpg", "publishedAt": "2022-07-01T10:32:27Z", "content": "For Aneri Vajani, the journey of Khatron Ke Khiladi 12has been as ‘enjoyable’ as it has been ‘painful’. Sharing that there’s not even one bit of her body that hasn’t been injured, the Anupamaa actor,… [+2803 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Inflation in 19 countries using euro hits record 8.6%", "description": "Inflation is at its highest level since record keeping for the euro began in 1997.", "url": "https://indianexpress.com/article/business/inflation-19-countries-euro-hits-8-6-8003180/", "urlToImage": "https://images.indianexpress.com/2022/07/euro_m.jpg", "publishedAt": "2022-07-01T10:31:39Z", "content": "Inflation in the 19 countries that use the euro currency hit a record 8.6% in June, pushed higher by a strong increase in energy costs fueled partly by Russias war in Ukraine.Food prices also picked … [+1197 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "IIT-Mandi launches MBA program in Data Science and Artificial Intelligence", "description": "The program brings together contemporary management concepts, soft skills, and relevant applications of data science tools. The applications to the program will end by July 17.", "url": "https://indianexpress.com/article/education/iit-mandi-launches-mba-program-in-data-science-and-artificial-intelligence/", "urlToImage": "https://images.indianexpress.com/2022/07/IIT-Mandi-1200.jpg", "publishedAt": "2022-07-01T10:27:09Z", "content": "The Indian Institute of Technology Mandi has launched an MBA program in Data Science and Artificial Intelligence. The two-year, full-time master’s program begins in the Fall Semester of 2022, the ins… [+2716 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Bloomberg", "title": "RRR, KGF and Pushpa: Bollywood is threatened by India’s other movie-making powerhouse", "description": "The box office success, indicative of a power shift toward the country’s south, comes at a time when Bollywood is reeling from a string of flops, as its increasingly westernized content limits its appeal to a mostly urban audience.", "url": "https://indianexpress.com/article/entertainment/regional/bollywood-is-threatened-by-indias-other-movie-making-powerhouse-8002953/", "urlToImage": "https://images.indianexpress.com/2022/07/South-hit-films-in-Bollywood-1200by667.jpg", "publishedAt": "2022-07-01T10:25:00Z", "content": "Bollywood has a serious rival now in India. Its bigger, louder and is making more money than its prolific, glitzy Hindi-language cousin known for its signature dance moves and opulent wedding scenes.… [+7518 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Ms Marvel teams up with Captain America, Ant-Man and Wasp to fight Ultron, misses a chance to meet Captain Marvel", "description": "Actor Anthony Mackie, who plays Sam Wilson aka Falcon, returned in his new superhero avatar as Captain America in a special video segment shown on the Disney cruise line recently.", "url": "https://indianexpress.com/article/entertainment/hollywood/ms-marvel-teams-up-with-captain-america-ant-man-and-wasp-to-fight-ultron-misses-a-chance-to-meet-captain-marvel-watch-8003015/", "urlToImage": "https://images.indianexpress.com/2022/07/captain-america-ms-marvel-1200.jpg", "publishedAt": "2022-07-01T10:21:40Z", "content": "Ms Marvel got to team up with Captain America, who even declared her as an Avenger, much to the happiness of our teenage superhero. And all this even before their joint appearance in a Marvel Cinemat… [+1847 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "KL Rahul undergoes sports hernia surgery; know more about the condition", "description": "Dr Brahm Datt Pathak explains that sports hernia is caused by \"excessive/overuse of lower abdominal muscles\" in sports such as soccer, football, wrestling, etc", "url": "https://indianexpress.com/article/lifestyle/health/kl-rahul-sports-hernia-surgery-germany-causes-prevention-8002852/", "urlToImage": "https://images.indianexpress.com/2022/07/kl-rahul-1200.jpg", "publishedAt": "2022-07-01T10:20:42Z", "content": "Indian cricketer KL Rahul recently underwent surgery for sports herniain Germany. Taking to Instagram to share a health update with his followers, the Indian opener and vice-captain wrote, “Hello eve… [+1708 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Upasana Singh reveals why she quit Kapil Sharma Show, gives update on their equation: ‘I was being paid well, but…’", "description": "Upasana Singh revealed in a new interview that she's still good friends with Kapil Sharma, but has only one condition for returning to work with him.", "url": "https://indianexpress.com/article/entertainment/television/upasana-singh-reveals-why-she-quit-kapil-sharma-show-8002929/", "urlToImage": "https://images.indianexpress.com/2017/02/upasana-singh-1200.jpg", "publishedAt": "2022-07-01T10:14:49Z", "content": "Former Kapil Sharma Show cast member Upasana Singh said that money is important in the life of an artist, but only up to a point. After that, one needs to be creatively satisfied. She cited this as o… [+1816 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Associated Press", "title": "Germany, Nigeria to sign accord on returning Benin Bronzes", "description": "A British colonial expedition stole the bas-relief Bronzes along with a vast number of other treasures from the royal palace of the Kingdom of Benin in 1897.", "url": "https://indianexpress.com/article/world/germany-nigeria-sign-accord-returning-benin-bronzes-8003162/", "urlToImage": "https://images.indianexpress.com/2022/07/benin-bronse.jpg", "publishedAt": "2022-07-01T10:14:29Z", "content": "Germany is set to sign an agreement in Nigeria on Friday paving the way for the return of important sculptures known as the Benin Bronzes that were taken from Africa in the late 19th century.Governme… [+1264 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Turkey blocks access to Deutsche Welle and Voice of America", "description": "In a statement, Deutsche Welle said it did not comply with the licensing requirement because it “would have allowed the Turkish government to censor editorial content”.", "url": "https://indianexpress.com/article/world/turkey-blocks-access-deutsche-welle-voice-of-america-8003144/", "urlToImage": "https://images.indianexpress.com/2022/06/erdogan.jpg", "publishedAt": "2022-07-01T10:12:57Z", "content": "Turkey’s media watchdog has banned access to the Turkish services of US public service broadcaster Voice of America and German broadcaster Deutsche Welle, prompting criticism of censorship.The Suprem… [+3362 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Normal rainfall over India in July, says IMD", "description": "However, Odisha, West Bengal, northeast India, Kerala, coastal Karnataka and Vidarbha regions will experience below normal rainfall during this month.", "url": "https://indianexpress.com/article/india/normal-rainfall-india-july-says-imd-8003154/", "urlToImage": "https://images.indianexpress.com/2022/07/Mumbai-rain-1.jpg", "publishedAt": "2022-07-01T10:07:24Z", "content": "The India Meteorological Department (IMD) has forecast normal rainfall over the country during July, which is 280.4 mm as per data from 1971 to 2020. Monthly rainfall for July over the country is mos… [+1551 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Ex-Alibaba employee says ex-boss should be charged with rape", "description": "The employee, a woman identified only by her last name Zhou, alleged in a lengthy account posted online this week that there were inconsistencies in a police statement about the case that she says led to online victim blaming against her.", "url": "https://indianexpress.com/article/world/ex-alibaba-employee-says-ex-boss-should-be-charged-with-rape-8002983/", "urlToImage": "https://images.indianexpress.com/2021/04/Alibaba-Group-logo.jpg", "publishedAt": "2022-07-01T10:06:43Z", "content": "A former employee of t Alibaba has accused her then-manager of trying to rape her on a business trip last year as she pushes police to review charges in a case that has cast a rare spotlight on workp… [+4180 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Karnataka sanitation workers strike seeking permanent jobs, better working conditions", "description": "The Karnataka Safaikarmachari Kaval Samithi alleges the sanitation workers are not provided basic facilities like gloves, drinking water and access to toilets.", "url": "https://indianexpress.com/article/cities/bangalore/karnataka-sanitation-workers-permanent-jobs-working-conditions-8002970/", "urlToImage": "https://images.indianexpress.com/2022/07/protest.jpg", "publishedAt": "2022-07-01T10:04:14Z", "content": "Nearly 5,000 pourakarmikas, or sanitation workers, from the 198 wards in the Bengaluru corporation gathered at Freedom Park on Friday demanding the government make them permanent employees with a fix… [+2727 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Reliance Industries stock tumbles nearly 9%; ONGC tanks 11%", "description": "Shares of Reliance Industries fell 8.65 per cent to Rs 2,369.45 apiece on the BSE.", "url": "https://indianexpress.com/article/business/market/reliance-industries-stock-tumbles-nearly-9-pc-ongc-tanks-11-pc-8003126/", "urlToImage": "https://images.indianexpress.com/2021/10/RELIANCE-INDUSTRIES-RIL-REUTERS-1200.jpeg", "publishedAt": "2022-07-01T09:59:29Z", "content": "Shares of Reliance Industries tumbled nearly 9 per cent in morning trade on Friday after the government imposed an export tax on petrol, diesel and jet fuel (ATF).The government on Friday slapped an … [+1731 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "SC to hear plea of Sena chief whip seeking suspension of Shinde, 15 rebel Sena MLAs from House", "description": "A vacation bench comprising Justices Surya Kant and J B Pardiwala was urged by senior advocate Kapil Sibal, appearing for Prabhu, that the interim plea needed an urgent hearing due to the pendency of disqualification proceedings against 16 lawmakers including…", "url": "https://indianexpress.com/article/cities/mumbai/sc-plea-of-sena-chief-whip-suspension-of-shinde-15-rebel-sena-mlas-from-house-8002965/", "urlToImage": "https://images.indianexpress.com/2022/07/Eknath-Main-2.jpg", "publishedAt": "2022-07-01T09:58:27Z", "content": "The Supreme Court on Friday agreed to hear on July 11 the plea of Shiv Sena chief whip Sunil Prabhu seeking suspension from assembly of Maharashtra Chief Minister Eknath Shinde and 15 rebel MLAs agai… [+4950 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Carnatic & Western: Bengaluru-based violinist merges two parallels", "description": "Carnatic artiste Apoorva Krishna wins an honourable mention at an international competition", "url": "https://indianexpress.com/article/cities/bangalore/carnatic-western-bengaluru-based-violinist-merges-parallels-8003088/", "urlToImage": "https://images.indianexpress.com/2022/07/Apoorva-Krishna.jpg", "publishedAt": "2022-07-01T09:51:11Z", "content": "Back in Bengaluru after winning an Honourable Mention at the Broadcast Music, Inc. (BMI) Foundations 70th annual BMI Student Composer Awards in America, Carnatic artiste Apoorva Krishna is understand… [+2768 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "From outright ban to ‘clear danger’: A look at RBI’s stance on crypto in India", "description": "The central bank has repeatedly warned users, holders, and traders of virtual currencies about the potential financial, operational, legal, customer protection, and security-related risks they are exposing themselves to.", "url": "https://indianexpress.com/article/technology/crypto/from-an-outright-ban-to-crypto-taxation-a-look-at-rbis-stance-on-crypto-in-india-8002837/", "urlToImage": "https://images.indianexpress.com/2022/06/RBI-3-1.jpg", "publishedAt": "2022-07-01T09:48:03Z", "content": "The Reserve Bank of India has been a vocal critic of cryptocurrency, calling it a tool for money laundering not once but several times. On Thursday, Reserve Bank Governor Shaktikanta Das described cr… [+3637 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "This fan-made version of ‘Arabic Kuthu’ is an impressive tribute to Beast star Vijay", "description": "Arabic Kuthu, pictured on Vijay and Pooja Hegde, was composed by Anirudh Ravichander.", "url": "https://indianexpress.com/article/entertainment/tamil/this-arabic-kuthu-fan-made-version-is-an-impressive-tribute-to-beast-star-vijay-8002811/", "urlToImage": "https://images.indianexpress.com/2022/07/Arabic-Kuthu-cover.jpg", "publishedAt": "2022-07-01T09:44:13Z", "content": "The dance number Arabic Kuthu from Tamil actor Vijays Beast broke the internet upon its release. At one time, it seemed the whole world was grooving to the hit song. And the craze around Arabic Kuthu… [+1135 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Careers Desk", "title": "RRB Group D 2019 Pay level 1 exam dates announced", "description": "The admit card for the exam will be made available four days prior to the CBT date mentioned in the exam city and date intimation link.", "url": "https://indianexpress.com/article/jobs/rrb-group-d-2019-pay-level-1-exam-dates-announced-rrbbhopal-gov-in-sarkari-naukri-8003092/", "urlToImage": "https://images.indianexpress.com/2021/01/RRB-1200-1.jpg", "publishedAt": "2022-07-01T09:42:02Z", "content": "The Railway Recruitment Board (RRB) has released the tentative exam dates for RRC Group D 2019 pay level 1 exam. The single-stage CBT is scheduled to be held tentatively from August 17, 2022 and onwa… [+765 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aanchal Magazine, Mihir Mishra", "title": "Explained: Why has the Govt imposed a special cess on exports of automobile fuels?", "description": "The Govt says the domestic retail prices of diesel and petrol would remain unchanged. At the same time these measures will ensure domestic availability of the petroleum products.", "url": "https://indianexpress.com/article/explained/explained-why-has-the-govt-imposed-a-special-cess-on-exports-of-automobile-fuels-8003070/", "urlToImage": "https://images.indianexpress.com/2022/06/fuel-2.jpg", "publishedAt": "2022-07-01T09:40:21Z", "content": "The import duty on gold has been hiked to 15 per cent from 10.75 per cent to curb imports of gold amid concerns over increasing pressure on the current account deficit.\r\nA cess of Rs 23,250 per tonne… [+3416 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "As Uddhav Thackeray Quits As Chief Minister, All Eyes On Eknath Shinde, BJP", "description": "", "url": "https://indianexpress.com/videos/news-video/as-uddhav-thackeray-quits-as-chief-minister-all-eyes-on-eknath-shinde-bjp/", "urlToImage": "https://images.indianexpress.com/2022/07/IE-thumb-temp-psd-copy-3.jpg", "publishedAt": "2022-07-01T09:36:43Z", "content": "BJP To AIMIM, Congress To CPI(M): Political Leaders Condemn Act, Demand Action"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "CM Ashok Gehlot Meets Family Of Slain Tailor Kanhaiya Lal", "description": "", "url": "https://indianexpress.com/videos/news-video/cm-ashok-gehlot-meets-family-of-slain-tailor-kanhaiya-lal/", "urlToImage": "https://images.indianexpress.com/2022/07/udaipur.jpg", "publishedAt": "2022-07-01T09:34:13Z", "content": "BJP To AIMIM, Congress To CPI(M): Political Leaders Condemn Act, Demand Action"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "From Stagflation To Boyfriend LoopHole, UPSC-CSE Key Terms In News", "description": "", "url": "https://indianexpress.com/videos/news-video/from-stagflation-to-boyfriend-loophole-upsc-cse-key-terms-in-news/", "urlToImage": "https://images.indianexpress.com/2022/07/Thumb-2.jpg", "publishedAt": "2022-07-01T09:32:46Z", "content": "BJP To AIMIM, Congress To CPI(M): Political Leaders Condemn Act, Demand Action"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Eknath Shinde Sworn In As Maharashtra CM, Devendra Fadnavis As Deputy CM", "description": "", "url": "https://indianexpress.com/videos/news-video/eknath-shinde-sworn-in-as-maharashtra-cm-devendra-fadnavis-as-deputy-cm/", "urlToImage": "https://images.indianexpress.com/2022/07/YT-Maha.jpg", "publishedAt": "2022-07-01T09:30:59Z", "content": "BJP To AIMIM, Congress To CPI(M): Political Leaders Condemn Act, Demand Action"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Skin expert shares face map to ‘decode what your breakouts are telling you’", "description": "\"There is more to breakouts than meets the eye and where they appear on your face can be the key to stopping them for good,\" said Dr Kiran Sethi in her Instagram post.", "url": "https://indianexpress.com/article/lifestyle/life-style/acne-breakouts-causes-face-mapping-treatment-7998172/", "urlToImage": "https://images.indianexpress.com/2022/06/acne1200.jpg", "publishedAt": "2022-07-01T09:30:04Z", "content": "“Breakouts are a bummer,” writes Dr Kiran Sethi, an aesthetic, skin and wellness doctor, on Instagram. And we couldn’t agree more with this statement as we know how it feels to get a pesky bump on ot… [+1598 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Neeraj Chopra Sets New National Record At Stockholm Diamond League", "description": "", "url": "https://indianexpress.com/videos/news-video/neeraj-chopra-sets-new-national-record-at-stockholm-diamond-league/", "urlToImage": "https://images.indianexpress.com/2022/07/Chopra-YT.jpg", "publishedAt": "2022-07-01T09:29:17Z", "content": "BJP To AIMIM, Congress To CPI(M): Political Leaders Condemn Act, Demand Action"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shubhra Gupta", "title": "Minions The Rise Of Gru movie review: A nippy, cheerful, fun summer film", "description": "Minions The Rise Of Gru movie review: Every character in this film feels alive, which is quite a win for a franchise whose characters are amongst the fastest-selling toys on the planet.", "url": "https://indianexpress.com/article/entertainment/movie-review/minions-the-rise-of-gru-movie-review-a-nippy-cheerful-fun-summer-film-8003007/", "urlToImage": "https://images.indianexpress.com/2022/07/minions-review-.jpg", "publishedAt": "2022-07-01T09:28:21Z", "content": "Minions The Rise Of Gru movie cast: Voiced by Steve Carell, Alan Arkin, Pierre Coffin, Taraji P Henson, Michelle Yeoh, Jean-Claude Van Damme, Lucy Lawless, Dolph Lundgren, Russell Brand, Danny Trejo,… [+3556 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Why a lean person runs the risk of being diabetic too", "description": "The weighing scale can give a false sense of security. Individuals with normal body weight but with increased proportion of body fat and low muscle mass often have insulin resistance. They are equally at risk of developing Type 2 diabetes, says Dr Ambrish Mit…", "url": "https://indianexpress.com/article/lifestyle/health/type-2-diabetes-risk-bmi-8002912/", "urlToImage": "https://images.indianexpress.com/2022/06/diabetes-main1200.jpg", "publishedAt": "2022-07-01T09:18:03Z", "content": "People often assume that if they are not overweight they are not at risk of developing diabetes. Thats largely because of the prevalence of Type 2 diabetes, which is directly related to body weight. … [+3088 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Komal RJ Panchal", "title": "Taapsee Pannu on working with Shah Rukh Khan, Rajkumar Hirani in Dunki: ‘Nobody picked up the phone for a recommendation’", "description": "Taapsee Pannu has finished one schedule of Rajkumar Hirani directorial Dunki. The film stars Shah Rukh Khan in the lead role.", "url": "https://indianexpress.com/article/entertainment/bollywood/taapsee-pannu-on-working-with-shah-rukh-khan-rajkumar-hirani-in-dunki-8002882/", "urlToImage": "https://images.indianexpress.com/2022/07/Collage-Maker-01-Jul-2022-01.43-PM.jpg", "publishedAt": "2022-07-01T09:17:48Z", "content": "Actor Taapsee Pannu is quite excited about her upcoming film Dunki opposite Shah Rukh Khan. Pannu has finished one schedule of the Rajkumar Hirani directorial, and is looking forward to the next sche… [+995 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "GST collections up 56% to Rs 1.44 lakh crore in June: FM Nirmala Sitharaman", "description": "Sitharaman said Rs 1.4 lakh crore is the \"rough bottom line\" now for GST collections.", "url": "https://indianexpress.com/article/business/economy/gst-collections-up-56-pc-to-rs-1-44-lakh-crore-in-june-fm-nirmala-sitharaman-8002547/", "urlToImage": "https://images.indianexpress.com/2022/06/P1-Nirmala-Sitharaman-3col.jpg", "publishedAt": "2022-07-01T09:15:54Z", "content": "By: PTI | New Delhi | July 1, 2022 2:45:54 pm\r\nUnion Finance Minister Nirmala Sitharaman (PTI) Join our Telegram channel (The Indian Express) for the latest news and updates\r\nFor all the latest Busin… [+37 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Timeline of Hong Kong under 25 years of Chinese rule", "description": "A timeline of key events in the history of Hong Kong, 25 years after its handover from British to Chinese rule.", "url": "https://indianexpress.com/article/world/timeline-hong-kong-handover-china-25-years-8002865/", "urlToImage": "https://images.indianexpress.com/2022/05/1-76.jpg", "publishedAt": "2022-07-01T09:15:24Z", "content": "China had promised the territory could retain its civil, economic and political liberties for 50 years under the one country, two systems” framework. However, in recent years Beijing has severely lim… [+4576 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "ED arrests 2 in money laundering case against Satyendar Jain", "description": "The two have been taken into custody under sections of the Prevention of Money Laundering Act (PMLA).", "url": "https://indianexpress.com/article/cities/delhi/ed-arrests-2-in-money-laundering-case-against-satyendar-jain-8002966/", "urlToImage": "https://images.indianexpress.com/2022/06/arrest-2-7-14.jpeg", "publishedAt": "2022-07-01T09:15:20Z", "content": "The ED has arrested two businessmen, Vaibhav Jain and Ankush Jain, in connection with the money laundering probe against Delhi minister Satyendar Jain, officials said on Friday.The two have been take… [+526 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gujarat: 30,260 kilograms of ‘fake cumin’ seized from Unjha godown", "description": "The flying squad of FDCA, Gandhinagar, local FDCA officials and Gujarat police conducted the raid on the godown on Gangapur-Rampur road belonging to Dilip Patel.", "url": "https://indianexpress.com/article/cities/ahmedabad/gujarat-30260-kilograms-of-fake-cumin-seized-from-unjha-godown-8002989/", "urlToImage": "https://images.indianexpress.com/2022/06/ajwain1200.jpg", "publishedAt": "2022-07-01T09:13:10Z", "content": "A total of 30,260 kilograms of spurious cumin seeds and raw materials were seized from a godown in Unjha, a well-known hub, by the Food and Drugs Control Administration (FDCA) Thursday. Unjha is the … [+743 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Amid price pressure, India’s manufacturing sector activity eases to nine-month low in June", "description": "The June PMI data pointed to an improvement in overall operating conditions for the twelfth straight month. In PMI parlance, a print above 50 means expansion while a score below 50 denotes contraction.", "url": "https://indianexpress.com/article/business/economy/amid-price-pressure-indias-manufacturing-sector-activity-eases-to-nine-month-low-in-june-8002697/", "urlToImage": "https://images.indianexpress.com/2022/07/manufacturing-pixabay-1200-1.jpg", "publishedAt": "2022-07-01T09:07:42Z", "content": "India’s manufacturing sector activity eased to a nine-month low in June as growth of total sales and production moderated amid intense price pressures, a monthly survey said on Friday.The seasonally … [+2607 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Raakhi Jagga", "title": "Mattewara textile park: People have lost trust after looking at existing pollution levels, says AAP leader Seechewal", "description": "During his earlier visits, Seechewal had expressed concerns over Sutlej river’s pollution and destruction of forest cover if textile park was set up.", "url": "https://indianexpress.com/article/cities/ludhiana/mattewara-textile-park-people-lost-trust-existing-pollution-levels-says-aap-leader-seechewal-8002956/", "urlToImage": "https://images.indianexpress.com/2022/07/balbir.jpg", "publishedAt": "2022-07-01T09:03:58Z", "content": "Following stiff protests from residents of Ludhiana over sanction of a textile park on a 1000 acre area in Koomkalan area near the Mattewara forest range, environmental activist and AAP’s Rajya Sabha… [+2203 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "A quarter of Americans think it’ll ‘soon be necessary to take up arms’ against govt, says poll", "description": "Among other things, the polls found that a majority of Americans agreed that the government is “corrupt and rigged against everyday people like me.”", "url": "https://indianexpress.com/article/world/americans-arms-against-government-poll-8002758/", "urlToImage": "https://images.indianexpress.com/2022/07/guns.jpg", "publishedAt": "2022-07-01T09:03:51Z", "content": "More than one-quarter of Americans believe that it may soon be necessary to take up arms against the United States government, according to a new poll reported by The Guardian.The results of the Univ… [+2281 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Alifiya Khan", "title": "Pune Campus Watch: Six city students win national competition with farmer friendly product", "description": "Students’ achievement inspires Sanskriti School to set up an innovation and incubation lab for future batches", "url": "https://indianexpress.com/article/cities/pune/pune-campus-watch-six-city-students-win-national-competition-with-farmer-friendly-product-8002915/", "urlToImage": "https://images.indianexpress.com/2022/07/IMG-20220701-WA0003.jpg", "publishedAt": "2022-07-01T08:58:53Z", "content": "When a team of six students from Punes Sanskriti School were given a brief by their teachers to come up with ideas for a national competition on rural innovation, little did they know that they were … [+4052 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "‘You better fix this’: Stranger Things fan flood Twitter with rage memes as Netflix crashes", "description": "On Friday when the streaming platform dropped volume 2 of Stranger Things 4, many were puzzled when they failed to log in or even load the finale episodes.", "url": "https://indianexpress.com/article/trending/trending-globally/stranger-things-fan-flood-twitter-with-rage-memes-as-netflix-crashes-8002769/", "urlToImage": "https://images.indianexpress.com/2022/07/stranger-things-4-netflix-down.jpg", "publishedAt": "2022-07-01T08:51:57Z", "content": "As people around the world were eagerly waiting to watch the final season ofStranger Things, most were left disappointed as Netflix crashed. Now, venting their frustrations on Twitter, fans are shari… [+3314 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Ranbir Kapoor says dad Rishi warned him he won’t be a national star despite doing good films: ‘I wanted to be Amitabh Bachchan, Shah Rukh’", "description": "In the second episode of 'RK Tapes', Ranbir Kapoor talks about his reel and real heroes Shah Rukh Khan and Amitabh Bachchan, and how his 'life would be set' if he even becomes two percent like them.", "url": "https://indianexpress.com/article/entertainment/bollywood/ranbir-kapoor-says-dad-rishi-warned-him-he-wont-be-a-national-star-despite-doing-good-films-srk-amitabh-bachchan-8002826/", "urlToImage": "https://images.indianexpress.com/2022/07/ranbir-kapoor-shah-rukh-khan-amitabh-bachchan.jpg", "publishedAt": "2022-07-01T08:44:00Z", "content": "Ranbir Kapoor has found an interesting way to promote his upcoming film Shamshera. The actor shot for a three-episodic series ‘RK Tapes’ with YRF. While the first one spoke about how acting was in hi… [+2166 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Careers Desk", "title": "TSTET 2022 Result declared; how to check", "description": "Final answer keys had been released on the official website for all subjects. Candidates can check results at tstet.cgg.gov.in", "url": "https://indianexpress.com/article/jobs/tstet-2022-result-declared-how-to-check-manabadi-com-tstet-cgg-gov-in-8002930/", "urlToImage": "https://images.indianexpress.com/2022/07/ch445860-1.jpg", "publishedAt": "2022-07-01T08:42:57Z", "content": "The School Education Minister had advised the officials to release TET results at the earliest. The final answer key was released on the official website on June 29, 2022.\r\nThe exam was conducted on … [+932 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Tom Hiddleston and Zawe Ashton expecting their first baby: A timeline of their relationship", "description": "In March 2022, it was confirmed that the actors had taken their relationship to the next level, when a stunning engagement ring was spotted on Ashton's finger on the BAFTAs red carpet", "url": "https://indianexpress.com/article/lifestyle/feelings/tom-hiddleston-zawe-ashton-expecting-first-baby-timeline-relationship-engagement-8002499/", "urlToImage": "https://images.indianexpress.com/2022/07/Tom-Hiddleston-and-Zawe-Ashton-1200.jpg", "publishedAt": "2022-07-01T08:40:55Z", "content": "Actor Tom Hiddleston, who stars as Loki, the God of Mischief in the Marvel Cinematic Universe is expecting his first child with actor Zawe Ashton, with whom he got engaged earlier this year.Buy Now |… [+2121 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Ritvik Chaturvedi", "title": "Digging Deep: What new research shows about the genetic diversity of India’s Gibbons", "description": "Faecal DNA has been used extensively in the past to understand the occupancy, population size as well as diet of a wide range of species.", "url": "https://indianexpress.com/article/technology/science/digging-deep-gibbon-8002702/", "urlToImage": "https://images.indianexpress.com/2022/07/Digging-Deep-Gibbon-.jpg", "publishedAt": "2022-07-01T08:30:19Z", "content": "A recent study from CSIR-Centre for Cellular and Molecular Biology, Hyderabad, sheds light on the population structure of western hoolock gibbons (Hoolock hoolock) in the North-Eastern region of Indi… [+4494 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "As SC pulls up Nupur Sharma, Congress’s Jairam Ramesh says BJP should hang its head in shame", "description": "Hailing the Supreme Court’s criticism of Nupur Sharma over her controversial comments on Prophet Mohammed, Congress leader Jairam Ramesh said the apex court has “held a mirror” to the current BJP government’s actions.", "url": "https://indianexpress.com/article/india/sc-pulls-up-nupur-sharma-congress-jairam-ramesh-bjp-8002913/", "urlToImage": "https://images.indianexpress.com/2022/06/nupur-4.jpg", "publishedAt": "2022-07-01T08:27:53Z", "content": "As the Supreme Court on Friday came down heavily on suspended BJP spokesperson Nupur Sharmaover her controversial comments on Prophet Mohammed, the Congress hit out at the BJP saying the apex court h… [+1736 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gujarat This Week: Pride fest in Ahmedabad, voiceover workshop by man who dubbed for Harry Potter", "description": "From an immersive sensory theatre experience titled The Darkroom 3.0 to a peek into the history of the queer movement in India, here's what's happening in Gujarat from July 2 to 9.", "url": "https://indianexpress.com/article/cities/ahmedabad/gujarat-this-week-pride-fest-in-ahmedabad-voiceover-workshop-by-man-who-dubbed-for-harry-potter-8002890/", "urlToImage": "https://images.indianexpress.com/2022/07/gujarat-this-week.jpg", "publishedAt": "2022-07-01T08:24:53Z", "content": "Pride Festival: Jashn-e-Karwaan\r\nAbout: With June being the Pride Month, performers and guests from all over the country will celebrate the history of the queer movement in India with a promise to cr… [+1389 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "IND vs ENG 5th Test Day 1 Live Score Updates: Bumrah to lead India", "description": "IND vs ENG 5th Test Day 1 Live Cricket Score Streaming Online Today Match, Sony Six , Sony LIV Live: India are eyeing a series win in England for the first time since 2007", "url": "https://indianexpress.com/article/sports/cricket/ind-vs-eng-5th-test-day-1-live-score-updates-8002884/", "urlToImage": "https://images.indianexpress.com/2022/07/ind-vs-eng-5th-test-day-1-live.jpg", "publishedAt": "2022-07-01T08:24:40Z", "content": "India Squad: Shubman Gill, Cheteshwar Pujara, Hanuma Vihari, Virat Kohli, Shreyas Iyer, Rishabh Pant(w), Ravindra Jadeja, Ravichandran Ashwin, Mohammed Shami, Jasprit Bumrah(c), Mohammed Siraj, Umesh… [+1666 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gujarat HC refuses nod to terminate 30-wk pregnancy of minor rape survivor from tribal community", "description": "Considering medical experts’ opinion, the socio-economic situation and the victim’s condition as a differently abled child, the Gujarat High Court ordered that once delivered, the baby shall be handed over to an orphanage home.", "url": "https://indianexpress.com/article/cities/ahmedabad/gujarat-hc-refuse-terminate-pregnancy-minor-rape-survivor-tribal-community-8002879/", "urlToImage": "https://images.indianexpress.com/2022/07/Gujarat-HC-1.jpg", "publishedAt": "2022-07-01T08:13:59Z", "content": "The Gujarat High Court refused to allow medical termination of pregnancy of a 15-year-old rape survivor who belongs to a tribal community following medical experts opinion that it will not be desirab… [+1554 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shubhra Gupta", "title": "Rocketry The Nambi Effect movie review: R Madhavan film is a patchy effort; equal parts effective and over-the-top amateurish", "description": "Rocketry The Nambi Effect movie review: R Madhavan makes you believe in the character, but the writing is stodgy, and the direction doesn’t quite make up for it.", "url": "https://indianexpress.com/article/entertainment/movie-review/rocketry-the-nambi-effect-movie-review-r-madhavan-film-patchy-effort-8002866/", "urlToImage": "https://images.indianexpress.com/2022/07/rocketry.jpg", "publishedAt": "2022-07-01T08:05:45Z", "content": "Its surprising that the story of Nambi Narayanan, an ISRO scientist who was falsely accused of espionage, took so long to be filmed. It has everything: a man who dedicated his life to the advancement… [+3465 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Manoj Bajpayee recalls when Shah Rukh Khan introduced him to Delhi nightlife: ‘That was the first time I saw a disco’", "description": "Manoj Bajpayee remembered how Shah Rukh Khan acted as his chaperone on his first night out in a discotheque in New Delhi.", "url": "https://indianexpress.com/article/entertainment/bollywood/manoj-bajpayee-recalls-when-shah-rukh-khan-introduced-him-to-delhi-nightlife-8002778/", "urlToImage": "https://images.indianexpress.com/2022/07/manoj-bajpayee-shah-rukh-khan.jpg", "publishedAt": "2022-07-01T08:05:08Z", "content": "Actor Manoj Bajpayee recalled how he didn’t even have shoes to gain entry into a nightclub, back when none other than Shah Rukh Khan became his chaperone to one when they were both students at Barry … [+1817 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Chennai: 2 die cleaning septic tank; building secretary, supervisor held", "description": "The workers were cleaning a septic tank that was about 20-feet deep when they fainted.", "url": "https://indianexpress.com/article/cities/chennai/chennai-septic-tank-cleaning-deaths-8002867/", "urlToImage": "https://images.indianexpress.com/2022/07/chennai-manual-scavenging.jpeg", "publishedAt": "2022-07-01T08:04:50Z", "content": "Two people cleaning a septic tank inside a gated community in Perungudi asphyxiated to death after inhaling poisonous gas on Wednesday evening, following which the police arrested the building secret… [+1164 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Assam CM Himanta Biswa Sarma files defamation suit against Manish Sisodia", "description": "Sarma's wife, Riniki Bhuyan Sarma, has already filed a Rs 100 crore civil defamation case against Sisodia.", "url": "https://indianexpress.com/article/north-east-india/assam/assam-cm-himanta-biswa-sarma-defamation-suit-manish-sisodia-8002868/", "urlToImage": "https://images.indianexpress.com/2013/01/Himanta-vs-Sisodia.jpg", "publishedAt": "2022-07-01T08:03:07Z", "content": "Assam Chief Minister Himanta Biswa Sarma on Friday filed a defamation case against Delhi Deputy Chief Minister Manish Sisodia over his remarks accusing the former of brazen corruption under the prete… [+2448 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Sudan doctors: 8 people killed in mass rallies against coup", "description": "In Khartoum, the police fired tear gas at thousands of demonstrators trying to reach the Republican Palace, the military's seat of power in the heart of the city", "url": "https://indianexpress.com/article/world/sudan-doctors-8-people-killed-in-mass-rallies-against-coup-8002843/", "urlToImage": "https://images.indianexpress.com/2022/02/Sudan.jpg", "publishedAt": "2022-07-01T08:01:24Z", "content": "Sudanese security forces shot eight people to death during anti-coup protests on Thursday, a medical group said. The incident took place as thousands marched to denounce the country’s military rulers… [+3640 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Varinder Bhatia", "title": "Removed from all party posts, rebel Kuldeep Bishnoi yet to part ways with Punjab Congress", "description": "Kuldeep Bishnoi's decision not to vote for the Congress came after the party sidelined him in favour of naming Udai Bhan, a Bhupinder Hooda loyalist, as the Haryana Congress president. Bishnoi was not even considered for the post of four working presidents.", "url": "https://indianexpress.com/article/cities/chandigarh/removed-party-posts-rebel-kuldeep-bishnoi-part-ways-punjab-congress-8002115/", "urlToImage": "https://images.indianexpress.com/2022/07/11-46.jpg", "publishedAt": "2022-07-01T08:00:27Z", "content": "Three weeks after he cross-voted for a Bharatiya Janata Party (BJP)-backed Independent candidate in the Rajya Sabha polls, leading to his removal from all posts within the Congress, suspense continue… [+3633 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "JKBOSE 12th Jammu division result declared: 70% students pass; girls surpass boys", "description": "A total of 7 students secured the first rank with 99.6% in Science,  5 with 98.8% in Arts, and Vanshika Mishra topped Commerce with  a score of 99.4%", "url": "https://indianexpress.com/article/education/jkbose-12th-jammu-division-result-declared-70-students-pass-indiaresult-in-jkbose-nic-in-8002629/", "urlToImage": "https://images.indianexpress.com/2021/02/jkbose-1200.jpg", "publishedAt": "2022-07-01T07:52:56Z", "content": "Jammu and Kashmir Board of Secondary Education (JKBOSE) declared the results of the Class 12 examination for the Jammu division on Thursday, June 30. To check their results, students can enter their … [+1150 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "National Doctor’s Day 2022: History, significance and theme of the day", "description": "\"There is an urgent need to strengthen healthcare education in India so that world-class competent medical physicians graduate each year,\" Dr Sameer Kulkarni said", "url": "https://indianexpress.com/article/lifestyle/health/national-doctors-day-2022-history-significance-and-theme-8002349/", "urlToImage": "https://images.indianexpress.com/2022/07/doctors-day_200_amit-chakravarty.jpg", "publishedAt": "2022-07-01T07:50:48Z", "content": "Every year, National Doctor’s Day is observed on July 1 in the memory of Dr Bidhan Roy, the former Chief Minister of Bengal, who was known for his selfless service to humanity. The day, commemorated … [+2509 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "‘Magic of speed’: Netizens can’t stop watching this little boy’s trick with stones", "description": "Posted by Instagram user @sahil.aazam, the Reel has amassed over 80 million views so far and many are sharing reaction videos to it on the app as well.", "url": "https://indianexpress.com/article/trending/viral-videos-trending/little-boy-magic-trick-with-tiny-stones-has-netizens-hooked-8002549/", "urlToImage": "https://images.indianexpress.com/2022/07/student-magic-trick.jpg", "publishedAt": "2022-07-01T07:43:38Z", "content": "When it comes to magic tricks be it in real life or on the internet, netizens’ fascination is unparalleled. Whether it is the sheer illusion or sleight of hand, the mysterious nature of the act often… [+1257 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sport Desk", "title": "India vs England 5th Test, Birmingham Weather Forecast, Pitch Report: Will it rain at Edgbaston?", "description": "India (IND) vs England (ENG) 5th Test, Birmingham Weather Forecast Today and Pitch Report: Rain expected at Edgbaston.", "url": "https://indianexpress.com/article/sports/cricket/india-vs-england-5th-test-weather-rain-birmingham-8002752/", "urlToImage": "https://images.indianexpress.com/2022/07/ind-vs-eng-weather.jpg", "publishedAt": "2022-07-01T07:41:59Z", "content": "India captain Rohit Sharma has been ruled out of the rescheduled fifth Test against England beginning on Friday and seamer Jasprit Bumrah will lead the side instead, the touring team said on Thursday… [+1819 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "চিকিৎসক দিবস উপলক্ষে ডাক্তারবাবুদের কুর্নিশ আমূল ইণ্ডিয়া’র", "description": "একটি বিশেষ ডুডলের মাধ্যমে ডাক্তারদের প্রতি শ্রদ্ধা জানানো হয়েছে।", "url": "https://bengali.indianexpress.com/viral/amul-celebrates-national-doctors-day-with-cute-doodle-463923/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/cats-5.jpg", "publishedAt": "2022-07-01T07:41:36Z", "content": "Stay updated with the latest news headlines and all the latest Viral news download Indian Express Bengali App.\r\nWeb Title: Amul celebrates national doctors day with cute doodle"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Udaipur killing: Two arrested for conspiracy", "description": "Tailor Kanhaiya Lal was killed Tuesday afternoon by two cleaver-wielding men, Riaz Akhtari and Ghouse Mohammad, who posted a grisly video of the crime online claiming responsibility for the “beheading”.", "url": "https://indianexpress.com/article/india/udaipur-killing-two-arrested-for-conspiracy-8002799/", "urlToImage": "https://images.indianexpress.com/2022/07/udaipur-killing.jpeg", "publishedAt": "2022-07-01T07:41:11Z", "content": "Two persons were arrested from Udaipur on Thursday night for conspiring the brutal beheading of a tailor, a senior police official said.Tailor Kanhaiya Lal was killed Tuesday afternoon by two cleaver… [+585 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Watch: Sanjana Ganesan reveals Bumrah and his mother’s reaction on his Test captaincy news", "description": "Jasprit Bumrah has experienced a meteoric rise in international cricket, including the five-day version in which he is only four seasons old, having made his Test debut in January 2018.", "url": "https://indianexpress.com/article/sports/cricket/ind-vs-eng-5th-test-watch-sanjana-ganesan-reveals-bumrah-and-his-mothers-reaction-on-his-test-captaincy-news-8002780/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-27.jpg", "publishedAt": "2022-07-01T07:35:01Z", "content": "Team India is all set to face England in the rescheduled 5th Test vs England from Friday under Jasprit Bumrah’s leadership. Bumrah became India’s 36th Test captain after his name’s announcement came … [+1184 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "PSEB Class 10th exam results 2022 not releasing today: Punjab Board official", "description": "PSEB 10th Result 2022 Date, Time, Websites: Punjab Board Mohali conducted the term II exams in April- May with the Punjabi language exam and concluded on May 19 with the physical education paper. Around 3.25 lakh students appeared in class 10 board exams this…", "url": "https://indianexpress.com/article/education/pseb-class-10th-exam-results-2022-date-time-not-releasing-today-punjab-board-official-pseb-ac-in-indiaresults-in-8002775/", "urlToImage": "https://images.indianexpress.com/2022/05/BSEB-results.jpg", "publishedAt": "2022-07-01T07:33:48Z", "content": "PSEB 10th Result 2022: The results for Punjab School Education Board (PSEB) Class 10 board results 2022 will not be released today, i;e on July 1, a board official confirmed. The matric examination r… [+1056 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Netflix crashes as users stream new Stranger Things episodes", "description": "Netflix is down following the release of Stranger Things Season 4 Volume 2.", "url": "https://indianexpress.com/article/technology/tech-news-technology/netflix-crashes-as-users-stream-new-stranger-things-episodes-8002792/", "urlToImage": "https://images.indianexpress.com/2022/07/Netflix-crash-season-4.jpg", "publishedAt": "2022-07-01T07:30:15Z", "content": "Streaming service Netflix is currently facing an outage for some users. The outage is expected to be caused by a large influx of users who logged in to the app at once. The synchronised logins are se… [+1055 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shruti Dhapola", "title": "Nothing easy about Shorts, say Indian YouTube creators who have tasted success", "description": "YouTube Shorts has changed life for Indian creators. But success on Shorts also requires a lot of commitment, and investment from the creators.", "url": "https://indianexpress.com/article/technology/social/youtube-shorts-indian-creators-a2-motivation-dushyant-kukreja-and-others-8002242/", "urlToImage": "https://images.indianexpress.com/2022/07/YouTube_Creators1.jpg", "publishedAt": "2022-07-01T07:28:45Z", "content": "Explosive growth in just a few months, billions of views, and millions of new followers: Thats how YouTube Shorts has changed life for Indian creators. As YouTube hosts its annual FanFest this year f… [+6265 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Entertainment Desk", "title": "‘অটোচালক থেকে মুখ্যমন্ত্রী’, মহারাষ্ট্রের মসনদে শিণ্ডে বসতেই ‘জি হুজুর’ শুরু কঙ্গনার", "description": "গদি উল্টালো উদ্ধবের! নয়া মুখ্যমন্ত্রী শিণ্ডেকে নিয়ে আত্মহারা কঙ্গনা।", "url": "https://bengali.indianexpress.com/entertainment/kangana-ranaut-congratulates-maharashtra-cm-eknath-shinde-463913/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/kangana.jpg", "publishedAt": "2022-07-01T07:28:05Z", "content": ", “ , ” - \r\n - , - \r\n , “ ” , ‘ ’ , \r\n[ : ! ]\r\n, , , , \r\n , \r\nStay updated with the latest news headlines and all the latest Entertainment news download Indian Express Bengali App.\r\nWeb Title: Kangan… [+50 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Aryan moves court to seek return of passport, cancellation of bail bond", "description": "In his plea filed before the court, Aryan has submitted that he was granted bail by the Bombay High Court last year after being arraigned as an accused in the case.", "url": "https://indianexpress.com/article/cities/mumbai/aryan-khan-passport-cancellation-bail-bond-8002784/", "urlToImage": "https://images.indianexpress.com/2022/07/Aryan-Khan-1200by667.jpg", "publishedAt": "2022-07-01T07:26:53Z", "content": "Aryan Khan, son of actor Shah Rukh Khan, has sought the return of his passport and cancellation of his bail bond in the Cordelia cruise ‘drugs’ case. Aryan was among the six accused discharged from t… [+719 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Ludhiana: Extortion racket run by ‘Canada-based’ gangster, jailed associate busted; 7 held", "description": "The police said the accused were held after they tried to extort Rs 3 crore from a Ludhiana-based businessman. Officers said that interrogation revealed their links with gangster Sukha Duneke who is believed to be hiding in Canada.", "url": "https://indianexpress.com/article/cities/ludhiana/ludhiana-extortion-racket-canada-based-gangster-busted-8002757/", "urlToImage": "https://images.indianexpress.com/2022/07/handcuff-arrest-1.jpg", "publishedAt": "2022-07-01T07:25:04Z", "content": "The Ludhiana police claimed to have busted an extortion racket allegedly run by two gangsters one believed to be in Canada and another who is lodged in jail with the arrest of seven members of the ga… [+2516 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Tamil Nadu: Ensure students, staff are wearing masks, education department tells schools", "description": "School education department issues circular directing schools to follow safety measures as there is a risk of students getting infected, leading to a spike in Covid-19 cases", "url": "https://indianexpress.com/article/cities/chennai/tamil-nadu-ensure-students-staff-are-wearing-masks-education-department-tells-schools-8002765/", "urlToImage": "https://images.indianexpress.com/2022/07/PTI02_01_2022_000102B-1.jpeg", "publishedAt": "2022-07-01T07:24:03Z", "content": "The Tamil Nadu School Education Department has now asked schools to stringently ensure that students and staff are wearing masks inside the campus.The academic year 2022-23 commenced for schools in t… [+1572 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Don’t stop vehicles for random checks, Karnataka DGP tells Bengaluru traffic police", "description": "However, despite the Karnataka police chief's direction, the practice continues, say Bengaluru citizens.", "url": "https://indianexpress.com/article/cities/bangalore/karnataka-dgp-bengaluru-traffic-police-random-checks-8002701/", "urlToImage": "https://images.indianexpress.com/2022/07/police-stop.jpg", "publishedAt": "2022-07-01T07:22:53Z", "content": "Karnataka police chief Praveen Sood has said on Twitter that he has directed the Bengaluru police commissioner and traffic officials not to stop vehicles in the city for random checks, unless it is f… [+1502 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "CPM-এর সদর কার্যালয়ের সামনে বিস্ফোরণ, রোমহর্ষক কাণ্ডে শহরে হুলস্থূল", "description": "সিসিটিভি ফুটেজে দেখা গিয়েছে যে একটি বাইকে থাকা এক ব্যক্তি একটি বস্তু ছুড়ে পালিয়ে যাচ্ছে।", "url": "https://bengali.indianexpress.com/politics/national/cpi-m-hits-out-at-congress-after-crude-bomb-attack-on-its-party-office-463907/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/01/Blast.jpg", "publishedAt": "2022-07-01T07:22:49Z", "content": ", \r\n - \r\n, , \r\n - , \r\n , ” ” \r\n - , \r\n , ” ?” , \r\n , ” ? ”\r\nStay updated with the latest news headlines and all the latest National news download Indian Express Bengali App.\r\nWeb Title: Cpi m hits ou… [+56 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "তোমাকে খুব মিস করছি…! ডেলিভারি বয়ের মেসেজ পেয়েই চোখ কপালে মহিলার", "description": "এরপরই সুইগির তরফে ওই মহিলার সঙ্গে যোগাযোগ করা হয়।", "url": "https://bengali.indianexpress.com/viral/swiggy-delivery-agent-sends-creepy-messages-to-woman-customer-company-deactivates-him-463905/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/cats-4.jpg", "publishedAt": "2022-07-01T07:20:25Z", "content": "..! , ..! , \r\n , ? , \r\n : [ ! ]\r\n , ‘’ , “ ”, !\r\n : [ , ]\r\n , \r\nStay updated with the latest news headlines and all the latest Viral news download Indian Express Bengali App.\r\nWeb Title: Swiggy deliv… [+72 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Kiara Advani on relationship rumours with Sidharth Malhotra: ‘Saying something won’t make much of a difference’", "description": "Kiara Advani shared that she had decided early on that she will never comment on her personal life. The JugJugg Jeeyo actor is rumoured to be dating her Shershaah co-star Sidharth Malhotra.", "url": "https://indianexpress.com/article/entertainment/bollywood/kiara-advani-rumours-sidharth-malhotra-saying-something-wont-make-much-difference-8002622/", "urlToImage": "https://images.indianexpress.com/2022/01/Sidharth-Malhotra-1200-1.jpg", "publishedAt": "2022-07-01T07:19:10Z", "content": "Kiara Advani is enjoying a golden period at the box office as shortly after Bhool Bhulaiyaa 2, the actor has another hit in JugJugg Jeeyo on her hands. While Kiara’s work life is all sorted, the inte… [+1728 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "World Health Organisation asks South-East Asian countries to scale up Covid vaccination", "description": "WHO also recommends countries to prioritize primary series and booster doses to all high priority groups, emphasizing that many deaths can be avoided if target groups such as healthcare workers, elderly are vaccinated first.", "url": "https://indianexpress.com/article/world/who-south-east-asian-countries-covid-vaccination-8002653/", "urlToImage": "https://images.indianexpress.com/2022/05/Covid-vaccination-2.jpeg", "publishedAt": "2022-07-01T07:12:19Z", "content": "The World Health Organisation on Friday called on countries in South-East Asia to accelerate Covid-19 vaccination coverage as the region again witnessing a rise in cases.While significant progress ha… [+3068 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Jimmy Leivon", "title": "Manipur Landslide: Two more bodies recovered, death toll rises to 10", "description": "The bodies recovered are confirmed to be of the missing personnel of the 107 Territorial Army (TA) stationed at the landslide hit camp situated near Marangching. With this, the total number of TA casualties claimed by the landslide stands at 9.", "url": "https://indianexpress.com/article/north-east-india/manipur/manipur-landslide-death-toll-update-live-8002667/", "urlToImage": "https://images.indianexpress.com/2022/07/PTI06_30_2022_000209A.jpg", "publishedAt": "2022-07-01T07:07:23Z", "content": "The death toll in the landslide that occurred in Noney district of Manipur on Thursday went up to 10 with the recovery of two more bodies on Friday.The bodies recovered are confirmed to be of the mis… [+1084 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Simran Sharma", "title": "‘Charisma coach’ Danish Sheikh decodes the human trait, shares secrets to ‘learn, practise, and master’ it", "description": "\"The challenge I used to face was that there is this myth in society that charisma is an intrinsic trait. Either you have it or not,\" he said", "url": "https://indianexpress.com/article/lifestyle/life-style/charisma-coach-danish-sheikh-personality-trait-communication-skills-power-7995188/", "urlToImage": "https://images.indianexpress.com/2022/06/Danish-Sheikh-picture-feature.jpg", "publishedAt": "2022-07-01T07:00:20Z", "content": "Good communication skills were something Danish Sheikh desperately wanted to learn. That is why the young boy from Indore worked as a tourist guide for free for nearly two years, “only to talk to str… [+7340 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Meta slashes hiring plans, girds for ‘fierce’ headwinds", "description": "Meta has reduced its target for hiring engineers in 2022 to around 6,000-7,000, down from an initial plan to hire about 10,000 new engineers, Zuckerberg said.", "url": "https://indianexpress.com/article/technology/tech-news-technology/meta-slashes-hiring-plans-girds-for-fierce-headwinds-8002695/", "urlToImage": "https://images.indianexpress.com/2022/07/Facebook_Meta_Reuters.jpg", "publishedAt": "2022-07-01T06:58:09Z", "content": "Facebook-owner Meta Platforms Inc has cut plans to hire engineers by at least 30% this year, CEO Mark Zuckerberg told employees on Thursday, as he warned them to brace for a deep economic downturn. “… [+4366 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Danes search Bahrain Victorious riders’ hotel ahead of Tour", "description": "The team said it felt the timing of the searches was “aimed at intentionally damaging the team’s reputation.”", "url": "https://indianexpress.com/article/sports/sport-others/danes-search-bahrain-victorious-riders-hotel-ahead-of-tour-bahrain-victorious-tour-de-france-dannie-rise-vladimir-miholjevic-jack-haig-8002565/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-26.jpg", "publishedAt": "2022-07-01T06:55:02Z", "content": "The Bahrain Victorious team at the Tour de France was raided by police for the second time this week on Thursday, a day before the tour’s grand start in Denmark. The team confirmed in a statement tha… [+2055 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Facebook starts testing new NFT tab with select creators in the US", "description": "Meta technical program manager Navdeep Singh displayed screenshots of NFTs on Twitter.", "url": "https://indianexpress.com/article/technology/crypto/facebook-starts-testing-new-nft-tab-for-select-creators-in-the-us-8002589/", "urlToImage": "https://images.indianexpress.com/2022/01/Zuck_Meta_AP_1.jpg", "publishedAt": "2022-07-01T06:54:22Z", "content": "Facebook has begun testing a new digital collectables tab with select creators in the US. Creators will be able to display their non-fungible-tokens (NFTs) on their timelines. Meta technical program … [+2055 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Chetan Nayak", "title": "Tech InDepth: What is Android Auto and how can you use it? - The Indian Express", "description": "Here's all you need to know about Android Auto, how you can set it up and use its features.", "url": "https://indianexpress.com/article/technology/tech-news-technology/tech-indepth-what-is-android-auto-and-how-can-you-use-it-8001502/", "urlToImage": "https://images.indianexpress.com/2022/06/Tech-InDepth-Android-Auto.jpg", "publishedAt": "2022-07-01T06:48:52Z", "content": "Be it streaming music, using navigation apps or having messages read out while you drive, the infotainment system in your car is gradually becoming one of the most in-demand features. Almost all new … [+3524 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Bill Gates on meeting Mahesh Babu: ‘It was great meeting you and Namrata’", "description": "Billionaire technologist Bill Gates has reacted to meeting Tollywood star Mahesh Babu and his wife Namrata in New York recently.", "url": "https://indianexpress.com/article/entertainment/telugu/bill-gates-on-meeting-mahesh-babu-it-was-great-meeting-you-and-namrata-8002615/", "urlToImage": "https://images.indianexpress.com/2022/06/Mahesh-Babu-Bill-Gates-Namrata-1200by667.jpg", "publishedAt": "2022-07-01T06:44:38Z", "content": "Tollywood superstar Mahesh Babu was overjoyed after bumping into billionaire technologist Bill Gates in New York recently. He also shared a photo from the meeting with Gates whom he called “the great… [+2130 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anjali Marar", "title": "Night compost soil in Himachal Pradesh’s Lahaul highly nutritive, finds study", "description": "Final compost recovered from dry toilets has high fertilising efficiency, says study conducted by researchers from CSIR-Institute of Himalayan Bioresource Technology (IHBT), Palampur.", "url": "https://indianexpress.com/article/cities/pune/night-compost-soil-himachal-pradeshs-lahaul-highly-nutritive-8002669/", "urlToImage": "https://images.indianexpress.com/2022/07/lahaul-night-soil.jpg", "publishedAt": "2022-07-01T06:43:58Z", "content": "The night soil compost, produced commonly in homes around Lahaul in Himachal Pradesh, can best be used as soil conditioner and results in higher germination rates of both food and non-food crops, a n… [+2546 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kamaldeep Singh Brar", "title": "British national Jaggi Johal arbitrarily detained in India, says UK PM Boris Johnson", "description": "Johal was arrested on November 4, 2017, from Jalandhar by the Punjab Police for his alleged role in targeted killings, including that of RSS leader Brigadier (retired) Jagdish Gagneja.", "url": "https://indianexpress.com/article/cities/amritsar/british-national-jaggi-johal-arrest-arbitrary-uk-pm-boris-johnson-8002666/", "urlToImage": "https://images.indianexpress.com/2022/07/Jagtar-Singh-Johal.jpg", "publishedAt": "2022-07-01T06:42:49Z", "content": "UK Prime Minister Boris Johnson, while speaking about the arrest of British national Jagtar Singh Johal, aka Jaggi Johal by Punjab Police for his alleged involvement in crimes between April 2017 and … [+3099 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "What SC said on Nupur Sharma: Her loose tongue, Udaipur murder, security threat and more", "description": "While hearing the plea filed by Sharma seeking transfer of the FIRs against her to Delhi, the Supreme Court  accusing the leader of “igniting emotions across the country” with her “disturbing” remarks.", "url": "https://indianexpress.com/article/india/nupur-sharma-supreme-court-apologise-top-five-remarks-8002658/", "urlToImage": "https://images.indianexpress.com/2022/07/nupur-sharma-1-5.jpeg", "publishedAt": "2022-07-01T06:34:37Z", "content": "The Supreme Court Friday slammed suspended BJP leader Nupur Sharma, for her controversial remarks on Prophet Mohammad. While hearing the plea filed by Sharma seeking transfer of the FIRs against her … [+1044 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rupsa Chakraborty", "title": "Four out of 10 households in urban slums of Nagpur use chulha for cooking: Survey", "description": "A survey conducted by Warrior Moms, a countrywide mothers’ network, and the Centre for Sustainable Development (CFSD) has found that 4 out of 10 households in the slums of urban Nagpur use chulhas for cooking and heating even though most of them have LPG conn…", "url": "https://indianexpress.com/article/cities/mumbai/four-out-of-10-households-in-urban-slums-of-nagpur-use-chulha-for-cooking-survey-8002660/", "urlToImage": "https://images.indianexpress.com/2016/05/chulha-1200.jpg", "publishedAt": "2022-07-01T06:34:04Z", "content": "POONAM MARKAM, a 20-year-old daily wager from Siddheshwari slums in Nagpur, cooks on a domestic chulha (brick stove) to feed her family of five. The nine-month pregnant woman with a meagre monthly in… [+4107 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "IND vs ENG 5th Test Live Streaming: When and where to watch India vs England match live online in India?", "description": "India vs England Live Streaming, 5th Test: Much-Awaited Final Test Match of India's Tour of England 2021 will before long start off at 3 PM IST; Check When and How to Watch", "url": "https://indianexpress.com/article/sports/cricket/ind-vs-eng-5th-test-live-streaming-india-tour-of-england-2022-5th-test-live-broadcast-at-edgbaston-in-birmingham-from-july-1-5-8002613/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-25.jpg", "publishedAt": "2022-07-01T06:32:06Z", "content": "India Tour of England 5th Test Live Streaming: With a 2-1 lead in the series, India will now be looking to win the fifth rescheduled Test against England at Edgbaston in Birmingham. Team India, in Ko… [+914 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Casting of Auguste Rodin’s Thinker fetches 10.7 mln euros at Paris auction", "description": "The sculpture initially represented Dante, the medieval Italian poet and author of the Divine Comedy, leaning forward to observe the circles of Hell, while meditating on his work.", "url": "https://indianexpress.com/article/lifestyle/art-and-culture/casting-of-auguste-rodins-thinker-fetches-10-7-mln-euros-at-paris-auction-8001690/", "urlToImage": "https://images.indianexpress.com/2022/06/france-auction-rodin.jpg", "publishedAt": "2022-07-01T06:30:14Z", "content": "A casting of Auguste Rodin’s “The Thinker” sculpture, one of the most iconic works of art in the world, sold for 10.7 million euros ($11.14 million) at a Paris auction on Thursday.The auction house, … [+1513 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "North Korea suggests balloons flown from South brought Covid-19", "description": "Activists for years have flown balloons across the border to distribute hundreds of thousands of propaganda leaflets critical of North Korean leader Kim Jong Un.", "url": "https://indianexpress.com/article/world/north-korea-suggests-balloons-flown-from-south-brought-covid-19-8002542/", "urlToImage": "https://images.indianexpress.com/2022/07/nkorea-covid.jpg", "publishedAt": "2022-07-01T06:27:47Z", "content": "North Korea suggested Friday its Covid-19 outbreak began in people who had contact with balloons flown from South Korea a highly questionable claim that appeared to be an attempt to hold its rival re… [+4886 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Three held near Chennai’s Tambaram for supplying addictive pills to students", "description": "Police said the gang brought the tablets illegally from Mumbai and supplied them to students across Chennai. Nearly 600 tablets and 100 syringes were seized from them.", "url": "https://indianexpress.com/article/cities/chennai/three-held-chennai-tambaram-supplying-addictive-pills-students-8002512/", "urlToImage": "https://images.indianexpress.com/2022/07/handcuff-arrest.jpg", "publishedAt": "2022-07-01T06:25:37Z", "content": "The Chennai police busted a three-member gang that allegedly supplied addictive pills to college students and others near Tambaram on Thursday, officers said, adding that nearly 600 tablets and 100 s… [+1508 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Gauahar Khan says she lost Slumdog Millionaire role because she was ‘too good-looking’, claims Danny Boyle called her a ‘fantastic actor’", "description": "Gauahar Khan said in an interview that Danny Boyle was impressed with her auditions for Slumdog Millionaire, but couldn't cast her in the film because she didn't look like someone from the slums. He also could not believe that she has trained in India.", "url": "https://indianexpress.com/article/entertainment/bollywood/gauahar-khan-lost-slumdog-millionaire-role-because-she-was-too-good-looking-danny-boyle-8002610/", "urlToImage": "https://images.indianexpress.com/2022/01/gauahar-khan-.jpg", "publishedAt": "2022-07-01T06:25:03Z", "content": "Gauahar Khan in an interview revealed that she appeared for five rounds of auditions for the Oscar-winning film Slumdog Millionaire, but director Danny Boyle couldn’t picture her as someone from the … [+2030 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "OnePlus Nord 2T launched in India with Dimensity 1300, 80W charging", "description": "OnePlus Nord 2T launched in India: The OnePlus Nord 2T goes on sale from July 5 on Amazon India. Here are all the details on the price, specifications, etc.", "url": "https://indianexpress.com/article/technology/mobile-tabs/oneplus-nord-2t-launched-in-india-with-dimensity-1300-80w-charging-8002648/", "urlToImage": "https://images.indianexpress.com/2022/07/OnePlus-Nord-2T-express-Photo1.jpg", "publishedAt": "2022-07-01T06:22:57Z", "content": "OnePlus has launched the OnePlus Nord 2T in India. The new mid-range Nord series phone succeeds the Nord 2 5G and comes with new specifications like the MediaTek Dimensity 1300 and 80W fast charging … [+1348 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Petrol, Diesel rates today, July 1, 2022: Check fuel prices in Mumbai, Delhi, Chennai and other cities", "description": "Fuel Prices Today (July1,2022): Petrol Diesel Prices in metro cities remain constant. In Mumbai, a litre of petrol retails for Rs 111.35 per litre, while that of diesel costs Rs 97.28. In Delhi, petrol costs Rs 96.72, while diesel is available for Rs 89.62. C…", "url": "https://indianexpress.com/article/business/commodities/petrol-diesel-rates-today-july-1-delhi-mumbai-chennai-banglore-8002429/", "urlToImage": "https://images.indianexpress.com/2022/07/petrol.jpg", "publishedAt": "2022-07-01T06:21:32Z", "content": "Petrol and Diesel Rates Today in Mumbai, Delhi, Chennai, Bengaluru: Prices of petrol and diesel remained the same across the nation for the 40th straight day.In Mumbai, petrol remains available for R… [+2663 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "ICSI CSEET 2022 Admit card released: How to download", "description": "The CSEET 2022 exam will be conducted on July 9 and will be administered remotely. Candidates appearing for the CSEET exam can take the test using a desktop computer or laptop with an active internet connection.", "url": "https://indianexpress.com/article/education/icsi-cseet-2022-admit-card-released-how-to-download-icsi-edu-8002582/", "urlToImage": "https://images.indianexpress.com/2022/07/CSEET-1200-1.jpg", "publishedAt": "2022-07-01T06:18:25Z", "content": "The CSEET 2022 exam will be conducted on July 9 and will be administered remotely. Candidates appearing for the CSEET exam can take the test using a desktop computer or laptop with an active internet… [+857 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Aryan Khan asks court to return his passport, moves plea", "description": "Aryan Khan moved an application in the special court, through his lawyers seeking the return of his passport.", "url": "https://indianexpress.com/article/entertainment/bollywood/shah-rukh-khan-son-aryan-khan-asks-court-to-return-his-passport-moves-plea-8002570/", "urlToImage": "https://images.indianexpress.com/2022/07/Aryan-Khan-1200by667.jpg", "publishedAt": "2022-07-01T06:16:33Z", "content": "Bollywood superstar Shah Rukh Khan‘s son Aryan, who got a clean chit from the NCB in the last year’s drugs-on-cruise case, on Thursday moved a plea before a special NDPS court, seeking return of his … [+942 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Incredibly grateful to all those within the sport: Lewis Hamilton after Pique comments", "description": "Former Formula One champion Nelson Piquet apologized to Lewis Hamilton on Wednesday, saying the racial term he used about the Mercedes driver was “ill thought out” but was not meant to be offensive.", "url": "https://indianexpress.com/article/sports/motor-sport/im-incredibly-grateful-to-all-those-that-have-been-supportive-within-the-sport-lewis-hamilton-after-pique-comments-8002503/", "urlToImage": "https://images.indianexpress.com/2020/09/hamilton-f1-tuscan.jpg", "publishedAt": "2022-07-01T06:14:18Z", "content": "Lewis Hamilton, on Thursday, expressed gratitude towards members of the motorsport community for giving him support and reiterated that Formula One should ignore old voices and reject racism as it fo… [+2149 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "বিদ্রোহী সেনা বিধায়কদের বরখাস্তের আর্জি, ১১ জুলাই শুনানি শীর্ষ আদালতে", "description": "বিদ্রোহী বিধায়কদের বরখাস্ত করার আবেদন করে শিবসেনার করা মামলা শুনবে সুপ্রিম কোর্ট।", "url": "https://bengali.indianexpress.com/politics/sc-to-hear-sena-plea-seeking-suspension-of-rebel-leaders-on-july-11-463879/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/Udhhav-Thakrey-Eknath-Shinde.jpg", "publishedAt": "2022-07-01T06:13:44Z", "content": ", , ” , ” , \r\n ’ \r\n - , - \r\n, , -- , “ ”\r\n, - \r\nStay updated with the latest news headlines and all the latest Politics news download Indian Express Bengali App.\r\nWeb Title: Sc to hear sena plea seek… [+41 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "DU to conduct practical exams, viva voce for UG courses in offline mode", "description": "DU's Examination Branch on Wednesday issued a notification entailing the procedure that needs to be followed to conduct internal assessments, practicals, viva voce, projects, oral examinations, apprenticeships, internships and fieldwork.", "url": "https://indianexpress.com/article/education/du-to-conduct-practical-exams-viva-voce-for-ug-courses-in-offline-mode-8002609/", "urlToImage": "https://images.indianexpress.com/2022/07/ch591306-1.jpg", "publishedAt": "2022-07-01T06:07:00Z", "content": "The Delhi University (DU) has announced that practical examinations, viva voce, and oral exams of undergraduate courses will be conducted in the physical mode by “strictly adhering” to Covid guidelin… [+1793 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Sharks Tank India’s Ashneer Grover and Anupam Mittal meet in London, fans say ‘ab actual business hoga’", "description": "Ashneer Grover and Anupam Mittal, who shared the panel in Shark Tank India, recently met in London with their wives over dinner.", "url": "https://indianexpress.com/article/entertainment/television/sharks-tank-india-ashneer-grover-anupam-mittal-meet-in-london-fans-ab-actual-business-hoga-8002445/", "urlToImage": "https://images.indianexpress.com/2022/07/anupam-mittal-ashneer-grover-shark-tank-india.jpg", "publishedAt": "2022-07-01T06:01:17Z", "content": "Shark Tank India’s Ashneer Grover has been holidaying in the UK with his family. After meeting Arjun Kapoor in Paris, the BharatPe co-founder now reunited with his co-shark Anupam Mittal in London. T… [+1673 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Miscarriages and summer: Experts decode the link", "description": "\"The problems with the genes or chromosomes can lead to a miscarriage,\" said Dr Gandhali Deorukhkar, consultant gynaecologist", "url": "https://indianexpress.com/article/lifestyle/health/study-miscarriages-are-likely-to-increase-in-summers-7999313/", "urlToImage": "https://images.indianexpress.com/2022/06/pregnant1200.jpg", "publishedAt": "2022-07-01T06:00:22Z", "content": "A new study has revealed that the risk of miscarriage is likely to go up during summer. Published in the journal ‘Epidemiology’, the study noted that up to 30 per cent of pregnancies end in miscarria… [+3461 chars]"}]}