{"status": "ok", "totalResults": 437, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Ukrainian director Dmytro Sukholytkyy-Sobchuk denounces Russian presence at Cannes", "description": "75th annual Cannes Film Festival has banned official Russian delegations from attending, but Russian dissident Kirill Serebrennikov, who has spoken out against the invasion of Ukraine, premiered his in-competition film Tchaikovsky's Wife at the festival on We…", "url": "https://indianexpress.com/article/entertainment/entertainment-others/ukrainian-director-dmytro-sukholytkyy-sobchuk-denounces-russian-presence-at-cannes-7930203/", "urlToImage": "https://images.indianexpress.com/2022/05/Dmytro-Sukholytkyy-Sobchuk-1200.jpg", "publishedAt": "2022-05-22T08:48:32Z", "content": "Ukrainian director Dmytro Sukholytkyy-Sobchuk criticised the Cannes Film Festivalfor including a Russian director in its line-up, as the debut filmmaker’s Pamfir was shown at Cannes’ Directors Fortni… [+1530 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manoj Dattatrye More", "title": "Cancelled Ayodhya trip as a trap was being laid for me, says Raj Thackeray at Pune rally", "description": "The Maharashtra Navnirman Sena (MNS) chief said if he had decided to still visit Ayodhya, then MNS workers and many Hindus would have followed him.", "url": "https://indianexpress.com/article/cities/pune/cancelled-ayodhya-trip-as-a-trap-was-being-laid-for-me-says-raj-thackeray-at-pune-rally-7930207/", "urlToImage": "https://images.indianexpress.com/2022/05/raj.jpg", "publishedAt": "2022-05-22T08:44:04Z", "content": "Two days after he called off his proposed Ayodhya visit, Maharashtra Navnirman Sena (MNS) chief Raj Thackeray on Sunday alleged that he was forced to take the decision in view of a “trap” that was be… [+5054 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Aditi Rao Hydari on North vs South debate: Not fair that they are doing well and suddenly we are like ‘okay, this is also us’", "description": "Aditi Rao Hydari said she never chooses a film based on its language, but on how wonderful the film, the character and the director is.", "url": "https://indianexpress.com/article/entertainment/bollywood/aditi-rao-hydari-on-north-vs-south-debate-7930188/", "urlToImage": "https://images.indianexpress.com/2022/05/Aditi-Rao-Hydari-1200-1.jpg", "publishedAt": "2022-05-22T08:43:57Z", "content": "Aditi Rao Hydari has shared her two cents on the ongoing North film industry vs South film industry debate. The actor, who has a filmography boasting of films by Mani Ratnam to Sanjay Leela Bhansali,… [+2343 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shalini Rajani", "title": "A quick jackfruit spread to make your healthy breads even healthier", "description": "Jackfruit is high in nutrients and antioxidants and has a number of health benefits, including improved blood sugar control. It makes for an excellent meat alternative in vegetarian and vegan recipes.", "url": "https://indianexpress.com/article/lifestyle/food-wine/a-quick-jackfruit-spread-to-make-your-healthy-breads-even-healthier-7930073/", "urlToImage": "https://images.indianexpress.com/2022/05/shalini.jpg", "publishedAt": "2022-05-22T08:40:29Z", "content": "Millet journey is not about those exhaustive meal plans, nor is it about adding processed stuff to elevate the taste quotient. It is always about adding value to your healthy meals with stuff thats h… [+3538 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Quad Summit will provide opportunity to review progress of grouping’s initiatives: PM Modi", "description": "In his departure statement ahead of his visit to Japan from May 23-24, Modi said during his visit he will also hold a bilateral meeting with US President Joe Biden, where they will discuss further consolidation of the multi-faceted bilateral relations.", "url": "https://indianexpress.com/article/india/quad-summit-will-provide-opportunity-to-review-progress-of-groupings-initiatives-pm-modi-7930179/", "urlToImage": "https://images.indianexpress.com/2022/05/NARENDRA-MODI.jpg", "publishedAt": "2022-05-22T08:36:16Z", "content": "The second in-person Quad Leaders’ Summit in Japan will provide an opportunity for leaders of four countries to review the progress of the grouping’s initiatives and exchange views on developments in… [+1645 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Adoptions another facet of life halted by war in Ukraine", "description": "When the war started, there were more than 300 Ukrainian children previously hosted by American families that were seeking to formally adopt them, said Ryan Hanlon, chief executive officer and president of the National Council For Adoption.", "url": "https://indianexpress.com/article/world/adoptions-another-facet-of-life-halted-by-war-in-ukraine-7930087/", "urlToImage": "https://images.indianexpress.com/2022/05/ukraine-adoption.jpg", "publishedAt": "2022-05-22T08:34:14Z", "content": "The ripple effects of Russias invasion of Ukraine have been devastating for families of all kinds including those who have seen their prospective adoptions put on hold.Ukraine was once one of the U.S… [+5293 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Rejecting ‘Love Letters’ to North Korea, Joe Biden offers carrots and sticks instead", "description": "Joe Biden and Yoon announced that they would explore ways to expand the joint military exercises that have historically irritated North Korea so much that Trump sought to curtail them during his presidency in a concession to Kim.", "url": "https://indianexpress.com/article/world/rejecting-love-letters-to-north-korea-joe-biden-offers-carrots-and-sticks-instead-7930186/", "urlToImage": "https://images.indianexpress.com/2022/05/biden-yoon.jpg", "publishedAt": "2022-05-22T08:33:12Z", "content": "Love letters are out. Military exercises are back. In his first visit to South Korea since taking office, President Joe Biden restored Americas strategy toward the Korean Peninsula to the traditional… [+9037 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Kate McKinnon, Pete Davidson departing from Saturday Night Live", "description": "Kate McKinnon, 38, won two Emmys for Saturday Night Live and was nominated for nine in her 10 seasons on the show, during which her impressions included Hillary Clinton, and former Attorney General Jeff Sessions.", "url": "https://indianexpress.com/article/entertainment/television/kate-mckinnon-pete-davidson-departing-from-saturday-night-live-7930185/", "urlToImage": "https://images.indianexpress.com/2022/05/snl-1200.jpg", "publishedAt": "2022-05-22T08:32:25Z", "content": "Kate McKinnon and Pete Davidson are among those departing from Saturday Night Live, leaving the sketch institution without arguably its two most famous names after Saturdays 47th season finale.Aidy B… [+1679 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Taliban Pressure Women in Afghanistan to Cover Up", "description": "These are perilous times for Afghan women. The Taliban show no sign of easing a crackdown not only on such basic rights as education and jobs for women, but on every facet of public life, from deportment to travel.", "url": "https://indianexpress.com/article/world/taliban-pressure-women-in-afghanistan-to-cover-up/", "urlToImage": "https://images.indianexpress.com/2021/08/afghanistan-women.jpg", "publishedAt": "2022-05-22T08:29:58Z", "content": "Her mother begged her not to go to the protest, even as Maryam Hassanzada was on her way out the door.\r\nBut Hassanzada, 24, reassured her mother, then joined a dozen other women protesting a Taliban … [+6815 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Tom Cruise’s Mission Impossible Dead Reckoning Part One full trailer leaked online", "description": "The trailer of Tom Cruise's Mission: Impossible – Dead Reckoning Part One was leaked on social media on Saturday. The film will release next year.", "url": "https://indianexpress.com/article/entertainment/hollywood/tom-cruises-mission-impossible-dead-reckoning-part-one-full-trailer-leaked-paramount-pictures-7930098/", "urlToImage": "https://images.indianexpress.com/2022/01/mission-impossible-1200.jpg", "publishedAt": "2022-05-22T08:29:20Z", "content": "The first trailer for Tom Cruise’s Mission Impossible 7 was apparently leaked on social media. Twitter began to speculate after the unreleased trailer, Mission Impossible 7: Dead Reckoning Part 1 tra… [+1451 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "WhatsApp may soon allow users to download account info from desktop: Report", "description": "While WhatsApp already allowed users to download all their information that the messaging service has, it was only available while using WhatsApp on iOS or Android.", "url": "https://indianexpress.com/article/technology/social/whatsapp-may-soon-allow-you-to-download-your-account-info-from-desktop-report-7930175/", "urlToImage": "https://images.indianexpress.com/2022/05/WhatsApp-Request-Infor-Desktop-Beta-featured.jpg", "publishedAt": "2022-05-22T08:24:18Z", "content": "A beta version of WhatsApp desktop will begin allowing users to download their account information from the desktop interface, according to WABetaInfo. While WhatsApp already allows users to download… [+1247 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Biden says ‘hello’ to N.Korea’s Kim amid tensions over weapons tests", "description": "A day earlier, Biden and his new South Korean counterpart, President Yoon Suk-yeol, agreed to consider bigger military exercises and potentially deploying more nuclear-capable American weapons to the region in response to the North's weapons tests.", "url": "https://indianexpress.com/article/world/biden-says-hello-to-n-koreas-kim-amid-tensions-over-weapons-tests-7930134/", "urlToImage": "https://images.indianexpress.com/2022/05/BIDEN-ASIA-3.jpg", "publishedAt": "2022-05-22T08:24:05Z", "content": "U.S. President Joe Biden, in Seoul before heading to Japan as part of his first Asia trip as president, had a simple message for North Korea’s Kim Jong Un: “Hello… period,” he told reporters on the l… [+3882 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Bloomberg", "title": "How Anthony Albanese went from public housing kid to Australia’s new PM", "description": "For Anthony Albanese, 59, the personal transformation came after he was in a head-on collision with another vehicle near his home in the Sydney suburbs in January 2021, a crash that almost cost him his life.", "url": "https://indianexpress.com/article/world/how-anthony-albanese-went-from-public-housing-kid-to-australias-new-pm-7930165/", "urlToImage": "https://images.indianexpress.com/2022/05/anthony.jpg", "publishedAt": "2022-05-22T08:17:09Z", "content": "At a popular bar in the heart of Melbourne back in 2016, a slightly chubby middle-aged man stood behind a turntable leading the crowd in a sing-a-long to Iggy Pops The Passenger.Its a good thing to h… [+7655 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Karnataka CM Bommai leaves for Davos to participate in World Economic Forum", "description": "Bommai said that interactions at the summit would be of significant help in drawing investors to the state during the Global Investors Meet in November.", "url": "https://indianexpress.com/article/cities/bangalore/karnataka-cm-basavaraj-bommai-world-economic-forum-7930171/", "urlToImage": "https://images.indianexpress.com/2022/05/Basavaraj-Bommai-2-1-1.jpg", "publishedAt": "2022-05-22T08:15:16Z", "content": "Speaking to the media in Bengaluru before leaving for Swiss town Davos to participate in the World Economic Forum’s annual summit, Karnataka Chief Minister Basavaraj Bommai said on Sunday that he was… [+3187 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "US Secretary takes a dig at Putin with Taylor Swift’s ‘We are never, ever getting back together’ song", "description": "Amid the ongoing Ukraine invasion, Blinken hinted that ties with Russia will likely remain strained.", "url": "https://indianexpress.com/article/trending/trending-globally/us-secretary-takes-a-dig-at-putin-with-taylor-swifts-song-7930145/", "urlToImage": "https://images.indianexpress.com/2022/05/Trending-Card-1-3.jpg", "publishedAt": "2022-05-22T08:13:28Z", "content": "Delivering the commencement address for Georgetown University on Saturday, US Secretary of State Anthony Blinken left the audience in splits when he took a dig at Russian President Vladamir Putin usi… [+2118 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Qualcomm Snapdragon 8+ Gen 1 processor: OnePlus to Realme, a look at future devices coming up", "description": "Qualcomm has announced the upgraded version of its flagship processor called the Snapdragon 8+ Gen 1. Here's a look at brands which are expected to launch devices featuring the same.", "url": "https://indianexpress.com/article/technology/mobile-tabs/qualcomm-snapdragon-8-plus-gen-1-processor-oneplus-to-realme-future-phones-coming-up-7930144/", "urlToImage": "https://images.indianexpress.com/2022/05/Snapdragon8_plus_Gen1.jpg", "publishedAt": "2022-05-22T08:11:12Z", "content": "Qualcomm has announced the upgraded version of its flagship processor called the Snapdragon 8+ Gen 1. Post the announcement, smartphone brands have started confirming their upcoming devices which wil… [+2244 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Odisha autorickshaw driver returns gold necklace worth Rs 1.6 lakh to passenger", "description": "The autorickshaw driver, Pankaj Behera, found the ornament weighing around 30 gm underneath the passenger seat while cleaning his vehicle on Friday.", "url": "https://indianexpress.com/article/india/odisha-autorickshaw-driver-returns-gold-necklace-worth-rs-1-6-lakh-to-passenger-7930095/", "urlToImage": "https://images.indianexpress.com/2022/05/AUTORICKSHAW-.jpg", "publishedAt": "2022-05-22T07:57:43Z", "content": "A 35-year-old autorickshaw driver in Odisha’s Ganjam district has won accolades for returning a gold necklace worth around Rs 1.6 lakh to a female passenger who had accidentally left it in his vehicl… [+1238 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Preparations on to implement Uniform Civil Code in ‘Devbhoomi’ Uttarakhand: CM Dhami", "description": "Speaking at an event in Delhi, Uttarakhand Chief Minister Pushkar Singh Dhami vowed to make the state’s anti-conversion law stronger and said a drive was on to identify ‘infiltrators’.", "url": "https://indianexpress.com/article/india/preparations-on-to-implement-uniform-civil-code-in-devbhoomi-uttarakhand-cm-dhami-7930117/", "urlToImage": "https://images.indianexpress.com/2022/03/nodal-dhami-2col.jpg", "publishedAt": "2022-05-22T07:52:42Z", "content": "Reiterating that Uttarakhand will set up a special committee to implement the Uniform Civil Code, Chief Minister Pushkar Singh Dhami on Sunday said a special drive was on to identify “infiltrators” i… [+1505 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Check out what Harnaaz Sandhu wore for her reunion with former Miss Universe Andrea Meza", "description": "The Miss Universe 2021 looked absolutely stunning as she showcased sartorial elegance in a blush pink attire", "url": "https://indianexpress.com/article/lifestyle/fashion/check-out-what-harnaaz-sandhu-wore-in-her-reunion-with-andrea-meza-7918476/", "urlToImage": "https://images.indianexpress.com/2022/03/harnaaz-sandhu_200_insta.jpg", "publishedAt": "2022-05-22T07:50:32Z", "content": "Harnaaz Sandhu often serves fashion goals with her versatile and jaw-dropping style statements. Since she won the Miss Universe crown in 2021, her popularity has surged and people are eager to learn … [+1341 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Dhaakad box office collection Day 2: Kangana Ranaut-starrer is a huge disaster", "description": "Dhaakad box office collection Day 2: This Kangana Ranaut-starrer has fallen way short of expectations.", "url": "https://indianexpress.com/article/entertainment/bollywood/box-office-collection/dhaakad-box-office-collection-day-2-kangana-ranaut-7930108/", "urlToImage": "https://images.indianexpress.com/2022/05/dhaakad-1200.jpg", "publishedAt": "2022-05-22T07:45:20Z", "content": "Kangana Ranaut-starrer action-thriller Dhaakad is turning out to be a huge box office disaster. As per Bollywood Hungama, the film grossed Rs 50 lakh on Saturday, taking its two-date total to just Rs… [+1511 chars]"}]}