{"status": "ok", "totalResults": 378, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "CBI nets GST superintendent, inspector for taking bribe", "description": "It was further alleged that both the accused negotiated the bribe amount with the complainant and his tax consultant and fixed the same as Rs 50,000.", "url": "https://indianexpress.com/article/cities/pune/cbi-nets-gst-superintendent-inspector-for-taking-bribe-7894381/", "urlToImage": "https://images.indianexpress.com/2022/04/handcuff-4-8.jpg", "publishedAt": "2022-04-30T00:47:02Z", "content": "THE CBI has arrested a Superintendent and an Inspector, both of Central GST, Jaisingpur in Kolhapur district, for allegedly accepting a bribe of Rs 50,000.\r\nCBI has identified the accused as Mahesh N… [+493 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pune: Two policemen booked for demanding bribe", "description": "The two policemen, Pundalik and Gite, attached to Shirur police station, allegedly demanded Rs 5,000 bribe from the complainant to help her colleague get bail.", "url": "https://indianexpress.com/article/cities/pune/pune-two-policemen-booked-for-demanding-bribe-7894379/", "urlToImage": "https://images.indianexpress.com/2022/04/pune-police.jpg", "publishedAt": "2022-04-30T00:42:36Z", "content": "THE PUNE unit of the state Anti-Corruption Bureau (ACB) has lodged a case against two policemen at Shirur police station for allegedly demanding bribe from a woman to help her colleague in getting ba… [+475 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "‘Despite advent of social media, politicians need to maintain direct communication with people’", "description": "Young politicians on the panel discussion included Rohit Pawar, MLA, NCP, Devendra Bhuyar, Independent MLA from Amravati, Yogesh Kadam, MLA, Shiv Sena, and Siddharth Shirole, MLA, BJP.", "url": "https://indianexpress.com/article/cities/pune/despite-advent-of-social-media-politicians-need-to-maintain-direct-communication-with-people-7894367/", "urlToImage": "https://images.indianexpress.com/2022/04/Pune-social-3col.jpg", "publishedAt": "2022-04-30T00:33:28Z", "content": "WE HAVE to post on time and also ensure that we dont look fake on our social media accounts. We must reflect our original personality,” said Aditi Tatkare, tourism minister, speaking at a panel of yo… [+679 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Peter Vidal", "title": "Horoscope Today, April 30, 2022: Libra, Aries, Pisces and other signs — check astrological prediction", "description": "Aquarius__ It now looks as if you cannot afford to make any more false moves. The general confusion in the air is too widespread for you to add to it by being uncertain about your own direction and motives.", "url": "https://indianexpress.com/article/horoscope/horoscope-today-april-30-2022-libra-aries-pisces-and-other-signs-check-astrological-prediction-7894374/", "urlToImage": "https://images.indianexpress.com/2022/04/HORO33-1-1-1-1-1.jpeg", "publishedAt": "2022-04-30T00:30:06Z", "content": "ARIES (Mar 21 – Apr. 20)It now seems that you will want to procrastinate and deliberate for a little longer before taking the plunge. Even if you do make a sudden decision this may be revised after a… [+3461 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "TMC leader among two more arrested: CBI", "description": "Braj Gopal was arrested a day after the victim's family had filed a complaint. So far, a total of eight persons have been arrested in the case.", "url": "https://indianexpress.com/article/cities/kolkata/tmc-leader-among-two-more-arrested-cbi-7894373/", "urlToImage": "https://images.indianexpress.com/2022/04/indian-express-crime-1-2.jpg", "publishedAt": "2022-04-30T00:25:42Z", "content": "The CBI has arrested two more persons, including a panchayat member owing allegiance to the Trinamool Congress (TMC), in connection with the alleged gangrape of a minor girl in Nadia district."}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Trinamool & BJP trade barbs over fuel prices, Central dues", "description": "Banerjee claimed that the Centre was yet to clear over Rs 97,000 crore dues of the state. Countering her claim, BJP co-incharge for West Bengal and its national IT cell head Amit Malviya said that Banerjee was lying.", "url": "https://indianexpress.com/article/cities/kolkata/trinamool-bjp-trade-barbs-over-fuel-prices-central-dues-7894371/", "urlToImage": "https://images.indianexpress.com/2022/04/mamata-modi-1.jpg", "publishedAt": "2022-04-30T00:22:26Z", "content": "A war of words broke out between the Trinamool Congress (TMC) and the BJP over rising prices of fuel and the Centre not clearing the state’s dues.On Thursday, Chief Minister Mamata Banerjee slammed P… [+1609 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Asad Rehman", "title": "Among 7 in Ayodhya police net: ex-Bajrang Dal worker, freelance journalist, labourer", "description": "Mishra, who the police are calling the “mastermind” of the incident, is a former Bajrang Dal worker. Currently unemployed, Mishra was earlier booked in four cases, including one in 2016 for holding an “arms training programme for youth using toy guns” in Ayod…", "url": "https://indianexpress.com/article/cities/lucknow/among-7-in-ayodhya-police-net-ex-bajrang-dal-worker-freelance-journalist-labourer-7894368/", "urlToImage": "https://images.indianexpress.com/2022/04/lucknow.jpg", "publishedAt": "2022-04-30T00:18:26Z", "content": "A former Bajrang Dal worker, a man claiming to be a freelance journalist and a Bengaluru-based man who returned to Ayodhya during the Covid lockdown in 2020 are among seven men arrested for allegedly… [+3934 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Amit Sharma", "title": "Additional forces deployed in Saharanpur after tension during Friday prayers: Police", "description": "Trouble ensued when a group of people reacted strongly to some questions raised by a section of mediapersons there regarding the Friday prayers.", "url": "https://indianexpress.com/article/cities/lucknow/additional-forces-deployed-in-saharanpur-after-tension-during-friday-prayers-police-7894366/", "urlToImage": "https://images.indianexpress.com/2022/04/p1-upbulldozer-4col.jpeg", "publishedAt": "2022-04-30T00:10:03Z", "content": "Saharanpur police on Friday said they have deployed additional forces in the west UP town after a group of people reacted strongly to questions raised by a section of mediapersons near a mosque regar… [+1181 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "MANOJ MORE", "title": "Ahead of rally, Raj Thackeray gets an iftaar invite from AIMIM; BJP mum on alliance", "description": "After an overnight stay in Pune, the Maharashtra Navnirman Sena chief is expected to start for Aurangabad on Saturday morning. The rally is being held in backdrop of the ultimatum given by Raj Thackeray to pull down loudspeakers from mosques by May 3.", "url": "https://indianexpress.com/article/cities/pune/ahead-of-rally-raj-thackeray-gets-an-iftaar-invite-from-aimim-bjp-mum-on-alliance-7894361/", "urlToImage": "https://images.indianexpress.com/2022/04/RAJ-1-2.jpeg", "publishedAt": "2022-04-30T00:05:49Z", "content": "AHEAD OF MNS chief Raj Thackeray’s rally in Aurangabad on Sunday on the issue of loudspeakers at mosques, leaders of his party have denied that there was any discussions in progress with the BJP for … [+1680 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Vaibhav Jha", "title": "A first-gen scholar, her last words: ‘I’m like wind… don’t want to stop for anyone’", "description": "Born in a humble middle-class family in Ahmedabad, Ayesha was the first among the four siblings to pursue higher education. Even today, her parents have kept her economics books, notes for competitive exams and a few religious books on the shelves as a remind…", "url": "https://indianexpress.com/article/cities/ahmedabad/a-first-gen-scholar-her-last-words-im-like-wind-dont-want-to-stop-for-anyone-7894362/", "urlToImage": "https://images.indianexpress.com/2022/04/ahm.jpg", "publishedAt": "2022-04-30T00:03:10Z", "content": "On the afternoon of February 25 last year, 23-year-old Ayesha Banu Makrani arrived at the Sabarmati riverfronta popular spot that gets deserted in the noon hours due to the blazing sunin Ahmedabad.Mo… [+4559 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mission tribal votes: Kejriwal’s Bharuch rally tomorrow", "description": "According to AAP leaders, Kejriwal will spend Sunday with the Vasavas and meet several tribal leaders in Bharuch, in an attempt to make the party's prospects brighter for the upcoming assembly polls later this year.", "url": "https://indianexpress.com/article/cities/ahmedabad/mission-tribal-votes-kejriwals-bharuch-rally-tomorrow-7894359/", "urlToImage": "https://images.indianexpress.com/2022/04/Kejriwal-4.jpg", "publishedAt": "2022-04-30T00:00:02Z", "content": "Delhi Chief Minister and Aam Aadmi Party national convenor Arvind Kejriwal will arrive in Surat Saturday evening to participate in a rally with Chhotu Vasava’s Bharatiya Tribal Party (BTP), its allia… [+1812 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Dhankhar: Not being invited to convocations of several universities", "description": "“As Chancellor of State Universities and Visitor of private universities, I have with concern and excruciating pain noticed unionism against the Chancellor by VCs. A shameful and shocking development,\" said Dhankhar.", "url": "https://indianexpress.com/article/cities/kolkata/dhankhar-not-being-invited-to-convocations-of-several-universities-7894357/", "urlToImage": "https://images.indianexpress.com/2022/04/JAGDEEP.jpg", "publishedAt": "2022-04-29T23:58:57Z", "content": "GOVERNOR JAGDEEP Dhankhar on Friday criticised the education environment in the state and claimed that he is not being invited to convocation ceremonies of several universities. The Governor also all… [+1425 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Swaminarayan sect conflict: Seer’s death has created ‘atmosphere of fear’, HC told", "description": "According to police officials, the death allegedly occurred on the intervening night of Thursday and Friday. Gunatit swami's body was brought to SSG hospital for a panel post-mortem on Thursday, even as several followers of both groups gathered.", "url": "https://indianexpress.com/article/cities/ahmedabad/swaminarayan-sect-conflict-seers-death-has-created-atmosphere-of-fear-hc-told/", "urlToImage": "https://images.indianexpress.com/2022/03/Gujarat-HC-1-1-2.jpg", "publishedAt": "2022-04-29T23:56:52Z", "content": "The mysterious death of a seer, Gunatit Swami, belonging to the Akshar Purshottam Swami Temple in Sokhda in Vadodara (Haridham) Thursday, has created a fresh controversy in wake of the ongoing disput… [+3255 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Kapadvanj gangrape: 3 get death sentence", "description": "The prosecution examined 26 witnesses and presented 45 documentary evidence before the court. According to the police case, the victim was known to one of the three accused.", "url": "https://indianexpress.com/article/cities/ahmedabad/kapadvanj-gangrape-3-get-death-sentence-7894355/", "urlToImage": "https://images.indianexpress.com/2022/04/indian-express-crime-1-2.jpg", "publishedAt": "2022-04-29T23:56:21Z", "content": "The sessions court at Kapadvanj in Kheda district Friday sentenced to death three accused for gangraping a 30-year-old woman, who was found murdered in a field in the Nirmali area of Kapadvanj on Oct… [+1340 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Soumyarendra Barik", "title": "Make India chip hub: PM to industry", "description": "IT Minister Ashwini Vaishnaw said the Centre expects to give nods in 6-8 months to chip makers who applied to its PLI scheme.", "url": "https://indianexpress.com/article/business/commodities/make-india-chip-hub-pm-to-industry-7894328/", "urlToImage": "https://images.indianexpress.com/2022/04/modi-7-1-2.jpg", "publishedAt": "2022-04-29T23:53:31Z", "content": "Underlining that the country is investing heavily in skilling and training youth for the needs of the 21st century, Prime Minister Narendra Modi called upon the semiconductor industry to make India a… [+125 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gujarat a BJP lab, new Patel govt a part of this strategy: JP Nadda", "description": "Earlier in the day, Nadda said Prime Minister Narendra Modi has given his reply to the politics of casteism, communalism, and nepotism with politics of development. “PM Modi has changed the culture of politics in India,” the BJP national president said.", "url": "https://indianexpress.com/article/cities/ahmedabad/gujarat-a-bjp-lab-new-patel-govt-a-part-of-this-strategy-jp-nadda-7894354/", "urlToImage": "https://images.indianexpress.com/2022/04/JP-NADDA-3.jpg", "publishedAt": "2022-04-29T23:51:01Z", "content": "Gujarat has been BJP’s laboratory in matters that are both organisational and governance-related, said party national president JP Nadda in Gandhinagar Friday. The change of the Gujarat government la… [+4035 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Omkar Gokhale", "title": "Bombay High court allows 2 death row convicts to pursue studies in jail", "description": "Then chief justice of the HC, Justice Pradeep Nandrajog, in November 2019, had transferred all four pleas – including appeals by convicts and the state's petition seeking confirmation of death sentences – from Aurangabad bench of the HC to its principal seat …", "url": "https://indianexpress.com/article/cities/mumbai/bombay-high-court-allows-2-death-row-convicts-to-pursue-studies-in-jail-7894338/", "urlToImage": "https://images.indianexpress.com/2022/04/Bombay-hC-1-2.jpg", "publishedAt": "2022-04-29T23:06:57Z", "content": "The Bombay High Court recently allowed two convicts in the 2016 case of Kopardi rape and murder of minor to continue their education at Yerawada Central Prison in Pune through open universities, pend… [+1830 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sagar Sharma, Urmi Tat", "title": "Placing semicon diplomacy at the heart of India’s foreign policy", "description": "Doing so would make sense, both strategically and economically.", "url": "https://indianexpress.com/article/opinion/columns/placing-semicon-diplomacy-at-the-heart-of-indias-foreign-policy-7894226/", "urlToImage": "https://images.indianexpress.com/2021/02/MSME.jpg", "publishedAt": "2022-04-29T23:05:31Z", "content": "Semiconductor chips are the lifeblood of the modern information age. They enable electronic products to compute and control actions that simplify our lives. The manufacturing cycle of a semiconductor… [+4714 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Laxman Singh", "title": "Flooding a man-made disaster, planning can avert it, says BMC ex-commissioner", "description": "The recently unveiled Mumbai Climate Action Plan (MCAP) has warned that Mumbai which has geographically challenging terrain will face extreme rainfalls and floodings.", "url": "https://indianexpress.com/article/cities/mumbai/flooding-a-man-made-disaster-planning-can-avert-it-says-bmc-ex-commissioner-7894337/", "urlToImage": "https://images.indianexpress.com/2021/07/Ajoy-Mehta-1.jpg", "publishedAt": "2022-04-29T23:00:40Z", "content": "Flooding is a man-made disaster and a result of failed planning, said former municipal commissioner Ajoy Mehta on Friday. Expressing concern on climate change impacts, Mehta called for meticulous pla… [+1672 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Mrinal Kaul", "title": "The one nation, one language fallacy", "description": "India has never done justice to its linguistic diversity or focused on quality language learning. Languages, instead, have become instruments of exercising hegemony.", "url": "https://indianexpress.com/article/opinion/columns/the-one-nation-one-language-fallacy-7894218/", "urlToImage": "https://images.indianexpress.com/2018/07/hindi1.jpg", "publishedAt": "2022-04-29T22:54:00Z", "content": "mujhe khauf atish-e-gul se hai ye kahin chaman ko jala na de.\r\n(My conviction is so strong that I do not fear the blaze of others, but indeed I dread the flame of a flower (of my own garden) lest it … [+4973 chars]"}]}