{"status": "ok", "totalResults": 404, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Nitin Sharma", "title": "Khelo India games: Maharashtra’s para-athlete comes 4th in relay; ‘doesn’t feel less than winning medal’", "description": "Khelo India 2022: Dilip Gavit won medals in 200m and 400m events at the state level before competing in the second edition of the Khelo India Youth Games in Pune in 2019 where his team won silver in the 4x400m relay race and bronze in the 4X100m relay race.", "url": "https://indianexpress.com/article/cities/panchkula/khelo-india-youth-games-results-medal-tally-maharashtra-dilip-gavit-relay-7961555/", "urlToImage": "https://images.indianexpress.com/2022/06/dilip-gavit.jpg", "publishedAt": "2022-06-10T00:45:44Z", "content": "On Thursday morning, Tamil Nadus relay team were the first to cross the finish line. But instead of celebrating their win, they cheered the Maharastra teams 19-year-old specially-abled Dilip Gavit, w… [+2510 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "FIR lodged over letter to judge who ordered Gyanvapi survey", "description": "Taking a serious note of the matter, the Varanasi police has upgraded the judge's security and written to their counterparts in Lucknow to ensure safety of his family settled there.", "url": "https://indianexpress.com/article/cities/lucknow/fir-lodged-over-letter-to-judge-who-ordered-gyanvapi-survey-7961557/", "urlToImage": "https://images.indianexpress.com/2022/06/Gyanvapi-Mosque.jpg", "publishedAt": "2022-06-10T00:41:01Z", "content": "An FIR was lodged against unidentified person(s) for sending a purported letter with alleged ‘objectionable comments’ to a judge who had ordered court-monitored survey of the Gyanvapi mosque complex … [+1832 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Woman burnt alive for dowry in Hathras, husband, in-laws held", "description": "The police have arrested the three who were booked after the victim's father lodged a complaint of murder at the Chandapa police station.", "url": "https://indianexpress.com/article/cities/lucknow/woman-burnt-alive-for-dowry-in-hathras-husband-in-laws-held-7961554/", "urlToImage": "https://images.indianexpress.com/2021/07/express-photo-13-16.jpg", "publishedAt": "2022-06-10T00:37:26Z", "content": "A 20-year-old woman was burnt alive allegedly by her husband and parents-in-law who used to torture her over demand for dowry in Hathras district’s Chintagarhi village on Wednesday.The police have ar… [+416 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delegation of Gujarat MLAs visits Assembly to learn about e-vidhan", "description": "UP Assembly Speaker Satish Mahana received the delegation and took them on a tour of the Vidhan Bhavan, including its pavilion, picture gallery, Neva (National e-Vidhan Application) Service Center and Assembly Library, said to be the largest in the country af…", "url": "https://indianexpress.com/article/cities/lucknow/delegation-of-gujarat-mlas-visits-assembly-to-learn-about-e-vidhan-7961549/", "urlToImage": "https://images.indianexpress.com/2022/06/up_assembly_1200.jpeg", "publishedAt": "2022-06-10T00:33:05Z", "content": "A 19-member delegation of Gujarat MLAs and officials, led by Speaker Nimaben Acharya, on Thursday visited Uttar Pradesh Vidhan Bhavan to learn about the newly introduced e-vidhan system the digitisat… [+999 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Kanpur Clash Police to probe prime accused role in CAA stir", "description": "“Hayat Jafar Hashmi's role in the 2019 violence was earlier looked into, but he was not booked in any case. We have now found some lead that he had allegedly incited people during the 2019 protest. We will soon start collecting evidence of his alleged involve…", "url": "https://indianexpress.com/article/cities/lucknow/kanpur-clash-police-to-probe-prime-accused-role-in-caa-stir-7961547/", "urlToImage": "https://images.indianexpress.com/2022/06/kanpur-violence-1.jpg", "publishedAt": "2022-06-10T00:28:20Z", "content": "KANPUR police on Thursday said that they would look into the role of Hayat Jafar Hashmi, arrested for last Friday’s clashes in the city, in the 2019 anti-CAA NRC protests.Hayat Jafar Hashmi’s role in… [+2080 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Abducted’ petrol pump owner rescued, 6 held in Gandhinagar", "description": "According to police, a joint team of DCB and Chandkheda PS rescued Patel from a pucca hut in a farmland on the border of Umiyanagar and Bilodra village near the Mansa-Visnagar state highway in Gandhinagar in a late night operation.", "url": "https://indianexpress.com/article/cities/ahmedabad/abducted-petrol-pump-owner-rescued-6-held-in-gandhinagar-7961545/", "urlToImage": "https://images.indianexpress.com/2022/06/arrest-9.jpg", "publishedAt": "2022-06-10T00:19:05Z", "content": "The Ahmedabad Police’s Detection of Crime Branch (DCB) arrested six persons and rescued a petrol pump owner from a farmland in Gandhinagar Wednesday night. He was allegedly abducted by the gang for r… [+2085 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Three men loot valuables worth Rs 1.6L from govt official’s house: Police", "description": "The incident took place in Nutan Society at the house of Alpana Dani, electrical inspector with the Energy and Petrochemical Department, around 3 pm.", "url": "https://indianexpress.com/article/cities/ahmedabad/three-men-loot-valuables-worth-rs-1-6l-from-govt-officials-house-police/", "urlToImage": "https://images.indianexpress.com/2022/04/ROBBERY.jpg", "publishedAt": "2022-06-10T00:14:53Z", "content": "Three men broke into the house of a government official and robbed cash and valuables worth Rs 1.6 lakh, holding her domestic helps at gunpoint, in a posh society in Paldi area of Ahmedabad Wednesday… [+1219 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Rajya Sabha elections: Kartikeya Sharma garners support amid last-minute ‘offers’, mock tests", "description": "Chief Minister Manohar Lal Khattar and deputy chief minister Dushyant Chautala, and BJP state president Om Prakash Dhankar today held a discussion with all the coalition and a few Independent MLAs for a final push before the Rajya Sabha polling, tomorrow.", "url": "https://indianexpress.com/article/cities/chandigarh/rajya-sabha-elections-haryana-seats-kartikeya-sharma-congress-jjp-bjp-7961525/", "urlToImage": "https://images.indianexpress.com/2022/06/kartikeya-sharma.jpg", "publishedAt": "2022-06-10T00:11:03Z", "content": "The polls for two Rajya Sabha seats from Haryana seemed set for a cliffhanger amid last minute efforts by the contestants to reach out to the Independent MLAs even as the lone Indian National Lok Dal… [+7056 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Three men rob youth of Rs 1.87 lakh at ATM centre", "description": "According to police, Chandankumar Chaurasia, working as a collection agent of a private money finance firm in Sachin, went to deposit Rs 1.87 lakh in the ATM centre at Laxmi Villa complex in Sachin GIDC.", "url": "https://indianexpress.com/article/cities/surat/three-men-rob-youth-of-rs-1-87-lakh-at-atm-centre-7961534/", "urlToImage": "https://images.indianexpress.com/2022/06/indian-express-Banner.jpeg", "publishedAt": "2022-06-10T00:10:31Z", "content": "Three miscreants robbed a youth of Rs 1.87 lakh at an ATM centre of the Varachha Cooperative Bank in Sachin GIDC area on Thursday, police said.According to police, Chandankumar Chaurasia, working as … [+927 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sohini Ghosh", "title": "What are the charges against former ASG Syed?", "description": "Syed, along with five others, are facing allegations of causing hurt, extortion, wrongful confinement and criminal intimidation, among other charges, of Ahmedabad-based businessman Viral Shah, although no specific role has been attributed to Syed.", "url": "https://indianexpress.com/article/explained/what-are-the-charges-against-former-asg-syed-7961528/", "urlToImage": "https://images.indianexpress.com/2022/06/ASG-Syed.jpg", "publishedAt": "2022-06-10T00:04:42Z", "content": "After nearly three weeks of legal battle, designated senior advocate at the Gujarat High Court IH Syed was granted protection from arrest on June 7 in relation to an FIR by an Ahmedabad-based busines… [+5602 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aditi Raja", "title": "Artwork to spread awareness: Ex-MSU Fine Arts student", "description": "He was debarred from MS University on May 13 following the controversy over an artwork involving cutouts from newspaper clippings reporting crimes against women.", "url": "https://indianexpress.com/article/india/artwork-to-spread-awareness-ex-msu-fine-arts-student-7961396/", "urlToImage": "https://images.indianexpress.com/2022/06/MSU.jpg", "publishedAt": "2022-06-09T23:54:09Z", "content": "The exhibit that led to a controversy over an artwork involving Goddesses was made to create awareness for respecting women like Goddesses, a former first-year Masters student of the Faculty of Fine … [+3385 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gujarat govt prevented use of farm urea in industries, says minister", "description": "In a statement, State Agriculture Minister Raghavji Patel said teams from the Centre and state government had undertaken random checks on industrial units that were purportedly using the subsidised urea.", "url": "https://indianexpress.com/article/cities/ahmedabad/gujarat-govt-prevented-use-of-farm-urea-in-industries-says-minister-7961492/", "urlToImage": "https://images.indianexpress.com/2022/06/fertiliser-1200-1.jpg", "publishedAt": "2022-06-09T23:47:56Z", "content": "The state government on Thursday said it has prevented 8,184 bags of subsidised urea meant for agricultural purposes from being illegally used by industrial units in the state.In a statement, State A… [+1040 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Taking Christian leaders to temple: Shabri Seva Samiti expels BJP MLA", "description": "A copy of the Samiti’s resolution signed by Swami Aseema-nand says, “Shri Vijaybhai Rameshbhai Patel (Dang MLA), has violated the principle of Shabri Seva Samiti. He has been removed from the post of trust member of the Shabri Seva Samiti.” Aseemanad is a lif…", "url": "https://indianexpress.com/article/cities/surat/taking-christian-leaders-to-temple-shabri-seva-samiti-expels-bjp-mla-7961512/", "urlToImage": "https://images.indianexpress.com/2022/06/guj-MLA.jpg", "publishedAt": "2022-06-09T23:47:51Z", "content": "Bharatiya Janata Party (BJP) MLA from Dang, Vijay Patel, was expelled from the Shabri Seva Samiti of Dang district that is headed by self-styled godman Swami Aseemanand on Wednesday, allegedly over t… [+2457 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gandhinagar man held for abduction, murder of 17-year-old student in Kota", "description": "According to police, the girl, who was a National Eligibility Entrance Test (NEET) aspirant, was enrolled in a coaching centre in Kota and lived in a city-based hostel. She went missing on June 6 evening after which the hostel owner filed an abduction FIR in …", "url": "https://indianexpress.com/article/cities/ahmedabad/gandhinagar-man-held-for-abduction-murder-of-17-year-old-student-in-kota-7961491/", "urlToImage": "https://images.indianexpress.com/2022/06/arrest-9.jpg", "publishedAt": "2022-06-09T23:45:51Z", "content": "A joint team of Gujarat Police and Rajasthan Police on Thursday arrested a 21-year-old man from a village in Gandhinagar for allegedly abducting and murdering a 17-year-old girl student in Kota of Ra… [+1650 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "10 more set to arrive from Arunachal: Elephant inmates at Jamnagar care centre to cross 150", "description": "With this, the number of elephants at the centre, said to be the biggest such facility for old elephants, will cross 150. The RKTEWT facility is spread over 600 acres in the RIL’s Moti Khavdi co-mplex where it has an oil refinery.", "url": "https://indianexpress.com/article/cities/rajkot/10-more-set-to-arrive-from-arunachal-elephant-inmates-at-jamnagar-care-centre-to-cross-150-7961510/", "urlToImage": "https://images.indianexpress.com/2022/06/guj-ele.jpg", "publishedAt": "2022-06-09T23:42:11Z", "content": "Ten elephants belonging to private owners in Arunachal Pradesh that were deployed in the timber industry and are now old and ailing will soon find their way to a care centre run by the Radhe Krishna … [+4789 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Partha Sarathi Biswas", "title": "Mills with waiver forms from farmers won’t have to pay penalty interest", "description": "The Sugarcane Control Act, 1966, mandates payment of FRP within 14 days of cane purchased, failing which 15 per cent interest has to be paid. Till date, not a single mill in the country has paid the penalty interest amount.", "url": "https://indianexpress.com/article/cities/pune/mills-with-waiver-forms-from-farmers-wont-have-to-pay-penalty-interest-7961508/", "urlToImage": "https://images.indianexpress.com/2022/05/sugar.jpg", "publishedAt": "2022-06-09T23:27:59Z", "content": "Sugar Commissioner Shekhar Gaikwad on Thursday ruled that mills which have submitted forms signed by cane farmers — to waive the payment of interest to them over late payment of Fair and Remunerative… [+1751 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuradha Mascarenhas", "title": "Can’t rule out possibility of more mini Covid waves, says WHO chief scientist", "description": "The WHO chief scientist also felt that due to home-based self testing, numbers could also be underestimated.", "url": "https://indianexpress.com/article/india/cant-rule-out-possibility-of-more-mini-covid-waves-says-who-chief-scientist-7961505/", "urlToImage": "https://images.indianexpress.com/2022/06/swamy.jpg", "publishedAt": "2022-06-09T23:22:42Z", "content": "The BA.4 and BA.5 Omicron sub-variants are making their presence felt across various areas in the country with the daily Covid tally now showing a rise in the country. When contacted, Dr Soumya Swami… [+3571 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "MANOJ MORE", "title": "Congress issues whip, but Sena seeks at least two votes for Sanjay Pawar", "description": "“Each candidate needs 41 preferential votes. We want to ensure that our candidates get the required votes even if some votes turn invalid,” former chief minister Prithviraj Chavan told The Indian Express Thursday late evening.", "url": "https://indianexpress.com/article/cities/pune/congress-issues-whip-but-sena-seeks-at-least-two-votes-for-sanjay-pawar-7961502/", "urlToImage": "https://images.indianexpress.com/2021/12/chauhan-1200.jpg", "publishedAt": "2022-06-09T23:18:22Z", "content": "Even as the BJP made special arrangements to ferry two of its ailing MLAs from Pune and Pimpri-Chinchwad by a well-equipped ambulance for the Rajya Sabha elections on Friday, the state Congress unit … [+2103 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "HC asks petitioner to deposit Rs 1 L to hear PIL on Metro station renaming", "description": "The plea challenged the July 18, 2019 order passed by the Mumbai Metropolitan Region Development Authority (MMRDA), which sought to revise station names on lines 2A and 7 of Mumbai Metro.", "url": "https://indianexpress.com/article/cities/mumbai/hc-asks-petitioner-to-deposit-rs-1-l-to-hear-pil-on-metro-station-renaming-7961500/", "urlToImage": "https://images.indianexpress.com/2022/06/bombay-high-court-1200-3-4-1.jpg", "publishedAt": "2022-06-09T23:06:41Z", "content": "The Bombay High Court on Thursday directed a petitioner to deposit Rs 1 lakh as a pre-condition for hearing a PIL seeking to revise a stations name on the Mumbai Metro Line 7 from Dindoshi to Pathanw… [+927 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Yogesh Naik", "title": "Civic body issues tender for construction of promenade along Mahalakshmi race course", "description": "A civic official added, “The eco-friendly track will be constructed without cutting down any tree... Recreational and seating facilities will also be provided. In particular, it has been proposed to erect a solar canopy along the sidewalk.”", "url": "https://indianexpress.com/article/cities/mumbai/civic-body-issues-tender-for-construction-of-promenade-along-mahalakshmi-race-course-7961496/", "urlToImage": "https://images.indianexpress.com/2022/06/BMC-4-2.jpg", "publishedAt": "2022-06-09T23:02:53Z", "content": "The BMC on Thursday issued tenders for the construction of a promenade along the periphery of the Mahalakshmi race course. The project, estimated to cost nearly Rs 5 crore, will come up in Worli, whi… [+784 chars]"}]}