{"status": "ok", "totalResults": 546, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "#Politics: Compromised on self-respect but got pain in return: Shivpal’s apparent dig at Akhilesh", "description": "\"I tried to satisfy him by going down to the bottom point of self-respect!. Despite this, if I am angry...to what extent he must have inflicted pain on my heart!,\" said Shivpal Singh Yadav without taking anyone's name in his tweet.", "url": "https://indianexpress.com/article/india/political-pulse/shivpal-singh-yadav-attack-akhilesh-sp-alliance-bjp-7899534/", "urlToImage": "https://images.indianexpress.com/2022/05/Shivpal-Akhilesh-featured.jpg", "publishedAt": "2022-05-03T10:49:06Z", "content": "In an apparent attack against Samajwadi Party chief and his nephew Akhilesh Yadav, sulking socialist leader Shivpal Singh Yadav on Tuesday said he compromised on his self-respect to “satisfy” him but… [+1617 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Samsung, LG, and more: Best deals on ACs, refrigerators to check out this summer", "description": "The Amazon Summer Sale is a great opportunity for discounts on home appliances such as AC's and refrigerators. Here's a look at some options.", "url": "https://indianexpress.com/article/technology/techook/samsung-lg-and-more-best-deals-on-acs-refrigerators-to-check-out-this-summer-7899558/", "urlToImage": "https://images.indianexpress.com/2022/05/WhatsApp-Image-2022-05-03-at-4.11.51-PM.jpeg", "publishedAt": "2022-05-03T10:46:55Z", "content": "Peak summers are here along with unbearably hot temperatures. While everyone wants to stay cool during the summer season, your fan may not cut it for 2022, which is one of the hottest summer season i… [+3244 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Arun Sharma", "title": "J&K investigating agency may approach Pakistan court to get information about Hizbul militants staying across border", "description": "The chargesheet followed investigations conducted over the last six months beginning November 7 in the backdrop of government’s strategy to identify J&K residents who are hiding in Pakistan and coordinating terrorist and secessionist activities.", "url": "https://indianexpress.com/article/india/jammu-and-kashmir-hizbul-mujahideen-militants-pakistan-7899444/", "urlToImage": "https://images.indianexpress.com/2022/05/kashmir.jpg", "publishedAt": "2022-05-03T10:43:16Z", "content": "The State Investigating Agency (SIA) of Jammu and Kashmir has decided to approach a court in Pakistan to get information about the activities of three Hizbul Mujahideen militants from Jammu divisions… [+4217 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Dipanita Nath", "title": "How a zero-waste lifestyle startup from Pune is becoming one of India’s most successful enterprises", "description": "The mission of Adrish is to promote a waste-free way of living and serve nature at the level of consumers. Adrish retails food and groceries, home decor items, cleaning products, beauty products and toys of the kind the previous generations played with.", "url": "https://indianexpress.com/article/cities/pune/zero-waste-lifestyle-startup-pune-india-most-successful-enterprises-7899503/", "urlToImage": "https://images.indianexpress.com/2022/05/MGL39311.jpg", "publishedAt": "2022-05-03T10:41:10Z", "content": "‘I know what some of my friends say about me Yeh puraane zamaney wala hai and theyre right. I live in the past, says Akshay Agarwal. When the Pune-based entrepreneur travels to cooler countries such … [+4666 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Bloomberg", "title": "Citi trader made error behind flash crash in Europe stocks", "description": "Citi Europe flash crash: A trader at the U.S. firm made a mistake “inputting a transaction,” Citigroup said late last night, after a knee-jerk selloff in Swedish stocks in five minutes wreaked havoc in bourses from Paris to Warsaw, wiping out 300 billion euro…", "url": "https://indianexpress.com/article/business/world-market/citi-trader-made-error-behind-flash-crash-in-europe-stocks-7899519/", "urlToImage": "https://images.indianexpress.com/2022/05/citi-trader-europe-crash-bloomberg-1200.jpg", "publishedAt": "2022-05-03T10:32:45Z", "content": "Citigroup Inc.s London trading desk was a behind a flash crash that sent shares across Europe tumbling on Monday, dealing a fresh setback to the banks yearslong efforts to improve controls.A trader a… [+2341 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Shivaji memorial at Raigad Fort was not built by Tilak: Sambhajiraje", "description": "Why talk without verifying facts, asks Rajya Sabha MP who is descendant of Maratha king", "url": "https://indianexpress.com/article/cities/mumbai/shivaji-memorial-at-raigad-fort-was-not-built-by-tilak-sambhajiraje-7899540/", "urlToImage": "https://images.indianexpress.com/2022/05/sambhajiraje-chhatrapati.jpg", "publishedAt": "2022-05-03T10:32:41Z", "content": "Maharashtra Navnirman Sena (MNS) president Raj Thackerays statement that Lokmanya Tilak built Chhatrapati Shivajis memorial at Raigad Fort has sparked a debate in Maharashtra, with politicians weighi… [+1341 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "‘Hindi film industry not over’: Manoj Muntashir says Bollywood will be ‘back with a bang’ if filmmakers start speaking the language", "description": "Manoj Munstashir jumped in on the debate as to why Hindi films are not achieving pan-Indian success. He said filmmakers need to self-reflect.", "url": "https://indianexpress.com/article/entertainment/bollywood/manoj-muntashir-language-debate-hindi-filmmakers-should-start-speaking-the-language-7899460/", "urlToImage": "https://images.indianexpress.com/2022/05/manoj-muntashir.jpg", "publishedAt": "2022-05-03T10:25:10Z", "content": "As the debate on pan-Indian films in the Indian landscape grows, many celebrities have chimed in with their thoughts on why Hindi films are not doing wonders across the country as opposed to films li… [+1688 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "‘Get up and go on with your life’: Madea (Tyler Perry)", "description": "\"Stop praying about it, go work... get yourself together,\" Madea said", "url": "https://indianexpress.com/article/lifestyle/life-positive/get-up-and-go-on-with-your-life-madea-tyler-perry7895919/", "urlToImage": "https://images.indianexpress.com/2022/05/tyler-perry-1.jpg", "publishedAt": "2022-05-03T10:20:08Z", "content": "American actor, director, producer and screenwriter Tyler Perry, also known as Madea, shares an inspiring and life changing message, saying it is important to let people go from your life. Madea is a… [+1150 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "MHT CET 2022 revised exam dates announced; check new schedule here", "description": "Those who applied to appear in the exams can check revised exam dates at the official website - mhtcet2022.mahacet.org.", "url": "https://indianexpress.com/article/education/mht-cet-2022-revised-exam-dates-announced-check-new-schedule-here-mhtcet2022-mahacet-org-7899411/", "urlToImage": "https://images.indianexpress.com/2019/12/uppsc-759.jpg", "publishedAt": "2022-05-03T10:17:18Z", "content": "The Maharashtra State Common Entrance Test (CET) Cell has announced the rescheduled dates for the MHT CET 2022 for several courses such as BA-BEd, and BSc-BEd integrated courses; BPEd, LLb, and more.… [+838 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "IPL 2022: From Virat Kohli, Rohit Sharma to MS Dhoni, how the retained players have performed so far", "description": "With the 15th edition of the IPL has come to its second leg, let's take a look at how the retained players have fared for their respective teams in the ongoing season.", "url": "https://indianexpress.com/article/sports/ipl/from-virat-kohli-rohit-sharma-to-ms-dhoni-how-the-ipl-2022-retained-players-have-performed-so-far-7899422/", "urlToImage": "https://images.indianexpress.com/2022/05/Virat-Rohit-Jadeja-and-Mayank.jpg", "publishedAt": "2022-05-03T10:16:15Z", "content": "Team India had a forgettable ICC Mens T20 World Cup campaign in UAE. The ongoing Indian Premier League (IPL) performances will play a pivotal role in who will be on the plane to have another crack at… [+6270 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Omkar Gokhale", "title": "Bombay HC seeks MIAL, Collector’s response on actions against structures near airport flouting height norms", "description": "The Court was hearing a PIL filed by a lawyer in 2019, raising concerns about airport safety.", "url": "https://indianexpress.com/article/cities/mumbai/bombay-hc-mial-collectors-structures-airport-height-norms-7899512/", "urlToImage": "https://images.indianexpress.com/2022/05/bombay-high-court-1200-3-4.jpg", "publishedAt": "2022-05-03T10:16:04Z", "content": "The Bombay High Court on Monday asked the Mumbai International Airport Limited (MIAL) to file an affidavit about the details of requests it has made to the District Collector seeking actions against … [+3032 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Acharya box office: Chiranjeevi, Ram Charan film set to become a commercial disaster", "description": "Acharya box office: Chiranjeevi and Ram Charan-starrer continues its downward spiral at the ticket windows.", "url": "https://indianexpress.com/article/entertainment/telugu/acharya-box-office-chiranjeevi-ram-charan-set-to-become-a-commercial-disaster-7899272/", "urlToImage": "https://images.indianexpress.com/2022/04/acharya-1.jpg", "publishedAt": "2022-05-03T10:14:40Z", "content": "Tollywood superstar Chiranjeevi’s latest movie Acharya is set to become one of the biggest box office disasters of 2022. The film’s collection continues its downward spiral, showing no signs of recov… [+1419 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Amid heatwave, parents in Delhi demand revision of school timings, advance summer holidays", "description": "Several schools have already announced reduction in outdoor activities in view of the sweltering heat coupled with the ongoing spike in the number of Covid cases.", "url": "https://indianexpress.com/article/education/amid-heatwave-parents-delhi-demand-revision-school-timings-advance-summer-holidays-7899516/", "urlToImage": "https://images.indianexpress.com/2021/11/delhi-schools.jpg", "publishedAt": "2022-05-03T10:13:14Z", "content": "Worried about their children’s health due to extreme heat, parents here have asked the Delhi government to either revise the school timings or advance the summer holidays.Several schools have already… [+3027 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Yogesh Naik", "title": "Shiv Sena MP Arvind Sawant writes to PM Modi, seeks revival of BSNL, MTNL", "description": "The MTNL needs a huge amount to the tune of Rs 35,000 crore for survival, Arvind Sawant said and appealed to the Union government to monetise assets and till then requested it to finance the purchase of new equipment like fiber optic cables and installation o…", "url": "https://indianexpress.com/article/cities/mumbai/shiv-sena-mp-arvind-sawant-modi-letter-bsnl-mtnl-revival-7899449/", "urlToImage": "https://images.indianexpress.com/2019/11/sawant-12.jpg", "publishedAt": "2022-05-03T10:11:34Z", "content": "Shiv Sena MP from South Mumbai and former Union minister Arvind Sawant has written a letter to Prime Minister Narendra Modi urging him to revive Bharat Sanchar Nigam Limited (BSNL) and its subsidiary… [+2550 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "Man dressed as a joker in Karachi leaves netizens spellbound with his soulful singing", "description": "Singing soulful renditions from Sonu Nigam to Rahat Fateh Ali Khan -- netizens were left in awe, moved by his musical talent.", "url": "https://indianexpress.com/article/trending/trending-globally/joker-from-karachi-wows-all-singing-viral-video-7899220/", "urlToImage": "https://images.indianexpress.com/2022/05/pakistan-joker-singing.jpg", "publishedAt": "2022-05-03T10:08:44Z", "content": "When it comes to acknowledging raw talent, the internet never disappoints. And latest in this long list is a man dressed as a joker from Pakistan, who is not winning the virtual world by his tricks b… [+3016 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "‘Unstoppable’: Book chronicles journey of 40 youth icons", "description": "It features stories of Olympians Dutee Chand and Deepa Karmakar, rapper Kaam Bhaari, track and field para athlete Sandeep Chaudhary, astrophysicist Karan Jani, acid Attack survivor Reshma Qureshi and Sanket Deshpande, the youngest Indian to send satellite in …", "url": "https://indianexpress.com/article/books-and-literature/unstoppable-book-chronicles-journey-40-youth-icons-7899475/", "urlToImage": "https://images.indianexpress.com/2022/05/manthan-shah-book_1200_penguin.com_.jpg", "publishedAt": "2022-05-03T10:07:37Z", "content": "From olympians and academicians to musicians and environmentalists, a new book chronicles the inspiring journeys of 40 Indian youth icons who overcame their struggles to create something of value.“Un… [+2246 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Louis Leterrier in talks to replace Justin Lin as director of Fast X", "description": "A deal between director Louis Leterrier and studio Universal is yet to be closed as they still have to figure out the scheduling with some of his other projects.", "url": "https://indianexpress.com/article/entertainment/hollywood/louis-leterrier-in-talks-to-replace-justin-lin-as-director-of-fast-x-7899369/", "urlToImage": "https://images.indianexpress.com/2022/05/Fast-X-1200by667.jpg", "publishedAt": "2022-05-03T10:04:48Z", "content": "Filmmaker Louis Leterrier is expected to take over the director’s chair for the 10th instalment of Fast and Furious franchise after the exit of Justin Lin.The film is currently without a director aft… [+1450 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Tale Of The Nine Tailed Season 2: Lee Dong-wook and Kim Bum confirm return, Kim So-yeon to replace Jo Bo-ah", "description": "The second season of Tale Of The Nine Tailed will see Kim So-yeon and Ryu Kyung-soo joining the cast. Lee Dong-wook and Kim Bum will reprise their roles.", "url": "https://indianexpress.com/article/entertainment/entertainment-others/tale-of-the-nine-tailed-season-2-lee-dong-wook-and-kim-bum-confirm-return-7899242/", "urlToImage": "https://images.indianexpress.com/2022/05/tail1200.jpg", "publishedAt": "2022-05-03T10:00:15Z", "content": "Tale Of The Nine-Tailed will return for Season 2, with a few new faces. The second season will see Kim So-yeon as well as Ryu Kyung-soo joining the cast. Lee Dong-wook and Kim Bum will reprise their … [+1276 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Akshaya Tritiya begins on positive note; jewellers expect business of up to 30 tonne", "description": "Gold prices in your city: Kalyan Jewellers Executive Director Ramesh Kalyanaraman said gold-buying as a tradition has been an integral part of Akshaya Tritiya and this coupled with the ongoing wedding season, has created a positive market sentiment.", "url": "https://indianexpress.com/article/business/commodities/akshaya-tritiya-begins-on-positive-note-jewellers-expect-business-of-up-to-30-tonne-7899206/", "urlToImage": "https://images.indianexpress.com/2022/05/INDIA-GOLD-DEMAND-REUTERS-1200.jpg", "publishedAt": "2022-05-03T09:59:47Z", "content": "The auspicious day of Akshaya Tritiya has begun on a strong note as jewellers are witnessing good footfalls and being a public holiday on Tuesday, consumers are flocking to the stores early before th… [+2906 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Chennai death in custody: CCTV footage shows youth running, being chased & hit by police", "description": "In the video, a man can be seen running from the main road towards a narrow street and falling down after losing balance. He is chased by two policemen and one of them can be seen beating him once with a stick.", "url": "https://indianexpress.com/article/cities/chennai/chennai-death-custody-cctv-footage-youth-running-chased-hit-7899471/", "urlToImage": "https://images.indianexpress.com/2022/05/Indian-express-1-3-2.jpg", "publishedAt": "2022-05-03T09:59:01Z", "content": "Two weeks after a 25-year-old man died after allegedly being beaten up at a police station in Chennai, unverified CCTV footage has surfaced online purportedly showing the man running on a road, falli… [+1553 chars]"}]}