{"status": "ok", "totalResults": 97, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Buying Nothing phone (1)? Here’s what after-sales services look like", "description": "Nothing phone (1): How to reach Nothing helpline, Nothing customer care number, Nothing service centre, Nothing repair, Nothing phone 1 repair, Nothing phone 1 after sales support", "url": "https://indianexpress.com/article/technology/mobile-tabs/nothing-phone-1-after-sales-services-customer-care-service-centre-8030556/", "urlToImage": "https://images.indianexpress.com/2022/07/Nothing-Phone-1-official-1.jpg", "publishedAt": "2022-07-15T06:31:49Z", "content": "Nothing phone (1) Customer Care, Service Centre: The Nothing phone (1) was launched earlier this week in India after a lot of talk around the London-based companys first smartphone. While the signatu… [+2160 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Stop vehicles only if there is visible traffic violation: Goa police asks its staff", "description": "Also, in case of any traffic violation, the motorists should be challaned only by theDeputy Superintendent of Police (DySP) or police inspectors.", "url": "https://indianexpress.com/article/cities/goa/stop-vehicles-only-if-there-is-visible-traffic-violation-goa-police-asks-its-staff-8030689/", "urlToImage": "https://images.indianexpress.com/2022/07/delhi-traffic-cops.jpeg", "publishedAt": "2022-07-15T06:20:14Z", "content": "The Goa police department has directed its personnel to ensure that henceforth vehicles should be stopped only if there is a “visible” traffic violation so that motorists do not have to face “undue h… [+1228 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "After rain plays spoilsport, Indian Railways books cab so student doesn’t miss train to Chennai", "description": "Engineering student Satyam Gadhvi had booked a train from Gujarat’s Ekta Nagar to Vadodara, from where he was to travel to Chennai, but the train from Ekta Nagar got cancelled due to heavy rain.", "url": "https://indianexpress.com/article/trending/trending-in-india/indian-railways-books-cab-so-student-doesnt-miss-train-to-chennai-8030551/", "urlToImage": "https://images.indianexpress.com/2022/07/railway-book-cab.jpg", "publishedAt": "2022-07-15T06:17:36Z", "content": "Its hardly anything new when heavy monsoon rains disrupt train services in any part of our country. However, the Indian Railways went out of its way to help a young student when torrential rains spoi… [+1769 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "A new Palestinian leader rises in the West Bank. He’s very unpopular", "description": "Though Mahmoud Abbas is 87, he has never designated an heir apparent to lead the Palestinian Authority, which administers parts of the West Bank and the 2.7 million Palestinians who live there.", "url": "https://indianexpress.com/article/world/palestine-leader-hussein-al-sheik-west-bank-8030630/", "urlToImage": "https://images.indianexpress.com/2022/07/Palestine.jpg", "publishedAt": "2022-07-15T05:56:29Z", "content": "For years, Hussein al-Sheikh has overseen the fraught day-to-day relations between Palestinians in the occupied West Bank and the Israeli military a role that has made him unpopular with the public b… [+5694 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "China’s surveillance state hits rare resistance from its own subjects", "description": "As China builds up its vast surveillance and security apparatus, it is running up against growing public unease about the lack of safeguards to prevent the theft or misuse of personal data.", "url": "https://indianexpress.com/article/world/china-surveillance-state-rare-resistance-8030623/", "urlToImage": "https://images.indianexpress.com/2022/07/china-surveillance.jpg", "publishedAt": "2022-07-15T05:55:59Z", "content": "Chinese artists have staged performances to highlight the ubiquity of surveillance cameras. Privacy activists have filed lawsuits against the collection of facial recognition data. Ordinary citizens … [+9228 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Union minister unaware of ground realities on MGNREGA in West Bengal: BJP", "description": "The ruling TMC seized the opportunity and said the state BJP has been lying about corruption in the implementation of MGNREGA in West Bengal and should \"apologise\" for making \"false allegations\".", "url": "https://indianexpress.com/article/cities/kolkata/union-min-unaware-of-ground-realities-on-mgnrega-in-west-bengal-bjp-8030600/", "urlToImage": "https://images.indianexpress.com/2022/07/dilip-ghosh.jpg", "publishedAt": "2022-07-15T05:35:03Z", "content": "The West Bengal BJP has claimed that union minister Kapil Moreshwar Patil, who said that he does not know of any corruption in the implementation of MGNREGA in West Bengal, is unaware of the ground r… [+1730 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Cristiano Ronaldo set to reject €275 million offer from Saudi club: Report", "description": "The Portuguese striker has reportedly turned down a move that would have made him the highest-paid player in the world.", "url": "https://indianexpress.com/article/sports/football/cristiano-ronaldo-set-to-reject-275-million-offer-report-8030535/", "urlToImage": "https://images.indianexpress.com/2022/02/cristiano-ronaldo.jpg", "publishedAt": "2022-07-15T05:19:43Z", "content": "Manchester United striker Cristiano Ronaldo’s future has been a subject of speculation for the entirety of the ongoing summer transfer window. The Portuguese, who arrived at Old Trafford last year an… [+2729 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "CUET UG 2022 Day 1 LIVE Updates: Affected candidates can appear in second phase, says NTA official", "description": "CUET UG Exam Analysis 2022 LIVE Updates: The first phase will take place on July 15, 1 6, 19 and 20 and the second phase will be held on August 4, 5, 6, 7, 8, and 10. Registered candidates can download the same from the official website — cuet.samarth.ac.in —…", "url": "https://indianexpress.com/article/education/cuet-ug-exam-analysis-2022-live-updates-common-entrance-test-begins-check-first-day-guidelines-schedule-cuet-samarth-ac-in-nta-ac-in-8028443/", "urlToImage": "https://images.indianexpress.com/2022/07/CUET-7.jpg", "publishedAt": "2022-07-15T05:12:24Z", "content": "CUET UG 2022 LIVE Updates: The National Testing Agency (NTA) is conducting the first day of the Common University Entrance Test undergraduate (CUET UG) 2022 today for phase I students. The students w… [+1952 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Shah Rukh Khan makes a dapper appearance at airport, fans say ‘thanks for ditching the umbrella’. See pics", "description": "Shah Rukh Khan was clicked at the Mumbai airport last night.", "url": "https://indianexpress.com/article/entertainment/bollywood/shah-rukh-khan-makes-a-dapper-appearance-at-airport-fans-say-thanks-for-ditching-the-umbrella-8030455/", "urlToImage": "https://images.indianexpress.com/2022/07/shah-rukh-khan-1200.jpg", "publishedAt": "2022-07-15T05:06:42Z", "content": "Actor Shah Rukh Khan was spotted at the Mumbai airport last night, and fans are thankful that he is no longer hiding behind umbrellas. SRK was seen hiding his face with the aid of umbrellas in the re… [+1394 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Fire breaks out at restaurant in Delhi’s Connaught Place", "description": "Delhi Fire Service Chief Atul Garg said: “Six fire tenders were immediately dispatched. No casualties were reported from the site.”", "url": "https://indianexpress.com/article/cities/delhi/delhi-connaught-place-restaurant-fire-breaks-out-8030495/", "urlToImage": "https://images.indianexpress.com/2022/07/cp-fire.jpg", "publishedAt": "2022-07-15T04:33:13Z", "content": "A fire broke out at a restaurant in Central Delhis Connaught Place early on Friday.The Delhi Fire Service said that six fire tenders were rushed to Cafe High-5 restaurant, and that no one was injured… [+868 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Instagram down for thousands of users – Downdetector", "description": "Earlier on Thursday, Twitter Inc also had a near three-hour outage that affected as many as 50,000 users at its peak", "url": "https://indianexpress.com/article/technology/social/instagram-down-for-thousands-of-users-downdetector-8030472/", "urlToImage": "https://images.indianexpress.com/2022/07/Instagram-Reuters.jpg", "publishedAt": "2022-07-15T04:21:16Z", "content": "Thousands of users of Meta Platforms Inc’s Instagram on Thursday reported issues with the photo-sharing application, according to Downdetector.com.Nearly 24,000 users of Instagram were impacted by 5 … [+702 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "‘Why is there even a discussion on his form?’: Rohit Sharma defends Virat Kohli after another failure", "description": "I am incredibly surprised with the criticism Virat Kohli is receiving, says England skipper Jos Buttler.", "url": "https://indianexpress.com/article/sports/cricket/ind-vs-eng-why-is-there-even-a-discussion-on-his-form-rohit-sharma-defends-virat-kohli-after-another-failure-8030423/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-22-3.jpg", "publishedAt": "2022-07-15T04:07:29Z", "content": "Rohit, who stood up for his teammate ahead of the first ODI, has again backed Virat Kohli and told reporters: “Virat Kohli doesn’t need reassurance from him as he is too good a player.”\r\n“Why is ther… [+2045 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Court documents in Roman Polanski criminal case ordered released", "description": "Roman Polanski remains a fugitive after pleading guilty in 1977 to unlawful sex with a minor and fleeing the United States for France on the eve of sentencing the following year.", "url": "https://indianexpress.com/article/entertainment/hollywood/court-documents-in-roman-polanski-criminal-case-ordered-released-8030369/", "urlToImage": "https://images.indianexpress.com/2022/07/Roman-Polanski-ap-1200by667.jpeg", "publishedAt": "2022-07-15T03:57:51Z", "content": "A California appeals court on Wednesday ordered the unsealing of some documents in the criminal case against renowned director Roman Polanski, who has been a fugitive since pleading guilty to having … [+3557 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sandip G", "title": "Reece Topley: How music and micro-economics helped England’s Lord’s hero return to cricket after 4 stress fractures in 5 years", "description": "Pulling off the England jersey had once seemed a distant journey. Making his debut at 21, life and career were smoothly progressing when a string of injuries began to seize him, pushing him to the brink of premature retirement.", "url": "https://indianexpress.com/article/sports/cricket/ind-vs-eng-reece-topley-music-and-micro-economics-helped-englands-lords-return-to-cricket-4-stress-fractures-8030413/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-21-3.jpg", "publishedAt": "2022-07-15T03:57:33Z", "content": "At the presentation ceremony after he demolished India with a six-wicket haul, Reece Topley could not hide his emotions. It means a lot, he said, choking for words. It makes it all worthwhile, to be … [+5708 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Mom-to-be Sonam Kapoor glows in yellow as she steps out ahead of her baby shower, see photo", "description": "Sonam Kapoor was seen out and about in Mumbai last evening. She is expecting her first baby soon with her husband Anand Ahuja.", "url": "https://indianexpress.com/article/entertainment/bollywood/sonam-kapoor-in-mumbai-for-baby-shower-soon-to-be-mom-yellow-dress-steps-out-photos-videos-8030346/", "urlToImage": "https://images.indianexpress.com/2022/07/sonam-kapoor-1200.jpg", "publishedAt": "2022-07-15T03:50:27Z", "content": "Sonam Kapoor is in Mumbai for her grand baby shower, which is expected to take place soon. The mom-to-be looked stunning in yellow as she was spotted at a plush restaurant in the city. Sonam was seen… [+1564 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "NIRF Ranking 2022 Live Updates: Education Minister to release college rankings today", "description": "NIRF Ranking List 2022 Live Updates: Union Education Minister Dharmendra Pradhan to unveil NIRF 2022 rankings today for 11 categories. The list will be revealed through a webcast on the official website of the ranking platform – nirfindia.org.", "url": "https://indianexpress.com/article/education/nirf-ranking-2022-live-updates-education-ministry-release-college-rankings-iisc-iit-jnu-du-iim-nirfindia-org-8029967/", "urlToImage": "https://images.indianexpress.com/2022/07/NIRF-2022-edu-card-live.jpg", "publishedAt": "2022-07-15T03:30:12Z", "content": "NIRF Ranking List 2022 Live Updates: The Union Education Minister Dharmendra Pradhan will release the National Institutional Ranking Framework (NIRF) Rankings 2022 today at 11 am. The list will be re… [+934 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Punjab govt withdraws plea against job quota in AG office", "description": "The State of Punjab had moved HC after the Punjab Department of Home Affairs and Justice, on May 27, wrote to the NCSC stating that reservation to Scheduled Caste candidates was not applicable while engaging various categories of law officers in the office of…", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-withdraws-plea-against-job-quota-in-ag-office-8030316/", "urlToImage": "https://images.indianexpress.com/2022/07/punjab-haryana-high-court-1.jpg", "publishedAt": "2022-07-15T02:45:12Z", "content": "The Punjab government on Thursday withdrew its petition filed before the Punjab and Haryana High Court wherein it had challenged an order of the National Commission for Scheduled Castes (NCSC) direct… [+2000 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Tight security arrangements in Jaipur for ‘Kanwar Yatra’", "description": "The yatra starts from Jaipur's Galta Teerth to various temples in the city during the holy month of Shravan.", "url": "https://indianexpress.com/article/cities/jaipur/tight-security-arrangements-jaipur-kanwar-yatra-8030306/", "urlToImage": "https://images.indianexpress.com/2022/07/kanwariya759-1.jpg", "publishedAt": "2022-07-15T02:25:57Z", "content": "The Rajasthan Police on Thursday said strict security arrangements have been made for ‘Kanwar Yatra’ and drones will be deployed to monitor its routes.The yatra starts from Jaipur’s Galta Teerth to v… [+518 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Madras HC calls for report, video clippings of violence at AIADMK party office", "description": "Turning down the plea of the APP Raj Tilak to grant time till Monday, Justice N Sathishkumar directed him to produce the report and video clippings by 2.30 p.m. Friday and adjourned the matter till then.", "url": "https://indianexpress.com/article/cities/chennai/madras-hc-calls-for-report-video-clippings-of-violence-at-aiadmk-party-office-8030262/", "urlToImage": "https://images.indianexpress.com/2022/07/AIADMK-hq-1.jpeg", "publishedAt": "2022-07-15T01:42:51Z", "content": "The Madras High Court on Thursday directed the Tamil Nadu Additional Public Prosecutor to file a report with video clippings of the violent incidents staged by the cadres of AIADMK at the party headq… [+2430 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Removal of Mangalsutra by wife is mental cruelty of highest order: Madras HC", "description": "When the woman was examined, she admitted that at the time of separation, she removed her thali chain (sacred chain worn by the wife as a token of having married). Though she proceeded to explain that she retained the thali and only removed the chain, the act…", "url": "https://indianexpress.com/article/cities/chennai/removal-of-mangalsutra-by-wife-is-mental-cruelty-of-highest-order-madras-hc-8030242/", "urlToImage": "https://images.indianexpress.com/2022/07/Madras-HC-2-3-1-4.jpg", "publishedAt": "2022-07-15T01:23:15Z", "content": "Removal of ‘thali’ (Mangalsutra) by an estranged wife would amount to subjecting the husband to mental cruelty of the highest order, the Madras High Court has observed and granted divorce to the aggr… [+3508 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "IIT-M develops indigenous management system for ONGC", "description": "The software 'Structural Integrity Management System' (SIMS) was developed by the Offshore Structures Group by the department of ocean engineering at IIT Madras.", "url": "https://indianexpress.com/article/cities/chennai/iit-m-develops-indigenous-management-system-for-ongc-8030231/", "urlToImage": "https://images.indianexpress.com/2022/07/Main-Gate_IIT-Madras1200x667.jpeg", "publishedAt": "2022-07-15T01:15:57Z", "content": "Premier research institute Indian Institute of Technology-Madras on Thursday said it has developed a large database management software system that would collect structural and design related data fo… [+2395 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Prescription must for sale of specified Ayurveda, Unani drugs online: CCPA", "description": "The CCPA said, “The Central Authority may initiate necessary action under the provisions of the Consumer Protection Act, 2019 if, after investigation, it is found that the said drugs are offered for sale by any e-commerce platform in violation to the legal fr…", "url": "https://indianexpress.com/article/india/prescription-must-for-sale-of-specified-ayurveda-unani-drugs-online-ccpa-8030225/", "urlToImage": "https://images.indianexpress.com/2022/07/Express-Representational-Image-46-14.jpeg", "publishedAt": "2022-07-15T00:55:58Z", "content": "THE CENTRAL Consumer Protection Authority (CCPA) has asked e-commerce companies to not allow the sale of Ayurvedic, Siddha and Unani drugs containing ingredients listed in Schedule E (1) of the Drugs… [+1669 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Carmel school tree accident: People from city, Odisha, Delhi come together to help woman conductor", "description": "Sheela, 36, a woman conductor at Carmel convent, was arranging chairs when she saw the tree fall. Hearing the cries of the children, she ran to rescue them. She was helping out the trapped girls when a huge branch fell on her.", "url": "https://indianexpress.com/article/cities/chandigarh/carmel-convent-school-tree-accident-students-conductor-woman-odisha-delhi-8030217/", "urlToImage": "https://indianexpress.com/wp-content/themes/indianexpress/images/IE-OGimage.jpg", "publishedAt": "2022-07-15T00:45:02Z", "content": "People not only from Chandigarh but also from Delhi and Odisha have got together to help single mother Sheela, the woman conductor who is battling for life at ICU in PGI after a 250-year-old tree fel… [+2420 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "SC grants bail to Pune man booked for murder of undertrial released on Covid-19 parole", "description": "The deceased, Pravin Satyavan More (25), a resident of area in Rajgad police station jurisdiction, was found murdered at Shivare village in Bhor taluka, Pune district.", "url": "https://indianexpress.com/article/cities/mumbai/sc-grants-bail-to-pune-man-booked-for-murder-of-undertrial-released-on-covid-19-parole-8030142/", "urlToImage": "https://images.indianexpress.com/2022/07/supreme-court-3-1-1.jpg", "publishedAt": "2022-07-14T22:55:09Z", "content": "The Supreme Court Tuesday granted bail to a man booked for killing another, who was an undertrial in a murder case and was released from Yerwada jail on provisional parole due to the Covid-19 outbrea… [+2748 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "Industry body IAMAI dissolves crypto, blockchain advocacy unit", "description": "The Blockchain and Crypto Assets Council (BACC) — which represents Indian crypto industry players such as CoinSwitch Kuber, WazirX, CoinDCX, Zebpay, BitBNS, Vauld, Chingari, Mudrex, etc — was formed to advocate the crypto industry’s arguments to regulatory bo…", "url": "https://indianexpress.com/article/business/industry-body-iamai-dissolves-crypto-blockchain-advocacy-unit-8030126/", "urlToImage": "https://images.indianexpress.com/2022/07/CRYPTO-1.jpg", "publishedAt": "2022-07-14T22:46:16Z", "content": "The Internet and Mobile Association of India (IAMAI) the industry body representing top internet companies and tech platforms has dissolved a key unit set up four years ago to do public advocacy for … [+2669 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "Global prices cooling: Govt to relook duties, cesses on fuel & crude", "description": "With global crude prices having softened since the imposition of the levies on July 1, it is likely that the government may consider lowering the duties and cesses.", "url": "https://indianexpress.com/article/business/commodities/global-prices-cooling-govt-to-relook-duties-cesses-on-fuel-crude-8030115/", "urlToImage": "https://images.indianexpress.com/2022/07/crude-oil-reuters-1200.jpeg", "publishedAt": "2022-07-14T22:34:14Z", "content": "The government is looking at reviewing the imposition of cesses and duties on fuel and domestic crude in a meeting to be held Friday, officials said. Officials of petroleum and finance ministries wil… [+2374 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Mihir Mishra", "title": "‘Re settlement may not pick up pace, trade deficits to weigh’", "description": "The RBI on Monday announced to allow trade settlements between India and other countries in rupees. While the move is seen to benefit trading primarily with Russia, it is also likely to help dollar outflow and help slow rupee depreciation to a ‘very limited e…", "url": "https://indianexpress.com/article/business/economy/re-settlement-may-not-pick-up-pace-trade-deficits-to-weigh-8030113/", "urlToImage": "https://images.indianexpress.com/2022/07/RBI-Reserve-Bank-Reuters-1200-1.jpg", "publishedAt": "2022-07-14T22:30:44Z", "content": "The Reserve Bank of Indias (RBI’s) move to promote trade settlements in Indian Rupee could work in the short-term with countries like Russia, but is unlikely to make a significant difference over the… [+3140 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "VS Krishnan", "title": "GST 2.0: Next stage of reform in the tax regime requires creating federal institutions", "description": "It can bring together senior officers from the Centre and states in an institutional forum registered under the Society Act. This forum could also provide a common point of contact for trade and industry to redress the grievances on non-policy matters", "url": "https://indianexpress.com/article/opinion/columns/gst-2-0-next-stage-of-reform-in-the-tax-regime-requires-creating-federal-institutions-8029959/", "urlToImage": "https://images.indianexpress.com/2022/07/GST-2-2.jpg", "publishedAt": "2022-07-14T22:28:30Z", "content": "The last five years of the GST journey have been like the samudra manthan that began with the unwanted elements of transition, but slowly yielded the nectar of higher revenues. Many of those who comp… [+4931 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Karnataka PSI scam: HC flags probe pace, cops say need time", "description": "The probe, however, is “on track”, the agency said, informing the court the Director General of Police, CID, P S Sandhu, is monitoring the investigation “personally”.", "url": "https://indianexpress.com/article/cities/bangalore/karnataka-psi-scam-hc-flags-probe-pace-cops-say-need-time-8030100/", "urlToImage": "https://images.indianexpress.com/2022/07/cop-2-1-4.jpg", "publishedAt": "2022-07-14T22:15:10Z", "content": "IPS officer Amrit Paul, arrested in the Karnataka police recruitment scam, formatted his phone before it was seized and efforts are on to retrieve the lost data, investigators said Thursday, as they … [+1123 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Supertech twin tower demolition: Decision on structural audit report awaited", "description": "Noida Authority officials had held a meeting with all stakeholders to finalise the demolition process of Supertech Twin Towers— Apex and Ceyane — situated in Sector 93A on June 7.", "url": "https://indianexpress.com/article/cities/delhi/supertech-twin-tower-demolition-decision-on-structural-audit-report-awaited-8029960/", "urlToImage": "https://images.indianexpress.com/2022/07/ch559207.jpg", "publishedAt": "2022-07-14T21:02:30Z", "content": "As the date for Supertech twin towers demolition draws near, Noida Authority convened a meeting Thursday to discuss the status of the pre-demolition structural audit report, officials said.A conclusi… [+1253 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "WWE PG Era is reportedly over, Monday Night Raw to be rated TV-14", "description": "WWE PG era technically being over is one of the biggest pro-wrestling stories this year.", "url": "https://indianexpress.com/article/wwe/wwe-pg-era-over-monday-night-raw-tv-14-8030037/", "urlToImage": "https://images.indianexpress.com/2022/07/wwe-raw.jpg", "publishedAt": "2022-07-14T20:27:43Z", "content": "WWE has reportedly converted its television rating for Monday Night Raw from TV-PG to TV- 14.According to Andrew Zarian of The Mat Men Podcast, next week’s episode of RAW (July 18) will have a TV-14 … [+1660 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "School principal transferred over allegations of molesting student", "description": "Municipal Education Officer (MEO), Surat, Vimal Desai said that a three-member committee has been constituted to probe into the allegations against the principal.", "url": "https://indianexpress.com/article/cities/surat/school-principal-transferred-over-allegations-of-molesting-student-8029975/", "urlToImage": "https://images.indianexpress.com/2022/07/IE-79-4.jpeg", "publishedAt": "2022-07-14T18:35:07Z", "content": "The principal of a Surat Municipal School was transferred on Thursday over allegations of molesting a student.Municipal Education Officer (MEO), Surat, Vimal Desai said that a three-member committee … [+1575 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sanath Prasad", "title": "Study in Karnataka NEP paper flags attitudes to gender: ‘Women tolerate violence for family’", "description": "The stigma around the LGBTQ community still exists among the education institutions and we need to overcome it.", "url": "https://indianexpress.com/article/cities/bangalore/study-in-karnataka-nep-paper-flags-attitudes-to-gender-women-tolerate-violence-for-family-8029922/", "urlToImage": "https://images.indianexpress.com/2022/06/LGBTQ-1200.jpg", "publishedAt": "2022-07-14T17:15:22Z", "content": "-Women tolerate violence for the good of the family\r\n-Clothes and behaviour are a cause for sexual violence\r\nThese are some of the responses by a number of teachers, parents and students who took par… [+4402 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Jimmy Leivon", "title": "Manipur govt announces free Covid precaution doses for all adults", "description": "The Manipur government said the vaccine will be made available in all government Covid-19 vaccine centres for a period of 75 days.", "url": "https://indianexpress.com/article/north-east-india/manipur/manipur-govt-announces-free-covid-precaution-doses-for-all-adults-8029919/", "urlToImage": "https://images.indianexpress.com/2019/12/Biren-singh-1200.jpg", "publishedAt": "2022-07-14T17:04:03Z", "content": "In line with the Centres decision, the Manipur government on Thursday announced free precaution dose vaccinations for 18 plus population of the state from Friday.An official statement issued by the s… [+945 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Divya Goyal", "title": "Daler Mehndi Immigration Fraud case: Immigration fraud case: Daler Mehndi sent to jail as court upholds Punjabi singer's conviction - The Indian Express", "description": "<ol><li>Daler Mehndi Immigration Fraud case: Immigration fraud case: Daler Mehndi sent to jail as court upholds Punjabi singer's conviction  The Indian Express\r\n</li><li>Daler Mehndi Gets 2-Year Jail In 2003 Human Trafficking Case In Patiala  NDTV\r\n</li><li>F…", "url": "https://indianexpress.com/article/cities/ludhiana/daler-mehndi-sentenced-to-2-years-in-jail-8029456/", "urlToImage": "https://images.indianexpress.com/2022/07/daler.jpg", "publishedAt": "2022-07-14T17:02:57Z", "content": "Punjabi singer Daler Singh Mehndi was on Thursday arrested and sent to jail after a Patiala court dismissed his appeal against a two-year jail term awarded to him in an immigration fraud case registe… [+3061 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Sachin, Sourav, Dhoni, Raina, all in house at Lord’s for the England vs India 2nd ODI", "description": "From Sachin Tendulkar to Sourav Ganguly, from Suresh Raina to MS Dhoni, the stars of Indian cricket weren't just on the field but in the stands as well for the England-India Lord's ODI.", "url": "https://indianexpress.com/article/sports/cricket/sachin-sourav-dhoni-raina-all-in-house-at-lords-for-the-england-india-odi-8029819/", "urlToImage": "https://images.indianexpress.com/2022/07/Sourav-Sachin-Dhoni-and-Raina.jpg", "publishedAt": "2022-07-14T16:38:56Z", "content": "Lord’s Cricket Ground has something special about it on cricket days, especially on July 14. On the third anniversary of the 2019 World Cup final, England play India in the second ODI of the three ma… [+1604 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "কেরলে এক ব্যক্তির শরীরে মিলল মাঙ্কিপক্স, সদ্য ফিরেছেন আমিরশাহি থেকে", "description": "এর লক্ষণগুলো থাকে দুই থেকে চার সপ্তাহ।", "url": "https://bengali.indianexpress.com/general-news/monkeypox-confirmed-in-kerala-man-who-returned-from-uae-469295/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/monekeypox.jpg", "publishedAt": "2022-07-14T16:27:04Z", "content": ", \r\n , \r\n, - , , , , - \r\n - , \r\n , , , , , , \r\nRead full story in English\r\nStay updated with the latest news headlines and all the latest General news download Indian Express Bengali App.\r\nWeb Title:… [+55 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Hashtag Politics | Who exactly is unparliamentary, asks Opposition", "description": "The booklet on unparliamentary words in Parliament and Assemblies sets off a war of words; Opp calls it a “gag order”, being used to suppress “hard-hitting truth”", "url": "https://indianexpress.com/article/political-pulse/hashtag-politics-unparliamentary-words-opposition-8029878/", "urlToImage": "https://images.indianexpress.com/2022/07/oppostion-1200-pulse.jpg", "publishedAt": "2022-07-14T16:15:41Z", "content": "The list features words like jumlajeevi, baal buddhi;, Covid spreader, Snoopgate. anarchist, Shakuni, dictatorial, taanashah , taanashahi, vinash purush, “Khalistani”, among other common words such a… [+3258 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Amit Sharma", "title": "As Kanwar Yatra begins, BJP revives old line of attack against SP", "description": "BJP alleges Akhilesh govt used to hassle pilgrims; SP dismisses ‘lies’", "url": "https://indianexpress.com/article/political-pulse/as-kanwar-yatra-begins-bjp-revives-old-line-of-attack-against-sp-8029775/", "urlToImage": "https://images.indianexpress.com/2022/07/Kanwar-Yatra-2-edit.jpeg", "publishedAt": "2022-07-14T15:15:05Z", "content": "The Kanwar Yatra, which began on Thursday, is an important part of the religious calendar of thousands of Shiva devotees in north India, especially western Uttar Pradesh. In the past few years, it ha… [+5473 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Sushmita Sen is dating Lalit Modi, see photos", "description": "Lalit Modi on Thursday announced that he is dating Bollywood actress Sushmita Sen.", "url": "https://indianexpress.com/article/entertainment/bollywood/sushmita-sen-is-dating-lalit-modi-8029770/", "urlToImage": "https://images.indianexpress.com/2022/07/sushmit-sen-modi-1200.jpg", "publishedAt": "2022-07-14T15:08:12Z", "content": "Bollywood actress Sushmita Sen is dating businessman and IPL founder Lalit Modi. Lalit professed his love for the Bollywood diva on Thursday through social media. Sharing a series of clicks on Twitte… [+1211 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Editorial", "title": "Stooping low", "description": "BJP demeans its mandate by linking former V-P Ansari to a dodgy Pak journalist and the ISI. Pakistan would be proud", "url": "https://indianexpress.com/article/opinion/editorials/stooping-low-2/", "urlToImage": "https://images.indianexpress.com/2022/07/edit-7-3.jpg", "publishedAt": "2022-07-14T15:03:40Z", "content": "The allegations levelled by the BJP’s official spokesperson against former Vice President Hamid Ansari cast extremely unflattering light on the BJP, not its intended target. Ansari has had a distingu… [+2477 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "CUET UG 2022: Class 12 marks to act as tie-breaker for students with same CUET score, says Delhi University V-C", "description": "DU will admit 20 per cent \"extra students\" under unreserved and OBC categories and 30 per cent in the SC/ST category to fill the maximum seats in undergraduate courses in the first round of counselling this year.", "url": "https://indianexpress.com/article/education/cuet-ug-2022-class-12-marks-to-act-as-tie-breaker-for-students-with-same-cuet-score-says-delhi-university-v-c-8029746/", "urlToImage": "https://images.indianexpress.com/2022/04/CUET-2022-4.jpg", "publishedAt": "2022-07-14T14:57:35Z", "content": "A Delhi University (DU) applicant’s performance in the Class 12 Board exams may, after all, prove to be useful for admission to undergraduate programmes this year. In the case of two students with th… [+3948 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Saba Azad, Hrithik Roshan enjoy jazz music in London, see pictures", "description": "Saba Azad took to her Instagram and posted a series of photos and a video which featured her and Hrithik Roshan in a jazz club.", "url": "https://indianexpress.com/article/entertainment/bollywood/saba-azad-hrithik-roshan-enjoy-jazz-music-in-london-see-pictures-8029700/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-40-1.jpg", "publishedAt": "2022-07-14T14:50:43Z", "content": "Saba Azad has dropped new pictures with Hrithik Roshan from their recent vacation in London. Sharing photos and a video from their visit to Ronnie Scotts Jazz Club in London, Saba wrote, Where the ja… [+1127 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "CAD expected to deteriorate in FY23 on costlier import: FinMin Report", "description": "The review released on Thursday by the ministry also said that global headwinds would continue to pose a downside risk to growth as crude oil and edibles, which have driven inflation in India, remain major imported components in the consumption basket.", "url": "https://indianexpress.com/article/business/economy/cad-expected-to-deteriorate-in-fy23-on-costlier-import-finmin-report-8029428/", "urlToImage": "https://images.indianexpress.com/2021/07/finance-ministry-express-archieve-1200.jpg", "publishedAt": "2022-07-14T14:03:32Z", "content": "India’s current account deficit is expected to deteriorate in the current fiscal on account of costlier imports and tepid merchandise exports, according to the Finance Ministry’s monthly economic rev… [+4712 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Shapoorji Pallonji and Co exits from Eureka Forbes", "description": "Advent International backed Lunolux acquired 1.68 crore equity shares of Eureka Forbes constituting 8.7 per cent of the equity share capital of Eureka Forbes from Shapoorji Pallonji and Company on July 12, 2022, said a regulatory update by the manufacturer of…", "url": "https://indianexpress.com/article/business/companies/shapoorji-pallonji-and-co-exits-from-eureka-forbes-8029472/", "urlToImage": "https://images.indianexpress.com/2022/07/eureka-forbes.jpg", "publishedAt": "2022-07-14T13:55:45Z", "content": "Construction major Shapoorji Pallonji and Company has exited from Eureka Forbes after selling its remaining 8.7 per cent stake to the new owner Lunolux, a firm backed by private equity firm Advent In… [+1455 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "কোনও শব্দই নাকি ‘নিষিদ্ধ’ হয়নি, অসংসদীয় বিতর্কের মাঝেই দাবি ওম বিড়লার", "description": "অসংসদীয় শব্দের তালিকা প্রকাশ করেছে লোকসভার সচিবালয়। যা নিয়ে উত্তাল রাজনীতি।", "url": "https://bengali.indianexpress.com/politics/national/not-banned-lok-sabha-speaker-amid-unparliamentary-words-row-469240/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/om-birla.jpg", "publishedAt": "2022-07-14T13:48:31Z", "content": ", ‘ , ’\r\n , ‘ ’\r\n , ‘ ? , , , , , ’\r\n -, , \r\n , \r\n, , , , , , , , , , , , , , , , , , , , , , , , , , , \r\n , ‘ , ’ ’\r\n , ‘ , . , , , , ’"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Payal Rohatgi performs Pag Phera ritual, fans say ‘Laxmi ka grah pravesh’", "description": "Payal Rohatgi has dropped a new video of her post-wedding ritual. The actor tied the knot with Sangram Singh on July 9.", "url": "https://indianexpress.com/article/entertainment/television/payal-rohatgi-performs-pag-phera-ritual-fans-say-laxmi-ka-grah-pravesh-8029620/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-39-1.jpg", "publishedAt": "2022-07-14T13:45:18Z", "content": "Television actor Payal Rohatgi, who married Indian wrestler Sangram Singh on July 9, recently shared a video of herself performing a post-wedding ritual known as Pag Phera. Sharing the video on her I… [+925 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shivani Naik", "title": "Husband-coach Kashyap on Saina Nehwal’s CWG non-selection: ‘It’s about your own people treating you like s*#@.’", "description": "Kashyap says that Nehwal's omission from the Badminton contingent going to Birmingham has led to frequent breakdowns for the former World No. 1.", "url": "https://indianexpress.com/article/sports/badminton/husband-coach-kashyap-on-saina-nehwals-cwg-non-selection-8028993/", "urlToImage": "https://images.indianexpress.com/2022/01/saina-nehwal-1.jpg", "publishedAt": "2022-07-14T13:24:16Z", "content": "For Saina Nehwal, her non-selection for the Commonwealth Games was not about desperation to play at the Games: she has two gold medals from 2010 and 2018 editions. “It’s about the amount of disrespec… [+4222 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "The Lord of the Rings The Rings of Power teaser: Amazon series is worthy of the biggest screen in your house", "description": "The Lord of the Rings: The Rings of Power starts streaming from September 2 on Amazon Prime Video.", "url": "https://indianexpress.com/article/entertainment/web-series/the-lord-of-the-rings-the-rings-of-power-new-teaser-amazon-prime-video-series-8029600/", "urlToImage": "https://images.indianexpress.com/2022/07/lotr.jpg", "publishedAt": "2022-07-14T13:19:35Z", "content": "Amazon Prime Video on Thursday released the main teaser of their upcoming series The Lord of the Rings: The Rings of Power. The two-and-a-half-minute teaser opens with a voice-over introducing the au… [+1323 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Aero Innovation and Skill Centre to mentor start-ups, students to open on July 16", "description": "Around 15-20 start-ups have been shortlisted by the Aero Innovation and Skill Centre.", "url": "https://indianexpress.com/article/india/aero-innovation-and-skill-centre-to-mentor-start-ups-students-to-open-on-july-16-8029582/", "urlToImage": "https://images.indianexpress.com/2022/04/DRDO.jpg", "publishedAt": "2022-07-14T13:15:08Z", "content": "With an aim to mentor start-ups, students and entrepreneurs working in the aerospace and aviation sectors, the Aeronautical Society of Indias (AeSI) Bengaluru branch will open the Aero Innovation and… [+2705 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "এফআইআর খারিজের আবেদন, এবার সুপ্রিম কোর্টের দ্বারস্থ মহম্মদ জুবের", "description": "তদন্তের জন্য প্রয়োজনীয় সমস্ত ইলেকট্রনিক সামগ্রী ইতিমধ্যে পুলিশ বাজেয়াপ্ত করেছে।", "url": "https://bengali.indianexpress.com/general-news/mohammed-zubair-moves-sc-seeking-quashing-of-firs-against-him-469175/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/Mohammed-Zubair.jpg", "publishedAt": "2022-07-14T13:04:43Z", "content": "’ , , , , , \r\n , - , , , \r\n, , ‘ , - , , ,’ \r\n - CAA , \r\n , - , , , \r\n - , , - \r\nRead full story in English\r\nStay updated with the latest news headlines and all the latest General news download India… [+95 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Delhi HC rejects plea seeking NEET postponement: ‘You can’t come at the last hour’", "description": "The court stated that had the petitioners not been students, it would have imposed a fine.", "url": "https://indianexpress.com/article/cities/delhi/delhi-high-court-rejects-plea-seeking-postponement-of-neet-exam-8029464/", "urlToImage": "https://images.indianexpress.com/2022/07/NEET-2021-2-1.jpg", "publishedAt": "2022-07-14T12:54:24Z", "content": "A group of students had sought the Delhi HC’s direction in rescheduling the medical entrance examination as the Common University Entrance Test (CUET) is scheduled in the same week and Joint Entrance… [+1147 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Forest department pulls up Ghaziabad Nagar Nigam for felling over 200 trees", "description": "According to the forest department, a case has been registered against officials of the horticulture department and proceedings have begun in the matter.", "url": "https://indianexpress.com/article/cities/delhi/forest-department-pulls-up-ghaziabad-nagar-nigam-felling-over-200-trees-8029513/", "urlToImage": "https://images.indianexpress.com/2022/07/felling.jpg", "publishedAt": "2022-07-14T12:33:50Z", "content": "The Ghaziabad forest department has registered a case against the Ghaziabad Nagar Nigam for allegedly chopping around 200-300 varieties of trees in a residential area without requisite permission, of… [+2697 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "‘লজ্জার, ব্রিটিশ শাসনেও মানুষ এত পরাধীন ছিল না’, অসংসদীয় শব্দ বিতর্কে তোপ অভিষেকের", "description": "বেশ কিছু ইংরেজি ও হিন্দি শব্দগুচ্ছের উপর নিষেধাজ্ঞা জারির ঘোষণা করেছে লোকসভার সচিবালয়। আঞ্চলিক ভাষাতেও ওইসব শব্দ প্রয়োগ করা যাবে না।", "url": "https://bengali.indianexpress.com/west-bengal/abhishek-banerjee-slammed-modi-government-on-unparliamentary-phrases-issue469184/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/abhishek-modi.jpg", "publishedAt": "2022-07-14T12:32:16Z", "content": ", ‘’ , ‘ ’\r\n - ‘, , , , , , , , , , , , , , , , ’, , \r\n , ‘ ? ?’\r\n , ‘ ? , , , , ’"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Entertainment Desk", "title": "জোর TRP-টক্কর! ‘মিঠাই’কে হারালেন ‘লক্ষ্মী কাকিমা’! বাকিরা কে কোথায়?", "description": "দর্শকরা কাকে ফুলমার্কস দিলেন, আর কাকে বাড়ি পাঠালেন? জেনে নিন একনজরে।", "url": "https://bengali.indianexpress.com/entertainment/television/bengali-serial-trp-ratings-dhulokona-at-first-mithai-in-fourth-469168/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/trp1.jpg", "publishedAt": "2022-07-14T12:19:10Z", "content": "TRP , \r\n! , , . ! TRP , – .\r\n [ , ] \r\n, , – , – - \r\n , \r\nStay updated with the latest news headlines and all the latest Television news download Indian Express Bengali App.\r\nWeb Title: Bengali serial… [+47 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Daler Mehndi sentenced to 2 years in jail for 2003 human trafficking case", "description": "Singer Daler Mehndi jailed for human trafficking case", "url": "https://indianexpress.com/article/cities/patiala/daler-mehndi-sentenced-to-2-years-in-jail-for-2003-human-trafficking-case-8029456/", "urlToImage": "https://images.indianexpress.com/2022/07/daler.jpg", "publishedAt": "2022-07-14T12:06:07Z", "content": "Daler mehndi sentenced to 2 years in jail( image source: Daler Mehndi/ Twitter)Singer Daler Mehndi sentenced to two years of imprisonment in a human trafficking case of 2003. He has been taken into p… [+350 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Entertainment Desk", "title": "বিহারের গ্রামে মাটির উনুনে লিট্টি বানাচ্ছেন পঙ্কজ ত্রিপাঠি, সরলতায় মুগ্ধ পড়শিরা", "description": "'জিয়ে তু বিহার কে লালা..' কালীন ভাইয়ার কীর্তিতে উল্লাস! দেখুন ভিডিও।", "url": "https://bengali.indianexpress.com/entertainment/pankaj-tripathi-making-litti-chokha-in-bihar-village-469165/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/07/pankaj.jpg", "publishedAt": "2022-07-14T12:00:05Z", "content": ", - ! , - , (Pankaj Tripathi) \r\n (Pankaj Tripathi in Bihar) , - , - \r\n[ : ! ]\r\n , - !\r\n- “ .. ”\r\n ,"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "IAS officer shares photo of innovation that reduces load on bulls, netizens impressed", "description": "The idea was conceived by the students of the Rajarambapu Institute of Technology in Maharashtra.", "url": "https://indianexpress.com/article/trending/trending-in-india/ias-officer-shares-photo-of-innovation-that-reduces-load-on-bulls-8029427/", "urlToImage": "https://images.indianexpress.com/2022/07/bull-innovation.jpeg", "publishedAt": "2022-07-14T11:41:56Z", "content": "A large part of rural India still uses bullock carts, especially in areas that are engaged in agricultural work. Bulls are often used for a variety of tasks such as ploughing the fields or transporti… [+2532 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manas Srivastava", "title": "UPSC Essentials: One word a day – FCRA", "description": "What is FCRA? All you need to know. UPSC aspirants must take note of this term often seen in the news due to amendments and NGOs. Do not miss to solve the MCQ below the article.", "url": "https://indianexpress.com/article/upsc-current-affairs/upsc-essentials/upsc-essentials-one-word-a-day-fcra-8028424/", "urlToImage": "https://images.indianexpress.com/2022/07/Untitled-design-51-1.jpg", "publishedAt": "2022-07-14T11:27:07Z", "content": "Take a look at the essential concepts, terms, and phenomena from the static and current parts of the UPSC-CSE. Also, check the answers to the previous MCQ.Word: FCRA\r\nSubject: Economy and Governance\r… [+7958 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "New emojis up for approval in 2022, include symbol of Sikh faith Khanda", "description": "Here are some of the new emojis that could make their way into your phone in 2022.", "url": "https://indianexpress.com/article/technology/social/new-upcoming-latest-emojis-2022-approval-khanda-8029300/", "urlToImage": "https://images.indianexpress.com/2022/07/New-emojis-approval-2022-emojipedia.jpg", "publishedAt": "2022-07-14T11:19:05Z", "content": "Two pushing hands, a shaking face, and a Khanda (symbol of the Sikh faith) are some of the emojis that are up for approval this September, ahead of World Emoji Day, according to Emojipedia. The emoji… [+1752 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Punjab: 13 more associates of gangsters Lawrence Bishnoi, Harwinder Rinda arrested, say police", "description": "Earlier, the police had claimed to have busted the gang with the arrest of 11 history-sheeters on June 29.", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-associates-gangsters-lawrence-bishnoi-harwinder-rinda-arrested-8029243/", "urlToImage": "https://images.indianexpress.com/2022/07/Handcuffs-crime-1200-2-1-10.43.56-AM.jpeg", "publishedAt": "2022-07-14T10:52:29Z", "content": "The Punjab Police have arrested 13 more associates of an inter-state gang backed by gangsters Lawrence Bishnoi and Harwinder Rinda, inspector general of police (IGP, headquarters) Sukhchain Singh Gil… [+2338 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Ms Marvel makers explain whether the post-credits cameo is real: ‘What you’re seeing is exactly what you think you’re seeing’", "description": "Ms Marvel ended on a high note with a much-awaited cameo by another MCU superhero.", "url": "https://indianexpress.com/article/entertainment/web-series/ms-marvel-finale-post-credits-cameo-captain-marvel-brie-larson-iman-vellani-8029041/", "urlToImage": "https://images.indianexpress.com/2022/07/ms-marvel-12002.jpg", "publishedAt": "2022-07-14T10:43:03Z", "content": "Ms Marvel‘s season finale was everything fans could ask for. And we dont just mean all the action, but also THAT long awaited cameo in the post-credits.*SPOILERS*\r\nThe intense action and drama that u… [+1785 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Sri Lanka Crisis: How the Presidential crisis unfolded", "description": "Here's a look at how the second phase of Sri Lankan protests unfolded.", "url": "https://indianexpress.com/article/world/sri-lanka-crisis-how-the-presidential-crisis-unfolded-8028985/", "urlToImage": "https://images.indianexpress.com/2022/07/sri-lanka-16.jpg", "publishedAt": "2022-07-14T10:36:44Z", "content": "The protests fuelled by the economic crisis flared in Sri Lanka again this week as the protesters stormed President Gotabaya Rajapaksa’s residence, forcing the leader to flee the country. Though the … [+5085 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "CBSE 12th, ISC, ICSE Results 2022 Updates: CISCE says result not ready yet", "description": "CBSE Class 12th Result 2022 Latest Update, ISC, CISCE, ISC Result 2022: Score cards not ready yet, says CISCE official. Once released, students will be able to check their results on the websites - cisce.org or results.cisce.org.", "url": "https://indianexpress.com/article/education/cbse-class-12th-result-isc-icse-results-date-and-time-updates-cisce-says-result-not-ready-yet-cisce-org-results-cisce-org-8029019/", "urlToImage": "https://images.indianexpress.com/2022/07/ICSE-ISC-result.jpg", "publishedAt": "2022-07-14T10:11:29Z", "content": "The official informed that CISCE is not ready with the results yet and will make an official announcement as and when the Board is ready to announce the results for ISCE and ISC. Once released, stude… [+1879 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shruti Dhapola", "title": "Nothing phone (1)’s challenges and advantages in fight against OnePlus, Oppo and others", "description": "Nothing phone (1)'s price of Rs 32,999 puts it squarely in the competitive mid-range segment. Here's are the challenges and advantages it has as it competes against options from OnePlus, Xiaomi, Oppo and others.", "url": "https://indianexpress.com/article/technology/mobile-tabs/nothing-phone-1s-challenges-and-advantages-in-fight-against-oneplus-oppo-and-others-8029071/", "urlToImage": "https://images.indianexpress.com/2022/07/NothingPhone1_NEW_LEAD.jpg", "publishedAt": "2022-07-14T10:08:09Z", "content": "When OnePlus One first launched in April 2014, there was a lot of hype and curiosity around the phone. After all, it offered a unique finish (the sandstone black finish was rare), a good processor (t… [+5440 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "World Emoji Day: Indian users are not entirely sure what some emojis mean, shows survey", "description": "As it turns outs, Indians have wildly different ideas about what certain emojis represent.", "url": "https://indianexpress.com/article/technology/tech-news-technology/world-emoji-day-survey-indian-user-emoji-perception-interpretation-8029063/", "urlToImage": "https://images.indianexpress.com/2022/07/India-emojis-perception-slack-world-emoji-day-2022.jpg", "publishedAt": "2022-07-14T09:40:38Z", "content": "Do you know what each emoji really means? Well, it seems many Indian users are confused about some emojis and their exact usage.  Ahead of World Emoji Day on July 17, Slack paired up with DuoLingo to… [+3717 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Increase the shelf life of vegetables, make soft rotis, remove garlic smell from hands with these kitchen hacks", "description": "Former MasterChef Pankaj Bhadouria shares simple kitchen hacks to make life easier", "url": "https://indianexpress.com/article/lifestyle/food-wine/fresh-vegetables-soft-roti-easy-kitchen-cooking-hacks-pankaj-bhadouria-8021775/", "urlToImage": "https://images.indianexpress.com/2022/07/kitchen-hacks_200_getty.jpg", "publishedAt": "2022-07-14T09:30:37Z", "content": "The kitchen may excite some people, but for others, it is the one place they would rather not be. However, you never know when you may find yourself in the kitchen to whip up a quick dish. At such ti… [+1706 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "History haunts Ukraine’s undiplomatic voice in Berlin", "description": "Debate over a Ukrainian nationalist leader’s role in the Holocaust has exposed how views of the past shape European allies’ relationships with Kyiv.", "url": "https://indianexpress.com/article/world/history-haunts-ukraines-undiplomatic-voice-in-berlin-8028337/", "urlToImage": "https://images.indianexpress.com/2022/07/adrijn-melynk.jpg", "publishedAt": "2022-07-14T09:09:11Z", "content": "It was as if Ukraines ambassador in Germany was vying for the title of most undiplomatic diplomat: Determined to spur Berlin into more urgent support for his embattled nation, he mocked the chancello… [+9353 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Zeeshan Shaikh", "title": "Maharashtra politics moves to BMC ground: Milind Deora takes swipe at Sena, gets Fadnavis support", "description": "Deora writes to CM Shinde over increase in wards, basis for their reservation, says against spirit of free, fair polls", "url": "https://indianexpress.com/article/political-pulse/maharashtra-politics-bmc-wards-milind-deora-shiv-sena-devendra-fadnavis-8028941/", "urlToImage": "https://images.indianexpress.com/2022/07/deora-fadnavis.jpg", "publishedAt": "2022-07-14T09:04:31Z", "content": "The simmering discontent within the unlikely triumvirate of the Congress, NCP and Shiv Sena manifested itself yet again Wednesday when former Mumbai Congress president Milind Deora wrote to Maharasht… [+3707 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sweety Kumari", "title": "Kolkata: More than a year after Rashika Jain’s death, husband arrested", "description": "Rashika was found dead at her in-laws’ house at Alipore on February 16, 2021, just a year after she got married to Kushal Agarwal", "url": "https://indianexpress.com/article/cities/kolkata/kolkata-rashika-jain-death-case-husband-arrested-8028843/", "urlToImage": "https://images.indianexpress.com/2022/07/handcuff-1200.jpg", "publishedAt": "2022-07-14T08:49:21Z", "content": "The Alipore police on Wednesday arrested businessman Kushal Agarwal, whose wife Rashika Jain was found dead at her in-laws house last year, following which her family said that she was being tortured… [+1284 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Kajol wore this interesting outfit to celebrate 25 years of her film ‘Gupt’", "description": "The actor was seen in a one-shoulder multi-coloured top that featured geometric patterns on a black base", "url": "https://indianexpress.com/article/lifestyle/fashion/kajol-outfit-celebrate-25-years-gupt-film-fashion-8022623/", "urlToImage": "https://images.indianexpress.com/2022/07/Kajol-1200.jpg", "publishedAt": "2022-07-14T08:40:09Z", "content": "Kajol looked her cheerful best in one of her recent fashion outings, which was the screening of her 1997 thriller film ‘Gupt: The Hidden Truth‘.Buy Now | Our best subscription plan now has a special … [+1189 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Deutsche Welle", "title": "US warns it will defend Philippines in South China Sea", "description": "The new Philippines government has a renewed focus on the South China Sea territorial dispute.", "url": "https://indianexpress.com/article/world/us-warns-it-will-defend-philippines-south-china-sea-8028547/", "urlToImage": "https://images.indianexpress.com/2021/12/south-china-sea.jpeg", "publishedAt": "2022-07-14T07:54:04Z", "content": "US Secretary of State Antony Blinken made the statement on the sixth anniversary of a 2016 decision by an international arbitration tribunal that largely ruled in favour of the Philippines over the d… [+1875 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "SpaceX Starship booster ‘probably’ returning to pad after explosion – Elon Musk", "description": "SpaceX founder and chief executive Elon Musk said that the Starship rocket booster SpaceX plans to use for an inaugural flight to orbit will \"probably\" return to its launch mount in Texas next week following a testing explosion on Monday.", "url": "https://indianexpress.com/article/technology/science/elon-musk-spacex-booster-rocket-explosion-return-to-pad-8028595/", "urlToImage": "https://images.indianexpress.com/2022/07/space-x-rocket-launch-explosion.jpg", "publishedAt": "2022-07-14T07:48:26Z", "content": "The Starship rocket booster SpaceX plans to use for an inaugural flight to orbit will “probably” return to its launch mount in Texas next week following a testing explosion on Monday, the company’s c… [+1938 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "ENG vs IND 2nd ODI live streaming: When and where to watch England vs India match live online?", "description": "India vs England Live Streaming, 2nd ODI: The former India captain, who is enduring a prolonged bad patch, missed the first game due to groin strain and it is still not clear if he is fit for the second game.", "url": "https://indianexpress.com/article/sports/cricket/eng-vs-ind-2nd-odi-live-streaming-when-and-where-to-watch-england-vs-india-match-live-online-8028440/", "urlToImage": "https://images.indianexpress.com/2022/07/india-cricket-team-2022.jpg", "publishedAt": "2022-07-14T07:37:56Z", "content": "England vs India, 2nd ODI live streaming: Indian star batter Virat Kohli’s poor show hasn’t affected the team much as it is playing extremely well in the white-ball games. After clinching the T20 ser… [+930 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Battlegrounds Mobile India to host virtual Blackpink concert: All you need to know", "description": "BGMI Blackpink concert: Battlegrounds Mobile India to host virtual Blackpink concert - check details, how to access", "url": "https://indianexpress.com/article/technology/gaming/battlegrounds-mobile-india-to-host-virtual-blackpink-concert-all-you-need-to-know-8028508/", "urlToImage": "https://images.indianexpress.com/2022/07/Battlegrounds-Mobile-India-BlackPink-concert.jpg", "publishedAt": "2022-07-14T07:26:54Z", "content": "Battle royale shooting title Battlegrounds Mobile India (BGMI) is set to host a virtual in-game concert later this month. The concert will feature the popular K-pop girl group Blackpink. The concert … [+1381 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Pune News Live Updates: Rain continues to batter city as IMD predicts showers for next 24 hours; schools shut", "description": "Pune News Live Today: Schools in Pune remain shut and the IMD has maintained its warning of avoiding visiting ghat areas of Pune, Satara, Kolhapur, and Nashik as these remain extremely vulnerable to intense rainfall spells.", "url": "https://indianexpress.com/article/cities/pune/pune-news-live-updates-rain-weather-traffic-8028459/", "urlToImage": "https://images.indianexpress.com/2022/07/Pune-Rain.jpeg", "publishedAt": "2022-07-14T07:18:57Z", "content": "Students return home from school on Wednesday. Authorities in Pune have decided to keep schools shut owing to the incessant rains. (Express Photo: Arul Horizon)\r\nThe Pune Municipal Corporation (PMC) … [+1188 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pune: Nine bikes gutted in fire in parking lot of residential building", "description": "A fire officer said that by the time they were able to douse the fire, all the nine bikes were completely gutted so was the compartment that housed electricity meters of the building.", "url": "https://indianexpress.com/article/cities/pune/pune-fire-chandan-nagar-residential-building-bikes-gutted-8028456/", "urlToImage": "https://images.indianexpress.com/2022/07/pune-bikes.jpg", "publishedAt": "2022-07-14T07:01:24Z", "content": "Nine motorcycles were completely gutted in a fire that started early Thursday in the parking lot of a residential building in the Chandan Nagar area of Pune, said the police. No one was injured in th… [+82 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Careers Desk", "title": "RRB NTPC CBT 2 Guwahati exam dates announced; check schedule", "description": "As per the official notification, the RRB NTPC CBT 2 exam will begin on August 10 and will end on August 12, 2022. The admit cards will soon be available on the official website - rrbguwahati.gov.in", "url": "https://indianexpress.com/article/jobs/rrb-ntpc-cbt-2-guwahati-exam-dates-announced-check-schedule-rrbguwahati-gov-in-8028287/", "urlToImage": "https://images.indianexpress.com/2022/03/UPSC-NDA.jpg", "publishedAt": "2022-07-14T06:59:27Z", "content": "The Railway Recruitment Board (RRB) has announced exam dates for RRB NTPC CBT 2 Guwahati on the official website – rrbguwahati.gov.in. As per the official notification, the RRB NTPC CBT 2 exam will b… [+1328 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Nepal’s Parliament passes first Citizenship Amendment Bill", "description": "In the meeting of the lower house of Parliament or the House of Representatives on Wednesday, Home Minister Bal Krishna Khand presented Nepal's first Citizenship Amendment Bill 2022.", "url": "https://indianexpress.com/article/world/nepals-citizenship-amendment-bill-parliament-8028281/", "urlToImage": "https://images.indianexpress.com/2022/07/kp-oli.jpg", "publishedAt": "2022-07-14T06:47:46Z", "content": "Nepal’s Parliament on Wednesday passed the country’s first Citizenship Amendment Bill, which was under discussion for more than two years as political parties failed to forge a consensus on it.The bi… [+1501 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "CBI arrests seven, including ECL managers, in coal pilferage scam", "description": "CBI has announced a bounty of Rs 1 lakh on absconding TMC leader Vinay Mishra in connection with the scam. Mishra allegedly collected money on behalf of influential people.", "url": "https://indianexpress.com/article/cities/kolkata/cbi-arrests-seven-including-ecl-managers-in-coal-pilferage-scam-8028369/", "urlToImage": "https://images.indianexpress.com/2022/07/coal-mining-express.jpg", "publishedAt": "2022-07-14T06:42:44Z", "content": "CBI has arrested seven people, including a serving and three retired general managers of state-run Eastern Coalfields Limited (ECL), in connection with the multi-crore coal pilferage scam, an officia… [+1517 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Petrol-diesel prices today: Check fuel rates in your city", "description": "Petrol-Diesel Rates Today (July 14): In Delhi, petrol costs Rs 96.72 per litre, while diesel is priced at Rs 89.62 per litre. In Mumbai, petrol retails at Rs 111.35 per litre, while diesel costs Rs 97.28 per litre. Read below to find out fuel rates in your ci…", "url": "https://indianexpress.com/article/business/commodities/petrol-diesel-prices-today-july-14-2022-fuel-rates-delhi-mumbai-8028237/", "urlToImage": "https://images.indianexpress.com/2022/07/petrol-diesel-price-express-archieve-photo-1200.jpg", "publishedAt": "2022-07-14T06:29:43Z", "content": "Fuel Rates in India Today (July 14): Petrol and diesel rates stood the same across the country for the 53rd successive day on Thursday, July 14, 2022.In Delhi, petrol continues to retail at Rs 96.72 … [+2419 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gujarat: After heavy rains, national highway closed in Navsari", "description": "Rivers and dams in Navsari district overflow after heavy downpour. National and state disaster response force teams engaged in evacuating people", "url": "https://indianexpress.com/article/cities/surat/gujarat-rains-national-highway-closed-in-navsari-8028357/", "urlToImage": "https://images.indianexpress.com/2022/07/gujarat-highway.jpeg", "publishedAt": "2022-07-14T06:29:09Z", "content": "Due to heavy rains in Navsari, Valsad and Dang districts in south Gujarat, National Highway 48, from Alipore in Navsari district to Valsad, was temporarily closed on the orders of Navsari District Co… [+890 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi: Fake call centre cheating US citizens busted, 25 apprehended", "description": "The call centre operated out of a rented house in Outer Delhi's Mundka area. The accused posed as officials from the United States higher education grants department to call people in the US and took money in the name of various schemes.", "url": "https://indianexpress.com/article/cities/delhi/delhi-fake-call-centre-mundka-8028268/", "urlToImage": "https://images.indianexpress.com/2022/07/call-centre.jpg", "publishedAt": "2022-07-14T06:02:35Z", "content": "The Delhi Police Crime Branch busted a fake call centre in Outer Delhis Mundka area and caught at least 25 people, said officials Thursday. The police said the accused posed as officials from the Uni… [+2529 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Chennai airport’s Bravo taxiway to open today", "description": "The Bravo taxiway had a curve that has now been straightened. The straightened taxiway is expected to ensure faster movement of flights, especially during peak hour traffic.", "url": "https://indianexpress.com/article/cities/chennai/chennai-airport-bravo-taxiway-opens-8028251/", "urlToImage": "https://images.indianexpress.com/2022/07/airport.jpeg", "publishedAt": "2022-07-14T05:44:05Z", "content": "The Chennai International Airport is finally set to open its primary taxiway Bravo on Thursday, four years after straightening work on it began in 2018.According to officials, the functioning of Brav… [+1437 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Cheating case: Chandigarh Police issue LoC against Delhi man hiding in Dubai", "description": "The fraud came to light when two of the accomplices of the mastermind -- Chauhan Ratan and Parmar Rajeshji -- of Gujarat were arrested in Chandigarh on June 24.", "url": "https://indianexpress.com/article/cities/chandigarh/cheating-case-police-issue-loc-against-delhi-man-hiding-in-dubai-8028147/", "urlToImage": "https://images.indianexpress.com/2022/07/cyber-crime-1-4.jpg", "publishedAt": "2022-07-14T05:01:54Z", "content": "THE Chandigarh Police has issued a look out notice (LOC) against a suspect identified as Saurabh Balwani of Delhi believed to be hiding in Dubai in connection with cheating a Mumbai man by doing onli… [+2156 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "CUET UG 2022: Five tips to ace common entrance test", "description": "With the CUET UG 2022 exam approaching, students need to ensure they are fully prepared to ace the entrance test for admissions in undergraduate programmes. Here are some expert tips.", "url": "https://indianexpress.com/article/education/cuet-ug-2022-admit-card-five-tips-to-ace-common-entrance-test-8023176/", "urlToImage": "https://images.indianexpress.com/2022/07/CUET-2.jpg", "publishedAt": "2022-07-14T04:59:07Z", "content": "As the CUET UG exam is a few days away, this is a very crucial time for aspirants. These last few days are important in terms of preparation. Students are advised to be thorough with their syllabus. … [+2357 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "‘I see him coming back and doing well”, Sourav Ganguly backs under-pressure Virat Kohli", "description": "Kohli, who hasn’t scored a century since 2019, has been going through a lean patch for quite some time.", "url": "https://indianexpress.com/article/sports/cricket/look-at-the-numbers-he-has-got-that-doesnt-happen-without-ability-and-quality-sourav-ganguly-backs-under-pressure-virat-kohli-8028124/", "urlToImage": "https://images.indianexpress.com/2022/07/virat-kohli-11.jpg", "publishedAt": "2022-07-14T04:54:04Z", "content": "BCCI president Sourav Ganguly has backed up under pressure Virat Kohli and said, Yeah, look at the numbers he has got in international cricket that does not happen without ability and quality. Yes, h… [+1265 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Punjab: 12-year-old boy dies by suicide in Ludhiana", "description": "The boy's father Parsa Singh told police that Armandeep's mother had died nearly two years ago. She had also allegedly died by suicide as she suffered from depression over health issues of her elder son.", "url": "https://indianexpress.com/article/cities/ludhiana/punjab-12-year-old-boy-dies-by-suicide-in-ludhiana-8028138/", "urlToImage": "https://images.indianexpress.com/2022/07/Express-Representational-Image-46-13.jpeg", "publishedAt": "2022-07-14T04:42:32Z", "content": "A twelve-year-old boy allegedly died by suicide at his home in Khera village of Machhiwara, Ludhiana, on Tuesday. Police said that the body of the boy, Armaandeep Singh, was found hanging from a hook… [+970 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Dharmendra remembers his ‘darling brother’ Dilip Kumar, shares a prized old photo of the late actor. See here", "description": "Dharmendra shared an old photo of his late friend, actor Dilip Kumar. See it here.", "url": "https://indianexpress.com/article/entertainment/bollywood/dharmendra-recalls-his-darling-brother-dilip-kumar-shares-an-old-photo-of-the-late-actor-8027986/", "urlToImage": "https://images.indianexpress.com/2022/07/Dilip-Kumar-dharmendra-1200.jpg", "publishedAt": "2022-07-14T03:26:37Z", "content": "Actor Dharmendra regularly shares old photos and videos on his social media platforms, taking his fans down memory lane. His latest post features an old photo of his friend, actor Dilip Kumar. Dharme… [+2113 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Karan Johar reveals Rishi Kapoor was upset with Deepika Padukone and Sonam Kapoor for taking digs at Ranbir Kapoor on Koffee with Karan: ‘I had to step in…’", "description": "During their appearance on Koffee with Karan in 2010, Deepika Padukone and Sonam Kapoor had taken several digs at Ranbir Kapoor.", "url": "https://indianexpress.com/article/entertainment/bollywood/karan-johar-koffee-with-karan-rishi-kapoor-deepika-padukome-comments-8027966/", "urlToImage": "https://images.indianexpress.com/2022/07/Kjo1200.jpg", "publishedAt": "2022-07-14T03:13:15Z", "content": "Filmmaker Karan Johar’s chat show Koffee with Karan has birthed innumerable controversies over the years. From Deepika Padukone and Sonam Kapoor’s comments about Ranbir Kapoor to Kangana Ranaut attac… [+1845 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Punjab: CM Bhagwant Mann orders inquiry into scholarship scam", "description": "“The guilty of these irregularities will be made answerable for the loot of every single penny from the state exchequer” said Punjab CM Bhagwant Mann.", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-cm-bhagwant-mann-orders-inquiry-into-post-metric-sc-scholarship-scam-sadhu-singh-dharamsot-8027987/", "urlToImage": "https://indianexpress.com/wp-content/themes/indianexpress/images/IE-OGimage.jpg", "publishedAt": "2022-07-14T03:08:28Z", "content": "In more trouble for former Congress minister Sadhu Singh Dharamsot who is facing trial in a corruption case, Punjab Chief Minister Bhagwant Mann on Wednesday ordered a comprehensive inquiry into the … [+4469 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kamaldeep Singh Brar", "title": "Described as terrorist: Punjabi University to remove ‘Bhindranwale content’ after SGPC objects", "description": "“Sant Jarnail Singh Bhindranwale has been described as a terrorist in the syllabus of MA political science. This unacceptable language is found in the Punjabi medium book of MA political science (fourth semester syllabus),\" SGPC president Advocate Harjinder S…", "url": "https://indianexpress.com/article/education/described-as-terrorist-pau-to-remove-bhindranwale-content-after-sgpc-objects-8027962/", "urlToImage": "https://images.indianexpress.com/2022/07/bhindranwale-1.jpg", "publishedAt": "2022-07-14T02:57:24Z", "content": "After Shiromani Gurdwara Parbandhak Committee (SGPC) took strong objection to a part of the Punjabi University’s MA political science syllabus which mentions Sikh leader Jarnail Singh Bhindranwale as… [+1855 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Haryana govt forms new backward classes panel", "description": "Mukul Kumar, Special Secretary, Scheduled Castes and Backward Classes Welfare Department, has been nominated as Member Secretary.", "url": "https://indianexpress.com/article/cities/chandigarh/haryana-forms-new-backward-classes-panel-8027938/", "urlToImage": "https://indianexpress.com/wp-content/themes/indianexpress/images/IE-OGimage.jpg", "publishedAt": "2022-07-14T02:13:55Z", "content": "Following the announcement made by CM Manohar Lal Khattar, the Haryana government on Wednesday constituted the Haryana Backward Classes Commission afresh in exercise of the powers conferred by sub-se… [+1178 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Tamil Nadu: Mettur dam crosses 105 feet, more rains likely to raise water level", "description": "The full reservoir level in the dam, also known as Stanley Reservoir, is at 120 feet. The water level is likely to increase by another two feet late in the night, as inflow is increasing fast throughout the day.", "url": "https://indianexpress.com/article/cities/chennai/tamil-nadu-mettur-dam-crosses-105-feet-more-rains-likely-to-raise-water-level-8027899/", "urlToImage": "https://images.indianexpress.com/2022/07/Mettur.jpeg", "publishedAt": "2022-07-14T02:00:15Z", "content": "As the catchment areas of Cauvery river in neighbouring Karnataka are receiving heavy rains, the water level in Mettur dam in Salem district breached the 105 feet mark on Wednesday.The full reservoir… [+916 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "No reason for Punjab to oppose Vidhan Sabha land in Chandigarh, says BJP’s Capt Abhimanyu", "description": "Currently, Haryana and Punjab have their respective Vidhan Sabhas in the same complex in Chandigarh. Haryana has been demanding a separate Vidhan Sabha citing that the number of Assembly constituencies may go up to 126 by 2029.", "url": "https://indianexpress.com/article/cities/chandigarh/no-reason-for-punjab-to-oppose-vidhan-sabha-land-in-chandigarh-says-bjps-capt-abhimanyu-8027911/", "urlToImage": "https://images.indianexpress.com/2022/07/capt-abhimanyu.jpg", "publishedAt": "2022-07-14T01:41:06Z", "content": "Senior BJP leader Captain Abhimanyu on Wednesday said that there should not be any reason for political leaders of Punjab to oppose allotment of land to Haryana for an additional Vidhan Sabha buildin… [+3125 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Madras HC issues contempt notice against education dept officials", "description": "As the first bench in its common order dated February 13, 2020 had categorically held that the contempt petitioners were entitled to UGC scales of pay, the present bench said the college was bound to comply with the same.", "url": "https://indianexpress.com/article/cities/chennai/madras-hc-issues-contempt-notice-against-education-dept-officials-8027880/", "urlToImage": "https://images.indianexpress.com/2022/07/Madras-HC-2-3-1-3.jpg", "publishedAt": "2022-07-14T01:15:31Z", "content": "The Madras High Court has ordered issuance of notice to the officials of the Tamil Nadu Education department and the head of a college in Tiruppur district for not complying with its earlier orders.T… [+1076 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "After Chandigarh tree accident: Mohali MC yet to start drive to cut dead trees, lacks exact number", "description": "Mohali has around 70,000 green trees as well but in old parts of the city there are some dead trees which are posing danger to the lives of the people. These areas include Phase V, Phase 3B2, Phase 3A, Phase IV and Phase II.", "url": "https://indianexpress.com/article/cities/sas-nagar-mohali/chandigarh-school-accident-carmel-convent-dead-trees-mohali-municipal-corporation-8027878/", "urlToImage": "https://images.indianexpress.com/2022/07/tree-cutting-express.jpg", "publishedAt": "2022-07-14T01:03:07Z", "content": "After a girl’s death due to falling off of a tree in Chandigarh, the Mohali Municipal Corporation had claimed to start a drive to cut dead trees in the city. But the civic body does not have the numb… [+1823 chars]"}]}