{"status": "ok", "totalResults": 326, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Shyam Saran", "title": "On a trek through Uttarakhand, a former diplomat muses on the unprecedented scale of developmental activity in the region", "description": "Travelling through the vulnerable landscape brings on the sobering realisation that the snows on the Himalayas may not be eternal after all", "url": "https://indianexpress.com/article/express-sunday-eye/trek-uttarakhand-former-diplomat-unprecedented-scale-developmental-activity-region-7928971/", "urlToImage": "https://images.indianexpress.com/2022/05/GettyImages-Precarious-at-the-Top-Eye-1200.jpg", "publishedAt": "2022-05-22T00:30:06Z", "content": "I have been trekking the Uttarakhand and Himachal Himalayas for several years now. These are unique and breathtakingly beautiful landscapes. No matter how many times I have returned to explore these … [+6255 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Three arrested for impersonating candidates", "description": "Sources said that during the verification, it was found that the face of the candidates Aman, Vikram Singh and Anand, from Haryana, did not match with the photo on the admit card issued by the Punjab University.", "url": "https://indianexpress.com/article/cities/chandigarh/three-arrested-for-impersonating-candidates-7929803/", "urlToImage": "https://images.indianexpress.com/2022/05/arrest-27.jpg", "publishedAt": "2022-05-22T00:29:17Z", "content": "THREE MEN were caught for appearing on the behalf of real candidates during the physical test for the recruitment of firemen in the Chandigarh Municipal Corporation at Police Lines, Sector 26, on Sat… [+1113 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Divya Goyal", "title": "A sinking INLD receives another jolt with its supremo Om Prakash Chautala’s conviction", "description": "Having won the polls two times from Moga and once from Dharamkot, he was a close confidant of SAD patron Parkash Singh Badal. He had also participated in several “morchas” led by Akali Dal for rights of Punjab and had also spent jail term.", "url": "https://indianexpress.com/article/cities/chandigarh/a-sinking-inld-receives-another-jolt-with-its-supremo-om-prakash-chautalas-conviction-7929800/", "urlToImage": "https://images.indianexpress.com/2021/09/Om-Prakash-Chautala-1.jpg", "publishedAt": "2022-05-22T00:28:16Z", "content": "The fresh conviction of its supremo, 87-year-old Om Prakash Chautala in a disproportionate assets case is all set to further dent the already sinking Indian National Lok Dal party in Haryana, which i… [+3973 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Shahpur Colony demolition: HC issues notice to UT Administration", "description": "The petitioner, Rajinder Kumar and others, through counsel GP Vashisht, argued that the petitioners are residing in their houses in their area which have been provided house numbers and they also have ration cards, Aadhar cards and are registered voters.", "url": "https://indianexpress.com/article/cities/chandigarh/shahpur-colony-demolition-hc-issues-notice-to-ut-administration-7929802/", "urlToImage": "https://images.indianexpress.com/2022/03/Punjab-and-Haryana-HC-2.jpeg", "publishedAt": "2022-05-22T00:18:56Z", "content": "The Punjab and Haryana High Court have issued notice to the Chandigarh Administration over a petition filed by the residents of Shahpur Colony, Sector 38-A West, Chandigarh, seeking to quash the demo… [+685 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Three, including lawyer, fall prey to cyber crime", "description": "Police have registered three FIRs and started investigation.", "url": "https://indianexpress.com/article/cities/chandigarh/three-including-lawyer-fall-prey-to-cyber-crime-7929799/", "urlToImage": "https://images.indianexpress.com/2022/05/cyber-crime-2.jpg", "publishedAt": "2022-05-22T00:04:36Z", "content": "THREE PEOPLE including a practicing advocate and a woman fell prey to online fraudsters. Police said that Advocate Sukhbir Singh of Sector 38A received a call on about an update of his credit card of… [+1301 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Probe finds fraud in widow pension scheme in Panchkula", "description": "Officials said that most of the beneficiaries who are under the scanner are from Mauli, Jatwal, Raipurrani villages and from areas near Barwala.", "url": "https://indianexpress.com/article/cities/chandigarh/probe-finds-fraud-in-widow-pension-scheme-in-panchkula-7929796/", "urlToImage": "https://images.indianexpress.com/2019/10/pension-1200-1.jpg", "publishedAt": "2022-05-21T23:57:48Z", "content": "A probe by Panchkulas Social Welfare Department has found that at least 24 beneficiaries of Haryanas widow pension scheme have been withdrawing money fraudulently every month on the basis of fake dea… [+2391 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "FPIs net sellers in equities on Re fall, US rate hike prospects", "description": "Foreign investors sell Rs 35,137 crore of equities during May 2-20", "url": "https://indianexpress.com/article/business/economy/fpis-net-sellers-in-equities-on-re-fall-us-rate-hike-prospects-7929789/", "urlToImage": "https://images.indianexpress.com/2022/05/foreign-exchange-2-2.jpg", "publishedAt": "2022-05-21T23:47:33Z", "content": "The outflux of foreign funds from domestic equity markets continued steadily, with FPIs having pulled out more than Rs 35,000 crore so far this month, according to depositories data.The outflow by fo… [+2904 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Student dies by suicide, one booked", "description": "According to information, the victim, Raj Singh, was studying at a private college in Landran and was staying at the hostel there, where he allegedly died by suicide.", "url": "https://indianexpress.com/article/cities/sas-nagar-mohali/student-dies-by-suicide-one-booked-7929793/", "urlToImage": "https://images.indianexpress.com/2022/05/Indian-expressss-6.jpg", "publishedAt": "2022-05-21T23:46:43Z", "content": "Sohana police have booked an unidentified person for allegedly forcing a student of Bihar to die by suicide. The accused has not been arrested yet."}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mohali: Thousands of dairy farmers stage protest", "description": "Daljit Singh Sadarpura, President, Progressive Dairy Farmers Association (PDFA) last week had warned the Mann government of launching a campaign against them if their demands were not met.", "url": "https://indianexpress.com/article/cities/sas-nagar-mohali/mohali-thousands-of-dairy-farmers-stage-protest-7929791/", "urlToImage": "https://images.indianexpress.com/2022/05/Milk-protest-mohali.jpg", "publishedAt": "2022-05-21T23:32:09Z", "content": "Thousands of dairy farmers from all districts of Punjab today gathered at the Verka Milk Plant here and protested against the Bhagwant Mann government, demanding an increase in milk prices, on Saturd… [+2734 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "George Mathew", "title": "FY22: As Covid curbs ease, outward remittances up 55% to all-time high", "description": "Foreign exchange, including the US dollar and euro, taken out of the country by resident Indians has shot up by 54.60 per cent during the fiscal ended March 2022 as countries opened up and flight services resumed after the Covid-19 pandemic restricted the mov…", "url": "https://indianexpress.com/article/business/market/fy22-as-covid-curbs-ease-outward-remittances-up-55-to-all-time-high-7929776/", "urlToImage": "https://images.indianexpress.com/2022/05/RBi-1-2-2.jpg", "publishedAt": "2022-05-21T23:03:09Z", "content": "Foreign exchange, including the US dollar and euro, taken out of the country by resident Indians has shot up by 54.60 per cent during the fiscal ended March 2022 as countries opened up and flight ser… [+3025 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Will boycott meeting with CM, Speaker today if norms not followed: Adhikari", "description": "Earlier this week, state home secretary BP Gopalika sent a letter to Suvendu Adhikari, requesting him to attend the meeting.", "url": "https://indianexpress.com/article/cities/kolkata/will-boycott-meeting-with-cm-speaker-today-if-norms-not-followed-adhikari-7929786/", "urlToImage": "https://images.indianexpress.com/2022/03/Suvendu-Adhikari.jpg", "publishedAt": "2022-05-21T23:00:29Z", "content": "Leader of Opposition in the West Bengal Assembly Suvendu Adhikari on Saturday threatened to boycott the meeting scheduled to be attended by Chief Minister Mamata Banerjee and Speaker Biman Banerjee t… [+1785 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "TMC evicted people from Malda dist with help of Bihar Police: BJP", "description": "Locals alleged that last night some policemen claiming to be from Bihar entered the Sadlichak gram panchayat area and destroyed shanties. They also allegedly beat up some people.", "url": "https://indianexpress.com/article/cities/kolkata/tmc-evicted-people-from-malda-dist-with-help-of-bihar-police-bjp-7929783/", "urlToImage": "https://images.indianexpress.com/2022/04/SU.jpeg", "publishedAt": "2022-05-21T22:51:29Z", "content": "The BJP on Saturday alleged that the ruling Trinamool Congress (TMC) took the help of Bihar Police to evict some people from Malda district’s Harishchandrapur area after policemen from the neighbouri… [+1437 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Will challenge HC order: Alorani Sarkar", "description": "The single bench of Justice Bibek Chaudhuri on Friday said that Sarkar could not declare herself a citizen of this country as she had ner name on the voters' list in Bangladesh.", "url": "https://indianexpress.com/article/cities/kolkata/will-challenge-hc-order-alorani-sarkar-tmc-7929780/", "urlToImage": "https://images.indianexpress.com/2022/05/Sarkar.jpg", "publishedAt": "2022-05-21T22:44:56Z", "content": "Buy Now | Our best subscription plan now has a special price\r\nThe single bench of Justice Bibek Chaudhuri on Friday said that Sarkar could not declare herself a citizen of this country as she had ner… [+3137 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "P Chidambaram", "title": "Time for a re-set", "description": "P Chidambaram wirtes: We cannot depart from the path of an open, liberal and market-based economy. That would be suicidal. Yet, we must take stock and, considering the global and domestic developments, re-set our economic policies. That requires the courage, …", "url": "https://indianexpress.com/article/opinion/columns/p-chidambaram-writes-cannot-depart-from-the-path-of-an-open-liberal-and-market-based-economy-7929709/", "urlToImage": "https://images.indianexpress.com/2022/05/economy-2.jpg", "publishedAt": "2022-05-21T22:34:31Z", "content": "I can scarcely believe that 31 years have rolled by since the bugle was first sounded on a change of economic policy: devaluation of the rupee on July 1, 1991. It was a dramatic move, disruptive, and… [+5204 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shubhajit Roy", "title": "Modi-Biden talks beyond bilateral, will look at global issues: India", "description": "On whether the economic crisis in Sri Lanka would be part of the discussions at the Quad summit, Kwatra, without getting into specifics, said the leaders would discuss both opportunities and challenges in the Indo-Pacific region.", "url": "https://indianexpress.com/article/india/modi-biden-talks-beyond-bilateral-will-look-at-global-issues-india-7929744/", "urlToImage": "https://images.indianexpress.com/2022/05/Modi-Biden-1.jpg", "publishedAt": "2022-05-21T22:30:36Z", "content": "Announcing that Prime Minister Narendra Modi will be meeting US President Joe Biden on May 24 on the sidelines of the Quad leaders summit in Tokyo, India Saturday said that the Quad cooperation is an… [+3351 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Liz Mathew", "title": "Bangladesh minister urges India to protect minorities, says applies to all nations", "description": "Moni was addressing a session titled ‘India@2047’ at the India Ideas Conclave, organised by India Foundation, a think-tank working closely with BJP and RSS.", "url": "https://indianexpress.com/article/india/bangladesh-minister-urges-india-to-protect-minorities-says-applies-to-all-nations-7929759/", "urlToImage": "https://images.indianexpress.com/2022/05/dipumoni-2col.jpg", "publishedAt": "2022-05-21T22:30:21Z", "content": "Urging India to protect and guarantee fundamental rights of every citizen, Bangladesh Education Minister Dipu Moni on Saturday said that unbiased application of the provisions of the Constitution on … [+1239 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Vallabh Ozarkar", "title": "Away from rows, a piece of Aurangzeb history brought to light in Maharashtra", "description": "Bibi ka Maqbara had been constructed by the sixth Mughal Emperor in 1660, in the memory of his first wife and chief consort Dilras Banu Begum, as a replica of the Taj Mahal, which had been built by his father Shahjehan, for his wife.", "url": "https://indianexpress.com/article/cities/mumbai/piece-of-aurangzeb-history-brought-to-light-in-maharashtra-7929751/", "urlToImage": "https://images.indianexpress.com/2022/05/P1-anchor-3col.jpg", "publishedAt": "2022-05-21T22:30:14Z", "content": "FROM THE renewed row over the Gyanvapi Mosque in Varanasi built by him, to the disturbed quiet around his spare tomb near Aurangabad, Aurangzeb finds himself back at the heart of controversies. Howev… [+2344 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "‘My dream, my goal is to win an Olympic gold for my country: Nikhat Zareen", "description": "Nikhat started her boxing journey in earnest in 2009, won the youth world championship in 2011, fell in the quarters of the senior world championship in 2016, and has now won the gold.", "url": "https://indianexpress.com/article/idea-exchange/my-dream-my-goal-is-to-win-an-olympic-gold-for-my-country-nikhat-zareen-7929747/", "urlToImage": "https://images.indianexpress.com/2022/05/nikhat-2col.jpg", "publishedAt": "2022-05-21T22:29:25Z", "content": "WHEN NIKHAT Zareen was a young girl interested in boxing, she remembers people telling her father, Mohammad Jameel, why have you put her in boxing? Its a mens sport (mardon ka khel hai), who will mar… [+2933 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tavleen Singh", "title": "Evil under the sun", "description": "Tavleen Singh writes: The message to Muslims who chose India over Pakistan in 1947 is that they made a bad choice. They must now learn to accept that although they chose to remain Indian, they should now learn to live in India as lesser citizens.", "url": "https://indianexpress.com/article/opinion/columns/tavleen-singh-writes-evil-under-the-sun-gyanvapi-mosque-hindu-temples-modi-govt-7929662/", "urlToImage": "https://images.indianexpress.com/2022/05/Gyanvapi-MosqueNEWCOV1.jpg", "publishedAt": "2022-05-21T22:26:13Z", "content": "We do not need proof that the Gyanvapi Mosque is built on the ruins of a Hindu temple. Nor do we need proof that there is an Idgah built above the prison cell in which Krishna is said to have been bo… [+4893 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Maulshree Seth", "title": "In House’s tech makeover, senior MLAs let young take lead, Speaker says ‘flip tablet pages like a book’", "description": "As part of its efforts to go paperless, the state government has installed tablets on 416 seats in the Assembly under the National E-Vidhan Application project.", "url": "https://indianexpress.com/article/cities/lucknow/houses-tech-makeover-senior-mlas-young-speaker-flip-tablet-pages-book-7929779/", "urlToImage": "https://images.indianexpress.com/2022/05/yogi-4.jpg", "publishedAt": "2022-05-21T22:24:30Z", "content": "THEY MAY have taken many a young legislator under their wing but during a session organised in the Uttar Pradesh Assembly on Saturday to train House members in using the tablets installed on their se… [+3648 chars]"}]}