{"status": "ok", "totalResults": 299, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Kiran Parashar", "title": "After 5 deaths, officials admit filtration unit not cleaned for 5 years", "description": "The man who died on Friday was Janakaraj, a guest lecturer at a government engineering college. He was unmarried and had been taking care of his ailing 65-year-old mother.", "url": "https://indianexpress.com/article/india/after-5-deaths-officials-admit-filtration-unit-not-cleaned-for-5-years-7965233/", "urlToImage": "https://images.indianexpress.com/2022/06/death-5-2-1.jpg", "publishedAt": "2022-06-11T22:43:25Z", "content": "With the death of a 48-year-old man on Friday, the number of people who died after drinking contaminated water in Karnatakas Raichur has gone up to five. Officials have said that several wards in the… [+4093 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Liz Mathew, Shyamlal Yadav", "title": "Sunday Story: A new red line", "description": "A raucous TV debate and a string of tweets by two BJP spokespersons — normal grist to the Hindutva mill. But as their remarks on the Prophet spun out of control, the BJP faced its first blowback on its handling of minority issues. What followed was a swift cr…", "url": "https://indianexpress.com/article/india/sunday-story-red-line-bjp-modi-shah-jindal-nupur-prophet-remark-7963742/", "urlToImage": "https://images.indianexpress.com/2022/06/MODI-COVER-NEW1.jpg", "publishedAt": "2022-06-11T22:34:50Z", "content": "A FEW minutes before 11 pm on June 1, a senior BJP leader got an angry call from a senior colleague. What has this Naveen Jindal tweeted? Until then, the leader, who is part of the media unit, had no… [+15754 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manish Sahu", "title": "Bulldozers out in Saharanpur, Kanpur; UP cops say 255 held", "description": "", "url": "https://indianexpress.com/article/cities/lucknow/bulldozers-out-in-saharanpur-kanpur-up-cops-say-255-held/", "urlToImage": "https://indianexpress.com/wp-content/themes/indianexpress/images/IE-OGimage.jpg", "publishedAt": "2022-06-11T22:34:49Z", "content": ", JUNE 11A DAY after clashes broke out in Saharanpur amid protests over derogatory remarks against the Prophet by a former BJP spokesperson, the district administration on Saturday bulldozed illegal … [+3079 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manish Sahu", "title": "Bulldozers out in Saharanpur, Kanpur; UP cops say 255 held", "description": "Police claimed that the houses were constructed without approval of map by the authorities concerned.", "url": "https://indianexpress.com/article/cities/lucknow/bulldozers-out-in-saharanpur-kanpur-up-cops-say-255-held-7965259/", "urlToImage": "https://images.indianexpress.com/2022/06/ezgif.com-gif-maker1.jpg", "publishedAt": "2022-06-11T22:34:49Z", "content": "A DAY after clashes broke out in Saharanpur amid protests over derogatory remarks against the Prophet by a former BJP spokesperson, the district administration on Saturday bulldozed illegal construct… [+3088 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ENS Economic Bureau", "title": "Households see high prices over next 3 months; consumer confidence rises", "description": "Households’ median inflation perception has increased by 10 bps and 30 bps for three months and one year ahead periods, respectively, says the survey conducted among 3,036 households across the country.", "url": "https://indianexpress.com/article/business/households-see-high-prices-over-next-3-months-consumer-confidence-rises-7965166/", "urlToImage": "https://images.indianexpress.com/2022/06/RBI-Reserve-Bank-of-India-Reuters-1200-1.jpeg", "publishedAt": "2022-06-11T22:32:59Z", "content": "Inflation for the current period is expected to increase by 40 basis points (bps) to 10.1 per cent when compared to the March 2022 round of the survey, according to the Households Inflation Expectati… [+2839 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "MAYURA JANWALKAR", "title": "Hoping for more direct tax than expectations this fiscal; looking at crypto concerns: Chairperson, Central Board of Direct Taxes", "description": "Taking note of the concerns raised for the wordings of the taxation law for virtual digital assets, Singh said the Department is “looking at those concerns” and the intent of the soon-to-be-released guidelines is to explain the issue further.", "url": "https://indianexpress.com/article/business/economy/hoping-for-more-direct-tax-than-expectations-this-fiscal-looking-at-crypto-concerns-chairperson-central-board-of-direct-taxes/", "urlToImage": "https://images.indianexpress.com/2022/06/CBDT-Chief-3col.jpg", "publishedAt": "2022-06-11T22:19:22Z", "content": "Direct tax revenue trends are encouraging so far and the tax department is hoping to collect more than the Budget estimates, Central Board of Direct Taxes (CBDT) Chairperson Sangeeta Singh said in an… [+4608 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manoj Dattatrye More", "title": "Fadnavis dedicates RS victory to ailing Pune MLAs who travelled to Mumbai to cast votes", "description": "About Kasba Peth MLA Mukta Tilak, Fadnavis said,\"Mukta tai came to Mumbai a day in advance. She was admitted to a hospital, from where she came for voting and then again returned to the hospital. After that, she went home to Pune.\"", "url": "https://indianexpress.com/article/cities/pune/fadnavis-dedicates-rs-victory-to-ailing-pune-mlas-who-travelled-to-mumbai-to-cast-votes-7965256/", "urlToImage": "https://images.indianexpress.com/2022/06/June11-BOM-CelebrationBJP08-4col.jpg", "publishedAt": "2022-06-11T21:30:32Z", "content": "AFTER BEATING the Maha Vikas Aghadi for the sixth Rajya Sabha seat from the state, former chief minister and BJP leader Devendra Fadnavis on Saturday dedicated the party’s victory to the two ailing P… [+1902 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Parthasarathi Biswas", "title": "Maharashtra govt to set up electronic park in Ranjangaon industrial area", "description": "Subhash Desai, who inaugurated the Electronic Cluster Foundation of the Mahratta Chamber of Commerce Industries and Agriculture (MCCIA), said the electronic park will see the presence of all major electronic giants.", "url": "https://indianexpress.com/article/cities/pune/maharashtra-govt-to-set-up-electronic-park-in-ranjangaon-industrial-area-7965254/", "urlToImage": "https://images.indianexpress.com/2022/05/Subhash-Desai.jpg", "publishedAt": "2022-06-11T21:21:16Z", "content": "THE MAHARASHTRA government has decided to set up a world-class electronic park in Ranjangaon industrial area near Pune. Subhash Desai, minister for industries and mining, while speaking to The Indian… [+2062 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "One killed as Congress councillor’s son opens fire in presence of police", "description": "Charandeep Singh Babba, son of Congress councillor Dalbir Kaur from ward number 45, allegedly opened fire in the presence of police on 100 feet road during a clash between two groups over a land dispute.", "url": "https://indianexpress.com/article/cities/amritsar/one-killed-as-congress-councillors-son-opens-fire-in-presence-of-police-7965252/", "urlToImage": "https://images.indianexpress.com/2021/09/shot-dead.jpg", "publishedAt": "2022-06-11T21:16:17Z", "content": "One person was killed and another injured when a Congress councillor’s son allegedly opened fire in Amritsar on Saturday.Charandeep Singh Babba, son of Congress councillor Dalbir Kaur from ward numbe… [+639 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Govt must recognise sex work as a profession: Amruta Fadnavis", "description": "Speaking at an event organised in the red light area of Budhwar Peth, Fadnavis said, \"Like other professionals, prostitutes should also get respect and be able to live with dignity. The government must accept it as a profession.\"", "url": "https://indianexpress.com/article/cities/pune/govt-must-recognise-sex-work-as-a-profession-amruta-fadnavis-7965253/", "urlToImage": "https://images.indianexpress.com/2022/02/amruta22.png", "publishedAt": "2022-06-11T21:15:52Z", "content": "AMRUTA FADNAVIS, wife of former Chief Minister Devendra Fadnavis, on Saturday demanded that the government should recognise the profession of sex work and work towards the welfare of commercial sex w… [+971 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kamaldeep Singh Brar", "title": "Moosewala murder: No shooter arrested so far, no clarity on weapon used", "description": "Shooters had come in two cars and it is still not known how many shooters came. It is said that at least, six shooters were involved in the crime.", "url": "https://indianexpress.com/article/cities/amritsar/moosewala-murder-no-shooter-arrested-so-far-no-clarity-on-weapon-used-7965251/", "urlToImage": "https://images.indianexpress.com/2022/06/sidhu_moosewala-1200-1.jpg", "publishedAt": "2022-06-11T21:12:47Z", "content": "After 13 days of murder of Punjabi singer-turned-politician Shubdeep Singh Sidhu Moosewala, Punjab police have identified only four shooters so far and none has been arrested. Also, there is no clari… [+2227 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pune: Missing for a few days, two young men found dead in stone quarry", "description": "Police have identified the deceased as Vicky Lanke (20) and Sushant Badade (21), both residents of Vishrantwadi.", "url": "https://indianexpress.com/article/cities/pune/pune-missing-for-a-few-days-two-young-men-found-dead-in-stone-quarry-7965249/", "urlToImage": "https://images.indianexpress.com/2022/06/dead-4-1.jpg", "publishedAt": "2022-06-11T21:12:34Z", "content": "BODIES OF two young men, who had gone missing a few days ago, were fished out of a stone quarry in Dhanori area on Saturday.Police have identified the deceased as Vicky Lanke (20) and Sushant Badade … [+611 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Sangrur bypoll will be wake-up call for AAP, says Warring", "description": "Asserting that the AAP candidate could not be compared with the Congress's Dalvir Goldy, Warring said AAP did not field the CM’s sister as her defeat was certain.", "url": "https://indianexpress.com/article/cities/ludhiana/sangrur-bypoll-will-be-wake-up-call-for-aap-says-warring-7965248/", "urlToImage": "https://images.indianexpress.com/2022/04/Oct1-warring-1cols.jpeg", "publishedAt": "2022-06-11T21:09:54Z", "content": "Punjab Congress president Amarinder Singh Raja Warring Saturday said that the Sangrur parliamentary by-election will be a wake-up call for the ruling Aam Aadmi Party in the state that it cannot take … [+32 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anju Agnihotri Chaba", "title": "All’s not well in Jalandhar Diocese, Pope’s envoy told", "description": "This is what the Catholic Union, senior citizens and members of the Diocesan Pastoral Council (DPC) of the Diocese of Jalandhar told Vatican's representative to India Archbishop Leopoldo Girelli, who is on a three-day visit to Punjab.", "url": "https://indianexpress.com/article/cities/jalandhar/alls-not-well-in-jalandhar-diocese-popes-envoy-told-7965245/", "urlToImage": "https://images.indianexpress.com/2022/06/jalandhar.jpg", "publishedAt": "2022-06-11T21:06:02Z", "content": "All’s not well in the Diocese of Jalandhar. This is what the Catholic Union, senior citizens and members of the Diocesan Pastoral Council (DPC) of the Diocese of Jalandhar told Vatican’s representati… [+1140 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Prostitution racket busted in Pune", "description": "Acting on a tip-off, a team of the Social Security Cell of the Crime Branch raided the spa on June 9.  They nabbed six persons during the raid.", "url": "https://indianexpress.com/article/cities/pune/prostitution-racket-busted-in-pune-7965246/", "urlToImage": "https://images.indianexpress.com/2022/06/Pune-Police-2.jpg", "publishedAt": "2022-06-11T21:03:38Z", "content": "City police have busted a prostitution racket and arrested six persons following a raid at a spa in Koregaon Park recently. Four girls, who were lured into the racket at the spa, have been rescued. A… [+322 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Expelled BJP leader booked for remarks against Prophet", "description": "Zakir Shaikh, a resident of Mitha Nagar, has lodged the first information report (FIR) in this case at the Kondhwa police station on Friday.", "url": "https://indianexpress.com/article/cities/pune/expelled-bjp-leader-booked-for-remarks-against-prophet-7965244/", "urlToImage": "https://images.indianexpress.com/2022/06/Naveen-Kumar-Jindal.jpg", "publishedAt": "2022-06-11T20:59:22Z", "content": "PUNE CITY Police have booked expelled Bharatiya Janata Party leader Naveen Kumar Jindal for his objectionable remarks against Prophet Mohammed.Zakir Shaikh, a resident of Mitha Nagar, has lodged the … [+814 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "‘Panel to probe scam of handing over land to builders by Bajwa’", "description": "Addressing a press conference, Kuldeep Singh Dhaliwal alleged that former Rural Development Minister Bajwa had illegally allowed selling of panchayat land in Bhagtupura village in Amritsar district even though the model code of conduct was in force.", "url": "https://indianexpress.com/article/cities/amritsar/panel-to-probe-scam-of-handing-over-land-to-builders-by-bajwa-7965243/", "urlToImage": "https://images.indianexpress.com/2022/06/Indian-expressss-4.jpg", "publishedAt": "2022-06-11T20:57:49Z", "content": "Panchayat and Rural Development Minister Kuldeep Singh Dhaliwal on Saturday said that a three-member committee will probe into the alleged scam of handing over prime panchayat land to colonisers by f… [+51 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Give AAP a chance if you want your children to have bright future: Kejriwal", "description": "Addressing a gathering at the townhall in Hamirpur district, Kejriwal said the AAP government in Delhi has secured the future of 16 lakh students studying in over 1,100 government schools by making positive changes in the education system.", "url": "https://indianexpress.com/article/cities/shimla/give-aap-a-chance-if-you-want-your-children-to-have-bright-future-kejriwal-7965238/", "urlToImage": "https://images.indianexpress.com/2022/06/mann-2.jpg", "publishedAt": "2022-06-11T20:52:05Z", "content": "Delhi Chief Minister Arvind Kejriwal and his Punjab counterpart Bhagwant Mann on Saturday urged Himachal Pradesh voters to give the AAP a chance in the coming Assembly elections if they want their ch… [+936 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Omicron sub-variant BA.5 found in 37-yr-old from Pune", "description": "The man, who returned from England on May 21, is fully vaccinated. His sample was processed at the Indian Institute of Science Education and Research, Pune.", "url": "https://indianexpress.com/article/cities/pune/omicron-sub-variant-ba-5-found-in-37-yr-old-from-pune-7965206/", "urlToImage": "https://images.indianexpress.com/2022/04/VACCINE-27.jpg", "publishedAt": "2022-06-11T20:49:36Z", "content": "A 37-year-old man from Pune has been diagnosed with the BA.5 sub-variant of Omicron, according to a report on genomic sequencing from B J Medical College and Sassoon General Hospital. The man, who re… [+1098 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Will launch stir if govt doesn’t start buying maize, corn: Farm unions", "description": "The unions said that farmers were facing harassment at the hands of private players in mandis due to non-procurement of corn and maize by the government.", "url": "https://indianexpress.com/article/cities/jalandhar/will-launch-stir-if-govt-doesnt-start-buying-maize-corn-farm-unions-7965237/", "urlToImage": "https://images.indianexpress.com/2021/03/maize.jpg", "publishedAt": "2022-06-11T20:45:33Z", "content": "Around 22 farmer unions in a meeting on Saturday decided to hold protests in Punjab mandis from June 16 if the government doesn’t start procurement of maize and corn immediately as announced by Punja… [+1615 chars]"}]}