{"status": "ok", "totalResults": 601, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "CJI Ramana: 126 vacancies filled in under a year, 50 appointments soon", "description": "Speaking at the 39th Chief Justices’ Conference in Delhi on Friday, Chief Justice of India N V Ramana said that despite the Covid situation, the judiciary did its best to promote access to justice.", "url": "https://indianexpress.com/article/india/cji-ramana-judiciary-vacancies-7893467/", "urlToImage": "https://images.indianexpress.com/2022/04/CJI-Ramana.jpeg", "publishedAt": "2022-04-29T08:42:27Z", "content": "Chief Justice of India N V Ramana on Friday called upon chief justices of high courts that are still having number of vacancies, to forward the names for elevation at the earliest and said 50 vacanci… [+2594 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Bloomberg", "title": "Passenger trains in India make way for coal to stop power crisis", "description": "Coal reserves at India’s power plants have declined almost 17% since the start of this month and are barely a third of the required levels.", "url": "https://indianexpress.com/article/india/passenger-trains-in-india-make-way-for-coal-to-stop-power-crisis-7893457/", "urlToImage": "https://images.indianexpress.com/2022/04/coal-1-1.jpeg", "publishedAt": "2022-04-29T08:41:40Z", "content": "India has canceled some passenger trains to allow for faster movement of coal carriages as the nation scrambles to replenish depleting inventories at power plants in a bid to avoid a full-blown power… [+1965 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "March against pro-Khalistan elements: Tension in Patiala, police fire in air to avert clash", "description": "Nihangs, who first gathered at Dukh Niwaran Sahib gurdwara to counter the call for a march given by the Shiv Sena (Hindustan), marched towards the Kali Mata temple raising pro-Khalistan slogans, the police said.", "url": "https://indianexpress.com/article/cities/chandigarh/clash-pro-khalistan-elements-patiala-police-shiv-sena-nihangs-7893421/", "urlToImage": "https://images.indianexpress.com/2022/04/CLASH04.jpg", "publishedAt": "2022-04-29T08:39:26Z", "content": "Tension prevails in Punjabs Patiala after the police fired in the air while trying to avert a clash between members of the Shiv Sena (Hindustan), who had called a march against pro-Khalistani element… [+1529 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "India has world’s fastest growing start-up eco-system: PM Modi", "description": "Narendra Modi said India is set to lead the next technology revolution and investments are being made in developing capabilities in 5G among other things.", "url": "https://indianexpress.com/article/india/india-has-worlds-fastest-growing-start-up-eco-system-pm-modi-7893289/", "urlToImage": "https://images.indianexpress.com/2022/04/modi-7-1-1-1.jpg", "publishedAt": "2022-04-29T08:34:54Z", "content": "Prime Minister Narendra Modi on Friday said India is headed for a robust economy and the country’s consumption of semi-conductors is expected to cross USD 110 billion by 2030 and has the world’s fast… [+3145 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Top Gun Maverick first reactions: Tom Cruise-starrer ‘terrific’, ‘best film of the year’", "description": "Top Gun Maverick has Tom Cruise reprising the role of Pete \"Maverick\" Mitchell, a US Navy pilot in the original film who is now a flight instructor. Thus far, the film has won the love of critics.", "url": "https://indianexpress.com/article/entertainment/hollywood/top-gun-maverick-first-reactions-reviews-tom-cruise-best-film-of-year-7893111/", "urlToImage": "https://images.indianexpress.com/2022/04/top-gun-maverick-1200.jpg", "publishedAt": "2022-04-29T08:33:44Z", "content": "The first reactions to Tom Cruise-starrer Top Gun: Maverickare here. The much-awaited and also much-delayed (thanks to the Covid-19 pandemic) film is the sequel to 1986’s Top Gun and is directed by T… [+2186 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Darul Uloom Admissions 2022: Police verification mandatory before enrolment", "description": "Those seeking admission will have to submit their previous madrasa certificates, the mark sheets obtained from there and the Aadhaar cards of the applicants and their fathers including their mobile numbers.", "url": "https://indianexpress.com/article/education/darul-uloom-admission-police-verification-mandatory-before-enrolment-7893248/", "urlToImage": "https://images.indianexpress.com/2017/03/jameah_darul_uloom_deoband1200.jpg", "publishedAt": "2022-04-29T08:31:30Z", "content": "The Islamic educational institution, Darul Uloom Deoband has made this year’s admission process more stringent by making police verification of the documents submitted by the applicants mandatory, th… [+1506 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Rajasthan CM describes power outage in country as ‘national crisis’", "description": "Chief Minister Ashok Gehlot said that the demand for electricity has increased in 16 states due to the rising mercury levels and coal is not being supplied in accordance with the requirement, affecting the power supply.", "url": "https://indianexpress.com/article/cities/jaipur/rajasthan-cm-describes-power-outage-in-country-as-national-crisis-7893415/", "urlToImage": "https://images.indianexpress.com/2022/04/ashok-gehlot-1200.jpg", "publishedAt": "2022-04-29T08:28:32Z", "content": "Terming power outage a “national crisis”, Rajasthan Chief Minister Ashok Gehlot expressed concern on Friday over the shortage of coal supply in the country and the simultaneous increase in electricit… [+1153 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Realme GT Neo 3, Realme Pad Mini launched: Check price, specifications", "description": "Here is everything you need to know about the new Realme GT Neo 3 and Realme Pad Mini.", "url": "https://indianexpress.com/article/technology/mobile-tabs/realme-gt-neo-3-realme-pad-mini-launched-check-price-specifications-7893387/", "urlToImage": "https://images.indianexpress.com/2022/04/Realme-GT-neo-3.jpg", "publishedAt": "2022-04-29T08:27:47Z", "content": "Realme has just launched a few new devices in India, including the Realme GT Neo 3 and the Realme Pad Mini. Heres all you need to know about the new devices, including price, features and specificati… [+2157 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "When Kamal Haasan confessed that he was ‘losing faith in the institution of marriage’, Sarika opened up about being the ‘other woman’", "description": "Kamal Haasan and Sarika started their relationship when Kamal was still a married man. In a rare interview from 20 years ago, the couple spoke about the tough times they endured in those early days.", "url": "https://indianexpress.com/article/entertainment/tamil/when-kamal-haasan-losing-faith-in-marriage-sarika-being-the-other-woman-7893198/", "urlToImage": "https://images.indianexpress.com/2022/04/kamal-sarika-1200.jpg", "publishedAt": "2022-04-29T08:26:38Z", "content": "Kamal Haasan has been a celebrated actor since the start of his career but one of the biggest controversies that surrounded the actor in the 1980s was his affair with actor Sarika. Kamal was married … [+1976 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "MPBSE MP Board Class 10, 12 result declared; girls outperform boys this year", "description": "MP board result 2022: For class 12, the overall pass percentage was 72.72 per cent while class 10  pass percentage remained low, with slightly more than half of the students passing exams.", "url": "https://indianexpress.com/article/education/mpbse-mp-board-class-10-12-result-declared-2022-girls-outperform-boys-7893416/", "urlToImage": "https://images.indianexpress.com/2022/04/MP-Board-card-1.jpg", "publishedAt": "2022-04-29T08:25:06Z", "content": "The Madhya Pradesh Board of Secondary Education (MPBSE) has released the board exam results for Classes 10 and 12 today. In both the classes, girls out performed boys with a better pass percentage. F… [+1161 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Delhi has few days of coal supply left, warns Satyendar Jain as he appeals to Centre to ensure availability", "description": "This comes hours after the Delhi government said that electric supply to important establishments in the capital, including Metro trains and hospitals, may be interrupted because of a shortage in coal.", "url": "https://indianexpress.com/article/cities/delhi/delhi-coal-supply-shortage-satyendar-jain-7893347/", "urlToImage": "https://images.indianexpress.com/2022/04/coal-1.jpg", "publishedAt": "2022-04-29T08:10:38Z", "content": "Amid a deepening crisis in supply of coal, the Delhi government sounded an alarm saying that the government only has stocks left for the coming few days.Health Minister Satyendar Jain, via a tweet, s… [+1232 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Peru’s ruling party turns on Castillo; calls for president to step down in 2023", "description": "Castillo, a leftist former school teacher and union leader, has presided over unprecedented political instability since taking office last July, cycling through four separate cabinets and surviving two impeachment attempts in just nine months in office.", "url": "https://indianexpress.com/article/world/perus-ruling-party-turns-on-castillo-calls-for-president-to-step-down-in-2023-7893342/", "urlToImage": "https://images.indianexpress.com/2021/08/PERU.jpg", "publishedAt": "2022-04-29T08:01:48Z", "content": "Peruvian lawmakers from the ruling Peru Libre party on Thursday presented a bill to cut President Pedro Castillo’s presidential term from five to two years, with general elections set for 2023, an un… [+1772 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Prerna Mittra", "title": "‘Fad diets come and go; it is important to eat a balanced meal, exercise right, sleep tight’: Chef Kunal Kapur", "description": "\"Women must plan their meals in advance, eat small and frequent meals to boost energy levels, drink water, and snack right in the evenings,\" he said", "url": "https://indianexpress.com/article/lifestyle/food-wine/fad-diets-balanced-diet-exercise-healthy-foods-cooking-oil-pandemic-chef-kunal-kapur-women-health-breakfast-options-7876363/", "urlToImage": "https://images.indianexpress.com/2022/04/Chef-Kunal-Kapur-1200.jpg", "publishedAt": "2022-04-29T07:50:00Z", "content": "The pandemic has put the spotlight on health and nutrition like never before. It has made people pause and pay more attention to what they put on their plates. While it is a positive change to have c… [+4173 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pune Book Fair gets underway", "description": "Pune news: The Pune Book Fair is open to all from 11 a.m. to 7 p.m. till Sunday, May 1, 2022.", "url": "https://indianexpress.com/article/cities/pune/pune-book-fair-gets-underway-2-7893263/", "urlToImage": "https://images.indianexpress.com/2022/04/pune-book-fair-1.jpg", "publishedAt": "2022-04-29T07:46:47Z", "content": "The 19th edition of Pune Book Fair set up at Creaticity off Airport Road, Yerawada was inaugurated by renowned writer Ashok Kamat on Friday.Creative City Chief Executive Officer M Mahesh.P.N.R. Rajan… [+1408 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Bathinda: Late-night blaze kills bus conductor, reduces three buses to ashes", "description": "The cause of fire is unclear. The fire reportedly began from one bus at around 11 pm and within no time it had spread to three more buses parked alongside.", "url": "https://indianexpress.com/article/cities/bathinda/bathinda-bus-fire-dead-7893115/", "urlToImage": "https://images.indianexpress.com/2022/04/bus-1.jpg", "publishedAt": "2022-04-29T07:45:53Z", "content": "In a late-night blaze at Bhagta Bhaika bus stand in Bathinda district of Punjab, a conductor, who slept in a bus, was burnt to death. While three buses belonging to two firms were reduced to ashes, a… [+1604 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Taapsee Pannu’s Shabaash Mithu to release on July 15", "description": "Taapsee Pannu, who essays the role of Mithali Raj, shared the new release date of Shabaash Mithu movie in a post on Twitter.", "url": "https://indianexpress.com/article/entertainment/bollywood/taapsee-pannu-shabaash-mithu-to-release-on-july-15-7892945/", "urlToImage": "https://images.indianexpress.com/2022/04/Shabaash-Mithu-1200by667.jpeg", "publishedAt": "2022-04-29T07:45:17Z", "content": "Bollywood star Taapsee Pannu on Friday announced that her upcoming film Shabaash Mithu, a biopic on Indian cricketer Mithali Raj, will make its debut in theatres on July 15. Directed by filmmaker Sri… [+1489 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Johnson T A", "title": "Karnataka Police CID arrests Maharashtra businessman for sheltering key accused in sub-inspector recruitment exam scam", "description": "Suresh Katgaon was arrested Thursday night after investigators tracked down the key accused in the recruitment exam Divya Hagaragi, 41, the former president of the women's unit of the BJP in Kalaburagi district of Karnataka.", "url": "https://indianexpress.com/article/cities/bangalore/karnataka-police-cid-arrests-maharashtra-businessman-for-sheltering-key-accused-in-sub-inspector-recruitment-exam-scam-7893286/", "urlToImage": "https://images.indianexpress.com/2022/04/arrest-1-8-11.jpg", "publishedAt": "2022-04-29T07:45:06Z", "content": "The Criminal Investigation Department (CID) of the Karnataka Police arrested a prominent Maharashtra businessman Suresh Katgaon from Solapur on charges of sheltering a key accused in the police sub-i… [+5274 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Russia-Ukraine war: All eyes on Donbas battle, 10 injured in Kyiv missile attack, and more", "description": "Here are the key updates on the war and its impact across the world.", "url": "https://indianexpress.com/article/world/russia-ukraine-war-top-developments-april-29-7892760/", "urlToImage": "https://images.indianexpress.com/2022/04/Luhansk-ukraine1.jpg", "publishedAt": "2022-04-29T07:43:26Z", "content": "The “Battle of Donbas” remains Russias main strategic focus in Ukraine, Britain’s defence ministry said on Friday, but it has suffered significant losses for limited territorial gains.\r\nMoscow regard… [+3167 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Tamil Nadu passes resolution urging Centre to allow it to send aid to Sri Lanka", "description": "Speaking in the Tamil Nadu Assembly, M K Stalin said, \"Tamil Nadu would like to help by sending 40,000 tons of rice, 137 types of life-saving drugs and 500 tonnes of milk powder.\"", "url": "https://indianexpress.com/article/cities/chennai/tamil-nadu-assembly-stalin-centre-sri-lanka-relief-materials-resolution-7893150/", "urlToImage": "https://images.indianexpress.com/2022/04/Stalin-5.jpg", "publishedAt": "2022-04-29T07:40:42Z", "content": "The Tamil Nadu Assembly Friday unanimously passed a resolution urging the Centre to permit the state government to send essential commodities including rice, pulses, dairy products and medicines to S… [+2093 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "RR vs MI preview: Rajasthan aim to continue winning momentum against struggling Mumbai", "description": "After mustering just 144 runs in their last game against Royal Challengers Bangalore, the Royals would be hoping for an improvement from their batters.", "url": "https://indianexpress.com/article/sports/cricket/rajasthan-royals-aim-to-continue-winning-momentum-against-struggling-mumbai-indians-7893056/", "urlToImage": "https://images.indianexpress.com/2022/04/RR-2.jpg", "publishedAt": "2022-04-29T07:38:51Z", "content": "On a three-match winning streak, Rajasthan Royals have the momentum as well as a source of inspiration when they face bottom-placed and out-of-reckoning Mumbai Indians in an Indian Premier League mat… [+4037 chars]"}]}