{"status": "ok", "totalResults": 319, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Angelina Jolie makes surprise Ukraine visit, meets children", "description": "Angelina had come to speak with displaced people who have found refuge in Lviv, including children undergoing treatment for injuries sustained in the missile strike on the Kramatorsk railway station in early April.", "url": "https://indianexpress.com/article/entertainment/hollywood/angelina-jolie-makes-surprise-ukraine-visit-meets-children-photos-7895590/", "urlToImage": "https://images.indianexpress.com/2022/05/angelina-jolie-1200.jpeg", "publishedAt": "2022-05-01T02:49:33Z", "content": "Hollywood actress and U.N. humanitarian Angelina Jolie made a surprise visit to the western Ukrainian city of Lviv on Saturday, the Lviv regional governor said on Telegram.According to Maksym Kozytsk… [+1430 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Naomi Judd, of Grammy-winning duo The Judds, dies at 76", "description": "Naomi Judd died near Nashville, Tennessee, said a statement on behalf of her husband and fellow singer, Larry Strickland. It said no further details about her death would be released and asked for privacy as the family grieves.", "url": "https://indianexpress.com/article/entertainment/music/naomi-judd-of-the-judds-dies-at-76-7895584/", "urlToImage": "https://images.indianexpress.com/2022/05/naomi-1.jpeg", "publishedAt": "2022-05-01T02:42:32Z", "content": "Naomi Judd, whose family harmonies with daughter Wynonna turned them into the Grammy-winning country stars The Judds, has died. She was 76.Her daughters, Wynonna and Ashley, announced her death on Sa… [+5742 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rounak Bagchi, Sonal Gupta", "title": "Daily Briefing: PM Modi bats for local languages in courts; Parties got electoral bonds worth Rs 648.48 crore this April", "description": "Ravindra Jadeja has relinquished Chennai Super Kings captaincy, handing it back to MS Dhoni, following the team’s last IPL match, which they lost by 11 runs.", "url": "https://indianexpress.com/article/live-news/top-news-briefing-today-7895576/", "urlToImage": "https://images.indianexpress.com/2022/05/expressintro-1-1-1.jpg", "publishedAt": "2022-05-01T02:32:44Z", "content": "Prime Minister Modi bats for use of local languages in courts; Kashmir sees big jump in number of militants killed; the hottest summer in 122 years: here are the top stories from todays edition:\r\nBig… [+4206 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sourav Roy Barman", "title": "Mamata, Kejriwal signal a thaw, but TMC, AAP face long chill", "description": "In September 2021, when the TMC announced its plans to foray into the Goa Assembly polls, the equations between the two leaders started to change and get frosty.", "url": "https://indianexpress.com/article/india/political-pulse/mamata-kejriwal-signal-a-thaw-but-tmc-aap-face-long-chill-7895564/", "urlToImage": "https://images.indianexpress.com/2022/05/mamata-banerjee-and-arvind-kejriwal-12.jpg", "publishedAt": "2022-05-01T02:23:03Z", "content": "When West Bengal Chief Minister and Trinamool Congress (TMC) supremo Mamata Banerjee last visited the national capital in November 2021, what made a bigger news than the string of her interactions wi… [+4544 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "IPL 2022: Shami’s hug after Virat Kohli returns to form, Anushka Sharma’s celebration goes viral", "description": "Mohammed Shami congratulated Virat Kohli after the former RCB captain scored his first fifty of IPL 2022.", "url": "https://indianexpress.com/article/sports/ipl/virat-kohli-shami-hug-anushka-sharma-celebration-viral-7895206/", "urlToImage": "https://images.indianexpress.com/2022/04/ipl-2022-virat-kohli.jpg", "publishedAt": "2022-05-01T02:15:00Z", "content": "Virat Kohlis first half-century in 14 IPL games went in vain as the league-leading Gujarat Titans routed the Royal Challengers Bangalore by six wickets.Coming out of a prolonged slump in form, Kohli … [+1370 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Madras HC issues arrest warrant against two Income Tax officials", "description": "The officials who are to be produced before the court by the police are B L Meena, IRS, Principal Commissioner of Income Tax and B Lapila, Administrative Officer (Grade-III) of the Commissioner of Income Tax in Salem.", "url": "https://indianexpress.com/article/cities/chennai/madras-hc-issues-arrest-warrant-against-two-income-tax-officials-7895568/", "urlToImage": "https://images.indianexpress.com/2022/05/Madras-HC-2-3-1-1.jpg", "publishedAt": "2022-05-01T02:10:28Z", "content": "The Madras High Court has issued a non-bailable arrest warrant against two officers attached to the Income Tax department in Salem.The officials who are to be produced before the court by the police … [+1080 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Another electric scooter catches fire in Tamil Nadu, rider escapes unhurt", "description": "Earlier this month, a man died when the detachable battery of the electric scooter kept for charging exploded in his house in Telangana.", "url": "https://indianexpress.com/article/cities/chennai/another-electric-scooter-catches-fire-in-tamil-nadu-rider-escapes-unhurt-7895561/", "urlToImage": "https://images.indianexpress.com/2022/05/Pure-EV.jpeg", "publishedAt": "2022-05-01T02:02:34Z", "content": "An electric scooter caught fire in Hosur, an industrial hub in Tamil Nadu’s Krishnagiri district, on Saturday causing panic in the area.The owner, a supervisor at a private firm in Bengaluru, however… [+1735 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Thanjavur temple chariot electrocution: One-man panel begins inquiry", "description": "Tamil Nadu's Thanjavur Temple News: The panel would prepare a report on how the accident took place at Kalimedu and another one on how to avoid such incidents in future and would submit them both to the government.", "url": "https://indianexpress.com/article/cities/chennai/thanjavur-temple-chariot-electrocution-one-man-panel-begins-inquiry-7895548/", "urlToImage": "https://images.indianexpress.com/2022/05/Thanjavur-1.jpeg", "publishedAt": "2022-05-01T01:25:24Z", "content": "Chief Minister M K Stalin had ordered setting up of a one-man commission of inquiry led by Jayanth to look into the causes of the incident and make recommendations so that such events do not recur.\r\n… [+1308 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Madras High Court grants mother nature ‘living being’ status with rights and duties", "description": "The Madurai bench of the Madras High Court in its recent order placed immense importance on conserving nature", "url": "https://indianexpress.com/article/cities/chennai/madras-high-court-grants-mother-nature-living-being-status-with-rights-and-duties-7895543/", "urlToImage": "https://images.indianexpress.com/2022/05/Madras-HC-2-3-1.jpg", "publishedAt": "2022-05-01T01:20:01Z", "content": "The Madras High Court has invoked the “parens patriae jurisdiction” to declare Mother Nature as a Living Being with all corresponding rights, duties and liabilities of a living person, in order to pr… [+3238 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "NGT panel meets, begins work on report on new STP", "description": "The tribunal also directed for  constitution of the joint-committee, and sought a factual and action-taken report.", "url": "https://indianexpress.com/article/cities/ahmedabad/ngt-panel-meets-begins-work-on-report-on-new-stp-7895537/", "urlToImage": "https://images.indianexpress.com/2022/05/national-green-tribunal-1200.jpg", "publishedAt": "2022-05-01T01:04:27Z", "content": "A joint-committee constituted by the National Green Tribunal (NGT) held its first meeting on April 28 as it commenced work on a report sought by the tribunal last month on a new sewage treatment plan… [+1399 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Three children drown in Tapi river", "description": "According to police, the incident happened Friday evening when the three minors were playing on the banks of Tapi river got dragged towards the river due to high tide from the sea.", "url": "https://indianexpress.com/article/cities/surat/three-children-drown-in-tapi-river-7895535/", "urlToImage": "https://images.indianexpress.com/2022/05/Gujarat-tapi-1.webp_.jpg", "publishedAt": "2022-05-01T01:00:08Z", "content": "Three children drowned in Tapi river in Surat when they were playing on the river banks, police said Saturday.According to police, the incident happened Friday evening when the three minors were play… [+512 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sohini Ghosh", "title": "Sabarmati pollution: Ahmedabad civic body differs in submissions to HC, NGT", "description": "While AMC submitted before the Gujarat HC on April 22 that it did not have the details of the number of stormwater drain outfalls for the entire stretch of the river, adding that it would find out the same and put it on the court’s records soon", "url": "https://indianexpress.com/article/cities/ahmedabad/sabarmati-pollution-ahmedabad-civic-body-differs-in-submissions-to-hc-ngt-7895533/", "urlToImage": "https://images.indianexpress.com/2022/05/Gujarat-HC-1.jpg", "publishedAt": "2022-05-01T00:54:57Z", "content": "The Ahmedabad Municipal Corporation (AMC) has made different submissions to the National Green Tribunal (NGT) and Gujarat High Court with respect to its knowledge of stormwater drains flowing into Sa… [+3945 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sandip Roy", "title": "A touch of the vintage, a taste of the modern: making new memories in familiar old Shillong", "description": "A writer in search of the nostalgic pineapple soufflé of his childhood in the Meghalayan capital returns with local lore and fresh food memories instead", "url": "https://indianexpress.com/article/express-sunday-eye/shillong-vintage-modern-memories-travel-cherry-blossoms-northeast-7894407/", "urlToImage": "https://images.indianexpress.com/2022/04/shillong_getty_eye_1200.jpg", "publishedAt": "2022-05-01T00:50:32Z", "content": "I had had it as a little boy at the grand old Pinewood Hotel. It was served inside a whole pineapple that had been hollowed out and, in my memory, it was divinely airy and delicious, like a cloud of … [+4989 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Stephen Alter", "title": "How books keep us company on armchair travel and physical journeys", "description": "In uncertain times, travelling into the well-worn pages of old favourites can be as rewarding — and unexpected — as sojourns into destinations old and new", "url": "https://indianexpress.com/article/express-sunday-eye/how-books-keep-us-company-on-armchair-travel-and-physical-journeys-7893942/", "urlToImage": "https://images.indianexpress.com/2022/04/GettyImages-1385137142.jpg", "publishedAt": "2022-05-01T00:40:56Z", "content": "Every book is a journey. This cliché has never been more apparent for me than it was during the recent and, hopefully, receding pandemic. Over the past two years, while most of the world was in lockd… [+5050 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kamaal Saiyed", "title": "Gujarat police most successful in busting drug rackets: Sanghavi", "description": "The home minister urged Gujarat residents to work together to make the state more safe and sound.", "url": "https://indianexpress.com/article/cities/surat/gujarat-police-most-successful-in-busting-drug-rackets-sanghavi-7895531/", "urlToImage": "https://images.indianexpress.com/2022/05/police-1-3.jpg", "publishedAt": "2022-05-01T00:25:41Z", "content": "The success rate of Gujarat police is highest in the country when it comes to busting big rackets of drugs, said state Home Minister Harsh Sanghavi in Surat Saturday. The state cops have done a treme… [+1661 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Lehripura Gate slab collapse: Mayor warns ASI of criminal prosecution if gate not restored", "description": "Some parts of the then derelict structure had fallen in 2013-14. The VMC had then safeguarded the structure to avoid casualty during traffic movement and approached the ASI for repairs.", "url": "https://indianexpress.com/article/cities/baroda/lehripura-gate-slab-collapse-mayor-warns-asi-of-criminal-prosecution-if-gate-not-restored-7895511/", "urlToImage": "https://images.indianexpress.com/2022/05/slab.jpeg", "publishedAt": "2022-05-01T00:18:51Z", "content": "Seven months after a major slab of the pre-Mughal historic Lehripura Gate in Vadodara came crashing down, Mayor Keyur Rokadia on Saturday issued a notice to the Archaeological Survey of India (ASI), … [+2857 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Peter Vidal", "title": "Weekly Horoscope, May 1, 2022 – May 7, 2022: Libra, Aries, Pisces and other signs — check astrological prediction", "description": "Leo, you'll be brimming over with sensible ideas for improving your domestic situation this week, although, in some strange way, anything that happens is strangely linked to professional affairs. Aquarius, friendly arrangements will bring practical gains assu…", "url": "https://indianexpress.com/article/horoscope/weekly-horoscope-may-1-2022-may-7-2022-libra-aries-pisces-and-other-signs-7895524/", "urlToImage": "https://images.indianexpress.com/2022/02/GettyImages-Pisces-zodiac-1200.jpg", "publishedAt": "2022-05-01T00:08:27Z", "content": "ARIES (Mar 21 – Apr. 20)If you’ve been sitting on the fence and generally prevaricating, seize an overdue chance to settle a personal matter. Helpful movements by Saturn will counteract Mercury’s obs… [+3722 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Trinamool MLA’s PA, 2 aides held for duping people of Rs 16 cr: Cops", "description": "Earlier, several alleged victims had written to TMC general secretary Abhishek Banerjee in this regard, it is learnt. The complainants are from Palashipara, Tehatta and Karimpur assembly constituencies. They wanted their money back since they got no job.", "url": "https://indianexpress.com/article/cities/kolkata/trinamool-mlas-pa-2-aides-held-for-duping-people-of-rs-16-cr-cops-7895518/", "urlToImage": "https://images.indianexpress.com/2022/04/indian-express-crime-1-2.jpg", "publishedAt": "2022-05-01T00:03:20Z", "content": "Trinamool Congress (TMC) MLA Tapas Saha’s personal assistant and two of his accomplices were arrested for allegedly duping people of Rs 16 crore by promising them jobs, police said.Saha, who is MLA f… [+969 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Oppn slams CM, Kolkata Police over ‘fabrication of court order’", "description": "ED officials, in their FIR registered on April 20 with the Delhi Police, have claimed that a court order was tampered with in a bid to make its Joint Director Kapil Raj provide a voice sample without his consent.", "url": "https://indianexpress.com/article/cities/kolkata/oppn-slams-cm-kolkata-police-over-fabrication-of-court-order-7895517/", "urlToImage": "https://images.indianexpress.com/2022/04/SU.jpeg", "publishedAt": "2022-04-30T23:52:50Z", "content": "Leader of Opposition in the state Assembly Suvendu Adhikari on Saturday slammed Chief Minister Mamata Banerjee and the police administration following the reports that the Enforcement Directorate (ED… [+1867 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "BJP MP Arjun Singh called to Delhi day after his letter to CM", "description": "The development comes in the backdrop of Singh relentlessly “targeting” the Centre for allegedly neglecting the jute industry's interest in West Bengal.", "url": "https://indianexpress.com/article/cities/kolkata/bjp-mp-arjun-singh-called-to-delhi-day-after-his-letter-to-cm-7895516/", "urlToImage": "https://images.indianexpress.com/2022/04/WB-Arjunn-2col.jpg", "publishedAt": "2022-04-30T23:49:53Z", "content": "A day after he wrote a letter to Chief Minister Mamata Banerjee, seeking her intervention in the raw jute price capping issue, BJP MP Arjun Singh was on Saturday called to Delhi.The development comes… [+1903 chars]"}]}