{"status": "ok", "totalResults": 647, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Anonna Dutt", "title": "‘No evidence to show going to school increases Covid-19 risk’: Experts back Delhi govt decision", "description": "Experts believe that after two years of the pandemic, which forced institutions to stop physical classes, schools must not be closed “even if the number of cases goes up”.", "url": "https://indianexpress.com/article/lifestyle/health/delhi-children-covid-19-surge-risk-school-experts-7882422/", "urlToImage": "https://images.indianexpress.com/2022/04/delhi-schools-1.jpg", "publishedAt": "2022-04-22T12:12:14Z", "content": "Thermal screening at the gate, asking whether students or their family members have symptoms while taking roll call, and discouraging children from sharing lunch. These are among the strict protocols… [+3091 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sreenivas Janyala", "title": "Telangana: Man stabs MCA student for rejecting his advances, governor condemns attack", "description": "The student of Kakatiya University sustained injuries on her neck following Friday's attack, the police said. Condemning the incident, the governor said the society must take steps against the increasing number of crimes against women.", "url": "https://indianexpress.com/article/cities/hyderabad/telangana-man-stabs-mca-student-for-rejecting-his-advances-governor-condemns-attack-7882414/", "urlToImage": "https://images.indianexpress.com/2022/04/governor.jpg", "publishedAt": "2022-04-22T12:04:09Z", "content": "Telangana Governor Tamilisai Soundararajan on Friday expressed her deep anguish over the attack on a woman by a youth who claimed to be in love with her at Narsampet in the states Warangal district.T… [+1242 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Did Palak Tiwari take a dig at Shweta Tiwari’s ex-husband Abhinav Kohli for not providing for son?: ‘If anyone else was earning accordingly…’", "description": "Palak Tiwari said that she hopes to provide for her family one day, so that her 'single mother' Shweta Tiwari doesn't have bear the brunt of this responsibility herself.", "url": "https://indianexpress.com/article/entertainment/television/did-palak-tiwari-take-a-dig-at-shweta-tiwari-ex-husband-abhinav-kohli-7882369/", "urlToImage": "https://images.indianexpress.com/2022/04/palak-tiwari-shweta-tiwari.jpg", "publishedAt": "2022-04-22T12:00:47Z", "content": "Palak Tiwari said that her goal in life is to be able to provide for her family, because she wants to unburden her mother, Shweta Tiwari, from the responsibility of being the sole bread-winner of the… [+1973 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Style alert: Mrunal Thakur dazzles in blingy ensemble for Jersey screening", "description": "True to her style, the 29-year-old kept her accessories minimal -- just a pair of silver hoops, and black pumps", "url": "https://indianexpress.com/article/lifestyle/fashion/mrunal-thakur-ralph-lauren-ensemble-jersey-movie-screening-fashion-7881976/", "urlToImage": "https://images.indianexpress.com/2022/04/Mrunal-Thakur-1200-1.jpg", "publishedAt": "2022-04-22T12:00:17Z", "content": "Mrunal Thakur, who is currently receiving accolades for her impactful performance in her latest release Jersey, is a veritable fashionista with a distinct sense of style. She never fails to experimen… [+1412 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Encroachment made by Khargone riot-accused won’t be razed without due legal process: MP govt to HC", "description": "The state government made the submission in the high court on Thursday at a time when opposition parties, especially Congress, was raised question marks over the BJP government's anti-encroachment drive in Khargone.", "url": "https://indianexpress.com/article/india/encroachment-khargone-riot-accused-wont-razed-without-due-legal-process-madhya-pradesh-govt-hc-7882387/", "urlToImage": "https://images.indianexpress.com/2022/04/KHARGONE-1-1.jpg", "publishedAt": "2022-04-22T11:58:21Z", "content": "The Shivraj Singh Chouhan government has told the Indore bench of the Madhya Pradesh High Court that the alleged encroachment made by an accused in the Khargone riots case shall not be removed withou… [+2136 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sreenivas Janyala", "title": "In a first in India, Hyderabad hospital performs new cervical cancer procedure", "description": "The American Oncology Institute (AOI) at Hyderabad announced that the radiation oncology team successfully conducted the procedures under the guidance of Dr Sushil Beriwal, a Fellow of the American Society of Radiation Oncology and American Brachytherapy Soci…", "url": "https://indianexpress.com/article/cities/hyderabad/hyderabad-aoi-new-cervical-cancer-procedure-7882365/", "urlToImage": "https://images.indianexpress.com/2022/02/GettyImages-surgery.jpg", "publishedAt": "2022-04-22T11:57:30Z", "content": "The American Oncology Institute (AOI) at Hyderabad recently performed Indias first hybrid interstitial brachytherapy procedure using Varians Aarhus Applicator at its Citizens Specialty Hospital.Docto… [+2065 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manoj C G", "title": "Party to party, Prashant Kishor, the man in a hurry", "description": "Prashant Kishor a.k.a PK has covered a long distance in Indian politics in the last eight years. But unpredictability, or rather inconsistency, driven by ambition has been his hallmark", "url": "https://indianexpress.com/article/india/political-pulse/prashant-kishor-profile-political-strategy-congress-ipac-7882391/", "urlToImage": "https://images.indianexpress.com/2022/04/prashant-Kishor-1200-1.jpg", "publishedAt": "2022-04-22T11:56:48Z", "content": "From playing a key role in Narendra Modi’s prime ministerial campaign in the 2014 Lok Sabha elections, to taking a political plunge four years later by joining the JD(U) and leaving it in a huff, to … [+4263 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kanchan Vasdev", "title": "Punjab farmers borrow five times more than counterparts in Maharashtra, four times more than those in UP: Study", "description": "The study revealed that in all the three states together, more than 40 per cent of the “very highly” distressed surveyed farmers did not receive any farm loan waiver (FLW) benefits.", "url": "https://indianexpress.com/article/india/punjab-farmers-borrow-five-times-more-counterparts-maharashtra-four-times-more-those-up-study-7882388/", "urlToImage": "https://images.indianexpress.com/2022/04/farming.jpeg", "publishedAt": "2022-04-22T11:54:52Z", "content": "An average farmer of Punjab borrows four times the amount than his counterparts in Uttar Pradesh (UP) and over five times his counterparts in Maharashtra, showed a study conducted by the National Ban… [+10710 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Goutham VS", "title": "Antakshari Movie review: An ominous investigative thriller that resorts to usual climax formula", "description": "Antakshari is a slow burn that takes a path distinctly different from what we have seen in Malayalam investigative thrillers of late.", "url": "https://indianexpress.com/article/entertainment/malayalam/antakshari-movie-review-an-ominous-investigative-thriller-that-resorts-to-usual-climax-formula-7881737/", "urlToImage": "https://images.indianexpress.com/2022/04/antakshari.jpeg", "publishedAt": "2022-04-22T11:54:43Z", "content": "Child abuse, animal torture, caste conflicts, rape, serial killings, a psychopath, a Royal Enfield bullet, and a game of Antakshari — these very discordant elements come together successfully in the … [+2413 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sreenivas Janyala", "title": "Explained: What is GO 111, the order to protect Hyderabad’s Osman Sagar and Himayat Sagar, that has now been lifted", "description": "The GO 111 order, issued by the government of erstwhile (undivided) Andhra Pradesh on March 8, 1996, prohibited the setting up of industries, residential colonies, hotels, etc in the catchment area of the Osman Sagar and Himayat Sagar lakes up to a radius of …", "url": "https://indianexpress.com/article/explained/go-111-order-to-protect-hyderabad-osman-sagar-himayat-sagar-lifted-7882177/", "urlToImage": "https://images.indianexpress.com/2022/04/Osman-sagar.jpg", "publishedAt": "2022-04-22T11:50:53Z", "content": "Environmentalists and activists are criticising the Telangana government for withdrawing an over 25-year-old government order protecting the historic Osman Sagar and Himayat Sagar reservoirs in Hyder… [+3692 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Person with other jobs can be provisionally enrolled with Bar Council for 6 months: SC", "description": "The top court said that BCI may allow provision enrolment for persons in other employments giving them a window of six months for them to decide after clearing the AIBE, whether they want to continue with advocacy or continue in their job.", "url": "https://indianexpress.com/article/jobs/person-other-jobs-provisionally-enrolled-with-bar-council-for-6-months-sc-7882376/", "urlToImage": "https://images.indianexpress.com/2022/03/supreme-court-3-1-1.jpg", "publishedAt": "2022-04-22T11:49:10Z", "content": "The Supreme Court Thursday said that a person engaged in other professions can be allowed to provisionally enroll with a bar council but has to clear the All India Bar Examination (AIBE) and upon cle… [+4604 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "IPL 2022, DC vs RR Live Score Updates: Covid hits Delhi camp before Rajasthan battle", "description": "IPL 2022 DC vs RR Live Cricket Score Streaming Online Today Match, Star Sports 1 Hindi, Hotstar IPL Live: Delhi Capitals vs Rajasthan Royals takes place in Mumbai.", "url": "https://indianexpress.com/article/sports/ipl/ipl-2022-dc-vs-rr-live-score-online-updates-7882219/", "urlToImage": "https://images.indianexpress.com/2022/04/dc-vs-rr-live.jpg", "publishedAt": "2022-04-22T11:45:51Z", "content": "IPL 2022, DC vs RR Live Cricket Score Streaming Online Today Match Updates: Here are the two squads\r\nDelhi Capitals Squad: Prithvi Shaw, David Warner, Rishabh Pant(w/c), Rovman Powell, Sarfaraz Khan,… [+813 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Sri Lanka’s inflation surges to 21.5% in March", "description": "Sri Lanka's nation-wide inflation for March 2022 under the National Consumer Price Index (NCPI) surged to 21.5 per cent from 17.5 per cent reported in February 2022.", "url": "https://indianexpress.com/article/world/inflation-surges-to-21-5-per-cent-in-march-2022-in-sri-lanka-7882256/", "urlToImage": "https://images.indianexpress.com/2022/04/sri-lanka3-1.jpg", "publishedAt": "2022-04-22T11:43:29Z", "content": "Debt-ridden Sri Lanka’s inflation soared to 21.5 per cent, according to official data released on Friday, even as finance minister Ali Sabry met IMF officials in Washington to negotiate a bailout pac… [+2052 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Benita Fernando", "title": "Why Bridgerton Season 2, despite its many shortcomings, is a satisfying slow burn", "description": "The period drama is replete with anachronisms, misplaced portrayal of the colonised and confused cultural references, but by casting two dark Dravidian female British-Tamil actors in leading roles, the Netflix show has done a better job than mainstream Tamil …", "url": "https://indianexpress.com/article/express-sunday-eye/bridgerton-season-2-shortcomings-satisfying-slow-burn-netflix-representational-tamil-culture-7882105/", "urlToImage": "https://images.indianexpress.com/2022/04/Eye-BRIDGERTON_season-2-1200.jpg", "publishedAt": "2022-04-22T11:40:45Z", "content": "Theres a perfectly admissible explanation for the Kate Sharma-Appa-Bon-Didi problem. Perhaps, Kates mother was Tamil, and Appa is Kates way of honouring her roots. Perhaps, she calls Edwina bon (the … [+7800 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Bengaluru: BBMP issues ID cards to manual scavengers in bid to rehabilitate them", "description": "Over 1,400 manual scavengers identified in a survey will get ID cards and become eligible for various welfare programmes, including student fee reimbursement, housing, skill training, etc.", "url": "https://indianexpress.com/article/cities/bangalore/bengaluru-bbmp-id-cards-manual-scavengers-7882366/", "urlToImage": "https://images.indianexpress.com/2019/03/manual-scavenger-12.jpg", "publishedAt": "2022-04-22T11:36:37Z", "content": "Complying with the Centres directive, manual scavengers within the limits of the Bruhat Bengaluru Mahanagara Palike (BBMP) are being issued identity cards. On Thursday, BBMP chief commissioner Gaurav… [+1552 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Fixed Deposit (FD) Interest Rates 2022: These banks offer the best interest rates, check here", "description": "Best Fixed Deposit (FD) Interest Rates of All Banks 2022: Here are the fixed deposit (FD) interest rates from the top four banks in India. Read below to find out the best interest rates.", "url": "https://indianexpress.com/article/business/banking-and-finance/1-year-banks-fixed-deposits-fds-interest-rate-state-bank-of-india-sbi-hdfc-bank-punjab-national-bank-pnb-icici-bank-7881342/", "urlToImage": "https://images.indianexpress.com/2022/04/rupee-pixabay-1200-2.jpg", "publishedAt": "2022-04-22T11:35:16Z", "content": "Fixed Deposit (FD) Interest Rates 2022:Fixed deposits (FDs) are one of the most popular financial instruments which are used by many of us for savings. Many people in the country continue to bank on … [+2042 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Yoga class attended by 114 nationalities in Qatar breaks world record", "description": "The achievement was dedicated to celebrate Qatar’s diverse community, and to the upcoming FIFA World Cup Qatar 2022.", "url": "https://indianexpress.com/article/lifestyle/fitness/guinness-world-record-114-nationalities-yoga-lesson-qatar-7879616/", "urlToImage": "https://images.indianexpress.com/2022/04/yoga_1200_qatar_embassy-twitter.jpg", "publishedAt": "2022-04-22T11:30:14Z", "content": "Yoga is known all around the world for its numerous health benefits — both, physical and mental. And the latest Guinness World Records is proof that its global appeal continues to only increase. The … [+2560 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Need to make India’s educational institutions world-class to regain old reputation: Vice President Naidu", "description": "Stressing on linking higher education with new opportunities, he said we are living in a rapidly changing technological era and we should make our university curriculum relevant to the modern contexts.", "url": "https://indianexpress.com/article/education/need-to-make-indias-educational-institutions-world-class-to-regain-old-reputation-vice-president-7882325/", "urlToImage": "https://images.indianexpress.com/2021/12/venkaiah-naidu-1200.jpg", "publishedAt": "2022-04-22T11:29:27Z", "content": "Vice President M Venkaiah Naidu on Thursday emphasised the need to make educational institutions world class and promote research and innovation to restore India’s old reputation.Addressing the third… [+1623 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuradha Mascarenhas", "title": "Pune’s Tarini Moghe among 18 winners of Ayush Master Chef competition", "description": "The All India Institute of Ayurveda , New Delhi had announced a pan-India Ayush Master Chef Competition on March 31 this year 2022.", "url": "https://indianexpress.com/article/cities/gandhinagar/punes-tarini-moghe-among-18-winners-of-ayush-master-chef-competition-7882112/", "urlToImage": "https://images.indianexpress.com/2022/04/Master-chef-pune-1.jpg", "publishedAt": "2022-04-22T11:29:27Z", "content": "Tarini Moghe, a first-year masters student in Ayurveda from D Y Patil College, Pimpri, Pune was among the 18 winners of the pan-India Ayush Master Chef competition that was held at the Global Ayush I… [+3546 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "IPL 2022: Looking forward to the battle against Shimron Hetmyer and R Ashwin, says Axar Patel", "description": "Delhi Capitals will lock horns with Rajasthan Royals at Wankhede on Friday.", "url": "https://indianexpress.com/article/sports/ipl/ipl-2022-looking-forward-to-the-battle-against-shimron-hetmyer-and-r-ashwin-says-axar-patel-7882307/", "urlToImage": "https://images.indianexpress.com/2022/04/Axar-Patel.jpg", "publishedAt": "2022-04-22T11:26:09Z", "content": "Delhi Capitals will be looking to put their best foot forward to stay afloat when they face Rajasthan Royals at the iconic Wankhede Stadium in Mumbai on Friday.The covid-19 hit Capitals has bounced b… [+2579 chars]"}]}