{"status": "ok", "totalResults": 773, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Kiccha Sudeep reacts to KGF 2 being called a pan-India film made in Kannada: ‘Hindi is no more a national language…’", "description": "At the film launch of 'R': The Deadliest Gangster Ever, Kannada star Kiccha Sudeep entered the debate about Hindi being a national language and said that south directors are making films that have a global presence.", "url": "https://indianexpress.com/article/entertainment/regional/kiccha-sudeep-kgf-2-pan-india-film-bollywood-hindi-national-language-7884478/", "urlToImage": "https://images.indianexpress.com/2022/04/Kicchasudeep1200.jpg", "publishedAt": "2022-04-24T04:20:55Z", "content": "At the film launch of ‘R’: The Deadliest Gangster Ever, Kannada actor Kiccha Sudeep entered the debate of Hindi being termed as a national language and said that south directors are making films that… [+2232 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Serie A: Inter beat AS Roma 3-1 on miserable return for Jose Mourinho", "description": "Denzel Dumfries, Marcelo Brozovic and Lautaro Martínez scored for Inter and Henrikh Mkhitaryan netted a late consolation on Saturday.", "url": "https://indianexpress.com/article/sports/football/serie-a-inter-beat-as-roma-3-1-on-miserable-return-for-jose-mourinho-7884526/", "urlToImage": "https://images.indianexpress.com/2022/04/Lautaro-Martinez.jpg", "publishedAt": "2022-04-24T04:17:30Z", "content": "Defending champion Inter Milan gave a signal of intent as it crushed Roma 3-1 to move on top of Serie A on a miserable return to San Siro for former coach José Mourinho.Denzel Dumfries, Marcelo Brozo… [+2732 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "George Mathew", "title": "Explained: Why has Reliance called off Future Retail takeover proposal?", "description": "Some leading banks were not in favour of the proposal stating there’s ambiguity on debt recovery. “If top banks are opposing the sale to RIL, the deal is likely to fall through. The next option is to take the IBC route,” said a banking source.", "url": "https://indianexpress.com/article/explained/explained-reliance-future-retail-takeover-7884476/", "urlToImage": "https://images.indianexpress.com/2022/04/Reliance.jpeg", "publishedAt": "2022-04-24T04:17:19Z", "content": "Virtually calling off the proposal to buy Future Retails assets, Reliance Industries Ltd (RIL) on Saturday said the takeover proposal cant be implemented as secured creditors rejected the RIL plan.On… [+3537 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "EU Takes Aim at Social Media’s Harms With Landmark New Law", "description": "The law, called the Digital Services Act, is intended to address social media’s societal harms by requiring companies to more aggressively police their platforms for illicit content or risk billions of dollars in fines.", "url": "https://indianexpress.com/article/technology/tech-news-technology/eu-takes-aim-at-social-medias-harms-with-landmark-new-law-7884525/", "urlToImage": "https://images.indianexpress.com/2022/04/European-union-DSA-law.jpg", "publishedAt": "2022-04-24T04:15:13Z", "content": "The European Union on Saturday reached a deal on landmark legislation that would force Facebook, YouTube and other internet services to combat misinformation, disclose how their services amplify divi… [+2390 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Bag with explosives, detonator found near Burail Jail, Army team called in", "description": "The bomb disposal squad of the Indian Army reached the spot from nearby Western Command, Chandimandir, later rushed to the spot to try and defuse the explosive, even as a high alert was sounded and the area was cordoned off.", "url": "https://indianexpress.com/article/cities/chandigarh/bag-with-explosives-detonator-found-near-burail-jail-army-team-called-in-7884511/", "urlToImage": "https://images.indianexpress.com/2022/04/Jail-4col.jpg", "publishedAt": "2022-04-24T04:11:50Z", "content": "A bag containing an explosive device was found abandoned near the rear boundary wall of high security Model Burail Jail in Chandigarh on Saturday night, sending security establishments in a tizzy and… [+2599 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Was forced to buy M F Husain painting from Priyanka Gandhi, paid Rs 2 crore: Rana Kapoor in ED chargesheet", "description": "Stating that he had paid a cheque of Rs 2 crore, Kapoor claimed that \"Milind Deora (son of the late Murli Deora and former Congress MP) later conveyed to him confidentially that the sale proceeds were utilised by the Gandhi family for the medical treatment of…", "url": "https://indianexpress.com/article/india/was-forced-to-buy-m-f-husain-painting-from-priyanka-gandhi-paid-rs-2-cr-rana-kapoor-in-ed-chargesheet-7884523/", "urlToImage": "https://images.indianexpress.com/2021/09/rana-kapoor-3-1.jpg", "publishedAt": "2022-04-24T04:09:37Z", "content": "Yes Bank co-founder Rana Kapoor has told the Enforcement Directorate that he was “forced” to buy an M F Husain painting from Congress’ Priyanka Gandhi Vadra and the sale proceeds were utilised by the… [+5670 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Nitin Sharma", "title": "Behind Gundappa’s magic wrist, a Pataudi trick: ‘exercise with buckets full of water’", "description": "From talking about his early days in cricket to his favourite knocks, the 73-year-old cricketer, who scored 6080 runs in Test cricket for India including 14 centuries in 91 Test matches, spoke on a range of cricketing stories.", "url": "https://indianexpress.com/article/cities/chandigarh/gundappa-magic-wrist-pataudi-trick-cricket-7884519/", "urlToImage": "https://images.indianexpress.com/2022/04/WhatsApp-Image-2022-04-24-at-9.28.41-AM.jpg", "publishedAt": "2022-04-24T04:06:11Z", "content": "Former Indian captain Gundappa Vishwanath remains one of the most accomplished batsman in world cricket and the former Indian batsman enthralled cricket fans all over the world with his wrist work wi… [+3584 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Copa del Rey: Real Betis beat Valencia 5-4 on penalties in final", "description": "It was Betis' third Copa del Rey title, ending a 17-year wait for a major title for the Seville-based side.", "url": "https://indianexpress.com/article/sports/football/copa-del-rey-real-betis-beat-valencia-5-4-on-penalties-in-final-7884399/", "urlToImage": "https://images.indianexpress.com/2022/04/Real-Betis.jpg", "publishedAt": "2022-04-24T04:05:29Z", "content": "Real Betis beat Valencia 5-4 on penalties to win the Copa del Rey after teenager Yunus Musah missed the only spot kick in the shootout that finished early on Sunday.The United States midfielder, who … [+2057 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Delhi News Live: Five booked for Jahangirpuri violence sent to police custody; capital sees 1,094 new Covid-19 cases", "description": "Delhi News: There were around 1,000 cases recorded in Delhi over the last four days and the positivity rate has also remained between 4.6 and 4.8 per cent", "url": "https://indianexpress.com/article/cities/delhi/delhi-news-live-updates-covid-19-jahangirpuri-violence-weather-traffic-7884480/", "urlToImage": "https://images.indianexpress.com/2022/04/WhatsApp-Image-2022-04-16-at-10.32.20-PM-1-1.jpeg", "publishedAt": "2022-04-24T04:05:03Z", "content": "AAP MLA Atishi led the protest at Sriniwaspuri (File Photo)\r\nAAP claims Centre planning to demolish temple, BJP says rumourThe Aam Aadmi Party Saturday protested at Delhis Sriniwaspuri against what i… [+714 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Alec Baldwin’s lawyer says state’s Rust shooting probe clears actor", "description": "In response to New Mexico's Occupational Health and Safety Bureau's findings, Alec Baldwin's attorneys said in a statement that his authority on the production was limited to approving script changes and creative casting and that he had no authority over matt…", "url": "https://indianexpress.com/article/entertainment/hollywood/alec-baldwin-lawyer-says-states-rust-shooting-probe-clears-actor-7884504/", "urlToImage": "https://images.indianexpress.com/2022/04/alec-baldwin-1200.jpg", "publishedAt": "2022-04-24T04:01:18Z", "content": "A lawyer for Alec Baldwinsaid on Thursday that an investigation by New Mexico has cleared his client of wrongdoing in the fatal shooting on the set of Rust, pointing out that its report stated the ac… [+2186 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Navjeevan Gopal", "title": "After Opp backlash, Punjab Police takes a U-turn, lets ‘jugad rehris’ run for now", "description": "In a fresh order,  Punjab ADGP (Traffic) AS Rai asked district police chiefs to take no action against “jugad rehri” owners till further order.", "url": "https://indianexpress.com/article/chandigarh/after-opp-backlash-punjab-police-takes-a-u-turn-lets-jugad-rehris-run-for-now-7884491/", "urlToImage": "https://images.indianexpress.com/2022/01/police-759-1-1.jpg", "publishedAt": "2022-04-24T03:53:51Z", "content": "The Punjab Police on Saturday evening suspended its drive against the jugad rehris (innovative carts) made up of old motorbikes. This comes after a backlash from the Opposition political parties for … [+3083 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Nandagopal Rajan", "title": "Urbanista Los Angeles headphones review: Give me more devices that don’t need to be charged", "description": "The Urbanista Los Angeles are self-charging wireless headphones that don’t need you to figure out when to charge them or for how long. The headphones use Powerfoyle solar cell material on the top band to convert all forms of light into energy.", "url": "https://indianexpress.com/article/technology/tech-reviews/urbanista-los-angeles-headphones-review-give-me-more-devices-that-dont-need-to-be-charged-7884479/", "urlToImage": "https://images.indianexpress.com/2022/04/Urbanista-los-angeles-review-featured.jpg", "publishedAt": "2022-04-24T03:51:44Z", "content": "Over the years I have had many favourite headphones and earphones, and many more that I loved but could never own. However good the headphone might be, the chances are it is out of charge when you ar… [+4135 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Sunday Zodiac: Some negative traits each sign needs to work on", "description": "Leo's ego and selfish attitude is something they need to work on, says astrologer Pandit Jagannath Guruji; check out what he says about other signs", "url": "https://indianexpress.com/article/lifestyle/life-style/sunday-zodiac-signs-negative-personality-traits-7865704/", "urlToImage": "https://images.indianexpress.com/2021/07/sunday-zodiac_200_getty.jpg", "publishedAt": "2022-04-24T03:40:47Z", "content": "All of us have something negative in us and these issues can be a major hindrance in our lives. So, if you want to identify and work on them, scroll down to read what renowned Bengaluru-based astrolo… [+2299 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Blast heard in Jammu village ahead of PM Modi’s visit to Union Territory", "description": "Laliyana village is nearly 8-km away from Palli in the Samba district where PM Modi will visit on Sunday.", "url": "https://indianexpress.com/article/india/blast-heard-in-jammu-village-ahead-of-pm-modis-visit-to-union-territory-7884484/", "urlToImage": "https://images.indianexpress.com/2022/04/Jammu.jpg", "publishedAt": "2022-04-24T03:34:56Z", "content": "A powerful explosion was heard early Sunday in a village in Jammus Bishnah hours ahead of Prime Minister Narendra Modis visit to the Union Territory, the police said. Laliyana village is nearly 8-km … [+402 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "When Amitabh Bachchan ran to meet Dr Rajkumar, touched his feet: ‘I love you a lot’", "description": "Actor Dayanand had recalled an instant that demonstrates Rajkumar's child-like quality. He remembered the meeting between Annavru and Amitabh Bachchan, who was then shooting for director KV Raju's movie Indrajeet in Karnataka.", "url": "https://indianexpress.com/article/entertainment/regional/when-amitabh-bachchan-ran-to-meet-dr-rajkumar-touched-his-feet-7882519/", "urlToImage": "https://images.indianexpress.com/2022/04/rajkumar-1200.jpg", "publishedAt": "2022-04-24T03:28:48Z", "content": "If movie icon Dr Rajkumar were alive today, he would have been 93. Born as Singanalluru Puttaswamayya Muthuraju on April 24, 1929, he became a household name as Rajkumar. He has an indisputable place… [+2283 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Hrithik Roshan transforms into Vedha in new photo: ‘Calm over chaos’", "description": "Hrithik Roshan shared a new look from his upcoming noir-thriller Vikram Vedha, where he plays the role of Vedha.", "url": "https://indianexpress.com/article/entertainment/bollywood/hrithik-roshan-vikram-vedha-new-look-photo-7884448/", "urlToImage": "https://images.indianexpress.com/2022/04/hrithik1200-1.jpg", "publishedAt": "2022-04-24T03:20:36Z", "content": "Actor Hrithik Roshan treated fans to a new look from his upcoming film Vikram Vedha. On Saturday, he shared a photo where he is staring into the mirror, mentioning that he is ‘channeling’ Vedha. The … [+1555 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "WHO says at least one child has died after increase of acute hepatitis cases in children", "description": "The WHO issued the figures as health authorities around the world investigate a mysterious increase in severe cases of hepatitis - inflammation of the liver – in young children.", "url": "https://indianexpress.com/article/world/who-acute-hepatitis-children-7884474/", "urlToImage": "https://images.indianexpress.com/2022/04/kids.jpeg", "publishedAt": "2022-04-24T03:17:05Z", "content": "The World Health Organization said on Saturday that at least one child death had been reported following an increase of acute hepatitis of unknown origin in children, and that at least 169 cases had … [+1359 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Seven people found from missing Japan ship, coast guard says", "description": "A coast guard official told Reuters the condition of the three people was unclear but public broadcaster NHK reported they were unconscious.", "url": "https://indianexpress.com/article/world/japan-missing-ship-seven-people-missing-7884469/", "urlToImage": "https://images.indianexpress.com/2022/04/ship-1.jpg", "publishedAt": "2022-04-24T03:09:22Z", "content": "Seven people from the Japanese tour boat that went missing with 26 people on board have been found, after three more were found on Sunday, Japan’s coast guard said, although it was unclear if they we… [+1244 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aksheev Thakur", "title": "Lakes of Bengaluru: Resident bodies press authorities to pull up socks before monsoon to save Kothanur Lake from getting polluted", "description": "The local residents fear that the entry of sewage to the lake, if not stopped, would contaminate the water body.", "url": "https://indianexpress.com/article/cities/bangalore/lakes-bengaluru-bodies-press-authorities-monsoon-kothanur-lake-7884206/", "urlToImage": "https://images.indianexpress.com/2022/04/Kothanur-Lake-featured-1.jpg", "publishedAt": "2022-04-24T03:00:53Z", "content": "Rejuvenated lakes having poor water quality due to the inflow of sewage has always been one of the major concerns of the citizens of Bengaluru. Earlier this month dead fishes were found floating at t… [+4886 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Macron or Le Pen: France faces stark choice for president", "description": "A surprise Le Pen victory cannot entirely be ruled out, given the high numbers of voters who were undecided or not sure if they would vote at all in the runoff presidential vote.", "url": "https://indianexpress.com/article/world/macron-or-le-pen-france-faces-stark-choice-for-president-7884431/", "urlToImage": "https://images.indianexpress.com/2022/04/Le-Pen-Macron.jpg", "publishedAt": "2022-04-24T02:51:32Z", "content": "The French vote on Sunday in an election that will decide whether pro-European Union, centrist President Emmanuel Macron keeps his job or is unseated by far-right eurosceptic Marine Le Pen in what wo… [+3818 chars]"}]}