{"status": "ok", "totalResults": 544, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Elina Svitolina wants better mental health protection for juniors", "description": "Svitolina dealt with things differently back in her junior days, and perhaps more resiliently.", "url": "https://indianexpress.com/article/sports/tennis/elina-svitolina-wants-better-mental-health-protection-for-juniors-7912897/", "urlToImage": "https://images.indianexpress.com/2022/05/Elina-Svitolina.jpg", "publishedAt": "2022-05-12T06:40:30Z", "content": "Elina Svitolina can vividly recall her struggles as an anxious young player on the international tennis circuit and is now campaigning for better mental health protection for juniors starting out in … [+3838 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Android 13 beta 2 announced at I/O 2022: Here’s what’s new", "description": "Check out what is new with Android 13 beta 2 and which devices can try out the beta build.", "url": "https://indianexpress.com/article/technology/tech-news-technology/android-13-beta-2-announced-at-i-o-2022-heres-whats-new-7912881/", "urlToImage": "https://images.indianexpress.com/2022/05/Android-13.jpg", "publishedAt": "2022-05-12T06:36:36Z", "content": "Google announced Android 13 Beta 2 during its I/O 2022 developer conference keynote last night. Android 13 Beta 2 which will soon begin rolling out to eligible Pixel devices, brings some more Materia… [+1496 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "SC refuses interim relief in plea challenging LIC IPO; issues notice", "description": "The Supreme Court on Thursday refused to grant interim relief to a matter related to LIC IPO and issued notice to Centre on petitions challenging the constitutional validity of provisions of certain sections of Finance Act, 2021 and LIC Act 1956.", "url": "https://indianexpress.com/article/business/market/supreme-court-sc-refuses-interim-relief-to-lic-ipo-issues-notice-to-centre-7912903/", "urlToImage": "https://images.indianexpress.com/2022/05/LIC-IPO-REUTERS-1200.jpg", "publishedAt": "2022-05-12T06:31:36Z", "content": "The Supreme Court on Thursday refused to grant interim relief to a matter related to LIC IPO and issued notice to the Centre on petitions challenging the constitutional validity of provisions of cert… [+551 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Deutsche Welle", "title": "Europe’s first samurai museum opens in Berlin", "description": "As a new museum on the samurai opens in Berlin, here are five facts about how the legendary warriors and political elite shaped the history of Japan for centuries", "url": "https://indianexpress.com/article/lifestyle/art-and-culture/europes-first-samurai-museum-opens-in-berlin-7911340/", "urlToImage": "https://images.indianexpress.com/2022/05/Samurai_DW.jpg", "publishedAt": "2022-05-12T06:30:31Z", "content": "The Japanese samurai are considered to be masters of swordsmanship and brave, fearless fighters. The myth surrounding the warriors still fascinates today. Both in Hollywood and in video games, feudal… [+4738 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuj Bhatia", "title": "I tried Asus’ Zenbook 14X OLED Space Edition, and it’s one of the coolest laptops in ages", "description": "There is a joy in owning a device that has a nostalgic appeal - and the ZenBook 14X OLED Space Edition is the one.", "url": "https://indianexpress.com/article/technology/tech-reviews/asus-zenbook-14x-oled-space-edition-review-7912794/", "urlToImage": "https://images.indianexpress.com/2022/05/81-1.jpg", "publishedAt": "2022-05-12T06:30:01Z", "content": "When legendary fashion designer Karl Lagerfeld, the creative director of the French fashion house Chanel, was alive, his shows used to have themes that transported audiences to a different world. For… [+7906 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Elections in Pak will only be held after introduction of poll reforms: Zardari", "description": "Zardari, a senior political leader who played a key role in the vote of no-confidence motion moved by the opposition parties last month against former premier Imran Khan, said elections would be held once the incumbent coalition government completes both task…", "url": "https://indianexpress.com/article/world/elections-pakistan-poll-recordms-asif-zardari-7912889/", "urlToImage": "https://images.indianexpress.com/2016/06/zardari_1200.jpg", "publishedAt": "2022-05-12T06:24:48Z", "content": "The co-chairman of the Pakistan Peoples Party (PPP), Asif Zardari, has made it clear that elections in the country will only be held after poll reforms are introduced and the National Accountability … [+1281 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Burial sites found at 53 Native American boarding schools, US government says", "description": "Until Wednesday, the US government had yet to provide any true accounting of the legacy of the schools, which used education to change culture so tribal land could be taken. Families were forced to send their children to the schools.", "url": "https://indianexpress.com/article/world/burial-sites-found-at-53-native-american-boarding-schools-us-government-says-7912877/", "urlToImage": "https://images.indianexpress.com/2022/05/Native-americans.jpg", "publishedAt": "2022-05-12T06:22:50Z", "content": "A US government investigation into the dark history of Native American boarding schools has found “marked or unmarked burial sites” at 53 of them, Interior Secretary Deb Haaland said on Wednesday.Haa… [+4892 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Bloomberg", "title": "Where Sri Lanka’s inflation-driven crisis could head next", "description": "To remove a President in Sri Lanka, a resolution must be passed by two-thirds of parliament, then it must be investigated by the Supreme Court, and then if judges agree with the findings lawmakers need to vote again.", "url": "https://indianexpress.com/article/world/where-sri-lankas-inflation-driven-crisis-could-head-next-7912887/", "urlToImage": "https://images.indianexpress.com/2022/04/1-331.jpg", "publishedAt": "2022-05-12T06:22:04Z", "content": "Sri Lankan President Gotabaya Rajapaksa has defied calls to resign, pledging instead to form a new government after violent clashes this week left eight people dead in an escalation of a monthslong c… [+6530 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Ukraine to hold first war crimes trial of captured Russian", "description": "Ukraine's top prosecutor says the country plans to hold its first war crimes trial of a captured Russian soldier", "url": "https://indianexpress.com/article/world/ukraine-to-hold-first-war-crimes-trial-of-captured-russian-7912866/", "urlToImage": "https://images.indianexpress.com/2022/05/bucha-1200.jpg", "publishedAt": "2022-05-12T06:21:46Z", "content": "Ukraine’s top prosecutor disclosed plans Wednesday for the first war crimes trial of a captured Russian soldier, as fighting raged in the east and south and the Kremlin left open the possibility of a… [+8163 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Elizabeth Olsen reveals playing Wanda in MCU made her lose roles in other movies: ‘I started to feel frustrated’", "description": "For Elizabeth Olsen, who initially made her mark in independent films, the success of Doctor Strange in the Multiverse of Madness is the equivalent of turning a comic-book page to find yourself the subject of a massive splash panel. During a video call last w…", "url": "https://indianexpress.com/article/entertainment/hollywood/elizabeth-olsen-reveals-playing-wanda-in-mcu-made-her-lose-other-roles-7912854/", "urlToImage": "https://images.indianexpress.com/2022/05/elizabeth-olsen-1200.jpg", "publishedAt": "2022-05-12T06:19:46Z", "content": "Written by Kyle Buchanan\r\nElizabeth Olsen is used to waiting in the wings. When she was an acting student at New York University, she landed an understudy role in the Broadway play Impressionism, sta… [+11163 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Virat Kohli sketches his idea of freedom with Anushka Sharma and Vamika: ‘Three of us, and a house in the hills…’", "description": "Virat Kohli sketched his idea of freedom, which featured a life in the hills with his wife and actor Anushka Sharma, and their daughter Vamika.", "url": "https://indianexpress.com/article/entertainment/bollywood/virat-kohlis-idea-of-freedom-is-to-live-a-peaceful-life-with-anushka-sharma-and-daughter-vamika-a-house-somewhere-in-the-hills-a-stream-flowing-7912631/", "urlToImage": "https://images.indianexpress.com/2022/01/Virushka1200-1.jpg", "publishedAt": "2022-05-12T06:19:29Z", "content": "Actor Anushka Sharmaand her husband, cricketer Virat Kohli are considered one of India’s power couples. Their photos and mellowed social media PDA never fails to bring joy to fans. Recently, Virat se… [+2303 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Japan has long sought more inflation and a weak yen. But not like this.", "description": "While overall inflation remains moderate, food and energy costs are rising rapidly, an outgrowth not of increased demand, but of market turmoil related to the pandemic and Russia’s invasion of Ukraine. And the yen has hit a two-decade low against the dollar, …", "url": "https://indianexpress.com/article/business/world-market/japan-has-long-sought-more-inflation-and-a-weak-yen-but-not-like-this-7912855/", "urlToImage": "https://images.indianexpress.com/2022/05/japan-yen-market-AP-1200.jpg", "publishedAt": "2022-05-12T06:11:02Z", "content": "For years, as Japan tried to boost its chronically weak economic growth, it pursued what its central bank saw as a magic formula: stronger inflation and a weaker yen.\r\nIt did not quite work as intend… [+7902 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "BTS: Jimin’s solo demo track doesn’t make it to Proof album CD 3, ARMY fumes at ‘unfair treatment’", "description": "BTS ARMY expressed concern over the seemingly increased exclusion and limitation of Jimin from many of BTS's upcoming career opportunities.", "url": "https://indianexpress.com/article/entertainment/music/bts-jimins-solo-demo-track-proof-army-7912702/", "urlToImage": "https://images.indianexpress.com/2022/04/Jimin1200.jpg", "publishedAt": "2022-05-12T06:10:14Z", "content": "While the excitement regarding BTS’ new album has reached a feverish peak, many fans are taking up cudgels on Jimin’sbehalf as they argue that he has barely been included in the album, as compared to… [+2354 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sanskriti Falor", "title": "Explained: Who is John Lee, Hong Kong’s new Chief Executive?", "description": "John Lee has been elected the leader of Hong Kong after winning an election held through a closed voting system. What was different about this election? Who is Lee, and what does his win mean for Hong Kong?", "url": "https://indianexpress.com/article/explained/hong-kong-elections-chief-executive-john-lee-7912659/", "urlToImage": "https://images.indianexpress.com/2022/05/Hong-Kong-main.jpg", "publishedAt": "2022-05-12T06:10:10Z", "content": "John Lee was on Sunday (May 8) elected the leader of Hong Kong after winning an election held through a closed voting system. Lee, who was the only candidate running for the position, replaced Carrie… [+5242 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "‘Wow, surprise guest’: IFS officer meets leopard outside rest house, reminds him of Ruskin Bond’s story", "description": "The leopard was spotted outside a rest house in Katarniaghat Wildlife Sanctuary in the Terai of the Bahraich district.", "url": "https://indianexpress.com/article/trending/trending-in-india/ifs-officer-meets-leopard-katarniaghat-7912749/", "urlToImage": "https://images.indianexpress.com/2022/05/leopard-forest-rest-house.jpg", "publishedAt": "2022-05-12T06:10:02Z", "content": "For most parts, serving as a forest officer can be a good mix of daunting and thrilling experiences. An IFS officer in Uttar Pradesh was recently greeted by a leopard as he returned home at night. As… [+2882 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Hong Kong police bail Catholic cardinal arrested on national security charge", "description": "Local police said in a statement that the national security department of the police force had arrested two men and two women, ranging from 45 to 90 years old for \"collusion with foreign forces\" on Tuesday and Wednesday.", "url": "https://indianexpress.com/article/world/hong-kong-police-bail-catholic-cardinal-arrested-on-national-security-charge-7912860/", "urlToImage": "https://images.indianexpress.com/2022/05/Joseph-.jpg", "publishedAt": "2022-05-12T06:03:31Z", "content": "Cardinal Joseph Zen, one of the most senior Catholic clerics in Asia, and three others who helped run a now-disbanded Hong Kong fund for protesters were arrested on charges of “collusion with foreign… [+3607 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Bitcoin is increasingly acting like just another tech stock", "description": "Since the start of this year, bitcoin's price movement has closely mirrored that of the Nasdaq, a bench mark that’s heavily weighted toward technology stocks, according to an analysis by the data firm Arcane Research.", "url": "https://indianexpress.com/article/technology/tech-news-technology/bitcoin-is-increasingly-acting-like-just-another-tech-stock-7912814/", "urlToImage": "https://images.indianexpress.com/2022/05/Bitcoin-Pixabay.jpg", "publishedAt": "2022-05-12T06:03:07Z", "content": "Written by: David Yaffe-Bellany\r\nBitcoin was conceived more than a decade ago as digital gold, a long-term store of value that would resist broader economic trends and provide a hedge against inflati… [+5233 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi: Man stalks, molests 13-yr-old, thrashed by her parents, locals", "description": "Police have identified the accused as Irfan Khan (37), an accountant who is married and has three children. Based on the girl’s complaint, a case was registered against Khan under stalking charges and sections of the POCSO Act. Khan was sent to judicial custo…", "url": "https://indianexpress.com/article/cities/delhi/delhi-man-stalks-molests-13-year-old-parents-locals-7912848/", "urlToImage": "https://images.indianexpress.com/2022/05/Indian-Express-logo-13-4-3-4.jpeg", "publishedAt": "2022-05-12T06:02:20Z", "content": "A middle-aged man was assaulted in broad daylight in a Delhi locality after he allegedly molested a 13-year-old girl, who was on her way to her tuition class. The man, who was thrashed by a group of … [+896 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Malavika Mohanan’s Italy vacation will make you want to visit this country", "description": "If her pictures are making you want to take advantage of the relaxed Covid restrictions and stroll through the streets of Rome and gaze at the Colosseum, you should know that Italy is one of the best countries to explore in the summer", "url": "https://indianexpress.com/article/lifestyle/destination-of-the-week/malavika-mohanan-vacation-italy-will-experience-country-summer-tour-guide-7880587/", "urlToImage": "https://images.indianexpress.com/2022/04/278664824_967821497332221_6913407846943660610_n.jpg", "publishedAt": "2022-05-12T06:00:26Z", "content": "Actor Malavika Mohanan recently vacationed in one of the most beautiful summer holiday destinations in the world — Italy. She took to Instagram to share some glimpses from her trip as she toured the … [+2066 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Australia’s #MeToo puts miners and ministers in crosshairs of history", "description": "Political commentators say a national furore over workplace harassment and discrimination has been a major cause of a decline in support for Prime Minister Scott Morrison's government among women.", "url": "https://indianexpress.com/article/world/australia-metoo-mining-industry-sexual-harassment-7912836/", "urlToImage": "https://images.indianexpress.com/2022/05/metoo-2859980_1280.jpg", "publishedAt": "2022-05-12T06:00:02Z", "content": "Australia’s mighty #MeToo wave is piling pressure on mining and political leaders who are preparing to face a reckoning over sexual harassment scandals stretching from the arid Outback to Parliament … [+8408 chars]"}]}