{"status": "ok", "totalResults": 674, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Goutham VS", "title": "Jack N Jill movie review: This Santhosh Sivan, Manju Warrier film is shambolic", "description": "Jack N Jill movie review: Jack N Jill, which was projected as a sci-fi comedy, is neither scientifically convincing nor humorous.", "url": "https://indianexpress.com/article/entertainment/malayalam/jack-n-jill-movie-review-this-santhosh-sivan-manju-warrier-film-is-shambolic-7927845/", "urlToImage": "https://images.indianexpress.com/2022/05/jack-n-jill-review-1200.jpg", "publishedAt": "2022-05-20T10:43:15Z", "content": "Besides being a cinematographer who has elevated the visual language of Indian cinema, Santhosh Sivan has also established himself as a credible filmmaker. Malayalam cinegoers have experienced his am… [+2679 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Mumbai: Gang of 5 honeytrap businessman, 2 arrested; hunt on for woman, 2 others", "description": "The incident took place on May 17 at 6.30 pm at a hotel near the Sahar airport in Mumbai. The 47-year-old businessman, a Kandivali resident, had booked the room for a day.", "url": "https://indianexpress.com/article/cities/mumbai/mumbai-gang-of-5-honeytrap-businessman-2-arrested-hunt-on-for-woman-2-others-7927847/", "urlToImage": "https://images.indianexpress.com/2022/05/arrest-4-1.jpg", "publishedAt": "2022-05-20T10:40:33Z", "content": "The Sahar police arrested two men of a gang of five persons, which also has a woman, who tried to honeytrap a businessman at a five star hotel by making the woman get intimate with him and later dema… [+1392 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi: Six-year old brain dead girl becomes youngest organ donor at AIIMS", "description": "Delhi NCR news: “She’s the youngest girl in Delhi-NCR and at AIIMS whose organs we have transplanted. There is a huge waiting list for children and many children die waiting for transplants,\" Dr Deepak Gupta, Professor of Neurosurgery and in-charge of organ p…", "url": "https://indianexpress.com/article/cities/delhi/noida-six-year-old-brain-dead-girl-becomes-youngest-organ-donor-aiims-7927811/", "urlToImage": "https://images.indianexpress.com/2022/05/rolly-prajapati-organ-donor.jpg", "publishedAt": "2022-05-20T10:31:44Z", "content": "The family members of Rolly Prajapati, a six-year-old girl from Noida who died due to a gunshot wound on April 27, donated her organs, making her the youngest such donor at the All India Institute of… [+1497 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "‘Was hard and I did not act fast enough’: Sameera Reddy on dealing with postpartum stress", "description": "\"I couldn’t feel happy however hard I tried after the birth of my first child. I still reflect on these moments and it only drives me harder to reach out to anyone not feeling good about themselves,\" said Sameera Reddy", "url": "https://indianexpress.com/article/lifestyle/health/postpartum-stress-depression-sameera-reddy-new-mothers-mental-health-awareness-month-7927280/", "urlToImage": "https://images.indianexpress.com/2022/05/sameera-reddy-postpartum_1200_insta.jpg", "publishedAt": "2022-05-20T10:30:41Z", "content": "Postpartum stress is a condition, which WebMD describes as “a complex mix of physical, emotional, and behavioral changes that happen in some women after giving birth”. Still, many women are not aware… [+4265 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Kapil Sharma asks if Kangana Ranaut is planning her Hollywood debut with Dhaakad: ‘Humare yaha itna talent hai…’", "description": "During her visit to The Kapil Sharma Show, Kangana Ranaut spoke about Dhaakad being helmed as per international standard.", "url": "https://indianexpress.com/article/entertainment/television/kapil-sharma-jokes-kangana-ranaut-planning-hollywood-debut-with-dhaakad-7927542/", "urlToImage": "https://images.indianexpress.com/2022/05/kangana-ranaut-kapil-sharma.jpg", "publishedAt": "2022-05-20T10:29:48Z", "content": "Kangana Ranaut’s ambitious project Dhaakad dropped at theatres today. Ahead of the release, the actor joined Kapil Sharma for a fun time on his show. Co-stars Arjun Rampal, Divya Dutta, Sharib Hashmi… [+2005 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Mimansa Shekhar", "title": "Money Heist Korea teaser: Plan to unite Korea brings back Professor and his masked robbers, but with a twist", "description": "Money Heist: Korea – Joint Economic Area teaser brings back the gang and mastermind Professor, but with a fresh plot. The heist drama is set to premiere on Netflix June 24.", "url": "https://indianexpress.com/article/entertainment/web-series/money-heist-korea-teaser-unified-korea-professor-masked-robbers-fresh-twist-watch-7927678/", "urlToImage": "https://images.indianexpress.com/2022/05/money-heist-korea-teaser-1200.jpg", "publishedAt": "2022-05-20T10:26:54Z", "content": "Incase you were wondering why the Korean remake of Netflix’s global hit Money Heist has been titled ‘Money Heist: Korea Joint Economic Area‘, now we know the reason. The makers on Friday dropped the … [+1812 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Asha Parekh gives a thumbs down to social media: ‘There’s too much exposure…’", "description": "Asah Parekh said that she is not even interested in experimenting with social media. She said they give fans too much exposure and no mystique remains.", "url": "https://indianexpress.com/article/entertainment/bollywood/asha-parekh-not-fond-of-social-media-sites-7927742/", "urlToImage": "https://images.indianexpress.com/2022/05/asha-parekh-12001.jpg", "publishedAt": "2022-05-20T10:25:56Z", "content": "Yesteryear actor Asha Parekh has said that she does not have a social media presence as she is not too fond of them. In an interaction with Hindustan Times, Parekh, who was often referred to as the H… [+1527 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aanchal Magazine", "title": "Explained: The SC ruling that GST Council decisions are not binding on Centre or states", "description": "The Centre has said that the decision does not bring any change to the already existing framework. But some Opposition-ruled states have stated that it would give them greater space to take decisions in the federal structure.", "url": "https://indianexpress.com/article/explained/supreme-court-ruling-gst-council-decision-centre-states-7927786/", "urlToImage": "https://images.indianexpress.com/2022/05/Nirmala.jpg", "publishedAt": "2022-05-20T10:24:15Z", "content": "The Supreme Court ruled on Thursday (May 19) that recommendations of the Goods and Services Tax (GST) Council only have persuasive value, and cannot be binding on the Centre and states.While the Cent… [+6190 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Poll panel to curtail some perks, privileges extended to Election Commissioners", "description": "The tax exemptions enjoyed by the Chief Election Commissioner (CEC) and Election Commissioners on sumptuary allowance will no longer be applicable. Only one LTC (Leave Travel Concession) will now be availed by them annually instead of three.", "url": "https://indianexpress.com/article/india/india-news-india/poll-panel-to-curtail-some-perks-privileges-extended-to-election-commissioners-7927820/", "urlToImage": "https://images.indianexpress.com/2022/05/election-commission-1200-1-1-1.jpeg", "publishedAt": "2022-05-20T10:23:18Z", "content": "The Election Commission has decided to let go of certain perks and privileges available to the Chief Election Commissioner (CEC) and Election Commissioners (ECs) including the income tax exemptions g… [+1314 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Hamza Khan", "title": "Need to warn nation against bids to spark new rows over language, caste: PM to BJP brass", "description": "Addressing virtually the inaugural session of the BJP's national officer-bearers meeting being held in Jaipur, Modi also hit out at the politics of dynasty and nepotism, days after the Congress held its Chintan Shivir in Rajasthan's Udaipur.", "url": "https://indianexpress.com/article/india/political-pulse/warn-nation-against-bids-to-spark-new-rows-language-caste-pm-bjp-7927758/", "urlToImage": "https://images.indianexpress.com/2022/05/Modi-14.jpg", "publishedAt": "2022-05-20T10:17:30Z", "content": "Prime Minister Narendra Modi on Friday said that there is a need to warn the nation against an attempt to create new controversies over languages and that the BJP reveres every Indian language.Addres… [+5995 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Infinix Note 12, Note 12 Turbo launched in India starting at Rs 11,999", "description": "Here's all you need to know about the new Infinix Note 12 series phones.", "url": "https://indianexpress.com/article/technology/mobile-tabs/infinix-note-12-note-12-turbo-launched-in-india-starting-at-rs-11999-7927766/", "urlToImage": "https://images.indianexpress.com/2022/05/Infinix-Note-12-series.jpg", "publishedAt": "2022-05-20T10:08:02Z", "content": "Infinix has launched the Infinix Note 12 series in India, succeeding the Note 11 series. We have two new phones – the Infinix Note 12 and the Note 12 Turbo. The entry-level Note 12 and mid-range Note… [+1571 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "IPL 2022: Disappointed Mahela Jayawardene concedes team didn’t win crucial moments", "description": "Mumbai are likely to end up last on the points table even if they manage to win their last game against Delhi Capitals on Saturday.", "url": "https://indianexpress.com/article/sports/ipl/ipl-2022-disappointed-mahela-jayawardene-concedes-team-didnt-win-crucial-moments-7927767/", "urlToImage": "https://images.indianexpress.com/2021/04/jayawardene-mi.jpg", "publishedAt": "2022-05-20T10:03:53Z", "content": "Mumbai Indians head coach Mahela Jayawardene was brutally honest in his assessment after their early exit from the IPL, saying they failed to take control of crucial moments and did not play good cri… [+2752 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kaunain Sheriff M", "title": "The current bout of unexplained hepatitis in Covid-hit children is related to the virus in some way", "description": "\"It would be fair to say there is a risk of liver dysfunction after you recover from Covid-19. But the proportion of children or patients who get it is not large,\" says Dr Arvinder Soin.", "url": "https://indianexpress.com/article/lifestyle/health/children-hepatitis-covid-correlation-7927693/", "urlToImage": "https://images.indianexpress.com/2022/05/Dr-Arvinder-Soin.jpg", "publishedAt": "2022-05-20T10:03:51Z", "content": "Dr Arvinder Soin talks to Kaunain Sheriff M about the recent scientific papers on unexplained hepatitis in children and says that it may be linked to Covid-19. He explains how the immune system activ… [+7196 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sreenivas Janyala", "title": "2019 Hyderabad encounter: Police deliberately fired upon accused with intent to kill, says Justice Sirpurkar Commission report", "description": "Hyderabad 'fake' encounter of gangrape accused: SC Commission recommends action against 10 police officials, says they are liable to be tried for murder", "url": "https://indianexpress.com/article/cities/hyderabad/hyderabad-encounter-2019-gangrape-accused-sc-commission-7927755/", "urlToImage": "https://images.indianexpress.com/2022/05/hyderabad-1200-2.jpeg", "publishedAt": "2022-05-20T09:58:29Z", "content": "The Justice V S Sirpurkar Commission, set up by the Supreme Court to probe the deaths of the four accused in the rape and murder of a veterinarian at Chattanpally in Shadnagar on the outskirts of Hyd… [+4139 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Central Railway to increase toy train services between Matheran, Aman Lodge for summers", "description": "Mumbai news: The Central Railway's shuttle services for passengers between Aman Lodge and Matheran have been instrumental in popularising this place as a major tourist destination.", "url": "https://indianexpress.com/article/cities/mumbai/matheran-aman-lodge-toy-train-central-railway-mumbai-7927738/", "urlToImage": "https://images.indianexpress.com/2022/05/matheran-aman-lodge-toy-train.jpg", "publishedAt": "2022-05-20T09:55:26Z", "content": "The Central Railway has decided to increase the toy train services for the Matheran-Aman Lodge section from Friday to May 31 considering the summer season.Currently, a total of 16 toy trains or shutt… [+1205 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "JNU student alleges molestation inside coffee shop on campus", "description": "According to the woman's complaint, the man got in touch with her with queries about her course. During a meeting in a coffee shop inside the JNU campus, the accused allegedly molested her.", "url": "https://indianexpress.com/article/cities/delhi/jnu-student-alleges-molestation-inside-coffee-shop-on-campus-7927744/", "urlToImage": "https://images.indianexpress.com/2022/05/jnu-1200.jpg", "publishedAt": "2022-05-20T09:52:51Z", "content": "A JNU student has alleged she was molested by a man, whom she met on social media, at a coffee shop inside the campus. Police said they have identified the accused and he has joined the investigation… [+1279 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Video series on pay and entitlements of Army jawans launched", "description": "The maintenance of pay accounts of jawans involves efforts of the respective units where a junior commissioned officer or soldier of other ranks is posted, the records office of the regiment and the pay and account offices of the Defence Accounts Department.", "url": "https://indianexpress.com/article/cities/pune/video-series-pay-entitlements-army-jawans-7927741/", "urlToImage": "https://images.indianexpress.com/2022/05/PCDA-SC-Photo-2.jpg", "publishedAt": "2022-05-20T09:52:48Z", "content": "The office of Principal Controller of Defence Accounts (Southern Command), or PCDA(SC), in Pune has launched a series of educational videos to familiarise the Army jawans with their pay and entitleme… [+1937 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Gold, Silver Prices Today: Gold rises Rs 330/10 gm, silver climbs Rs 768/kg", "description": "Gold, Silver Rates Today News: The opening price for 999 purity gold was Rs 51,012 per 10 grams, up Rs 330 from Thursday’s closing price of Rs 50,682, while that of 999 purity silver was Rs 61,855 per kg, up Rs 768 from Rs 61,087. Read below to find out bulli…", "url": "https://indianexpress.com/article/business/commodities/gold-silver-price-today-may-20-latest-check-bullion-rates-7927448/", "urlToImage": "https://images.indianexpress.com/2022/04/gold-bullion-reuters-1200.jpeg", "publishedAt": "2022-05-20T09:45:33Z", "content": "Gold, Silver Rates Today News Updates: Prices of gold and silver opened sharply higher in the key spot markets of the country on Friday, May 20, 2022.The opening price for 999 purity gold was Rs 51,0… [+2206 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuradha Mascarenhas", "title": "Ruby Hall Clinic kidney transplant case: Transplants will halt if harassment continues, warn doctors associations", "description": "Pune news: In the Ruby Hall Clinic cae, an unrelated woman was allegedly presented as the organ receiver’s wife and promised Rs 15 lakh in return.", "url": "https://indianexpress.com/article/cities/pune/ruby-hall-clinic-kidney-transplants-will-come-to-a-halt-if-harassment-continues-warn-doctors-associations-7927709/", "urlToImage": "https://images.indianexpress.com/2022/05/RUBY.jpg", "publishedAt": "2022-05-20T09:45:11Z", "content": "In the wake of the kidney transplant malpractice case involving Punes Ruby Hall Clinic, doctors from the Indian Society of Organ Transplantation (ISOT) and other professional associations have clarif… [+3383 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Margot Robbie to star in Ocean’s Eleven prequel movie", "description": "Ocean's Eleven prequel movie is billed as a heist comedy and follows con artists who rob hundreds of millions from a Las Vegas casino.", "url": "https://indianexpress.com/article/entertainment/hollywood/margot-robbie-to-star-in-oceans-eleven-prequel-movie-7927650/", "urlToImage": "https://images.indianexpress.com/2022/05/Margot-Robbie-1200ny667.jpg", "publishedAt": "2022-05-20T09:44:49Z", "content": "Hollywood star Margot Robbie has been tapped to play the lead role in the Ocean’s Eleven prequel film set at Warner Bros.According to Variety, the movie is billed as a heist comedy and follows con ar… [+885 chars]"}]}