{"status": "ok", "totalResults": 371, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Prithviraj trailer: Akshay Kumar-Manushi Chhillar film celebrates ‘true love, valour and dharm’", "description": "Prithviraj trailer: Akshay Kumar plays Samrat Prithviraj Chauhan while Manushi Chhillar steps into the shoes of Sanyogita in director Chandraprakash Dwivedi’s historical.", "url": "https://indianexpress.com/article/entertainment/bollywood/prithviraj-trailer-akshay-kumar-manushi-chhillar-love-valour-watch-video-7907351/", "urlToImage": "https://images.indianexpress.com/2022/05/prithviraj-film-akshay-kumar-1200.jpg", "publishedAt": "2022-05-09T06:42:27Z", "content": "Akshay Kumar-starrer Prithviraj is all about grandeur, patriotism and bravery. The Yash Raj Film’s latest magnum opus has been in the news for a long time, and going by the trailer which released on … [+2486 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Johnson T A", "title": "Fog of uncertainty in Karnataka BJP, no word yet on Cabinet reshuffle", "description": "Last week, former CM BS Yediyurappa said the changes might take place by May 10.", "url": "https://indianexpress.com/article/india/political-pulse/fog-of-uncertainty-in-karnataka-bjp-no-word-yet-on-cabinet-reshuffle-7907637/", "urlToImage": "https://images.indianexpress.com/2022/05/Bommai-Shah-new-2.jpeg", "publishedAt": "2022-05-09T06:40:34Z", "content": "An air of suspense continues to hang over an impending reshuffle in the BJP government in Karnataka following Union Home Minister Amit Shah’s visit to the state on May 3, which took place amid specul… [+4127 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Ukraine-Russia war top developments: 60 killed in bombing of Ukraine school; G7 countries pledge to stop Russian oil imports", "description": "Meanwhile, leaders from the G-7 countries met online Sunday and announced their commitment to ban or phase out Russian oil imports in their latest effort to pressure Moscow into ending its aggression on Ukraine", "url": "https://indianexpress.com/article/world/russia-ukraine-top-developments-zelenskyy-putin-kyiv-moscow-biden-g7-7907411/", "urlToImage": "https://images.indianexpress.com/2022/05/Ukraine-8.jpg", "publishedAt": "2022-05-09T06:38:19Z", "content": "As many as 60 people are feared dead after a bomb struck a village school in eastern Ukraine Sunday, Luhansk region Governor Serhiy Gaidai said. The school in Bilohorivka, where about 90 people were … [+4814 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sreenivas Janyala", "title": "With Amit Shah, Telangana BJP to organise massive show of strength near Hyderabad on May 14", "description": "The party plans to turn the last day of the padayatra by BJP state chief Bandi Sanjay Kumar into a major public meeting at Tukkuguda near Maheshwaram.", "url": "https://indianexpress.com/article/cities/hyderabad/amit-shah-telangana-bjp-hyderabad-on-may-14-7907617/", "urlToImage": "https://images.indianexpress.com/2022/05/aMIT-SHAH-14-2.jpg", "publishedAt": "2022-05-09T06:35:11Z", "content": "The Telangana unit of the BJP is planning to turn the last day of the padayatra by party state chief Bandi Sanjay Kumar into a massive show of strength in the presence of Union Home Minister Amit Sha… [+2259 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "‘Avoid eating shawarma. It is not our food’: Tamil Nadu Health Minister Subramanian", "description": "The Tamil Nadu minister’s comments came after 58 people fell ill and a young girl died after consuming shawarma on May 1 from an eatery in Kerala’s Kasaragod district.", "url": "https://indianexpress.com/article/cities/chennai/shawarma-tamil-nadu-health-minister-subramanian-7907643/", "urlToImage": "https://images.indianexpress.com/2022/05/Ma-Subramanian.jpg", "publishedAt": "2022-05-09T06:34:18Z", "content": "Tamil Nadu Health Minister Ma Subramanian has requested people to avoid eating shawarma, saying it is not a part of Indian cuisine. Addressing reporters while overseeing the mega vaccination drive Su… [+1587 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Noida: Trio held for robbing, killing people after meeting them on dating apps", "description": "According to the police, the accused created fake profiles on Tinder and other social media apps and made friends with users based on their wealth as portrayed on the profile.", "url": "https://indianexpress.com/article/cities/delhi/noida-trio-arrested-robbing-killing-dating-apps-7907641/", "urlToImage": "https://images.indianexpress.com/2022/05/Handcuffs-crime-1200.jpeg", "publishedAt": "2022-05-09T06:32:32Z", "content": "Noida police arrested two women and a man on Sunday for allegedly robbing and killing people after befriending them on dating apps, officers said. The police said the accused, identified as Sandeep a… [+897 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Three bodies fished out of canal", "description": "Officials said that one body was fished out from canal in Shinde Vasti area of Hadapsar and two more from Vaidu Wadi area in two separate searches conducted on Sunday morning.", "url": "https://indianexpress.com/article/cities/pune/three-bodies-fished-out-of-canal-7907603/", "urlToImage": "https://images.indianexpress.com/2022/05/Indian-Express-logo-13-4-3-1.jpeg", "publishedAt": "2022-05-09T06:26:24Z", "content": "Three bodies of unidentified men were taken out from canal in Hadapsar area from two different locations on Sunday following calls received by local residents after seeing the bodies."}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "May 9 is a revered day in Russia. For many, Putin has hijacked it", "description": "Warplanes will fly over Moscow in a “Z” formation — the symbol of support for this year’s invasion — and airborne troops who fought recently in Ukraine will parade through Red Square in their armored personnel carriers.", "url": "https://indianexpress.com/article/world/may-9-is-a-revered-day-in-russia-for-many-putin-has-hijacked-it-7907340/", "urlToImage": "https://images.indianexpress.com/2022/05/Russia.jpg", "publishedAt": "2022-05-09T06:25:13Z", "content": "Olga Romanovas grandmother served as a front-line nurse in World War II. She was small and thin, Romanova said, but somehow carried big, grown, wounded men to safety. She met her husband in her four … [+7722 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "ED raids Dempo Group, searches in offices across Goa", "description": "The Dempo group, which earlier had mining as its core business, has investments in ship-building, real estate, education and media among other sectors.", "url": "https://indianexpress.com/article/cities/goa/ed-raids-dempo-group-searches-in-offices-across-goa-7907618/", "urlToImage": "https://images.indianexpress.com/2022/05/goa.jpg", "publishedAt": "2022-05-09T06:23:28Z", "content": "The Enforcement Directorate Monday conducted searches across offices of the Goa-based Dempo Group of companies.\r\nThe Enforcement Directorate Monday conducted searches across offices of the Goa-based … [+352 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Justices Sudhanshu Dhulia, Jamshed Burjor Pardiwala take oath as Supreme Court judges", "description": "The Supreme Court has a sanctioned strength of 34 judges and it was working with two vacancies. The fresh appointments have brought the functioning strength back to 34.", "url": "https://indianexpress.com/article/india/justices-sudhanshu-dhulia-jamshed-burjor-pardiwala-take-oath-as-supreme-court-judges-7907468/", "urlToImage": "https://images.indianexpress.com/2022/05/supreme-court-3-1-1.jpg", "publishedAt": "2022-05-09T06:16:16Z", "content": "Justices Sudhanshu Dhulia and Jamshed Burjor Pardiwala were sworn in as the judges of the Supreme Court Monday taking its total working strength to 34. Chief Justice of India (CJI) N V Ramana adminis… [+2364 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuradha Mascarenhas", "title": "Pune: Ayurveda rasayana therapy cured cancer, says study published in international journal", "description": "One of the successfully treated cancer cases at Pune's Rasayu Cancer Clinic was recently published in the international peer-reviewed journal Clinical Case Reports.", "url": "https://indianexpress.com/article/cities/pune/pune-ayurveda-rasayana-therapy-cured-cancer-says-study-published-in-international-journal-7907587/", "urlToImage": "https://images.indianexpress.com/2022/05/Pune-.jpg", "publishedAt": "2022-05-09T06:14:55Z", "content": "Ayurveda often is seen only as herbal medicine or simply useful for general ailments and not advisable for serious or critical illnesses. But now in a first, one of the successfully treated cancer ca… [+4005 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Philippine election narrows to Marcos Jr, rights defender", "description": "A former provincial governor, congressman and senator, the 64-year-old son of the late dictator is making the most impressive attempt yet of the Marcos family to recapture the presidency.", "url": "https://indianexpress.com/article/world/philippine-election-narrows-to-marcos-jr-7907578/", "urlToImage": "https://images.indianexpress.com/2022/05/Phillipines-Polls.jpg", "publishedAt": "2022-05-09T06:13:47Z", "content": "More than three decades after a largely peaceful People Power revolt overthrew Philippine dictator Ferdinand Marcos, his son and namesake is the top choice in most voter-preference surveys. Some of t… [+5063 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "IPL 2022: I fully back every decision Rishabh Pant takes on the field, says Ricky Ponting", "description": "Under Pant, DC have won just five of the 11 matches they have played so far, including the 91-run thrashing at the hands of Chennai Super Kings on Sunday.", "url": "https://indianexpress.com/article/sports/ipl/i-fully-back-every-decision-pant-takes-on-the-field-ponting-7907494/", "urlToImage": "https://images.indianexpress.com/2022/03/Rishabh-Pant-Ricky-Ponting.jpg", "publishedAt": "2022-05-09T06:09:52Z", "content": "Rishabh Pant’s on-field decisions as Delhi Capitals captain in the ongoing IPL might have come under the scanner of former players but the wicketkeeper has got the “full backing” of head coach Ricky … [+2779 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "F3 trailer: Venkatesh, Varun Tej are frustrated by women and money in this sequel", "description": "F3 stars Venkatesh, Varun Tej, Tamannaah Bhatia, Mehreen Pirzada, Rajendra Prasad and Sunil.", "url": "https://indianexpress.com/article/entertainment/telugu/f3-trailer-venkatesh-varun-tej-are-now-frustrated-by-both-women-and-money-7907472/", "urlToImage": "https://images.indianexpress.com/2022/05/f3-movie.jpg", "publishedAt": "2022-05-09T06:01:26Z", "content": "Telugu star Venkatesh Daggubati on Monday unveiled the trailer of his upcoming film F3. The film, which is written and directed by Anil Ravipudi, is the sequel to the 2019 hit F2: Fun and Frustration… [+1280 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Campus Activewear makes a strong debut, lists at over 23% premium over issue price", "description": "Campus Activewear IPO Listing Today: The scrip of athleisure footwear company Campus Activewear got listed at Rs 360.00 apiece on the NSE, thereby registering a gain of 23.29 per cent from its offer price of Rs 292.00.", "url": "https://indianexpress.com/article/business/market/campus-activewear-share-price-bse-nse-market-debut-7907440/", "urlToImage": "https://images.indianexpress.com/2022/04/campus-shoes-ipo.jpg", "publishedAt": "2022-05-09T05:59:29Z", "content": "Campus Activewear share price: Shares of athleisure footwear company Campus Activewear debuted on a strong note and got listed at a premium of over 23 per cent from their issue price in the stock exc… [+1782 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Suspense over Karnataka cabinet rejig continues a week after Amit Shah’s visit", "description": "Amid the speculation over a change in the leadership and the Karnataka cabinet, several BJP leaders in the state have indicated that they have not received any such hints.", "url": "https://indianexpress.com/article/cities/bangalore/suspense-over-karnataka-cabinet-rejig-continues-a-week-after-amit-shahs-visit-7907503/", "urlToImage": "https://images.indianexpress.com/2022/05/Amiy-shah-bommai.jpeg", "publishedAt": "2022-05-09T05:55:29Z", "content": "An air of suspense continues to hang over the impending leadership change and cabinet expansion in Karnataka following the visit of Union Home Minister Amit Shah last week amid speculation of the BJP… [+4567 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Karnataka: Right-wing activists play Hanuman Chalisa at 5 am to ‘counter’ azaan, detained", "description": "According to the police, the incidents were reported in places including Bengaluru, Mysuru, Mandya, Belgaum, Dharwad and Kalaburagi.", "url": "https://indianexpress.com/article/cities/bangalore/karnataka-right-wing-activists-hanuman-chalisa-azaan-7907498/", "urlToImage": "https://images.indianexpress.com/2022/05/azaan-.png", "publishedAt": "2022-05-09T05:55:04Z", "content": "A day after Sri Rama Sene chief Pramod Muthalik called to play the Hanuman Chalisaand other devotional hymns early in the morning to counter the azaan, in several places the police detained Sene acti… [+1560 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Fashion designer Vera Wang reacts to her Barbie version: ‘I never could have imagined’", "description": "\"Barbie is the ultimate icon, and she represents all of us,\" she said", "url": "https://indianexpress.com/article/lifestyle/life-style/fashion-designer-vera-wang-barbie-doll-tribute-7906681/", "urlToImage": "https://images.indianexpress.com/2022/05/VeraWang-Barbie-1200.jpg", "publishedAt": "2022-05-09T05:55:01Z", "content": "Celebrated fashion designer Vera Wang, who has dressed many celebrities around the world, has now been honoured with her very own Barbie doll. Mattel dedicated the doll to the Chinese-American fashio… [+1884 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Shaheen Bagh faces bulldozer threat as MCD, police arrive for demolition drive", "description": "In the first phase of the demolition drive, the SDMC razed over half a dozen shops in Tughlakabad earlier this month.", "url": "https://indianexpress.com/article/cities/delhi/shaheen-bagh-demolition-drive-bulldozer-south-mcd-7907512/", "urlToImage": "https://images.indianexpress.com/2022/05/Shaheen-Bagh-1.jpeg", "publishedAt": "2022-05-09T05:54:33Z", "content": "The Delhi Police have decided to provide security to the South Delhi Municipal Corporation (SDMC) during its demolition drive in Shaheen Bagh, which had earlier seen anti-CAA protests for months, Mon… [+2516 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Max Verstappen cruises to win in inaugural Miami Grand Prix", "description": "Verstappen started third Sunday after Ferrari locked out the front row with Leclerc and Carlos Sainz Jr. in qualifying. But in the end, Red Bull got the best of its new rival for a second consecutive race.", "url": "https://indianexpress.com/article/sports/verstappen-cruises-to-win-in-inaugural-miami-grand-prix-7907455/", "urlToImage": "https://images.indianexpress.com/2022/05/max1.jpg", "publishedAt": "2022-05-09T05:46:09Z", "content": "His first day racing around the new Formula One circuit in Miami was absolutely horrible. Then he made a mistake in qualifying that cost him a spot on the front row.By the time race day rolled around… [+3237 chars]"}]}