{"status": "ok", "totalResults": 380, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "West Bengal: BJP, TMC trade barbs after tribal woman found dead in S Dinajpur", "description": "While the BJP claimed that the woman was gangraped and murdered, the ruling TMC accused the saffron party of politicising the incident.", "url": "https://indianexpress.com/article/cities/kolkata/west-bengal-bjp-tmc-trade-barbs-tribal-woman-found-dead-s-dinajpur-7916513/", "urlToImage": "https://images.indianexpress.com/2022/05/Indian-express-1-3-8.jpg", "publishedAt": "2022-05-14T00:49:44Z", "content": "A tribal woman was found dead in bushes in South Dinajpur district on Thursday night, triggering a political war of words between the ruling Trinamool Congress (TMC) and the BJP over women safety in … [+2873 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "West Bengal: Programmes to mark TMC’s 11 years in govt to continue for a month", "description": "As part of the 'Unnayaner Pathey 11 Bochor' campaign that is being organised in all districts, 631 static exhibitions will be held at various venues, including educational institutions and government offices, to showcase “achievements and successful initiativ…", "url": "https://indianexpress.com/article/cities/kolkata/west-bengal-programmes-mark-tmc-11-years-govt-continue-month-7916511/", "urlToImage": "https://images.indianexpress.com/2022/05/tmc-fb-1.jpg", "publishedAt": "2022-05-14T00:45:32Z", "content": "Programmes being organised since on May 5 by the Mamata Banerjee-led Trinamool Congress (TMC) government in West Bengal to mark the completion of the party’s 11 years in office will continue for a mo… [+1506 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Cracks in buildings: Bowbazar soil to be tested to take call on fate of structures, says Kolkata Mayor", "description": "At least 12 buildings in the congested Bowbazar area developed major cracks on Thursday following which as many as 82 affected people were moved to different hotels.", "url": "https://indianexpress.com/article/cities/kolkata/cracks-buildings-bowbazar-soil-tested-take-call-fate-structures-kolkata-mayor-7916507/", "urlToImage": "https://images.indianexpress.com/2022/05/cracks-1.jpg", "publishedAt": "2022-05-14T00:36:15Z", "content": "Hakim also said that The Kolkata Metro Railway Corporation Ltd (KMRCL) has been asked to test the soil condition in Bowbazar to decide the fate of the buildings that have developed major cracks.\r\nAt … [+1770 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Constable shot dead in Pulwama", "description": "This is the second killing in the Valley in the last 24 hours. A Kashmiri Pandit employee at the Tehsil office at Chadoora, Budgam was killed within his office premises on Thursday evening.", "url": "https://indianexpress.com/article/cities/srinagar/constable-shot-dead-in-pulwama-7916486/", "urlToImage": "https://images.indianexpress.com/2022/04/srinagar.jpeg", "publishedAt": "2022-05-14T00:34:21Z", "content": "A J&amp;K Police constable was shot dead by suspected militants at his residence in Gudroo area of Pulwama early Friday morning. J&amp;K Police IGP Vijay Kumar said Constable Reyaz Ahmad Thokar with … [+1157 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Bashaarat Masood", "title": "J&K: 3 govt employees dismissed, order calls prof ‘threat to state’", "description": "Lt Governor Manoj Sinha ordered Dr Pandit's dismissal “with immediate effect” on Friday, declaring him a “threat to the security of the state”.", "url": "https://indianexpress.com/article/cities/srinagar/jk-3-govt-employees-dismissed-order-calls-prof-threat-to-state-7916505/", "urlToImage": "https://images.indianexpress.com/2022/02/Manoj-Sinha.jpg", "publishedAt": "2022-05-14T00:30:19Z", "content": "A University of Kashmir professor is among three government employees terminated by the J&amp;K government, the latest in a series of dismissals under a law whose growing use in the Valley has trigge… [+2063 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "SSC recruitment exam: Calcutta HC panel seeks action against top officials", "description": "The committee, headed by Justice (retd) RK Bag, recommended criminal proceedings against four ex-state SSC officials and the incumbent president of the West Bengal Board of Secondary Education.", "url": "https://indianexpress.com/article/cities/kolkata/ssc-recruitment-exam-calcutta-hc-panel-seeks-action-against-top-officials-7916495/", "urlToImage": "https://images.indianexpress.com/2022/05/SSC-exam-759.jpg", "publishedAt": "2022-05-14T00:28:01Z", "content": "A committee constituted by the Calcutta High Court on Friday submitted a report on an alleged scam in recruitments by the School Service Commission (SSC), saying that 381 appointments for Group-C pos… [+2416 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shivani Naik", "title": "Historic win propels India into first Thomas Cup final", "description": "More than anything, Friday's performance will count as the win of India's united squad, not embittered by the usual Hyderabad-Bangalore-Mumbai rivalries and factionalism -- the players get along famously, bonding over PubG and street style dancing.", "url": "https://indianexpress.com/article/sports/badminton/india-semifinal-victory-denmark-first-thomas-cup-final-7916500/", "urlToImage": "https://images.indianexpress.com/2022/05/thomas-cup.jpg", "publishedAt": "2022-05-14T00:19:40Z", "content": "India will line up against 14-time Thomas Cup champions Indonesia on Sunday after a historic 3-2 semifinal victory over Denmark in Bangkok.Indonesia is to shuttle what Australia used to be to cricket… [+3772 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shyamlal Yadav", "title": "Aviation Secy, wife get cut-rate A-I tickets to US, upgrade to Business", "description": "Bansal, a 1988 batch IAS officer, was appointed Secretary on September 22 last year a day after the government decided to sell its stake in Air India. He took charge on October 1, 2021.", "url": "https://indianexpress.com/article/business/aviation/aviation-secy-wife-get-cut-rate-a-i-tickets-to-us-upgrade-to-business-7916497/", "urlToImage": "https://images.indianexpress.com/2022/05/Rajiv-Bansal-1200.jpg", "publishedAt": "2022-05-14T00:09:12Z", "content": "AIR INDIA may have been sold to the Tata Group but, at least, in one aspect, it seems, its disinvestment isnt complete: upgrading seats and special handling of a Government officer.Records reviewed b… [+2221 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manish Sahu", "title": "Uttar Pradesh: Police attach properties, bank accounts of jailed former MP Rizwan Zaheer", "description": "A two-time MP and three-time MLA, Rizwan Zaheer is lodged in jail along with his daughter Zeba Rizwan and son-in-law Rameez  in connection with a murder case that took place during the recently concluded Assembly election.", "url": "https://indianexpress.com/article/cities/lucknow/police-attach-properties-bank-accounts-of-jailed-former-mp-7916496/", "urlToImage": "https://images.indianexpress.com/2022/05/Rizwan-Zaheer.jpg", "publishedAt": "2022-05-14T00:02:46Z", "content": "THE BALRAMPUR police have attached properties and bank accounts of jailed former Samajwadi Party MP Rizwan Zaheer (55) under Uttar Pradesh Gangsters and Anti-Social Activities (Prevention) Act.A two-… [+2628 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Kashi Vishwanath-Gyanvapi case: Supreme court declines to stay survey, transfers matter to Justice Chandrachud", "description": "A bench headed by CJI N V Ramana said it cannot pass any order without looking at the files.", "url": "https://indianexpress.com/article/india/kashi-vishwanath-gyanvapi-case-supreme-court-declines-stay-survey-transfers-matter-justice-chandrachud-7916493/", "urlToImage": "https://images.indianexpress.com/2022/05/Gyanvapi-Mosque.jpg", "publishedAt": "2022-05-13T23:55:52Z", "content": "The Supreme Court on Friday declined to pass any order on an appeal seeking urgent stay on the inspection of the Kashi Vishwanath temple-Gyanvapi mosque complex, saying it will decide on listing it f… [+3521 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Kashi Vishwanath-Gyanvapi case: Video survey set to resume today, security stepped up", "description": "Administration says people from both sides have assured full cooperation", "url": "https://indianexpress.com/article/cities/lucknow/kashi-vishwanath-gyanvapi-case-video-survey-security-7916471/", "urlToImage": "https://images.indianexpress.com/2022/05/Gyanvapi-Masjid.jpg", "publishedAt": "2022-05-13T23:50:39Z", "content": "The court-ordered videography survey of the Kashi Vishwanath temple-Gyanvapi mosque complex in Varanasi will resume on Saturday, with officials making elaborate security arrangements to ensure no unt… [+2563 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "DSP says Punjab Police harassing him, kin; NCSC issues notice to DGP", "description": "The NCSC chairman, taking up the petition, has now directed Punjab Police maintain status quo on the two FIRs registered against the DSP.", "url": "https://indianexpress.com/article/cities/ludhiana/dsp-punjab-police-harassing-him-kin-ncsc-issues-notice-dgp-7916488/", "urlToImage": "https://images.indianexpress.com/2022/05/p1.jpg", "publishedAt": "2022-05-13T23:48:05Z", "content": "Taking strong note of a representation received from DSP (Jail) Amar Singh alleging harassment of his family by Sangrur police, the National Commission for Scheduled Castes (NCSC) chairman Vijay Samp… [+1810 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Peter Vidal", "title": "Horoscope Today, May 14, 2022: Gemini, Aries, Pisces and other signs — check astrological prediction", "description": "Aquarius-- At times like these business and pleasure merge, with the result that work can be rather enjoyable but domestic life can become just a little too hectic. Fortunately you've got what it takes to find a happy medium. And that's precisely what you mus…", "url": "https://indianexpress.com/article/horoscope/horoscope-today-may-14-2022-gemini-aries-pisces-and-other-signs-check-astrological-prediction/", "urlToImage": "https://images.indianexpress.com/2022/04/horo2121.jpg", "publishedAt": "2022-05-13T23:30:53Z", "content": "Whats on the cards today for you? Leo, you were born under an independent sign, and sometimes you don’t notice your individualistic behaviour. Pisces, scarcely a moment passes when you don’t have som… [+3729 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kanchan Vasdev", "title": "‘We will get every inch of encroached land vacated, nobody bigger than Punjab’: Kuldeep Singh Dhaliwal", "description": "A mammoth challenge, however, lies ahead as hundreds of acres have been encroached by influential people. Punjab Rural Development and Panchayats Minister Kuldeep Singh Dhaliwal speaks to The Indian Express on the issue:", "url": "https://indianexpress.com/article/cities/chandigarh/get-encroached-land-vacated-nobody-bigger-punjab-kuldeep-singh-dhaliwal-7916485/", "urlToImage": "https://images.indianexpress.com/2022/05/nri.jpeg", "publishedAt": "2022-05-13T23:30:22Z", "content": "A Punjab government initiative to remove encroachments from prime public land last month has started yielding results with rural development department claiming to have freed 1,100 acres of such land… [+2875 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gujarat: 250 professors from 8 varsities join BJP", "description": "Speaking on the occasion, Padaliya welcomed all the professors and said that on the front of education, certain false propaganda is being circulated.", "url": "https://indianexpress.com/article/cities/gandhinagar/gujarat-250-professors-from-8-varsities-join-bjp-7916482/", "urlToImage": "https://images.indianexpress.com/2022/05/Gujarat-BJP.jpg", "publishedAt": "2022-05-13T23:17:41Z", "content": "Around 250 professors from eight universities of Gujarat joined BJP at party state headquarters Shree Kamalam in Gandhinagar Friday in the presence of party state president C R Paatil. Also present o… [+82 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gujarat: CM Bhupendra Patel visits RMC headquarters, holds review meeting with corporators", "description": "The CM also met a Congress delegation led by the Leader of Opposition in the RMC and assured them to look into their demands.", "url": "https://indianexpress.com/article/cities/rajkot/gujarat-cm-bhupendra-patel-visits-rmc-headquarters-holds-review-meeting-with-corporators-7916478/", "urlToImage": "https://images.indianexpress.com/2022/05/Patel.jpg", "publishedAt": "2022-05-13T23:12:17Z", "content": "IN A first, Chief Minister Bhupendra Patel visited the headquarters of the Rajkot Municipal Corporation (RMC) and held a review meeting directly with corporators of the ruling BJP and partys local of… [+1142 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Navjeevan Gopal", "title": "Mohali RPG attack: Day after, man who recced, accompanied attackers secured parole extension from HC", "description": "On May 10, a Division bench of Justices Augustine George Masih and Justice Jasjit Singh Bedi of the Punjab and Haryana High Court had extended the Charhat 's parole till May 13 (Friday).", "url": "https://indianexpress.com/article/cities/chandigarh/mohali-rpg-attack-man-recced-accompanied-attackers-secured-parole-extension-hc-7916473/", "urlToImage": "https://images.indianexpress.com/2022/05/Mohali-terror-attack-2.jpg", "publishedAt": "2022-05-13T23:09:32Z", "content": "A 33-year-old man, who Punjab Police has accused of carrying out the RPG attack on their Intelligence Headquarters in Mohali on Monday (May 9) was out on parole in a murder case and was supposed to r… [+2138 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gujarat: Send children to schools, basic amenities assured, CM Patel tells nomadic tribes", "description": "The housing society is an initiative of the state government, in collaboration with the Vicharta Samuday Samarthan Manch (VSSM) and the civil society.", "url": "https://indianexpress.com/article/cities/rajkot/gujarat-send-children-to-schools-basic-amenities-assured-cm-patel-tells-nomadic-tribes-7916476/", "urlToImage": "https://images.indianexpress.com/2022/05/Guj-patel.jpg", "publishedAt": "2022-05-13T23:06:40Z", "content": "Urging the members of nomadic tribes (NTs) to send their children to school, Chief Minister Bhupendra Patel Friday assured that the state government will provide the community all basic amenities and… [+4511 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gujarat: CEPT launches revised edition of book on architecture, independence", "description": "The book traces the development of architectural profession and patterns of architectural form in the century following the formation of the Indian National Congress in the 1880s.", "url": "https://indianexpress.com/article/cities/ahmedabad/gujarat-cept-launches-revised-edition-of-book-on-architecture-independence-7916469/", "urlToImage": "https://images.indianexpress.com/2022/05/guj-CEPT.jpg", "publishedAt": "2022-05-13T23:01:04Z", "content": "CEPT University Press Friday launched the second revised edition of Architecture &amp; Independence: The Search for Identity India 1880 to 1980, a book written by Jon Lang, Madhavi Desai and Miki Des… [+771 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Punjabi singer, another man held for beating car driver", "description": "Another man was identified as Randhir. Police said the vehicle of the Punjabi singer, Kamal Khaira, was impounded. The victim was identified as Hardik Ahluwalia, a resident of Ground Floor, Omaxe New Chandigarh, in Mohali.", "url": "https://indianexpress.com/article/cities/chandigarh/punjabi-singer-man-held-beating-car-driver-7916468/", "urlToImage": "https://images.indianexpress.com/2022/05/arrest-11.jpg", "publishedAt": "2022-05-13T22:57:29Z", "content": "The Chandigarh Police has arrested Punjabi singer Kamal Khaira along with another man for beating a car driver after a road accident near gate number 2 of Panjab University Thursday night.Another man… [+1186 chars]"}]}