{"status": "ok", "totalResults": 531, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Lakshana N Palat", "title": "Revisiting Manichitrathazhu ahead of Bhool Bhulaiyya 2: How Shobana’s Nagavalli can make a million Manjulikas pale", "description": "Before the release of Bhool Bhulaiyya 2, here's going back to OG Malayalam classic that started it all---Manichitrathazhu.", "url": "https://indianexpress.com/article/entertainment/malayalam/revisiting-manichitrathazhu-ahead-of-bhool-bhulaiyya-2-how-shobanas-nagavalli-can-make-a-million-manjulikas-pale-7923919/", "urlToImage": "https://images.indianexpress.com/2022/05/Mani1200.jpg", "publishedAt": "2022-05-19T02:35:31Z", "content": "Bhool Bhulaiyya 2, the sequel to the 2007 hit is just around the corner and it promises the return of Manjulika, a lot of shrieking, some thrills, remixed songs and hints of a romance. The film stars… [+4043 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Nawazuddin Siddiqui in Kahaani: The coarse, terse police officer remains one of his best roles till date", "description": "In 2011, Nawazuddin Siddiqui cemented his position on the Bollywood scene with Kahaani.", "url": "https://indianexpress.com/article/entertainment/bollywood/nawazuddin-siddiqui-in-kahaani-the-coarse-terse-police-officer-remains-one-of-his-best-roles-till-date/", "urlToImage": "https://images.indianexpress.com/2022/05/Nawaz1200.jpg", "publishedAt": "2022-05-19T02:35:25Z", "content": "In his first scene of Kahaani itself, Nawazuddin Siddiqui caught peoples attention. After smoking in the washroom while assessing the situation, he marches into a sleepy police station and barks at w… [+2968 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lakshana N Palat", "title": "Modern Love Mumbai: Chitrangda Singh and Arshad Warsi capture bittersweet effects of love, marriage in just one scene", "description": "Modern Love: Mumbai was definitely the more watchable of all the Indian anthologies of late; some of the stories and their conclusions were just as satisfying as misal pav on the rocks of Marine Drive.", "url": "https://indianexpress.com/article/entertainment/web-series/modern-love-mumbai-chitrangda-singh-and-arshad-warsi-cutting-chai-7922005/", "urlToImage": "https://images.indianexpress.com/2022/05/arshad1200.jpg", "publishedAt": "2022-05-19T02:35:08Z", "content": "There have been so many anthologies on streamers that now most (if not all) of them seemed to have blurred into a congealed mass. When I saw the trailer for the latest one, Modern Love: Mumbai, I won… [+6067 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shaikh Ayaz", "title": "How Girish Karnad’s iconic plays have redefined Indian theatre", "description": "Remembering the thespian Girish Karnad's passion for playwriting and his significant contribution to the world of theatre on his 84th birth anniversary today.", "url": "https://indianexpress.com/article/entertainment/entertainment-others/how-girish-karnad-iconic-plays-have-redefined-indian-theatre-7924333/", "urlToImage": "https://images.indianexpress.com/2022/05/girish-karnad-1200.jpg", "publishedAt": "2022-05-19T02:34:57Z", "content": "If you are a young Hindi movie-goer you likely know Girish Karnad as the Indian spy Tiger’s (Salman Khan) boss in Ek Tha Tiger and Tiger Zinda Hai or the gentle cricketing coach to Shreyas Talpade in… [+3990 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Joe Biden to travel to Japan for Quad Summit, have bilateral meetings with PM Modi", "description": "Before arriving in Japan for the Quad summit, US President Joe Biden is scheduled to travel to South Korea for a summit meeting with its leaders.", "url": "https://indianexpress.com/article/india/joe-biden-pm-modi-japan-quad-summit-7924899/", "urlToImage": "https://images.indianexpress.com/2021/09/Biden-Modi-1.jpg", "publishedAt": "2022-05-19T02:34:08Z", "content": "Formed with Australia, India, Japan, and the United States, Quad was an initiative of the Trump Administration, which Biden has elevated to the leadership level. There have so far been three summits,… [+2718 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Parents may have renounced Indian citizenship, but child in mother’s womb entitled to it, says Madras HC", "description": "Justice Anita Sumanth gave the ruling while allowing a writ petition from Pranav Srinivasan, now 22 years old, seeking Indian citizenship.", "url": "https://indianexpress.com/article/cities/chennai/madras-hc-indian-citizenship-option-signapore-citizen-plea-7924906/", "urlToImage": "https://images.indianexpress.com/2022/05/Madras-HC-2-3-1-9.jpg", "publishedAt": "2022-05-19T02:30:32Z", "content": "Even though the parents renounce their Indian citizenship and opt for citizenship elsewhere, their unborn child at the time of renunciation is entitled to claim Indian citizenship, the Madras High Co… [+2663 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kiran Parashar", "title": "Bengaluru: KSHRC orders police to pay compensation of Rs 75,000 to ‘chair stealer’ Japanese national", "description": "A month before his deportation, the Japanese national Hirotoshi Tanaka had reportedly stolen a chair from the JC Nagar ACP office in a bid to stay on in India to fight the case.", "url": "https://indianexpress.com/article/cities/bangalore/bengaluru-kshrc-orders-police-compensation-rs-75000-chair-stealer-japanese-national-7924636/", "urlToImage": "https://images.indianexpress.com/2022/05/Jap-nat-bengaluru-1.jpg", "publishedAt": "2022-05-19T02:30:29Z", "content": "Karnataka State Human Rights Commission (KSHRC) has directed Karnataka police to pay a compensation of Rs 75,000 to a Japanese national.Japanese student Hirotoshi Tanaka was deported to his country i… [+4004 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rahel Philipose, Sonal Gupta", "title": "Daily Briefing: Hardik Patel quits Congress over issues with leadership; Perarivalan walks free after 3 decades", "description": "A jolt for Congress ahead of the Gujarat polls, the row over Varanasi’s Gyanvapi mosque and Rajiv Gandhi murder convict A G Perarivalan’s long road to freedom – here are the top reads from today’s edition", "url": "https://indianexpress.com/article/live-news/top-news-briefing-today-7924897/", "urlToImage": "https://images.indianexpress.com/2022/05/Express-intro-10.jpg", "publishedAt": "2022-05-19T02:24:41Z", "content": "The Big Story\r\nFrom introspection to new resolve, when the Congress leadership deftly changed the format of the Udaipur Chintan Shivir, many pertinent questions remained unanswered such as the inacce… [+5396 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Tamil Nadu CM MK Stalin flags off Rs 45 crore worth relief supplies to Sri Lanka", "description": "The first consignment comprises 9,000 metric tonne (MT) of rice, 200 MT Aavin milk powder and 24 MT life-saving medicines with a combined value of Rs 45 crore.", "url": "https://indianexpress.com/article/cities/chennai/tamil-nadu-cm-mk-stalin-flags-off-rs-45-crore-worth-relief-supplies-to-sri-lanka-7924898/", "urlToImage": "https://images.indianexpress.com/2022/05/Stalin-8.jpg", "publishedAt": "2022-05-19T02:20:34Z", "content": "Tamil Nadu Chief Minister M K Stalin on Wednesday flagged off a ship laden with relief supplies, the first to be dispatched to crisis-hit Sri Lanka, from Chennai.The first consignment comprises 9,000… [+955 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Tiruvannamalai Collector told to ascertain facts on encroachment for Karunanidhi statue", "description": "A vacation bench of Justices S M Subramaniam and J Sathya Narayana Prasad, who gave the direction while entertaining a writ petition from G Karthick, also directed the authorities concerned to maintain status-quo on the issue.", "url": "https://indianexpress.com/article/cities/chennai/tiruvanamalai-karunanidhi-statue-encroachment-madras-high-court-7924889/", "urlToImage": "https://images.indianexpress.com/2022/05/Madras-HC-2-3-1-8.jpg", "publishedAt": "2022-05-19T02:13:32Z", "content": "The Madras High Court on Wednesday directed the Tiruvannamalai district Collector to inspect and ascertain the facts on alleged encroachment of public land for installing former Chief Minister, the l… [+2184 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "India calls out the West, says food grains shouldn’t go the way of Covid vaccines", "description": "The UN meeting came just days after India's last Friday decision to ban wheat exports in a bid to check high prices amid shortage of wheat due to scorching heatwave.", "url": "https://indianexpress.com/article/india/india-united-nations-food-security-meeting-7924879/", "urlToImage": "https://images.indianexpress.com/2022/05/india-un.jpg", "publishedAt": "2022-05-19T02:09:57Z", "content": "Calling out the West, India on Wednesday said that food grains should not go the way of the Covid-19 vaccines as it voiced concern over hoarding and discrimination amid the unjustified increase in fo… [+6114 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Europa League final: Watch Frankfurt beat Rangers in shootout to lift the title", "description": "Frankfurt defeated Rangers 5-4 in a penalty shootout after the game ended tied 1-1.", "url": "https://indianexpress.com/article/sports/football/europa-league-final-watch-frankfurt-vs-rangers-penalty-shootout-goals-7924876/", "urlToImage": "https://images.indianexpress.com/2022/05/frankfurt-europa-league-2022.jpg", "publishedAt": "2022-05-19T02:05:20Z", "content": "Eintracht Frankfurts 42-year wait for a European trophy is over.The German club ended its title drought with a penalty shootout win over Rangers in the Europa League final on Wednesday.\r\nGoalkeeper K… [+3734 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Elon Musk says he ‘can no longer support’ Democrats, ‘will vote Republican’", "description": "Tesla CEO Elon Musk has been a vocal critic of the Joe Biden administration and Democrats for their proposals to tax billionaires.", "url": "https://indianexpress.com/article/technology/tech-news-technology/elon-musk-voting-democrats-republican-7924872/", "urlToImage": "https://images.indianexpress.com/2022/04/ElonMusk_Reuters_NEW1-1.jpg", "publishedAt": "2022-05-19T01:55:58Z", "content": "Tesla Inc CEO Elon Musk said on Wednesday that while he voted for Democrats in the past, he will now vote for Republicans.“In the past I voted Democrat, because they were (mostly) the kindness party.… [+2207 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Distribute midday meal supplies to parents during vacation, govt tells schools", "description": "This will be the first time that midday meal supplies will be distributed among schoolchildren during summer vacation, a school education department official said.", "url": "https://indianexpress.com/article/cities/kolkata/distribute-midday-meal-supplies-to-parents-during-vacation-govt-tells-schools-7924870/", "urlToImage": "https://images.indianexpress.com/2022/04/mid-day-meal-1.jpg", "publishedAt": "2022-05-19T01:43:16Z", "content": "The West Bengal government has asked the state-run schools to distribute midday meal supplies among parents of the students during the summer vacation so that the children are not deprived of the fac… [+785 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Road accident deaths down by half in six years: Kolkata police chief lauds traffic dept", "description": "Praising the efforts made by the traffic department, Goyal said, “The Kolkata traffic police has successfully implemented the Safe Drive Save Live campaign since 2016.\"", "url": "https://indianexpress.com/article/cities/kolkata/road-accident-deaths-down-by-half-in-six-years-kolkata-police-chief-lauds-traffic-dept-7924866/", "urlToImage": "https://images.indianexpress.com/2022/05/Kolkata-commissioner.jpg", "publishedAt": "2022-05-19T01:36:02Z", "content": "OVER THE past six years, fatalities caused by road accidents have been reduced by half, Kolkata Police Commissioner Vineet Goyal said on Wednesday.Praising the efforts made by the traffic department,… [+1664 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Tamil Nadu CM Stalin chairs first state-level DISHA meet, asks officials to complete works on time", "description": "MK Stalin stressed that their (officials) functioning should be attuned to ensure the state emerged as numero uno in the country in implementing developmental projects.", "url": "https://indianexpress.com/article/cities/chennai/tamil-nadu-cm-stalin-development-committee-disha-meet-7924857/", "urlToImage": "https://images.indianexpress.com/2022/05/MK-Stalin-4.jpg", "publishedAt": "2022-05-19T01:30:10Z", "content": "Tamil Nadu Chief Minister M K Stalin chaired the first meeting of the state-level District Development Coordination and Monitoring Committee (DISHA) in Chennai on Wednesday and directed the officials… [+2591 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "New film show at Kolkata Science City", "description": "The film will generate awareness about the flora and fauna in the arctic region and the need to protect its rich biodiversity from the onslaught of global warming.", "url": "https://indianexpress.com/article/cities/kolkata/new-film-show-at-kolkata-science-city-7924865/", "urlToImage": "https://images.indianexpress.com/2020/03/science-city-fb.jpg", "publishedAt": "2022-05-19T01:25:29Z", "content": "With the rise in footfall after the pandemic, Science City, Kolkata, on Wednesday introduced a large-format film Life Under the Arctic Sky’, to be screened in its fulldome digital theatre, an officia… [+6 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "State logs 26 fresh Covid-19 cases, no death", "description": "On Sunday 9,292 samples were tested. With the latest rise, Bengal's Covid-19 infection tally has gone up to 20,18,948 cases. West Bengal recorded 43 Covid-19 recoveries in the past 24 hours.", "url": "https://indianexpress.com/article/cities/kolkata/state-logs-26-fresh-covid-19-cases-no-death-7924862/", "urlToImage": "https://images.indianexpress.com/2022/01/kolkata-covid-2.jpg", "publishedAt": "2022-05-19T01:20:20Z", "content": "NO DEATH linked to Covid-19 was recorded in West Bengal in the past 24 hours, a state health bulletin said on Wednesday. A total of 26 new cases of the infection were recorded in the past 24 hours, t… [+561 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Cops use water cannons to disperse protesting ABVP members in Kolkata", "description": "ABVP national secretary Saptarshi Sarkar said that “four of our activists were arrested while at least six others suffered injuries in the police action”.", "url": "https://indianexpress.com/article/cities/kolkata/cops-use-water-cannons-to-disperse-protesting-abvp-members-in-kolkata-7924859/", "urlToImage": "https://images.indianexpress.com/2021/11/Kolkata-police.jpg", "publishedAt": "2022-05-19T01:16:08Z", "content": "Police on Wednesday used water cannons and baton-charged activists of the Akhil Bharatiya Vidyarthi Parishad (ABVP), who tried to force their way past the security cordon near Bikash Bhavan here in p… [+701 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Mamata lashes out at PM over fuel price hike", "description": "She also accused the Narendra Modi government of engineering communal disturbances to divert people's attention from the issues affecting them such as price rise.", "url": "https://indianexpress.com/article/cities/kolkata/mamata-lashes-out-at-pm-over-fuel-price-hike/", "urlToImage": "https://images.indianexpress.com/2022/05/mamata-759-1-1-1-5.jpg", "publishedAt": "2022-05-19T01:09:42Z", "content": "Hitting out at the Centre over the hike in domestic gas and fuel prices, Chief Minister Mamata Banerjee on Wednesday accused the BJP-led government of looting the common people."}]}