{"status": "ok", "totalResults": 384, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Kamaldeep Singh Brar", "title": "10 ‘drug overdose’ deaths in a week push AAP govt in a corner", "description": "While there has not been much action on part of government, one change that has been noticed is that people have become vocal against drug peddlers. In the recent past, there have been several instances when people caught alleged drug peddlers and handed them…", "url": "https://indianexpress.com/article/cities/amritsar/10-drug-overdose-deaths-in-a-week-push-aap-govt-in-a-corner-7903564/", "urlToImage": "https://images.indianexpress.com/2022/05/indianexpress-logo-2.jpeg", "publishedAt": "2022-05-06T02:30:54Z", "content": "A man, who along with his sarpanch wife had joined Aam Aadmi Party in the run up to this year’s Assembly polls, was arrested Thursday with 30-gm heroin from Khemkaran in Tarn Taran, the police action… [+4649 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Doctor Strange in the Multiverse of Madness: Strange, Wanda, Charles Xavier, Superior Iron Man and other confirmed and rumoured characters", "description": "Doctor Strange in the Multiverse of Madness, which brings back Benedict Cumberbatch in the titular role, is a crossover of sorts, with multiple characters returning and it also features new characters and even different versions of older characters. Here are …", "url": "https://indianexpress.com/article/entertainment/hollywood/doctor-strange-in-multiverse-of-madness-strange-wanda-charles-xavier-superior-iron-man-confirmed-rumoured-characters-7901737/", "urlToImage": "https://images.indianexpress.com/2022/05/doctor-strange-multiverse-of-madness-characters-1200.jpg", "publishedAt": "2022-05-06T02:28:10Z", "content": "If Spider-Man: No Way Home marked MCU’s big-screen introduction to the multiverse, Doctor Strange in the Multiverse of Madnessis the first time we are going to see the full ramifications of the conce… [+4111 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Karine Jean-Pierre is named White House Press Secretary", "description": "Karine Jean-Pierre is set to make history as the first Black woman and openly gay person to serve as press secretary.", "url": "https://indianexpress.com/article/world/karine-jean-pierre-white-house-press-secretary-7903556/", "urlToImage": "https://images.indianexpress.com/2022/05/PRESS-SECRETARY-3-3.jpg", "publishedAt": "2022-05-06T02:21:51Z", "content": "US President Joe Biden on Thursday selected Karine Jean-Pierre, the principal deputy press secretary, to replace Jen Psaki as the top White House spokeswoman, making her the first Black woman to hold… [+4699 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "3 Israelis killed in stabbing attack near Tel Aviv", "description": "Israel marked its Independence Day on Thursday, a festive national holiday in which people typically hold barbecues and attend air shows.", "url": "https://indianexpress.com/article/world/israel-tel-aviv-stabbing-attack-7903552/", "urlToImage": "https://images.indianexpress.com/2022/05/israel-1.jpg", "publishedAt": "2022-05-06T02:13:39Z", "content": "A pair of Palestinian attackers went on a stabbing rampage in a town near Tel Aviv, killing at least three people and wounding four others before fleeing in a vehicle, Israeli authorities said.Police… [+5645 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rahel Philipose, Sonal Gupta", "title": "Daily Briefing: J&K Delimitation Commission issues final notification; 47.4 lakh Covid deaths in India, says WHO", "description": "On the petitions challenging the constitutional validity of IPC Section 124A dealing with sedition, the Supreme Court decided to first examine if it should be referred to a larger bench in light of its 1962 judgment upholding the provision after reading it do…", "url": "https://indianexpress.com/article/live-news/top-news-briefing-today-7903541/", "urlToImage": "https://images.indianexpress.com/2022/05/Express-intro-3.jpg", "publishedAt": "2022-05-06T02:13:22Z", "content": "The Big Story\r\nFinalising its order for the Union Territory of Jammu and Kashmir, the Delimitation Commission recommended seven additional constituencies six for Jammu and one for Kashmir taking the … [+5124 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kamaldeep Singh Brar", "title": "PSPCL’s move to vacate prime land: complaint alleges fraud involving Congress ex-minister", "description": "Asked about the decision to vacate the building, Baldev Singh sent The Indian Express, a general letter of Punjab government to all departments in which they were asked to shift government offices running in the private buildings to the official buildings to …", "url": "https://indianexpress.com/article/cities/amritsar/pspcls-move-to-vacate-prime-land-complaint-alleges-fraud-involving-congress-ex-minister-7903532/", "urlToImage": "https://images.indianexpress.com/2022/05/city.jpg", "publishedAt": "2022-05-06T01:52:54Z", "content": "After refusing to vacate a plush property worth crores in the heart of Amritsar, the Punjab State Power Corporation Limited (PSPCL) suddenly decided to the leave the building in 2019 50 years after r… [+5292 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sourav Roy Barman", "title": "Ease of doing politics: Bhagwant Mann takes a leaf out of Arvind Kejriwal’s public consultation book", "description": "The Punjab government, headed by Chief Minister Bhagwant Mann, has sought views of traders, ranging from small shopkeepers to industrialists, on repealing unnecessary licences and attracting investment.", "url": "https://indianexpress.com/article/india/political-pulse/bhagwant-mann-arvind-kejriwal-aap-public-opinion-7903527/", "urlToImage": "https://images.indianexpress.com/2022/05/Mann-2.jpg", "publishedAt": "2022-05-06T01:36:45Z", "content": "The Aam Aadmi Party (AAP)-led Punjab government has launched a public consultation exercise on ways to improve the ease of doing business in the state.As part of this initiative, the Punjab governmen… [+3628 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Punjab: AAP govt rolls out drive to hire over 26,000 people across 25 depts", "description": "Chief Minister Bhagwant Mann said that the recruitment for 26,454 vacancies in 25 different departments would be accomplished in a corruption free and impartial manner.", "url": "https://indianexpress.com/article/cities/chandigarh/aap-govt-rolls-out-drive-to-hire-over-26000-people-across-25-depts-7903528/", "urlToImage": "https://images.indianexpress.com/2022/05/Mann-1-2.jpg", "publishedAt": "2022-05-06T01:34:34Z", "content": "As AAP government in Punjab completed 50 days, Chief Minister Bhagwant Mann Thursday said that a massive recruitment has been advertised to mark the milestone.The Chief Minister said that the recruit… [+824 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Deeksha Teri", "title": "‘Your govt doesn’t support us’: Indian students allege raw deal from some Ukrainian teachers", "description": "Several Indian medical students, who have returned following Russian invasion of Ukraine, say a section of their teachers believe they might reflect New Delhi's 'pro-Russia' position.", "url": "https://indianexpress.com/article/education/your-govt-doesnt-support-us-indian-students-allege-raw-deal-from-some-ukrainian-teachers-7900956/", "urlToImage": "https://images.indianexpress.com/2022/03/Indians-Ukraine-border.jpg", "publishedAt": "2022-05-06T01:30:29Z", "content": "Many Indian students pursuing medical courses in Ukraine, who returned home following Russia’s invasion of that country in February, seem to be uncertain about going back to their universities. They … [+4479 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "‘AAP will speed up drive to free govt land from encroachments’", "description": "The Rural Development & Panchayats Department, he said, had in the last few days illegal possessions have been removed from 79 acres and one kanal of land, including 62 acres of land only in Jalandhar division.", "url": "https://indianexpress.com/article/cities/jalandhar/aap-will-speed-up-drive-to-free-govt-land-from-encroachments-7903521/", "urlToImage": "https://images.indianexpress.com/2022/05/encroachments-2.jpg", "publishedAt": "2022-05-06T01:28:16Z", "content": "Punjab Rural Development and Panchayats Minister Kuldeep Singh Dhaliwal Thursday claimed that he his department has manged to get 100 acres of government land freed from illegal possession across the… [+6 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Rrecruitment row: HC stays order sacking Haryana warehousing corporation manager", "description": "The court was told that the current MD joined on April 8, and started inquiry in the selections made by Ashok Khemka in 2010 and as a fallout, the services of the petitioner were terminated on April 20, 2022.", "url": "https://indianexpress.com/article/cities/chandigarh/rrecruitment-row-hc-stays-order-sacking-haryana-warehousing-corporation-manager-7903512/", "urlToImage": "https://images.indianexpress.com/2022/05/indian-express-2.jpeg", "publishedAt": "2022-05-06T01:22:16Z", "content": "The Punjab and Haryana High Court has stayed the operation of an order, issued by the Managing Director of the Haryana State Warehousing Corporation, terminating a manager of the Corporation.The peti… [+1646 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Peter Vidal", "title": "Horoscope Today, May 6, 2022: Libra, Aries, Pisces and other signs — check astrological prediction", "description": "Virgo-- You may try to go easy on yourself; no matter what pressures you're under, you really should let go and enjoy yourself. Partners have much to teach you about letting your hair down, sowing wild oats and generally being irresponsible!", "url": "https://indianexpress.com/article/horoscope/horoscope-today-may-6-2022-libra-aries-pisces-and-other-signs-check-astrological-prediction-7903516/", "urlToImage": "https://images.indianexpress.com/2022/04/HORO21.jpg", "publishedAt": "2022-05-06T01:20:08Z", "content": "Whats on the cards today for you? Aries,  you may now expect a brief burst of passion in one special relationship. Leo, professional decisions should now become much easier and before another week is… [+3803 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Punjab issues guidelines for running govt schools in double shift", "description": "In summers, morning shift will be from 7 am to 12 noon, and in winters from 7.30 am to 12.15 pm. In summers, evening shift will be from 12.30 pm to 5.30 pm and in winters from 12.30 pm to 5.15 pm.", "url": "https://indianexpress.com/article/cities/ludhiana/punjab-issues-guidelines-for-running-govt-schools-in-double-shift-7903508/", "urlToImage": "https://images.indianexpress.com/2022/05/punjab-govt-schools.jpg", "publishedAt": "2022-05-06T01:11:27Z", "content": "The Punjab government Thursday issued a set of guidelines for running government schools in double shift. An order issued by principal secretary (education) Alok Shekhar said that government schools … [+1533 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "ANJU AGNIHORI CHABA", "title": "Explained: Why Punjab’s DSR push matters, how much groundwater will it save", "description": "Last year, 18% (5.62 lakh hectares) of the total rice area in the state was under DSR against government target of bringing 10 lakh hectares under it.", "url": "https://indianexpress.com/article/explained/explained-why-punjabs-dsr-push-matters-how-much-groundwater-will-it-save-farmers-7903504/", "urlToImage": "https://images.indianexpress.com/2022/05/paddy-1.jpg", "publishedAt": "2022-05-06T01:05:15Z", "content": "The Punjab government recently announced Rs 1,500 incentive per acre for farmers opting for Direct Seeding of Rice (DSR), which is known for saving water. Last year, 18% (5.62 lakh hectares) of the t… [+4601 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "To save groundwater, Mann asks farmers to go for alternative crops", "description": "The CM then went on to appeal to the farmers to sow paddy only during the monsoon season so that groundwater could be saved enormously. Mann said it was a collective duty to save this precious natural resource for future generations.", "url": "https://indianexpress.com/article/cities/ludhiana/to-save-groundwater-bhagwant-mann-asks-farmers-to-go-for-alternative-crops-7903502/", "urlToImage": "https://images.indianexpress.com/2022/05/Mann-1-1.jpg", "publishedAt": "2022-05-06T00:56:13Z", "content": "Punjab Chief Minister, Bhagwant Mann, on Thursday called upon the farmers to save the air, water and land of Punjab by getting rid of the traditional crop cycle and adopting alternative crops, which … [+1943 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kanchan Vasdev", "title": "With GST grant set to end, Punjab’s AAP regime stares at tough times ahead", "description": "The revenue shortfall comes at a time when the AAP is looking to come good on its pre-poll promises of different freebies to voters.", "url": "https://indianexpress.com/article/cities/chandigarh/with-gst-grant-set-to-end-punjabs-aap-regime-stares-at-tough-times-ahead-7903499/", "urlToImage": "https://images.indianexpress.com/2022/05/Mann-1.jpg", "publishedAt": "2022-05-06T00:49:00Z", "content": "Saddled with a debt of Rs 3 lakh crore it inherited from the previous regime, Punjab’s Aam Aadmi Party government is staring at a financial crisis with Centre set to stop the GST compensation grant f… [+3329 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anju Agnihotri Chaba", "title": "Punjab wheat mandi purchases hit 15-year high, but farmers struggle to recover costs", "description": "The lower premium over MSP that the farmers in Punjab are receiving is being attributed to the high levies payable on grain purchases from the state's APMC mandis.", "url": "https://indianexpress.com/article/cities/jalandhar/punjab-wheat-mandi-purchase-farmers-costs-msp-loss-7903497/", "urlToImage": "https://images.indianexpress.com/2022/05/wheat-punjab.jpg", "publishedAt": "2022-05-06T00:38:14Z", "content": "Wheat purchases from mandis (markets) in Punjab this marketing season have touched a 15-year high of almost six lakh tonnes. But farmers are not happy. The reason? Flour millers and traders are payin… [+4669 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Asad Rehman", "title": "School principal booked for ‘asking students to dress up in Eid attire’", "description": "Mustafa is the principal of CBSE-affiliated Nyaya Nagar Public School located in Havelia area under Jhunsi police station. The school has over 1,200 students.", "url": "https://indianexpress.com/article/cities/lucknow/school-principal-booked-for-asking-students-to-dress-up-in-eid-attire-7903481/", "urlToImage": "https://images.indianexpress.com/2022/05/IE-79-6.jpeg", "publishedAt": "2022-05-05T23:38:19Z", "content": "The principal of a private school was booked in Prayagraj on Wednesday on charges of hurting religious sentiments after she allegedly directed students to post 20-second videos wearing Eid attire as … [+3296 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "‘Enemy property’ case: HC reserves order on Azam bail application", "description": "The court said that the order would be pronounced in the second week of May.  Azam has been in jail for more than two years in connection with 87 cases lodged against him since 2017. He is currently lodged in Sitapur jail.", "url": "https://indianexpress.com/article/cities/lucknow/enemy-property-case-hc-reserves-order-on-azam-bail-application-7903479/", "urlToImage": "https://images.indianexpress.com/2022/05/Azam-Khan-1200.jpg", "publishedAt": "2022-05-05T23:26:49Z", "content": "The Allahabad High Court on Thursday reserved its order while hearing the bail plea of Samajwadi Party MLA Azam Khan in an alleged case of grabbing Enemy Property that was  purportedly used for the c… [+1832 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Maulshree Seth", "title": "Free Wi-Fi at all 58,189 gram panchayat secretariats soon", "description": "The facility will help villagers to avail services related to documents, land records through common service centre", "url": "https://indianexpress.com/article/cities/lucknow/free-wi-fi-at-all-58189-gram-panchayat-secretariats-soon-7903474/", "urlToImage": "https://images.indianexpress.com/2022/05/internet.jpg", "publishedAt": "2022-05-05T23:24:17Z", "content": "THE STATE government on Thursday announced that free Wi-Fi facilities would soon be provided in all its 58,000 gram panchayats.The facility would be provided in a 50-metre radius of Gram Sachivalaya … [+2235 chars]"}]}