{"status": "ok", "totalResults": 655, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Kirit Somaiya moves Bombay HC against cabinet waiver of Rs 3.3 crore fine imposed on Shiv Sena MLA’s housing project", "description": "Of the 2,707 square metre that has been constructed, the developer has built 2,089 sq metre without any permission and has constructed 13 floors. He had also asked for a regularisation in 2013 and 2014, Somaiya said.", "url": "https://indianexpress.com/article/cities/mumbai/kirit-somaiya-bombay-hc-fine-shiv-sena-housing-project-7893686/", "urlToImage": "https://images.indianexpress.com/2022/04/Kirit-1.jpg", "publishedAt": "2022-04-29T10:49:28Z", "content": "BJP MP Kirit Somiaya Friday approached the Bombay High Court with a PIL challenging the state cabinet resolution of January which gave a waiver of a fine of Rs 3.33 crore along with interest on penal… [+2379 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Explained: Why US needs a law to sell off oligarchs’ assets", "description": "In the latest attempt to pressure Russia to end its war and to pay for the enormous costs of defending Ukraine, the Biden administration on Thursday called on Congress to enhance US authority to liquidate assets seized from Russian elites — the “bad guys,” as…", "url": "https://indianexpress.com/article/explained/ukraine-war-russian-oligarchs-joe-biden-us-law-7893690/", "urlToImage": "https://images.indianexpress.com/2022/04/Biden-2.jpg", "publishedAt": "2022-04-29T10:34:13Z", "content": "President Joe Biden doesn’t want to just seize the yachts, luxury homes and other assets of Russian oligarchs, he wants to sell off the pricey goods and use the money to help rebuild Ukraine. He’s as… [+5695 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "‘Once was CM of Delhi who stretched from his head to belly’: Tharoor’s poem on ‘mannerless’ row", "description": "The BJP had criticised Kejriwal on Wednesday over his \"mannerless\" posture during a meeting with Prime Minister Narendra Modi on the Covid situation", "url": "https://indianexpress.com/article/india/cm-delhi-arvind-kejriwal-tharoor-poem-mannerless-row-7893689/", "urlToImage": "https://images.indianexpress.com/2022/04/tharoor-kejriwal.jpg", "publishedAt": "2022-04-29T10:34:13Z", "content": "Senior Congress leader Shashi Tharoor on Friday took a dig at the BJP and AAP convener Arvind Kejriwal with a poem over the Delhi Chief Minister’s “mannerless” posture row.The BJP had criticised Kejr… [+1316 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Ukraine President Zelenskyy reveals Russian troops came close to capturing him in initial days of invasion", "description": "In an interview with the TIME magazine, Zelenskyy said that the military informed him that teams of Russian strikers had parachuted into the capital city of Kyiv in order to kill or capture him and his family.", "url": "https://indianexpress.com/article/world/ukraine-president-zelenskyy-russian-troops-7893570/", "urlToImage": "https://images.indianexpress.com/2022/04/zelenskyy-ukraine.jpg", "publishedAt": "2022-04-29T10:33:28Z", "content": "Ukrainian President Volodymyr Zelenskyy, in an interview with the TIME magazine, opened up about his close brush with being captured or killed by Russian troops in the initial days of the Russian inv… [+2018 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Aishwarya Mohanty", "title": "56-year-old Odisha MLA appears for Class X exam, says his wish got fulfilled", "description": "“Education not only ensures a good job but creates an impact on one’s life by adding knowledge and value,” Phulbani MLA Angada Kanhar said.", "url": "https://indianexpress.com/article/cities/bhubaneswar/56-year-old-odisha-mla-class-10-exam-7893694/", "urlToImage": "https://images.indianexpress.com/2022/04/download-59.jpg", "publishedAt": "2022-04-29T10:31:38Z", "content": "At the age of 56, Biju Janata Dal (BJD) lawmaker from Phulbani in Odisha, Angada Kanhar, has finally fulfilled his long-awaited dream to appear for his Class X examinations.On Friday, Kanhar was amon… [+1979 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Rinku Ghosh", "title": "What makes the Badami Cave Temples symbols of shared thought and learning", "description": "There’s a harmony there, like no other, with Shaivaite, Vaishnavite and Jain sculptures finding their place in cavernous halls tiered above one another", "url": "https://indianexpress.com/article/express-sunday-eye/what-makes-the-badami-cave-temples-symbols-of-shared-thought-and-learning-7893388/", "urlToImage": "https://images.indianexpress.com/2022/04/badami-caves-1.jpg", "publishedAt": "2022-04-29T10:30:14Z", "content": "A short drive from town takes us to the soaring volcanic rocks of Badami, so called because they look like giant almonds grown on another planet but piled up haphazardly, terrifying, fiery, burning l… [+5324 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Explained: Rivaling Cold War exodus, Cuban migration to the US is soaring. Here’s why", "description": "The number of Cubans leaving their homeland has soared in recent months. Why are so many Cubans leaving the island? How does this exodus compare to previous waves of migration out of Cuba? How has the US responded?", "url": "https://indianexpress.com/article/explained/cuban-migration-to-united-states-7893660/", "urlToImage": "https://images.indianexpress.com/2022/04/cuba-1.jpg", "publishedAt": "2022-04-29T10:29:40Z", "content": "The number of Cubans leaving their homeland has soared in recent months. The migration, often via irregular and dangerous routes over land and sea, has sparked new tensions between the island´s commu… [+4078 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kamaldeep Singh Brar", "title": "Punjab power crisis: Farmers’ union protests outside minister’s house, AAP blames Centre", "description": "The activists first gathered at the Golden Gate on Friday before marching to the minister’s residence and staging a dharna there.", "url": "https://indianexpress.com/article/cities/amritsar/punjab-power-crisis-farmers-union-protest-aap-blames-centre-7893688/", "urlToImage": "https://images.indianexpress.com/2022/04/Punjab-power-crisis.jpg", "publishedAt": "2022-04-29T10:29:29Z", "content": "The Kisan Mazdoor Sangarsh Committee (KMSC) in Punjab protested outside the residence of state power minister Harbhajan Singh ETO in Amritsar on Friday against the power cuts in the state, even as th… [+1625 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Gujarat MLA Jignesh Mevani granted bail in ‘assault’ case", "description": "After being granted bail in a \"defamatory\" tweet case, Mevani on Monday was rearrested in a fresh case filed in Barpeta district under various charges including assault of a public servant and outraging a woman’s modesty.", "url": "https://indianexpress.com/article/north-east-india/assam/jignesh-mevani-bail-assault-case-gujarat-mla-7893687/", "urlToImage": "https://images.indianexpress.com/2022/04/MEVANI-1.jpg", "publishedAt": "2022-04-29T10:28:52Z", "content": "Gujarat MLA Jignesh Mevani was granted bail on Friday by a sessions court in Assam’s Barpeta. After being granted bail in a “defamatory” tweet case last Monday, Mevani was rearrested in a fresh case … [+559 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Manoj Kumar R", "title": "Acharya movie review: Chiranjeevi, Ram Charan seem inadequate to save this spiritless film", "description": "Acharya  Movie Review Live News: The writing is so poor that even the massive stardom of Chiranjeevi and Ram Charan feel inadequate to lift this movie. It's a snooze town.", "url": "https://indianexpress.com/article/entertainment/movie-review/acharya-movie-review-chiranjeevi-ram-charan-7893549/", "urlToImage": "https://images.indianexpress.com/2022/04/Ram-Charan-and-Chiranjeevi-1200by667.jpeg", "publishedAt": "2022-04-29T10:26:46Z", "content": "Acharya movie director: Koratala SivaAcharya movie cast: Chiranjeevi, Ram CharanAcharya movie ratings: 1 starAcharya, starring Telugu superstar Chiranjeevi, is set in the fictional temple town of Dha… [+2240 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sadaf Modak", "title": "Intent was to challenge law and order, recommend dissolution of govt: Mumbai Police opposes bail pleas of Navneet, Ravi Rana", "description": "The police said that the Rana couple’s interviews with the media between April 20 to April 23 ‘crossed limits of fair criticism permitted by law in a democratic country’ and are within the ambit of section 124A (sedition) of the Indian Penal Code.", "url": "https://indianexpress.com/article/cities/mumbai/challenge-law-order-dissolution-govt-mumbai-police-bail-navneet-ravi-rana-7893628/", "urlToImage": "https://images.indianexpress.com/2022/04/RaviRanaandNavneetRana01.jpg", "publishedAt": "2022-04-29T10:24:33Z", "content": "The Mumbai police Friday, opposing the bail of Independent MP Navneet Rana and her husband MLA Ravi Rana, claimed that their announcement to recite Hanuman Chalisa in front of the private residence o… [+4120 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Vandana Kalra", "title": "At India Art Fair, sights and sounds attract, compelling artworks make a mark: A roundup", "description": "After a gap year due to the pandemic, the 13th edition of the India Art Fair brings together masters and contemporaries, and covers a huge gamut -- from indigenous art to NFT works", "url": "https://indianexpress.com/article/lifestyle/art-and-culture/at-india-art-fair-sights-and-sounds-attract-compelling-artworks-make-a-mark-a-roundup-7893355/", "urlToImage": "https://images.indianexpress.com/2022/04/India-Art-Fair-madhvi-parekh-1200.jpg", "publishedAt": "2022-04-29T10:20:50Z", "content": "The modernists are always in demand and it is no different at the art fair this year. So, at numerous places booth are on display with the contemporaries and at other places they dominate the entire … [+7232 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "PV Sindhu enters BAC semifinals, assured of a medal", "description": "Sindhu galloped to 11-2 lead in no time and then kept things under her firm grip to take a 1-0 lead in the match.", "url": "https://indianexpress.com/article/sports/badminton/pv-sindhu-enters-bac-semifinals-assured-of-a-medal-7893683/", "urlToImage": "https://images.indianexpress.com/2022/04/Untitled-design-22.jpg", "publishedAt": "2022-04-29T10:20:42Z", "content": "Double Olympic medallist P V Sindhu eked out a thrilling win over China’s He Bing Jiao to make it to the women’s singles semifinals of the Badminton Asia Championships on Friday. With this win, Sindh… [+1405 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Hottest locations this summer have been in Maharashtra and Rajasthan: IMD", "description": "The heatwave conditions will continue over Punjab, Haryana, Delhi, west Uttar Pradesh, Jharkhand interior Odisha, Bihar, Chhattisgarh, Gujarat and Telangana till May 3.", "url": "https://indianexpress.com/article/cities/pune/hottest-locations-summer-have-been-in-maharashtra-rajasthan-imd-7893659/", "urlToImage": "https://images.indianexpress.com/2022/04/heatwave-3.jpg", "publishedAt": "2022-04-29T10:18:57Z", "content": "Maharashtra and Rajasthan seem to be facing the maximum heat from the continuing heatwave conditions this summer. Both states have come under the influence of three of the four heatwaves to have affe… [+2145 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Google blocked over 1.2 million policy violating apps from Play Store in 2021", "description": "The 2021 edition comes a day after the company's Data safety section has started to roll out.", "url": "https://indianexpress.com/article/technology/tech-news-technology/google-blocked-1-2-million-policy-violating-apps-from-play-store-in-2021-7893606/", "urlToImage": "https://images.indianexpress.com/2022/03/Google_Logo_Reuters_1-1.jpg", "publishedAt": "2022-04-29T10:17:24Z", "content": "Google has revealed that it banned 1.2 million ‘policy-breaking’ apps from being released on its play store, in its effort to combat fraudulent and spammy apps and developers. Over 190,000 developer … [+2156 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "NCHM JEE 2022 application deadline extended; check revised date here", "description": "The submission of online application forms to apply for NCHM JEE 2022 will conclude on May 16, 2022, at 5 pm. Visit the official website of NCHM JEE — nchmjee.nta.nic.in", "url": "https://indianexpress.com/article/education/nchm-jee-2022-application-deadline-extended-check-revised-date-here-nchmjee-nta-nic-in-7893226/", "urlToImage": "https://images.indianexpress.com/2022/04/NEET-A.jpg", "publishedAt": "2022-04-29T10:10:39Z", "content": "The National Testing Agency (NTA) has extended the last date for the submission of online applications for the National Council of Hotel Management Joint Entrance Examination (NCHM JEE) 2022. Interes… [+932 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Lawmaker: Sri Lanka president agrees to remove brother as PM", "description": "President Gotabaya Rajapaksa agreed that a national council will be appointed to name a new prime minister and Cabinet comprised of all parties in Parliament, lawmaker Maithripala Sirisena said after meeting with the president.", "url": "https://indianexpress.com/article/world/sri-lanka-president-gotabaya-rajapaksa-brother-mahinda-pm-7893640/", "urlToImage": "https://images.indianexpress.com/2022/04/mahinda-1.jpg", "publishedAt": "2022-04-29T10:09:56Z", "content": "Sri Lanka’s president has agreed to replace his older brother as prime minister in a proposed interim government to solve a political impasse caused by the country’s worst economic crisis in decades,… [+1051 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Kejriwal praises Atishi for United Nations speech on ‘Delhi model of governance’", "description": "The AAP chief says the MLA’s address to the UN General Assembly was ‘a moment of pride for India’ and that ‘the world is now looking up to Delhi for solutions in many areas of urban governance’.", "url": "https://indianexpress.com/article/cities/delhi/kejriwal-praises-atishi-for-united-nations-speech-on-delhi-model-of-governance-7893656/", "urlToImage": "https://images.indianexpress.com/2022/04/Kejriwal-4.jpg", "publishedAt": "2022-04-29T10:08:31Z", "content": "Aam Aadmi Party supremo and Delhi Chief Minister Arvind Kejriwal praised party MLA Atishis speech at the United Nations on Friday.In her speech titled Delhi model of governance, the Oxford-educated K… [+1714 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "IIT-Delhi to organise DIY summer boot camp for school students", "description": "Interested students can submit their applications till May 7 or until the slots are available. If students have any concerns or queries, they can write an email at acadoutreach@admin.iit.ac.in", "url": "https://indianexpress.com/article/education/iit-delhi-diy-summer-boot-camp-school-students-7893657/", "urlToImage": "https://images.indianexpress.com/2022/04/sfdf.jpg", "publishedAt": "2022-04-29T10:08:29Z", "content": "The Indian Institute of Technology (IIT) Delhi will organise a do-it-yourself (DIY) summer boot camp named Change.Makers for high school students where the students of classes 11 and 12 will be able … [+1453 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AglaSem", "title": "WBJEE 2022 tomorrow: Check important exam day guidelines", "description": "Candidates appearing for the exam on April 30, 2022, must reach the exam center by the reporting time mentioned in the admit card.", "url": "https://indianexpress.com/article/education/wbjee-2022-important-exam-day-guidelines-7893649/", "urlToImage": "https://images.indianexpress.com/2022/04/GUJCET.jpg", "publishedAt": "2022-04-29T10:06:30Z", "content": "The West Bengal Joint Entrance Examination Board (WBJEEB) will conduct theWBJEE 2022 exam on April 30, 2022. Paper 1 will be held from 11 am to 1 pm, and paper 2 from 2 pm to 4 pm.With little to no t… [+1449 chars]"}]}