{"status": "ok", "totalResults": 488, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "ECB officials concerned over cocaine fuelling crowd trouble ahead of England-India Edgbaston Test", "description": "The Sunday Times reported that cricket officials in England believe antisocial behaviour at grounds this summer is being fuelled by cocaine use among spectators post two years of Covid restrictions public gatherings at sports and social events.", "url": "https://indianexpress.com/article/sports/cricket/ecb-officials-concerned-over-cocaine-fuelling-crowd-trouble-ahead-of-england-india-edgbaston-test-7995325/", "urlToImage": "https://images.indianexpress.com/2022/06/England-fans.jpg", "publishedAt": "2022-06-28T06:48:53Z", "content": "Ahead of the one-off England-India Test match in Edgbaston, the England and Wales Cricket Board officials have a major issue to worry and work on. Cocaine fuelled anti social behavior of fans at grou… [+1734 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Amitabh Bachchan was minding his own business, then Aamir Khan knocked on his car window. See picture here", "description": "Amitabh Bachchan bumped into Aamir Khan on Monday, and couldn't help but share a picture of their chance encounter on Instagram.", "url": "https://indianexpress.com/article/entertainment/bollywood/amitabh-bachchan-aamir-khan-chance-encounter-picture-7995371/", "urlToImage": "https://images.indianexpress.com/2022/06/aamir-khan-amitabh-bachchan.jpg", "publishedAt": "2022-06-28T06:46:22Z", "content": "Actor Amitabh Bachchan had a chance encounter with Aamir Khan on Monday, as they were both out on professional assignments. While Amitabh posed for a photograph with ‘stalwarts of cinema’, Aamir has … [+1333 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Violent threats to election workers are common. Prosecutions are not.", "description": "Colorado alone has forwarded at least 500 threats against election workers to the task force, Griswold said.", "url": "https://indianexpress.com/article/world/violent-threats-to-election-workers-are-common-prosecutions-are-not-7995365/", "urlToImage": "https://images.indianexpress.com/2022/06/ELECTION-WORKER-THREATS-2.jpg", "publishedAt": "2022-06-28T06:39:52Z", "content": "Do you feel safe? You shouldnt.\r\nIn August, 42-year-old Travis Ford of Lincoln, Nebraska, posted those words on the personal Instagram page of Jena Griswold, the secretary of state and chief election… [+7962 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Tiger Shroff tries hard to ‘keep up with’ dad Jackie Shroff in new video, fans call him ‘OG style king’", "description": "Tiger Shroff and Jackie Shroff posed together for cameras, and fans had a field day complimenting the father-son duo.", "url": "https://indianexpress.com/article/entertainment/bollywood/tiger-shroff-shares-a-video-with-father-jackie-shroff-fans-say-he-is-the-og-style-king-7995368/", "urlToImage": "https://images.indianexpress.com/2022/06/tiger-jackie-shroff.jpg", "publishedAt": "2022-06-28T06:38:13Z", "content": "Apart from his smooth dance moves, Tiger Shroff’s fans also love him for his swag and style. However, as the actor shared a video with his father Jackie Shroff, they were quick to call the senior act… [+1843 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Shericka Jackson’s feat makes the women’s sprint events a must watch at World Athletics Championships next month", "description": "Shericka Jackson (21.55 seconds) ran the third-fastest 200 metres in history on Sunday; Elaine Thompson-Herah will be gunning for the evergreen 100 metres record of Florence  Griffith-Joyner (21.34) set in 1988; add the legendary Shelly-Ann Fraser-Pryce to th…", "url": "https://indianexpress.com/article/sports/sport-others/shericka-jackson-feat-makes-the-womens-sprint-events-a-must-watch-at-world-athletics-championships-next-month-7995456/", "urlToImage": "https://images.indianexpress.com/2022/06/jackson.jpg", "publishedAt": "2022-06-28T06:38:11Z", "content": "For a while the worry for the world of athletics has been who will fill the void left by the great sprinter Usain Bolt. The World Championships in Oregon is next month and Yohan’s Blake’s return to f… [+4238 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Birthday girl Jasmin Bhasin gets a sweet surprise from boyfriend Aly Goni; parties with Rahul Vaidya, Disha Parmar, Ankita Lokhande", "description": "Jasmin Bhasin's birthday party was all about friendship and love as she was joined by boyfriend Aly Goni and friends Disha Parmar, Krishna Mukherjee, Sandiip Sikcand and Ankita Lokhande.", "url": "https://indianexpress.com/article/entertainment/television/jasmin-bhasin-birthday-aly-goni-parties-with-rahul-vaidya-disha-parmar-ankita-lokhande-7995252/", "urlToImage": "https://images.indianexpress.com/2022/06/jasmin-bhasin-aly-goni-rahul-vaidya.jpg", "publishedAt": "2022-06-28T06:38:03Z", "content": "Actor Jasmin Bhasin is celebrating her 30th birthday today. On the occasion, boyfriend Aly Goni and her close friends got together to ring in her big day. Fans were also delighted to see Jasmin and A… [+1516 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Indian Railways cancels 141 trains, reschedules 52 planned for Tuesday", "description": "Railway stations in several states, including those in Uttar Pradesh, Bihar, Jharkhand and Telangana, have been attacked by the agitators", "url": "https://indianexpress.com/article/india/indian-railways-cancels-141-trains-reschedules-52-planned-for-tuesday-7995377/", "urlToImage": "https://images.indianexpress.com/2022/06/railways-1-4.jpg", "publishedAt": "2022-06-28T06:35:03Z", "content": "As many as 141 trains scheduled for Tuesday have been cancelled and 52 others partially, according to an Indian Railways press release.Among the trains cancelled include SGLA-ANDI KISAN SPL (00101), … [+1317 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Bloomberg", "title": "Vladimir Putin to leave Russia for first time since the Ukraine invasion", "description": "Russian President Vladimir Putin is due to attend the Caspian summit in Turkmenistan Wednesday.", "url": "https://indianexpress.com/article/world/vladimir-putin-to-leave-russia-for-first-time-since-the-ukraine-invasion-7995460/", "urlToImage": "https://images.indianexpress.com/2022/06/vladimir-putin-russian-economy-featured.jpg", "publishedAt": "2022-06-28T06:34:25Z", "content": "Russian President Vladimir Putin will travel to Tajikistan on Tuesday and later visit Turkmenistan for a summit of Caspian Sea nations, his spokesman said, in the first foreign trip by the Russian le… [+163 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Iran applies to join BRICS group of emerging countries", "description": "Iran's membership in the BRICS group, which includes Brazil, Russia, India, China and South Africa, \"would result in added values for both sides,\" Iran's Foreign Ministry spokesperson said.", "url": "https://indianexpress.com/article/world/iran-applies-to-join-brics-group-of-emerging-countries-7995450/", "urlToImage": "https://indianexpress.com/wp-content/themes/indianexpress/images/IE-OGimage.jpg", "publishedAt": "2022-06-28T06:32:43Z", "content": "Iran has submitted an application to become a member in the group of emerging economies known as the BRICS, an Iranian official said on Monday.Iran’s membership in the BRICS group, which includes Bra… [+1459 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "PM Modi leaves for UAE after attending G7 Summit in Germany", "description": "In the UAE, PM Modi will convey his personal condolences on the passing away of Sheikh Khalifa bin Zayed Al Nahyan, the former UAE President and Abu Dhabi ruler. He had been in the office since 2004 and died on May 13th.", "url": "https://indianexpress.com/article/india/pm-narendra-modi-uae-visit-g7-summit-7995374/", "urlToImage": "https://images.indianexpress.com/2022/06/AP06_27_2022_000158B.jpg", "publishedAt": "2022-06-28T06:30:19Z", "content": "“PM @narendramodi concludes his visit to Germany for the G7 Summit, wrapping up two days of productive discussions on sustainable solutions to global challenges, PM Modi now emplanes for Abu Dhabi fo… [+2622 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "The Conversation", "title": "Women are at greater risk of stroke, the more miscarriages or stillbirths they’ve had", "description": "The women were aged between 32 and 73 when they were first enrolled in the studies and were followed up for an average of 11 years.", "url": "https://indianexpress.com/article/lifestyle/health/women-greater-risk-stroke-more-miscarriages-stillbirths-7985775/", "urlToImage": "https://images.indianexpress.com/2022/06/women-stroke_200_pixabay.jpg", "publishedAt": "2022-06-28T06:30:16Z", "content": "New research shows women who have had a miscarriageor stillbirth, have an increased risk of stroke when blood can’t get to the brain, because of a blocked or burst artery. That risk increases with ea… [+6085 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Instagram and Facebook remove posts offering abortion pills", "description": "Such social media posts ostensibly aimed to help women living in states where preexisting laws banning abortion suddenly snapped into effect on Friday.", "url": "https://indianexpress.com/article/world/instagram-facebook-abortion-7995352/", "urlToImage": "https://images.indianexpress.com/2022/06/drugs-1.jpg", "publishedAt": "2022-06-28T06:24:19Z", "content": "Facebook and Instagram have begun promptly removing posts that offer abortion pills to women who may not be able to access them following a Supreme Court decision that stripped away constitutional pr… [+3641 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Deutsche Welle", "title": "Sri Lanka suspends non-essential fuel supply amid shortages", "description": "Fuel will be rationed for two weeks as shortages and inflation continue to wreak havoc on Sri Lanka. Colombo is hoping Russian energy can solve its problems.", "url": "https://indianexpress.com/article/world/sri-lanka-suspends-non-essential-fuel-supply-amid-shortages-7995386/", "urlToImage": "https://images.indianexpress.com/2022/06/sri-lanka-1.jpg", "publishedAt": "2022-06-28T06:20:38Z", "content": "The Sri Lankan government will ration the supply of fuel to essential services such as transport, health and food deliveries for two weeks from Tuesday, it announced on Monday.“From midnight today, n… [+2440 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Canada announces new task force to address delay in processing immigration applications", "description": "Canada has an immigration application backlog of over 2.4 million people, as per recent reports.", "url": "https://indianexpress.com/article/world/canada-immigration-application-delay-7995298/", "urlToImage": "https://images.indianexpress.com/2022/06/canada-1.jpg", "publishedAt": "2022-06-28T06:18:23Z", "content": "Canada will have a new task force to address the delays in the processing of immigration applications and passports, announced Prime Minister Justin Trudeau on June 25.“The task force will drive acti… [+2187 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "New Yorker convicted of importing illegal controlled substances from India", "description": "Ezhil Sezhian Kamaldoss, from Queens in New York, faces up to 50 years of imprisonment.", "url": "https://indianexpress.com/article/world/united-states/new-yorker-convicted-importing-illegal-controlled-substances-india-7995323/", "urlToImage": "https://images.indianexpress.com/2022/05/jail-1.jpg", "publishedAt": "2022-06-28T06:18:21Z", "content": "A federal grand jury on Monday convicted a New Yorker of importing illegal controlled substances from India and money laundering, a US attorney said.Ezhil Sezhian Kamaldoss, from Queens in New York, … [+1622 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "SGPC chief writes to MEA, proposes to send delegation to Afghanistan", "description": "The body has also offered to take care of the historical gurdwaras and Sikh heritage in Afghanistan.", "url": "https://indianexpress.com/article/cities/chandigarh/sgpc-chief-writes-to-mea-proposes-to-send-delegation-to-afghanistan-7995404/", "urlToImage": "https://images.indianexpress.com/2022/03/sgpc-thumb759.jpg", "publishedAt": "2022-06-28T06:18:13Z", "content": "Days after two people were killed in a terror attack on Gurdwara Dashmesh Pita Sri Guru Gobind Singh in Karte Parwan, Kabul, on June 18, the Shiromani Gurdwara Parbandhak Committee (SGPC) in a letter… [+1458 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Deutsche Welle", "title": "Ahead of NATO summit, alliance sets out plan to increase high-alert forces", "description": "Ahead of the annual NATO Summit in Madrid this week, the alliance's chief announced plans to increase the number of its high-readiness forces and bolster its eastern flank.", "url": "https://indianexpress.com/article/world/nato-alliance-summit-increase-high-alert-forces-7995383/", "urlToImage": "https://images.indianexpress.com/2022/06/nato-summit.jpeg", "publishedAt": "2022-06-28T06:17:25Z", "content": "“We will transform NATO’s response force and increase the number of our high readiness forces to well over 300,000,” NATO chief Stoltenberg told reporters in Brussels on Monday, as part of what he ca… [+5489 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "AIADMK infighting over solo leadership reaches Election Commission", "description": "O Panneerselvam has taken the fight to the Election Commission, blaming vested interests over the single leadership tussle favouring Edappadi K Palaniswami, after asserting that Monday's meeting of top AIADMK functionaries was not valid.", "url": "https://indianexpress.com/article/cities/chennai/aiadmk-palaniswami-pannerselvam-ec-7995310/", "urlToImage": "https://images.indianexpress.com/2022/06/EPS-OPS-2.jpg", "publishedAt": "2022-06-28T06:16:06Z", "content": "The AIADMK’s dominant Edappadi K Palaniswami (EPS) camp on Monday slammed rival leader O Panneerselvam (OPS) as a symbol of ‘betrayal’ and said the upcoming General Council meet shall decide whether … [+4030 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Omkar Gokhale", "title": "Mere friendship with woman is not consent for sexual relationship: Bombay HC", "description": "A single-judge bench of Justice Bharati H Dangre on June 24, while rejecting anticipatory bail to a man booked for allegedly raping a woman on the pretext of marriage, said his friendly relationship with her did not give him the license to force himself upon …", "url": "https://indianexpress.com/article/cities/mumbai/bombay-high-court-friendship-sexual-relations-7995040/", "urlToImage": "https://images.indianexpress.com/2022/06/HC.jpeg", "publishedAt": "2022-06-28T06:16:02Z", "content": "The Bombay High Court recently held that merely sharing a friendly relationship with a woman does not permit a man to take her for granted and construe it as her consent to establish a physical relat… [+2261 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "‘PM Modi understands potential of India-US relationship’: Ambassador Sandhu", "description": "The event was organised by eminent Indian-Americans including Bharat Barai, Darshan Singh Dhaliwal. It was attended by a large number of Sikhs. The event was attended by a large number of Sikhs from various parts of the Midwest.", "url": "https://indianexpress.com/article/world/pm-modi-understands-potential-of-india-us-relationship-ambassador-sandhu-7995334/", "urlToImage": "https://images.indianexpress.com/2021/10/taranjit-sandhu.jpg", "publishedAt": "2022-06-28T06:13:19Z", "content": "Indias envoy to Washington, Taranjit Singh Sandhu said that Prime Minister Narendra Modi understands the potential of the India-US relationship and has played a key role in building trust between the… [+4280 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "Here’s how this elephant was rescued from a ditch", "description": "The elephant was then seen trying hard to get out of the ditch. As it reached the top of the ditch, locals were seen holding torches to scare it away.", "url": "https://indianexpress.com/article/trending/trending-in-india/heres-how-this-elephant-was-rescued-from-a-ditch-7995224/", "urlToImage": "https://images.indianexpress.com/2022/06/Elephant-rescue-from-ditch.jpg", "publishedAt": "2022-06-28T06:10:08Z", "content": "An elephant which fell into a ditch in Hulu village of Jharkhands Ramgarh district was rescued by using an excavator on Monday. As the clip showing the strenuous rescue operation surfaced online, loc… [+1575 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Kate Middleton gets clicked in a never-seen-before military outfit; check it out", "description": "The duchess wore a camouflage outfit and worked with some military paraphernalia. In one of the pictures, she was seen tinkering a machine", "url": "https://indianexpress.com/article/lifestyle/fashion/fashion-kate-middleton-military-outfit-camouflage-7994372/", "urlToImage": "https://images.indianexpress.com/2022/06/Kate-Middleton-1200-1.jpg", "publishedAt": "2022-06-28T06:00:03Z", "content": "Kate Middleton has served many fashionable looks in the past — from elegant gowns and calf-length dresses with matching fascinators, to pantsuits. The Duchess of Cambridge’s wardrobe is quite enviabl… [+2020 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "The most exciting Apple products we’re hoping to see in 2022", "description": "iPhone 14 Max, AirPods Pro 2 and iPad Pro are among the most exciting Apple products coming our way in late 2022.", "url": "https://indianexpress.com/article/technology/tech-news-technology/the-most-exciting-apple-products-were-hoping-to-see-in-2022-7995250/", "urlToImage": "https://images.indianexpress.com/2022/06/iphone-14.jpeg", "publishedAt": "2022-06-28T05:57:57Z", "content": "Apple has already had a busy year with the launch of the iPhone SE 3 and Mac Pro in Spring and the reveal of iOS 16 at WWDC. But some of 2022s most anticipated devices are expected to release in the … [+4361 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "Abortion-rights groups take up the fight in the United States", "description": "Abortion rights advocates in Kentucky, Idaho, Louisiana, Mississippi and Texas on Monday sued to halt or delay bans on abortion after a similar court challenge was filed in Arizona over the weekend.", "url": "https://indianexpress.com/article/world/abortion-rights-groups-fight-united-states-7995257/", "urlToImage": "https://images.indianexpress.com/2022/06/ABORTION-STATES-1-1.jpg", "publishedAt": "2022-06-28T05:51:19Z", "content": "The battle over abortion shifted to the states Monday as a weekend of furious protest and prayerful thanksgiving in the wake of the Supreme Courts Roe v. Wade reversal gave way to a coast-to-coast wa… [+6177 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Pune: Mistaken for a thief, 19-year-old celebrating friend’s birthday attacked", "description": "Pune news: According to the FIR, Nitesh Shelar was celebrating his friend’s birthday near a labour camp in Bavdhan. Running behind his friend to apply cake on his face, he entered the area where he was attacked", "url": "https://indianexpress.com/article/cities/pune/pune-mistaken-for-a-thief-youth-attacked-7995317/", "urlToImage": "https://images.indianexpress.com/2022/06/Indian-Express-logo-13-1.jpg", "publishedAt": "2022-06-28T05:50:41Z", "content": "A youngster celebrating a friends birthday was allegedly beaten up by locals in Punes Bavdhan area after they thought he was a thief.The police identified the youngster as Nitesh Deepak Shelar (19), … [+1026 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "From Chris Hemsworth’s audition to the evolution of Thor: Marvel traces the superhero’s 10-year legacy in special video", "description": "Ahead of the release of Thor: Love and Thunder, Marvel Studios released a video tracing the journey of the superhero and showcasing Chris Hemsworth's dedication towards playing Thor in the MCU for past 10 years.", "url": "https://indianexpress.com/article/entertainment/hollywood/chris-hemsworth-thor-legacy-audition-playing-superhero-marvel-10-years-love-and-thunder-watch-7995156/", "urlToImage": "https://images.indianexpress.com/2022/06/thor-chris-hemsworth-1200.jpg", "publishedAt": "2022-06-28T05:50:34Z", "content": "When Marvel Studios was casting the role of Thor back in 2009, it wanted an actor “who had the chops to perform this character as we saw him,” president Kevin Feige said in a special video shared by … [+2199 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Trends Desk", "title": "Watch actor Raghubir Yadav play music with a lauki", "description": "The veteran actor celebrated his 72nd birthday on June 25, 2022.", "url": "https://indianexpress.com/article/trending/trending-in-india/watch-actor-raghubir-yadav-play-music-with-a-lauki-7995315/", "urlToImage": "https://images.indianexpress.com/2022/06/raghubir-yadav.jpg", "publishedAt": "2022-06-28T05:45:52Z", "content": "Raghubir Yadav is a multi-talented personality, the 72-year-old actor displayed another skillset Saturday when he played music after fashioning a musical instrument from a lauki (bottle gourd).The vi… [+1184 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "They danced and died: Tragic teen party mystery in South Africa", "description": "The bodies of many of the victims, the youngest a 13-year-old girl, were discovered by police lying on tables, slumped in chairs and couches, and sprawled on the dancefloor of the club in the early hours of Sunday morning.", "url": "https://indianexpress.com/article/world/tragic-teen-party-mystery-south-africa-7995183/", "urlToImage": "https://images.indianexpress.com/2022/06/06655d3b333b428d9d8f570b4c338197-06655d3b333b428d9d8f570b4c338197-3f99dae542504c5d9f49549ad3e2a4c5.jpg", "publishedAt": "2022-06-28T05:45:10Z", "content": "South African authorities were seeking answers Monday, a day after 21 underage teenagers partying after the end of school exams died in a mysterious incident at a nightclub. The bodies of many of the… [+3649 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Divyanka Tripathi reveals husband Vivek Dahiya felt she didn’t trust him: ‘I was shocked’", "description": "TV actor Divyanka Tripathi has been married to Vivek Dahiya for six years now. The two stars met on the set of their show Yeh Hai Mohabbatein.", "url": "https://indianexpress.com/article/entertainment/television/divyanka-tripathi-reveals-when-husband-vivek-dahiya-took-her-care-for-lack-of-trust-7995253/", "urlToImage": "https://images.indianexpress.com/2022/06/divyanka-vivek.jpg", "publishedAt": "2022-06-28T05:44:26Z", "content": "TV actors Divyanka Tripathi and Vivek Dahiya met on the set of their TV show Yeh Hai Mohabbatein, became friends, fell in love and eventually got married in a dreamy ceremony in Bhopal. Since their m… [+1538 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "US strike in Syria targets ‘senior’ militant", "description": "The strikes targeted Abu Hamzah al Yemeni, a \"senior leader\" of Al Qaeda aligned Hurras al-Din, while he was traveling alone on a motorcycle, the US military statement said.", "url": "https://indianexpress.com/article/world/us-strike-in-syria-targets-senior-al-qaeda-militant-7995256/", "urlToImage": "https://images.indianexpress.com/2022/06/US-troops.jpg", "publishedAt": "2022-06-28T05:40:18Z", "content": "The United States carried out a strike in Syria’s Idlib province on Monday that targeted a senior leader of an Al-Qaeda aligned militant group, the US military said."}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Kerala: 21,026 dowry harassment cases registered since 2016, CM Pinarayi Vijayan tells Assembly", "description": "Chief Minister Vijayan says 7,248 dowry harassment cases have been reported since last year. Spike in cases attributed to increased awareness, government campaign drives and a police helpline for women to register complaints", "url": "https://indianexpress.com/article/cities/thiruvananthapuram/kerala-assembly-dowry-harassment-cases-cm-pinarayi-vijayan-7995281/", "urlToImage": "https://images.indianexpress.com/2022/06/pinarayi-vijayan-tashi-tobgyal.jpeg", "publishedAt": "2022-06-28T05:40:05Z", "content": "As many as 21,026 dowry harassment cases were registered in Kerala since 2016, and of these, the accused were convicted in just 251 cases, data presented in the state Assembly on Monday revealed.Answ… [+967 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Dipanita Nath", "title": "Pune Inc: A startup on a mission to make people ‘climate smart’", "description": "Ecozen raises Rs 54 cr of planned Rs 200 cr, explores markets in Africa and Southeast Asia for its smart, solar-based solutions in the agricultural sector", "url": "https://indianexpress.com/article/cities/pune/pune-inc-a-startup-on-a-mission-to-make-people-climate-smart-7995276/", "urlToImage": "https://images.indianexpress.com/2022/06/Ecozen-Facility-min.jpg", "publishedAt": "2022-06-28T05:34:28Z", "content": "Pune-based Ecozen, a climate-smart deep tech startup, announced earlier this month that it had raised Rs 54 crore and is in talks for the remaining amount of its planned Rs 200 crore funding. Founded… [+3411 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "BBC presenters criticised for supporting Boris Becker on-air", "description": "Sue Barker and John McEnroe received flak over sympathising for the 54-year former German Tennis player who is currently serving his sentence for hiding assets and loans to avoid paying debt.", "url": "https://indianexpress.com/article/sports/tennis/bbc-presenters-criticised-for-supporting-boris-becker-on-air-7995218/", "urlToImage": "https://images.indianexpress.com/2022/04/Boris-2-2.jpg", "publishedAt": "2022-06-28T05:32:24Z", "content": "BBC presenters for Wimbledon, John McEnroe and Sue Barker were criticised on Monday for showing support to Boris Becker on-air.The duo was part of the coverage for the grand slam when they exchanged … [+1488 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Court allows SCOTUS to enforce more restrictive abortion law", "description": "The US District Court in South Carolina lifted its prior hold on the enforcement of a state law passed last year that bans most abortions if an ultrasound detects a so-called fatal heartbeat, usually around six weeks into a pregnancy.", "url": "https://indianexpress.com/article/world/us-supreme-court-abortion-law-south-carolina-7995150/", "urlToImage": "https://images.indianexpress.com/2021/12/ABORTION-POLITICS.jpg", "publishedAt": "2022-06-28T05:32:09Z", "content": "A law restricting abortions in South Carolina after six weeks of pregnancy can take effect immediately in the state, a federal court ruled Monday. The US District Court in South Carolina lifted its p… [+3420 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Soumyarendra Barik", "title": "Niti Aayog’s report on India’s gig economy: what has the think-tank recommended?", "description": "In a report titled 'India's Booming Gig and Platform Economy', government think-tank Niti Aayog has made observations on labour force participation of women and persons with disabilities, and made recommendations to companies.", "url": "https://indianexpress.com/article/explained/niti-aayog-india-gig-economy-7995223/", "urlToImage": "https://images.indianexpress.com/2022/06/India-1-1.jpg", "publishedAt": "2022-06-28T05:23:47Z", "content": "Government think-tank Niti Aayog has proposed fiscal incentives, like tax breaks or startup grants, for companies with about one-third of their workforce as women and people with disabilities. This i… [+4525 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "New York Times", "title": "US: Companies scramble to work out policies related to employee abortions", "description": "Among the companies that said they would assist employees who have to travel for abortions are Disney, H&M, Nike, and Goldman Sachs, which join a larger group including Starbucks and Yelp that had previously committed to doing so.", "url": "https://indianexpress.com/article/world/us-companies-employee-abortions-policies-7995233/", "urlToImage": "https://images.indianexpress.com/2022/06/abortion-policies-usa.jpg", "publishedAt": "2022-06-28T05:21:38Z", "content": "There is no clear blueprint for corporate engagement on abortion. After numerous companies came forward to announce that they would cover travel expenses for their employees to get abortions, executi… [+6781 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Can cleansing beads in facewashes get stuck in skin pores? Dermatologist answers", "description": "Dr Meghna Gupta, dermatologist and founder, Delhi Skin Centre said, \"Certain ingredients, if not cleaned properly, could remain on the face and clog pores.\"", "url": "https://indianexpress.com/article/lifestyle/life-style/woman-claims-aesthetician-found-face-wash-beads-stuck-pores-dermatologist-explains-7994163/", "urlToImage": "https://images.indianexpress.com/2022/06/GettyImages-washing-face-with-cold-water_1200.jpg", "publishedAt": "2022-06-28T05:20:02Z", "content": "A woman recently took to TikTok to urge people to stop using a particular face wash after her aesthetician found and removed the product’s beads from her poresduring a facial.In the video, Emma Kinsl… [+1367 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Rajasthan: Sachin Pilot takes a dig at Ashok Gehlot, says Rahul Gandhi’s praise shouldn’t upset anyone", "description": "In July 2020, Pilot along with 18 other disgruntled Congress MLAs, revolted against the leadership of Gehlot which created a crisis for the government.", "url": "https://indianexpress.com/article/cities/jaipur/rajasthan-chief-minister-ashok-gehlot-congress-leader-sachin-pilot-7995204/", "urlToImage": "https://images.indianexpress.com/2022/06/ashok-2.jpg", "publishedAt": "2022-06-28T05:14:56Z", "content": "In a veiled attack on Rajasthan Chief Minister Ashok Gehlot, Congress leader Sachin Pilot on Monday said that no one should be unnecessarily upset if Rahul Gandhi has praised his “patience”.Pilot sai… [+3507 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Rajasthan: RLP’s Hanuman Beniwal calls on regional parties to join hands in fight against Agnipath scheme", "description": "Hanuman Beniwal took a dig at Prime Minister Narendra Modi's promise of generating two crore jobs every year, according to the promise 16 crore jobs should have been created in the last eight years and wondered if the number was even 16 lakhs in reality.", "url": "https://indianexpress.com/article/cities/jaipur/rajasthan-rlps-hanuman-beniwal-calls-on-regional-parties-to-join-hands-in-fight-against-agnipath-scheme/", "urlToImage": "https://images.indianexpress.com/2021/02/hanuman-beniwal.jpg", "publishedAt": "2022-06-28T05:12:40Z", "content": "Rashtriya Loktantrik Party (RLP) coordinator and Nagaur MP Hanuman Beniwal called upon all the regional parties on Monday to join hands in the fight against the Agnipath scheme for military recruitme… [+1723 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Main accused in Gurgaon’s Subhash Chowk cash van robbery arrested", "description": "The accused, Jitender alias Jeetu, was arrested on Monday from Subhash Chowk by a team of Crime Branch Sector 40, said the police.", "url": "https://indianexpress.com/article/cities/delhi/gurgaon-subhash-chowk-cash-van-robbery-accused-arrested-7995239/", "urlToImage": "https://images.indianexpress.com/2022/06/handcuff-arrest-1200.jpg", "publishedAt": "2022-06-28T05:11:10Z", "content": "More than two months after dacoits had allegedly robbed Rs 96.32 lakh at gunpoint after throwing chilli powder in the eyes of two employees of a private cash transportation company in Gurgaon, the po… [+1556 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi weather: Warm day, partly cloudy skies and thunder forecast today", "description": "The minimum temperature, usually recorded at night, also settled a few degrees above normal at 30.8 degrees, which is three degrees above the long period average for this time of the year.", "url": "https://indianexpress.com/article/cities/delhi/delhi-weather-warm-day-partly-cloudy-skies-and-thunder-forecast-today-7995231/", "urlToImage": "https://images.indianexpress.com/2022/05/HEAT-4-1.jpg", "publishedAt": "2022-06-28T05:10:39Z", "content": "Partly cloudy skies and the possibility of thunder are on the India Meteorological Department (IMD) forecast for Tuesday for Delhi. Tuesday is likely to be another warm day for the national capital w… [+1557 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Shamik Chakrabarty", "title": "Why Team India should be worried after England’s daring run chases in all the three Tests versus New Zealand", "description": "England are riding a crest under new management, as the 3-0 whitewash of NZ shows, and are an altogether different proposition compared to the team India had faced last year in the first four Tests of the five-match series", "url": "https://indianexpress.com/article/sports/cricket/why-team-india-should-be-worried-after-englands-daring-run-chases-in-all-the-three-tests-versus-new-zealand-7995203/", "urlToImage": "https://images.indianexpress.com/2022/06/Untitled-design-8-3.jpg", "publishedAt": "2022-06-28T05:09:47Z", "content": "That was the only time Jamie Overton looked nervous, after moving into the 90s in his debut Test. Eventually he fell for 97, got a bear hug from Jonny Bairstow and left to a standing ovation from the… [+6583 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Chlorine gas leak kills 12, injures 251 at Jordan port", "description": "Jordan officials said the gas leak came after a tank filled with 25 tonnes of chlorine gas being exported to Djibouti fell while being transported.", "url": "https://indianexpress.com/article/world/jordon-port-gas-leak-7995175/", "urlToImage": "https://images.indianexpress.com/2022/06/jordan.png", "publishedAt": "2022-06-28T05:08:17Z", "content": "At least 12 people died and 251 were injured in a chlorine gas leak from a storage tank at Jordan’s Aqaba port, officials and state media reported on Monday.The leak came after a tank filled with 25 … [+1370 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Monkeypox case count rises to more than 3,400 globally, WHO says", "description": "WHO said that since June 17, 1,310 new cases were reported to the agency, with eight new countries reporting monkeypox cases.", "url": "https://indianexpress.com/article/world/monkeypox-case-count-3400-globally-who-7995157/", "urlToImage": "https://images.indianexpress.com/2022/06/monkeypox-1200-2.jpg", "publishedAt": "2022-06-28T05:07:43Z", "content": "More than 3,400 confirmed monkeypox cases and one death were reported to the World Health Organization as of last Wednesday, with a majority of them from Europe, the agency said in an update on Monda… [+118 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Sanjay Dutt was concerned about hitting ‘beta’ Ranbir Kapoor during Shamshera fight scenes: ‘Usse lag na jaye’", "description": "Actors Ranbir Kapoor and Sanjay Dutt will be seen as rivals in Shamshera. Ahead of the film's release, the duo has opened up about starring opposite each other.", "url": "https://indianexpress.com/article/entertainment/ranbir-kapoor-on-his-equation-with-sanjay-dutt-hitting-him-in-the-film-and-getting-hit-by-him-says-ive-never-got-hit-so-much-in-my-life-7995054/", "urlToImage": "https://images.indianexpress.com/2022/06/ranbir-kapoor-1.jpg", "publishedAt": "2022-06-28T05:03:36Z", "content": "The trailer for Ranbir Kapoor-starrer Shamshera highlighted the antagonistic equation between Ranbir’s character Balli and Daroga Shuddh Singh, played by Sanjay Dutt. However, the actors’ off-screen … [+2566 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "India says it remains deeply concerned by developments in the West Bank, Jerusalem and Gaza", "description": "\"It is extremely important for the international community and the UN Security Council to send a strong signal against any step that would prevent the possibility of durable peace between Israel and Palestine,” India's Deputy Permanent Representative to the U…", "url": "https://indianexpress.com/article/world/india-concerned-west-bank-jerusalem-gaza-un-security-council-7995180/", "urlToImage": "https://images.indianexpress.com/2022/06/Palestine-AP.jpg", "publishedAt": "2022-06-28T05:00:49Z", "content": "India has expressed deep concern over developments in the West Bank, Jerusalem and Gaza, underscoring the importance of the international community and the UN Security Council sending a “strong signa… [+3221 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Deutsche Welle", "title": "African-born German MPs bring new perspectives to politics", "description": "For the first time in Germany's political history, the lower house of parliament, the Bundestag, includes three lawmakers of African descent. So what do they want to achieve?", "url": "https://indianexpress.com/article/world/germany-african-born-mp-politics-new-perspectives-7995202/", "urlToImage": "https://images.indianexpress.com/2022/06/german-mp.jpg", "publishedAt": "2022-06-28T04:57:34Z", "content": "Armand Zorn was surprisingly relaxed when he gave his debut speech at the Bundestag. The topic, tax policy, is his area of expertise.\r\n“I was a bit excited, I have to admit,” said the 33-year-old man… [+5967 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Probe into impersonation during recruitment of firemen transferred to Crime Branch", "description": "A source said, “The investigation was transferred to the Crime Branch considering the widespread area of the gang members, including the actual candidates, dummy candidates and certain government employees. It is a lengthy investigation.", "url": "https://indianexpress.com/article/cities/chandigarh/probe-into-impersonation-during-recruitment-of-firemen-transferred-to-crime-branch-7995212/", "urlToImage": "https://images.indianexpress.com/2022/03/Banner-image-2.jpg", "publishedAt": "2022-06-28T04:53:28Z", "content": "THE INVESTIGATION into the impersonation racket through which dummy candidates appeared during the recruitment of firemen in UT fire department has been transferred to the Crime Branch, Sector 11. Th… [+661 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "England’s 20-year old pacer, Issy Wong can be the quickest ever", "description": "Wong took little time to impress on her Test debut. At 17, she could clock 70 mph. The untouched 80 mph mark awaits the England international.", "url": "https://indianexpress.com/article/sports/cricket/englands-20-year-old-pacer-with-chinese-roots-can-be-the-quickest-ever-7995099/", "urlToImage": "https://images.indianexpress.com/2022/06/Issy-Wong.jpg", "publishedAt": "2022-06-28T04:49:31Z", "content": "Isabelle Wong can solve a rubix cube in 33 seconds. She has got proof. A video posted by ECB Cricket on their Twitter handle from September 2019.“They just see it differently some people, don’t they,… [+2448 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Sanjay Popli attends son’s cremation, says has full faith in judiciary", "description": "IAS officer Sanjay Popli was arrested on June 20, for allegedly demanding Rs 7 lakh as a bribe for clearing tenders for laying of sewerage pipeline at Nawanshahr.", "url": "https://indianexpress.com/article/cities/chandigarh/sanjay-popli-attends-sons-cremation-says-has-full-faith-in-judiciary-7995199/", "urlToImage": "https://images.indianexpress.com/2022/06/sanjay-popli.jpg", "publishedAt": "2022-06-28T04:47:36Z", "content": "Graft accused IAS officer, Sanjay Popli, on Monday attended the cremation of his son, Kartik Popli, 26, who was found dead with bullet wounds at his house in Sector 11 on Saturday. The cremation took… [+1035 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Markets trade weak after three-day gain; Sensex falls over 300 points in early trade", "description": "The 30-share BSE Sensex was trading 317.41 points lower at 52,843.87. The NSE Nifty dipped 99.65 points to 15,732.40.", "url": "https://indianexpress.com/article/business/market/share-market-today-equity-stocks-bse-sensex-nse-nifty-rupee-global-cues-june-28-7995185/", "urlToImage": "https://images.indianexpress.com/2022/06/bse-bombay-stock-exchange-express-archive-1200-1.jpg", "publishedAt": "2022-06-28T04:43:41Z", "content": "Equity benchmark indices halted their three-day gain on Tuesday, with the Sensex falling over 317 points in early trade, amid weak global market trends and persistent foreign fund outflows.Firm crude… [+1283 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "JugJugg Jeeyo box office collection Day 4: Varun-Kiara film maintains a good hold on first Monday, crosses Rs 40 crore", "description": "JugJugg Jeeyo box office: Though the Dharma Productions film has been doing decent business, it has not been able to cross the Monday collections of Bhool Bhulaiyaa 2, Gangubai Kathiawadi and Samrat Prithviraj.", "url": "https://indianexpress.com/article/entertainment/bollywood/box-office-collection/jugjugg-jeeyo-box-office-day-4-varun-dhawan-kiara-advani-film-maintains-a-good-hold-on-first-monday-7995164/", "urlToImage": "https://images.indianexpress.com/2022/06/jugjugg-jeeyo-box-office-2.jpg", "publishedAt": "2022-06-28T04:41:12Z", "content": "Varun Dhawan-led JugJugg Jeeyo is managing to entertain the audience and pull them to the theatre. The film had a good opening weekend with a collection of Rs 36.93 crore, and on its first Monday, it… [+1876 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Aamir Khan makes Bhojpuri actor Akshara Singh’s ‘dream come true’ as he dances with her on Laal Singh Chaddha song. Watch video", "description": "Aamir Khan, who is promoting Laal Singh Chaddha, danced with Bhojpuri actor Akshara Singh to the film's new song, Phir Na Aisi Raat Aayegi, sung by Arijit Singh.", "url": "https://indianexpress.com/article/entertainment/bollywood/aamir-khan-makes-bhojpuri-actor-akshara-singhs-dream-come-true-as-he-dances-with-her-on-laal-singh-chaddha-song-watch-video-7995115/", "urlToImage": "https://images.indianexpress.com/2022/06/Collage-Maker-28-Jun-2022-09.47-AM.jpg", "publishedAt": "2022-06-28T04:35:25Z", "content": "Bhojpuri actor Akshara Singh is on cloud nine after Aamir Khan danced with her on Laal Singh Chaddha’s song Phir Na Aisi Raat Aayegi. An excited Akshara has shared videos with Aamir on her social med… [+1983 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Google to shut down Hangouts later this year", "description": "Hangouts was introduced back in 2013, and was the planned successor to GChat, or Google Talk. Almost a decade later, the platform is now on the verge of shutting down.", "url": "https://indianexpress.com/article/technology/social/google-to-shut-down-hangouts-later-this-year-7995172/", "urlToImage": "https://images.indianexpress.com/2022/06/Google-Hangouts-to-Google-Chat.jpg", "publishedAt": "2022-06-28T04:35:03Z", "content": "Back in February, Google replaced the Hangouts app for Workspace users with the newer Google Chat. The company is now set to completely shut down the older Hangouts later this year, moving all curren… [+1380 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Mahender Singh Manral", "title": "FIR against AltNews’ Mohammed Zubair filed last week; cop who filed complaint said document ‘sensitive’, should not be uploaded", "description": "The FIR was registered on June 20 under Sections 153-A (promoting enmity between different groups) and 295-A (malicious acts, intended to outrage religious feelings) of the Indian Penal Code (IPC) after a complaint from Arun Kumar.", "url": "https://indianexpress.com/article/cities/delhi/fir-against-altnews-mohammed-zubair-filed-last-week-cop-said-document-sensitive-should-not-be-uploaded-7995160/", "urlToImage": "https://images.indianexpress.com/2022/06/mohammed-zubair.jpeg", "publishedAt": "2022-06-28T04:32:36Z", "content": "The FIR against Mohammed Zubair, the co-founder of fact-checking website AltNews who was arrested by the cyber unit of the Delhi Police on Monday, was registered a week ago, according to officials Tu… [+3397 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Anshula Kapoor finds the courage to talk about her ‘biggest insecurity’ on social media", "description": "The 31-year-old wrote, \"Wearing sleeveless anything (even at home) still makes me nervous/uncomfortable! [Sic]\"", "url": "https://indianexpress.com/article/lifestyle/life-style/anshula-kapoor-biggest-insecurity-social-media-body-image-7994684/", "urlToImage": "https://images.indianexpress.com/2022/06/Anshula-Kapoor-1200.jpg", "publishedAt": "2022-06-28T04:30:59Z", "content": "While social media is a platform that perpetuates unrealistic standards of beauty, it is also a tool with which to address such concerns and promote a positive body image.Buy Now | Our best subscript… [+2087 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "TS Telangana Inter 1st, 2nd year result 2022: How to check score online", "description": "Manabadi TS Inter Results 2022, TSBIE Telangana Board Intermediate 1st, 2nd Year Results 2022 at www.tsbie.cgg.gov.in, manabadi.com, results.cgg.gov.in: A total of 9 lakh students who had appeared in the first or second year exams can check the results throug…", "url": "https://indianexpress.com/article/education/ts-telangana-inter-1st-2nd-year-result-2022-declared-how-to-check-manabadi-bse-telangana-gov-in-results-cgg-gov-in-7951215/", "urlToImage": "https://images.indianexpress.com/2022/06/2-203.jpg", "publishedAt": "2022-06-28T04:30:06Z", "content": "The TS board examinations were successfully conducted in an offline pen and paper mode from May 7 to May 24, 2022. The IPE results are available on official websites results.cgg.gov.in, tsbie.cgg.gov… [+1682 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Rupee hits record low of 78.59 against US dollar in early trade", "description": "At the interbank foreign exchange, the rupee opened on a weak note at 78.53 against the American dollar, then lost ground to quote at 78.59 -- its all-time low level, registering a fall of 22 paise from the last close.", "url": "https://indianexpress.com/article/business/market/rupee-hits-record-low-against-us-dollar-7995134/", "urlToImage": "https://images.indianexpress.com/2022/05/rupee-express-archieve-1200.jpg", "publishedAt": "2022-06-28T04:28:44Z", "content": "The rupee depreciated 22 paise to a record low of 78.59 against the US dollar in opening trade on Tuesday as persistent foreign funds outflows weighed on investor sentiments.At the interbank foreign … [+1285 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "Decision to allow Michael Vaughan to commentate was ‘totally inexcusable’: BBC in-house diversity group", "description": "Vaughan, who has been charged following an investigation into racism claims made by former player Azeem Rafiq, was doing live commentary for the third Test on Radio 5.", "url": "https://indianexpress.com/article/sports/cricket/decision-to-allow-michael-vaughan-to-commentate-was-totally-inexcusable-bbc-in-house-diversity-group-7995163/", "urlToImage": "https://images.indianexpress.com/2021/11/michael-vaughan.jpg", "publishedAt": "2022-06-28T04:27:24Z", "content": "BBC’s in-house diversity group has criticised the broadcaster for its decision to employ the former England captain Michael Vaughan as a commentator for the third Test against New Zealand at Headingl… [+884 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Delhi: Economic Offences Wing arrest wanted man from Shahdara", "description": "A senior police officer said, \"Paliwal along with his associate used to cheat people and banks on the pretext of getting money to invest in a granite mining business.\"", "url": "https://indianexpress.com/article/cities/delhi/delhi-economic-offences-wing-arrest-man-shahdara-7995152/", "urlToImage": "https://images.indianexpress.com/2022/06/shahdara-arres.jpeg", "publishedAt": "2022-06-28T04:23:07Z", "content": "A wanted man and his associate were arrested from Delhi’s Shahdara Monday by the Economic Offences Wing and handed over to the CBI, said the police. The men were identified as the main accused Pradee… [+951 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "‘Architect of modern India’: KCR pays tribute to P V Narasimha Rao", "description": "On Narasimha Rao’s birth anniversary, Telangana Chief Minister K Chandrasekhar Rao credits former Prime Minister’s innovative policies for India’s economic growth", "url": "https://indianexpress.com/article/cities/hyderabad/architect-of-modern-india-kcr-pays-tribute-to-p-v-narasimha-rao-7995151/", "urlToImage": "https://images.indianexpress.com/2022/06/narasimha-rao-4.jpg", "publishedAt": "2022-06-28T04:20:50Z", "content": "Calling former Prime Minister of India P V Narasimha Rao the architect of modern India, Telangana Chief Minister K Chandrasekhar Rao said the state government imbibes inspiration from the former PM a… [+877 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Cops shoot man in Derabassi, claim it was in ‘self defence’", "description": "The police later identified the injured man as Hitesh Aggarwal (24), a resident of Habetpur Village, Derabassi. Hitesh has sustained a gunshot wound on his leg and was admitted to Government Medical College and Hospital (GMCH) Sector 32, Chandigarh, where he …", "url": "https://indianexpress.com/article/cities/chandigarh/cops-shoot-man-in-derabassi-claim-it-was-in-self-defence-7995154/", "urlToImage": "https://images.indianexpress.com/2022/06/Pune-Police-2-3.jpg-3.jpg", "publishedAt": "2022-06-28T04:20:37Z", "content": "The video of a man being shot in his leg by a police team at Derabassi went viral on Monday, with police later issuing a statement that the man was shot in ‘self defence’ after he indulged in a spat … [+1411 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "‘মমতা-ই মা সারদা’, সময়-সংখ্যাতত্ত্ব মিলিয়ে দাবি করলেন ‘দিদির সৈনিক’ নির্মল মাজি", "description": "'দিদি-ই মা সারদা, দিদি-ই সিস্টার নিবেদিতা, দিদি-ই ঘরের দুর্গা।'", "url": "https://bengali.indianexpress.com/west-bengal/tmc-mla-nirmal-maji-claims-mamata-banerjee-is-ma-saradas-reincarnation-462696/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/Mamata-Ma-Sarada.jpg", "publishedAt": "2022-06-28T04:18:48Z", "content": ", \r\n , “ , , ”\r\n , “, - - , - , - ” \r\n , - \r\n - , \r\n , , -\r\nStay updated with the latest news headlines and all the latest Westbengal news download Indian Express Bengali App.\r\nWeb Title: Tmc mla nir… [+58 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Third front looks to make a mark in Pimpri Chinchwad civic body polls", "description": "The need for a third block, Bhor said, was felt given because the politics of Pimpri Chinchwad had failed to produce a leader in the area. Under the Pimpri Chinchwad Vikas Aghadi, Bhor said they plan to enter the local body polls.", "url": "https://indianexpress.com/article/cities/pune/third-front-pimpri-chinchwad-civic-body-polls-7995073/", "urlToImage": "https://images.indianexpress.com/2022/06/pcmc-main1.jpg", "publishedAt": "2022-06-28T04:16:31Z", "content": "In the upcoming civic body elections in Pimpri Chinchwad a third front led by Abhay Bhor, the president of the Federation of Small Scale Industries, hopes to make its presence felt. Bhor, while speak… [+1962 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "State wildlife board gives green signal to CHB project in IT Park", "description": "Three plots -- plot number 1, 2 and 7 where the CHB will construct housing projects -- fall under the Eco Sensitive Zone area. At least 2.75 km area from the wildlife sanctuary falls in the ESZ.", "url": "https://indianexpress.com/article/cities/chandigarh/state-wildlife-board-gives-green-signal-to-chb-project-in-it-park-7995149/", "urlToImage": "https://images.indianexpress.com/2022/06/Screenshot-2022-06-27-at-11.57.57-AM-2.png", "publishedAt": "2022-06-28T04:14:41Z", "content": "THE STATE Board of Wildlife of UT Administration Monday gave its assent to the housing scheme of Chandigarh Housing Board in IT Park which is under the Eco-Sensitive Zone (ESZ) area of Sukhna Wildlif… [+1829 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Chess: Nepomniachtchi takes another step towards challenging Magnus Carlsen for the world title but will the Norwegian play at all?", "description": "The current standings make the possibility of Carlsen opting out of the World Championship defence even greater. If that happens the winner and the runner-up of the Candidates will play each other for the title next year.", "url": "https://indianexpress.com/article/sports/chess/nepomniachtchi-takes-another-step-towards-challenging-magnus-carlsen-for-the-world-title-but-will-the-norwegian-play-at-all-7995141/", "urlToImage": "https://images.indianexpress.com/2021/12/Carlsen.jpg", "publishedAt": "2022-06-28T04:12:51Z", "content": "Under the roof of the Palacio de Santoña in Madrid, with its heritage art and paintings on the walls and the roofs, Russian Grandmaster Ian Nepomniachtchi took another important step towards securing… [+3119 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "OnePlus making a ‘Nord Watch’, could begin internal testing soon", "description": "OnePlus is reportedly making a new Nord-series smartwatch, which could be more affordable compared to last year's OnePlus Watch.", "url": "https://indianexpress.com/article/technology/gadgets/oneplus-is-making-a-nord-watch-could-begin-internal-testing-soon-7995122/", "urlToImage": "https://images.indianexpress.com/2022/06/OnePlus-Watch.jpg", "publishedAt": "2022-06-28T04:11:07Z", "content": "OnePlus has gone through a transition in the past two years with its Nord series. After launching a few smartphones under the Nord-series that are priced much below the flagship number series, OnePlu… [+1821 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Punjab Budget: Myopic, says BJP; Warring calls it old wine in new bottle", "description": "Calling it a budget of empty platitude, leader of opposition in Vidhan Sabha and senior Congress leader Partap Singh Bajwa said the finance minister “made multiple promises, yet as we listened closer to the details, the government has shown no roadmap for the…", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-budget-myopic-says-bjp-warring-calls-it-old-wine-in-new-bottle-7995143/", "urlToImage": "https://images.indianexpress.com/2022/06/Screenshot-2022-06-27-at-11.57.57-AM-2.png", "publishedAt": "2022-06-28T04:09:47Z", "content": "The first budget of the Aam Aadmi Party (AAP) presented by Finance Minister Harpal Singh Cheema on Monday came under sharp criticism from the opposition parties in Punjab.Calling it a budget of empty… [+3566 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "Armenia, Azerbaijan trade new Karabakh accusations", "description": "The dispute over the Nagorno-Karabakh region, a mountainous territory inside Azerbaijan controlled since the 1990s by ethnic Armenians, flared in 2020 into a six-week war in which Azeri troops regained swathes of territory.", "url": "https://indianexpress.com/article/world/armenia-azerbaijan-trade-new-karabakh-accusations-7995126/", "urlToImage": "https://images.indianexpress.com/2022/06/azerbaijan-president.jpg", "publishedAt": "2022-06-28T04:08:45Z", "content": "Armenian Prime Minister Nikol Pashinyan traded new accusations on Monday with the president of Azerbaijan, saying his neighbour was failing to take action on a treaty to end 30 years of hostility ove… [+1801 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Punjab Budget: ‘Check tax evasion to mop up funds’", "description": "The budget has pegged the total receipts at Rs 151129 crore.", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-budget-check-tax-evasion-to-mop-up-funds-7995139/", "urlToImage": "https://images.indianexpress.com/2022/06/Screenshot-2022-06-27-at-11.57.57-AM-2.png", "publishedAt": "2022-06-28T04:04:33Z", "content": "By checking evasion of tax, the Punjab government plans to make Rs 45,588 crore from states own tax revenue. This is at least Rs 8,000 crore more than the estimates in the last budget."}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Soni Razdan expresses ‘gratitude’ as Alia Batt-Ranbir Kapoor announce pregnancy: ‘May your tribe increase’", "description": "Alia Bhatt and Ranbir Kapoor announced that they are expecting their first child on Monday. The film industry has since been showering the couple with congratulatory messages.", "url": "https://indianexpress.com/article/entertainment/bollywood/soni-razdan-expresses-gratitude-as-alia-batt-ranbir-kapoor-announce-pregnancy-photo-7995064/", "urlToImage": "https://images.indianexpress.com/2022/06/alia-ranbir-soni-razdan-1200.jpg", "publishedAt": "2022-06-28T04:01:38Z", "content": "Soni Razdan cannot contain her happiness after daughter Alia Bhatt announced that she is expecting her first child with husband Ranbir Kapoor. Soni took to her Instagram account and posted two pictur… [+1193 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Punjab Budget: Debt Rs 2.63 lakh cr: govt plans to take more loan to pay off loans", "description": "For ways and means advances, the state will pay Rs 20,000 crore which will be spent under the capital expenditure head.", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-budget-debt-rs-2-63-lakh-cr-govt-plans-to-take-more-loan-to-pay-off-loans-7995132/", "urlToImage": "https://images.indianexpress.com/2022/06/Screenshot-2022-06-27-at-11.57.57-AM-2.png", "publishedAt": "2022-06-28T04:00:12Z", "content": "Funds crunched Punjab would pay Rs 36,068 crore on debt servicing in the current fiscal, as per the budget estimates. Out of this, Rs 20,122 crore will be used for interest payments alone while the r… [+1954 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Britney Spears’ ex ordered to trial on stalking charge", "description": "After a two-hour preliminary hearing, Ventura County Judge ruled that Jason Allen Alexander should be held to answer on the charge, along with misdemeanor counts of trespassing, vandalism and battery, court records showed.", "url": "https://indianexpress.com/article/entertainment/music/britney-spears-ex-ordered-to-trial-on-stalking-charge-7995072/", "urlToImage": "https://images.indianexpress.com/2022/06/Britney-Spears-ap-1200by667.jpeg", "publishedAt": "2022-06-28T03:54:17Z", "content": "A California judge found Monday that there is enough evidence against a man once briefly married to Britney Spears who showed up uninvited at the pop stars wedding to go to trial on a felony stalking… [+1188 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Mahesh Bhatt says Alia Bhatt-Ranbir Kapoor’s child will have ‘extraordinary genetics’: ‘The child, who will be born…’", "description": "Alia Bhatt announced her pregnancy on Monday through social media. Mahesh Bhatt called it 'astounding' news.", "url": "https://indianexpress.com/article/entertainment/bollywood/mahesh-bhatt-on-alia-bhatt-ranbir-kapoor-pregnancy-grandfather-7995097/", "urlToImage": "https://images.indianexpress.com/2022/06/alia-ranbir-mahesh.jpg", "publishedAt": "2022-06-28T03:52:52Z", "content": "Filmmaker Mahesh Bhatt is elated to be getting to play a new role in life, that of a grandfather. Like every Kapoor and Bhatt family member, Mahesh is also looking forward to welcoming Alia Bhatt and… [+1692 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kanchan Vasdev", "title": "Punjab Budget: Record payment for power", "description": "While the government has estimated that it would end up paying Rs 15,846 crore for power subsidy during the current fiscal, an amount of Rs 7,117.86 crore is due from the previous fiscal.", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-budget-record-payment-for-power-7995123/", "urlToImage": "https://images.indianexpress.com/2022/06/Screenshot-2022-06-27-at-11.57.57-AM-2.png", "publishedAt": "2022-06-28T03:50:39Z", "content": "DURING 2022-23 fiscal, the Punjab Government would have to pay Rs 22,962 crore towards power subsidy to different categories which is a record payment to be paid to the power utility by the governmen… [+2487 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express Web Desk", "title": "Pallonji Mistry, chairman of Shapoorji Pallonji group, passes away at 93", "description": "Pallonji Mistry, chairman of Shapoorji Pallonji group, passed away in Mumbai. He was 93.", "url": "https://indianexpress.com/article/cities/mumbai/pallonji-mistry-chairman-shapoorji-pallonji-group-death-7995103/", "urlToImage": "https://images.indianexpress.com/2022/06/pallonji-mistry.jpeg", "publishedAt": "2022-06-28T03:50:39Z", "content": "Pallonji Mistry (File/Twitter)Pallonji Mistry, chairman of Shapoorji Pallonji group, passed away last night in Mumbai. He was 93.\r\nMistry along with his family ran the Mumbai-based construction giant… [+285 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Punjab Budget: FM took suggestions, but hardly implemented them: Industry", "description": "Chamber of Industrial and Commercial Undertakings (CICU) president Upkar Singh Ahuja said, “The industry in Punjab feels betrayed and highly disappointed, as Rs 100 crore fund allocation for industrial development is too less for industrial growth out of Rs 1…", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-budget-fm-took-suggestions-but-hardly-implemented-them-industry-7995118/", "urlToImage": "https://images.indianexpress.com/2022/06/Bhagwant-Mann-2.jpg", "publishedAt": "2022-06-28T03:45:09Z", "content": "While the AAP government in Punjab may have presented its first paperless budget with much fanfare on Monday, it hasn’t gone down well with the industry, by and large. Before preparing the budget, Pu… [+2621 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Punjab Budget: Rs 200 crore for Pbi university, scholarships for general category", "description": "An allocation of Rs 30 crore has been made for providing infrastructure facilities in nine new libraries of government colleges inTarn Taran, Barnala, Ludhiana, Fazilka, Malerkotla, Moga, Pathankot, Sri Muktsar Sahib and Shaheed Bhagat Singh Nagar.", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-budget-rs-200-crore-for-pbi-university-scholarships-for-general-category-7995111/", "urlToImage": "https://images.indianexpress.com/2022/06/Bhagwant-Mann-2.jpg", "publishedAt": "2022-06-28T03:41:34Z", "content": "Announcing an aid of Rs 200 crore for Punjabi University, Patiala, finance minister Harpal Singh Cheema said that PU Patiala was initially mandated to develop and promote our mother-tongue Punjabi. I… [+1196 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "This common kitchen ingredient can help keep your gut healthy", "description": "“It is absolutely fantastic for digestive health because of an active ingredient called thymol that helps produce more digestive enzymes.,” Luke Coutinho, an integrative lifestyle medicine expert and life coach, said on YouTube", "url": "https://indianexpress.com/article/lifestyle/health/heres-how-carom-seeds-or-ajwain-can-be-used-to-keep-your-gut-healthy-7990960/", "urlToImage": "https://images.indianexpress.com/2022/06/guthealth_Getty1200.jpg", "publishedAt": "2022-06-28T03:40:28Z", "content": "Carom seedsor ajwain are commonly found in most Indian kitchens. Generally used for seasoning and adding flavours to dishes, these seeds can also be used to address gut health, acidity, and indigesti… [+3723 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Entertainment Desk", "title": "Alia Bhatt and Ranbir Kapoor’s fans are sure this is the moment he proposed to her, see Neetu Kapoor’s photo", "description": "Neetu Kapoor wished her son Ranbir Kapoor and daughter-in-law Alia Bhatt with a picture of the time Ranbir had proposed to her. Check it out here:", "url": "https://indianexpress.com/article/entertainment/bollywood/alia-bhatt-ranbir-kapoor-proposal-pregnancy-neetu-kapoor-7995063/", "urlToImage": "https://images.indianexpress.com/2022/06/Collage-Maker-28-Jun-2022-08.53-AM.jpg", "publishedAt": "2022-06-28T03:40:02Z", "content": "Neetu Kapoor is ready to be a proud grandmother once again after her son Rabir Kapoor and daughter-in-law Alia Bhatt announced their pregnancy on Monday. Neetu, who made her acting comeback with JugJ… [+1334 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Tech Desk", "title": "Apple revokes certificate for ‘Hermit’ spyware app that targeted iPhones in Italy, Kazakhstan : Report", "description": "Apple has revoked certificates for ‘Hermit’ spyware which was used to target iPhones in Italy. The incidents were first highlighted by Lookout research and later reported by Google's Threat Analysis Group as well.", "url": "https://indianexpress.com/article/technology/tech-news-technology/apple-revokes-certificate-for-hermit-spyware-app-that-targeted-iphones-in-italy-kazakhstan-7995101/", "urlToImage": "https://images.indianexpress.com/2022/06/Apple_logo_1.jpg", "publishedAt": "2022-06-28T03:39:36Z", "content": "TAGs analysis showed both Android and iOS devices were targeted using Hermit, which has been developed by an Italian vendor called RCS Lab. Now, Apple has said revoked all known accounts and certific… [+2449 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Bloomberg", "title": "Netflix’s plan to fix its subscription crisis starts in Asia", "description": "While Netflix will continue to offer low-price, mobile-only membership across Asia, it’s also seeking more partnerships with wireless operators and digital payment companies to reach more potential customers in a region where credit card use is less common.", "url": "https://indianexpress.com/article/technology/tech-news-technology/netflixs-plan-to-fix-its-subscription-crisis-starts-in-asia-7995104/", "urlToImage": "https://images.indianexpress.com/2022/06/Netflix-Logo-1.jpg", "publishedAt": "2022-06-28T03:38:13Z", "content": "Netflix Inc. is looking to Asia after its shock first-quarter slowdown, seeking to both maintain growth in the one region where its still adding subscribers and replicate its success there in other p… [+5423 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Divya Goyal", "title": "Punjab Budget: Big jump in outlay for schools, higher education", "description": "For the fiscal year 2022-23, the budget outlay of Rs 13,991 crore - nine per cent of the state’s expenditure budget of Rs 1,55,860 crore - has been proposed for schools.", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-budget-big-jump-in-outlay-for-schools-higher-education-7995106/", "urlToImage": "https://images.indianexpress.com/2022/06/Bhagwant-Mann-2.jpg", "publishedAt": "2022-06-28T03:35:08Z", "content": "In his maiden budget, Punjab Finance Minister Harpal Singh Cheema proposed several new schemes in the education sector that have been picked from Delhis Model of Education such as Schools of Eminence… [+3393 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Web Desk", "title": "নূপুরের পয়গম্বর মন্তব্য সামনে এনেছিলেন, সেই সাংবাদিক মহম্মদ জুবেরকে গ্রেফতার করল দিল্লি পুলিশ", "description": "পুলিশ সূত্রে খবর, টুইটার ইউজার হনুমান ভক্ত নামে এক যুবক এই মামলা করেছিলেন।", "url": "https://bengali.indianexpress.com/general-news/altnews-co-founder-mohammed-zubair-arrested-for-allegedly-hurting-religious-sentiments-462688/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/Nupur-Zuabir.jpg", "publishedAt": "2022-06-28T03:34:49Z", "content": "- \r\n , , , , \r\n- \r\n , , - \r\n , , , \r\nStay updated with the latest news headlines and all the latest General news download Indian Express Bengali App.\r\nWeb Title: Altnews co founder mohammed zubair ar… [+48 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "3 killed, dozens hurt in Amtrak train crash in Missouri", "description": "An Amtrak passenger train travelling from Los Angeles to Chicago struck a dump truck Monday in a remote area of Missouri.", "url": "https://indianexpress.com/article/world/missouri-amtrak-train-crash-deaths-injured-7995085/", "urlToImage": "https://images.indianexpress.com/2022/06/amtrak-derailed.jpg", "publishedAt": "2022-06-28T03:32:17Z", "content": "An Amtrak passenger train travelling from Los Angeles to Chicago struck a dump truck Monday in a remote area of Missouri, killing three people and injuring dozens more as rail cars tumbled off the tr… [+6218 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anju Agnihotri Chaba", "title": "Punjab Budget: Not much for farming sector, say experts", "description": "Also, no budget has been allocated to support farmers going for crops ‘alternative’ to paddy’ like maize, basmati, kharif season pulses, etc.", "url": "https://indianexpress.com/article/cities/chandigarh/punjab-budget-not-much-for-farming-sector-say-experts-7995091/", "urlToImage": "https://images.indianexpress.com/2022/06/Screenshot-2022-06-27-at-11.57.57-AM-2.png", "publishedAt": "2022-06-28T03:31:15Z", "content": "While the Punjab government has admitted that it is under obligation to save the state from ‘desertification’, it has not brought any concrete plans for diversification the need of the hour in its bu… [+5129 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "While You Were Asleep: West Indies beat Bangladesh 2-0, Murray defends underarm serve at Wimbledon and Kapp first to score 150 in Tests for SA Women", "description": "The 35-year old used the cheeky serve to serve a special moment during his Centre Court win against James Duckworth on Monday at the Wimbledon.", "url": "https://indianexpress.com/article/sports/cricket/while-you-were-asleep-west-indies-beat-bangladesh-2-0-murray-defends-underarm-serve-at-wimbledon-and-kapp-hits-150-to-bail-sa-women-7995037/", "urlToImage": "https://images.indianexpress.com/2022/06/West-Indies-Murray-Kapp.jpg", "publishedAt": "2022-06-28T03:10:08Z", "content": "Two-time Wimbledon champion, Andy Murray believes the underarm serve is a legitimate option to make sure the opponent doesn’t stand too deep to return service.The 35-year old used the serve in his wi… [+3240 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Zeeshan Shaikh", "title": "‘Being part of MVA a difficult journey; political interference in every constituency’", "description": "Samajwadi Party MLA Rais Shaikh elaborates on where his party stands in the present political situation in Maharashtra", "url": "https://indianexpress.com/article/cities/mumbai/being-part-of-mva-a-difficult-journey-political-interference-in-every-constituency-7994984/", "urlToImage": "https://images.indianexpress.com/2022/06/Rais-2col.jpg", "publishedAt": "2022-06-28T03:08:57Z", "content": "Samajwadi Party (SP) MLA from Bhiwandi East and two-time Brihanmumbai Municipal Corporation (BMC) Corporator Rais Shaikh elaborates on where his party stands in the present political situation in Mah… [+7542 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Bangla Sports Desk", "title": "ফ্লোরেন্তিনের পর নয়া চমক! পোগবার বন্ধুকে সই করাল কলকাতার এই প্রধান", "description": "এটিকে মোহনবাগানের মতই এবার চমক হাজির করল মহামেডান। পোগবার বন্ধু এবার খেলবেন কলকাতায়।", "url": "https://bengali.indianexpress.com/sports/isl-transfer-mohammedan-ropes-in-atk-mohun-bagans-florentin-pogbas-close-friend-ousmane-ndiaye-462674/", "urlToImage": "https://bengali.indianexpress.com/wp-content/uploads/2022/06/Pogba.jpg", "publishedAt": "2022-06-28T02:57:55Z", "content": "DONE DEAL\r\nMohammedan SC have reached an agreement with former Olympique Lyon graduate Ousmane NDiaye. \r\nOusmane is a versatile defender who has plied his trade in Ligue 2, Turkish Super League, Mold… [+133 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Two Army personnel shot dead by colleague in Pathankot", "description": "The sepoy, who has been serving in the Army for four years, had fled from the scene leaving behind his service weapon, but was nabbed later.", "url": "https://indianexpress.com/article/india/army-personnel-shot-dead-colleague-pathankot-7995024/", "urlToImage": "https://images.indianexpress.com/2022/06/kashmir-1200.jpg", "publishedAt": "2022-06-28T02:56:56Z", "content": "An Army jawan allegedly shot dead two of his colleagues at Mirthal cantonment in Punjab’s Pathankot district on Monday, a police official said.The 22-year-old sepoy allegedly opened fire on two havil… [+849 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Leela Prasad, Sonal Gupta", "title": "Daily Briefing: SC grants interim relief to Shiv Sena rebels; Delhi Police arrests Mohammed Zubair", "description": "In today's edition: The latest on Maharashtra crisis; the Supreme Court's orders in the Gujarat riots cases through the years; the arrest of AltNews co-founder Mohammed Zubair; and more", "url": "https://indianexpress.com/article/live-news/top-news-briefing-today-7995055/", "urlToImage": "https://images.indianexpress.com/2022/06/Express-intro-10.jpg", "publishedAt": "2022-06-28T02:53:07Z", "content": "The Big Story\r\nIn an interim relief for the Shiv Sena rebel MLAs, the Supreme Court extended the deadline set by Maharashtra Deputy Speaker Narhari Zirwalto reply to notices on pleas seeking their di… [+5603 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "How to parent a teen from a teen’s perspective: Listen, stay calm", "description": "Androski asks that adults follow simple step to build good relationships with their teens; that they understand what teens think of them", "url": "https://indianexpress.com/article/lifestyle/life-positive/parent-teen-lucy-androski-life-positive-7981766/", "urlToImage": "https://images.indianexpress.com/2022/06/laptop.jpg", "publishedAt": "2022-06-28T02:50:37Z", "content": "Technology is something that parents and teens dont see eye-to-eye on, according to Lucy Androski, a 13-year-old teen. Lucy is a young public speaker. Being a teenager, she has a unique view on how t… [+1479 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Santosh Singh", "title": "Bihar: Nine apolitical organisations come together against “militant communalism and confused opposition”", "description": "Combined forum to demand Bihar caste census be done in rational manner.", "url": "https://indianexpress.com/article/cities/patna/bihar-nine-apolitical-organisations-come-together-against-militant-communalism-confused-opposition-7995045/", "urlToImage": "https://images.indianexpress.com/2022/06/census.jpg", "publishedAt": "2022-06-28T02:48:00Z", "content": "As many as nine apolitical and social organisations working for the rights of backwards and deprived classes are coming together on one platform in Patna on 30 June to discuss militant “communalism a… [+2601 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sports Desk", "title": "IND vs ENG 5th Test: ECB announces 15-member England squad for Edgbaston Test", "description": "James Anderson, who missed the third Test match against New Zealand, is also back in the squad against India.", "url": "https://indianexpress.com/article/sports/cricket/ind-vs-eng-5th-test-ecb-announces-15-member-england-squad-for-edgbaston-test-7995035/", "urlToImage": "https://images.indianexpress.com/2022/06/Untitled-design-7-4.jpg", "publishedAt": "2022-06-28T02:37:46Z", "content": "Hosts England have announced their 15-member squad for the fifth and final Test against India, starting from July 1 at the Edgbaston.  Sam Billing has been called up after their regular wicket keeper… [+1060 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lakshana N Palat", "title": "Jugjugg Jeeyo: Neetu Kapoor captures the raw anguish of a loveless marriage in one scene, everything else is just noise", "description": "Jugjugg Jeeyo had the right themes, but it derailed by delving into trite, sexist comedy and utilising age-old Bollywood tropes for a story that was intended to be progressive.", "url": "https://indianexpress.com/article/entertainment/bollywood/jugjugg-jeeyo-neetu-kapoor-star-of-the-show-7993769/", "urlToImage": "https://images.indianexpress.com/2022/06/jugjugg-jeeyo-box-office.jpg", "publishedAt": "2022-06-28T02:34:20Z", "content": "In Jugjugg Jeeyo, Neetu Kapoor silences a flustered Varun Dhawan, who plays her son, after he snaps at Kiara Advani, her daughter-in-law, with just a few words, Khabardar Naina se aise baat ki mere s… [+6388 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Mimansa Shekhar", "title": "Best and worst Hindi films of 2022 so far: RRR, Gangubai Kathiawadi, KGF 2, Gehraiyaan on the list", "description": "2022 has so far seen several superstars failing to bring audience to the theatres, while some small budget content-driven movies got the applause. As we enter the second half of 2022, we take a look back and list down Hindi movies, which outshone, and the one…", "url": "https://indianexpress.com/article/entertainment/bollywood/best-and-worst-hindi-films-of-2022-so-far-rrr-gangubai-kathiawadi-kgf-2-gehraiyaan-alia-bhatt-ss-rajamouli-7993416/", "urlToImage": "https://images.indianexpress.com/2022/06/Best-worst-films-card-1200.jpg", "publishedAt": "2022-06-28T02:34:13Z", "content": "Bollywood in 2022 has so far remained highly dependent on either audience emotions, or pan-India titles. While the former impacted the theatrical performance of releases like The Kashmir Files, Samra… [+5059 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Jignasa Sinha", "title": "What is IFSO, the Delhi Police unit that arrested Mohammed Zubair?", "description": "The unit had arrested climate activist Disha Ravi, investigated GitHub apps that targeted Muslim women.", "url": "https://indianexpress.com/article/cities/delhi/ifso-delhi-police-mohammed-zubair-7995033/", "urlToImage": "https://images.indianexpress.com/2022/06/ifso-zubair.jpeg", "publishedAt": "2022-06-28T02:32:11Z", "content": "The Intelligence Fusion and Strategic Operations (IFSO) unit of the Delhi Police, a specialised team under the Special Cell, has been making “significant” arrests and has registered cases against sev… [+4964 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "IE Online", "title": "Haunted by the idea of success, I found self-therapy through writing", "description": "Born to a life of privilege, an MBA graduate from Harvard Business School and the CEO of BP Ergo, nobody believed that Aparna Piramal Raje suffered from bipolar disorder or that she had serious mental health struggles before she found her calling in writing. …", "url": "https://indianexpress.com/article/lifestyle/health/haunted-by-the-idea-of-success-i-found-self-therapy-through-writing-7994801/", "urlToImage": "https://images.indianexpress.com/2022/06/Aparna0150.jpg", "publishedAt": "2022-06-28T02:30:49Z", "content": "I grew up with three defining beliefs related to myself and the world around me, based on the prevailing family business environment and my response to it: First, to be successful was to be an entrep… [+9305 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Education Desk", "title": "Manabadi TS Inter 1st, 2nd Year Results 2022 LIVE Updates: Result today at tsbie.cgg.gov.in", "description": "Manabadi TS Inter Results 2022, TSBIE Telangana Intermediate 1st, 2nd Year Results 2022 at www.tsbie.cgg.gov.in, manabadi.com, results.cgg.gov.in, bse.telangana.gov.in: Students who appeared for both first and second year exams can check the results through t…", "url": "https://indianexpress.com/article/education/manabadi-ts-inter-1st-2nd-year-results-2022-live-updates-result-toppers-merit-list-tsbie-cgg-gov-in-manabadi-co-in-7988488/", "urlToImage": "https://images.indianexpress.com/2022/06/4-185.jpg", "publishedAt": "2022-06-28T02:30:12Z", "content": "Manabadi TSBIE TS Inter Results 2022 Live updates: The Telangana Board, TSBIE will declare the Intermediate Public Examination (IPE) first and second year board examination results today. The inter r… [+852 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Reuters", "title": "UK’s Northern Ireland trade law clears first parliamentary hurdle", "description": "Despite some fierce criticism, lawmakers voted 295 to 221 in favour of the Northern Ireland Protocol Bill, which would unilaterally overturn part of Britain's divorce deal from the EU agreed in 2020.", "url": "https://indianexpress.com/article/world/northern-ireland-trade-law-clears-first-parliamentary-hurdle-7995002/", "urlToImage": "https://images.indianexpress.com/2022/06/uk-parliament-mace-759.jpg", "publishedAt": "2022-06-28T02:17:27Z", "content": "Legislation allowing Britain to scrap some of the rules on post-Brexit trade with Northern Ireland on Monday passed the first of many parliamentary tests, as Prime Minister Boris Johnson pressed on w… [+2414 chars]"}]}