{"status": "ok", "totalResults": 427, "articles": [{"source": {"id": null, "name": "The Indian Express"}, "author": "A. Kameshwari", "title": "Jaaved Jaaferi says father Jagdeep was proud of India’s inclusivity: ‘Sadly I see it is going for a toss…’", "description": "Jaaved Jaaferi spoke about the lessons he learned from his father, legendary actor Jagdeep, who passed away in 2020.", "url": "https://indianexpress.com/article/entertainment/bollywood/jaaved-jaaferi-father-jagdeep-india-inclusivity-it-is-going-for-a-toss-7887921/", "urlToImage": "https://images.indianexpress.com/2022/04/Jaaved-Jaaferi-1200-1.jpg", "publishedAt": "2022-04-27T02:48:30Z", "content": "In 2020, Indian cinema lost a gem – legendary actor-comedian Jagdeep. The actor, who has been a part of 400 films, has touched our lives either with his on-screen work or his words. We know him as an… [+3954 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Villarreal face next giant at Liverpool in Champions League semifinals", "description": "Now the club from a small town of 50,000 inhabitants in eastern Spain must get past one more giant standing in the way of a dream appearance in its first Champions League final.", "url": "https://indianexpress.com/article/sports/football/villarreal-face-next-giant-at-liverpool-in-champions-league-semifinals-7889088/", "urlToImage": "https://images.indianexpress.com/2022/04/AP22102722352809.jpg", "publishedAt": "2022-04-27T02:46:11Z", "content": "Juventus and Bayern Munich learned the hard way that Villarreal, despite its modest reputation, is no pushover even in Europe’s elite competition.Now the club from a small town of 50,000 inhabitants … [+4702 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Hina Rohtaki", "title": "Chandigarh to seek help of French experts in preserving its 12,000 heritage items", "description": "While speaking to The Indian Express, UT Adviser Dharam Pal said, “I was informed that an inventory was prepared for all heritage items and there are about 12,000 such items including chairs, heritage manhole covers, etc.”", "url": "https://indianexpress.com/article/cities/chandigarh/chandigarh-to-seek-help-of-french-experts-in-preserving-its-12000-heritage-items-7889083/", "urlToImage": "https://images.indianexpress.com/2022/04/chandigarh-auction.jpg", "publishedAt": "2022-04-27T02:42:27Z", "content": "The Chandigarh Administration will seek help of French experts in preserving and protecting its 12,000 heritage items, which may be sold abroad for lakhs. Whether Radio Frequency Identification (RFID… [+2319 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "Karim Benzema keeps Real Madrid alive in Champions League despite 4-3 loss to Man City", "description": "Manchester City just couldn't shake off Real Madrid in the Champions League.", "url": "https://indianexpress.com/article/sports/football/karim-benzema-keeps-real-madrid-alive-in-champions-league-despite-4-3-loss-to-man-city-7889071/", "urlToImage": "https://images.indianexpress.com/2022/04/Untitled-design-8-5.jpg", "publishedAt": "2022-04-27T02:37:55Z", "content": "It was the coolest of penalties at the end of one of the wildest matches in Champions League history.With his cheekily dispatched “Panenka,” Karim Benzema might just have kept Real Madrid’s chances a… [+4782 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Serivce", "title": "Ten killed in Thanjavur as temple car comes in contact with a high tension cable during a procession", "description": "Initial reports confirm ten deaths, including two children who were part of the team that pulled the temple car. Seven of them died on the spot.", "url": "https://indianexpress.com/article/cities/chennai/thanjavur-10-kiled-temple-car-comes-in-contact-with-high-tension-cable-7889065/", "urlToImage": "https://images.indianexpress.com/2022/04/express-photo-13-14.jpeg", "publishedAt": "2022-04-27T02:05:13Z", "content": "Five injured are being treated in the hospital. At least 10 people were killed in the early hours of Wednesday in Kalimedu near Thanjavur, after an overhead high-voltage cable came in contact with a … [+569 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Stranger Things star David Harbour to star in Cooper Raiff’s The Trashers", "description": "The Trashers will chronicle the rise and fall of Jimmy Galante (David Harbour), a Connecticut trash magnate and associate of the Genovese crime family.", "url": "https://indianexpress.com/article/entertainment/hollywood/david-harbour-to-headline-cooper-raiffs-directorial-the-trashers-7888309/", "urlToImage": "https://images.indianexpress.com/2022/04/David-Harbour-1200by667-n.jpg", "publishedAt": "2022-04-27T02:00:36Z", "content": "Hollywood star David Harbour will play the lead role in filmmaker Cooper Raiff’s upcoming film The Trashers. Raiff, best known for directing the Dakota Johnson-starrer Cha Cha Real Smooth, will direc… [+1104 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Mohamed Thaver", "title": "Rana not ill-treated in lock-up, will provide details: Walse Patil", "description": "After the Ranas were arrested on Saturday for attempting to recite Hanuman Chalisa outside Matoshree – CM Uddhav Thackeray’s residence in Mumbai – they were first kept at Khar police station, from where they were taken to Santacruz police station.", "url": "https://indianexpress.com/article/cities/mumbai/rana-not-ill-treated-in-lock-up-will-provide-details-walse-patil-hanuman-chalisa-controversy-7889057/", "urlToImage": "https://images.indianexpress.com/2022/04/cats-68.jpg", "publishedAt": "2022-04-27T01:58:24Z", "content": "Maharashtra Home Minister Dilip Walse Patil on Tuesday denied that Independent MP Navneet Rana, who was lodged at Santacruz police station on Saturday night, had been treated unfairly by the local po… [+3591 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Jayalalithaa death case: Probe panel completes hearing, nearly 5 years after it was formed", "description": "The Arumughaswamy Commission of Inquiry, constituted by the previous AIADMK government, commenced it's hearing on November 22, 2017. Justice Arumughaswamy is a retired judge of the Madras High Court.", "url": "https://indianexpress.com/article/cities/chennai/jayalalithaa-death-probe-arumughaswamy-commission-completes-hearing-7889054/", "urlToImage": "https://images.indianexpress.com/2022/04/jayalalithaa-biopic-759.jpeg", "publishedAt": "2022-04-27T01:56:48Z", "content": "The inquiry by a commission probing the circumstances surrounding late Tamil Nadu Chief Minister J Jayalalithaa’s death culminated on Tuesday, nearly four and a half years after it was constituted by… [+2077 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Madras HC upholds order which allowed only sportspersons to head sports bodies", "description": "The first bench of the High Court upheld an order of a single judge, which among other things had held that sports organisations must be headed by sports persons alone.", "url": "https://indianexpress.com/article/cities/chennai/madras-hc-upholds-order-which-allowed-only-sportspersons-to-head-sports-bodies-7889042/", "urlToImage": "https://images.indianexpress.com/2022/04/Madras-HC-5-4.jpeg", "publishedAt": "2022-04-27T01:55:58Z", "content": "The Madras High Court on Tuesday observed that only sportspersons and not politicians and others should be office-bearers of sports associations and federations and upheld a single judge order in thi… [+2213 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Sonal Gupta, Rahel Philipose", "title": "Daily Briefing: Covaxin gets DCGI nod for 6-12-year-olds; Congress and Prashant Kishor part ways & more", "description": "🎧 In today’s episode of the ‘3 Things’ podcast, we discuss Elon Musk's Twitter deal, his focus on absolute free speech, and what all of it means for users.", "url": "https://indianexpress.com/article/live-news/top-news-briefing-today-7889051/", "urlToImage": "https://images.indianexpress.com/2022/04/Express-intro-10.jpg", "publishedAt": "2022-04-27T01:54:25Z", "content": "The Big Story\r\nA day after the European Commission President asserted that the war in Ukraine would deeply affect the Indo-Pacific region and the rest of the world, External Affairs Minister S Jaisha… [+4971 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Tamil Nadu govt to provide 50,000 free power connections to farmers: Minister", "description": "The announcement comes close on the heels of the DMK government's success in providing, for the first time, one lakh agriculture service connections in less than a year during 2021-22 fiscal.", "url": "https://indianexpress.com/article/cities/chennai/tamil-nadu-govt-to-provide-50000-free-power-connections-to-farmers-minister-7889052/", "urlToImage": "https://images.indianexpress.com/2022/04/V-Senthil-Balaji.jpeg", "publishedAt": "2022-04-27T01:50:48Z", "content": "The Tamil Nadu government will provide 50,000 free agriculture service connections to farmers during 2022-’23 fiscal, Electricity Minister V Senthil Balaji informed the Assembly on Tuesday.The announ… [+1069 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Formulate scheme to give employment guarantee: Madras HC", "description": "The State government, which is now responsible for their engagement ought to consider their pitiable plight, hanging precariously by a thread and initiate all necessary and earnest steps towards addressing their grievance.", "url": "https://indianexpress.com/article/cities/chennai/formulate-scheme-to-give-employment-guarantee-madras-hc-7889036/", "urlToImage": "https://images.indianexpress.com/2022/04/Madras-HC-2-3-1-12.jpg", "publishedAt": "2022-04-27T01:45:07Z", "content": "The Madras High Court has directed the Tamil Nadu government to formulate as expeditiously as possible a comprehensive scheme for providing guarantee of employment to the ousted block level co-ordina… [+1854 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Chennai custodial death: Tamil Nadu CM MK Stalin announces Rs 10 lakh solatium for family", "description": "CM M K Stalin informed the Assembly that the government would bear the medical expenses of Suresh, who was arrested along with Vignesh for allegedly consuming ganja on their possession, by the Secretariat Colony police on April 18.", "url": "https://indianexpress.com/article/cities/chennai/chennai-custodial-death-tamil-nadu-cm-stalin-announces-compensation-7889044/", "urlToImage": "https://images.indianexpress.com/2022/04/MK-Stalin_Chess-2.jpeg", "publishedAt": "2022-04-27T01:31:09Z", "content": "Tamil Nadu Chief Minister M K Stalin on Tuesday announced a solatium of Rs 10 lakh to the kin of Vignesh, who allegedly died in police custody recently, on humanitarian grounds and assured that the p… [+2229 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "AP", "title": "The Offer recreates wild drama behind The Godfather: ‘An interesting examination of how difficult it is in Hollywood’", "description": "What’s revealed in the 10-episodes of The Offer, debuting April 28, is that pressure from the mafia was just one of many hurdles that Ruddy, Evans and other players navigated to get The Godfather movie made.", "url": "https://indianexpress.com/article/entertainment/web-series/the-offer-recreates-wild-drama-behind-the-godfather-7887724/", "urlToImage": "https://images.indianexpress.com/2022/04/The-Offer-ap-1200by667.jpeg", "publishedAt": "2022-04-27T01:30:41Z", "content": "On a trip to New York in the early 1970s, Robert Evans, the former head of Paramount, discovered a dead rat in his hotel room bed. According to the new Paramount+ series The Offer, this was not an un… [+3655 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "PTI", "title": "Madras HC calls for trial court judgment in former PM Rajiv Gandhi murder case", "description": "Rajiv Gandhi was assassinated at an election public meeting organised by the Congress party at Sriperumbudur in the night of May 21, 1991.", "url": "https://indianexpress.com/article/cities/chennai/madras-hc-calls-for-trial-court-judgment-in-former-pm-rajiv-gandhi-murder-case-7889031/", "urlToImage": "https://images.indianexpress.com/2022/04/Madras-HC_Rajiv-Gandhi.jpg", "publishedAt": "2022-04-27T01:30:18Z", "content": "The first bench of the Madras High Court on Tuesday called for a copy of the order of the Tada Court in Poonamallee, which had passed an order on January 28, 1998 imposing death sentence to all the 2… [+2208 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Ritu Sharma", "title": "Two panels for stricter monitoring of private universities in Gujarat", "description": "The Gujarat Assembly had last month passed a Bill amending the Act to announce 11 more universities, taking the total number of private universities in the state from 43 to 54.", "url": "https://indianexpress.com/article/cities/ahmedabad/two-panels-for-stricter-monitoring-of-private-universities-in-gujarat-7889029/", "urlToImage": "https://images.indianexpress.com/2022/04/gujarat-univeristy-.jpg", "publishedAt": "2022-04-27T00:21:28Z", "content": "For effective implementation of the Gujarat Private Universities Act 2009 and the rules under the Act, the state government has appointed two committees for stricter monitoring, supervision, inspecti… [+4273 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "SCs commission Rights violation during Mevani arrest: Notice to Assam, Gujarat", "description": "The petition has been moved by Kirit Rathod, convenor of Dalit Adhikar Manch – an organisation working for the rights of the oppressed.", "url": "https://indianexpress.com/article/cities/gandhinagar/scs-commission-rights-violation-during-mevani-arrest-notice-to-assam-gujarat-7889024/", "urlToImage": "https://images.indianexpress.com/2022/04/MEVANI-1.jpg", "publishedAt": "2022-04-27T00:16:13Z", "content": "Acting on a petition alleging human rights violation by police in Assam and Gujarat during the arrest of of Vadgam MLA Jignesh Mevani, the National Commission for Scheduled Castes (NCSC) on Tuesday i… [+1339 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Peter Vidal", "title": "Horoscope Today, April 27, 2022: Libra, Aries, Pisces and other signs — check astrological prediction", "description": "Aquarius -- Certainly there does seem to be a connection at present between overseas commitments and responsibility, but there is still further information to come.", "url": "https://indianexpress.com/article/horoscope/horoscope-today-april-27-2022-libra-aries-pisces-and-other-signs-check-astrological-prediction-7888848/", "urlToImage": "https://images.indianexpress.com/2022/02/GettyImages-Pisces-zodiac-1200.jpg", "publishedAt": "2022-04-27T00:07:44Z", "content": "ARIES (Mar 21 – Apr. 20)Just as it seems that the world was too dominated by Venus’ slightly hysterical location, along comes Mars, your very special planet, with its firm, uncompromising desire to p… [+3410 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Kamaal Saiyed", "title": "J P Nadda ‘busy’, BJP postpones event in Surat to May 7", "description": "The “One day one district” by state BJP chief CR Paatil was launched in Tapi district on April 21 to reach out to party workers and religious leaders in each district ahead of the state assembly elections due in December.", "url": "https://indianexpress.com/article/cities/surat/j-p-nadda-busy-bjp-postpones-event-in-surat-to-may-7-7889022/", "urlToImage": "https://images.indianexpress.com/2022/04/JP-NADDA-3.jpg", "publishedAt": "2022-04-27T00:05:59Z", "content": "The second leg of One day one district programme by Bharatiya Janata Party (BJP) state unit to be held in Surat on April 30 has been postponed to May 7 due to partys national president JP Naddas unav… [+1115 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Express News Service", "title": "Send CCTV footage of Contai civic polling for forensic exam: Calcutta HC to EC", "description": "The division bench of Chief Justice Prakash Srivastava and Justice Rajarshi Bharadwaj said, “We are of the opinion that...in larger public interest and to uphold democratic principles it is necessary to get forensic audit of CCTV footage of the Contai Municip…", "url": "https://indianexpress.com/article/cities/kolkata/send-cctv-footage-of-contai-civic-polling-for-forensic-exam-calcutta-hc-to-ec-7889020/", "urlToImage": "https://images.indianexpress.com/2022/04/CALCUTTA-HC-1-2.jpg", "publishedAt": "2022-04-26T23:59:56Z", "content": "The Calcutta High Court on Tuesday directed the State Election Commission to send CCTV footage of voting from booths for the Contai Municipality elections for forensic examination to the Central Fore… [+1413 chars]"}]}