{"status": "ok", "totalResults": 881, "articles": [{"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Russian invasion of Ukraine can happen anytime now: White House", "description": "\"We are in the window where we believe an attack could come at any time, and that would be preceded by a fabricated pretext that the Russians use as an excuse to launch an invasion,\" Psaki told reporters at her daily news conference.", "url": "https://www.moneycontrol.com/news/world/russian-invasion-of-ukraine-can-happen-anytime-now-white-house-8116991.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/02/4-ukraine-russia-conflict-belarus-drill-770x433.jpg", "publishedAt": "2022-02-17T01:55:26Z", "content": "A Russian invasion of Ukraine can happen anytime now, the White House said Wednesday as President Joe Biden announced plans to dispatch Vice President Kamala Harris and Secretary of State Tony Blinke… [+2593 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Oil slides after France and Iran say closer to a nuclear deal", "description": "U.S. West Texas Intermediate (WTI) crude was trading down $2.50, or 2.7%, at $91.16 a barrel at 0058 GMT, after it ended up 1.7% the previous day.", "url": "https://www.moneycontrol.com/news/business/markets/oil-slides-after-france-and-iran-say-closer-to-a-nuclear-deal-8116971.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/02/oil-industry-770x433.jpg", "publishedAt": "2022-02-17T01:52:42Z", "content": "Oil slid more than 2% in early Asian trade on Thursday after both France and Iran said parties are closer to an agreement to salvage Iran's 2015 nuclear deal with world powers, offsetting ongoing con… [+1022 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "US hopes India to stand by its side if Russia invades Ukraine", "description": "During the recently concluded Quad ministerial in Melbourne that included foreign ministers from Australia, India, Japan and the United States, State Department Spokesperson Ned Price said there was a discussion of Russia and Ukraine.", "url": "https://www.moneycontrol.com/news/india/us-hopes-india-to-stand-by-its-side-if-russia-invades-ukraine-8116981.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/02/PM-Modi-in-Lok-Sabha-770x374.png", "publishedAt": "2022-02-17T01:51:13Z", "content": "India is committed to rules-based international order, the United States said Wednesday, hoping that New Delhi would stand by its side in case of an impending Russian invasion of Ukraine.\r\nDuring the… [+3553 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "ICICI Value Discovery Fund uses ONGCâ\u0080\u0099s sharp January rally to book profits", "description": "Shares of the oil producer rallied around 21 percent last month on the back of a 15 percent surge in global crude oil prices during the period to a seven-year high aided by rising geopolitical tensions in Eastern Europe and increasing global demand", "url": "https://www.moneycontrol.com/news/business/mutual-funds/icici-value-discovery-fund-uses-ongcs-sharp-january-rally-to-book-profits-8113541.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2019/05/ONGC-India-770x433.jpg", "publishedAt": "2022-02-17T01:45:36Z", "content": "The biggest rally in shares of Oil &amp; Natural Gas Corporation (ONGC) in more than 11 months in January prompted ICICI Value Discovery Fund to trim holding.\r\nShares of the oil producer rallied arou… [+2565 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Apple defeats copyright lawsuit over racially diverse emoji", "description": "Cub Club Investment LLC didn#39;t show that Apple copied anything that was eligible for copyright protection, U.S. District Judge Vince Chhabria said.", "url": "https://www.moneycontrol.com/news/world/apple-defeats-copyright-lawsuit-over-racially-diverse-emoji-8116951.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/12/apple-770x433.jpg", "publishedAt": "2022-02-17T01:42:40Z", "content": "Apple Inc convinced a California federal judge on Wednesday to throw out a lawsuit accusing the tech giant of ripping off another company's multiracial emoji and violating its intellectual property r… [+1658 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Tesla sued over alleged suspension failure in fatal Florida crash", "description": "The 2021 Model 3 vehicle had a \"defective and unreasonably dangerous suspension that may cause loss of control during ordinary and foreseeable driving conditions,\" according to the lawsuit filed by the driver#39;s family in a Florida state court last week. Th…", "url": "https://www.moneycontrol.com/news/world/tesla-sued-over-alleged-suspension-failure-in-fatal-florida-crash-8116961.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/04/Tesla-770x433.jpg", "publishedAt": "2022-02-17T01:39:54Z", "content": "Tesla Inc has been sued over an alleged suspension failure in a crash that killed the driver and a passenger in Florida last year and sparked a federal probe.\r\nThe 2021 Model 3 vehicle had a \"defecti… [+1811 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Japan set to announce easing of strict border measures", "description": "About 150,000 foreign students have been kept out of the country, along with workers desperately needed by an aging nation with a shrinking population, prompting warnings of labour shortages and damage to Japan#39;s international reputation.", "url": "https://www.moneycontrol.com/news/world/japan-set-to-announce-easing-of-strict-border-measures-8116921.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/09/Japan_22022020-770x433.jpg", "publishedAt": "2022-02-17T01:35:51Z", "content": "Japan is set to announce on Thursday that it will ease border controls put in place to counter the spread of the coronavirus, measures that are the strictest among wealthy nations and have been slamm… [+2092 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Ukraine stand-off keeps euro pinned", "description": "The standoff on Europe#39;s eastern edge is one of the deepest crises in East-West relations for decades, and markets - and the euro - had rallied in relief at earlier Russian statements about a military pullback. A senior U.S. official told reporters on Wedn…", "url": "https://www.moneycontrol.com/news/world/ukraine-stand-off-keeps-euro-pinned-8116931.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/07/Swiss-franc_euro_reuters-770x433.jpg", "publishedAt": "2022-02-17T01:33:59Z", "content": "The euro was weighed down on Thursday after a U.S. official said Russia was increasing troop numbers near its border with Ukraine rather than withdrawing, offsetting a boost it had caught overnight f… [+2401 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Britain sees record investment in 10-billion-pound cyber sector", "description": "Companies that received new investment included Bristol-based Immersive Labs, which raised 53.5 million pounds, and London-headquartered Tessian, which secured more than 52 million pounds, the government said in its Annual Cyber Sector Report.", "url": "https://www.moneycontrol.com/news/world/britain-sees-record-investment-in-10-billion-pound-cyber-sector-8116941.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/05/Pound_may20-770x433.jpg", "publishedAt": "2022-02-17T01:32:17Z", "content": "British cyber security firms raised more than 1 billion pounds ($1.36 billion) in 84 deals last year, as foreign investors tapped into growth in capabilities such as network security and threat monit… [+459 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "On the edge of a polish forest, where some of Vladimir Putinâ\u0080\u0099s darkest fears lurk", "description": "The fence is the perimeter of a highly sensitive US military facility protected by Polish soldiers and is expected to operate this year. Washington claims to help protect Europe and the United States from ballistic missiles launched by fraudulent nations like…", "url": "https://www.moneycontrol.com/news/world/on-the-edge-of-a-polish-forest-where-some-of-vladimir-putins-darkest-fears-lurk-8116901.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/06/Vladimir-Putin_Jun30_21-770x433.jpg", "publishedAt": "2022-02-17T01:25:57Z", "content": "In a meeting with Mr Putin on Monday, Russian Foreign Minister Serge V. Labrov said that Russia had a fundamental change in the field of security in Europe, that is, a wide range of changes, includin… [+2089 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Marriott, AirBnB, others see global travel rebounding in 2022", "description": "Hotel and other travel-related companies delivered rosy outlooks in this week#39;s quarterly results, citing rising vaccination rates and falling COVID-19 cases in the United States after the winter surge of the Omicron variant.", "url": "https://www.moneycontrol.com/news/world/marriott-airbnb-others-see-global-travel-rebounding-in-2022-8116881.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/12/flight-770x433.png", "publishedAt": "2022-02-17T01:10:37Z", "content": "Marriott and Hilton, two of the biggest U.S. hotel chains, told investors they expect people to resume packing their bags for business and leisure this year at rates not seen since before the pandemi… [+2975 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "G20 finance leaders to debate inflation, fallout from tighter policy", "description": "But rising COVID cases overshadow the gathering with many ministers either attending online or skipping the meeting altogether, heightening challenges for host Indonesia#39;s efforts to promote a broader and stronger post-pandemic global recovery.", "url": "https://www.moneycontrol.com/news/world/g20-finance-leaders-to-debate-inflation-fallout-from-tighter-policy-8116871.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/01/Janet-Yellen-770x433.jpg", "publishedAt": "2022-02-17T01:05:22Z", "content": "Finance leaders of the world's top 20 economies will debate the fallout from lingering geopolitical tensions, rising global inflation and tighter monetary policy in some regions at a two-day meeting … [+2698 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Moderna eyes COVID booster by August, not clear yet if Omicron-specific needed", "description": "Last month Moderna began clinical trials for a booster dose specifically designed to target Omicron but initial results from studies in monkeys show the Omicron-specific shot may not offer stronger protection than a new dose of the existing vaccine.", "url": "https://www.moneycontrol.com/news/world/moderna-eyes-covid-booster-by-august-not-clear-yet-if-omicron-specific-needed-8116861.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/12/moderna-vaccine-770x433.jpg", "publishedAt": "2022-02-17T01:02:20Z", "content": "An Omicron-specific booster could be ready by August, the CEO of U.S. biotech firm Moderna told Reuters, but the firm is still gathering clinical data to determine whether that vaccine would offer be… [+2417 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Canada police say they will take city Ottawa back, govt#39;s blames extremists", "description": "Later, Interim Police Chief Steve Bell vowed \"to take back the entirety of the downtown core and every occupied space\" in \"coming days\", adding \"it will take time to do this right\".", "url": "https://www.moneycontrol.com/news/world/canada-police-say-they-will-take-city-ottawa-back-govts-blames-extremists-8116851.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/02/US-Canada-Border-2-770x433.jpg", "publishedAt": "2022-02-17T00:59:23Z", "content": "Police in the Canadian capital Ottawa on Wednesday started warning truck drivers blockading the downtown core that they should depart or face arrest, part of a promised crackdown to end a three-week-… [+3783 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Joe Biden, Olaf Scholz highlight NATO reinforcements if Russia invades Ukraine", "description": "A German government spokesperson said the two leaders agreed the situation in Ukraine must be assessed as \"extremely serious\" as there is still a risk of further Russian military aggression.", "url": "https://www.moneycontrol.com/news/world/joe-biden-olaf-scholz-highlight-nato-reinforcements-if-russia-invades-ukraine-8116841.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/02/joe-biden-770x433.jpg", "publishedAt": "2022-02-17T00:55:51Z", "content": "U.S. President Joe Biden and German Chancellor Olaf Scholz discussed Russia's military build-up near Ukraine in a phone call Wednesday and underscored the importance of reinforcing NATO's eastern fla… [+1597 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "West warns Russia is moving troops towards, not away from, Ukraine", "description": "There have been sightings of additional armoured vehicles, helicopters and a field hospital moving towards Ukraineâ\u0080\u0099s borders, Britain#39;s defence intelligence chief Jim Hockenhull said in a rare public statement.", "url": "https://www.moneycontrol.com/news/world/west-warns-russia-is-moving-troops-towards-not-away-from-ukraine-8116831.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/02/4-ukraine-russia-conflict-belarus-drill-770x433.jpg", "publishedAt": "2022-02-17T00:53:59Z", "content": "Russia's military build-up near the Ukrainian border is continuing, the United States warned on Wednesday as Estonia said battle groups were approaching ahead of a likely attack to occupy \"key terrai… [+5457 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Japan#39;s exports grow less than expected, trade deficit soars", "description": "The world#39;s third-largest economy ran its biggest trade deficit in a single month in eight years, as persistent rises in fuel and raw material costs swelled imports, the value of which outstripped shipments.", "url": "https://www.moneycontrol.com/news/world/japans-exports-grow-less-than-expected-trade-deficit-soars-8116821.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/01/Export_import-770x433.jpg", "publishedAt": "2022-02-17T00:48:46Z", "content": "Japan's exports in January grew less than expected as manufacturers faced pressure from slowing overseas demand for cars and struggled with global supply constraints.\r\nThe world's third-largest econo… [+1773 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Readout of January meeting shows Fed not wed to particular pace of rate hikes", "description": "The account of the two-day session showed the U.S. central bank readying for a fight against the fastest pace of price increases since the 1980s, with officials saying that while they still expected inflation to ease through the year they would be ready to hi…", "url": "https://www.moneycontrol.com/news/world/readout-of-january-meeting-shows-fed-not-wed-to-particular-pace-of-rate-hikes-8116811.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/05/Federal-Reserve-Chair-Jerome-Powell-770x433.jpg", "publishedAt": "2022-02-17T00:46:35Z", "content": "Federal Reserve officials last month agreed that, with inflation tightening its grip on the economy and employment strong, it was time to raise interest rates, but also that any decisions would depen… [+4197 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Gold, oil rise on Ukraine crisis; US stocks end flat", "description": "Stronger-than-expected U.S. retail sales data and higher inflation readings from Canada and Britain added to the outlook for tighter monetary policy worldwide, but geopolitical tensions kept markets for the most part focused on the Ukraine standoff.", "url": "https://www.moneycontrol.com/news/business/markets/gold-oil-rise-on-ukraine-crisis-us-stocks-end-flat-8116791.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/01/gold_yellow-metal__precious-metal_gold-prices-1-770x433.jpg", "publishedAt": "2022-02-17T00:43:52Z", "content": "Oil and gold rose on Wednesday after NATO and the United States said Russia was increasing its troop build-up near Ukraine, while a dovish reading of minutes from the last Federal Reserve meeting hel… [+3672 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "The SP 500 rebounds, closes slightly higher after Fed minutes", "description": "The minutes showed that while policymakers agreed that it would \"soon be appropriate\" to raise the Fed#39;s benchmark overnight interest rate from its near-zero level, they would re-asses the rate hike timeline at each meeting.", "url": "https://www.moneycontrol.com/news/business/markets/the-sp-500-rebounds-closes-slightly-higher-after-fed-minutes-8116781.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/04/Wall-street-770x433.jpg", "publishedAt": "2022-02-17T00:40:31Z", "content": "Wall Street bounced off session lows Wednesday with the S&amp;P 500 crossing into positive territory by the closing bell after the U.S. Federal Reserve released meeting minutes, which said that while… [+3734 chars]"}]}