{"status": "ok", "totalResults": 451, "articles": [{"source": {"id": null, "name": "Moneycontrol"}, "author": "Hindi.Moneycontrol.com Team, Moneycontrol Hindi", "title": "XE वेरिएंट से देश भर में बढ़ा खौफ, तीन महीने में R- Value एक से अधिक, जानिए अन्य राज्यों का हाल", "description": "कोरोना वायरस एक बार फिर से वापस लौट आया है। यह अब बहुत तेजी से सभी शहरों में फैल रहा है। जिससे लोग अपनी हेल्‍थ को लेकर चिंतित हो रहे हैं। ऐसे मौके पर अपनी सुरक्षा सबसे जरूरी होती है। जानकारों का मानना है कि कोविड के लिए भारत का रिप्रोडक्शन नंबर (R) जनवरी के ब…", "url": "http://hindi.moneycontrol.com/news/india/omicron-delta-recombinant-xe-variants-r-value-more-than-one-in-three-months-know-the-condition-of-other-states-541811.html", "urlToImage": "https://images.moneycontrol.com/static-hindinews/2022/04/Corona_Test21FB-770x430.jpg", "publishedAt": "2022-04-21T02:21:54Z", "content": "(R) R-Value 12 18 1.07 , 5 11 0.93 \r\n , , , \r\nR- Value 1 10 R- Value 2.98 , R- Value R- Value , R- Value , R- Value 2.12, 2.12, 1.04, 1.70, 1.18, 1.18 1.04 R- Value 0.72 0.88 \r\n R-Value\r\nR R-Value , … [+46 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Reuters", "title": "British PM Boris Johnson signals visa flexibility with India to win trade deal", "description": "Speaking on the plane on his way to the world#39;s second-most populous country, Johnson signalled he was ready to be more accommodating on an issue that could have stalled the talks.", "url": "https://www.moneycontrol.com/news/india/british-pm-boris-johnson-signals-visa-flexibility-with-india-to-win-trade-deal-8387211.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/02/Boris-Johnson-770x433.jpg", "publishedAt": "2022-04-21T02:06:17Z", "content": "British Prime Minister Boris Johnson indicated he was ready to offer more visas to India in return for this year clinching a free-trade deal that could boost annual bilateral trade by billions of pou… [+1626 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "FM Nirmala Sitharaman calls for proactive collective efforts towards protecting economies at G20 FMCBG meet in US", "description": "The meeting was held here on Wednesday under the presidency of Indonesia. Its agenda included global economic outlook and risk, international financial architecture and global health.", "url": "https://www.moneycontrol.com/news/business/economy/fm-nirmala-sitharaman-calls-for-proactive-collective-efforts-towards-protecting-economies-at-g20-fmcbg-meet-in-us-8387221.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/04/Nirmala-Sitharaman-and-Gina-Raimondo-770x433.jpg", "publishedAt": "2022-04-21T02:00:05Z", "content": "Global growth momentum is dampened by prolonged inflation, supply chain disruption, volatility in energy markets and investor uncertainty, Finance Minister Nirmala Sitharaman has said as she attended… [+2368 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Bloomberg", "title": "India wants trade pact with UK by October, easier worker visas", "description": "The British prime ministerâ\u0080\u0099s trip comes just weeks after Foreign Secretary Liz Truss visited New Delhi in a bid to convince the Modi government to condemn Russiaâ\u0080\u0099s invasion of Ukraine and join efforts to economically isolate Moscow.", "url": "https://www.moneycontrol.com/news/world/india-wants-trade-pact-with-uk-by-october-easier-worker-visas-8387201.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/11/exportsimports-770x433.png", "publishedAt": "2022-04-21T01:52:55Z", "content": "India is keen to finalize a trade pact with Britain by October and will seek easier access to visas for skilled workers and students when U.K. Prime Minister Boris Johnson visits the country later th… [+2078 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Sunil Shankar Matkar", "title": "Trade Spotlight | What should investors do with ACC, Biocon, Vinati Organics, Astral, Fineotex Chemical on Thursday?", "description": "Fineotex Chemical is trading in an uptrend and has recently shown outperformance. The previous resistance of Rs 182 is now expected to become a support and hence any declines towards this support could be used as a buying opportunity.", "url": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-what-should-investors-do-with-acc-biocon-vinati-organics-astral-fineotex-chemical-on-thursday-8385611.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/12/sensex_stocks_nifty_stockmarket-1-770x433.jpg", "publishedAt": "2022-04-21T01:49:59Z", "content": "The market closed sharply higher for the first time in six consecutive sessions on April 20, backed by auto, cement, FMCG, technology, pharma stocks, and index heavyweights Reliance Industries and HD… [+3610 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "RohanPatil", "title": "Hot Stocks | Here is why you should bet on Hindustan Unilever, ICICI Lombard for short term", "description": "Hindustan Unilever has shown a strong reversal from the lower levels after forming a double bottom formation near Rs 1,930 levels on the daily time frame. The breakout comes with a bullish candle and above average volumes indicate fresh buying from the lower …", "url": "https://www.moneycontrol.com/news/business/markets/hot-stocks-here-is-why-you-should-bet-on-hindustan-unilever-icici-lombard-for-short-term-8385711.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/04/sensex_nifty_stock-stocks_stock-770x433.jpg", "publishedAt": "2022-04-21T01:47:09Z", "content": "Rohan Patil, Technical Analyst at Bonanza Portfolio\r\nAfter a strong sell off in the previous day's trading session, Nifty50 witnessed a gap up opening on April 20 and sustained above 17,050 levels th… [+2560 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Reuters", "title": "Judge rejects #39;gag order#39; for Elon Musk", "description": "U.S. District Judge Edward Chen in San Francisco agreed with Musk and Tesla that the proposed temporary restraining order appeared overbroad because it prevented Musk from speaking to &quot;anyone&quot; about the case.", "url": "https://www.moneycontrol.com/news/world/judge-rejects-gag-order-for-elon-musk-8387141.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/04/Elon-Musk-Bloomberg-770x433.jpg", "publishedAt": "2022-04-21T01:29:22Z", "content": "Elon Musk will not be subjected to a \"gag order\" preventing him from discussing a lawsuit claiming he defrauded Tesla Inc shareholders by tweeting in 2018 about taking his electric car company privat… [+2154 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Reuters", "title": "US Justice Department appeals transportation mask ruling", "description": "A U.S. district judge ruled on Monday that the mandates, which apply to planes, trains and other public transportation, were unlawful. The Justice Department said it would appeal the ruling if the CDC determined the 14-month-old mandate was still needed.", "url": "https://www.moneycontrol.com/news/world/us-justice-department-appeals-transportation-mask-ruling-8387131.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/02/4-mask-wearing-in-india-770x433.jpg", "publishedAt": "2022-04-21T01:27:21Z", "content": "The U.S. Justice Department on Wednesday appealed a judge's ruling ending a mask mandate on public transportation and airplanes, a spokesman said, after the Centers for Disease Control and Prevention… [+825 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Reuters", "title": "Raising Fed#39;s policy rate to 2.5% by end of 2022 is #39;prudent,#39; Mary Daly says", "description": "&quot;Accounting for the risks of being too fast or too slow, I see an expeditious march to neutral by the end of the year as a prudent path,&quot; Daly said in remarks prepared for delivery at the University of Nevada, Las Vegas, noting that most forecasters…", "url": "https://www.moneycontrol.com/news/world/raising-feds-policy-rate-to-2-5-by-end-of-2022-is-prudent-mary-daly-says-8387121.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/09/FEDfederal-reserve-770x433.jpg", "publishedAt": "2022-04-21T01:25:20Z", "content": "San Francisco Federal Reserve President Mary Daly on Wednesday said she supports getting the U.S. central bank's benchmark overnight interest rate up to about 2.5% by the end of the year, joining wha… [+2210 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Reuters", "title": "Netflix heads for worst day in two decades as investors hit #39;not for me#39;", "description": "The streaming pioneer#39;s shares fell 37% to $220.40 and were headed for their worst day in nearly 18 years if the losses hold. More than a dozen analysts rushed to temper their views on a stock that has been a red-hot market performer in the past few years.", "url": "https://www.moneycontrol.com/news/world/netflix-heads-for-worst-day-in-two-decades-as-investors-hit-not-for-me-8387111.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/04/Netflix-1-770x433.jpg", "publishedAt": "2022-04-21T01:20:26Z", "content": "Netflix Inc shares lost over a third of their value on Wednesday after the company reported its first drop in subscribers in a decade, leaving Wall Street questioning its growth in the face of fierce… [+2824 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Reuters", "title": "UK PM Boris Johnson says Ukraine peace talks are doomed because of \"crocodile\" Vladimir Putin", "description": "The prime minister was speaking as he headed to India, where he will encourage his counterpart Narendra Modi to end its neutrality over the war in Ukraine. He played down the likelihood that India would end its longstanding ties with Russia.", "url": "https://www.moneycontrol.com/news/world/uk-pm-boris-johnson-says-ukraine-peace-talks-are-doomed-because-of-crocodile-vladimir-putin-8387101.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/02/Boris-Johnson-770x433.jpg", "publishedAt": "2022-04-21T01:17:51Z", "content": "British Prime Minister Boris Johnson said any peace talks over Ukraine are likely to fail, as he compared holding talks with Russian President Vladimir Putin to negotiating with a crocodile.\r\nJohnson… [+3043 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "PTI", "title": "World Bank President David Malpass welcomes India#39;s move of selling oil from its stockpiles", "description": "Speaking on the sidelines of the annual Spring meeting of the IMF and the World Bank held here, Malpass told reporters that allowing more trade and opening of markets were &quot;very important&quot; steps.", "url": "https://www.moneycontrol.com/news/business/economy/world-bank-president-david-malpass-welcomes-indias-move-of-selling-oil-from-its-stockpiles-8387051.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/04/386451372-770x433.jpg", "publishedAt": "2022-04-21T01:06:05Z", "content": "World Bank President David Malpass has welcomed Indias move to begin selling oil from its stockpiles, asserting that the world needs to take important steps to address the current set of crises.\r\nSpe… [+3725 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "PTI", "title": "India#39;s high growth rate positive news for world: IMF Managing Director Kristalina Georgieva", "description": "The IMF, early this week, projected a â\u0080\u009cfairly robustâ\u0080\u009d growth of 8.2 per cent for India in 2022, making it the fastest-growing major economy in the world, almost twice faster than Chinaâ\u0080\u0099s 4.4 per cent.", "url": "https://www.moneycontrol.com/news/business/economy/indias-high-growth-rate-positive-news-for-world-imf-managing-director-kristalina-georgieva-8387061.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/03/Kristalina-Georgieva_reuters-770x433.jpg", "publishedAt": "2022-04-21T01:04:01Z", "content": "A high growth rate for India, as projected in the latest World Economic Outlook, is not only healthy for the country but also positive news for the world, Managing Director of the International Monet… [+1753 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "PTI", "title": "India in much better place to face Ukrainian crisis due to its successful macroeconomic management of pandemic: IMF official", "description": "Observing that India represents about seven per cent of the total world economy in purchasing power parity (PPP) terms and is one of the countries that are growing rapidly, IMFâ\u0080\u0099s Mission Chief for India Nada Choueiri told PTI that India#39;s growth is lifti…", "url": "https://www.moneycontrol.com/news/business/economy/india-in-much-better-place-to-face-ukrainian-crisis-due-to-its-successful-macroeconomic-management-of-pandemic-imf-official-8387071.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/06/Economy-770x435.jpg", "publishedAt": "2022-04-21T01:00:38Z", "content": "The successful macroeconomic management of the Covid-19 pandemic has resulted in a strong recovery of Indias economy because of which the country is in a better position to face the economic fallout … [+7637 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "PTI", "title": "Imran Khan indirectly blames \"some elements\" in establishment for his ouster as Pakistan PM", "description": "â\u0080\u009cRelations between the establishment and the Pakistan Tehreek-e-Insaf (PTI) government had strained for months. We tried our best, including myself, to remove misunderstandings with the establishment but could not succeed,â\u0080\u009d former minister Fawad Chaudhry …", "url": "https://www.moneycontrol.com/news/world/imran-khan-indirectly-blames-some-elements-in-establishment-for-his-ouster-as-pakistan-pm-8387081.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/04/RTXCY2IFR-770x433.jpg", "publishedAt": "2022-04-21T00:56:37Z", "content": "Ousted Pakistani prime minister Imran Khan has indirectly blamed some elements in the establishment for him losing power, as one of his close aides admitted their partys relationship with the militar… [+2680 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Reuters", "title": "Elon Musk#39;s Tesla races ahead of rising costs with price hikes", "description": "Tesla has been an outlier since the pandemic outbreak, posting record deliveries and earnings for several quarters when rivals wrestling with global supply chain snarls rolled out production halts.", "url": "https://www.moneycontrol.com/news/world/elon-musks-tesla-races-ahead-of-rising-costs-with-price-hikes-8387091.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/04/Elon-Musk-Bloomberg-770x433.jpg", "publishedAt": "2022-04-21T00:53:17Z", "content": "Tesla Inc results surged past Wall Street expectations on Wednesday, as higher prices helped insulate the electric vehicle maker from supply chain chaos and rising costs.\r\nThe results also should tri… [+4323 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Reuters", "title": "William Ackman gives up on Netflix, taking $400 million loss as shares tumble", "description": "The shares tumbled 35% on Wednesday to close at $226.19, just 24 hours after the company announced that it had lost subscribers for the first time in a decade.", "url": "https://www.moneycontrol.com/news/world/william-ackman-gives-up-on-netflix-taking-400-million-loss-as-shares-tumble-8387041.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/01/William-Ackman-bill-Ackman-770x433.jpg", "publishedAt": "2022-04-21T00:47:54Z", "content": "William Ackman's hedge fund Pershing Square Holdings Ltd said on Wednesday that it exited its Netflix Inc investment as the streaming service's stock price plunged and the billionaire investor absorb… [+724 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Reuters", "title": "Nasdaq drags on Wall Street, bond yields dip", "description": "The Dow Jones Industrial Average ended higher for the second straight day, the S&amp;P 500 was flat, and the Nasdaq Composite fell sharply after Netflix reported it had lost subscribers for the first time in over a decade, casting gloom over the tech sector.", "url": "https://www.moneycontrol.com/news/business/markets/nasdaq-drags-on-wall-street-bond-yields-dip-8387031.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/11/NYSEwall-street-770x433.jpg", "publishedAt": "2022-04-21T00:46:09Z", "content": "U.S. stocks ended in mixed territory on Wednesday as the tech-heavy Nasdaq was dragged down by bleak Netflix earnings, while bond yields dipped after a recent strong run.\r\nThe Dow Jones Industrial Av… [+2990 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Reuters", "title": "Leading Vladimir Putin ally predicts Mariupol victory on Thursday", "description": "Mariupol would be the biggest city to be seized by Russia since invading Ukraine eight weeks ago in an attack that has taken longer than some military analysts expected, seen over five million people flee abroad and turned towns and cities to rubble.", "url": "https://www.moneycontrol.com/news/world/leading-vladimir-putin-ally-predicts-mariupol-victory-on-thursday-8387021.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/04/vladimir-putin-770x433.jpg", "publishedAt": "2022-04-21T00:40:23Z", "content": "Russian forces said they will seize the Mariupol steel plant that is the last main stronghold of resistance in the besieged city on Thursday after Ukraine proposed talks on evacuating troops and civi… [+5354 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Reuters", "title": "Elon Musk scores hat trick of Tesla compensation goals worth $23 billion", "description": "The world#39;s most valuable carmaker posted March quarter revenue and profit that surged past Wall Street estimates as it raised prices in response to inflation, offsetting the impact of a Shanghai factory shutdown.", "url": "https://www.moneycontrol.com/news/world/elon-musk-scores-hat-trick-of-tesla-compensation-goals-worth-23-billion-8387011.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/04/Elon-Musk-Bloomberg-770x433.jpg", "publishedAt": "2022-04-21T00:38:46Z", "content": "With Tesla's strong quarterly report on Wednesday, Chief Executive Elon Musk has scored a hat trick of performance goals worth a combined $23 billion in new compensation.\r\nThe world's most valuable c… [+1769 chars]"}]}