{"status": "ok", "totalResults": 439, "articles": [{"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Chinaâ\u0080\u0099s energy map to 2025 plans massive boost in power capacity", "description": "The country aims to have 3,000 gigawatts of generating capacity installed by 2025, up from 2,200 at the end of 2020, according its 14th five-year plan for energy development released Monday. The 800-gigawatt growth goal is about twice the size of Indiaâ\u0080\u0099s en…", "url": "https://www.moneycontrol.com/news/world/chinas-energy-map-to-2025-plans-massive-boost-in-power-capacity-8263221.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/03/385531219-770x433.jpg", "publishedAt": "2022-03-23T02:06:20Z", "content": "China is targeting a huge increase in power capacity over the next five years as it tries to ensure energy security while staying on course to reach long-term climate goals.\r\nThe country aims to have… [+2145 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Petrol, diesel prices hiked by 80 paise a litre each for the second day in a row", "description": "Petrol will now cost Rs 97.01 per litre in Delhi, while you shall have to pay Rs 88.27 per litre for diesel. In Mumbai, petrol will now cost Rs 111.67, while diesel would cost Rs 95.85 per litre.", "url": "https://www.moneycontrol.com/news/business/economy/petrol-diesel-prices-hiked-by-80-paise-a-litre-each-for-the-second-day-in-a-row-8263201.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/03/fuelpetroldiesel-770x433.jpg", "publishedAt": "2022-03-23T02:03:10Z", "content": "Petrol and diesel prices were raised by over 80 paise a litre on March 23 for the second day in a row after a status quo on rates for 137 days.\r\nPetrol will now cost Rs 97.01 per litre in Delhi, whil… [+2247 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Europe is heading for a diesel shortage, traders Trafigura and Gunvor Say", "description": "Europeâ\u0080\u0099s leading diesel external supplier has seen its exports of crude oil and petroleum products slide by about 2 million-2.5 million barrels a day since the invasion, Trafigura Group Chief Executive Officer Jeremy Weir said at the Financial Times Commodi…", "url": "https://www.moneycontrol.com/news/world/europe-is-heading-for-a-diesel-shortage-traders-trafigura-and-gunvor-say-8263181.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/03/383444323-770x433.jpg", "publishedAt": "2022-03-23T02:02:37Z", "content": "Europe is facing the prospect of a shortage of diesel as flows from Russia dwindle in the aftermath of its invasion of Ukraine, senior executives at three trading houses said.\r\nEuropes leading diesel… [+3914 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Recession is unavoidable without Russian oil, Dallas Fed study says", "description": "â\u0080\u009cIf the bulk of Russian energy exports is off the market for the remainder of 2022, a global economic downturn seems unavoidable,â\u0080\u009d economists Lutz Kilian and Michael Plante wrote in an article posted by the Dallas Fed Tuesday. â\u0080\u009cThis slowdown could be mo…", "url": "https://www.moneycontrol.com/news/world/recession-is-unavoidable-without-russian-oil-dallas-fed-study-says-8263161.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/03/385531921-770x433.jpg", "publishedAt": "2022-03-23T01:51:45Z", "content": "The global economy likely wont be able to avoid a recession without a resumption of Russian energy exports this year, according to a study by Federal Reserve Bank of Dallas economists.\r\nIf the bulk o… [+2398 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Exemplary efforts to draw more investment to JK: PM Modi on Gulf countries investment summit", "description": "Tagging the tweet, Modi said, \"Exemplary efforts to draw more investment to Jammu and Kashmir, and ensure greater opportunities for the people.\"", "url": "https://www.moneycontrol.com/news/india/exemplary-efforts-to-draw-more-investment-to-jk-pm-modi-on-gulf-countries-investment-summit-8263081.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/03/10-pm-modi-2day-gujarat-visit-770x433.jpg", "publishedAt": "2022-03-23T01:45:31Z", "content": "After Jammu and Kashmir Lieutenant Governor Manoj Sinha addressed a Gulf countries investment summit in Srinagar, Prime Minister Narendra Modi on Tuesday hailed \"exemplary efforts\" to draw more inves… [+909 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "France#39;s Emmanuel Macron speaks with Vladimir Putin, Volodymyr Zelenskyy", "description": "They reached â\u0080\u009cno agreement,â\u0080\u009d the statement said, but Macron â\u0080\u009cremains convinced of the need to continue his effortsâ\u0080\u009d and he â\u0080\u009cstands alongside Ukraine.â\u0080\u009d", "url": "https://www.moneycontrol.com/news/world/frances-emmanuel-macron-speaks-with-vladimir-putin-volodymyr-zelenskyy-8263071.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/02/emmanuel-macron-770x433.jpg", "publishedAt": "2022-03-23T01:42:29Z", "content": "French President Emmanuel Macron on Tuesday talked with both Russian President Vladimir Putin and Ukrainian counterpart Volodymyr Zelenskyy about the terms of a potential cease-fire, according to the… [+377 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Trade Spotlight | What should investors do with Jindal Drilling, Mahindra Holidays, KSB Pumps, Rain Industries on Wednesday?", "description": "Mahindra Holidays seems to have registered a consolidation breakout on huge volumes after remaining sideways for almost 9 weeks. Hence, sustaining above Rs 213 levels it can head higher to test its interim top of Rs 267 registered in the month of November 202…", "url": "https://www.moneycontrol.com/news/business/markets/trade-spotlight-what-should-investors-do-with-jindal-drilling-mahindra-holidays-ksb-pumps-rain-industries-on-wednesday-8262671.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/12/sensex_stocks_nifty_stockmarket-1-770x433.jpg", "publishedAt": "2022-03-23T01:40:53Z", "content": "The smart recovery from the day's low helped the benchmark indices post more than a percent gains on Tuesday. The rebound was backed by positive global mood. Buying in banks, auto, IT, metals stocks … [+3471 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Russia has failed#39; to accomplish its objectives in Ukraine: US", "description": "Sullivan told reporters that Russia intended to accomplish three basic objectives in launching its unprovoked attack against Ukraine: first, to subjugate Ukraine; second, to enhance Russian power and prestige; and third, to divide and weaken the West.", "url": "https://www.moneycontrol.com/news/world/russia-has-failed-to-accomplish-its-objectives-in-ukraine-us-8263151.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/02/joe-biden-vladimir-putin-770x433.jpg", "publishedAt": "2022-03-23T01:31:27Z", "content": "Russia has \"manifestly failed\" to accomplish its three major goals through the country's \"brutal\" invasion of Ukraine, US National Security Advisor Jake Sullivan has said.\r\nOn February 24, Russian fo… [+2503 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "This is now the worst drawdown on record for global fixed income", "description": "The Bloomberg Global Aggregate Index, a benchmark for government and corporate debt, has fallen 11% from a high in early 2021. Thatâ\u0080\u0099s the biggest decline from a peak in data stretching back to 1990, surpassing a 10.8% drawdown during the financial crisis in…", "url": "https://www.moneycontrol.com/news/world/this-is-now-the-worst-drawdown-on-record-for-global-fixed-income-8263131.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/03/385554822-770x433.jpg", "publishedAt": "2022-03-23T01:21:37Z", "content": "Losses in global bond markets have marked a milestone as central banks including the Federal Reserve look to tighten policy to combat surging inflation.\r\nThe Bloomberg Global Aggregate Index, a bench… [+1373 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Hot Stocks | Double-digit return likely in short term from Sundram Fasteners, Chalet Hotels, Intellect Design Arena", "description": "Sundram Fasteners has created a strong base at Rs 780 level and managed to close above its all-important moving averages. On the upside, Rs 928 is an immediate hurdle then Rs 990 is the next target level.", "url": "https://www.moneycontrol.com/news/business/markets/hot-stocks-double-digit-return-likely-in-short-term-from-sundram-fasteners-chalet-hotels-intellect-design-arena-8261591.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/03/sensex_nifty_sensex_market-4-770x430.jpg", "publishedAt": "2022-03-23T01:19:55Z", "content": "Santosh Meena, Head of Research at Swastika Investmart\r\nThe Nifty respected its 200-DMA (day moving average) after a pullback from 100-DMA and witnessed a smart rally on March 22. There is a high pos… [+2422 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "China Plane Crash: Pilots didnâ\u0080\u0099t answer calls; fast dive", "description": "Investigators have offered no major insights as to why the Boeing Co. 737-800 jet carrying 132 people crashed near Wuzhou in southern China on Monday, saying at a press conference late Tuesday it was too early draw clear conclusions about the cause. All 123 p…", "url": "https://www.moneycontrol.com/news/world/china-plane-crash-pilots-didnt-answer-calls-fast-dive-8263091.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/03/385539734-770x433.jpg", "publishedAt": "2022-03-23T01:17:48Z", "content": "Pilots of a doomed China Eastern Airlines Corp. flight failed to respond to calls from air-traffic controllers after tipping into a deadly nosedive, authorities said. The jet was traveling at close t… [+3386 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Apple services including App Store resume after outage for second straight day", "description": "Tuesday#39;s outage also affected Mac App Store, users of Apple Card, Apple Books, iCloud Web Apps and Weather. The outage on Monday affected 11 of Apple#39;s services, including Arcade and Maps.", "url": "https://www.moneycontrol.com/news/world/apple-services-including-app-store-resume-after-outage-for-second-straight-day-8263041.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/01/Apple-iPad-review-2-1-770x433.jpg", "publishedAt": "2022-03-23T01:10:02Z", "content": "Apple Inc's Apple Music, mobile App Store and Podcasts resumed services on Tuesday, after facing outages for a second consecutive day, according to the company's system status page.\r\nTuesday's outage… [+547 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "China searches for victims from plane crash with cause still unclear", "description": "Flight MU5735 was headed on Monday for the port city of Guangzhou from Kunming, capital of the southwestern province of Yunnan, when it plunged from cruising altitude to crash in the mountains of Guangxi less than an hour before landing time.", "url": "https://www.moneycontrol.com/news/world/china-searches-for-victims-from-plane-crash-with-cause-still-unclear-8263031.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/03/pjimage-12-4-770x433.jpg", "publishedAt": "2022-03-23T01:08:21Z", "content": "Rescuers in southern China searched for victims from a China Eastern Airlines jet on Tuesday after it crashed with 132 people on board and authorities said severe damage to the aircraft would make it… [+4398 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Joe Biden to announce new Russia sanctions while in Brussels", "description": "Joe Biden, who will take part in a special meeting of NATO and address the European Council summit, is also expected to underscore efforts to enforce the avalanche of existing sanctions already announced by the U.S. and allies.", "url": "https://www.moneycontrol.com/news/world/joe-biden-to-announce-new-russia-sanctions-while-in-brussels-8263021.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/03/pjimage-13-770x433.jpg", "publishedAt": "2022-03-23T01:02:47Z", "content": "President Joe Biden plans to announce new sanctions against Russia on Thursday while in Brussels for meetings with NATO and European allies, according to a top national security aide.\r\nBiden, who wil… [+3334 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Fed policymakers call for bigger rate hikes to fight inflation", "description": "\"The Fed needs to move aggressively to keep inflation under control,\" St. Louis Fed President James Bullard told Bloomberg TV on Tuesday, calling for the central bank to raise its benchmark overnight interest rate to 3% this year.", "url": "https://www.moneycontrol.com/news/world/fed-policymakers-call-for-bigger-rate-hikes-to-fight-inflation-8263011.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2020/05/Federal-Reserve-Chair-Jerome-Powell-770x433.jpg", "publishedAt": "2022-03-23T00:59:25Z", "content": "Federal Reserve officials are helping shape market expectations for sharper interest-rate hikes to curb the surge in inflation, but have not managed to dispel fears the tightening cycle could blow a … [+4624 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "EXPLAINER: What is known about the China Eastern plane crash", "description": "One day after the China Eastern Airlines flight plunged from the sky, there are more questions than answers.", "url": "https://www.moneycontrol.com/news/world/explainer-what-is-known-about-the-china-eastern-plane-crash-8263001.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/03/pjimage-12-4-770x433.jpg", "publishedAt": "2022-03-23T00:55:34Z", "content": "The crash of a Boeing 737-800 passenger jet in Chinas southwest started a fire big enough to be seen from space and forced rescuers to search a rugged, remote mountainside.\r\nOne day after the China E… [+5439 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Ukraine war imperils wheat, but farmers in no rush to pivot", "description": "Worldwide, farmers like Kessel are weighing whether to change their planting patterns and grow more wheat this spring as the war has choked off or thrown into question grain supplies from a region known as â\u0080\u009cthe breadbasket of the world.â\u0080\u009d", "url": "https://www.moneycontrol.com/news/world/ukraine-war-imperils-wheat-but-farmers-in-no-rush-to-pivot-8262991.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/05/shutterstock_447280168-770x433.jpg", "publishedAt": "2022-03-23T00:51:02Z", "content": "Russias war in Ukraine could mean changes for Ed Kessels farm along a quiet stretch of western North Dakota.\r\nWorldwide, farmers like Kessel are weighing whether to change their planting patterns and… [+7451 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "New trade deal to lift tariffs on British steel, US motorcycles, whiskey", "description": "In a joint statement, U.S. Commerce Secretary Gina Raimondo and U.S. Trade Representative Katherine Tai said the deal would protect steel and aluminum companies - and their workers - in both countries, allowing the allies to focus on what they say are \"Chinaâ…", "url": "https://www.moneycontrol.com/news/world/new-trade-deal-to-lift-tariffs-on-british-steel-us-motorcycles-whiskey-8262981.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2021/01/Export_import-770x433.jpg", "publishedAt": "2022-03-23T00:47:46Z", "content": "The United States and Britain ended a four-year dispute over U.S. steel and aluminum tariffs on Tuesday, pledging to work together to counter China in a deal that also removes retaliatory tariffs fro… [+2883 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Ukraine thwarts Russian advances; fight rages for Mariupol", "description": "â\u0080\u009cPutinâ\u0080\u0099s back is against the wall,â\u0080\u009d said U.S. President Joe Biden, who is heading to Europe this week to meet with allies. â\u0080\u009cAnd the more his back is against the wall, the greater the severity of the tactics he may employ.â\u0080\u009d", "url": "https://www.moneycontrol.com/news/world/ukraine-thwarts-russian-advances-fight-rages-for-mariupol-8262971.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/03/Ukraine-Russia-invasion-Reuters-770x433.jpg", "publishedAt": "2022-03-23T00:40:43Z", "content": "Ukrainian forces fought off continuing Russian efforts to occupy Mariupol and claimed to have retaken a strategic suburb of Kyiv on Tuesday, mounting a defense so dogged that it is stoking fears Russ… [+7460 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": null, "title": "Volodymyr Zelenskyy says humanitarian convoy attacked", "description": "â\u0080\u009cWe are trying to organize stable humanitarian corridors for Mariupol residents, but almost all of our attempts, unfortunately, are foiled by the Russian occupiers, by shelling, or deliberate terror,â\u0080\u009d Zelenskyy said in his nighttime video address to the n…", "url": "https://www.moneycontrol.com/news/world/volodymyr-zelenskyy-says-humanitarian-convoy-attacked-8262961.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/03/pjimage-5-1-770x433.jpg", "publishedAt": "2022-03-23T00:37:11Z", "content": "Ukrainian President Volodymyr Zelenskyy said Russian forces not only blocked a humanitarian convoy trying to reach besieged Mariupol with desperately needed supplies on Tuesday but took captive some … [+912 chars]"}]}