{"status": "ok", "totalResults": 305, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Don't Damage Rail Property: Railway Minister To Agnipath Protesters", "description": "As railway properties come under the attack from those protesting against the Agneepath scheme in parts of the country, Railway Minister Ashwini Vaishnaw on Friday appealed to everyone not to indulge in any violent protest and not to damage railways", "url": "https://www.ndtv.com/india-news/agnipath-protests-railway-minister-ashwini-vaishnaw-appeals-to-protesters-to-not-damage-rail-property-3077788", "urlToImage": "https://c.ndtvimg.com/2022-06/5sfn21o_agnipath-protest-in-ballia_625x300_17_June_22.jpg", "publishedAt": "2022-06-17T22:26:25Z", "content": "Agnipath Row: Protests have broken out in various parts of the country against Agnipath for armed force.\r\nNew Delhi: As railway properties come under the attack from those protesting against the Agne… [+1819 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Anti-Agnipath Protests Due To Misunderstanding, Says Union Minister", "description": "Minister of State for External Affairs V Muraleedharan on Friday said that the Central government has bought Agnipath scheme with the right intentions while adding that some people are agitating due to misunderstanding.", "url": "https://www.ndtv.com/india-news/anti-agnipath-protests-due-to-misunderstanding-says-union-minister-v-muraleedharan-3077769", "urlToImage": "https://c.ndtvimg.com/2020-09/ta2q7lio_v-muraleedharan-650_625x300_17_September_20.jpg", "publishedAt": "2022-06-17T21:52:58Z", "content": "V Muraleedharan said Government is responsive to issues of citizens and the age has been raised to 23.\r\nThiruvananthapuram: Minister of State for External Affairs V Muraleedharan on Friday said that … [+1962 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Mumbai Police Rescue Kidnapped 2-Year-Old-Boy From Woman In 12 Hours", "description": "A two-year-old boy who was kidnapped from close to Panvel railway station was rescued and reunited with his parents within 12 hours, a Navi Mumbai police official said on Friday.", "url": "https://www.ndtv.com/india-news/mumbai-police-rescue-kidnapped-2-year-old-boy-from-woman-in-12-hours-3077750", "urlToImage": "https://c.ndtvimg.com/2022-06/ars722ac_police-generic_625x300_14_June_22.jpg", "publishedAt": "2022-06-17T21:13:15Z", "content": "The accused woman has said she picked up the child as he was found alone. (Representational)\r\nThane: A two-year-old boy who was kidnapped from close to Panvel railway station was rescued and reunited… [+602 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Secrets Vs Press Freedom: All You Need To Know About Case Against Julian Assange", "description": "Wikileaks founder Julian Assange, whose extradition to the US was approved by Britain on Friday, faces charges of espionage in a case that could prove an unprecedented legal battle pitting national security against fundamental press freedom rights.", "url": "https://www.ndtv.com/world-news/secrets-vs-press-freedom-all-you-need-to-know-about-case-against-julian-assange-3077749", "urlToImage": "https://i.ndtvimg.com/i/2015-06/julian-assange_650x400_81434705403.jpg", "publishedAt": "2022-06-17T20:53:00Z", "content": "The charges under the Espionage Act against Julian Assange could bring up to 175 years in prison.\r\nWashington: Wikileaks founder Julian Assange, whose extradition to the United States was approved by… [+4770 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Remains Of UK Journalist Identified In Brazil: Police", "description": "Brazil's Federal Police said Friday it had officially identified the remains of British journalist Dom Phillips, who was found buried in the Amazon after going missing on a book research trip.", "url": "https://www.ndtv.com/world-news/remains-of-uk-journalist-dom-phillip-identified-in-brazil-police-3077745", "urlToImage": "https://c.ndtvimg.com/2022-06/taeu3uro_british-journalist-afp_625x300_14_June_22.jpg", "publishedAt": "2022-06-17T20:33:26Z", "content": "UK's Dom Phillips was a longtime contributor to The Guardian and other leading international newspapers.\r\nAtalaia do Norte, Brazil: Brazil's Federal Police said Friday it had officially identified th… [+1385 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Indonesia Open: HS Prannoy Sails Into Semi-Finals With Thumping Win", "description": "HS Prannoy continued his impressive run as he sailed into the semi-finals of the Indonesia Open Super 1000 badminton tournament with a straight-games win over world number 13 Rasmus Gemke.", "url": "https://sports.ndtv.com/badminton/indonesia-open-hs-prannoy-sails-into-semi-finals-with-thumping-win-over-rasmus-gemke-3077709", "urlToImage": "https://c.ndtvimg.com/2022-05/9nqf46mg_hs-prannoy-afp_625x300_14_May_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-17T19:57:24Z", "content": "India's HS Prannoy continued his impressive run as he sailed into the semi-finals of the Indonesia Open Super 1000 badminton tournament with a straight-games win over world number 13 Rasmus Gemke of … [+1980 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Uttarakhand Top Cop Instructs State Police To Talk To Agnipath Protesters", "description": "Uttarakhand Director General of Police (DGP) Ashok Kumar instructed the Superintendents of Police of all the districts in the state to talk to the youth agitating about the Agnipath scheme and convince them not to protest peacefully.", "url": "https://www.ndtv.com/india-news/agnipath-protests-uttarakhand-dgp-instructs-sps-to-talk-to-agitating-youths-3077699", "urlToImage": "https://c.ndtvimg.com/2021-06/iqseva3_uttarakhand-dgp-ashok-kumar_625x300_10_June_21.jpg", "publishedAt": "2022-06-17T19:50:55Z", "content": "Agnipath Row: Uttarakhand top cop instructed SPs to convince agitators to protest peacefully.\r\nDehradun (Uttarakhand): Uttarakhand Director General of Police (DGP) Ashok Kumar on Friday instructed th… [+1557 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sidhu Moose Wala's Teen \"Fan\" Arrested For Threats To Accused Bishnoi", "description": "A juvenile, who claimed to be a fan of killed Punjabi singer Siddu Moosewala, was apprehended for allegedly sending threats to gangster Lawrence Bishnoi through social media, police said on Friday.", "url": "https://www.ndtv.com/india-news/sidhu-moose-walas-teen-fan-arrested-for-threats-to-accused-gangster-lawrence-bishnoi-3077691", "urlToImage": "https://c.ndtvimg.com/2022-05/lm8qmjn_lawrence-bishnoi-650_650x400_30_May_22.jpg", "publishedAt": "2022-06-17T19:38:27Z", "content": "The teen said he is big fan of Sidhu Moose Wala and after his murder, he got hurt, police said.\r\nNew Delhi: A juvenile, who claimed to be a fan of killed Punjabi singer Siddu Moosewala, was apprehend… [+1667 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Urges \"Accountability\" In Brazil Over Killing Of UK Journalist, Expert", "description": "The United States on Friday urged accountability over the murder in the Brazilian Amazon of a British journalist and an Indigenous expert, as it hailed defenders of the rainforest.", "url": "https://www.ndtv.com/world-news/us-urges-accountability-over-killing-of-uk-journalist-expert-in-brazil-3077672", "urlToImage": "https://c.ndtvimg.com/2022-06/ag9i1ttg_brazil-british-reporter_625x300_13_June_22.jpg", "publishedAt": "2022-06-17T19:14:53Z", "content": "The UK journalist and an indigenous expert were last seen early on June 5 in Brazil's Amazon region.\r\nWashington: The United States on Friday urged accountability over the murder in the Brazilian Ama… [+1473 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Hamilton Welcomes \"Porpoising\" Intervention, Disagrees With Verstappen", "description": "Lewis Hamilton on Friday welcomed the FIA's intervention to overcome 'porpoising' on health and safety grounds and said any steps taken were unlikely to affect the grid for Sunday's Canadian Grand Prix.", "url": "https://sports.ndtv.com/formula-1/lewis-hamilton-welcomes-porpoising-intervention-disagrees-with-max-verstappen-3077639", "urlToImage": "https://c.ndtvimg.com/2022-06/otb8erh8_lewis-hamilton-afp_625x300_18_June_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-17T18:41:34Z", "content": "Lewis Hamilton on Friday welcomed the FIA's intervention to overcome 'porpoising' on health and safety grounds and said any steps taken were unlikely to affect the grid for Sunday's Canadian Grand Pr… [+2367 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Meghalaya's Mawsynram, India's Wettest Place, Sees Record Rainfall", "description": "As monsoon rain lashes Northeast region wreaking havoc and killing people, Mawsynram and Sohra in Meghalaya's East Khasi Hills district are in a competition to be the wettest place in the country receiving record rainfall in the last 24 hours.", "url": "https://www.ndtv.com/india-news/meghalayas-mawsynram-indias-wettest-place-sees-record-rainfall-3077623", "urlToImage": "https://c.ndtvimg.com/2019-04/3faakmog_monsoon-india-reuters_625x300_15_April_19.jpg", "publishedAt": "2022-06-17T18:28:16Z", "content": "Sohra received 2457.2 mm of rainfall in the last three days.(Representational)\r\nShillong: As monsoon rain lashes Northeast region wreaking havoc and killing people, Mawsynram and Sohra in Meghalaya's… [+1111 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "In Viral Video, Traffic Cop Seen Sweeping Pebbles Off Busy Road", "description": "The job of a traffic policeman is not particularly easy as they have to bear with the weather's wrath at all times. But despite that,some walk the extra mile beyondtheir set of duties.", "url": "https://www.ndtv.com/india-news/in-viral-video-traffic-cop-seen-sweeping-pebbles-off-busy-road-3077613", "urlToImage": "https://c.ndtvimg.com/2022-06/4u4r60eo_traffic-cop-sweeps-road-240650_625x300_17_June_22.jpg", "publishedAt": "2022-06-17T18:26:48Z", "content": "The viral video of the traffic cop has garnered over 1.4 million views.\r\nNew Delhi: The job of a traffic policeman is not particularly easy as they have to bear with the weather's wrath at all times.… [+647 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "1st ODI: England Hit World Record 498/4 To Thrash Netherlands", "description": "England hit a world record one-day international score of 498-4 to crush the Netherlands by 232 runs in Amstelveen on Friday, with three men scoring centuries", "url": "https://sports.ndtv.com/cricket/netherlands-vs-england-1st-odi-england-hit-world-record-498-4-to-thrash-netherlands-3077612", "urlToImage": "https://c.ndtvimg.com/2022-06/fgijj6l8_jos-buttler-806_625x300_17_June_22.jpg", "publishedAt": "2022-06-17T18:25:54Z", "content": "England hit a world record one-day international score of 498-4 to crush the Netherlands by 232 runs in Amstelveen on Friday, with three men scoring centuries. Eoin Morgan's side beat their own mark … [+3028 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "2 Arrested With Mephedrone Drug Worth Rs 4.6 Crore In Maharashtra", "description": "Two persons have been arrested allegedly with mephedrone worth Rs 4.60 crore, a Mumbai Crime Branch official said on Friday.", "url": "https://www.ndtv.com/mumbai-news/maharashtra-2-arrested-with-mephedrone-drug-worth-rs-4-6-crore-in-maharashtra-3077323", "urlToImage": "https://i.ndtvimg.com/i/2016-05/arrest-generic_650x400_71463458726.jpg", "publishedAt": "2022-06-17T18:24:53Z", "content": "Mumbai: Two persons have been arrested allegedly with mephedrone. (Representational)\r\nMumbai: Two persons have been arrested allegedly with mephedrone worth Rs 4.60 crore, a Mumbai Crime Branch offic… [+426 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Mask Off, No Foreign Tourist Registration: Thailand Drops Covid Rules", "description": "Thailand announced Friday it would drop rules requiring people to wear masks outdoors and no longer require foreign visitors to register before travel, as Covid-19 cases fall and the kingdom seeks to lure tourists back.", "url": "https://www.ndtv.com/world-news/thailand-coronavirus-thailand-covid-cases-thailand-new-covid-cases-mask-off-no-foreign-tourist-registration-thailand-drops-covid-rules-3077604", "urlToImage": "https://c.ndtvimg.com/2022-01/bshi7g4k_covid-in-thailand-reuters_625x300_06_January_22.jpg", "publishedAt": "2022-06-17T18:22:14Z", "content": "Thailand Coronavirus: Thailand's relaxation on facemasks comes after similar moves by regional peers.\r\nBangkok: Thailand announced Friday it would drop rules requiring people to wear masks outdoors a… [+1938 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Not Our Fault: Russia's Putin On Global Inflation", "description": "Russian President Vladimir Putin said Friday that Moscow's military intervention in Ukraine was not the cause of global economic troubles, instead blaming Western countries for using the situation to cover up their own mistakes.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-not-our-fault-russias-putin-on-global-inflation-3077587", "urlToImage": "https://c.ndtvimg.com/2022-02/fhc8kvmo_putin-afp_625x300_22_February_22.jpg", "publishedAt": "2022-06-17T18:17:55Z", "content": "Russia-Ukraine War: Putin said food shortage \"threatens starvation in poorest countries\".\r\nMoscow: Russian President Vladimir Putin said Friday that Moscow's military intervention in Ukraine was not … [+2388 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Thailand Rushes To Rein In Cannabis Use A Week After Decriminalisation", "description": "Thailand hastily issued a raft of new regulations for cannabis use this week after a long-planned decriminalisation raised alarm at the potential for unchecked use of the substance anywhere and by anyone - including children.", "url": "https://www.ndtv.com/world-news/thailand-rushes-to-rein-in-cannabis-use-a-week-after-decriminalisation-3077581", "urlToImage": "https://c.ndtvimg.com/2022-06/4p0um31o_cannabis_625x300_17_June_22.jpg", "publishedAt": "2022-06-17T18:15:59Z", "content": "Thailand hastily issued a raft of new regulations for cannabis use this week after a long-planned decriminalisation raised alarm at the potential for unchecked use of the substance anywhere and by an… [+2146 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Jean-Louis Trintignant, \"Wonderful Talent\" Of French Cinema, Dies At 91", "description": "Jean-Louis Trintignant, one of France's greatest actors, who died on Friday aged 91, was hailed by French President Emmanuel Macron as \"a wonderful artistic talent and voice\".", "url": "https://www.ndtv.com/world-news/jean-louis-trintignant-wonderful-talent-of-french-cinema-dies-at-91-3077570", "urlToImage": "https://c.ndtvimg.com/2022-06/r9ckk6ck_jeanlouis-trintignant_625x300_17_June_22.jpg", "publishedAt": "2022-06-17T18:12:38Z", "content": "Jean-Louis Trintignant died surrounded by his family in the Gard region of southern France.\r\nParis: Jean-Louis Trintignant, one of France's greatest actors, who died on Friday aged 91, was hailed by … [+2794 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "States Must Define Target To Make India $5 Trillion Economy: PM Modi", "description": "Each state must recognise its strength and define a target as this is crucial for India to become a USD 5-trillion economy, Prime Minister Narendra Modi said on Friday.", "url": "https://www.ndtv.com/india-news/states-must-define-target-to-make-india-5-trillion-economy-pm-modi-3077557", "urlToImage": "https://c.ndtvimg.com/2022-06/o7p67on4_narendra-modi-ani_625x300_09_June_22.jpg", "publishedAt": "2022-06-17T18:07:59Z", "content": "In 2019, Prime Minister Narendra Modi envisioned to make India a USD 5-trillion economy.(File)\r\nDharamshala: Each state must recognise its strength and define a target as this is crucial for India to… [+4667 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Property Worth Crores Found During Anti-Corruption Raid On Gardener", "description": "Karnataka Anti-Corruption Bureau (ACB) officials were in for a shock on Friday when they unearthed the wealth of Shivalingaiah, a gardener in the Bangalore Development Authority.", "url": "https://www.ndtv.com/karnataka-news/karnataka-property-worth-crores-found-during-anti-corruption-raid-on-gardener-3077238", "urlToImage": "https://c.ndtvimg.com/2022-06/ars722ac_police-generic_625x300_14_June_22.jpg", "publishedAt": "2022-06-17T18:02:43Z", "content": "Karnataka: 80 locations linked to 21 officials were raided, ACB authorities said. (Representational)\r\nBengaluru: Karnataka Anti-Corruption Bureau (ACB) officials were in for a shock on Friday when th… [+1532 chars]"}]}