{"status": "ok", "totalResults": 322, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE: India Reports 1,829 New COVID-19 Cases In 24 Hours", "description": "India on Wednesday reported at least 1,829 new Covid cases, taking the total number of infections to 4,31,27,199. According to the Union Health Ministry, the active cases dipped to 15,647 in the last 24 hours.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-may-19-2988982", "urlToImage": "https://c.ndtvimg.com/2021-08/4fmrmba_coronavirus-india-reuters-august-30_650x400_30_August_21.jpg", "publishedAt": "2022-05-19T00:25:33Z", "content": "India Covid Live: At least 33 new covid deaths reported in India on Wednesday.\r\nNew Delhi: India on Wednesday reported at least 1,829 new Covid cases, taking the total number of infections to 4,31,27… [+572 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Student Stabs His Girlfriend's Classmate For Talking To Her: Police", "description": "A class 12 student allegedly stabbed his girlfriend's classmate for talking to her in Rajendranagar Mandal of Ranga Reddy district in Telangana, the police said.", "url": "https://www.ndtv.com/india-news/student-stabs-his-girlfriends-classmate-for-talking-to-her-in-telangana-police-2988971", "urlToImage": "https://c.ndtvimg.com/knife-stabbing-generic-pixabay-650_625x300_1529019833273.jpg", "publishedAt": "2022-05-18T23:56:23Z", "content": "According to the police, the victim has been identified as Durga Prasad.\r\nHyderabad: A class 12 student allegedly stabbed his girlfriend's classmate for talking to her in Rajendranagar Mandal of Rang… [+613 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Man Stabs Mother-In-Law To Death After Wife Goes Missing In Andhra: Cops", "description": "A man allegedly stabbed his mother-in-law to death in Andhra's Kakinada district after he failed to find his wife, who left him months ago, at her place, according to a police official on Wednesday.", "url": "https://www.ndtv.com/india-news/man-stabs-mother-in-law-to-death-after-wife-goes-missing-in-andhra-pradesh-2988966", "urlToImage": "https://c.ndtvimg.com/2018-10/2j46hlug_police-generic_625x300_27_October_18.jpg", "publishedAt": "2022-05-18T23:36:53Z", "content": "The police have registered a case against accused Ramesh for killing her mother-in-law.\r\nKakinada, Andhra Pradesh: A man allegedly stabbed his mother-in-law to death in Andhra's Kakinada district aft… [+983 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Johnny Depp Grabbed Amber Heard By Hair, Hit Her Repeatedly: Sister", "description": "Johnny Depp grabbed his then-wife Amber Heard by the hair and repeatedly struck her in the face during a heated argument about a month after their marriage, her sister said Wednesday.", "url": "https://www.ndtv.com/world-news/johnny-depp-grabbed-amber-heard-by-hair-hit-her-repeatedly-sister-2988963", "urlToImage": "https://c.ndtvimg.com/2022-04/h5bpk09c_johnny-depp-defamation-trial_625x300_26_April_22.jpg", "publishedAt": "2022-05-18T23:18:54Z", "content": "\"if he (Johnny Depp) was drinking there was almost always a fight,\" Amber Heard's sister said.\r\nWashington: Johnny Depp grabbed his then-wife Amber Heard by the hair and repeatedly struck her in the … [+3241 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Gurugram: Man Arrested For Issuing Fake GST Invoices Worth Rs 160 Crore", "description": "Directorate General of GST Intelligence Gurugram has arrested a person in connection with a case wherein a total Input Tax Credit (ITC) of over Rs 160 crore has been utilized and passed on by a network of nonexistent and fake firms.", "url": "https://www.ndtv.com/india-news/gurugram-man-arrested-for-issuing-fake-gst-invoices-worth-rs-160-crore-2988951", "urlToImage": "https://i.ndtvimg.com/i/2016-05/arrest-generic_650x400_71463458726.jpg", "publishedAt": "2022-05-18T22:35:54Z", "content": "The man was identified as Pawan Kumar Sharma who arrested on May 13. (Representational)\r\nNew Delhi: Directorate General of GST Intelligence Gurugram has arrested a person in connection with a case wh… [+2211 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Minor Claims Secret Filming In Washroom, Moves Court Alleging Cops' Inaction", "description": "A minor girl has moved the Rajasthan High Court alleging inaction by police into her complaint that a person had secretly filmed her while she was in a washroom at a prominent club here and demanding a CBI inquiry into it.", "url": "https://www.ndtv.com/india-news/minor-claims-secret-filming-at-jodhpur-club-in-washroom-moves-court-alleging-cops-inaction-2988946", "urlToImage": "https://c.ndtvimg.com/court-generic_625x300_1527245477936.jpg", "publishedAt": "2022-05-18T22:11:40Z", "content": "Court also summoned the investigating officer with case diary related to the matter. (Representational)\r\nJodhpur: A minor girl has moved the Rajasthan High Court alleging inaction by police into her … [+1931 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Woman Dies By Suicide After Boyfriend Blocks Her On WhatsApp: Cops", "description": "A 20-year-old woman allegedly hanged herself to death at her boyfriend's house located along the railway tracks in suburban Dahisar apparently after he blocked her number on WhatsApp following an argument with her, police said on Wednesday.", "url": "https://www.ndtv.com/india-news/woman-dies-by-suicide-after-boyfriend-blocks-her-on-whatsapp-cops-2988941", "urlToImage": "https://c.ndtvimg.com/2021-03/3d9746ug_dead-body-generic_625x300_03_March_21.jpg", "publishedAt": "2022-05-18T21:57:02Z", "content": "The woman, identified as Pranali Lokare, was found hanging on Monday morning, police said.\r\nMumbai: A 20-year-old woman allegedly hanged herself to death at her boyfriend's house located along the ra… [+1426 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UN Urges Ukraine Grain Release Amid Global Food Crisis", "description": "The UN warned Wednesday that a growing global food crisis could last years if it goes unchecked, as the World Bank announced an additional $12 billion in funding to mitigate its \"devastating effects.\"", "url": "https://www.ndtv.com/world-news/un-urges-ukraine-grain-release-amid-global-food-crisis-2988930", "urlToImage": "https://c.ndtvimg.com/2020-02/il1pp214_antonio-guterres-reuters_625x300_28_February_20.jpg", "publishedAt": "2022-05-18T21:42:37Z", "content": "The war threatens to tip tens of millions of people over the edge into food insecurity, UN chief said.\r\nUnited Nations: The UN warned Wednesday that a growing global food crisis could last years if i… [+4175 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Explained: What Is Monkeypox And Why Cases Are Rising In Europe", "description": "A handful of cases of monkeypox have now been reported or are suspected in the United Kingdom, Portugal and Spain.", "url": "https://www.ndtv.com/world-news/what-is-monkeypox-and-why-cases-are-rising-in-europe-2988924", "urlToImage": "https://c.ndtvimg.com/2022-05/rkjst6a_monkeypox-disease-650_625x300_10_May_22.jpg", "publishedAt": "2022-05-18T21:09:38Z", "content": "Monkeypox is a virus that causes fever symptoms as well as a distinctive bumpy rash.\r\nLondon: A handful of cases of monkeypox have now been reported or are suspected in the United Kingdom, Portugal a… [+2866 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "No improvement In Situation After Article 370 Removal: Omar Abdullah", "description": "National Conference vice-president Omar Abdullah on Wednesday said there has been no improvement in the security situation in Jammu and Kashmir following the abrogation of Articles 370 and 35A.", "url": "https://www.ndtv.com/india-news/no-improvement-in-security-situation-in-jammu-and-kashmir-after-article-370-removal-omar-abdullah-2988919", "urlToImage": "https://c.ndtvimg.com/2019-08/0a5qmd44_omar-abdullah-pti_625x300_05_August_19.jpg", "publishedAt": "2022-05-18T20:53:54Z", "content": "Omar Abdullah also called for respecting the sentiments of the people in view of the loudspeaker ban.\r\nSrinagar: National Conference vice-president Omar Abdullah on Wednesday said there has been no i… [+1004 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Exiled Ex-Spanish King Juan Carlos To Return Home: Royal Household", "description": "Spain's former king Juan Carlos will return to Spain this week after nearly two years in exile in the United Arab Emirates, the royal household said on Wednesday.", "url": "https://www.ndtv.com/world-news/exiled-ex-spanish-king-juan-carlos-to-return-home-royal-household-2988900", "urlToImage": "https://c.ndtvimg.com/2020-08/h0vibcv8_spains-former-king-juan-carlos-afp_625x300_04_August_20.jpg", "publishedAt": "2022-05-18T20:31:48Z", "content": "Juan Carlos will stay in Sanxenxo in Spain's northwest and will see his son, the Royal House said.\r\nMadrid: Spain's former king Juan Carlos will return to Spain this week after nearly two years in ex… [+1227 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "North Korea Could Conduct \"Nuclear Test\" Ahead Of Biden's Asia trip: US", "description": "The United States believes there is a \"genuine possibility\" that North Korea could conduct a nuclear test or other saber rattling while Joe Biden is on his first trip as president to Asia, a top US official said Wednesday.", "url": "https://www.ndtv.com/world-news/us-says-north-korea-could-conduct-nuclear-test-ahead-of-joe-bidens-asia-trip-2988870", "urlToImage": "https://c.ndtvimg.com/2022-05/efkeqoc4_north-korea-missilereuters_625x300_18_May_22.jpg", "publishedAt": "2022-05-18T20:00:05Z", "content": "US said North Korea is preparing long range missile tests or a nuclear test during Biden's Asia trip.\r\nWashington: The United States believes there is a \"genuine possibility\" that North Korea could c… [+1325 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US 'confident' Turkey Will Overcome Concerns On Finland, Sweden NATO Bids", "description": "The United States is \"confident\" that Turkey's concerns over accession to NATO by Finland and Sweden can be overcome, a top advisor to President Joe Biden said Wednesday.", "url": "https://www.ndtv.com/world-news/us-says-turkeys-concern-will-overcome-on-finland-sweden-nato-bid-2988824", "urlToImage": "https://c.ndtvimg.com/2022-05/n9jpkq3c_joe-biden-reuters_625x300_03_May_22.jpg", "publishedAt": "2022-05-18T19:07:10Z", "content": "Ukraine war: Biden's advisor said that US 'confident' that Turkey's concern will overcome.\r\nWashington: The United States is \"confident\" that Turkey's concerns over accession to NATO by Finland and S… [+424 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "LSG Pull Off Last-Ball Thriller Vs KKR After de Kock's Ton, In Play-offs", "description": "Lucknow Super Giants defeated Kolkata Knight Riders to qualify for IPL 2022 play-offs", "url": "https://sports.ndtv.com/ipl-2022/kkr-vs-lsg-indian-premier-league-2022-lucknow-super-giants-pull-off-last-ball-thriller-against-kolkata-knight-riders-after-quinton-de-kocks-ton-enter-2988792", "urlToImage": "https://c.ndtvimg.com/2022-05/g6jd2908_de-kock-bcciipl_625x300_19_May_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-18T18:42:17Z", "content": "Quinton de Kock struck a sensational hundred and shared a record opening stand with skipper K L Rahul as Lucknow Super Giants pipped Kolkata Knight Riders by two runs in a last-ball IPL thriller to s… [+3064 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Tamil Actor Vijay Meets Telangana Chief Minister K Chandrasekhar Rao", "description": "Tamil film actor Vijay called on Telangana Chief Minister K Chandrasekhar Rao today.", "url": "https://www.ndtv.com/telangana-news/tamil-actor-vijay-meets-telangana-chief-minister-k-chandrasekhar-rao-2988791", "urlToImage": "https://c.ndtvimg.com/2022-05/9k20fmeo_vijay-kcr_625x300_19_May_22.jpg", "publishedAt": "2022-05-18T18:41:26Z", "content": "The Telangana Chief Minister presented the actor with a shawl.\r\nHyderabad: Tamil film actor Vijay called on Telangana Chief Minister K Chandrasekhar Rao today.\r\nVijay met Mr Rao at Pragati Bhavan at … [+317 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Minister Ajay Mishra's Nephew Dies After Tree Branch Falls On Him: Police", "description": "A nephew of Union minister Ajay Mishra died after a tree branch fell on him while he was riding a motorcycle on Wednesday, police said.", "url": "https://www.ndtv.com/india-news/union-minister-ajay-mishras-nephew-dies-after-tree-branch-falls-on-him-2988337", "urlToImage": "https://c.ndtvimg.com/2021-06/ontt01q_hospital-generic-pixabay-650_625x300_17_June_21.jpg", "publishedAt": "2022-05-18T18:33:18Z", "content": "Some passersby took him to hospital where doctors declared him dead, police said. (Representational)\r\nLakhimpur Kheri (UP): A nephew of Union minister Ajay Mishra died after a tree branch fell on him… [+794 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Train Services Between India And Bangladesh To Resume From May 29", "description": "Passenger train services between India and Bangladesh will resume from May 29, an official order said. Kolkata-Dhaka Maitree Express from Dhaka by Bangladesh Railway rake and Kolkata-Khulna Bandhan Express from Kolkata will resume on May 29.", "url": "https://www.ndtv.com/india-news/train-services-between-india-and-bangladesh-to-resume-from-may-29-2988777", "urlToImage": "https://c.ndtvimg.com/2022-05/cjure0g8_train-generic_625x300_14_May_22.jpg", "publishedAt": "2022-05-18T18:31:06Z", "content": "Services of NJP-Dhaka Mitali Express will start on June 1. (Representational)\r\nNew Delhi: Passenger train services between India and Bangladesh will resume from May 29, an official order said.\r\nThe t… [+738 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Partha Chatterjee Appears Before CBI In SSC Recruitment Scam", "description": "West Bengal minister Partha Chatterjee today appeared before the CBI sleuths for questioning in connection with their probe into the SSC recruitment scam. A single bench of Justice Abhijit Gangopadhyay directed the minister to appear before the CBI.", "url": "https://www.ndtv.com/india-news/partha-chatterjee-appears-before-cbi-in-ssc-recruitment-scam-2988762", "urlToImage": "https://c.ndtvimg.com/2022-05/u2tf32jc_partha-chatterjee_625x300_18_May_22.jpg", "publishedAt": "2022-05-18T18:22:11Z", "content": "Partha Chatterjee was the education minister when the illegal recruitments took place. (File)\r\nKolkata: West Bengal minister Partha Chatterjee on Wednesday evening appeared before the CBI sleuths for… [+1046 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "IPL 2022 Points Table Update, Latest Orange Cap, Purple Cap Lists", "description": "IPL 2022: Lucknow Super Giants became only the second team to confirm a place in the play-offs this season with a thrilling 2-run victory over Kolkata Knight Riders.", "url": "https://sports.ndtv.com/ipl-2022/ipl-2022-points-table-update-latest-orange-cap-purple-cap-lists-after-kkr-vs-lsg-match-66-2988761", "urlToImage": "https://c.ndtvimg.com/2022-05/tmb4isc4_kl-rahul-and-quinton-de-kock_625x300_18_May_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-18T18:22:07Z", "content": "Rinku Singh batted superbly towards the end of the innings to bring Kolkata Knight Riders (KKR) to the brink of victory only for the franchise to lose by two runs in the end, thanks to a brilliant co… [+1358 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Taylor Swift Receives Honorary Doctorate From New York University", "description": "Taylor Swift, an American singer-songwriter, today received an honorary doctorate from the New York University in fine arts. Ms Swift turned up at New York's Yankee Stadium in a cap, blue gown, and a black dress.", "url": "https://www.ndtv.com/world-news/taylor-swift-receives-honorary-doctorate-from-new-york-university-2988758", "urlToImage": "https://c.ndtvimg.com/2022-05/gekp4r3g_taylor-swift_625x300_18_May_22.jpg", "publishedAt": "2022-05-18T18:21:54Z", "content": "Taylor Swift treated her fans with a short video displaying her graduation ensemble before the event\r\nNew Delhi: Taylor Swift, an American singer-songwriter, today received an honorary doctorate from… [+1571 chars]"}]}