{"status": "ok", "totalResults": 550, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Says Unclear If Russia's 40-Mile Convoy Headed To Kyiv Exists Anymore", "description": "The Pentagon said on Thursday it was not clear that Russia's convoy of military vehicles to Kyiv, which once stretched some 40 miles, even exists anymore after failing to accomplish its mission.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-us-says-unclear-if-russias-40-mile-convoy-headed-to-kyiv-exists-anymore-2855756", "urlToImage": "https://c.ndtvimg.com/2022-03/tfqfiv_russia-military-convoy-reuters-650_625x300_07_March_22.jpg", "publishedAt": "2022-04-01T02:06:45Z", "content": "Russia-Ukraine War: The stalled convoy became a symbol of Russia's battlefield difficulties.\r\nWashington: The Pentagon said on Thursday it was not clear that Russia's convoy of military vehicles to K… [+429 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Newsdesk", "title": "Ukraine LIVE: Russia Preparing Strikes On Donbas, Ukraine's Zelensky Says", "description": "Ukrainian President Volodymyr Zelensky said situation in Donbas region remained extremely difficult reiterating that Russia was building up forces near the besieged city of Mariupol.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-live-updates-russian-pledges-to-ease-ukraine-attack-west-sceptical-2855893", "urlToImage": "https://c.ndtvimg.com/2022-03/3vgt0ni8_mariupol-afp_625x300_22_March_22.jpg", "publishedAt": "2022-04-01T02:00:38Z", "content": "Russia-Ukraine War: Mariupol has been encircled and shelled by Russian forces since February.\r\nNew Delhi: Ukrainian President Volodymyr Zelensky said situation in Donbas region remained extremely dif… [+1311 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "What US Said On India-Russia Ties Ahead Of Moscow-New Delhi Talks", "description": "As Russian Foreign Minister Sergey Lavrov is on a two-day official visit to India, the US State Department Spokesperson Ned Price on Thursday (local time) said that every country has its own relationship with Moscow.", "url": "https://www.ndtv.com/india-news/india-russia-relations-what-us-said-on-india-russia-ties-ahead-of-russian-foreign-ministers-visit-2855870", "urlToImage": "https://c.ndtvimg.com/2021-04/v1pc00c4_eam-s-jaishankar-and-russian-foreign-minister-sergey-lavrov-pti-photo_625x300_06_April_21.jpg", "publishedAt": "2022-04-01T01:32:27Z", "content": "The Russian Foreign Minister reached New Delhi after his two-day visit to China. (File)\r\nWashington: As Russian Foreign Minister Sergey Lavrov is on a two-day official visit to India, the US State De… [+2391 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Newsdesk", "title": "Sri Lanka LIVE Updates: Protests Near Lanka President's Home Turn Violent", "description": "Hundreds of people protesting near the home of Sri Lankan President Gotabaya Rajapaksa turned violent on Thursday, with at least one man critically wounded. The residents slammed the government's handling of the country's crippling economic crisis.", "url": "https://www.ndtv.com/world-news/sri-lanka-economic-crisis-live-updates-protests-near-sri-lanka-presidents-home-turn-violent-2855878", "urlToImage": "https://c.ndtvimg.com/2022-03/kaogt5eo_sri-lanka-protests_625x300_31_March_22.jpg", "publishedAt": "2022-04-01T01:19:19Z", "content": "Sri Lanka's capital Colombo was placed under indefinite curfew in the wake of the violence.\r\nColombo: Hundreds of people protesting near the home of Sri Lankan President Gotabaya Rajapaksa turned vio… [+1539 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Sergey Lavrov's India Visit Live: Russian Foreign Minister To Meet S Jaishankar", "description": "Russian Foreign Minister Sergey Lavrov arrived in India on Thursday on a two-day official visit, his first trip to the country since Moscow launched its invasion of Ukraine last month.", "url": "https://www.ndtv.com/india-news/sergey-lavrovs-india-visit-live-updates-russian-foreign-minister-to-meet-s-jaishankar-pm-modi-2855876", "urlToImage": "https://c.ndtvimg.com/2022-03/f2a0km0o_russia-foreign-minister-sergei-lavrovbloomberg-_625x300_31_March_22.jpg", "publishedAt": "2022-04-01T01:11:31Z", "content": "This is his first trip to the country since Moscow launched its invasion of Ukraine\r\nNew Delhi: Russian Foreign Minister Sergey Lavrov arrived in India on Thursday on a two-day official visit, his fi… [+1461 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Oscars Producer Says Police \"Ready To Arrest\" Will Smith", "description": "Police officers were ready to arrest Will Smith after he attacked comedian Chris Rock at the Oscars, the show's producer said Thursday.", "url": "https://www.ndtv.com/world-news/oscars-producer-says-police-ready-to-arrest-will-smith-after-chris-rock-slap-2855871", "urlToImage": "https://c.ndtvimg.com/2022-02/97krclh8_will-smith_625x300_28_February_22.jpg", "publishedAt": "2022-04-01T01:03:02Z", "content": "Police in Los Angeles said Sunday that Rock had declined to file a report.\r\nLos Angeles: Police officers were ready to arrest Will Smith after he attacked comedian Chris Rock at the Oscars, the show'… [+3158 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russian Foreign Minister Sergey Lavrov To Meet S Jaishankar Today", "description": "Russian Foreign Minister Sergey Lavrov, who is on a two-day official visit to India, is expected to meet and hold talks with External Affairs Minister S Jaishankar on Friday.", "url": "https://www.ndtv.com/india-news/russian-foreign-minister-sergey-lavrov-to-meet-s-jaishankar-today-2855865", "urlToImage": "https://c.ndtvimg.com/2020-09/a04als2_s-jaishankarsergey-lavrov_625x300_09_September_20.jpg", "publishedAt": "2022-04-01T00:45:35Z", "content": "The Russian Foreign Minister reached New Delhi after his two-day visit to China. (File)\r\nNew Delhi: Russian Foreign Minister Sergey Lavrov, who is on a two-day official visit to India, is expected to… [+1304 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE Updates: India Sees 1,225 New COVID-19 Cases In 24 Hours", "description": "India's coronavirus tally rose to 4,30,24,440 on Thursday after country reported at least 1,225 fresh COVID-19 cases. India country also recorded 28 Covid-related deaths in the last 24 hours, bringing the death count to 5,21,129.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-1-april-2022-2855859", "urlToImage": "https://c.ndtvimg.com/2021-04/q6bsvdss_covid-india-afp_625x300_24_April_21.jpg", "publishedAt": "2022-04-01T00:19:33Z", "content": "Over 183.73 crore vaccine doses have been administered so far in the country.\r\nIndia's coronavirus tally rose to 4,30,24,440 on Thursday after country reported at least 1,225 fresh COVID-19 cases. In… [+508 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "EU Leaders To Pressure China At Summit To Not Help Russia In Ukraine War", "description": "EU and Chinese leaders meet for a first summit in two years on Friday with Brussels keen for assurances from Beijing that it will neither supply Russia with arms nor help Moscow circumvent Western sanctions imposed over the invasion of Ukraine.", "url": "https://www.ndtv.com/world-news/eu-leaders-to-pressure-china-at-summit-to-not-support-russia-in-ukraine-war-2855853", "urlToImage": "https://c.ndtvimg.com/2022-03/ghc4vk08_ukraine-war-afp_625x300_20_March_22.jpg", "publishedAt": "2022-03-31T23:59:25Z", "content": "An EU official said China's stance towards Russia would be the \"million-dollar question\" on Friday.\r\nBrussels: EU and Chinese leaders meet for a first summit in two years on Friday with Brussels keen… [+2522 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Gujarat Man Arrested For Killing Wife, 2 Children: Police", "description": "A man who allegedly killed his wife, two teenage children and the wife's grandmother has been arrested days after the chilling crime, police said on Thursday.", "url": "https://www.ndtv.com/india-news/gujarat-man-arrested-for-killing-wife-two-children-police-2855848", "urlToImage": "https://i.ndtvimg.com/i/2016-05/arrest-generic_650x400_71463458726.jpg", "publishedAt": "2022-03-31T23:36:35Z", "content": "It was suspected that they had been stabbed to death a few days earlier. (Representational)\r\nAhmedabad: A man who allegedly killed his wife, two teenage children and the wife's grandmother has been a… [+1429 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Northwest, Central India To Witness Above Normal Temperature In April", "description": "Northwest and central India and parts of the northeast are expected to experience above-normal maximum temperatures in April, the weather office said on Thursday.", "url": "https://www.ndtv.com/india-news/northwest-central-india-to-witness-above-normal-temperature-in-april-india-meteorological-department-2855839", "urlToImage": "https://c.ndtvimg.com/2022-03/rugj3bec_delhi-summer-ani_625x300_28_March_22.jpg", "publishedAt": "2022-03-31T23:09:29Z", "content": "It said some parts of northeast India expected to receive below-normal rainfall in April.\r\nNew Delhi: Northwest and central India and parts of the northeast are expected to experience above-normal ma… [+1317 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Boy, 8, Killed By Leopard In Maharashtra: Forest Official", "description": "An eight-year-old boy was mauled to death by a leopard in the Durgapur area of Maharashtra's Chandrapur district, said a senior forest department officer on Thursday.", "url": "https://www.ndtv.com/india-news/boy-8-killed-by-leopard-in-maharashtras-chandrapur-district-forest-official-2855835", "urlToImage": "https://c.ndtvimg.com/2022-01/fcs9hrfs_leopard-generic_625x300_30_January_22.jpg", "publishedAt": "2022-03-31T22:50:36Z", "content": "The body of Bawane was later found 500 metres away from the house, said the officer. (Representational)\r\nChandrapur, Maharashtra: An eight-year-old boy was mauled to death by a leopard in the Durgapu… [+1116 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Bombay High Court Orders Woman To Pay Alimony To Her Ex-Husband", "description": "In an order passed on February 26 this year, Justice Bharati Dangre of the Aurangabad bench of the high court upheld the orders passed by the local court in 2017 and 2019.", "url": "https://www.ndtv.com/india-news/bombay-high-court-orders-woman-to-pay-alimony-to-her-ex-husband-2855832", "urlToImage": "https://i.ndtvimg.com/i/2015-10/bombay-high-court_650x400_71444753742.jpg", "publishedAt": "2022-03-31T22:33:19Z", "content": "The man had approached the local court seeking permanent alimony two years later.\r\nMumbai: The Bombay High Court has upheld orders passed by a local court in Nanded in Maharashtra directing a woman t… [+1624 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Situation In Southern Ukraine, Donbass Extremely Difficult: Zelensky", "description": "Ukrainian President Volodymyr Zelenskiy on Thursday said the situation in the south and the Donbas region remained extremely difficult and reiterated that Russia was building up forces near the besieged city of Mariupol.", "url": "https://www.ndtv.com/world-news/situation-in-southern-ukraine-donbas-extremely-difficult-volodymyr-zelensky-2855831", "urlToImage": "https://c.ndtvimg.com/2022-03/2d6ul6ck_ukraine-zelensky-afp_625x300_12_March_22.jpg", "publishedAt": "2022-03-31T22:21:28Z", "content": "\"There will be battles ahead,\" Zelensky said in video address.\r\nKyiv:  Ukrainian President Volodymyr Zelenskiy on Thursday said the situation in the south and the Donbas region remained extremely dif… [+350 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Says It Will Open Humanitarian Corridor From Mariupol Today", "description": "Russia said a humanitarian corridor would be opened Friday morning to allow civilians out of the besieged port city of Mariupol in southeastern Ukraine.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-russia-says-it-will-open-humanitarian-corridor-from-mariupol-today-2855829", "urlToImage": "https://c.ndtvimg.com/2022-03/33r27p2o_ukraine-war-mariupol-theatre-reuters650_625x300_17_March_22.jpg", "publishedAt": "2022-03-31T22:05:36Z", "content": "Ukraine said it was sending dozens of buses to evacuate civilians from Mariupol.\r\nMoscow: Russia said a humanitarian corridor would be opened Friday morning to allow civilians out of the besieged por… [+1369 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Putin's Gas Threat As Ukraine, West Dismiss De-Escalation Claim", "description": "Russia threatened Thursday to turn off its gas taps to Europe, opening up a new front in its war in Ukraine amid growing scepticism over Moscow's claim it is scaling back its onslaught.", "url": "https://www.ndtv.com/world-news/russian-president-vladimir-putins-gas-threat-as-ukraine-west-dismiss-de-escalation-claim-2855828", "urlToImage": "https://c.ndtvimg.com/2022-03/inkdihco_ukraine-war-afp-650_625x300_24_March_22.jpg", "publishedAt": "2022-03-31T21:52:02Z", "content": "Meanwhile, Ukrainians did confirm that Russia has pulled back from Chernobyl.\r\nMoscow: Russia threatened Thursday to turn off its gas taps to Europe, opening up a new front in its war in Ukraine amid… [+5851 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine Says Russian Forces Have Left Chernobyl Nuclear Power Plant", "description": "Russian troops on Tuesday left Ukraine's Chernobyl nuclear power plant after weeks of occupation, officials in Kyiv said Thursday.", "url": "https://www.ndtv.com/world-news/ukraine-says-russian-forces-have-left-chernobyl-nuclear-power-plant-2855824", "urlToImage": "https://c.ndtvimg.com/2022-03/e5aalhh8_chernobyl-nuclear-plant-afp-650_625x300_09_March_22.jpg", "publishedAt": "2022-03-31T21:24:14Z", "content": "Russian forces had occupied Chernobyl power plant since the start of the Russian invasion on Feb 24.\r\nKyiv: Russian troops on Tuesday left Ukraine's Chernobyl nuclear power plant after weeks of occup… [+1319 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Canada's Justin Trudeau Says No To Having Putin At G20 Meeting", "description": "Canadian Prime Minister Justin Trudeau on Thursday joined allies in saying he does not wish to see Russian President Vladimir Putin at this year's G20 meeting, citing Moscow's invasion of Ukraine.", "url": "https://www.ndtv.com/world-news/canada-prime-minister-justin-trudeau-says-no-to-having-russian-president-vladimir-putin-at-g20-meeting-2855819", "urlToImage": "https://c.ndtvimg.com/2021-01/5hc2nags_justin-trudeau-bernie-sanders-twitter-650_625x300_24_January_21.jpg", "publishedAt": "2022-03-31T21:08:02Z", "content": "Canadian PM said it would be a big issue if Putin joins this year's G20 summit in Indonesia.\r\nOttawa: Canadian Prime Minister Justin Trudeau on Thursday joined allies in saying he does not wish to se… [+1458 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sri Lanka: Protest At President's Home Turns Violent, 1 Injured", "description": "A protest by hundreds of people trying to storm the home of Sri Lankan President Gotabaya Rajapaksa turned violent, with at least one man critically wounded, as residents slammed the government's handling of the country's crippling economic crisis.", "url": "https://www.ndtv.com/world-news/sri-lanka-protest-at-president-gotabaya-rajapaksas-home-turns-violent-1-injured-2855813", "urlToImage": "https://c.ndtvimg.com/2022-03/kaogt5eo_sri-lanka-protests_625x300_31_March_22.jpg", "publishedAt": "2022-03-31T20:47:56Z", "content": "Sri Lanka: The capital was placed under indefinite curfew in the wake of the violence.\r\nColombo: A protest by hundreds of people trying to storm the home of Sri Lankan President Gotabaya Rajapaksa tu… [+4081 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Imran Khan Hits Out At US As No-Confidence Debate Postponed", "description": "Prime Minister Imran Khan on Thursday accused the United States of meddling in Pakistan's politics  -- a claim quickly denied by Washington -- as a debate on a no-confidence motion against him in parliament was postponed.", "url": "https://www.ndtv.com/world-news/pakistan-prime-minister-imran-khan-hits-out-at-us-as-no-confidence-debate-postponed-2855787", "urlToImage": "https://c.ndtvimg.com/2022-03/a0d2su8g_pm-imran-khan-islamabad-rally_625x300_27_March_22.jpg", "publishedAt": "2022-03-31T20:21:29Z", "content": "\"I fight till the very last ball. I never quit whatever the result may be,\" Imran Khan said.\r\nIslamabad: Prime Minister Imran Khan on Thursday accused the United States of meddling in Pakistan's poli… [+4653 chars]"}]}