{"status": "ok", "totalResults": 341, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Joao Cancelo, Goncalo Guedes Send Portugal To Victory Over Czech Republic", "description": "Nations League: Joao Cancelo and Goncalo Guedes were on target in the 33rd and 38th minutes in Lisbon as Portugal continued their strong start in the competition with a comfortable 2-0 win", "url": "https://sports.ndtv.com/football/nations-league-joao-cancelo-goncalo-guedes-send-portugal-to-victory-over-czech-republic-3054429", "urlToImage": "https://c.ndtvimg.com/2022-06/gg6vdv38_joao-cancelo-afp_625x300_10_June_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-10T02:39:49Z", "content": "Portugal scored twice in five minutes to beat the Czech Republic on Thursday and open up a two-point lead at the top of Group A2 in the Nations League. Joao Cancelo and Goncalo Guedes were on target … [+2153 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Kane Williamson Ruled Out Of 2nd Test After Testing Positive For Covid", "description": "Tom Latham will take over as captain and Hamish Rutherford has been called into the squad as Kane Williamson's replacement", "url": "https://sports.ndtv.com/cricket/new-zealand-skipper-kane-williamson-ruled-out-of-second-test-against-england-after-testing-positive-for-covid-3054417", "urlToImage": "https://c.ndtvimg.com/2022-06/1pantjeg_kane-williamson-afp_625x300_10_June_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-10T02:22:56Z", "content": "New Zealand captain Kane Williamson was ruled out of the second Test against England in Nottingham on Friday, after testing positive for Covid-19 on the eve of the match. Williamson undertook a Rapid… [+935 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US President Joe Biden Faces Criticism At Americas Summit", "description": "US President Joe Biden faced open criticism Thursday at an Americas summit, along with complaints about foreign pressure by Brazil's far-right leader, as he sought progress on issues from migration to climate change.", "url": "https://www.ndtv.com/world-news/us-president-joe-biden-faces-criticism-at-americas-summit-3054415", "urlToImage": "https://c.ndtvimg.com/2022-06/hut5m454_biden-afp_625x300_10_June_22.jpg", "publishedAt": "2022-06-10T02:20:58Z", "content": "Biden is welcoming leaders from across the hemisphere in a bid to show that democracy can work.\r\nLos Angeles: US President Joe Biden faced open criticism Thursday at an Americas summit, along with co… [+4798 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Over 18 Lakh Pilgrims At Char Dham Shrines In Over A Month", "description": "The Char Dham yatra in Garhwal Himalayas has received a record number of more than 18 lakh pilgrims within just over a month of its commencement this year, an official said.", "url": "https://www.ndtv.com/india-news/over-18-lakh-pilgrims-at-char-dham-shrines-in-over-a-month-3054398", "urlToImage": "https://c.ndtvimg.com/2022-05/94k00i7_char-dham-yatra_625x300_02_May_22.jpg", "publishedAt": "2022-06-10T01:57:29Z", "content": "Char Dham Yatra: The total number of pilgrims to visit the Himalayan temples so far is 18,01,209.\r\nDehradun:  The Char Dham yatra in Garhwal Himalayas has received a record number of more than 18 lak… [+507 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Asaduddin Owaisi's Party To Contest Civic Body Polls In Madhya Pradesh", "description": "All India Majlis-E-Ittehadul Muslimeen (AIMIM) party will contest the civic polls in seven municipalities of Madhya Pradesh.", "url": "https://www.ndtv.com/india-news/asaduddin-owaisis-party-aimim-to-contest-civic-body-polls-in-madhya-pradesh-3054395", "urlToImage": "https://c.ndtvimg.com/2022-01/p97htp7k_asaduddin-owaisi_625x300_22_January_22.jpg", "publishedAt": "2022-06-10T01:46:52Z", "content": "The AIMIM chief Asaduddin Owaisi held a meeting with the state party unit before the announcement.\r\nHyderabad: All India Majlis-E-Ittehadul Muslimeen (AIMIM) party will contest the civic polls in sev… [+945 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine President Volodymyr Zelensky To Attend NATO Summit In Madrid", "description": "North Atlantic Treaty Organization (NATO) Deputy Secretary-General Mircea Joane has confirmed that Ukrainian President Volodymyr Zelensky has been invited to the alliance's summit in Madrid.", "url": "https://www.ndtv.com/world-news/ukraine-president-volodymyr-zelensky-to-attend-nato-summit-in-madrid-3054394", "urlToImage": "https://c.ndtvimg.com/2022-06/kjvk90ns_zelensky-afp_625x300_06_June_22.jpg", "publishedAt": "2022-06-10T01:43:54Z", "content": "The announcement of Zelensky joining the summit was made during a discussion organized by Politico.\r\nKyiv: North Atlantic Treaty Organization (NATO) Deputy Secretary-General Mircea Joane has confirme… [+2163 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Voting In Rajya Sabha Polls Today, Tight Contest In 4 States: 10 Points", "description": "Elections will be held to fill 16 vacant seats in Rajya Sabha, the upper house of parliament, today. 41 candidates have been elected unopposed. The election will be crucial in view of the Presidential elections due in July.", "url": "https://www.ndtv.com/india-news/voting-in-crucial-rajya-sabha-polls-today-tight-contests-in-2-states-top-10-3054381", "urlToImage": "https://c.ndtvimg.com/2019-07/ufqclhug_parliament-generic-reuters_625x300_31_July_19.jpg", "publishedAt": "2022-06-10T01:30:33Z", "content": "<li>Election is due on 16 seats in Maharashtra, Karnataka, Rajasthan and Haryana.\r\n</li><li>The 57 vacant seats were spread across 15 states. Of these, the BJP held 23 seats and eight were held by Co… [+1517 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Capitol Riot Hearing: Trump Allies, Ivanka Rejected Fraud Claims", "description": "Congressional hearings into the deadly US Capitol attack by Donald Trump's supporters opened on Thursday with the panel presenting video showing that even the former president's daughter, Ivanka, did not believe his false claims of election fraud.", "url": "https://www.ndtv.com/world-news/us-capitol-riot-hearing-trump-allies-ivanka-rejected-fraud-claims-3054375", "urlToImage": "https://c.ndtvimg.com/2022-06/s9un92p8_us-capitol-riot-reuters_625x300_10_June_22.jpg", "publishedAt": "2022-06-10T01:24:32Z", "content": "Four people died the day of the attack, one fatally shot by police and the others of natural causes.\r\nWashington: Congressional hearings into the deadly US Capitol attack by Donald Trump's supporters… [+5110 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE Updates: India Records 7,240 New COVID-19 Cases In 24 Hours", "description": "India reported a total of 7,240 new coronavirus infections in the last 24 hours, taking the total number of COVID-19 cases in the country to 4,31,97,522, the Health Ministry said.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-10-june-3054373", "urlToImage": "https://c.ndtvimg.com/2021-06/6i1ieuso_india-covid-afp_625x300_03_June_21.jpg", "publishedAt": "2022-06-10T01:22:10Z", "content": "India Covid Live: At least 8 people died due to coronavirus on Thursday.\r\nNew Delhi: India reported a total of 7,240 new coronavirus infections in the last 24 hours, taking the total number of COVID-… [+396 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Threat Letter To Salman Khan: Mumbai Police Confirm Lawrence Bishnoi Gang's Involvement", "description": "In a major breakthrough in the Salman Khan threat letter case, Mumbai police have identified the persons involved in delivering the letter to Salim Khan, the actor's father.", "url": "https://www.ndtv.com/india-news/threat-letter-to-salman-khan-mumbai-police-confirm-lawrence-bishnoi-gangs-involvement-3054365", "urlToImage": "https://c.ndtvimg.com/2022-06/t5jdra_salman-khan_625x300_05_June_22.jpg", "publishedAt": "2022-06-10T00:58:19Z", "content": "Salman Khan Threat Letter: Mumbai police confirmed that gangster Lawrence Bishnoi had issued letter.\r\nMumbai: In a major breakthrough in the Salman Khan threat letter case, Mumbai police have identif… [+1957 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Rajya Sabha Election LIVE: Polls To 57 Upper House Seats Today", "description": "Rajysa Sabha Elections 2022: The Rajya Sabha election will be held today to fill the 57 seats across the 15 states. The polls will be held for six seats from Maharashtra, two from Haryana and five each from Rajasthan and Karnataka.", "url": "https://www.ndtv.com/india-news/2022-rajya-sabha-election-live-news-updates-elections-to-57-upper-house-seats-today-3054358", "urlToImage": "https://c.ndtvimg.com/2022-02/oa80d25g_rajya-sabha-pti_625x300_10_February_22.jpg", "publishedAt": "2022-06-10T00:28:21Z", "content": "Rajya Sabha Election Updates: 41 candidates have already been elected unopposed.\r\nNew Delhi: Rajysa Sabha Elections 2022: The Rajya Sabha election will be held today to fill the 57 seats across the 1… [+963 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Capitol Riot Panel Warns Conspiracy Behind Violence \"Not Over\"", "description": "The conspiracy that drove a mob to attack the US Capitol in January 2021 still poses a threat to American democracy, the head of the congressional committee tasked with investigating the deadly riot will warn at the panel's first public hearing.", "url": "https://www.ndtv.com/world-news/us-capitol-riot-panel-warns-conspiracy-behind-violence-not-over-3054348", "urlToImage": "https://c.ndtvimg.com/2021-01/ka676kk8_us-capitol-attack_625x300_07_January_21.jpg", "publishedAt": "2022-06-09T23:35:23Z", "content": "Thousands of Trump supporters stormed the US Capitol on 6 January in a bid to overturn election result.\r\nWashington: The conspiracy that drove a mob to attack the US Capitol in January 2021 still pos… [+5611 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "3 People Killed In Shooting At Maryland Manufacturing Plant In US: Police", "description": "Three people have been killed in a mass shooting incident at a manufacturing plant in Maryland town of Smithsburg on Thursday,local US media said.", "url": "https://www.ndtv.com/world-news/3-people-killed-in-shooting-at-maryland-manufacturing-plant-in-us-police-3054340", "urlToImage": "https://c.ndtvimg.com/2018-09/hms9qqjc_us-police-generic_625x300_14_September_18.jpg", "publishedAt": "2022-06-09T23:13:35Z", "content": "Police said the shooting took place at the Columbia Machine in Smithsburg, Maryland. (Representational)\r\nMaryland: Three people have been killed in a mass shooting incident at a manufacturing plant i… [+2092 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Pak Police Open Investigation Into Politician Aamir Liaquat's Death", "description": "Pakistani police are investigating the circumstances surrounding the sudden death of a prominent televangelist-turned-politician on Thursday.", "url": "https://www.ndtv.com/world-news/pak-police-open-investigation-into-politician-aamir-liaquats-death-3054336", "urlToImage": "https://c.ndtvimg.com/2022-06/2ccpghvc_amir-liaquat_625x300_09_June_22.jpg", "publishedAt": "2022-06-09T23:01:10Z", "content": "Aamir Liaquat Hussain was found motionless at his house in Karachi by one his employees on Thursday.\r\nKarachi:  Pakistani police are investigating the circumstances surrounding the sudden death of a … [+860 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Fire Breaks Out At Crockery Factory In Delhi, No Casualties", "description": "A fire broke out in a carpet and crockery factory's godown in Delhi's Hamidpur area on Thursday evening.", "url": "https://www.ndtv.com/india-news/fire-breaks-out-at-crockery-factory-in-delhis-hamidpur-3054330", "urlToImage": "https://i.ndtvimg.com/i/2017-07/fire-generic-istock_650x400_51500191995.jpg", "publishedAt": "2022-06-09T22:36:09Z", "content": "Delhi Fire: As many as 23 fire tenders were rushed to the spot to douse the fire. (Representational)\r\nNew Delhi: A fire broke out in a carpet and crockery factory's godown in Delhi's Hamidpur area on… [+2258 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "BJP Would Have Won West Bengal Polls, But...: JP Nadda", "description": "A year after the party's defeat in the high-octane West Bengal Assembly polls, BJP president J P Nadda on Thursday claimed that the party would have come to power had the devastating second wave of Covid not affected the campaigning.", "url": "https://www.ndtv.com/india-news/bjp-would-have-won-west-bengal-polls-but-covid-played-spoilsport-jp-nadda-3054325", "urlToImage": "https://c.ndtvimg.com/2022-06/2sn16mvg_jp-nadda_625x300_09_June_22.jpg", "publishedAt": "2022-06-09T22:17:35Z", "content": "JP Nadda said that we will have to continue our fight democratically and defeat the TMC.\r\nKolkata: A year after the party's defeat in the high-octane West Bengal Assembly polls, BJP president J P Nad… [+4047 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "China Says It Does Not Want To See Another North Korean Nuclear Test", "description": "China's U.N. envoy said on Thursday that Beijing does not want to see North Korea carry out a new nuclear test, which is partly why China vetoed a U.S.-led bid to impose new U.N. sanctions on Pyongyang over renewed ballistic missiles launches.", "url": "https://www.ndtv.com/world-news/china-says-it-does-not-want-to-see-another-north-korean-nuclear-test-3054324", "urlToImage": "https://c.ndtvimg.com/2022-05/efkeqoc4_north-korea-missilereuters_625x300_18_May_22.jpg", "publishedAt": "2022-06-09T22:05:58Z", "content": "North Korea launched dozens of missile this year, including intercontinental ballistic missiles.\r\nUnited Nations: China's U.N. envoy said on Thursday that Beijing does not want to see North Korea car… [+2911 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rajya Sabha Polls: Internet Suspended In Jaipur's Amer Area Amid Poaching Fears", "description": "Rajasthan Congress MLAs were moved from Udaipur to Jaipur ahead of the voting for the Rajya Sabha elections that are slated to be held on Friday and party leaders are hoping to secure three seats in the Upper House of the parliament.", "url": "https://www.ndtv.com/india-news/internet-suspended-in-jaipurs-amer-area-ahead-of-rajya-sabha-polls-3054315", "urlToImage": "https://c.ndtvimg.com/2020-01/ifm6g8vs_mobile-generic-istock-650_625x300_31_January_20.jpg", "publishedAt": "2022-06-09T21:05:28Z", "content": "CM Ashok Gehlot reiterated the confidence and negated any chance of cross-voting. (Representational)\r\nJaipur: Fearing poaching of legislators ahead of the Rajya Sabha elections, the Rajasthan governm… [+2047 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Kerala Woman Suffers Injuries After Being Hacked With Sharp Weapon: Police", "description": "A woman in her twenties suffered serious injuries after she was hacked with a sharp weapon by a man in Nadapuram area of Kozhikode district of Kerala on Thursday and her health condition is still critical, police said.", "url": "https://www.ndtv.com/india-news/kerala-woman-suffers-injuries-after-being-hacked-with-sharp-weapon-police-3054310", "urlToImage": "https://i.ndtvimg.com/i/2017-03/police-generic_650x400_51490324353.jpg", "publishedAt": "2022-06-09T20:45:57Z", "content": "The victim's health condition is critical and she is on a ventilator, police said. (Representational)\r\nKozhikode, Kerala: A woman in her twenties suffered serious injuries after she was hacked with a… [+1264 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine War Implications Will Lead To Hunger Crisis, Warns S Jaishankar", "description": "The Russia-Ukraine war has thrown up a crisis of fuel, food and fertiliser that will lead to hunger situations and have a very significant inflationary impact, External Affairs Minister S Jaishankar said on Thursday.", "url": "https://www.ndtv.com/india-news/ukraine-war-implications-will-lead-to-hunger-crisis-warns-s-jaishankar-3054307", "urlToImage": "https://c.ndtvimg.com/2022-04/58h2h1go_s-jaishankar-pti_625x300_13_April_22.jpg", "publishedAt": "2022-06-09T20:34:45Z", "content": "The prices of these fuel and food have gone up because of Ukraine war, S Jaishankar said.\r\nBengaluru: The Russia-Ukraine war has thrown up a crisis of fuel, food and fertiliser that will lead to hung… [+3693 chars]"}]}