{"status": "ok", "totalResults": 256, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Shakti Kapoor's Son, Siddhanth, Released On Bail In Drugs Case", "description": "Bollywood actor Shraddha Kapoor's brother Siddhanth Kapoor has now been released on bail after he was arrested on Monday when his medical reports confirmed his consumption of drugs.", "url": "https://www.ndtv.com/india-news/shakti-kapoors-son-siddhanth-kapoor-released-on-bail-in-drugs-case-3064580", "urlToImage": "https://c.ndtvimg.com/2022-06/7ad2ti2_siddhanth-kapoor_625x300_13_June_22.jpg", "publishedAt": "2022-06-14T00:33:16Z", "content": "Bengaluru police confirmed that Siddhanth Kapoor's medical shows he had consumed drugs. (File)\r\nBengaluru: Bollywood actor Shraddha Kapoor's brother Siddhanth Kapoor has now been released on bail aft… [+1748 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "2 Killed, 4 Injured As Temple Chariot Capsizes In Tamil Nadu: Police", "description": "Two men were killed and four others sustained injuries when a huge chariot of a popular temple in Papparapatti here capsized on Monday, police said.", "url": "https://www.ndtv.com/india-news/2-killed-4-injured-as-temple-chariot-capsizes-in-tamil-nadus-dharmapuri-police-3064576", "urlToImage": "https://i.ndtvimg.com/i/2017-03/police-generic_650x400_71490246814.jpg", "publishedAt": "2022-06-14T00:16:37Z", "content": "Tamil Nadu CM announced a cash relief of Rs 5 lakh each to the families of the deceased.\r\nDharmapuri, West Bengal: Two men were killed and four others sustained injuries when a huge chariot of a popu… [+1380 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "National Herald Case: Questioning \"Someone\" Till 12 Midnight Wrong, Says Ashok Gehlot", "description": "Rajasthan Chief Minister Ashok Gehlot on Tuesday condemned the questioning of Congress leader Rahul Gandhi which went on till midnight by the Enforcement Directorate in the National Herald case.", "url": "https://www.ndtv.com/india-news/national-herald-case-questioning-someone-till-12-midnight-wrong-says-ashok-gehlot-3064560", "urlToImage": "https://c.ndtvimg.com/2020-08/d7gsgih8_ashok-gehlot-august-11-ndtv_625x300_11_August_20.jpg", "publishedAt": "2022-06-13T23:40:03Z", "content": "Ashok Gehlot also asked the Prime Minister Modi to address other issues in the country. (File)\r\nNew Delhi: Rajasthan Chief Minister Ashok Gehlot on Tuesday condemned the questioning of Congress leade… [+3560 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Congress MPs Detained For Hours, Released After Rahul Gandhi Left Enforcement Directorate Office", "description": "Top Congress leaders detained on Monday during the party's protest in solidarity with Rahul Gandhi, who was grilled by the ED in a money-laundering probe linked to the National Herald newspaper, were released from various police stations.", "url": "https://www.ndtv.com/india-news/congress-mps-detained-for-hours-released-after-rahul-gandhi-left-enforcement-directorate-office-3064544", "urlToImage": "https://c.ndtvimg.com/2022-06/7p06qq8o_priyanka-gandhi-vadra-with-congress-leaders-at-delhi-police-station_625x300_13_June_22.jpg", "publishedAt": "2022-06-13T23:01:48Z", "content": "Congress alleged that some of its leaders were manhandled by the police during protest.\r\nNew Delhi: Top Congress leaders detained on Monday during the party's protest in solidarity with Rahul Gandhi,… [+2743 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Says Its Key Goal To Protect People In Ukraine's Separatist Regions", "description": "Russia's main goal of its military operation in Ukraine is to protect the Donetsk and Luhansk people's republics, the Kremlin said on Monday, after the leader of one of the separatist regions asked for additional forces from Moscow.", "url": "https://www.ndtv.com/world-news/russia-says-its-key-goal-to-protect-people-in-ukraines-separatist-regions-3064536", "urlToImage": "https://c.ndtvimg.com/2022-04/ofrrlk7k_ukraines-luhansk_625x300_09_April_22.jpg", "publishedAt": "2022-06-13T22:19:17Z", "content": "Protection of the separatist is the main goal of the special military operation, Russia said.\r\nMoscow: Russia's main goal of its military operation in Ukraine is to protect the Donetsk and Luhansk pe… [+1622 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "2 Lashkar Terrorists Killed In Srinagar Encounter In Jammu And Kashmir", "description": "Two terrorists were killed in an encounter that broke out in the Bemina area of Srinagar, informed the police on Tuesday.", "url": "https://www.ndtv.com/india-news/2-lashkar-terrorists-killed-in-srinagar-encounter-in-jammu-and-kashmir-3064516", "urlToImage": "https://c.ndtvimg.com/2022-01/52iv7a4s_jammu-and-kashmir-encounter-pti_625x300_22_January_22.jpg", "publishedAt": "2022-06-13T21:11:19Z", "content": "The police called the Srinagar encounter 'a big success.' (Representational)\r\nSrinagar: Two terrorists were killed in an encounter that broke out in the Bemina area of Srinagar, informed the police o… [+1566 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Property Rights Can't Be Denied To Son Of Couple Who Lived Together: Supreme Court", "description": "The Supreme Court Monday said the \"law presumes in favour of marriage and against concubinage\" if a man and woman cohabited for a long period and their son cannot be denied the shares in the ancestral properties.", "url": "https://www.ndtv.com/india-news/property-rights-cant-be-denied-to-son-of-couple-who-lived-together-supreme-court-3064505", "urlToImage": "https://c.ndtvimg.com/2022-02/a1ooga8_supreme-court-of-india_650x400_14_February_22.jpg", "publishedAt": "2022-06-13T20:35:15Z", "content": "Court said law presumes marriage if couple lived together and property rights cant be denied to son.\r\nNew Delhi: The Supreme Court Monday said the \"law presumes in favour of marriage and against conc… [+4090 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UN Urges WTO Not To Impose Food Export Restrictions Amid Crisis", "description": "The United Nations on Monday begged world trade ministers meeting at the WTO not to impose export restrictions on food for humanitarian purposes, amid a food security crisis.", "url": "https://www.ndtv.com/world-news/un-urges-wto-not-to-impose-food-export-restrictions-amid-crisis-3064470", "urlToImage": "https://c.ndtvimg.com/2021-03/kfme0828_un-high-commissioner-for-human-rights-michelle-bachelet_625x300_23_March_21.jpg", "publishedAt": "2022-06-13T20:13:29Z", "content": "Ukraine war increasing the risk of hunger for tens of millions of people, UN human rights chief said.\r\nGeneva: The United Nations on Monday begged world trade ministers meeting at the WTO not to impo… [+2649 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Trump Knew Election Fraud Claims Were False, His Aides Say", "description": "Donald Trump ignored repeated warnings from top aides against claiming the 2020 election was stolen, according to testimony unveiled Monday by the congressional panel probing the 2021 assault on the US Capitol.", "url": "https://www.ndtv.com/world-news/former-us-president-donald-trump-knew-election-fraud-claims-were-false-his-aides-say-3064447", "urlToImage": "https://c.ndtvimg.com/2022-02/kr9u49fk_donald-trump-reuters_625x300_20_February_22.jpg", "publishedAt": "2022-06-13T19:45:49Z", "content": "Trump's campaign manager advised him not to declare victory on election night because he hadn't won.\r\nWashington: Donald Trump ignored repeated warnings from top aides against claiming the 2020 elect… [+4312 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Online \"Hate And Vitriol\" During Depp Trial Not \"Fair\": Amber Heard", "description": "Amber Heard said the \"hate and vitriol\" she suffered on social media during her libel trial against Johnny Depp was not \"fair,\" but insisted in an interview released Monday she did not blame the jury for largely siding with her ex-husband.", "url": "https://www.ndtv.com/world-news/online-hate-and-vitriol-during-johnny-depp-trial-not-fair-amber-heard-3064425", "urlToImage": "https://c.ndtvimg.com/2022-06/29bg858o_amber-heard_625x300_02_June_22.jpg", "publishedAt": "2022-06-13T19:22:52Z", "content": "Amber Heard breaks silence on \"hate\" shes receiving for trial against Johnny Depp in defamation case.\r\nWashington: Amber Heard said the \"hate and vitriol\" she suffered on social media during her libe… [+2240 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US, Allies Would Respond \"Quickly\" To North Korea If...: Blinken Warns", "description": "Secretary of State Antony Blinken promised Monday that the United States would respond swiftly with its allies and was ready to adjust its military posture if North Korea goes ahead with a nuclear test.", "url": "https://www.ndtv.com/world-news/us-allies-would-respond-quickly-to-north-korea-nuclear-test-antony-blinken-warns-3064388", "urlToImage": "https://c.ndtvimg.com/2022-06/r8i3iksg_blinken-afp_625x300_01_June_22.jpg", "publishedAt": "2022-06-13T18:51:13Z", "content": "Antony Blinken said that US will act swiftly with its allies if North Korea tests nukes. (File)\r\nWashington: Secretary of State Antony Blinken promised Monday that the United States would respondAand… [+523 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Not In the Race To Become India's Next President, Says Nitish Kumar", "description": "Presidential Elections 2022: Bihar Chief Minister Nitish Kumar on Monday categorically said he is not in the race in the July presidential election. \"I repeat I am not in the race to become the country's next President,\" Nitish Kumar said.", "url": "https://www.ndtv.com/india-news/presidential-elections-2022-not-in-the-race-to-become-indias-next-president-says-bihar-chief-minister-nitish-kumar-3064381", "urlToImage": "https://c.ndtvimg.com/2022-04/gg85flog_nitish-kumar_625x300_21_April_22.png", "publishedAt": "2022-06-13T18:39:27Z", "content": "The election for India's President will be held on July 18, counting on July 21. (File)\r\nPatna: Bihar Chief Minister Nitish Kumar on Monday categorically said he is not in the race in the July presid… [+1873 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Jharkhand Governor Summons Top Officials Over Ranchi Violence", "description": "Ranchi Violence: Jharkhand Governor Ramesh Bais on Monday summoned DGP Neeraj Sinha and other senior officials regarding why preventive measures or action to disperse the crowd were not taken during the recent violent protests in Ranchi.", "url": "https://www.ndtv.com/india-news/jharkhand-governor-ramesh-bais-summons-top-officials-over-ranchi-violence-3064365", "urlToImage": "https://c.ndtvimg.com/2022-06/ephogogg_ranchi-violence_625x300_11_June_22.jpg", "publishedAt": "2022-06-13T18:30:07Z", "content": "The governor asked why police officials were not wearing protective gear in Ranchi violence\r\nRanchi: Jharkhand Governor Ramesh Bais on Monday summoned DGP Neeraj Sinha and other senior officials at R… [+3261 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "New Zealand Collapse Gives England Hope In Tense Second Test", "description": "The Kiwis lost five wickets for 110 in a tense evening session at Trent Bridge and head into the final day with a lead of 238.", "url": "https://sports.ndtv.com/cricket/new-zealand-collapse-gives-england-hope-in-tense-second-test-3064347", "urlToImage": "https://c.ndtvimg.com/2022-06/09mophtg_stuart-broad_625x300_13_June_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-13T18:21:51Z", "content": "New Zealand collapsed to 224-7 as England gave themselves a chance to chase a dramatic series victory by close of play on the fourth day of the second Test. The Kiwis lost five wickets for 110 in a t… [+2548 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Bulldozers Will Continue To Be Used Against Troublemakers\": UP Minister", "description": "Uttar Pradesh Deputy Chief Minister Brajesh Pathak on Friday warned that there is no place in the state for those obstructing development work and bulldozers will continue to be used against troublemakers.", "url": "https://www.ndtv.com/india-news/bulldozers-will-continue-to-be-used-against-troublemakers-says-uttar-pradesh-deputy-chief-minister-brajesh-pathak-3064340", "urlToImage": "https://c.ndtvimg.com/2022-06/69r0u598_bulldozer-prayagraj_625x300_12_June_22.jpg", "publishedAt": "2022-06-13T18:16:27Z", "content": "Brajesh Pathak said UP Chief Minister is very strict on the issue of law and order. (File)\r\nMeerut: Uttar Pradesh Deputy Chief Minister Brajesh Pathak on Friday warned that there is no place in the s… [+2329 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Chhattisgarh To Reopen 260 Schools Shut For 15 Years In Maoist-Hit Region", "description": "Spurred by the demands of local people, the Chhattisgarh government has decided to reopen as many as 260 government-run schools, located in four districts of the Maoist-hit Bastar region, which were shut 15 years ago due to various reasons.", "url": "https://www.ndtv.com/india-news/chhattisgarh-to-reopen-260-schools-shut-for-15-years-in-maoist-hit-region-3064325", "urlToImage": "https://i.ndtvimg.com/i/2018-04/classroom-generic_650x400_81524576018.jpg", "publishedAt": "2022-06-13T18:07:38Z", "content": "The collectors have been asked to ensure admission to the full extent. (Representational)\r\nRaipur: Spurred by the demands of local people, the Chhattisgarh government has decided to reopen as many as… [+2126 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Amarnath Yatra: Aadhar Authentication Made Compulsory For Pilgrims", "description": "Jammu and Kashmir administration on Monday said pilgrims intending to undertake the Amarnath Yatra will have to furnish their Aadhar card or submit to Aadhar authentication voluntarily.", "url": "https://www.ndtv.com/india-news/amarnath-yatra-aadhar-authentication-made-compulsory-for-pilgrims-3064305", "urlToImage": "https://c.ndtvimg.com/2019-08/dpvs5bmg_amarnath-yatra-reuters_650x400_02_August_19.jpg", "publishedAt": "2022-06-13T18:00:07Z", "content": "Over a million devotees are expected to take part in this year's pilgrimage. (File)\r\nSrinagar: Jammu and Kashmir administration on Monday said pilgrims intending to undertake the Amarnath Yatra will … [+1215 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Cuts Off Last Evacuation Route From Eastern Ukraine City: Report", "description": "Russian forces tightened their grip on the eastern Ukrainian city of Sievierodonetsk and cut off the last routes for evacuating citizens, a Ukrainian official said on Monday -- a scene that echoed Moscow's assault on Mariupol last month.", "url": "https://www.ndtv.com/world-news/russia-cuts-off-last-evacuation-route-from-eastern-ukraine-city-report-3064288", "urlToImage": "https://c.ndtvimg.com/2022-06/6o9lf5l8_ukraine-soldier_625x300_13_June_22.jpg", "publishedAt": "2022-06-13T17:51:42Z", "content": "A Ukrainian serviceman looks on from inside a tank at a position in Donetsk region.\r\nKyiv: Russian forces tightened their grip on the eastern Ukrainian city of Sievierodonetsk and cut off the last ro… [+4663 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Disney Star Gets IPL TV Rights Deal, Viacom18 Bags Digital Rights: Report", "description": "As per information received, Package A (Indian sub-continent TV Rights) for 410 IPL matches across five seasons from 2023 to 2027 has been sold for Rs 23,575 crore, which is effectively Rs 57.5 crore per game.", "url": "https://sports.ndtv.com/cricket/ipl-media-rights-disney-star-gets-tv-deal-for-23-575-crore-viacom18-bags-digital-for-rs-20-500-crore-report-3064256", "urlToImage": "https://c.ndtvimg.com/2020-10/m72b477_ipl-logo-twitter_625x300_25_October_20.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-13T17:35:32Z", "content": "Disney Star won the coveted IPL Indian sub-continent TV rights for a whopping Rs 23,575 crore while Viacom18 grabbed the digital rights with a bid of Rs 20,500 crore at the media rights auction on Mo… [+3773 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "99.5% Samples Infected With Omicron Sub-Variant: Mumbai's Civic Body", "description": "Out of 279 swab samples tested during the 12th genome sequencing series in Mumbai, 278 were found infected with Omicron sub-variants of coronavirus and 1 with the Delta strain, the Brihanmumbai Municipal Corporation (BMC) said on Monday.", "url": "https://www.ndtv.com/mumbai-news/99-5-samples-infected-with-omicron-sub-variant-in-genome-sequencing-says-mumbais-civic-body-brihanmumbai-municipal-corporation-bmc-3064245", "urlToImage": "https://c.ndtvimg.com/2022-01/gtf6h33_mumbai-covid-pti-650_650x400_05_January_22.jpg", "publishedAt": "2022-06-13T17:31:01Z", "content": "Of the 202 samples, 2 had taken only the 1st dose of COVID-19 vaccine. (Representational)\r\nMumbai: Out of 279 swab samples tested during the 12th genome sequencing series in Mumbai, 278 were found in… [+1876 chars]"}]}