{"status": "ok", "totalResults": 519, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "March Quarter GDP Growth Better Than Expected: Chief Economic Adviser", "description": "Though India is not unaffected by global inflationary pressures, it is better placed compared to several developed economies, Mr Nageswaran added", "url": "https://www.ndtv.com/business/march-quarter-gdp-growth-better-than-expected-says-chief-economic-adviser-3026577", "urlToImage": "https://c.ndtvimg.com/2021-05/cpedfh6g_india-economy-covid-reuters_625x300_31_May_21.jpg", "publishedAt": "2022-05-31T14:27:30Z", "content": "Chief economic adviser has said that March quarter GDP growth is better than expected\r\nDespite GDP recording its slowest growth during the March quarter of 2021-22 at 4.1 per cent, Chief Economic Adv… [+1687 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Red Bull Reward Monaco Man Setgio Perez With New Deal To 2024", "description": "The new contract gave Max Verstappen's teammate double cause for celebration after he emerged from all the chaos caused by a pre-race deluge to win the iconic Grand Prix.", "url": "https://sports.ndtv.com/formula-1/red-bull-reward-monaco-man-setgio-perez-with-new-deal-to-2024-3026576", "urlToImage": "https://c.ndtvimg.com/2022-05/p0ms1m28_sergio-perez-afp_625x300_29_May_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-31T14:27:26Z", "content": "Red Bull on Tuesday announced they have rewarded Sergio Perez with a fresh two-year deal until 2024, with the Mexican signing in Monaco last weekend. The new contract gave Max Verstappen's teammate d… [+1472 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "South African Cricketer Hospitalised After Assault Outside UK Pub: Report", "description": "Khumalo, who is on his first overseas stint as a professional cricketer, is currently in \"serious condition\", claimed another report in ESPNCricinfo. He was playing club cricket for North Petherton Cricket Club.", "url": "https://sports.ndtv.com/cricket/south-african-cricketer-mondli-khumalo-hospitalised-after-assault-outside-uk-pub-reports-3026573", "urlToImage": "https://c.ndtvimg.com/2022-05/edt7ieq8_mondli-khumalo_625x300_31_May_22.jpg", "publishedAt": "2022-05-31T14:26:07Z", "content": "20-year-old Mondli Khumalo, a former U-19 cricketer for South Africa, has been hospitalised after he was attacked outside a pub in Friarn Street in Bridgwater on Sunday, BBC reported. A 27-year-old m… [+989 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Gujarat Nuclear Plant's 4th Unit Operation Delayed By Over A Year: Report", "description": "Construction of Nuclear Power Corp of India Ltd's (NPCIL) Kakrapara plant's fourth unit, scheduled to start commercial generation this year, has not been completed and is running more than a year late, a government memo showed.", "url": "https://www.ndtv.com/india-news/gujarat-nuclear-plants-4th-unit-operation-delayed-by-over-a-year-report-3026568", "urlToImage": "https://c.ndtvimg.com/2020-07/0oklk99o_kakrapar-atomic-power-plant-gujarat_625x300_22_July_20.jpg", "publishedAt": "2022-05-31T14:25:23Z", "content": "Kakrapar Nuclear Plant: Kakrapara setback is negative for India's efforts to keep emissions in check.\r\nAhmedabad: Construction of Nuclear Power Corp of India Ltd's (NPCIL) Kakrapara plant's fourth un… [+2234 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Amid Centre Vs AAP On Delhi Minister's Arrest, A Look At Other Cases", "description": "The latest flashpoint between the Aam Aadmi Party (AAP) government in Delhi and the centre involves the arrest of Delhi minister Satyendar Jain by the Enforcement Directorate in an alleged money laundering case.", "url": "https://www.ndtv.com/india-news/amid-centre-vs-aap-on-delhi-minister-satyendar-jains-arrest-a-look-at-other-cases-3026540", "urlToImage": "https://c.ndtvimg.com/2022-01/2ft3pm08_arvind-kejriwal-satyendar-jain-pti_625x300_23_January_22.jpg", "publishedAt": "2022-05-31T14:17:28Z", "content": "Satyendar Jain's arrest has led to another round of AAP vs centre row\r\nNew Delhi: The latest flashpoint between the Aam Aadmi Party (AAP) government in Delhi and the centre involves the arrest of Del… [+1513 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Is SpaceX Environmentally Responsible? Elon Musk Stares At The Question", "description": "The Federal Aviation Administration (FAA) is set to complete an environmental review of the proposed SpaceX Starship spacecraft and Super Heavy rocket program in Boca Chica, Texas, as early as Tuesday.", "url": "https://www.ndtv.com/world-news/elon-musk-elon-musk-spacex-is-spacex-environmentally-responsible-elon-musk-stares-at-the-question-3025467", "urlToImage": "https://c.ndtvimg.com/2022-05/dte8tg0g_elon-musk-reuters_625x300_18_May_22.jpg", "publishedAt": "2022-05-31T14:15:58Z", "content": "Elon Musk: Elon Musk said SpaceX has a fallback plan.\r\nWashington: The Federal Aviation Administration (FAA) is set to complete an environmental review of the proposed SpaceX Starship spacecraft and … [+1644 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sidhu Moose Wala Murder: Suspect From Uttarakhand Is First To Be Arrested", "description": "On the day Punjabi singer Sidhu Moose Wala was cremated, the police made the first arrest in the horrific murder of the popular singer, who was shot dead at the weekend.", "url": "https://www.ndtv.com/india-news/sidhu-moose-wala-murder-first-arrest-made-in-case-accused-sent-to-police-custody-for-5-days-3026534", "urlToImage": "https://c.ndtvimg.com/2022-05/p0ksnhhg_sidhu-moose-wala_625x300_30_May_22.jpg", "publishedAt": "2022-05-31T14:14:58Z", "content": "The Punjab police had said the killing seemed to be the result of an inter-gang rivalry.\r\nNew Delhi: On the day Punjabi singer Sidhu Moose Wala was cremated, the police made the first arrest in the h… [+1040 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "England's Stuart Broad Vows To Give 'Heart And Soul' At Lord's", "description": "Both James Anderson and Stuart Broad, England's two all-time leading Test wicket-takers, were controversially left out of the squad that lost 1-0 in a three-match series in the West Indies earlier this year", "url": "https://sports.ndtv.com/cricket/englands-stuart-broad-vows-to-give-heart-and-soul-at-lords-3026533", "urlToImage": "https://c.ndtvimg.com/2022-01/tmbhu29k_stuart-broad_625x300_06_January_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-31T14:14:06Z", "content": "England veteran quick Stuart Broad has vowed to leave his \"heart and soul\" on the field should he earn a Test recall against New Zealand at Lord's this week. Both James Anderson and Broad, England's … [+2506 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "On Ex-Officer's Bail Plea, Delhi High Court Seeks CBI's Stand In NSE Scam", "description": "The Delhi High Court on Tuesday issued notice to the Central Bureau of Investigation (CBI) on the bail plea of Anand Subramanian, former Group Operating Officer (GOO) and Chief Strategic Advisor (CSA) of the National Stock Exchange.", "url": "https://www.ndtv.com/india-news/nse-co-location-scam-anand-subramanian-bail-on-ex-officers-bail-plea-delhi-high-court-seeks-cbis-stand-in-nse-scam-3025160", "urlToImage": "https://c.ndtvimg.com/2022-02/364kkq7_ex-nse-officer-anand-subramanian_625x300_25_February_22.jpg", "publishedAt": "2022-05-31T14:12:16Z", "content": "NSE Co-Location Scam: Anand Subramanian has now moved a bail plea before the Delhi HC.\r\nNew Delhi: The Delhi High Court on Tuesday issued notice to the Central Bureau of Investigation (CBI) on the ba… [+1678 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Mumbai Cop Arrested For Accepting Rs 70,000 Bribe To Not Register FIR", "description": "A 35-year-old policeman in Mumbai has been arrested for allegedly accepting a bribe of Rs 70,000 from a man for not registering an FIR against him, police said on Tuesday.", "url": "https://www.ndtv.com/mumbai-news/mumbai-cop-arrested-for-accepting-rs-70-000-bribe-to-not-register-fir-3026519", "urlToImage": "https://c.ndtvimg.com/mumbai-police-generic_650_625x300_1530762157699.jpg", "publishedAt": "2022-05-31T14:10:01Z", "content": "The cop has been arrested under relevant sections of the Prevention of Corruption Act. (Representational)\r\nMumbai: A 35-year-old policeman in Mumbai has been arrested for allegedly accepting a bribe … [+1074 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Mizoram Board 2022 Results: Girls Outperform Boys In MBSE Class 12", "description": "HSSLC result 2022 Mizoram: The Higher Secondary School Leaving Certificate (HSSLC) examinations for Arts, Science and Commerce streams were held in February-March. While the pass percentage among girls was 82.10, among boys it was 82.04, officials said.", "url": "https://www.ndtv.com/education/mizoram-board-2022-class-12-result-declared-girls-outperform-boys-in-mbse-hsslc-exams", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/5/31/exam-result-featured-image.jpg", "publishedAt": "2022-05-31T14:05:31Z", "content": "Aizawl:The Mizoram Board of School Education (MBSE) on Tuesday announced the MBSE results of the class 12 board examinations, in which 82.07 per cent of candidates were declared successful. The Highe… [+1432 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Mumbai Man Learning To Drive Presses Accelerator Instead Of Brake, 1 Dead", "description": "A 62-year-old working at a restaurant died after he was hit by a car in south Mumbai's Girgaum Chowpatty area, a police official said on Tuesday.", "url": "https://www.ndtv.com/mumbai-news/mumbai-man-learning-to-drive-presses-accelerator-instead-of-brake-1-dead-3026491", "urlToImage": "https://c.ndtvimg.com/2018-10/bkln88o4_car-generic-car-lights-in-darkness-istock_625x300_17_October_18.jpg", "publishedAt": "2022-05-31T14:02:30Z", "content": "The driver was handed over to the police by passers-by (Representational pic)\r\nMumbai: A 62-year-old working at a restaurant died after he was hit by a car in south Mumbai's Girgaum Chowpatty area, a… [+601 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Johnny Depp-Amber Heard Case: When Is The Verdict Expected?", "description": "Johnny Depp and Amber Heard have sued each other and are seeking millions in damages. The jury is currently deliberating.", "url": "https://www.ndtv.com/world-news/johnny-depp-amber-heard-case-when-is-the-verdict-expected-3026490", "urlToImage": "https://c.ndtvimg.com/2022-04/d5p67l3_johnny-depp-vs-amber-heard_625x300_30_April_22.jpg", "publishedAt": "2022-05-31T14:01:52Z", "content": "The Johnny Depp-Amber Heard trial began on April 11 and arguments continued for 6 weeks.\r\nThe Johnny Depp-Amber Heard court battle is in its final stages, with the jury deliberating in Fairfax, Virgi… [+1598 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Asian News International", "title": "India vs SA T20Is: KL Rahul-led Team India To Arrive In Delhi On June 5", "description": "As Virat Kohli and Rohit Sharma have been rested from the series, Team India will be led by KL Rahul while Rishabh Pant will be the vice-captain", "url": "https://sports.ndtv.com/india-vs-south-africa-2022/india-vs-south-africa-t20is-kl-rahul-led-team-india-to-arrive-in-delhi-on-june-5-3026476", "urlToImage": "https://c.ndtvimg.com/2022-05/vu4sp4i_kl-rahul-afp_625x300_31_May_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-31T13:59:25Z", "content": "After the 15th edition of the Indian Premier League (IPL) concluded on Sunday, the Indian cricket team is all set to arrive in New Delhi on June 5 for the five-match T20I series against South Africa.… [+2137 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "ASHA Workers' Struggle For Survival In Shadows Outside WHO Spotlight", "description": "Come rain, sun, hail or indeed a contagion, the band of women who form the bedrock of India's rural healthcare system slog on, anonymous, underpaid and mostly unsung until last week when the WHO honoured them for their efforts in controlling Covid.", "url": "https://www.ndtv.com/india-news/asha-workers-struggle-for-survival-in-shadows-outside-who-spotlight-3026461", "urlToImage": "https://c.ndtvimg.com/2022-05/a5gr0nio_asha-worker-_625x300_23_May_22.jpg", "publishedAt": "2022-05-31T13:58:06Z", "content": "ASHA workers are the first point of contact for millions of villagers and the healthcare system.\r\nNew Delhi: Come rain, sun, hail or indeed a contagion, the band of women who form the bedrock of Indi… [+5271 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Mridusmita Deka", "title": "Banaras Hindu University Scientists In Global Research Team On Venus", "description": "The BHU team is also assessing the impact from volcanic activity on its climate. The research to study the Venus surface, as per the university statement, is being conducted by International Venus Research Group which comprises teams from Canada, United State…", "url": "https://www.ndtv.com/education/banaras-hindu-university-scientists-in-global-research-team-on-planet-venus", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/5/31/bhu-featured-image.jpg", "publishedAt": "2022-05-31T13:55:30Z", "content": "A Banaras Hindu University (BHU) team from the Department of Geology is involved in research on planet Venus through geological mapping of its surface for different magmatic units including volcanic … [+2169 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ranveer Burnt Up Karan Johar's Dance Floor To An Iconic Big B Song", "description": "Juhi Chawla shared a video from Karan Johar's birthday bash", "url": "https://www.ndtv.com/entertainment/ranveer-singh-burnt-up-karan-johars-dance-floor-to-an-iconic-amitabh-bachchan-song-video-courtesy-juhi-chawla-3026452", "urlToImage": "https://c.ndtvimg.com/2022-05/cd47cgso_ranveer-singh_625x300_31_May_22.jpg", "publishedAt": "2022-05-31T13:54:05Z", "content": "Ranveer Singh dancing at Karan Johar's birthday party. (courtesy: iamjuhichawla\r\nIt has been almost a week since Karan Johar celebrated his 50th birthday bash on May 25, but inside pictures and video… [+1446 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Prashant Kishor's Latest Swipe At Congress, With Folded Hands", "description": "Prashant Kishor, after nearly joining the Congress weeks ago, declared today that he would \"never go with the party\", folding his hands for emphasis.", "url": "https://www.ndtv.com/india-news/prashant-kishor-prashant-kishor-on-joining-congress-prashant-kishor-congress-news-prashant-kishors-latest-swipe-at-congress-with-folded-hands-3026430", "urlToImage": "https://c.ndtvimg.com/2022-05/cpbipvmg_prashant-kishor_625x300_31_May_22.jpg", "publishedAt": "2022-05-31T13:47:19Z", "content": "Prashant Kishor On Congress: Prashant Kishor said Congress would go down and take everyone with it.\r\nNew Delhi: Prashant Kishor, after nearly joining the Congress weeks ago, declared today that he wo… [+1921 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Judge Recounts When He Had To Grant Divorce As Woman Only Cooked Maggi", "description": "Well, we all have special stories associated with Maggi but this one turned a lot of heads on social media.", "url": "https://www.ndtv.com/india-news/husband-tired-of-eating-maggi-for-breakfast-lunch-and-dinner-divorces-wife-3026425", "urlToImage": "https://c.ndtvimg.com/maggi-noodles_625x300_1526556574467.jpg", "publishedAt": "2022-05-31T13:46:48Z", "content": "The couple parted ways on mutual consent\r\nImagine if you have to eat Maggi thrice a day. This may sound like a dream to some, but for a couple in Karnataka's Ballari this became a reason to file for … [+2064 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "UGC Cautions Students Against Periyar University's ODL Programmes", "description": "The University Grants Commission has warned students against taking admission in distance learning programmes offered by Periyar University in Tamil Nadu.", "url": "https://www.ndtv.com/education/ugc-cautions-students-against-periyar-universitys-odl-programmes", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/5/31/ugc.JPG", "publishedAt": "2022-05-31T13:46:05Z", "content": "New Delhi:The University Grants Commission has warned students against taking admission in distance learning programmes offered by Periyar University in Tamil Nadu saying it does not recognise such c… [+1699 chars]"}]}