{"status": "ok", "totalResults": 523, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Hit By Oil Import Ban, Ukraine Changes Stance On NATO: 10 Facts", "description": "The United States led a Western assault on Moscow's economic lifeline Tuesday, banning imports of Russian oil as civilians fled besieged Ukrainian cities in a desperate evacuation push", "url": "https://www.ndtv.com/world-news/ukraine-russia-war-russia-hit-by-oil-import-ban-ukraine-changes-stance-on-nato-10-facts-2811883", "urlToImage": "https://c.ndtvimg.com/2022-03/8r3t9fc_ukraine-war_625x300_09_March_22.jpg", "publishedAt": "2022-03-09T01:36:43Z", "content": "<li>President Joe Biden announced a ban on US imports of Russian oil, gas and coal, saying Ukraine will \"never be a victory for Putin\". Britain said it will also phase out Russian oil imports by the … [+2182 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Edited by NDTV News Desk", "title": "Ukraine-Russia War Live: Russian onslaught continues in Ukraine", "description": "The United States said Tuesday it was working with Ukraine to prevent invading Russian forces from seizing biological research material amid concern governments or unscrupulous actors might try to use such items to create bioweapons.", "url": "https://www.ndtv.com/world-news/ukraine-russia-war-live-updates-refugees-flee-embattled-cities-as-russian-onslaught-continues-2811866", "urlToImage": "https://c.ndtvimg.com/2022-03/78hqs6b8_ukraine-war_625x300_09_March_22.jpg", "publishedAt": "2022-03-09T00:59:28Z", "content": "New Delhi: The United States said Tuesday it was working with Ukraine to prevent invading Russian forces from seizing biological research material amid concern governments or unscrupulous actors migh… [+862 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE: India Records 3,993 New Covid Cases In 24 Hours", "description": "India on Tuesday reported a total of 3,993 new COVID-19 infections, taking the Covid tally to 4,29,71,308. According to the Union Health Ministry data, the active cases dipped to 49,948.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-9-march-2022-2811860", "urlToImage": "https://c.ndtvimg.com/2021-11/iulm91gs_covid-testing_625x300_11_November_21.jpg", "publishedAt": "2022-03-09T00:29:32Z", "content": "With 108 fresh fatalities, the death count climbed to 5,15,210 so far.\r\nNew Delhi: India on Tuesday reported a total of 3,993 new COVID-19 infections, taking the Covid tally to 4,29,71,308. According… [+950 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Putin's War Hurting American Families,\" Says Joe Biden, Imposes New Ban", "description": "Russia's war against Ukraine has hurt American families with gas prices shooting up and it is going to rise further, US President Joe Biden said after announcing a ban on the import of Russian oil and gas.", "url": "https://www.ndtv.com/world-news/putins-war-hurting-american-families-says-joe-biden-imposes-new-ban-2811859", "urlToImage": "https://c.ndtvimg.com/2022-03/jr4sokvc_joe-biden-pti_625x300_09_March_22.jpg", "publishedAt": "2022-03-09T00:29:01Z", "content": "US President Joe Biden banned import of Russian crude oil, petroleum products, LNG, and coal.\r\nWashington: Russia's war against Ukraine has hurt American families with gas prices shooting up and it i… [+3182 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Pentagon Says Poland's Fighter Jet Offer For Ukraine \"Not Tenable\"", "description": "The United States believes that a Polish offer to deliver Mig-29 fighter jets to a US air base in Germany with a view to sending them to Ukraine is not \"tenable,\" the Pentagon said Tuesday.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-pentagon-says-polands-fighter-jet-offer-for-ukraine-not-tenable-2811855", "urlToImage": "https://c.ndtvimg.com/2018-10/u0ikv2c8_mig-29_625x300_07_October_18.jpg", "publishedAt": "2022-03-09T00:14:23Z", "content": "Poland has said it is sending its MIG-29 jets to US' Germany air base to give Ukraine against Russia.\r\nWashington: The United States believes that a Polish offer to deliver Mig-29 fighter jets to a U… [+658 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russian Families Divided Over Putin's Move To Attack On Ukraine", "description": "When Russian actor Jean-Michel Scherbak wrote on social media that he was ashamed his country had started a war in Ukraine, his mother, a longtime supporter of Russian President Vladimir Putin, blocked him online.", "url": "https://www.ndtv.com/world-news/russian-families-divided-over-putins-move-to-attack-on-ukraine-2811850", "urlToImage": "https://c.ndtvimg.com/2022-03/7ginplo8_ukraine_650x400_05_March_22.jpg", "publishedAt": "2022-03-09T00:01:42Z", "content": "Police have detained more than 13,000 people at anti-war protests in Russia since Feb. 24.\r\nGdask, Poland: When Russian actor Jean-Michel Scherbak wrote on social media that he was ashamed his countr… [+3721 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ready To Deploy MiG-29 Warplanes To US Air Base In Germany, Says Poland", "description": "Poland is willing to hand its Mig-29 fighter jets to the United States, the foreign ministry said in a statement Tuesday, under a reported scheme that would see the planes given to Ukraine.", "url": "https://www.ndtv.com/world-news/ready-to-deploy-mig-29-fighter-jets-to-us-air-base-in-germany-says-poland-2811838", "urlToImage": "https://i.ndtvimg.com/i/2016-05/mig-29k-fighter-aircraft_650x400_81462967061.jpg", "publishedAt": "2022-03-08T23:41:15Z", "content": "Earlier, the US had downplayed the possibility of any NATO country supplying besieged Ukraine.\r\nWarsaw: Poland is willing to hand its Mig-29 fighter jets to the United States, the foreign ministry sa… [+1636 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ex-Principal Arrested In Disproportionate Assets Case In Odisha", "description": "A former college principal was arrested in Odisha's Kalahandi district on Tuesday for allegedly possessing disproportionate assets after the Vigilance Directorate unearthed assets worth more than Rs 5 crore from his possession.", "url": "https://www.ndtv.com/india-news/ex-principal-arrested-in-disproportionate-assets-case-in-odisha-2811832", "urlToImage": "https://i.ndtvimg.com/i/2016-05/arrest-generic_650x400_71463458726.jpg", "publishedAt": "2022-03-08T23:06:27Z", "content": "A single-storey building, a house in Bhubaneswar, and Rs 1.94 lakh seized. (Representational)\r\nBhawanipatna, Odisha: A former college principal was arrested in Odisha's Kalahandi district on Tuesday … [+958 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Says Russia's Nord Stream 2 Pipeline \"Dead\" After Ukraine Invasion", "description": "The controversial Nord Stream 2 pipeline that was halted over Russia's invasion of Ukraine is \"dead,\" a senior US official said Tuesday, appearing to douse any hopes that the multi-billion-dollar gas venture could have a future.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-us-says-russias-nord-stream-2-pipeline-dead-after-ukraine-invasion-2811824", "urlToImage": "https://c.ndtvimg.com/2021-01/t9v68mm8_nord-stream-2reuters_625x300_19_January_21.jpg", "publishedAt": "2022-03-08T22:38:58Z", "content": "Kremlin's prize geopolitical energy project has become a victim of Western sanctions.\r\nWashington: The controversial Nord Stream 2 pipeline that was halted over Russia's invasion of Ukraine is \"dead,… [+559 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Coca-Cola, PepsiCo Suspend Operations In Russia Over Ukraine Crisis", "description": "Coca-Cola and PepsiCo are suspending business in Russia, the soft drink giants announced Tuesday, as corporations and Western governments penalize Moscow for its invasion of Ukraine.", "url": "https://www.ndtv.com/world-news/russia-ukraine-crisis-coca-cola-pepsico-suspend-operations-in-russia-over-ukraine-crisis-2811816", "urlToImage": "https://c.ndtvimg.com/2022-02/jld7477_russia-ukraine-war-afp-650_625x300_27_February_22.jpg", "publishedAt": "2022-03-08T22:18:56Z", "content": "Companies from Apple to Visa have already suspended their operations in Russia.\r\nNew York: Coca-Cola and PepsiCo are suspending business in Russia, the soft drink giants announced Tuesday, as corpora… [+907 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Surprised At Poland's MiG-29 Fighter Jets Offer For Ukraine", "description": "Poland's decision to put all its MiG-29 fighter jets at the disposal of the United States was \"a surprise move\" by Warsaw, the U.S. State Department's No. 3 diplomat said on Tuesday.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-us-calls-polands-jets-for-ukraine-surprise-to-fight-against-russian-invaders-2811814", "urlToImage": "https://c.ndtvimg.com/2018-10/u0ikv2c8_mig-29_625x300_07_October_18.jpg", "publishedAt": "2022-03-08T22:00:44Z", "content": "US said that sending fighter jet to Ukraine to fight against Russian army was a surprise move.\r\nWashington: Poland's decision to put all its MiG-29 fighter jets at the disposal of the United States w… [+2077 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Spotify, Discord Down For Thousands Of Users In Widespread Outage", "description": "Audio streaming platform Spotify and messaging platform Discord were down for thousands of users on Tuesday, according to outage tracking website Downdetector.com.", "url": "https://www.ndtv.com/world-news/spotify-discord-down-for-thousands-of-users-in-widespread-outage-2811808", "urlToImage": "https://i.ndtvimg.com/i/2018-04/spotify-logo-reuters_650x400_81524590917.jpg", "publishedAt": "2022-03-08T21:29:46Z", "content": "\"Something's not quite right, and we're looking into it,\" Spotify said in statement.\r\nStockholm: Audio streaming platform Spotify and messaging platform Discord were down for thousands of users on Tu… [+757 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Coffee Giant Starbucks Suspends Business In Russia Over Ukraine Invasion", "description": "Coffee chain Starbucks said Tuesday that it would halt operations in Russia -- the latest fallout in the corporate world over Moscow's invasion of Ukraine.", "url": "https://www.ndtv.com/world-news/russia-ukaine-war-coffee-giant-starbucks-suspends-operations-in-russia-over-ukraine-invasion-2811802", "urlToImage": "https://c.ndtvimg.com/2018-10/irm24hts_starbucks-afp_625x300_24_October_18.jpg", "publishedAt": "2022-03-08T21:12:39Z", "content": "Starbucks has 130 stores in Russia that are wholly owned and operated by a licensed partner.\r\nWashington: Coffee chain Starbucks said Tuesday that it would halt operations in Russia -- the latest fal… [+1223 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UN Tourism Body To Vote On Suspending Russia's Membership Over Ukraine War", "description": "The United Nations' tourism body said on Tuesday it would vote in the coming days to temporarily suspend Russia's membership in the organisation due to the country's invasion of Ukraine.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-un-tourism-body-to-vote-on-suspending-russias-membership-over-ukraine-invasion-2811797", "urlToImage": "https://c.ndtvimg.com/2022-02/2el7hq9o_russia-ukraine-war-afp-650_625x300_26_February_22.jpg", "publishedAt": "2022-03-08T21:00:23Z", "content": "The first-ever extraordinary UNWTO General Assembly will be convened in the coming days.\r\nMadrid: The United Nations' tourism body said on Tuesday it would vote in the coming days to temporarily susp… [+1259 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Announces Humanitarian Ceasefire In Ukraine For Today", "description": "Moscow has announced a humanitarian ceasefire in Ukraine for Wednesday morning to carry out the evacuation of the civilian population, Russian news agencies reported.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-russia-announces-humanitarian-ceasefire-in-ukraine-for-today-2811749", "urlToImage": "https://c.ndtvimg.com/2022-03/sn77nej8_ukraine-refugee-afp-650_625x300_06_March_22.jpg", "publishedAt": "2022-03-08T20:02:33Z", "content": "The statement said that Russian is ready to provide humanitarian corridors for Wednesday.\r\nMoscow: Moscow has announced a humanitarian ceasefire in Ukraine for Wednesday morning to carry out the evac… [+911 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "'We Lost Our Life': Ukrainian Women Face Uncertain Futures", "description": "There is no thought of celebrating International Women's Day for the refugees arriving in the Polish border city of Przemysl after leaving their husbands and sons behind to fight in Ukraine.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-ukrainian-women-face-uncertain-futures-2811713", "urlToImage": "https://c.ndtvimg.com/2022-03/09c0734o_ukraine-refugees-afp-650_625x300_08_March_22.jpg", "publishedAt": "2022-03-08T19:16:04Z", "content": "More than two million people have left Ukraine since the Russian invasion began on February 24. (File)\r\nPrzemysl, Poland: There is no thought of celebrating International Women's Day for the refugees… [+2546 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"First Since Nazi Invasion\": Ukraine Says Girl Dies Of Thirst Under Rubble", "description": "A six-year-old girl has died from dehydration under the rubble of her destroyed home in the besieged Ukrainian city of Mariupol, the city council said Tuesday.", "url": "https://www.ndtv.com/world-news/ukraine-war-first-since-nazi-invasion-ukraine-says-girl-dies-of-thirst-under-rubble-2811686", "urlToImage": "https://c.ndtvimg.com/2022-03/8sj9tn4o_ukraine-war-afp-650_625x300_09_March_22.jpg", "publishedAt": "2022-03-08T18:42:23Z", "content": "Ukraine War: Mariupol is surrounded by Russian forces who have bombarded the port city. (File)\r\nDnipro, Ukraine: A six-year-old girl has died from dehydration under the rubble of her destroyed home i… [+1341 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Express Train Operated By All-Women Staff On International Women's Day", "description": "An express train was operated for the first time by all women staff including the loco pilot, guard, TTE, security personnel in Chakradharpur division of South Eastern Railway today on the occasion of the International Women's Day, an officer said.", "url": "https://www.ndtv.com/india-news/express-train-operated-by-all-women-staff-on-international-womens-day-2811331", "urlToImage": "https://c.ndtvimg.com/2022-03/j6da2o9_indian-train-womens-day-650_625x300_09_March_22.jpg", "publishedAt": "2022-03-08T18:33:47Z", "content": "Women's Day: The train was operated exclusively by women employees, an official said. (Representational)\r\nJamshedpur: An express train was operated for the first time by all women staff including the… [+1440 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Women's World Cup, England vs West Indies Live Score And Updates", "description": "England vs West Indies Live score, ICC Women's World Cup 2022: England take on West Indies in the seventh match of the ICC Women's World Cup at the University Oval in Dunedin on Wednesday.", "url": "https://sports.ndtv.com/icc-women-s-world-cup-2022/england-women-vs-west-indies-women-live-score-and-updates-2811675", "urlToImage": "https://c.ndtvimg.com/2022-03/ordf8ccg_england-women-icc_625x300_08_March_22.png?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-03-08T18:26:25Z", "content": "0 &amp;&amp; comm[ts].geo.indexOf($root.$GEO.country) == -1\" ng-if=\"comm[ts].evt != 'Plugin:news' &amp;&amp; comm[ts].evt != 'Plugin:video' &amp;&amp; comm[ts].evt != 'Plugin:comments'\"&gt;England vs… [+1621 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Priyanka Gandhi Surpasses Yogi Adityanath In Poll Rallies In UP", "description": "Congress general secretary Priyanka Gandhi Vadra appears to have shed maximum sweat among top leaders for over the last 45 days for the seven-phase Uttar Pradesh assembly elections campaign.", "url": "https://www.ndtv.com/india-news/assembly-elections-2022-priyanka-gandhi-surpasses-yogi-adityanath-in-poll-rallies-in-up-2811671", "urlToImage": "https://c.ndtvimg.com/2022-02/kge5f744_priyanka-gandhi-punjab-ani_625x300_13_February_22.jpg", "publishedAt": "2022-03-08T18:22:45Z", "content": "Priyanka Gandhi appears to have shed maximum sweat among top leaders for over last 45 days (File)\r\nLucknow: Congress general secretary Priyanka Gandhi Vadra appears to have shed maximum sweat among t… [+5107 chars]"}]}