{"status": "ok", "totalResults": 538, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Petrol, Diesel Prices Hiked Again, Fourth Time In 5 Days", "description": "Petrol and diesel prices were hiked by 80 paise a litre each today, the fourth increase in five days as oil firms passed on to consumers the spike in cost of raw material.", "url": "https://www.ndtv.com/india-news/petrol-diesel-prices-hiked-again-fourth-time-in-5-days-2844086", "urlToImage": "https://c.ndtvimg.com/2020-07/8uslaip4_petrol-and-diesle-price_625x300_01_July_20.jpg", "publishedAt": "2022-03-26T01:41:52Z", "content": "Fuel Prices Today: Petrol in Delhi will now cost Rs 98.61 per litre while diesel will cost Rs 89.87.\r\nPetrol and diesel prices were hiked by 80 paise a litre each today, the fourth increase in five d… [+2244 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Edited by Nonika Sharma", "title": "Russia Signals Less Ambitious Goals In Ukraine War: Updates", "description": "Russia signaled Friday it may dial back its war aims to focus on eastern Ukraine after failing to break the nation's resistance in a month of fighting and attacks on civilians, including up to 300 feared killed in the bombing of a theatre.", "url": "https://www.ndtv.com/world-news/russia-ukraine-crisis-live-updates-russia-signals-less-ambitious-goals-in-ukraine-war-2844085", "urlToImage": "https://c.ndtvimg.com/2022-03/7rpnml0g_ukraine-war-afp_625x300_26_March_22.jpg", "publishedAt": "2022-03-26T01:40:14Z", "content": "Ukraine Crisis: Russia launched its full-scale invasion on February 24.\r\nNew Delhi: Russia signaled Friday it may dial back its war aims to focus on eastern Ukraine after failing to break the nation'… [+1633 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Fuel Prices Increasing Due To Russia-Ukraine War: Nitin Gadkari", "description": "Union Minister Nitin Gadkari justified the hikes in fuel prices, thrice in the last 4 days, saying that the oil prices had gone up within the international market owing to the Russia-Ukraine war, which was beyond the Indian government's control.", "url": "https://www.ndtv.com/india-news/fuel-prices-increasing-due-to-russia-ukraine-war-nitin-gadkari-2844079", "urlToImage": "https://c.ndtvimg.com/2021-09/i9noc5q8_nitin-gadkari_625x300_17_September_21.jpg", "publishedAt": "2022-03-26T01:21:32Z", "content": "Petrol and diesel prices were hiked by 80 paise a litre each on Friday, the third increase in four days.\r\nMumbai: Union Minister Nitin Gadkari on Friday justified the hikes in fuel prices, thrice in … [+4111 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Sending Troops From Georgia To Ukraine, Claims US Official", "description": "A senior US defence official told reporters that the Pentagon has seen indications of Russia sending troop reinforcements from \"Georgia\" to Ukraine to support its offensive in the Donbas region.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-russia-sending-troops-from-georgia-to-ukraine-claims-pentagon-2844071", "urlToImage": "https://c.ndtvimg.com/2022-03/u10q85a_antitank-constructions-kyivukrainereuters_625x300_07_March_22.jpg", "publishedAt": "2022-03-26T00:55:42Z", "content": "Pentagon official said that they have seen the movement of some number of Russian troops from Georgia.\r\nWashington: A senior US defence official told reporters that the Pentagon has seen indications … [+1051 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE: India Logs 1,685 New COVID-19 Cases In 24 Hours", "description": "India recorded at least 1,685 fresh coronavirus cases in the last 24 hours, taking the COVID-19 tally to 4,30,16,372 as of Friday. According to Union health ministry data, the active cases declined further to 21,530 today.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-26-march-2022-2844061", "urlToImage": "https://c.ndtvimg.com/2022-02/s1ha4ch8_india-covid-reuters_625x300_04_February_22.jpg", "publishedAt": "2022-03-26T00:13:35Z", "content": "A reduction of 2,531 cases has been recorded in the active COVID-19 caseload in a span of 24 hours.\r\nNew Delhi: India recorded at least 1,685 fresh coronavirus cases in the last 24 hours, taking the … [+513 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "France Announces Joint Evacuation Mission In Mariupol With Turkey, Greece", "description": "President Emmanuel Macron said Friday France was working with Turkey and Greece on a \"humanitarian operation\" to evacuate people from the devastated Ukrainian city of Mariupol under attack by Russian forces.", "url": "https://www.ndtv.com/world-news/frances-president-emmanuel-macron-announces-joint-evacuation-mission-in-mariupol-with-turkiye-greece-2844056", "urlToImage": "https://c.ndtvimg.com/2022-03/ejjfvb0g_russia-ukraine-war-mariupol-attack_625x300_14_March_22.jpeg", "publishedAt": "2022-03-25T23:50:20Z", "content": "Authorities in the city have put the death count in the city at over 2,000.\r\nBrussels: President Emmanuel Macron said Friday France was working with Turkey and Greece on a \"humanitarian operation\" to… [+1462 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US To Sanction Russian Firms Providing Tech To Moscow's Military: Report", "description": "The Biden administration is preparing sanctions targeting Russian companies it says provides goods and services to Moscow's military and intelligence services, the Wall Street Journal reported on Friday.", "url": "https://www.ndtv.com/world-news/us-to-sanction-russian-firms-providing-tech-to-moscows-military-report-2844051", "urlToImage": "https://c.ndtvimg.com/2022-03/k83gj7go_ukraine-war-afp_625x300_22_March_22.jpg", "publishedAt": "2022-03-25T23:19:49Z", "content": "The US and its allies on Thursday ramped up pressure on Moscow over its invasion of Ukraine.\r\nWashington: The Biden administration is preparing sanctions targeting Russian companies it says provides … [+998 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Saudi-Led Coalition Says Aramco Fire \"Under Control\" After Rebel Strike", "description": "Yemen's Houthis said they launched attacks on Saudi energy facilities on Friday and the Saudi-led coalition said oil giant Aramco's petroleum products distribution station in Jeddah was hit, causing a fire in two storage tanks but no casualties.", "url": "https://www.ndtv.com/world-news/saudi-led-coalition-says-aramco-fire-under-control-after-yemen-rebel-strike-2844048", "urlToImage": "https://c.ndtvimg.com/2022-03/da3nk6ik_jeddah-oil-fire_625x300_25_March_22.jpg", "publishedAt": "2022-03-25T22:55:10Z", "content": "The attacks came as Jeddah was hosting the Formula One Saudi Arabian Grand Prix.\r\nRiyadh: Yemen's Houthis said they launched attacks on Saudi energy facilities on Friday and the Saudi-led coalition s… [+3489 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "7 Russian Generals Killed In Ukraine War So Far: Western Official", "description": "Among the others said to have been killed is General Magomed Tushaev, of the Chechen Special Forces deployed by Russian President Vladimir Putin in Ukraine.", "url": "https://www.ndtv.com/world-news/7-russian-generals-killed-in-ukraine-war-so-far-western-official-2844045", "urlToImage": "https://c.ndtvimg.com/2022-03/a2ukbeio_ukraine-war-afp-240_625x300_24_March_22.jpg", "publishedAt": "2022-03-25T22:21:21Z", "content": "The Kremlin claimed Friday that just over 1,300 military personnel have died in the war.\r\nLondon: Western officials on Friday named seven Russian generals they said had so far been killed, and anothe… [+2181 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Calls For Tougher UN Sanctions Against North Korea After Missile Test", "description": "The United States called Friday for tougher international sanctions against North Korea at the UN Security Council, accusing Pyongyang of \"increasingly dangerous provocations\" after it test-fired its largest-ever intercontinental ballistic missile.", "url": "https://www.ndtv.com/world-news/us-calls-for-tougher-un-sanctions-against-north-korea-after-missile-launch-2844040", "urlToImage": "https://c.ndtvimg.com/2022-03/hppf10v8_north-korea-intercontinental-ballistic-missileafp_625x300_25_March_22.jpg", "publishedAt": "2022-03-25T21:56:23Z", "content": "North Korea says the latest missile was designed to deter any US military moves.\r\nWashington: The United States called Friday for tougher international sanctions against North Korea at the UN Securit… [+1753 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Centre Introduces Bill In Lok Sabha To Merge Delhi's 3 Municipal Bodies", "description": "A bill to merge the three municipal corporations in the national capital into a single entity was introduced in Lok Sabha on Friday amid opposition claims that the move was beyond the legislative competence of Parliament.", "url": "https://www.ndtv.com/india-news/centre-introduces-bill-in-lok-sabha-to-merge-delhis-3-municipal-bodies-2844033", "urlToImage": "https://c.ndtvimg.com/2020-09/tinlqous_lok-sabha-generic-pti-photo_625x300_15_September_20.jpg", "publishedAt": "2022-03-25T21:26:18Z", "content": "The BJP has been ruling the municipal corporations in Delhi for the last 15 years.\r\nNew Delhi: A bill to merge the three municipal corporations in the national capital into a single entity was introd… [+4188 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "France's Macron Dismisses Putin's Demand For Gas Payments In Rubles", "description": "French President Emmanuel Macron on Friday dismissed Russian President Vladimir Putin's demand for Europe to pay for gas in rubles as he accused Moscow of trying to sidestep sanctions over its war on Ukraine.", "url": "https://www.ndtv.com/world-news/france-president-emmanuel-macron-dismisses-vladimir-putins-demand-for-gas-payments-in-ruble-2844027", "urlToImage": "https://c.ndtvimg.com/2021-10/9dstda2k_macron_625x300_09_October_21.jpg", "publishedAt": "2022-03-25T21:00:32Z", "content": "\"It is therefore not possible today to do what is requested,\" French President said.\r\nBrussels: French President Emmanuel Macron on Friday dismissed Russian President Vladimir Putin's demand for Euro… [+1600 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Aiming To Talk To Putin In \"Coming Hours\" Over Ukraine: France's Macron", "description": "French President Emmanuel Macron said on Friday that he was hoping to have more talks with Russian President Vladimir Putin \"in the coming hours\" regarding the situation in Ukraine and any plans to help people leave Mariupol.", "url": "https://www.ndtv.com/world-news/french-president-emmanuel-macron-says-hoping-to-have-more-talks-with-russian-president-vladimir-putin-in-coming-hours-over-ukraine-2844008", "urlToImage": "https://i.ndtvimg.com/i/2017-05/macron-putin-reuters_650x400_81496121260.jpg", "publishedAt": "2022-03-25T20:28:47Z", "content": "Tens of thousands of people are believed to be trapped in Ukraine since Russia invaded its neighbour.\r\nBrussels:  French President Emmanuel Macron said on Friday that he was hoping to have more talks… [+770 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Putin Signs Law On Jail Terms For \"Fake News\" On State Actions Abroad", "description": "Russian President Vladimir Putin Friday signed into law a bill introducing jail terms of up to 15 years for publishing \"fake\" information about Russia's actions abroad, as Moscow's troops continue their military operation in Ukraine.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-russian-president-vladimir-putin-signs-law-on-jail-terms-for-fake-news-on-state-actions-abroad-2844002", "urlToImage": "https://c.ndtvimg.com/2021-12/d9gktnk8_vladimir-putin-afp-650_625x300_12_December_21.jpg", "publishedAt": "2022-03-25T19:50:02Z", "content": "The bill was adopted by Russia's parliament this week.\r\nMoscow: Russian President Vladimir Putin Friday signed into law a bill introducing jail terms of up to 15 years for publishing \"fake\" informati… [+629 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Says China, Russia Must Tell North Korea To Avoid \"Provocation\"", "description": "China and Russia should tell North Korea to avoid more \"provocations\" after it resumed intercontinental ballistic missile testing this week, U.S. State Department spokesperson Jalina Porter said on Friday.", "url": "https://www.ndtv.com/world-news/us-says-china-russia-must-tell-north-korea-to-avoid-provocation-after-missile-launch-2843996", "urlToImage": "https://c.ndtvimg.com/2022-01/t05h03ig_north-korea-missile-afp_625x300_06_January_22.jpg", "publishedAt": "2022-03-25T19:39:03Z", "content": "US said China and Russia should send a strong message to North Korea after missile launch.\r\nWashington: China and Russia should tell North Korea to avoid more \"provocations\" after it resumed intercon… [+1589 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Biden In Poland As Ukraine Fears 300 Dead In Mariupol Theatre Strike", "description": "US President Joe Biden came up-close to the war in Ukraine Friday after forging a new set of measures with Europe designed to place a tighter squeeze on Russia's tottering, energy-rich economy.", "url": "https://www.ndtv.com/world-news/us-president-joe-biden-in-poland-as-ukraine-fears-300-dead-in-mariupol-theatre-strike-2843978", "urlToImage": "https://c.ndtvimg.com/2022-03/33r27p2o_ukraine-war-mariupol-theatre-reuters650_625x300_17_March_22.jpg", "publishedAt": "2022-03-25T19:11:15Z", "content": "Biden already warned that the NATO alliance would \"respond\" if Putin resorts next to chemical weapons.\r\nRzeszw, Poland: US President Joe Biden came up-close to the war in Ukraine Friday after forging… [+6307 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Women's WC, New Zealand vs Pakistan: Live Cricket Score, Live Updates", "description": "ICC Women's Cricket World Cup Live Score: New Zealand face Pakistan in their league stage fixture at Hagley Oval in Christchurch on Saturday.", "url": "https://sports.ndtv.com/icc-women-s-world-cup-2022/icc-womens-cricket-world-cup-new-zealand-women-vs-pakistan-women-live-cricket-score-live-updates-hagley-oval-christchurch-2843954", "urlToImage": "https://c.ndtvimg.com/2022-03/v8ok8rs8_new-zealand-women-afp_625x300_25_March_22.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-03-25T18:28:16Z", "content": "We are into the last stages of the group stage of the World Cup with just the three games left. This game between Pakistan and New Zealand is of the least importance. Pakistan have no chance of quali… [+1040 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Dropped From Yogi Cabinet, Outgoing UP Deputy Chief Minister Said This", "description": "BJP leader and outgoing Uttar Pradesh Deputy Chief Minister Dinesh Sharma on Friday said he will continue to strengthen the party to ensure that it emerges winner in the 2024 Lok Sabha polls.", "url": "https://www.ndtv.com/india-news/dropped-from-yogi-cabinet-outgoing-up-deputy-chief-minister-dinesh-sharma-said-this-2843754", "urlToImage": "https://c.ndtvimg.com/2022-02/l9i4642o_dinesh-sharma-bjp-650_625x300_06_February_22.jpg", "publishedAt": "2022-03-25T18:25:13Z", "content": "Dinesh Sharma has dismissed speculations of him being next Uttar Pradesh BJP chief. (File)\r\nLucknow: BJP leader and outgoing Uttar Pradesh Deputy Chief Minister Dinesh Sharma on Friday said he will c… [+1431 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "COVID-19 Infections Surge In Most Of UK As England Nears Record High", "description": "Coronavirus levels reached all-time highs in Scotland and Wales and are nearing record levels in England, with around 4.2 million people infected across the UK last week, official figures showed Friday.", "url": "https://www.ndtv.com/world-news/covid-19-infections-surge-in-most-of-uk-as-england-nears-record-high-2843946", "urlToImage": "https://c.ndtvimg.com/2021-06/bn6rs7j_delta-variant-afp_625x300_04_June_21.jpg", "publishedAt": "2022-03-25T18:16:21Z", "content": "Britain has been one of the countries hardest hit by the pandemic, recording 164,454 deaths.\r\nLondon: Coronavirus levels reached all-time highs in Scotland and Wales and are nearing record levels in … [+1625 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Phosphorus Bombs, Restricted But Not Banned", "description": "Ukraine has accused invading Russian troops of using phosphorus bombs -- incendiary weapons whose use against civilians is banned under an international convention but allowed for military targets.", "url": "https://www.ndtv.com/world-news/phosphorus-bombs-restricted-but-not-banned-2843934", "urlToImage": "https://c.ndtvimg.com/2022-03/k83gj7go_ukraine-war-afp_625x300_22_March_22.jpg", "publishedAt": "2022-03-25T18:10:13Z", "content": "Phosphorus catches fire on contact with air, but not classified as a chemical weapon (Representational)\r\nParis: Ukraine has accused invading Russian troops of using phosphorus bombs -- incendiary wea… [+3318 chars]"}]}