{"status": "ok", "totalResults": 289, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": "Mridusmita Deka", "title": "Maharashtra SSC Result 2022 Live: Class 10 Result Today", "description": "Maharashtra 10th Result 2022: The Maharashtra SSC Class 10 result will be announced today, June 17 for over 16 lakh students. Keep following this blog for latest updates on result time, websites, direct link, pass percentage and toppers.", "url": "https://www.ndtv.com/education/maharashtra-ssc-result-2022-live-updates-msbshse-10th-result-announced-direct-link-mahresult-nic-in-sscresult-mkcl-org", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/6/17/maharashtra-class-10-ssc-result-2022-featured-image.jpg", "publishedAt": "2022-06-17T00:38:17Z", "content": "Maharashtra Board SSC Result 2022: The Maharashtra State Board of Secondary and Higher Secondary Education (MSBSHSE) will declare the Class 10, or SSC, result for the 2022 board exams today, June 17.… [+943 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus Live: India Records Over 12,000 New Covid Cases In 24 Hours", "description": "India reported at least 12,213 new coronavirus cases in the last 24 hours, bringing the country's COVID-19 tally to 4,32,57,730.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-17-june-3074505", "urlToImage": "https://c.ndtvimg.com/2021-12/k11vj84g_coronavirus-india-afp-december_650x400_07_December_21.jpg", "publishedAt": "2022-06-17T00:32:16Z", "content": "India COVID-19 LIVE: The country also reported 11 new Covid related deaths in last 24 hours.\r\nNew Delhi: India reported at least 12,213 new coronavirus cases in the last 24 hours, bringing the countr… [+552 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Relationship With India \"Most Important\" For US, Says White House Adviser", "description": "White House Indo-Pacific adviser Kurt Campbell said that the US has decided to step up its partnership with India as well as to provide New Delhi with the alternatives on security issues.", "url": "https://www.ndtv.com/world-news/relationship-with-india-most-important-for-us-says-white-house-adviser-3074498", "urlToImage": "https://c.ndtvimg.com/2019-04/7eeobneg_india-us-trade-relationsgeneralized-system-of-preferences-reuters_625x300_13_April_19.jpg", "publishedAt": "2022-06-17T00:17:30Z", "content": "The White House adviser said that US has decided to step up its partnership with India.\r\nWashington: At a time of changing world order and security challenges emanating in the wake of the Russia-Ukra… [+4209 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Arnab Mitra", "title": "Maharashtra SSC Result 2022 To Be Announced Today", "description": "SSC Result 2022 Maharashtra Board: The Secondary School Certificate (SSC) exam result 2022 will be announced today at 1 PM. Check SSC result 2022 on the official website- mahresult.nic.in.", "url": "https://www.ndtv.com/education/maharashtra-ssc-result-2022-to-be-announced-today-at-mahresult-nic-in", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/6/17/maha-class-10-result-2022-exam-featured-image.jpg", "publishedAt": "2022-06-17T00:13:53Z", "content": "Maharashtra 10th Result 2022: The students who are waiting long for their Secondary School Certificate (SSC) exam result 2022 should note that the 10th result will be announced on Friday, June 17. Sc… [+1482 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Thailand Inches Closer To Legalising Same-Sex Marriage", "description": "Lawmakers in Thailand on Wednesday passed at first reading four different bills on same-sex unions, moving a step closer towards becoming the second territory in Asia to legalise same-gender marriages.", "url": "https://www.ndtv.com/world-news/thailand-inches-closer-to-legalising-same-sex-marriage-3074476", "urlToImage": "https://c.ndtvimg.com/lgbt_625x300_1530021497513.jpg", "publishedAt": "2022-06-16T23:50:56Z", "content": "So far in Asia, only Taiwan has legalised same-sex unions. (Representational)\r\nBangkok: Lawmakers in Thailand on Wednesday passed at first reading four different bills on same-sex unions, moving a st… [+2187 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Taliban Posters Say Women Without Hijab \"Trying To Look Like Animals\"", "description": "The Taliban's religious police have put up posters across the southern Afghan city of Kandahar saying that Muslim women who do not wear an Islamic hijab that fully covers their bodies are \"trying to look like animals.\"", "url": "https://www.ndtv.com/world-news/taliban-posters-say-women-without-hijab-trying-to-look-like-animals-3074471", "urlToImage": "https://c.ndtvimg.com/2021-09/ev8j2gb_afghan-womenheratreuters_625x300_12_September_21.jpg", "publishedAt": "2022-06-16T23:13:35Z", "content": "Wearing burqa is mandatory for women under the Taliban's first stint in power in Afghanistan.\r\nKabul: The Taliban's religious police have put up posters across the southern Afghan city of Kandahar sa… [+2669 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Trump Unleashed Mob After Vice President Rejected Election Plot: Probe", "description": "Donald Trump pressured his vice president to go along with an illegal plot to overturn the 2020 US election and whipped up a mob that put his deputy's life in danger when he refused, congressional investigators and former administration aides said.", "url": "https://www.ndtv.com/world-news/donald-trump-unleashed-mob-after-vice-president-rejected-election-plot-us-capitol-riots-probe-panel-3074450", "urlToImage": "https://c.ndtvimg.com/2021-01/s3un2hc4_-donald-trump-mike-pence-reuters-650_625x300_12_January_21.jpg", "publishedAt": "2022-06-16T22:51:38Z", "content": "Trump wanted Mike Pence to do something no other vice president has ever done, the panel said. (File)\r\nWashington: Donald Trump pressured his vice president to go along with an illegal plot to overtu… [+4668 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Congress MPs To Meet President Over Police Misbehaviour During Protest", "description": "Congress leaders is likely to meet President Ram Nath Kovind on June 20 on the issue of entry of police into party headquarters and allegedly misbehaving with party MPs during protests against the Enforcement Directorate probe on Rahul Gandhi.", "url": "https://www.ndtv.com/india-news/congress-leaders-to-meet-president-over-police-misbehaviour-during-protest-3074449", "urlToImage": "https://c.ndtvimg.com/2022-06/78a8sr_congress-protest_650x400_13_June_22.jpg", "publishedAt": "2022-06-16T22:25:34Z", "content": "Congress has alleged that its leaders have been manhandled by Delhi Police during protests.\r\nNew Delhi: A delegation of Congress leaders is likely to meet President Ram Nath Kovind on June 20 and sub… [+3191 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Urges Russia \"Humane Treatment\" Of Its Captured Citizens In Ukraine", "description": "The United States on Thursday urged Russia to treat any American volunteers captured while fighting alongside Ukrainian troops as prisoners of war guaranteed humane treatment.", "url": "https://www.ndtv.com/world-news/us-urges-russia-humane-treatment-of-its-captured-citizens-in-ukraine-3074438", "urlToImage": "https://c.ndtvimg.com/2022-06/ikeq20m8_russiaukraine-war-afp_625x300_12_June_22.jpg", "publishedAt": "2022-06-16T21:52:47Z", "content": "The 2 US citizens have gone missing In Ukraine and feared captured by Russia, families said.\r\nWashington: The United States on Thursday urged Russia to treat any American volunteers captured while fi… [+1974 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Court To Decide Today On Jailed Maharashtra MLAs To Vote In Council Polls", "description": "The Bombay High Court on Thursday reserved the order pleas on Maharashtra Minister Nawab Malik and former Maharashtra Home Minister Anil Deshmukh for permission to cast their votes for the MLC polls on June 20.", "url": "https://www.ndtv.com/india-news/bombay-court-to-decide-today-on-jailed-maharashtra-mlas-anil-deshmukh-malik-nawab-to-vote-in-council-polls-3074427", "urlToImage": "https://c.ndtvimg.com/2022-06/2mmnn2kc_nawab-malik-ncp-leader-pti_625x300_10_June_22.jpg", "publishedAt": "2022-06-16T21:39:11Z", "content": "The Bombay High Court will pronounce the order today at 2.30 pm to vote in council polls.\r\nMumbai: The Bombay High Court on Thursday reserved the order pleas on Maharashtra Minister Nawab Malik and f… [+1665 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "White House Refuses To Clarify Joe Biden's Covid Status", "description": "The White House faced intense questioning from reporters Thursday over when Joe Biden last tested negative for Covid-19 following a spate of positive cases among high-ranking officials with access to the president.", "url": "https://www.ndtv.com/world-news/white-house-refuses-to-clarify-joe-bidens-covid-status-3074423", "urlToImage": "https://c.ndtvimg.com/2021-11/0nt9j2e4_jo-biden-afp_625x300_12_November_21.jpg", "publishedAt": "2022-06-16T21:16:27Z", "content": "Questions raised a day after Biden's top medical advisor, Anthony Fauci, tested positive for COVID-19.\r\nWashington: The White House faced intense questioning from reporters Thursday over when Joe Bid… [+1744 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Congress Seeks Action On Officials Over \"Leaks\" In Rahul Gandhi Questioning", "description": "The Congress has sought action against Enforcement Directorate officials who \"selectively leaked\" to some media houses information related to Rahul Gandhi's questioning, as the party also served a legal notice on three Union ministers over the issue.", "url": "https://www.ndtv.com/india-news/national-herald-case-congress-seeks-action-against-officials-over-leaks-in-rahul-gandhi-questioning-3074414", "urlToImage": "https://c.ndtvimg.com/2022-06/h1u9m0a_rahul-gandhi_650x400_14_June_22.jpg", "publishedAt": "2022-06-16T21:02:50Z", "content": "Congress said this is a selective leaks by the ED to malign Rahul Gandhi's image.\r\nNew Delhi: The Congress has sought action against Enforcement Directorate officials who \"selectively leaked\" to some… [+4463 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rahul Gandhi Visits Ailing Mother Sonia At Delhi Hospital", "description": "Congress leader Rahul Gandhi on Thursday night reached Sir Ganga Ram Hospital in Delhi where her mother and party interim president Sonia Gandhi is admitted due to COVID-related issues since June 12.", "url": "https://www.ndtv.com/india-news/rahul-gandhi-visits-ailing-mother-sonia-at-delhi-sir-ganga-ram-hospital-3074407", "urlToImage": "https://c.ndtvimg.com/2019-05/2stvdh58_rahul-gandhi-sonia-gandhi-pti_650x400_27_May_19.jpg", "publishedAt": "2022-06-16T20:47:52Z", "content": "Rahul Gandhi will stay at the hospital to look after his ailing mother Sonia Gandhi. (File)\r\nNew Delhi: Congress leader Rahul Gandhi on Thursday night reached Sir Ganga Ram Hospital in Delhi where he… [+3801 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Agnipath Row: AAP Says PM Modi \"Betrayed\" Country's Youth", "description": "The AAP on Thursday alleged that Prime Minister Narendra Modi has \"betrayed\" the country's youth with the announcement of 'Agnipath' scheme for recruitment into the armed forces, and demanded that the decision be withdrawn.", "url": "https://www.ndtv.com/india-news/agnipath-row-aap-says-pm-modi-betrayed-countrys-youth-3074371", "urlToImage": "https://c.ndtvimg.com/2020-09/vd9grjfc_aap-leader-sanjay-singh-pti_625x300_19_September_20.jpg", "publishedAt": "2022-06-16T20:22:00Z", "content": "Agnipath Row: AAP's Sanjay Singh urged youth to raise their voice against the Centre's decision.\r\nNew Delhi: The AAP on Thursday alleged that Prime Minister Narendra Modi has \"betrayed\" the country's… [+3517 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Elon Musk Says He Wants One Billion Users On Twitter", "description": "Elon Musk pitched a vision Thursday to Twitter staff of a one-billion-user platform, but was hazy on potential layoffs, free speech limits and what's next in his chaotic buyout bid.", "url": "https://www.ndtv.com/world-news/elon-musk-says-he-wants-one-billion-users-on-twitter-3074359", "urlToImage": "https://c.ndtvimg.com/2022-06/i2dfddv_elon-musk-reuters_625x300_03_June_22.jpg", "publishedAt": "2022-06-16T19:53:03Z", "content": "Elon Musk told Twitter employees he personally favors moderate political positions.\r\nSan Francisco: Elon Musk pitched a vision Thursday to Twitter staff of a one-billion-user platform, but was hazy o… [+3453 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Two Hizbul Terrorists Killed In Anantnag Encounter In Jammu And Kashmir", "description": "Two terrorists of the proscribed terror outfit Hizb-ul-Mujahideen (HM) were killed during the encounter with security forces in the Anantnag district of Jammu and Kashmir on Thursday, said police.", "url": "https://www.ndtv.com/india-news/two-hizbul-terrorists-killed-in-anantnag-encounter-in-jammu-and-kashmir-3074336", "urlToImage": "https://c.ndtvimg.com/2019-03/d5srpipo_jammu-kashmir-encounter-_625x300_30_March_19.jpg", "publishedAt": "2022-06-16T19:24:17Z", "content": "Police said one of the killed terrorists was involved in killing of BJP's Sarpanch Ghulam Rasool Dar.\r\nAnantnag: Two terrorists of the proscribed terror outfit Hizb-ul-Mujahideen (HM) were killed dur… [+1937 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Fans of Frogs...\": Putin Aide Snubs European Leaders' Kyiv Visit", "description": "In a show of support to Ukraine following its invasion by Russia, the leaders of France, Germany and Italy met President Volodymyr Zelensky on Thursday.", "url": "https://www.ndtv.com/world-news/the-clock-s-ticking-dmitry-medvedev-s-tweet-as-germany-italy-and-france-leaders-reach-ukraine-3072976", "urlToImage": "https://c.ndtvimg.com/2022-06/lh6qaomo_macron-zelensky-ukraine-afp-_120x90_17_June_22.jpg?im=FeatureCrop,algorithm=dnn,width=650,height=400", "publishedAt": "2022-06-16T18:54:18Z", "content": "European leaders' Kyiv visit was deemed as an empty gesture by DmitryA. Medvedev.\r\nIn a show of support to Ukraine following its invasion by Russia, the leaders of France, Germany and Italy met Presi… [+2052 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Another Great Day On Heart Of Stone,\" Writes Alia Bhatt", "description": "\"So so so happy with all the love for our d Brahmastra,\" wrote Alia Bhatt", "url": "https://www.ndtv.com/entertainment/another-great-day-on-heart-of-stone-writes-alia-bhatt-as-she-shares-a-sunkissed-selfie-3074286", "urlToImage": "https://c.ndtvimg.com/2022-06/b65l5c8o_alia_625x300_17_June_22.jpg", "publishedAt": "2022-06-16T18:43:05Z", "content": "Alia Bhatt looks gorgeous. (courtesy: aliaabhatt)\r\nNew Delhi: Alia Bhatt, who is shooting for her Hollywood debut Heart of Stone, has shared a post on her Instagram stories, thanking her fans for the… [+1634 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Terror Funding Case: Anti Terror Agency Conducts Searches In Kashmir", "description": "The National Investigation Agency (NIA) on Thursday carried out searches at six locations in Kashmir in connection with a terror funding case involving the Jamaat-e-Islami (JeI), an official said.", "url": "https://www.ndtv.com/india-news/jamaat-e-islami-terror-funding-case-national-investigation-agency-conducts-searches-in-kashmir-3074271", "urlToImage": "https://c.ndtvimg.com/2018-12/9cmll0r_nia-generic-650_625x300_27_December_18.jpg", "publishedAt": "2022-06-16T18:34:40Z", "content": "In 2019, the Centre had banned Jamaat-e-Islami (Jel). (Representational)\r\nSrinagar: The National Investigation Agency (NIA) on Thursday carried out searches at six locations in Kashmir in connection … [+1943 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "On Camera, Great Indian Hornbill Bird Tortured, Killed In Nagaland", "description": "An endangered Great Indian Hornbill was seen being beaten with sticks with a man stamping on its neck, in an extremely distressing video from Nagaland.", "url": "https://www.ndtv.com/india-news/in-distressing-video-great-indian-hornbill-tortured-killed-in-nagaland-3074212", "urlToImage": "https://c.ndtvimg.com/2022-06/kb7r7vp_horbill-torture-650_625x300_16_June_22.jpg", "publishedAt": "2022-06-16T18:22:28Z", "content": "The hornbill's video was shared on Twitter by People for Animals in India.\r\nAn endangered Great Indian Hornbill was seen being beaten with sticks with a man stamping on its neck, in an extremely dist… [+2193 chars]"}]}