{"status": "ok", "totalResults": 331, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Rajya Sabha Election LIVE: Polls To 57 Upper House Seats Today", "description": "Rajysa Sabha Elections 2022: The Rajya Sabha election will be held today to fill the 57 seats across the 15 states. The polls will be held for six seats from Maharashtra, two from Haryana and five each from Rajasthan and Karnataka.", "url": "https://www.ndtv.com/india-news/2022-rajya-sabha-election-live-news-updates-elections-to-57-upper-house-seats-today-3054358", "urlToImage": "https://c.ndtvimg.com/2022-02/oa80d25g_rajya-sabha-pti_625x300_10_February_22.jpg", "publishedAt": "2022-06-10T00:28:21Z", "content": "Rajya Sabha Election Updates: 41 candidates have already been elected unopposed.\r\nNew Delhi: Rajysa Sabha Elections 2022: The Rajya Sabha election will be held today to fill the 57 seats across the 1… [+963 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Capitol Riot Panel Warns Conspiracy Behind Violence \"Not Over\"", "description": "The conspiracy that drove a mob to attack the US Capitol in January 2021 still poses a threat to American democracy, the head of the congressional committee tasked with investigating the deadly riot will warn at the panel's first public hearing.", "url": "https://www.ndtv.com/world-news/us-capitol-riot-panel-warns-conspiracy-behind-violence-not-over-3054348", "urlToImage": "https://c.ndtvimg.com/2021-01/ka676kk8_us-capitol-attack_625x300_07_January_21.jpg", "publishedAt": "2022-06-09T23:35:23Z", "content": "Thousands of Trump supporters stormed the US Capitol on 6 January in a bid to overturn election result.\r\nWashington: The conspiracy that drove a mob to attack the US Capitol in January 2021 still pos… [+5611 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "3 People Killed In Shooting At Maryland Manufacturing Plant In US: Police", "description": "Three people have been killed in a mass shooting incident at a manufacturing plant in Maryland town of Smithsburg on Thursday,local US media said.", "url": "https://www.ndtv.com/world-news/3-people-killed-in-shooting-at-maryland-manufacturing-plant-in-us-police-3054340", "urlToImage": "https://c.ndtvimg.com/2018-09/hms9qqjc_us-police-generic_625x300_14_September_18.jpg", "publishedAt": "2022-06-09T23:13:35Z", "content": "Police said the shooting took place at the Columbia Machine in Smithsburg, Maryland. (Representational)\r\nMaryland: Three people have been killed in a mass shooting incident at a manufacturing plant i… [+2092 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Pak Police Open Investigation Into Politician Aamir Liaquat's Death", "description": "Pakistani police are investigating the circumstances surrounding the sudden death of a prominent televangelist-turned-politician on Thursday.", "url": "https://www.ndtv.com/world-news/pak-police-open-investigation-into-politician-aamir-liaquats-death-3054336", "urlToImage": "https://c.ndtvimg.com/2022-06/2ccpghvc_amir-liaquat_625x300_09_June_22.jpg", "publishedAt": "2022-06-09T23:01:10Z", "content": "Aamir Liaquat Hussain was found motionless at his house in Karachi by one his employees on Thursday.\r\nKarachi:  Pakistani police are investigating the circumstances surrounding the sudden death of a … [+860 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Fire Breaks Out At Crockery Factory In Delhi, No Casualties", "description": "A fire broke out in a carpet and crockery factory's godown in Delhi's Hamidpur area on Thursday evening.", "url": "https://www.ndtv.com/india-news/fire-breaks-out-at-crockery-factory-in-delhis-hamidpur-3054330", "urlToImage": "https://i.ndtvimg.com/i/2017-07/fire-generic-istock_650x400_51500191995.jpg", "publishedAt": "2022-06-09T22:36:09Z", "content": "Delhi Fire: As many as 23 fire tenders were rushed to the spot to douse the fire. (Representational)\r\nNew Delhi: A fire broke out in a carpet and crockery factory's godown in Delhi's Hamidpur area on… [+2258 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "BJP Would Have Won West Bengal Polls, But...: JP Nadda", "description": "A year after the party's defeat in the high-octane West Bengal Assembly polls, BJP president J P Nadda on Thursday claimed that the party would have come to power had the devastating second wave of Covid not affected the campaigning.", "url": "https://www.ndtv.com/india-news/bjp-would-have-won-west-bengal-polls-but-covid-played-spoilsport-jp-nadda-3054325", "urlToImage": "https://c.ndtvimg.com/2022-06/2sn16mvg_jp-nadda_625x300_09_June_22.jpg", "publishedAt": "2022-06-09T22:17:35Z", "content": "JP Nadda said that we will have to continue our fight democratically and defeat the TMC.\r\nKolkata: A year after the party's defeat in the high-octane West Bengal Assembly polls, BJP president J P Nad… [+4047 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "China Says It Does Not Want To See Another North Korean Nuclear Test", "description": "China's U.N. envoy said on Thursday that Beijing does not want to see North Korea carry out a new nuclear test, which is partly why China vetoed a U.S.-led bid to impose new U.N. sanctions on Pyongyang over renewed ballistic missiles launches.", "url": "https://www.ndtv.com/world-news/china-says-it-does-not-want-to-see-another-north-korean-nuclear-test-3054324", "urlToImage": "https://c.ndtvimg.com/2022-05/efkeqoc4_north-korea-missilereuters_625x300_18_May_22.jpg", "publishedAt": "2022-06-09T22:05:58Z", "content": "North Korea launched dozens of missile this year, including intercontinental ballistic missiles.\r\nUnited Nations: China's U.N. envoy said on Thursday that Beijing does not want to see North Korea car… [+2911 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rajya Sabha Polls: Internet Suspended In Jaipur's Amer Area Amid Poaching Fears", "description": "Rajasthan Congress MLAs were moved from Udaipur to Jaipur ahead of the voting for the Rajya Sabha elections that are slated to be held on Friday and party leaders are hoping to secure three seats in the Upper House of the parliament.", "url": "https://www.ndtv.com/india-news/internet-suspended-in-jaipurs-amer-area-ahead-of-rajya-sabha-polls-3054315", "urlToImage": "https://c.ndtvimg.com/2020-01/ifm6g8vs_mobile-generic-istock-650_625x300_31_January_20.jpg", "publishedAt": "2022-06-09T21:05:28Z", "content": "CM Ashok Gehlot reiterated the confidence and negated any chance of cross-voting. (Representational)\r\nJaipur: Fearing poaching of legislators ahead of the Rajya Sabha elections, the Rajasthan governm… [+2047 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Kerala Woman Suffers Injuries After Being Hacked With Sharp Weapon: Police", "description": "A woman in her twenties suffered serious injuries after she was hacked with a sharp weapon by a man in Nadapuram area of Kozhikode district of Kerala on Thursday and her health condition is still critical, police said.", "url": "https://www.ndtv.com/india-news/kerala-woman-suffers-injuries-after-being-hacked-with-sharp-weapon-police-3054310", "urlToImage": "https://i.ndtvimg.com/i/2017-03/police-generic_650x400_51490324353.jpg", "publishedAt": "2022-06-09T20:45:57Z", "content": "The victim's health condition is critical and she is on a ventilator, police said. (Representational)\r\nKozhikode, Kerala: A woman in her twenties suffered serious injuries after she was hacked with a… [+1264 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine War Implications Will Lead To Hunger Crisis, Warns S Jaishankar", "description": "The Russia-Ukraine war has thrown up a crisis of fuel, food and fertiliser that will lead to hunger situations and have a very significant inflationary impact, External Affairs Minister S Jaishankar said on Thursday.", "url": "https://www.ndtv.com/india-news/ukraine-war-implications-will-lead-to-hunger-crisis-warns-s-jaishankar-3054307", "urlToImage": "https://c.ndtvimg.com/2022-04/58h2h1go_s-jaishankar-pti_625x300_13_April_22.jpg", "publishedAt": "2022-06-09T20:34:45Z", "content": "The prices of these fuel and food have gone up because of Ukraine war, S Jaishankar said.\r\nBengaluru: The Russia-Ukraine war has thrown up a crisis of fuel, food and fertiliser that will lead to hung… [+3693 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Mridusmita Deka", "title": "West Bengal Class 12 HS Result To Be Announced Today", "description": "WB Class 12 Result 2022: The West Bengal HS result 2022 will be declared through a press conference, and later it will be released on the WBCHSE result website -- wbresults.nic.in.", "url": "https://www.ndtv.com/education/wbchse-west-bengal-class-12-hs-result-2022-today-wbresults-nic-in", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/6/9/wb-12th-2022-result-featured-image.jpg", "publishedAt": "2022-06-09T20:33:18Z", "content": "New Delhi:The West Bengal Council of Higher Secondary Education (WBCHSE) will announce the HS, or Class 12, or Uccha Madhyamik, exam result today, June 10. The WB Class 12 result 2022 can be download… [+1829 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Mridusmita Deka", "title": "Meghalaya Board Class 10, 12 Arts Results For MBOSE 2022 Exams Today", "description": "MBOSE 2022 Results: Confirming the MBOSE 2022 result Class 10, 12 Arts date and time, the board in a statement said that the Meghalaya results will be declared during office hours on June 10.", "url": "https://www.ndtv.com/education/meghalaya-board-class-10-sslc-12-hsslc-arts-results-2022-today-mbose-in-megresults-nic-in", "urlToImage": "https://cache.careers360.mobi/media/presets/625X400/article_images/2022/6/9/mbose-sslc-hsslc-result-2022-featured-image.jpg", "publishedAt": "2022-06-09T20:10:03Z", "content": "New Delhi:The Meghalaya Board of School Education (MBOSE) will announce the Class 10 and Class 12 Arts stream results today, June 10. Confirming the MBOSE 2022 result Class 10, 12 Arts date and time,… [+1747 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Putin Calls Himself A Modern \"Peter The Great\" Amid Ukraine War", "description": "Russian President Vladimir Putin on Thursday compared his current actions to Peter the Great's conquest of the Baltic coast during his 18th-century war against Sweden.", "url": "https://www.ndtv.com/world-news/russia-president-vladimir-putin-calls-himself-a-modern-peter-the-great-amid-ukraine-war-3054277", "urlToImage": "https://c.ndtvimg.com/2019-06/vuqpioto_vladimir-putin-reuters_625x300_29_June_19.jpg", "publishedAt": "2022-06-09T19:58:01Z", "content": "Ukraine war: Putin compares his actions to Peter the Great's invasion at start of Great Northern War.\r\nMoscow: Russian President Vladimir Putin on Thursday compared his current actions to Peter the G… [+1735 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine's Zelensky Imposes Sanctions On Putin, Other Russian Leaders", "description": "Volodymyr Zelensky signed a decree enacting the decision of the National Security and Defense Council of Ukraine on the application of personal sanctions against Russian President Vladimir Putin.", "url": "https://www.ndtv.com/world-news/ukraine-president-volodymyr-zelensky-imposes-sanctions-on-russia-president-vladimir-putin-other-russian-leaders-3054259", "urlToImage": "https://c.ndtvimg.com/2022-05/dh4ebmoo_vladimir-putin-reuters_625x300_15_May_22.jpg", "publishedAt": "2022-06-09T19:30:14Z", "content": "Ukraine imposed sanctions on President Vladimir Putin as Russia intensifies attack in East.\r\nKyiv: Volodymyr Zelensky signed a decree enacting the decision of the National Security and Defense Counci… [+655 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Kyiv In \"No Danger\" But Prepared For Russian Attacks: Ukraine Minister", "description": "Ukraine's interior minister said Thursday there was no imminent risk of Russians marching on Kyiv, more than 100 days after Russia invaded, but the capital would not let its guard down.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-kyiv-in-no-danger-but-prepared-for-russian-attack-ukraine-minister-3054248", "urlToImage": "https://c.ndtvimg.com/2022-04/oi3hocag_kyiv-attack-ukraine-war-afp-650_625x300_29_April_22.jpg", "publishedAt": "2022-06-09T19:11:58Z", "content": "Ukraine War: Ukrainian minister said that Any place in Ukraine can be a target for rocket fire.\r\nKyiv: Ukraine's interior minister said Thursday there was no imminent risk of Russians marching on Kyi… [+1750 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Karti Chidambaram's Aide Gets Bail In Bribe For Visa Case", "description": "A court in Delhi has granted bail to Congress's Karti Chidambaram aide in the alleged \"bribe for visa case\" after 24 days in custody.", "url": "https://www.ndtv.com/india-news/karti-chidambarams-aide-gets-bail-in-bribe-for-visa-case-3054227", "urlToImage": "https://c.ndtvimg.com/2022-05/87440d1_karti-chidambaram_625x300_26_May_22.jpg", "publishedAt": "2022-06-09T18:50:17Z", "content": "New Delhi: A court in Delhi has granted bail to Congress's Karti Chidambaram aide in the alleged \"bribe for visa case\" after 24 days in custody. Noting that the \"investigating agency has tried to pla… [+1333 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Amid Relationship Rumours, Sonakshi Sinha Shares Pic With Zaheer Iqbal", "description": "\"Its #NationalBestFriendDay! Lol cant believe these clowns have a day dedicated to them,\" wrote Sonakshi Sinha", "url": "https://www.ndtv.com/entertainment/amid-relationship-rumours-sonakshi-sinha-shares-pic-with-zaheer-iqbal-3054226", "urlToImage": "https://c.ndtvimg.com/2022-06/s728nug_sonakshi_625x300_10_June_22.jpg", "publishedAt": "2022-06-09T18:49:56Z", "content": "Sonakshi Sinha posing with Zaheer Iqbal. (courtesy: aslisona)\r\nSonakshi Sinha and Zaheer Iqbal were recently in the news after Zaheer shared a belated birthday post for her on his Instagram handle an… [+1746 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Would-Be 'Mystic Mercenaries' Go On Trial In Germany", "description": "Two former German soldiers went on trial on Thursday for trying to form a paramilitary group to fight in Yemen's civil war after being inspired by a psychic.", "url": "https://www.ndtv.com/world-news/achim-allweyer-arend-adolf-graess-would-be-mystic-mercenaries-go-on-trial-in-germany-3054214", "urlToImage": "https://c.ndtvimg.com/2022-02/nkng42q_german-army-generic-afp-650_625x300_27_February_22.jpg", "publishedAt": "2022-06-09T18:41:47Z", "content": "Achim Allweyer and Arend-Adolf Graess were arrested by special forces in October.(Representational))\r\nStuttgart: Two former German soldiers went on trial on Thursday for trying to form a paramilitary… [+2910 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "IIT Delhi-Incubated Startup On Road To Making \"Safest\" Electric Scooter", "description": "An electric vehicle start-up incubated by the Indian Institute of Technology in Delhi is doing deep research on making safer electric two-wheelers, which the company plans to roll out once their testing is complete.", "url": "https://www.ndtv.com/india-news/iit-delhi-incubated-startup-creatara-mobility-on-road-to-making-safest-electric-scooter-3054204", "urlToImage": "https://c.ndtvimg.com/2022-06/a0riegag_creatara-mobility_625x300_09_June_22.jpg", "publishedAt": "2022-06-09T18:31:12Z", "content": "IIT Delhi-incubated Creatara Mobility plans to make \"world's safest\" electric scooter\r\nNew Delhi: An electric vehicle start-up incubated by the Indian Institute of Technology in Delhi is doing deep r… [+2689 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Beijing Gives Initial Nod To Revive Ant IPO After Crackdown Cools: Report", "description": "China's central leadership has given billionaire Jack Ma's Ant Group a tentative green light to revive its initial public offering (IPO), two sources with knowledge of the matter said.", "url": "https://www.ndtv.com/world-news/jack-ma-alibaba-group-beijing-gives-initial-nod-to-revive-ant-ipo-after-crackdown-cools-says-reports-3054186", "urlToImage": "https://c.ndtvimg.com/2022-06/g30uj1hg_ant-ipo_625x300_09_June_22.jpg", "publishedAt": "2022-06-09T18:21:25Z", "content": "A revival of the IPO may also mark a rehabilitation of sorts for Jack Ma.\r\nHong Kong:  China's central leadership has given billionaire Jack Ma's Ant Group a tentative green light to revive its initi… [+5187 chars]"}]}