{"status": "ok", "totalResults": 424, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Mo Farah Relieved At UK Government Support After Shock Revelation", "description": "Olympic great Mo Farah expressed relief Wednesday after receiving fulsome backing from the UK government despite his admission that he was illegally trafficked into Britain as a child", "url": "https://sports.ndtv.com/athletics/mo-farah-relieved-at-uk-government-support-after-shock-revelation-3153838", "urlToImage": "https://c.ndtvimg.com/2022-07/qsmkuidg_mo-farah-afp_625x300_13_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-13T10:30:24Z", "content": "Olympic great Mo Farah expressed relief Wednesday after receiving fulsome backing from the UK government despite his admission that he was illegally trafficked into Britain as a child. The revelation… [+2531 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Give Rs 950 Crore Bank Guarantee To Operate Frozen Accounts, Vivo Told", "description": "The Delhi High Court Wednesday allowed Chinese smartphone maker Vivo to operate its various bank accounts frozen by the Enforcement Directorate in connection with a money-laundering probe subject to furnishing of a bank guarantee of Rs 950 crore within a week…", "url": "https://www.ndtv.com/business/give-rs-950-crore-bank-guarantee-to-operate-frozen-accounts-vivo-told-3153761", "urlToImage": "https://c.ndtvimg.com/2022-07/jf37nbj8_vivo_625x300_13_July_22.jpg", "publishedAt": "2022-07-13T10:28:03Z", "content": "The court also asked Vivo to maintain a balance of Rs 251 crore in the bank accounts.\r\nNew Delhi: The Delhi High Court Wednesday allowed Chinese smartphone maker Vivo to operate its various bank acco… [+4768 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "7 Healthy South Indian Breakfast Recipes That Will Make Your Mornings Better", "description": "South Indian food is comforting to have and good for any day. Plus, you don't always use the traditional rice batter for cooking south Indian food.", "url": "https://food.ndtv.com/food-drinks/7-healthy-south-indian-breakfast-recipes-that-will-make-your-mornings-better-3153821", "urlToImage": "https://c.ndtvimg.com/2022-07/knc9vae_idli_625x300_08_July_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-13T10:25:28Z", "content": "What does your breakfast look like? Is it the daily bread smeared with jam and butter, or maybe paratha or poha? And sometimes, if you feel like having more, you could indulge in bedmi poori, dosa sa… [+2273 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Pakistan Play Warm-Up Match In Emergency-Hit Sri Lanka Ahead Of Tests", "description": "Pakistan had scored 301/9 in the first innings riding on an impressive 88 from skipper Babar Azam. SLC XI responded with a total of 375/8.", "url": "https://sports.ndtv.com/cricket/pakistan-play-warm-up-match-in-emergency-hit-sri-lanka-ahead-of-tests-3153791", "urlToImage": "https://c.ndtvimg.com/2022-07/2mhkt94g_pak-warm-up-vs-slc_625x300_13_July_22.jpg", "publishedAt": "2022-07-13T10:21:23Z", "content": "The touring Pakistan cricket team is currently involved in a warm-up match with the Sri Lanka Cricket XI at the Colts Cricket Club Ground in Colombo. The final day of the match is being played in the… [+2242 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Adarsh Srivastava", "title": "ICAI Result 2022 Release Date, Time; Official Website To Check", "description": "The Institute of Chartered Accountants of India (ICAI) will announce the CA Final result 2022 for the May 2022 session either on July 15 or July 16.", "url": "https://www.ndtv.com/education/icai-result-2022-release-date-time-official-website-check-ca-final-result", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/13/ICAI-Final-Result-2022-Date-Time.jpg", "publishedAt": "2022-07-13T10:21:21Z", "content": "New Delhi:CA Final Result 2022: The Institute of Chartered Accountants of India (ICAI) will announce the CA Final result 2022 for the May 2022 session either on July 15 or July 16. Candidates who too… [+1954 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Emmanuel Macron's Government Suffers First Defeat In French Parliament", "description": "France's government has suffered its first defeat in parliament after President Emmanuel Macron's ruling party lost its majority in elections last month.", "url": "https://www.ndtv.com/world-news/emmanuel-macrons-government-suffers-first-defeat-in-french-parliament-3153784", "urlToImage": "https://c.ndtvimg.com/2022-06/vc3059t4_macron-afp_625x300_04_June_22.jpg", "publishedAt": "2022-07-13T10:20:34Z", "content": "President Emmanuel Macron's ruling party lost its majority in elections last month. (File)\r\nParis: France's government has suffered its first defeat in parliament after President Emmanuel Macron's ru… [+1861 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "SA Forfeit Australia Series To Ensure Player Availability For T20 League", "description": "Cricket South Africa (CSA) withdrew from a scheduled three-match World Cup Super League series in Australia in January in order to have their best players available for a domestic Twenty20 league.", "url": "https://sports.ndtv.com/cricket/south-africa-forfeit-australia-series-to-ensure-player-availability-for-t20-league-3153773", "urlToImage": "https://c.ndtvimg.com/2022-06/pclh2f9g_south-africa-bcci_625x300_11_June_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-13T10:18:15Z", "content": "South Africa's quest to achieve automatic qualification for the 2023 Cricket World Cup became more difficult on Wednesday when the country's board agreed to forfeit a series against Australia. Cricke… [+3107 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Video: Sea Lion Attacks Girl, Internet Slams \"Content Hungry\" Parents", "description": "Any animal can sometimes be unpredictable. Domesticated or not, animals can act out when you least expect it. Case in point, a video of a sea lion almost attacking a child has surfaced online.", "url": "https://www.ndtv.com/offbeat/video-sea-lion-almost-attacks-little-girl-internet-slams-content-hungry-parents-3153766", "urlToImage": "https://c.ndtvimg.com/2022-07/3lfcdoi8_sea-lion-attack-girl_625x300_13_July_22.jpg", "publishedAt": "2022-07-13T10:16:18Z", "content": "The video has racked up more than 20,600 upvotes and over 12,000 comments.\r\nAny animal can sometimes be unpredictable. Domesticated or not, animals can act out when you least expect it. Case in point… [+1835 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sri Lanka PM Instructs Military And Police \"To Restore Order\"", "description": "Sri Lanka Crisis: The Prime Minister of Sri Lanka has instructed the Military and the Police in a televised address \"to do whatever necessary to restore order\" in Sri Lanka.", "url": "https://www.ndtv.com/world-news/sri-lankan-pm-ranil-wickremesinghe-instructs-military-and-police-to-restore-order-3153755", "urlToImage": "https://c.ndtvimg.com/2022-06/a8ou5sgo_sri-lanka-pm-reuters_625x300_07_June_22.jpg", "publishedAt": "2022-07-13T10:14:06Z", "content": "Sri Lanka Prime Minister said \"we can't allow fascists to take over\". (File)\r\nColombo: Sri Lanka's Prime Minister Ranil Wickremesinghe instructed the military and police \"to do what is necessary to r… [+353 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Indian Couple With 45 Pistols Arrested At Delhi Airport", "description": "Two Indian nationals carrying 45 pistols were arrested by customs officials at the Indira Gandhi International Airport in New Delhi on Wednesday.", "url": "https://www.ndtv.com/india-news/indian-couple-with-45-pistols-arrested-at-delhi-airport-3153747", "urlToImage": "https://c.ndtvimg.com/2022-07/ho7t48g8_delhi-customs-pistol_625x300_13_July_22.jpg", "publishedAt": "2022-07-13T10:11:38Z", "content": "The total cost of the guns is believed to be around Rs 22,50,000.\r\nNew Delhi: Two Indian nationals carrying 45 pistols were arrested by customs officials at the Indira Gandhi International Airport in… [+834 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Video: Moment When Thousands Of Protesters Entered Lankan PM Office", "description": "As protests intensified in the Sri Lankan capital city of Colombo, protestors who had gathered outside Sri Lanka PM's office have taken over his residence at Flower Road here.", "url": "https://www.ndtv.com/world-news/video-moment-when-thousands-of-protesters-entered-lankan-pm-ranil-wickremesinghe-office-3153743", "urlToImage": "https://c.ndtvimg.com/2022-07/ikrc71k8_sri-lanka-pm-protesters_625x300_13_July_22.jpg", "publishedAt": "2022-07-13T10:10:12Z", "content": "Sri Lanka is in deep trouble following its worst ever economic crisis (AFP)\r\nColombo: As protests intensified in the Sri Lankan capital city of Colombo, protestors who had gathered outside Sri Lanka … [+2337 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rupee Ends At Another New Record Low Of 79.63 On Rampant Dollar", "description": "The rupee's collapse marched slightly ahead as investors waited with bated breath for the key US inflation data, which is predicted to show price pressures surged to a 40-year peak and further boost a rampant dollar.", "url": "https://www.ndtv.com/business/rupee-today-3153557", "urlToImage": "https://c.ndtvimg.com/2022-07/b0voo4i_image_625x300_13_July_22.jpg", "publishedAt": "2022-07-13T10:06:17Z", "content": "Rupee falls to yet another record low close of 79.63\r\nThe rupee's collapse marched slightly ahead, marking the third straight session of record weak levels. as investors waited with bated breath for … [+1470 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sensex, Nifty Reverse Early Gains As Oil Prices Rebound", "description": "Indian equity benchmarks on Wednesday extended their fall for the third straight session, dragged by index heavyweights Reliance Industries, Tata Consultancy Services and HDFC twins (HDFC and HDFC Bank).", "url": "https://www.ndtv.com/business/stock-market-india-sensex-reverses-early-gains-falls-372-points-as-oil-prices-rebound-nifty-settles-below-16-000-3153714", "urlToImage": "https://c.ndtvimg.com/2022-01/7s3vka2o_sensex_625x300_25_January_22.jpg", "publishedAt": "2022-07-13T10:04:19Z", "content": "Sensex and Nifty settled on a lower note today.\r\nNew Delhi: Indian equity benchmarks on Wednesday extended their fall for the third straight session, dragged by index heavyweights Reliance Industries… [+2275 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sri Lanka: 5 Basic Facts About Country Hit By Crisis", "description": "Sri Lanka is hit by a crisis, with its economy crumbling under the weight of massive foreign debt and steep inflation. President Gotabaya Rajpaksa has fled and Prime Minister Ranil Wickremesinghe has imposed an emergency.", "url": "https://www.ndtv.com/world-news/sri-lanka-5-basic-facts-about-country-hit-by-crisis-3153700", "urlToImage": "https://c.ndtvimg.com/2022-07/gvv4ktig_sri-lanka-basic-facts-afp-650_625x300_13_July_22.jpg", "publishedAt": "2022-07-13T10:02:10Z", "content": "<li>The island nation lies in the Indian Ocean off southern India. It is separated from the Indian subcontinent by the Gulf of Mannar and Palk Strait. Sri Lanka won independence from the British in 1… [+1303 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sri Lanka Crisis: Explained In 5 Points", "description": "Sri Lanka has declared a state of emergency after the crisis-hit nation's president fled to the Maldives, with protesters also demanding the prime minister quit.", "url": "https://www.ndtv.com/world-news/sri-lanka-crisis-explained-in-5-points-3153672", "urlToImage": "https://c.ndtvimg.com/2022-07/3o971p9_sri-lanka-protest-afp-650_625x300_13_July_22.jpg", "publishedAt": "2022-07-13T09:54:57Z", "content": "Sri Lanka crisis: President Rajapaksa fled Sri Lanka on Wednesday for the Maldives.\r\nColombo: Sri Lanka has declared a state of emergency after the crisis-hit nation's president fled to the Maldives,… [+3418 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sleepover In Kebab Heaven? All About UK Restaurant's Unique Staycation", "description": "A UK-based restaurant is offering a staycation in a kebab-themed house. Here are all the lip-smacking details of this unique travel experience!", "url": "https://food.ndtv.com/news/sleepover-in-kebab-heaven-all-about-uk-restaurants-unique-staycation-3153662", "urlToImage": "https://c.ndtvimg.com/2022-07/ccqafrkg_kebab-house-uk_625x300_13_July_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-13T09:52:57Z", "content": "Flavourful and succulent, kebabs make for a luscious addition to any meal. Whether it's galouti kebab or seekh, doner or even boti kebab - there are so many delicious options out there to choose from… [+2117 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Ashwin Suggests Radical Change In LBW Rule When Batters Play This Shot", "description": "\"Let batters play the switch hit, but give us LBW when they miss,\" Ravichandran Ashwin said while advocating a change in the rules.", "url": "https://sports.ndtv.com/cricket/ravichandran-ashwin-suggests-radical-change-in-lbw-rule-when-batters-play-this-shot-3153643", "urlToImage": "https://c.ndtvimg.com/2022-03/akdts12o_ravichandran-ashwin-afp_625x300_01_March_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-13T09:45:44Z", "content": "Ace India off-spinner Ravichandran Ashwin feels that the batters should be adjudged leg before wicket even if the ball is pitched outside leg stump if they miss out on an attempted switch hit. As per… [+2122 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Plea Filed Before Delhi High Court To Postpone NEET-UG", "description": "The petitioners, who seek to set aside the entrance test scheduled for undergraduate medical and dental courses, said that a fresh notification rescheduling the NEET UG examination date should be issued by the authorities after addressing their grievances.", "url": "https://www.ndtv.com/education/plea-filed-before-delhi-high-court-to-postpone-neet-ug", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/13/neet.jpg", "publishedAt": "2022-07-13T09:41:49Z", "content": "New Delhi:Several National Eligibility cum Entrance Test- Undergraduate (NEET-UG) aspirants Wednesday approached the Delhi High Court seeking direction to the authorities to postpone the competitive … [+2302 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sorry Shahid But Mira Won This Round. Not That We Are Keeping Score", "description": "\"He thinks he's very funny,\" Mira Rajput wrote", "url": "https://www.ndtv.com/entertainment/sorry-shahid-kapoor-but-mira-rajput-clearly-won-this-round-not-that-we-are-keeping-score-3153590", "urlToImage": "https://c.ndtvimg.com/2022-07/jtb1t1do_mira-rajput_625x300_13_July_22.jpg", "publishedAt": "2022-07-13T09:33:43Z", "content": "Mira Rajput with Shahid Kapoor. (courtesy: mira.kapoor)\r\nNew Delhi: Mira Rajput had the perfect comeback for Shahid Kapoor's ROFL Instagram stories. A couple of days ago, Shahid posted a video in whi… [+1792 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sri Lanka Crisis: 5 Points On Current Situation, Efforts To Mitigate It", "description": "Sri Lanka's President Gotabaya Rajapaksa fled to Maldives on Wednesday, hours before he was supposed to step down. Prime Minister Ranil Wickremesinghe has declared a state of emergency in the country.", "url": "https://www.ndtv.com/world-news/sri-lanka-crisis-5-points-on-current-situation-and-efforts-to-mitigate-it-3153580", "urlToImage": "https://c.ndtvimg.com/2022-07/e5io434o_sri-lanka-protesters-afp-650_625x300_13_July_22.jpg", "publishedAt": "2022-07-13T09:30:38Z", "content": "<li>The island nation has witnessed months of protests over soaring prices and lack of food and fuel. Sri Lanka's foreign reserves have virtually run dry, which means it doesn't have money to buy foo… [+1170 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Blog: \"Was Tear-Gassed, (Lankan) Protesters Helped Me Breathe\": Reporter's Blog", "description": "July 13 - it was a big day for the people here. They expected that President Gotabaya Rajapaksa would resign. Instead, they learnt he had fled the country and had taken a midnight flight to the...", "url": "https://www.ndtv.com/blog/was-tear-gassed-lankan-protesters-helped-me-breathe-reporters-blog-3153573", "urlToImage": "https://c.ndtvimg.com/2022-07/37bhive_sreeja-tear-gassed_650x400_13_July_22.jpg", "publishedAt": "2022-07-13T09:29:58Z", "content": "July 13 - it was a big day for the people here. They expected that President Gotabaya Rajapaksa would resign. Instead, they learnt he had fled the country and had taken a midnight flight to the Maldi… [+2555 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "China Says It 'Drove' Away US Destroyer That Sailed Near Disputed Isles", "description": "A USdestroyer sailed near the disputed Paracel Islands in the South China Sea on Wednesday, drawing an angry reaction from Beijing, which said its military had \"driven away\" the ship after it illegally entering territorial waters.", "url": "https://www.ndtv.com/world-news/china-says-it-drove-away-us-destroyer-that-sailed-near-disputed-isles-3153567", "urlToImage": "https://c.ndtvimg.com/2022-07/jpef0k3o_uss-destroyer-benfold-reuters-_120x90_13_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=650,height=400", "publishedAt": "2022-07-13T09:28:28Z", "content": "China accuses the US of deliberately provoking tensions. (File)\r\nBeijing: A US destroyer sailed near the disputed Paracel Islands in the South China Sea on Wednesday, drawing an angry reaction from B… [+2471 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Lanka President Called, Said He'll Send Resignation Later Today: Speaker", "description": "Sri Lankan President Gotabaya Rajapaksa, who fled to the Maldives on Wednesday, telephoned the speaker of parliament saying that his resignation letter will be sent later in the day.", "url": "https://www.ndtv.com/world-news/sri-lanka-president-gotabaya-rajapaksa-calls-speaker-tells-him-he-will-resign-later-in-the-day-3153546", "urlToImage": "https://c.ndtvimg.com/2019-11/o0t0sdvk_gotabaya-rajapaksa-reuters_625x300_16_November_19.jpg", "publishedAt": "2022-07-13T09:25:33Z", "content": "The Sri Lankan Speaker said the President got in touch with him over the phone. (File)\r\nColombo: Sri Lankan President Gotabaya Rajapaksa, who fled to the Maldives on Wednesday, telephoned the speaker… [+540 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Here's How Your EPF Investment Can Make You A Crorepati", "description": "An individual who starts working at the age of 21 years with a basic monthly salary and DA (Dearness Allowance) of Rs 25,000 can retire with over Rs 1 crore from his regular contributions to the EPF investment.", "url": "https://www.ndtv.com/business/heres-how-your-epf-investment-can-make-you-a-crorepati-3150336", "urlToImage": "https://c.ndtvimg.com/2022-07/2h057gho_image_625x300_13_July_22.jpg", "publishedAt": "2022-07-13T09:23:40Z", "content": "The EPF investment calculations depend on the basic salary and DA along with the interest rates.\r\nNew Delhi: \r\nThe Employees' Provident Fund Organization (EPFO) allows salaried employees in the priva… [+2399 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Watch: Umesh Yadav Leaves Stumps Flying For 1st Wicket Of County Stint", "description": "Umesh Yadav took the first wicket of his County stint with Middlesex.", "url": "https://sports.ndtv.com/cricket/watch-umesh-yadav-leaves-stumps-flying-for-his-1st-wicket-of-county-stint-3153501", "urlToImage": "https://c.ndtvimg.com/2022-07/2u40876g_umesh-yadav-county-wicket-twitter_625x300_13_July_22.jpg", "publishedAt": "2022-07-13T09:15:49Z", "content": "Senior India pacer Umesh Yadav has notched up his maiden wicket in the County Championship representing Middlesex against Worcestershire on the second day in London. The 34-year-old pacer, who was ro… [+878 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "'Same Risk, Same Regulation' For Stablecoins, Say Global Regulators", "description": "Major stablecoins must comply with the same safeguards as traditional forms of payments, global regulators said on Wednesday, tightening controls over a battered crypto sector.", "url": "https://www.ndtv.com/business/same-risk-same-regulation-for-stablecoins-say-global-regulators-3153498", "urlToImage": "https://c.ndtvimg.com/2022-07/5ju5356o_image_625x300_13_July_22.jpg", "publishedAt": "2022-07-13T09:15:38Z", "content": "Global regulators back 'same risk, same regulation' for stablecoins\r\nMajor stablecoins must comply with the same safeguards as traditional forms of payments, global regulators said on Wednesday, tigh… [+1978 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Rashi Hardaha", "title": "AP ICET 2022 Correction Window Closes Today; Know How To Edit", "description": "AP ICET 2022: To edit the Andhra Pradesh ICET registration form, the aspirants will have enter their registration number, reference ID, qualifying exam hall ticket number, mobile number and date of birth.", "url": "https://www.ndtv.com/education/andhra-pradesh-icet-2022-correction-window-closes-today-know-how-to-edit-application-form", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/13/ap_icet.jpg", "publishedAt": "2022-07-13T09:13:32Z", "content": "AP ICET 2022: The application correction window for the Andhra Pradesh Integrated Common Entrance Test (AP ICET) 2022 will be closed today, July 13. Candidates who have submitted the AP ICET applicat… [+1515 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Supreme Court To Hear Pleas Challenging 'Agnipath' Scheme On July 15", "description": "The Supreme Court will hear pleas challenging the 'Agnipath' recruitment scheme for defence forces on July 15.", "url": "https://www.ndtv.com/india-news/supreme-court-to-hear-pleas-challenging-agnipath-scheme-on-july-15-3153480", "urlToImage": "https://c.ndtvimg.com/2022-02/a1ooga8_supreme-court-of-india_650x400_14_February_22.jpg", "publishedAt": "2022-07-13T09:09:41Z", "content": "Various petitions were filed before the top court challenging the 'Agnipath' scheme.\r\nNew Delhi: The Supreme Court will hear pleas challenging the 'Agnipath' recruitment scheme for defence forces on … [+1790 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Bengaluru Park's \"No Anti-Clockwise Walking\" Sign Becomes Meme Material", "description": "Public parks in India usually prohibit visitors from doing certain activities within the premises. However, now an image of a rather strange notice in a park in Bengaluru has surfaced online and has left internet users in splits.", "url": "https://www.ndtv.com/offbeat/viral-bengaluru-park-sign-prohibiting-anti-clockwise-walking-3153464", "urlToImage": "https://c.ndtvimg.com/2022-07/7q5v134_bangalore-sign-board_625x300_13_July_22.jpg", "publishedAt": "2022-07-13T09:05:09Z", "content": "Netizens flooded the comment section with hilarious jokes.\r\nPublic parks in India usually prohibit visitors from doing certain activities within the premises. This could be walking pets or plucking f… [+1660 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Bumrah Zooms Past Boult And Shaheen To Become Top Ranked ODI Bowler", "description": "As a result of Bumrah's upward movement in the rankings, New Zealand left arm pacer Trent Boult fell to the second spot while Pakistan's Shaheen Shah Afridi went a position down to the third spot.", "url": "https://sports.ndtv.com/england-vs-india-2022/jasprit-bumrah-zooms-past-trent-boult-and-shaheen-afridi-to-become-top-ranked-odi-bowler-after-oval-heroics-3153418", "urlToImage": "https://c.ndtvimg.com/2022-07/no8v3g1g_jasprit-bumrah_625x300_12_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-13T08:54:58Z", "content": "Jasprit Bumrah produced a breathtaking spell of fast bowling on Tuesday in the 1st ODI against England at The Oval in London to end with his career-best figures of 6/19. It helped India complete a 10… [+1100 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"It Was Unreal\": Read Cancer Survivor Sonali Bendre \"Bittersweet\" Post", "description": "\"From sheer terror to continued hope, so much has changed yet so much remains the same,\" wrote Sonali Bendre", "url": "https://www.ndtv.com/entertainment/cancer-survivor-sonali-bendre-visits-the-hospital-where-she-was-treated-read-her-bittersweet-post-3153401", "urlToImage": "https://c.ndtvimg.com/2022-07/isgn2gd8_sonali_625x300_13_July_22.jpg", "publishedAt": "2022-07-13T08:50:14Z", "content": "Sonali Bendre in a still from the video. (courtesy: iamsonalibendre)\r\nNew Delhi: Sonali Bendre, who was diagnosed with metastatic cancer in July 2018, revisited the hospital in New York where she had… [+1623 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Probe Agency Detects Rs 4,389 Crore Customs Duty Evasion By Oppo India", "description": "Revenue intelligence officers have detected Rs 4,389 crore duty evasion by Chinese smartphone maker Oppo by misdeclaration of imports, the Finance Ministry said today.", "url": "https://www.ndtv.com/india-news/probe-agency-detects-rs-4-389-crore-customs-duty-evasion-by-oppo-india-3153396", "urlToImage": "https://c.ndtvimg.com/2022-07/imlgneqo_image_625x300_13_July_22.jpg", "publishedAt": "2022-07-13T08:48:59Z", "content": "The Chinese company deals in mobile brands - Oppo, OnePlus and Realme.\r\nNew Delhi: Revenue intelligence officers have detected Rs 4,389 crore duty evasion by Chinese smartphone maker Oppo by misdecla… [+2448 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Vishesh Roy", "title": "Neeraj Chopra Sheds Light On Preparations For World Championships", "description": "Javelin thrower Neeraj Chopra on Wednesday spoke about his preparations for the upcoming World Championships in Eugene.", "url": "https://sports.ndtv.com/athletics/neeraj-chopra-sheds-light-on-preparations-for-world-championships-3153380", "urlToImage": "https://c.ndtvimg.com/2021-08/hfnh0qv_neeraj-chopra-afp_625x300_10_August_21.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-13T08:44:29Z", "content": "Olympic champion Neeraj Chopra would look to break the 90m mark at the senior World Championships later this month. The Tokyo Olympics gold medallist had come up with a throw of 87.58m at the event t… [+2931 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Man Charged For Threatening Voters To Return Money After Poll Defeat", "description": "A case has been filed against a man who lost the panchayat elections for allegedly threatening people to return the money he had distributed during the polls in Neemuch district of Madhya Pradesh, police said on Wednesday.", "url": "https://www.ndtv.com/india-news/neemuch-madhya-pradesh-man-charged-for-threatening-voters-to-return-money-after-poll-defeat-3153208", "urlToImage": "https://c.ndtvimg.com/2022-07/ik09ic08_neemuch-panchayat-polls-defeat-candidate-650_625x300_13_July_22.jpg", "publishedAt": "2022-07-13T08:44:24Z", "content": "Neemuch: More charges can be added against the accused, police said.\r\nNeemuch: A case has been filed against a man who lost the panchayat elections for allegedly threatening people to return the mone… [+1395 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "ISIS, Lashkar Spin-Off Claim Srinagar Attack, Release Video: Sources", "description": "This is the third attack in which terrorists used body cameras to shoot the attack, officials said.", "url": "https://www.ndtv.com/india-news/isis-lashkar-spin-off-claim-srinagar-attack-release-video-sources-3153379", "urlToImage": "https://c.ndtvimg.com/2022-07/7o10vdb4_srinagar-terrorist-shooting-pti_625x300_13_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675?ver-20220701.02", "publishedAt": "2022-07-13T08:44:03Z", "content": "There were at least three terrorists involved in the attack, the police says.\r\nNew Delhi: In shaky first-person footage, the violence is hard to miss. Terrorists are seen gunning down policemen in th… [+2310 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sri Lankan State Broadcaster Suspends Service: 5 Latest Updates", "description": "Hours after it emerged that President Gotabaya Rajapaksa had fled the country, massive street protests have erupted in Sri Lanka.", "url": "https://www.ndtv.com/world-news/sri-lankan-state-broadcaster-rupavahini-suspends-service-5-latest-updates-3153374", "urlToImage": "https://c.ndtvimg.com/2022-07/qem69rjo_sri-lanka-protests-reuters-pic_650x400_13_July_22.jpg", "publishedAt": "2022-07-13T08:41:39Z", "content": "<li>Sri Lanka's national television network, Rupavahini, suspended broadcast after protesters entered the TV station.\r\n</li><li>The US embassy in Colombo has suspended consular services for two days.… [+587 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Woman, 82, Mauled By Her Pet Pit Bull In Lucknow", "description": "An 82-year-old woman was mauled to death by her pet dog at her house in the Qaiserbagh area of the city, police said Wednesday.", "url": "https://www.ndtv.com/lucknow-news/woman-82-mauled-by-her-pet-pit-bull-dog-in-lucknow-3153327", "urlToImage": "https://c.ndtvimg.com/2022-01/uu6ghipg_pit-bull-generic-650_625x300_18_January_22.jpg", "publishedAt": "2022-07-13T08:41:13Z", "content": "Lucknow: Officials said they don't have information about the whereabouts of the dog (Representational)\r\nLucknow: An 82-year-old woman was mauled to death by her pet dog at her house in the Qaiserbag… [+1677 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Tara Sutaria Is \"Obsessed With Pulling\" Arjun Kapoor's Cheeks. But Why?", "description": "Well, Tara has happily answered the question. Read on", "url": "https://www.ndtv.com/entertainment/arjun-kapoor-and-tara-sutarias-cheeky-tales-are-too-cute-to-miss-3153373", "urlToImage": "https://c.ndtvimg.com/2022-07/6hssbllg_arjun_625x300_13_July_22.jpg", "publishedAt": "2022-07-13T08:40:52Z", "content": "New Delhi: Arjun Kapoor and Tara Sutaria are busy promoting their upcoming film Ek Villain Returns, which will release on July 29. The Mohit Suri directorial also stars John Abrahan and Disha Patani.… [+1974 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Lalu Yadav's Elder Son Wanted Car \"Parikrama\" At UP Temple. Cops Said No", "description": "RJD leader Tej Pratap Yadav was barred today from performing a 'parikrama' of Giriraj Maharaj temple here in his car by the authorities.", "url": "https://www.ndtv.com/india-news/lalu-yadavs-elder-son-wanted-car-parikrama-at-up-temple-cops-said-no-3153360", "urlToImage": "https://c.ndtvimg.com/2019-07/4uoivlo_tej-pratap-yadav_625x300_23_July_19.jpg", "publishedAt": "2022-07-13T08:37:33Z", "content": "Tej Pratap's car was stopped at a barrier by police personnel. File\r\nMathura: RJD leader Tej Pratap Yadav was barred today from performing a 'parikrama' of Giriraj Maharaj temple here in his car by t… [+1614 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Anushka Sharma Enjoys Boxful of 'Healthy Treats' In A Park - See Pic", "description": "We need to take equal care of our physical and mental health for overall wellbeing. And Anushka Sharma believes it to the core. Read on to know more.", "url": "https://food.ndtv.com/news/anushka-sharma-enjoys-boxful-of-healthy-treats-in-a-park-see-pic-3153359", "urlToImage": "https://c.ndtvimg.com/2022-06/4si6da3o_anushka-sharma_625x300_22_June_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-13T08:37:23Z", "content": "What do we associate the most with the word 'healthy'? The most common answer will be something that keeps us physically fit and energetic. But what about our minds and souls?! We also need to take e… [+1966 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Abhimanyu Bose", "title": "\"My Focus Is Definitely On Next Year's World Cup\": Shikhar Dhawan", "description": "Shikhar Dhawan, who just played his 150th ODI, has his eyes firmly set on the 2023 World Cup.", "url": "https://sports.ndtv.com/cricket/my-focus-is-definitely-on-next-years-world-cup-shikhar-dhawan-3153344", "urlToImage": "https://c.ndtvimg.com/2022-07/3oe3p7l8_shikhar-dhawan-afp_625x300_13_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-13T08:30:33Z", "content": "Experienced opener Shikhar Dhawan seems to be out of the Indian team management's plans in Test and T20 Internationals, but he remains a key member of the ODI side. Dhawan, who just played his 150th … [+1211 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "DoctorNDTV", "title": "Do You Know Ginger Can Reduce Exercise-Induced Muscle Pain? Hear It From Nmami Agarwal", "description": "Nmami Agarwal shares a food fact that will help you deal with exercise-induced muscle pain.", "url": "https://doctor.ndtv.com/living-healthy/nmami-agarwal-shares-one-amazing-food-fact-that-will-help-you-deal-with-muscle-soreness-after-exercising-3147820", "urlToImage": "https://c.ndtvimg.com/2019-05/g9hlki68_ginger-roots_625x300_15_May_19.jpg", "publishedAt": "2022-07-13T08:30:08Z", "content": "If you follow a workout regime, you must be aware of muscle soreness. Isn't it? And,  everyone, who has just started exercising or does it regularly, can relate to it. It happens because of the stres… [+2917 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Mridusmita Deka", "title": "NIRF Rankings 2022 On July 15; This Is How Colleges Will Be Ranked", "description": "NIRF Rankings 2022: The NIRF India ranking parameters differ for all the categories. The broad categories adopted to rank the colleges, universities and institutes include Teaching, Learning and Resources; Research and Professional Practice; and Graduation Ou…", "url": "https://www.ndtv.com/education/nirf-india-rankings-2022-on-july-15-how-institutes-colleges-will-be-ranked-parameters-nirfindia-org", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/13/ranking-featured-image.jpg", "publishedAt": "2022-07-13T08:27:18Z", "content": "New Delhi:The Union Education Minister Dharmendra Pradhan will release the National Institutional Ranking Framework (NIRF) on July 15. NIRF Rankings will rank universities and institutes in India. NI… [+1117 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Embassy In Sri Lanka Cancels Consular Services For 2 Days", "description": "The US Embassy in Colombo on Wednesday cancelled its consular services as a precaution for the next two days, amidst the deepening political turmoil and economic crisis in Sri Lanka.", "url": "https://www.ndtv.com/world-news/sri-lanka-crisis-us-embassy-in-sri-lanka-cancels-consular-services-for-2-days-3153329", "urlToImage": "https://c.ndtvimg.com/2022-07/nuvrjrvs_sri-lanka-embassy_625x300_13_July_22.jpg", "publishedAt": "2022-07-13T08:25:59Z", "content": "The Sri Lankan government has also imposed a state of emergency in the country.\r\nColombo: The US Embassy in Colombo on Wednesday cancelled its consular services as a precaution for the next two days,… [+1982 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "World's 1st Malaria Shot Won't Reach Millions Of Children. Here's Why", "description": "After decades of work, the World Health Organization endorsed the first-ever malaria vaccine last year - a historic milestone that promised to drive back a disease that kills a child every minute.", "url": "https://www.ndtv.com/world-news/worlds-1st-malaria-shot-wont-reach-millions-of-children-heres-why-3153323", "urlToImage": "https://c.ndtvimg.com/2022-07/bcvs7p7_malaria_625x300_13_July_22.jpg", "publishedAt": "2022-07-13T08:25:02Z", "content": "The world's inability to fund more Mosquirix shots dismays many in Africa. (Reuters)\r\nLondon, Kisumu, Kenya: After decades of work, the World Health Organization endorsed the first-ever malaria vacci… [+10322 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "9 Classic Indian Snacks That Are Just Perfect For The Monsoon", "description": "If you are someone who loves to enjoy the monsoon with snacks just like we do, here we bring you 9 classic Indian snack recipes that all of us love to devour.", "url": "https://food.ndtv.com/food-drinks/9-classic-indian-snacks-that-are-just-perfect-for-the-monsoon-3153313", "urlToImage": "https://c.ndtvimg.com/2022-03/sdt8aji_samosa_625x300_09_March_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-13T08:21:51Z", "content": "Let's agree, we all enjoy crispy and crunchy snacks during the monsoon. The moment temperature drops and the air becomes nippy, our cravings for something delectable skyrockets. Having a plateful of … [+3899 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"When I Came To Delhi In 1999...\": Nagaland Minister Shares Funny Video", "description": "On Sunday, Nagaland minister Temjen Imna Along won over Twitter with his witty remark on Google's concern about his wife.", "url": "https://www.ndtv.com/india-news/nagaland-ministers-latest-post-came-to-delhi-in-1999-saw-more-people-on-station-than-our-states-population-3153304", "urlToImage": "https://c.ndtvimg.com/2022-07/o8d3l2m8_nagaland-minister-inma-650_625x300_13_July_22.jpg", "publishedAt": "2022-07-13T08:17:48Z", "content": "Nagaland minister Temjen Imna Along speaking at an event.\r\nNagaland minister Temjen Imna Along, who has been trending on social media for his \"small eyes\" remark calling out racism in a humorus way, … [+1550 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Lanka PM Ranil Wickremesinghe Appointed Acting President, Says Speaker", "description": "Sri Lankan Prime Minister Ranil Wickremesinghe was appointed to be acting president as incumbent Gotabaya Rajapaksa was overseas, the parliamentary Speaker announced Wednesday as thousands of protesters demanded both men step down.", "url": "https://www.ndtv.com/world-news/sri-lanka-pm-ranil-wickremesinghe-appointed-acting-president-says-speaker-3153299", "urlToImage": "https://c.ndtvimg.com/2022-07/092fhub8_ranil-wickremesinghe-afp-650_625x300_13_July_22.jpg", "publishedAt": "2022-07-13T08:15:39Z", "content": "The announcement comes amid protesters' demanding both the President and PM to step down. (File)\r\nColombo: Sri Lankan Prime Minister Ranil Wickremesinghe was appointed to be acting president as incum… [+482 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Examine Juvenility Of Accused: Supreme Court On Gurgaon Schoolboy's Death", "description": "The Supreme Court on Wednesday said a juvenile accused of killing a seven-year-old child at a private school in Haryana's Gurgaon district in 2017 be examined afresh to ascertain whether he should be tried as an adult or not for the alleged crime.", "url": "https://www.ndtv.com/india-news/examine-juvenility-of-accused-supreme-court-on-gurgaon-schoolboys-death-3153295", "urlToImage": "https://c.ndtvimg.com/2022-02/a1ooga8_supreme-court-of-india_650x400_14_February_22.jpg", "publishedAt": "2022-07-13T08:15:11Z", "content": "The victim's body, with the throat slit, was found in the washroom of a school in Gurgaon.\r\nNew Delhi: The Supreme Court on Wednesday said a juvenile accused of killing a seven-year-old child at a pr… [+1451 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Masaba Gupta's \"Sharp As A Knife\" Reply To Troll Who Body Shamed Her", "description": "Leave it to Masaba Gupta to shut trolls with a sassy reply", "url": "https://www.ndtv.com/entertainment/masaba-guptas-sharp-as-a-knife-reply-to-troll-who-body-shamed-her-3153291", "urlToImage": "https://c.ndtvimg.com/2022-07/153442u8_masaba-_625x300_13_July_22.jpg", "publishedAt": "2022-07-13T08:13:39Z", "content": "Masaba Gupta shared this image. (courtesy: masabagupta)\r\nNew Delhi: Fashion designer and actor Masaba Gupta couldn't help but call out the troll who shamed her for her looks. Masaba posted a screensh… [+1467 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "3 Nutritionist-Recommended Health Benefits Of Kiwi", "description": "Celebrity nutritionist Lovneet Batra recently took to her Instagram to share interesting health benefits of kiwi.", "url": "https://food.ndtv.com/food-drinks/3-nutritionist-recommended-health-benefits-of-kiwi-3153290", "urlToImage": "https://c.ndtvimg.com/2022-07/qrej8qgg_kiwi_625x300_13_July_22.png?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-13T08:12:58Z", "content": "Known for its vibrant green colour and refreshing taste, kiwi is a superfruit loved by many. It is most commonly used to make fruit salads, yogurt parfaits, desserts, juices and more, and makes for a… [+2349 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Chinese Phone Maker Oppo Evaded Rs 4,390 Crore Customs Duty: Report", "description": "An investigation by India's Directorate of Revenue Intelligence has found that Chinese smartphone maker Oppo evaded customs duty worth 43.9 billion Indian rupees ($551 million).", "url": "https://www.ndtv.com/business/india-accuses-chinas-oppo-of-551-million-tax-evasion-3153274", "urlToImage": "https://c.ndtvimg.com/2022-07/imlgneqo_image_625x300_13_July_22.jpg", "publishedAt": "2022-07-13T08:10:05Z", "content": "India accuses China's Oppo of $551 million tax evasion\r\nNEW DELHI: An investigation by India's Directorate of Revenue Intelligence has found that Chinese smartphone maker Oppo evaded customs duty wor… [+1545 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Mridusmita Deka", "title": "NTA Extends CUET PG Application Date", "description": "CUET PG 2022: The application deadline for CUET PG 2022 registration has been extended.", "url": "https://www.ndtv.com/education/nta-extends-cuet-pg-2022-application-date-cuet-nta-nic-in", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/13/application-featured-image.jpg", "publishedAt": "2022-07-13T08:09:43Z", "content": "Sign In/Sign Up\r\nWe endeavor to keep you informed and help you choose the right Career path. Sign in and access our\r\nresources on Exams, Study Material, Counseling, Colleges etc."}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "New Virtual Reality Login System For Facebook Owner Meta's Users", "description": "Meta is modifying how users log onto its virtual reality headsets, backtracking on an earlier change to require accounts from Facebook app.", "url": "https://www.ndtv.com/business/new-virtual-reality-login-system-for-facebook-owner-metas-users-3153273", "urlToImage": "https://c.ndtvimg.com/2022-07/1bk2g37_image_625x300_13_July_22.jpg", "publishedAt": "2022-07-13T08:09:41Z", "content": "Facebook owner Meta announces new virtual reality login system\r\nMeta Platforms Inc is modifying how users log onto its virtual reality headsets, backtracking on an earlier change to require accounts … [+1894 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Bhagyashree Shares Behind The Scene Foodie Moments With Remo D'Souza And Urmila Matondkar", "description": "Bhagyashree is currently working on a new project, being a judge in the new reality television show 'Dance India Dance Supermoms'", "url": "https://food.ndtv.com/food-drinks/bhagyashree-shares-behind-the-scene-foodie-moments-with-remo-dsouza-and-urmila-matondkar-3153272", "urlToImage": "https://c.ndtvimg.com/2022-06/32i7lvh_bhagyashree-photos_625x300_20_June_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-13T08:09:35Z", "content": "Bhagyashree started in the industry as an actress in the 90s but it seems like she has gotten more famous post her active years, all thanks to social media! With over 1.2 million followers on Instagr… [+1949 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Aditya Kumar", "title": "\"Let Me Get My Ducks\": Jaffer Trolls Vaughan After England's Dismal Show", "description": "Wasim Jaffer smartly used the word \"duck\" to take a dig at Michael Vaughan and the England national cricket team.", "url": "https://sports.ndtv.com/england-vs-india-2022/india-vs-england-let-me-get-my-ducks-wasim-jaffer-trolls-michael-vaughan-after-england-batters-dismal-show-in-1st-odi-3153270", "urlToImage": "https://c.ndtvimg.com/2022-07/inf59t48_wasim-jaffer-806_625x300_10_July_22.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-13T08:09:07Z", "content": "The social media banter between former India batter Wasim Jaffer and ex-England cricketer Michael Vaughan is nothing new. The two often engage in pulling each other's leg and their topic of talk main… [+1577 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Crypto Lender Celsius Is \"Deeply Insolvent\": US State Regulator", "description": "Vermont's Department of Financial Regulation (DFR) on Tuesday said it believes cryptocurrency lender Celsius Network is \"deeply insolvent\" and does not have the assets and liquidity to honor its obligations to customers and other creditors.", "url": "https://www.ndtv.com/business/crypto-lender-celsius-is-deeply-insolvent-us-state-regulator-3153231", "urlToImage": "https://c.ndtvimg.com/2022-07/qoinlm2o_image_625x300_13_July_22.jpg", "publishedAt": "2022-07-13T08:00:14Z", "content": "US state regulator says it believes crypto lender Celsius is \"deeply insolvent\"\r\nVermont's Department of Financial Regulation (DFR) on Tuesday said it believes cryptocurrency lender Celsius Network i… [+1559 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Adarsh Srivastava", "title": "Andhra Pradesh AP EAPCET 2022 Answer Key Out For Agriculture Stream", "description": "The Jawaharlal Nehru Technological University (JNTU) Anantapur has released the Andhra Pradesh Engineering, Agriculture and Pharmacy Common Entrance Test (AP EAPCET) 2022 answer key for Agriculture stream.", "url": "https://www.ndtv.com/education/andhra-pradesh-ap-eapcet-2022-answer-key-out-for-agriculture-stream-objection-date-details-here", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/13/AP-EAPCET-2022-Answer-Key.jpg", "publishedAt": "2022-07-13T07:56:32Z", "content": "New Delhi:AP EAPCET 2022: The Jawaharlal Nehru Technological University (JNTU) Anantapur has released the Andhra Pradesh Engineering, Agriculture and Pharmacy Common Entrance Test (AP EAPCET) 2022 an… [+2032 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Viral Video: Street Vendor Makes Omelette With Jeera Soda And Oreo", "description": "Video shows a street vendor prepping for his experimental speciality by heating a frying pan with a few drops of oil. The beginning of the clip seems normal, however, it takes a bizarre turn when the vendor goes on to empty 'Jeera Soda' into the pan.", "url": "https://www.ndtv.com/offbeat/this-is-a-crime-video-of-street-vendor-making-omelette-with-jeera-soda-and-oreo-leaves-internet-disgusted-3153210", "urlToImage": "https://c.ndtvimg.com/2022-07/sp4k5k78_eggs-and-coke_625x300_13_July_22.jpg", "publishedAt": "2022-07-13T07:53:35Z", "content": "The video has surfaced on several social media platforms.\r\nFusion food has become the latest trend on the internet as people love to experiment and combine different dishes to create a new one. While… [+1973 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Windfall Tax Review On Oil Firms Likely After Sharp Fall In Crude Prices", "description": "A massive crash in refining margins of diesel, petrol and ATF coinciding with a cool-off in crude oil prices from their peaks in June has diminished the super-profits of refiners, a report said on Wednesday.", "url": "https://www.ndtv.com/business/windfall-tax-review-more-likely-than-expected-after-sharp-fall-in-global-crude-prices-3153194", "urlToImage": "https://c.ndtvimg.com/2022-07/rjkpg144_crude-oil-reuters_625x300_10_July_22.jpeg", "publishedAt": "2022-07-13T07:48:34Z", "content": "Windfall tax review more likely than expected after sharp fall in global crude prices\r\nNew Delhi: A massive crash in refining margins of diesel, petrol and ATF coinciding with a cool-off in crude oil… [+3546 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "14 Killed, 31,000 Evacuated So Far Amid Heavy Rain In Gujarat, Saurashtra", "description": "Parts of south Gujarat and Kutch-Saurashtra regions received very heavy showers in last 24 hours leaving 14 people dead, while over 31,000 were evacuated so far this rainy season, officials said on Wednesday.", "url": "https://www.ndtv.com/india-news/14-killed-31-000-evacuated-so-far-amid-heavy-rain-in-gujarat-saurashtra-3153192", "urlToImage": "https://c.ndtvimg.com/2022-07/f09f0ol4_gujarat-rain_625x300_13_July_22.jpg", "publishedAt": "2022-07-13T07:48:13Z", "content": "The state's largest Sardar Sarovar Dam is also filled up to 48 per cent of its total capacity.\r\nAhmedabad: Parts of south Gujarat and Kutch-Saurashtra regions received very heavy showers in last 24 h… [+2804 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Abhimanyu Bose", "title": "\"Imagine Mr Bean Brought Into Team\": Sanath Jayasuriya Slams Lankan PM", "description": "Sanath Jayasuriya has been vocal in his protests against the Sri Lanka President and Prime Minister.", "url": "https://sports.ndtv.com/cricket/imagine-mr-bean-brought-into-team-ex-sri-lanka-captain-slams-prime-minister-3153172", "urlToImage": "https://c.ndtvimg.com/2018-10/p0ublpgg_sanath-jayasuriya-icc_625x300_16_October_18.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-13T07:37:56Z", "content": "As the acting President, Sri Lanka's Prime Minister Ranil Wickremesinghe declared a nationwide state of emergency on Wednesday, hours after President Gotabaya Rajapaksa fled the country leading to mo… [+1781 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "How To Store Your Green Vegetables For Longer", "description": "These hacks can help you in keeping all kinds of greens fresh for as long as possible.", "url": "https://food.ndtv.com/food-drinks/how-to-store-your-green-vegetables-for-longer-3153156", "urlToImage": "https://c.ndtvimg.com/2020-08/dd1omri8_leafy-green-veggies-_625x300_08_August_20.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-13T07:34:08Z", "content": "Leafy greens are an important addition to a healthy diet - and they go beyond a bowl of humble salad. Lettuce, kale, spinach and more - these are just a few varieties of greens. No matter what the se… [+1872 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Vivo's Bank Accounts Ban Lifted In Money Laundering Case: Report", "description": "An Indian court on Wednesday lifted a freeze on smartphone maker Vivo's bank accounts imposed by the country's financial crime agency and ordering the Chinese company to provide a bank guarantee of $119 million, a lawyer for the company told Reuters.", "url": "https://www.ndtv.com/business/delhi-high-court-lifts-ban-on-vivo-bank-accounts-in-money-laundering-case-3153103", "urlToImage": "https://c.ndtvimg.com/2022-07/k524pks4_vivo-india-reuters_625x300_07_July_22.jpg", "publishedAt": "2022-07-13T07:33:43Z", "content": "The court ordered the Chinese company to provide a bank guarantee of $119 million.\r\nNew Delhi: An Indian court on Wednesday lifted a freeze on smartphone maker Vivo's bank accounts imposed by the cou… [+389 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "PM Modi, Rahul Gandhi Greet Nation On Guru Purnima", "description": "Prime Minister Narendra Modi on Wednesday extended greetings on the occasion of Guru Purnima and prayed for India to be taken to \"newer heights\" with the blessings of the Gurus.", "url": "https://www.ndtv.com/india-news/guru-purnima-2022-pm-modi-rahul-gandhi-greet-nation-on-guru-purnima-3153143", "urlToImage": "https://c.ndtvimg.com/2022-07/skkqope8_pm-modi-650_625x300_12_July_22.jpg", "publishedAt": "2022-07-13T07:31:28Z", "content": "The festival, also known as 'Vyasa Purnima', is being celebrated on July 13 this year.\r\nNew Delhi: Prime Minister Narendra Modi on Wednesday extended greetings on the occasion of Guru Purnima and pra… [+2176 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Emmys: Succession Gets Most Nominations, Squid Game Creates History", "description": "Emmys 2022: Squid Game became the first non-English-language drama series shortlisted for glory for television's equivalent of the Oscars", "url": "https://www.ndtv.com/entertainment/emmys-2022-succession-gets-most-nominations-squid-game-creates-history-3153140", "urlToImage": "https://c.ndtvimg.com/2022-07/da1bkfho_emmy_625x300_13_July_22.jpg", "publishedAt": "2022-07-13T07:30:54Z", "content": "A still from Succession. (courtesy: hbo)\r\nHBO's Succession topped this year's Emmy nominations, earning 25 nods on Tuesday, as Squid Game became the first non-English-language drama series shortliste… [+4020 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rupee's Relief Short-Lived, Hits New Lifetime Low Of 79.67 Per Dollar", "description": "The rupee's relief was only short-lived against a rampant dollar as the currency hit a new record intra-day lifetime low of 79.67 on Wednesday after recovering a touch, marking the third straight session of record weak levels.", "url": "https://www.ndtv.com/business/rupees-relief-short-lived-hits-new-lifetime-low-of-79-67-per-dollar-3153120", "urlToImage": "https://c.ndtvimg.com/2022-07/df54csug_image_625x300_13_July_22.jpg", "publishedAt": "2022-07-13T07:24:53Z", "content": "Rupee hits record low for a third straight session\r\nThe rupee's relief was only short-lived against a rampant dollar as the currency hit a new record intra-day lifetime low of 79.67 on Wednesday afte… [+2039 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Probe Agency To Respond To Vivo's Plea Against Freezing Bank Accounts", "description": "Delhi High Court sought response of the Enforcement Directorate on a plea by Chinese smartphone maker Vivo seeking quashing of an order freezing its various bank accounts in connection with a money laundering probe.", "url": "https://www.ndtv.com/india-news/probe-agency-to-respond-to-chinese-phone-maker-vivos-plea-against-freezing-bank-accounts-3153113", "urlToImage": "https://c.ndtvimg.com/2022-07/fq6o12rs_vivo-logo-reuters_625x300_13_July_22.jpg", "publishedAt": "2022-07-13T07:22:52Z", "content": "Vivo has sought permission to deal with its frozen bank accounts for making payments\r\nNew Delhi: The Delhi High Court today sought response of the Enforcement Directorate on a plea by Chinese smartph… [+1255 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "BJP MPs Invited To Dinner With PM On Saturday Ahead Of Presidential Poll", "description": "The BJP-led coalition has nominated Droupadi Murmu to be the next President, and her election on Monday against the opposition's candidate Yashwant Sinha appears certain.", "url": "https://www.ndtv.com/india-news/bjp-mps-invited-to-dinner-with-pm-on-saturday-ahead-of-presidential-poll-3153112", "urlToImage": "https://c.ndtvimg.com/2022-07/da9q9b2k_pm-modi-droupadi-murmu-bjp-pti_625x300_13_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675?ver-20220701.02", "publishedAt": "2022-07-13T07:22:29Z", "content": "For Droupadi Murmu, the BJP has scored support across the political spectrum.\r\nNew Delhi: All MPs of the BJP have been invited to dinner on Saturday with Prime Minister Narendra Modi, Union Home Mini… [+1824 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Shoulder Ache From Incorrect Sleeping Position? Try These Exercises For Relief", "description": "Shoulder pain from poor sleeping positions may cause discomfort. Here's how to fix it quickly and effortlesly.", "url": "https://www.ndtv.com/health/shoulder-ache-from-bad-sleeping-position-try-these-exercises-for-relief-3138224", "urlToImage": "https://c.ndtvimg.com/2019-06/tut5vjsg_child-pose_625x300_21_June_19.jpg", "publishedAt": "2022-07-13T07:16:04Z", "content": "Child pose may provide relief from shoulder pain\r\nWe spend an average of 26 years of our life sleeping. This is one of the many reasons why it is. crucial for us to get adequate sleep daily. Our qual… [+3409 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Opinion: Our Emblem Is Not A Plaything - by Rajmohan Gandhi", "description": "The distortion is serious and ought to be undone. Our national emblem is not a toy to which a child can give a new shape. It stands for the meaning of India, and for the message of the Indian state.", "url": "https://www.ndtv.com/opinion/our-emblem-is-not-a-plaything-by-rajmohan-gandhi-3153069", "urlToImage": "https://c.ndtvimg.com/2022-07/iffi00a_modi-emblem_625x300_11_July_22.jpg", "publishedAt": "2022-07-13T07:12:35Z", "content": "The distortion is serious and ought to be undone. Our national emblem is not a toy to which a child can give a new shape. It stands for the meaning of India, and for the message of the Indian state. … [+5008 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "No Pause On Demolitions, Supreme Court Refuses Blanket Ban", "description": "The Supreme Court today refused to pass a blanket order banning demolitions across states, stressing that such a move will curtail the rights of municipal authorities.", "url": "https://www.ndtv.com/india-news/no-pause-on-demolitions-across-states-supreme-court-says-blanket-ban-will-curtail-rights-of-civic-authorities-3153081", "urlToImage": "https://c.ndtvimg.com/2022-06/69r0u598_bulldozer-prayagraj_625x300_12_June_22.jpg", "publishedAt": "2022-07-13T07:10:26Z", "content": "The Supreme Court today refused to pass a blanket order banning demolitions across states, stressing that such a move will curtail the rights of municipal authorities.\r\nThe court is hearing a petitio… [+1638 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Adarsh Srivastava", "title": "IIT Madras Issues HSEE 2022 Admit Card, Steps To Download", "description": "Indian Institute of Technology (IIT) Madras has released the Humanities and Social Sciences Entrance Examination (HSEE) 2022 admit card today, July 13. The HSEE hall ticket can be downloaded from the official website.", "url": "https://www.ndtv.com/education/hsee-2022-iit-madras-issues-humanities-and-social-sciences-entrance-exam-admit-card", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/13/HSEE-2022-Admit-Card.jpg", "publishedAt": "2022-07-13T07:08:50Z", "content": "HSEE 2022 Admit Card: Indian Institute of Technology (IIT) Madras has released the Humanities and Social Sciences Entrance Examination (HSEE) 2022 admit card today, July 13. The HSEE hall ticket can … [+1371 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Abhimanyu Bose", "title": "\"Good To Hear Nasser Hussain Agree\": Sachin Tendulkar's Ultimate Praise For Jasprit Bumrah - NDTV Sports", "description": "<ol><li>\"Good To Hear Nasser Hussain Agree\": Sachin Tendulkar's Ultimate Praise For Jasprit Bumrah  NDTV Sports\r\n</li><li>Bumrah takes career-best 6 for 19 as India skittle England  ESPNcricinfo\r\n</li><li>Bumrah to Shami, India has a terrific bowling quartet.…", "url": "https://sports.ndtv.com/england-vs-india-2022/good-to-hear-nasser-hussain-agree-sachin-tendulkars-ultimate-praise-for-jasprit-bumrah-3153000", "urlToImage": "https://c.ndtvimg.com/2022-07/cael265_jasprit-bumrah-afp_625x300_13_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-13T07:04:47Z", "content": "Jasprit Bumrah put in a sensational bowling performance to help India thrash England by 10 wickets in the first ODI at the Kennington Oval on Tuesday. With some swing and bounce on offer, Bumrah - wi… [+1728 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Athiya And KL Rahul's Wedding In 3 Months? \"Hope I'm Invited,\" She Says", "description": "Athiya Shetty shut the rumours and how", "url": "https://www.ndtv.com/entertainment/athiya-shetty-and-kl-rahuls-wedding-in-3-months-hope-im-invited-she-says-3153065", "urlToImage": "https://c.ndtvimg.com/2022-07/5ogvgqc_athiya_625x300_13_July_22.jpg", "publishedAt": "2022-07-13T07:03:50Z", "content": "Athiya Shetty with KL Rahul. (courtesy: athiyashetty)\r\nNew Delhi: Actor Athiya Shetty and cricketer KL Rahul, who have been dating for over 3 years now, often feature on the list of trends courtesy t… [+1910 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "5 Classic Party Dips Ready In Just 20 Mins", "description": "Pair your party snacks with dips that are ready in just 20 minutes.", "url": "https://food.ndtv.com/food-drinks/5-classic-party-dips-ready-in-just-20-mins-3153054", "urlToImage": "https://c.ndtvimg.com/2022-05/1s9fhflg_dips_625x300_10_May_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-13T06:59:51Z", "content": "Any snack feels incomplete without a condiment to pair it with, doesn't it? We can't imagine having samosa without imli chutney or chicken tikka without hari chutney! These condiments play an integra… [+2445 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "NASA's James Webb Telescope Detects Water On Distant Planet. Details Here", "description": "NASA's James Webb Space Telescope has detected signs of water, along with evidence for clouds and haze, in the atmosphere of a hot, puffy gas giant planet orbiting a Sun-like star over a thousand light years away, the US space agency said today.", "url": "https://www.ndtv.com/science/nasas-james-webb-telescope-detects-water-on-distant-planet-details-here-3152952", "urlToImage": "https://c.ndtvimg.com/2022-07/3ih640fk_exoplanet-wasp-96b-nasa-website_625x300_13_July_22.jpg", "publishedAt": "2022-07-13T06:58:02Z", "content": "Exoplanet WASP-96b is located roughly 1,150 light-years away in the constellation Phoenix\r\nWashington: NASA's James Webb Space Telescope has detected signs of water, along with evidence for clouds an… [+3738 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "'So Egg-Cited': Sara Ali Khan Kick-Started Her Day With This Loaded Breakfast", "description": "Sara Ali Khan enjoyed a lavish and wholesome breakfast that she called 'Breakfast of Champions'. Take a look at what she ate!", "url": "https://food.ndtv.com/news/so-egg-cited-sara-ali-khan-kick-started-her-day-with-this-loaded-breakfast-3153022", "urlToImage": "https://c.ndtvimg.com/2022-04/ieeefea8_sara-_625x300_08_April_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-13T06:54:39Z", "content": "From London to the Maldives, Paris to Switzerland - Bollywood celebrities are jetting off to exotic locations for their vacations. Sara Ali Khan too is currently enjoying some quality time with frien… [+1881 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "A Look At Sri Lanka's Powerful Rajapaksa Family", "description": "Anger at Sri Lanka's dire economic crisis has been simmering for months, with many laying the blame for widespread shortages and runaway inflation squarely at the feet of the ruling Rajapaksa family.", "url": "https://www.ndtv.com/world-news/a-look-at-sri-lankas-powerful-rajapaksa-family-3153019", "urlToImage": "https://c.ndtvimg.com/2022-07/bg3lpldg_gotabaya-mahinda-rajapaksas-afp-650_625x300_13_July_22.jpg", "publishedAt": "2022-07-13T06:54:00Z", "content": "Unlike Mahinda, who heads the Rajapaksa clan, Gotabaya had little political experience. (File)\r\nColombo: Anger at Sri Lanka's dire economic crisis has been simmering for months, with many laying the … [+3992 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Shiv Sena Stakes Claim For Leader Of Opposition In Maharashtra Council", "description": "After being dislodged from power in Maharashtra, the Shiv Sena has staked claim for the post of leader of opposition in the state Legislative Council.", "url": "https://www.ndtv.com/india-news/shiv-sena-stakes-claim-for-leader-of-opposition-in-maharashtra-council-3153013", "urlToImage": "https://c.ndtvimg.com/2019-11/h177erto_maharashtra-assembly_625x300_27_November_19.jpg", "publishedAt": "2022-07-13T06:52:08Z", "content": "The Sharad Pawar-led NCP is just two short of the Sena's tally in the Upper House.\r\nMumbai: After being dislodged from power in Maharashtra, the Shiv Sena has staked claim for the post of leader of o… [+1568 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Tour De France Environment Protest Reaches Global Audience", "description": "When French environmental campaigners \"Dernier Renovation\" briefly halted the Tour de France in the Alps on Tuesday, they hooked into a global audience with sport becoming an increasingly popular medium for viral stunts by protestors", "url": "https://sports.ndtv.com/cycling/tour-de-france-environment-protest-reaches-global-audience-3153008", "urlToImage": "https://c.ndtvimg.com/2022-07/2sin76m_tour-de-france-afp_625x300_13_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-13T06:51:30Z", "content": "When French environmental campaigners \"Dernier Renovation\" briefly halted the Tour de France in the Alps on Tuesday, they hooked into a global audience with sport becoming an increasingly popular med… [+3593 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "47-Year-Old Mumbai Woman Found Dead In Hotel Room, 1 Arrested: Police", "description": "A 47-year-old woman was found dead in a hotel room in Mumbai on Tuesday, the police said.", "url": "https://www.ndtv.com/mumbai-news/47-year-old-mumbai-woman-found-dead-in-hotel-room-1-arrested-police-3152980", "urlToImage": "https://c.ndtvimg.com/mumbai-police-generic_650_625x300_1530762157699.jpg", "publishedAt": "2022-07-13T06:41:38Z", "content": "Further investigation is underway, police said.\r\nMumbai: A 47-year-old woman was found dead in a hotel room in Mumbai on Tuesday, the police said.\r\nSoon after the information was received in the matt… [+883 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ahead Of The Finale, Ms Marvel And Co-Stars Have Messages For Fans", "description": "The ultimate finale will release at 12:30 pm on Wednesday on Disney+ Hotstar", "url": "https://www.ndtv.com/entertainment/ahead-of-ms-marvel-epic-finale-cast-send-special-video-messages-to-cosmic-fans-3152864", "urlToImage": "https://c.ndtvimg.com/2022-07/8975blm8_ms-marvel_625x300_13_July_22.jpg", "publishedAt": "2022-07-13T06:40:44Z", "content": "Iman Vellani in a still from the video. (courtesy: marvelstudios)\r\nNew Delhi: Ms Marvel fans, or we should say cosmic fans, we have some fantastic news in store for you. On the finale day, everyone's… [+2446 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Realty Firm Signature Global Files Rs 1,000 Crore IPO Papers", "description": "Realty firm Signature Global (India) Ltd has filed preliminary papers with capital markets regulator Sebi to raise Rs 1,000 crore through an initial public offering (IPO).", "url": "https://www.ndtv.com/business/realty-firm-signature-global-files-rs-1-000-crore-ipo-papers-3152912", "urlToImage": "https://i.ndtvimg.com/i/2017-08/sebi-650_650x400_81502178694.jpg", "publishedAt": "2022-07-13T06:40:39Z", "content": "As of March 2022, Signature Global had sold 23,453 residential and commercial units.\r\nNew Delhi: Realty firm Signature Global (India) Ltd has filed preliminary papers with capital markets regulator S… [+1354 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Paneer Saag, Dal And More: Anupam Kher Receives Yummy Home-Cooked Food From Vrinda Kher", "description": "Anupam Kher loves to have a variety of food and never shies away from it. Recently, he was seen having some yummy home-cooked food.", "url": "https://food.ndtv.com/news/paneer-saag-dal-and-more-anupam-kher-receives-yummy-home-cooked-food-from-vrinda-kher-3152973", "urlToImage": "https://c.ndtvimg.com/2022-06/9keqopb_anupam-kher-_625x300_08_June_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-13T06:39:15Z", "content": "Anupam Kher, a veteran actor, has demonstrated his acting prowess in numerous movies and television programs throughout the years. He is a well-known personality in the industry known for his skills … [+1929 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "How Sri Lanka Crisis Unfolded - Timeline", "description": "Sri Lanka is mired in a deep political and economic crisis, and on Wednesday, the country's president Gotabaya Rajapaksa flew out of the country days after a huge crowd of protesters barged into his residence demanding his resignation.", "url": "https://www.ndtv.com/world-news/how-sri-lanka-crisis-unfolded-timeline-3152934", "urlToImage": "https://c.ndtvimg.com/2022-07/9tsb74h8_sri-lanka-crisis-sri-lanka-protest-afp-650_625x300_13_July_22.jpg", "publishedAt": "2022-07-13T06:25:48Z", "content": "<li>April 1 - State of emergency: Rajapaksa declares a temporary state of emergency, giving security forces sweeping powers to arrest and detain suspects, after a spate of protests.\r\n</li><li>April 3… [+3970 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Manipur Schools Closed Till July 24 Amid Covid Surge", "description": "The Manipur government has ordered closure of all schools till next week due to the recent surge in coronavirus cases.", "url": "https://www.ndtv.com/education/manipur-schools-closed-till-july-24-amid-covid-surge", "urlToImage": "https://cache.careers360.mobi/media/presets/860X430/article_images/2022/7/13/Manipur-School-Closed.jpg", "publishedAt": "2022-07-13T06:25:29Z", "content": "Imphal:The Manipur government has ordered closure of all schools till next week due to the recent surge in coronavirus cases. In an official order issued on Tuesday, Schools Education Commissioner H … [+566 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Brahmastra: A Guide To The Astraverse - From Vanarastra To Nandi Astra", "description": "Brahmastra releases on September 13, 2022", "url": "https://www.ndtv.com/entertainment/brahmastra-a-guide-to-the-astraverse-from-vanarastra-to-nandi-astra-3152924", "urlToImage": "https://c.ndtvimg.com/2022-07/tvnnp8f8_ranbir_625x300_13_July_22.jpg", "publishedAt": "2022-07-13T06:19:32Z", "content": "A screenshot of Ranbir Kapoor from Brahamstra video. (courtesy: Sony Music South)\r\nNew Delhi: Alia Bhatt shared a video about the \"vision\" of director Ayan Mukerji behind his forthcoming film, Brahma… [+2011 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Supreme Court To Hear Ram Sethu Plea: 5 Points About The Bridge", "description": "The Supreme Court on Wednesday a petition seeking to recognise Ram Sethu as a national heritage. The petition has been filed by Bharatiya Janata Party (BJP) leader Subramanian Swamy.", "url": "https://www.ndtv.com/india-news/supreme-court-to-hear-ram-sethu-as-national-monument-plea-5-points-about-the-bridge-3152919", "urlToImage": "https://i.ndtvimg.com/i/2018-03/ram-sethu-650_650x400_71521183285.jpg", "publishedAt": "2022-07-13T06:18:16Z", "content": "<li>Ram Sethu, also known as Adam's bridge, is a chain of limestone shoals between Pamban or Rameswaram Island off the south-eastern coast of Tamil Nadu and Mannar Island on the north-western coast o… [+999 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sri Lanka Declares State Of Emergency As President Rajapaksa Flees", "description": "Crisis-hit Sri Lanka declared a nationwide state of emergency on Wednesday, hours after President Gotabaya Rajapaksa fled the country, the Prime Minister's office said.", "url": "https://www.ndtv.com/world-news/sri-lanka-declares-state-of-emergency-after-president-gotabaya-rajapaksa-flees-news-agency-afp-quoting-pms-office-3152907", "urlToImage": "https://c.ndtvimg.com/2022-07/6e8tvps_sri-lanka-protest_625x300_10_July_22.jpg", "publishedAt": "2022-07-13T06:12:21Z", "content": "Sri Lanka crisis: Thousands of demonstrators had mobbed the premier's office. (File)\r\nColombo: Crisis-hit Sri Lanka declared an indefinite nationwide state of emergency on Wednesday, hours after Pres… [+1226 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Abhimanyu Bose", "title": "\"I Don't Think I Need The Tennis\": Did Roger Federer Hint At Retirement?", "description": "Roger Federer has not played since his exit from Wimbledon in the quarter-finals last year.", "url": "https://sports.ndtv.com/tennis/i-dont-think-i-need-the-tennis-did-roger-federer-hint-at-retirement-3152895", "urlToImage": "https://c.ndtvimg.com/2021-07/3avdis6o_roger-federer-afp_625x300_07_July_21.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-13T06:08:04Z", "content": "Swiss tennis ace Roger Federer last played a competitive match at Wimbledon last year, when he lost in straight sets to Hubert Hurkacz in the quarter-finals. The 40-year-old then had his third knee s… [+1392 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Mridusmita Deka", "title": "Fix Last Date For Admission To UG Courses: UGC To HEIs", "description": "The fixing of the last date by HEIs, as per UGC Chairman, will provide the Class 12 qualified students with sufficient time for admission to the undergraduate course.", "url": "https://www.ndtv.com/education/ugc-asks-higher-educational-institutions-hei-to-fix-last-date-for-admission-to-undergraduate-ug-programmes", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/13/UGC-university-grants-commission-featured-image.jpg", "publishedAt": "2022-07-13T06:07:16Z", "content": "New Delhi:The University Grants Commission (UGC) has asked higher education institutions (HEIs) to fix a last date for admission to undergraduate programmes after CBSE Class 12 result 2022 declaratio… [+1688 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Guru Purnima 2022: How To Make Classic Poori-Choley-Halwa For Bhog", "description": "Guru Purnima 2022: The day is observed with ritualistic puja of the Gurus (Guru Puja). Devotees also prepare bhog for their Gurus and offer to them.", "url": "https://food.ndtv.com/food-drinks/guru-purnima-2022-how-to-make-classic-poori-choley-halwa-for-bhog-recipes-inside-3152886", "urlToImage": "https://c.ndtvimg.com/2021-04/jreoc9p_halwa-poori_625x300_20_April_21.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-13T06:04:35Z", "content": "India is celebrating Guru Purnima today. One of the most auspicious Hindu festivals, this day is observed to honour the teachers, gurus and mentors in our lives. As per the Hindu calendar, this day i… [+2516 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "At Cop's Srinagar Funeral, \"Terrorist Associate\" Tag For Son Haunts Family", "description": "Two years ago, the fallen officer's son, Aaqib Mushtaq, an engineering graduate, was killed in a controversial encounter in Kulgam. Police termed him a \"terrorist associate\".", "url": "https://www.ndtv.com/india-news/mushtaq-ahmad-lone-at-cops-srinagar-funeral-terrorist-associate-tag-for-son-haunts-family-3152872", "urlToImage": "https://c.ndtvimg.com/2022-07/dq4fqqjo_mushtaq-ahmad-lone-family-pti_625x300_13_July_22.jpg", "publishedAt": "2022-07-13T06:03:05Z", "content": "Mushtaq Ahmad Lone's family was overcome with grief at his funeral.\r\nSrinagar: Minutes before the wreath-laying ceremony for Mushtaq Ahmad Lone at the Police Lines in Srinagar, the sombre gathering d… [+2514 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Delhi Shopkeeper Attacked By Group Of Men, Family Suspects Shop Owner Role", "description": "A 46-year-old shopkeeper was severely injured after a group of people allegedly attacked him in North Delhi's Kotwali area, police said on Wednesday.", "url": "https://www.ndtv.com/delhi-news/delhi-shopkeeper-attacked-by-group-of-men-family-suspects-shop-owner-role-3152736", "urlToImage": "https://c.ndtvimg.com/2019-08/cpo0305o_delhi-police-generic_625x300_13_August_19.jpg", "publishedAt": "2022-07-13T05:55:17Z", "content": "Delhi: Deepak Jain is undergoing treatment at a hospital in Daryaganj, police said. (Representational)\r\nNew Delhi: A 46-year-old shopkeeper was severely injured after a group of people allegedly atta… [+1832 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Asian News International", "title": "Singapore Open: PV Sindhu Makes Winning Start, Mithun Stuns Srikanth", "description": "Playing on court 1, PV Sindhu won the match within two straight games by margin of 21-15, 21-11", "url": "https://sports.ndtv.com/badminton/singapore-open-pv-sindhu-makes-winning-start-mithun-manjunath-stuns-kidambi-srikanth-3152847", "urlToImage": "https://c.ndtvimg.com/2022-07/3rladun_pv-sindhu-afp_625x300_13_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-13T05:51:12Z", "content": "Olympic medalist PV Sindhu made a winning start to her Singapore Open 2022 campaign, defeating Belgium's Lianne Tan in the first round of the Women's singles category on Wednesday. Playing on court 1… [+1610 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Adarsh Srivastava", "title": "Telangana Declares TS POLYCET Result 2022; Direct Link, Steps To Check", "description": "State Board of Technical Education and Training (SBTET) Telangana has declared the Telangana Polytechnic Common Entrance Test (TS POLYCET) 2022 result.", "url": "https://www.ndtv.com/education/telangana-declares-ts-polycet-result-2022-direct-link-steps-to-check", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/12/TS-POLYCET-Result-2022.jpg", "publishedAt": "2022-07-13T05:50:22Z", "content": "New Delhi:TS POLYCET Result 2022: State Board of Technical Education and Training (SBTET) Telangana has declared the Telangana Polytechnic Common Entrance Test (TS POLYCET) 2022 result. The TS POLYCE… [+1433 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Vedant Yadav", "title": "Rohit Sharma Becomes First Indian Batter To Achieve Big Feat In ODIs", "description": "England vs India: Rohit Sharma hit an unbeaten 76 off just 58 deliveries to help India register a 10-wicket win in the 1st ODI.", "url": "https://sports.ndtv.com/england-vs-india-2022/ind-vs-eng-rohit-sharma-becomes-first-india-batter-to-achieve-big-feat-in-odis-3152846", "urlToImage": "https://c.ndtvimg.com/2022-07/et0huifo_rohit-sharma-afp_625x300_13_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-13T05:49:33Z", "content": "India on Tuesday thrashed England by 10 wickets in the first ODI of the three-match series at the Oval in London. After electing to bowl, the Indian pacers -- Jasprit Bumrah and Mohammed Shami -- too… [+1332 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "1 Dead, 2 Injured In Landslide In Maharashtra's Palghar", "description": "One person died and two were seriously injured in the landslide incident in the Vasai area of Palghar district on Wednesday, officials said.", "url": "https://www.ndtv.com/india-news/maharashtra-rain-1-dead-2-injured-in-landslide-in-maharashtras-palghar-3152840", "urlToImage": "https://c.ndtvimg.com/2022-07/od1n57ho_palghar-landslide_625x300_13_July_22.jpg", "publishedAt": "2022-07-13T05:47:47Z", "content": "Rescue operations are underway.\r\nPalghar (Maharashtra): One person died and two were seriously injured in the landslide incident in the Vasai area of Palghar district on Wednesday, officials said.\r\nA… [+1077 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Biggest Supermoon Of 2022 Set To Appear Tonight. All Details Here", "description": "The biggest Supermoon of 2022 is set to appear tonight. This year will witness total of four full Supermoons with the third one being visible this week.", "url": "https://www.ndtv.com/world-news/biggest-supermoon-of-2022-set-to-appear-tonight-all-details-here-3152718", "urlToImage": "https://c.ndtvimg.com/2021-05/tmobonns_supermoontwitter650_625x300_26_May_21.jpg", "publishedAt": "2022-07-13T05:37:51Z", "content": "People around the world will be able to witness the supermoon till Friday early morning. (File)\r\nThe biggest Supermoon of 2022 is set to appear tonight. This year will witness total of four full Supe… [+1370 chars]"}]}