{"status": "ok", "totalResults": 275, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Army Jawan Drowns While Bathing In Ganga River In Uttarakhand: Police", "description": "An Army jawan drowned while bathing in the Ganga river near Rishikesh in Uttarakhand on Tuesday, police said.", "url": "https://www.ndtv.com/india-news/army-jawan-drowns-while-bathing-in-ganga-river-in-uttarakhand-3131251", "urlToImage": "https://c.ndtvimg.com/2022-06/ars722ac_police-generic_625x300_14_June_22.jpg", "publishedAt": "2022-07-05T21:58:29Z", "content": "Army jawan was on leave and on a trip to Rishikesh, police said. (Representational)\r\nDehradun: An Army jawan drowned while bathing in the Ganga river near Rishikesh in Uttarakhand on Tuesday, police … [+746 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Pak Government In Talks With Terror Group Pakistan Taliban To \"End Violence\"", "description": "A Pakistan parliamentary panel on Tuesday formally endorsed the talks with the banned Tehreek-i-Taliban Pakistan (TTP) to end the violence in the country, linking the final outcome of the dialogue with the approval of the government.", "url": "https://www.ndtv.com/world-news/pak-government-in-talks-with-terror-group-pakistan-taliban-to-end-violence-3131244", "urlToImage": "https://i.ndtvimg.com/i/2016-09/pakistan-taliban-ap_650x400_61472840501.jpg", "publishedAt": "2022-07-05T21:45:21Z", "content": "Pakistan parliamentary panel also endorsed talks with banned Tehreek-i-Taliban Pakistan terror group.\r\nIslamabad: A Pakistan parliamentary panel on Tuesday formally endorsed the talks with the banned… [+1820 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UK PM Names New Finance Minister After Rishi Sunak Resigns", "description": "British Prime Minister Boris Johnson late Tuesday named his Iraqi-born education secretary, Nadhim Zahawi, as finance minister after the shock resignation of Rishi Sunak.", "url": "https://www.ndtv.com/world-news/uk-boris-johnson-pm-names-new-finance-minister-after-rishi-sunak-resigns-3131231", "urlToImage": "https://c.ndtvimg.com/2021-02/8qdjqkgk_uk-minister-nadhim-zahawi-reuters-650_625x300_04_February_21.jpg", "publishedAt": "2022-07-05T21:12:46Z", "content": "UK Finance Minister Rishi Sunak and Health Secretary Sajid Javid had resigned on Tuesday.\r\nLondon: British Prime Minister Boris Johnson late Tuesday named his Iraqi-born education secretary, Nadhim Z… [+1094 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Delhi Government's Debt Increased By 7% In 4 Years Up To 2019-20: Audit Report", "description": "The Delhi government's debt increased by nearly seven per cent in the four-year period up to 2019-20 although it maintained a revenue surplus, according to a CAG audit report tabled in the Assembly on Tuesday.", "url": "https://www.ndtv.com/india-news/delhi-governments-debt-increased-by-7-in-4-years-up-to-2019-20-audit-report-3131221", "urlToImage": "https://c.ndtvimg.com/2022-05/fr7jugg8_arvind-kejriwal-ndtv-650_650x400_05_May_22.jpg", "publishedAt": "2022-07-05T20:49:20Z", "content": "Revenue receipts grew by Rs 4,023 crore (9.33 per cent) over the previous year, CAG report said.\r\nNew Delhi: The Delhi government's debt increased by nearly seven per cent in the four-year period up … [+2514 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Lack Of Seriousness\": US Slams Iran Over New Demands In Nuclear Talks", "description": "Iran has repeatedly introduced, over the recent weeks and months, extraneous demands that go beyond the confines of the nuclear deal struck in 2015, State Department spokesperson Ned Price said on Tuesday.", "url": "https://www.ndtv.com/world-news/us-slams-iran-over-new-demands-in-nuclear-talks-3131185", "urlToImage": "https://c.ndtvimg.com/2021-07/7arkdhhk_ned-price_625x300_02_July_21.jpg", "publishedAt": "2022-07-05T20:14:13Z", "content": "Us said that the new demands suggest a lack of seriousness on Tehran's behalf.\r\nWashington: Iran has repeatedly introduced, over the recent weeks and months, extraneous demands that go beyond the con… [+554 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "S Jaishankar Says India Has Taken \"Right Course\" On Ukraine Conflict", "description": "External Affairs Minister S Jaishankar on Tuesday said that India has taken the \"right course\" on the Ukraine conflict and the most urgent issue is to prevent hostilities from escalating to a level where they only do harm.", "url": "https://www.ndtv.com/india-news/s-jaishankar-says-india-has-taken-right-course-on-ukraine-conflict-3131167", "urlToImage": "https://c.ndtvimg.com/2021-08/hso19nhg_s-jaishankar_625x300_14_August_21.jpg", "publishedAt": "2022-07-05T19:56:09Z", "content": "Ukraine War: S Jaishankar said that India has done everything to prevent Ukarine war.\r\nNew Delhi: External Affairs Minister S Jaishankar on Tuesday said that India has taken the \"right course\" on the… [+2328 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Father-Son Duo Killed, 2 Girls Injured After Being Hit By Bus In UP", "description": "A father-son duo travelling by bicycle were killed and two others were injured after being hit by a bus in Bisauli Kotwali area here on Tuesday, police said.", "url": "https://www.ndtv.com/india-news/father-son-duo-killed-2-girls-injured-after-being-hit-by-bus-in-up-3131142", "urlToImage": "https://c.ndtvimg.com/2019-01/bh5lk67_car-accident-generic-unsplash-650_625x300_24_January_19.jpg", "publishedAt": "2022-07-05T19:16:19Z", "content": "2 girls, who were returning home from school, were also hit bus at the same time. (Representational)\r\nBadaun, Uttar Pradesh: A father-son duo travelling by bicycle were killed and two others were inj… [+1031 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "No Court Relief To Mumbai Woman Who Alleged Torture By Husband", "description": "The Bombay High Court has refused to annul the marriage of a 33-year-old woman, who claimed that she was forced to marry the man and was physically assaulted and tortured by him since she was 14 years old.", "url": "https://www.ndtv.com/india-news/bombay-high-court-refuses-to-grant-relief-to-woman-alleging-forced-marriage-3131114", "urlToImage": "https://c.ndtvimg.com/court-generic_625x300_1527245477936.jpg", "publishedAt": "2022-07-05T18:49:46Z", "content": "The Court noted that there was no evidence to the woman's claims and the overall evidence.\r\nMumbai: The Bombay High Court has refused to annul the marriage of a 33-year-old woman, who claimed that sh… [+3893 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Wimbledon 2022: Ons Jabeur Enters Semi-final With Win Over Marie Bouzkova", "description": "NewsOns Jabeur won the quarter-final match against Marie Bouzkova 3-6, 6-1, 6-1 in one hour and 47 minutes.", "url": "https://sports.ndtv.com/wimbledon-2022/wimbledon-2022-ons-jabeur-enters-semi-final-with-win-over-marie-bouzkova-3131101", "urlToImage": "https://c.ndtvimg.com/2022-07/m7g5oe18_ons-jabeur-afp_625x300_06_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-05T18:44:08Z", "content": "World number two Ons Jabeur battled back from a set down on Tuesday to beat Marie Bouzkova and set up a Wimbledon semi-final against unseeded Tatjana Maria. The Tunisian was broken twice as she lost … [+142 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Janhvi Imitates F.R.I.E.N.D.S' Janice's Iconic Laugh And \"Oh My God\" Line", "description": "Janhvi Kapoor is shooting for Bawaal with Varun Dhawan", "url": "https://www.ndtv.com/entertainment/janhvi-kapoor-imitates-f-r-i-e-n-d-s-janices-iconic-laugh-with-oh-my-god-line-see-video-3131109", "urlToImage": "https://c.ndtvimg.com/2022-07/qj2u30fo_janhvi-kapoor_625x300_06_July_22.jpg", "publishedAt": "2022-07-05T18:44:06Z", "content": "A still from the video. (courtesy: varundvn)\r\nVarun Dhawan, who is busy shooting for his next movie Bawaal with Janhvi Kapoor, share a video on his Instagram that shows Janhvi mimicking one of the po… [+1698 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Marshals Asked To Remove All BJP MLAs From Delhi Assembly For Disruption", "description": "Deputy Speaker of Delhi Assembly asked Marshals to remove all BJP MLAs from the Assembly after disruption over a debate on the issue raised by AAP MLAs over letters written for posting of DTC drivers.", "url": "https://www.ndtv.com/india-news/marshals-asked-to-remove-all-bjp-mlas-from-delhi-assembly-for-disruption-3131108", "urlToImage": "https://c.ndtvimg.com/2021-12/pt0qh61g_delhi-assembly-650_625x300_14_December_21.jpg", "publishedAt": "2022-07-05T18:41:35Z", "content": "Deputy Speaker of Delhi Assembly Rakhi Birla said there was consensus of the House for a debate.\r\nNew Delhi: BJP MLAs were marshalled out of the Delhi Assembly on Tuesday after they opposed discussio… [+1055 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Zee Anchor In Rahul Gandhi Fake News Released After Questioning: UP Cops", "description": "Zee TV news anchor Rohit Ranjan was arrested for questioning and has since been released, said the Uttar Pradesh police, whose personnel were caught on camera this morning fighting and jostling with their Chhattisgarjh counterparts for his custody.", "url": "https://www.ndtv.com/india-news/zee-anchor-in-rahul-gandhi-fake-news-released-after-questioning-up-cops-3131098", "urlToImage": "https://c.ndtvimg.com/2022-07/pkfrtrj_zee-anchor_650x400_05_July_22.jpg", "publishedAt": "2022-07-05T18:34:27Z", "content": "Rohit Ranjan was arrested days after the channel ran a misleading news item on Rahul Gandhi.\r\nZee TV news anchor Rohit Ranjan was arrested for questioning and has since been released, said the Uttar … [+1533 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "138 SpiceJet Passengers, Stranded For 11 Hours In Pak, Take Off For Dubai", "description": "After being stranded for nearly 11 hours in Karachi, 138 passengers of a Delhi-Dubai SpiceJet finally took off for Dubai in an alternate flight that was sent from India on Tuesday evening.", "url": "https://www.ndtv.com/india-news/138-spicejet-passengers-stranded-for-11-hours-in-pak-take-off-for-dubai-3131089", "urlToImage": "https://c.ndtvimg.com/2022-07/pplimjls_spicejet_625x300_06_July_22.jpg", "publishedAt": "2022-07-05T18:28:01Z", "content": "138 stranded passengers of SpiceJet leave for Dubai from Karachi in alternate aircraft\r\nNew Delhi: After being stranded for nearly 11 hours in Karachi, 138 passengers of a Delhi-Dubai SpiceJet finall… [+2216 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Court Rejects Rahul Gandhi's Plea In Defamation Case On Surname Remark", "description": "The Jharkhand High Court rejected a petition filed by Rahul Gandhi for quashing of a defamation case against him. Rahul Gandhi in one of his speech during 2019 Lok Sabha Polls said, \"All people with Modi as their surnames are thieves.\"", "url": "https://www.ndtv.com/india-news/jharkhand-high-court-rejects-rahul-gandhis-plea-in-defamation-case-on-modi-surname-remark-3131071", "urlToImage": "https://c.ndtvimg.com/2022-07/hg724m2o_rahul-gandhi-twitter_625x300_03_July_22.jpg", "publishedAt": "2022-07-05T18:19:21Z", "content": "The counsel also filed a separate civil defamation suit seeking Rs 20 crore in damages. (File)\r\nRanchi: The Jharkhand High Court on Tuesday rejected a petition filed by Congress leader Rahul Gandhi f… [+1316 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Mumbai On Heavy Rain Alert, 3,500 Moved To Safety Across Maharashtra", "description": "Over 3,500 people have been shifted to safer places from flood-prone and vulnerable spots across Maharashtra, where several districts, including Mumbai, experienced heavy rain, said Chief Minister Eknath Shinde.", "url": "https://www.ndtv.com/india-news/mumbai-on-heavy-rain-alert-3500-moved-to-safety-across-maharashtra-3131069", "urlToImage": "https://c.ndtvimg.com/2022-07/a0lbusvc_mumbai-rain-650_625x300_05_July_22.jpg", "publishedAt": "2022-07-05T18:17:19Z", "content": "State transport buses have been asked to ferry stranded passengers\r\nNew Delhi: Over 3,500 people have been shifted to safer places from flood-prone and vulnerable spots across Maharashtra, where seve… [+1163 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Man Takes Wrong Turn Using Maps In Gurugram, Made To Sweep Road By Cop", "description": "A man in Gurugram alleged that he was made to sweep the road by a police constable after he took a wrong turn using Google Maps to the stretch leading to the Recruit Training Centre in Bhondsi.", "url": "https://www.ndtv.com/gurgaon-news/man-takes-wrong-turn-using-maps-in-gurugram-made-to-sweep-road-by-police-3131057", "urlToImage": "https://c.ndtvimg.com/2019-12/pasi7rqs_gurgaon-police-generic_625x300_19_December_19.jpg", "publishedAt": "2022-07-05T18:07:39Z", "content": "A senior police official said action will be taken as per law following an inquiry.(Representational)\r\nGurugram: A man in Gurugram alleged that he was made to sweep the road by a constable after he t… [+1220 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"I'm Perfectly Fine\": Shruti Haasan On Rumours About Her Health", "description": "\"Yes, it is challenging, but no, it doesn't mean I am unwell or in critical condition,\" said Shruti Haasan", "url": "https://www.ndtv.com/entertainment/im-perfectly-fine-shruti-haasan-on-rumours-about-her-health-3131030", "urlToImage": "https://c.ndtvimg.com/2022-07/3mgo2dig_shruti-_625x300_05_July_22.jpg", "publishedAt": "2022-07-05T17:57:49Z", "content": "Shruti Haasan. (courtesy: shrutzhaasan)\r\nShruti Haasan, who recently opened up about her struggle with Polycystic Ovary Syndrome (PCOS) and Endometriosis, has shared a health update, amid the rumours… [+2247 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "After Reported Unhappiness, Devendra Fadnavis Says He Chose Eknath Shinde", "description": "Devendra Fadnavis, the two-time Chief Minister of Maharashtra, who was widely expected to have a third turn at the post, today said it was his idea that Shiv Sena's Eknath Shinde take the job instead. Mr Fadnavis, after announcing on Thursday morning", "url": "https://www.ndtv.com/india-news/after-reported-unhappiness-devendra-fadnavis-says-he-chose-eknath-shinde-3131010", "urlToImage": "https://c.ndtvimg.com/2022-06/g6jhnni_devendra-fadnavis-eknath-shinde-ani-650-_650x400_30_June_22.jpg", "publishedAt": "2022-07-05T17:46:41Z", "content": "\"I changed my decision obeying the orders of my leaders,\" Devendra Fadnavis said.\r\nDevendra Fadnavis, the two-time Chief Minister of Maharashtra who was widely expected to have a third turn at the po… [+3127 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Air Force Receives 7.5 Lakh Applications Under Agnipath Recruitment Scheme", "description": "Agnipath Scheme: The Indian Air Force on Tuesday said it has received 7.5 lakh applications under the \"Agnipath\" recruitment scheme.", "url": "https://www.ndtv.com/india-news/indian-air-force-receives-7-5-lakh-applications-under-agnipath-recruitment-scheme-3131006", "urlToImage": "https://c.ndtvimg.com/2020-08/8d5s4c44_air-force-twitter_625x300_27_August_20.jpg", "publishedAt": "2022-07-05T17:45:10Z", "content": "The registrations began on June 24 and it ended on Tuesday.\r\nNew Delhi: The Indian Air Force (IAF) on Tuesday said it has received 7.5 lakh applications under the \"Agnipath\" recruitment scheme.\r\nThe … [+1843 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Eknath Shinde Backstabbed Me,\" Says Uddhav Thackeray", "description": "Days after he resigned as the Chief Minister of Maharashtra, Uddhav Thackeray on Tuesday said Eknath Shinde, who led the rebellion with party MLAs to bring down Maha Vikas Aghadi (MVA) government, backstabbed him.", "url": "https://www.ndtv.com/india-news/eknath-shinde-backstabbed-me-says-uddhav-thackeray-3130994", "urlToImage": "https://c.ndtvimg.com/2022-06/9r2ahp7_uddhav-thackeray-ndtv_625x300_29_June_22.jpg", "publishedAt": "2022-07-05T17:37:15Z", "content": "Eknath Shinde to whom I gave Sena responsibility backstabbed me, said Uddhav Thackeray (FILE)\r\nMumbai: Days after he resigned as the Chief Minister of Maharashtra, Uddhav Thackeray on Tuesday said Ek… [+1925 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Autorickshaw Outpaced Mercedes\": Eknath Shinde Jabs Uddhav Thackeray", "description": "Maharashtra Chief Minister Eknath Shinde on Tuesday took a dig at Shiv Sena president Uddhav Thackeray, saying an autorickshaw has outpaced Mercedes car. In his early days, Eknath Shinde used to drive an autorickshaw.", "url": "https://www.ndtv.com/india-news/autorickshaw-outpaced-mercedes-maharashtra-chief-minister-eknath-shinde-jabs-uddhav-thackeray-3130985", "urlToImage": "https://c.ndtvimg.com/2022-07/69mm8de_eknath-shinde-devendra-fadnavis-ani-650_650x400_04_July_22.jpg", "publishedAt": "2022-07-05T17:36:29Z", "content": "Devendra Fadnavis earlier called Aaditya Thackeray \"Mercedes baby\".\r\nMumbai: Apparently referring to his past when he used to drive an autorickshaw to earn living, Maharashtra Chief Minister Eknath S… [+1338 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "IND vs ENG: Joe Root Joins Elite Company With 737 Runs In Test Series", "description": "Former England captain Joe Root rounded off the memorable five-match Test series against India with a majestic 142 not out.", "url": "https://sports.ndtv.com/england-vs-india-2022/india-vs-england-joe-root-joins-elite-company-with-737-runs-in-test-series-3130970", "urlToImage": "https://c.ndtvimg.com/2022-07/8u82vpt8_joe-root-afp_625x300_05_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-05T17:29:39Z", "content": "Joe Root has joined a select group of England players after making 737 runs in England's drawn Test series against India. The former England captain rounded off the campaign with a majestic 142 not o… [+752 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "BJP Demands Anti-Terror Agency Probe In Lashkar Terrorist's Arrest", "description": "BJP alleged a \"new terror plan\" to target the party after a Lashkar-e-Taiba (LeT) terrorist was arrested in Jammu and Kashmir and demanded a probe into the matter by the National Investigation Agency (NIA).", "url": "https://www.ndtv.com/india-news/bjp-demands-nia-probe-in-lashkar-terrorists-arrest-in-jammu-and-kashmir-3130958", "urlToImage": "https://c.ndtvimg.com/2019-02/m1p57ej8_jkbjpchiefravinder-raina650_625x300_04_February_19.jpg", "publishedAt": "2022-07-05T17:24:29Z", "content": "We want to know where were the terrorist's target in BJP, party spokesperson said.\r\nJammu: Alleging that the recently arrested Lashkar-e-Taiba (LeT) terrorist was part of a \"new terror plan\" to targe… [+3704 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "IND vs ENG, 5th Test: Three Things We Learned From England's Historic Win", "description": "England successfully chased down a target of 378 runs against India, their highest-ever in Test cricket.", "url": "https://sports.ndtv.com/cricket/india-vs-england-5th-test-three-things-we-learned-from-englands-historic-win-3130938", "urlToImage": "https://c.ndtvimg.com/2022-07/aubp8m6g_joe-root-afp_625x300_05_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-05T17:19:06Z", "content": "England defeated India in thrilling fashion to win the Covid-delayed fifth Test at Edgbaston on Tuesday by seven wickets. Set 378, more than any other England team have made in the fourth innings to … [+2180 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UK's Rishi Sunak, Health Minister Quit In Huge Crisis For Boris Johnson", "description": "UK Finance Minister Rishi Sunak and Health Secretary Sajid Javid resigned on Tuesday, plunging Prime Minister Boris Johnson's government into crisis.", "url": "https://www.ndtv.com/world-news/uk-finance-minister-rishi-sunak-health-secretary-sajid-javid-quit-citing-boris-johnsons-leadership-3130937", "urlToImage": "https://c.ndtvimg.com/2021-08/urn5beog_rishi-sunak-reuters-650_625x300_09_August_21.jpg", "publishedAt": "2022-07-05T17:17:48Z", "content": "UK Finance Minister Rishi Sunak and Health Secretary Sajid Javid resigned on Tuesday, plunging Prime Minister Boris Johnson's government into crisis.\r\nMr Sunak, in his letter, said he was \"sad to be … [+1520 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ex-Mumbai Civic Body Official Dies In Swimming Pool: Cops", "description": "A 73-year-old retired official of Brihanmumbai Municipal Corporation (BMC) died while swimming at a civic-run swimming pool in suburban Kandivali, police said on Tuesday.", "url": "https://www.ndtv.com/mumbai-news/ex-mumbai-civic-body-bmc-official-dies-in-swimming-pool-cops-3130921", "urlToImage": "https://c.ndtvimg.com/2022-06/ars722ac_police-generic_625x300_14_June_22.jpg", "publishedAt": "2022-07-05T17:12:44Z", "content": "The police said the official used to regularly come for swimming. (Representational)\r\nMumbai: A 73-year-old retired official of Brihanmumbai Municipal Corporation (BMC) died while swimming at a civic… [+847 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ajay Devgn's Daughter Nysa Holidays In Spain With Her Friends. See Pics", "description": "After Amsterdam, Nysa Devgan is holidaying in Spain", "url": "https://www.ndtv.com/entertainment/ajay-devgns-daughter-nysa-holidays-in-spain-with-her-friends-see-pics-3130894", "urlToImage": "https://c.ndtvimg.com/2022-07/9ngncf9o_nysa-devgn_625x300_05_July_22.jpg", "publishedAt": "2022-07-05T17:07:59Z", "content": "Nysa Devgan with her friends. (courtesy: orry1)\r\nNysa Devgan, daughter of actor couple Ajay Devgn and Kajol, is currently on vacation with her friends in Spain. Nysa's friend Orhan Awatramani shared … [+1718 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Wimbledon 2022: Djokovic Battles From Two Sets Down To Reach Semi-final", "description": "Novak Djokovic, who won 5-7, 2-6, 6-3, 6-2, 6-2 on Tuesday, will face either Cameron Norrie or David Goffin for a place in Sunday's final.", "url": "https://sports.ndtv.com/tennis/wimbledon-2022-novak-djokovic-battles-from-two-sets-down-to-reach-11th-semi-final-3130878", "urlToImage": "https://c.ndtvimg.com/2022-07/h5o85pf8_novak-djokovic-afp_625x300_05_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-05T17:03:40Z", "content": "Defending champion Novak Djokovic battled back from two sets to love down to defeat Jannik Sinner and reach his 11th Wimbledon semi-final on Tuesday. Djokovic triumphed 5-7, 2-6, 6-3, 6-2, 6-2 and wi… [+3623 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "What Next For Vladimir Putin In Ukraine Fight?", "description": "Russian President Vladimir Putin must now decide his next steps in the five-month invasion he started in February.", "url": "https://www.ndtv.com/world-news/what-next-for-vladimir-putin-in-ukraine-fight-3130850", "urlToImage": "https://c.ndtvimg.com/2022-05/dh4ebmoo_vladimir-putin-reuters_625x300_15_May_22.jpg", "publishedAt": "2022-07-05T16:56:50Z", "content": "Russia itself is suffering heavy costs from Western sanctions, battlefield casualties.\r\nParis, France: Russian President Vladimir Putin must now decide his next steps in the five-month invasion he st… [+4413 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Teen Found Buried Near Delhi Ridge 2 Days After Kidnapping Caught On CCTV", "description": "A minor was kidnapped at knife-point, stabbed to death, his body was buried and clothes were burnt to hide evidence. All this over a minor dispute.", "url": "https://www.ndtv.com/delhi-news/he-was-found-buried-in-delhi-ridge-2-days-after-kidnapping-caught-on-cctv-3130844", "urlToImage": "https://c.ndtvimg.com/2019-05/fkcrjpmg_delhi-police-generic_625x300_27_May_19.jpg", "publishedAt": "2022-07-05T16:55:21Z", "content": "The accused revealed they had personal enmity towards the victim, police said. (Representational)\r\nNew Delhi: A minor was kidnapped at knife-point, stabbed to death, his body was buried and clothes w… [+1010 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "July 4 Gunman Planned Attack For Weeks, Wore Women's Clothes: Police", "description": "US police said Tuesday that the suspected gunman who opened fire at a July 4 holiday parade in a Chicago suburb had planned the attack for weeks and wore women's clothes to try to cover up his facial tattoos.", "url": "https://www.ndtv.com/world-news/july-4-gunman-planned-attack-for-weeks-wore-womens-clothes-police-3130825", "urlToImage": "https://c.ndtvimg.com/2022-07/sofuuh6c_us-parade-shooting_625x300_05_July_22.jpg", "publishedAt": "2022-07-05T16:52:16Z", "content": "US Parade Shooting: The suspect, identified as Robert Crimo was taken into custody.\r\nHighland Park, United States: US police said Tuesday that the suspected gunman who opened fire at a July 4 holiday… [+1037 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Holiday For Educational Institutions In Coastal Karnataka Tomorrow", "description": "Educational institutions remained closed in the two districts on Tuesday also as per an earlier order.", "url": "https://www.ndtv.com/education/holiday-for-educational-institutions-in-coastal-karnataka-tomorrow-due-to-rains", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/5/empty-class.jpg", "publishedAt": "2022-07-05T16:38:56Z", "content": "Mangaluru:The district administrations of Dakshina Kannada (DK) and Udupi have declared holiday for all educational institutions on Wednesday in view of continuing rains in the coastal region. DK dep… [+1017 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Lalu Prasad Yadav In Hospital, PM Modi Dials Son Tejashwi For Update", "description": "Prime Minister Narendra Modi on Tuesday enquired about the health of RJD supremo and former Bihar Chief Minister Lalu Prasad Yadav, who fractured his right shoulder after suffering a fall at his house.", "url": "https://www.ndtv.com/india-news/lalu-prasad-yadav-in-hospital-pm-modi-dials-son-tejashwi-for-update-3130755", "urlToImage": "https://c.ndtvimg.com/2021-10/833ha9l8_lalu-yadav-reached-tej-pratap-yadav-home_625x300_24_October_21.jpg", "publishedAt": "2022-07-05T16:33:37Z", "content": "Lalu Yadav is undergoing treatment and is being monitored by multiple doctors\r\nPatna: Prime Minister Narendra Modi on Tuesday enquired about the health of RJD supremo and former Bihar Chief Minister … [+770 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Man Run Over By Bus After Motorbike Hits Pothole In Maharashtra: Report", "description": "A man was run over by a bus on Tuesday when he fell down after his motorcycle hit a pothole on GB Road in Maharashtra's Thane city, a civic official said.", "url": "https://www.ndtv.com/cities/man-run-over-bus-after-motorbike-hits-pothole-in-maharashtra-report-3130705", "urlToImage": "https://c.ndtvimg.com/mi2p3td8_death-generic_625x300_12_August_18.jpg", "publishedAt": "2022-07-05T16:16:29Z", "content": "A police probe is underway, the civic official said. (Representational)\r\nThane: A man was run over by a bus on Tuesday when he fell down after his motorcycle hit a pothole on GB Road in Maharashtra's… [+485 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Razorpay Shared Donor Data With Cops: Fact-Checking Site Alt News", "description": "Fact-checking website Alt News on Tuesday alleged that payment gateway Razorpay had shared its donor data with the police without informing it.", "url": "https://www.ndtv.com/india-news/razorpay-shared-donor-data-with-cops-fact-checking-site-alt-news-3130695", "urlToImage": "https://c.ndtvimg.com/2022-06/gcubof4g_mohamed-zubair-650_650x400_27_June_22.jpg", "publishedAt": "2022-07-05T16:12:56Z", "content": "Delhi Police has arrested Alt News' co-founder Mohammed Zubair.\r\nNew Delhi: Fact-checking website Alt News on Tuesday alleged that payment gateway Razorpay had shared its donor data with the police w… [+1859 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Delhi Government's Draft Policy Mandates All-Electric Fleet For Cabs", "description": "The Delhi government's draft aggregator policy mandates transition to an all-electric fleet for cab companies, food delivery firms and e-commerce entities by April 1, 2030 and proposes a fine of Rs 50,000 per vehicle.", "url": "https://www.ndtv.com/india-news/delhi-governments-draft-policy-delhi-motor-vehicle-aggregator-scheme-mandates-all-electric-fleet-for-cabs-food-delivery-firms-3130658", "urlToImage": "https://c.ndtvimg.com/2019-09/768nklo_delhi-cabs-ani_625x300_19_September_19.jpg", "publishedAt": "2022-07-05T15:59:35Z", "content": "Drivers with less than 3.5 ratings for 1 year should undertake remedial trainings. (File)\r\nNew Delhi: The Delhi government's draft aggregator policy mandates transition to an all-electric fleet for c… [+6881 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rihanna Is US' Youngest Self-Made Billionaire With $1.4 Billion Net Worth", "description": "After Rihanna, the next-youngest billionaire on Forbes' list is 41-year-old Kim Kardashian, who has a net worth of $1.8 billion.", "url": "https://www.ndtv.com/entertainment/rihanna-is-us-youngest-self-made-billionaire-woman-with-1-4-billion-net-worth-3130646", "urlToImage": "https://c.ndtvimg.com/2022-05/73l0ml98_rihanna_625x300_03_May_22.jpg", "publishedAt": "2022-07-05T15:56:08Z", "content": "Rihanna's net worth is now $1.4 billion, according to Forbes.\r\nPop star Rihanna is the youngest self-made billionaire woman in the United States, as per Forbes 2022 list.\r\nThe 34-year-old singer rece… [+1545 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Arjun Calls Malaika \"Shopaholic\" In This Pic From Their Paris Vacation", "description": "Arjun Kapoor will be next seen in Ek Villain Returns", "url": "https://www.ndtv.com/entertainment/arjun-kapoor-calls-girlfriend-malaika-arora-shopaholic-in-this-pic-from-their-paris-vacation-3130622", "urlToImage": "https://c.ndtvimg.com/2022-07/sqgulpg8_arjun-kapoor_625x300_05_July_22.jpg", "publishedAt": "2022-07-05T15:50:19Z", "content": "Arjun Kapoor shared this picture. (courtesy: arjunkapoor)\r\nArjun Kapoor recently returned from his Paris vacation with his girlfriend Malaika Arora. However, it seems his heart is still in Paris as h… [+1401 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Rashi Hardaha", "title": "Tripura Board 10th, 12th Result Date: Official Website, Steps To Check", "description": "Tripura Board 10th, 12th Result 2022: To access the roll number and registration number TBSE term 2 Class 10 and TBSE Class 12 term 2 results, the students need to enter their roll number and registration number.", "url": "https://www.ndtv.com/education/tripura-board-10th-12th-result-date-official-website-steps-to-check-tbse-result-2022", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/5/TBSE_term_2_result.jpg", "publishedAt": "2022-07-05T15:50:03Z", "content": "Tripura Board 10th, 12th Result 2022: The Tripura Board of Secondary Education (TBSE) is expected to announce the Madhyamik (Class 10), Uccha Madhyamik (Class 12) term 2 results 2022 on Thursday, Jul… [+1157 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Why Does Mumbai Get Clogged In The Rain? 5 Factors Behind Monsoon Misery", "description": "Mumbai waterlogging, explained: As rain hit the city and suburbs Monday night, Sion and Andheri were already flooded  part of a pattern", "url": "https://www.ndtv.com/india-news/why-does-mumbai-get-clogged-in-the-rain-here-are-5-factors-that-play-a-part-in-mumbai-monsoon-waterlogging-3130560", "urlToImage": "https://c.ndtvimg.com/2022-07/c1e28e4o_mumbai-rain-pti-pic_650x400_05_July_22.jpg", "publishedAt": "2022-07-05T15:34:17Z", "content": "Mumbai: Beyond the Instagram stories that romanticise the weather, for many parts of Mumbai, rain spells deep trouble quite literally as waterlogging disrupts life and sometimes even leads to horror … [+2166 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Arvind Kejriwal Alleges That The Centre \"May Dissolve Delhi Assembly\" - NDTV", "description": "<ol><li>Arvind Kejriwal Alleges That The Centre \"May Dissolve Delhi Assembly\"  NDTV\r\n</li><li>Will approach court to get MCD polls conducted on time, says Delhi CM Arvind Kejriwal; AAP leader accuses  Times of India\r\n</li><li>BJP planning to turn Delhi into a…", "url": "https://www.ndtv.com/india-news/arvind-kejriwal-alleges-that-the-centre-may-dissolve-delhi-assembly-3130138", "urlToImage": "https://c.ndtvimg.com/2022-06/v4i2ukko_arvind-kejriwal_650x400_02_June_22.jpg", "publishedAt": "2022-07-05T15:31:40Z", "content": "The AAP chief added, \"Kejriwal is not important, but the county is.\" (File)\r\nNew Delhi: AAP supremo Arvind Kejriwal on Tuesday alleged there are talks that the Centre may dissolve Delhi Assembly and … [+1758 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Here's The Reason Why India Dropped Below Pakistan In WTC Points Table", "description": "Pakistan have jumped above India in the ICC World Test Championship standings after the latter were penalised for slow over-rate in the Edgbaston Test.", "url": "https://sports.ndtv.com/england-vs-india-2022/heres-the-reason-why-india-dropped-below-pakistan-in-wtc-points-table-3130526", "urlToImage": "https://c.ndtvimg.com/2022-07/ogv85f48_indian-cricket-team_625x300_05_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-05T15:28:09Z", "content": "India were on Tuesday fined 40 per cent of their match fee and penalised two ICC World Test Championship points for maintaining a slow over-rate against England in the rescheduled fifth Test in Birmi… [+1571 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Viral Photo Shows Baby In Full Face Mask On New Zealand Flight", "description": "A photograph of a baby wearing a full face mask on an Air New Zealand flight has gone viral on the internet and has sparked an online debate.", "url": "https://www.ndtv.com/offbeat/viral-photo-shows-baby-in-full-face-mask-on-new-zealand-flight-3130509", "urlToImage": "https://c.ndtvimg.com/2022-07/jo2la7ho_baby-wearing-full-face-mask_625x300_05_July_22.jpg", "publishedAt": "2022-07-05T15:20:46Z", "content": "The child is seen wearing an adult-sized face mask, with two little eye holes cut out.\r\nA photograph of a baby wearing a full face mask on an Air New Zealand flight has gone viral on the internet and… [+2232 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "After Reported Unhappiness, Devendra Fadnavis Says He Chose Eknath Shinde - NDTV", "description": "<ol><li>After Reported Unhappiness, Devendra Fadnavis Says He Chose Eknath Shinde  NDTV\r\n</li><li>Mumbai rains LIVE updates: Maha CM Eknath Shinde visits BMC disaster management room, takes stock of situation  India Today\r\n</li><li>SC to hear Uddhav camp’s pe…", "url": "https://www.ndtv.com/india-news/eknath-shinde-made-cm-on-my-proposal-to-party-leaders-devendra-fadnavis-3129952", "urlToImage": "https://c.ndtvimg.com/2022-06/g6jhnni_devendra-fadnavis-eknath-shinde-ani-650-_650x400_30_June_22.jpg", "publishedAt": "2022-07-05T15:18:00Z", "content": "Devendra Fadnavis said he was \"obeying the orders of my leaders\". (File)\r\nNagpur: Maharashtra Deputy Chief Minister Devendra Fadnavis on Tuesday said he had proposed to BJP leadership to make Eknath … [+1898 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Mridusmita Deka", "title": "Odisha Matric Class 10 Result 2022 For Over 5.8 Lakh Students Tomorrow", "description": "As many as 5,85,730 students await Odisha Class 10th result 2022. BSE Odisha websites inclduing bseodisha.nic.in and orissaresults.nic.in will host the BSE matric result 2022 Odisha.", "url": "https://www.ndtv.com/education/odisha-matric-class-10-result-2022-for-over-5-8-lakh-students-tomorrow", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/5/results-out-featured-image.jpg", "publishedAt": "2022-07-05T15:13:03Z", "content": "New Delhi:The Board of Secondary Education (BSE) Odisha Class 10 Matric result will be declared tomorrow, July 6, for as many as 5,85,730 students. The Odisha Class 10th result 2022 websites -- bseod… [+1600 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Mira Rajput Takes A Day Off As She Enjoys London Summer. See Pics", "description": "Mira Rajput is holidaying in London", "url": "https://www.ndtv.com/entertainment/mira-rajput-takes-a-day-off-as-she-enjoys-london-summer-see-pics-3130379", "urlToImage": "https://c.ndtvimg.com/2022-07/9ol1oc28_mira-rajput_625x300_05_July_22.jpg", "publishedAt": "2022-07-05T14:47:56Z", "content": "Mira Rajput shared this picture. (courtesy: mira.kapoor)\r\nShahid Kapoor's wife, Mira Rajput, is having the time of her life as she now holidays in London with her kids - Misha and Zain. Recently, she… [+1365 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "\"Let The Match Slip Away...\": Jasprit Bumrah On India's Loss In Edgbaston", "description": "England overhauled a 378-run target against India in the morning session of the fifth and final day with Joe Root and Jonny Bairstow remaining unbeaten on 142 and 114 respectively", "url": "https://sports.ndtv.com/england-vs-india-2022/let-the-match-slip-away-skipper-jasprit-bumrah-underlines-reason-behind-indias-loss-to-england-in-edgbaston-test-3130356", "urlToImage": "https://c.ndtvimg.com/2022-07/ql3anhcg_jonny-bairstow-joe-root-twitter_625x300_05_July_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-05T14:41:23Z", "content": "India stand-in captain Jasprit Bumrah on Tuesday attributed his side's defeat to England in the rescheduled fifth Test here to the batting failure in the second innings, saying they let the match sli… [+4499 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Watch: Man In Russia-Occupied Kherson Plays Ukrainian National Anthem", "description": "Amid the ongoing war in Ukraine, a video showing an elderly man playing the Ukrainian national anthem while travelling on his mobility scooter has gone viral on the internet.", "url": "https://www.ndtv.com/offbeat/watch-elderly-man-in-russia-occupied-kherson-plays-ukrainian-national-anthem-internet-says-bravo-3130298", "urlToImage": "https://c.ndtvimg.com/2022-07/114g46l8_ukraine-elderly-man_625x300_05_July_22.jpg", "publishedAt": "2022-07-05T14:26:25Z", "content": "The video has garnered more than 198,000 views.\r\nAmid the ongoing war in Ukraine, a video showing an elderly man playing the Ukrainian national anthem while travelling on his mobility scooter has gon… [+2373 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "What Ranveer Had To leave Behind For Ranveer Vs Wild With Bear Grylls", "description": "\"You know things are getting serious when I left my wardrobe behind,\" wrote Ranveer", "url": "https://www.ndtv.com/entertainment/what-ranveer-singh-had-to-leave-behind-for-ranveer-vs-wild-with-bear-grylls-3130295", "urlToImage": "https://c.ndtvimg.com/2022-07/3kdq69lg_ranveer_625x300_05_July_22.jpg", "publishedAt": "2022-07-05T14:24:51Z", "content": "Ranveer Singh in Twitter video (courtesy: RanveerOfficial)\r\nNew Delhi: Ranveer Singh is all set to explore the wild in the upcoming episode of Ranveer Vs Wild With Bear Grylls. In the trailer, which … [+1777 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Punjab Cabinet Expansion: Chief Minister Allots Portfolios To Ministers", "description": "Punjab Chief Minister Bhagwant Mann on Tuesday allocated portfolios to the five newly inducted ministers a day after the first cabinet expansion of his over three-month-old government.", "url": "https://www.ndtv.com/india-news/punjab-cabinet-expansion-chief-minister-bhagwant-mann-allots-portfolios-to-ministers-3130260", "urlToImage": "https://c.ndtvimg.com/2022-04/57fcqk3_bhagwant-mann_625x300_16_April_22.jpg", "publishedAt": "2022-07-05T14:14:36Z", "content": "MLA Anmol Gagan Mann was allocated Tourism and Cultural Affairs.\r\nChandigarh: Punjab Chief Minister Bhagwant Mann on Tuesday allocated portfolios to the five newly inducted ministers a day after the … [+3837 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Women's Hockey WC 2022: When And Where To Watch India vs China Match", "description": "Both China and India are equal on points after playing out a draw in their respective opening matches at Women's FIH Hockey World Cup 2022.", "url": "https://sports.ndtv.com/hockey/womens-fih-hockey-world-cup-2022-india-vs-china-when-and-where-to-watch-live-telecast-live-streaming-3130240", "urlToImage": "https://c.ndtvimg.com/2022-07/p9okrcgo_india-women-hockey-india_625x300_03_July_22.jpeg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-05T14:10:59Z", "content": "After a 1-1 draw against a higher-ranked England side in their opening match at Women's FIH Hockey World Cup 2022, the Indian team will be high on confidence when they meet China for their second gam… [+1523 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Adarsh Srivastava", "title": "KEAM 2022 Answer Key for Paper 1,2 Released; Download Steps Here", "description": "The Commissioner for Entrance Examinations (CEE) Kerala has released the Kerala Engineering Architecture Pharmacy and Medical Exam (KEAM) answer key 2022. The KEAM paper 1 and paper 2 answer key download window is available.", "url": "https://www.ndtv.com/education/kerala-engineering-architecture-medical-keam-2022-answer-key-out-download-steps-here", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/5/KEAM-2022-Answer-Key.jpg", "publishedAt": "2022-07-05T14:10:22Z", "content": "The Commissioner for Entrance Examinations (CEE) Kerala has released the Kerala Engineering Architecture Pharmacy and Medical Exam (KEAM) answer key 2022. The KEAM paper 1 and paper 2 answer key down… [+1764 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Fresh Plea In Supreme Court Challenges 'Agnipath' Scheme", "description": "A fresh plea has been filed in the Supreme Court challenging the Centre's 'Agnipath' scheme for recruitment in the armed forces.", "url": "https://www.ndtv.com/india-news/fresh-plea-in-supreme-court-challenges-agnipath-scheme-3130225", "urlToImage": "https://c.ndtvimg.com/2022-06/ff8iu6dg_agniveers_625x300_14_June_22.jpg", "publishedAt": "2022-07-05T14:07:57Z", "content": "The petition contends that Agnipath scheme jeopardizes the future of aspirants\r\nNew Delhi: A fresh plea has been filed in the Supreme Court challenging the Centre's 'Agnipath' scheme for recruitment … [+2626 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "I Shall Fight And Give Strength To Shiv Sena, Says Uddhav Thackeray", "description": "Uddhav Thackeray said it was 'painful' to see those MLAs, Ministers who won due to Shiv Sena workers and got everything (positions in the party) have left him. He said he will fight and give strength to Shiv Sena.", "url": "https://www.ndtv.com/india-news/i-shall-fight-and-give-strength-to-shiv-sena-says-uddhav-thackeray-3130205", "urlToImage": "https://c.ndtvimg.com/2022-06/2kllv7do_uddhav-thackeray-reuters-650_625x300_30_June_22.jpg", "publishedAt": "2022-07-05T14:04:16Z", "content": "\"Those who didn't get anything are with me,\" Uddhav Thackeray told Shiv Sena workers. (File)\r\nAurangabad: Former Maharashtra Chief Minister Uddhav Thackeray has said that he was \"hurt\" to see some me… [+2214 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Rashi Hardaha", "title": "NID DAT 2022: MDes Final Result Announced; Direct Link", "description": "NID DAT MDes Result 2022: The National Institute of Design (NID) has announced the Design Aptitude Test (DAT) 2022 result for the Master of Design (MDes) programme.", "url": "https://www.ndtv.com/education/nid-dat-2022-mdes-final-result-announced-direct-link-to-download-scorecard", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/5/shutterstock_1232307976_5.jpg", "publishedAt": "2022-07-05T14:01:56Z", "content": "NID DAT MDes Result 2022: The National Institute of Design (NID) has announced the Design Aptitude Test (DAT) 2022 result for the Master of Design (MDes) programme today, July 5. The NID DAT MDes 202… [+2034 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sajjan Kumar's Bail Plea In Anti-Sikh Riots Case Stayed By Delhi Court", "description": "The Delhi High Court has stayed an order granting bail to former Congress leader Sajjan Kumar in a rioting and murder case arising from the 1984 anti-Sikh riots in which the trial is continuing.", "url": "https://www.ndtv.com/india-news/sajjan-kumars-bail-plea-in-anti-sikh-riots-case-stayed-by-delhi-court-3130190", "urlToImage": "https://c.ndtvimg.com/2018-12/eoma68qg_sajjan-kumar-pti-650_625x300_20_December_18.jpg", "publishedAt": "2022-07-05T14:00:49Z", "content": "Sajjan Kumar is already convicted in a similar case and is in custody. (File)\r\nNew Delhi: The Delhi High Court has stayed an order granting bail to former Congress leader Sajjan Kumar in a rioting an… [+3712 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Vice-President Polls: 5 People File Papers On Day 1 Of Nomination Process", "description": "Five people, including one who goes by the alias \"Ramayani Chaiwala\", filed papers on Tuesday, the first day of the nomination process for the August 6 vice-presidential election. July 19 is the last date for filing nominations.", "url": "https://www.ndtv.com/india-news/vice-president-polls-5-people-file-papers-on-day-1-of-nomination-process-3130136", "urlToImage": "https://c.ndtvimg.com/2019-07/rtvrrj68_parliament-generic-pti_625x300_23_July_19.jpg", "publishedAt": "2022-07-05T13:45:50Z", "content": "A candidate can file a maximum of four nomination papers. (Representational)\r\nNew Delhi: Five people, including one who goes by the alias \"Ramayani Chaiwala\", filed papers on Tuesday, the first day o… [+3176 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Mridusmita Deka", "title": "University Of Allahabad Extends PGAT 2022 Application Deadline", "description": "The Allahabad University PGAT application portal will now remain open till July 8. Candidates can apply online at the university website -- aupravesh2022.in.", "url": "https://www.ndtv.com/education/university-of-allahabad-extends-pgat-2022-application-deadline", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/5/application-featured-image.jpg", "publishedAt": "2022-07-05T13:43:22Z", "content": "New Delhi:The University of Allahabad has extended the application process for the Postgraduate Admission Test (PGAT). PGAT 2022 will be held as an admission test for postgraduate, research and sever… [+1289 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Shilpa Shares An Adorable Pic With Husband Raj Kundra From Paris Vacation", "description": "Shilpa Shetty and Raj Kundra are holidaying in Paris", "url": "https://www.ndtv.com/entertainment/shilpa-shetty-shares-an-adorable-pic-with-husband-raj-kundra-from-paris-vacation-3130111", "urlToImage": "https://c.ndtvimg.com/2022-07/ft0tsvm8_shilpa-shetty_625x300_05_July_22.jpg", "publishedAt": "2022-07-05T13:42:30Z", "content": "Shilpa Shetty with Raj Kundra. (courtesy: theshilpashetty)\r\nShilpa Shetty, who was holidaying in London with her family, including sister Shamita Shetty, has now jetted off to Paris. The actress has … [+1875 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "\"Can Always Look At Hindsight\": Dravid On Decision To Not Pick Ashwin", "description": "Head coach Rahul Dravid was asked if India missed a trick by not including veteran spinner Ravichandran Ashwin in the post match press conference. Dravid said that when they looked at the pitch it had a lot of grass on it and hence they chose to go ahead with…", "url": "https://sports.ndtv.com/england-vs-india-2022/can-always-look-at-hindsight-rahul-dravid-opens-up-on-decision-to-not-pick-r-ashwin-for-edgbaston-test-3130086", "urlToImage": "https://c.ndtvimg.com/2022-02/jfidlgr_rahul-dravid-bcci_625x300_21_February_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-05T13:37:05Z", "content": "The Indian cricket team surrendered to a meek loss at the hands of England in the rescheduled 5th Test at Edgbaston on Tuesday, with the hosts chasing down a mammoth fourth innings target of 378 runs… [+1862 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Nick Kyrgios Faces Assault Charge: Australian Paper", "description": "The news broke as the 27-year-old, one of the most polarising yet exciting figures in tennis, prepared to enter the quarter-finals at Wimbledon on Wednesday.", "url": "https://sports.ndtv.com/tennis/nick-kyrgios-faces-assault-charge-australian-paper-3130085", "urlToImage": "https://c.ndtvimg.com/2022-07/uvmj9658_nick-kyrgios-afp_625x300_04_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-05T13:37:03Z", "content": "Australian tennis ace Nick Kyrgios will face court after being charged with assault, his barrister told the Canberra Times newspaper Tuesday. The news broke as the 27-year-old, one of the most polari… [+1068 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "\"Absolutely Listless\": Ex-India Players On Humiliating Loss In Edgbaston", "description": "India fell to 245 all out to hand England a record victory target of 378, which the hosts achieved with two sessions and seven wickets to spare on the fifth day and end the Covid-delayed five-match series at 2-2.", "url": "https://sports.ndtv.com/england-vs-india-2022/absolutely-listless-ex-india-players-react-to-humiliating-loss-in-edgbaston-test-vs-england-3130046", "urlToImage": "https://c.ndtvimg.com/2022-07/g00lv98o_ben-stokes-jasprit-bumrah_625x300_05_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-05T13:24:04Z", "content": "Cricketers and pundits slammed India's batting in the second innings as England batsmen Jonny Bairstow and Joe Root hit hundreds to thrash the tourists in the fifth Test on Tuesday. India fell to 245… [+2920 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Father's Reply To Son For Incorrect Food Order Leaves Internet In Splits", "description": "A father's hilarious reply to his son's text message on WhatsApp has left social media in splits.", "url": "https://www.ndtv.com/offbeat/man-puts-wrong-address-while-ordering-food-fathers-epic-reaction-leaves-internet-in-splits-3130020", "urlToImage": "https://c.ndtvimg.com/2022-07/38peci1o_whatsapp-chat_625x300_05_July_22.jpg", "publishedAt": "2022-07-05T13:17:51Z", "content": "The post garnered nearly 4,000 likes and hundreds of retweets. (Unsplash/Representative Photo)\r\nA father's hilarious reply to his son's text message on WhatsApp has left social media in splits. \r\nTwi… [+2093 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "PSG Sack Mauricio Pochettino, Appoint Christophe Galtier As New Coach", "description": "Paris Saint-Germain have parted company with coach Mauricio Pochettino, the French champions confirmed on Tuesday, and replaced him with Christophe Galtier who pipped the Argentine and PSG to the 2021 Ligue 1 title when in charge of Lille.", "url": "https://sports.ndtv.com/football/psg-sack-mauricio-pochettino-appoint-christophe-galtier-as-new-coach-3130016", "urlToImage": "https://c.ndtvimg.com/2022-07/votigfag_galtier-psg-afp_625x300_05_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-05T13:17:08Z", "content": "Paris Saint-Germain have parted company with coach Mauricio Pochettino, the French champions confirmed on Tuesday, and replaced him with Christophe Galtier who pipped the Argentine and PSG to the 202… [+1837 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "What Twitter Argues In Its Case vs Centre On Blocking Content", "description": "Twitter has requested the Karnataka High Court to reverse a few orders from the Centre to block content, arguing that the orders are arbitrary and show \"disproportionate use of power\", according to sources familiar with the filings.", "url": "https://www.ndtv.com/india-news/what-twitter-argues-in-its-case-vs-centre-on-blocking-content-3129996", "urlToImage": "https://c.ndtvimg.com/tmw9v8osepo_twitter-generic-reuters_625x300.jpg", "publishedAt": "2022-07-05T13:12:07Z", "content": "India has 24 million Twitter users and is the third highest market for the company.\r\nTwitter has requested the Karnataka High Court to reverse a few orders from the Centre to block content, arguing t… [+2745 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Tottenham Hotspur New-Boy Richarlison Banned After Flare Celebration", "description": "Richarlison sealed a 60 million pound ($71 million) move to Tottenham Hotspur last week, but he will have to wait for his first top-flight match in a Tottenham shirt.", "url": "https://sports.ndtv.com/football/tottenham-hotspur-new-boy-richarlison-banned-after-flare-celebration-3129984", "urlToImage": "https://c.ndtvimg.com/2021-03/ip2p15ko_richarlison-afp_625x300_26_March_21.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-05T13:09:13Z", "content": "Tottenham's new forward Richarlison will miss the first game of the Premier League season after being banned for celebrating a goal by throwing a smoke flare while playing for Everton last season. Ri… [+1158 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Rashi Hardaha", "title": "Medical Candidates Urge PM Modi To Postpone NEET UG 2022 Exam", "description": "Medical aspirants have taken to social media demanding the postponement of NEET UG 2022 by using #PMOHelpNEETUGAspirants. However, the NTA has not confirmed any postponement.", "url": "https://www.ndtv.com/education/neet-2022-twitter-pmohelpneetugaspirants-medical-candidates-urge-pm-modi-to-postpone-neet-ug-exam", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/5/neet_ug_2022.jpg", "publishedAt": "2022-07-05T12:59:52Z", "content": "New Delhi:With just few days left for the commencement of the National Eligibility cum Entrance Test-Undergraduate (NEET UG) 2022, the demand to postpone the medical entrance test has grown larger. T… [+2607 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "SL vs AUS: Cameron Green Says \"Clear Gameplan\" Ahead Of Second Test", "description": "Australia lead the two-match Test series against Sri Lanka 1-0 after winning the first game by 10 wickets in Galle.", "url": "https://sports.ndtv.com/cricket/sri-lanka-vs-australia-cameron-green-says-clear-gameplan-ahead-of-second-test-3129955", "urlToImage": "https://c.ndtvimg.com/2022-07/v93b0moo_cameron-green-afp_625x300_05_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-05T12:59:49Z", "content": "Australia's Cameron Green said on Tuesday that batting bravely on a turning Galle pitch will remain key as the tourists look to clinch the series in the second Sri Lanka Test. Green, a batting all-ro… [+2116 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "In Twitter-Government Face-Off, A Legal Challenge: 10 Points", "description": "Social media giant Twitter went to court today, challenging certain government orders to take down content. Some orders were arbitrary and disproportionate, Twitter said, seeking a judicial review of content that the government wanted blocked.", "url": "https://www.ndtv.com/india-news/in-twitter-government-face-off-a-legal-challenge-10-points-3129938", "urlToImage": "https://c.ndtvimg.com/2021-02/ochcopmo_twitter-generic-reuters-650_650x400_10_February_21.jpg", "publishedAt": "2022-07-05T12:55:48Z", "content": "<li>In a petition in the Karnataka High Court, Twitter said the government has sought blocking of some content by political parties' handles. This, Twitter contended, amounts to violation of Freedom … [+1415 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Adarsh Srivastava", "title": "Odisha 10th Result 2022: Last Five Years' Pass Percentage Trends", "description": "The Odisha Class 10 result 2022 is to be announced tomorrow, July 6 by the Board of Secondary Education (BSE). Students who appeared in the Class 10 board exams will get their BSE Odisha Matric results 2022 from the official website.", "url": "https://www.ndtv.com/education/odisha-10th-result-2022-last-five-years-pass-percentage-trends", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/5/BSE-Odisha-Result-2022.jpg", "publishedAt": "2022-07-05T12:55:40Z", "content": "New Delhi:BSE Odisha 10th Result 2022: The Odisha Class 10 result 2022 is to be announced tomorrow, July 6 by the Board of Secondary Education (BSE). Students who appeared in the Class 10 board exams… [+2060 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Adults' Cardiometabolic Health Status Sets Alarm Bells In US: Report", "description": "According to a recent study which suggested that less than 7 per cent of the US adult population has good cardiometabolic health, a devastating health crisis requires urgent action.", "url": "https://www.ndtv.com/world-news/adults-cardiometabolic-health-status-sets-alarm-bells-in-us-report-3129933", "urlToImage": "https://c.ndtvimg.com/2022-06/ipbu0t1_heart-attack_650x400_03_June_22.jpg", "publishedAt": "2022-07-05T12:53:05Z", "content": "The study looked at a nationally representative sample of about 55,000 people aged 20 years or older.\r\nWashington: According to a recent study which suggested that less than 7 per cent of the US adul… [+5009 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Vishesh Roy", "title": "\"Did Not Bat...\": Coach Rahul Dravid Reflects On India's Edgbaston Loss", "description": "Team India head coach Rahul Dravid addressed a press conference on Tuesday after his side suffered a seven-wicket defeat against England in the rescheduled fifth Test at Edgbaston, Birmingham.", "url": "https://sports.ndtv.com/england-vs-india-2022/india-vs-england-did-not-bat-coach-rahul-dravid-reflects-on-indias-edgbaston-loss-3129916", "urlToImage": "https://c.ndtvimg.com/2022-07/ubc2024g_virat-kohli-afp_625x300_05_July_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-05T12:50:02Z", "content": "Before the start of play on Day 4 of the Edgbaston Test, India were favourites to win against England, having extended their lead to 257 with seven wickets in hand and no one could have anticipated a… [+3533 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Warning: These Posts By Kalki, Radhika And Tripti Will Make You Jealous", "description": "Kalki Koechlin, Radhika Apte and Tripti Dimri shared glimpses from their beach holidays", "url": "https://www.ndtv.com/entertainment/warning-these-posts-by-kalki-koechlin-radhika-apte-and-tripti-dimri-will-make-you-jealous-3129908", "urlToImage": "https://c.ndtvimg.com/2022-07/o6g07i2o_kalki_625x300_05_July_22.jpg", "publishedAt": "2022-07-05T12:48:01Z", "content": "Kalki Koechlin in a swimsuit. (courtesy: kalkikanmani)\r\nNew Delhi: Trust Bollywood actresses to heat things up on the Internet with their stunning pictures. After all, as fans, it's always a delight … [+1853 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "This Disturbing Cooking Video Had A Strange Way Of Showing Chopped Onions", "description": "A strange video went viral online after it featured a strange shot of onion being chopped. Take a look!", "url": "https://food.ndtv.com/news/this-disturbing-cooking-video-had-a-strange-way-of-showing-chopped-onions-3129869", "urlToImage": "https://c.ndtvimg.com/2018-11/f18ep104_onions_625x300_28_November_18.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-05T12:38:16Z", "content": "Cooking videos are one of the most favourite categories of videos on the internet. People love to see how exactly their favourite foods are prepared. The step-by-step process of making food is not ju… [+2776 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Antony Blinken To Hold Talks With Chinese Foreign Minister At G20 Meet", "description": "US Secretary of State Antony Blinken will meet Chinese Foreign Minister Wang Yi alongside the G20 meeting of foreign ministers in Bali this week, a senior US State Department official said on Tuesday.", "url": "https://www.ndtv.com/world-news/antony-blinken-to-hold-talks-with-chinese-foreign-minister-at-g20-meet-3129847", "urlToImage": "https://c.ndtvimg.com/2022-07/vc639be8_blinken-china_625x300_05_July_22.jpg", "publishedAt": "2022-07-05T12:36:51Z", "content": "Blinken and Wang last met in October at a Group of 20 summit in Rome.\r\nWashington: US Secretary of State Antony Blinken will meet Chinese Foreign Minister Wang Yi alongside the G20 meeting of foreign… [+1196 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "In 2nd Spicejet Incident Today, Windshield Cracks On Gujarat-Mumbai Flight", "description": "A SpiceJet aircraft, flying from Kandla in Gujarat, made a priority landing in Mumbai after its outer windshield developed a crack mid-air, said the airline. This is the second incident in the day involving a SpiceJet plane.", "url": "https://www.ndtv.com/india-news/in-2nd-spicejet-incident-today-windshield-cracks-on-gujarat-mumbai-flight-3129809", "urlToImage": "https://c.ndtvimg.com/2022-07/qf10s6n8_spicejet-landing-karachi-650_650x400_05_July_22.jpg", "publishedAt": "2022-07-05T12:29:38Z", "content": "This is the 7th safety-related concern in SpiceJet in less than 3 weeks, say sources (Representational)\r\nNew Delhi: A SpiceJet aircraft, flying from Kandla in Gujarat, made a priority landing in Mumb… [+1652 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Miten Kakaiya", "title": "How To Get The Most Out Of Your Summer Workouts", "description": "Here's how you can make working out the most fun and effective during summer.", "url": "https://doctor.ndtv.com/living-healthy/how-to-get-the-most-out-of-your-summer-workouts-3129800", "urlToImage": "https://i.ndtvimg.com/i/2017-09/drinking-water-while-standing_650x400_51505279144.jpg", "publishedAt": "2022-07-05T12:26:55Z", "content": "First things first: working out in the summers can seem daunting. Especially in a country like India, where a combination of heat and humidity can be absolutely unforgiving.\r\nBut did you know that wo… [+3783 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "5th Test Report: England Register Record Chase, Beat India By 7 Wickets", "description": "While Joe Root remained unbeaten on 142, Jonny Bairstow scored 114 not out as England chased down a record 378 runs vs India in fifth Test.", "url": "https://sports.ndtv.com/england-vs-india-2022/india-vs-england-5th-test-report-joe-root-jonny-bairstow-help-england-register-record-chase-beat-india-by-7-wickets-3129754", "urlToImage": "https://c.ndtvimg.com/2022-07/ql3anhcg_jonny-bairstow-joe-root-twitter_625x300_05_July_22.jpg", "publishedAt": "2022-07-05T12:26:52Z", "content": "Jonny Bairstow and Joe Root, who have made chasing tricky targets in Test matches fashionable, put famed Indian pace attack to sword with imposing hundreds as England recorded their highest ever chas… [+5412 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Comrades\": Air Force On First Father-Daughter Hawk Sortie", "description": "Air Commodore Sanjay Sharma and his daughter, Flying Officer Ananya Sharma, posed in front of the fighter plane and the photo is now going viral.", "url": "https://www.ndtv.com/india-news/air-force-officer-daughter-fly-hawk-sortie-together-proud-moment-moves-internet-3129799", "urlToImage": "https://c.ndtvimg.com/2022-07/lqqghjv8_air-force-officer-with-daughter-650_625x300_05_July_22.jpg", "publishedAt": "2022-07-05T12:26:46Z", "content": "Air Commodore Sanjay Sharma with his daughter, Flying Officer Ananya Sharma. (Credit: Indian Air Force)\r\nA photo is going viral on the internet, which shows an Indian Air Force (IAF) officer posing w… [+1886 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "China Resumes International Flights After 2-Year Covid Ban", "description": "China has started permitting international flights after a two-year ban due to the COVID-19 pandemic, but there is no word yet on the resumption of air services to India.", "url": "https://www.ndtv.com/world-news/china-resumes-international-flights-after-2-year-covid-ban-3129607", "urlToImage": "https://c.ndtvimg.com/2020-01/79kisq2o_china-airport_625x300_29_January_20.jpg", "publishedAt": "2022-07-05T12:25:41Z", "content": "China has started permitting international flights after a two-year ban.\r\nBeijing: China has started permitting international flights after a two-year ban due to the COVID-19 pandemic, but there is n… [+2631 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Centre Not Allowing Municipal Polls, Will Approach Court: Arvind Kejriwal", "description": "Delhi Chief Minister Arvind Kejriwal on Tuesday accused the BJP-led central government of using force and hooliganism in not allowing MCD elections in the city and asserted that the AAP will approach the court to get the polls conducted on time.", "url": "https://www.ndtv.com/delhi-news/centre-not-allowing-municipal-polls-will-approach-court-arvind-kejriwal-3129776", "urlToImage": "https://c.ndtvimg.com/2022-06/dr4eg5dg_kejriwal_625x300_29_June_22.jpg", "publishedAt": "2022-07-05T12:20:28Z", "content": "Arvind Kejriwal's comments came in the Delhi Assembly on the second day of the monsoon session.\r\nNew Delhi: Delhi Chief Minister Arvind Kejriwal on Tuesday accused the BJP-led central government of u… [+1147 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Watch - The Moment When England Chased Down 378-Run Target vs India", "description": "England levelled the series 2-2 with a seven-wicket win, denying India their first Test series win on English soil since 2007", "url": "https://sports.ndtv.com/england-vs-india-2022/india-vs-england-simply-irrestible-the-moment-when-england-chased-down-378-run-target-vs-india-watch-3129775", "urlToImage": "https://c.ndtvimg.com/2022-07/g6hhg78_jonny-bairstow_625x300_05_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-05T12:19:53Z", "content": "A 269-run partnership between Joe Root and Jonny Bairstow helped England make history, with the side completing their highest successful run chase ever in the longest format of the game with a seven-… [+2367 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Darlings Teaser: Twitter Can't Get Enough Of Alia's Expressions", "description": "Darlings had been co-produced by Alia Bhatt and Shah Rukh Khan", "url": "https://www.ndtv.com/entertainment/darlings-teaser-twitter-cant-get-enough-of-alia-bhatts-expressions-easy-to-see-why-3129759", "urlToImage": "https://c.ndtvimg.com/2022-07/ngjaujo_alia-bhatt_625x300_05_July_22.jpg", "publishedAt": "2022-07-05T12:16:41Z", "content": "Darlings: Alia Bhatt in the teaser. (courtesy: YouTube)\r\nNew Delhi: The teaser of Darlings released on Tuesday and it is the perfect amalgamation of thrill and dark comedy. Alia Bhatt, who has co-pro… [+2307 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "7 \"Refreshing\" Summer Beverages That Might Actually Be Dehydrating You", "description": "We often confuse refreshing drinks as being refreshing. Although these drinks help the body cool down, they might cause dehydration later on.", "url": "https://www.ndtv.com/health/7-refreshing-summer-beverages-that-might-actually-be-dehydrating-you-2994568", "urlToImage": "https://i.ndtvimg.com/i/2017-12/iced-teas-have-high-sugar-content_650x400_61513250118.jpg", "publishedAt": "2022-07-05T12:16:05Z", "content": "Iced tea are very dehydrating due to the tea and sugar\r\nAs summer heat worsens, there are various ways in which we keep our bodies cool and ourselves hydrated. Summer is all about iced drinks and ref… [+3250 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Kerala Actress Assault Case: Court Allows Forensic Analysis Of Memory Card", "description": "The Kerala High Court on Tuesday allowed the Crime Branch's plea seeking forensic analysis of the memory card containing visuals of the actress assault incident of 2017.", "url": "https://www.ndtv.com/kerala-news/kerala-actress-assault-case-court-allows-forensic-analysis-of-memory-card-3129752", "urlToImage": "https://c.ndtvimg.com/2019-09/1482fqp_kerala-high-court-650_625x300_05_September_19.jpg", "publishedAt": "2022-07-05T12:15:09Z", "content": "The Kerala High Court has granted time till July 15 to the prosecution to conclude further probe.\r\nKochi: The Kerala High Court on Tuesday allowed the Crime Branch's plea seeking forensic analysis of… [+2629 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Watch: Policeman Gifting Brand New Slippers To Cart Puller Wins Hearts", "description": "A video showing a police constable giving a pair of slippers to a cart puller walking barefoot on the road has melted hearts online.", "url": "https://www.ndtv.com/offbeat/viral-video-policeman-gifting-brand-new-slippers-to-cart-puller-wins-hearts-on-internet-3129741", "urlToImage": "https://c.ndtvimg.com/2022-07/fsef9nho_up-police_625x300_05_July_22.jpg", "publishedAt": "2022-07-05T12:12:00Z", "content": "The video racked up more than 257,000 views and over 17,000 likes.\r\nA video showing a police constable giving a pair of slippers to a cart puller walking barefoot on the road has melted hearts online… [+1685 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Devendra Fadnavis Holds Roadshow In Nagpur", "description": "Maharashtra's new Deputy Chief Minister Devendra Fadnavis on Tuesday held a roadshow in Nagpur after he received a warm welcome upon his arrival in the city.", "url": "https://www.ndtv.com/india-news/maharashtras-new-deputy-chief-minister-devendra-fadnavis-holds-roadshow-in-nagpur-3129021", "urlToImage": "https://c.ndtvimg.com/2022-07/gfsanjag_devendra-fadnavis-nagpur-roadshow-ani-twitter_625x300_05_July_22.jpg", "publishedAt": "2022-07-05T12:03:39Z", "content": "Devendra Fadnavis held a roadshow in Nagpur.\r\nNagpur (Maharashtra): Maharashtra's new Deputy Chief Minister Devendra Fadnavis on Tuesday held a roadshow in Nagpur after he received a warm welcome upo… [+2357 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Boris Johnson Under Pressure Over Conservative Lawmaker's Misconduct", "description": "British Prime Minister Boris Johnson faces renewed pressure on Tuesday after a former civil servant spoke out about Downing Street's handling of allegations of misconduct by a Conservative Party member of Parliament who was suspended recently.", "url": "https://www.ndtv.com/world-news/boris-johnson-under-pressure-over-conservative-lawmakers-misconduct-3129710", "urlToImage": "https://c.ndtvimg.com/2022-06/atbqrg54_boris-johnson-reuters_625x300_06_June_22.jpg", "publishedAt": "2022-07-05T12:03:36Z", "content": "The Labour Party said it was clear that PM Johnson knew about the seriousness of the complaints.\r\nLondon: British Prime Minister Boris Johnson faces renewed pressure on Tuesday after a former civil s… [+2474 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "This Protein-Rich Toor Dal Dosa By Chef Kunal Kapur Is Ideal For A Wholesome Meal", "description": "Chef Kunal Kapur has shared a healthy toor dal dosa recipe that can easily be made at home.", "url": "https://food.ndtv.com/food-drinks/this-protein-rich-toor-dal-dosa-by-chef-kunal-kapur-is-ideal-for-a-wholesome-meal-3129691", "urlToImage": "https://c.ndtvimg.com/2022-02/g7a0124_adai-dosa_625x300_23_February_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-05T11:57:22Z", "content": "South Indian cuisine is known for its spicy, mouth-watering and tangy dishes. From Chicken Chettinad, Andhra-Style Chicken Curry, Hyderabadi Biryani to Paal Payasam, Appam, Rava Uttapam and more - th… [+3673 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Updated WTC Points Table After India's Humbling Loss In Edgbaston Test", "description": "The complete lack of application from the batters in the second innings, and the lack of any proper tactics and plans while bowling in the second innings were big reasons behind India embarrassing loss at Edgbaston.", "url": "https://sports.ndtv.com/england-vs-india-2022/updated-world-test-championship-points-table-after-indias-humbling-loss-in-edgbaston-test-to-england-3129677", "urlToImage": "https://c.ndtvimg.com/2022-07/2k57pqh8_joe-root-jonny-bairstow-afp_625x300_05_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-05T11:53:11Z", "content": "The Indian cricket team went down tamely on the final day of the rescheduled fifth Test against England to lose by 7 wickets as Jonny Bairstow and Joe Root smashed unbeaten centuries to take the host… [+1452 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "London Is Full Of Bollywood Stars These Days. Shabana Azmi Made A List", "description": "London is the new Mumbai", "url": "https://www.ndtv.com/entertainment/london-is-full-of-bollywood-stars-these-days-shabana-azmi-made-a-list-3129654", "urlToImage": "https://c.ndtvimg.com/2022-07/49fp5978_kareena-_625x300_05_July_22.jpg", "publishedAt": "2022-07-05T11:49:08Z", "content": "In pics: Celebs holidaying in London. (courtesy: karismakapoor)\r\nNew Delhi: Maldives is a thing of the past, Bollywood stars just found a new holiday spot for the season - London it is. A quick glanc… [+2191 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Former Maharashtra Minister Nawab Malik Files His First Regular Bail Plea", "description": "NCP leader and former Maharashtra minister Nawab Malik, who has been arrested in a money laundering case, filed a bail application before a special court here on Tuesday.", "url": "https://www.ndtv.com/india-news/former-maharashtra-minister-nawab-malik-files-his-first-regular-bail-plea-3129652", "urlToImage": "https://c.ndtvimg.com/2022-06/2mmnn2kc_nawab-malik-ncp-leader-pti_625x300_10_June_22.jpg", "publishedAt": "2022-07-05T11:48:36Z", "content": "Nawab Malik was arrested on February 23. (File)\r\nMumbai: NCP leader and former Maharashtra minister Nawab Malik, who has been arrested in a money laundering case, filed a bail application before a sp… [+812 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Zayed Khan On Hrithik, Fardeen And Sister Sussanne's Boyfriend Arslan", "description": "\"I think he is a lovely boy. He has a sweetheart nature,\" Zayed said about Arslan Goni", "url": "https://www.ndtv.com/entertainment/zayed-khan-on-hrithik-roshan-fardeen-khan-and-sister-sussannes-boyfriend-arslan-goni-3129647", "urlToImage": "https://c.ndtvimg.com/2022-07/jak4ip9o_zayed_625x300_05_July_22.jpg", "publishedAt": "2022-07-05T11:47:52Z", "content": "Zayed Khan in a post. (courtesy: itszayedkhan)\r\nNew Delhi: Zayed Khan, who is celebrating his 42nd birthday today, opened up about his equation with Hrithik Roshan in an interview. Hrithik and Zayed'… [+2651 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Mridusmita Deka", "title": "JEE Main 2022 June Result Soon; Details On Tie-Breaking Rules Here", "description": "JEE Main 2022: In JEE Main, if two or more candidates score the same JEE Main NTA scores, a tie-breaking methodology will be followed to break the deadlock.", "url": "https://www.ndtv.com/education/jee-main-2022-june-result-soon-details-on-tie-breaking-rules-here", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/5/jee-featured-image.jpg", "publishedAt": "2022-07-05T11:45:36Z", "content": "New Delhi:The Joint Entrance Examination Main (JEE Main) 2022 June result will be announced anytime soon. The National Testing Agency (NTA) has already released the JEE Main 2022 answer key for all t… [+4036 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Monsoon Is Here And Malaika Arora's Lunch Is A Proof To That - See Pic", "description": "Malaika Arora is a hardcore foodie and believes in marking every occasion with good food. She marked the rainy day in Mumbai with a delicious meal.", "url": "https://food.ndtv.com/news/monsoon-is-here-and-malaika-aroras-lunch-is-a-proof-to-that-see-pic-3129627", "urlToImage": "https://c.ndtvimg.com/2022-07/a9bvuago_malaika-arora_650x400_05_July_22.jpg", "publishedAt": "2022-07-05T11:42:41Z", "content": "The summer season is on the verge of its end and we are experiencing rainfall in different parts of India. Currently, Mumbai is on alert for heavy rainfall. According to an ANI report, different part… [+1735 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"No Fear\": Gold Smuggling Accused Swapna Suresh Appears For Questioning", "description": "Swapna Suresh, prime accused in the Kerala gold smuggling case, appeared before the Crime Branch officials in the police club for interrogation in the conspiracy case registered against her.", "url": "https://www.ndtv.com/kerala-news/kerala-gold-smuggling-case-no-fear-gold-smuggling-accused-swapna-suresh-appears-for-questioning-3129586", "urlToImage": "https://c.ndtvimg.com/2020-07/pikorels_swapna-suresh-ndtv-_625x300_09_July_20.jpg", "publishedAt": "2022-07-05T11:34:47Z", "content": "It is a fake case, charged overnight, alleged Swapna Suresh.\r\nKochi: Swapna Suresh, prime accused in the Kerala gold smuggling case, appeared before the Crime Branch officials in the police club for … [+3563 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Root-Bairstow Take England To Their Highest Successful Chase, Set Records", "description": "England's chase of 378 runs against India is now their highest successful chase ever. It surpassed their previous highest chase of 359 runs against Australia in 2019.", "url": "https://sports.ndtv.com/england-vs-india-2022/joe-root-jonny-bairstow-master-classes-vs-india-help-england-register-their-highest-successful-chase-break-other-records-3129552", "urlToImage": "https://c.ndtvimg.com/2022-07/9vt710ag_joe-root-afp_625x300_05_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-05T11:27:34Z", "content": "When India set England a 378-run target in the fourth innings of the fifth rescheduled Test in Edgbaston, few would have believed that it was possible. There were several reasons behind the thought. … [+1643 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "\"Best Test Batsman In World Right Now\": Sehwag Lauds England Star", "description": "England beat India by seven wickets in the rescheduled fifth Test at Edgbaston to draw the five-match series 2-2.", "url": "https://sports.ndtv.com/england-vs-india-2022/best-test-batsman-in-world-right-now-virender-sehwags-ultimate-praise-for-england-star-3129530", "urlToImage": "https://c.ndtvimg.com/2021-08/abnub9co_virender-sehwag_625x300_13_August_21.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-05T11:21:57Z", "content": "Joe Root hit yet another century as he continued his fine form in Test cricket to take England to an emphatic victory over India in the Edgbaston Test. Root hit an unbeaten 142 off 173 as England cha… [+1457 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UP Man Called For Counselling Hits Cop Inside Police Station, Detained", "description": "A man lost his temper and beat up a police officer inside the police station premises in Uttar Pradesh's Mainpuri.", "url": "https://www.ndtv.com/india-news/up-man-called-for-counselling-beats-up-cop-inside-mainpuri-police-station-detained-3129148", "urlToImage": "https://c.ndtvimg.com/2022-07/9130fok8_man-beats-cop-inside-police-station-mainpuri-_625x300_05_July_22.jpg", "publishedAt": "2022-07-05T11:21:56Z", "content": "According to the police, he was mentally ill and was called regarding a domestic violence case.\r\nMainpuri (Uttar Pradesh): A man lost his temper and beat up a police officer inside the police station… [+692 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "SpiceJet's Karachi Landing Its 6th Safety-Related Concern In 3 Weeks", "description": "The aviation regulator conducted a fleet-wide safety audit of the low-cost carrier just last month and continues to carry out inspections on a case-by-case basis.", "url": "https://www.ndtv.com/india-news/spicejets-karachi-landing-its-6th-safety-related-concern-in-under-3-weeks-3129527", "urlToImage": "https://c.ndtvimg.com/2022-07/qf10s6n8_spicejet-landing-karachi-650_650x400_05_July_22.jpg", "publishedAt": "2022-07-05T11:20:29Z", "content": "The aviation regulator conducted a fleet-wide safety audit of the low-cost carrier just last month.\r\nNew Delhi: The Indian aviation regulator has ordered a probe into today's incident where air carri… [+1464 chars]"}]}