{"status": "ok", "totalResults": 502, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Consider Reopening Schools Within 2 Months: High Court Tells Odisha", "description": "Odisha School Opening News: The petitioner had approached the court seeking directions to the government to reopen schools as early as possible, adhering to COVID-19 guidelines", "url": "https://www.ndtv.com/education/consider-reopening-schools-within-2-months-high-court-tells-odisha-government", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/2/3/school-shut-online-class-covid-19-featured-image.jpeg", "publishedAt": "2022-02-03T09:08:15Z", "content": "Cuttack:The Orissa High Court has directed the state government to decide about reopening schools within two months. Disposing a writ petition, the single-judge bench of Justice Biswanath Rath also a… [+740 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Associated Press", "title": "Israel Upholds Use of Surveillance Technology on Protesters", "description": "Israel’s attorney general has upheld the Shin Bet security agency’s use of mobile-phone tracking technology to monitor and threaten Palestinian protesters at Jerusalem’s most sensitive holy site last year.", "url": "https://gadgets.ndtv.com/mobiles/news/israel-surveillance-technology-smartphone-protesters-pegasus-nso-2746656", "urlToImage": "https://i.gadgets360cdn.com/large/surveillance_israel_emmanuel_ikwuegbu_unsplash_1643879414366.jpg", "publishedAt": "2022-02-03T09:06:19Z", "content": "Israel's attorney general has upheld the Shin Bet security agency's use of mobile-phone tracking technology to monitor and threaten Palestinian protesters at Jerusalem's most sensitive holy site last… [+3234 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Comedian Sunil Grover To Be Discharged From Hospital After Heart Surgery", "description": "Sunil Grover reportedly underwent a heart surgery on January 27", "url": "https://www.ndtv.com/entertainment/comedian-sunil-grover-to-be-discharged-from-hospital-after-heart-surgery-2746653", "urlToImage": "https://c.ndtvimg.com/2022-02/c7o1v1lg_sunil-grover_625x300_03_February_22.jpg", "publishedAt": "2022-02-03T09:04:54Z", "content": "Sunil Grover was last seen in Sunflower (Courtesy: @whosunilgrover)\r\nHighlights\r\n<ul><li>Sunil Grover underwent surgery on January 27\r\n</li><li>He will be discharged from the hospital today\r\n</li><li… [+1987 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Arnab Mitra", "title": "Supreme Court Likely To Hear Plea On Deferment Of NEET PG Tomorrow", "description": "NEET PG 2022:  As per the apex court website, the plea seeking postponement of NEET PG 2022 may be listed for hearing on Friday, February 4", "url": "https://www.ndtv.com/education/supreme-court-likely-to-hear-plea-on-neet-pg-2022-postponement-on-february-4-nbe-edu-in-mcc", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/2/3/SC_860.jpg", "publishedAt": "2022-02-03T09:00:53Z", "content": "New Delhi:NEET PG 2022: The Supreme Court is likely to hear a plea on postponement of National Eligibility cum Entrance Test (NEET PG) exam 2022 date on Friday, February 4, which was earlier listed o… [+2766 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "On Camera, Karnataka College Students' 'Allow Us In With Hijab' Plea", "description": "Students of a Karnataka college were not allowed to enter and attend classes for wearing a Hijab, the second such controversy in the state this year.", "url": "https://www.ndtv.com/karnataka-news/on-camera-karnataka-college-students-allow-us-in-with-hijab-plea-2746637", "urlToImage": "https://c.ndtvimg.com/2022-02/7456j8_karnataka-hijab-controversy_625x300_03_February_22.jpg", "publishedAt": "2022-02-03T08:57:13Z", "content": "The students request the college principal to allow them to attend classes wearing the hijab\r\nBengaluru: Students of a Karnataka college were not allowed to attend classes wearing a Hijab, the second… [+1811 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Queen's Platinum Jubilee Souvenirs Manufactured With An Awkward Typo", "description": "A spelling error on thousands of souvenirs manufactured for Queen Elizabeth's Platinum Jubilee is proving to be a costly mistake", "url": "https://www.ndtv.com/offbeat/queen-elizabeths-platinum-jubilee-souvenirs-manufactured-with-an-awkward-typo-2746633", "urlToImage": "https://c.ndtvimg.com/2022-02/4kbui71g_queen-elizabeths-platinum-jubilee-souvenirs_625x300_03_February_22.jpg", "publishedAt": "2022-02-03T08:56:24Z", "content": "Souvenirs for Queen Elizabeth's Platinum Jubilee were printed with a typo.\r\nA spelling error on thousands of souvenirs manufactured for Queen Elizabeth's Platinum Jubilee is proving to be a costly mi… [+1815 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "T-Series Enters OTT Space; Teams Up With Aanand L. Rai, Anubhav Sinha, Nikkhil Advani for Web Series", "description": "T-Series producer Bhushan Kumar announced the foray of the studio into over-the-top (OTT) platform. It has teamed up with directors such as Aanand L. Rai, Anubhav Sinha, and Nikkhil Advani for upcoming Web series.", "url": "https://gadgets.ndtv.com/entertainment/news/t-series-ott-web-series-movies-films-aanand-l-rai-anubhav-sinha-nikkhil-advani-2746629", "urlToImage": "https://i.gadgets360cdn.com/large/t_series_logo_twitter_1643878120238.jpg", "publishedAt": "2022-02-03T08:52:54Z", "content": "Producer Bhushan Kumar of T-Series on Thursday announced the foray of the studio into over-the-top (OTT) platform.\r\nThe company, founded by the late Gulshan Kumar, has backed movies like Aashiqui, Ba… [+1611 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Arnab Mitra", "title": "Centre Issues New Guidelines On Reopening Schools; Here In Details", "description": "School Reopening Guidelines: The revised guidelines also focused on smooth transition from online to classroom learning through bridge courses, focusing on students who need extra interventions and to implement remedial programmes.", "url": "https://www.ndtv.com/education/centre-issues-new-guidelines-on-reopening-schools-here-in-details", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/2/3/school-empty-class-room-featured-image.jpg", "publishedAt": "2022-02-03T08:48:54Z", "content": "New Delhi:The Union Government has issued new guidelines on reopening of schools, colleges across the country. As per the revised guidelines, the centre has allowed states to decide whether parental … [+1139 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Actor Dileep Moves Kerala High Court Over Sexual Assault Case Probe", "description": "Actor Dileep on Thursday moved a fresh plea in the Kerala High Court opposing further investigation being carried out by the police in the sexual assault case of an actress, alleging that it was a \"wilful attempt\" to protract the trial in the matter.", "url": "https://www.ndtv.com/kerala-news/actor-dileep-moves-kerala-high-court-over-sexual-assault-case-probe-2746619", "urlToImage": "https://c.ndtvimg.com/actor-dileep-file_625x300_1530184324294.jpg", "publishedAt": "2022-02-03T08:45:58Z", "content": "Actor's latest plea also seeks a declaration that a further probe being carried out was \"illegal\"\r\nKochi: Actor Dileep on Thursday moved a fresh plea in the Kerala High Court opposing further investi… [+1921 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sensex Tanks Over 600 Points, Nifty Trades Below 17,600", "description": "The Indian equity benchmarks on Thursday plunged sharply in late deals, pausing a three-day winning run amid weak global cues.", "url": "https://www.ndtv.com/business/stock-market-india-sensex-tanks-over-600-points-nifty-trades-below-17-600-it-financial-stocks-top-drags-2746618", "urlToImage": "https://c.ndtvimg.com/2021-11/bd3uahbo_bse-sensex_625x300_03_November_21.jpg", "publishedAt": "2022-02-03T08:45:44Z", "content": "Both BSE and NSE had climbed about 4 per cent each over the last three sessions.\r\nNew Delhi: The Indian equity benchmarks on Thursday plunged sharply in late deals, pausing a three-day winning run am… [+2439 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "In This UP Constituency, Deputy Chief Minister KP Maurya vs To Be Decided", "description": "In Sirathu, one of the oldest towns in Uttar Pradesh about 150 km from Lucknow, an interesting election contest is in the making with the state's deputy Chief Minister facing a still-unknown rival.", "url": "https://www.ndtv.com/india-news/in-this-up-constituency-deputy-chief-minister-kp-maurya-vs-to-be-decided-2746615", "urlToImage": "https://c.ndtvimg.com/2022-02/ta0kg8qg_kp-maurya_625x300_03_February_22.jpg", "publishedAt": "2022-02-03T08:44:01Z", "content": "\"I challenge Akhilesh Yadav to contest against me,\" Keshav Prasad Maurya told NDTV\r\nKaushambi, Uttar Pradesh: In Sirathu, one of the oldest towns in Uttar Pradesh about 150 km from Lucknow, an intere… [+1955 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Bishal Kalita", "title": "See If Parents' Consent Necessary: Centre In New School Reopening SOPs", "description": "School Reopening News: With Covid cases declining, states have started reopening schools and colleges for physical classes. As per the previous guidelines, consent from parents was necessary for students to attend schools. This provision was criticised by man…", "url": "https://www.ndtv.com/education/school-reopening-guidelines-centre-education-ministry-delhi-up-bihar-odisha-haryana-punjab-news", "urlToImage": "https://cache.careers360.mobi/media/presets/860X430/article_images/2022/2/3/delhi-school-reopening-date-manish-sisodia-news.png", "publishedAt": "2022-02-03T08:37:10Z", "content": "New Delhi:The Central Government on February 2 issued modified guidelines for reopening of schools and asked states and Union Territories (UTs) to decide at their level whether schools require consen… [+1679 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Paneer Dahi Bhalla, Bread Dahi Bhalla And More: 5 Dahi Bhalla Recipes You Must Try", "description": "Dahi bhallas are our go-to dish to make at any event. Here we have 5 yummy ways in which you can make dahi bhalla at home!", "url": "https://food.ndtv.com/food-drinks/paneer-dahi-bhalla-bread-dahi-bhalla-and-more-5-dahi-bhalla-recipes-you-must-try-2746592", "urlToImage": "https://c.ndtvimg.com/2020-10/9ns6kda_dahi-bhalla_625x300_23_October_20.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-02-03T08:32:45Z", "content": "Have a dinner party at home? Attending an event at someone's place? Going to a wedding? Do you know what's the one dish that is present on all kinds of occasions? Well, if you made a guess and the fi… [+2154 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Edited by Gadgets 360 Newsdesk", "title": "NASA to Retire International Space Station in January 2031", "description": "International Space Station (ISS) is entering its final decade of operational life and NASA is planning to open it for commercial activities. The space agency has detailed the transition plan in a new report. It outlines the steps being taken by NASA to devel…", "url": "https://gadgets.ndtv.com/science/news/iss-retire-january-2031-deorbit-crash-pacific-ocean-plans-nasa-final-years-commercial-spacex-blue-origin-2746480", "urlToImage": "https://i.gadgets360cdn.com/large/nasa_iss_website_1643876727584.jpg", "publishedAt": "2022-02-03T08:26:16Z", "content": "International Space Station (ISS) is entering its final decade of operational life and NASA is planning to open it for commercial activities. The space agency has detailed the transition plan in a ne… [+2198 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "David Delima", "title": "Xiaomi 12 mini Tipped to Be in Works, Leaked Renders Suggest Possible iPhone 13 mini Rival", "description": "Xiaomi 12 mini has been spotted online in an alleged render shared by a tipster, suggesting that Xiaomi could be working on a compact smartphone. Xiaomi is yet to reveal plans for a compact smartphone as part of the Xiaomi 12 series that could rival iPhone 13…", "url": "https://gadgets.ndtv.com/mobiles/news/xiaomi-12-mini-renders-leak-compact-smartphone-design-smartphone-triple-cameras-2746579", "urlToImage": "https://i.gadgets360cdn.com/large/xiaomi_12_mini_render_shadowleak_1643876597313.jpg", "publishedAt": "2022-02-03T08:25:26Z", "content": "Xiaomi 12 series was launched in China in December, including the company's latest Xiaomi 12, Xiaomi 12 Pro, and Xiaomi 12X handsets. The Chinese smartphone manufacturer is yet to reveal when the fla… [+1498 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rahul Gandhi To Lead 'Loyalty Pledge' For Congress' Goa Candidates Tomorrow", "description": "Congress's Assembly poll candidates in Goa will take a pledge of loyalty to the party in the presence of its senior leader Rahul Gandhi on Friday, when he will be on a day-long visit to the state, a party functionary said.", "url": "https://www.ndtv.com/india-news/goa-election-goa-polla-rahul-gandhi-to-lead-loyalty-pledge-for-congresss-goa-candidates-tomorrow-2746573", "urlToImage": "https://c.ndtvimg.com/2022-01/au451pb_goa-congress_625x300_23_January_22.jpg", "publishedAt": "2022-02-03T08:23:55Z", "content": "Goa Election: Elections to all 40 Assembly seats in Goa will be held on February 14.\r\nPanaji: Congress's Assembly poll candidates in Goa will take a pledge of loyalty to the party in the presence of … [+1835 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Pricey Pixels: Why People Spend Fortunes on NFT Art", "description": "Thousands of artists beaver away every day creating images to sell as NFTs in online exchanges. The market is booming, the most popular pieces can sell for millions, but outsiders may wonder why anyone would pay anything at all.", "url": "https://gadgets.ndtv.com/cryptocurrency/features/nft-art-collection-buy-purchase-usd-40-billion-market-why-reason-2746567", "urlToImage": "https://i.gadgets360cdn.com/large/nft_logo_unsplash_1643876410005.jpg", "publishedAt": "2022-02-03T08:22:18Z", "content": "Thousands of artists beaver away every day creating images to sell as digital tokens (NFTs) in online exchanges. The market is booming, the most popular pieces can sell for millions, but outsiders ma… [+5410 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Gold Prices Today: Gold Futures Edge Higher; Silver Declines", "description": "Gold futures traded marginally higher on Thursday, February 3, amid a muted trend in international spot rates.", "url": "https://www.ndtv.com/business/gold-prices-today-gold-futures-edge-higher-silver-declines-2746553", "urlToImage": "https://c.ndtvimg.com/2022-01/um27vkto_jewellery-650_625x300_19_January_22.jpg", "publishedAt": "2022-02-03T08:15:42Z", "content": "Domestic spot gold with a purity of 24 carats opened at Rs 48,196 per 10 grams.\r\nGold Price In India: Gold futures traded marginally higher on Thursday, February 3, amid a muted trend in internationa… [+1816 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Rahul Gandhi's Attempt To Incite...\": BJP Leader's Notice In Parliament", "description": "BJP MP Nishikant Dubey on Thursday submitted a privilege notice to Lok Sabha secretariat against Congress leader Rahul Gandhi for attempting to \"incite\" MPs and the nation at large through his remarks during the debate in the House.", "url": "https://www.ndtv.com/india-news/attempt-to-incite-bjp-mp-nishikant-dubey-moves-privilege-notice-against-rahul-gandhi-in-parliament-2746552", "urlToImage": "https://c.ndtvimg.com/2021-07/63osmgi_bjp-mp-nishikant-dubey-650_625x300_29_July_21.jpeg", "publishedAt": "2022-02-03T08:15:40Z", "content": "BJP MP Nishikant Dubey called Rahul Gandhi a \"script reader\" and a \"Drawing Room Politician\" (File)\r\nNew Delhi: BJP MP Nishikant Dubey on Thursday submitted a privilege notice to the Lok Sabha secret… [+3280 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Viral Video: Internet Says \"Heart Attack Omelette\" After Street Vendor Loaded Eggs With Butter", "description": "Omelette is one of those mainstay recipes that we can find anywhere. Recently a street vendor's omelette has been going viral. Read to know more.", "url": "https://food.ndtv.com/news/viral-video-internet-says-heart-attack-omelette-after-street-vendor-loaded-eggs-with-butter-2746550", "urlToImage": "https://c.ndtvimg.com/2022-02/4f34bl9g_omelette_625x300_03_February_22.jpg", "publishedAt": "2022-02-03T08:15:21Z", "content": "One of the most versatile ingredients to cook with undoubtedly has to be the egg. You can turn it into almost any dish and add all kinds of veggies or spices to amp up the taste. With enough room for… [+2269 chars]"}]}