{"status": "ok", "totalResults": 314, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Watch: Air Force Officer Scales Mt Everest, Sings National Anthem", "description": "Wing Commander Vikrant Uniyal of the Indian Air Force, posted at Central Air Command, Prayagraj scaled Mt Everest on May 21 on the occasion of Azadi Ka Amrit Mahotsav.", "url": "https://www.ndtv.com/india-news/watch-iaf-officer-scales-mt-everest-sings-national-anthem-on-reaching-summit-3023919", "urlToImage": "https://c.ndtvimg.com/2022-05/15b2sn2g_iaf-officer-scales-mt-everest-ani-twitter_625x300_31_May_22.jpg", "publishedAt": "2022-05-31T02:22:58Z", "content": "New Delhi: Wing Commander Vikrant Uniyal of the Indian Air Force, posted at Central Air Command, Prayagraj scaled Mt Everest on May 21 on the occasion of Azadi Ka Amrit Mahotsav.\r\n\"Wing Commander Vik… [+1415 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "On Camera, Rare Sight Of Leopard Hunting Monkey In Panna Tiger Reserve", "description": "Videos of animals in the wild are quite fascinating to watch and one such rather rare and terrifying clip has surfaced on Twitter showing the moment when a leopard made a monkey its prey.", "url": "https://www.ndtv.com/offbeat/viral-video-rare-sight-of-leopard-hunting-monkey-in-panna-tiger-reserve-3024273", "urlToImage": "https://c.ndtvimg.com/2022-04/mubtabgs_leopard-generic-leopard-on-tree-generic-file-photo_625x300_19_April_22.jpg", "publishedAt": "2022-05-31T02:20:50Z", "content": "The video has received more than 3,000 views and hundreds of likes. (Representative Photo)\r\nVideos of animals in the wild are quite fascinating to watch and one such rather rare and terrifying clip h… [+1871 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Arvind Kejriwal Must Sack Arrested Delhi Minister, Demand BJP, Congress", "description": "The BJP and Congress on Monday welcomed the arrest of Delhi government minister Satyendar Jain and asked Chief Minister Arvind Kejriwal to remove him from his cabinet.", "url": "https://www.ndtv.com/delhi-news/arvind-kejriwal-must-sack-arrested-delhi-minister-satyendar-jain-demand-bjp-congress-3023965", "urlToImage": "https://c.ndtvimg.com/2022-05/fllcrsa8_arvind-kejriwal-pti_625x300_31_May_22.jpg", "publishedAt": "2022-05-31T02:14:12Z", "content": "BJP, Congress demand that Arvind Kejriwal sack minister Satyendar Jain after arrest\r\nNew Delhi: The BJP and Congress on Monday welcomed the arrest of Delhi government minister Satyendar Jain and aske… [+2182 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "2 Terrorists Killed In Kashmir, One Of Them Was Behind Civilian Killings", "description": "Two terrorists have been killed in an encounter today with security forces in Jammu and Kashmir's Awantipora district, the police said. One of the terrorists killed was involved in civilian killings, they added.", "url": "https://www.ndtv.com/india-news/2-terrorists-killed-in-kashmir-one-of-them-was-involved-in-killing-2-civilians-3024266", "urlToImage": "https://c.ndtvimg.com/2020-01/5a5u08bg_awantipora-encounter-jkani-_625x300_07_January_20.jpg", "publishedAt": "2022-05-31T02:13:04Z", "content": "2 terrorists killed in an encounter with security forces in J&amp;K's Awantipora (Representational)\r\nSrinagar: Two terrorists have been killed in an encounter today with security forces in Jammu and … [+1265 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Monkeypox Spread No Reason To Shun Pride Parades: WHO", "description": "An unusual spread of monkeypox does not mean people should shun LGBTQ pride parades this summer, a World Health Organization expert said on Monday, adding that it was important to show support.", "url": "https://www.ndtv.com/world-news/monkeypox-spread-no-reason-to-shun-pride-parades-who-3023896", "urlToImage": "https://c.ndtvimg.com/2022-05/3e0jgjh8_monkeypox-reuters_625x300_22_May_22.jpg", "publishedAt": "2022-05-31T02:00:21Z", "content": "More than 300 suspected and confirmed cases of monkeypox have been reported in May.\r\nFrankfurt: An unusual spread of monkeypox does not mean people should shun LGBTQ pride parades this summer, a Worl… [+1441 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Canada To Ban On Handgun Sales In Wake Of Texas School Shooting", "description": "Prime Minister Justin Trudeau announced Monday a proposed freeze on handgun ownership in Canada that would effectively ban their importation and sale, following recent mass shootings in the United States.", "url": "https://www.ndtv.com/world-news/canada-to-ban-on-handgun-sales-in-wake-of-texas-school-shooting-3024250", "urlToImage": "https://c.ndtvimg.com/2022-05/ilgmelik_canadas-justin-trudeau_625x300_09_May_22.jpg", "publishedAt": "2022-05-31T01:42:42Z", "content": "The move comes days after deadly Texas school shooting that killed 21 people.\r\nOttawa: Prime Minister Justin Trudeau announced Monday a proposed freeze on handgun ownership in Canada that would effec… [+2433 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "PM Modi Praises Devotees' Spirit Of Keeping Places Of Pilgrimage Clean", "description": "A day after he urged pilgrims visiting Char Dham to ensure cleanliness, Prime Minister Narendra Modi on Monday lauded the spirit of devotees to participate in the cleanliness efforts along with the government.", "url": "https://www.ndtv.com/india-news/pm-modi-praises-devotees-spirit-of-keeping-places-of-pilgrimage-clean-3024241", "urlToImage": "https://c.ndtvimg.com/2022-05/1k70mjag_pm-modi-in-rajkot-pti_625x300_28_May_22.jpg", "publishedAt": "2022-05-31T01:27:23Z", "content": "Earlier, PM Modi had expresses his concern over litter on 'Char Dham Yatra' route in Mann Ki Baat.\r\nNew Delhi: A day after he urged pilgrims visiting Char Dham to ensure cleanliness, Prime Minister N… [+1864 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE: India Logs 2,706 New Covid Cases, 25 Deaths In A Day", "description": "India on Monday reported at least 2,706 new coronavirus infections, bringing the total number of COVID-19 cases to 4,31,55,749. The active cases also increased to 17,698 in the last 24 hours, according to the Union Health Ministry data.", "url": "https://www.ndtv.com/india-news/coronaviru-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-31-may-3024219", "urlToImage": "https://c.ndtvimg.com/2021-08/4fmrmba_coronavirus-india-reuters-august-30_650x400_30_August_21.jpg", "publishedAt": "2022-05-31T00:24:50Z", "content": "India Covid Updates: The country also reported 25 new Covid deaths on Monday.\r\nNew Delhi: India on Monday reported at least 2,706 new coronavirus infections, bringing the total number of COVID-19 cas… [+581 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Five Rockets Fired At Iraq Military Base With Foreign Troops: Official", "description": "Five rockets on Monday targeted an Iraqi military base hosting troops from an international anti-jihadist coalition without causing deaths or damage, a military official said.", "url": "https://www.ndtv.com/world-news/five-rockets-fired-at-iraq-military-base-with-foreign-troops-official-3024212", "urlToImage": "https://c.ndtvimg.com/2021-10/6e8i71v_missile-generic_650x400_17_October_21.jpg", "publishedAt": "2022-05-31T00:02:38Z", "content": "Rocket attacks have targeted US troops and interests in Iraq in recent months. (Representational)\r\nFallujah: Five rockets on Monday targeted an Iraqi military base hosting troops from an internationa… [+1492 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "EU Agrees To Send 9 Billion Euros To Ukraine In Immediate Liquidity", "description": "European Union leaders meeting in Brussels have agreed to send Ukraine nine billion euros to support its economy in the face of Russia's invasion, EU chief Charles Michel announced Monday.", "url": "https://www.ndtv.com/world-news/eu-agrees-to-send-9-billion-euros-to-ukraine-in-immediate-liquidity-3024207", "urlToImage": "https://c.ndtvimg.com/2022-05/86ipfm4c_russia-ukraine-war-afp_625x300_21_May_22.jpg", "publishedAt": "2022-05-30T23:44:48Z", "content": "EU leaders also agreed to ban on more than 2/3 Russian oil imports to punish Moscow.\r\nBrussels: European Union leaders meeting in Brussels have agreed to send Ukraine nine billion euros to support it… [+591 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Georgia's Separatist Region Rejects Referendum On Joining Russia", "description": "The leader of Georgia's breakaway region of South Ossetia on Monday scrapped plans to hold a referendum on joining Russia which his predecessor had scheduled for July 17.", "url": "https://www.ndtv.com/world-news/georgias-separatist-region-south-ossetia-rejects-referendum-on-joining-russia-3024202", "urlToImage": "https://c.ndtvimg.com/2022-05/v6c1ffug_georgia-flag-unsplash-650_625x300_13_May_22.jpg", "publishedAt": "2022-05-30T23:25:33Z", "content": "Earlier, On May 13, Gagloev's predecessor signed a decree on holding the referendum to join Russia.\r\nTbilisi, Georgia: The leader of Georgia's breakaway region of South Ossetia on Monday scrapped pla… [+2820 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "EU Agrees Ban On More Than Two-Thirds Of Russian Oil Imports Over Ukraine", "description": "EU leaders on Monday backed a ban on most Russian oil imports, after a compromise deal with Hungary to punish Moscow for the war in Ukraine.", "url": "https://www.ndtv.com/world-news/eu-agrees-ban-on-more-than-two-thirds-of-russian-oil-imports-over-ukraine-3024189", "urlToImage": "https://c.ndtvimg.com/2021-06/bqb9pkqk_oil-pipeline-reuters-650_625x300_10_June_21.jpg", "publishedAt": "2022-05-30T22:58:26Z", "content": "EU official said that Europe is putting maximum pressure on Russia to end the war. (Representational)\r\nBrussels: EU leaders on Monday backed a ban on most Russian oil imports, after a compromise deal… [+1612 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Border Force Recovers 4 Kg Heroin From Field In Amritsar", "description": "Almost four kg of heroin was recovered by the Border Security Force (BSF) from an agriculture field in Amritsar, an official statement said on Monday.", "url": "https://www.ndtv.com/india-news/bsf-recovers-4-kg-heroin-from-field-in-amritsar-3024182", "urlToImage": "https://c.ndtvimg.com/d6pigfu4_drugs-generic-narcotics-generic-istock_625x300_01_September_18.jpg", "publishedAt": "2022-05-30T22:35:18Z", "content": "The net weight of the recovered narcotics is 3.870 Kg, the BSF said. (Representational)\r\nAmritsar: Almost four kg of heroin was recovered by the Border Security Force (BSF) from an agriculture field … [+637 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "At Least 57 Injured After Two Buses Collide In Kerala's Kollam: Police", "description": "At least 57 people were injured, including one in serious condition, when a tourist bus collided with a KSRTC bus in Kerala's Kollam district on Monday.", "url": "https://www.ndtv.com/india-news/at-least-57-injured-after-two-buses-collide-in-keralas-kollam-police-3024181", "urlToImage": "https://c.ndtvimg.com/2020-11/ot9qoiqo_kerala-police-van_625x300_03_November_20.jpg", "publishedAt": "2022-05-30T22:25:24Z", "content": "Kerala Bus Accident: The Minister said the condition of 1 injured person is serious. (Representational)\r\nKollam, Kerala: At least 57 people were injured, including one in serious condition, when a to… [+943 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rajya Sabha Polls: BJP Reveals 4 More Names, Fields Party's OBC Wing Head", "description": "The BJP on Monday announced four more candidates for the upcoming Rajya Sabha polls.", "url": "https://www.ndtv.com/india-news/rajya-sabha-polls-bjp-reveals-4-more-names-fields-partys-obc-wing-head-k-laxman-from-up-3024178", "urlToImage": "https://c.ndtvimg.com/2019-01/63smtts8_bjp-flag_625x300_01_January_19.jpg", "publishedAt": "2022-05-30T22:15:33Z", "content": "Rajya Sabha Polls: Earlier, the BJP had on Sunday announced 18 candidates. (Representational)\r\nNew Delhi: The BJP on Monday announced four more candidates for the upcoming Rajya Sabha polls.\r\nThe BJP… [+698 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Stable Environment In Indo-Pacific Essential For Global Prosperity: Minister", "description": "Defence Minister Rajnath Singh said a free and open Indo-Pacific is an important aspect of India's maritime security while noting that geopolitical tensions and clash of strategic interests have resulted in new security challenges in the region.", "url": "https://www.ndtv.com/india-news/stable-environment-in-indo-pacific-essential-for-global-prosperity-defence-minister-rajnath-singh-3024171", "urlToImage": "https://c.ndtvimg.com/2022-04/1fgrfhu4_rajnath-singh-650_625x300_22_April_22.jpg", "publishedAt": "2022-05-30T21:59:05Z", "content": "Rajnath Singh shared his views on the importance of Indo-Pacific region at Indian Coast Guard event.\r\nNew Delhi: Defence Minister Rajnath Singh on Monday said a free and open Indo-Pacific is an impor… [+3879 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Unlikely Monkeypox Outbreak Will Turn Into A Global Pandemic: WHO - NDTV", "description": "<ol><li>Unlikely Monkeypox Outbreak Will Turn Into A Global Pandemic: WHO  NDTV\r\n</li><li>WHO says sudden appearance of monkeypox suggests undetected transmission  Arirang News\r\n</li><li>Monkeypox spreads to 23 countries, total 257 confirmed cases now; WHO wa…", "url": "https://www.ndtv.com/world-news/unlikely-monkeypox-outbreak-will-turn-into-a-global-pandemic-who-3024166", "urlToImage": "https://c.ndtvimg.com/2022-05/3e0jgjh8_monkeypox-reuters_625x300_22_May_22.jpg", "publishedAt": "2022-05-30T21:45:44Z", "content": "WHO said that there was no reason to panic over Monkeypox virus.\r\nGeneva: The WHO said Monday it was not concerned for now that the spread of monkeypox beyond the African countries where it is typica… [+3374 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Debika Chakraborty", "title": "Nagaland Board NBSE To Announce HSLC, HSSLC Results 2022 Today", "description": "NBSE HSLC, HSSLC results 2022: The NBSE 10th, 12th results 2022 will be declared today, May 31, 2022 at 2 pm.", "url": "https://www.ndtv.com/education/nagaland-board-nbse-hslc-hsslc-results-2022-today-nbsenl-edu-in-nbsenagaland-com", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/5/30/shutterstock_524596531.jpg", "publishedAt": "2022-05-30T21:31:35Z", "content": "New Delhi:NBSE HSLC, HSSLC results 2022: The High School Leaving Certificate (HSLC), and Higher Secondary School Leaving Certificate (HSSLC) results of the Nagaland Board will be declared on Tuesday,… [+1731 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Italy Scraps COVID-19 Entry Rules For Travellers As Cases Drop", "description": "Italy said Monday it was dropping the requirement to show proof of coronavirus vaccination, recent recovery or a negative test before entering the country.", "url": "https://www.ndtv.com/world-news/italy-scraps-covid-19-entry-rules-for-travellers-as-cases-drop-3024149", "urlToImage": "https://c.ndtvimg.com/2021-07/0fkpk4d_coronavirus-travel-generic_625x300_29_July_21.jpg", "publishedAt": "2022-05-30T20:55:06Z", "content": "Italy on Monday recorded another 7,537 cases and 62 deaths.\r\nRome: Italy said Monday it was dropping the requirement to show proof of coronavirus vaccination, recent recovery or a negative test befor… [+748 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Several Injured After Bomb Hits Russian-Occupied Town Of Ukraine: Official", "description": "A car bomb exploded in the Russia-controlled Ukrainian city of Melitopol city on Monday, injuring several people in what Russia's Investigative Committee and a Ukrainian official said may have been the work of Ukrainians opposed to Russia.", "url": "https://www.ndtv.com/world-news/several-inured-after-bomb-hits-russian-occupied-ukraine-city-of-melitopol-3024102", "urlToImage": "https://c.ndtvimg.com/2022-04/8ctb1l3o_ukraine-war-afp-650_625x300_24_April_22.jpg", "publishedAt": "2022-05-30T20:31:18Z", "content": "Ukraine War: According to preliminary information, 3 people were injured in bomb blast in Melitopol.\r\nKyiv:  A car bomb exploded in the Russia-controlled Ukrainian city of Melitopol city on Monday, i… [+1137 chars]"}]}