{"status": "ok", "totalResults": 309, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Over 21,000 Private Vehicles Fined For Bus Lane Violations In Delhi", "description": "Over 21,000 private vehicles have been challaned for violating designated bus lanes within two months of the launch of an enforcement drive by Delhi government's Transport department, officials said on Friday.", "url": "https://www.ndtv.com/india-news/over-21-000-private-vehicles-fined-for-bus-lane-violations-in-delhi-3016657", "urlToImage": "https://c.ndtvimg.com/2021-09/ojba386c_-delhi-traffic-_625x300_01_September_21.jpg", "publishedAt": "2022-05-28T00:25:18Z", "content": "Nearly 391 DTC buses and 328 cluster buses penalised under the drive that started from April 1. (File)\r\nNew Delhi: Over 21,000 private vehicles have been challaned for violating designated bus lanes … [+1633 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Mathura Case: Application Filed For Status Quo On Mosque Premises", "description": "Three applications were filed in the court of civil judge (senior division) in the Krishna Janmabhoomi-Shahi Idgah dispute case, requesting among other things that the status quo be maintained on the mosque premises, officials said.", "url": "https://www.ndtv.com/india-news/mathura-case-application-filed-for-status-quo-on-mosque-premises-3016654", "urlToImage": "https://c.ndtvimg.com/2022-05/nn1m4r7o_krishna-janmabhoomi-shahi-idgah-mosque-case-mathura-pti_625x300_07_May_22.jpg", "publishedAt": "2022-05-27T23:59:37Z", "content": "The next hearing in the Krishna Janmabhoomi-Shahi Idgah dispute case will be held on July 1.\r\nMathura: Three applications were filed in the court of civil judge (senior division) in the Krishna Janma… [+2032 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Kerala: 18 More Arrested For Hate Slogans At Popular Front Of India Rally", "description": "The Kerala Police on Friday arrested 18 more people in connection with the PFI sloganeering case.", "url": "https://www.ndtv.com/india-news/kerala-18-more-arrested-for-hate-slogans-at-popular-front-of-india-rally-in-alappuzha-3016647", "urlToImage": "https://c.ndtvimg.com/2020-11/ot9qoiqo_kerala-police-van_625x300_03_November_20.jpg", "publishedAt": "2022-05-27T23:31:16Z", "content": "Kerala Police also registered a case against Popular Front Of India Alappuzha district president.\r\nThiruvananthapuram:  The Kerala Police on Friday arrested 18 more people in connection with the PFI … [+1251 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Donald Trump Rejects Calls For Stricter Gun Control After Texas Shooting", "description": "Former US president Donald Trump rejected calls for tightened gun controls Friday following the Texas school massacre, saying decent Americans should be allowed the firearms they need to defend themselves against \"evil.\"", "url": "https://www.ndtv.com/world-news/donald-trump-rejects-calls-for-stricter-gun-control-after-texas-shooting-3016646", "urlToImage": "https://c.ndtvimg.com/2022-05/13d6d2_donald-trump-_625x300_08_May_22.jpg", "publishedAt": "2022-05-27T23:05:33Z", "content": "Trump said that Americans should be allowed the firearms to defend themselves against \"evil.\"\r\nHouston: Former US president Donald Trump rejected calls for tightened gun controls Friday following the… [+2888 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Authorities Scrutinise Elon Musk's Twitter Stock Buys", "description": "US market authorities have asked Elon Musk to explain an apparent delay in reporting his Twitter stock buys, the agency revealed Friday, the latest questions on the methods and intent of his troubled bid for the platform.", "url": "https://www.ndtv.com/world-news/us-authorities-scrutinise-elon-musks-twitter-stock-buys-3016637", "urlToImage": "https://c.ndtvimg.com/2022-05/jul1dlq8_elon-musk-afp_625x300_18_May_22.jpg", "publishedAt": "2022-05-27T22:37:38Z", "content": "Elon Musk also faces lawsuit by shareholders accusing him of pushing down Twitter share price.\r\nWashington: US market authorities have asked Elon Musk to explain an apparent delay in reporting his Tw… [+2431 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Pak PM Says Hiking Fuel Price Was Necessary To Avoid Bankruptcy", "description": "Pakistan Prime Minister Shehbaz Sharif on Friday said his government's move to increase fuel prices was necessary to avoid the country from facing bankruptcy.", "url": "https://www.ndtv.com/world-news/pak-pm-shehbaz-sharif-says-hiking-fuel-price-was-necessary-to-avoid-bankruptcy-3016629", "urlToImage": "https://c.ndtvimg.com/2022-04/9b12rq5_pakistan-pm-shehbaz-sharif-afp-650_625x300_11_April_22.jpg", "publishedAt": "2022-05-27T22:03:33Z", "content": "Pak PM said the move to increase fuel prices was necessary to avoid Pakistan from facing bankruptcy.\r\nIslamabad: Pakistan Prime Minister Shehbaz Sharif on Friday said his government's move to increas… [+3699 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine Accuses UN Nuclear Watchdog Of Falling For Russian Propaganda", "description": "Ukraine's state nuclear inspectorate on Friday accused the International Atomic Energy Agency (IAEA) of falling for Russian propaganda and demanded it back efforts by Kyiv to expel Moscow's forces from a major power plant.", "url": "https://www.ndtv.com/world-news/ukraine-accuses-un-nuclear-watchdog-of-falling-for-russian-propaganda-3016627", "urlToImage": "https://c.ndtvimg.com/2022-04/er03up14_zaporizhzhia-nuclear-power-plant-reuters_625x300_26_April_22.jpg", "publishedAt": "2022-05-27T21:45:37Z", "content": "Russian forces have occupied the Zaporizhzhia nuclear power station, the largest of its kind in Europe.\r\nKyiv: Ukraine's state nuclear inspectorate on Friday accused the International Atomic Energy A… [+1588 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Moves On Key City Amid Ukraine Church Schism", "description": "Russian troops were approaching the strategic city of Severodonetsk on Friday in a relentless offensive to control Ukraine's eastern Donbas region, as the war triggered a historic schism in the Ukrainian Orthodox Church's Moscow branch.", "url": "https://www.ndtv.com/world-news/russia-moves-on-key-city-amid-ukraine-church-schism-3016623", "urlToImage": "https://c.ndtvimg.com/2022-05/6boe0isg_severodonetsk-russia-ukraine-war-afp_625x300_19_May_22.jpg", "publishedAt": "2022-05-27T21:37:42Z", "content": "Pro-Russian separatists said they had captured the town of Lyman between Severodonetsk and Kramatorsk.\r\nKyiv: Russian troops were approaching the strategic city of Severodonetsk on Friday in a relent… [+5411 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rajasthan Cop Found Hanging From Tree: Police", "description": "A police head constable allegedly hanged himself from a tree in Rajasthan's Alwar district on Friday, officials said.", "url": "https://www.ndtv.com/india-news/rajasthan-cop-found-hanging-from-tree-police-3016574", "urlToImage": "https://c.ndtvimg.com/2019-05/em980mag_rajasthan-police-generic-twitter-650_625x300_28_May_19.jpg", "publishedAt": "2022-05-27T20:07:05Z", "content": "He was posted at Udyog Nagar police station in Alwar, police said. (Representational)\r\nAlwar, Rajasthan: A police head constable allegedly hanged himself from a tree in Rajasthan's Alwar district on … [+571 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Johnny Depp Vs Amber Heard: Jury Begins Deliberations After 6 Weeks Of Testimony", "description": "A jury began deliberations Friday in the defamation case between Johnny Depp and his ex-wife Amber Heard after a six-week trial featuring blistering mutual accusations of domestic abuse.", "url": "https://www.ndtv.com/world-news/johnny-depp-vs-amber-heard-jury-begins-deliberations-after-6-weeks-of-testimony-3016563", "urlToImage": "https://c.ndtvimg.com/2022-04/d5p67l3_johnny-depp-vs-amber-heard_625x300_30_April_22.jpg", "publishedAt": "2022-05-27T19:54:01Z", "content": "Johnny Depp filed suit against Heard over an op-ed she wrote for The Washington Post in December 2018.\r\nWashington: A jury began deliberations Friday in the defamation case between Johnny Depp and hi… [+4661 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "India Slams Islamic Nations' Group On Yasin Malik Remarks: \"Don't Justify\"", "description": "India on Friday slammed OIC-IPHRC for its criticism of judgement in the terror funding case involving Yasin Malik and said the organisation has implicitly expressed support for the terrorist activities.", "url": "https://www.ndtv.com/india-news/india-slams-islamic-nations-group-oic-on-yasin-malik-remarks-3016526", "urlToImage": "https://c.ndtvimg.com/2022-05/nkpmtd2_yasin-malik-afp-650_650x400_25_May_22.jpg", "publishedAt": "2022-05-27T19:04:20Z", "content": "NIA court on Wednesday awarded life imprisonment to Yasin Malik in a terror funding case.\r\nNew Delhi: India on Friday slammed OIC-IPHRC for its criticism of judgement in the terror funding case invol… [+1562 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Case Registered Over Misappropriation Of Rs 6 Crore Village Funds In Punjab", "description": "The Punjab Vigilance Bureau on Friday said it has booked 17 people, including two 'sarpanches' and a junior engineer, for allegedly misappropriating panchayat funds to the tune of Rs 6.66 crore.", "url": "https://www.ndtv.com/india-news/case-registered-over-misappropriation-of-rs-6-crore-village-funds-in-punjab-3016314", "urlToImage": "https://c.ndtvimg.com/2019-02/3lps5v78_bribe-generic_625x300_26_February_19.jpg", "publishedAt": "2022-05-27T18:52:51Z", "content": "Punjab: Further investigation is underway, probe body said. (Representational)\r\nChandigarh: The Punjab Vigilance Bureau on Friday said it has booked 17 people, including two 'sarpanches' and a junior… [+1551 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Maharashtra State-Run Hospital Nurses On Indefinite Strike From Today", "description": "Over 15,000 nurses of state-run hospitals in Maharashtra will go on indefinite strike from Saturday to protest against the state government's decision to outsource recruitment of nurses to a private agency, their association said.", "url": "https://www.ndtv.com/india-news/maharashtra-nurses-strike-maharashtra-nurses-strike-news-maharashtra-state-run-hospital-nurses-on-indefinite-strike-from-today-3016235", "urlToImage": "https://i.ndtvimg.com/i/2016-05/nurse-generic-istock_650x400_71463368694.jpg", "publishedAt": "2022-05-27T18:46:56Z", "content": "Maharashtra State Nurses Association had earlier called for a two-day strike. (Representational)\r\nMumbai: Over 15,000 nurses of state-run hospitals in Maharashtra will go on indefinite strike from Sa… [+855 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Why Quality Test Only In Delhi: Water Body's Swipe At Centre", "description": "Two days after the Delhi BJP chief urged the Centre to test the national capital's water quality, DJB vice-chairman Saurabh Bharadwaj on Friday said the exercise should cover Gujarat, Himachal Pradesh, Madhya Pradesh and Uttar Pradesh as well.", "url": "https://www.ndtv.com/delhi-news/why-quality-test-only-in-delhi-water-bodys-swipe-at-centre-3015948", "urlToImage": "https://c.ndtvimg.com/2021-03/ias5fgek_aap-saurabh-bharadwaj_625x300_31_March_21.jpg", "publishedAt": "2022-05-27T18:39:44Z", "content": "Delhi BJP chief had urged Centre to test the national capital's water quality.\r\nNew Delhi: Two days after the Delhi BJP chief urged the Centre to test the national capital's water quality, DJB vice-c… [+3597 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "India Faces Wider Coal Shortages, Worsening Power Outage Risks: Report", "description": "India is expected to face a wider coal shortage during the quarter ending September over expectations of higher power demand, an internal power ministry presentation seen by Reuters showed, worsening risks of widespread power outages.", "url": "https://www.ndtv.com/india-news/india-faces-wider-coal-shortages-worsening-power-outage-risks-report-3016491", "urlToImage": "https://c.ndtvimg.com/2020-01/f86dnk4_coal-india-reuters_625x300_07_January_20.jpg", "publishedAt": "2022-05-27T18:34:04Z", "content": "India has stepped up pressure on utilities to increase imports in recent days\r\nNew Delhi: India is expected to face a wider coal shortage during the quarter ending September over expectations of high… [+3316 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ladakh Bus Accident: PM, Amit Shah, Rajnath Singh Condole Soldiers' Deaths", "description": "Prime Minister Narendra Modi condoled the bus accident in Ladakh that claimed seven lives of Indian Army personnel on Friday.", "url": "https://www.ndtv.com/india-news/ladakh-bus-accident-pm-amit-shah-rajnath-singh-condole-soldiers-deaths-3015763", "urlToImage": "https://c.ndtvimg.com/2022-05/ptpvlmc8_shyok-accident-ani-650_650x400_27_May_22.jpg", "publishedAt": "2022-05-27T18:24:48Z", "content": "Ladakh Bus Accident: Seven Indian Army soldiers lost their lives in the accident.\r\nNew Delhi: Prime Minister Narendra Modi condoled the bus accident in Ladakh that claimed seven lives of Indian Army … [+2655 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "India Sends 25 Tonnes Of Medical Supplies To Crisis-Hit Sri Lanka", "description": "India on Friday handed over 25 tonnes of medical supplies worth over USD 700,000 to Sri Lanka as part of its ongoing efforts to help the island nation combat its worst economic crisis and shortage of medicines.", "url": "https://www.ndtv.com/india-news/sri-lanka-economic-crisis-india-sends-25-tonnes-of-medical-supplies-to-crisis-hit-sri-lanka-3015695", "urlToImage": "https://c.ndtvimg.com/2022-05/t4v2jj04_sri-lanka-aid_625x300_27_May_22.jpg", "publishedAt": "2022-05-27T18:20:54Z", "content": "Sri Lanka Economic Crisis: Sri Lanka is facing its worst economic crisis since gaining independence.\r\nColombo: India on Friday handed over 25 tonnes of medical supplies worth over USD 700,000 to Sri … [+2401 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Leclerc Completes \"Double Top\" For Ferrari In Monaco Practice", "description": "Charles Leclerc completed a convincing 'double top' at his home Monaco Grand Prix on Friday, finishing second practice fastest ahead of his Ferrari team-mate Carlos Sainz.", "url": "https://sports.ndtv.com/formula-1/leclerc-completes-double-top-for-ferrari-in-monaco-practice-3016461", "urlToImage": "https://c.ndtvimg.com/2022-05/vc9k8o5o_charles-leclerc-ferrari-afp_625x300_27_May_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-27T18:19:54Z", "content": "Charles Leclerc completed a convincing 'double top' at his home Monaco Grand Prix on Friday, finishing second practice fastest ahead of his Ferrari team-mate Carlos Sainz. The 24-year-old Monegasque … [+3685 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "15 Injured As Bus Plunges Into Ditch In Maharashtra's Palghar", "description": "At least 15 people were injured when the bus they were travelling in plunged into a roadside ditch near Waghoba Ghat in Maharashtra's Palghar on Friday.", "url": "https://www.ndtv.com/india-news/maharashtra-15-injured-as-bus-plunges-into-ditch-in-maharashtras-palghar-3015671", "urlToImage": "https://c.ndtvimg.com/2022-05/s779vrko_maharashtra-bus-accident_625x300_27_May_22.jpg", "publishedAt": "2022-05-27T18:15:59Z", "content": "Maharashtra: Rescue teams, police, and administration officials rushed to the spot.\r\nPalghar (Maharashtra): At least 15 people were injured when the bus they were travelling in plunged into a roadsid… [+473 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "In Russia's Biggest Advance in Weeks, Ukraine Loses Railway Hub", "description": "Russian forces in eastern Ukraine captured the centre of the railway hub town of Lyman and encircled most of Sievierodonetsk city, Ukrainian officials said on Friday, as Kyiv's forces fell back in the face of Moscow's biggest advance for weeks.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-lyman-sievierodonetsk-in-russias-biggest-advance-in-weeks-ukraine-lose-railway-hub-3016447", "urlToImage": "https://c.ndtvimg.com/2022-05/sqnvioa_russiaukraine_625x300_27_May_22.jpg", "publishedAt": "2022-05-27T18:12:36Z", "content": "Ukrainian officials acknowledged that Russia had captured most of Donbas.\r\nKyiv: Russian forces in eastern Ukraine captured the centre of the railway hub town of Lyman and encircled most of Sievierod… [+5551 chars]"}]}