{"status": "ok", "totalResults": 529, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": "Posted by Aditi Gautam", "title": "Ukraine-Russia War Live: Ukraine Urges Solidarity Against Russia", "description": "Western nations are set to warn Russian President Vladimir Putin today that his country will pay \"ruinous\" costs for invading Ukraine during an unprecedented one-day trio of NATO, G7 and EU summits that will be attended by US President Joe Biden.", "url": "https://www.ndtv.com/world-news/ukraine-russia-war-live-updates-ukraine-urges-solidarity-against-russia-as-western-leaders-gather-in-europe-2839791", "urlToImage": "https://c.ndtvimg.com/2022-03/8j4du3ao_ukraine-war_625x300_24_March_22.jpg", "publishedAt": "2022-03-24T01:27:42Z", "content": "The resolve to punish Moscow with massive sanctions will be underlined in summits\r\nNew Delhi: Western nations are set to warn Russian President Vladimir Putin today that his country will pay \"ruinous… [+1126 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Covid Makes Comeback In US As Omicron BA.2 Variant Becomes Dominant", "description": "Covid is making its latest comeback in parts of the northeastern United States as BA.2 coronavirus variant becomes dominant in the country, officials, while urging Congress to pass new funding or risk the supply of future treatments and vaccines.", "url": "https://www.ndtv.com/world-news/covid-makes-comeback-in-us-as-omicron-ba-2-variant-becomes-dominant-2839787", "urlToImage": "https://c.ndtvimg.com/2021-12/vgnln264_new-york-us-covid-afp_625x300_03_December_21.jpg", "publishedAt": "2022-03-24T01:26:41Z", "content": "BA.2 currently accounts for 35 percent of cases nationally and is expected to become dominant soon.\r\nWashington: Covid is making its latest comeback in parts of the northeastern United States as the … [+2930 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Madeleine Albright, First Female US Secretary Of State, Dies At 84", "description": "Madeleine Albright, who came to the United States as a child refugee and rose to be the first female secretary of state, shaping American foreign policy at the end of the 20th century, has died at the age of 84.", "url": "https://www.ndtv.com/world-news/madeleine-albright-first-female-us-secretary-of-state-dies-at-84-2839771", "urlToImage": "https://c.ndtvimg.com/2022-03/vmo9p7jo_madeleine-albright_625x300_24_March_22.jpg", "publishedAt": "2022-03-24T00:46:56Z", "content": "Albright took the helm of the State Department in a post-Cold War world in which the US.\r\nWashington: Madeleine Albright, who came to the United States as a child refugee and rose to be the first fem… [+4379 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE: India Logs 1,778 New COVID-19 Cases In 24 Hours", "description": "India reported a total of 1,778 fresh coronavirus cases in the last 24 hours, taking the COVID-19 tally to 4,30,12,749. According to Union health ministry data, the active cases declined further to 23,087 on Wednesday.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-24-march-2022-2839764", "urlToImage": "https://c.ndtvimg.com/2020-11/j50nmb7o_noidadelhi-random-covid-testing_625x300_18_November_20.jpg", "publishedAt": "2022-03-24T00:19:30Z", "content": "India Covid Cases: The daily positivity rate was recorded at 0.28 per cent\r\nNew Delhi: India reported a total of 1,778 fresh coronavirus cases in the last 24 hours, taking the COVID-19 tally to 4,30,… [+484 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Odisha All Set For Civic Body Polls Today Amid Tight Security", "description": "Elections will be held in 106 civic bodies and three municipal corporations in Odisha today amid tight security, officials said.", "url": "https://www.ndtv.com/india-news/odisha-all-set-for-civic-body-polls-today-amid-tight-security-2839757", "urlToImage": "https://c.ndtvimg.com/2020-09/djqil16o_electionsvoting-genericindiaafp-_625x300_25_September_20.jpg", "publishedAt": "2022-03-24T00:01:55Z", "content": "Polling will be held in 3,068 booths of 1,731 wards in the 106 civic bodies.\r\nBhubaneswar: Elections will be held in 106 civic bodies and three municipal corporations in Odisha today amid tight secur… [+1673 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Centre Must Give Up Idea Of Privatisation Of Railways: Mallikarjun Kharge", "description": "Congress' Mallikarjun Kharge said the Centre must give up the idea of privatisation of railways, and accused the dispensation of not giving due credit to the previous governments for their contribution to the development of national transporter.", "url": "https://www.ndtv.com/india-news/centre-must-give-up-idea-of-privatisation-of-railways-congress-leader-mallikarjun-kharge-2839752", "urlToImage": "https://c.ndtvimg.com/2018-11/i2d88uv_mallikarjun-kharge_625x300_03_November_18.jpg", "publishedAt": "2022-03-23T23:46:09Z", "content": "Mr Kharge was speaking during a discussion on the working of the Ministry of Railways.\r\nNew Delhi: Congress leader Mallikarjun Kharge on Wednesday said the Centre must give up the idea of privatisati… [+2993 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UK Says It Will Send 6,000 Missiles To Ukraine To Fight Against Russia", "description": "Prime Minister Boris Johnson said late Wednesday Britain would send 6,000 missiles and £25 million ($33 million, 30 million euros) in financial aid to Ukraine's army to help it fight Russian forces.", "url": "https://www.ndtv.com/world-news/uk-says-it-will-send-6-000-missiles-to-ukraine-to-fight-against-russia-2839745", "urlToImage": "https://c.ndtvimg.com/2022-02/snkvhrgg_russia-ukraine-crisis-kyiv-afp-650_625x300_28_February_22.jpg", "publishedAt": "2022-03-23T23:30:40Z", "content": "Thursday's NATO summit in Brussels is expected to announce new sanctions on Russia.\r\nLondon: Prime Minister Boris Johnson said late Wednesday Britain would send 6,000 missiles and £25 million ($33 mi… [+2426 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "India Abstains In UN Vote On Russian Resolution Over Ukraine Humanitarian Crisis", "description": "India, along with 12 other UN Security Council members, abstained on a resolution by Russia on the humanitarian crisis in Ukraine.", "url": "https://www.ndtv.com/world-news/india-abstains-in-un-vote-on-russian-resolution-over-ukraine-humanitarian-crisis-2839738", "urlToImage": "https://c.ndtvimg.com/2022-03/0vki2nno_ukraine-war-afp-650_625x300_17_March_22.jpg", "publishedAt": "2022-03-23T23:10:32Z", "content": "The draft resolution by Russia was cosponsored by Syria, North Korea and Belarus.\r\nUnited Nations:  India, along with 12 other UN Security Council members, abstained on a resolution by Russia on the … [+4747 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine's Zelensky Urges Global Protests Against Russia", "description": "Ukrainian President Volodymyr Zelensky on Wednesday urged citizens around the world to take to the streets to protest Russia's invasion of his country.", "url": "https://www.ndtv.com/world-news/ukraine-president-volodymyr-zelensky-urges-global-protests-against-russia-2839729", "urlToImage": "https://c.ndtvimg.com/2022-03/djvkmrso_volodymyr-zelensky-netflix-show-servant-of-the-people-650_625x300_16_March_22.jpg", "publishedAt": "2022-03-23T22:42:31Z", "content": "Zelensky urged people across the world to come out against Russia's war in his country.\r\nKyiv: Ukrainian President Volodymyr Zelensky on Wednesday urged citizens around the world to take to the stree… [+960 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UN To Again \"Demand\" Russia \"Immediately\" Stop War In Ukraine", "description": "The UN General Assembly was debating on Wednesday a new non-binding resolution which, if adopted by a majority of member states, will \"demand\" that Russia stop the war in Ukraine \"immediately\".", "url": "https://www.ndtv.com/world-news/un-to-again-demand-russia-immediately-stop-war-in-ukraine-2839723", "urlToImage": "https://c.ndtvimg.com/2022-03/o7ehm0o_kyiv-ukraine-russia-afp-650_625x300_01_March_22.jpg", "publishedAt": "2022-03-23T22:17:54Z", "content": "On Wednesday, Ukraine put the new resolution forward at another emergency session of the UN.\r\nUnited Nations: The UN General Assembly was debating on Wednesday a new non-binding resolution which, if … [+2586 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Joe Biden Lands In Brussels For NATO Summit On Ukraine", "description": "US President Joe Biden arrived in Brussels on Wednesday for crunch summits with European, G7 and NATO allies, expected to focus on Russia's invasion of Ukraine, pictures on broadcaster CNN showed.", "url": "https://www.ndtv.com/world-news/us-president-joe-biden-lands-in-brussels-for-european-g7-nato-summit-on-ukraine-2839721", "urlToImage": "https://c.ndtvimg.com/2021-11/o825fakg_biden-afp_625x300_01_November_21.jpg", "publishedAt": "2022-03-23T22:00:21Z", "content": "Biden is expected to announce new Russia sanctions during meeting with NATO and G7.\r\nBrussels: US President Joe Biden arrived in Brussels on Wednesday for crunch summits with European, G7 and NATO al… [+404 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Congress Calls Meeting To Discuss Organisational Elections On Saturday", "description": "Congress has called a meeting of General Secretaries and in-charges on Saturday to discuss a range of issues including organizational elections.", "url": "https://www.ndtv.com/india-news/congress-calls-meeting-to-discuss-organisational-elections-on-saturday-2839713", "urlToImage": "https://c.ndtvimg.com/2022-03/h1g0f4i_sonia-gandhi-rahul-gandhi-afp_625x300_21_March_22.jpg", "publishedAt": "2022-03-23T21:36:25Z", "content": "Congress faced a debacle in 5 states - UP Uttarakhand Goa, Manipur and Punjab.\r\nCongress has called a meeting of General Secretaries and in-charges on Saturday to discuss a range of issues including … [+1261 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Delhi To Develop \"World-Class Parks\" On 3,000 Acres Land: Arvind Kejriwal", "description": "The Delhi government will transform the national capital into a city of \"world-class parks\" by developing about 3,000 acres of land into state-of-the-art facilities across 17 city forests under the 'Mukhyamantri Park Saundaryakaran Yojna', an officia", "url": "https://www.ndtv.com/india-news/delhi-to-develop-world-class-parks-on-3-000-acres-land-chief-minister-arvind-kejriwal-2839706", "urlToImage": "https://c.ndtvimg.com/2022-02/5lk3fak_arvind-kejriwal_625x300_15_February_22.jpg", "publishedAt": "2022-03-23T21:19:27Z", "content": "Mr Kejriwal directed the officials to submit a detailed project report within 15 days.\r\nNew Delhi: The Delhi government will transform the national capital into a city of \"world-class parks\" by devel… [+1978 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russian Journalist Killed In Ukraine While Filming Destruction", "description": "A Russian journalist for the investigative news outlet The Insider was killed when Russian troops shelled a residential neighbourhood in the Ukrainian capital, the outlet said Wednesday, the latest reporter to die in war.", "url": "https://www.ndtv.com/world-news/russian-journalist-oksana-baulina-killed-in-kyiv-shelling-while-filming-destruction-2839699", "urlToImage": "https://c.ndtvimg.com/2022-03/ghc4vk08_ukraine-war-afp_625x300_20_March_22.jpg", "publishedAt": "2022-03-23T20:55:53Z", "content": "She was died while filming the destruction caused by Russian shelling.\r\nKyiv: A Russian journalist for the investigative news outlet The Insider was killed when Russian troops shelled a residential n… [+1909 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Blocks Google News, Cites \"Fake Material\" On Ukraine War: Report", "description": "Russia's communications regulator has blocked Alphabet's Google News, accusing it of allowed access to what it calls fake material about the country's military operation in Ukraine, Interfax news agency said on Wednesday.", "url": "https://www.ndtv.com/world-news/russia-blocks-google-news-cites-ukraine-conflict-report-2839677", "urlToImage": "https://c.ndtvimg.com/2022-03/k83gj7go_ukraine-war-afp_625x300_22_March_22.jpg", "publishedAt": "2022-03-23T20:27:33Z", "content": "Moscow: Russia's communications regulator has blocked Alphabet's Google News, accusing it of allowed access to what it calls fake material about the country's military operation in Ukraine, Interfax … [+275 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ready To Hold Up Dialogue With Putin On Ukraine, Says France's Macron", "description": "French President Emmanuel Macron said on Wednesday that he was prepared to hold up the dialogue with Russia and its president, Vladimir Putin, over the war in Ukraine.", "url": "https://www.ndtv.com/world-news/france-president-emmanuel-macron-says-he-is-ready-to-hold-up-talks-with-russian-president-vladimir-putin-on-ukraine-2839671", "urlToImage": "https://c.ndtvimg.com/2022-02/klns7ap_french-president-emmanuel-macron-vladimir-putin-meetingreuters650_625x300_11_February_22.jpg", "publishedAt": "2022-03-23T20:06:11Z", "content": "Macron said Europe \"will do everything\" to stop the war in Ukraine.\r\nParis: French President Emmanuel Macron said on Wednesday that he was prepared to hold up the dialogue with Russia and its preside… [+486 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Germany To Send 2,000 More Anti-Tank Weapons To Ukraine: Report", "description": "Germany will send 2,000 additional anti-tank weapons to Ukraine to help it repel the Russian invasion, a parliamentary source told AFP on Wednesday.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-germany-to-send-2-000-more-anti-tank-weapons-to-ukraine-report-2839664", "urlToImage": "https://c.ndtvimg.com/2022-03/kj4ou2b4_russia-ukraine-afp_625x300_12_March_22.jpg", "publishedAt": "2022-03-23T19:41:01Z", "content": "Germany has also provided around 500 Strela surface-to-air missiles out from 2,700 promised.\r\nBerlin: Germany will send 2,000 additional anti-tank weapons to Ukraine to help it repel the Russian inva… [+1297 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "In A Tit-For-Tat Move, Russia Expels US Diplomats Amid Ukraine War", "description": "Russia on Wednesday said it was expelling US diplomats in retaliation for Washington's move to remove 12 of Moscow's representatives to the UN based in New York.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-russia-expels-us-diplomats-amid-ukraine-crisis-2839644", "urlToImage": "https://c.ndtvimg.com/2022-03/ec71sdp_ukraine-war-kyiv-afp-650_625x300_06_March_22.jpg", "publishedAt": "2022-03-23T19:03:32Z", "content": "Earlier, US expelled 12 members of the Russian diplomatic mission to the UN.\r\nMoscow: Russia on Wednesday said it was expelling US diplomats in retaliation for Washington's move to remove 12 of Mosco… [+1454 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Indore Man Drags 3 Puppies On Road In Sack, 1 Dies", "description": "An FIR was registered against a man on Wednesday for allegedly putting three stray puppies roaming near his residence in Indore in a sack and dragging them to some distance, leading to the death of one of the canines.", "url": "https://www.ndtv.com/cities/madhya-pradesh-indore-man-drags-3-puppies-on-road-in-sack-1-dies-2839563", "urlToImage": "https://c.ndtvimg.com/2022-03/4gafkp3o_madhya-pradesh-police-generic_625x300_19_March_22.jpg", "publishedAt": "2022-03-23T18:46:36Z", "content": "Indore: The man allegedly put three puppies in a sack and dragged them to a distance. (Representational)\r\nIndore: An FIR was registered against a man on Wednesday for allegedly putting three stray pu… [+904 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Court Allows Child Abuse Case Accused To Cross-Examine Survivor", "description": "In a significant judgment, the Madras High Court has held that an accused in a POCSO case might be allowed to cross-examine the survivor, who was a minor at the time of occurrence, but an adult(21 years old) now.", "url": "https://www.ndtv.com/tamil-nadu-news/madras-high-court-allows-child-abuse-case-accused-to-cross-examine-survivor-2839626", "urlToImage": "https://c.ndtvimg.com/2019-09/v4ps907_madras-high-court-650_650x400_06_September_19.jpg", "publishedAt": "2022-03-23T18:38:03Z", "content": "Petitioner's counsel said survivor is now aged 21 and the bar will not operate anymore (Representational)\r\nChennai: In a significant judgment, the Madras High Court has held that an accused in a Prot… [+3287 chars]"}]}