{"status": "ok", "totalResults": 256, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE: India Records Over 3,000 New COVID-19 Cases In 24 Hours", "description": "India reported at least 3,157 new COVID-19 cases in the last 24 hours, taking the coronavirus tally to 4,30,82,345. The country also recorded 26 new covid-related fatalies, bring the total number of deaths to 523,869.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-may-3-2941077", "urlToImage": "https://c.ndtvimg.com/2020-11/mls1442o_covid-testingdelhinoidaborderpti_625x300_18_November_20.jpg", "publishedAt": "2022-05-03T00:25:45Z", "content": "India COVID-19 Live: India also recorded 26 deaths in the last 24 hours.\r\nNew Delhi: India reported at least 3,157 new COVID-19 cases in the last 24 hours, taking the coronavirus tally to 4,30,82,345… [+390 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sacrilege Case: Court Allows Dera Chief To Appear Via Video Conferencing", "description": "The Punjab and Haryana High Court on Monday allowed the plea of Dera Sacha Sauda head Gurmeet Ram Rahim seeking relief from physical appearance and permission to appear via video conferencing before the court in matters related to sacrilege case.", "url": "https://www.ndtv.com/india-news/court-allows-dera-chief-to-appear-via-video-conferencing-in-2015-sacrilege-case-2941061", "urlToImage": "https://i.ndtvimg.com/i/2017-08/dera-sacha-sauda-chief-gurmeet-ram-rahim-singh_650x400_81503912100.jpg", "publishedAt": "2022-05-03T00:00:37Z", "content": "Currently, Dera Chief Gurmeet Ram Rahim is serving his sentence in rape and murder cases.\r\nChandigarh: The Punjab and Haryana High Court on Monday allowed the plea of Dera Sacha Sauda head Gurmeet Ra… [+1295 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Hitler Was Jewish\": An Old Conspiracy Theory", "description": "The suggestion by Russia's foreign minister that Adolf Hitler had Jewish blood is just the latest version of a conspiracy theory exploiting a gap in the dictator's ancestry.", "url": "https://www.ndtv.com/world-news/hitler-was-jewish-an-old-conspiracy-theory-2941047", "urlToImage": "https://i.ndtvimg.com/i/2016-10/adolf-hitler_650x400_81476716851.jpg", "publishedAt": "2022-05-02T23:23:09Z", "content": "Hitler's father, Alois, was an illegitimate child whose own father was unknown, Austrian historian said.\r\nVienna: The suggestion by Russia's foreign minister that Adolf Hitler had Jewish blood is jus… [+3208 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "New India Takes Risks, It Innovates: PM Modi To Indian Community In Berlin", "description": "Prime Minister Narendra Modi on Monday said the New India doesn't think only of a secure future alone but takes risks.", "url": "https://www.ndtv.com/india-news/new-india-takes-risks-it-innovates-pm-modi-to-indian-community-in-berlin-2941040", "urlToImage": "https://c.ndtvimg.com/2022-05/cggat548_pm-modi-berlin-ndtv_625x300_02_May_22.jpg", "publishedAt": "2022-05-02T23:06:35Z", "content": "India has more than 68,000 startups, PM Modi told Indian Community In Berlin.\r\nBerlin: Prime Minister Narendra Modi on Monday said the New India doesn't think only of a secure future alone but takes … [+2601 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "40% Of Global Real-Time Payments Took Place In India In 2021: PM Modi", "description": "Addressing the Indian community in Berlin, Prime Minister Narendra Modi on Monday said that of the total real-time digital payments that took place throughout the world in 2021, 40 per cent took place in India.", "url": "https://www.ndtv.com/india-news/40-of-global-real-time-payments-took-place-in-india-in-2021-pm-modi-in-berlin-2941037", "urlToImage": "https://c.ndtvimg.com/2022-05/cggat548_pm-modi-berlin-ndtv_625x300_02_May_22.jpg", "publishedAt": "2022-05-02T22:47:29Z", "content": "PM Modi also talked about the \"record number of airports being built in the country.\"\r\nBerlin: Addressing the Indian community in Berlin, Prime Minister Narendra Modi on Monday said that of the total… [+3270 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Cops To Move Gauhati High Court Against Bail To Jignesh Mevani", "description": "Assam Advocate General Debojit Saikia said that the Investigating Officer of Barpeta Road Police Station will file a separate petition through the public prosecutor before the Gauhati High Court against the bail granted to Gujarat MLA Jignesh Mevani.", "url": "https://www.ndtv.com/india-news/cops-to-move-gauhati-high-court-against-bail-to-gujarat-mla-jignesh-mevani-2941036", "urlToImage": "https://i.ndtvimg.com/i/2018-01/jignesh-mewani_650x400_51515139431.jpg", "publishedAt": "2022-05-02T22:28:02Z", "content": "Jignesh Mevani was arrested on 20 April by Assam police over his offensive tweet against PM Modi.\r\nGuwahati: Assam Advocate General Debojit Saikia on Monday said that the Investigating Officer of Bar… [+2768 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "1 Arrested, 5 Charged For Child Marriage In Rajasthan", "description": "One person was arrested and five others were booked in case of alleged child marriage in Jhalawar district of Rajasthan last week, police said on Monday.", "url": "https://www.ndtv.com/india-news/1-arrested-5-charged-for-child-marriage-in-rajasthans-jhalawar-2941031", "urlToImage": "https://i.ndtvimg.com/i/2016-05/arrest-generic_650x400_71463458726.jpg", "publishedAt": "2022-05-02T22:07:27Z", "content": "Jhalawar child marriage: The marriage took place in the Gurjar community, police said. (Representational)\r\nKota: One person was arrested and five others were booked in case of alleged child marriage … [+1316 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UK PM To Announce New Military Aid In Address To Ukrainian Parliament", "description": "British Prime Minister Boris Johnson will announce Tuesday another £300 million ($376 mn, 358 mn euros) in military aid for Ukraine in a remote address to its parliament, his office said Monday.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-uk-pm-boris-johnson-to-announce-376-million-more-military-aid-to-ukraine-in-address-to-ukrainian-parliament-2941027", "urlToImage": "https://c.ndtvimg.com/2022-04/lhrqh2_boris-johnson-650_625x300_22_April_22.jpg", "publishedAt": "2022-05-02T21:55:38Z", "content": "Russia-Ukraine war: On the diplomatic front, Britain is also reopening its embassy in Kyiv.\r\nLondon: British Prime Minister Boris Johnson will announce Tuesday another £300 million ($376 mn, 358 mn e… [+2520 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine's Zelensky Says Russia Forgot World War II Lessons", "description": "Ukraine's President Volodymyr Zelenskiy said on Monday that Russian Foreign Minister Sergei Lavrov's suggestion that Nazi leader Adolf Hitler had Jewish origins showed that Moscow has forgotten, or never learned, the lessons of World War Two.", "url": "https://www.ndtv.com/world-news/ukraine-president-volodymyr-zelensky-says-russia-forgot-world-war-ii-lessons-2941017", "urlToImage": "https://c.ndtvimg.com/2022-03/bh3l1t3g_zelensky-on-streets-afp_650x400_24_March_22.jpg", "publishedAt": "2022-05-02T21:30:04Z", "content": "Zelensky reacted after Russia's foreign minister claimed that Adolf Hitler \"had Jewish blood\".\r\nKyiv:  Ukraine's President Volodymyr Zelenskiy said on Monday that Russian Foreign Minister Sergei Lavr… [+578 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Palestine's Hamas Claims Responsibility For Deadly West Bank Shooting", "description": "The Islamist movement Hamas that rules the Gaza Strip said Monday they were behind a recent attack that killed an Israeli in the West Bank, linking it to tensions in Jerusalem.", "url": "https://www.ndtv.com/world-news/palestines-hamas-claims-responsibility-for-deadly-west-bank-shooting-2941009", "urlToImage": "https://c.ndtvimg.com/2022-04/e0ei6018_jerusalem-al-aqsa-mosque-afp-650_625x300_29_April_22.jpg", "publishedAt": "2022-05-02T21:07:50Z", "content": "Hamas said the Friday shooting was in response to the \"brutal aggression of against Al-Aqsa mosque.(File)\r\nGaza City, Palestinian: The Islamist movement Hamas that rules the Gaza Strip said Monday th… [+2001 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sri Lanka: Protest Intensifies Amid No-Trust Motion Against Government", "description": "The protests at 'Galle Face' in Colombo in front of the Presidential Secretariat continued for the 24th day on Monday even as the government faces the prospect of a no-confidence motion in the upcoming parliamentary session.", "url": "https://www.ndtv.com/world-news/sri-lanka-protest-intensifies-amid-no-trust-motion-against-mahinda-rajapaksa-government-2940997", "urlToImage": "https://c.ndtvimg.com/2022-04/0tbcia8_sri-lanka-crisis_625x300_05_April_22.jpg", "publishedAt": "2022-05-02T20:40:16Z", "content": "Sri Lanka is facing its worst economic crisis since independence with food and fuel shortages.\r\nColombo:  As the ongoing economic crisis continues to fuel unrest in the Island country, the protests a… [+2790 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "PM Modi Urges German Businesses To Invest In India's Youth", "description": "Prime Minister Narendra Modi on Monday highlighted the reforms undertaken by his government as he interacted with Indian and German business leaders, urging them to invest in India's youth.", "url": "https://www.ndtv.com/india-news/pm-narendra-modi-urges-german-businesses-to-invest-in-indias-youth-2940971", "urlToImage": "https://c.ndtvimg.com/2022-05/ak6ng4qg_pm-modi-in-europe-dd-650_650x400_02_May_22.jpg", "publishedAt": "2022-05-02T20:13:58Z", "content": "PM Modi in Germany: PM Modi invited the German business leaders to invest in India's youth.\r\nBerlin: Prime Minister Narendra Modi on Monday highlighted the reforms undertaken by his government as he … [+2502 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "White House Says \"Biden Will Love To Visit Ukraine, But...\"", "description": "U.S. President Joe Biden would \"love to visit Ukraine,\" but there are no current plans for him to do so, White House spokesperson Jen Psaki said on Monday, after House of Representatives Speaker Nancy Pelosi paid a surprise visit over the weekend.", "url": "https://www.ndtv.com/world-news/white-house-says-us-president-joe-biden-will-love-to-visit-ukraine-but-not-now-2940963", "urlToImage": "https://c.ndtvimg.com/2022-03/6dp1afqo_joe-biden-in-warsaw-afp-650_625x300_26_March_22.jpg", "publishedAt": "2022-05-02T19:54:21Z", "content": "Russia-Ukraine war: Last month, White House had told that Joe Biden has no plans to visit Ukraine.\r\nWashington:  U.S. President Joe Biden would \"love to visit Ukraine,\" but there are no current plans… [+562 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Says Russia Planning To \"Annex\" Ukraine's Donetsk, Lugansk Regions", "description": "Russia is planning imminently to \"annex\" the two eastern regions of Ukraine battered by its invasion after failing to overthrow the Kyiv government, a senior US official said Monday.", "url": "https://www.ndtv.com/world-news/us-says-russia-planning-to-annex-ukraines-donetsk-lugansk-regions-2940958", "urlToImage": "https://c.ndtvimg.com/2022-04/mfdercb_donetsk-ukraine-war-afp-650_625x300_15_April_22.jpg", "publishedAt": "2022-05-02T19:38:13Z", "content": "US also believes Russia was considering a similar plan to annex a third region---Ukraine's Kherson.\r\nWashington: Russia is planning imminently to \"annex\" the two eastern regions of Ukraine battered b… [+1365 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "European Union Readies For End Of Russia Gas, Warns Won't Pay In Ruble", "description": "The European Union warned member states Monday to prepare for a possible complete breakdown in gas supplies from Russia, insisting it would not cede to Moscow's demand that imports be paid for in rubles.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-european-union-readies-for-end-of-russia-gas-warns-wont-pay-in-ruble-2940933", "urlToImage": "https://c.ndtvimg.com/2018-11/11mvgsl8_gas-pipeline-generic_625x300_07_November_18.jpg", "publishedAt": "2022-05-02T19:06:07Z", "content": "Europe Gas Shortage: EU said no European company was preparing to pay for Russian gas in rubles.\r\nBrussels: The European Union warned member states Monday to prepare for a possible complete breakdown… [+4332 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Kerala Pip Bengal On Penalties To Win Santosh Trophy", "description": "Hosts Kerala bounced back from a goal down to beat heavyweights Bengal 5-4 in the penalty shootout and win their seventh Santosh Trophy title.", "url": "https://sports.ndtv.com/football/kerala-pip-bengal-on-penalties-to-win-santosh-trophy-2940903", "urlToImage": "https://c.ndtvimg.com/2022-05/thjd9k5g_kerala-santosh-trophy-twitter_625x300_03_May_22.jpg", "publishedAt": "2022-05-02T18:32:59Z", "content": "Hosts Kerala bounced back from a goal down to beat heavyweights Bengal 5-4 in the penalty shootout and win their seventh Santosh Trophy title at the Manjeri Payyanad Football Stadium in Malappuram on… [+2398 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Rinku Singh Stars vs Rajasthan Royals As KKR End 5-Match Losing Streak", "description": "IPL 2022: Rinku Singh played a key knock as Kolkata Knight Riders chased down a target of 153 to beat Rajasthan Royals by seven wickets.", "url": "https://sports.ndtv.com/ipl-2022/kkr-vs-rr-rinku-singh-stars-vs-rajasthan-royals-as-kolkata-knight-riders-end-5-match-losing-streak-2940877", "urlToImage": "https://c.ndtvimg.com/2022-05/sdp0hl1_rinku-singh-bcciipl_625x300_02_May_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-02T18:16:19Z", "content": "Kolkata Knight Riders defeated in-form Rajasthan Royals by seven wickets to snap their five-match losing streak in the Indian Premier League here on Monday. KKR first restricted RR to 152 for five af… [+3871 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Successful Trials Of India-Made Advanced Artillery Gun System Carried Out", "description": "Trials of made in India Advanced Towed Artillery Gun System (ATAGS) were successfully conducted at Pokhran Field Firing Range (PFFR) between April 26 and May 2, Defence Research and Development Organisation (DRDO) officials said on Monday.", "url": "https://www.ndtv.com/india-news/successful-trials-of-atags-howitzers-carried-out-in-pokhran-2940834", "urlToImage": "https://c.ndtvimg.com/2022-05/kbovsrgo_atags-howtizer-trials_625x300_02_May_22.jpg", "publishedAt": "2022-05-02T17:52:18Z", "content": "The Advanced Towed Artillery Gun System (ATAGS) has been developed by the DRDO.\r\nJaisalmer, Rajasthan: Trials of made in India Advanced Towed Artillery Gun System (ATAGS) were successfully conducted … [+714 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Congress Leader Urges PM Modi To Allow Hybrid Classes", "description": "In his letter to the prime minister, Congress leader Adhir Ranjan Chowdhury claimed that there is a lack of availability of Covaxin and Covishield, and most children below 18 years remain unprotected", "url": "https://www.ndtv.com/education/congress-leader-urges-pm-modi-to-allow-hybrid-classes-as-children-remain-unvaccinated-against-covidd-19", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/5/2/CBSE_Web_860.jpg", "publishedAt": "2022-05-02T17:49:13Z", "content": "New Delhi:Congress leader in Lok Sabha Adhir Ranjan Chowdhury on Monday wrote to Prime Minister Narendra Modi urging him to allow hybrid classes as schoolchildren continue to remain unvaccinated agai… [+950 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Netflix Cancels Meghan Markle Animated Series 'Pearl'", "description": "Netflix has canceled an animated series created by Meghan Markle as it makes cost-saving moves following disappointing first-quarter results.", "url": "https://www.ndtv.com/world-news/netflix-cancels-meghan-markle-animated-series-pearl-2940825", "urlToImage": "https://c.ndtvimg.com/2021-07/56fv2bg8_meghan-markle-afp_625x300_15_July_21.jpg", "publishedAt": "2022-05-02T17:48:26Z", "content": "\"Pearl\" was due to be about a 12-year-old girl who is inspired by historical female figures.\r\nNew York, United States: Netflix has canceled an animated series created by Meghan Markle as it makes cos… [+1818 chars]"}]}