{"status": "ok", "totalResults": 282, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": "Neelav Chakravarti", "title": "IPL 2022 Points Table Update, Latest Orange Cap, Purple Cap Lists", "description": "SunRisers Hyderabad (SRH) defeated Mumbai Indians (MI) by three runs in Match 65 of the ongoing Indian Premier League (IPL) 2022 season, at the Wankhede Stadium in Mumbai on Tuesday", "url": "https://sports.ndtv.com/ipl-2022/ipl-2022-points-table-update-latest-orange-cap-purple-cap-lists-after-mi-vs-srh-match-65-2985589", "urlToImage": "https://c.ndtvimg.com/2022-05/ndl4joe8_srh-bcciipl_650x400_17_May_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-18T02:40:33Z", "content": "SunRisers Hyderabad (SRH) defeated Mumbai Indians (MI) by three runs in Match 65 of the ongoing Indian Premier League (IPL) 2022 season, at the Wankhede Stadium in Mumbai on Tuesday. Defending a targ… [+1416 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Arnab Mitra", "title": "CBSE Class 12 Geography Exam 2022 Today; Checklist For Students", "description": "The Class 12 Geography paper will be of 35 marks, and be held for two hours, from 10:30 AM to 12:30 PM. The paper will have five sections- A, B, C, D and E having a total of 10 questions.", "url": "https://www.ndtv.com/education/cbse-class-12-geography-exam-2022-today-important-checklist-for-students", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/5/17/shutterstock_157595726.jpg", "publishedAt": "2022-05-18T02:39:29Z", "content": "New Delhi:The Central Board of Secondary Education (CBSE) Class 12 term 2 Geography exam 2022 will be conducted on Wednesday, May 18. The Class 12 Geography paper will be of 35 marks, and be held for… [+1951 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "New York Raises Covid Alert From \"Medium\" To \"High\" As Infections Soar", "description": "New York City, the largest city in the United States, raised its COVID-19 alert level from \"medium\" to \"high\" on Tuesday, as infections continue to go up in recent weeks.", "url": "https://www.ndtv.com/world-news/new-york-city-lifts-covid-19-alert-level-to-high-2985585", "urlToImage": "https://c.ndtvimg.com/2022-04/ku9be3a8_covid-generic_625x300_26_April_22.jpg", "publishedAt": "2022-05-18T02:32:03Z", "content": "New York City raised its COVID-19 alert level to \"medium\" from \"low\" in early May. (Representational)\r\nNew York: New York City, the largest city in the United States, raised its COVID-19 alert level … [+1405 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Twitter India Exec Summoned For \"No Action\" Against Comedian Kunal Kamra", "description": "The country's top child rights body NCPCR has summoned Twitter India's communications director today for not submitting an action taken report against comedian Kunal Kamra for posting a \"doctored\" video of a boy singing a song for PM Modi.", "url": "https://www.ndtv.com/india-news/twitter-india-exec-summoned-for-no-action-against-comedian-kunal-kamra-2983432", "urlToImage": "https://c.ndtvimg.com/2020-01/guk7mua_kunal-kamra_625x300_29_January_20.jpg", "publishedAt": "2022-05-18T02:30:37Z", "content": "Kunal Kamra had posted a \"doctored\" video of a boy singing a patriotic song for PM Modi\r\nNew Delhi: The country's top child rights body NCPCR has summoned Twitter India's communications director toda… [+1561 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "French Government seeks To Block 'Burkinis' In Swimming Pools", "description": "France's interior minister said Tuesday that he would seek to overturn a rule change in the city of Grenoble that would allow women to wear burkinis in state-run swimming pools.", "url": "https://www.ndtv.com/world-news/unacceptable-french-government-seeks-to-block-burkinis-in-swimming-pools-2985568", "urlToImage": "https://i.ndtvimg.com/i/2016-08/burkini_650x400_41472207440.jpg", "publishedAt": "2022-05-18T02:04:36Z", "content": "French city Grenoble changed its swimming pool rules on Monday, allowing Burkinis for Muslim women.\r\nParis: France's interior minister said Tuesday that he would seek to overturn a rule change in the… [+2388 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Child's Tooth, 1,30,000 Years Old, Offers Clues To Ancient Human Relative", "description": "A child's tooth at least 130,000 years old found in a Laos cave could help scientists uncover more information about an early human cousin, a study said on Tuesday.", "url": "https://www.ndtv.com/world-news/childs-tooth-1-30-000-years-old-offers-clues-to-ancient-human-relative-2985558", "urlToImage": "https://c.ndtvimg.com/2022-05/991lhn18_childs-tooth-reuters_625x300_18_May_22.jpg", "publishedAt": "2022-05-18T01:42:44Z", "content": "Very little is known about the Denisovans, a cousin of Neanderthals.\r\nParis: A child's tooth at least 130,000 years old found in a Laos cave could help scientists uncover more information about an ea… [+3707 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "In Rare Hearing, Pentagon Reports Rise In UFO Sightings In Past 20 Years", "description": "An increasing number of unidentified flying objects have been reported in the sky over the past 20 years, a top US defense official told lawmakers Tuesday in the first public hearing on UFOs in half a century.", "url": "https://www.ndtv.com/world-news/in-rare-hearing-pentagon-reports-rise-in-ufo-sightings-in-past-20-years-2985557", "urlToImage": "https://c.ndtvimg.com/2021-05/c3it975_jeremy-corbell-ufo-video_625x300_20_May_21.jpg", "publishedAt": "2022-05-18T01:42:08Z", "content": "Last year, Filmmaker Jeremy Corbell released footage of UFO disappearing into the water off California.\r\nAn increasing number of unidentified flying objects have been reported in the sky over the pas… [+1822 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "The 'Bots' At Heart Of Elon Musk's Twitter Buyout Row", "description": "Elon Musk's pausing of his bid to buy Twitter due to questions over \"bots\" has put the artificially-operated accounts at the heart of the proposed deal's latest controversy.", "url": "https://www.ndtv.com/world-news/the-bots-at-heart-of-elon-musks-twitter-buyout-row-2985556", "urlToImage": "https://c.ndtvimg.com/2022-05/jul1dlq8_elon-musk-afp_625x300_18_May_22.jpg", "publishedAt": "2022-05-18T01:41:36Z", "content": "Elon Musk has put on hold his Twitter deal plan over the issue of spam\r\nSan Francisco: Elon Musk's pausing of his bid to buy Twitter due to questions over \"bots\" has put the artificially-operated acc… [+3299 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Centre Forcing States To Buy Imported Coal: Ashok Gehlot", "description": "Rajasthan Chief Minister Ashok Gehlot on Tuesday alleged that the Centre is pressuring states to purchase imported coal, which costs three times more the one produced in the country.", "url": "https://www.ndtv.com/india-news/centre-forcing-states-to-buy-imported-coal-rajasthan-chief-minister-ashok-gehlot-2985555", "urlToImage": "https://c.ndtvimg.com/2022-01/gr534gig_ashok-gehlottwitter_625x300_30_January_22.jpg", "publishedAt": "2022-05-18T01:38:24Z", "content": "Ashok Gehlot said the price of imported coal is 3 times higher than that of provided by Coal India.\r\nJaipur: Rajasthan Chief Minister Ashok Gehlot on Tuesday alleged that the Centre is pressuring sta… [+1413 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Business Groups Criticise Biden's Taiwan Arms Sales Policy", "description": "U.S. business groups on Tuesday criticized the Biden administration's Taiwan arms sales policy, arguing in a public letter that it was too restrictive and failed to address challenges posed by China's military to the democratic island.", "url": "https://www.ndtv.com/world-news/us-business-groups-criticise-bidens-taiwan-arms-sales-policy-2985529", "urlToImage": "https://c.ndtvimg.com/2022-03/r0pib8h8_joe-biden-afp-650_625x300_17_March_22.jpg", "publishedAt": "2022-05-18T01:14:30Z", "content": "The United States has only unofficial relations with Taiwan.\r\nWashington: U.S. business groups on Tuesday criticized the Biden administration's Taiwan arms sales policy, arguing in a public letter th… [+2527 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE: India Records Less Than 2,000 New Covid Cases In 24 Hours", "description": "At least 1,569 new Covid cases reported on Tuesday, taking the total number of cases to 4,31,25,370. According to the Union Health Ministry, the active cases dipped to 16,400 in the last 24 hours.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-may-18-2985518", "urlToImage": "https://c.ndtvimg.com/2021-09/ksqcgig_coronavirus-india-afp-september-2021_650x400_22_September_21.jpg", "publishedAt": "2022-05-18T00:31:38Z", "content": "India COVID-19 Live: The country also reported 19 covid deaths on Tuesday.\r\nNew Delhi: At least 1,569 new Covid cases reported on Tuesday, taking the total number of cases to 4,31,25,370. According t… [+555 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rajya Sabha Polls: Sena's Snub To Kolhapur Royal, Party To Contest 6th Seat", "description": "Senior Shiv Sena leader and Maharashtra minister Anil Parab on Tuesday said his party will field a second candidate in the coming Rajya Sabha polls, a move that could hamper the prospects of Sambhaji Raje Chhatrapati.", "url": "https://www.ndtv.com/india-news/rajya-sabha-polls-senas-snub-to-kolhapur-royal-party-to-contest-6th-seat-2985511", "urlToImage": "https://i.ndtvimg.com/i/2016-06/sambhaji-raje-chhatrapati_650x400_71465662164.jpg", "publishedAt": "2022-05-18T00:12:47Z", "content": "Sambhaji Raje is a member of the Kolhapur royal family and descendant of Chhatrapati Shivaji Maharaj.\r\nMumbai: Senior Shiv Sena leader and Maharashtra minister Anil Parab on Tuesday said his party wi… [+1808 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Punjab Chief Minister Calls Farmers Protest \"Unwarranted\"", "description": "Punjab Chief Minister Bhagwant Mann on Tuesday called the agitation by state farmers as unwarranted and undesirable but said he is ready for talks.", "url": "https://www.ndtv.com/india-news/punjab-chief-minister-bhagwant-mann-calls-farmers-protest-unwarranted-2985500", "urlToImage": "https://c.ndtvimg.com/2022-04/57fcqk3_bhagwant-mann_625x300_16_April_22.jpg", "publishedAt": "2022-05-17T23:44:42Z", "content": "Punjab CM Bhawant Mann said the government held talks with farmers on Tuesday. (File)\r\nChandigarh: Punjab Chief Minister Bhagwant Mann on Tuesday called the agitation by state farmers as unwarranted … [+1855 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Court To Hear Activist Sharjeel Imam's Bail Plea On May 26", "description": "The Delhi High Court said it will hear on May 26 a plea by JNU student Sharjeel Imam, who has been arrested in a case related to alleged inflammatory speeches made by him during the protests against the CAA and NRC, seeking interim bail.", "url": "https://www.ndtv.com/india-news/court-to-hear-activist-sharjeel-imams-bail-plea-on-may-26-2985493", "urlToImage": "https://c.ndtvimg.com/2020-01/hpteji0g_sharjeel-imam_625x300_28_January_20.jpg", "publishedAt": "2022-05-17T23:31:05Z", "content": "JNU student Sharjeel Imam has filed an application seeking interim bail in his already pending bail plea.\r\nNew Delhi: The Delhi High Court on Tuesday said it will hear on May 26 a plea by JNU student… [+5374 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Pollution Killed 9 Million People Globally In 2019: Report", "description": "Pollution caused some 9 million people to die prematurely in 2019, according to a new global report published Wednesday, with experts raising alarm over increasing deaths from breathing outside air and the \"horrifying\" toll of lead poisoning.", "url": "https://www.ndtv.com/world-news/pollution-killed-9-million-people-globally-in-2019-report-2985488", "urlToImage": "https://c.ndtvimg.com/2018-11/53o5jkj8_air-pollution-generic-pixabay-650_625x300_28_November_18.jpg", "publishedAt": "2022-05-17T23:18:08Z", "content": "Global Pollution Death Report: Low- and middle-income countries are by far the most affected region.\r\nParis: Pollution caused some 9 million people to die prematurely in 2019, according to a new glob… [+4817 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Immature\": Kim Jong Un Slams Officials As Outbreak Surges In North Korea", "description": "North Korean leader Kim Jong Un slammed his country's response to its first officially confirmed COVID-19 outbreak as \"immature,\" accusing government officials of inadequacies and inertia as fever cases swept the country, state media reported on Wedn", "url": "https://www.ndtv.com/world-news/immature-kim-jong-un-slams-officials-as-covid-19-outbreak-surges-in-north-korea-2985479", "urlToImage": "https://c.ndtvimg.com/2022-05/qk4qiqe_north-korea-covid_625x300_13_May_22.jpg", "publishedAt": "2022-05-17T22:53:41Z", "content": "North Korea Covid: Kim Jong Un said \"immaturity\" has increased the complexity in order to curb COVID-19.\r\nSeoul: North Korean leader Kim Jong Un slammed his country's response to its first officially… [+1373 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Pentagon Finds No Wrongdoing In 2019 Syria Strike That Killed Civilians", "description": "An investigation into a 2019 strike by US forces in Syria that killed numerous civilians found no violations of policy or wanton negligence, the Pentagon said Tuesday.", "url": "https://www.ndtv.com/world-news/pentagon-finds-no-wrongdoing-in-2019-syria-strike-that-killed-civilians-2985476", "urlToImage": "https://c.ndtvimg.com/2019-02/tuk8h3ig_usarmysyriareuters650_625x300_22_February_19.jpg", "publishedAt": "2022-05-17T22:32:43Z", "content": "The Times report said that 70 people had been killed in the US strike in Syria in March 2019.\r\nWashington: An investigation into a 2019 strike by US forces in Syria that killed numerous civilians fou… [+2359 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Tata Motors In Court Against Disqualification From Mumbai E-Buses Tender", "description": "Tata Motors on Tuesday moved the Bombay High Court challenging its disqualification from the tender process for 1,400 electric buses for the Brihanmumbai Electric Supply and Transport (BEST) Undertaking.", "url": "https://www.ndtv.com/india-news/tata-motors-in-court-against-disqualification-from-mumbai-e-buses-tender-2985465", "urlToImage": "https://c.ndtvimg.com/2021-04/b2jsh8t_tata-motors-650_650x400_20_April_21.jpg", "publishedAt": "2022-05-17T22:06:52Z", "content": "The high court will hear the Tata Motors' case further on May 23.\r\nMumbai: Tata Motors on Tuesday moved the Bombay High Court challenging its disqualification from the tender process for 1,400 electr… [+1306 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UP Loot Accused Surrenders With \"Don't-Shoot-Me\" Placard: Cops", "description": "With a \"don't shoot me\" placard hung around his neck, an alleged robber surrendered to police here on Tuesday in the district, an official said.", "url": "https://www.ndtv.com/india-news/up-loot-accused-surrenders-with-dont-shoot-me-placard-cops-2985463", "urlToImage": "https://c.ndtvimg.com/gvui22eg_paschim-bengal_625x300_28_July_18.jpg", "publishedAt": "2022-05-17T21:58:01Z", "content": "A sum of Rs 25,000 of the looted amount too was recovered from Fukran, police said. (Representational)\r\nBudaun, UP: With a \"don't shoot me\" placard hung around his neck, an alleged robber surrendered… [+858 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sweden, Finland To Submit NATO Membership Bid Today", "description": "Finland and Sweden announced they will submit their bids to join NATO together Wednesday, despite Turkey's threat to block the military alliance's expansion.", "url": "https://www.ndtv.com/world-news/sweden-finland-to-submit-nato-membership-bid-today-2985457", "urlToImage": "https://c.ndtvimg.com/2022-01/ohk1stfg_nato-reuters_625x300_24_January_22.jpg", "publishedAt": "2022-05-17T21:42:18Z", "content": "Any membership bid must be unanimously approved by NATO's 30 members.\r\nStockholm: Finland and Sweden announced they will submit their bids to join NATO together Wednesday, despite Turkey's threat to … [+4488 chars]"}]}