{"status": "ok", "totalResults": 294, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": "Neelav Chakravarti", "title": "IPL 2022 Points Table Update, Latest Orange Cap, Purple Cap Lists", "description": "Delhi Capitals (DC) defeated Rajasthan Royals (RR) by eight wickets in Match 58 of the ongoing Indian Premier League (IPL) 2022 at the Dr DY Patil Sports Academy in Navi Mumbai.", "url": "https://sports.ndtv.com/ipl-2022/ipl-2022-points-table-update-latest-orange-cap-purple-cap-lists-after-rr-vs-dc-match-58-2968023", "urlToImage": "https://c.ndtvimg.com/2022-05/oo604fg_david-warner-mitchell-marsh-bcci_625x300_12_May_22.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-12T02:38:59Z", "content": "Delhi Capitals (DC) defeated Rajasthan Royals (RR) by eight wickets in Match 58 of the ongoing Indian Premier League (IPL) 2022 at the Dr DY Patil Sports Academy in Navi Mumbai. Chasing a target of 1… [+1538 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Man City Go 3 Points Clear After 4-Goal Kevin De Bruyne Masterclass", "description": "Kevin De Bruyne produced a four-goal masterclass as Manchester City thrashed Wolves 5-1 to move three points clear at the top of the Premier League", "url": "https://sports.ndtv.com/english-premier-league/manchester-city-go-three-points-clear-after-four-goal-kevin-de-bruyne-masterclass-2968015", "urlToImage": "https://c.ndtvimg.com/2022-05/slcr0qi8_kevin-de-bruyne-afp_625x300_12_May_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-12T02:27:12Z", "content": "Kevin De Bruyne produced a four-goal masterclass as Manchester City thrashed Wolves 5-1 to move three points clear at the top of the Premier League, while Chelsea consolidated their top-four place an… [+4185 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "On Camera, Railway Cop Drags Out Woman From Gap In Train Platform", "description": "A head constable of the Railway Protection Force (RPF) saved a woman's life when she nearly got trapped in the gap between the platform and a moving train at Bhubneswar railway station in Odisha yesterday.", "url": "https://www.ndtv.com/bhubaneshwar-news/on-camera-railway-cop-drags-out-woman-from-gap-in-train-platform-2968006", "urlToImage": "https://c.ndtvimg.com/2022-05/6e4tmqso_bhubaneswar-train-incident_625x300_12_May_22.jpg", "publishedAt": "2022-05-12T02:08:08Z", "content": "Bhubaneswar: A head constable of the Railway Protection Force (RPF) saved a woman's life when she nearly got trapped in the gap between the platform and a moving train at Bhubaneswar railway station … [+907 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Rashi Hardaha", "title": "GUJCET 2022 Live Updates: Result At 10 AM; Official Website To Check", "description": "GUJCET 2022 Result Live: GUJCET 2022 result will be declared today, May 12 at 10 am. Once released, candidates can check and download Gujarat CET results using roll number or seat number as mentioned on the admit card.", "url": "https://www.ndtv.com/education/gujcet-result-2022-live-updates-gujarat-cet-results-declared-gseb-org-direct-link-toppers-merit-list-latest-news", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/5/12/shutterstock_1535292356_1.jpg", "publishedAt": "2022-05-12T01:52:58Z", "content": "GUJCET 2022 Result Live Updates: The Gujarat Common Entrance Test (GUJCET) 2022 result will be declared today, May 12 at 10 am. The Gujarat School Education Board (GSEB) will announce the GUJCET resu… [+1032 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Mridusmita Deka", "title": "GSEB Result Live 2022: Gujarat Class 12 HSC Science Result At 10 AM", "description": "Gujarat HSC Science Result Live: The GSEB HSC result 2022 will be released online at gseb.org. Students will be able to check their results at the official website using credentials including their registration numbers, index numbers and dates of birth.", "url": "https://www.ndtv.com/education/gseb-class-12-result-2022-science-stream-live-updates-gujarat-board-hsc-results-declared-gseb-org-mark-sheet-toppers", "urlToImage": "https://cache.careers360.mobi/media/presets/1280X853/article_images/2022/5/11/exam-analysis-featured-image.jpg", "publishedAt": "2022-05-12T01:39:17Z", "content": "12th Science Result 2022 Gujarat Board: The Gujarat Secondary and Higher Secondary Education Board (GSHSEB), or GSEB, will declare the Class 12 Science results for the 2022 board exams today, May 12.… [+1298 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE: India Logs 2,897 New Covid Cases, 54 Deaths In 24 Hours", "description": "India recorded at least 2,897 new coronavirus infections on Wednesday, taking the total tally of COVID-19 cases to 4,31,10,586, while the active cases dipped to 19,494, according to the Union Health Ministry data updated.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-india-covid-cases-may-12-2967988", "urlToImage": "https://c.ndtvimg.com/2022-04/ise074vo_coronavirus-india-pti-650_650x400_18_April_22.jpg", "publishedAt": "2022-05-12T01:26:14Z", "content": "India Covid Live: India also reported 54 new Covid deaths in the last 24 hours.\r\nNew Delhi: India recorded at least 2,897 new coronavirus infections on Wednesday, taking the total tally of COVID-19 c… [+583 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Arnab Mitra", "title": "Gujarat Common Entrance Test, GUJCET 2022 Result To Be Announced Today", "description": "GUJCET Result 2022: The GUJCET 2022 result will be available on the official websites- gseb.org and gsebeservice.com from 10 am. The candidates can download GUJCET 2022 result using roll number or seat number as mentioned on the admit card.", "url": "https://www.ndtv.com/education/gujarat-common-entrance-test-gujcet-2022-result-to-be-announced-today-gseb-org-gsebeservice-com", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/5/11/shutterstock_1789800119_2.jpg", "publishedAt": "2022-05-12T01:22:29Z", "content": "GUJCET Result 2022: The Gujarat School Education Board (GSEB) will announce the GUJCET 2022 result on Thursday, May 12. The GUJCET 2022 result will be available on the official websites- gseb.org and… [+1493 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "North Korea Confirms 1st Covid Case, Declares \"Severe National Emergency\"", "description": "North Korea on Thursday confirmed its first-ever case of Covid-19, with state media declaring it a \"severe national emergency incident\" after more than two years of purportedly keeping the pandemic at bay.", "url": "https://www.ndtv.com/world-news/north-korea-confirms-1st-covid-case-declares-severe-national-emergency-2967985", "urlToImage": "https://c.ndtvimg.com/2021-06/umgqhn9_kim-jong-un-650_625x300_30_June_21.jpeg", "publishedAt": "2022-05-12T01:17:18Z", "content": "North Korea Covid: Kim Jong Un called for tighter border controls and Covid lockdown measures.\r\nSeoul: North Korea has confirmed its first-ever case of Covid-19 and declared a \"severe national emerge… [+4005 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Saudi Aramco Dethrones Apple As World's Most Valuable Company: Report", "description": "Saudi Aramco on Wednesday dethroned Apple as the world's most valuable company as surging oil prices drove up shares and tech stocks slumped.", "url": "https://www.ndtv.com/world-news/saudi-aramco-dethrones-apple-as-worlds-most-valuable-company-report-2967979", "urlToImage": "https://c.ndtvimg.com/2021-03/mgkke68k_saudi-aramco-reuters_625x300_22_March_21.jpg", "publishedAt": "2022-05-12T01:15:13Z", "content": "Apple has seen its share price drop over the past month\r\nSan Francisco: Saudi Aramco on Wednesday dethroned Apple as the world's most valuable company as surging oil prices drove up shares and tech s… [+2462 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Elon Musk's Delay In Disclosing Twitter Stake Triggers Probe: Report", "description": "U.S. regulators are investigating Elon Musk's delayed disclosure of his sizable stake in Twitter Inc last month, the Wall Street Journal reported on Wednesday, citing people familiar with the matter.", "url": "https://www.ndtv.com/world-news/elon-musks-delay-in-disclosing-twitter-stake-triggers-probe-report-2967978", "urlToImage": "https://c.ndtvimg.com/2022-05/gfotlhvo_elon-musk_625x300_12_May_22.jpg", "publishedAt": "2022-05-12T01:14:43Z", "content": "Elon Musk allegedly violated law that needs people to report certain large transactions\r\nU.S. regulators are investigating Elon Musk's delayed disclosure of his sizable stake in Twitter Inc last mont… [+1527 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Arnab Mitra", "title": "Gujarat Board GSHSEB HSC, 12th Science Result 2022 Today", "description": "Gujarat Board Class 12 Science Result: The 12th HSC Science exam result will be announced at 10 am today, Education Minister Jitu Vaghani tweeted.", "url": "https://www.ndtv.com/education/gujarat-board-gshseb-hsc-class-12th-science-result-2022-today-gseb-org", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/5/11/result-featured-image.jpg", "publishedAt": "2022-05-12T01:13:25Z", "content": "GSHSEB HSC 12th Science Result 2022: The Gujarat Board Higher Secondary School Certificate (HSC) Class 12 Science exam result 2022 will be announced on Thursday, May 12. The 12th HSC Science exam res… [+1474 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine To Hold First War Crimes Trial Over Russian Invasion", "description": "Ukraine will launch its first war crimes trial over Moscow's ongoing invasion, bringing a 21-year-old Russian service member to the stand, Kyiv's prosecutor general announced Wednesday.", "url": "https://www.ndtv.com/world-news/ukraine-to-hold-first-war-crimes-trial-over-russian-invasion-2967971", "urlToImage": "https://c.ndtvimg.com/2022-03/omm12v2g_ukraine-war-afp-650_625x300_08_March_22.jpg", "publishedAt": "2022-05-12T01:05:14Z", "content": "Ukraine War: Britain has sent war crimes investigators to Ukraine to probe possible mass atrocities.\r\nKyiv: Ukraine will launch its first war crimes trial over Moscow's ongoing invasion, bringing a 2… [+1911 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Man Accused Of Brandishing Sword During Madhya Pradesh Violence Arrested", "description": "Police on Wednesday arrested a man who allegedly brandished a sword during violence on Ram Navami in Madhya Pradesh's Khargone town last month and was later chased by Superintendent of Police Siddharth Choudhary, a senior official said.", "url": "https://www.ndtv.com/india-news/man-arrested-for-brandishing-sword-during-madhya-pradesh-ram-navmi-violence-in-khargone-2967968", "urlToImage": "https://c.ndtvimg.com/2022-04/9utiiavo_khargone-violence-_625x300_10_April_22.jpg", "publishedAt": "2022-05-12T00:50:37Z", "content": "Khargone violence: So far, 188 people have been arrested in connection with the violent incidents.\r\nKhargone, Madhya Pradesh: Police on Wednesday arrested a man who allegedly brandished a sword durin… [+1050 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Allies To Approve Finland, Sweden NATO Bid, Offer Security: Report", "description": "NATO allies expect Finland and Sweden to apply to join the alliance in the coming days and will grant membership quickly, five diplomats and officials said, as Russia's invasion of Ukraine forces a radical rethink of European security.", "url": "https://www.ndtv.com/world-news/allies-to-approve-finland-sweden-nato-bid-offer-security-report-2967960", "urlToImage": "https://c.ndtvimg.com/2019-11/t015ele8_nato-flags_625x300_27_November_19.jpg", "publishedAt": "2022-05-12T00:17:49Z", "content": "In the wider Nordic region, Norway, Denmark and the three Baltic states are already NATO members.\r\nBrussels: NATO allies expect Finland and Sweden to apply to join the alliance in the coming days and… [+4052 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ex-CEO Jack Dorsey Says Not Interested To Head Twitter Again", "description": "Twitter Inc co-founder Jack Dorsey said on Wednesday that he was not keen to retake the helm of the social media company, hinting at his limited involvement if Elon Musk manages to successfully close the takeover deal.", "url": "https://www.ndtv.com/world-news/ex-ceo-jack-dorsey-says-not-interested-to-head-twitter-again-2967953", "urlToImage": "https://c.ndtvimg.com/2021-02/439jqic_jack-dorsey-650_625x300_13_February_21.jpg", "publishedAt": "2022-05-11T23:51:58Z", "content": "Twitter co-founder Jack Dorsey stepped down as the chief executive officer last year in November.\r\nSan Francisco: Twitter Inc co-founder Jack Dorsey said on Wednesday that he was not keen to retake t… [+1084 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Pro-Russia Hackers Target Italian Official Websites: Report", "description": "Pro-Russia hackers targeted the websites of several Italian institutions including the defence ministry and the senate, media reports said on Wednesday.", "url": "https://www.ndtv.com/world-news/pro-russia-hackers-target-italian-official-websites-report-2967948", "urlToImage": "https://c.ndtvimg.com/2022-04/hc7as9jg_cyber-attack_625x300_07_April_22.jpg", "publishedAt": "2022-05-11T23:35:11Z", "content": "The report said that hackers also tried to hack the Eurovision song contest's website. (Representational)\r\nRome: Pro-Russia hackers targeted the websites of several Italian institutions including the… [+1114 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Finland Says Joining NATO \"Would Not Be Against Anyone\"", "description": "Finnish President Sauli Niinisto said on Wednesday that it \"would not be against anyone\", if the Nordic country joined NATO, despite Russia warning against the membership.", "url": "https://www.ndtv.com/world-news/joining-nato-would-not-be-against-anyone-finland-2967941", "urlToImage": "https://c.ndtvimg.com/2021-03/veg1uns4_finland-flag_625x300_19_March_21.jpg", "publishedAt": "2022-05-11T23:16:25Z", "content": "Finland will announce on Thursday its highly-awaited positions on whether to join NATO.\r\nHelsinki: Finnish President Sauli Niinisto said on Wednesday that it \"would not be against anyone\", if the Nor… [+1715 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "More Than 560 Ukraine National Guard Soldiers Killed Since War Began", "description": "Over 560 soldiers from Ukraine's National Guard, a force which includes the Azov regiment currently holed up in Mariupol's steelworks, have been killed since the war with Russia began, its leader said Wednesday.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-more-than-560-ukraine-national-guard-soldiers-killed-since-war-began-2967934", "urlToImage": "https://c.ndtvimg.com/2022-04/9kdfund_ukrainian-service-members-kyiv-reuters_625x300_04_April_22.jpg", "publishedAt": "2022-05-11T22:56:04Z", "content": "Ukraine war: Earlier, Zelensky said between 2,500 and 3,000 Ukrainian soldiers killed since war began.\r\nKyiv: Over 560 soldiers from Ukraine's National Guard, a force which includes the Azov regiment… [+2026 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Arab Countries Seek UN Probe Into Al Jazeera Journalist's Killing", "description": "Arab countries at the UN called Wednesday for an independent, international probe into what they called the assassination of Al Jazeera journalist Shireen Abu Akleh, who was shot dead as she covered an Israeli army raid in the occupied West Bank.", "url": "https://www.ndtv.com/world-news/outrage-over-killing-of-al-jazeera-journalist-shireen-abu-akleh-arab-countries-seek-un-probe-2967927", "urlToImage": "https://c.ndtvimg.com/2022-05/ishs654_al-jazeera-journalist-shireen-abu-aqleh650_625x300_11_May_22.jpg", "publishedAt": "2022-05-11T22:26:45Z", "content": "Al Jazeera journalist Shireen Abu Aqle was killed in West Bank on Wednesday.\r\nUnited Nations: Arab countries at the United Nations called Wednesday for an independent, international probe into what t… [+1234 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "At UN, China, Russia Oppose Action Against North Korea Over Missile", "description": "The United States called out China and Russia on Wednesday for opposing further United Nations action on North Korea, warning that the Security Council \"cannot stay silent any longer\" as Pyongyang prepares for a seventh nuclear test.", "url": "https://www.ndtv.com/world-news/at-un-china-russia-oppose-action-against-north-korea-over-missile-2967920", "urlToImage": "https://c.ndtvimg.com/2022-02/4hoit0nk_united-nations-reuters_625x300_22_February_22.jpg", "publishedAt": "2022-05-11T21:56:32Z", "content": "North Korea has been subject to UN sanctions since 2006 over its nuclear and ballistic missile programs.\r\nUnited Nations: The United States called out China and Russia on Wednesday for opposing furth… [+2242 chars]"}]}