{"status": "ok", "totalResults": 332, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Two US Citizens In Ukraine Feared Captured By Russia: Families", "description": "Two U.S. citizens who traveled to Ukraine as volunteer fighters against Russian forces have been missing for a week and are feared captured, family members said on Wednesday.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-two-us-citizens-missing-in-ukraine-feared-captured-by-russia-families-3071248", "urlToImage": "https://c.ndtvimg.com/2022-03/jfhfb1bg_russia-ukraine-war-kharkiv-reuters-650_625x300_01_March_22.jpg", "publishedAt": "2022-06-15T23:17:48Z", "content": "Ukraine War: The two US citizens, who went missing, were traveled to Ukraine to fight against Russia.\r\nWashington: Two U.S. citizens who traveled to Ukraine as volunteer fighters against Russian forc… [+2836 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rain Lashes Parts Of Delhi-NCR; Brings Respite From Heat", "description": "Parts of Delhi and the National Capital Region (NCR) received rains in the early hours of Thursday.", "url": "https://www.ndtv.com/india-news/delhi-rains-rain-lashes-parts-of-delhi-ncr-brings-respite-from-heat-3071241", "urlToImage": "https://c.ndtvimg.com/2021-12/tbcqevag_delhi-rains-ndtv-650_625x300_02_December_21.jpg", "publishedAt": "2022-06-15T22:58:23Z", "content": "Delhi Rains: The weather office predicts the moderate rain for 6 days in Delhi. (Representational)\r\nNew Delhi: Parts of Delhi and the National Capital Region (NCR) received rains in the early hours o… [+969 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Grateful\": Zelensky Thanks Biden For New US Arms Package To Ukraine", "description": "Ukrainian President Volodymyr Zelensky said Wednesday he was \"grateful\" for a new American arms package to Kyiv after speaking to US President Joe Biden.", "url": "https://www.ndtv.com/world-news/volodymyr-zelensky-thanks-biden-for-new-us-arms-package-to-ukraine-3071234", "urlToImage": "https://c.ndtvimg.com/2022-06/ah6js3os_zelensky-reuters_625x300_01_June_22.jpg", "publishedAt": "2022-06-15T22:32:27Z", "content": "Ukraine War: Zelensky said the US' move will help especially (the eastern region of) in Donbas.\r\nKyiv: Ukrainian President Volodymyr Zelensky said Wednesday he was \"grateful\" for a new American arms … [+1538 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Weather Office Predicts Rain, Thunderstorm In Delhi, Haryana Today", "description": "Delhi and Haryana are likely to receive thunderstorms with light to moderate rains on Thursday, as per India Meteorological Department.", "url": "https://www.ndtv.com/india-news/weather-office-predicts-rain-thunderstorm-in-delhi-haryana-today-3071227", "urlToImage": "https://c.ndtvimg.com/2021-08/f9oo0u9g_delhi-rain-ndtv_625x300_01_August_21.jpg", "publishedAt": "2022-06-15T22:07:01Z", "content": "Delhi Rains: Winds are expected at a speed of 30-40 KM per hour, weather office said. (Representational)\r\nNew Delhi: Delhi and Haryana are likely to receive thunderstorms with light to moderate rains… [+706 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Tamil Nadu: Power Struggle Again In AIADMK, Back-To-Back Meetings On", "description": "Separate closed door meetings and back-to-back parleys on Wednesday over who should lead the party indicated a gathering storm of power struggle in the AIADMK between top leaders, O Panneerselvam and Edappadi K Palaniswami.", "url": "https://www.ndtv.com/india-news/tamil-nadu-power-struggle-again-in-aiadmk-back-to-back-meetings-on-3071216", "urlToImage": "https://c.ndtvimg.com/2022-06/hikacrus_aiadmk-leaders-650_625x300_14_June_22.jpg", "publishedAt": "2022-06-15T21:28:11Z", "content": "Supporters of OPS staged a protest here opposing 'removal' of posters in support of their leader.\r\nChennai: Separate closed door meetings and back-to-back parleys on Wednesday over who should lead th… [+3690 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Fresh Landslides In Assam, Heavy Rains In Guwahati", "description": "Fresh landslides were reported from various parts of Guwahati for the second consecutive day on Wednesday amid incessant rainfall, which also led to heavy waterlogging in most parts of the city, officials said.", "url": "https://www.ndtv.com/india-news/fresh-landslides-in-assam-heavy-rains-in-guwahati-3071211", "urlToImage": "https://c.ndtvimg.com/2022-06/hblp4hu_assam-landslide_625x300_14_June_22.jpg", "publishedAt": "2022-06-15T21:15:22Z", "content": "Assam Rains: The state has registered 42 deaths due to floods and landslides this year. (File)\r\nGuwahati:  Fresh landslides were reported from various parts of Guwahati for the second consecutive day… [+2999 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Stop Excluding Women From Peace Talks In Global Conflicts: UN Chief", "description": "Men must stop excluding women from peace talks around the world, UN chief Antonio Guterres said Wednesday, warning that in conflicts such as Russia's invasion of Ukraine the situation is actually \"going backwards.\"", "url": "https://www.ndtv.com/world-news/stop-excluding-women-from-peace-talks-in-global-conflicts-un-chief-3071208", "urlToImage": "https://c.ndtvimg.com/2022-05/bbkdiah4_antonio-guterres_625x300_18_May_22.jpg", "publishedAt": "2022-06-15T20:59:40Z", "content": "The rights and freedoms of wome deliberately targeted, said UN chief Antonio Guterres\r\nUnited Nations: Men must stop excluding women from peace talks around the world, UN chief Antonio Guterres said … [+1846 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ranchi Violence: Explanation Sought From Top Cop Over Posters Of Accused", "description": "A day after Jharkhand police put up posters carrying photographs of those allegedly involved in the recent violent protests in Ranchi, the state's Home Secretary Rajiv Arun Ekka sought an explanation from the SSP over the  \"unlawful\" act.", "url": "https://www.ndtv.com/india-news/jharkhand-10-june-violence-explanation-sought-from-ranchi-top-cop-over-posters-of-violence-accused-3071203", "urlToImage": "https://c.ndtvimg.com/2022-06/ephogogg_ranchi-violence_625x300_11_June_22.jpg", "publishedAt": "2022-06-15T20:49:37Z", "content": "Ranchi Violence: Police said that 29 people have been arrested so far in connection with the incident.\r\nRanchi, Jharkhand: A day after Jharkhand police put up posters carrying photographs of those al… [+2064 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"On Wrong Side Of History\": US Slams China For Backing Russia On Ukraine", "description": "The United States expressed concern Wednesday about China's alignment with Russia, warning that nations which side with President Vladimir Putin on Ukraine will be \"on the wrong side of history.\"", "url": "https://www.ndtv.com/world-news/us-warns-china-against-being-on-wrong-side-of-history-on-ukraine-3071176", "urlToImage": "https://c.ndtvimg.com/2022-02/ep90im0k_putin-xi-jinping_625x300_04_February_22.jpg", "publishedAt": "2022-06-15T20:29:41Z", "content": "Ukraine War: China has refused to condemn Russia's invasion of Ukraine.\r\nWashington: The United States expressed concern Wednesday about China's alignment with Russia, warning that nations which side… [+1590 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Expresses \"Serious Concern\" Over Israeli Strikes In Syria", "description": "Russia expressed \"serious concern\" on Wednesday to Israel's ambassador about air strikes that shut down Syria's Damascus International Airport last week, the foreign ministry said in a statement.", "url": "https://www.ndtv.com/world-news/russia-expresses-serious-concern-over-israeli-strikes-in-syria-3071164", "urlToImage": "https://i.ndtvimg.com/i/2018-04/syria-air-strikes-afp_650x400_51523674090.jpg", "publishedAt": "2022-06-15T20:03:00Z", "content": "For several years, Israel has been attacking what it has described as Iranian-linked targets in Syria.\r\nMoscow: Russia expressed \"serious concern\" on Wednesday to Israel's ambassador about air strike… [+1617 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Biden's Top Medical Advisor Dr Anthony Fauci Tests Positive For COVID-19", "description": "Top scientist Anthony Fauci, the face of America's response to the Covid-19 pandemic, tested positive Wednesday for the virus on a rapid antigen test, the National Institutes of Health said.", "url": "https://www.ndtv.com/world-news/us-top-coronavirus-advisor-dr-anthony-fauci-tests-positive-for-covid-19-3071127", "urlToImage": "https://c.ndtvimg.com/2021-06/puntic2_anthony-fauci-reuters_625x300_22_June_21.jpg", "publishedAt": "2022-06-15T19:19:38Z", "content": "Anthony Fauci, Joe Biden's top medical advisor, said that he is currently experiencing mild symptoms.\r\nWashington: Top scientist Anthony Fauci, the face of America's response to the Covid-19 pandemic… [+452 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rajnath Singh To Pay Two-Day Visit To Jammu And Kashmir From Today", "description": "Union Defence Minister Rajnath Singh is scheduled to visit the forward areas of Jammu and Kashmir on Thursday.", "url": "https://www.ndtv.com/india-news/defence-minister-rajnath-singh-to-pay-two-day-visit-to-jammu-and-kashmir-from-today-3071110", "urlToImage": "https://c.ndtvimg.com/2022-05/0r665ut8_rajnath-singh-pti_625x300_06_May_22.jpg", "publishedAt": "2022-06-15T19:05:59Z", "content": "Rajnath Singh will interact with the troops during his visit to Jammu and Kashmir. (file)\r\nNew Delhi: Union Defence Minister Rajnath Singh is scheduled to visit the forward areas of Jammu and Kashmir… [+3152 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Dani Alves Leaves Barcelona For Second Time", "description": "Dani Alves made 408 appearances in total for Barcelona, with 391 of those coming in his first spell from 2008-2016", "url": "https://sports.ndtv.com/football/dani-alves-leaves-barcelona-for-second-time-3071073", "urlToImage": "https://c.ndtvimg.com/2021-11/c38sik28_dani-alves-afp_625x300_17_November_21.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-15T18:29:26Z", "content": "Dani Alves announced on Wednesday that he is leaving Barcelona for a second time after returning to the club last year. The 39-year-old, who rejoined Barca last November on a short-term deal until th… [+815 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Saira Banu Sobs While Accepting Award On \"Kohinoor\" Dilip Kumar's Behalf", "description": "Former actor Saira Banu broke into tears after accepting the honourable Bharat Ratna Dr Ambedkar Award for her late husband and veteran actor Dilip Kumar, on Tuesday, saying that Dilip is 'always with her'.", "url": "https://www.ndtv.com/india-news/saira-banu-sobs-while-accepting-award-on-kohinoor-dilip-kumars-behalf-3071068", "urlToImage": "https://c.ndtvimg.com/2020-10/cli1lli8_dilip-kumar-saira-banu-_625x300_09_October_20.jpg", "publishedAt": "2022-06-15T18:29:08Z", "content": "Saira Banu called Dilip Kumar the 'Kohinoor' of India.\r\nMumbai: Former actor Saira Banu broke into tears after accepting the honourable Bharat Ratna Dr Ambedkar Award for her late husband and veteran… [+2283 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Navya Nanda Is \"Exploring The World\" With Her Father Nikhil. Neetu Reacts", "description": "Navya Naveli Nanda has shared a picture with father Nikhil Nanda", "url": "https://www.ndtv.com/entertainment/navya-naveli-is-exploring-the-world-with-her-father-nikhil-nanda-neetu-kapoor-reacts-3071056", "urlToImage": "https://c.ndtvimg.com/2022-06/rnh5572o_navya_625x300_15_June_22.jpg", "publishedAt": "2022-06-15T18:23:02Z", "content": "Navya Naveli Nanda posing with father Nikhil. (courtesy: navyananda)\r\nNew Delhi: Navya Naveli Nanda, who is currently holidaying in Japan, has shared a new picture on her Instagram handle, and this t… [+1644 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Man, 72, Arrested For Organising Jama Masjid Prophet Remark Protest: Cops", "description": "A 72-year-old man was held for allegedly disrupting communal harmony and organising a protest without permission at the Jama Masjid area here recently against the controversial remarks on Prophet Mohammad, police said on Wednesday.", "url": "https://www.ndtv.com/india-news/prophet-remark-protests-man-72-arrested-for-organising-jama-masjid-prophet-remark-protest-cops-3070698", "urlToImage": "https://c.ndtvimg.com/2022-06/4kg7iiv8_jama-masjid-prophet-protests-pti_625x300_11_June_22.jpg", "publishedAt": "2022-06-15T18:20:26Z", "content": "Prophet Remark Protests: Protests erupted outside the Jama Masjid in Delhi after Friday prayers.\r\nNew Delhi: A 72-year-old man was held for allegedly disrupting communal harmony and organising a prot… [+1741 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Federal Reserve Announces Biggest Interest Rate Hike Since 1994", "description": "The Federal Reserve announced the most aggressive interest rate increase in nearly 30 years, raising the benchmark borrowing rate by 0.75 percentage points on Wednesday as it battles against surging inflation.", "url": "https://www.ndtv.com/world-news/us-federal-reserve-announces-biggest-interest-rate-hike-since-1994-to-tame-surging-inflation-3071046", "urlToImage": "https://c.ndtvimg.com/2019-09/ud2ua6_us-federal-reserve-_625x300_11_September_19.jpg", "publishedAt": "2022-06-15T18:18:54Z", "content": "Washington: The Federal Reserve announced the most aggressive interest rate increase in nearly 30 years, raising the benchmark borrowing rate by 0.75 percentage points on Wednesday as it battles agai… [+3620 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "EU Watchdog Reviews Adapted Pfizer Jab. Target: Omicron", "description": "Europe's medicines watchdog said Wednesday it has started to review an adapted version of Pfizer/BioNTech's anti-Covid jab in order to better protect against specific variants of the virus, including Omicron.", "url": "https://www.ndtv.com/world-news/coronavirus-coronavirus-vaccine-eu-watchdog-reviews-adapted-pfizer-jab-target-omicron-3071039", "urlToImage": "https://c.ndtvimg.com/2021-04/3k47k8bg_pfizer-vaccine-reuters_625x300_09_April_21.jpg", "publishedAt": "2022-06-15T18:17:31Z", "content": "Coronavirus: Europe's medicines watchdog is reviewing an adapted version of Pfizer jab.\r\nThe Hague: Europe's medicines watchdog said Wednesday it has started to review an adapted version of Pfizer/Bi… [+1014 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Update On Elon Musk's Buyout? Twitter Says \"Committed To The Transaction\"", "description": "Twitter remains committed to closing Elon Musk's $44 billion buyout bid, the firm's board chairman said Wednesday, as doubts swirl about the billionaire's intentions for the troubled deal.", "url": "https://www.ndtv.com/world-news/elon-musk-elon-musk-twitter-deal-elon-musk-news-update-on-elon-musks-buyout-twitter-says-committed-to-the-transaction-3071025", "urlToImage": "https://c.ndtvimg.com/2022-05/tepddd6_elon-musk-twitter-reuters_625x300_17_May_22.jpg", "publishedAt": "2022-06-15T18:13:17Z", "content": "Elon Musk Twitter Deal: Elon Musk took over Twitter in $44 billion cash deal which has been put on hold.\r\nParis: Twitter remains committed to closing Elon Musk's $44 billion buyout bid, the firm's bo… [+1010 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Time For 1st European To Travel Moon? A New Deal Could Make This Happen", "description": "The European Space Agency and NASA on Wednesday talked up the prospect of putting the first European on the Moon, as they signed a deal strengthening collaboration for future lunar exploration.", "url": "https://www.ndtv.com/world-news/time-for-1st-european-to-travel-moon-a-new-deal-could-make-this-happen-3071016", "urlToImage": "https://c.ndtvimg.com/2022-02/qguvmk58_moon-pixabay_625x300_21_February_22.jpg", "publishedAt": "2022-06-15T18:09:40Z", "content": "NASA is counting on cooperation with European Space Agency. (Representational)\r\nParis: The European Space Agency and NASA on Wednesday talked up the prospect of putting the first European on the Moon… [+2010 chars]"}]}