{"status": "ok", "totalResults": 613, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Man Killed As He Tampers With World War II Bomb In Czech Republic", "description": "A World War II bomb went off early Friday in the eastern Czech city of Ostrava after a man tried to cut it during excavation work, killing him and injuring another.", "url": "https://www.ndtv.com/world-news/man-killed-as-he-tampers-with-world-war-ii-bomb-in-czech-republic-2872742", "urlToImage": "https://i.ndtvimg.com/i/2018-03/police-generic-international-afp_650x400_41520126059.jpg", "publishedAt": "2022-04-09T02:05:44Z", "content": "Police said on Twitter the dead man probably mistook the bomb for an old sewage pipe. (Representational)\r\nPrague: A World War II bomb went off early Friday in the eastern Czech city of Ostrava after … [+893 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Newsdesk", "title": "Pakistan Political Crisis LIVE: Imran Khan Faces No Trust Vote Today", "description": "Pakistan Prime Minister Imran Khan faces the most crucial challenge of his political career as he faces no-confidence motion in the national assembly today. With this, Imran Khan might become the first PM to be removed through a no-trust vote.", "url": "https://www.ndtv.com/world-news/imran-khan-live-updates-pakistan-political-crisis-live-updates-imran-khan-faces-no-confidence-vote-today-2872739", "urlToImage": "https://c.ndtvimg.com/2022-04/3kfhu4qo_pakistan-prime-minister-imran-khan-reuters_625x300_05_April_22.jpg", "publishedAt": "2022-04-09T02:00:19Z", "content": "Pakistan Political Crisis LIVE: Imran Khan attacked the opposition amid political crisis.\r\nNew Delhi: Pakistan Prime Minister Imran Khan faces the most crucial challenge of his political career as he… [+1110 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Moderna Recalls Thousands Of Covid Doses In Europe. Here's Why", "description": "Moderna Inc said on Friday it was recalling 764,900 doses of its COVID-19 vaccine made by its contract manufacturer Rovi after a vial was found contaminated by a foreign body.", "url": "https://www.ndtv.com/world-news/moderna-recalling-thousands-of-covid-doses-in-europe-heres-why-2872733", "urlToImage": "https://c.ndtvimg.com/2020-11/rloo9hso_moderna650_625x300_16_November_20.jpg", "publishedAt": "2022-04-09T01:38:42Z", "content": "Over 900 million doses of the Moderna COVID-19 vaccine have been administered worldwide to date.\r\nMassachusetts: Moderna Inc said on Friday it was recalling 764,900 doses of its COVID-19 vaccine made… [+915 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE: India Reports Over 1,000 New Covid Cases In 24 Hours", "description": "India on Friday reported at least 1,109 new COVID-19 cases, taking the total number of coronavirus infections to 4,30,33,067. According to the Union Health Ministry data, the active cases dipped to 11,492.", "url": "https://www.ndtv.com/india-news/coronavirus-india-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-9-april-2022-2872691", "urlToImage": "https://c.ndtvimg.com/2020-07/qem57b2_chennai-covid-testing-2020_625x300_14_July_20.jpg", "publishedAt": "2022-04-09T00:28:06Z", "content": "India COVID-19 Cases: The death count climbed to 5,21,573 with 43 fresh fatalities\r\nNew Delhi: India on Friday reported at least 1,109 new COVID-19 cases, taking the total number of coronavirus infec… [+578 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "1 Killed, 2 Injured In Shooting Outside High School In New York", "description": "A 16-year-old girl was killed and two other teenagers injured by stray bullets in New York on Friday after a man who was arguing with someone opened fire in the street, police said.", "url": "https://www.ndtv.com/world-news/1-killed-2-injured-in-shooting-outside-high-school-in-new-york-2872686", "urlToImage": "https://c.ndtvimg.com/2021-12/0885q2ig_us-police-generic-afp_625x300_01_December_21.jpg", "publishedAt": "2022-04-09T00:12:02Z", "content": "New York shooting: The other two teenagers were hospitalized in stable condition. (Representational)\r\nNew York: A 16-year-old girl was killed and two other teenagers injured by stray bullets in New Y… [+1659 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Closely Monitoring Covid Lockdown In Shanghai: White House", "description": "The Biden administration is closely monitoring a coronavirus lockdown in Shanghai that could cause delays to air cargo, White house press secretary Jen Psaki said on Friday.", "url": "https://www.ndtv.com/world-news/us-closely-monitoring-covid-lockdown-in-shanghai-white-house-2872675", "urlToImage": "https://c.ndtvimg.com/2022-04/uvrjp6c4_shanghai-china-covid-reuters_625x300_02_April_22.jpg", "publishedAt": "2022-04-08T23:49:05Z", "content": "Shanghai on Friday announced a record 21,000 new COVID-19.\r\nWashington: The Biden administration is closely monitoring a coronavirus lockdown in Shanghai that could cause delays to air cargo, White h… [+418 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine's Zelensky Demands Tough Global Response To Train Station Attack", "description": "Ukraine called for more weapons and harsher sanctions after it blamed Russia for a missile attack that killed at least 52 people at a train station packed with women, children and the elderly fleeing the threat of a Russian offensive in the east.", "url": "https://www.ndtv.com/world-news/ukraines-zelensky-demands-tough-global-response-to-train-station-attack-in-kramatorsk-2872671", "urlToImage": "https://c.ndtvimg.com/2022-03/bh3l1t3g_zelensky-on-streets-afp_650x400_24_March_22.jpg", "publishedAt": "2022-04-08T23:23:50Z", "content": "\"We expect a firm global response to this war crime,\" Zelenskiy said in a video posted late on Friday.\r\nLviv: Ukraine called for more weapons and harsher sanctions after it blamed Russia for a missil… [+5777 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Indian Student Killed In Canada, S Jaishankar Offers Condolences", "description": "External Affairs Minister S Jaishankar on Saturday expressed grief over the death of Indian student Kartik Vasudev, who was shot dead in Canada's Toronto.", "url": "https://www.ndtv.com/india-news/indian-student-killed-in-canadas-toronto-s-jaishankar-offers-condolences-2872670", "urlToImage": "https://c.ndtvimg.com/2021-03/3d9746ug_dead-body-generic_625x300_03_March_21.jpg", "publishedAt": "2022-04-08T23:13:20Z", "content": "Taking to Twitter, Mr Jaishankar also offered his \"deepest condolences\" to the family. (Representational)\r\nNew Delhi:  External Affairs Minister S Jaishankar on Saturday expressed grief over the deat… [+1183 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Crisis-Hit Sri Lanka Hikes Rates As Protests Intensify", "description": "Cash-strapped Sri Lanka's central bank hiked interest rates by a record 700 basis points Friday, in a bid to support the tumbling rupee as the country faces a dire economic crisis.", "url": "https://www.ndtv.com/world-news/crisis-hit-sri-lanka-hikes-rates-as-protests-intensify-2872667", "urlToImage": "https://c.ndtvimg.com/2022-04/0tbcia8_sri-lanka-crisis_625x300_05_April_22.jpg", "publishedAt": "2022-04-08T22:59:08Z", "content": "Protestors are demanding Rajapaksa and his administration step down over country's worst economic crisis.\r\nColombo: Cash-strapped Sri Lanka's central bank hiked interest rates by a record 700 basis p… [+4553 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Iran's Revolutionary Guards Should Stay On Terror List: Top US General", "description": "The United States insisted Friday on keeping the elite Quds Force of Iran's Revolutionary Guards Corps on its designated list of terror groups, as Washington pushes on with negotiations to restore the 2015 Iran nuclear agreement.", "url": "https://www.ndtv.com/world-news/us-top-general-mark-milley-says-irans-revolutionary-guards-corps-should-stay-on-terror-list-2872664", "urlToImage": "https://c.ndtvimg.com/2019-04/hnvp7mq_iran-revolutionary-guards-reuters_625x300_22_April_19.jpg", "publishedAt": "2022-04-08T22:47:57Z", "content": "The Islamic Revolutionary Guard Corps (IRGC) is a powerful faction in Iran. (File)\r\nWashington: The United States insisted Friday on keeping the elite Quds Force of Iran's Revolutionary Guards Corps … [+2311 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Around 1,000 Sailors Stranded In Ukraine Ports Since Russia's invasion: UN", "description": "Two UN agencies on Friday called for \"urgent action\" to help and protect around 1,000 sailors on trading ships stranded in Ukrainian ports and waters since Russia's invasion of Ukraine.", "url": "https://www.ndtv.com/world-news/around-1-000-sailors-stranded-in-ukraine-ports-un-2872657", "urlToImage": "https://c.ndtvimg.com/2018-11/ni1f5jm4_ship-generic_625x300_21_November_18.jpg", "publishedAt": "2022-04-08T22:30:04Z", "content": "ILO said that more than 100 trading ships cannot leave Ukrainian ports and waters. (Representational)\r\nGeneva: Two UN agencies on Friday called for \"urgent action\" to help and protect around 1,000 sa… [+1222 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "AAP Himachal Chief Joins BJP, Accuses Arvind Kejriwal Of \"Insulting\" Leaders", "description": "Anup Kesari,Aam Aadmi Party (AAP) chief of Himachal Pradesh, joined the BJP along with two other party workers ahead of the upcoming state Assembly elections and expressed their disappointment with AAP national convenor Arvind Kejriwal and accused h", "url": "https://www.ndtv.com/india-news/after-joining-bjp-anup-kesari-accuses-kejriwal-of-insulting-aap-himachal-unit-leaders-during-roadshow-2872655", "urlToImage": "https://c.ndtvimg.com/2022-04/mnqtueb_aap-himachal-chief-anup-kesari-2-others-join-bjp-_625x300_09_April_22.jpg", "publishedAt": "2022-04-08T22:22:03Z", "content": "\"Arvind Kejriwal overlooked party workers when he came for a rally in Mandi, AAP Himachal chief said.\r\nNew Delhi: Anup Kesari, Aam Aadmi Party (AAP) chief of Himachal Pradesh, joined the BJP along wi… [+2921 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UP Chief Minister Office's Twitter Account Hacked", "description": "Twitter account of Uttar Pradesh Chief Minister's Office (CMO) was hacked on Saturday.", "url": "https://www.ndtv.com/india-news/up-chief-minister-offices-twitter-account-hacked-2872652", "urlToImage": "https://c.ndtvimg.com/2022-01/j8m1jguc_yogi-adityanath_625x300_31_January_22.jpg", "publishedAt": "2022-04-08T22:16:46Z", "content": "UP CMO (@CMOfficeUP) Twitter account has four million followers at present.\r\nLucknow: Twitter account of Uttar Pradesh Chief Minister's Office (CMO) was hacked on Saturday.\r\nUP CMO (@CMOfficeUP) Twit… [+651 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "India-US 2+2 Talks: Pentagon To Welcome Rajnath Singh On Sunday", "description": "Secretary of Defense Lloyd J Austin III will welcome Indian Defence Minister Rajnath Singh in an enhanced honour cordon ceremony at the Pentagon on April 11 (Sunday).", "url": "https://www.ndtv.com/india-news/us-defence-secretary-to-welcome-rajnath-singh-at-pentagon-on-sunday-2872647", "urlToImage": "https://c.ndtvimg.com/2021-10/435fng8s_rajnath-singh-650_625x300_13_October_21.jpg", "publishedAt": "2022-04-08T21:34:24Z", "content": "Washington: Secretary of Defense Lloyd J Austin III will welcome Indian Defence Minister Rajnath Singh in an enhanced honour cordon ceremony at the Pentagon on April 11 (Sunday).\r\nIndia and the US ar… [+2848 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Used \"Ballistic Missile\" In Ukraine Train Station Strike: US", "description": "The United States believes Russia used a short range ballistic missile to strike a railway station in east Ukraine on Friday, a senior U.S. defense official said.", "url": "https://www.ndtv.com/world-news/russia-used-short-range-ballistic-missile-in-ukraine-train-station-strike-us-2872640", "urlToImage": "https://c.ndtvimg.com/2022-04/5507n188_rocket-remains-kramatorsk-ukraine_650x400_08_April_22.jpg", "publishedAt": "2022-04-08T21:15:43Z", "content": "US believes Russian forces used an SS-21 Scarab missile in the strike.\r\nWashington: The United States believes Russia used a short range ballistic missile to strike a railway station in east Ukraine … [+1772 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Pak Used As Tissue Paper, Thrown Away: Imran Khan On Foreign Interference", "description": "Lauding India as \"khuddar quam\" (very self-respecting people), Pakistan Prime Minister Imran Khan has said that no superpower can dictate terms to the neighbouring country, admitting that both New Delhi and Islamabad do not share a good relationship.", "url": "https://www.ndtv.com/world-news/pakistan-used-as-tissue-papers-and-thrown-away-imran-khan-2872635", "urlToImage": "https://c.ndtvimg.com/2022-03/a0d2su8g_pm-imran-khan-islamabad-rally_625x300_27_March_22.jpg", "publishedAt": "2022-04-08T20:58:36Z", "content": "\"You have to come out to protest for Pakistan's dream on Sunday evening,\" Imran Khan said. (File)\r\nIslamabad: Lauding India as \"khuddar quam\" (very self-respecting people), Pakistan Prime Minister Im… [+3446 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UK Minister Sunak's Wife To Pay More Tax On Overseas Income After Outcry", "description": "Akshata Murty, wife of Britain's finance minister Rishi Sunak, announced Friday she will start paying UK tax on \"all worldwide income,\" amid controversy over her non-domiciled status.", "url": "https://www.ndtv.com/world-news/uk-minister-rishi-sunaks-wife-akshata-murty-to-pay-more-tax-on-overseas-income-after-outcry-2872601", "urlToImage": "https://i.ndtvimg.com/i/2018-01/rishi-sunak-akshata-murthy-facebook_650x400_61515555153.jpg", "publishedAt": "2022-04-08T20:30:54Z", "content": "Sunak's wife Akshata Murty is the daughter of Indian billionaire NR Narayana Murthy.\r\nLondon: Akshata Murty, wife of Britain's finance minister Rishi Sunak, announced Friday she will start paying UK … [+3490 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "EU Imposes Sanctions On Putin's Daughters, 217 Others Over Ukraine Crisis", "description": "The EU blacklisted Russian President Vladimir Putin's two adult daughters and more than 200 other people as part of its latest sanctions package over Moscow's war in Ukraine, according to an official list published late Friday.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-eu-imposes-sanctions-on-putins-daughters-217-others-over-ukraine-crisis-2872583", "urlToImage": "https://c.ndtvimg.com/2022-04/bkdocphg_putin-daughter-wife-afp-650_625x300_07_April_22.jpg", "publishedAt": "2022-04-08T20:01:27Z", "content": "A total of 215 individuals were added to the EU's blacklist, including Putin's offspring.\r\nBrussels: The EU blacklisted Russian President Vladimir Putin's two adult daughters and more than 200 other … [+2536 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Shuts Amnesty, Other Human Rights Organisation Offices Over Ukraine", "description": "Russia said on Friday it was shutting down the local offices of more than a dozen international organisations including Human Rights Watch, Amnesty International and the Carnegie Endowment for International Peace.", "url": "https://www.ndtv.com/world-news/russia-shuts-amnesty-other-human-rights-organisation-offices-over-ukraine-war-2872573", "urlToImage": "https://c.ndtvimg.com/2022-03/e9ljhqjg_ukraine-war_625x300_27_March_22.jpg", "publishedAt": "2022-04-08T19:46:12Z", "content": "The announcement came on the 44th day of Russian attack in Ukraine with thousands killed.\r\nMoscow: Russia said on Friday it was shutting down the local offices of more than a dozen international orga… [+1978 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Will Smith Banned From Oscars Ceremonies For 10 Years Over Slap", "description": "Will Smith has been banned from attending the Oscars for the next 10 years after he slapped comedian Chris Rock on stage, the Academy of Motion Picture Arts and Sciences said Friday.", "url": "https://www.ndtv.com/world-news/will-smith-banned-from-oscars-ceremonies-for-10-years-over-slap-2872542", "urlToImage": "https://c.ndtvimg.com/2022-03/kmfecaeg_will-smith_625x300_29_March_22.jpg", "publishedAt": "2022-04-08T19:15:11Z", "content": "The Board said that Mr. Smith shall not be permitted to attend any Academy events or programs.\r\nLos Angeles: Will Smith was banned on Friday from attending the Oscars for the next 10 years, two weeks… [+4190 chars]"}]}