{"status": "ok", "totalResults": 290, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Will Send Long Range Rocket System To Ukraine To \"Hit Russian Targets\": US", "description": "The United States is sending Himars advanced multiple rocket systems to Ukraine, a US official said Tuesday, ending days of speculation over the latest upgrade of military aid to Kyiv in its fight against Russia.", "url": "https://www.ndtv.com/world-news/will-send-long-range-rocket-system-to-ukraine-to-hit-russian-targets-us-3027560", "urlToImage": "https://c.ndtvimg.com/2022-05/gb9u61u8_biden-afp_625x300_23_May_22.jpg", "publishedAt": "2022-06-01T00:29:03Z", "content": "Earlier, the White House said that US is preparing new weapons for Ukraine to fight against Russia.\r\nWashington: The United States is sending Himars advanced multiple rocket systems to Ukraine, a US … [+626 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "AAP Demands Karnataka BJP Leader's Arrest For His Remark On National Flag", "description": "AAP leader Sanjay Singh has submitted a complaint to police against the BJP's K Eshwarappa over his reported remarks that the saffron flag would become the national flag of India one day and said he should be arrested.", "url": "https://www.ndtv.com/india-news/aap-leader-sanjay-singh-demands-karnataka-bjp-leaders-arrest-for-his-remark-on-national-flag-3027541", "urlToImage": "https://c.ndtvimg.com/2022-04/qm0s56tc_ks-eshwarappa-ndtv_625x300_05_April_22.jpg", "publishedAt": "2022-05-31T23:51:30Z", "content": "Karnataka BJP leader Eshwarappa had recently said that on day RSS flag will become the national flag.\r\nNew Delhi: AAP leader Sanjay Singh has submitted a complaint to police against the BJP's K Eshwa… [+1007 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "French Open: Nadal Wins Epic Four-Set Clash With Djokovic To Make Semis", "description": "French Open: 13-time champion Rafael Nadal defeated world number one Novak Djokovic in the quarter-finals", "url": "https://sports.ndtv.com/french-open-2022/french-open-rafael-nadal-wins-epic-four-set-clash-with-novak-djokovic-to-make-semi-finals-3027536", "urlToImage": "https://c.ndtvimg.com/2022-06/vsh2nnj8_rafael-nadal-afp_625x300_01_June_22.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-31T23:33:34Z", "content": "Rafael Nadal edged a late-night classic against old rival Novak Djokovic in the early hours of Wednesday in four sets to reach his 15th French Open semi-final. The 13-time Roland Garros champion won … [+1932 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sidhu Moose Wala Murder: Punjab Police Recover Cars Used In Crime", "description": "A Special Investigation Team formed under the supervision of the Mansa SSP is minutely probing all angles involving the killing of Punjabi singer and Congress leader Sidhu Moose Wala including the role of gangsters Lawrence Bishnoi and Goldy Brar.", "url": "https://www.ndtv.com/india-news/sidhu-moose-wala-murder-punjab-police-recover-cars-used-in-crime-3027533", "urlToImage": "https://c.ndtvimg.com/2022-05/p0ksnhhg_sidhu-moose-wala_625x300_30_May_22.jpg", "publishedAt": "2022-05-31T23:22:53Z", "content": "Punjab Police on Monday also detained 6 people in connection with the death of Sidhu Moose Wala.\r\nMansa, Punjab: A Special Investigation Team (SIT) formed under the supervision of the Mansa Superinte… [+2453 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Johnny Depp Vs Amber Heard: Jury Concludes Deliberations Without Verdict", "description": "The jury in the bitter defamation trial between \"Pirates of the Caribbean\" star Johnny Depp and his ex-wife Amber Heard concluded deliberations for the day on Tuesday without reaching a verdict.", "url": "https://www.ndtv.com/world-news/johnny-depp-vs-amber-heard-jury-concludes-deliberations-without-verdict-3027530", "urlToImage": "https://c.ndtvimg.com/2022-04/d5p67l3_johnny-depp-vs-amber-heard_625x300_30_April_22.jpg", "publishedAt": "2022-05-31T23:03:07Z", "content": "Johnny Depp Vs Amber Heard: Jury will resume deliberations on Wednesday in Fairfax County Circuit Court.\r\nWashington: The jury in the bitter defamation trial between \"Pirates of the Caribbean\" star J… [+3222 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "White House Says US Preparing New Weapons Package For Ukraine Amid War", "description": "U.S. President Joe Biden and his team are still considering the sending of longer-range rocket systems to Ukraine but do not want them used to launch attacks inside Russian territory, the White House said on Tuesday.", "url": "https://www.ndtv.com/world-news/white-house-says-us-preparing-new-weapons-package-for-ukraine-amid-war-3027527", "urlToImage": "https://c.ndtvimg.com/2022-05/592rr60g_joe-biden-potus_625x300_30_May_22.jpg", "publishedAt": "2022-05-31T22:45:36Z", "content": "Earlier, Biden had that US will not send rocket systems to Ukraine that strike into Russia.\r\nWashington: U.S. President Joe Biden and his team are still considering the sending of longer-range rocket… [+2557 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "India, Pakistan Have A Lot To Gain From Mutually Beneficial Trade: Pak PM", "description": "Pakistan Prime Minister Shehbaz Sharif has said that Islamabad is looking to forge partnerships for its geo-economics strategy, especially within the region, which apparently includes New Delhi.", "url": "https://www.ndtv.com/world-news/india-pakistan-have-a-lot-to-gain-from-mutually-beneficial-trade-pak-pm-shehbaz-sharif-3027524", "urlToImage": "https://c.ndtvimg.com/vl3o3ykk3h_shehbaz-sharif-afp-_625x300.jpg", "publishedAt": "2022-05-31T22:25:57Z", "content": "Pakistan PM Shehbaz Sharif arrived in Turkey on Tuesday for a three-day official visit.\r\nIslamabad: Pakistan Prime Minister Shehbaz Sharif has said that Islamabad is looking to forge partnerships for… [+2021 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Iran Says UN Nuclear Watchdog Report On Undeclared Sites \"Not Fair\"", "description": "Iran condemned as \"not fair\" Tuesday a report by the UN nuclear watchdog on traces of nuclear material found at three undeclared sites.", "url": "https://www.ndtv.com/world-news/iran-says-un-nuclear-watchdog-report-on-undeclared-sites-not-fair-3027521", "urlToImage": "https://c.ndtvimg.com/2019-05/6c7epapg_iran-flag-reuters-650_625x300_20_May_19.jpg", "publishedAt": "2022-05-31T22:06:38Z", "content": "Iran said that UN Nuclear Watchdog's report is not a fair and balanced.\r\nTehran: Iran condemned as \"not fair\" Tuesday a report by the UN nuclear watchdog on traces of nuclear material found at three … [+4387 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine Reports 'Shutdown Of All Communications' In Russian-Occupied Kherson", "description": "Ukrainian officials are reporting a \"shutdown of all communications\" in the Russian-occupied southern region of Kherson.", "url": "https://www.ndtv.com/world-news/ukraine-reports-shutdown-of-all-communications-in-russian-occupied-kherson-3027518", "urlToImage": "https://c.ndtvimg.com/2022-05/csd36oq_russia-ukraine-war-donbas-_625x300_29_May_22.jpg", "publishedAt": "2022-05-31T21:45:45Z", "content": "Ukraine war: Mobile communication and the Internet blocked in Kherson region, Ukraine offical said.\r\nKyiv: Ukrainian officials are reporting a \"shutdown of all communications\" in the Russian-occupied… [+655 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "From Sonu Nigam To Shreya Ghoshal, Music Industry Mourns KK's Sudden Demise", "description": "Several celebrities from the Indian music industry paid heartfelt tributes to Krishnakumar Kunnath, better known as KK, after the demise of the popular playback singer.", "url": "https://www.ndtv.com/india-news/singer-kk-dies-from-sonu-nigam-to-shreya-ghoshal-music-industry-mourns-singers-sudden-demise-3027513", "urlToImage": "https://c.ndtvimg.com/2022-06/br4rbbeg_singer-kk_625x300_01_June_22.jpg", "publishedAt": "2022-05-31T21:26:22Z", "content": "KK, who was just 54 years old, is survived by his wife and two children.\r\nMumbai: Several celebrities from the Indian music industry paid heartfelt tributes to Krishnakumar Kunnath, better known as K… [+2493 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "1 Killed, 2 Injured In Shooting At US High School: Police", "description": "An elderly woman was killed and two other persons were injured when gunfire erupted at a high school graduation ceremony in New Orleans on Tuesday (local time).", "url": "https://www.ndtv.com/world-news/us-1-killed-2-injured-in-shooting-at-high-school-in-new-orleans-3027504", "urlToImage": "https://c.ndtvimg.com/2018-09/hms9qqjc_us-police-generic_625x300_14_September_18.jpg", "publishedAt": "2022-05-31T21:00:19Z", "content": "New Orleans incident happened days after Texas school shooting which killed 21 people. (Representational)\r\nNew Orleans: An elderly woman was killed and two other persons were injured when gunfire eru… [+733 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Hails EU's Russian Oil Ban, Urges Long-Term Effort", "description": "The United States on Tuesday hailed a European Union decision to scale back Russian oil imports and called for long-term efforts to further reduce dependence on Moscow.", "url": "https://www.ndtv.com/world-news/us-hails-eus-russian-oil-ban-urges-long-term-effort-3027461", "urlToImage": "https://c.ndtvimg.com/2021-07/7arkdhhk_ned-price_625x300_02_July_21.jpg", "publishedAt": "2022-05-31T20:02:20Z", "content": "Ukraine war: EU leaders on Monday agreed to ban more than two-thirds of Russian oil imports.\r\nWashington: The United States on Tuesday hailed a European Union decision to scale back Russian oil impor… [+1451 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Over 69% Voter Turnout In Odisha's Brajrajnagar Assembly Bypoll: Official", "description": "Over 69 per cent polling was registered in the by-election to Brajrajnagar assembly segment in Odisha's Jharsuguda district, where voting was largely \"incident-free\" on Tuesday, Chief Electoral Officer SK Lohani said.", "url": "https://www.ndtv.com/india-news/over-69-voter-turnout-in-odishas-brajrajnagar-assembly-bypoll-official-3027452", "urlToImage": "https://c.ndtvimg.com/2020-11/mpbfnv4_election-generic-afp650_625x300_02_November_20.jpg", "publishedAt": "2022-05-31T19:35:17Z", "content": "Odisha Bypoll: The elections were conducted amid strict adherence to Covid norms, official said.\r\nBhubaneswar: Over 69 per cent polling was registered in the by-election to Brajrajnagar assembly segm… [+1843 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Closes In On Key City Of Ukraine As EU Agrees On Partial Oil Ban", "description": "Russian forces now control \"most\" of eastern Ukraine's key city of Severodonetsk, a regional governor said Tuesday, while EU leaders were split over banning gas from Moscow after agreeing to embargo most of its oil.", "url": "https://www.ndtv.com/world-news/russia-inches-closer-to-capture-severodonetsk-in-eastern-ukraine-3027432", "urlToImage": "https://c.ndtvimg.com/2022-05/6boe0isg_severodonetsk-russia-ukraine-war-afp_625x300_19_May_22.jpg", "publishedAt": "2022-05-31T19:22:36Z", "content": "Ukraine war: The local governor said \"90 percent\" of Severodonetsk had been destroyed by Russian army.\r\nKyiv: Russian forces now control \"most\" of eastern Ukraine's key city of Severodonetsk, a regio… [+5213 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Bombing In Myanmar's Commercial Hub Kills 1, Injures 9", "description": "A bomb blast in a busy neighbourhood of Myanmar's commercial hub Yangon killed one person and injured nine others on Tuesday, police and junta authorities said.", "url": "https://www.ndtv.com/world-news/bombing-in-myanmars-commercial-hub-kills-1-injures-9-3027424", "urlToImage": "https://c.ndtvimg.com/2022-06/46ebdo38_myanmar-blast_625x300_01_June_22.jpg", "publishedAt": "2022-05-31T19:15:33Z", "content": "Myanmar Blast: The blast came from a \"homemade mine\".\r\nA bomb blast in a busy neighbourhood of Myanmar's commercial hub Yangon killed one person and injured nine others on Tuesday, police and junta a… [+2492 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "German Regulator Warns Banks Over Possible Cyber Attacks", "description": "The German financial regulator BaFin on Tuesday issued a fresh warning to the nation's financial sector of the increased danger of cyber attacks.", "url": "https://www.ndtv.com/world-news/german-regulator-warns-banks-over-possible-cyber-attacks-3026649", "urlToImage": "https://c.ndtvimg.com/2022-04/hc7as9jg_cyber-attack_625x300_07_April_22.jpg", "publishedAt": "2022-05-31T19:12:03Z", "content": "German financial regulator BaFin issued a warning on cyber attacks. (Representational)\r\nFRANKFURT: The German financial regulator BaFin on Tuesday issued a fresh warning to the nation's financial sec… [+130 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine Identifies Over 15,000 War Crime Cases Since Russia Invasion", "description": "Ukraine has identified several thousand suspected war crimes in the eastern Donbas region where Russian forces are pressing their offensive, Kyiv's chief prosecutor said Tuesday.", "url": "https://www.ndtv.com/world-news/ukraine-identifies-over-15-000-war-crime-cases-since-russia-invasion-3027422", "urlToImage": "https://c.ndtvimg.com/2022-05/csd36oq_russia-ukraine-war-donbas-_625x300_29_May_22.jpg", "publishedAt": "2022-05-31T19:09:59Z", "content": "Russia-Ukraine War: Ukraine had identified 15,000 war crimes cases since the Russian invasion.\r\nKyiv: Ukraine has identified several thousand suspected war crimes in the eastern Donbas region where R… [+3018 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Germany's Help To Ukraine Amid Russia War: Soviet Weapons", "description": "Germany will deliver infantry fighting vehicles (IFV) to Greece so that the government in Athens can pass on Soviet-style weapons to Ukraine, German Chancellor Olaf Scholz said on Tuesday.", "url": "https://www.ndtv.com/world-news/germanys-help-to-ukraine-amid-russia-war-soviet-weapons-3026583", "urlToImage": "https://c.ndtvimg.com/2022-05/fc0jpgg_russia-ukraine-war-afp_625x300_31_May_22.jpg", "publishedAt": "2022-05-31T19:05:15Z", "content": "Germany has been criticized for dragging its feet on heavy arms deliveries to Kyiv.\r\nBrussels: Germany will deliver infantry fighting vehicles (IFV) to Greece so that the government in Athens can pas… [+620 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Don't Rule Out Anything: France's Macron On EU Sanctions On Russia", "description": "French President Emmanuel Macron said that following a sixth European Union package of sanctions against Russia nothing could be ruled out in terms of additional sanctions in the coming weeks.", "url": "https://www.ndtv.com/world-news/dont-rule-out-anything-frances-macron-on-eu-sanctions-on-russia-3026502", "urlToImage": "https://c.ndtvimg.com/2022-05/vf1vsh44_macron-afp_625x300_31_May_22.jpg", "publishedAt": "2022-05-31T18:59:51Z", "content": "French President Macron said nothing could be ruled out in terms of sanctions.\r\nParis: French President Emmanuel Macron said that following a sixth European Union package of sanctions against Russia … [+366 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "KK Dies At 53: The Versatile Singer's Top 10 Songs", "description": "Singer KK died hours after a concert performance in Kolkata. The 54-year-old singer fell ill while performing and was brought to the hospital, where he was declared dead.", "url": "https://www.ndtv.com/india-news/singer-kks-death-singer-kk-dies-at-53-top-10-songs-3027412", "urlToImage": "https://c.ndtvimg.com/2022-06/br4rbbeg_singer-kk_625x300_01_June_22.jpg", "publishedAt": "2022-05-31T18:55:50Z", "content": "Singer KK's Death: Singer KK died hours after a concert performance in Kolkata.\r\nNew Delhi: Singer KK died hours after a concert performance in Kolkata. The 54-year-old singer fell ill while performi… [+764 chars]"}]}