{"status": "ok", "totalResults": 620, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Grave Injustice: Not Even The Dead Rest Easy In Karachi", "description": "In the teeming metropolis of Karachi, Pakistan's biggest city, graveyards are filling up and the dead are running out of space to rest.", "url": "https://www.ndtv.com/world-news/grave-injustice-not-even-the-dead-rest-easy-in-karachi-2886895", "urlToImage": "https://c.ndtvimg.com/2022-04/ddvcelf_karachi-gravedigger-afp-650_625x300_14_April_22.jpg", "publishedAt": "2022-04-14T01:51:10Z", "content": "Karachi:Freelance gravediggers are profiting on Pakistan's changing population dynamic.\r\nKarachi: In the teeming metropolis of Karachi, Pakistan's biggest city, graveyards are filling up and the dead… [+4882 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "No Hate Speech At Delhi Meet, Say Police, Questions Plea In Supreme Court", "description": "The speakers at the \"Dharm Sansad\" or religious assembly in Delhi on December 19 made no hate speech against the Muslim community, the Delhi Police has said.", "url": "https://www.ndtv.com/india-news/no-hate-speech-at-hindu-yuva-vahini-delhi-dharm-sansad-meet-say-police-questions-plea-in-supreme-court-2886890", "urlToImage": "https://c.ndtvimg.com/2021-08/h0cit9vo_supreme-court-650_625x300_16_August_21.jpg", "publishedAt": "2022-04-14T01:45:40Z", "content": "Delhi Police told the Supreme Court that no hate speech was given against any community.\r\nNew Delhi: The speakers at the \"Dharm Sansad\" or religious assembly in Delhi on December 19 made no hate spee… [+1656 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus Live: India Records Over 1,000 COVID-19 Cases In 24 Hours", "description": "India saw a total of 1,088 new COVID-19 cases on Wednesday, taking the coronavirus tally to 4,30,38,016. The country also reported at least 26 Covid-related deaths on Wednesday, bringing the total number of fatalities to 5,21,736.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-14-april-2022-2886875", "urlToImage": "https://c.ndtvimg.com/2021-04/q6bsvdss_covid-india-afp_625x300_24_April_21.jpg", "publishedAt": "2022-04-14T01:12:47Z", "content": "India Covid Live: A reduction of 19 cases was recorded in the active caseload in a span of 24 hours.\r\nNew Delhi: India saw a total of 1,088 new COVID-19 cases on Wednesday, taking the coronavirus tal… [+775 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Says Its Warship In Black Sea \"Badly Damaged\" By Explosion", "description": "Russia on Thursday said the flagship of its Black Sea fleet was seriously damaged and its crew evacuated following a fire that caused an explosion, as a Ukrainian official said the vessel had been hit by missiles.", "url": "https://www.ndtv.com/world-news/russia-says-its-warship-in-black-sea-badly-damaged-by-explosion-2886849", "urlToImage": "https://c.ndtvimg.com/2022-04/g2utmnsk_russian-warship-in-black-sea_625x300_14_April_22.jpg", "publishedAt": "2022-04-14T00:27:21Z", "content": "Meanwhile, Ukraine claimed that it has destroyed Russian warship in Black Sea. (File)\r\nMoscow: Russia on Thursday said the flagship of its Black Sea fleet was seriously damaged and its crew evacuated… [+5995 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Congratulates Pakistan's Newly Elected PM Shehbaz Sharif", "description": "The United States on Wednesday congratulated Pakistani Prime Minister Shehbaz Sharif, newly elected following the weekend ouster of Imran Khan, who accused Washington of involvement in a conspiracy to force him from power.", "url": "https://www.ndtv.com/world-news/us-congratulates-pakistans-newly-elected-pm-shehbaz-sharif-2886842", "urlToImage": "https://c.ndtvimg.com/2022-04/f6akv76c_shahbaz-sharif-afp_625x300_12_April_22.jpg", "publishedAt": "2022-04-13T23:58:02Z", "content": "Khan was dismissed after losing a no-trust vote, and Sharif elected by lawmakers the following day.\r\nWashington: The United States on Wednesday congratulated Pakistani Prime Minister Shehbaz Sharif, … [+1739 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Asaram Bapu Case: Security For Rape Victim's Family Stepped Up", "description": "Police have stepped up security for the family of the victim in the 2013 rape case against Asaram Bapu after her father claimed a threat to his life and that of his family members from the supporters of the self-styled 'godman'.", "url": "https://www.ndtv.com/india-news/asaram-bapu-case-security-for-rape-victims-family-stepped-up-2886839", "urlToImage": "https://i.ndtvimg.com/i/2016-05/asaram-bapu_650x400_41463420015.jpg", "publishedAt": "2022-04-13T23:36:55Z", "content": "The victim had accused Asaram of rape in 2013. (File)\r\nShahjahanpur: Police have stepped up security for the family of the victim in the 2013 rape case against Asaram Bapu after her father claimed a … [+1263 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "War Prisoners In Pak: Court To Hear Plea Seeking Repatriation Of Soldiers", "description": "The Supreme Court on Wednesday agreed to hear a plea of the wife of an Indian Army officer seeking repatriation of her husband and other Army officers believed to be held under illegal detention as Prisoners of War by Pakistan since the 1971 war.", "url": "https://www.ndtv.com/india-news/war-prisoners-in-pak-court-to-hear-plea-seeking-repatriation-of-army-personnel-2886832", "urlToImage": "https://c.ndtvimg.com/2021-07/84i6b6oo_supreme-court-_650x400_20_July_21.jpg", "publishedAt": "2022-04-13T23:17:56Z", "content": "The Supreme Court sought its response in three weeks from Centre.\r\nNew Delhi: The Supreme Court on Wednesday agreed to hear a plea of the wife of an Indian Army officer seeking repatriation of her hu… [+5084 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"This Is Terrorism\": Polish President On Russian Invasion Of Ukraine", "description": "Polish President Andrzej Duda called the war in Ukraine \"terrorism\" on Wednesday, saying those who committed crimes must be brought to justice and that that must extend to those who gave the orders.", "url": "https://www.ndtv.com/world-news/this-is-terrorism-polish-president-andrzej-duda-on-russian-invasion-of-ukraine-2886823", "urlToImage": "https://c.ndtvimg.com/2022-04/mindrbs8_ukraine-war_625x300_08_April_22.jpg", "publishedAt": "2022-04-13T22:58:13Z", "content": "Polish president called war in Ukraine \"terrorism\" and demanded justice.\r\nKyiv: Polish President Andrzej Duda called the war in Ukraine \"terrorism\" on Wednesday, saying those who committed crimes mus… [+636 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Embattled UK PM Johnson To Announce Illegal Migration Plan", "description": "British Prime Minister Boris Johnson will on Thursday outline his government's plan to tackle illegal migration and small boat crossings of the Channel, which is expected to include an immigration deal with Rwanda.", "url": "https://www.ndtv.com/world-news/embattled-uk-pm-boris-johnson-to-announce-illegal-migration-plan-2886811", "urlToImage": "https://c.ndtvimg.com/2022-01/ubb66glg_boris-johnson-reuters_625x300_18_January_22.jpg", "publishedAt": "2022-04-13T22:25:54Z", "content": "It said that the plan aims to \"break the business model of people smuggling gangs.\"\r\nLondon: British Prime Minister Boris Johnson will on Thursday outline his government's plan to tackle illegal migr… [+1926 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine Claims It Destroyed Russian Warship In Black Sea", "description": "Ukrainian forces damaged a Russian warship in the Black Sea with missile strikes Wednesday, the governor of Odessa said.", "url": "https://www.ndtv.com/world-news/russian-warship-destroyed-after-missile-strike-in-black-sea-ukraine-says-2886806", "urlToImage": "https://i.ndtvimg.com/i/2017-06/russian-warship-reuters_650x400_81498207823.jpg", "publishedAt": "2022-04-13T21:58:19Z", "content": "There was no confirmation from the Russian military of any attack on the warship. (Representational)\r\nOdessa, Ukraine: Ukrainian forces damaged a Russian warship in the Black Sea with missile strikes… [+928 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Imran Khan Urges Youth To Raise Voice Against New Pak PM On Social Media", "description": "Lashing out at the Shehbaz Sharif-led Pakistan government over the recent crackdown on social media, Imran Khan said that it is not the Pakistan of the 1970s era but a 'Naya Pakistan' where people have right to raise voice through social media.", "url": "https://www.ndtv.com/world-news/imran-khan-urges-youth-to-raise-voice-against-new-pak-pm-on-social-media-2886800", "urlToImage": "https://c.ndtvimg.com/2022-04/25ps1mqg_pak-pm-imran-khan-ani-650_650x400_08_April_22.jpg", "publishedAt": "2022-04-13T21:37:27Z", "content": "Imran Khan Said people will not accept Shehbaz Sharif as the new prime minister of Pakistan.\r\nIslamabad: Lashing out at the PM Shehbaz Sharif-led Pakistan government over the recent crackdown on soci… [+2194 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "What's In US' $800 Million Military Aid Package For Ukraine? Details Here", "description": "The United States on Wednesday unveiled a new $800 million military aid package for Ukraine, including heavier equipment such as helicopters, howitzers and armored personnel carriers.", "url": "https://www.ndtv.com/world-news/whats-in-us-800-million-military-aid-package-for-ukraine-details-here-2886793", "urlToImage": "https://c.ndtvimg.com/2022-03/6dp1afqo_joe-biden-in-warsaw-afp-650_625x300_26_March_22.jpg", "publishedAt": "2022-04-13T21:15:46Z", "content": "US also agrees to send Mi-17 helicopters to Ukraine as a part new military package.\r\nWashington: The United States on Wednesday unveiled a new $800 million military aid package for Ukraine, including… [+2658 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukrainian Forces Will Need Training On Some Military Equipment: Pentagon", "description": "Some of the new military equipment the United States said on Wednesday it was sending to Ukraine will require training for Ukrainian forces, Pentagon spokesperson John Kirby told reporters.", "url": "https://www.ndtv.com/world-news/ukrainian-forces-will-need-training-on-some-military-equipment-pentagon-2886783", "urlToImage": "https://c.ndtvimg.com/2022-02/3f3rjmt8_ukraine-army-afp-650_625x300_26_February_22.jpg", "publishedAt": "2022-04-13T20:46:38Z", "content": "The US on Wednesday unveiled a new $800 million military aid package for Ukraine.\r\nWashington: Some of the new military equipment the United States said on Wednesday it was sending to Ukraine will re… [+592 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "New York Subway Shooting Suspect Faces Terror Charge: Official", "description": "The suspect arrested for shooting 10 people on the New York subway has been charged with a federal terror offense and could face life in prison, authorities said Wednesday.", "url": "https://www.ndtv.com/world-news/new-york-subway-shooting-suspect-frank-james-faces-federal-terror-charge-fbi-2886754", "urlToImage": "https://c.ndtvimg.com/2022-04/2j2iom5g_brooklyn-shooting-person-of-interest-twitter-650_650x400_13_April_22.jpg", "publishedAt": "2022-04-13T20:11:23Z", "content": "Frank James could face a life sentence if convicted, official said.\r\nNew York: A 62-year-old man accused of shooting 10 people on the New York subway was taken into custody Wednesday and faces a fede… [+4256 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Canada's Trudeau Terms Russian Assault In Ukraine \"Genocide\"", "description": "Canadian Prime Minister Justin Trudeau said Wednesday it was \"right\" to describe Russia's attacks in Ukraine as \"genocide,\" repeating US President Joe Biden's accusation.", "url": "https://www.ndtv.com/world-news/canadas-justin-trudeau-calls-russian-assault-in-ukraine-genocide-2886749", "urlToImage": "https://c.ndtvimg.com/2021-11/8kr7u6is_justin-trudeau-reuters_625x300_16_November_21.jpg", "publishedAt": "2022-04-13T19:45:54Z", "content": "\"We have seen this desire to attack civilians,\" Trudeau said.\r\nMontreal: Canadian Prime Minister Justin Trudeau said Wednesday it was \"right\" to describe Russia's attacks in Ukraine as \"genocide,\" re… [+2106 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Announces Sanctions Against 398 Members Of US Congress", "description": "Russia said Wednesday it had introduced sanctions against 398 members of the US Congress in retaliation against Washington's punitive measures over Ukraine and said more sanctions would follow.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-russia-announces-sanctions-against-398-members-of-us-congress-2886734", "urlToImage": "https://i.ndtvimg.com/i/2017-07/us-congress-capitol-building-reuters_650x400_81501327460.jpg", "publishedAt": "2022-04-13T19:22:13Z", "content": "Moscow said that sanctions included a ban on entry. (File)\r\nMoscow: Russia said Wednesday it had introduced sanctions against 398 members of the US Congress in retaliation against Washington's puniti… [+1162 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Macron's Refusal To Talk Of \"Genocide\" In Ukraine \"Painful\": Zelensky", "description": "Ukrainian President Volodymyr Zelensky on Wednesday denounced French leader Emmanuel Macron's refusal to call killings in Ukraine \"genocide\" and his reference to Russians as a \"brotherly\" people.", "url": "https://www.ndtv.com/world-news/frence-president-emmanuel-macrons-refusal-to-talk-of-genocide-in-ukraine-painful-ukraine-president-volodymyr-zelensky-2886723", "urlToImage": "https://c.ndtvimg.com/2022-04/o6tn4et4_ukrainian-president-volodymyr-zelensky_625x300_02_April_22.jpg", "publishedAt": "2022-04-13T19:07:19Z", "content": "French President Emmanuel Macron said leaders should be careful with language.\r\nKyiv: Ukrainian President Volodymyr Zelensky on Wednesday denounced French leader Emmanuel Macron's refusal to call kil… [+1710 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Announces New $800 Million Military Aid Package For Ukraine", "description": "US President Joe Biden on Wednesday announced a new $800 million military aid package for Ukraine, including weapons, ammunition, armored personnel carriers and helicopters.", "url": "https://www.ndtv.com/world-news/us-announces-new-800-million-military-aid-package-for-ukraine-2886676", "urlToImage": "https://c.ndtvimg.com/2022-03/243s95ng_ukraine-afp_625x300_19_March_22.jpg", "publishedAt": "2022-04-13T18:24:06Z", "content": "US Announces New $800 Million Military Aid Package For Ukraine\r\nWashington: US President Joe Biden on Wednesday announced a new $800 million military aid package for Ukraine, including weapons, ammun… [+405 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "IPL 2022: MI's Winless Run Continues, Lose To PBKS By 12 Runs", "description": "IPL 2022, MI vs PBKS: Failing to chase a target of 199 runs, Mumbai Indians crashed to another defeat, losing to Punjab Kings in Pune on Wednesday.", "url": "https://sports.ndtv.com/ipl-2022/ipl-2022-mi-vs-pbks-punjab-kings-compound-mumbai-indians-woes-with-12-run-victory-2886663", "urlToImage": "https://c.ndtvimg.com/2022-04/lv9t3gj8_pbks-bcci-ipl_625x300_13_April_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-04-13T18:20:29Z", "content": "Mumbai Indians inched closer towards elimination after setting themselves up for their first win, only to slump to their fifth defeat on the trot as Punjab Kings won a high-scoring IPL thriller by 12… [+4109 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "62-Year-Old Man Arrested For Shooting 10 At New York Subway: Report", "description": "New York police arrested a suspect accused of shooting 10 people on a packed subway train car in Brooklyn, more than 24 hours after the terrifying attack, US media reported Wednesday.", "url": "https://www.ndtv.com/world-news/new-york-subway-shooting-suspect-arrested-report-2886656", "urlToImage": "https://c.ndtvimg.com/2022-04/c3vd8csg_brooklyn-shooting_625x300_12_April_22.jpg", "publishedAt": "2022-04-13T18:13:53Z", "content": "Police had named 62-year-old Frank James as the suspect in the incident.\r\nNew York: New York police arrested a suspect accused of shooting 10 people on a packed subway train car in Brooklyn, more tha… [+424 chars]"}]}