{"status": "ok", "totalResults": 226, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"I Think Sane People Can See...\": Russian Minister Denies Putin Is Ill", "description": "Russian Foreign Minister Sergei Lavrov on Sunday denied speculation that President Vladimir Putin was ill, saying there were no signs pointing to any ailment.", "url": "https://www.ndtv.com/world-news/russian-minister-denies-putin-is-ill-i-think-sane-people-can-see-3020953", "urlToImage": "https://c.ndtvimg.com/2022-05/6s30js9g_vladimir-putin-health-afp-650_625x300_18_May_22.jpg", "publishedAt": "2022-05-29T22:57:19Z", "content": "Putin's health, private life are taboo subjects in Russia, and almost never discussed in public.(FILE)\r\nMoscow: Russian Foreign Minister Sergei Lavrov on Sunday denied speculation that President Vlad… [+1070 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Zelensky Fires Kharkiv Security Chief For \"Not Working To Defend City\"", "description": "Ukrainian President Volodymyr Zelensky made his first trip Sunday to the war-torn east since Moscow's invasion started, as Russian forces tightened their grip around key cities in the Donbas region.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-zelensky-fires-kharkiv-security-chief-for-not-working-to-defend-city-3020945", "urlToImage": "https://c.ndtvimg.com/2022-05/8uhjrv7s_zelensky-afp_625x300_30_May_22.jpg?im=FitAndFill=(600,400)", "publishedAt": "2022-05-29T22:21:16Z", "content": "Volodymyr Zelensky talking with servicemen during his visit to the Kharkiv region.\r\nKharkiv: Ukrainian President Volodymyr Zelensky made his first trip Sunday to the war-torn east since Moscow's inva… [+5809 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sri Lanka Police Tear-Gas Students In Fresh Clashes", "description": "Police fired tear gas to disperse thousands of students trying to storm the Sri Lankan president's home Sunday as the government offered an olive branch to demonstrators demanding his resignation.", "url": "https://www.ndtv.com/india-news/sri-lanka-police-tear-gas-students-in-fresh-clashes-3020936", "urlToImage": "https://c.ndtvimg.com/2022-05/n5m04hns_sri-lanka-protests-afp_625x300_30_May_22.jpg?im=FitAndFill=(600,400)", "publishedAt": "2022-05-29T21:59:15Z", "content": "Police use tear gas shells to disperse students taking part in protests.\r\nColombo: Police fired tear gas to disperse thousands of students trying to storm the Sri Lankan president's home Sunday as th… [+2734 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Monkeypox In Non-Endemic Countries Suggests Undetected Transmission: WHO", "description": "The World Health Organization said on Sunday that the sudden appearance of monkeypox at once in several countries where the disease is not typically found suggests undetected transmission for some time and recent amplifying events.", "url": "https://www.ndtv.com/world-news/reports-of-monkeypox-in-non-endemic-countries-suggests-undetected-transmission-for-some-time-who-says-3020926", "urlToImage": "https://c.ndtvimg.com/2022-05/iagsqfo_monkeypox-reuters_625x300_28_May_22.jpg", "publishedAt": "2022-05-29T21:29:23Z", "content": "Monkeypox is an infectious disease that is usually mild.\r\nThe World Health Organization said on Sunday that the sudden appearance of monkeypox at once in several countries where the disease is not ty… [+1017 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"It's A Shame, Teesta River Deal Stuck For 11 Years\": Bangladesh Minister", "description": "Dhaka and New Delhi are preparing for a bilateral Joint consultative commission between the Foreign Ministers from both the sides in June, which would clear the deck for a likely visit of Bangladesh Prime Minister Sheikh Hasina to India in July.", "url": "https://www.ndtv.com/india-news/bangladesh-minister-its-a-shame-teesta-river-deal-stuck-for-11-years-3020864", "urlToImage": "https://c.ndtvimg.com/2021-03/bvvk67ao_bangladesh-foreign-minister-ak-abdul-momen_625x300_26_March_21.jpg", "publishedAt": "2022-05-29T19:56:42Z", "content": "Unfortunate we could not get Teesta deal through for 11 years, said the Bangladesh minister (FILE)\r\nGuwahati: At a time when India is trying to give a fresh push to bilateral ties with Bangladesh, am… [+4155 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Discontent Brews In Congress Over Candidates For Rajya Sabha Polls", "description": "The Congress party has announced the names of 10 candidates for the Rajya Sabha elections in which the names of many prominent leaders are missing. In such a situation, voices of dissatisfaction are rising in the party.", "url": "https://www.ndtv.com/india-news/discontent-brews-in-congress-after-party-announces-10-candidates-for-rajya-sabha-polls-3020829", "urlToImage": "https://c.ndtvimg.com/2018-11/ceef17g8_congress-flag-generic-afp_625x300_06_November_18.jpg", "publishedAt": "2022-05-29T19:20:51Z", "content": "The party released the list of 10 candidates from seven states for the polls. (Representational)\r\nNew Delhi: The Congress party has announced the names of 10 candidates for the Rajya Sabha elections … [+2755 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Punjab's AAP Government Must Be Dismissed: Congress Over Singer's Killing", "description": "The Congress on Sunday sought the dismissal of the Aam Aadmi Party government in Punjab over the killing of popular Punjabi singer Sidhu Moose Wala, saying that it has lost the moral authority to govern.", "url": "https://www.ndtv.com/india-news/punjabs-aap-government-must-be-dismissed-congress-over-singers-killing-3020826", "urlToImage": "https://c.ndtvimg.com/2022-05/6ckhkhd4_sidhu-moose-wala_625x300_29_May_22.jpg", "publishedAt": "2022-05-29T19:18:33Z", "content": "Moose Wala, 27, was attacked when he was in his jeep at village Jawahar Ke and several bullets hit him.\r\nNew Delhi: The Congress on Sunday sought the dismissal of the Aam Aadmi Party government in Pu… [+2499 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Nadal To Face Djokovic In French Open Quarters After Epic Last-16 Win", "description": "Rafael Nadal set up a blockbuster French Open quarter-final against world number one Novak Djokovic on Sunday when he defeated Felix Auger-Aliassime in a five-set fourth round epic.", "url": "https://sports.ndtv.com/french-open-2022/rafael-nadal-to-face-novak-djokovic-in-french-open-quarters-after-epic-last-16-win-3020785", "urlToImage": "https://c.ndtvimg.com/2022-05/lt4jrso_rafael-nadal-afp_625x300_30_May_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-29T18:45:32Z", "content": "Rafael Nadal set up a blockbuster French Open quarter-final against world number one Novak Djokovic on Sunday when he defeated Felix Auger-Aliassime in a five-set fourth round epic. Nadal, the 13-tim… [+413 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Yuzvendra Chahal Wins IPL Purple Cap With Record-Breaking Performance", "description": "In the IPL final on Sunday, Yuzvendra Chahal took one wicket to take the outright lead in the Purple Cap race.", "url": "https://sports.ndtv.com/ipl-2022/purple-cap-updated-list-after-ipl-2022-final-yuzvendra-chahal-makes-ipl-history-3020777", "urlToImage": "https://c.ndtvimg.com/2022-05/svtk9tr_yuzvendra-chahal-bcciipl_625x300_30_May_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-29T18:36:50Z", "content": "Yuzvendra Chahal might not have ended up on the winners podium after Rajasthan Royals lost to Gujarat Titans in the IPL final but had a lot to be pleased about with his overall performance in the IPL… [+1426 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "At Least 44 Killed, 56 Missing After Heavy Rains In Northeastern Brazil", "description": "Torrential rains in northeastern Brazil have left at least 44 people dead and dozens missing, the government said Sunday, as rescuers capitalized on a lull in downpours to search for survivors.", "url": "https://www.ndtv.com/world-news/brazil-rains-at-least-44-killed-56-missing-after-heavy-rains-in-northeastern-brazil-3020762", "urlToImage": "https://c.ndtvimg.com/2022-05/74kfuh9s_brazil-rains-floods_625x300_29_May_22.jpg", "publishedAt": "2022-05-29T18:30:54Z", "content": "Brasilia: Torrential rains in northeastern Brazil have left at least 44 people dead and dozens missing, the government said Sunday, as rescuers capitalized on a lull in downpours to search for surviv… [+3090 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Hardik Pandya Leads Gujarat Titans To IPL Title In Debut Season", "description": "Gujarat Titans beat Rajasthan Royals by seven wickets in the IPL 2022 final to win the title in their debut season.", "url": "https://sports.ndtv.com/ipl-2022/gt-vs-rr-gujarat-titans-beat-rajasthan-royals-by-7-wickets-to-win-ipl-title-in-debut-season-3020759", "urlToImage": "https://c.ndtvimg.com/2022-05/jsbivrlg_gujarat-titans-bcciipl_625x300_29_May_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-29T18:28:59Z", "content": "Nobody gave them a chance but Gujarat Titans, bucking all pre-tournament predictions, surprised everyone by lifting the Indian Premier League title in a dream maiden season after a seven-wicket victo… [+4411 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "2 Indians Among 21 Elevated To Rank Of Cardinal By Pope Francis: Report", "description": "Two Indian churchmen were among 21 who will be elevated by Pope Francis to the rank of cardinal in a ceremony at the Vatican in August. The College of Cardinals currently consists of 208 Cardinals, of whom 117 are electors and 91 are non-electors.", "url": "https://www.ndtv.com/india-news/2-indians-among-21-elevated-to-rank-of-cardinal-by-pope-francis-3020751", "urlToImage": "https://c.ndtvimg.com/2022-01/ce8jvbso_pope-francis-reuters-650_625x300_01_January_22.jpg", "publishedAt": "2022-05-29T18:23:19Z", "content": "Eight of the newly named Cardinals are from Europe, 6 from Asia, 2 from Africa. (File)\r\nVatican City: Two Indian churchmen were among 21 who will be elevated by Pope Francis to the rank of cardinal i… [+1693 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "36 Years Later, 'Top Gun' Again Tops North America Box Office", "description": "Much-anticipated action film \"Top Gun: Maverick\" was expected to have a big opening and it did not disappoint, taking in an estimated $151 million in North America for the four-day Memorial Day weekend.", "url": "https://www.ndtv.com/world-news/tom-cruises-top-gun-tops-north-america-box-office-again-after-36-years-3020750", "urlToImage": "https://c.ndtvimg.com/2022-05/9pnm5a0g_top-gun_625x300_22_May_22.jpg", "publishedAt": "2022-05-29T18:22:49Z", "content": "Los Angeles: Much-anticipated action film \"Top Gun: Maverick\" was expected to have a big opening and it did not disappoint, taking in an estimated $151 million in North America for the four-day Memor… [+2319 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "PM Modi's Opinion Sought Globally On Various Issues: Amit Shah", "description": "Asserting that India is progressing in all spheres under Prime Minister Narendra Modi's leadership, Union Home Minister Amit Shah on Sunday said no discussion on the global platform is considered as complete unless Modi's opinion.", "url": "https://www.ndtv.com/india-news/pm-modis-opinion-sought-globally-on-various-issues-amit-shah-3020746", "urlToImage": "https://c.ndtvimg.com/2022-03/0ejuse4_amit-shah-pti_625x300_12_March_22.jpg", "publishedAt": "2022-05-29T18:17:41Z", "content": "Amit Shah said that sports complex at Naranpura in Ahmedabad will prepare students.\r\nAhmedabad: Asserting that India is progressing in all spheres under Prime Minister Narendra Modi's leadership, Uni… [+3209 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Pope Names 21 New Cardinals, Putting Stamp On Church's Future", "description": "Pope Francis announced on Sunday that he would appoint 21 new cardinals in August, including an Italian leading the Church in Mongolia, again putting his stamp on the future of Catholicism.", "url": "https://www.ndtv.com/world-news/pope-names-21-new-cardinals-putting-stamp-on-churchs-future-3020731", "urlToImage": "https://c.ndtvimg.com/2022-01/ce8jvbso_pope-francis-reuters-650_625x300_01_January_22.jpg", "publishedAt": "2022-05-29T18:14:29Z", "content": "Pope Francis announced on Sunday that he would appoint 21 new cardinals in August, including an Italian leading the Church in Mongolia, again putting his stamp on the future of Catholicism.\r\nOf the 2… [+2200 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ministry Asks Electricity Body To Fix Domestic Coal Quantity For Plants", "description": "The Power Ministry on Sunday directed the Central Electricity Authority of India to determine the eligible quantity of domestic coal for the power plants using coal under Shakti B(viii) (a).", "url": "https://www.ndtv.com/india-news/power-ministry-coal-power-plants-ministry-asks-electricity-body-to-fix-domestic-coal-quantity-for-plants-3020724", "urlToImage": "https://i.ndtvimg.com/i/2015-07/coal-generic_650x400_81435757462.jpg", "publishedAt": "2022-05-29T18:09:51Z", "content": "The Power Ministry asked the CEA to determine the eligible quantity of coal for plants.\r\nNew Delhi: The Power Ministry on Sunday directed the Central Electricity Authority of India to determine the e… [+1286 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Hardik Patel Denies Speculations Of Him Joining BJP Tomorrow", "description": "Former Congress leader Hardik Patel denied speculation that he will join the BJP on Monday, and took to Twitter to attack the Aam Aadmi Party (AAP) over the killing of popular Punjabi singer Sidhu Moosewala.", "url": "https://www.ndtv.com/india-news/hardik-patel-denies-speculations-of-him-joining-bjp-tomorrow-3020717", "urlToImage": "https://c.ndtvimg.com/2022-05/g5obbvl8_hardik-patel-pti_625x300_19_May_22.jpg", "publishedAt": "2022-05-29T18:07:50Z", "content": "Hardik Patel recently praised the BJP for its decision making leadership. (File)\r\nAhmedabad: Former Congress leader Hardik Patel denied speculation that he will join the BJP on Monday, and took to Tw… [+1693 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Centre's Policy In Kashmir Has Failed: Mehbooba Mufti", "description": "Peoples Democratic Party (PDP) chief Mehbooba Mufti on Sunday hit out at the BJP-led Central government, saying that it is 'scared' of the Gupkar alliance.", "url": "https://www.ndtv.com/india-news/centres-policy-in-kashmir-has-failed-mehbooba-mufti-3020572", "urlToImage": "https://c.ndtvimg.com/2022-05/b61e8t8o_mehbooba-mufti-ani-twitter_625x300_16_May_22.jpg", "publishedAt": "2022-05-29T18:06:24Z", "content": "Mehbooba Mufti hit out at the BJP-led Central government.\r\nSrinagar (Jammu and Kashmir): Peoples Democratic Party (PDP) chief Mehbooba Mufti on Sunday hit out at the BJP-led Central government, sayin… [+996 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Nitish Kumar's Party Names Khiru Mahto As Its Rajya Sabha Candidate", "description": "Janata Dal (United) has named its Jharkhand unit chief and former Member of Legislative Assembly(MLA) Khiru Mahto as the party's candidate from Bihar for Rajya Sabha elections, JD(U) national president Rajiv Ranjan Singh informed on Sunday.", "url": "https://www.ndtv.com/india-news/janata-dal-united-rajya-sabha-nitish-kumars-party-names-khiru-mahto-as-bihar-rajya-sabha-candidate-3020702", "urlToImage": "https://c.ndtvimg.com/2022-05/net5b8jg_mahto-rajya-sabha_625x300_29_May_22.jpg", "publishedAt": "2022-05-29T18:00:56Z", "content": "JD(U) has named Khiru Mahto as the party's candidate from Bihar for Rajya Sabha elections.\r\nPatna: Janata Dal (United) has named its Jharkhand unit chief and former Member of Legislative Assembly(MLA… [+1335 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "On Filling Tribal Posts, Summons To Maharashtra Chief Secretary", "description": "The National Commission for Scheduled Tribes (NCST) has issued summons to Maharashtra Chief Secretary Manu Kumar Srivastava, asking him to appear before it on June 1 in connection with a matter related to filling up vacancies for tribal people.", "url": "https://www.ndtv.com/india-news/on-filling-tribal-posts-summons-to-maharashtra-chief-secretary-3020300", "urlToImage": "https://c.ndtvimg.com/2022-05/h9t537f_national-commission-for-scheduled-tribes_625x300_29_May_22.jpg", "publishedAt": "2022-05-29T18:00:55Z", "content": "Mr Srivastava has been asked to appear before NCST member Ananta Nayak on June 1.\r\nNew Delhi: The National Commission for Scheduled Tribes (NCST) has issued summons to Maharashtra Chief Secretary Man… [+949 chars]"}]}