{"status": "ok", "totalResults": 559, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "BJP Retains Assam Seat Vacated By Minister Sarbananda Sonowal In Bypoll", "description": "The ruling BJP retained the Majuli assembly constituency with its candidate Bhuban Gam defeating the joint opposition candidate Chittaranjan Basumatary of the Assam Jatiya Parishad by 42,141 votes in a bypoll, election office sources said on Thursday", "url": "https://www.ndtv.com/india-news/majuli-bypoll-bjp-retains-assams-majuli-seat-vacated-by-minister-sarbananda-sonowal-in-bypoll-2815956", "urlToImage": "https://c.ndtvimg.com/2022-03/fj7egido_assam-polls-majuli-bypoll-2022-pti-650_625x300_11_March_22.jpg", "publishedAt": "2022-03-11T01:48:26Z", "content": "Majuli bypoll: Altogether 1,642 people have voted for the NOTA option. (File)\r\nGuwahati: The ruling BJP retained the Majuli (ST) assembly constituency with its candidate Bhuban Gam defeating the join… [+2598 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Iran Says US Making New Demands, Complicating Efforts To Restore Nuke Deal", "description": "Iran said on Thursday the United States has made extra demands and accused it of working to \"complicate\" efforts to restore a 2015 nuclear deal, after new Russian requests linked to the Ukraine war raised concerns of fresh delays.", "url": "https://www.ndtv.com/world-news/iran-says-us-making-new-demands-complicating-efforts-to-restore-nuke-deal-2816374", "urlToImage": "https://c.ndtvimg.com/2019-05/6c7epapg_iran-flag-reuters-650_625x300_20_May_19.jpg", "publishedAt": "2022-03-11T01:42:44Z", "content": "Iranian supreme leader said that his country will not give up on elements of national strength.\r\nTehran: Iran said on Thursday the United States has made extra demands and accused it of working to \"c… [+4513 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Edited by NDTV News Desk", "title": "Russia-Ukraine War Live: No Breakthrough In Talks As Attacks Continue", "description": "Russia and Ukraine failed to make a breakthrough in their first top-level talks since Moscow's invasion two weeks ago, as Russian advances sparked fears the Ukrainian capital Kyiv could soon be encircled.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-live-updates-no-breakthrough-in-talks-as-russian-forces-advance-on-kyiv-2816360", "urlToImage": "https://c.ndtvimg.com/2022-03/83q4ppg8_ukraine-war_625x300_11_March_22.jpg", "publishedAt": "2022-03-11T01:20:07Z", "content": "Russia and Ukraine failed to make a breakthrough Thursday in their first top-level talks since Moscow's invasion two weeks ago, as Russian advances sparked fears the Ukrainian capital Kyiv could soon… [+1260 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Live: India Logs 4,184 New Covid Cases, 104 Deaths In 24 Hours", "description": "India on Thursday reported at least 4,184 new COVID-19 cases, bringing the total number of coronavirus infections to 4,29,80,067.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-11-march-2022-2816352", "urlToImage": "https://c.ndtvimg.com/2022-01/fdhokfoo_-bengaluru-covid-testing-pti-650_650x400_03_January_22.jpg", "publishedAt": "2022-03-11T00:46:14Z", "content": "India Covid Cases: India also reported 104 Covid-related fatalities, taking the death tally to 5,15,459.\r\nNew Delhi: India on Thursday reported at least 4,184 new COVID-19 cases, bringing the total n… [+509 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Air India Flight Carrying Students Evacuated From Ukraine Lands In Delhi", "description": "An Air India flight from Poland's Rzeszow carrying students evacuated from northeastern Ukrainian city Sumy, landed in Delhi on Friday morning, officials said.", "url": "https://www.ndtv.com/india-news/air-india-flight-carrying-students-evacuated-from-ukrainian-city-sumy-lands-in-delhi-2816351", "urlToImage": "https://c.ndtvimg.com/2022-02/8c5o9hpg_air-india_625x300_26_February_22.jpg", "publishedAt": "2022-03-11T00:44:34Z", "content": "The flight had taken off from Poland around 11.30 pm (IST) on Thursday. (Representational image)\r\nNew Delhi: An Air India flight from Poland's Rzeszow carrying students evacuated from northeastern Uk… [+882 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Facebook Eases Rules To Allow Violent Speech Against Russian Forces", "description": "Facebook said Thursday that due to the invasion of Ukraine it has temporarily eased its rules regarding violent speech to allow statements like \"death to Russian invaders,\" but not credible threats against civilians.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-facebook-eases-rules-to-allow-violent-speech-against-russian-forces-2816347", "urlToImage": "https://c.ndtvimg.com/2022-03/3rsvi6o8_russia-ukraine-tank_625x300_02_March_22.jpg", "publishedAt": "2022-03-11T00:19:38Z", "content": "Washington: Facebook said Thursday that due to the invasion of Ukraine it has temporarily eased its rules regarding violent speech to allow statements like \"death to Russian invaders,\" but not credib… [+2718 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine President Accuses Russia Of \"Attack\" On Humanitarian Corridor", "description": "Ukraine's President Volodymyr Zelensky Thursday said around 100,000 people had evacuated the country's cities in two days, but accused Russian forces of targeting a humanitarian corridor in the city of Mariupol.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-russian-tanks-attacked-humanitarian-corridor-in-mariupol-ukraine-president-volodymyr-zelensky-2816343", "urlToImage": "https://c.ndtvimg.com/2022-02/2el7hq9o_russia-ukraine-war-afp-650_625x300_26_February_22.jpg", "publishedAt": "2022-03-10T23:54:56Z", "content": "Ukraine's President Volodymyr Zelensky said some 40,000 had fled on Thursday alone.\r\nKyiv: Ukraine's President Volodymyr Zelensky Thursday said around 100,000 people had evacuated the country's citie… [+1059 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Bolivian Soldier Who Killed Che Guevara Dies At 80", "description": "The former Bolivian soldier who claimed to have shot dead Marxist revolutionary hero Ernesto \"Che\" Guevara died on Thursday aged 80, his relatives said.", "url": "https://www.ndtv.com/world-news/bolivian-soldier-who-killed-che-guevara-dies-at-80-2816337", "urlToImage": "https://c.ndtvimg.com/2020-06/q0rjkalg_che-guevara_625x300_14_June_20.jpg", "publishedAt": "2022-03-10T23:35:46Z", "content": "Born in Rosario, Argentina, Guevara studied medicine and then traveled throughout Latin America.\r\nLa Paz, Bolivia: The former Bolivian soldier who claimed to have shot dead Marxist revolutionary hero… [+2349 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Says Ukraine Needs Surface-To-Air Missiles, Not Fighter Jets", "description": "The US State Department on Thursday ruled out proposals to send MiG fighter jets to Ukraine via an American base, saying Kyiv's efforts to repel the Russian invasion would be better served by the supply of ground-based weapons.", "url": "https://www.ndtv.com/world-news/us-says-ukraine-needs-surface-to-air-missiles-not-fighter-jets-2816335", "urlToImage": "https://c.ndtvimg.com/2022-03/2s2q32pg_ukraine-war-afp-650_625x300_08_March_22.jpg", "publishedAt": "2022-03-10T23:15:53Z", "content": "Washington said that it has no desire to get involved in the plan to send fighter jets to Ukraine.\r\nWashington: The US State Department on Thursday ruled out proposals to send MiG fighter jets to Ukr… [+2574 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Manipur Polls: BJP High Command Will Decide CM, Says State Party Chief", "description": "The next chief minister of Manipur will be decided together by the BJP parliamentary board along with the state unit, state party president A Sharda Devi said on Thursday.", "url": "https://www.ndtv.com/india-news/manipur-assembly-polls-bjp-high-command-will-decide-cm-says-state-party-chief-a-sharda-devi-2816330", "urlToImage": "https://c.ndtvimg.com/2019-10/3kdj2eig_pm-modi-at-delhi-bjp-office-_625x300_25_October_19.jpg", "publishedAt": "2022-03-10T22:50:45Z", "content": "BJP has crossed the majority mark with 32 seats in the 60-member state assembly.\r\nImphal: The next chief minister of Manipur will be decided together by the BJP parliamentary board along with the sta… [+2077 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Twitter Deletes Russian Embassy Tweet On Mariupol Hospital Attack", "description": "Twitter Inc has removed tweets from the Russian Embassy in the United Kingdom about the bombing of a children's hospital in Mariupol for breaking its rules against denying violent events, the company said on Thursday.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-twitter-deletes-russian-embassy-tweet-on-mariupol-hospital-attack-2816318", "urlToImage": "https://c.ndtvimg.com/2022-03/svvl2ei_mariupol-afp_625x300_10_March_22.jpg?im=FeatureCrop,algorithm=dnn,width=620,height=350", "publishedAt": "2022-03-10T22:13:42Z", "content": "Twitter said that tweet of the Russian Embassy in the UK was violation of its rules and policies.\r\nLondon: Twitter Inc has removed tweets from the Russian Embassy in the United Kingdom about the bomb… [+1393 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Serious Escalation\": US Says North Korea Testing New Ballistic Missile", "description": "Two recent missile tests conducted by North Korea were of a new intercontinental ballistic missile (ICBM) system, marking a \"serious escalation\" by Pyongyang that will be punished with fresh sanctions, a senior US official said Thursday", "url": "https://www.ndtv.com/world-news/serious-escalation-us-says-north-korea-testing-new-ballistic-missile-2816312", "urlToImage": "https://c.ndtvimg.com/2020-10/0fu8k4bo_kim-jong-un-650_625x300_14_October_20.jpg", "publishedAt": "2022-03-10T21:31:36Z", "content": "A fresh ICBM launch would be an early challenge for South Korea's new president-elect, Yoon. (File)\r\nWashington: Two recent missile tests conducted by North Korea were of a new intercontinental balli… [+3641 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine War May Cause To Cut Global Growth Forecast: IMF", "description": "The IMF expects to cut its global growth estimate due to the economic damage caused by Russia's invasion of Ukraine, Managing Director Kristalina Georgieva said Thursday.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-ukraine-war-may-cause-to-cut-global-growth-forecast-says-imf-2816306", "urlToImage": "https://c.ndtvimg.com/2022-03/8r3t9fc_ukraine-war_625x300_09_March_22.jpg", "publishedAt": "2022-03-10T21:14:00Z", "content": "Russia is \"moving into a deep recession,\" said IMF official.\r\nWashington: The IMF expects to cut its global growth estimate due to the economic damage caused by Russia's invasion of Ukraine, Managing… [+1198 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Joe Biden Hails Turkey's Effort To Mediate In Ukraine Crisis", "description": "Turkish President Recep Tayyip Erdogan on Thursday told US counterpart Joe Biden that mediating the Ukraine-Russia war was important to Ankara, after the two sides' top diplomats held talks in Turkey.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-us-president-joe-biden-hails-turkeys-effort-to-mediate-in-ukraine-crisis-2816296", "urlToImage": "https://c.ndtvimg.com/2021-10/pjo4vp2_joe-biden-meets-recep-tayyip-erdogan-_625x300_31_October_21.jpg", "publishedAt": "2022-03-10T20:42:49Z", "content": "Ankara has close ties with Moscow and Kyiv and hosted a meeting between both countries top ministers.\r\nAnkara: Turkish President Recep Tayyip Erdogan on Thursday told US counterpart Joe Biden that me… [+1859 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Moscow To Open Daily Humanitarian Corridors From Ukraine To Russia", "description": "Moscow said Thursday that it will open daily humanitarian corridors to evacuate civilians fleeing fighting in Ukraine to Russian territory, despite Kyiv insisting that no evacuation routes should lead to Russia.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-moscow-to-open-daily-humanitarian-corridors-from-ukraine-to-russia-2816273", "urlToImage": "https://c.ndtvimg.com/2022-03/rjck5pv8_ukraine-refugees-reuters_625x300_01_March_22.jpg", "publishedAt": "2022-03-10T20:06:10Z", "content": "Russian defence ministry claimed that Moscow had evacuated \"more than 187,000\" civilians to Russia.\r\nMoscow: Moscow said Thursday that it will open daily humanitarian corridors to evacuate civilians … [+1450 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "United Airlines Says Unvaccinated Employees Can Return to Work", "description": "United Airlines, one of the first American companies to have imposed a Covid-19 vaccine mandate for its staff, announced Thursday it will allow employees who have been granted an exemption to return to work.", "url": "https://www.ndtv.com/world-news/united-airlines-says-unvaccinated-employees-can-return-to-work-2816263", "urlToImage": "https://c.ndtvimg.com/2021-06/db9d8chk_united-airlines-afp-650_625x300_29_June_21.jpg", "publishedAt": "2022-03-10T19:43:24Z", "content": "United Airlines said that it will allow its unvaccnated employees to returen to work.\r\nNew York: United Airlines, one of the first American companies to have imposed a Covid-19 vaccine mandate for it… [+1574 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "PM Congratulates AAP For Historic Win In Punjab, Assures Centre's Support", "description": "As the Aam Aadmi Party (AAP) registered a historic win in Punjab Assembly polls by winning a three-fourths majority with 92 seats, Prime Minister Narendra Modi on Thursday congratulated the party and assured all possible support from the Centre.", "url": "https://www.ndtv.com/india-news/pm-narendra-modi-congratulates-aap-for-historic-win-in-punjab-2816244", "urlToImage": "https://c.ndtvimg.com/2022-02/nq7alts8_pm-modi-650_625x300_23_February_22.jpg", "publishedAt": "2022-03-10T19:05:44Z", "content": "\"I assure all possible support from the Centre for Punjab's welfare,\" PM Modi said in his tweet.\r\nNew Delhi: As the Aam Aadmi Party (AAP) registered a historic win in Punjab Assembly polls by winning… [+2045 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Women's WC, Pakistan vs South Africa: Live Cricket Score, Live Updates", "description": "ICC Women's World Cup, Pak-W vs SA-W Live: Pakistan face South Africa in their league stage match at Bay Oval in Mount Maunganui on Friday.", "url": "https://sports.ndtv.com/icc-women-s-world-cup-2022/icc-womens-world-cup-pakistan-women-vs-south-africa-women-live-cricket-score-live-updates-bay-oval-mount-maunganui-2816229", "urlToImage": "https://c.ndtvimg.com/2022-03/1sii5h1g_pakistan-afp_625x300_11_March_22.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-03-10T18:40:29Z", "content": "The ICC Women’s World Cup 2022 is up and running and we have witnessed some enthralling contests so far. We are now into match number 9 which sees South Africa Women take on Pakistan Women at the Bay… [+1902 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Says Mariupol Hospital Attack \"Staged\" By Ukraine", "description": "Russian defence ministry spokesman Igor Konashenkov has stated that the Mariupol hospital attack was staged by Ukraine.", "url": "https://www.ndtv.com/world-news/ukraine-russia-crisis-russia-says-mariupol-hospital-attack-staged-by-ukraine-2816202", "urlToImage": "https://c.ndtvimg.com/2022-03/6nljgh5g_igor-konashenkov-afp_625x300_10_March_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675?ver-20220310.01", "publishedAt": "2022-03-10T18:07:59Z", "content": "Igor Konashenkov has stated that the Mariupol hospital was staged by Ukraine.\r\nMoscow, Russia: The Russian army claimed Thursday that an attack on a children's hospital in the southeastern Ukrainian … [+718 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "ISIS Names New Chief, Confirms Predecessor's Death After February US Raid", "description": "The Islamic State jihadist group confirmed the death of its leader Abu Ibrahim al-Qurashi in a statement Thursday and named Abu Hasan al-Hashemi al-Qurashi as his replacement.", "url": "https://www.ndtv.com/world-news/isis-names-new-chief-abu-hasan-al-qurashi-confirms-death-of-abu-ibrahim-al-qurashi-predecessor-after-us-counterterror-op-2816187", "urlToImage": "https://c.ndtvimg.com/2022-02/daaf5phg_isis-chief-abu-bakr_625x300_03_February_22.jpg", "publishedAt": "2022-03-10T17:55:58Z", "content": "Abu Ibrahim al-Qurashi's death in February came two weeks after ISIS launched an attack in Syria.\r\nBeirut: The Islamic State jihadist group confirmed the death of its leader Abu Ibrahim al-Qurashi in… [+2969 chars]"}]}