{"status": "ok", "totalResults": 274, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE: India Records Nearly 3,000 New Covid Cases In 24 Hours", "description": "India reported at least 2,927 new coronavirus cases in the last 24 hours, taking the total number of infections to 4,30,65,496. According to the Union Health Ministry, the active cases increased to 16,279,", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-april-28-2927092", "urlToImage": "https://c.ndtvimg.com/2022-04/iptdjlsg_coronavirus-india-pti-pic_650x400_20_April_22.jpg", "publishedAt": "2022-04-28T00:15:06Z", "content": "India COVID-19 Live: India reported 32 deaths on Wednesday.\r\nIndia reported at least 2,927 new coronavirus cases in the last 24 hours, taking the total number of infections to 4,30,65,496. According … [+441 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "India Developed Ties With Russia As US Couldn't Do It Earlier: Blinken", "description": "Asserting that now there is a growing strategic convergence between the United States and India, Secretary of State Antony Blinken said New Delhi built its partnership with Moscow out of necessity as the US was not in a position to do that earlier.", "url": "https://www.ndtv.com/world-news/india-developed-ties-with-russia-as-us-couldnt-do-it-earlier-antony-blinken-2927089", "urlToImage": "https://c.ndtvimg.com/2022-04/j1j3oje_antony-blinken-afp_625x300_12_April_22.jpg", "publishedAt": "2022-04-28T00:02:33Z", "content": "Blinken said US President Biden has spent a lot of time directly engaging with PM Modi.\r\nWashington: Asserting that now there is a growing strategic convergence between the United States and India, S… [+2110 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Goa Urges Citizens To Continue Wearing Masks As Covid Cases Rise", "description": "In wake of rising cases of COVID-19, the Goa government on Wednesday advised citizens to continue wearing masks and follow Covid appropriate behaviour.", "url": "https://www.ndtv.com/india-news/goa-urges-citizens-to-continue-wearing-masks-as-covid-cases-rise-2927082", "urlToImage": "https://c.ndtvimg.com/2022-01/t7hsfnbo_covid-masks_625x300_06_January_22.jpg", "publishedAt": "2022-04-27T23:46:45Z", "content": "Goa COVID-19: So far 3,832 people have died due to coronaviru in Goa.\r\nPanaji: In wake of rising cases of COVID-19, the Goa government on Wednesday advised citizens to continue wearing masks and foll… [+1759 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Congress Leader Seeks Clear Definition Of Uniform Civil Code From Centre", "description": "Amid the debate over Uniform Civil Code (UCC) in the country, Senior Congress leader and former union minister Salman Khurshid on Wednesday said the government should clearly give the definition of UCC.", "url": "https://www.ndtv.com/india-news/congress-leader-salman-khurshid-seeks-clear-definition-of-uniform-civil-code-from-centre-2927063", "urlToImage": "https://c.ndtvimg.com/2019-06/pfkj2d6_salman-khurshid-pti_625x300_03_June_19.jpg", "publishedAt": "2022-04-27T23:16:33Z", "content": "\"They should tell what is the definition of Uniform Civil Code then only we can react,\" Mr Khurshid said.\r\nNew Delhi: Amid the debate over Uniform Civil Code (UCC) in the country, Senior Congress lea… [+3018 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia's Invasion In Ukraine Is \"Genocide\", Canada's Parliament Votes", "description": "Canadian lawmakers voted unanimously on Wednesday to call Russia's attacks in Ukraine a \"genocide\", with members of parliament saying there was \"ample evidence of systemic and massive war crimes against humanity\" being committed by Moscow.", "url": "https://www.ndtv.com/world-news/russias-invasion-in-ukraine-is-genocide-canadas-parliament-votes-2927058", "urlToImage": "https://c.ndtvimg.com/2020-05/n7dooq1_canada-parliament-goes-virtual_625x300_17_May_20.jpg", "publishedAt": "2022-04-27T22:44:28Z", "content": "Earlier this month, Canadian PM Trudeau termed Russian assault in Ukraine a \"Genocide.\"\r\nOttawa: Canadian lawmakers voted unanimously on Wednesday to call Russia's attacks in Ukraine a \"genocide\", wi… [+1780 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Central African Republic Adopts Bitcoin As An Official Currency", "description": "Central African Republic has adopted bitcoin as an official currency, the presidency said on Wednesday, becoming the first country in Africa and only the second in the world to do so.", "url": "https://www.ndtv.com/world-news/central-african-republic-adopts-bitcoin-as-an-official-currency-2927051", "urlToImage": "https://c.ndtvimg.com/2022-04/gh7c2if_bitcoin_625x300_19_April_22.jpg", "publishedAt": "2022-04-27T22:20:26Z", "content": "A bill governing the use of cryptocurrency was adopted unanimously by parliament last week.\r\nBangui: Central African Republic has adopted bitcoin as an official currency, the presidency said on Wedne… [+2071 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Scrap Cess So We Can Give Petrol At Rs 70: Telangana Minister To Centre", "description": "Lashing out at the Centre for asking the States to reduce VAT (value-added tax) on fuel, Telangana Industry and Commerce Minister KT Rama Rao on Wednesday demanded the central government to scrap the Cess on petrol and diesel across the country.", "url": "https://www.ndtv.com/india-news/scrap-cess-so-we-can-give-petrol-at-rs-70-telangana-minister-kt-rama-rao-to-centre-2927044", "urlToImage": "https://c.ndtvimg.com/2020-04/fvsfsat_kt-rama-rao_650x400_07_April_20.jpg", "publishedAt": "2022-04-27T21:59:40Z", "content": "Fuel prices have shot up because of NPA (non-performing asset) Central government, said Telangana's KTR.\r\nHyderabad: Lashing out at the Centre for asking the States to reduce VAT (value-added tax) on… [+2452 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Launched Hundreds Of Cyberattacks Against Ukraine, Microsoft Claims", "description": "A handful of hacker groups aligned with the Russian government have carried out hundreds of cyberattacks against Ukraine since Moscow invaded, US tech giant Microsoft said in a report Wednesday.", "url": "https://www.ndtv.com/world-news/russia-launched-hundreds-of-cyberattacks-against-ukraine-microsoft-says-2927043", "urlToImage": "https://c.ndtvimg.com/2021-03/e3bu6b4_microsoft-650_625x300_23_March_21.jpeg", "publishedAt": "2022-04-27T21:35:24Z", "content": "Microsoft's report says that Russia often matches cyberattacks with military assaults on the battlefield.\r\nWashington: A handful of hacker groups aligned with the Russian government have carried out … [+2355 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Zelensky Welcomes EU Plans To Suspend Import Duties On Ukrainian Exports", "description": "Ukrainian President Volodymyr Zelensky on Wednesday welcomed EU plans to suspend import duties on Ukrainian goods, saying the move will help \"maintain\" Kyiv's economy, hard-hit by Russia's devastating invasion.", "url": "https://www.ndtv.com/world-news/russia-ukraine-crisis-volodymyr-zelensky-welcomes-eu-plans-to-suspend-import-duties-on-ukrainian-exports-2927030", "urlToImage": "https://c.ndtvimg.com/2022-04/o6tn4et4_ukrainian-president-volodymyr-zelensky_625x300_02_April_22.jpg", "publishedAt": "2022-04-27T21:15:03Z", "content": "The Ukrainian leader said he expected more countries to liberalise Ukrainian exports \"soon\".\r\nKyiv: Ukrainian President Volodymyr Zelensky on Wednesday welcomed EU plans to suspend import duties on U… [+1541 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Israeli Forces Kill Palestinian In Latest West Bank Raid", "description": "Israeli forces killed a Palestinian man in the West Bank flashpoint city of Jenin Wednesday, in what the army called its latest \"counterterrorism\" raid following a series of attacks in Israel since late March.", "url": "https://www.ndtv.com/world-news/israeli-forces-kill-palestinian-in-latest-west-bank-raid-2927027", "urlToImage": "https://i.ndtvimg.com/i/2017-12/west-bank-afp_650x400_81512735889.jpg", "publishedAt": "2022-04-27T20:57:28Z", "content": "The Israeli army said 12 people were arrested in the overnight raids at several West Bank locations.\r\nJenin, Palestine: Israeli forces killed a Palestinian man in the West Bank flashpoint city of Jen… [+4401 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Centre Earned Rs 26 Lakh Crore From Excise Duty In 8 Years: Ashok Gehlot", "description": "As PM Narendra Modi flagged higher fuel prices in many opposition-ruled states including Rajasthan, CM Ashok Gehlot said the PM \"by mistake instead of saying Bhopal, mentioned Jaipur\" as petrol and diesel cost more in BJP-ruled Madhya Pradesh.", "url": "https://www.ndtv.com/india-news/fuel-prices-centre-earned-about-26-lakh-crore-by-taxing-petrol-diesel-ashok-gehlot-2927018", "urlToImage": "https://c.ndtvimg.com/2019-07/p3aujdu8_ashok-gehlot-pti_625x300_10_July_19.jpg", "publishedAt": "2022-04-27T20:40:04Z", "content": "Ashok Gehlot claimed the Centre has earned about Rs 26 lakh crore from excise duty in 8 years.\r\nJaipur: As Prime Minister Narendra Modi flagged higher fuel prices in many opposition-ruled states incl… [+4089 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine Plans To Rename Streets, Squares Linked To Russia Amid War", "description": "A number of Ukrainian cities plan to rename streets and squares associated with Russia under a process of \"derussification\" following Moscow's invasion.", "url": "https://www.ndtv.com/world-news/ukraine-plans-to-rename-streets-squares-linked-to-russia-amid-war-2926987", "urlToImage": "https://c.ndtvimg.com/2022-04/203kq84k_ukraine-reuters_625x300_13_April_22.jpg", "publishedAt": "2022-04-27T20:03:40Z", "content": "Cities and towns in Ukraine's north have started the process of renaming streets linked to Russia.\r\nKyiv: A number of Ukrainian cities plan to rename streets and squares associated with Russia under … [+2052 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Poland, Bulgaria Get Gas From EU Neighbours After Russia Halt", "description": "Poland and Bulgaria are now receiving gas from their EU neighbours after Russia's state energy giant Gazprom turned off the taps, European Commission head Ursula von der Leyen said Wednesday.", "url": "https://www.ndtv.com/world-news/poland-bulgaria-get-gas-from-eu-neighbours-after-russia-halt-2926979", "urlToImage": "https://c.ndtvimg.com/2018-11/11mvgsl8_gas-pipeline-generic_625x300_07_November_18.jpg", "publishedAt": "2022-04-27T19:48:03Z", "content": "Russia had announced the halt of gas to both Poland and Bulgaria after not receiving payment in ruble.\r\nBrussels: Poland and Bulgaria are now receiving gas from their EU neighbours after Russia's sta… [+1327 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Prince Andrew Loses \"Freedom Of The City Of York\" Title In Crunch Vote", "description": "Prince Andrew was on Wednesday stripped of his status as a freeman of the city of York because of his associations with convicted sex offenders Jeffrey Epstein and Ghislaine Maxwell.", "url": "https://www.ndtv.com/world-news/prince-andrew-loses-freedom-of-the-city-of-york-title-in-crunch-vote-2926955", "urlToImage": "https://c.ndtvimg.com/2021-10/6r6jklj8_prince-andrew-reuters_625x300_07_October_21.jpg", "publishedAt": "2022-04-27T19:17:12Z", "content": "Prince Andrew was conferred with \" Freedom Of The City Of York\" in 1987.\r\nYork, UK: Prince Andrew was on Wednesday stripped of his status as a freeman of the city of York because of his associations … [+2360 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine Warns Of \"Major Destruction\" As Russian Offensive Intensifies", "description": "Ukraine's Defence Minister Oleksiy Reznikov on Wednesday said Kyiv faced \"extremely difficult weeks\" ahead, warning of major \"destruction\" in a developing Russian offensive in the east of the country.", "url": "https://www.ndtv.com/world-news/ukraine-warns-of-major-destruction-as-russian-offensive-intensifies-2926925", "urlToImage": "https://c.ndtvimg.com/2022-03/a2ukbeio_ukraine-war-afp-240_625x300_24_March_22.jpg", "publishedAt": "2022-04-27T18:53:42Z", "content": "\"Some extremely difficult weeks lie ahead,\" Ukraine Defence Minister said in a statement on Facebook.\r\nKyiv: Ukraine's Defence Minister Oleksiy Reznikov on Wednesday said Kyiv faced \"extremely diffic… [+974 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Rashid And Tewatia Power GT's Great Win, SRH Lose Despite Malik Heroics", "description": "The BCCI, nevertheless, will have again taken serious note of the man from Jammu, who, in one of the best ever exhibitions of fast bowling, finished with incredible figures of 5/25, four of which were bowled.", "url": "https://sports.ndtv.com/ipl-2022/ipl-2022-rashid-khan-and-rahul-tewatia-power-gts-stunning-win-srh-lose-despite-umran-malik-heroics-2926892", "urlToImage": "https://c.ndtvimg.com/2022-04/hg0ifdqg_rahul-tewatia-rashid-khan-bcciipl_625x300_28_April_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-04-27T18:33:10Z", "content": "All eyes were on Sunrisers Hyderabad's Umran Malik, but all they could see was a blur. But still, Gujarat Titans had the last laugh as they prised out a five-wicket win in their thrilling IPL match h… [+3777 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "ONGC Recruitment 2022: Apply For 3614 Apprentice Jobs, Check Details Here", "description": "The Oil and Natural Gas Corporation Limited (ONGC) has invited applications for 3614 apprentice vacancies.", "url": "https://www.ndtv.com/jobs/ongc-recruitment-2022-apply-for-3614-apprentice-jobs-check-details-here-2926242", "urlToImage": "https://c.ndtvimg.com/2022-03/eqnlfo_ongc-videsh_625x300_29_March_22.jpg", "publishedAt": "2022-04-27T18:21:53Z", "content": "ONGC recruitment 2022: The the last date to submit the application is May 15\r\nONGC recruitment 2022: The Oil and Natural Gas Corporation Limited (ONGC) has invited applications for 3614 apprentice va… [+1890 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Rashid Khan Hits 3 Sixes Off 4 Balls In Last Over To Help Titans Beat SRH", "description": "Here's the details of how Rashid Khan and Rahul Tewatia helped Gujarat Titans score 22 off the last over to defeat SunRisers Hyderabad in an IPL 2022 match", "url": "https://sports.ndtv.com/ipl-2022/gt-vs-srh-ipl-2022-rashid-khan-hits-three-sixes-off-four-balls-in-last-over-to-help-gujarat-titans-beat-sunrisers-hyderabad-2926858", "urlToImage": "https://c.ndtvimg.com/2022-04/qnfdpu8_rashid-khan-bcciipl_625x300_27_April_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-04-27T18:16:56Z", "content": "Rashid Khan saved his best for the last over on Wednesday. Chasing 196 against SunRisers Hyderabad (SRH), the odds were heavily stacked against Gujarat Titans as they needed 22 off the last six balls… [+1437 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Maximum Temperature Breaches 40 Degrees In Odisha Amid Heatwave", "description": "Odisha sweltered in the blazing sun on Wednesday as a searing heatwave engulfed parts of the state for the third successive day and the maximum temperature breached the 40 degrees Celsius-mark in 24 places, the Met office said.", "url": "https://www.ndtv.com/india-news/odisha-weather-odisha-heatwave-maximum-temperature-breaches-40-degrees-in-odisha-amid-heatwave-2926366", "urlToImage": "https://c.ndtvimg.com/2019-06/rs2hk9do_india-heatwave-afp_625x300_03_June_19.jpg", "publishedAt": "2022-04-27T18:07:08Z", "content": "Odisha Weather: The mercury shot up to 43 degrees Celsius or more in 11 weather stations.\r\nBhubaneswar: Odisha sweltered in the blazing sun on Wednesday as a searing heatwave engulfed parts of the st… [+1839 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Cyber Fraud Of Rs 3,000 Crores Busted In UP: How It Is Linked To China", "description": "With the arrest of one person from Noida, the Cyber Cell of Uttar Pradesh police on Wednesday claimed to have busted an online fraud nexus worth Rs 3,000 crore with links in China.", "url": "https://www.ndtv.com/india-news/online-fraud-worth-rs-3-000-cr-with-china-links-busted-1-held-up-cyber-cell-2926439", "urlToImage": "https://i.ndtvimg.com/i/2017-09/cyber-crime-generic-istock_650x400_81504427706.jpg", "publishedAt": "2022-04-27T18:05:11Z", "content": "The accused has been identified as a native of West Bengal, police said. (Representational)\r\nNoida: With the arrest of one person from Noida, the Cyber Cell of Uttar Pradesh police on Wednesday claim… [+1240 chars]"}]}