{"status": "ok", "totalResults": 298, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rain Lashes Parts Of Andhra Pradesh's Kakinada As Cyclone Asani Nears", "description": "As cyclone Asani approaches the Andhra coastline, rain lashed parts of Andhra Pradesh's Kakinada district this morning.", "url": "https://www.ndtv.com/andhra-pradesh-news/rain-lashes-parts-of-andhra-pradeshs-kakinada-as-cyclone-asani-nears-2964574", "urlToImage": "https://c.ndtvimg.com/2022-05/vt714lkc_cyclone-asani-ani_625x300_11_May_22.jpg", "publishedAt": "2022-05-11T02:35:26Z", "content": "Cyclone Asani has changed direction and is going to touch the Kakinada coast in Andhra Pradesh\r\nKakinada, Andhra Pradesh: As cyclone Asani approaches the Andhra coastline, rain lashed parts of Andhra… [+2194 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Barcelona Win Overshadowed By Ronald Araujo Injury", "description": "Pierre-Emerick Aubameyang scored twice as Barcelona tightened their grip on second place in La Liga on Tuesday with a 3-1 win at home to Celta Vigo", "url": "https://sports.ndtv.com/football/barcelona-win-overshadowed-by-ronald-araujo-injury-2964622", "urlToImage": "https://c.ndtvimg.com/2022-05/cnhsufqg_barcelona-afp_625x300_11_May_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-11T02:34:59Z", "content": "Pierre-Emerick Aubameyang scored twice as Barcelona tightened their grip on second place in La Liga on Tuesday with a 3-1 win at home to Celta Vigo. But Barca's victory was overshadowed by a nasty he… [+3730 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "New Zealand To Fully Reopen International Borders From July-End", "description": "New Zealand PM Jacinda Ardern said today that the country will fully reopen its international borders from 11:59 pm on July 31, also welcoming cruise ships back on local ports.", "url": "https://www.ndtv.com/world-news/new-zealand-to-fully-reopen-international-borders-from-july-end-2964614", "urlToImage": "https://c.ndtvimg.com/2022-05/2trnlk28_new-zealand-borders-opened-reuters_625x300_02_May_22.jpg", "publishedAt": "2022-05-11T02:21:55Z", "content": "We are building on our proven plan to secure New Zealand's economic future: PM Jacinda Ardern\r\nWellington, New Zealand: New Zealand Prime Minister Jacinda Ardern said today the country will fully reo… [+709 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Man Who Allegedly Helped Punjab Rocket Grenade Attackers Detained", "description": "A man who gave logistics support to some suspects who fired a rocket-propelled grenade, or RPG, at an intelligence headquarters in Punjab's Mohali has been detained by the state police.", "url": "https://www.ndtv.com/india-news/man-who-allegedly-helped-punjab-rocket-grenade-attackers-detained-cops-2964593", "urlToImage": "https://c.ndtvimg.com/2022-05/nvdqten8_punjab-detain-rpg_625x300_11_May_22.jpg", "publishedAt": "2022-05-11T01:45:41Z", "content": "Punjab RPG attack: Nishan Singh, a resident of Faridkot, has been detained\r\nNew Delhi: A man who gave logistics support to some suspects who fired a rocket-propelled grenade, or RPG, at an intelligen… [+1770 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "On Certifying Future \"Flying Taxi\" Pilots, US Regulator Shifts Gears", "description": "The Federal Aviation Administration (FAA) said it had shifted course on its approach to approving pilots of future electric vertical takeoff and landing aircraft (eVTOL) but does not expect it would delay certification or operational approvals.", "url": "https://www.ndtv.com/world-news/on-certifying-future-flying-taxi-pilots-us-regulator-shifts-gears-2964583", "urlToImage": "https://c.ndtvimg.com/2022-05/ea7nri9o_flying-taxi_625x300_11_May_22.jpg", "publishedAt": "2022-05-11T01:28:09Z", "content": "The eVTOL aircraft have been touted as air taxis that could be the future of urban air mobility.\r\nWashington: The Federal Aviation Administration (FAA) said Tuesday it had shifted course on its appro… [+2245 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Microsoft Co-Founder Bill Gates Tests Positive For Covid-19", "description": "Microsoft co-founder Bill Gates said Tuesday that he has tested positive for Covid-19 and is experiencing mild symptoms.", "url": "https://www.ndtv.com/world-news/microsoft-co-founder-bill-gates-tests-positive-for-covid-19-2964582", "urlToImage": "https://c.ndtvimg.com/2021-11/r1mnr984_bill-gates-bloomberg_625x300_08_November_21.jpg", "publishedAt": "2022-05-11T01:21:27Z", "content": "Bill Gates tweeted that he was isolating himself until he is healthy again. (File)\r\nSeattle: Microsoft co-founder Bill Gates said Tuesday that he has tested positive for Covid-19 and is experiencing … [+868 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE: India Reports Over 2,000 New COVID-19 Cases In 24 Hours", "description": "India reported at least 2,288 new coronavirus infections in the last 24 hours, taking the total tally of COVID-19 cases to 4,31,07,689, while the active cases dipped to 19,637, according to the Union Health Ministry data updated.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-india-covid-cases-may-11-2964561", "urlToImage": "https://c.ndtvimg.com/2022-01/qrkq57t_coronavirus-india-generic-hospital-generic-covid-hospital-reuters-650_625x300_10_January_22.jpg", "publishedAt": "2022-05-11T00:31:35Z", "content": "India Covid Live: The death count climbed to 5,24,103 with 10 fresh fatalities on Tuesday.\r\nNew Delhi: India reported at least 2,288 new coronavirus infections in the last 24 hours, taking the total … [+600 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Pak President Calls For Probe Into Alleged Regime Change \"Conspiracy\"", "description": "President Dr Arif Alvi on Tuesday called for a thorough probe into the alleged regime change conspiracy by ousted Prime Minister Imran Khan.", "url": "https://www.ndtv.com/world-news/pak-president-calls-for-probe-into-alleged-regime-change-conspiracy-2964556", "urlToImage": "https://c.ndtvimg.com/2019-08/ia06oug_pakistan-president-arif-alvi_625x300_14_August_19.jpg", "publishedAt": "2022-05-11T00:09:04Z", "content": "Pakistan President also informed PM Shehbaz Sharif and Chief Justice of Pakistan regarding the matter.\r\nIslamabad: President Dr Arif Alvi on Tuesday called for a thorough probe into the alleged regim… [+2876 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Fire Breaks Out At Factory In Delhi, No Casualties Reported", "description": "A fire that broke out in a speaker manufacturing factory in Wazirpur Industrial Area in New Delhi has been doused, said Ram Gopal Meena, Station Officer, Fire Department.", "url": "https://www.ndtv.com/india-news/fire-breaks-out-at-factory-in-delhis-wazirpur-industrial-area-no-casualties-reported-2964549", "urlToImage": "https://i.ndtvimg.com/i/2017-07/fire-generic-istock_650x400_51500191995.jpg", "publishedAt": "2022-05-10T23:47:41Z", "content": "Delhi Fire: No casualty has been reported in the incident, the fire department said. (Representational)\r\nNew Delhi: A fire that broke out in a speaker manufacturing factory in Wazirpur Industrial Are… [+315 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Intelligence Says India-China Relations Will \"Remain Strained\"", "description": "The ties between India and China will \"remain strained\" in the wake of the \"lethal clash\" in 2020, the US intelligence community has told lawmakers as it also expressed concerns over any potential crisis between India and Pakistan.", "url": "https://www.ndtv.com/world-news/us-intelligence-says-india-china-relations-will-remain-strained-2964540", "urlToImage": "https://i.ndtvimg.com/i/2016-10/china-india-flags-reuters_650x400_71476070351.jpg", "publishedAt": "2022-05-10T23:32:19Z", "content": "India and China have held 15 rounds of military talks so far to resolve the eastern Ladakh row.\r\nWashington: The ties between India and China will \"remain strained\" in the wake of the \"lethal clash\" … [+2345 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sri Lankan Army Denies Reports Troops Ordered To Shoot At Protesters", "description": "Sri Lankan Chief of Defence Staff and Commander of the Army, General Shavendra Silva on Tuesday refuted allegations that the armed forces are poised to shoot at the general public to provoke them.", "url": "https://www.ndtv.com/world-news/sri-lankan-army-denies-troops-ordered-to-shoot-at-protestors-2964529", "urlToImage": "https://c.ndtvimg.com/2022-05/mq0faet8_sri-lanka-_625x300_09_May_22.jpg", "publishedAt": "2022-05-10T23:12:28Z", "content": "Anti-government protesters also set on fire the official residences of Rajapaksa government.\r\nColombo: Sri Lankan Chief of Defence Staff and Commander of the Army, General Shavendra Silva on Tuesday … [+2105 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Amid Bad Weather, Over 80,000 Pilgrims Visit Kedarnath Dham On 5th Day", "description": "On the fifth day of the opening of the doors of Kedarnath Dham, more than 80,000 pilgrims visited Kedarnath Dham and took darshan of Lord Kedarnath.", "url": "https://www.ndtv.com/india-news/uttarakhand-over-80-000-pilgrims-visit-kedarnath-dham-on-5th-day-2964516", "urlToImage": "https://c.ndtvimg.com/2022-05/q19gin7_kedarnath_625x300_06_May_22.jpg", "publishedAt": "2022-05-10T22:44:07Z", "content": "Authorities said that passengers are stopped at Sonprayag due to bad weather. (File)\r\nDehradun: On the fifth day of the opening of the doors of Kedarnath Dham, more than 80,000 pilgrims visited Kedar… [+722 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Man Killed In Celebratory Firing At Wedding In UP, 2 Arrested: Police", "description": "The police have arrested two men after a person was killed and his minor son injured in a celebratory firing during a wedding here, police said on Tuesday.", "url": "https://www.ndtv.com/india-news/man-killed-in-celebratory-firing-at-wedding-in-up-2-arrested-police-2964509", "urlToImage": "https://c.ndtvimg.com/2018-10/2j46hlug_police-generic_625x300_27_October_18.jpg", "publishedAt": "2022-05-10T22:24:19Z", "content": "Police said that case been registered following the incident. (Representational)\r\nMuzaffarnagar: The police have arrested two men after a person was killed and his minor son injured in a celebratory … [+599 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Mumbai Airport Completes Runway Maintenance Work Ahead Of Monsoon", "description": "Adani Group-owned Mumbai international airport said on Tuesday it has completed the runway repair and maintenance work ahead of the monsoon season, an exercise which necessitated rescheduling of 150 flights.", "url": "https://www.ndtv.com/india-news/adani-owned-mumbai-airport-completes-runway-maintenance-work-ahead-of-monsoon-2964498", "urlToImage": "https://i.ndtvimg.com/i/2017-09/mumbai-airport-midday_650x400_51505056822.jpg", "publishedAt": "2022-05-10T21:44:59Z", "content": "The Chhatrapati Shivaji Maharaj International Airport has two intersecting runways.\r\nMumbai: Adani Group-owned Mumbai international airport said on Tuesday it has completed the runway repair and main… [+1475 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Mumbai Man Arrested For Beating His Neighbour To Death", "description": "A man was arrested in Nehru Nagar area of Mumbai's Kurla suburb for allegedly killing his neighbour over an old rivalry, a police official said on Tuesday.", "url": "https://www.ndtv.com/india-news/mumbai-man-arrested-for-beating-his-neighbour-to-death-2964497", "urlToImage": "https://i.ndtvimg.com/i/2016-05/arrest-generic_650x400_71463458726.jpg", "publishedAt": "2022-05-10T21:25:23Z", "content": "Victim's mother had earlier filed a molestation case against accused, police said.\r\nMumbai: A man was arrested in Nehru Nagar area of Mumbai's Kurla suburb for allegedly killing his neighbour over an… [+385 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "BJP Leader Says Ready To Welcome Raj Thackeray In Ayodhya", "description": "BJP MP Lallu Singh Tuesday said he will welcome and is ready to play a host to MNS chief Raj Thackeray during his proposed Ayodhya visit next month, even as ruling party lawmaker Brij Bhushan Sharan Singh opposed the Maharashtra leader's trip.", "url": "https://www.ndtv.com/india-news/bjp-leader-lallu-singh-says-ready-to-welcome-raj-thackeray-in-ayodhya-2964494", "urlToImage": "https://c.ndtvimg.com/2022-05/2o7ku7fg_raj-thackeray-ani-pic_650x400_04_May_22.jpg", "publishedAt": "2022-05-10T21:09:56Z", "content": "The MNS chief Raj Thackeray announced to visit Ayodhya on June 5 with his supporters.\r\nAyodhya: BJP MP Lallu Singh Tuesday said he will welcome and is ready to play a host to MNS chief Raj Thackeray … [+1228 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UN To Discuss On Taliban's New Hijab Rules For Afghan Women", "description": "The UN Security Council will meet on Thursday to discuss an order by Afghanistan's Taliban for women to cover their faces in public, a return to a signature policy of the Islamist group's past hardline rule and an escalation of restrictions.", "url": "https://www.ndtv.com/world-news/un-to-discuss-taliban-ordering-afghan-women-to-cover-faces-in-public-2964487", "urlToImage": "https://c.ndtvimg.com/2021-09/ev8j2gb_afghan-womenheratreuters_625x300_12_September_21.jpg", "publishedAt": "2022-05-10T20:50:04Z", "content": "Most women in Afghanistan wear a headscarf for religious reasons.\r\nUnited Nations: The United Nations Security Council will meet on Thursday to discuss an order by Afghanistan's Taliban for women to … [+1277 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine's First Post-Soviet President Dies At 88", "description": "Leonid Kravchuk, a former communist who helped signed the Soviet Union's death warrant and then served as the first president of independent Ukraine, has died at the age of 88, a senior official said on Tuesday.", "url": "https://www.ndtv.com/world-news/ukraines-first-president-leonid-kravchuk-who-fought-against-soviet-coup-dies-at-88-2964463", "urlToImage": "https://c.ndtvimg.com/2022-05/l51cc9ho_-leonid-kravchuk-_625x300_11_May_22.jpg", "publishedAt": "2022-05-10T20:27:34Z", "content": "\"Kravchuk was a wise patriot of Ukraine,\" President Zelensky's office said in a statement.\r\nKyiv: Leonid Kravchuk, a former communist who helped signed the Soviet Union's death warrant and then serve… [+2402 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sri Lanka Crisis: Shoot-At-Sight Orders As Protest Intensifies", "description": "Sri Lankan authorities issued shoot-on-sight orders on Tuesday to quell unrest that has seen buildings and vehicles set ablaze a day after the island was rocked by deadly violence and rioting.", "url": "https://www.ndtv.com/world-news/sri-lanka-crisis-shoot-at-sight-orders-as-protest-intensifies-2964450", "urlToImage": "https://c.ndtvimg.com/2022-05/u6bf045c_sri-lanka-protests-afp_625x300_09_May_22.jpg", "publishedAt": "2022-05-10T20:12:06Z", "content": "Sri Lanka Crisis: Police said at least 8 people killed on Tuesday.\r\nColombo: Sri Lankan authorities issued shoot-on-sight orders on Tuesday to quell unrest that has seen buildings and vehicles set ab… [+5211 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US House Set To Approve $40 Billion Ukraine Aid Package", "description": "The U.S. House of Representatives will vote on a $40 billion military and humanitarian aid package for Ukraine on Tuesday night, House Speaker Nancy Pelosi said.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-us-house-set-to-approve-40-billion-ukraine-aid-package-2964442", "urlToImage": "https://c.ndtvimg.com/2022-04/26bfedsk_kyiv-reuters_625x300_28_April_22.jpg", "publishedAt": "2022-05-10T19:51:48Z", "content": "Ukraine war: Earlier, Biden Signed a bill to speed up US weapons deliveries to Ukraine against Russia.\r\nWashington: The U.S. House of Representatives will vote on a $40 billion military and humanitar… [+1015 chars]"}]}