{"status": "ok", "totalResults": 469, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Orders Non-Essential Staff To Leave China's Shanghai Amid Covid Spike", "description": "The United States has ordered all non-essential employees at its Shanghai consulate to leave over concerns about their safety, an embassy spokesperson said in a statement Tuesday.", "url": "https://www.ndtv.com/world-news/china-coronavirus-china-covid-cases-china-covid-news-us-orders-non-essential-staff-to-leave-chinas-shanghai-amid-covid-spike-2880261", "urlToImage": "https://c.ndtvimg.com/2022-04/tnqeh9d_-shanghai-covid-reuters-new_625x300_09_April_22.jpg", "publishedAt": "2022-04-12T02:11:16Z", "content": "Covid In Shanghai: China's Shanghai imposed harsh movement restrictions to stem spread of Covid.\r\nWashington: The United States has ordered all non-essential employees at its Shanghai consulate to le… [+1488 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukrainian Authorities In Kharkiv Begin Clearing Landmines", "description": "Ukrainian authorities in the northeastern city of Kharkiv warned people not to go near what they said were landmines being dropped on the city.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-ukrainian-authorities-in-kharkiv-begin-clearing-landmines-2880260", "urlToImage": "https://c.ndtvimg.com/2022-04/44tbs6qg_kharkiv-ukraine-russia-war-afp-650_625x300_04_April_22.jpg", "publishedAt": "2022-04-12T02:08:35Z", "content": "Ukrainian officials have repeatedly accused Russia of war crimes but Moscow denied claims.\r\nKharkiv: Ukrainian authorities in the northeastern city of Kharkiv warned people not to go near what they s… [+1554 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "38 Cows Killed In Fire At Cow Shelter In UP", "description": "Thirty-eight cows were charred to death after a fire broke out at a dumpyard here and engulfed a cow shelter nearby, officials said.", "url": "https://www.ndtv.com/india-news/uttar-pradesh-38-cows-killed-in-fire-at-cow-shelter-in-up-2880255", "urlToImage": "https://c.ndtvimg.com/rlak4li4_cow-generic-pixabay_625x300_08_August_18.jpg", "publishedAt": "2022-04-12T02:06:52Z", "content": "Uttar Pradesh: There were around 150 cows at the facility at the time of the blaze. (Representational)\r\nGhaziabad: Thirty-eight cows were charred to death after a fire broke out at a dumpyard here an… [+1549 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Britney Spears Says She Is Pregnant After Controversial Guardianship Ends", "description": "Britney Spears on Monday announced she is pregnant with her third child, five months after a judge ended the controversial guardianship the pop icon said barred her from having more children.", "url": "https://www.ndtv.com/world-news/britney-spears-says-she-is-having-a-baby-2880223", "urlToImage": "https://c.ndtvimg.com/2019-04/7vv803r_britney-spears-afp_625x300_25_April_19.jpg", "publishedAt": "2022-04-12T01:11:37Z", "content": "Britney Spears said Monday that she \"won't be going out as much\" to avoid trailing paparazzi.\r\nLos Angeles: Britney Spears on Monday announced she is pregnant with her third child, five months after … [+4098 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus Live: India Logs 861 Cases, 6 Covid Deaths In 24 Hours", "description": "India on Monday reported a total of 861 new COVID-19 cases, taking the coronavirus tally to 4,30,36,132. According to Union Health Ministry, the country reported at least 6 Covid-related deaths, bringing the total number of fatalities to 5,21,691.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-12-april-2022-2880187", "urlToImage": "https://c.ndtvimg.com/2022-01/fdhokfoo_-bengaluru-covid-testing-pti-650_650x400_03_January_22.jpg", "publishedAt": "2022-04-12T00:23:03Z", "content": "India Covid cases: However, the number of active cases of the infection has further declined to 11,058.\r\nNew Delhi: India on Monday reported a total of 861 new COVID-19 cases, taking the coronavirus … [+751 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UK Says It Is Probing Claims Of Russian Chemical Attack On Mariupol", "description": "Britain is trying to verify reports that Russia has used chemical weapons in an attack on the besieged Ukrainian city of Mariupol, London's top diplomat said on Monday.", "url": "https://www.ndtv.com/world-news/uk-says-it-is-probing-claims-of-russian-chemical-attack-on-ukraines-mariupol-2880184", "urlToImage": "https://i.ndtvimg.com/i/2015-03/mariupol-650_650x400_51425218886.jpg", "publishedAt": "2022-04-12T00:04:45Z", "content": "Russia has denied committing any war crimes during its offensive in Ukraine.\r\nLondon: Britain is trying to verify reports that Russia has used chemical weapons in an attack on the besieged Ukrainian … [+1722 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Arrests Putin Critic Vladimir Kara-Murza Over Ukraine War", "description": "Vladimir Kara-Murza, one of the main opponents of the Kremlin and its offensive in Ukraine still living in Russia, was arrested Monday near his home, his lawyer said.", "url": "https://www.ndtv.com/world-news/russia-arrests-opposition-politician-vladimir-kara-murza-over-ukraine-war-2880182", "urlToImage": "https://c.ndtvimg.com/2022-04/e97frcmc_vladimir-karamurza_625x300_12_April_22.jpg", "publishedAt": "2022-04-11T23:51:25Z", "content": "Russian authorities have recently tightened the screws on critics of the military operation.\r\nMoscow: Vladimir Kara-Murza, one of the main opponents of the Kremlin and its offensive in Ukraine still … [+1323 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Monitoring Rise In \"Human Rights Abuses\" In India, Says US", "description": "US Secretary of State Antony Blinken said the United States was monitoring what he described as a rise in human rights abuses in India by some officials, in a rare direct rebuke by Washington of the Asian nation's rights record.", "url": "https://www.ndtv.com/india-news/u-s-monitoring-rise-in-rights-abuses-in-india-blinken-says-2880171", "urlToImage": "https://c.ndtvimg.com/2022-04/9621c8q_antony-blinken_625x300_12_April_22.jpg", "publishedAt": "2022-04-11T23:35:16Z", "content": "This was a rare direct rebuke by Washington of India's rights record.\r\nWashington: US Secretary of State Antony Blinken said the United States was monitoring what he described as a rise in human righ… [+1092 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "S Jaishnakar, Blinken Discuss Ukraine War, Afghanistan At 2+2 Talks", "description": "External Affairs Minister S Jaishankar on Monday said that he held a discussion with US Secretary of State on several issues including the ongoing war in Ukraine, the situation in Afghanistan and challenges pertaining to the Indo-Pacific region.", "url": "https://www.ndtv.com/world-news/india-us-2-2-talks-s-jaishankar-antony-blinken-discuss-ukraine-war-afghanistan-indo-pacific-challenges-2880164", "urlToImage": "https://c.ndtvimg.com/2022-04/ivsuahv_modi-biden-afp_650x400_11_April_22.jpg", "publishedAt": "2022-04-11T23:10:22Z", "content": "Mr Jaishankar informed India-US also discussed ways to ensure a free, open and inclusive Indo-Pacific.\r\nWashington:  External Affairs Minister S Jaishankar on Monday said that he held a discussion wi… [+3674 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine's Zelensky Says Russian Forces Could Use Chemical Weapons", "description": "Ukrainian President Volodymyr Zelenskiy said on Monday that Russia could use chemical weapons in Ukraine and called on the West to impose strong sanctions on Moscow that would deter even talk of the use of such weapons.", "url": "https://www.ndtv.com/world-news/ukraine-president-volodymyr-zelensky-says-russian-forces-could-use-chemical-weapons-2880152", "urlToImage": "https://c.ndtvimg.com/2022-03/bh3l1t3g_zelensky-on-streets-afp_650x400_24_March_22.jpg", "publishedAt": "2022-04-11T22:40:12Z", "content": "Meanwhile, the European Union said on Monday that more sanction on Russia are an option.\r\nKyiv: Ukrainian President Volodymyr Zelenskiy said on Monday that Russia could use chemical weapons in Ukrain… [+1515 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "JNU Meat Row: Student Groups File Cross-FIRs, Cops Say Probe Underway", "description": "The Delhi Police on Monday registered separate FIRs based on complaints received by 2 rival student groups in connection with a clash on the JNU campus over non-vegetarian food being served in a hostel mess and alleged disruption of Ram Navami puja.", "url": "https://www.ndtv.com/india-news/jnu-meat-row-student-groups-file-cross-firs-cops-say-probe-underway-2880149", "urlToImage": "https://c.ndtvimg.com/2022-04/477rv8ug_jnu-campus_625x300_11_April_22.jpg", "publishedAt": "2022-04-11T22:29:40Z", "content": "JNU meat row: Both sides accused each other of pelting stones and injuring their members.\r\nNew Delhi: The Delhi Police on Monday registered separate FIRs based on complaints received by two rival stu… [+3989 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine's Mariupol May Fall To Russia As Attacks Intensify On East", "description": "Russia was poised Monday to take the strategic city of Mariupol and unleash a massive offensive in eastern Ukraine, as fresh diplomatic efforts with Moscow to broker a peace offered little hope of de-escalation.", "url": "https://www.ndtv.com/world-news/ukraines-mariupol-may-fall-to-russia-as-attacks-intensify-on-east-2880139", "urlToImage": "https://i.ndtvimg.com/i/2015-02/mariupol-town-ukraine_650x400_61424954519.jpg", "publishedAt": "2022-04-11T22:01:16Z", "content": "\"At least tens of thousands of Mariupol citizens must have been killed,\" Zelensky said.\r\nKyiv: Russia was poised Monday to take the strategic city of Mariupol and unleash a massive offensive in easte… [+5005 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "8 Killed In Gun Attack On House Near Mexico City: Police", "description": "Gunmen killed eight people, including four minors, in an attack on Monday on a house near Mexico City, authorities said.", "url": "https://www.ndtv.com/world-news/8-killed-in-gun-attack-on-house-near-mexico-city-police-2880130", "urlToImage": "https://i.ndtvimg.com/i/2018-03/police-generic-international-afp_650x400_41520126059.jpg", "publishedAt": "2022-04-11T21:26:19Z", "content": "An investigation has been launched into the motive and perpetrators, it said. (Representational)\r\nMexico City: Gunmen killed eight people, including four minors, in an attack on Monday on a house nea… [+799 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russian Army Using \"Rape\" As Weapon Of War: Ukraine Rights Group To UN", "description": "The United Nations is increasingly hearing accounts of rape and sexual violence in Ukraine, a senior U.N. official told the Security Council on Monday, as a Ukrainian human rights group accused Russian troops of using rape as a weapon of war.", "url": "https://www.ndtv.com/world-news/russian-army-using-rape-as-weapon-of-war-ukraine-rights-groups-to-un-2880121", "urlToImage": "https://c.ndtvimg.com/2022-03/a2ukbeio_ukraine-war-afp-240_625x300_24_March_22.jpg", "publishedAt": "2022-04-11T21:07:17Z", "content": "Violence and rape is used now as a weapon of war by Russian troops in Ukraine, the organisation told UN.\r\nUnited Nations: The United Nations is increasingly hearing accounts of rape and sexual violen… [+2459 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Let People Decide\": Imran Khan Demands \"Immediate Elections\" In Pakistan", "description": "Ousted Prime Minister of Pakistan Imran Khan has demanded an \"immediate elections\" in the country, hours after Shehbaz Sharif took oath as the 23rd Prime Minister on Monday.", "url": "https://www.ndtv.com/world-news/imran-khan-demands-immediate-elections-in-pakistan-2880110", "urlToImage": "https://c.ndtvimg.com/2022-04/57egtro8_imran-khan_650x400_10_April_22.jpg", "publishedAt": "2022-04-11T20:50:57Z", "content": "He also said that he would be holding a rally in Peshawar on April 13.\r\nIslamabad: Ousted Prime Minister of Pakistan Imran Khan has demanded an \"immediate elections\" in the country, hours after Shehb… [+1586 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Gujarat Tops Niti Aayog's Index For Energy And Climate, Kerala At 2nd", "description": "Gujarat has topped NITI Aayog's State Energy and Climate Index (SECI) with a score of 50.1 points in the larger states category.", "url": "https://www.ndtv.com/india-news/gujarat-tops-niti-aayogs-index-for-energy-and-climate-kerala-at-2nd-2880078", "urlToImage": "https://i.ndtvimg.com/i/2016-08/niti-aayog_650x400_81470827652.jpg", "publishedAt": "2022-04-11T20:28:05Z", "content": "Kerala and Punjab are ranked 2nd and 3rd respectively, while Goa has topped the category of small states.\r\nNew Delhi: Gujarat has topped NITI Aayog's State Energy and Climate Index (SECI) with a scor… [+4243 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "What US Said After Shehbaz Sharif Takes Over As Pak PM", "description": "After Mian Muhammad Shehbaz Sharif was elected as the 23rd Prime Minister of Pakistan, the United States said that they support the upholding of constitutional democratic principles and a democratic Pakistan is critical to US interests.", "url": "https://www.ndtv.com/world-news/what-us-said-after-shehbaz-sharif-takes-over-as-pak-pm-2880058", "urlToImage": "https://c.ndtvimg.com/vl3o3ykk3h_shehbaz-sharif-afp-_625x300.jpg", "publishedAt": "2022-04-11T20:07:00Z", "content": "The White House Official said that democratic Pakistan is critical to its interests.\r\nWashington: After Mian Muhammad Shehbaz Sharif was elected as the 23rd Prime Minister of Pakistan, the United Sta… [+2138 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Pope Francis To Visit Kazakhstan In September: Presidency", "description": "Pope Francis will visit Central Asia's largest nation of Kazakhstan in September, the country's presidency said on Monday, where he will participate in an inter-faith dialogue.", "url": "https://www.ndtv.com/world-news/pope-francis-to-visit-kazakhstan-in-september-presidency-2880046", "urlToImage": "https://c.ndtvimg.com/2021-05/uphijt7_pope-francisafp_625x300_09_May_21.jpg", "publishedAt": "2022-04-11T19:48:06Z", "content": "The first edition of the congress, aimed at promoting dialogue between religions, was held in 2003.\r\nAlmaty: Pope Francis will visit Central Asia's largest nation of Kazakhstan in September, the coun… [+883 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Says India Not Violating Any Sanctions By Importing Russian Oil", "description": "In a major shift in its tone on India's energy imports from Russia, the United States on Monday (local time) said that energy imports are not banned from Russia and New Delhi is not violating US sanctions.", "url": "https://www.ndtv.com/world-news/india-us-2-2-talks-us-says-india-not-violating-any-sanctions-by-importing-russian-oil-2880029", "urlToImage": "https://c.ndtvimg.com/2021-04/kqbsfbkg_white-house-press-secretary-jen-psaki_625x300_12_April_21.jpg", "publishedAt": "2022-04-11T19:33:02Z", "content": "\"Energy imports are not banned and they don't violate our sanctions,\" the White House official said.\r\nWashington: In a major shift in its tone on India's energy imports from Russia, the United States… [+3096 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "6 Suspected Russian Spies Expelled From France: Official", "description": "France is expelling six Russians suspected of working as spies under diplomatic cover after the French intelligence services uncovered a clandestine operation on its territory, the foreign ministry said on Monday.", "url": "https://www.ndtv.com/world-news/6-suspected-russian-spies-expelled-from-france-official-2880013", "urlToImage": "https://c.ndtvimg.com/2021-04/11394ivo_emmanuel-macron-reuters_625x300_01_April_21.jpg", "publishedAt": "2022-04-11T19:16:28Z", "content": "Earlier, France on April 4 said it was expelling 35 Russian diplomats as part of a joint EU action.\r\nParis: France is expelling six Russians suspected of working as spies under diplomatic cover after… [+1715 chars]"}]}