{"status": "ok", "totalResults": 214, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Video: 3 Shooters Open Fire At Car In West Delhi, 2 Injured", "description": "Two people were injured in west Delhi's Subhash Nagar last evening after at least three shooters surrounded a car on a busy road and fired 10 rounds at the occupants.", "url": "https://www.ndtv.com/delhi-news/video-3-shooters-open-fire-at-car-in-west-delhis-subhash-nagar-2-injured-2955841", "urlToImage": "https://c.ndtvimg.com/2022-05/bc0vch08_delhi-shooting_625x300_08_May_22.jpg", "publishedAt": "2022-05-08T02:28:53Z", "content": "While detailed information is yet to come in, the footage points to a planned attack\r\nNew Delhi: Two people were injured in west Delhi's Subhash Nagar last evening after at least three shooters surro… [+1287 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "5 Of Family Drown In Maharashtra Quarry As Rescue Goes Horribly Wrong", "description": "Five members of a family, including three children, drowned in a water-filled quarry in Maharashtra's Thane district on Saturday, the police said today. The family members had jumped into the pond to save one of the accompanying child members who sli", "url": "https://www.ndtv.com/mumbai-news/5-of-family-drown-in-maharashtra-quarry-as-rescue-goes-horribly-wrong-2955835", "urlToImage": "https://c.ndtvimg.com/2022-05/43sc5m9_thane-police_625x300_08_May_22.jpg", "publishedAt": "2022-05-08T02:19:51Z", "content": "The incident took place at 4 pm in Sandap village near Dombivali, adjacent to Mumbai.\r\nMumbai: Five members of a family, including three children, drowned in a water-filled quarry in Maharashtra's Th… [+1116 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "India Must Revive 'Sanatan Dharma' Principles: Kerala Governor Arif Khan", "description": "Kerala Governor Arif Mohammad Khan on Saturday emphasised the need to revive India's old culture and restore 'Sanatan dharma' principles by spreading proper education in the country.", "url": "https://www.ndtv.com/india-news/india-must-revive-sanatan-dharma-principles-kerala-governor-arif-khan-2955105", "urlToImage": "https://c.ndtvimg.com/2022-02/ifv9hmlo_kerala-governor-_625x300_16_February_22.jpg", "publishedAt": "2022-05-08T02:03:14Z", "content": "Kerala Governor Arif Mohammad Khan made remarks while inaugurating a school in Kalan town.\r\nShahjahanpur: Kerala Governor Arif Mohammad Khan on Saturday emphasised the need to revive India's old cult… [+844 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Pakistan Joins India In Questioning WHO's Covid Death Count", "description": "The Pakistani government has rejected the World Health Organization's (WHO) report on number of COVID-19 deaths in the country, questioning the United Nations body's methodology to collect data.", "url": "https://www.ndtv.com/world-news/who-covid-data-report-covid-in-pakistan-coronavirus-in-pakistan-pakistan-joins-india-in-questioning-whos-covid-death-count-2954331", "urlToImage": "https://c.ndtvimg.com/2020-03/fd3ftu38_pakistan-coronavirus_625x300_17_March_20.jpg", "publishedAt": "2022-05-08T01:55:17Z", "content": "Covid Deaths In Pakistan: Official records state Pakistan had 30,369 Covid deaths. (File)\r\nIslamabad: The Pakistani government has rejected the World Health Organization's (WHO) report on number of C… [+2801 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Mother's Day 2022: Gifts Ideas For Your Mom On This Special Day", "description": "This Sunday, May 8, will be extra special for us. After all, it's Mother's Day. Though mothers deserve to be loved throughout the year, Mother's Day is the time to go all out with special meals, family activities, and gifts galore.", "url": "https://www.ndtv.com/world-news/mothers-day-2022-gifts-ideas-for-your-mom-on-this-special-day-2948422", "urlToImage": "https://c.ndtvimg.com/2021-05/6ofv37c8_happy-mothers-day_625x300_06_May_21.jpg", "publishedAt": "2022-05-08T01:24:02Z", "content": "Mother's Day 2022: Mother's Day is observed in a number of countries around the world.\r\nThis Sunday, May 8, will be extra special for us. After all, it's Mother's Day. Though mothers deserve to be lo… [+2262 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE Updates: India Reports 3,805 New Covid Cases, 22 Deaths", "description": "India reported 3,805 new coronavirus infections in a day, pushing the number of active cases of the disease in the country to 20,303 and the overall tally to 4,30,98,743, according to Union Health Ministry data updated on Saturday.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-may-8-2955809", "urlToImage": "https://c.ndtvimg.com/2022-05/7n1qav7g_india-covid-covid-india-pti-april-30-2022_625x300_01_May_22.jpg", "publishedAt": "2022-05-08T00:26:26Z", "content": "The active cases now constitute 0.05 per cent of the total infections.\r\nNew Delhi: India reported 3,805 new coronavirus infections in a day, pushing the number of active cases of the disease in the c… [+1671 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Man Grabs Gun From Cop, Kills 2 Patients In South Africa Hospital", "description": "A man on Saturday wrested a gun from a policeman, went on a rampage and shot dead two patients inside a South African hospital, police said.", "url": "https://www.ndtv.com/world-news/man-grabs-gun-from-cop-kills-2-patients-in-south-africa-hospital-2955795", "urlToImage": "https://i.ndtvimg.com/i/2016-12/police-line_650x400_41482635766.jpg", "publishedAt": "2022-05-07T23:16:56Z", "content": "The man seriously wounded the police officer from whom he seized the firearm. (Representational)\r\nA man on Saturday wrested a gun from a policeman, went on a rampage and shot dead two patients inside… [+1075 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Hong Kong's Next Leader Set To Be Endorsed By Pro-Beijing Elites", "description": "Hong Kong's leader-in-waiting, John Lee, is expected to be endorsed for the city's top job on Sunday by a committee stacked with pro-Beijing loyalists, as the financial hub attempts to relaunch itself after several years of political upheaval.", "url": "https://www.ndtv.com/world-news/hong-kongs-next-leader-set-to-be-endorsed-by-pro-beijing-elites-2955791", "urlToImage": "https://c.ndtvimg.com/2022-05/lmh180p4_john-lee-reuters_625x300_08_May_22.jpg", "publishedAt": "2022-05-07T23:06:16Z", "content": "Hong Kong sole Chief Executive candidate John Lee holds a campaign rally (FILE)\r\nHONG KONG: Hong Kong's leader-in-waiting, John Lee, is expected to be endorsed for the city's top job on Sunday by a c… [+2227 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UK To Provide 1.3 Billion Pounds Of Further Military Support To Ukraine", "description": "Britain said it would provide a further 1.3 billion pounds ($1.60 billion) in military support and aid to Ukraine, making the pledge ahead of a planned video call on Sunday by Group of Seven leaders with Ukrainian President Volodymyr Zelensky.", "url": "https://www.ndtv.com/world-news/uk-to-provide-1-3-billion-pounds-of-further-military-support-to-ukraine-2955768", "urlToImage": "https://c.ndtvimg.com/2022-05/7pggdgm8_ukraine-crisis-reuters-pic-650x319_650x400_05_May_22.jpg", "publishedAt": "2022-05-07T21:35:24Z", "content": "Britain said the extra spending on Ukraine will come from a reserve used for emergencies.\r\nLONDON: Britain said it would provide a further 1.3 billion pounds ($1.60 billion) in military support and a… [+1916 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Unseen Home Recordings Of Young Queen Elizabeth To Be Aired", "description": "Previously unseen footage of Britain's Queen Elizabeth as a young girl before acceding to the throne will feature in a new documentary airing at the end of this month, Buckingham Palace and broadcaster BBC said on Saturday.", "url": "https://www.ndtv.com/world-news/unseen-home-recordings-of-young-queen-elizabeth-to-be-aired-2955762", "urlToImage": "https://c.ndtvimg.com/2022-02/2c39iaf8_queen-elizabeth-ii-reuters_625x300_06_February_22.jpg", "publishedAt": "2022-05-07T21:06:21Z", "content": "Producers viewed more than 400 reels of film and dipped into more than 300 speeches(FILE)\r\nLONDON: Previously unseen footage of Britain's Queen Elizabeth as a young girl before acceding to the throne… [+1014 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Putin \"Doesn't Believe He Can Afford To Lose\" In Ukraine: US Spy Chief", "description": "Russian President Vladimir Putin believes that he cannot afford to lose in Ukraine and is \"doubling down\" on the war, but shows no signs of planning to use tactical nuclear weapons, CIA director Bill Burns said Saturday.", "url": "https://www.ndtv.com/world-news/vladimir-putin-doesnt-believe-he-can-afford-to-lose-in-ukraine-us-spy-chief-2955724", "urlToImage": "https://c.ndtvimg.com/2022-04/ig4aoe6o_vladimir-putin_625x300_28_April_22.jpg", "publishedAt": "2022-05-07T19:32:45Z", "content": "The CIA chief said Putin has been \"stewing\" for years over Ukraine. (FILE)\r\nWashington: Russian President Vladimir Putin believes that he cannot afford to lose in Ukraine and is \"doubling down\" on th… [+3670 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "F1: Sergio Perez Quickest In Final Practice As Mercedes Slump Again", "description": "Miami Grand Prix: Sergio Perez topped the times for Red Bull ahead of championship leader Charles Leclerc in Saturday's final free practice.", "url": "https://sports.ndtv.com/formula-1/miami-grand-prix-formula-1-sergio-perez-quickest-in-final-practice-as-mercedes-slump-again-2955684", "urlToImage": "https://c.ndtvimg.com/2022-05/mfg9gd64_sergio-perez-_625x300_08_May_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-07T18:40:46Z", "content": "Sergio Perez topped the times for Red Bull ahead of championship leader Charles Leclerc in Saturday's final free practice ahead of Sunday's inaugural Miami Grand Prix. In hot, but changing conditions… [+2658 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Carlos Alcaraz Downs Novak Djokovic In Thriller To Reach Madrid Final", "description": "Madrid Open: Carlos Alcaraz reached his second ATP Masters final in five weeks and claimed his first-ever win over a reigning world number one, overcoming Novak Djokovic 6-7 (5/7), 7-5, 7-6 (7/5).", "url": "https://sports.ndtv.com/tennis/carlos-alcaraz-downs-novak-djokovic-in-thriller-to-reach-madrid-final-2955679", "urlToImage": "https://c.ndtvimg.com/2022-05/t2n4dt7o_alcaraz-afp_625x300_08_May_22.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-07T18:38:46Z", "content": "Carlos Alcaraz became the first player to defeat Rafael Nadal and Novak Djokovic at the same tournament on clay as he stormed into the Madrid Open final on Saturday. The 19-year-old Spaniard reached … [+2531 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Brighton Score Four As They Thrash Dismal Manchester United", "description": "Brighton thrashed Manchester United 4-0 to end their hopes of finishing in the top four and sealing a Champions League berth.", "url": "https://sports.ndtv.com/english-premier-league/brighton-score-four-as-they-thrash-dismal-manchester-united-2955678", "urlToImage": "https://c.ndtvimg.com/2022-05/1ilaucv8_brighton-vs-manchester-united-afp_625x300_08_May_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-07T18:38:44Z", "content": "Manchester United's dismal season hit a new low as Brighton condemned them to a 4-0 defeat that ended their hopes of finishing in the Premier League's top four on Saturday. United have endured a host… [+3129 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Court Cancels UP Ex-Minister's Plea Over Case Against His Meat Business", "description": "The Allahabad High Court has dismissed a plea by a former Uttar Pradesh minister to quash an FIR, lodged against him for allegedly running his meat processing business in Meerut without a valid licence.", "url": "https://www.ndtv.com/india-news/court-cancels-up-ex-ministers-plea-over-complaint-against-his-meat-business-2955676", "urlToImage": "https://c.ndtvimg.com/court-generic_625x300_1527245477936.jpg", "publishedAt": "2022-05-07T18:38:07Z", "content": "The allegations indicate that the unit was indulging in an unlawful act, the court said(Representational)\r\nAllahabad: The Allahabad High Court has dismissed a plea by a former Uttar Pradesh minister … [+2721 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Police Constable Shot Dead By Terrorists In J&K's Srinagar", "description": "A police constable was shot dead by terrorists in Srinagar on Saturday, police said.", "url": "https://www.ndtv.com/india-news/police-constable-shot-dead-by-terrorists-in-j-ks-srinagar-2955662", "urlToImage": "https://c.ndtvimg.com/2022-05/4bj1dr9o_jk-terrorist-attackanimay-7_625x300_07_May_22.jpg", "publishedAt": "2022-05-07T18:31:44Z", "content": "The police personnel was unarmed at the time of the attack and was riding a motorcycle.\r\nSrinagar: A police constable was shot dead by terrorists here on Saturday, police said.\r\n\"Around 8.40 am, terr… [+1119 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Aakash Arya", "title": "Pujara Registers 4th 100 Plus Score In 4th County Match For Sussex", "description": "County Championships: Indian international Cheteshwar Pujara continued his purple patch as he registered his fourth 100-plus score in as many games for Sussex.", "url": "https://sports.ndtv.com/cricket/county-championships-cheteshwar-pujara-registers-fourth-100-plus-score-in-fourth-county-match-for-sussex-2955653", "urlToImage": "https://c.ndtvimg.com/2022-05/najgded4_cheteshwar-pujara_625x300_07_May_22.jpg", "publishedAt": "2022-05-07T18:29:06Z", "content": "Cheteshwar Pujara is really making a statement in County Championships Division Two this season as he registered his fourth 100-plus score in as many games for Sussex while playing against Middlesex … [+1281 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Teen Raped, Murdered In Jharkhand, 2 Arrested: Police", "description": "A teenager was raped and murdered after she was allegedly kidnapped by two men from Matwari Bhuiyan Toli in Hazaribag district, a senior police officer said on Saturday.", "url": "https://www.ndtv.com/india-news/teen-raped-murdered-in-jharkhand-2-arrested-police-2955646", "urlToImage": "https://c.ndtvimg.com/2020-03/utejv4l_police-generic_625x300_07_March_20.jpg", "publishedAt": "2022-05-07T18:24:47Z", "content": "They were arrested on the basis of the complaint filed with the police by her family(Representational)\r\nHazaribagh: A teenager was raped and murdered after she was allegedly kidnapped by two men from… [+1445 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "If Pak Had Better Ties With Russia, It Could Ensure Cheap Gas: Imran Khan", "description": "Former Pakistan Prime Minister Imran Khan has said that if the country had better ties with Russia, then Moscow could have ensured cheap gas and wheat for the country.", "url": "https://www.ndtv.com/world-news/better-ties-with-russia-could-ensure-cheap-gas-and-wheat-says-imran-khan-2955632", "urlToImage": "https://c.ndtvimg.com/2022-04/57egtro8_imran-khan_650x400_10_April_22.jpg", "publishedAt": "2022-05-07T18:18:41Z", "content": "Our foreign policy should be designed as per our national interests, says Imran Khan. (FILE)\r\nIslamabad: Former Pakistan Prime Minister Imran Khan has said that if the country had better ties with Ru… [+1926 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Amit Shah To Present President's Colour Award To Assam Police", "description": "Union Home Minister Amit Shah is scheduled to present the President's Colour award to Assam Police on May 10 here for its exemplary service during the last 25 years, a senior police official said on Saturday.", "url": "https://www.ndtv.com/india-news/amit-shah-to-present-presidents-colour-award-to-assam-police-2955613", "urlToImage": "https://c.ndtvimg.com/2022-05/qhbrhiu_amit-shah_625x300_06_May_22.jpg", "publishedAt": "2022-05-07T18:08:59Z", "content": "Union Home minister Amit Shah is scheduled to arrive in Assam on a three-day visit from Sunday night\r\nGuwahati: Union Home Minister Amit Shah is scheduled to present the President's Colour award to A… [+1633 chars]"}]}