{"status": "ok", "totalResults": 617, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Fleeing Thief Gets Trapped In Hole After Looting Temple, Caught Red-Handed", "description": "A thief got stuck in a wall hole while escaping with nine grams of silver which he stole from the Jami Ellama temple in Srikakulam district of Andhra Pradesh, said a police official on Wednesday.", "url": "https://www.ndtv.com/andhra-pradesh-news/fleeing-thief-gets-stuck-in-wall-hole-after-looting-temple-in-andhra-pradesh-caught-red-handed-2867602", "urlToImage": "https://c.ndtvimg.com/2022-04/3q5l3p3o_temple-loot_625x300_07_April_22.jpg", "publishedAt": "2022-04-07T01:51:50Z", "content": "A robbery case has been registered against the accused\r\nSrikakulam: A thief got stuck in a wall hole while escaping with nine grams of silver which he stole from the Jami Ellama temple in Srikakulam … [+912 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "North Korea Could Hold Nuclear Test Next Week: US Envoy", "description": "Pyongyang is ignoring US overtures for talks and could be planning its first nuclear weapon test in nearly five years for its April 15 holiday, the State Department's top North Korea envoy said Wednesday.", "url": "https://www.ndtv.com/world-news/north-korea-nuclear-test-north-korea-could-hold-nuclear-test-next-week-us-envoy-2867601", "urlToImage": "https://c.ndtvimg.com/2021-10/m1dr7m1c_kim-jong-un_625x300_12_October_21.jpg", "publishedAt": "2022-04-07T01:48:42Z", "content": "North Korea Nuclear Test: North Korea has tested nuclear weapons several times.\r\nWashington: Pyongyang is ignoring US overtures for talks and could be planning its first nuclear weapon test in nearly… [+2561 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "China Could Face Sanctions If It Supports Russia's Ukraine War, US Warns", "description": "Sanctions imposed on Russia over its war in Ukraine should give China a \"good understanding\" of the consequences it could face if it provides material support to Moscow, U.S. Deputy Secretary of State Wendy Sherman said on Wednesday.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-china-could-face-sanctions-if-it-supports-russias-ukraine-war-us-warns-2867453", "urlToImage": "https://c.ndtvimg.com/2021-06/b6t3g4kg_china-flag-reuters_625x300_13_June_21.jpg", "publishedAt": "2022-04-07T01:38:21Z", "content": "Russia-Ukraine War: China and Russia have developed increasingly close ties in recent years.\r\nWashington: Sanctions imposed on Russia over its war in Ukraine should give China a \"good understanding\" … [+2111 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Newsdesk", "title": "LIVE Updates: Russia Threatens Ukraine's East Amid More Western Sanctions", "description": "The United States and Britain announced new sanctions against Russia after Ukraine said hundreds of civilians were found dead near Kyiv, including the town of Bucha, after the pullout of Russian troops.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-live-updates-russia-threatens-ukraines-east-amid-more-western-sanctions-2867586", "urlToImage": "https://c.ndtvimg.com/2022-04/8aoujlv_ukraine-bucha-afp-650_625x300_05_April_22.jpg", "publishedAt": "2022-04-07T01:26:39Z", "content": "Russia-Ukraine War: Russia denied responsibility for civilian deaths in Bucha.\r\nNew Delhi: The United States and Britain announced new sanctions against Russia after Ukraine said hundreds of civilian… [+1157 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE: India Reports Over 1,000 New Covid Cases In 24 Hours", "description": "India reported 1,086 new Covid cases in the last 24 hours, taking the coronavirus tally to 4,30,30,925. According to the Union Health Ministry data, country's active cases currently stand at 11,871.", "url": "https://www.ndtv.com/india-news/coronavirus-india-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-7-april-2022-2867575", "urlToImage": "https://c.ndtvimg.com/2020-11/j50nmb7o_noidadelhi-random-covid-testing_625x300_18_November_20.jpg", "publishedAt": "2022-04-07T00:32:33Z", "content": "India Covid Updates: The number of people who have recuperated from the disease surged to 4,24,97,567.\r\nNew Delhi: India reported 1,086 new Covid cases in the last 24 hours, taking the coronavirus ta… [+587 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Pentagon Says Ukrainian Soldiers Getting Drone Training In US", "description": "Ukrainian soldiers are being trained in the United States to operate the deadly Switchblade drones that Washington is supplying to Kyiv, a Pentagon official said Wednesday.", "url": "https://www.ndtv.com/world-news/pentagon-says-ukrainian-soldiers-getting-drone-training-in-us-2867567", "urlToImage": "https://c.ndtvimg.com/2019-06/8m2rp2f8_iran-downs-us-drone_625x300_21_June_19.jpeg", "publishedAt": "2022-04-07T00:03:01Z", "content": "Meanwhile the US announced another $100 million worth of military aid to Ukraine. (File)\r\nWashington: Ukrainian soldiers are being trained in the United States to operate the deadly Switchblade drone… [+2347 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "With Ukraine War, Putin Has \"Shortened His Term\": Alexei Navalny Ally", "description": "Russian President Vladimir Putin's decision to invade Ukraine was clearly a miscalculation, and will shorten his time in office, a top ally of jailed Kremlin critic Alexei Navalny said Wednesday.", "url": "https://www.ndtv.com/world-news/with-ukraine-war-russian-president-vladmir-putin-has-shortened-his-term-kremlin-critic-navalny-ally-2867561", "urlToImage": "https://c.ndtvimg.com/2022-03/pg2olmq8_putin_650x400_31_March_22.jpg", "publishedAt": "2022-04-06T23:38:23Z", "content": "\"Very clearly, Putin has shortened his term,\" Leonid Volkov told AFP in an interview.\r\nGeneva: Russian President Vladimir Putin's decision to invade Ukraine was clearly a miscalculation, and will sho… [+3041 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Delay On Russia Oil Ban Decision Is Costing Lives: Ukraine's Zelensky To West", "description": "Ukrainian President Volodymyr Zelenskiy on Thursday called on Western politicians to quickly agree on an embargo of Russian oil, complaining that their failure to do so was costing Ukrainians their lives.", "url": "https://www.ndtv.com/world-news/delay-on-russia-oil-ban-decision-is-costing-lives-ukraine-president-volodymyr-zelensky-to-west-2867556", "urlToImage": "https://c.ndtvimg.com/2022-03/k27u67s8_ukraine-president-volodymyr-zelensky-650_625x300_12_March_22.jpg", "publishedAt": "2022-04-06T23:13:42Z", "content": "Russia's 6-week-long invasion of Ukraine has forced over 4 million to flee, killed or injured thousands.\r\nKyiv: Ukrainian President Volodymyr Zelenskiy on Thursday called on Western politicians to qu… [+1525 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Covid Increases Risk Of Blood Clots For Up To 6 Months: Study", "description": "People who have had Covid-19 have an increased risk of developing serious blood clots for up to six months after getting infected, even in mild cases, a study said Thursday.", "url": "https://www.ndtv.com/world-news/covid-increases-risk-of-blood-clots-for-up-to-6-months-study-2867555", "urlToImage": "https://c.ndtvimg.com/2021-03/qj1hqlqc_coronavirus-generic_625x300_05_March_21.jpg", "publishedAt": "2022-04-06T23:00:08Z", "content": "There was also an increased danger of deep vein thrombosis--a blood clot normally in legs.\r\nParis: People who have had Covid-19 have an increased risk of developing serious blood clots for up to six … [+1946 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Red Cross Evacuee Convoy Arrives From Russian-Held City", "description": "A Red Cross convoy arrived in the southern Ukrainian city of Zaporizhzhia on Wednesday after failing to reach the besieged port city of Mariupol, an AFP journalist on the scene reported.", "url": "https://www.ndtv.com/world-news/red-cross-evacuee-convoy-arrives-from-russian-held-city-2867552", "urlToImage": "https://c.ndtvimg.com/2022-03/0mi584hg_russia-ukraine-mariupol-reuters-650_625x300_01_March_22.jpg", "publishedAt": "2022-04-06T22:48:02Z", "content": "The ICRC said that more than 500 evacuees in total were brought to Zaporizhzhia.\r\nZaporizhzhia, Ukraine: A Red Cross convoy arrived in the southern Ukrainian city of Zaporizhzhia on Wednesday after f… [+3891 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Countries With Agenda Blocking India's NSG Membership bid: S Jaishankar", "description": "India's membership of the Nuclear Suppliers Group requires a consensus and there are others that seem to have another agenda and are blocking it, S Jaishankar said on Wednesday.", "url": "https://www.ndtv.com/india-news/countries-with-agenda-blocking-indias-nsg-membership-bid-s-jaishankar-2867551", "urlToImage": "https://c.ndtvimg.com/2022-04/0c3e3oqg_s-jaishankar-in-parliament-_650x400_06_April_22.jpg", "publishedAt": "2022-04-06T22:33:02Z", "content": "Minister noted that many members expressed interest in where India is on the NSG membership bid.\r\nNew Delhi: India's membership of the Nuclear Suppliers Group requires a consensus and there are count… [+1960 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Centre Denies Reports Of New Coronavirus XE Variant In India", "description": "The Union Health Ministry on Wednesday said that said present evidence does not suggest the presence of XE variant of COVID denying media reports that claimed that a case of the new mutant was reported in Mumbai.", "url": "https://www.ndtv.com/india-news/centre-denies-reports-of-new-coronavirus-xe-variant-in-india-2867548", "urlToImage": "https://c.ndtvimg.com/2021-11/iulm91gs_covid-testing_625x300_11_November_21.jpg", "publishedAt": "2022-04-06T22:08:58Z", "content": "XE is recombinant of Omicron BA.1 and BA.2 sublineages of COVID-19.\r\nMumbai: The Union Health Ministry on Wednesday said that said present evidence does not suggest the presence of XE variant of COVI… [+1910 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Why US Is Targeting Putin's Daughters: All You Need To Know", "description": "The United States' latest round of sanctions on Russia includes two new targets: Russian President Vladimir Putin's two adult daughters, Katerina and Maria, who U.S. officials believe are hiding Putin's wealth.", "url": "https://www.ndtv.com/world-news/why-us-is-targeting-russian-president-vladimir-putins-daughters-katerina-vladimirovna-tikhonova-maria-vladimirovna-vorontsova-2867539", "urlToImage": "https://c.ndtvimg.com/2022-04/vael155_putin-daughter_625x300_07_April_22.jpg", "publishedAt": "2022-04-06T21:43:39Z", "content": "Putin's daughter Katerina (L) dances during the World Cup Rock'n'Roll Acrobatic Competition. (File)\r\nWashington: The United States' latest round of sanctions on Russia includes two new targets: Russi… [+4621 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "France's Macron Slams Polish PM After Criticism Of Putin Talks", "description": "President Emmanuel Macron on Wednesday lashed out at Poland's prime minister following his criticism of the French leader's repeated talks with Russia's Vladimir Putin.", "url": "https://www.ndtv.com/world-news/scandalous-frances-macron-slams-polish-pm-after-criticism-of-putin-talks-2867535", "urlToImage": "https://c.ndtvimg.com/2021-04/11394ivo_emmanuel-macron-reuters_625x300_01_April_21.jpg", "publishedAt": "2022-04-06T21:16:38Z", "content": "Macron said that he takes responsibility for having spoken to Putin in the name of France.\r\nParis: President Emmanuel Macron on Wednesday lashed out at Poland's prime minister following his criticism… [+2999 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "British National Charged With \"Spying\" For Russia In Berlin", "description": "A security guard for the British embassy in Berlin suspected of working for the Russian intelligence services has been charged with nine offences under the UK Official Secrets Act.", "url": "https://www.ndtv.com/world-news/british-security-guard-charged-with-spying-for-russia-in-berlin-2867533", "urlToImage": "https://c.ndtvimg.com/2018-10/h4s5hmb8_german-police_650_625x300_14_October_18.jpg", "publishedAt": "2022-04-06T21:03:03Z", "content": "He mainly worked with British documents, Sputnik reported citing German media. (Representational)\r\nBerlin: A security guard for the British embassy in Berlin suspected of working for the Russian inte… [+1204 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine's Zelensky Says Russia Hiding \"Thousands\" Killed in Mariupol", "description": "Russia is blocking humanitarian access to the besieged port city of Mariupol because it wants to hide evidence of \"thousands\" of people killed there, Ukrainian President Volodymyr Zelensky said on Wednesday.", "url": "https://www.ndtv.com/world-news/ukraines-zelensky-says-russia-hiding-thousands-killed-in-mariupol-2867504", "urlToImage": "https://c.ndtvimg.com/2022-03/bh3l1t3g_zelensky-on-streets-afp_650x400_24_March_22.jpg", "publishedAt": "2022-04-06T20:28:36Z", "content": "Zelensky said it is difficult to stop this war without peace talks with Russia.\r\nKyiv: Russia is blocking humanitarian access to the besieged port city of Mariupol because it wants to hide evidence o… [+1638 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Italy Vows To Follow EU On Russian Gas Ban", "description": "Italy will \"follow the decisions of the European Union\" on new sanctions against Russia, including a possible gas embargo, Prime Minister Mario Draghi said Wednesday.", "url": "https://www.ndtv.com/world-news/italy-vows-to-follow-eu-on-russian-gas-ban-2867496", "urlToImage": "https://c.ndtvimg.com/2021-11/37vqsnko_crude-oil-reuters_625x300_23_November_21.jpg", "publishedAt": "2022-04-06T20:07:20Z", "content": "Italy is highly dependent on Russian gas, importing 95% of the gas it consumes.\r\nRome: Italy will \"follow the decisions of the European Union\" on new sanctions against Russia, including a possible ga… [+1467 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Pentagon Says Ukraine Can \"Absolutely\" Win War", "description": "he Pentagon said on Wednesday it assessed that Ukraine could win the war against Russia, even as U.S. officials speak of the risk of a protracted conflict.", "url": "https://www.ndtv.com/world-news/pentagon-says-ukraine-can-absolutely-win-war-against-russia-2867485", "urlToImage": "https://c.ndtvimg.com/2022-03/inkdihco_ukraine-war-afp-650_625x300_24_March_22.jpg", "publishedAt": "2022-04-06T19:29:13Z", "content": "\"Of course they can win this,\" Pentagon spokesman John Kirby told a news briefing.\r\nWashington: he Pentagon said on Wednesday it assessed that Ukraine could win the war against Russia, even as U.S. o… [+328 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "On \"Passive Foreign Policy\" Charge, Minister's \"Giving Gyan\" Rebuttal", "description": "Noting that India should look at its national interests effectively and be less concerned about \"giving gyan\" to the world over foreign policy, External Affairs Minister S Jaishankar on Monday said that the government is \"very, very focussed\" in its", "url": "https://www.ndtv.com/india-news/on-passive-foreign-policy-charge-foreign-minister-s-jaishankars-giving-gyan-rebuttal-in-lok-sabha-2867469", "urlToImage": "https://c.ndtvimg.com/2022-04/2nur9edo_s-jaishankar-in-parliament-pti-pic_650x400_06_April_22.jpg", "publishedAt": "2022-04-06T19:03:02Z", "content": "Mr Jaishankar rejected allegation of an opposition member that India's diplomacy was \"passive\".\r\nNew Delhi: Noting that India should look at its national interests effectively and be less concerned a… [+2984 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Can You Relate To This? Gauahar Shares A Funny Video On Fasting During Ramadan", "description": "She highlighted what people think about how people fasting during Ramadan feel at the mention of food", "url": "https://www.ndtv.com/entertainment/can-you-relate-to-this-gauahar-khan-shares-a-hilarious-video-on-fasting-during-ramadan-2867435", "urlToImage": "https://c.ndtvimg.com/2022-04/uqctv7gg_gauahar-khan_625x300_06_April_22.jpg", "publishedAt": "2022-04-06T18:22:56Z", "content": "Gauahar Khan. (courtesy: gauaharkhan)\r\nHighlights\r\n<ul><li>Gauahar Khan shared a post\r\n</li><li>\"To everyone who Loves my #ramadan content,\" wrote Gauahar\r\n</li><li>Gauahar was last seen in Bestselle… [+1864 chars]"}]}