{"status": "ok", "totalResults": 142, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Delhi Government Offices Get Notice Over Mosquito Breeding", "description": "Seventy-six legal notices have been sent to multiple authorities after mosquito larvae were found breeding on the premises of several government offices in Delhi in the last few months, civic officials said on Wednesday.", "url": "https://www.ndtv.com/india-news/notices-issued-by-mcd-to-delhi-government-offices-over-mosquito-breeding-3178442", "urlToImage": "https://i.ndtvimg.com/i/2016-04/dengue-generic-650_650x400_41460483224.jpg", "publishedAt": "2022-07-20T20:51:54Z", "content": "Nearly 160 dengue cases have been reported in Delhi so far this year, the civic body said.\r\nNew Delhi: Seventy-six legal notices have been sent to multiple authorities after mosquito larvae were foun… [+3295 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Assam Flood Situation Improves, Over 16,000 People Still Affected", "description": "The flood situation in Assam improved further on Wednesday as the number of people affected by the deluge came down to 16,462 even as one more person died, an official bulletin said.", "url": "https://www.ndtv.com/india-news/assam-flood-situation-improves-over-16-000-people-still-affected-3178410", "urlToImage": "https://c.ndtvimg.com/2022-06/c3qjfltg_assam-flood-silchar-reuters_625x300_27_June_22.jpg", "publishedAt": "2022-07-20T20:08:32Z", "content": "Assam Floods: More than 1,500 displaced people are still in 16 relief camps.\r\nGuwahati: The flood situation in Assam improved further on Wednesday as the number of people affected by the deluge came … [+1360 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Man Attacked In Madhya Pradesh For 'Supporting' Nupur Sharma, 2 Arrested", "description": "A man was injured after he was attacked by a group of people armed with sharp-edged weapons for allegedly expressing support for former BJP spokesperson Nupur Sharma in Madhya Pradesh's Agar Malwa district on Wednesday, officials said.", "url": "https://www.ndtv.com/india-news/man-attacked-in-madhya-pradeshs-agar-malwa-for-supporting-nupur-sharma-2-arrested-3178401", "urlToImage": "https://c.ndtvimg.com/2022-06/ars722ac_police-generic_625x300_14_June_22.jpg", "publishedAt": "2022-07-20T19:53:54Z", "content": "According to police, the incident took place in Madhya Pradesh's Agar Malwa. (Representational)\r\nAgar Malwa, Madhya Pradesh: A man was injured after he was attacked by a group of people armed with sh… [+1840 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Biden Vows Climate Action As Heatwave Hits US, Europe", "description": "US President Joe Biden unveiled a series of executive measures Wednesday to combat climate change and pledged more to follow, seeking to advance his environmental agenda stalled by unsupportive lawmakers and a conservative Supreme Court.", "url": "https://www.ndtv.com/world-news/joe-biden-vows-climate-action-as-heatwave-hits-us-europe-3178383", "urlToImage": "https://c.ndtvimg.com/2022-05/ghd8f8hs_biden_625x300_20_May_22.jpg", "publishedAt": "2022-07-20T19:28:56Z", "content": "Biden, in his first day in office, signed an order to bring the US back into the Paris agreement.\r\nWashington: US President Joe Biden unveiled a series of executive measures Wednesday to combat clima… [+2966 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Brain Dead 19-Year-Old Student Saves 5 Lives In Chennai", "description": "A 19-year-old student, who was declared brain dead following an accident recently, has given a new lease of life to five individuals, a private health care facility said on Wednesday.", "url": "https://www.ndtv.com/india-news/brain-dead-19-year-old-student-saves-5-lives-in-chennai-3178357", "urlToImage": "https://i.ndtvimg.com/i/2015-03/ambulance-generic_650x400_51425838004.jpg", "publishedAt": "2022-07-20T18:59:36Z", "content": "The final-year college student sustained grievous injury early this month in Chennai. (Representational)\r\nChennai: A 19-year-old student, who was declared brain dead following an accident recently, h… [+2143 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Opposition's \"RSS Anti-National\" Retort At Assam Chief Minister Over Flag", "description": "The opposition parties in Assam have reacted sharply after Assam Chief Minister Himanta Biswa Sarma made an appeal to the people of the state to hoist the national flag at their homes from August 13 to 15.", "url": "https://www.ndtv.com/india-news/oppositions-rss-anti-national-retort-at-assam-chief-minister-himanta-biswa-sarma-over-national-flag-3178336", "urlToImage": "https://c.ndtvimg.com/2022-03/lonccrt_himanta-sarma-650_625x300_14_March_22.jpg", "publishedAt": "2022-07-20T18:42:36Z", "content": "Himanta Biswa Sarma asked the people of Assam to hoist national flag from August 13 to 15\r\nGuwahati: The opposition parties in Assam have reacted sharply after Assam Chief Minister Himanta Biswa Sarm… [+2909 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Maharashtra Congress Chief Warns BJP Leader Of Legal Action Over Tweet", "description": "BJP leader Chitra Wagh on Wednesday tweeted a video which purportedly showed Maharashtra Congress chief Nana Patole with a woman.", "url": "https://www.ndtv.com/india-news/maharashtra-congress-chief-nana-patole-warns-bjp-leader-chitra-wagh-of-legal-action-over-tweet-3178313", "urlToImage": "https://c.ndtvimg.com/2022-07/edpdt1n_-nana-patole_625x300_07_July_22.jpg", "publishedAt": "2022-07-20T18:27:30Z", "content": "Maharashtra Congress chief Nana Patole warned of legal action over the video\r\nMumbai: BJP leader Chitra Wagh on Wednesday tweeted a video which purportedly showed Maharashtra Congress chief Nana Pato… [+669 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Paytm, Ola Bosses, Others To Meet Panel On Anti-Competition Concerns", "description": "Top executives of eight domestic tech firms, including Paytm founder Vijay Shekhar Sharma and Oyo founder Ritesh Agarwal, will appear before a key parliamentary panel on Thursday.", "url": "https://www.ndtv.com/india-news/paytm-ola-bosses-others-to-meet-panel-on-anti-competition-concerns-3178293", "urlToImage": "https://c.ndtvimg.com/2021-09/j8j3lrk_paytm-ceo-vijay-shekhar-sharma_625x300_14_September_21.jpg", "publishedAt": "2022-07-20T18:20:52Z", "content": "Bosses of 8 tech firms including Paytm's Vijay Shekhar Sharma will appear before a parliamentary panel\r\nNew Delhi: Top executives of eight domestic tech firms, including Paytm founder Vijay Shekhar S… [+2311 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "KGF Actor Yash And Radhika Pandit Are \"Lost In A Far Away Land\". See Pics", "description": "\"In the world of Cheese and Gelato.. where the sun hangs out till late!,\" wrote Radhika Pandit", "url": "https://www.ndtv.com/entertainment/kgf-actor-yash-and-radhika-pandit-are-lost-in-a-far-away-land-see-vacation-pics-3178292", "urlToImage": "https://c.ndtvimg.com/2022-07/h9c45v2_yash_625x300_20_July_22.jpg", "publishedAt": "2022-07-20T18:20:42Z", "content": "Radhika Pandit shared this picture. (courtesy: iamradhikapandit)\r\nKGF actor Yash's wife Radhika Pandit has shared stunning pictures from their recent vacation from an undisclosed location, and we can… [+1381 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Robert Lewandowski Says 'Hungry' For Success At Barcelona Unveiling", "description": "The Polish striker, signed from Bayern Munich for around 50 million euros, was formally introduced as a Barca player alongside club president Joan Laporta.", "url": "https://sports.ndtv.com/football/robert-lewandowski-says-hungry-for-success-at-barcelona-unveiling-3178278", "urlToImage": "https://c.ndtvimg.com/2022-07/5ks8kkb8_robert-lewandowski_625x300_20_July_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-20T18:16:28Z", "content": "Robert Lewandowski was officially unveiled as a Barcelona player on Wednesday and insisted he still has the hunger to continue his incredible goalscoring exploits. The Polish striker, signed from Bay… [+1542 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Man Involved In Propagating Jihad Against India Arrested\": Probe Agency", "description": "A \"highly radicalised\" individual involved in propagating \"jihad\" against India was arrested from Bihar by the National Investigation Agency (NIA), an official said on Wednesday.", "url": "https://www.ndtv.com/india-news/man-involved-in-propagating-jihad-against-india-arrested-from-bihar-probe-agency-nia-3178252", "urlToImage": "https://c.ndtvimg.com/2018-12/9cmll0r_nia-generic-650_625x300_27_December_18.jpg", "publishedAt": "2022-07-20T18:02:59Z", "content": "The case is related to arrest of six active cadres of proscribed organization JMB\r\nNew Delhi: A \"highly radicalised\" individual involved in propagating \"jihad\" against India was arrested from Bihar b… [+1358 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Dance, Drums And Delight: 90-Year-Old Indian Woman Visits Her Pak Home", "description": "As 90-year-old Indian woman Reena Varma stands on the balcony of the house in Pakistan where she was born, visiting on Wednesday for the first in 75 years, she recalls her playful childhood.", "url": "https://www.ndtv.com/india-news/reena-varma-dance-drums-and-delight-90-year-old-indian-woman-visits-her-pak-home-3177988", "urlToImage": "https://c.ndtvimg.com/2022-07/hla492n4_reena-varma_625x300_20_July_22.jpg", "publishedAt": "2022-07-20T17:50:08Z", "content": "Reena Varma danced with some of the residents who beat drums.\r\nRawalpindi: As 90-year-old Indian woman Reena Varma stands on the balcony of the house in Pakistan where she was born, visiting on Wedne… [+2669 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine's First Lady To US Congress: \"Help Us Stop This Terror\"", "description": "Ukraine's first lady made an emotional pitch Wednesday to US lawmakers for more weapons to fight Russian invaders, saying she spoke for millions of parents fearing for their children.", "url": "https://www.ndtv.com/world-news/olena-zelenska-russia-ukraine-war-ukraines-first-lady-to-us-congress-help-us-stop-this-terror-3178223", "urlToImage": "https://c.ndtvimg.com/2022-07/r0k3iqnk_olena-zelenska_625x300_20_July_22.jpg", "publishedAt": "2022-07-20T17:48:34Z", "content": "Russia-Ukraine War: Ukraine's first lady Olena Zelenska made an emotional pitch to US lawmakers.\r\nWashington: Ukraine's first lady made an emotional pitch Wednesday to US lawmakers for more weapons t… [+2081 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "NASA's 1st Uncrewed Moon Rocket To Launch In August: Details Here", "description": "Mark your calendars: NASA's Artemis program to return to the Moon could launch its first uncrewed test flight as soon as August 29, the agency said Wednesday.", "url": "https://www.ndtv.com/world-news/nasas-1st-uncrewed-moon-rocket-to-launch-in-august-details-here-3178208", "urlToImage": "https://c.ndtvimg.com/2022-03/2gegsi2o_artemis-i_625x300_18_March_22.jpg", "publishedAt": "2022-07-20T17:42:25Z", "content": "NASA: The decision follows final checks on the ground at the Kennedy Space Center.\r\nWashington: Mark your calendars: NASA's Artemis program to return to the Moon could launch its first uncrewed test … [+2074 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Bajrang Dal Worker Attacked In Madhya Pradesh For Supporting Nupur Sharma", "description": "Ayush Jadam, a member of right wing Bajrang Dal, has been attacked in Agar town of Madhya Pradesh for allegedly making statements in support of Nupur Sharma.", "url": "https://www.ndtv.com/india-news/bajrang-dal-man-attacked-in-madhya-praesh-for-supporting-nupur-sharma-3178203", "urlToImage": "https://c.ndtvimg.com/2022-07/drueg5vo_bajrang-dal-man-beaten-650_625x300_20_July_22.jpg", "publishedAt": "2022-07-20T17:40:04Z", "content": "\"They said I would be beheaded for supporting Nupur Sharma,\" the Bajrang Dal worker said\r\nBhopal: A member of right wing Bajrang Dal has been attacked in Agar town of Madhya Pradesh, allegedly for ma… [+1429 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Fire Onboard Aircraft Carrier INS Vikramaditya, No Casualties Reported", "description": "A fire broke out at the aircraft carrier INS Vikramaditya while operating off the Karnataka coast today, the Indian Navy said in a statement. The fire was brought under control by the crew. No casualties were reported, the navy said.", "url": "https://www.ndtv.com/india-news/fire-onboard-aircraft-carrier-ins-vikramaditya-no-casualties-reported-3178201", "urlToImage": "https://c.ndtvimg.com/2022-07/ibq5tu8o_ins-vikramaditya_625x300_20_July_22.jpg", "publishedAt": "2022-07-20T17:38:44Z", "content": "A board of inquiry has been formed to probe fire onboard aircraft carrier INS Vikramaditya\r\nNew Delhi: A fire broke out at the aircraft carrier INS Vikramaditya while operating off the Karnataka coas… [+681 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "The Gray Man Mumbai Premiere: Dhanush And Russo Brothers Arrive In Style", "description": "The Gray Man will begin streaming on Netflix from July 22", "url": "https://www.ndtv.com/entertainment/the-gray-man-mumbai-premiere-dhanush-and-russo-brothers-arrive-in-style-3178190", "urlToImage": "https://c.ndtvimg.com/2022-07/17kdv4t8_dhanush_625x300_20_July_22.jpg", "publishedAt": "2022-07-20T17:35:55Z", "content": "Dhanush posed with Russo Brothers at the The Gray Man premiere.\r\nDhanush is gearing up for his big Hollywood debut with Russo Brothers' The Gray Man, starring Ryan Gosling and Chris Evans in the lead… [+1965 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Man Who Shot Lady Gaga's Dog Walker Was Released Due To \"Clerical Error\"", "description": "US authorities were on Wednesday searching for the suspect accused of shooting Lady Gaga's dog walker in 2021, months after he was accidentally released from custody.", "url": "https://www.ndtv.com/world-news/lady-gaga-man-who-shot-lady-gagas-dog-walker-was-released-due-to-clerical-error-3178189", "urlToImage": "https://c.ndtvimg.com/2022-06/aud8mnro_lady-gaga-_625x300_14_June_22.jpg", "publishedAt": "2022-07-20T17:35:54Z", "content": "US authorities offered $5,000 for information about the suspect.\r\nLos Angeles: US authorities were on Wednesday searching for the suspect accused of shooting Lady Gaga's dog walker in 2021, months af… [+1285 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Teesta Setalvad Part Of Conspiracy To Frame PM In Riots Cases, Court Told", "description": "Social activist Teesta Setalvad was part of a larger conspiracy to frame the then-Gujarat Chief Minister Narendra Modi and others as accused in the post-Godhra riots cases.", "url": "https://www.ndtv.com/india-news/teesta-setalvad-part-of-conspiracy-to-frame-pm-in-riots-cases-court-told-3178182", "urlToImage": "https://i.ndtvimg.com/i/2016-05/teesta-setalvad_650x400_41462885799.jpg", "publishedAt": "2022-07-20T17:34:40Z", "content": "Teesta Setalvad was arrested last month by the Ahmedabad crime branch\r\nAhmedabad: Social activist Teesta Setalvad was part of a larger conspiracy to frame the then-Gujarat Chief Minister Narendra Mod… [+3696 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UP Builder Burns Contractor To Death Over Rs 18 Lakh Payment, Arrested", "description": "An 59-year-old contractor was allegedly charred to death on Wednesday by a builder and his accountant inside the builder's house here in Shyam Nagar locality in Chakeri area, police said.", "url": "https://www.ndtv.com/india-news/up-kanpur-builder-arrested-for-burning-contractor-to-death-over-rs-18-lakh-payment-in-kanpur-3178173", "urlToImage": "https://c.ndtvimg.com/2021-06/1d9stjf8_up-police-generic_625x300_24_June_21.jpg", "publishedAt": "2022-07-20T17:32:46Z", "content": "The police registered an FIR on charges of murder against builder and arrested him.\r\nKanpur (UP): An 59-year-old contractor was allegedly charred to death on Wednesday by a builder and his accountant… [+1290 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Supreme Court Junks Review Plea On CBI Probe Against Mumbai's Ex Top Cop", "description": "The Supreme Court dismissed the plea filed by the Maharashtra government seeking a review of its order transferring the probe to the CBI against former Mumbai police commissioner Param Bir Singh over allegations of misconduct and corruption.", "url": "https://www.ndtv.com/india-news/param-bir-singh-supreme-junks-review-plea-on-cbi-probe-against-mumbais-ex-top-cop-3177618", "urlToImage": "https://c.ndtvimg.com/2021-03/rrthqfk_param-bir-singh-pti_625x300_20_March_21.jpg", "publishedAt": "2022-07-20T17:23:13Z", "content": "Param Bir Singh is also accused of extorting nine lakh and mobile phones worth 2.92 lakh.\r\nNew Delhi: The Supreme Court Wednesday dismissed the plea filed by the Maharashtra government seeking a revi… [+3891 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "BJP Slips In Madhya Pradesh Mayoral Polls, Retains Municipal Bodies - NDTV", "description": "<ol><li>BJP Slips In Madhya Pradesh Mayoral Polls, Retains Municipal Bodies  NDTV\r\n</li><li>MP urban body election results: After Gwalior, BJP loses Morena Municipal Corporation  Times of India\r\n</li><li>MP Municipal Polls Results Highlights: BJP loses 7 muni…", "url": "https://www.ndtv.com/india-news/bjp-slips-in-madhya-pradesh-mayoral-polls-retains-municipal-bodies-3178110", "urlToImage": "https://c.ndtvimg.com/2022-07/u5kchvv8_madhya-pradesh-mayor-election_625x300_20_July_22.jpg", "publishedAt": "2022-07-20T17:13:29Z", "content": "Madhya Pradesh Chief Minister Shivraj Singh Chouhan congratulated party workers\r\nBhopal: In 2014, the BJP swept the mayoral elections in Madhya Pradesh by scoring all 16 seats. This year, however, th… [+3149 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Priyanka Chopra With Daughter Malti Marie In Best Friend Tamanna Dutt's Belated Birthday Post - NDTV Movies", "description": "<ol><li>Priyanka Chopra With Daughter Malti Marie In Best Friend Tamanna Dutt's Belated Birthday Post  NDTV Movies\r\n</li><li>Priyanka Chopra Holds Daughter Malti Close In Stunning New Pic From Her Birthday Bash; See Here  News18\r\n</li><li>View Full coverage o…", "url": "https://www.ndtv.com/entertainment/priyanka-chopra-with-daughter-malti-marie-in-best-friend-tamanna-dutts-belated-birthday-post-3177946", "urlToImage": "https://c.ndtvimg.com/2022-07/fh1bgimg_priyanka_625x300_20_July_22.jpg", "publishedAt": "2022-07-20T16:19:41Z", "content": "Tamanna Dutt shared this picture. (courtesy: tam2cul)\r\nPriyanka Chopra's best friend Tamanna Dutt has treated the actress' fans to a new picture of Priyanka and daughter Malti Marie Chopra-Jonas. Tam… [+1737 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Stokes Is Once-In-A-Generation Player, England'll Miss Him In ODIs: Buttler", "description": "The chief architect of England's historic 2019 World Cup triumph, Stokes ended his 105-match ODI career with a forgettable 5-run innings at his home ground here in Durham as England lost to South Africa by 62 runs to trail 0-1 in the three-match series.", "url": "https://sports.ndtv.com/cricket/ben-stokes-is-once-in-a-generation-player-england-will-miss-him-in-odis-jos-buttler-3177893", "urlToImage": "https://c.ndtvimg.com/2022-07/fh1c9cng_ben-stokes_625x300_20_July_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-20T16:05:04Z", "content": "England white-ball captain Jos Buttler has described Ben Stokes as \"once-in-a-generation player\", while his predecessor Eoin Morgan hailed him as a \"true leader\" after the star allrounder retired fro… [+2054 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "DTU Gets 2 New Hostels, To Accommodate 1,000 More Students", "description": "The newly constructed hostels are said to be equipped with fully furnished and air conditioned rooms, a TV Room, a gymnasium, indoor games area, a reading and internet room, a dining room, a parlour, an activity room, and a guest room.", "url": "https://www.ndtv.com/education/delhi-technological-university-gets-2-new-hostels-to-accommodate-1000-more-students", "urlToImage": "https://cache.careers360.mobi/media/presets/814X449/article_images/2022/7/20/Delhi_Technological_University.png", "publishedAt": "2022-07-20T15:57:30Z", "content": "New Delhi:Two new hostels with capacity to accommodate 1,000 students were inaugurated at the Delhi Technological University (DTU) on Wednesday. With the inauguration of the new hostels, DTU can now … [+1712 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Not In A Position To Host Asia Cup T20, SLC Tells Asian Cricket Council", "description": "The development comes after the SLC recently postponed the third edition of the Lanka Premier League (LPL) due to the ongoing crisis.", "url": "https://sports.ndtv.com/cricket/not-in-a-position-to-host-asia-cup-t20-slc-tells-asian-cricket-council-3177864", "urlToImage": "https://c.ndtvimg.com/2021-09/vk3knca8_sri-lanka-cricket-team-afp_625x300_12_September_21.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-20T15:57:01Z", "content": "Sri Lanka Cricket (SLC) on Wednesday informed the Asian Cricket Council (ACC) that the board will not be in a position to host the upcoming edition of the Asia Cup T20 because of the economic and pol… [+1009 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Adarsh Srivastava", "title": "Panjab University Issues PUTHAT 2022 Answer Key; Steps To Download", "description": "Panjab University (PU) Chandigarh has released the Panjab University Tourism & Hospitality Aptitude Test (PUTHAT) 2022 answer key today, July 20.", "url": "https://www.ndtv.com/education/panjab-university-issues-puthat-2022-answer-key-direct-link-steps-download", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/20/PUTHAT-2022-Answer-Key.jpg", "publishedAt": "2022-07-20T15:48:59Z", "content": "New Delhi:PUTHAT 2022: Panjab University (PU) Chandigarh has released the Panjab University Tourism &amp; Hospitality Aptitude Test (PUTHAT) 2022 answer key today, July 20. Candidates who appeared fo… [+1628 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "No Kashmiri Pandit Left Valley Since Article 370 Removed, Government Tells Parliament - NDTV", "description": "<ol><li>No Kashmiri Pandit Left Valley Since Article 370 Removed, Government Tells Parliament  NDTV\r\n</li><li>Live News: 128 security force personnel and 118 civilians have been killed by terrorists in J&K in...  Moneycontrol\r\n</li><li>No Kashmiri Pandit migr…", "url": "https://www.ndtv.com/india-news/no-kashmiri-pandit-has-left-valley-since-article-370-removed-central-government-tells-parliament-3177520", "urlToImage": "https://c.ndtvimg.com/2022-06/q6a30ugo_kashmiri-pandit-protests_625x300_20_June_22.jpg", "publishedAt": "2022-07-20T15:48:00Z", "content": "On June 20, Kashmiri Pandits holding a protest in Budgam, around 25 km from Srinagar. (File)\r\nDelhi: No Kashmiri Pandit has migrated from the Valley since August 5, 2019, when Article 370 was removed… [+2583 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UK Heatwave Forces Amusement Park Guests To Walk Down The Rollercoaster", "description": "Some unfortunate people caught on a rollercoaster at Staffordshire's Alton Towers amusement park were forced to go down a flight of stairs to reach the ground.", "url": "https://www.ndtv.com/world-news/uk-heatwave-forces-amusement-park-guests-to-walk-down-the-rollercoaster-3177796", "urlToImage": "https://c.ndtvimg.com/2022-07/4j455d9g_roller-coaster_625x300_20_July_22.jpg", "publishedAt": "2022-07-20T15:41:33Z", "content": "The ride was unable to get started because of the evacuation process\r\nThe United Kingdom is experiencing severe heatwaves, with temperature breaking all-time records and power outages due to overheat… [+1289 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Fact-Checker Mohammed Zubair Leaves Jail As Court Ends \"Vicious Cycle\"", "description": "Fact checker Mohammed Zubair was released from the Tihar jail today, hours after being granted interim bail by the Supreme Court in all cases filed against him.", "url": "https://www.ndtv.com/india-news/fact-checker-mohammed-zubair-leaves-jail-as-court-ends-vicious-cycle-3177794", "urlToImage": "https://c.ndtvimg.com/2022-07/tsarv618_mohammed-zubair-out-of-jail-650_650x400_20_July_22.jpg", "publishedAt": "2022-07-20T15:40:21Z", "content": "Mohammed Zubair walked out of jail after 9 pm on Wednesday\r\nNew Delhi: Fact-checker Mohammed Zubair, who was granted bail by the Supreme Court after his arrest last month over what the police said wa… [+2547 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rishi Sunak: On The Tough Road To Become The \"Custodian Of UK\"", "description": "Rishi Sunak is now the closest anyone of Indian origin has ever been to take charge as British Prime Minister, after his Conservative Party colleagues voted overwhelmingly in his favour with 137 votes in the final round on Wednesday.", "url": "https://www.ndtv.com/world-news/rishi-sunak-on-the-tough-road-to-become-the-custodian-of-uk-3177771", "urlToImage": "https://c.ndtvimg.com/2022-07/dktbbano_rishi-sunak-reuters-650_625x300_14_July_22.jpg", "publishedAt": "2022-07-20T15:32:58Z", "content": "Rishi Sunak will be up against Liz Truss to take charge as British Prime Minister.\r\nLondon: It is official Rishi Sunak is now the closest anyone of Indian origin has ever been to take charge as Briti… [+5189 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rishi Sunak, Liz Truss Final 2 Candidates In Race For UK PM - NDTV", "description": "<ol><li>Rishi Sunak, Liz Truss Final 2 Candidates In Race For UK PM  NDTV\r\n</li><li>UK: Rishi Sunak tops 4th leadership ballot, but winning Conservative party base a challenge  Times of India\r\n</li><li>'Dirtiest campaign ever': UK MP calls for party inquiry a…", "url": "https://www.ndtv.com/world-news/rishi-sunak-liz-truss-final-2-candidates-in-race-for-uk-pm-3177656", "urlToImage": "https://c.ndtvimg.com/2020-03/55m8agps_rishi-sunak-reuters-650_625x300_11_March_20.jpg", "publishedAt": "2022-07-20T15:30:27Z", "content": "Rishi Sunak clinched his place for the final leg of the race to succeed Boris Johnson\r\nNew Delhi: It is official - Rishi Sunak is now the closest anyone of Indian origin has ever been to take charge … [+5504 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Rashi Hardaha", "title": "NTA Issues ICAR AIEEA 2022 Application Form; Direct Link To Apply", "description": "ICAR AIEEA Application Form 2022: Students willing to take admission to the UG and PG courses can fill and submit the ICAR AIEEA registration form2022 on the official website-- icar.nta.nic.in. The last date to apply for ICAR AIEEA 2022 is August 19.", "url": "https://www.ndtv.com/education/nta-issues-icar-aieea-2022-application-form-direct-link-to-apply-icar-nta-nic-in", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/20/icar_aieea.jpg", "publishedAt": "2022-07-20T15:29:03Z", "content": "ICAR AIEEA Application Form 2022: The National Testing Agency (NTA) has released the application form for the Indian Council of Agricultural Research (ICAR) All India Entrance Examination in Agricult… [+1964 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "So Close To Clinching Spot, Rishi Sunak's Major Challenge: Image Problem", "description": "Rishi Sunak will claim credit for steering Britain's economy through the COVID-19 crash but must overcome accusations that he is too rich and too willing to raise taxes to win the race to be the next prime minister.", "url": "https://www.ndtv.com/world-news/rishi-sunak-so-close-to-clinching-spot-rishi-sunaks-major-challenge-image-problem-3177724", "urlToImage": "https://c.ndtvimg.com/2022-07/dktbbano_rishi-sunak-reuters-650_625x300_14_July_22.jpg", "publishedAt": "2022-07-20T15:26:04Z", "content": "UK Prime Minister Run-Off: Rishi Sunak will face off against Liz Truss in the UK PM run-off.\r\nLondon: Rishi Sunak will claim credit for steering Britain's economy through the COVID-19 crash but must … [+4403 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"If You Try To...\": Ranil Wickremesinghe Warns Sri Lanka Protesters", "description": "Sri Lanka's president-elect vowed on Wednesday to take tough action against anyone resorting to what he called the undemocratic means that led to his predecessor's ouster.", "url": "https://www.ndtv.com/world-news/sri-lanka-crisis-if-you-try-to-ranil-wickremesinghe-warns-sri-lanka-protesters-3177748", "urlToImage": "https://c.ndtvimg.com/2022-07/vmfrefng_ranil-wickremesinghe-reuters-650_625x300_20_July_22.jpg", "publishedAt": "2022-07-20T15:25:51Z", "content": "Sri Lanka Crisis: Sri Lanka is facing its worst economic crisis since gaining independence.\r\nColombo: Sri Lanka's president-elect vowed on Wednesday to take tough action against anyone resorting to w… [+1618 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Viral: Nick Dances With Mother-In-Law In A Video From Priyanka's Birthday", "description": "Priyanka Chopra celebrated her 40th birthday on Monday", "url": "https://www.ndtv.com/entertainment/viral-nick-jonas-dancing-with-mother-in-law-madhu-chopra-in-a-video-from-priyankas-40th-birthday-3177741", "urlToImage": "https://c.ndtvimg.com/2022-07/c8bojfio_priyanka_625x300_20_July_22.jpg", "publishedAt": "2022-07-20T15:24:25Z", "content": "A still from the video. (courtesy: @np_legacy)\r\nPriyanka Chopra recently celebrated her 40th birthday with her family and friends on Monday. Now, a video from the party is doing rounds on the interne… [+1676 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Watch: Will Rishi Sunak Make History?", "description": "42-year-old Rishi Sunak is tantalisingly close to becoming the next Prime Minister of the UK. The former Finance Minister could make history, if he does indeed win the leadership contest in the Conservative party on September 5", "url": "https://www.ndtv.com/world-news/will-rishi-sunak-make-history-hot-mic-with-nidhi-razdan-3177729", "urlToImage": "https://c.ndtvimg.com/2022-07/mne3o9j8_hot-mic-with-nidhi-razdan_625x300_20_July_22.jpg", "publishedAt": "2022-07-20T15:22:24Z", "content": "Hi, this is Hot Mic and I'm Nidhi Razdan.\r\n42-year-old Rishi Sunak is tantalisingly close to becoming the next Prime Minister of the UK. The former Finance Minister could make history if he does inde… [+4173 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Watch: Cheteshwar Pujara \"Does It Again\", Scores 3rd Double Ton For Sussex", "description": "Courtesy Cheteshwar Pujara's double ton, Sussex crossed the 500-run mark in the first innings against Middlesex.", "url": "https://sports.ndtv.com/cricket/cheteshwar-pujara-does-it-again-scores-third-double-century-for-sussex-in-county-championship-watch-3177698", "urlToImage": "https://c.ndtvimg.com/2022-07/b04sv54o_cheteshwar-pujara-afp_625x300_03_July_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-20T15:16:16Z", "content": "Cheteshwar Pujara has continued his fine form for Sussex. On Day 2 of their match against Middlesex in the County Championship Division Two, Pujara scored his third double ton this season. Courtesy P… [+1563 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "26-Week Pregnant Minor Rape Survivor Allowed Abortion By Delhi High Court", "description": "The Delhi High Court has allowed a minor rape survivor to undergo medical termination of pregnancy after 26 weeks, saying her misery and suffering would stand compounded if she was forced to bear the mantle of motherhood at a tender age.", "url": "https://www.ndtv.com/delhi-news/26-week-pregnant-minor-rape-survivor-allowed-abortion-by-delhi-high-court-3177646", "urlToImage": "https://i.ndtvimg.com/i/2018-01/delhi-high-court_650x400_51516587873.jpg", "publishedAt": "2022-07-20T15:04:19Z", "content": "Delhi High Court allowed a minor rape survivor to undergo medical termination of pregnancy\r\nNew Delhi: The Delhi High Court has allowed a minor rape survivor to undergo medical termination of pregnan… [+3053 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Laal Singh Chaddha New Poster: Presenting Naga Chaitanya As Balaraju", "description": "Laal Singh Chaddha: Naga Chaitanya plays Aamir Khan's best friend in the film", "url": "https://www.ndtv.com/entertainment/laal-singh-chaddha-new-poster-presenting-naga-chaitanya-as-balaraju-3177641", "urlToImage": "https://c.ndtvimg.com/2022-07/ic81m8i_naga-chaitanya_625x300_20_July_22.jpg", "publishedAt": "2022-07-20T15:03:46Z", "content": "Naga Chaitanya in Laal Singh Chaddha. (courtesy: aamirkhanproductions)\r\nNew Delhi: The makers of Laal Singh Chaddha shared a brand new poster from the film on Wednesday. The poster features Naga Chai… [+1803 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Mathura Court To Hear Petition Seeking Survey Of Shahi Idgah Next Month", "description": "A court in Mathura will hear on August 16 the petition seeking a survey of the Shahi Eidgah and Jahanara's mosque by the Archaeological Survey of India and the objections filed to it by the Sunni Central Waqf Board.", "url": "https://www.ndtv.com/india-news/mathura-court-to-hear-petition-seeking-survey-of-shahi-idgah-next-month-3177630", "urlToImage": "https://c.ndtvimg.com/2022-05/nn1m4r7o_krishna-janmabhoomi-shahi-idgah-mosque-case-mathura-pti_625x300_07_May_22.jpg", "publishedAt": "2022-07-20T15:01:24Z", "content": "Mathura: A court in Mathura will hear on August 16 the petition seeking a survey of the Shahi Idgah and Jahanara's mosque by the Archaeological Survey of India and the objections filed to it by the S… [+1380 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "NASA Shares Stunning Rainbow Coloured Image Of Pluto, Internet Amazed - NDTV", "description": "<ol><li>NASA Shares Stunning Rainbow Coloured Image Of Pluto, Internet Amazed  NDTV\r\n</li><li>NASA's 'Rainbow Planet' | Can You Identify It? #shorts #pluto #nasa  MIRROR NOW\r\n</li><li>View Full coverage on Google News</li></ol>", "url": "https://www.ndtv.com/world-news/nasa-shares-stunning-rainbow-coloured-image-of-pluto-internet-amazed-3177553", "urlToImage": "https://c.ndtvimg.com/2022-07/qn14k3u_pluto-coloured-images_625x300_20_July_22.jpg", "publishedAt": "2022-07-20T14:52:00Z", "content": "Picture shows shows various sections of Pluto in rainbow-like colours and stunning effects.\r\nAmerican Space Agency NASA frequently shares amazing photographs on its social media platforms. A recent p… [+1878 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Truck Driver Who Ran Over Police Officer In Haryana Arrested - NDTV", "description": "<ol><li>Truck Driver Who Ran Over Police Officer In Haryana Arrested  NDTV\r\n</li><li>Haryana Dy CM Lists Steps To Curb Illegal Mining, Assures DSP's Killers Will Be Nabbed In 24 Hrs  India Today\r\n</li><li>Haryana DSP murder: Main accused, a truck driver, nabb…", "url": "https://www.ndtv.com/india-news/truck-driver-who-ran-over-police-officer-in-haryana-arrested-3177465", "urlToImage": "https://c.ndtvimg.com/2022-07/v7tbl8jo_police-officer-run-over-by-mining-mafia-ndtv-650_650x400_19_July_22.jpg", "publishedAt": "2022-07-20T14:28:00Z", "content": "Haryana police officer Surendra Singh Bishnoi was run over by a truck while stopping illegal mining\r\nNew Delhi: A truck driver who ran over a police officer during illegal mining check in Haryana has… [+1200 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Microsoft Offers Data Control, Launches 'Sovereign' Cloud For Governments", "description": "Microsoft on Tuesday launched a public cloud for government customers, offering greater control over their data", "url": "https://www.ndtv.com/business/microsoft-offers-greater-data-control-launches-sovereign-cloud-for-governments-3177356", "urlToImage": "https://c.ndtvimg.com/2022-07/plm8lomo_image_625x300_20_July_22.jpg", "publishedAt": "2022-07-20T13:53:39Z", "content": "Microsoft launches 'sovereign' cloud for governments\r\nMicrosoft on Tuesday launched a public cloud for government customers, offering greater control over their data, and has signed up Italian defenc… [+1440 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ex Karnataka Minister Cleared In Contractor Suicide Case - NDTV", "description": "<ol><li>Ex Karnataka Minister Cleared In Contractor Suicide Case  NDTV\r\n</li><li>Udupi Police Give Clean Chit To Eshwarappa | No Evidence Found Against Former BJP Leader | Breaking  TIMES NOW\r\n</li><li>Udupi police file B Report in contractor Santosh Patil de…", "url": "https://www.ndtv.com/india-news/former-karnataka-minister-ks-eshwarappa-named-by-contractor-who-died-by-suicide-cleared-in-probe-by-cops-3177113", "urlToImage": "https://c.ndtvimg.com/2022-02/b5e87pg8_k-seshwarappa_625x300_21_February_22.jpg", "publishedAt": "2022-07-20T13:50:14Z", "content": "Former Karnataka minister, the BJP's KS Eshwarappa, who had to step down from the post after a huge controversy following the suicide of a contractor, has been cleared by the police after investigati… [+1835 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Census Data Can't Be Used To Prep National Register Of Citizens: Centre", "description": "Data from the census, whenever the exercise is carried out, cannot be used to prepare any other database including the National Register of Citizens, or NRC, the Home Ministry has said.", "url": "https://www.ndtv.com/india-news/census-data-cant-be-used-to-prep-national-register-of-citizens-centre-3177342", "urlToImage": "https://c.ndtvimg.com/2019-08/goqu4lgo_nrc-assam-people-pti_625x300_31_August_19.jpg", "publishedAt": "2022-07-20T13:48:15Z", "content": "The NRC exercise was first done in Assam\r\nNew Delhi: Data from the census, whenever the exercise is carried out, cannot be used to prepare any other database including the National Register of Citize… [+2732 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "IPhone Maker Foxconn Partners With Chipmaker NXP Semiconductors", "description": "Taiwan's Foxconn said on Wednesday it has partnered with chipmaker NXP Semiconductors to develop platforms for electric vehicles, adding to a string of such deals by the iPhone assembler as it moves into the auto market.", "url": "https://www.ndtv.com/business/iphone-maker-foxconn-partners-with-chipmaker-nxp-semiconductors-3177339", "urlToImage": "https://c.ndtvimg.com/2022-07/4amhda1o_image_625x300_20_July_22.jpg", "publishedAt": "2022-07-20T13:46:53Z", "content": "iPhone maker Foxconn builds EV partnership with NXP Semiconductors\r\nTaiwan's Foxconn said on Wednesday it has partnered with chipmaker NXP Semiconductors to develop platforms for electric vehicles, a… [+1241 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Congress Has Destructive Attitude Towards Democracy\", Says Minister", "description": "Union Minister Piyush Goyal slammed the Congress party over disrupting proceedings in the House and said the \"Congress has a destructive attitude towards democracy.\"", "url": "https://www.ndtv.com/india-news/congress-has-destructive-attitude-towards-democracy-says-minister-piyush-goyal-on-parliament-proceedings-3177338", "urlToImage": "https://c.ndtvimg.com/2022-03/icop0c5_piyush-goyalrajya-sabhaani_625x300_25_March_22.jpg", "publishedAt": "2022-07-20T13:46:39Z", "content": "Piyush Goyal said there is competition among opposition over who would disrupt proceedings. (File)\r\nNew Delhi: The government is not running away from debate on price rise and GST and the issues can … [+1750 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Koo To Open Development Center In Hyderabad Under MoU With Telangana", "description": "Koo signed a Memorandum of Understanding (MoU) with Telangana Government to open a Development Center in Hyderabad, the company social-media platform informed.", "url": "https://www.ndtv.com/india-news/koo-to-open-development-center-in-hyderabad-under-mou-signed-with-telangana-3177337", "urlToImage": "https://c.ndtvimg.com/2022-07/tdvk709g_koo-signed-a-memorandum-of-understanding-mou-with-telangana-government_625x300_20_July_22.jpg", "publishedAt": "2022-07-20T13:45:05Z", "content": "Koo signed a Memorandum of Understanding (MoU) with Telangana Government.\r\nHyderabad: Koo signed a Memorandum of Understanding (MoU) with Telangana Government to open a Development Center in Hyderaba… [+989 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Watch: Shafique Gets Rousing Reception From Pakistan Players After SL Win", "description": "The Pakistan players and coaching staff also gave a rousing reception to Abdullah Shafique as he carried his bat back to the team's dressing room in Galle", "url": "https://sports.ndtv.com/cricket/sri-lanka-vs-pakistan-1st-test-abdullah-shafique-gets-rousing-reception-from-teammates-after-match-winning-knock-watch-3177324", "urlToImage": "https://c.ndtvimg.com/2022-07/e2j8ha7o_abdullah-shafique-806_625x300_20_July_22.jpg", "publishedAt": "2022-07-20T13:42:03Z", "content": "Pakistan completed the highest run-chase at the venue to beat Sri Lanka in the first Test at the picturesque Galle International Cricket Stadium on Wednesday. Chasing a total of 342 runs, Pakistan ro… [+1358 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "EU Tells Members To Cut Gas Usage By 15% On New Russia Supply Warning", "description": "The European Union (EU) told member states on Wednesday to cut gas usage by 15 per cent until March as an emergency step after President Vladimir Putin warned that Russian supplies sent via the biggest pipeline to Europe could be reduced further and might eve…", "url": "https://www.ndtv.com/business/eu-tells-members-to-cut-gas-usage-by-15-on-new-russia-supply-warning-3177323", "urlToImage": "https://c.ndtvimg.com/2022-07/drsa5d78_image_625x300_20_July_22.jpg", "publishedAt": "2022-07-20T13:40:52Z", "content": "EU tells members to cut gas usage amid new Putin warning\r\nThe European Union (EU) told member states on Wednesday to cut gas usage by 15 per cent until March as an emergency step after President Vlad… [+5317 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "More Pics From Katrina's Maldives Holiday. Courtesy: Sunny And Isabelle", "description": "Sunny Kaushal and Isabelle Kaif shared new pictures from Katrina's birthday week", "url": "https://www.ndtv.com/entertainment/more-pics-from-katrina-kaifs-maldives-holiday-courtesy-sunny-kaushal-and-isabelle-kaif-3177286", "urlToImage": "https://c.ndtvimg.com/2022-07/fm1edoag_sjunny_625x300_20_July_22.jpg", "publishedAt": "2022-07-20T13:31:36Z", "content": "Sunny Kaushal shared this picture. (courtesy: sunsunnykhez)\r\nNew Delhi: Vicky Kaushal's brother Sunny Kaushal is the latest of the Maldives gang who shared more glimpses from Katrina Kaif's birthday … [+1710 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "World Shares Rally To Hit Three-Week Highs As Recession Fears Recede", "description": "World shares hit a three-week high on Wednesday and US index futures were indicating a steady open on Wall Street as strong US corporate earnings and the expected resumption of Russian gas supply to Europe tempered recession fears.", "url": "https://www.ndtv.com/business/world-shares-rally-to-hit-three-week-high-as-recession-fears-recede-3177285", "urlToImage": "https://c.ndtvimg.com/2022-07/j6u5in7o_image_625x300_20_July_22.jpg", "publishedAt": "2022-07-20T13:31:18Z", "content": "World shares hit three-week high, US futures resilient as recession fears wane\r\nWorld shares hit a three-week high on Wednesday and US index futures were indicating a steady open on Wall Street as st… [+3724 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ahead Of The Gray Man Premiere, Dhanush, Joe Russo Pictured In Mumbai", "description": "The Gray Man marks Dhanush's big international debut", "url": "https://www.ndtv.com/entertainment/ahead-of-the-gray-man-mumbai-premiere-dhanush-and-joe-russo-pictured-at-the-airport-3177284", "urlToImage": "https://c.ndtvimg.com/2022-07/s4qd1508_dhanush_625x300_20_July_22.jpg", "publishedAt": "2022-07-20T13:30:48Z", "content": "Dhanush clicked at the Mumbai airport.\r\nThe Russo Brothers made good on a promise. A couple of weeks ago, the filmmaker-duo announced that they will come to India and so they did (one of them did). J… [+1448 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "On Camera, Massive Ambulance Crash At Toll Booth In Karnataka, 4 Dead - NDTV", "description": "<ol><li>On Camera, Massive Ambulance Crash At Toll Booth In Karnataka, 4 Dead  NDTV\r\n</li><li>Karnataka News: Speeding Ambulance Crashes At Toll Plaza In Kundapura; 4 People Injured  Republic World\r\n</li><li>Video: Speeding ambulance skids on wet road, rams i…", "url": "https://www.ndtv.com/karnataka-news/on-camera-massive-ambulance-crash-at-toll-booth-in-karnataka-3177105", "urlToImage": "https://c.ndtvimg.com/2022-07/95jsqer8_ambulance-accident_625x300_20_July_22.jpg", "publishedAt": "2022-07-20T13:25:19Z", "content": "The ambulance aquaplaned just before hitting the toll booth cabin\r\nBengaluru: An ambulance carrying a patient and two attendants lost control and crashed into a toll booth in Karnataka's Udupi distri… [+1009 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "\"If You Leave Virat Out...\": Ricky Ponting On Why \"It Will Be Hard\" For Kohli To Get Back In - NDTV Sports", "description": "<ol><li>\"If You Leave Virat Out...\": Ricky Ponting On Why \"It Will Be Hard\" For Kohli To Get Back In  NDTV Sports\r\n</li><li>Ricky Ponting analyses Virat Kohli's recent form  International Cricket Council\r\n</li><li>'If I was India's captain or coach, I'd tell …", "url": "https://sports.ndtv.com/t20-world-cup-2022/if-you-leave-virat-out-ricky-ponting-on-why-it-will-be-hard-for-kohli-to-get-back-in-3177163", "urlToImage": "https://c.ndtvimg.com/2022-07/c4pefg8o_virat-kohli-afp_625x300_14_July_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-20T13:11:30Z", "content": "Should Virat Kohli play in the T20 World Cup for the Indian cricket team or not? The former India skipper's lean patch has raised this question which was unthinkable in Indian cricket at one point of… [+1742 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Pranita Chaubey", "title": "Shah Rukh Khan's Fitness Trainer Reveals How The Actor Prepped For His Pathaan Look", "description": "Shah Rukh Khan's Fitness Trainer Reveals How The Actor Prepped For His Pathaan Lookndtv.com", "url": "https://www.ndtv.com/entertainment/shah-rukh-khans-fitness-trainer-reveals-how-the-actor-prepped-for-his-pathaan-look-3177042", "urlToImage": "https://c.ndtvimg.com/2022-07/80jpff_srk_625x300_20_July_22.jpg", "publishedAt": "2022-07-20T12:53:38Z", "content": "SRK will be seen in a new look in Pathaan. (courtesy: iamsrk)\r\nNew Delhi: Shah Rukh Khan created headlines when he dropped his first look from the film Pathaan. The 56-year-year-old actor, who will b… [+1598 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rishi Sunak Could Be 6th Indian-Origin Head Of State If He Wins UK PM Race - NDTV", "description": "<ol><li>Rishi Sunak Could Be 6th Indian-Origin Head Of State If He Wins UK PM Race  NDTV\r\n</li><li>Punjab ancestry, Oxford graduate, ‘proud Hindu’ — all eyes on Rishi Sunak in UK PM race  ThePrint\r\n</li><li>Rishi Sunak Tops Another Round, Is UK Set To Get Ind…", "url": "https://www.ndtv.com/world-news/rishi-sunak-could-be-6th-indian-origin-head-of-state-if-he-wins-uk-pm-race-3176904", "urlToImage": "https://c.ndtvimg.com/2022-07/uldkutmg_rishi-sunak_625x300_19_July_22.jpg", "publishedAt": "2022-07-20T12:17:07Z", "content": "Rishi Sunak has been in lead in previous rounds of voting by Members of British Parliament.\r\nRishi Sunak, the Indian-origin former UK Chancellor, retained the lead in the fourth round of voting on Tu… [+2013 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Fact-Checker Mohammed Zubair To Leave Jail, Court Ends \"Vicious Cycle\" - NDTV", "description": "<ol><li>Fact-Checker Mohammed Zubair To Leave Jail, Court Ends \"Vicious Cycle\"  NDTV\r\n</li><li>'Power of arrest should be used sparingly': SC grants bail to Alt News co-founder Mohammed Zubair  Times of India\r\n</li><li>SC jolt to Yogi govt as top court grants…", "url": "https://www.ndtv.com/india-news/mohammed-zubair-gets-bail-in-all-cases-filed-against-him-3176103", "urlToImage": "https://c.ndtvimg.com/2022-06/gcubof4g_mohamed-zubair-650_650x400_27_June_22.jpg", "publishedAt": "2022-07-20T12:04:00Z", "content": "The court has ordered Mohammed Zubair's release from jail by 6 pm today. (File)\r\nNew Delhi: Fact-checker Mohammed Zubair, arrested last month over what the police said was a \"highly provocative tweet… [+2180 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Vedant Yadav", "title": "Updated World Test Championship Points Table: Pakistan's Win Over Sri Lanka Takes Them To Top-Three,.. - NDTV Sports", "description": "<ol><li>Updated World Test Championship Points Table: Pakistan's Win Over Sri Lanka Takes Them To Top-Three,..  NDTV Sports\r\n</li><li>Pakistan return to 3rd spot in ICC World Test Championship table after historic win over Sri Lanka in Galle  India Today\r\n</l…", "url": "https://sports.ndtv.com/cricket/updated-world-test-championship-points-table-pakistans-win-over-sri-lanka-takes-them-to-top-three-india-fourth-3176773", "urlToImage": "https://c.ndtvimg.com/2022-07/3l5acr6g_babar-azam-abdullah-shafique-afp_625x300_20_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-20T11:43:02Z", "content": "Pakistan on Wednesday reclaimed the third spot in the World Test Championship tables after beating Sri Lanka in the first Test at the Galle International Stadium. Riding on Abdullah Shafique's unbeat… [+1364 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Explained: How Votes Are Counted In Presidential Election - NDTV", "description": "<ol><li>Explained: How Votes Are Counted In Presidential Election  NDTV\r\n</li><li>Spotlight on EVMs after presidential election  The Shillong Times\r\n</li><li>India to get its 15th President on Thursday: How votes are counted  Hindustan Times\r\n</li><li>OPINION…", "url": "https://www.ndtv.com/india-news/presidential-election-explained-how-votes-are-counted-3176762", "urlToImage": "https://c.ndtvimg.com/2022-07/p5or0gc_rashtrapati-bhavan-pti_625x300_20_July_22.jpg", "publishedAt": "2022-07-20T11:40:29Z", "content": "<li>First, the votes will be sorted and checked by returning officers.\r\n</li><li>MPs have written down their order of preferences for the candidates on ballot papers using green pens, while MLAs have… [+1041 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Amid Rise In Covid Cases, Centre Asks States To Monitor Home Isolation Cases", "description": "The Centre urged the states and Union territories on Wednesday to strictly monitor the home isolation cases of COVID-19 so that these patients do not intermingle in the community.", "url": "https://www.ndtv.com/india-news/amid-rise-in-covid-cases-centre-asks-states-to-monitor-home-isolation-cases-3176726", "urlToImage": "https://c.ndtvimg.com/2022-07/50bgo9ig_india-covid-pti-650_625x300_03_July_22.jpg", "publishedAt": "2022-07-20T11:33:49Z", "content": "New Delhi: The Centre urged the states and Union territories on Wednesday to strictly monitor the home isolation cases of COVID-19 so that these patients do not intermingle in the community, while st… [+5149 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Kartik's First Car Was \"Third-Hand.\" Now, He Owns Lamborghini, McLaren GT", "description": "\"I used to go (to red carpets) by auto or take a lift from someone or go with someone on a bike,\" Kartik said", "url": "https://www.ndtv.com/entertainment/kartik-aaryans-first-car-was-third-hand-now-he-owns-a-lamborghini-and-a-mclaren-gt-3176718", "urlToImage": "https://c.ndtvimg.com/2022-07/an2m7pf8_kartik_625x300_20_July_22.jpg", "publishedAt": "2022-07-20T11:32:18Z", "content": "Kartik Aaryan shared this pic. (courtesy: kartikaaryan)\r\nNew Delhi: Kartik Aaryan recently opened up about the first car he purchased during the initial years of his career, in an interview with Boll… [+2045 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Lok Sabha Adjourned For Day Amid Opposition Protests Over Price Rise", "description": "Proceedings in Lok Sabha were disrupted for the third day due to continued vociferous protests by opposition members who were demanding an urgent discussion over price rise and the imposition of the GST on some daily-use items.", "url": "https://www.ndtv.com/india-news/lok-sabha-adjourned-for-day-amid-opposition-protests-over-price-rise-3176673", "urlToImage": "https://c.ndtvimg.com/2022-07/iastogbc_lok-sabha-parliament_625x300_20_July_22.jpg", "publishedAt": "2022-07-20T11:21:28Z", "content": "New Delhi: Proceedings in Lok Sabha were disrupted for the third day due to continued vociferous protests by opposition members who were demanding an urgent discussion over price rise and the imposit… [+1448 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Watch: Harbhajan Impressed By This Differently-Abled Indian Cricketer", "description": "Harbhajan Singh commented \"Respect\" with a couple of emojis on the video of Shankara posted by Differently Abled Cricket Council of India.", "url": "https://sports.ndtv.com/cricket/harbhajan-singh-impressed-by-this-differently-abled-indian-cricketers-batting-display-watch-3176635", "urlToImage": "https://c.ndtvimg.com/2022-07/sl6re4bg_g-shiva-shankara_625x300_20_July_22.jpg", "publishedAt": "2022-07-20T11:13:46Z", "content": "India is a land of talented cricketers. It's not only the big cities, but often prodigious talents emerge from small town and villages too in the country. Not all of them are celebrities also, but ye… [+1956 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Nysa Devgan And Others Are At This Celeb-Favourite Destination", "description": "Jasmin Bhasin, Amy Jackson and other stars are also holidaying in Spain", "url": "https://www.ndtv.com/entertainment/spain-is-the-new-celeb-favourite-destination-see-pics-from-nysa-devgan-mandira-bedi-and-other-stars-albums-3176628", "urlToImage": "https://c.ndtvimg.com/2022-07/obq0fh98_nysa_625x300_20_July_22.jpg", "publishedAt": "2022-07-20T11:12:36Z", "content": "All the celebs holidaying in Spain. (courtesy: vedantmahajan10)\r\nNew Delhi: While Katrina Kaif-Vicky Kaushal and their group of friends, decided to holiday in the celeb-approved staple Maldives, anot… [+1873 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "DoctorNDTV", "title": "Nmami Agarwal Tells Why Acne Occurs On Your Skin", "description": "Acne is a common problem among many people across the world. Nmami Agarwal shares some of the common reasons behind it.", "url": "https://doctor.ndtv.com/living-healthy/here-s-why-maybe-your-acne-has-been-troubling-you-for-years-3160591", "urlToImage": "https://c.ndtvimg.com/2021-05/2luq7ng8_junk-food_625x300_20_May_21.jpg", "publishedAt": "2022-07-20T11:11:38Z", "content": "You talk about skin issues and acne, being the most common of it all, is highly discussed among people. A lot of women start complaining about pimples right from the time puberty hits. For many, the … [+3564 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Monsoon Diet Tips: 5 Fun Ways To Include Jamun In Your Diet (Recipes Inside)", "description": "Here, we bring some fun jamun recipes (both healthy and decadent) that you can make at home this monsoon. Take a look.", "url": "https://food.ndtv.com/health/monsoon-diet-tips-5-fun-ways-to-include-jamun-in-your-diet-recipes-inside-3176598", "urlToImage": "https://c.ndtvimg.com/2022-06/bklljrqo_jamun_625x300_07_June_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-20T11:04:40Z", "content": "'Sawan ka mahina' has already started; meaning monsoon season is officially here. So is the time for heavy rainfall, lush green nature and comforting nippy weather. Besides, the season also brings al… [+3849 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "India's \"1st Ever\" Concert In Cave In Meghalaya. Yes, It Really Happened", "description": "The famous Arwah Cave at Sohra, Meghalaya, on July 16, turned into the venue for a music show that was a first of its kind.", "url": "https://www.ndtv.com/india-news/meghalaya-cave-concert-indias-1st-ever-concert-in-cave-in-meghalaya-yes-it-really-happened-3176097", "urlToImage": "https://c.ndtvimg.com/2022-07/teoas5bk_meghalaya-cave-concert_625x300_20_July_22.jpg", "publishedAt": "2022-07-20T10:58:02Z", "content": "Meghalaya Cave Concert: The Grassroots Musical Projects event was titled \"KI Sur Na Pubon\".\r\nThe famous Arwah Cave at Sohra, Meghalaya, on July 16, turned into the venue for a music show that was a f… [+1950 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Train Signal Melts, Fire Alarm Goes Off In Theatre As Heatwave Roasts UK", "description": "The London Fire Brigade said it had deployed dozens of fire engines to several fires in and around the city", "url": "https://www.ndtv.com/world-news/uk-heatwave-train-signal-melts-fire-alarm-goes-off-in-theatre-as-heatwave-roasts-uk-3176574", "urlToImage": "https://c.ndtvimg.com/2022-07/4toto1fg_uk-train-signal-melts-650_625x300_20_July_22.jpg", "publishedAt": "2022-07-20T10:54:49Z", "content": "UK Heatwave: Railway infrastructure was damaged due to record heat in the UK.\r\nTrain services faced major disruption across Britain on Wednesday as wildfire triggered by extreme temperature melted si… [+1899 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "High-Protein Lunch: These 7 Protein-Rich Snacks Will Be Ready In 15 Mins", "description": "Here we bring you some delicious high-protein snacks that you can pack and have any time.", "url": "https://food.ndtv.com/food-drinks/high-protein-lunch-these-7-protein-rich-snacks-will-be-ready-in-15-mins-3176563", "urlToImage": "https://c.ndtvimg.com/2022-06/534mfm9o_chana-chaat_625x300_06_June_22.png?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-20T10:52:10Z", "content": "The schools, colleges, and offices have begun in full swing, and this is the time when most of us are not able to follow our diets. We just wake up in the morning and cook with whatever ingredients a… [+2389 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "On Rohit Sharma's Pic With \"Long Lost Friend\", Harbhajan Trolls Yuvraj", "description": "Amid Rohit Sharma and Yuvraj Singh's Instagram bromance, Harbhajan Singh chipped in to troll the latter with a hilarious comment.", "url": "https://sports.ndtv.com/cricket/on-rohit-sharmas-pic-with-long-lost-friend-harbhajan-singh-trolls-yuvraj-singh-3176557", "urlToImage": "https://c.ndtvimg.com/2022-07/k53cgia_rohit-sharma-yuvraj-singh-instagram_625x300_20_July_22.jpg", "publishedAt": "2022-07-20T10:49:42Z", "content": "India captain Rohit Sharma on Tuesday shared a picture with former India all-rounder Yuvraj Singh on Instagram. The two are all smiles as they hug each other in the picture. \"Met my long lost friend … [+1568 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Flights Services Hit, Massive Traffic Jams In Delhi After Heavy Rain", "description": "Rainfall in the capital city brought relief from the intense heat for citizens but also led to waterlogging in several areas.", "url": "https://www.ndtv.com/india-news/rainfall-in-parts-of-delhi-some-roads-flooded-traffic-affected-3176520", "urlToImage": "https://c.ndtvimg.com/2022-07/jg14gkmg_rains-delhi_625x300_20_July_22.jpg", "publishedAt": "2022-07-20T10:39:38Z", "content": "Several low-lying areas were submerged and traffic movement was hampered.\r\nNew Delhi: At least seven flights were diverted and 40 services were delayed at Delhi airport due to heavy rain in the natio… [+1786 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "2 Lakh SC Students Dropped Out Of Colleges In Punjab", "description": "Punjab Chief Minister Bhagwant Mann last week ordered a comprehensive probe into alleged irregularities in the post-matric scholarship scheme that had surfaced during the previous Congress regime in the state.", "url": "https://www.ndtv.com/education/2-lakh-sc-students-dropped-out-of-colleges-in-punjab-due-to-non-payment-of-scholarship-by-state-ncsc", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/20/shutterstock_561503107.jpg", "publishedAt": "2022-07-20T10:37:21Z", "content": "New Delhi:Around two lakh students from the Scheduled Caste category dropped out of college due to non-payment of dues under a scholarship scheme worth around Rs 2,000 crore by the Punjab government,… [+1931 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Go First Delhi-Guwahati Flight's Windshield Cracks, Diverted To Jaipur", "description": "A Go First flight heading from Delhi to Guwahati was diverted to Jaipur after the A320neo aircraft's windshield cracked mid-air, aviation regulator DGCA officials said.", "url": "https://www.ndtv.com/india-news/go-first-delhi-guwahati-flights-windshield-cracks-mid-air-diverted-to-jaipur-3176502", "urlToImage": "https://c.ndtvimg.com/2021-11/2kp564jg_go-first-generic_625x300_03_November_21.jpg", "publishedAt": "2022-07-20T10:36:31Z", "content": "Go First Delhi-Guwahati Flight: This is third incident of malfunction on Go First aircraft in 2 days.\r\nNew Delhi: A Go First flight heading from Delhi to Guwahati was diverted to Jaipur after the A32… [+422 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Singer Zubeen Garg Hospitalised With Head Injury, Airlifted To Guwahati", "description": "Singer and music composer from Assam, Zubeen Garg, was hospitalised after a head injury following a fall in Dibrugarh district today. He was flown to main city Guwahati in an air ambulance this evening.", "url": "https://www.ndtv.com/india-news/singer-zubeen-garg-hospitalised-with-head-injury-after-a-fall-3176469", "urlToImage": "https://c.ndtvimg.com/2020-08/dfknklm_zubeen-garg_625x300_13_August_20.jpg", "publishedAt": "2022-07-20T10:31:55Z", "content": "Doctors said singer Zubeen Garg has received stitches on his head\r\nGuwahati: Singer and music composer from Assam, Zubeen Garg, was hospitalised after a head injury following a fall in Dibrugarh dist… [+844 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Caught On Camera: Turkish President Erdogan Keeps Vladimir Putin Waiting Ahead Of Tehran Talks - NDTV", "description": "<ol><li>Caught On Camera: Turkish President Erdogan Keeps Vladimir Putin Waiting Ahead Of Tehran Talks  NDTV\r\n</li><li>Erdoğan keeps Putin waiting in awkward moment ahead of Tehran talks  The Guardian\r\n</li><li>Fidgeting Putin kept waiting for Erdogan ahead o…", "url": "https://www.ndtv.com/world-news/caught-on-camera-turkish-president-erdogan-keeps-vladimir-putin-waiting-ahead-of-tehran-talks-3176410", "urlToImage": "https://c.ndtvimg.com/2021-09/cf9s2d9o_putinerdoganafp_625x300_29_September_21.jpg", "publishedAt": "2022-07-20T10:18:43Z", "content": "Vladimir Putin met Turkish President in Tehran on Tuesday. (AFP File Photo)\r\nRussian President Vladimir Putin was awkwardly left waiting alone ahead of the meeting with Turkish leader Recep Tayyip Er… [+1946 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ranil Wickremesinghe Elected New Sri Lanka President: 5 Facts - NDTV", "description": "<ol><li>Ranil Wickremesinghe Elected New Sri Lanka President: 5 Facts  NDTV\r\n</li><li>Ranil Wickeremesinghe Elected New Sri Lanka President With 134 Votes, Dullas Placed Second In Race  India Today\r\n</li><li>Ahead Of Vote, Sri Lanka's Opposition Leader Makes …", "url": "https://www.ndtv.com/world-news/ranil-wickremesinghe-elected-new-sri-lanka-president-3175675", "urlToImage": "https://c.ndtvimg.com/2018-12/740h8hgc_ranil-wickremesinghe-reuters-650_625x300_16_December_18.jpg", "publishedAt": "2022-07-20T09:16:00Z", "content": "<li>Official results showed Wickremesinghe polled 134 votes. His main opponent Dullas Alahapperuma got 82 and leftist front's leader Anura Dissanayake just three. Mr Wickremesinghe, a six-time prime … [+1109 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sidhu Moose Wala Murder Suspects, Police In Shootout Near Amritsar; Ambulances On Site Now - NDTV", "description": "<ol><li>Sidhu Moose Wala Murder Suspects, Police In Shootout Near Amritsar; Ambulances On Site Now  NDTV\r\n</li><li>Dramatic Shootout In Punjab: Encounter In Amritsar, Police Fire At Moose Wala Killers | English News  CNN-News18\r\n</li><li>Encounter underway be…", "url": "https://www.ndtv.com/india-news/encounter-in-punjab-between-police-gangsters-suspected-in-singer-sidhu-moose-walas-killing-people-asked-to-stay-indoors-3175940", "urlToImage": "https://c.ndtvimg.com/2022-07/0c7kc5mo_punjab-cops-sidhu-moose-wala-suspects-shootout-ndtv-650_650x400_20_July_22.jpg", "publishedAt": "2022-07-20T09:00:47Z", "content": "Three ambulances have reached the village near Amritsar where a shootout between the police and two suspected killers of singer Sidhu Moose Wala is on. The area has been cordoned off and people told … [+871 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Watch: Korean Woman Teaching Hindi To Her Son Leaves Internet In Awe", "description": "An adorable video showing a Korean woman teaching Hindi to her son has taken the internet by storm. Shared on Instagram, the short clip has accumulated more than 360,000 views and over 20,000 likes.", "url": "https://www.ndtv.com/offbeat/viral-video-korean-woman-teaching-hindi-to-her-son-leaves-internet-in-awe-3176043", "urlToImage": "https://c.ndtvimg.com/2022-07/pbvvpkg_korean-kid-speaking-hindi_625x300_20_July_22.jpg", "publishedAt": "2022-07-20T08:57:22Z", "content": "The video has accumulated more than 360,000 views and over 20,000 likes.\r\nAn adorable video showing a Korean woman teaching Hindi to her son has taken the internet by storm. Shared on Instagram, the … [+1530 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Yogi Adityanath Cabinet Trouble: Minister Resigns, Another In Delhi", "description": "Uttar Pradesh minister Dinesh Khatik has resigned complaining that he was \"sidelined because he is a Dalit\" in a huge setback for Chief Minister Yogi Adityanath just months after he was re-elected by a landslide.", "url": "https://www.ndtv.com/india-news/yogi-adityanath-cabinet-trouble-minister-dinesh-khatik-resigns-another-jitin-prasada-in-delhi-3176007", "urlToImage": "https://c.ndtvimg.com/2022-02/mkcddahg_yogi-adityanathuplakhimpur-kheripti_625x300_20_February_22.jpg", "publishedAt": "2022-07-20T08:49:43Z", "content": "Sources said that Yogi Adityanath summoned Jitin Prasada over corruption charge on his aide. (File)\r\nAn Uttar Pradesh minister has resigned complaining that he was \"sidelined because he is a Dalit\" i… [+2137 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Is India Ready For Plastic Ban? Why Stocks of Juice Packs Are Running Out", "description": "Prime Minister Narendra Modi has a reputation for imposing policies suddenly on an unprepared nation, but when he pledged in 2019 to eliminate single-use plastics, food and beverage makers had years to prepare.", "url": "https://www.ndtv.com/india-news/is-india-ready-for-plastic-ban-why-stocks-of-juice-packs-are-running-out-3176001", "urlToImage": "https://c.ndtvimg.com/2022-07/oi7tt9og_plastic-straw-plastic-pollution-unsplash-_120x90_20_July_22.jpg?im=FaceCrop,algorithm=dnn,width=650,height=400", "publishedAt": "2022-07-20T08:46:41Z", "content": "Plastic straws are attached to many of the ubiquitous Tetra Paks of juices. (Representational)\r\nPrime Minister Narendra Modi has a reputation for imposing policies suddenly on an unprepared nation, b… [+6241 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Bitcoin Miners In Texas Back Online After Power Surge Caused Curtailments", "description": "Large-scale bitcoin mining operations in Texas are back online after sweltering temperatures that caused electricity use to spike led to power curtailments earlier in the month, an industry group said on Tuesday.", "url": "https://www.ndtv.com/business/bitcoin-miners-in-texas-back-online-after-power-surge-caused-curtailments-3175988", "urlToImage": "https://c.ndtvimg.com/2022-06/tujnpo18_bitcoin-new_625x300_21_June_22.jpg", "publishedAt": "2022-07-20T08:42:27Z", "content": "Power use in Texas is expected to break records again this week.\r\nNew York: Large-scale bitcoin mining operations in Texas are back online after sweltering temperatures that caused electricity use to… [+1030 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Mridusmita Deka", "title": "CISCE Class 12 Result 2022: ISC Semester 2 Soon", "description": "CISCE Result 2022: Schools can check their students’ results on the Careers portal of the council using principal’s ID and password, while students can access and download the Class 12 ISC results on the official websites -- cisce.org, results.cisce.org.", "url": "https://www.ndtv.com/education/cisce-class-12-result-2022-isc-semester-2-soon-marking-scheme-key-points", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/20/result-declared-soon-fetaured-image.jpg", "publishedAt": "2022-07-20T08:39:46Z", "content": "New Delhi:The Council for the Indian School Certificate Examination (CISCE) semester 2 result for the ISC Class 12th exams will be released anytime soon at cisce.org. CISCE will release the mark shee… [+1594 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Asian News International", "title": "Taipei Open: Kashyap, Manjunath Make Winning Start, Bansod Crashes Out", "description": "Taipei Open 2022: Parupalli Kashyap and Mithun Manjunath won their first round matches.", "url": "https://sports.ndtv.com/badminton/taipei-open-2022-parupalli-kashyap-mithun-manjunath-make-winning-start-malvika-bansod-crashes-out-3175978", "urlToImage": "https://c.ndtvimg.com/2020-08/ujquhlt_parupalli-kashyap-twitter_625x300_25_August_20.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-20T08:39:39Z", "content": "India's Parupalli Kashyap made a winning start to his campaign at Taipei Open 2022, defeating Chi Yu Jen of Chinese Taipei in the first round of the men's singles category on Wednesday. Kashyap defea… [+1608 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Bitcoin Rises 5.11% To $23,565; Ether Slips 0.33%", "description": "Bitcoin rose 5.11% to $23,564.93 on Tuesday, adding $1,145.77 to its previous close.", "url": "https://www.ndtv.com/business/bitcoin-rises-5-11-to-23-565-ether-slips-0-33-3175968", "urlToImage": "https://c.ndtvimg.com/2022-07/bo9a7uso_bitcoin_625x300_07_July_22.jpg", "publishedAt": "2022-07-20T08:36:41Z", "content": "Bitcoin is up 33.9% from the year's low of $17,592.78 on June 18.\r\nBitcoin rose 5.11% to $23,564.93 on Tuesday, adding $1,145.77 to its previous close.\r\nBitcoin, the world's biggest and best-known cr… [+301 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Watch: Ukraine Soldier's Homecoming - \"This Is What We're Fighting For\"", "description": "An Ukrainian official has shared a video of a soldier returning home amidthe Russian invasion and receiving a warm welcome from a child, presumably her son.", "url": "https://www.ndtv.com/world-news/ukraine-war-ukraine-soldiers-homecoming-this-is-what-were-fighting-for-3175674", "urlToImage": "https://c.ndtvimg.com/2022-07/d81h0c58_ukraine-soldier-homecoming-650_625x300_20_July_22.jpg", "publishedAt": "2022-07-20T08:35:01Z", "content": "Ukraine: The solider approaches the child and the two share a warm hug.\r\nImages and videos of soldiers returning home after days in war and conflict-ridden areas are always special. Adding to the lis… [+2651 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ishaan Khatter's DMs Made Him Post This Pic: \"They Were Hilarious\"", "description": "Ishaan Khatter's mom also dropped a comment on his post", "url": "https://www.ndtv.com/entertainment/ishaan-khatters-dms-made-him-post-this-pic-they-were-hilarious-3175960", "urlToImage": "https://c.ndtvimg.com/2022-07/2kh6bs4o_ishaann_625x300_20_July_22.jpg", "publishedAt": "2022-07-20T08:33:51Z", "content": "Ishaan Khatter shared this image. (courtesy: ishaankhatter)\r\nNew Delhi: Ishaan Khatter's fitness game is very strong and his latest Instagram entry makes it all the more obvious. The actor, on Wednes… [+1427 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "DoctorNDTV", "title": "This Is Why You Must Add Pumpkin Seeds To Your Diet", "description": "Pumpkin seeds have a high nutrition profile and must be regularly savoured with food.", "url": "https://doctor.ndtv.com/living-healthy/why-should-you-add-pumpkin-seeds-to-your-diet-here-are-some-reasons-3175446", "urlToImage": "https://c.ndtvimg.com/2022-05/7gv4avq8_pumpkin-seeds-benefits_625x300_02_May_22.jpg", "publishedAt": "2022-07-20T08:30:09Z", "content": "Do you eat pumpkin seeds? Yes, you may have seen many celebrities or health-conscious people relishing the seeds with salads, pancakes, and many other food items. Ever wondered why? It's because thes… [+3494 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"In Amrit Kaal...\": Opposition's Price-Rise Protest With Placards Angers Lok Sabha Speaker - NDTV", "description": "<ol><li>\"In Amrit Kaal...\": Opposition's Price-Rise Protest With Placards Angers Lok Sabha Speaker  NDTV\r\n</li><li>Parliament Monsoon Session: Opposition On A Warpath, Holds Protests Against Inflation | English News  CNN-News18\r\n</li><li>Disruptions over pric…", "url": "https://www.ndtv.com/india-news/speaker-om-birla-angry-at-oppositions-protest-with-placards-in-lok-sabha-in-amrit-kaal-people-expect-3175759", "urlToImage": "https://c.ndtvimg.com/2022-07/lpilatu8_speaker-om-birla-stops-opposition-members-from-showing-placards-and-raising-slogans-july-20-2022_625x300_20_July_22.jpg", "publishedAt": "2022-07-20T08:30:00Z", "content": "Speaker Om Birla stops Opposition members from showing placards and raising slogans.\r\nDelhi: Speaker Om Birla was rather blunt today with Opposition members protesting inside the Lok Sabha against pr… [+3266 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Shane Watson, Ravi Bopara To Play In Legends League Cricket", "description": "Former Australia all-rounder Shane Watson will be playing in the upcoming Legends League Cricket", "url": "https://sports.ndtv.com/cricket/former-australia-all-rounder-shane-watson-to-play-in-legends-league-cricket-3175939", "urlToImage": "https://c.ndtvimg.com/2022-04/58r3krbo_shane-watson-bcci_625x300_23_April_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-20T08:26:22Z", "content": "Legends League Cricket on Wednesday confirmed that Shane Watson (Australia), Ravi Bopara (England), Matt Prior (England), Chris Tremlett (England), Parveez Maharoof (Sri Lanka), Romesh Kaluwitharana … [+2360 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Shooting World Cup: India End Changwon Campaign With Most Medals", "description": "India finished yet another ISSF Shooting World Cup campaign by topping the medal's tally with a haul of 15 medals, including five gold, six silver and four bronze on Wednesday", "url": "https://sports.ndtv.com/othersports/shooting-world-cup-india-end-changwon-campaign-with-most-medals-3175917", "urlToImage": "https://c.ndtvimg.com/2022-07/k7pev7g8_india-shooting-806_625x300_20_July_22.jpg", "publishedAt": "2022-07-20T08:22:11Z", "content": "India finished yet another ISSF Shooting World Cup campaign by topping the medal's tally with a haul of 15 medals, including five gold, six silver and four bronze on Wednesday. On the final day of co… [+1140 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Bride Killed By Stray Bullet During Celebratory Gunfire At Wedding", "description": "In a tragic incident, an Iranian bride died at her own wedding after getting shot by a stray bullet during a round of celebratory gunfire.", "url": "https://www.ndtv.com/world-news/bride-in-iran-killed-by-stray-bullet-during-celebratory-gunfire-at-wedding-3175916", "urlToImage": "https://c.ndtvimg.com/5evuq9is_dead-body-generic_625x300_28_August_18.jpg", "publishedAt": "2022-07-20T08:21:05Z", "content": "The other two victims survived with minor injuries. (Representative Photo)\r\nIn a tragic incident, an Iranian bride died at her own wedding after getting shot by a stray bullet during a round of celeb… [+1605 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "IPL Team Owners Snap Up All 6 Franchises In New South Africa T20 League - NDTV Sports", "description": "<ol><li>IPL Team Owners Snap Up All 6 Franchises In New South Africa T20 League  NDTV Sports\r\n</li><li>IPL franchise owners buy all six teams in South Africa's new T20 league  ESPNcricinfo\r\n</li><li>Owners of MI, CSK, SRH, DC, RR, LSG buy 6 teams in South Afr…", "url": "https://sports.ndtv.com/cricket/ipl-team-owners-snap-up-all-6-franchises-in-new-south-africa-t20-league-3175794", "urlToImage": "https://c.ndtvimg.com/2022-02/8dvukpg_ipl-auction-2022-flags_625x300_12_February_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-20T07:43:32Z", "content": "The six teams in the new South African T20 league which is set to begin in January next year have been bought by owners of franchises in the Indian Premier League (IPL). Reliance Industries Limited, … [+1745 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Just Samantha Ruth Prabhu And Akshay Kumar Dancing To Oo Antava. Watch - NDTV Movies", "description": "<ol><li>Just Samantha Ruth Prabhu And Akshay Kumar Dancing To Oo Antava. Watch  NDTV Movies\r\n</li><li>KWK ep 3 trailer: Akshay spins Samantha, Karan wants to talk about her marriage  Hindustan Times\r\n</li><li>Samantha Ruth Prabhu Recreates Oo Antava Magic Wit…", "url": "https://www.ndtv.com/entertainment/just-samantha-ruth-prabhu-and-akshay-kumar-dancing-to-oo-antava-watch-3175742", "urlToImage": "https://c.ndtvimg.com/2022-07/r9u4krhg_samantha_625x300_20_July_22.jpg", "publishedAt": "2022-07-20T07:30:23Z", "content": "Samantha with Akshay Kumar. (courtesy: disneyplushotstar)\r\nNew Delhi: This new video of two superstars dancing together is making the wait for Koffee With Karan 7 episode all the more difficult. We a… [+1407 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Mridusmita Deka", "title": "NEET UG 2022 Answer Key: Know How Candidates Will Be Marked", "description": "NEET UG 2022: In addition to the NEET UG answer keys, NTA will also release the NEET OMR response sheets of the candidates. The NTA website -- neet.nta.nic.in will host the NEET UG answer key for all the sets of the NEET 2022 question papers.", "url": "https://www.ndtv.com/education/neet-ug-2022-answer-key-marking-scheme-omr-response-sheet-neet-nta-nic-in", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/20/omr-sheet-featured-image.jpg", "publishedAt": "2022-07-20T06:42:22Z", "content": "New Delhi:The National Eligibility cum Entrance Test answer key (NEET answer key) is expected to be issued soon. Although the National Testing Agency (NTA) is yet to announce an official update as to… [+1884 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "What Does Kim Kardashian Have For Breakfast - See Pic", "description": "Kardashian has never shied away from sharing her fitness and diet secrets and often shares glimpses of her everyday meals.", "url": "https://food.ndtv.com/news/what-does-kim-kardashian-have-for-breakfast-see-pic-3175544", "urlToImage": "https://c.ndtvimg.com/2022-06/eeqc6ke_kim-kardashian_625x300_05_June_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-20T06:33:03Z", "content": "We all know her as a model, entrepreneur, reality TV star, and fashion icon, Kim Kardashian has undoubtedly made a name for herself in the industry. Kardashian has never shied away from sharing her f… [+1677 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Adarsh Srivastava", "title": "Himachal Pradesh HP CET Result 2022 Out: Direct Link; Steps To Check", "description": "Himachal Pradesh Technical University (HPTU) declared the Himachal Pradesh Common Entrance Test (HP CET) 2022 result today, July 20.", "url": "https://www.ndtv.com/education/himachal-pradesh-hp-cet-result-2022-out-direct-link-steps-to-check", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/20/HP-CET-Result-2022.jpg", "publishedAt": "2022-07-20T06:30:23Z", "content": "New Delhi:HP CET Result 2022: Himachal Pradesh Technical University (HPTU) declared the Himachal Pradesh Common Entrance Test (HP CET) 2022 result today, July 20. The HP CET result is now available o… [+1695 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Man Who Can't Find 20 MLAs' Support...\": Sena Showdown In Supreme Court - NDTV", "description": "<ol><li>\"Man Who Can't Find 20 MLAs' Support...\": Sena Showdown In Supreme Court  NDTV\r\n</li><li>Maharashtra politics News: SC To Hear Disqualification Pleas Filed By Uddhav- Shinde Camp  India Today\r\n</li><li>Uddhav faction says democracy in peril; ‘You were…", "url": "https://www.ndtv.com/india-news/in-sena-vs-sena-big-supreme-court-hearing-underway-3175405", "urlToImage": "https://c.ndtvimg.com/2022-06/r61bq9qk_uddhav-thackeray-afp_625x300_29_June_22.jpg", "publishedAt": "2022-07-20T06:29:00Z", "content": "<li>The top court is hearing six petitions in the matter. One of them is from the Shinde camp and challenges disqualification proceedings initiated by Deputy Assembly Speaker Narhari Zirwal against l… [+1904 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sick Woman Carried On Shoulders For 12 Km To See Doctor In Uttarakhand", "description": "Exposing the rickety health infrastructure in remote areas, family members of a 52-year-old ill woman carried her on their shoulders for 12 kms to reach the nearest medical facility in Uttarakhand's Badiyar.", "url": "https://www.ndtv.com/india-news/sick-woman-carried-on-shoulders-for-12-km-to-see-doctor-in-uttarakhand-3175169", "urlToImage": "https://c.ndtvimg.com/2022-03/e9oompdg_uttarakhand_625x300_10_March_22.jpg", "publishedAt": "2022-07-20T06:26:54Z", "content": "A social worker pointed to the \"sorry state of affairs of health facilities\". (Representational)\r\nUttarkashi: Exposing the rickety health infrastructure in remote areas, family members of a 52-year-o… [+1276 chars]"}]}