{"status": "ok", "totalResults": 292, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": "Arnab Mitra", "title": "CBSE 10th Term 2 Science Exam 2022 Today; Key Instructions To Follow", "description": "The CBSE term 2 Class 10 Science exam will be conducted today, May 10. The CBSE Class 10 Science paper will be of 40 marks, and be held for a duration of two hours between 10:30 am and 12:30 pm.", "url": "https://www.ndtv.com/education/cbse-10th-term-2-science-exam-2022-today-key-instructions-to-follow", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/5/9/shutterstock_613374476_1.jpg", "publishedAt": "2022-05-10T02:41:31Z", "content": "CBSE 10th Science Exam 2022: The Central Board of Secondary Education (CBSE) will conduct the term 2 Class 10 Science exam on Tuesday, May 10. The CBSE Class 10 Science paper will be of 40 marks, and… [+1421 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Marilyn Monroe Portrait Becomes Most Expensive 20th Century Artwork Sold", "description": "An iconic portrait of Marilyn Monroe by American pop art visionary Andy Warhol went under the hammer for a record $195 million Monday at Christie's.", "url": "https://www.ndtv.com/world-news/marilyn-monroes-shot-sage-blue-marilyn-becomes-most-expensive-20th-century-artwork-sold-2961261", "urlToImage": "https://c.ndtvimg.com/2022-05/84j4t08o_christies-marilyn-monroe_625x300_10_May_22.jpg", "publishedAt": "2022-05-10T02:31:36Z", "content": "Andy Warhol's 'Shot Sage Blue Marilyn' was auctioned for a record-breaking $195 million\r\nNew York: An iconic portrait of Marilyn Monroe by American pop art visionary Andy Warhol went under the hammer… [+3830 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Man Looted Of Nearly 7 Lakh In Broad Daylight In UP's Noida: Police", "description": "A collection agent working for a private firm was allegedly looted of nearly Rs 7 lakh on a Noida road on Monday afternoon after he was waylaid and assaulted by unidentified motorcycle-borne assailants, police said.", "url": "https://www.ndtv.com/india-news/man-looted-of-nearly-7-lakh-in-broad-daylight-in-ups-noida-police-2961264", "urlToImage": "https://i.ndtvimg.com/i/2017-03/police-generic_650x400_71490246814.jpg", "publishedAt": "2022-05-10T02:24:33Z", "content": "Noida Police said an FIR has been lodged in connection with the incident. (Representational)\r\nNoida: A collection agent working for a private firm was allegedly looted of nearly Rs 7 lakh on a Noida … [+1452 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Elon Musk Recalls Taj Mahal Visit: \"Truly A Wonder Of The World\"", "description": "Billionaire entrepreneur Elon Musk on Tuesday recalled his 2007 trip to India including a visit to the Taj Mahal, which he described as \"truly a wonder of the world\".", "url": "https://www.ndtv.com/india-news/elon-musk-recalls-taj-mahal-visit-truly-a-wonder-of-the-world-2961251", "urlToImage": "https://c.ndtvimg.com/2022-05/j9q7c708_elon-musk_625x300_04_May_22.jpg", "publishedAt": "2022-05-10T02:04:10Z", "content": "Elon Musk described Taj Mahal as \"truly a wonder of the world\". (File)\r\nBillionaire entrepreneur Elon Musk on Tuesday recalled his 2007 trip to India including a visit to the Taj Mahal, which he desc… [+945 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Pulitzer For Danish Siddiqui, 3 Others For India's Covid Deaths Pics", "description": "Pulitzer Prize 2022 winners in Journalism, Books, Drama and Music were announced on Monday. The winner's list included The Washington Post, including Indians Adnan Abidi, Sanna Irshad Mattoo, Amit Dave, and the late Danish Siddiqui.", "url": "https://www.ndtv.com/india-news/pulitzer-for-danish-siddiqui-3-others-for-indias-covid-deaths-pics-2961234", "urlToImage": "https://c.ndtvimg.com/2021-07/oo0n56ko_danish-siddiqui_625x300_16_July_21.jpg", "publishedAt": "2022-05-10T01:21:07Z", "content": "Pulitzer Prize 2022 winners in Journalism, Books, Drama and Music were announced on Monday.\r\nWashington: Pulitzer Prize 2022 winners in Journalism, Books, Drama and Music were announced on Monday.\r\nT… [+4611 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE: India Records Over 3,000 New Covid Cases In 24 Hours", "description": "India on Monday reported at least 3,207 new coronavirus infections, taking the total tally of COVID-19 cases to 4,31,05,401, while the active cases dipped to 20,403, according to the Union Health Ministry data updated.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-india-covid-cases-may-10-2961210", "urlToImage": "https://c.ndtvimg.com/2021-12/91fs4qmg_coronavirus-india-afp-december_650x400_08_December_21.jpg", "publishedAt": "2022-05-10T00:34:12Z", "content": "India COVID-19 Live: India reported 29 Covid-related deaths on Monday.\r\nNew Delhi: India on Monday reported at least 3,207 new coronavirus infections, taking the total tally of COVID-19 cases to 4,31… [+558 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Cashier Attacked, Looted Of Rs 10 Lakh In Chhattisgarh: Official", "description": "Three unidentified men attacked a cashier working with a property dealer and looted Rs 10 lakh from him in Chhattisgarh's capital Raipur on Monday, police said.", "url": "https://www.ndtv.com/india-news/cashier-attacked-looted-of-rs-10-lakh-in-chhattisgarhs-raipur-official-2961205", "urlToImage": "https://c.ndtvimg.com/144povgk_police-istock_625x300_15_August_18.jpg", "publishedAt": "2022-05-10T00:19:41Z", "content": "Raipur robbery: The police have launched a manhunt for the robbers. (Representational)\r\nRaipur: Three unidentified men attacked a cashier working with a property dealer and looted Rs 10 lakh from him… [+649 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Student, 13, Found Hanging In School In UP: Police", "description": "The body of a Class 8 student was found hanging under suspicious circumstances behind his school in Uttar Pradesh's Jaunpur district on Monday, police said.", "url": "https://www.ndtv.com/india-news/student-13-found-hanging-in-school-in-ups-jaunpur-police-2961204", "urlToImage": "https://i.ndtvimg.com/i/2017-03/police-generic_650x400_71490246814.jpg", "publishedAt": "2022-05-10T00:04:25Z", "content": "It was not known when he came to the school and took the extreme step, principal said. (Representational)\r\nJaunpur, UP: The body of a Class 8 student was found hanging under suspicious circumstances … [+957 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Delhi Man Arrested In Rs 1,146 Crore Money Laundering Case: Probe Agency", "description": "Enforcement Directorate (ED) has arrested Delhi-based Deepak Nayyar in a case linked to the alleged laundering of funds worth Rs 1,146 crore by forging Air Way Bills of reputed companies in the guise of freight forwarding services on May 5.", "url": "https://www.ndtv.com/india-news/delhi-man-deepak-nayyar-arrested-in-rs-1-146-crore-money-laundering-case-enforcement-directorate-2961202", "urlToImage": "https://c.ndtvimg.com/enforcement-directorate_625x300_1526972931080.jpg", "publishedAt": "2022-05-09T23:53:10Z", "content": "Mr Nayyar has been remanded to ED Custody from May 6 to May 20. (Representational)\r\nEnforcement Directorate (ED) has arrested Delhi-based Deepak Nayyar in a case linked to the alleged laundering of f… [+2161 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "France's Macron Says He Knows Name Of His Country's Next Prime Minister", "description": "Emmanuel Macron, who was just re-elected French president, said on Monday he knew the name of the country's next prime minister, due to succeed Jean Castex.", "url": "https://www.ndtv.com/world-news/frances-macron-says-he-knows-name-of-his-countrys-next-prime-minister-2961196", "urlToImage": "https://c.ndtvimg.com/2021-09/3g913r18_macron_625x300_20_September_21.jpg", "publishedAt": "2022-05-09T23:41:01Z", "content": "Emmanuel Macron on Tuesday was in Berlin attended press conference with German Chancellor Scholz. (File)\r\nBerlin: Emmanuel Macron, who was just re-elected French president, said on Monday he knew the… [+622 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Culprits Of Bihar Civil Services Exam Paper Leak To Be Punished: Nitish Kumar", "description": "Bihar Chief Minister Nitish Kumar on Monday said that strict action will be taken against the perpetrators of Bihar Public Service Commission (BPSC) Preliminary exam paper leak.", "url": "https://www.ndtv.com/india-news/bihar-civil-services-exam-paper-leak-chief-minister-nitish-kumar-says-culprits-wont-be-spared-2961187", "urlToImage": "https://c.ndtvimg.com/2022-04/clf0oi68_nitish-kumar_625x300_18_April_22.jpg", "publishedAt": "2022-05-09T23:23:23Z", "content": "BPSC paper leak: Over 6 lakh candidates were to sit for the exam on Sunday.\r\nPatna: Bihar Chief Minister Nitish Kumar on Monday said that strict action will be taken against the perpetrators of Bihar… [+1160 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Will Increase Pressure On Taliban To Protect Afghan Women's Rights: US", "description": "The United States will take steps to increase pressure on Afghanistan's Taliban government to reverse some of its recent decisions restricting the rights of women and girls if the hardline group shows no sign of rescinding the actions on its own.", "url": "https://www.ndtv.com/world-news/will-increase-pressure-on-taliban-to-protect-afghan-womens-rights-us-after-new-hijab-rule-in-afghanistan-2961178", "urlToImage": "https://c.ndtvimg.com/2021-09/ev8j2gb_afghan-womenheratreuters_625x300_12_September_21.jpg", "publishedAt": "2022-05-09T22:58:16Z", "content": "Afghanistan Hijab Rule: Taliban has restricted women from working, including limited their travel.\r\nWashington: The United States will take steps to increase pressure on Afghanistan's Taliban governm… [+2559 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Biden Signs Bill To Speed US Weapons Deliveries To Ukraine Against Russia", "description": "President Joe Biden on Monday resurrected a World War II measure used to boost US allies fighting Nazi Germany, allowing the government to accelerate weapons shipments to Ukraine for its battle against Russia's invasion.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-us-president-joe-biden-signs-lend-lease-act-to-speed-weapons-deliveries-to-ukraine-against-russia-2961169", "urlToImage": "https://c.ndtvimg.com/2022-02/jf0i0mi4_joe-biden_625x300_25_February_22.jpg", "publishedAt": "2022-05-09T22:33:36Z", "content": "Washington: President Joe Biden on Monday resurrected a World War II measure used to boost US allies fighting Nazi Germany, allowing the government to accelerate weapons shipments to Ukraine for its … [+2718 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"To Keep Women Out Of Work\": Malala Yousafzai On Taliban's New Hijab Rule", "description": "Nobel Prize laureate Malala Yousafzai has expressed fear for women and girls in Afghanistan after the Taliban issued a decree making the hijab compulsory for women in Afghanistan.", "url": "https://www.ndtv.com/world-news/malala-yousafzai-expresses-fear-on-talibans-hijab-rule-in-afghanistan-2961163", "urlToImage": "https://c.ndtvimg.com/2021-09/tiecl8e_malala-yousafzai_625x300_24_September_21.jpg", "publishedAt": "2022-05-09T22:16:23Z", "content": "Malala Yousafzai urged world leaders to take action against Taliban for forcing women to wear veil.\r\nNew Delhi: Nobel Prize laureate Malala Yousafzai has expressed fear for women and girls in Afghani… [+2114 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Philippines Polls: Late Dictator's Son Wins Presidential Election", "description": "The son of late Philippines dictator Ferdinand Marcos won a landslide presidential election victory Tuesday, as Filipino voters dismissed warnings his rise could put their fragile democracy at risk.", "url": "https://www.ndtv.com/world-news/philippine-dictators-son-ferdinand-marco-wins-presidential-election-2961153", "urlToImage": "https://c.ndtvimg.com/2022-05/1q1ojca8_ferdinand-marcos_625x300_10_May_22.jpg", "publishedAt": "2022-05-09T21:44:20Z", "content": "Rights activists had warned Marcos Jr could rule with an even heavier fist if he wins by a large margin.\r\nManila: The son of late Philippines dictator Ferdinand Marcos won a landslide presidential el… [+5870 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Pulitzer Board Honours Ukrainian Journalists Covering Russia's Invasion", "description": "The Pulitzer Prize Board honored Ukrainian journalists on Monday for their \"courage, endurance and commitment to truthful\" coverage of Russia's invasion of their country.", "url": "https://www.ndtv.com/world-news/pulitzer-board-honours-ukrainian-journalists-covering-russias-invasion-2961148", "urlToImage": "https://c.ndtvimg.com/2022-03/ghc4vk08_ukraine-war-afp_625x300_20_March_22.jpg", "publishedAt": "2022-05-09T21:18:41Z", "content": "At least 7 journalists, including 3 from Ukraine, have been killed since Russia launched war on Feb 24.\r\nNew York: The Pulitzer Prize Board honored Ukrainian journalists on Monday for their \"courage,… [+2359 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "France, Germany Assure \"Full Support\" To Ukraine Amid Rising Tensions", "description": "French President Emmanuel Macron and German Chancellor Olaf Scholz showed Ukraine their \"full support\" on Monday as they visited Berlin's symbolically important Brandenburg Gate, illuminated in Ukraine's national colours, AFP saw.", "url": "https://www.ndtv.com/world-news/france-germany-assure-full-support-to-ukraine-amid-rising-tensions-2961140", "urlToImage": "https://c.ndtvimg.com/2022-03/48be8em_ukraine-capital-kyiv-afp_625x300_03_March_22.jpg", "publishedAt": "2022-05-09T20:58:38Z", "content": "German Chancellor in particular has come under fire for arms deliveries to Ukraine deemed insufficient.\r\nBerlin: French President Emmanuel Macron and German Chancellor Olaf Scholz showed Ukraine thei… [+1462 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Says Moscow Is \"Forcibly\" Taking Ukrainians To Russia", "description": "The Pentagon has seen indications that Ukrainians caught up in Russia's invasion are being forcibly removed from their homeland and sent to Russia, a senior US defense official said Monday.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-us-says-moscow-is-forcibly-taking-ukrainians-to-russia-2961129", "urlToImage": "https://c.ndtvimg.com/2022-04/1mnsct3s_-russia-ukraine-war_625x300_12_April_22.jpg", "publishedAt": "2022-05-09T20:42:25Z", "content": "Russia-Ukraine war: Pentagon said that Ukrainians being taken \"against their will\" into Russia amid war.\r\nWashington: The Pentagon said Monday it has seen indications that Ukrainians caught up in Rus… [+1604 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Covid Positive Accident Victim Taken In By Delhi Hospital On Day 3, Saved", "description": "A 19-year-old Covid patient, who was severely injured in a bike-bus collision, was saved from having his hand amputated after doctors at a city hospital here performed a high-risk surgery two days later.", "url": "https://www.ndtv.com/india-news/covid-positive-accident-victim-taken-in-by-delhi-hospital-on-day-3-saved-2961088", "urlToImage": "https://i.ndtvimg.com/i/2015-03/ambulance-generic_650x400_51425838004.jpg", "publishedAt": "2022-05-09T19:53:53Z", "content": "Earlier, no hospitals were willing to operate him as he tested coronavirus positive. (Representational)\r\nNew Delhi: A 19-year-old Covid patient, who was severely injured in a bike-bus collision, was … [+3433 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sri Lanka's Day Of Deadly Violence: Here's All You Need To Know", "description": "At least five people were killed and almost 200 wounded in Sri Lanka on Monday in a wave of violence between government supporters and demonstrators demanding President Gotabaya Rajapaksa's resignation.", "url": "https://www.ndtv.com/world-news/sri-lankas-day-of-deadly-violence-heres-all-you-need-to-know-2961079", "urlToImage": "https://c.ndtvimg.com/2022-05/ii8ov2c4_sri-lanka-protest-afp_625x300_09_May_22.jpg", "publishedAt": "2022-05-09T19:35:15Z", "content": "Sri Lanka Economic Crisis: A political office of the Rajapaksas was also destroyed in an arson attack.\r\nColombo: At least five people were killed and almost 200 wounded in Sri Lanka on Monday in a wa… [+4287 chars]"}]}