{"status": "ok", "totalResults": 320, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Forcibly Captured By Aurangzeb\": Hindu Side On Mosque Committe's Plea", "description": "The lawyers representing the Hindu devotees yesterday urged the Supreme Court to dismiss the petition filed by the Varanasi's Gyanvapi Mosque committee challenging the filming inside the Mosque", "url": "https://www.ndtv.com/india-news/forcibly-captured-by-aurangzeb-hindu-side-on-mosque-committes-plea-2992384", "urlToImage": "https://c.ndtvimg.com/2022-05/1pru2sfc_gyanvapi-masjid-pti_625x300_19_May_22.jpg", "publishedAt": "2022-05-20T02:35:13Z", "content": "The original suit was filed in 1991 in the Varanasi district court\r\nNew Delhi: The lawyers representing the Hindu devotees yesterday urged the Supreme Court to dismiss the petition filed by the Varan… [+2416 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Qatar World Cup Marks Last Dance For Lionel Messi And Cristiano Ronaldo", "description": "The FIFA World Cup will be played in Qatar from November 21-December 18 this year", "url": "https://sports.ndtv.com/football/qatar-world-cup-marks-last-dance-for-lionel-messi-and-cristiano-ronaldo-2992380", "urlToImage": "https://c.ndtvimg.com/2021-11/9spq91ro_ronaldo-messi_625x300_30_November_21.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-20T02:29:31Z", "content": "As the football world prepares to head to Qatar in six months' time, this World Cup is set to bookend the era in which Lionel Messi and Cristiano Ronaldo have been the sport's two pre-eminent players… [+4269 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Without Food, Boats, Hundreds Await Rescue In Flood-Hit Assam Villages", "description": "A risky boat ride through flood waters and a walk for a few miles through inundated paddy fields lead to the fringes of Hatigarh in Assam's Nagaon district - one of the worst-hit in the state.", "url": "https://www.ndtv.com/india-news/without-food-boats-hundreds-await-rescue-in-flood-hit-assam-villages-2992378", "urlToImage": "https://c.ndtvimg.com/2022-05/8i0sftmc_assam-flood_625x300_20_May_22.jpg", "publishedAt": "2022-05-20T02:25:27Z", "content": "In many areas, locals are trying to rescue marooned people without any outside help.\r\nGuwahati: A risky boat ride through flood waters and a walk for a few miles through inundated paddy fields lead t… [+2601 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "CBI's New Corruption Case Against Lalu Yadav, Daughter, Searches Begin", "description": "Weeks after he was granted bail in a fodder scam case, Lalu Prasad Yadav has been charged in a fresh corruption case over alleged irregularities in recruitment during his tenure as Bihar Chief Minister.", "url": "https://www.ndtv.com/india-news/cbis-fresh-corruption-case-against-lalu-prasad-yadav-daughter-searches-at-15-locations-2992371", "urlToImage": "https://c.ndtvimg.com/lalu-prasad-yadav_625x300_1527020134500.jpg", "publishedAt": "2022-05-20T02:14:20Z", "content": "New Delhi, Patna: Weeks after he was granted bail in a fodder scam case, Lalu Prasad Yadav has been charged in a fresh corruption case over alleged irregularities in recruitment during his tenure as … [+174 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Man Stabs Wife To Death In Broad Daylight In UP: Police", "description": "A man fled after stabbing his wife to death in broad daylight in a crowded spot in Premnagar area on Thursday, police said.", "url": "https://www.ndtv.com/india-news/man-stabs-wife-to-death-in-broad-daylight-in-up-police-2992362", "urlToImage": "https://i.ndtvimg.com/i/2017-03/police-generic_650x400_71490246814.jpg", "publishedAt": "2022-05-20T01:49:47Z", "content": "Police has lodged an FIR of murder on the complaint of family members of the woman. (Representational)\r\nBareilly, Uttar Pradesh: A man fled after stabbing his wife to death in broad daylight in a cro… [+1043 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US President Joe Biden Begins Asia Tour; North Korea, China In Focus", "description": "Biden wants the trip to build on recent moves accelerating a years-long US pivot to Asia, where rising Chinese commercial and military power is undercutting Washington's dominance.", "url": "https://www.ndtv.com/world-news/us-president-joe-biden-begins-asia-tour-china-in-focus-2992348", "urlToImage": "https://c.ndtvimg.com/2022-05/ghd8f8hs_biden_625x300_20_May_22.jpg", "publishedAt": "2022-05-20T01:30:41Z", "content": "The trip marks the US President's first trip to Asia since taking office.\r\nWashington DC: US President Joe Biden on Thursday left for South Korea and Japan to cement US leadership in Asia at a time w… [+4486 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Tesla On My Mind 24/7\": Elon Musk Amid Concerns Over Twitter Distraction", "description": "Tesla CEO Elon Musk said on Thursday that \"Tesla is on my mind 24/7,\" trying to soothe investor worries about him being distracted by a Twitter deal that has", "url": "https://www.ndtv.com/world-news/musk-says-tesla-is-on-my-mind-24-7-amid-concerns-about-twitter-distraction-2992337", "urlToImage": "https://c.ndtvimg.com/2022-04/9qe9n1bs_elon-musk-tesla-afp_625x300_08_April_22.jpg", "publishedAt": "2022-05-20T01:12:50Z", "content": "Tesla this year opened its new car factory in Texas (File)\r\nSan Francisco: Tesla CEO Elon Musk said on Thursday that \"Tesla is on my mind 24/7,\" trying to soothe investor worries about him being dist… [+2207 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE: India Records Over 2,000 New COVID-19 Cases In 24 Hours", "description": "India on Friday reported at least 2,364 new Covid cases, taking the total number of infections to 4,31,29,563. According to the Union Health Ministry, the active cases dipped to 15,419 in the last 24 hours.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-may-20-2992322", "urlToImage": "https://c.ndtvimg.com/2021-09/1d97kdb8_coronavirus-india-reuters-sep-2021_650x400_28_September_21.jpg", "publishedAt": "2022-05-20T00:42:56Z", "content": "India COVID-19 Live: India also reported 10 Covid-related deaths on Friday.\r\nNew Delhi: India on Thursday reported at least 2,364 new Covid cases, taking the total number of infections to 4,31,29,563… [+457 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Money Laundering Case Filed Against Raj Kundra In Porn Racket Case", "description": "The ED has launched an anti-money-laundering investigation into an alleged pornographic films case in which businessman Raj Kundra and others were arrested by the Mumbai Police crime branch in 2021, officials said on Thursday.", "url": "https://www.ndtv.com/india-news/ed-files-money-laundering-case-against-raj-kundra-in-porn-racket-case-2992317", "urlToImage": "https://c.ndtvimg.com/2021-07/5pfdkgmg_raj-kundra-instagram_625x300_20_July_21.jpg", "publishedAt": "2022-05-20T00:29:58Z", "content": "Last year, police filed FIRs against Raj Kundra on the basis of complaints received from 2 women. (File)\r\nNew Delhi: The ED has launched an anti-money-laundering investigation into an alleged pornogr… [+2919 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Bharat Jodo Yatra: Congress To Reach Out To Like-Minded Groups For March", "description": "The Congress will reach out to civil society members and like-minded political groups for the 'Bharat Jodo' yatra from October 2 for rallying support to combat polarisation and protect Constitution and democracy senior party leader said.", "url": "https://www.ndtv.com/india-news/bharat-jodo-yatra-congress-to-reach-out-to-like-minded-groups-for-march-2992310", "urlToImage": "https://c.ndtvimg.com/2020-01/dqh52igg_congress-generic_625x300_21_January_20.jpg", "publishedAt": "2022-05-19T23:55:06Z", "content": "Congress' Bharat Jodo Yatra will begin from Kanyakumari on October 2. (File)\r\nNew Delhi: The Congress will reach out to civil society members and like-minded political groups for the 'Bharat Jodo' ya… [+4152 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Johnny Depp Was Jealous, Frequently Drunk, Says His Ex-Girlfriend", "description": "Johnny Depp was jealous, controlling and frequently drunk, and once threw a wine bottle in his hotel room in Las Vegas, his former girlfriend, the actress Ellen Barkin, said in pre-recorded testimony Thursday.", "url": "https://www.ndtv.com/world-news/johnny-depp-was-jealous-controlling-frequently-drunk-says-his-ex-girlfriend-ellen-barkin-2992295", "urlToImage": "https://i.ndtvimg.com/i/2014-10/johnny-depp-630-new_625x300_61412599748.jpg", "publishedAt": "2022-05-19T23:13:28Z", "content": "Johnny Depp was a \"red wine drinker,\" said her ex-girlfriend and actress Ellen Barkin.\r\nWashington: Johnny Depp was jealous, controlling and frequently drunk, and once threw a wine bottle in his hote… [+4249 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Musk's Twitter Deal Will Not Renegotiate, Proceeding As Expected: Report", "description": "Twitter Inc executives told staff that Tesla Inc Chief Executive Elon Musk's $44-billion deal was proceeding as expected and would not renegotiate the offer price, Bloomberg News reporter tweeted on Thursday.", "url": "https://www.ndtv.com/world-news/musks-twitter-deal-will-not-renegotiate-proceeding-as-expected-report-2992282", "urlToImage": "https://c.ndtvimg.com/2022-05/tepddd6_elon-musk-twitter-reuters_625x300_17_May_22.jpg", "publishedAt": "2022-05-19T22:45:11Z", "content": "Elon Musk Twitter Deal: Elon Musk agreed to buy Twitter Inc for $44 billion cash last month in April.\r\nNew York: Twitter Inc executives told staff that Tesla Inc Chief Executive Elon Musk's $44-billi… [+315 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine's Zelensky Says Russia Has \"Completely Destroyed\" Donbas Region", "description": "Ukrainian President Volodymyr Zelenskiy on Thursday said Russian forces had \"completely destroyed\" the industrial Donbas region and accused Moscow of carrying out senseless bombardments as it intensified its offensive.", "url": "https://www.ndtv.com/world-news/ukraines-zelenskiy-says-donbas-region-has-been-completely-destroyed-2992269", "urlToImage": "https://c.ndtvimg.com/2022-03/k27u67s8_ukraine-president-volodymyr-zelensky-650_625x300_12_March_22.jpg", "publishedAt": "2022-05-19T21:54:32Z", "content": "Ukraine War: \"It is hell there - and that is not an exaggeration,\" Zelensky said on Thursday.\r\nKyiv: Ukrainian President Volodymyr Zelenskiy on Thursday said Russian forces had \"completely destroyed\"… [+1137 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Twitter To Tackle Ukraine Conflict Misinformation With Warning Labels", "description": "Twitter Inc will begin placing warning notices in front of some misleading content regarding the conflict in Ukraine and limit the spread of claims debunked by humanitarian groups or other credible sources, the social media company said on Thursday.", "url": "https://www.ndtv.com/world-news/twitter-to-tackle-ukraine-conflict-misinformation-with-warning-labels-2992268", "urlToImage": "https://c.ndtvimg.com/2022-03/48be8em_ukraine-capital-kyiv-afp_625x300_03_March_22.jpg", "publishedAt": "2022-05-19T21:49:49Z", "content": "The new warning notices will alert users that a tweet has violated Twitter's rules over Ukraine war.\r\nNew York:  Twitter Inc will begin placing warning notices in front of some misleading content reg… [+1874 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Blinken Accuses Russia Of Blocking Exports Of Ukrainian Grain Amid Crisis", "description": "U.S. Secretary of State Antony Blinken accused Russia on Thursday of using food as a weapon in Ukraine by holding \"hostage\" the food supply for not just millions of Ukrainians, but also millions around the world who rely on Ukrainian exports.", "url": "https://www.ndtv.com/world-news/antony-blinken-accuses-russia-of-blocking-exports-of-ukrainian-grain-amid-global-food-crisis-2992261", "urlToImage": "https://c.ndtvimg.com/2021-09/fo4ievhg_antony-blinken-afp-650_625x300_14_September_21.jpg", "publishedAt": "2022-05-19T21:29:14Z", "content": "Blinken rejected Russian accusations that Western sanctions on Moscow fueling the food crisis.\r\nUnited Nations: U.S. Secretary of State Antony Blinken accused Russia on Thursday of using food as a we… [+2004 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "G7 Countries Commit $18.4 Billion Aid Package For Ukraine", "description": "The Group of Seven (G7) industrialised nations have committed $18.4 billion in transfers and loans to help Ukraine meet its immediate financing needs, according to a draft communique seen by Reuters on Thursday.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-g7-countries-commit-18-4-billion-aid-package-for-ukraine-2992252", "urlToImage": "https://c.ndtvimg.com/2022-04/uqnsrqv_russia-ukraine-war-_625x300_09_April_22.jpg", "publishedAt": "2022-05-19T21:04:05Z", "content": "Earlier, US congress approved a new $40 billion aid package for Ukraine on Thursday.\r\nKnigswinter, Germany: The Group of Seven (G7) industrialised nations have committed $18.4 billion in transfers an… [+585 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Confident\": German Chancellor's Support For Finland, Sweden NATO Bid", "description": "German Chancellor Olaf Scholz said on Thursday he was confident that Sweden and Finland would succeed in joining the NATO defence alliance and that Germany was doing everything possible to make that happen.", "url": "https://www.ndtv.com/world-news/german-chancellor-olaf-scholzs-support-for-finland-sweden-nato-bid-2992243", "urlToImage": "https://c.ndtvimg.com/2022-05/9urenit4_olaf-scholz-afp_625x300_19_May_22.jpg", "publishedAt": "2022-05-19T20:39:21Z", "content": "German Chancellor Scholz reiterated that Germany welcomed the Nordic countries' bids to join NATO.\r\nThe Hague: German Chancellor Olaf Scholz said on Thursday he was confident that Sweden and Finland … [+635 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Johnny Depp's Career Was Dimming Because Of \"Unprofessional Behaviour\": Ex-Agent", "description": "Johnny Depp's career and finances were already in serious trouble before his then-wife Amber Heard accused him of domestic violence in 2016, his former agent and business manager testified on Thursday.", "url": "https://www.ndtv.com/world-news/johnny-depps-career-was-dimming-because-of-unprofessional-behavior-says-actors-ex-agent-2992195", "urlToImage": "https://c.ndtvimg.com/2020-11/07eljdeg_johnny-depp650_625x300_02_November_20.jpg", "publishedAt": "2022-05-19T20:00:45Z", "content": "Johnny Depp denied ever striking Amber Heard and claimed that she was the one who was frequently violent.\r\nWashington: Johnny Depp's career and finances were already in serious trouble before his the… [+3986 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US, Russia Blame Each Other For Worsening Global Food Crisis", "description": "The United States and Russia blamed each other Thursday for the worsening food situation around the world as the war in Ukraine unfolds.", "url": "https://www.ndtv.com/world-news/us-russia-blame-each-other-for-worsening-global-food-crisis-2992182", "urlToImage": "https://c.ndtvimg.com/2022-05/1a3b11qk_wheat-generic_625x300_20_May_22.jpg", "publishedAt": "2022-05-19T19:44:36Z", "content": "UN chief has already urged Russia to allow exports of Ukrainian grain amid crisis.\r\nUnited Nations: The United States and Russia blamed each other Thursday for the worsening food situation around the… [+2030 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine War Could Continue For Long Time Despite...: US Warns", "description": "A senior Pentagon official said Thursday that the Ukraine war could continue for a long time despite Kyiv's forces recapturing the Kharkiv region and their use of substantial US artillery supplies.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-pentagon-warns-war-will-stretch-out-despite-ukraine-successes-2992150", "urlToImage": "https://c.ndtvimg.com/2022-03/u10q85a_antitank-constructions-kyivukrainereuters_625x300_07_March_22.jpg", "publishedAt": "2022-05-19T19:13:37Z", "content": "The Pentagon official said Russian forces face continuing issues in sustaining their invasion.\r\nWashington: A senior Pentagon official said Thursday that the Ukraine war could continue for a long tim… [+2925 chars]"}]}