{"status": "ok", "totalResults": 576, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Biden Protects US Forests But Struggles On Biggest Climate Goals", "description": "President Joe Biden marked Earth Day on Friday by ordering protections for ancient forests and pondering a future without his beloved gas-guzzling Corvette sports car, but after 14 months in office his more ambitious climate goals look elusive.", "url": "https://www.ndtv.com/world-news/joe-biden-protects-us-forests-but-struggles-on-biggest-climate-goals-2912502", "urlToImage": "https://c.ndtvimg.com/2022-03/97mfb244_joe-biden-afp_625x300_31_March_22.jpg", "publishedAt": "2022-04-23T01:50:33Z", "content": "Biden has risked angering environmental activists by seeking to free up fuel supplies (File)\r\nSeattle: President Joe Biden marked Earth Day on Friday by ordering protections for ancient forests and p… [+4754 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Indian Coast Guard Inducts New Vessel 'Urja Pravaha'", "description": "The Indian Coast Guard Ship (Auxiliary Barge) named 'Urja Pravaha' has been inducted into the Indian Coast Guard at Gujarat's Bharuch.", "url": "https://www.ndtv.com/india-news/indian-coast-guard-inducts-new-vessel-urja-pravaha-2912445", "urlToImage": "https://c.ndtvimg.com/2022-04/637or6pg_urja-pravaha-indian-coast-guard-650_625x300_23_April_22.jpg", "publishedAt": "2022-04-23T00:45:22Z", "content": "Indian Coast Guard's Auxiliary Barge 'Urja Pravaha' is 36 meters long.\r\nKochi: The Indian Coast Guard Ship (Auxiliary Barge) named 'Urja Pravaha' has been inducted into the Indian Coast Guard at Guja… [+991 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UN Chief To Meet Zelensky In War-Hit Ukraine After Russia Visit", "description": "UN Secretary General Antonio Guterres will meet with President Volodymyr Zelensky in Ukraine next week after a stop in Moscow to confer with President Vladimir Putin about the war, the UN said Friday.", "url": "https://www.ndtv.com/world-news/ukraine-war-un-chief-antonio-guterres-to-meet-volodymyr-zelensky-in-ukraine-after-russia-visit-2912462", "urlToImage": "https://c.ndtvimg.com/2021-08/b5204l5o_antonio-guterresunchiefafp_625x300_16_August_21.jpg", "publishedAt": "2022-04-23T00:26:41Z", "content": "The UN chief has had little contact with Zelensky since the Ukraine war began. (File)\r\nUnited Nations: UN Secretary General Antonio Guterres will meet with President Volodymyr Zelensky in Ukraine nex… [+1408 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "LIVE: 2,451 New Covid Cases In India, Masks Must In Delhi Public Places", "description": "India reported 2,451 new coronavirus infections yesterday as its active tally increased to 12,241, according to the Union health ministry. Besides, 54 new deaths increased the death count to 5,22,116.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-april-23-2912461", "urlToImage": "https://c.ndtvimg.com/2021-06/6i1ieuso_india-covid-afp_625x300_03_June_21.jpg", "publishedAt": "2022-04-23T00:18:47Z", "content": "India COVID-19 LIVE: 54 new deaths in India increased the death count to 5,22,116. (File)\r\nNew Delhi: India reported 2,451 new coronavirus infections yesterday as its active tally increased to 12,241… [+548 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "BJP Leader Alleges Attack In Mumbai, Claims Shiv Sena Tried To Kill Him", "description": "BJP leader Mohit Kamboj on Friday alleged that his car was attacked by a mob at Kalanagar Junction in Mumbai, and called it an attempt to kill him by the Shiv Sena and the Maharashtra Chief Minister Uddhav Thackeray.", "url": "https://www.ndtv.com/india-news/bjp-leader-mohit-kamboj-alleges-attack-in-mumbai-claims-shiv-sena-tried-to-kill-him-2912459", "urlToImage": "https://c.ndtvimg.com/2022-04/fnemqjog_bjp-leader-mohit-kambol-alleges-attack-650_625x300_23_April_22.jpg", "publishedAt": "2022-04-23T00:15:11Z", "content": "The BJP leader claimed the attack was Shiv Sena's attempt to kill him.\r\nMumbai: BJP leader Mohit Kamboj on Friday alleged that his car was attacked by a mob at Kalanagar Junction in Mumbai, and calle… [+1751 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "5.7 Magnitude Earthquake Shakes Bosnia, Tremors Felt Across Balkans", "description": "A 5.7-magnitude earthquake rocked southern Bosnia late Friday and was felt across the Balkans, the US Geological Survey said.", "url": "https://www.ndtv.com/world-news/5-7-magnitude-earthquake-shakes-bosnia-tremors-felt-across-balkans-2912458", "urlToImage": "https://i.ndtvimg.com/i/2016-12/earthquake-generic_650x400_71481076561.jpg", "publishedAt": "2022-04-23T00:06:46Z", "content": "Bosnia earthquake: There were no immediate reports of major damage.\r\nSarajevo: A 5.7-magnitude earthquake rocked southern Bosnia late Friday and was felt across the Balkans, the US Geological Survey … [+1082 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Zelensky's Call For Help After Russian General Eyes Southern Ukraine", "description": "Ukrainian President Volodymyr Zelensky warned that Russia's invasion of his country was just the beginning and that Moscow has designs on capturing other countries after a Russian general said it wants full control over southern Ukraine.", "url": "https://www.ndtv.com/world-news/ukraine-war-volodymyr-zelenskys-call-for-help-after-russian-general-eyes-southern-ukraine-2912452", "urlToImage": "https://c.ndtvimg.com/2022-04/bes8e8b8_ukraine-war-afp-650_625x300_11_April_22.jpg", "publishedAt": "2022-04-22T23:56:36Z", "content": "Ukraine War: Zelensky said all nations that believe in victory of life over death must help them. (File)\r\nKyiv/Mariupol: Ukrainian President Volodymyr Zelensky warned that Russia's invasion of his co… [+6043 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Law That Revokes Disney's Special Status Signed By Florida Governor", "description": "Florida governor Ron DeSantis on Friday signed a law that eliminates a statute that has for decades allowed entertainment giant Disney to act as a local government in Orlando, where it has its theme park.", "url": "https://www.ndtv.com/world-news/law-that-revokes-disneys-special-status-signed-by-florida-governor-2912447", "urlToImage": "https://i.ndtvimg.com/i/2016-06/walt-disney-world_650x400_41465964624.jpg", "publishedAt": "2022-04-22T23:49:46Z", "content": "Florida: There was no immediate response by Disney to the decision. (File)\r\nMiami: Florida governor Ron DeSantis on Friday signed a law that eliminates a statute that has for decades allowed entertai… [+2113 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Nirmala Sitharaman, World Bank Chief Discuss Covid, Ukraine War", "description": "Union Finance Minister Nirmala Sitharaman met with World Bank President David Malpass in Washington on Friday and discussed several key economic issues.", "url": "https://www.ndtv.com/india-news/nirmala-sitharaman-world-bank-chief-david-malpass-discuss-covid-ukraine-war-2912443", "urlToImage": "https://c.ndtvimg.com/2022-04/jufig2f_nirmala-sitharaman-world-bank-chief-david-malpass-650_625x300_23_April_22.jpg", "publishedAt": "2022-04-22T23:42:18Z", "content": "Nirmala Sitharaman also highlighted India's roadmap for infrastructure development.\r\nWashington: Union Finance Minister Nirmala Sitharaman met with World Bank President David Malpass in Washington on… [+2272 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "3-Year Jail Term For Accused In ISIS Module Case In Kerala", "description": "A National Investigation Agency (NIA) court in Kochi sentenced Siddiqul Aslam, an accused in the Kanakamala ISIS module case, to three years of imprisonment.", "url": "https://www.ndtv.com/india-news/3-year-jail-term-for-accused-in-isis-module-case-in-kerala-2912368", "urlToImage": "https://i.ndtvimg.com/i/2018-02/jail-generic_650x400_61517932452.jpg", "publishedAt": "2022-04-22T23:41:44Z", "content": "Kanakamala ISIS module case: In 2016, the NIA busted Ansar-ul-Khilafah Kerala group. (Representational)\r\nKochi: A National Investigation Agency (NIA) court in Kochi sentenced Siddiqul Aslam, an accus… [+1468 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Nobel Laureate Mario Vargas Llosa Hospitalised With Covid", "description": "Mario Vargas Llosa, the 2010 winner of the Nobel Prize for Literature, has been hospitalised after contracting Covid-19, but his condition is \"developing favourably,\" his son said on Friday.", "url": "https://www.ndtv.com/world-news/nobel-laureate-mario-vargas-llosa-hospitalised-with-covid-2912436", "urlToImage": "https://c.ndtvimg.com/2022-04/81hc4lbg_mario-vargas-llosa-afp-650_625x300_23_April_22.jpg", "publishedAt": "2022-04-22T23:33:58Z", "content": "Mario Vargas Llosa is the 2010 winner of the Nobel Prize for Literature. (File)\r\nMadrid: Mario Vargas Llosa, the 2010 winner of the Nobel Prize for Literature, has been hospitalised after contracting… [+1413 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Twitter Bans Ads That Defy Climate Change Science", "description": "Twitter on Friday banned ads that deny the reality of climate change.", "url": "https://www.ndtv.com/world-news/twitter-bans-ads-that-defy-climate-change-science-2912435", "urlToImage": "https://c.ndtvimg.com/2021-03/s46nnvp8_twitter-generic_625x300_02_March_21.jpg", "publishedAt": "2022-04-22T23:22:47Z", "content": "Twitter said it believes climate denialism shouldn't be monetized on its platform (Representational)\r\nSan Francisco: Twitter on Friday banned ads that deny the reality of climate change.\r\nTwitter's a… [+2508 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Arvind Kejriwal's Reply To Himachal Chief Minister's \"Delhi Model\" Remark", "description": "AAP convenor and Delhi Chief Minister Arvind Kejriwal on Friday stated that the Delhi model means an honest government and Himachal Pradesh too will get an 'honest government'.", "url": "https://www.ndtv.com/india-news/arvind-kejriwals-reply-to-himachal-chief-minister-jairam-thakurs-delhi-model-remark-2912260", "urlToImage": "https://c.ndtvimg.com/2022-04/8gu840h_arvind-kejriwal-bengaluru-pti-650_625x300_21_April_22.jpg", "publishedAt": "2022-04-22T23:00:48Z", "content": "Arvind Kejriwal said Delhi model means \"honest government\". (File)\r\nNew Delhi: AAP convenor and Delhi Chief Minister Arvind Kejriwal on Friday stated that the Delhi model means an honest government a… [+1270 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "3 Injured In US Shooting, Upscale Washington Neighborhood On Lockdown", "description": "Three people were wounded on Friday after a gunman opened fire with an automatic weapon in an upscale neighborhood of the US capital, police said.", "url": "https://www.ndtv.com/world-news/3-injured-in-us-shooting-upscale-washington-neighborhood-on-lockdown-2912424", "urlToImage": "https://c.ndtvimg.com/2022-04/n9a5d9_us-shooting-police-response-afp-270_625x300_23_April_22.jpg", "publishedAt": "2022-04-22T22:48:34Z", "content": "US Shooting: Police said three people had been taken to hospital.\r\nWas: Three people were wounded on Friday after a gunman opened fire with an automatic weapon in an upscale neighborhood of the US ca… [+1587 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rights Body Notice To Rajasthan Government Over Infant Deaths In Hospital", "description": "The National Human Rights Commission (NHRC) has issued a notice to the Rajasthan government on the death of two infants due to overheating of warmers at a government-run hospital in Ajmer district.", "url": "https://www.ndtv.com/india-news/national-human-rights-commission-nhrc-notice-to-rajasthan-government-over-infant-deaths-in-ajmer-hospital-2912265", "urlToImage": "https://c.ndtvimg.com/infant-generic-pixabay-650_625x300_1529668835751.jpg", "publishedAt": "2022-04-22T20:48:46Z", "content": "Rajasthan Infant Deaths: The NHRC has called for a detailed report within six weeks. (Representational)\r\nNew Delhi: The National Human Rights Commission (NHRC) has issued a notice to the Rajasthan go… [+1154 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Girl Students Locked On UP School Roof By 2 Teachers Over Transfer Orders", "description": "Around 24 students of Kasturba Gandhi Balika Vidyalaya at Behjam in Lakhimpur Kheri district were allegedly locked on the roof of the school by two teachers to pressure the district authorities into cancelling their transfer orders, officials said.", "url": "https://www.ndtv.com/india-news/girl-students-locked-on-up-school-roof-by-2-teachers-over-transfer-orders-2912267", "urlToImage": "https://i.ndtvimg.com/i/2018-04/classroom-generic_650x400_81524576018.jpg", "publishedAt": "2022-04-22T20:33:44Z", "content": "UP: A departmental probe into the matter has been ordered, said an education officer. (Representational)\r\nLakhimpur Kheri (UP): Around 24 students of the Kasturba Gandhi Balika Vidyalaya at Behjam in… [+1475 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "India, UK Express Zero Tolerance For Terrorism In All Forms", "description": "Prime Minister Narendra Modi and his UK counterpart Boris Johnson on Friday expressed zero tolerance for terrorism in all its forms - and for those who encourage, support and finance terrorism or provide sanctuary to terrorists.", "url": "https://www.ndtv.com/india-news/india-uk-express-zero-tolerance-for-terrorism-in-all-forms-2912330", "urlToImage": "https://c.ndtvimg.com/2022-04/ra4mkte_modiboris-pti_625x300_22_April_22.jpg", "publishedAt": "2022-04-22T20:27:08Z", "content": "PM Modi and Boris Johnson reiterated their condemnation of terrorist attacks in India and the UK.\r\nNew Delhi: Prime Minister Narendra Modi and his UK counterpart Boris Johnson on Friday expressed zer… [+1815 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Gurgaon Grocery Shop Owner Shot Dead For Slapping Man, Accused Arrested", "description": "A man has been arrested for allegedly shooting dead a grocery store owner who had slapped him a few days ago, police said on Friday.", "url": "https://www.ndtv.com/gurgaon-news/gurgaon-grocery-shop-owner-shot-dead-for-slapping-man-accused-arrested-2912273", "urlToImage": "https://c.ndtvimg.com/2019-08/870972to_gun-generic-pixabay-650_625x300_07_August_19.jpg", "publishedAt": "2022-04-22T19:54:57Z", "content": "Gurgaon: Police said the accused killed the victim to avenge the slap. (Representational)\r\nGurgaon: A man has been arrested for allegedly shooting dead a grocery store owner who had slapped him a few… [+798 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sri Lanka Says India, World Bank Considering $2 Billion Bridge Finance", "description": "Sri Lanka's finance minister said on Friday that India and the World Bank are considering extending about $2 billion in bridge finance so it can continue essential imports.", "url": "https://www.ndtv.com/world-news/sri-lanka-says-india-world-bank-considering-2-billion-bridge-finance-2911825", "urlToImage": "https://c.ndtvimg.com/2022-04/ui2b5u4c_sri-lanka-crisis-afp_625x300_17_April_22.jpg", "publishedAt": "2022-04-22T19:43:46Z", "content": "India has also deferred about $1.5 billion in import payments to Sri Lanka. (File)\r\nColombo: Sri Lanka's finance minister said on Friday that India and the World Bank are considering extending about … [+1956 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Admits Losses In Moskva Warship Sinking: One Dead, 27 Missing", "description": "Russia said Friday that one crew member died and 27 went missing after the Moskva missile cruiser sank last week, Moscow's first admission of the losses following the tragedy.", "url": "https://www.ndtv.com/world-news/russia-admits-losses-in-moskva-warship-sinking-one-dead-27-missing-2912286", "urlToImage": "https://c.ndtvimg.com/2022-04/sgkt18fo_moskva-sinking-twitter_625x300_18_April_22.jpg", "publishedAt": "2022-04-22T19:28:35Z", "content": "Moskva warship sinking: Russia said 396 members of the crew were evacuated. (File)\r\nMoscow: Russia said Friday that one crew member died and 27 went missing after the Moskva missile cruiser sank last… [+527 chars]"}]}