{"status": "ok", "totalResults": 581, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "In Call With India, US Stresses On Collective Response To Ukraine Crisis", "description": "US Secretary of State Antony Blinken held a telephonic conversation with India's External Affairs Minister S Jaishankar and stressed the importance of a strong collective response to condemn Russia's invasion of Ukraine, an official spokesperson said", "url": "https://www.ndtv.com/india-news/in-call-with-india-us-stresses-on-collective-response-to-ukraine-crisis-2788325", "urlToImage": "https://c.ndtvimg.com/2022-02/jmo006sg_ukraine-crisis-afp-650_625x300_24_February_22.jpg", "publishedAt": "2022-02-25T01:50:22Z", "content": "Russia launched its invasion by land, air and sea on Thursday.\r\nWashington: US Secretary of State Antony Blinken held a telephonic conversation with India's External Affairs Minister S Jaishankar and… [+1971 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "BJP MLA Threatens To Quit Over Police Inaction After \"Assault\" On Father", "description": "BJP MLA from Gujarat's Kheda district Kesrisinh Solanki threatened to resign alleging inaction by police following an alleged assault on his father.", "url": "https://www.ndtv.com/india-news/gujarat-bjp-gujarat-bjp-mla-threatens-to-quit-over-police-inaction-after-assault-on-father-2788335", "urlToImage": "https://c.ndtvimg.com/2019-04/3e0isskg_bjp-flag_625x300_13_April_19.jpg", "publishedAt": "2022-02-25T01:49:10Z", "content": "BJP MLA alleged that 4 persons attacked his father on February 8 following a minor dispute.\r\nKheda, Gujarat: BJP MLA from Gujarat's Kheda district Kesrisinh Solanki threatened to resign alleging inac… [+1396 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Thousands Of Fleeing Ukrainians Start Arriving In Central Europe", "description": "Thousands of Ukrainians fleeing war with Russia started arriving in neighbouring central European countries on Thursday and the region braced for many more, setting up reception points and sending troops towards the borders to provide assistance.", "url": "https://www.ndtv.com/world-news/ukraine-russia-crisis-thousands-of-fleeing-ukrainians-start-arriving-in-central-europe-2788328", "urlToImage": "https://c.ndtvimg.com/2022-02/76gsvutc_ukrainians-flee_625x300_25_February_22.jpg", "publishedAt": "2022-02-25T01:36:33Z", "content": "Poland, Hungary, Slovakia and Romania all share land borders with Ukraine.\r\nMedyka, Poland/Bucharest: Thousands of Ukrainians fleeing war with Russia started arriving in neighbouring central European… [+4934 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Fierce Fighting Across Ukraine, Over 100 Dead On Day 1 Of Russia Invasion", "description": "At least 137 Ukranians died as the former soviet state was attacked by Russia by land, sea and air in the biggest attack on a European state since the second World War. The US has said that President Vladimir Putin has grander ambitions than Ukraine.", "url": "https://www.ndtv.com/world-news/russia-ukraine-crisis-fierce-fighting-across-ukraine-over-100-dead-on-day-1-of-russia-invasion-10-points-2788327", "urlToImage": "https://c.ndtvimg.com/2022-02/1oukhp7_ukraine-crisis-afp-650_625x300_25_February_22.jpg", "publishedAt": "2022-02-25T01:34:19Z", "content": "<li>The invasion of Ukraine has invited severe economic sanctions on Russia. In a speech from the White House, US President Joe Biden said four more banks -- including the two biggest, Sberbank &amp;… [+2761 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"No To War\": From Japan To US, Thousands Protest Against Ukraine Invasion", "description": "Protesters turned out on public squares and outside Russian embassies in cities from Tokyo to Tel Aviv and New York on Thursday to denounce the invasion of Ukraine -- while more than a thousand who tried to do the same in Russia were arrested.", "url": "https://www.ndtv.com/world-news/ukraine-russia-war-no-to-war-from-japan-to-us-thousands-protest-against-ukraine-invasion-2788322", "urlToImage": "https://c.ndtvimg.com/2022-02/n3a4sku8_putin-protest_625x300_25_February_22.jpg", "publishedAt": "2022-02-25T01:25:15Z", "content": "Russia invaded Ukraine on Thursday, killing dozens.\r\nProtesters turned out on public squares and outside Russian embassies in cities from Tokyo to Tel Aviv and New York on Thursday to denounce the in… [+2769 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE Updates: India Reports Over 14,000 New Covid Cases", "description": "India reported more than 14,000 new coronavirus infections on Thursday, taking the total tally of COVID-19 cases to 4,28,81,179. According to the Union Health Ministry data, the active cases dipped to 1,48,359.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-25-february-2022-2788309", "urlToImage": "https://c.ndtvimg.com/2021-12/poj0l18_delhi-covid-testing-pti-650_650x400_31_December_21.jpg", "publishedAt": "2022-02-25T00:59:13Z", "content": "Covid cases in India: The number of active cases has fallen below two lakh after 49 days.\r\nNew Delhi: India reported more than 14,000 new coronavirus infections on Thursday, taking the total tally of… [+460 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Updates: Ukraine's President Says 137 Dead After First Day Of Fighting", "description": "Russia said its first day of the Ukraine invasion had achieved all its goals and that it had destroyed 83 land-based Ukrainian targets. According to official reports, Russia had carried out 203 attacks on its western neighbour since the beginning of", "url": "https://www.ndtv.com/world-news/russia-ukraine-crisis-live-updates-ukraines-president-says-137-dead-after-first-day-of-fighting-2788284", "urlToImage": "https://c.ndtvimg.com/2022-02/1oukhp7_ukraine-crisis-afp-650_625x300_25_February_22.jpg", "publishedAt": "2022-02-25T00:38:26Z", "content": "Ukraine crisis: Russian air strikes hit military installations across Ukraine on first day. (File)\r\nRussia said its first day of the Ukraine invasion had achieved all its goals and that it had destro… [+1111 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Dark Moment In History\": Indian-American Lawmaker On Ukraine Invasion", "description": "The invasion of Ukraine by Russian President Vladimir Putin is a blatant violation of international law, Indian-American Congressman Ro Khanna said, terming it a \"dark moment\" in history.", "url": "https://www.ndtv.com/world-news/ukraine-russia-crisis-dark-moment-in-history-indian-american-lawmaker-ro-khanna-on-ukraine-invasion-2788300", "urlToImage": "https://c.ndtvimg.com/2022-02/pvg6mfcg_ukraine-military-afp_625x300_24_February_22.jpg", "publishedAt": "2022-02-25T00:27:14Z", "content": "Ro Khanna also called for welcoming Ukrainian asylum seekers into the US.\r\nWashington: The invasion of Ukraine by Russian President Vladimir Putin is a blatant violation of international law, Indian-… [+1619 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US To Provide $600 Million To Ukraine For \"Lethal Weapons\" Against Russia", "description": "U.S. House of Representatives Speaker Nancy Pelosi on Thursday said lawmakers want to provide Ukraine with $600 million for \"lethal defense weapons\" to battle Russia's unfolding attack.", "url": "https://www.ndtv.com/world-news/us-congress-to-provide-600-million-to-ukraine-for-lethal-weapons-to-fight-against-russia-nancy-pelsoi-2788297", "urlToImage": "https://c.ndtvimg.com/2022-02/hmmms7tk_russia-ukraine-reuters_625x300_16_February_22.jpg", "publishedAt": "2022-02-25T00:01:30Z", "content": "Nancy Pelosi said lethal defense weapons will help Ukraine to fight against Russia.\r\nWashington: U.S. House of Representatives Speaker Nancy Pelosi on Thursday said lawmakers want to provide Ukraine … [+469 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine President Says \"Left Alone\" To Fight Against Russian Offensive", "description": "Ukraine's President Volodymyr Zelensky said Thursday his country was \"left alone\" to fight Russia after the Kremlin launched a large-scale invasion.", "url": "https://www.ndtv.com/world-news/ukraine-president-says-left-alone-to-fight-against-russian-offensive-2788290", "urlToImage": "https://c.ndtvimg.com/2022-02/r1n6m4ao_russian-tanks-reuters_625x300_24_February_22.jpg", "publishedAt": "2022-02-24T23:34:24Z", "content": "Ukraine President said that they have been \"left alone to defend our state.\"\r\nKyiv: Ukraine's President Volodymyr Zelensky said Thursday his country was \"left alone\" to fight Russia after the Kremlin… [+286 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Cargill Says Ship It Chartered \"Hit By Projectile\" Amid Ukraine Attack", "description": "Global farm commodities trader Cargill Inc said on Thursday that an ocean vessel it chartered was \"hit by a projectile\" on the Black Sea, but that the ship remained seaworthy and all crew", "url": "https://www.ndtv.com/world-news/cargill-chartered-ship-on-black-sea-hit-by-a-projectile-amid-ukraine-invasion-2788289", "urlToImage": "https://c.ndtvimg.com/2018-11/ni1f5jm4_ship-generic_625x300_21_November_18.jpg", "publishedAt": "2022-02-24T23:23:44Z", "content": "The incident occurred offshore from Ukraine on Thursday. (Representational image)\r\nGlobal farm commodities trader Cargill Inc said on Thursday that an ocean vessel it chartered was \"hit by a projecti… [+270 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine's President Says 137 Dead After First Day Of Fighting", "description": "President Volodymyr Zelensky said 137 Ukrainians died Thursday after his country came under a large-scale attack from Russian forces.", "url": "https://www.ndtv.com/world-news/ukraine-russia-conflict-ukraines-president-volodymyr-zelensky-says-137-dead-after-first-day-of-fighting-2788285", "urlToImage": "https://c.ndtvimg.com/2022-02/6mcaopao_ukraine-airbase-gostomel-afp_625x300_24_February_22.jpg", "publishedAt": "2022-02-24T23:10:31Z", "content": "President Volodymyr Zelensky said 137 Ukrainians died Thursday after his country came under a large-scale attack from Russian forces.\r\n\"Today we have lost 137 of our heroes, our citizens. Military an… [+94 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "3 US Ex-Cops Found Guilty In George Floyd Killing", "description": "A jury found three former Minneapolis police officers guilty on Thursday of violating the civil rights of George Floyd, the African American man whose May 2020 murder sparked nationwide protests.", "url": "https://www.ndtv.com/world-news/3-us-ex-cops-found-guilty-in-george-floyd-killing-2788282", "urlToImage": "https://c.ndtvimg.com/2020-06/oiuogk5_-george-floyd-afp-650_625x300_04_June_20.jpg", "publishedAt": "2022-02-24T22:53:20Z", "content": "The 46-year-old George Floyd was killed during the police arrest in May 2020.\r\nSaint Paul, United State: A jury found three former Minneapolis police officers guilty on Thursday of violating the civi… [+1105 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Macron Called Putin To \"Demand Immediate Halt\" To Russian Offensive", "description": "French President Emmanuel Macron called Russian counterpart Vladimir Putin \"to demand the immediate halt\" to Moscow's offensive in Ukraine, the Elysee Palace said on Thursday.", "url": "https://www.ndtv.com/world-news/frances-macron-called-putin-to-demand-immediate-halt-to-russian-offensive-2788275", "urlToImage": "https://c.ndtvimg.com/2022-02/gun9gfu_russia-ukraine-conflict-afp_625x300_12_February_22.jpg", "publishedAt": "2022-02-24T22:27:41Z", "content": "Earlier, the French president told,\"We will respond without weakneyess to this act of war\".\r\nParis: French President Emmanuel Macron called Russian counterpart Vladimir Putin \"to demand the immediate… [+1646 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Some 100,000 Displaced In Ukraine, Thousands Flee After Russia Attack: UN", "description": "The UN refugee agency said around 100,000 people had fled their homes within Ukraine and several thousand more had left the country since neighbouring Russia invaded early Thursday.", "url": "https://www.ndtv.com/world-news/some-100-000-displaced-in-ukraine-thousands-flee-after-russia-attack-un-2788266", "urlToImage": "https://c.ndtvimg.com/2022-02/urfqqvdo_ukraine-troop-afp_625x300_21_February_22.jpg", "publishedAt": "2022-02-24T22:05:25Z", "content": "UN urged neighbouring countries to keep their borders open for those seeking safety and shelter.\r\nGeneva: The UN refugee agency said around 100,000 people had fled their homes within Ukraine and seve… [+817 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "France Says Putin Needs To Understand NATO Has Nuclear Weapons", "description": "French Foreign Minister Jean-Yves Le Drian said on Thursday that Russian President Vladimir Putin, when making threats about using nuclear weapons, needs to understand that NATO, too, is a nuclear alliance.", "url": "https://www.ndtv.com/world-news/france-says-putin-needs-to-understand-nato-has-nuclear-weapons-2788256", "urlToImage": "https://c.ndtvimg.com/2022-02/0arkknv8_ukrainian-servicemen-lugansk-afp_625x300_24_February_22.jpg", "publishedAt": "2022-02-24T21:36:03Z", "content": "French Minister said that Putin needs to understand that NATO, too, is a nuclear alliance.\r\nParis: French Foreign Minister Jean-Yves Le Drian said on Thursday that Russian President Vladimir Putin, w… [+621 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US To Consult India On Ukraine Crisis: Joe Biden", "description": "President Joe Biden on Thursday said that the United States will have consultations with India on the crisis in Ukraine following a military operation from Russia.", "url": "https://www.ndtv.com/world-news/russia-ukraine-crisis-us-to-consult-india-on-ukraine-crisis-us-president-joe-biden-2788154", "urlToImage": "https://c.ndtvimg.com/2022-02/1oukhp7_ukraine-crisis-afp-650_625x300_25_February_22.jpg", "publishedAt": "2022-02-24T21:28:42Z", "content": "It is understood that India and US are not on the same page on Ukrainian crisis.\r\nWashington: President Joe Biden on Thursday said that the United States will have consultations with India on the cri… [+2915 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "In Call With Macron, Putin's \"Exhaustive Explanation\" On Ukraine Invasion", "description": "Russian leader Vladimir Putin held a \"frank\" phone conversation with French President Emmanuel Macron Thursday, the Kremlin said, after Moscow sent troops to invade its pro-Western neighbour Ukraine.", "url": "https://www.ndtv.com/world-news/in-call-with-macron-putins-exhaustive-explanation-on-ukraine-invasion-2788249", "urlToImage": "https://c.ndtvimg.com/2022-02/nggk48b_putin-macron-meet-over-russia-ukraine-conflict_625x300_07_February_22.jpeg", "publishedAt": "2022-02-24T21:17:08Z", "content": "Kremlin said it was a serious and frank exchange of views between Putin and Macron.\r\nMoscow: Russian leader Vladimir Putin held a \"frank\" phone conversation with French President Emmanuel Macron Thur… [+444 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "S Jaishankar Speaks To US Diplomat, Russian Minister Amid Ukraine Crisis", "description": "External Affairs Minister S Jaishankar on Thursday night held a telephonic conversation with US Secretary of State Antony Blinken and his Russian counterpart Sergey Lavrov on the Ukraine crisis.", "url": "https://www.ndtv.com/india-news/russia-ukraine-crisis-s-jaishankar-speaks-to-us-diplomat-antony-blinken-russian-minister-sergey-lavrov-2788179", "urlToImage": "https://c.ndtvimg.com/2022-02/4avui29o_ukraine-kyiv-vehicle-afp-650_625x300_25_February_22.jpg", "publishedAt": "2022-02-24T21:12:16Z", "content": "Russia-Ukraine crisis: S Jaishankar also held talks with his Russian counterpart.\r\nNew Delhi: External Affairs Minister S Jaishankar on Thursday night held a telephonic conversation with US Secretary… [+2603 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russian Restores Water Flow To Canal Linking Ukraine River With Crimea", "description": "Russian forces restored water flow to a canal linking the Dnieper River in Ukraine to Russian-annexed Crimea, a Russian defence ministry spokesperson said on Thursday, as Russia pressed ahead with a vast military operation against Ukraine.", "url": "https://www.ndtv.com/world-news/russia-ukraine-crisis-russian-restores-water-flow-to-canal-linking-ukraine-river-with-annexed-crimea-2788091", "urlToImage": "https://c.ndtvimg.com/2022-02/870mp3i_russia-crimea-afp-650_625x300_25_February_22.jpg", "publishedAt": "2022-02-24T20:53:35Z", "content": "Russia is pressing ahead with a vast military operation against Ukraine.\r\nMoscow: Russian forces restored water flow to a canal linking the Dnieper River in Ukraine to Russian-annexed Crimea, a Russi… [+501 chars]"}]}