{"status": "ok", "totalResults": 420, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Discrimination Against Sikhs Has Gone Up, Rights Expert Tells US Congress", "description": "Religious discrimination and hate crime against the Sikh community in the United States has increased in recent years, an eminent human rights expert has told the lawmakers urging the administration and the US Congress to take steps to end this.", "url": "https://www.ndtv.com/indians-abroad/discrimination-against-sikhs-have-increased-in-us-lawmakers-told-2809632", "urlToImage": "https://i.ndtvimg.com/i/2016-01/sikh-generic-new_650x400_81451916663.jpg", "publishedAt": "2022-03-08T01:38:32Z", "content": "Workplace discrimination harms Sikhs in a range of public and private sector jobs, said the advocate.\r\nWashington: Religious discrimination and hate crime against the Sikh community in the United Sta… [+4218 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Fighting Escalates In Ukraine, Civilians Bank On Evacuation Corridors", "description": "The third round of talks between Russia and Ukraine about ending hostilities brought some positive results, Kyiv said. However, Russia's lead negotiator said that expectations from talks \"were not fulfilled\".", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-negotiation-talk-results-fighting-still-on-despite-evacuation-corridors-zelensky-putin-latest-developments-2809630", "urlToImage": "https://c.ndtvimg.com/2022-03/f2hqgjh_ukraine-war-afp-650_625x300_06_March_22.jpg", "publishedAt": "2022-03-08T01:34:25Z", "content": "<li>Ukraine's presidential advisor said that small progress was made in the the third round of negotiations on opening of evacuation corridors. Russia's lead negotiator Vladimir Medinsky says Moscow'… [+1454 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Opinion: Don't Dilute Message Of Women's Day - by Brinda Karat", "description": "On March 8 this year, hundreds of millions of women across the world will celebrate the day not having been able to do so for the last two years because of the restrictions imposed by the pandemic.", "url": "https://www.ndtv.com/opinion/dont-dilute-message-of-womens-day-by-brinda-karat-2808652", "urlToImage": "https://c.ndtvimg.com/2022-03/7mqrhd2g_women-stock-650_625x300_07_March_22.jpg", "publishedAt": "2022-03-08T01:30:15Z", "content": "\"What are we having this liberty for. We are having this liberty in order to reform our social system, which is full of inequality, discrimination and other things, which conflict with our fundamenta… [+7926 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Edited by NDTV News Desk", "title": "Ukraine-Russia War Live: No Breakthrough On Humanitarian Corridors", "description": "Amid the escalating Ukraine-Russia conflict, Ukrainian Foreign Minister Dmytro Kuleba has confirmed his plans to meet with his Russian counterpart Sergey Lavrov on March 10.", "url": "https://www.ndtv.com/world-news/ukraine-russia-war-live-updates-russia-ukraine-hold-third-round-of-talks-no-breakthrough-on-humanitarian-corridors-2809624", "urlToImage": "https://c.ndtvimg.com/2022-03/2kfi9njo_ukraine-war_625x300_08_March_22.jpg", "publishedAt": "2022-03-08T01:21:22Z", "content": "Vladimir Putin said he is not sending conscripts or reservists to fight\r\nUkraine and Russia made tentative progress in talks Monday but failed to reach a deal on creating \"humanitarian corridors\" fro… [+1519 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Safe Corridor Didn't Materialise\": India On Students In Ukraine's Sumy", "description": "Raising concern about the worsening situation in Ukraine, India on Tuesday said that the ensuing humanitarian crisis deserves immediate and urgent attention.", "url": "https://www.ndtv.com/india-news/ukraine-war-safe-corridor-for-students-in-sumy-did-not-materialise-india-tells-un-security-council-news-agency-pti-2809623", "urlToImage": "https://c.ndtvimg.com/2022-03/bh2uffdg_indian-students-fled-ukraineromaniareuters_625x300_02_March_22.jpg", "publishedAt": "2022-03-08T01:20:24Z", "content": "New Delhi: Raising concern about the worsening situation in Ukraine, India on Tuesday said that the ensuing humanitarian crisis deserves immediate and urgent attention.\r\nIndia's UN Ambassador T S Tir… [+746 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE: India Records 4,362 New Covid Cases", "description": "India on Monday reported a total of 4,362 COVID-19 infections, taking the Covid tally to 4,29,67,315. According to the Union Health Ministry data, the active cases dipped to 54,118.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-8-march-2022-2809620", "urlToImage": "https://c.ndtvimg.com/2020-11/j50nmb7o_noidadelhi-random-covid-testing_625x300_18_November_20.jpg", "publishedAt": "2022-03-08T01:13:49Z", "content": "With 66 fresh fatalities, the death count climbed to 5,15,102 so far.\r\nNew Delhi: India on Monday reported a total of 4,362 COVID-19 infections, taking the Covid tally to 4,29,67,315. According to th… [+507 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine Crisis: US General Asks American Troops To Stop \"Great Power War\"", "description": "Top US General Mark Milley on Monday asked American troops stationed in Europe to display their resolve to prevent \"a great power war\" following Russia's invasion of Ukraine.", "url": "https://www.ndtv.com/world-news/ukraine-war-top-us-general-asks-american-troops-to-stop-great-power-war-2809601", "urlToImage": "https://i.ndtvimg.com/i/2017-09/us-army-reuters_650x400_81504721306.jpg", "publishedAt": "2022-03-08T00:46:39Z", "content": "The United States has around 67,000 soldiers permanently stationed in Europe.\r\nConstanta, Romania: Top US General Mark Milley on Monday asked American troops stationed in Europe to display their reso… [+1723 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "1 Dead, Two Injured In Shooting Outside US High School", "description": "Des Moines police officers and fire department rescue personnel arrived at East High School, located in the center of the state capital city, around 2:48 pm (1848 GMT), the police department said in a statement.", "url": "https://www.ndtv.com/world-news/1-dead-two-injured-in-shooting-outside-iowa-high-school-in-us-2809598", "urlToImage": "https://c.ndtvimg.com/2022-03/cjjrs798_us-shooting_625x300_01_March_22.jpg", "publishedAt": "2022-03-08T00:37:40Z", "content": "\"The gunfire appears to have come from a passing vehicle,\" the statement said. (File)\r\nWashington: One teenager died and another two were injured outside their high school in the US state of Iowa Mon… [+1715 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Google Doodle Celebrates International Women's Day With Animated Slideshow", "description": "Search engine giant Google is celebrating International Women's day with a special Doodle today. The Doodle's animated video features women in their diverse roles in society - from homemakers to scientists.", "url": "https://www.ndtv.com/india-news/google-doodle-celebrates-international-womens-day-with-animated-slideshow-2809591", "urlToImage": "https://c.ndtvimg.com/2022-03/uvs5p8b8_doodle-womens-day_625x300_08_March_22.jpg", "publishedAt": "2022-03-08T00:13:50Z", "content": "Today's Doodle has been illustrated by Doodle Art Director Thoka Maer.\r\nNew Delhi: Search engine giant Google is celebrating International Women's day with a special Doodle today. The Doodle's animat… [+1229 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Recruiting Syrians To Fight In Ukraine: Pentagon", "description": "Russia is recruiting Syrians and other foreign fighters as it ramps up its assault on Ukraine, the Pentagon said Monday.", "url": "https://www.ndtv.com/world-news/russia-recruiting-syrians-to-fight-in-ukraine-pentagon-2809582", "urlToImage": "https://c.ndtvimg.com/2022-03/iule9log_ukraine-war-afp-650_625x300_04_March_22.jpg", "publishedAt": "2022-03-07T23:27:57Z", "content": "Foreign combatants have already entered the Ukrainian conflict on both sides, Pentagon said.\r\nWashington: Russia is recruiting Syrians and other foreign fighters as it ramps up its assault on Ukraine… [+2699 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Explained: What Would Be The Impact Of A US Ban On Russian Oil Imports?", "description": "The movement to bar imports of Russians oil exports has gained momentum in recent days in Washington following Moscow's brutal invasion of Ukraine.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-explained-what-would-be-the-impact-of-a-us-ban-on-russian-oil-imports-2809580", "urlToImage": "https://i.ndtvimg.com/i/2016-08/crude-oil-650_650x400_71471248828.jpg", "publishedAt": "2022-03-07T23:14:28Z", "content": "Russia accounts for less than 10 percent of US imports of oil and petroleum products.\r\nNew York: The movement to bar imports of Russians oil exports has gained momentum in recent days in Washington f… [+5899 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russian Troops Stopping Civilian Evacuations From War Zones: Zelensky", "description": "Ukrainian President Volodymyr Zelensky on Monday accused the Russian army of scuppering the evacuation of civilians through humanitarian corridors agreed after talks with Moscow.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-russian-troops-stopping-civilian-evacuations-from-war-zones-ukraines-president-volodymyr-zelensky-2809574", "urlToImage": "https://c.ndtvimg.com/2022-03/7d095j4_ukraine-war-kyiv-afp-650_625x300_06_March_22.jpg", "publishedAt": "2022-03-07T23:01:37Z", "content": "Zelensky said that Kyiv would continue to negotiate with Russia to reach a peace deal.\r\nKyiv: Ukrainian President Volodymyr Zelensky on Monday accused the Russian army of scuppering the evacuation of… [+1660 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Will Not Send Conscript Soldiers To Fight In Ukraine: Putin", "description": "Russian President Vladimir Putin on Monday said he will not send conscripts or reservists to fight in Ukraine and that \"professional\" soldiers fulfilling \"fixed objectives\" were leading the war.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-russia-will-not-send-conscript-soldiers-to-fight-in-ukraine-vladimir-putin-2809563", "urlToImage": "https://c.ndtvimg.com/2022-01/6bm9qbeo_russia-army-reuters_625x300_25_January_22.jpg", "publishedAt": "2022-03-07T22:26:12Z", "content": "\"There will not be an additional conscription of reservists either,\" Putin said.\r\nMoscow: Russian President Vladimir Putin on Monday said he will not send conscripts or reservists to fight in Ukraine… [+597 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UN Calls For Safe Passage In Ukraine To Send Humanitarian Aid", "description": "The United Nations needs safe passage to deliver humanitarian aid to conflict zones in Ukraine, a senior official with the organization told the Security Council on Monday.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-un-calls-for-safe-passage-in-ukraine-to-send-humanitarian-aid-2809559", "urlToImage": "https://c.ndtvimg.com/2022-03/s2e8ckto_ukraine-russia-war-afp-650_625x300_04_March_22.jpg", "publishedAt": "2022-03-07T22:12:32Z", "content": "Russia said it would open up humanitarian corridors on Tuesday.\r\nUnited Nations: The United Nations needs safe passage to deliver humanitarian aid to conflict zones in Ukraine, a senior official with… [+2835 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Regime Of Silence\": Russia's New Plan For Refugee Corridors In Ukraine", "description": "Russia said Monday it will open humanitarian corridors the next day to allow civilians to evacuate form several Ukrainian cities, including the capital Kyiv and the port city of Mariupol, Russian news agencies reported.", "url": "https://www.ndtv.com/world-news/regime-of-silence-russias-new-plan-for-refugee-corridors-in-ukraine-2809551", "urlToImage": "https://c.ndtvimg.com/2022-03/en47u4vg_ukraine-russia-war-afp-650_625x300_06_March_22.jpg", "publishedAt": "2022-03-07T21:39:14Z", "content": "Russian Federation is ready to provide humanitarian corridors, Defence Ministry's statement said.\r\nMoscow: Russia said Monday it will open humanitarian corridors the next day to allow civilians to ev… [+632 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Spain's Ex-King Juan Carlos To Stay In UAE: Royal Palace", "description": "Spain's former King Juan Carlos will remain for now in the UAE but will visit Spain frequently, the Royal Palace of Madrid said a week after the country's prosecutor office dropped two investigations into alleged fraud in his business dealings.", "url": "https://www.ndtv.com/world-news/spains-ex-king-juan-carlos-to-stay-in-uae-royal-palace-2809546", "urlToImage": "https://c.ndtvimg.com/2020-08/h0vibcv8_spains-former-king-juan-carlos-afp_625x300_04_August_20.jpg", "publishedAt": "2022-03-07T21:22:48Z", "content": "I prefer in this moment to continue living in a permanent and stable way in Abu Dhabi, Carlos said.\r\nMadrid: Spain's former King Juan Carlos will remain for now in the United Arab Emirates but will v… [+1995 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"No Decision\" Yet From Biden On Ban Of Russian Oil Imports: White House", "description": "US President Joe Biden has made no decision at this stage on a possible ban on imports of Russian oil and gas in response to the invasion of Ukraine, the White House said.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-white-house-says-no-decision-yet-from-biden-on-ban-of-russian-oil-imports-2809542", "urlToImage": "https://c.ndtvimg.com/2022-02/1vda8k4_joe-biden-reuters_625x300_23_February_22.jpg", "publishedAt": "2022-03-07T21:01:33Z", "content": "White House says question had raised during Biden's talks with leaders of Germany, France and UK.\r\nWashington: US President Joe Biden has made no decision at this stage on a possible ban on imports o… [+473 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Says Oil Prices Will Hit $300 A Barrel If US, Europe Ban Imports", "description": "Russian Deputy Prime Minister Alexander Novak warned Monday that a ban on Russian oil imports would have \"catastrophic\" consequences, as Western allies consider further sanctions on Moscow over Ukraine.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-russia-says-oil-prices-will-hit-300-a-barrel-if-us-europe-ban-imports-2809529", "urlToImage": "https://c.ndtvimg.com/2021-11/37vqsnko_crude-oil-reuters_625x300_23_November_21.jpg", "publishedAt": "2022-03-07T20:37:56Z", "content": "\"So far we have not made this decision. Nobody will benefit from this,\" Russian Deputy PM said.\r\nMoscow: Russian Deputy Prime Minister Alexander Novak warned Monday that a ban on Russian oil imports … [+1289 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US, France, Germany, UK Vow To Further Raise \"Costs\" On Russia", "description": "The leaders of the United States, France, Germany and Britain vowed Monday to further punish Russia over its invasion of Ukraine, the White House said after video teleconference talks.", "url": "https://www.ndtv.com/world-news/ukraine-crisis-us-france-germany-uk-vow-to-further-raise-costs-on-russia-2809503", "urlToImage": "https://c.ndtvimg.com/2022-03/65bdqcig_ukraine-russia-war-afp-650_625x300_04_March_22.jpg", "publishedAt": "2022-03-07T20:07:53Z", "content": "Western allies have maintained a unified front on sanctions against Russia over its assault on Ukraine.\r\nWashington: The leaders of the United States, France, Germany and Britain vowed Monday to furt… [+1558 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine, Russia Fail To Agree On Humanitarian Corridors", "description": "Ukraine and Russia made tentative progress in talks Monday but failed to reach a deal on creating \"humanitarian corridors\" from pummelled cities, as the bloodshed from Moscow's invasion mounted.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-ukraine-russia-fail-to-agree-on-humanitarian-corridors-2809488", "urlToImage": "https://c.ndtvimg.com/2022-03/602660c_ukraine-war_625x300_07_March_22.jpg", "publishedAt": "2022-03-07T19:31:31Z", "content": "The bloodshed continued on day 12 of the war, with 13 people killed in shelling.\r\nKyiv: Ukraine and Russia made tentative progress in talks Monday but failed to reach a deal on creating \"humanitarian… [+6573 chars]"}]}