{"status": "ok", "totalResults": 196, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Five Key Takeaways From US Capitol Riot Hearings", "description": "A series of blockbuster congressional hearings that have shocked Americans with eye-popping allegations of a plot by Donald Trump to steal the 2020 election went on a break this week as investigators began taking stock of new evidence.", "url": "https://www.ndtv.com/world-news/donald-trump-five-key-takeaways-from-us-capitol-riot-hearings-3100970", "urlToImage": "https://c.ndtvimg.com/2021-12/1rmsll4_donald-trump-reuters_625x300_02_December_21.jpg", "publishedAt": "2022-06-26T02:02:20Z", "content": "Washington remains split over whether his election disinformation campaign (File)\r\nWashington: A series of blockbuster congressional hearings that have shocked Americans with eye-popping allegations … [+5331 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rare Mummified Wooly Mammoth Found In Canadian Gold Mine", "description": "Miners in the Klondike gold fields of Canada's far north have made a rare discovery, digging up the mummified remains of a near complete baby woolly mammoth.", "url": "https://www.ndtv.com/world-news/rare-mummified-wooly-mammoth-found-in-canadian-gold-mine-3100960", "urlToImage": "https://c.ndtvimg.com/2022-06/ml823i7o_baby-wooly-mammoth_625x300_26_June_22.jpg", "publishedAt": "2022-06-26T00:59:16Z", "content": "The animal is believed to be female and would have died during the ice age.\r\nCanada: Miners in the Klondike gold fields of Canada's far north have made a rare discovery, digging up the mummified rema… [+1618 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Bypolls Vote-Count On 3 Lok Sabha, 7 Assembly Seats Today: 10 Points", "description": "Votes will be counted today in three Lok Sabha and seven assembly seats across five states and Delhi, where bypolls were held on June 23. Tripura Chief Minister Manik Saha is among the key candidates of the assembly by-election.", "url": "https://www.ndtv.com/india-news/bypoll-vote-counting-today-bypolls-vote-count-on-3-lok-sabha-7-assembly-seats-today-10-points-3100778", "urlToImage": "https://c.ndtvimg.com/2019-05/aq7kpjgc_evm-generic_625x300_21_May_19.jpg", "publishedAt": "2022-06-26T00:30:04Z", "content": "<li>Tripura bypolls was held on seats - Agartala, Jubarajnagar, Surma and Town Bardowali. Rajya Sabha MP Mr Saha, who contested from Town Bardowali, needs to win to continue as Chief Minister.\r\n</li>… [+2128 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia's Focus On Ukraine's East With Crucial Strategic Capture Of City", "description": "Russia's army has \"fully occupied\" the key Ukrainian city of Severodonetsk after weeks of fighting, its mayor said Saturday, as Russian President Vladimir Putin said Moscow would be able to send nuclear-capable missiles to Belarus within months.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-russias-focus-on-ukraines-east-with-crucial-strategic-capture-of-city-3100945", "urlToImage": "https://c.ndtvimg.com/2022-06/623c0ch4_russia-ukraine-war-afp_625x300_20_June_22.jpg", "publishedAt": "2022-06-26T00:23:44Z", "content": "Russia-Ukraine War: Russia's launched an attack on Ukraine on February 24.\r\nKyiv: Russia's army has \"fully occupied\" the key Ukrainian city of Severodonetsk after weeks of fighting, its mayor said Sa… [+5306 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE Updates: India Reports 15,940 Covid Cases In 24 Hours", "description": "India reported 15,940 new cases of Covid-19 cases on Friday, the Union Health Ministry said. With this, India's active caseload stood at 91,779 at the rate of 0.21 per cent, which was 88,284 at the rate of 0.20 per cent a day before.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-june-26-3100944", "urlToImage": "https://c.ndtvimg.com/2022-01/3mckphk_india-coronavirusafp_625x300_29_January_22.jpg", "publishedAt": "2022-06-26T00:08:41Z", "content": "India Coronavirus LIVE Updates: India's daily positivity rate stands at 4.39 per cent.\r\nNew Delhi: India reported 15,940 new cases of Covid-19 cases on Friday, the Union Health Ministry said. With th… [+644 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Ukraine Can Win And It Will\": UK's Boris Johnson Asserts At G7 Summit", "description": "British Prime Minister Boris Johnson on Saturday urged fellow G7 leaders not to \"give up\" on Ukraine four months into Russia's grinding war, as he pledged fresh financial support for Kyiv.", "url": "https://www.ndtv.com/world-news/g7-summit-ukraine-can-win-and-it-will-uks-boris-johnson-asserts-at-g7-summit-3100942", "urlToImage": "https://c.ndtvimg.com/2022-06/atbqrg54_boris-johnson-reuters_625x300_06_June_22.jpg", "publishedAt": "2022-06-26T00:00:53Z", "content": "G7 Summit: Britain stands ready to provide another 429 million pounds.\r\nElmau, Germany: British Prime Minister Boris Johnson on Saturday urged fellow G7 leaders not to \"give up\" on Ukraine four month… [+2177 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "PM Modi Dials Amarinder Singh, Enquires About Health After Spinal Surgery", "description": "Prime Minister Narendra Modi on Saturday spoke to Punjab Lok Congress founder and former Punjab CM Captain Amarinder Singh to enquire about his health after he had undergone a successful spinal surgery today.", "url": "https://www.ndtv.com/india-news/amarinder-singh-spinal-surgery-pm-modi-dials-amarinder-singh-enquires-about-health-after-spinal-surgery-3100864", "urlToImage": "https://c.ndtvimg.com/2021-09/tvk8rdr8_amarinder-singh-pti_625x300_18_September_21.jpg", "publishedAt": "2022-06-25T23:53:17Z", "content": "Amarinder Singh Spinal Surgery: Amarinder Singh underwent successful spinal surgery in a London.\r\nNew Delhi: Prime Minister Narendra Modi on Saturday spoke to Punjab Lok Congress founder and former P… [+807 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Set In Stone\": France Wants To Enshrine Abortion Rights In Constitution", "description": "Politicians representing a parliamentary majority on Saturday voiced support for a bill enshrining abortion rights in France's constitution, after the US Supreme Court revoked the nationwide legal protection for American women.", "url": "https://www.ndtv.com/world-news/france-abortion-rights-set-in-stone-france-wants-to-enshrine-abortion-rights-in-constitution-3100937", "urlToImage": "https://c.ndtvimg.com/2022-06/dp1ahkko_us-abortion_625x300_25_June_22.jpg", "publishedAt": "2022-06-25T23:51:49Z", "content": "France Abortion Rights: France President Macron is seeking parliamentary allies to pass reforms.\r\nParis: Politicians representing a parliamentary majority on Saturday voiced support for a bill enshri… [+3603 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "PM Modi In Germany To Attend G7 Summit", "description": "Prime Minister Narendra Modi on Sunday departed for Germany to attend the G7 Summit, scheduled from June 26-27, where he will hold meetings with G7 and guest countries and exchange views on contemporary issues.", "url": "https://www.ndtv.com/india-news/pm-modi-g7-summit-pm-modi-news-pm-modi-in-germany-to-attend-g7-summit-3100850", "urlToImage": "https://c.ndtvimg.com/2022-04/1cvsauj_pm-modi-twitter_625x300_15_April_22.jpg", "publishedAt": "2022-06-25T23:43:28Z", "content": "PM Modi G7 Summit: PM Modi will also travel to UAE while coming back to India.\r\nNew Delhi: Prime Minister Narendra Modi on Sunday departed for Germany to attend the G7 Summit, scheduled from June 26-… [+2560 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"No Uterus, No Opinion\": Massive Protests In US As Abortion Right Ends", "description": "Abortion rights defenders fanned out across America Saturday for a second day of protest against the Supreme Court's thunderbolt ruling, as state after conservative state moved swiftly to ban the procedure.", "url": "https://www.ndtv.com/world-news/us-abortion-rights-protests-no-uterus-no-opinion-protests-in-us-as-abortion-right-ends-3100936", "urlToImage": "https://c.ndtvimg.com/2022-06/dr19ilj_abortion-rally-_625x300_25_June_22.jpg", "publishedAt": "2022-06-25T23:39:46Z", "content": "US Abortion Rights Protests: At least eight right-leaning states imposed immediate bans on abortion.\r\nWashington: Abortion rights defenders fanned out across America Saturday for a second day of prot… [+4421 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Iran Nuclear Talks To Resume \"Quickly, Immediately\": EU's Top Diplomat", "description": "Talks to revive the Iran nuclear deal will resume within days after being stalled for months, the EU's top diplomat Josep Borrell said Saturday during a surprise visit to Tehran.", "url": "https://www.ndtv.com/world-news/iran-nuclear-talks-iran-nuclear-deal-iran-nuclear-talks-2015-iran-nuclear-talks-to-resume-quickly-immediately-eus-top-diplomat-3100919", "urlToImage": "https://c.ndtvimg.com/2019-05/6c7epapg_iran-flag-reuters-650_625x300_20_May_19.jpg", "publishedAt": "2022-06-25T23:03:27Z", "content": "Iran Nuclear Talks: Negotiations to restore the nuclear deal resumed in late November. (File)\r\nTehran: Talks to revive the Iran nuclear deal will resume within days after being stalled for months, th… [+4493 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Bengaluru-Based Real Estate Group Head Arrested In Money Laundering Case", "description": "The ED on Saturday said it has arrested Sushil P Mantri, director of Bengaluru-based real estate group Mantri Developers Pvt. Ltd., in a money laundering probe linked to alleged duping of numerous homebuyers.", "url": "https://www.ndtv.com/india-news/bengaluru-based-real-estate-group-head-arrested-in-money-laundering-case-3100166", "urlToImage": "https://i.ndtvimg.com/i/2016-05/arrest-generic_650x400_71463458726.jpg", "publishedAt": "2022-06-25T22:56:09Z", "content": "The agency said it filed a money laundering case against the group. (Representational)\r\nNew Delhi: The ED on Saturday said it has arrested Sushil P Mantri, director of Bengaluru-based real estate gro… [+1894 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Gurgaon Woman, 19, Shot At By Spurned Lover On Her Way To Work: Police", "description": "A 19-year-old woman was injured after she was shot at by a jilted lover in IMT Manesar area here on Saturday morning.", "url": "https://www.ndtv.com/gurgaon-news/gurgaon-gurgaon-woman-19-shot-at-by-spurned-lover-on-her-way-to-work-police-3100495", "urlToImage": "https://c.ndtvimg.com/2021-09/h868cgro_-goa-police-_625x300_28_September_21.jpg", "publishedAt": "2022-06-25T22:52:38Z", "content": "Gurgaon: Initial investigation suggests it to be a case of jilted affair, police said. (Representational)\r\nGurugram: A 19-year-old woman was injured after she was shot at by a jilted lover in IMT Man… [+992 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Pregnant Woman Denied Treatment, Madhya Pradesh Rights Body Takes Action", "description": "The Madhya Pradesh Human Right Commission (MPHRC) has issued notices to the collector and the chief medical and health officer (CMHO) of Chhatarpur district after a poor woman lost her newborn baby.", "url": "https://www.ndtv.com/india-news/madhya-pradesh-pregnant-woman-denied-treatment-in-madhya-pradesh-rights-body-takes-action-3099218", "urlToImage": "https://c.ndtvimg.com/2021-06/ontt01q_hospital-generic-pixabay-650_625x300_17_June_21.jpg", "publishedAt": "2022-06-25T22:47:31Z", "content": "Madhya Pradesh: Collector said he has directed CMHO to take action. (Representational)\r\nBhopal: The Madhya Pradesh Human Right Commission (MPHRC) has issued notices to the collector and the chief med… [+1600 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Team India Captain Rohit Sharma Tests Positive For COVID-19 In England", "description": "Indian cricket team captain Rohit Sharma has tested positive for COVID-19, just days before the start of the rearranged Test match against England.", "url": "https://sports.ndtv.com/england-vs-india-2022/rohit-sharma-team-india-captain-tests-positive-for-covid-19-in-england-3100912", "urlToImage": "https://c.ndtvimg.com/2022-02/tfol9ng8_rohit-sharma-test-afp_625x300_20_February_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-25T22:21:07Z", "content": "Indian cricket team captain Rohit Sharma has tested positive for COVID-19, just days before the start of the rearranged Test match against England. The Board of Control for Cricket in India (BCCI) in… [+1601 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Many More Blows, Losses...\": Ukraine's Zelensky Reflects On Tough War", "description": "Ukrainian President Volodymyr Zelensky on Saturday said Ukraine would win back all the cities it had lost to Russia, including Sievierodonetsk, and admitted the war was becoming tough to handle emotionally.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-many-more-blows-losses-ukraines-zelensky-reflects-on-tough-war-3100885", "urlToImage": "https://c.ndtvimg.com/2022-06/0nnfarn_ukraine-zelensky-afp_625x300_11_June_22.jpg", "publishedAt": "2022-06-25T21:32:53Z", "content": "Russia-Ukraine War: Sievierodonetsk finally fell to Moscow's forces on Friday.\r\nUkrainian President Volodymyr Zelensky on Saturday said Ukraine would win back all the cities it had lost to Russia, in… [+1150 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Monkeypox \"Evolving Threat\", WHO Says. Then, This Reassurance", "description": "The World Health Organization's chief said Saturday that the monkeypox outbreak was a deeply concerning evolving threat but did not currently amount to a global public health emergency.", "url": "https://www.ndtv.com/world-news/monkeypox-monkeypox-spread-monkeypox-evolving-threat-who-says-then-this-reassurance-3100895", "urlToImage": "https://c.ndtvimg.com/2021-06/6cb3frfo_tedros-adhanom-ghebreyesus-650_625x300_26_June_21.jpeg", "publishedAt": "2022-06-25T21:31:43Z", "content": "Monkeypox Outbreak: Monkeypox has mainly affected western Europe.\r\nGeneva: The World Health Organization's chief said Saturday that the monkeypox outbreak was a deeply concerning evolving threat but … [+2854 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Joe Biden In Germany For G7 Meet. On Agenda: Russia, World Economy", "description": "President Joe Biden touched down in Germany on Saturday to attend the G7 summit with the leaders of key US allies to discuss their united front against Russia and troubling weakness in the world economy.", "url": "https://www.ndtv.com/world-news/joe-biden-g7-summit-joe-biden-in-germany-for-g7-meet-on-agenda-russia-world-economy-3100894", "urlToImage": "https://c.ndtvimg.com/2022-06/pevhgaus_joe-biden-reuters_625x300_13_June_22.jpg", "publishedAt": "2022-06-25T21:26:28Z", "content": "Joe Biden G7 Summit: US President Joe Biden flew from Washington to Munich.\r\nBerlin: President Joe Biden touched down in Germany on Saturday to attend the G7 summit with the leaders of key US allies … [+423 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Macron's Task For France PM: Start Talks To Form \"Government Of Action\"", "description": "French President Emmanuel Macron on Saturday \"confirmed\" his confidence in Prime Minister Elisabeth Borne in an interview with AFP, after the premier came under fire for a wooden performance in an election that saw her boss fail.", "url": "https://www.ndtv.com/world-news/france-political-deadlock-macrons-task-for-france-pm-start-talks-to-form-government-of-action-3100889", "urlToImage": "https://c.ndtvimg.com/2022-06/vc3059t4_macron-afp_625x300_04_June_22.jpg", "publishedAt": "2022-06-25T21:22:32Z", "content": "France Political Deadlock: France is facing a prolonged political deadlock.\r\nParis: French President Emmanuel Macron on Saturday \"confirmed\" his confidence in Prime Minister Elisabeth Borne in an int… [+2090 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "India To Become $30 Trillion Economy Very Soon: Minister Piyush Goyal", "description": "Union Minister Piyush Goyal on Saturday said India wants to capture the world market in all sectors and the country would \"very soon\" become a USD 30 trillion economy from the level of USD 3 trillion at present.", "url": "https://www.ndtv.com/india-news/india-to-become-30-trillion-economy-very-soon-minister-piyush-goyal-3100827", "urlToImage": "https://c.ndtvimg.com/2022-04/fmk3e5c4_piyush-goyal-koo_625x300_06_April_22.jpg", "publishedAt": "2022-06-25T18:46:27Z", "content": "In all sectors, we want to become a global industry, said Piyush Goyal. (FILE)\r\nNew Delhi: Union Minister Piyush Goyal on Saturday said India wants to capture the world market in all sectors and the … [+2869 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Congress \"Driving Force\" Behind Teesta Setalvad's Campaign: BJP", "description": "The BJP on Saturday cited the Supreme Court's critical comments against activist Teesta Setalvad to allege the Congress and its chief Sonia Gandhi were the \"driving force\" behind the activist's campaign against then Chief Minister Narendra Modi.", "url": "https://www.ndtv.com/india-news/sonia-gandhi-congress-driving-force-behind-teesta-setalvads-campaign-against-pm-narendra-modi-says-bjp-3100808", "urlToImage": "https://i.ndtvimg.com/i/2015-07/teesta-setalvad-cbi-pti-650_650x400_61437446308.jpg", "publishedAt": "2022-06-25T18:28:40Z", "content": "Teesta Setalvad has been detained by the Gujarat ATS\r\nNew Delhi: The BJP on Saturday cited the Supreme Court's critical comments against activist Teesta Setalvad to allege the Congress and its chief … [+2067 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Assam Couple, Daughter Found Murdered. Police Suspect Rape.", "description": "A couple and their daughter were found murdered at their house in Assam's Jorhat district on Saturday, the police said.", "url": "https://www.ndtv.com/india-news/assam-couple-daughter-found-murdered-police-suspect-rape-3100792", "urlToImage": "https://i.ndtvimg.com/i/2017-06/police-generic_650x400_81497845700.jpg", "publishedAt": "2022-06-25T18:14:51Z", "content": "The Assam Police said they are investigating the case (Representational)\r\nJorhat (Assam): A couple and their daughter were found murdered at their house in Assam's Jorhat district on Saturday, the po… [+504 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UGC NET 2022 Exam In July, August", "description": "The dates for the conduct of the University Grants Commission (UGC)-National Eligibility Test (NET) have been rolled out for July and August this year, informed an official on Saturday.", "url": "https://www.ndtv.com/jobs/ugc-net-2022-nta-net-exam-in-july-august-3100636", "urlToImage": "https://i.ndtvimg.com/i/2015-06/exam-generic_650x400_51435598669.jpg", "publishedAt": "2022-06-25T18:00:18Z", "content": "UGC-NET exam to be held in July, August 2022\r\nNew Delhi: The dates for the conduct of the University Grants Commission (UGC)-National Eligibility Test (NET) have been rolled out for July and August t… [+816 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "3rd Test Day 3: Overton Puts England On Top As New Zealand Go 5 Down", "description": "ENG vs NZ Day 3: Jamie Overton hit a stunning 97 on debut and then starred with the ball as England closed in on a series clean sweep against New Zealand.", "url": "https://sports.ndtv.com/cricket/england-vs-new-zealand-3rd-test-day-3-all-round-jamie-overton-puts-england-on-top-as-new-zealand-go-5-down-3100755", "urlToImage": "https://c.ndtvimg.com/2022-06/61ombqj_jamie-overton-afp_625x300_25_June_22.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-25T17:47:30Z", "content": "Jamie Overton hit a stunning 97 on his England debut and then starred with the ball as the hosts closed in on a series clean sweep against World Test champions New Zealand at Headingley. New Zealand … [+2973 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Virat Kohli Shines On Day 3 Of India vs Leicestershire Tour Game", "description": "Virat Kohli showed his class, hitting an impressive 67 off 98 balls as India finished their second innings on 364 for 7 against Leicestershire on day three of their four-day warm-up match on Saturday.", "url": "https://sports.ndtv.com/england-vs-india-2022/virat-kohli-shines-on-day-3-of-india-vs-leicestershire-tour-game-3100747", "urlToImage": "https://c.ndtvimg.com/2022-06/nsvlofdo_virat-kohli-806_625x300_25_June_22.jpg", "publishedAt": "2022-06-25T17:43:09Z", "content": "Virat Kohli showed his class, hitting an impressive 67 off 98 balls as India finished their second innings on 364 for 7 against Leicestershire on day three of their four-day warm-up match on Saturday… [+1991 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Will Chief Minister Be Never Held Accountable?: Congress Over 2002 Riots", "description": "The Congress Saturday asked if a chief minister or a state government will ever be held accountable even if the state is thrown into a circle of pre-meditated violence and riots.", "url": "https://www.ndtv.com/india-news/will-chief-minister-be-never-held-accountable-congress-over-2002-gujarat-riots-case-3100745", "urlToImage": "https://c.ndtvimg.com/2022-05/154hlh3o_randeep-surjewala_625x300_12_May_22.jpg", "publishedAt": "2022-06-25T17:43:04Z", "content": "New Delhi: The Congress Saturday asked if a chief minister or a state government will ever be held accountable even if the state is thrown into a circle of pre-meditated violence and riots, a day aft… [+3162 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Man City Poised To Sign Bielefeld Goalkeeper Stefan Ortega: Reports", "description": "Premier League champions Manchester City are on the verge of signing Stefan Ortega from relegated Bundesliga club Arminia Bielefeld as back up for first-choice goalkeeper Ederson, according to reports", "url": "https://sports.ndtv.com/football/manchester-city-poised-to-sign-arminia-bielefeld-goalkeeper-stefan-ortega-reports-3100656", "urlToImage": "https://c.ndtvimg.com/2022-06/71m1bis8_stefan-ortega-806_625x300_25_June_22.jpg", "publishedAt": "2022-06-25T17:03:24Z", "content": "Premier League champions Manchester City are on the verge of signing Stefan Ortega from relegated Bundesliga club Arminia Bielefeld as back up for first-choice goalkeeper Ederson, according to report… [+625 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Seized Cash Pile Covers Entire Bed, Bihar Officials Can't Stop Counting", "description": "A huge amount of cash has been seized from the home of a drugs inspector in Bihar's Patna. Officials of the vigilance department who raided the home of drugs inspector Jitendra Kumar took several hours to count the currency notes.", "url": "https://www.ndtv.com/india-news/seized-cash-pile-covers-entire-bed-bihar-officials-cant-stop-counting-3100625", "urlToImage": "https://c.ndtvimg.com/2022-06/t76ourvo_bihar-cash-seized_625x300_25_June_22.jpg", "publishedAt": "2022-06-25T16:53:22Z", "content": "Officials count the seized notes as part of investigation into assets case\r\nPatna: A huge amount of cash has been seized from the home of a drugs inspector in Bihar's Patna. Officials of the vigilanc… [+801 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Novak Djokovic Repeats No Vaccination Stance As US Open Slips Away", "description": "Novak Djokovic repeated his hardline refusal to get a Covid-19 vaccination Saturday as he resigned himself to sitting out the season's last Grand Slam at the US Open.", "url": "https://sports.ndtv.com/tennis/novak-djokovic-repeats-no-vaccination-stance-as-us-open-slips-away-3100612", "urlToImage": "https://c.ndtvimg.com/2022-06/psbqs3g8_novak-djokovic-afp_625x300_25_June_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-25T16:47:03Z", "content": "Novak Djokovic repeated his hardline refusal to get a Covid-19 vaccination Saturday as he resigned himself to sitting out the season's last Grand Slam at the US Open. Djokovic was deported from Melbo… [+1889 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Killed In Front Of Me\": Arrested Bureaucrat On Son's Death During Raid", "description": "The son of bureaucrat Sanjay Popli, who was arrested in a corruption case, died of a gunshot wound today in Chandigarh.", "url": "https://www.ndtv.com/india-news/killed-in-front-of-me-arrested-bureaucrat-sanjay-popli-on-sons-death-during-raid-3100603", "urlToImage": "https://c.ndtvimg.com/2022-06/l8l6rkhk_sanjay-popli_625x300_25_June_22.jpg", "publishedAt": "2022-06-25T16:37:17Z", "content": "Bureaucrat Sanjay Popli claims that his son was killed in front of him.\r\nNew Delhi: The son of bureaucrat Sanjay Popli, who was arrested in a corruption case, died of a gunshot wound today in Chandig… [+1520 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Video: Women Protesters vs Women Bouncers Outside Wine Shop, 10 Arrested", "description": "A protest outside a wine shop in Delhi turned violent after a clash broke out between two groups of women.", "url": "https://www.ndtv.com/delhi-news/women-protesters-vs-women-bouncers-outside-delhi-wine-shop-10-arrested-3100569", "urlToImage": "https://c.ndtvimg.com/2022-06/a4i915dc_women-bouncers-beat-up-protesters_625x300_25_June_22.jpg", "publishedAt": "2022-06-25T16:20:56Z", "content": "women bouncers, in black, were seen kicking and punching the women protestors\r\nNew Delhi: A protest outside a wine shop in Delhi turned violent after a clash broke out between two groups of women. Sc… [+1146 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Rafael Nadal Says Pain-Free For First Time In \"Year And Half\"", "description": "Rafael Nadal said Saturday that for the first time in 18 months he has defeated the crippling foot pain which threatened to push him to the brink of retirement", "url": "https://sports.ndtv.com/tennis/rafael-nadal-says-pain-free-for-first-time-in-year-and-half-3100547", "urlToImage": "https://c.ndtvimg.com/2022-06/f9t2j5u_rafael-nadal-afp_625x300_25_June_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-25T16:15:02Z", "content": "Rafael Nadal said Saturday that for the first time in 18 months he has defeated the crippling foot pain which threatened to push him to the brink of retirement. Nadal captured his 14th French Open an… [+1451 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Gujarat Ex Top Cop Arrested A Day After Court Ruling On 2002 Riots", "description": "A day after the Supreme Court upheld the clean chit given by an Special Enquiry Team (SIT) to Prime Minister Narendra Modi in the 2002 riots cases, Gujarat police on Saturday arrested former Director...", "url": "https://www.ndtv.com/india-news/gujarat-police-ex-top-cop-rb-sreekumar-arrested-a-day-after-court-ruling-on-2002-riots-3100545", "urlToImage": "https://c.ndtvimg.com/2022-06/2m9gktoo_rb-sreekumar_625x300_25_June_22.jpg", "publishedAt": "2022-06-25T16:14:01Z", "content": "R B Sreekumar instituted false proceedings against innocent people, read the complaint.\r\nAhmedabad: A day after the Supreme Court upheld the all clear given by a Special Investigation Team (SIT) to P… [+5546 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rahul Gandhi's Office Attack: Massive Protest Rally In Wayanad", "description": "The opposition Congress on Saturday took out a massive rally at Kalpetta protesting against SFI activists allegedly vandalising the office of its party leader and local MP Rahul Gandhi.", "url": "https://www.ndtv.com/india-news/rahul-gandhis-office-attack-massive-protest-rally-in-wayanad-3100505", "urlToImage": "https://c.ndtvimg.com/2022-06/9jam8f4g_rahul-gandhis-office-waynad-attacked-ani-twitter_625x300_24_June_22.jpg", "publishedAt": "2022-06-25T16:05:54Z", "content": "A group of protestors creating ruckus inside the Rahul Gandhi's office.\r\nWayanad (Kerala): The opposition Congress on Saturday took out a massive rally at Kalpetta here protesting against SFI activis… [+4705 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Counting Of Bypoll Votes Tomorrow In 3 Lok Sabha, 7 Assembly Seats", "description": "The fate of Tripura Chief Minister Manik Saha among others will be decided on Sunday when counting of votes takes place in three Lok Sabha and seven assembly seats spread across five states and Delhi where bypolls were held on June 23.", "url": "https://www.ndtv.com/india-news/bypolls-counting-of-votes-on-sunday-in-3-lok-sabha-7-assembly-seats-3100257", "urlToImage": "https://c.ndtvimg.com/2022-03/qeklno2_voting-generic-up-pti-650_650x400_07_March_22.jpg", "publishedAt": "2022-06-25T15:48:30Z", "content": "Polling in Tripura on Thursday was the highest at 76.62 per cent.\r\nNew Delhi: The fate of Tripura Chief Minister Manik Saha among others will be decided on Sunday when counting of votes takes place i… [+4039 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "BJP Ally To Merge With Tripura Royal's Party Ahead Of Assembly Polls", "description": "The Indigenous People's Front of Tripura, an ally of the BJP in the North-eastern state, will merge with Tripra Motha, a regional political party, on July 2 ahead of the Assembly elections due next year", "url": "https://www.ndtv.com/india-news/bjp-ally-to-merge-with-tripura-royals-party-ahead-of-assembly-polls-3100452", "urlToImage": "https://c.ndtvimg.com/2019-09/a2rbc8a_tripura-pradesh-congress-president-pradyot-bikram-manikya-deb-barman_625x300_24_September_19.jpg", "publishedAt": "2022-06-25T15:45:46Z", "content": "The Tipra Motha is headed by royal scion Pradyot Kishore Debbarma. (FILE)\r\nAgartala: The Indigenous People's Front of Tripura, an ally of the BJP in the North-eastern state, will merge with Tripra Mo… [+2684 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Violence During First Phase Panchayat Polls In Madhya Pradesh", "description": "Few incidents of violence have been reported today during the first phase of the three-phased panchayat polls in Madhya Pradesh's Gwalior-Chambal region.", "url": "https://www.ndtv.com/india-news/madhya-pradesh-panchayat-elections-violence-during-first-phase-panchayat-polls-in-madhya-pradesh-3100443", "urlToImage": "https://c.ndtvimg.com/2022-06/92ejjbj8_madhya-pradesh-panchayat-elections-violence-_625x300_25_June_22.jpg", "publishedAt": "2022-06-25T15:42:21Z", "content": "The incident resulted in halting the polling for some time at the concerned polling booth.\r\nBhopal: Few incidents of violence have been reported today during the first phase of the three-phased panch… [+1656 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Asian News International", "title": "IOC Excludes International Boxing Association From 2024 Paris Olympics", "description": "The Executive Board (EB) of the International Olympic Committee (IOC) has decided that the boxing qualifying events and competitions at the Olympic Games Paris 2024 will not be run under the authority of the International Boxing Association (IBA)", "url": "https://sports.ndtv.com/boxing/ioc-excludes-international-boxing-association-from-2024-paris-olympics-3100423", "urlToImage": "https://c.ndtvimg.com/2021-05/kkkn20m8_boxing-_625x300_11_May_21.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-25T15:32:10Z", "content": "The Executive Board (EB) of the International Olympic Committee (IOC) has decided that the boxing qualifying events and competitions at the Olympic Games Paris 2024 will not be run under the authorit… [+2555 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Hardik Pandya, Laxman Address Team India Ahead Of Ireland T20Is. See Pics", "description": "On the eve of the first T20I, Hardik Pandya and VVS Laxman addressed the Indian squad before the team's practice session at the venue.", "url": "https://sports.ndtv.com/ireland-vs-india-2022/hardik-pandya-vvs-laxman-address-team-india-ahead-of-ireland-t20is-see-pics-3100356", "urlToImage": "https://c.ndtvimg.com/2022-06/6uf057lo_hardik-pandya-vvs-laxman-806_625x300_25_June_22.jpg", "publishedAt": "2022-06-25T15:14:13Z", "content": "Team India have begun their preparations for the two-match T20I series against Ireland, starting June 26 in Malahide. While Hardik Pandya will lead the second-string Indian team, NCA chief VVS Laxman… [+1475 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Counting Of Votes To Take Place On June 26 For Key Delhi Bypoll", "description": "The counting of votes polled during the recently concluded Rajinder Nagar assembly by-poll in Delhi with all arrangements, including a three-tier security cover will begin at 8 am on Sunday, Delhi Chief Electoral Officer Ranbir Singh said.", "url": "https://www.ndtv.com/delhi-news/counting-of-votes-to-take-place-on-june-26-in-key-delhis-rajinder-nagar-bypoll-3100317", "urlToImage": "https://c.ndtvimg.com/2022-03/qeklno2_voting-generic-up-pti-650_650x400_07_March_22.jpg", "publishedAt": "2022-06-25T14:58:33Z", "content": "The Delhi bypoll passed with a low turnout of 43.75 per cent. (Representational)\r\nNew Delhi: The stage is set for the counting of votes polled during the recently concluded Rajinder Nagar assembly by… [+3135 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "SRK Couldn't Help But Miss AbRam During His Chat Session With Fans", "description": "Shah Rukh Khan said that the next time he comes to meet people, he will bring AbRam along", "url": "https://www.ndtv.com/entertainment/shah-rukh-khan-couldnt-help-but-miss-son-abram-during-his-chat-session-with-fans-3100284", "urlToImage": "https://c.ndtvimg.com/2022-06/428finto_srk_625x300_25_June_22.jpg", "publishedAt": "2022-06-25T14:46:28Z", "content": "A throwback of AbRam with SRK. (courtesy: gaurikhan)\r\nNew Delhi: Shah Rukh Khan, who has a super busy schedule ahead, managed to take some time out for his fans and answered their questions in an Ins… [+1762 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Mumbai Records 840 New COVID-19 Cases; 3 Casualties", "description": "Mumbai on Saturday reported 840 COVID-19 cases, a fall attributed to the glitches in the ICMR portal, and three Covid-related deaths, taking the total countto 11,04,600 and casualtiesto 19,594, the Brihanmumbai Municipal Corporation said.", "url": "https://www.ndtv.com/india-news/mumbai-records-840-new-covid-19-cases-3-casualties-3100269", "urlToImage": "https://c.ndtvimg.com/2022-05/4bp6julo_covid-generic-covid-test-pti-650_625x300_22_May_22.jpg", "publishedAt": "2022-06-25T14:41:30Z", "content": "A day earlier, the metropolis had recorded 1,898 infections and two pandemic-related fatalities.(File)\r\nMumbai: Mumbai on Saturday reported 840 COVID-19 cases, a fall attributed to the glitches in th… [+1063 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Day 4: Rajat Patidar Hits Ton As MP Lay One Hand On Coveted Ranji Trophy", "description": "Rajat Patidar stamped his class with an authoritative century to put Madhya Pradesh on the cusp of their historic Ranji Trophy triumph against 41-time champions Mumbai on a rain-hit fourth day of the summit clash", "url": "https://sports.ndtv.com/cricket/ranji-trophy-final-day-4-rajat-patidar-hits-ton-as-madhya-pradesh-lay-one-hand-on-coveted-trophy-3100260", "urlToImage": "https://c.ndtvimg.com/2022-06/mtjrorng_rajat-patidar-twitter_625x300_25_June_22.jpg", "publishedAt": "2022-06-25T14:37:25Z", "content": "Rajat Patidar stamped his class with an authoritative century to put Madhya Pradesh on the cusp of their historic Ranji Trophy triumph against 41-time champions Mumbai on a rain-hit fourth day of the… [+4336 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Cannabis Worth Rs 50 Lakh Seized In Arunachal Pradesh: Police", "description": "Arunachal Pradesh police seized cannabis, weighing over 525 kg worth over Rs 50 lakh, from a house in Naharlagun, near the capital Itanagar and arrested a woman, a senior police officer said.", "url": "https://www.ndtv.com/india-news/cannabis-worth-rs-50-lakh-seized-in-arunachal-pradesh-police-3100223", "urlToImage": "https://c.ndtvimg.com/2022-06/ars722ac_police-generic_625x300_14_June_22.jpg", "publishedAt": "2022-06-25T14:27:27Z", "content": "The woman was arrested earlier as well under the NDPS act and was granted bail. (Representational)\r\nItanagar: In a major drug haul, Arunachal Pradesh police seized cannabis, worth over Rs 50 lakh, fr… [+1266 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Sri Lanka Name 18-Man Squad For Australia Test Series", "description": "Dimuth Karunaratne will lead Sri Lanka's 18-man squad for the two-match Test series against Australia, which starts next week in Galle, the island nation's cricket board said Saturday", "url": "https://sports.ndtv.com/cricket/sri-lanka-name-18-man-squad-for-australia-test-series-3100202", "urlToImage": "https://c.ndtvimg.com/2022-03/c3lb47bg_dimuth-karunaratne_650x400_14_March_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-25T14:20:48Z", "content": "Dimuth Karunaratne will lead Sri Lanka's 18-man squad for the two-match Test series against Australia, which starts next week in Galle, the island nation's cricket board said Saturday. The first Test… [+739 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Case Against Ram Gopal Varma For Controversial Tweet On Droupadi Murmu", "description": "Filmmaker Ram Gopal Varma, whose tweets often land him in trouble, has courted a fresh controversy. A case has been filed against him for a controversial tweet with a 'Mahabharata' reference on Droupadi Murmu, the presidential candidate of the BJP.", "url": "https://www.ndtv.com/india-news/case-against-ram-gopal-varma-for-controversial-tweet-on-droupadi-murmu-3100201", "urlToImage": "https://c.ndtvimg.com/2022-04/kvth4bs_ram-gopal-verma_625x300_28_April_22.jpg", "publishedAt": "2022-06-25T14:20:31Z", "content": "Ram Goal Verma soon after clarified on his tweet on Droupadi Murmu (FILE)\r\nNew Delhi: Filmmaker Ram Gopal Varma, whose tweets often land him in trouble, has courted a fresh controversy. A case has be… [+1663 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Another MLA Of Arvind Kejriwal's Party Claims Death Threat", "description": "Aam Aadmi Party MLA Ajay Dutt received extortion calls and death threats on his phone days after AAP Burari MLA Sanjeev Jha got similar calls, the party said on Saturday and demanded swift action by the Delhi Police.", "url": "https://www.ndtv.com/india-news/another-mla-of-arvind-kejriwals-party-claims-got-death-threat-3100187", "urlToImage": "https://c.ndtvimg.com/2022-06/q5v3m35o_sanjeev-jha-is-the-aap-mla-from-the-sant-nagarburari-region-in-north-delhi_625x300_23_June_22.jpg", "publishedAt": "2022-06-25T14:14:37Z", "content": "AAP Burari MLA Sanjeev Jha got similar threat calls, the party said\r\nNew Delhi: Aam Aadmi Party MLA Ajay Dutt received extortion calls and death threats on his phone days after AAP Burari MLA Sanjeev… [+1839 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Eknath Shinde Met BJP's Devendra Fadnavis In Gujarat Last Night: Sources", "description": "Shiv Sena rebel MLA Eknath Shinde and the BJP's Devendra Fadnavis met in Gujarat's Vadodara last night to discuss possible government formation in Maharashtra, sources have said.", "url": "https://www.ndtv.com/india-news/sena-rebel-eknath-shinde-met-bjps-devendra-fadnavis-in-vadodara-last-night-discussed-government-formation-sources-3100186", "urlToImage": "https://c.ndtvimg.com/2022-06/jra1i45_eknath-shinde-ani-650_650x400_22_June_22.jpg", "publishedAt": "2022-06-25T14:13:56Z", "content": "Shiv Sena rebel MLA Eknath Shinde and nearly 40 other rebels are in Assam\r\nGuwahati: Shiv Sena rebel MLA Eknath Shinde and the BJP's Devendra Fadnavis met in Gujarat's Vadodara last night to discuss … [+1592 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "BCCI Ties Up With Australian Body To Create Uniform Training System", "description": "The idea is to have such a training programme where there is less interference from old-school coaches across some state teams, whose idea of S&C training is still archaic.", "url": "https://sports.ndtv.com/cricket/bcci-ties-up-with-australian-body-to-create-uniform-training-system-3100168", "urlToImage": "https://c.ndtvimg.com/2020-07/6djjf69g_bcci-logo-afp_625x300_20_July_20.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-25T14:09:49Z", "content": "In its bid to create uniformity in training system across ranks, the BCCI has joined hands with Australian Strength &amp; Conditioning Association (ASCA) to create a pool of world class trainers (S&a… [+2924 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "National Health Authority To Host Hackathon Series To Drive Ideation", "description": "The National Health Authority is going to host its first open-to-all hackathon series to drive ideation and innovations around different components of the Ayushman Bharat Digital Mission.", "url": "https://www.ndtv.com/india-news/national-health-authority-to-host-hackathon-series-to-drive-ideation-3100157", "urlToImage": "https://c.ndtvimg.com/2021-11/k7p6skds_hacking-generic-reuters_625x300_16_November_21.jpg", "publishedAt": "2022-06-25T14:05:00Z", "content": "New Delhi: The National Health Authority is going to host its first open-to-all hackathon series to drive ideation and innovations around different components of the Ayushman Bharat Digital Mission (… [+2706 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Actor Madhavan Says India Used Hindu Calendar To Launch Rocket To Mars", "description": "Actor R Madhavan who made his directorial debut with the film 'Rocketry: The Nambi Effect' is being criticised for saying that ISRO used the Hindu calendar to successfully launch the PSLV C-25 rocket to Mars for India's Mars mission.", "url": "https://www.ndtv.com/india-news/madhavan-says-india-used-hindu-calendar-to-launch-rocket-to-mars-twitter-users-react-3100156", "urlToImage": "https://c.ndtvimg.com/2022-06/qr7j73go_madhavan_625x300_01_June_22.jpg", "publishedAt": "2022-06-25T14:03:39Z", "content": "Madhavan made the comments while promoting his film 'Rocketry: The Nambi Effect'. (File)\r\nNew Delhi: Actor R Madhavan who made his directorial debut with the film 'Rocketry: The Nambi Effect' is bein… [+3002 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Abhimanyu Bose", "title": "Watch: Navdeep Saini Dismisses KS Bharat, Ravindra Jadeja In An Over", "description": "Navdeep Saini was on fire against India during their tour game against Leicestershire.", "url": "https://sports.ndtv.com/england-vs-india-2022/india-vs-leicestershire-navdeep-saini-dismisses-ks-bharat-ravindra-jadeja-in-an-over-watch-3100128", "urlToImage": "https://c.ndtvimg.com/2022-06/b7aqhusg_navdeep-saini-twitter_625x300_25_June_22.jpg", "publishedAt": "2022-06-25T13:54:47Z", "content": "Indian pacer Navdeep Saini was in hot form against his own country during India's tour game against Leicestershire. On Day 3 of the practice match, Saini bowled a great spell and got the wickets of K… [+1838 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Never Thought I Will Last 30 Years\": SRK On His Journey In Films", "description": "\"I came to Mumbai hoping that I will be able to work for a year or two and do 5-7 films,\" said SRK", "url": "https://www.ndtv.com/entertainment/30-years-of-srk-superstar-opens-up-about-love-for-movies-hiatus-and-making-people-smile-3100097", "urlToImage": "https://c.ndtvimg.com/2022-06/15puf1uo_srk_625x300_25_June_22.jpg", "publishedAt": "2022-06-25T13:45:50Z", "content": "SRK in a still from the video. (courtesy: iamsrk)\r\nMumbai: Over three decades ago when he came to the city of dreams Mumbai, Delhi boy Shah Rukh Khan never imagined to become the Badshaah of the Hind… [+4354 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Rashi Hardaha", "title": "CLAT 2022 Counselling: Registration Begins; Check Fee, How To Apply", "description": "CLAT 2022 Counselling: Candidates can apply for the CLAT counselling through the official website-- consortiumofnlus.ac.in. The last to register for the CLAT counselling 2022 is June 27.", "url": "https://www.ndtv.com/education/clat-2022-counselling-registration-begins-at-consortiumofnlus-ac-in-check-fee-how-to-apply", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/6/25/shutterstock_1766826698.jpg", "publishedAt": "2022-06-25T13:45:17Z", "content": "CLAT 2022 Counselling: The Consortium of National Law Universities has started the registration process for the Common Law Admission Test (CLAT) 2022 counselling. Candidates can apply for the CLAT co… [+2209 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Clear Picture\": Rajnath Singh Tweets On Amit Shah's 2002 Riots Interview", "description": "Defence Minister Rajnath Singh has drawn attention to a media interview of Amit Shah in which the Home Minister explained how activist Teesta Setalvad's non-profit \"gave baseless information\" to court and investigators on the 2002 Gujarat riots.", "url": "https://www.ndtv.com/india-news/clear-picture-rajnath-singh-tweets-on-amit-shahs-2002-riots-interview-3100093", "urlToImage": "https://c.ndtvimg.com/2022-02/r010gm08_rajnath-singh-manipur-650_625x300_14_February_22.jpg", "publishedAt": "2022-06-25T13:44:35Z", "content": "Rajnath Singh drew attention to an interview by Amit Shah on 2002 Gujarat riots\r\nNew Delhi: Defence Minister Rajnath Singh has drawn attention to a media interview of Amit Shah in which the Home Mini… [+2417 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Deepika And I Looked The Same\": SRK's ROFL Issue With His Pathaan Look", "description": "\"When it comes to my look in Pathaan, I love my long hair the most in the film,\" said SRK", "url": "https://www.ndtv.com/entertainment/deepika-and-i-started-looking-the-same-shah-rukh-khans-rofl-explanation-of-the-only-issue-with-his-pathaan-look-3100077", "urlToImage": "https://c.ndtvimg.com/2022-06/ah5gd63_srk_625x300_25_June_22.jpg", "publishedAt": "2022-06-25T13:39:32Z", "content": "SRK will be seen sporting long hair in Pathaan. (courtesy: iamsrk)\r\nNew Delhi: How we missed Shah Rukh Khan and his candid interactive sessions with fans on social media. That wish came true when the… [+1755 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine Reports Massive Attack From Belarus", "description": "Ukraine said it came under \"massive bombardment\" Saturday from neighbouring Belarus, a Russian ally not officially involved in the conflict, the day after announcing a retreat from the strategic city of Severodonetsk.", "url": "https://www.ndtv.com/world-news/ukraine-reports-massive-attack-from-belarus-3100041", "urlToImage": "https://c.ndtvimg.com/2022-02/qcqb4jg8_ukraine-belarus-exercise-650_625x300_21_February_22.jpg", "publishedAt": "2022-06-25T13:23:10Z", "content": "Belarus has provided logistic support to Moscow since the February 24 invasion. (File)\r\nKyiv, Ukraine: Ukraine said it came under  \"massive bombardment\" Saturday from neighbouring Belarus, a Russian … [+5509 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Delhi Sees Nearly 70% Jump In Covid Containment Zones Since June 17", "description": "With a rise in Covid cases, the city's containment zones have increased from 190 on June 17 to 322 on June 24, an increase of about 70 per cent, according to official data.", "url": "https://www.ndtv.com/delhi-news/delhi-sees-nearly-70-jump-in-covid-containment-zones-since-june-17-3100040", "urlToImage": "https://c.ndtvimg.com/2022-01/hh7b31k_delhi-covidafp_625x300_02_January_22.jpg", "publishedAt": "2022-06-25T13:21:51Z", "content": "Delhi recorded 1,447 new Covid cases and one more death on Friday.\r\nNew Delhi: With a rise in Covid cases, the city's containment zones have increased from 190 on June 17 to 322 on June 24, an increa… [+1800 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UP Man Claiming To Be BJP Youth Leader Taken Into Police Custody", "description": "A man claiming to be a BJP youth leader has been taken into custody for posing as an Officer on Special Duty (OSD) to Uttar Pradesh Chief Minister Yogi Adityanath over a call to the district magistrate here, police said on Saturday.", "url": "https://www.ndtv.com/india-news/up-man-claiming-to-be-bjp-youth-leader-taken-into-police-custody-3100038", "urlToImage": "https://c.ndtvimg.com/2021-06/1d9stjf8_up-police-generic_625x300_24_June_21.jpg", "publishedAt": "2022-06-25T13:21:41Z", "content": "The officer informed the police about the call which sprang into action.\r\nMau (UP): A man claiming to be a BJP youth leader has been taken into custody for posing as an Officer on Special Duty (OSD) … [+1374 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Mehbooba Mufti Asks People To Stand Up Against Atrocities", "description": "Jammu and Kashmir People's Democratic Party (PDP) chief today asked people to stand up against atrocities and accused the Centre of creating a Palestine-like situation in Kashmir.", "url": "https://www.ndtv.com/india-news/mehbooba-mufti-asks-people-to-stand-up-against-atrocities-3100001", "urlToImage": "https://c.ndtvimg.com/2022-06/bslcue8_mehbooba-mufti_625x300_25_June_22.jpg", "publishedAt": "2022-06-25T13:11:06Z", "content": "Srinagar: Jammu and Kashmir People's Democratic Party (PDP) chief today asked people to stand up against atrocities and accused the Centre of creating a Palestine-like situation in Kashmir.  \r\nMy app… [+1449 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Biden Signs First Significant US Gun Control Law In Decades", "description": "President Joe Biden on Saturday signed into law the first significant federal bill on gun safety in decades, saying that while it falls short of what's really needed it will \"save lives.\"", "url": "https://www.ndtv.com/world-news/biden-signs-first-significant-us-gun-control-law-in-decades-3099993", "urlToImage": "https://c.ndtvimg.com/2022-05/55s0ubi8_us-gun-violence-protest-afp-_120x90_28_May_22.jpg", "publishedAt": "2022-06-25T13:05:59Z", "content": "Washington, United States: President Joe Biden on Saturday signed into law the first significant federal bill on gun safety in decades, saying that while it falls short of what's really needed it wil… [+315 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Kartik-Tabu Chilling On Bhool Bhulaiyaa 2 Set. That's It, That's The Post", "description": "It seems  Kartik is unable to get over the hangover of the shooting days yet", "url": "https://www.ndtv.com/entertainment/kartik-aaryan-gives-us-this-surprising-bts-moment-from-bhool-bhulaiyaa-2-3099830", "urlToImage": "https://c.ndtvimg.com/2022-06/hpnvca58_kartik_625x300_25_June_22.jpg", "publishedAt": "2022-06-25T13:00:35Z", "content": "Kartik Aaryan with Tabu on the sets of Bhool Bhulaiyaa 2. (courtesy: kartikaaryan)\r\nNew Delhi: Kartik Aaryan and his Bhool Bhulaiyaa 2 squad are having a gala time. And, why not? The film, which rele… [+1770 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Tamil Nadu Start Up Develops Life Saving Instant Oxygen Generator", "description": "A Tamil Nadu based start-up has launched a first of its kind portable instant oxygen generator called Portia, which they say could be a lifesaver during medical emergencies.", "url": "https://www.ndtv.com/tamil-nadu-news/tamil-nadu-start-up-develops-life-saving-instant-oxygen-generator-portia-3099949", "urlToImage": "https://c.ndtvimg.com/2022-06/to0pf6sg_instant-oxygen-generator-portia-ndtv_625x300_25_June_22.jpg", "publishedAt": "2022-06-25T12:52:48Z", "content": "Patented chemicals in the canister supply oxygen in 40 seconds by turn of a knob.\r\nChennai: A Tamil Nadu based start-up has launched a first of its kind portable instant oxygen generator called Porti… [+2308 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Rashi Hardaha", "title": "CCMT 2022: Round 2 Seat Allotment Result Announced; Direct Link", "description": "To check the CCMT 2022 round 2 allotment result, candidates will need to enter their GATE registration ID and password.", "url": "https://www.ndtv.com/education/ccmt-2022-round-2-seat-allotment-result-announced-ccmt-admissions-nic-in-direct-link-to-check", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/6/25/shutterstock_1780326170.jpg", "publishedAt": "2022-06-25T12:52:15Z", "content": "New Delhi:The Malaviya National Institute of Technology (MNIT), Jaipur has announced the seat allotment result for the Centralized Counseling for MTech/ MArch/ MPlan (CCMT) 2022 round 2. The CCMT 202… [+1437 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Oreo Cookie Maker To Reopen War-Damaged Potato-Chip Plant Outside Kyiv", "description": "Oreo cookie maker, Mondelez International Inc, plans to reopen a potato-chip plant on the outskirts of Kyiv next week which was closed following Russia's invasion of Ukraine, a spokeswoman said.", "url": "https://www.ndtv.com/business/oreo-cookie-maker-to-reopen-war-damaged-potato-chip-plant-outside-kyiv-3099916", "urlToImage": "https://c.ndtvimg.com/2022-06/6cnp8ks_reuters-image_625x300_25_June_22.jpg", "publishedAt": "2022-06-25T12:41:44Z", "content": "Oreo cookie maker Mondelez to reopen war-damaged potato-chip plant outside Kyiv\r\nOreo cookie maker, Mondelez International Inc, plans to reopen a potato-chip plant on the outskirts of Kyiv next week … [+926 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "PM Modi To Meet Over 12 World Leaders In Germany, UAE Visit", "description": "Prime Minister Narendra Modi will hold meetings with over 12 world leaders during his visit to Germany and the United Arab Emirates, officials said. The Prime Minister will visit Germany for the G7 summit.", "url": "https://www.ndtv.com/india-news/g7-summit-pm-narendra-modi-to-meet-over-12-world-leaders-in-germany-uae-visit-3099913", "urlToImage": "https://c.ndtvimg.com/2022-05/quhhdggg_pm-modi_625x300_24_May_22.jpg", "publishedAt": "2022-06-25T12:41:26Z", "content": "He is travelling to Germany to attend the G7 summit on June 26 and 27. (File)\r\nNew Delhi: Prime Minister Narendra Modi will hold meetings with over 12 world leaders during his visit to Germany and th… [+1220 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "\"Don't Play This Sport To Show Anything To Anybody\": Hardik Pandya", "description": "Hardik Pandya will be leading the Indian cricket team in the two-T20I series against Ireland, starting on Sunday", "url": "https://sports.ndtv.com/cricket/dont-play-this-sport-to-show-anything-to-anybody-hardik-pandya-ahead-of-india-ireland-t20i-series-3099910", "urlToImage": "https://c.ndtvimg.com/2022-06/5cbjrjl8_hardik-pandya-806_625x300_10_June_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-25T12:40:04Z", "content": "Hardik Pandya has been a revelation in recent times with some great cricket in the IPL and for the national side. He led Gujarat Titans from the from the front to help the new franchise win the India… [+2004 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Vishesh Roy", "title": "\"Not Instinctive, Like To Be More Practical\": Hardik On Captaincy Style", "description": "Hardik Pandya would be leading Team India in the two-match T20I series against Ireland.", "url": "https://sports.ndtv.com/ireland-vs-india-2022/ireland-vs-india-not-instinctive-i-like-to-be-more-practical-hardik-pandya-on-his-captaincy-style-3099905", "urlToImage": "https://c.ndtvimg.com/2022-06/f85of6ho_hardik-pandya-afp_625x300_16_June_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-25T12:36:42Z", "content": "Hardik Pandya had a great run for the Gujarat Titans in IPL 2022 as he led the debutants to the title win and his captaincy impressed one and all. Now, the 28-year-old all-rounder has been given the … [+2926 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Watch: Man Surprises Girlfriend With Proposal At Finish Line Of Marathon", "description": "An adorable video of a man proposing to his girlfriend at the finish line of her marathon race has gone viral on social media.", "url": "https://www.ndtv.com/world-news/viral-video-new-york-man-surprises-girlfriend-with-proposal-at-finish-line-of-marathon-3099878", "urlToImage": "https://c.ndtvimg.com/2022-06/culj4jf_man-proposes-girlfriend_625x300_25_June_22.jpg", "publishedAt": "2022-06-25T12:22:17Z", "content": "The video already has over two million views on Instagram.\r\nNew York: \r\nAn adorable video of a man proposing to his girlfriend at the finish line of her marathon race has gone viral on social media. … [+1517 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Activist Teesta Setalvad Detained By Gujarat Anti-Terror Squad In Mumbai", "description": "Activist Teesta Setalvad Detained By Gujarat Anti-Terrorism Squad In Mumbai", "url": "https://www.ndtv.com/india-news/activist-teesta-setalvad-detained-by-gujarat-anti-terrorism-squad-in-mumbai-3099862", "urlToImage": "https://i.ndtvimg.com/i/2016-05/teesta-setalvad_650x400_71463321132.jpg", "publishedAt": "2022-06-25T12:17:15Z", "content": "Activist Teesta Setalvad was taken into custody by the Gujarat Police's Anti-Terrorism Squad from Mumbai on Saturday, news agency ANI reported. It was not immediately clear the charges they were purs… [+938 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "2nd T20I Report: India Register Series-Sealing Win Over Sri Lanka", "description": "India restricted Sri Lanka to 125/7 in 20 overs and chased down the target with five wickets in hand and five balls to spare.", "url": "https://sports.ndtv.com/cricket/india-women-vs-sri-lanka-women-2nd-t20i-report-harmanpreet-kaur-leads-india-to-series-sealing-win-over-sri-lanka-3099861", "urlToImage": "https://c.ndtvimg.com/2022-06/qs0912g8_smriti-mandhana-and-harmanpreet-kaur-_625x300_25_June_22.jpg", "publishedAt": "2022-06-25T12:15:37Z", "content": "Skipper Harmanpreet Kaur contributed with both bat and ball to steer the Indian women's cricket team to a series sealing five-wicket win over Sri Lanka in the second T20 in Dambulla on Saturday. Vice… [+1490 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Salman Is Like Family\": SRK's Response To Question About The Actor", "description": "\"With Salman there is no working experience, it is fun,\" said SRK", "url": "https://www.ndtv.com/entertainment/salman-khan-is-like-family-shah-rukh-khans-response-to-question-about-working-with-the-actor-3099831", "urlToImage": "https://c.ndtvimg.com/2022-06/kg6ml8vg_salman-srk-_625x300_25_June_22.jpg", "publishedAt": "2022-06-25T11:58:50Z", "content": "SRK with Salman Khan. (courtesy: beingsalmaankhan)\r\nNew Delhi: Shah Rukh Khan interacted with his fans after a long, long time during an Ask Me Anything Session on Instagram. The actor went live on t… [+1680 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Fire At Complex Housing Children's Hospital In Gujarat, Over 50 Rescued", "description": "Ahmedabad Fire: A massive fire broke out inside a complex housing a children's hospital in Ahmedabad. The incident took place inside Dev Complex near Parimal Garden in Ahmedabad.", "url": "https://www.ndtv.com/ahmedabad-news/fire-breaks-out-inside-complex-housing-childrens-hospital-in-gujarat-3099826", "urlToImage": "https://c.ndtvimg.com/2022-06/npj363uo_fire-ahmedabad_625x300_25_June_22.jpg", "publishedAt": "2022-06-25T11:56:30Z", "content": "The patients have bee shifted to a nearby hospital, a fire officer said.\r\nAhmedabad: A massive fire broke out inside a complex housing a children's hospital in Ahmedabad. The fire started on the thir… [+1099 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Strong Field Awaits Neeraj In His First Diamond League Meet Of Season", "description": "Neeraj Chopra will compete in the Diamond League Meet with confidence after clinching his first win of the season at the Kuortane Games on June 18.", "url": "https://sports.ndtv.com/athletics/strong-field-awaits-neeraj-chopra-in-his-first-diamond-league-meet-of-season-3099818", "urlToImage": "https://c.ndtvimg.com/2021-12/5kmpp8c_neeraj-chopra-afp-650_625x300_28_December_21.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-25T11:52:56Z", "content": "A strong field awaits Olympic javelin throw champion Neeraj Chopra in the prestigious Diamond League Meet in Stockholm on June 30, which will be his biggest event ahead of the World Championships in … [+2588 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Aaditya Thackeray Says Maharashtra Crisis A Fight Between Truth And Lies", "description": "The Shiv Sena-led Maha Vikas Aghadi government in Maharashtra is currently caught in a political turmoil after a rebellion by party leader Eknath Shinde.Sena minister Aaditya Thackeray said that this is a fight between truth and lies.", "url": "https://www.ndtv.com/india-news/aaditya-thackeray-says-maharashtra-crisis-a-fight-between-truth-and-lies-3099793", "urlToImage": "https://c.ndtvimg.com/2022-06/3k1u665s_aaditya-thackeray_625x300_25_June_22.jpg", "publishedAt": "2022-06-25T11:45:02Z", "content": "Aaditya Thackeray made the remarks while leaving the Sena bhavan today.\r\nNew Delhi: The Shiv Sena-led Maha Vikas Aghadi government in Maharashtra is currently caught in a political turmoil after a re… [+909 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Rashi Hardaha", "title": "TS EAMCET 2022 Hall Ticket Out; Direct Link Here", "description": "TS EAMCET 2022 Hall Ticket: To download the EAMCET admit card 2022, candidates need to enter their registration number, qualifying examination hall ticket number, and date of birth.", "url": "https://www.ndtv.com/education/ts-eamcet-2022-hall-ticket-out-at-eamcet-tsche-ac-in-direct-link-here", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/6/25/shutterstock_1685909200_2.jpg", "publishedAt": "2022-06-25T11:44:18Z", "content": "TS EAMCET 2022 Hall Ticket: The Telangana State Engineering, Agriculture and Medical Common Entrance Test (TS EAMCET) 2022 admit card has been issued today, June 25. The Telangana State Council of Hi… [+1593 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Kishore Biyani-Led Future Group Firm Defaults For The Fourth Time In June", "description": "Future Enterprises defaults on Rs 4.10 crore interest payment for its non-convertible debentures (NCDs)", "url": "https://www.ndtv.com/business/future-enterprises-defaults-on-rs-4-10-crore-interest-payment-for-ncds-3099785", "urlToImage": "https://c.ndtvimg.com/2022-06/cts3211o_image_625x300_25_June_22.jpg", "publishedAt": "2022-06-25T11:43:11Z", "content": "Future Enterprises defaults on Rs 4.10 crore interest payment for NCDs\r\nNew Delhi: Debt-ridden Future Enterprises Ltd (FEL) has defaulted on interest payment of Rs 4.10 crore for its non-convertible … [+1277 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Watch: Virat Kohli Miffed After Fan Pesters Teammate For Photo", "description": "Virat Kohli was not happy with the behaviour of the fan, and was quick to confront him.", "url": "https://sports.ndtv.com/england-vs-india-2022/miffed-virat-kohli-comes-to-kamlesh-nagarkotis-defence-after-fan-pesters-him-for-photo-watch-3099731", "urlToImage": "https://c.ndtvimg.com/2022-06/etlgi1a_virat-kohli-806_625x300_25_June_22.jpg", "publishedAt": "2022-06-25T11:23:54Z", "content": "Virat Kohli came out in Kamlesh Nagarkoti's defence after the young pacer was given a hard time by the Indian crowd present at the Uptonsteel Cricket Ground for the ongoing tour game between India an… [+1718 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Rica Roy", "title": "\"Gamble Paid Off Massively\": Manjrekar Lauds Pandya's Recent Performance", "description": "Former Indian cricket team player Sanjay Manjrekar, in an exclusive interview with NDTV, talked one various relevant topics in Indian cricket.", "url": "https://sports.ndtv.com/cricket/gamble-paid-off-massively-sanjay-manjrekar-lauds-hardik-pandyas-recent-performance-3099726", "urlToImage": "https://c.ndtvimg.com/2022-06/o5bdsk7_hardik-pandya-bcci_625x300_17_June_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-25T11:21:48Z", "content": "Indian cricket is going through a crucial phase. The Tour of England is starting in a few days time while the T20 World Cup is only a few months away. The Indian Premier League (IPL) 2022 also saw se… [+9886 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Maharashtra Political Crisis: Large Gatherings Banned In Mumbai", "description": "Amid the reports of Shiv Sainiks allegedly ransacking the offices of rebel legislators, Mumbai Police on Saturday imposed section 144 of CrPC in the city.", "url": "https://www.ndtv.com/mumbai-news/maharashtra-political-crisis-large-gatherings-banned-in-mumbai-police-on-high-alert-3099704", "urlToImage": "https://c.ndtvimg.com/2022-06/l0ugiq44_mumbai-police_625x300_25_June_22.jpg", "publishedAt": "2022-06-25T11:15:13Z", "content": "Mumbai: Amid the reports of Shiv Sainiks allegedly ransacking the offices of rebel legislators, Mumbai Police on Saturday imposed section 144 of CrPC in the city.\r\nMumbai Police issued a high alert a… [+2363 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"If Our Faction Isn't Recognised...\": Sena Rebel Deepak Kesarkar", "description": "The battle for control of the Shiv Sena has come down to who will carry forward the legacy of Bal Thackeray, the party's founder and the father of Chief Minister Uddhav Thackeray.", "url": "https://www.ndtv.com/india-news/not-leaving-shiv-sena-not-leaving-balasahebs-ideology-rebel-mla-deepak-kesarkar-3099689", "urlToImage": "https://c.ndtvimg.com/2022-06/t0v0oj0g_eknath-shinde-with-rebel-mlas_650x400_23_June_22.jpg", "publishedAt": "2022-06-25T11:09:56Z", "content": "Rebel Shiv Sena MLAs are staying at a hotel in Assam's Guwahati\r\nGuwahati: The battle for control of the Shiv Sena has come down to who will carry forward the legacy of Bal Thackeray, the party's fou… [+1393 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Crypto Exchange FTX In Discussion To Buy Stake In BlockFi: Report", "description": "Cryptocurrency exchange FTX is in talks to acquire a stake in crypto lender BlockFi, the Wall Street Journal reported, citing people familiar with the matter.", "url": "https://www.ndtv.com/business/crypto-exchange-ftx-in-discussion-to-buy-stake-in-blockfi-report-3099686", "urlToImage": "https://c.ndtvimg.com/2022-06/v2lacjq_image_625x300_25_June_22.jpg", "publishedAt": "2022-06-25T11:04:48Z", "content": "Crypto exchange FTX in discussion to acquire stake in BlockFi: Report\r\nCryptocurrency exchange FTX is in talks to acquire a stake in crypto lender BlockFi, the Wall Street Journal reported, citing pe… [+1312 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Atmosphere Of Mistrust, Violence Prevailing In Country: Ashok Gehlot", "description": "An atmosphere of violence and mistrust is prevailing in the country, said Rajasthan Chief Minister Ashok Gehlot, stressing that it may ruin the nation.", "url": "https://www.ndtv.com/india-news/atmosphere-of-mistrust-violence-prevailing-in-country-ashok-gehlot-3099678", "urlToImage": "https://c.ndtvimg.com/2022-06/io52snko_ashok-gehlot_650x400_15_June_22.jpg", "publishedAt": "2022-06-25T10:59:12Z", "content": "Jaipur: An atmosphere of violence and mistrust is prevailing in the country, said Rajasthan Chief Minister Ashok Gehlot, stressing that it may ruin the nation.\r\n\"The politics of tension is not good f… [+1376 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Rashi Hardaha", "title": "NEET SS 2021: Final Allotment Result Of Special Mop-Up Round Declared", "description": "NEET SS 2021 Counselling: Candidates can check their NEET SS 2021 special mop-up round result on the official website-- mcc.nic.in.", "url": "https://www.ndtv.com/education/neet-ss-2021-counselling-final-seat-allotment-result-of-special-mop-up-round-declared", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/6/25/shutterstock_221234551_2.jpg", "publishedAt": "2022-06-25T10:54:34Z", "content": "NEET SS 2021 Counselling: The Medical counselling committee (MCC) has announced the final seat allotment result of the National Eligibility cum Entrance Test, Super Specialty (NEET SS) 2021 special m… [+1244 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Bureaucrat's Son Dies In Punjab; Murder, Claims Family, Cops Say Suicide", "description": "The son of a bureaucrat, who is under arrest in a corruption case, has died of a gunshot wound in Chandigarh on Saturday.", "url": "https://www.ndtv.com/india-news/bureaucrats-son-dies-in-punjab-murder-claims-family-cops-say-suicide-3099648", "urlToImage": "https://c.ndtvimg.com/2019-08/870972to_gun-generic-pixabay-650_625x300_07_August_19.jpg", "publishedAt": "2022-06-25T10:48:35Z", "content": "Sanjay Popli's wife has accused the vigilance team of killing their 27-year-old son.(Representational)\r\nChandigarh: The son of a bureaucrat, who is under arrest in a corruption case, has died of a gu… [+1001 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "This Is What Patralekhaa's \"Summer Of '22\" Looks Like", "description": "Patralekhaa has shared some striking photos of herself on her social media timeline.", "url": "https://www.ndtv.com/entertainment/here-s-how-summer-of-22-looked-for-patralekhaa-3099646", "urlToImage": "https://c.ndtvimg.com/2022-06/n9mlt568_patralekhaa_625x300_25_June_22.jpg", "publishedAt": "2022-06-25T10:47:22Z", "content": "Patralekhaa in latest photo (courtesy: patralekhaa)\r\nNew Delhi: Patralekhaa's Summer Of 2022 diaries scream travel goals from miles away. She has shared a new set of pictures on Instagram. And, defin… [+1560 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Shiv Sena Workers Vandalise Rebel MLA Tanaji Sawant's Office In Pune", "description": "Shiv Sena workers on Saturday vandalised an office of rebel Shiv Sena MLA Tanaji Sawant, who is currently camping with other dissidents led by Eknath Shinde in Guwahati.", "url": "https://www.ndtv.com/india-news/maharashtra-crisis-shiv-sena-workers-vandalise-rebel-mla-tanaji-sawants-office-in-pune-3099634", "urlToImage": "https://c.ndtvimg.com/2022-06/j8vckqu_shiv-sena-workers-vandalise-tanaji-sawant-office-twitter_625x300_25_June_22.jpg", "publishedAt": "2022-06-25T10:40:53Z", "content": "Shiv Sena workers vandalise office of the party's MLA Tanaji Sawant.\r\nPune: Shiv Sena workers on Saturday vandalised an office of rebel Shiv Sena MLA Tanaji Sawant, who is currently camping with othe… [+1380 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Here's The \"Yummiest\" Dish For Anita Hassanandani", "description": "Anita's latest Instagram update, we see her holding a lump of prasad in her palm", "url": "https://food.ndtv.com/news/anita-hassanandani-finds-this-dish-to-be-the-yummiest-3099498", "urlToImage": "https://c.ndtvimg.com/2022-04/9ev2uoh8_anita-hassanandani-625_625x300_15_April_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-25T10:35:43Z", "content": "Anita Hassanandani's food trips are always a delight to see. She keeps her Instafam hooked with relatable food stories. And, we are simply in love with Anita's recent food diaries. We don't know abou… [+1806 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Vedant Yadav", "title": "Watch: Trent Boult On Fire, Knocks Stump After Stump On Day 2 Of 3rd Test", "description": "England vs New Zealand: Trent Boult was on top of his game as New Zealand rattled England's top-order on Day 2 of the ongoing third Test at Headingley", "url": "https://sports.ndtv.com/cricket/england-vs-new-zealand-3rd-test-trent-boult-on-fire-knocks-stump-after-stump-on-day-2-watch-3099606", "urlToImage": "https://c.ndtvimg.com/2022-06/ab048d7g_trent-boult-twitter_625x300_25_June_22.jpg", "publishedAt": "2022-06-25T10:31:51Z", "content": "Trent Boult was on top of his game as New Zealand rattled England's top-order on Day 2 of the ongoing third Test at Headingley in Leeds. After the Kiwis were bundled out for 329 in the first innings,… [+1370 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Tata Power Arm Commissions India's Largest Floating Solar Project", "description": "Tata Power Solar Systems on Saturday said it has commissioned India's largest floating solar power project of 101.6 Megawatt Peak (MWp) in Kerala backwaters.", "url": "https://www.ndtv.com/business/tata-power-arm-commissions-indias-largest-floating-solar-project-3099597", "urlToImage": "https://c.ndtvimg.com/sqkg1gds_tata-power-gujarat_625x300_02_August_18.jpg", "publishedAt": "2022-06-25T10:27:17Z", "content": "Tata Power arm commissions India's largest floating solar project\r\nNew Delhi: Tata Power Solar Systems on Saturday said it has commissioned India's largest floating solar power project of 101.6 Megaw… [+1320 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Box Office Report: Jugjugg Jeeyo Gets A Good Start At Over Rs 9 Crore", "description": "Jugjugg Jeeyo released in theatres on Friday", "url": "https://www.ndtv.com/entertainment/jugjugg-jeeyo-box-office-collection-day-1-neetu-anil-kapoors-film-gets-a-good-start-at-over-rs-9-crore-3099591", "urlToImage": "https://c.ndtvimg.com/2022-06/iupacb1_kiara-and-varun-_625x300_25_June_22.jpg", "publishedAt": "2022-06-25T10:24:43Z", "content": "Kiara and Varun in a still from Jugjugg Jeeyo. courtesy: neetu54)\r\nNew Delhi: Raj Mehta's Jugjugg Jeeyo opened in theatres on Friday and it managed to collect over Rs 9 crore on the day of its releas… [+1467 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Reported By Rica Roy", "title": "\"If England's Got Stokes, India's Got...\": Manjrekar Names X-Factor Player", "description": "Before the India-England Test, in an exclusive interview to NDTV, former Indian cricket team player Sanjay Manjrekar opined on the player who can be the 'X-factor' for India against England", "url": "https://sports.ndtv.com/cricket/if-englands-got-ben-stokes-indias-got-sanjay-manjrekar-names-this-star-as-x-factor-vs-england-3099590", "urlToImage": "https://c.ndtvimg.com/2021-06/kmagl5cg_sanjay-manjrekar-bcci_625x300_08_June_21.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-25T10:24:25Z", "content": "India face England in the all-important rescheduled fifth Test in Birmingham from July 1. The contest will decide the outcome of the series that got stalled last year due to a COVID-19 outbreak in th… [+2432 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "India Successfully Managed Its Fight Against Covid, Says Health Minister", "description": "Union Health Minister Mansukh Mandaviya on Saturday said the country has successfully spearheaded the fight against the covid-19 pandemic under the leadership of Prime Minister Narendra Modi.", "url": "https://www.ndtv.com/india-news/india-successfully-managed-its-fight-against-covid-says-health-minister-mansukh-mandaviya-3099575", "urlToImage": "https://c.ndtvimg.com/2022-06/b13d5gt8_mansukh-mandaviya_625x300_25_June_22.jpg", "publishedAt": "2022-06-25T10:19:49Z", "content": "The health minister was declaring open the Jipmer International School of Public Health in Puducherry.\r\nPuducherry: Union Health Minister Mansukh Mandaviya on Saturday said the country has successful… [+2511 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Guess Who Wasn't Lost In Translation: This Fan Of Kapil In Vancouver", "description": "This fan made Kapil Sharma's day and how", "url": "https://www.ndtv.com/entertainment/kapil-sharma-meets-fan-at-vancouver-airport-see-video-of-their-cute-interaction-3099573", "urlToImage": "https://c.ndtvimg.com/2022-06/1qbsp08o_kapil-sharma_625x300_25_June_22.jpg", "publishedAt": "2022-06-25T10:19:48Z", "content": "Kapil Sharma in still from the video. (courtesy: kapilsharma)\r\nMumbai (Maharashtra): Actor-Comedian Kapil Sharma is currently soaking in the Canadian sun with his team. Kapil is currently touring Nor… [+1926 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Delhi Govt Moves Towards Bringing Back Detention Policy At Schools", "description": "The DoE has issued a circular stating that Delhi Right of Children to Free and Compulsory Education Rules 2022 has been amended, in a step towards bringing back the detention policy at schools.", "url": "https://www.ndtv.com/education/delhi-government-moves-towards-bringing-back-detention-policy-at-schools", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/6/25/shutterstock_2136724523.jpg", "publishedAt": "2022-06-25T10:12:23Z", "content": "New Delhi:The Directorate of Education (DoE) has issued a circular stating that Delhi Right of Children to Free and Compulsory Education Rules 2022 has been amended, in a step towards bringing back t… [+1426 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Assam Floods: Situation Still Grim In Assam After 10 Die In 24 Hours", "description": "Assam Floods: The situation in Assam remained grim on Saturday with the death count rising to 118 and Silchar town in the Cachar district submerged for the sixth straight day, official said.", "url": "https://www.ndtv.com/india-news/assam-floods-situation-still-grim-in-assam-after-10-die-in-24-hours-3099483", "urlToImage": "https://c.ndtvimg.com/2022-06/h31m7a3_assam-floods-_625x300_19_June_22.jpg", "publishedAt": "2022-06-25T09:53:28Z", "content": "Packets of food, water bottles and other essentials are being airdropped by the Air Force.\r\nGuwahati: The flood situation in Assam remained grim on Saturday with the death count rising to 118 and Sil… [+2444 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Office Of Eknath Shinde's Lok Sabha MP Son Shrikant Shinde Vandalised", "description": "A video that went viral on social media on Saturday showed some people damaging the board outside the office of Shrikant Shinde, Lok Sabha MP from Kalyan in Thane district and son of Shiv Sena rebel leader Eknath Shinde.", "url": "https://www.ndtv.com/india-news/maharashtra-crisis-8-10-persons-damage-office-of-eknath-shindes-lok-sabha-mp-son-shrikant-shinde-3099475", "urlToImage": "https://c.ndtvimg.com/2022-06/f6ktoihg_shrikant-shinde-facebook_625x300_25_June_22.jpg", "publishedAt": "2022-06-25T09:51:18Z", "content": "Some people threw stones at the Ulhasnagar office of Shrikant Shinde.\r\nThane: A video that went viral on social media on Saturday showed some people damaging the board outside the office of Shrikant … [+520 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russian Missiles Strike Across Ukraine As War Enters 5th Month", "description": "Russian missiles rained down across Ukraine on Saturday, hitting military facilities in the west and the north as well as a southern city as the biggest land conflict in Europe since World War Two entered its fifth month.", "url": "https://www.ndtv.com/world-news/russian-missiles-strike-across-ukraine-as-war-enters-5th-month-3099450", "urlToImage": "https://c.ndtvimg.com/2022-06/rt5herdg_soldiers-generic_625x300_25_June_22.jpg", "publishedAt": "2022-06-25T09:43:45Z", "content": "Russia invaded Ukraine on February24.\r\nKyiv: Russian missiles rained down across Ukraine on Saturday, hitting military facilities in the west and the north as well as a southern city as the biggest l… [+6029 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Phir Na Aisi Raat Aayegi Is About Laal Singh Chaddha's \"Unrequited Love\"", "description": "Phir Na Aisi Raat Aayegi: The song has been  beautifully sung by Arijit Singh", "url": "https://www.ndtv.com/entertainment/laal-singh-chaddha-song-phir-na-aisi-raat-aayegi-is-all-about-aamir-khans-unrequited-love-3099447", "urlToImage": "https://c.ndtvimg.com/2022-06/gmicier8_laal-singh-chaddha_625x300_25_June_22.jpg", "publishedAt": "2022-06-25T09:43:29Z", "content": "Kareena and Aamir in the song. (courtesy: YouTube)\r\nNew Delhi: The makers of Laal Singh Chaddha shared a new song from the film and it is the definition of beautiful. The track has been beautifully s… [+1223 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Prakash, Nataraj To Spearhead Indian Swimming Campaign At CWG", "description": "The star duo of Sajan Prakash and Srihari Nataraj will lead a four-member Indian swimming team at the Birmingham Commonwealth Games next month", "url": "https://sports.ndtv.com/commonwealth-games-2022/sajan-prakash-srihari-nataraj-to-spearhead-indian-swimming-campaign-at-commonwealth-games-3099443", "urlToImage": "https://c.ndtvimg.com/2021-06/vrodma58_sajan-prakash-twitter_625x300_26_June_21.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-25T09:42:16Z", "content": "The star duo of Sajan Prakash and Srihari Nataraj will lead a four-member Indian swimming team at the Birmingham Commonwealth Games next month. Apart from Prakash and Nataraj, fast-rising Delhi swimm… [+1612 chars]"}]}