{"status": "ok", "totalResults": 284, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "2 Indian Student Groups Win NASA Human Exploration Rover Challenge", "description": "Two Indian student groups from Punjab and Tamil Nadu have won the NASA 2022 Human Exploration Rover Challenge, a media release said.", "url": "https://www.ndtv.com/india-news/2-indian-student-groups-win-nasa-2022-human-exploration-rover-challenge-2943736", "urlToImage": "https://c.ndtvimg.com/2022-05/hsmaigs_nasa-2022-human-exploration-rover-challenge-winners_625x300_04_May_22.jpg", "publishedAt": "2022-05-04T02:28:59Z", "content": "Indian students from Punjab and Tamil Nadu won the NASA Human Exploration Rover Challenge\r\nWashington: Two Indian student groups from Punjab and Tamil Nadu have won the NASA 2022 Human Exploration Ro… [+1432 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Video Shows Man Kicking Cat Into Sea After Luring It To Edge Of Shore", "description": "In a shocking case of animal abuse, a man in Greece has been caught on camera booting a small cat into the ocean.", "url": "https://www.ndtv.com/offbeat/horrifying-video-shows-greek-man-kicking-cat-into-sea-after-luring-it-to-edge-of-shore-2943808", "urlToImage": "https://c.ndtvimg.com/2022-05/0okpugqg_cat-650_625x300_04_May_22.jpg", "publishedAt": "2022-05-04T02:23:26Z", "content": "The cat survived the abuse. (Representative photo)\r\nIn a shocking case of animal abuse, a man in Greece has been caught on camera kicking a small cat into the ocean. The video posted on YouTube shows… [+2120 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russian Gas Supplies To China Soar By 60% In 2022: Report", "description": "Amid the ongoing war in Ukraine, Russia's gas supplies to China have soared by as much as 60 per cent in the first four months of 2022 compared to the same period last year.", "url": "https://www.ndtv.com/world-news/russian-gas-supplies-to-china-soar-by-60-in-2022-report-2943806", "urlToImage": "https://c.ndtvimg.com/2018-11/11mvgsl8_gas-pipeline-generic_625x300_07_November_18.jpg", "publishedAt": "2022-05-04T02:19:31Z", "content": "China has refrained from outrightly condemning the Russian invasion of Ukraine.\r\nBeijing: Amid the ongoing war in Ukraine, Russia's gas supplies to China have soared by as much as 60 per cent in the … [+1557 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "PM Modi Meets Queen Of Denmark Margrethe II", "description": "Queen of Denmark Margrethe II extended a warm reception to Prime Minister Narendra Modi on Tuesday.", "url": "https://www.ndtv.com/india-news/pm-modi-meets-queen-of-denmark-margrethe-ii-2943793", "urlToImage": "https://c.ndtvimg.com/2022-05/fe3frsig_pm-modi-meets-queen-of-denmark-_625x300_04_May_22.jpg", "publishedAt": "2022-05-04T01:30:32Z", "content": "Queen Margrethe of Denmark receives PM Modi at Amalienborg Castle in Copenhagen on May 3.\r\nCopenhagen: Queen of Denmark Margrethe II extended a warm reception to Prime Minister Narendra Modi here on … [+1227 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE: India Logs 2,568 New Covid Cases In 24 Hours", "description": "India on Tuesday reported 2,568 new COVID-19 cases, taking the coronavirus tally to 4,30,84,913. The country also recorded 20 new covid-related fatalities, bring the total number of deaths to 523,889.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-may-4-2943777", "urlToImage": "https://c.ndtvimg.com/2022-04/ise074vo_coronavirus-india-pti-650_650x400_18_April_22.jpg", "publishedAt": "2022-05-04T00:59:14Z", "content": "India Covid Live: India records at least 20 Covid-related deaths in last 24 hours.\r\nNew Delhi: India on Tuesday reported 2,568 new COVID-19 cases, taking the coronavirus tally to 4,30,84,913. The cou… [+368 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Twitter Will Always Be Free For Casual Users, But May Charge For...: Elon Musk", "description": "Tesla CEO Elon Musk said on Tuesday Twitter Inc may charge a slight fee for commercial and government users.", "url": "https://www.ndtv.com/world-news/elon-musk-says-twitter-may-charge-government-commercial-users-2943768", "urlToImage": "https://c.ndtvimg.com/2022-03/s2ku2tf8_elon-musk-reuters_625x300_25_March_22.jpg", "publishedAt": "2022-05-04T00:27:49Z", "content": "Elon Musk has signed a deal to buy Twitter for $44 billion last week.\r\nSan Francisco: Tesla CEO Elon Musk said on Tuesday Twitter Inc may charge a slight fee for commercial and government users.\r\n\"Tw… [+447 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Adds Over 1.5 Years To Immigrant Work Permit Term, Indians To Benefit", "description": "Biden administration has announced an automatic extension of expiring work permits for certain categories of immigrants, including those seeking green cards and spouses of H-1B visa holders who get employment authorisation cards (EAD), for 1.5 years.", "url": "https://www.ndtv.com/world-news/joe-biden-administration-extending-immigrant-work-permit-for-more-1-5-years-indians-to-benefit-in-us-2943761", "urlToImage": "https://i.ndtvimg.com/i/2017-04/h-1b-visa_650x400_71491295947.jpg", "publishedAt": "2022-05-04T00:02:03Z", "content": "US extends Immigrant Work Permit: The move is likely to benefit thousands of Indian immigrants.\r\nWashington: The Biden administration has announced an automatic extension of expiring work permits for… [+3219 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Fire Breaks Out At Municipal Office In Delhi, No Casualty Reported", "description": "A major fire engulfed the Municipal Corporation of Delhi's office in the Keshav Puram area in the national capital on Tuesday.", "url": "https://www.ndtv.com/india-news/fire-breaks-out-at-municipal-office-in-delhi-no-casualty-reported-2943745", "urlToImage": "https://i.ndtvimg.com/i/2017-07/fire-generic-istock_650x400_51500191995.jpg", "publishedAt": "2022-05-03T23:22:04Z", "content": "Delhi MCD fire: The cause behind the fire has not been ascertained yet. (Representational)\r\nNew Delhi: A major fire engulfed the Municipal Corporation of Delhi's office in the Keshav Puram area in th… [+999 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "At Least 17 Killed In Road Accident In Western Ukraine", "description": "A bus collided with a fuel truck in western Ukraine on Tuesday, killing at least 17 people, authorities said, piling further misery on the war-torn country.", "url": "https://www.ndtv.com/world-news/at-least-17-killed-in-road-accident-in-western-ukraine-2943733", "urlToImage": "https://i.ndtvimg.com/i/2018-03/police-generic-international-afp_650x400_41520126059.jpg", "publishedAt": "2022-05-03T23:01:44Z", "content": "President Zelensky said a \"terrible accident\" taken place the in western Rivne region. (Representational)\r\nKyiv: A bus collided with a fuel truck in western Ukraine on Tuesday, killing at least 17 pe… [+855 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rajasthan BJP Urges Governor To Initiate Probe On Jodhpur Violence", "description": "Rajasthan state president of Bharatiya Janata Party Satish Poonia on Tuesday requested Governor Kalraj Mishra to initiate an investigation into the incidents related to violence in Jodhpur.", "url": "https://www.ndtv.com/india-news/jodhpur-communal-violence-rajasthan-bjp-chief-satish-poonia-urges-governor-kalraj-mishra-to-intervene-2943728", "urlToImage": "https://c.ndtvimg.com/2022-05/9c7g2634_jodhpur-clashes-ndtv_625x300_03_May_22.png", "publishedAt": "2022-05-03T22:51:34Z", "content": "Jodhpur violence: Clashes broke out at the Jalori gate circle in Jodhpur following Eid prayers.\r\nJodhpur: Rajasthan state president of Bharatiya Janata Party Satish Poonia on Tuesday requested Govern… [+1909 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UN Chief Hopes For More \"Humanitarian Pauses\" In Ukraine", "description": "The UN secretary-general said Tuesday he hopes Ukraine and Russia can organize \"more humanitarian pauses,\" such as the one that allowed the evacuation of about 100 Ukrainian civilians from the Azovstal steel plant.", "url": "https://www.ndtv.com/world-news/un-chief-hopes-for-more-humanitarian-pauses-in-ukraine-2943721", "urlToImage": "https://c.ndtvimg.com/2022-05/ms21csr8_odessa-ukraine-war-afp-650_625x300_03_May_22.jpg", "publishedAt": "2022-05-03T22:19:37Z", "content": "Ukraine War:UN says that humanitarian pauses will allow civilians safe passage away from the fighting.\r\nUnited Nations: The UN secretary-general said Tuesday he hopes Ukraine and Russia can organize … [+1696 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Jodhpur Communal Clashes: Over 50 Arrested After Violence, Curfew Imposed", "description": "Communal tensions gripped Rajasthan Chief Minister Ashok Gehlot's hometown Jodhpur hours before Eid on Tuesday, prompting the authorities to suspend mobile internet services and impose a curfew in 10 police stations areas of the city.", "url": "https://www.ndtv.com/india-news/jodhpur-communal-clashes-over-50-arrested-after-violence-curfew-imposed-cm-ashok-gehlot-appeals-for-calm-2943716", "urlToImage": "https://c.ndtvimg.com/2022-05/as6vfteo_jodhpur-clash-on-eid-pti-pic_650x400_03_May_22.jpg", "publishedAt": "2022-05-03T21:57:53Z", "content": "Jodhpur Communal Clashes: Curfew has been imposed after violence till May 4 midnight in Jodhpur.\r\nJodhpur: Communal tensions gripped Rajasthan Chief Minister Ashok Gehlot's hometown Jodhpur hours bef… [+5551 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Woman Raped, Stabbed By Two Men In Gurgaon, 1 Arrested: Police", "description": "A 24-year-old woman was allegedly raped and stabbed by two men in the DLF Phase 3 area here, police said on Tuesday, adding one of the accused was arrested.", "url": "https://www.ndtv.com/india-news/woman-raped-stabbed-by-two-men-in-gurgaon-1-arrested-police-2943710", "urlToImage": "https://c.ndtvimg.com/2018-10/2j46hlug_police-generic_625x300_27_October_18.jpg", "publishedAt": "2022-05-03T21:22:24Z", "content": "Gurgaon rape: Police said they have arrested one of the accused who is from of Bihar. (Representational)\r\nGurgaon: A 24-year-old woman was allegedly raped and stabbed by two men in the DLF Phase 3 ar… [+1260 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Wants UN Vote On North Korea Sanctions Over Missiles In May", "description": "The United States would like the U.N. Security Council to vote during May to further sanction North Korea over its renewed ballistic missile launches, the U.S. Ambassador to the United Nations, Linda Thomas-Greenfield, said on Tuesday.", "url": "https://www.ndtv.com/world-news/us-wants-un-vote-on-north-korea-sanctions-over-missiles-in-may-2943707", "urlToImage": "https://i.ndtvimg.com/i/2016-01/north-korea-flag_650x400_41452142703.jpg", "publishedAt": "2022-05-03T21:03:09Z", "content": "North Korea has been subjected to U.N. sanctions since 2006.\r\nUnited Nations: The United States would like the U.N. Security Council to vote during May to further sanction North Korea over its renewe… [+1664 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rahul Gandhi Reaches Out To 'Upset' Hardik Patel To Sort Out Differences", "description": "Congress leader Rahul Gandhi has reached out to disgruntled Gujarat Congress Committee working president Hardik Patel to sort out differences in the party unit ahead of state assembly polls, said sources.", "url": "https://www.ndtv.com/india-news/rahul-gandhi-reaches-out-to-upset-hardik-patel-to-sort-out-differences-2943700", "urlToImage": "https://c.ndtvimg.com/2022-04/gvgdmic_hardik-patel_625x300_15_April_22.jpg", "publishedAt": "2022-05-03T20:45:40Z", "content": "Hardik Patel recently lauded the BJP government for revoking Article 370.\r\nNew Delhi: Congress leader Rahul Gandhi has reached out to disgruntled Gujarat Congress Committee working president Hardik P… [+2324 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine Says At Least 21 Killed In Russian Strikes In Eastern Region", "description": "\"At least 10 killed and 15 wounded, the consequences of the shelling of the Avdiivka coke plant by the Russian occupiers, the governor Pavlo Kyrylenko said on Telegram.", "url": "https://www.ndtv.com/world-news/ukraine-says-at-least-21-killed-in-russian-strikes-in-eastern-region-2943666", "urlToImage": "https://c.ndtvimg.com/2022-03/84ldh8vg_ukraine-war_625x300_31_March_22.jpg", "publishedAt": "2022-05-03T20:19:28Z", "content": "Russia-Ukraine war: Moscow has increased attacks on territories held by Kyiv in the eastern region.\r\nKyiv: Russian strikes on Tuesday killed 21 civilians and wounded 27 in eastern Ukraine, the  gover… [+1610 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Nearly 13 Million US Children Infected With Covid Since Pandemic: Report", "description": "Almost 13 million children in the United States have tested positive for COVID-19 since the onset of the pandemic, according to the latest report by the American Academy of Pediatrics (AAP) and the Children's Hospital Association.", "url": "https://www.ndtv.com/world-news/nearly-13-million-us-children-infected-with-covid-19-since-pandemic-report-2943651", "urlToImage": "https://c.ndtvimg.com/2020-08/haicaheg_coronavirus-generic-august-2020-pti-650_650x400_28_August_20.jpg", "publishedAt": "2022-05-03T20:03:21Z", "content": "Children in US represented 19% of all COVID-19 cases in the country, the report showed.\r\nLos Angeles: Almost 13 million children in the United States have tested positive for COVID-19 since the onset… [+1172 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Stop Advertising If Elon Musk Turns Twitter Toxic: Activists To Ad Companies", "description": "Activist groups called on Twitter advertisers Tuesday to boycott the service if it opens the gates to abusive and misinformative posts with billionaire Elon Musk as its owner.", "url": "https://www.ndtv.com/world-news/stop-advertising-if-elon-musk-turns-twitter-toxic-activists-to-ad-companies-2943640", "urlToImage": "https://c.ndtvimg.com/2022-04/8q0ua0e8_elon-musk_625x300_26_April_22.jpg", "publishedAt": "2022-05-03T19:29:43Z", "content": "Analysts doubt that Twitter users would flock to pay for premium content such as retweeting posts.\r\nSan Francisco: Activist groups called on Twitter advertisers Tuesday to boycott the service if it o… [+2638 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "India Falls 8 Places To 150th Position In World Press Freedom Ranking", "description": "India's ranking in the World Press Freedom Index has fallen down to 150th position from last year's 142nd rank out of 180 countries, according to a report by a global media watchdog released on Tuesday.", "url": "https://www.ndtv.com/india-news/india-falls-8-places-to-150th-position-in-world-press-freedom-ranking-2943614", "urlToImage": "https://i.ndtvimg.com/i/2017-06/media-generic-istock_650x400_61496842801.jpg", "publishedAt": "2022-05-03T18:55:05Z", "content": "World Press Freedom: This year, Norway (1st) and Denmark grabbed the top positions. (Representational)\r\nNew Delhi: India's ranking in the World Press Freedom Index has fallen down to 150th position f… [+3558 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Was Punished By Kremlin For Stance On Ukraine War, Says Russian Tycoon", "description": "A Russian tycoon, who has urged the West to help end Moscow's \"insane war\" in Ukraine, said Tuesday he had been punished by the Kremlin for his stance.", "url": "https://www.ndtv.com/world-news/punished-by-kremlin-russian-tycoon-oleg-tinkov-claims-backlash-over-stance-on-ukraine-war-2943593", "urlToImage": "https://c.ndtvimg.com/2021-10/me6uodlg_russian-billianaire-oleg-tinkov_625x300_30_October_21.jpeg", "publishedAt": "2022-05-03T18:32:32Z", "content": "Oleg Tinkov said a majority of Russian businesspeople were afraid to speak out. (File)\r\nParis, France: A Russian tycoon, who has urged the West to help end Moscow's \"insane war\" in Ukraine, said Tues… [+2064 chars]"}]}