{"status": "ok", "totalResults": 252, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Nupur Sharma Will Be Made Big Leader In 6-7 Months\": Asaduddin Owaisi", "description": "All India Majlis-e-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi has demanded the arrest of suspended BJP spokesperson Nupur Sharma for the alleged objectionable remark against Prophet Muhammad", "url": "https://www.ndtv.com/india-news/nupur-sharma-to-be-big-leader-in-6-7-months-says-asaduddin-owaisi-3080227", "urlToImage": "https://c.ndtvimg.com/2021-11/gqe1gbu_owaisi_625x300_12_November_21.jpg", "publishedAt": "2022-06-19T02:33:26Z", "content": "Asaduddin Owaisi said BJP is safeguarding Nupur Sharma\r\nHyderabad: All India Majlis-e-Ittehadul Muslimeen (AIMIM) chief Asaduddin Owaisi has demanded the arrest of suspended BJP spokesperson Nupur Sh… [+2876 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Fathers Day: Wishes, Messages, Quotes, WhatsApp To Mark The Day", "description": "Take a look at some of the messages and quotes that you can share with your father on the occasion of Father's Day.", "url": "https://www.ndtv.com/world-news/happy-father-s-day-2022-wishes-messages-quotes-whatsapp-facebook-status-wallpapers-and-photos-3079100", "urlToImage": "https://c.ndtvimg.com/2021-06/7mo4p18o_fathers-day-650_625x300_18_June_21.jpg", "publishedAt": "2022-06-19T02:22:11Z", "content": "Father's Day wishes: This year, Father's Day falls on June 19.\r\nFather's Day is celebrated on the third Sunday of June. This year, it falls on June 19. On this day, we all try to make our dads feel a… [+2005 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Watch: Cop Saves Elderly Woman Crossing Tracks, Railways Makes A Request", "description": "A woman was moments away from being run over by a train in Uttar Pradesh's Lalitpur on Saturday before a Railway Police Force official rescued her. The entire incident was captured on a CCTV camera on the platform.", "url": "https://www.ndtv.com/india-news/watch-cop-saves-elderly-woman-crossing-tracks-railways-makes-a-request-3080222", "urlToImage": "https://c.ndtvimg.com/2022-06/fr1uge0g_railway-rescue-up_625x300_19_June_22.jpg", "publishedAt": "2022-06-19T02:18:28Z", "content": "The video has been viewed over 69,000 times on Twitter.\r\nUttar Pradesh: A woman was moments away from being run over by a train in Uttar Pradesh's Lalitpur on Saturday before a Railway Police Force o… [+1789 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "'Agnipath' Protests Continue, Centre Counting On Concessions: 10 Points", "description": "Despite the centre's steps to assuage concerns over the 'Agnipath' recruitment scheme, there was no let-up in the protests in several states.", "url": "https://www.ndtv.com/india-news/agnipath-protests-continue-centre-counting-on-concessions-10-points-3080216", "urlToImage": "https://c.ndtvimg.com/2022-06/riuaskhg_agnipath-protest-reuters_650x400_18_June_22.jpg", "publishedAt": "2022-06-19T02:11:18Z", "content": "<li>The Home and Defence ministries promised new 10 per cent quotas each in jobs for 'Agnipath' recruits after their four-year tenure. The Ministry of Shipping also announced plans to induct Agniveer… [+2507 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Staff At This Apple Store Have Voted To Form Their First Union In The US", "description": "A majority of employees at a US Apple store have voted to form a union, a first for the tech giant, which has so far tried to discourage unionising attempts.", "url": "https://www.ndtv.com/world-news/staff-at-this-apple-store-have-voted-to-form-their-first-union-in-the-us-3080207", "urlToImage": "https://c.ndtvimg.com/2022-06/3so0o0f8_apple_625x300_19_June_22.jpg", "publishedAt": "2022-06-19T01:44:03Z", "content": "Of the 110 employees at the Towson, Maryland shop, 65 voted in favor and 33 against\r\nSan Francisco: A majority of employees at a US Apple store have voted to form a union, a first for the tech giant,… [+326 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Congress Has No Future, BJP Spews Poison\": Telangana's KTR Slams Parties", "description": "Telangana Minister for IT and Industries KT Rama Rao on Saturday lashed out at the Congress and said that it had ruined the state and the entire country.", "url": "https://www.ndtv.com/india-news/congress-has-no-future-bjp-spews-poison-telanganas-ktr-slams-parties-3080169", "urlToImage": "https://c.ndtvimg.com/2018-11/9t0ag41o_ktr-telangana_625x300_20_November_18.jpg", "publishedAt": "2022-06-19T00:58:48Z", "content": "KT Rama Rao was speaking at a public meeting in Kollapur, Mahabubnagar on Saturday. (File)\r\nHyderabad: Telangana Minister for IT and Industries KT Rama Rao on Saturday lashed out at the Congress and … [+1720 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Updates: India Records 13,216 New Covid Cases, 23 Deaths In A Day", "description": "India's COVID-19 tally increased to 4,32,83,793 on Saturday as 13,216 more people tested positive for the viral disease and the active caseload climbed to 68,108, according to Union health ministry data.", "url": "https://www.ndtv.com/india-news/oronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-19-june-19-3080152", "urlToImage": "https://c.ndtvimg.com/2021-12/h3rhcsek_covid-india-pti_625x300_05_December_21.jpg", "publishedAt": "2022-06-19T00:31:25Z", "content": "The daily positivity rate was recorded at 2.73 per cent.\r\nNew Delhi: India's COVID-19 tally increased to 4,32,83,793 on Saturday as 13,216 more people tested positive for the viral disease and the ac… [+1575 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Hundreds Attend Yoga Session In Washington Ahead Of International Yoga Day", "description": "Hundreds of people participated in a yoga session organised by the Indian Embassy at the iconic Washington Monument ahead of the International Yoga Day (June 21).", "url": "https://www.ndtv.com/india-news/hundreds-attend-yoga-session-in-washington-ahead-of-international-yoga-day-3080148", "urlToImage": "https://c.ndtvimg.com/2022-06/jihbp5hk_washington-yoga-session_625x300_19_June_22.jpg", "publishedAt": "2022-06-19T00:28:03Z", "content": "As part of the celebrations, a common yoga protocol session was conducted\r\nWashington: Hundreds of people participated in a yoga session organised by the Indian Embassy at the iconic Washington Monum… [+2083 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Principal Arrested For Molesting Schoolgirls In Jharkhand", "description": "Jharkhand Police on Saturday arrested the principal of a private school on charges of molesting minor girl students.", "url": "https://www.ndtv.com/india-news/principal-arrested-for-molesting-schoolgirls-in-jharkhand-3080135", "urlToImage": "https://c.ndtvimg.com/2020-03/utejv4l_police-generic_625x300_07_March_20.jpg", "publishedAt": "2022-06-18T23:02:39Z", "content": "Police further said that the accused has been sent to judicial custody. (Representational)\r\nChaibasa (Jharkhand): Jharkhand Police on Saturday arrested the principal of a private school on charges of… [+717 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia's War In Ukraine Could Last Years: NATO", "description": "Russia's war in Ukraine could take years, NATO Secretary General Jens Stoltenberg told a German weekly newspaper, adding that the supply of state-of-the-art weaponry to Ukrainian troops would increase the chance of liberating the Donbas region", "url": "https://www.ndtv.com/world-news/russias-war-in-ukraine-could-last-years-natos-stoltenberg-says-3080123", "urlToImage": "https://c.ndtvimg.com/2022-06/kcc0sgkc_russiaukraine-war_625x300_18_June_22.jpg", "publishedAt": "2022-06-18T22:23:02Z", "content": "Must prepare for fact that it could take years. We must not let up in supporting Ukraine, said NATO\r\nFRANKFURT: Russia's war in Ukraine could take years, NATO Secretary General Jens Stoltenberg told … [+1072 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Covid Nasal Vaccine's Phase 3 Trials Completed: Bharat Biotech Chief", "description": "Dr Krishna Ella, Chairman and Managing Director of Bharat Biotech said that the clinical phase III trials of the COVID-19 nasal vaccine have been completed and the company will submit its data with Drugs Controller General of India next month.", "url": "https://www.ndtv.com/india-news/covid-nasal-vaccine-phase-3-trials-completed-bharat-biotech-chief-3080119", "urlToImage": "https://c.ndtvimg.com/2021-10/nfkjg30o_bharat-biotech-covaxinreuters_625x300_26_October_21.jpg", "publishedAt": "2022-06-18T22:12:17Z", "content": "Dr Ella said that those who had taken the 2nd dose must take the booster dose.(Representational)\r\nParis:  Dr Krishna Ella, Chairman and Managing Director of Bharat Biotech on Saturday said that the c… [+2585 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "North Korea Deploys Medical Crews As Hundreds Ill With Intestinal Disease", "description": "North Korea has dispatched medical crews and epidemiological investigators to a province battling the outbreak of an intestinal disease, state media reported on Sunday.", "url": "https://www.ndtv.com/world-news/north-korea-deploys-medical-crews-as-hundreds-ill-with-intestinal-disease-3080115", "urlToImage": "https://c.ndtvimg.com/2019-11/8v2lrfvg_hospital-generic_625x300_07_November_19.jpg", "publishedAt": "2022-06-18T22:11:01Z", "content": "South Korean officials say it may be cholera or typhoid. (Representational)\r\nSEOUL: North Korea has dispatched medical crews and epidemiological investigators to a province battling the outbreak of a… [+1155 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Approves Covid Vaccines For Children As Young As 6 Months", "description": "US health authorities on Saturday cleared the Pfizer and Moderna Covid-19 vaccines for children aged five and younger, in a move President Joe Biden greeted as a \"monumental step\" in the fight against the virus.", "url": "https://www.ndtv.com/world-news/us-approves-covid-vaccines-for-children-as-young-as-6-months-3080107", "urlToImage": "https://c.ndtvimg.com/2021-12/bopgkfqk_children-covid-vaccination-afp_625x300_15_December_21.jpg", "publishedAt": "2022-06-18T21:35:27Z", "content": "The Moderna vaccine will be available to children aged six months to five years. (Representational)\r\nWashington: US health authorities on Saturday cleared the Pfizer and Moderna Covid-19 vaccines for… [+2967 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"We Prepare For Worst\": Governor Of Ukraine Region Seeing Heavy Fighting", "description": "The governor of the eastern Ukrainian region now seeing heavy fighting with Russia, Sergiy Gaiday, opened the pockets of his flack jacket Saturday to show gun cartridges and a tourniquet.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-we-prepare-for-worst-governor-of-ukraine-region-seeing-heavy-fighting-3080101", "urlToImage": "https://c.ndtvimg.com/2022-06/n9m94f2s_ukraine-severodonetsk-afp_625x300_19_June_22.jpg?im=FitAndFill=(600,400)", "publishedAt": "2022-06-18T21:11:26Z", "content": "Smoke and dirt rise from the city of Severodonetsk in the eastern Ukrainian region of Donbas\r\nLysychansk: The governor of the eastern Ukrainian region now seeing heavy fighting with Russia, Sergiy Ga… [+3579 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "BJP's 1st Coordination Committee Meet Today To Discuss Presidential Polls", "description": "The Bharatiya Janata Party (BJP) will hold its first coordination committee meeting in the national capital on Sunday to hold detailed discussions for the upcoming presidential election that are due on July 18 this year.", "url": "https://www.ndtv.com/india-news/bjps-1st-coordination-committee-meet-today-to-discuss-presidential-polls-3080044", "urlToImage": "https://c.ndtvimg.com/2022-06/2sn16mvg_jp-nadda_625x300_09_June_22.jpg", "publishedAt": "2022-06-18T19:20:39Z", "content": "BJP chief JP Nadda will chair the meeting. (FILE)\r\nNew Delhi: The Bharatiya Janata Party (BJP) will hold its first coordination committee meeting in the national capital on Sunday to hold detailed di… [+2082 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Man Offers Blank Cheques To Get A Case Filed, Gurgaon Top Cop Responds", "description": "A local resident claiming to be the chief of a Hindu outfit offered money to two policemen on Twitter, asking them to lodge a case over cow smuggling. A senior police official said they will take legal action against the man for the slanderous post.", "url": "https://www.ndtv.com/gurgaon-news/man-offers-blank-cheques-to-get-a-case-filed-gurgaon-top-cop-responds-3080008", "urlToImage": "https://c.ndtvimg.com/2019-12/pasi7rqs_gurgaon-police-generic_625x300_19_December_19.jpg", "publishedAt": "2022-06-18T18:56:36Z", "content": "A senior police official said they will take legal action against the man. (Representational)\r\nGurugram: A local resident claiming to be the chief of a Hindu outfit offered money to two policemen on … [+1657 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Bangladesh Minister Sends 100 Roses To PM Modi's Mother On 99th Birthday", "description": "Bangladesh Foreign Minister AK Abdul Momen on Saturday greeted Heeraben Modi, mother of Prime Minister Narendra Modi who celebrated her 99th birthday.", "url": "https://www.ndtv.com/india-news/bangladesh-foreign-minister-a-k-abdul-momen-sends-100-roses-to-pm-modis-mother-on-her-99th-birthday-3079894", "urlToImage": "https://c.ndtvimg.com/2022-06/qmqalaao_pm-modi-mother_625x300_18_June_22.jpg", "publishedAt": "2022-06-18T18:41:49Z", "content": "PM Modi penned an emotional blog on the 99th birthday of his mother.\r\nNew Delhi: Bangladesh Foreign Minister AK Abdul Momen on Saturday greeted Heeraben Modi, mother of Prime Minister Narendra Modi w… [+2682 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "BJP Accuses AAP Of \"Using Children\" For Campaigning In Delhi Bypoll", "description": "The Delhi BJP on Saturday charged the AAP with roping in children for campaigning in Rajinder Nagar Assembly bypoll, with its  state president Adesh Gupta demanding child rights body NCPCR to take action against the party candidate Durgesh Pathak.", "url": "https://www.ndtv.com/delhi-news/bjp-accuses-aap-of-using-children-for-campaigning-in-delhi-bypoll-3079983", "urlToImage": "https://c.ndtvimg.com/2022-05/ecfr0pc4_aap-senior-leader-durgesh-pathak_625x300_31_May_22.jpg", "publishedAt": "2022-06-18T18:28:54Z", "content": "No immediate reaction was available from the AAP over Delhi BJP chief's charges. (FLE)\r\nNew Delhi: The Delhi BJP on Saturday charged the AAP with roping in children for campaigning in Rajinder Nagar … [+1691 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Not Just In Gulf...\": Minister's Disclosure On Prophet Row Backlash", "description": "Days after several nations expressed outrage over controversial remarks on Prophet Mohammad, External Affairs Minister S Jaishankar on Saturday said countries did appreciate that this was not the position of the government.", "url": "https://www.ndtv.com/india-news/foreign-minister-s-jaishankars-disclosure-on-prophet-row-backlash-not-just-in-gulf-3079609", "urlToImage": "https://c.ndtvimg.com/2022-04/58h2h1go_s-jaishankar-pti_625x300_13_April_22.jpg", "publishedAt": "2022-06-18T18:24:33Z", "content": "Prophet Remarks Row: S Jaishankar said sensibilities and the sensitivities of people were impacted (File)\r\nNew Delhi: Days after several nations expressed outrage over controversial remarks on Prophe… [+2290 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Don't Hold Celebrations On My Birthday: Rahul Gandhi To Congress Workers", "description": "Former Congress chief Rahul Gandhi has appealed to party leaders and workers not to celebrate his birthday on Sunday. In a message to them, he said the youngsters of the country are anguished and are protesting on the streets.", "url": "https://www.ndtv.com/india-news/rahul-gandhi-to-congress-workers-dont-hold-celebrations-on-my-birthday-3079973", "urlToImage": "https://c.ndtvimg.com/2022-05/v94u9k3c_rahul-gandhi-file_625x300_20_May_22.jpg", "publishedAt": "2022-06-18T18:23:07Z", "content": "Rahul Gandhi turns 52 on Sunday.\r\nNew Delhi: Former Congress chief Rahul Gandhi has appealed to party leaders and workers not to celebrate his birthday on Sunday. In a message to them, he said the yo… [+1150 chars]"}]}