{"status": "ok", "totalResults": 553, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": "Asian News International", "title": "Kieron Pollard To Play For Surrey In T20 Blast", "description": "The 35-year-old superstar has won two T20 World Cups and has also won five Indian Premier League titles with Mumbai Indians, and represented Somerset in the 2010-11 T20 season.", "url": "https://sports.ndtv.com/cricket/kieron-pollard-to-play-for-surrey-in-t20-blast-2994726", "urlToImage": "https://c.ndtvimg.com/2022-05/27ro96a_kieron-pollard-bcciipl_625x300_12_May_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-20T14:39:02Z", "content": "Former West Indies all-rounder Kieron Pollard will be joining Surrey to play in this year's T20 Vitality Blast, Surrey Cricket announced on Friday. The 35-year-old superstar has won two T20 World Cup… [+882 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Delhi Raises Wages Of Labourers, Revision Applicable From April 1", "description": "The Delhi government today raised the dearness allowance (DA) for labourers. With the latest revision in the dearness allowance, the monthly wages for unskilled labourers have been raised from Rs 16,064 to Rs 16,506 per month.", "url": "https://www.ndtv.com/delhi-news/delhi-raises-wages-of-labourers-hiked-wages-applicable-from-april-1-2994719", "urlToImage": "https://i.ndtvimg.com/i/2016-09/labour-india-reuters_650x400_81474555363.jpg", "publishedAt": "2022-05-20T14:37:33Z", "content": "The hiked wages will be applicable from April 1\r\nNew Delhi: The Delhi government today raised the dearness allowance (DA) for labourers. With the latest revision in the dearness allowance, the monthl… [+2062 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Managers Warn Over Pitch Invasions As Police Probe Vieira Incident", "description": "Footage appears to show Vieira kicking out at the supporter, who was apparently taunting the former Arsenal and France midfielder after Everton secured their Premier League status with a dramatic 3-2 win on Thursday.", "url": "https://sports.ndtv.com/football/managers-warn-over-pitch-invasions-as-police-probe-vieira-incident-2994665", "urlToImage": "https://c.ndtvimg.com/2022-05/1juahaq8_patrick-vieira_625x300_20_May_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-20T14:26:52Z", "content": "Newcastle manager Eddie Howe has warned pitch invasions could lead to a \"potential tragedy\" as British police opened an investigation into an \"altercation\" involving Crystal Palace manager Patrick Vi… [+3751 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTVSports", "title": "Rajasthan Royals vs Chennai Super Kings Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports", "description": "Live Updates of Today Match between Rajasthan Royals vs Chennai Super Kings from Brabourne Stadium, Mumbai. Check commentary and full scoreboard of the match.", "url": "https://sports.ndtv.com/ipl-2022/rajasthan-royals-vs-chennai-super-kings-live-score-over-match-68-t20-6-10-updates-2994661", "urlToImage": "https://edata.ndtv.com/twittergft/sport_automated_story/big_637886741036584330.png", "publishedAt": "2022-05-20T14:26:01Z", "content": "Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com. After 7.3 overs, Chennai Super Kings are 85/2. Get live score, ball by ball commentary and much more. Keep track of Indian… [+3442 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Tom Hanks Fans Spot Forrest Gump At Queen Event, Cause Online Frenzy", "description": "The photo was taken when the British monarch paid a surprise visit to the Paddington Station to officially open the new Elizabeth tube line.", "url": "https://www.ndtv.com/world-news/tom-hanks-fans-spot-forrest-gump-at-queen-event-cause-online-frenzy-2994620", "urlToImage": "https://c.ndtvimg.com/2022-05/edtret5_tom-hanks-in-queen-photo-650_625x300_20_May_22.jpg", "publishedAt": "2022-05-20T14:15:22Z", "content": "The man leaning out of the doorway caused online frenzy.\r\nThe fans of Tom Hanks caused frenzy on Twitter after a photo from the opening of the Elizabeth train line on Thursday appeared to show the Fo… [+1585 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "'Nothing To Recover': Nadal Dismisses Doubts Over Foot Injury", "description": "The Spaniard limped to a third-round loss to Denis Shapovalov at the Italian Open, but practised in front of thousands of fans at Roland Garros on Wednesday without any obvious discomfort.", "url": "https://sports.ndtv.com/tennis/nothing-to-recover-nadal-dismisses-doubts-over-foot-injury-2994618", "urlToImage": "https://i.ndtvimg.com/i/2017-05/rafa-nadal-french-open-afp_806x605_61496071961.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-20T14:14:53Z", "content": "Rafael Nadal has played down concerns over the chronic foot issue that resurfaced in Rome last week as he prepares to launch his bid for a 14th French Open title. The Spaniard limped to a third-round… [+2349 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Watch: Somerset Captain Gets Bowled After Much Drama In County Cricket", "description": "When Somerset captain Tom Abell was batting against Hampshire in a County Championship game, a bizarre thing happened", "url": "https://sports.ndtv.com/cricket/county-championship-somerset-captain-tom-abell-watches-in-horror-as-he-gets-bowled-after-much-drama-against-hampshire-watch-2994593", "urlToImage": "https://c.ndtvimg.com/2022-05/t2et1ri8_tom-abell-twitter_625x300_20_May_22.jpg", "publishedAt": "2022-05-20T14:09:57Z", "content": "From Cheteshwar Pujara's double ton for Sussex to Pakistan pacer Hasan Ali's breathtaking spell for Lancashire, the ongoing County Championship has so far witnessed some memorable moments. However, a… [+1545 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Heavy Rain In Parts Of Delhi, Gurgaon Brings Relief From Scorching Heat", "description": "Heavy rains in parts of Delhi today provided a much-needed respite from the sweltering heat in the national capital. Isolated pockets have reported drizzling with strong winds, which in turn has brought down the mercury.", "url": "https://www.ndtv.com/india-news/heavy-rain-in-parts-of-delhi-gurgaon-brings-relief-from-scorching-heat-2994592", "urlToImage": "https://c.ndtvimg.com/2022-05/qudao3ac_delhi-rain_625x300_04_May_22.jpg", "publishedAt": "2022-05-20T14:09:23Z", "content": "New Delhi: Heavy rains in parts of Delhi today provided a much-needed respite from the sweltering heat in the national capital. Isolated pockets received a heavy drizzle with strong winds, which in t… [+255 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Monkeypox Outbreak In Europe And North America, WHO Calls Emergency Meet", "description": "The World Health Organization (WHO) has called for an emergency meeting to discuss monkeypox, a virus that is rapidly spreading across Europe and North America.", "url": "https://www.ndtv.com/world-news/monkeypox-outbreak-in-europe-and-north-america-who-calls-emergency-meet-report-2994574", "urlToImage": "https://c.ndtvimg.com/2022-05/fq927atg_monkeypox-testing-indonesia_625x300_19_May_22.jpg", "publishedAt": "2022-05-20T14:02:19Z", "content": "France, Germany, and Belgium also reported their first case of monkeypox today.\r\nNew Delhi: The World Health Organization (WHO) has called for an emergency meeting to discuss monkeypox, a virus that … [+1145 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "On CBI Raids On Lalu Yadav In New Corruption Case, His Party's Response", "description": "The Rashtriya Janata Dal said on Friday the CBI's fresh corruption case against its chief Lalu Prasad Yadav and his family members was \"predictable\" and alleged that the BJP uses probe agencies to scare its rivals.", "url": "https://www.ndtv.com/india-news/on-cbi-raids-on-lalu-yadav-in-new-corruption-case-his-partys-response-2993462", "urlToImage": "https://c.ndtvimg.com/lalu-prasad-yadav_625x300_1527020134500.jpg", "publishedAt": "2022-05-20T14:01:23Z", "content": "Lalu Prasad Yadav has been charged in a fresh corruption case.\r\nNew Delhi: The Rashtriya Janata Dal said on Friday the CBI's fresh corruption case against its chief Lalu Prasad Yadav and his family m… [+2140 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ashok Gehlot Dials Punjab Chief Minister. On Agenda: Canal Repairs", "description": "Rajasthan Chief minister Ashok Gehlot on Friday spoke to his Punjab counterpart Bhagwant Mann over the phone, requesting him to get the repair of the damaged portion of the Sirhind canal done.", "url": "https://www.ndtv.com/india-news/ashok-gehlot-dials-punjab-chief-minister-on-agenda-canal-repairs-2993438", "urlToImage": "https://c.ndtvimg.com/2019-07/p3aujdu8_ashok-gehlot-pti_625x300_10_July_19.jpg", "publishedAt": "2022-05-20T13:56:51Z", "content": "Rajasthan Chief Minister Ashok Gehlot said Bhagwant Mann assured him efforts will be made.\r\nJaipur: Rajasthan Chief minister Ashok Gehlot on Friday spoke to his Punjab counterpart Bhagwant Mann over … [+827 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Man Fined For Not Wearing Helmet Was Driving Car. Traffic Cops Apologise", "description": "Twitter users liked the Delhi Traffic Police's gesture, hoping that it will give inspiration to others.", "url": "https://www.ndtv.com/india-news/delhi-traffic-police-apologies-to-man-wrongly-challaned-internet-says-this-made-my-day-2994555", "urlToImage": "https://c.ndtvimg.com/2022-05/612rlaa_man-challaned-for-helmet-650_625x300_20_May_22.jpg", "publishedAt": "2022-05-20T13:56:48Z", "content": "A Delhi Traffic Police official hands over a red rose to the man who was wrongly challaned.\r\nThe Delhi Traffic Police has apologised to a man who was fined for not wearing a helmet while driving a ca… [+1918 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Photo Of \"Worlds Most Beautiful Cycling Route\" Leaves Indians Thrilled", "description": "Erik Solheim, a former Norwegian diplomat, recently shared a picture of an aerial shot of one of the scenic roads in India, which he said is the \"world's most beautiful cycling route\".", "url": "https://www.ndtv.com/india-news/photo-of-worlds-most-beautiful-cycling-route-leaves-indians-thrilled-2994551", "urlToImage": "https://c.ndtvimg.com/2022-05/sac8kudo_cyclist-place-240_625x300_20_May_22.jpg", "publishedAt": "2022-05-20T13:56:32Z", "content": "An aerial shot of one of the scenic roads in India.\r\nErik Solheim, a former Norwegian diplomat, recently shared a picture of an aerial shot of one of the scenic roads in India, which he said is the \"… [+1588 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Jet Airways Permitted Fly Again; To Resume Commercial Flights", "description": "India's Jet Airways said on Friday the country's aviation regulator has cleared it to resume operation of commercial flights.", "url": "https://www.ndtv.com/business/indias-jet-airways-allowed-to-fly-again-2994549", "urlToImage": "https://c.ndtvimg.com/2022-05/u6n19geo_jet-airways-240_625x300_05_May_22.jpg", "publishedAt": "2022-05-20T13:56:25Z", "content": "Jet Airways allowed to fly again\r\nNEW DELHI: India's Jet Airways said on Friday the country's aviation regulator has cleared it to resume operation of commercial flights.\r\nOnce India's biggest privat… [+583 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "3 Elephants Killed After Being Hit By Train In Odisha", "description": "At least three elephants, including two calves, were killed after being hit by a goods train in Odisha's Keonjhar district, forest officials said on Friday.", "url": "https://www.ndtv.com/india-news/odisha-3-elephants-killed-after-being-hit-by-train-in-odisha-2993423", "urlToImage": "https://c.ndtvimg.com/2020-06/ju9gp4dg_elephant-generic-pixabay-650_625x300_09_June_20.jpg", "publishedAt": "2022-05-20T13:48:48Z", "content": "Odisha: One elephant calf died on the spot, officials said. (Representational)\r\nKeonjhar (Odisha): At least three elephants, including two calves, were killed after being hit by a goods train in Odis… [+1091 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Joe Biden Begins Asia Trip In South Korea Amid North's Nuclear Test Fears", "description": "US President Joe Biden arrived in South Korea Friday, his first Asia trip as US leader, aiming to cement ties with regional security allies despite growing fears of a North Korean nuclear test.", "url": "https://www.ndtv.com/world-news/joe-biden-asia-visit-biden-begins-asia-trip-in-s-korea-under-spectre-of-norths-nuclear-test-2994512", "urlToImage": "https://c.ndtvimg.com/2022-05/42t2hcd8_biden-afp_625x300_20_May_22.jpg", "publishedAt": "2022-05-20T13:47:53Z", "content": "Biden received a warm welcome from South Korea's new President Yoon Suk-yeol.\r\nPyeongtaek, South Korea: US President Joe Biden arrived in South Korea Friday, his first Asia trip as US leader, aiming … [+4739 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Watch: Panda Having 'Breakfast In Bed' Is Making The Internet Wish For The Same", "description": "This adorable video of panda is winning the hearts of people. Many of them can relate to it. Watch it here.", "url": "https://food.ndtv.com/news/watch-panda-having-breakfast-in-bed-is-making-the-internet-wish-for-the-same-2994492", "urlToImage": "https://c.ndtvimg.com/2022-05/4curdnb_panda-video_625x300_20_May_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-20T13:45:31Z", "content": "Do you dream of food while sleeping and even in your waking hours? Welcome to the foodies club. We are enamoured by good food all the time but cooking to enjoy our favourite food can seem like a task… [+1984 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "MS Dhoni Gives Huge Update On Whether He Will Play In IPL 2023 Or Not", "description": "MS Dhoni, in his own inimitable style, did not commit anything but said that he will be working hard to return next season.", "url": "https://sports.ndtv.com/ipl-2022/ms-dhoni-gives-big-update-on-whether-he-will-play-in-ipl-2023-or-not-2994480", "urlToImage": "https://c.ndtvimg.com/2022-05/g9c8floo_dhoni_650x400_20_May_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-20T13:43:21Z", "content": "Ahead of Chennai Super Kings' final match of the IPL 2022 season against Rajasthan Royals, the big question that all cricket fans wanted an answer to is whether MS Dhoni will be seen in the CSK jerse… [+1698 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "3 Arrested In Madhya Pradesh For Thrashing Man On Suspicion Of Theft: Cops", "description": "Three persons were arrested for allegedly severely thrashing a man on the suspicion of theft, a police official said on Friday.", "url": "https://www.ndtv.com/india-news/madhya-pradesh-3-arrested-in-madhya-pradesh-for-thrashing-man-on-suspicion-of-theft-cops-2993391", "urlToImage": "https://i.ndtvimg.com/i/2016-05/arrest-generic_650x400_71463458726.jpg", "publishedAt": "2022-05-20T13:43:13Z", "content": "Madhya Pradesh: Further investigation is underway, police said. (Representational)\r\nGwalior: Three persons were arrested for allegedly severely thrashing a man on the suspicion of theft, a police off… [+592 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Heroin Worth Rs 1,526 Crore Seized Off The Lakshadweep Coast", "description": "\"High-grade heroin\" worth Rs 1,526 crore was seized off the coast of the Lakshadweep Islands in a joint operation undertaken by the Directorate of Revenue Intelligence (DRI) and Indian Coast Guard (ICG) called 'Operation Khojbeen'.", "url": "https://www.ndtv.com/india-news/heroin-worth-rs-1-526-crore-seized-off-the-lakshadweep-coast-2994459", "urlToImage": "https://c.ndtvimg.com/2022-05/s34rojug_heroin_625x300_20_May_22.jpg", "publishedAt": "2022-05-20T13:39:04Z", "content": "'Operation Khojbeen' was launched on May 7.\r\n\"High-grade heroin\" worth Rs 1,526 crore was seized off the coast of the Lakshadweep Islands in a joint operation undertaken by the Directorate of Revenue… [+1556 chars]"}]}