{"status": "ok", "totalResults": 281, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Syria Intercepts Israeli Missiles Over Damascus; No Casualties: Reports", "description": "Syrian air defence intercepted Israeli missiles south of Damascus on Monday, with no casualties reported, a military source told Syria's official news agency SANA.", "url": "https://www.ndtv.com/world-news/syria-intercepts-israeli-missiles-over-damascus-no-casualties-reports-3044298", "urlToImage": "https://c.ndtvimg.com/2021-10/6e8i71v_missile-generic_650x400_17_October_21.jpg", "publishedAt": "2022-06-06T22:28:28Z", "content": "The conflict in Syria has killed nearly half a million people since war began in 2011. (Representational)\r\nDamascus: Syrian air defence intercepted Israeli missiles south of Damascus on Monday, with … [+1644 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Kanpur Clash: Top Cop Dismisses Reports Of Attack On Police During Arrest Of Accused", "description": "Kanpur police on Monday refuted the reports of an attack on the police team that went to arrest an accused in the violence that occurred in the city on June 3, and termed the information \"untrue and misleading\".", "url": "https://www.ndtv.com/india-news/kanpur-clash-top-cop-dismisses-reports-of-attack-on-police-during-arrest-of-accused-3044297", "urlToImage": "https://c.ndtvimg.com/2022-06/fjq39nm_kanpur-clash_625x300_03_June_22.jpg", "publishedAt": "2022-06-06T22:09:30Z", "content": "Police said that reports of attack on police team that went to arrest an accused is misleading.\r\nKanpur:  Kanpur police on Monday refuted the reports of an attack on the police team that went to arre… [+630 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Blinken Says Reports Of Russia Stealing Ukraine Grain \"Credible\"", "description": "US Secretary of State Antony Blinken gave support Monday to reports that Russia has stolen grain from Ukraine for resale, even as Moscow blocks the country from exporting its own corn.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-antony-blinken-says-reports-of-russia-stealing-ukraine-grain-credible-3044289", "urlToImage": "https://c.ndtvimg.com/2021-09/smc741gk_antony-blinken-afp_625x300_24_September_21.jpg", "publishedAt": "2022-06-06T21:28:02Z", "content": "The war \"is having a devastating impact on global food security, Blinken said in a statement.\r\nWashington: US Secretary of State Antony Blinken gave support Monday to reports that Russia has stolen g… [+1852 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UK PM Hails \"Convincing\" Win In Party Confidence Vote", "description": "British Prime Minister Boris Johnson vowed late Monday to plough on with governing after winning what he called a \"convincing\" victory in a Conservative confidence vote, despite a sizeable rebellion.", "url": "https://www.ndtv.com/world-news/uk-pm-boris-johnson-says-confidence-vote-win-is-convincing-3044278", "urlToImage": "https://c.ndtvimg.com/2022-03/8246og6s_boris-johnson-afp_625x300_04_March_22.jpg", "publishedAt": "2022-06-06T21:10:05Z", "content": "UK PM Boris Johnson secured the support of 59% of his lawmakers' in no-trust vote over partygate. (File)\r\nLondon: British Prime Minister Boris Johnson vowed late Monday to plough on with governing af… [+412 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Pakistani Terrorist Killed In Encounter In J&K's Baramulla: Police", "description": "A Pakistani terrorist of Lashkar-e-Taiba (LeT) was killed in an encounter with security forces in Baramulla district of Jammu and Kashmir on Monday, while three terrorists managed to escape, police said.", "url": "https://www.ndtv.com/india-news/pakistani-terrorist-killed-in-encounter-in-j-ks-baramulla-police-3044261", "urlToImage": "https://c.ndtvimg.com/2019-03/d5srpipo_jammu-kashmir-encounter-_625x300_30_March_19.jpg", "publishedAt": "2022-06-06T20:35:39Z", "content": "Kashmir zone IGP said one Pakistani terrorist was killed in the encounter. (Reprsentational)\r\nSrinagar: A Pakistani terrorist of Lashkar-e-Taiba (LeT) was killed in an encounter with security forces … [+1131 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Mumbai Police Record Salman Khan's Father's Statement Over Threat Letter", "description": "Mumbai Police on Monday recorded the statement of Bollywood actor Salman Khan's father Salim Khan, a day after a letter threatened that the father-son duo will meet the fate of Punjabi singer Sidhu Moosewala.", "url": "https://www.ndtv.com/india-news/mumbai-police-record-salman-khans-father-salim-khan-statement-over-threat-letter-3044228", "urlToImage": "https://c.ndtvimg.com/2021-05/t99aicu_radhe-salim-khan-_625x300_28_May_21.jpg", "publishedAt": "2022-06-06T20:08:51Z", "content": "Mumbai police commissioner said the police were taking the threat letter very seriously. (File)\r\nMumbai: Mumbai Police on Monday recorded the statement of Bollywood actor Salman Khan's father Salim K… [+2112 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UK PM Boris Johnson Wins Confidence Vote", "description": "British Prime Minister Boris Johnson won a confidence vote on Monday, seeing off a challenge to his leadership brought by lawmakers within his Conservative Party.", "url": "https://www.ndtv.com/world-news/uk-pm-boris-johnson-wins-confidence-vote-3044221", "urlToImage": "https://c.ndtvimg.com/2022-05/sgigl59_boris-johnson_625x300_25_May_22.jpg", "publishedAt": "2022-06-06T20:03:01Z", "content": "Boris Johnson won the vote 211 to 148\r\nLondon: British Prime Minister Boris Johnson won a confidence vote on Monday, seeing off a challenge to his leadership brought by lawmakers within his Conservat… [+834 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UK PM Boris Johnson Braces For Result Of Tory No-Confidence Vote", "description": "British Conservative MPs on Monday voted on the future of Prime Minister Boris Johnson, after calling a no-confidence vote over a string of scandals that have left the party's public standing in tatters.", "url": "https://www.ndtv.com/world-news/uk-pm-boris-johnson-braces-for-result-of-tory-no-confidence-vote-3044205", "urlToImage": "https://c.ndtvimg.com/2022-05/sgigl59_boris-johnson_625x300_25_May_22.jpg", "publishedAt": "2022-06-06T19:33:28Z", "content": "If he loses, he must step down as party leader but can stay on as PM, the report says.\r\nLondon: British Conservative MPs on Monday voted on the future of Prime Minister Boris Johnson, after calling a… [+5158 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "South Africa's Gupta Brothers, Friends Of Former President Zuma, Arrested", "description": "The South African government said on Monday that law enforcement authorities in the United Arab Emirates (UAE) have arrested Rajesh Gupta and Atul Gupta of the Gupta family.", "url": "https://www.ndtv.com/world-news/south-africas-gupta-brothers-atul-gupta-rajesh-gupta-friends-of-former-president-jacob-zuma-arrested-3044191", "urlToImage": "https://i.ndtvimg.com/i/2016-08/gupta-south-africa_650x400_51472451487.jpg", "publishedAt": "2022-06-06T19:15:14Z", "content": "Recently a report had said that Gupta brothers used ex-president Zuma against South African people.\r\nDubai: The South African government said on Monday that law enforcement authorities in the United … [+401 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "New Zealand Lose Colin De Grandhomme For Rest Of England Series", "description": "Coach Gary Stead said de Grandhomme would need 10 to 12 weeks to recover.", "url": "https://sports.ndtv.com/cricket/new-zealand-lose-colin-de-grandhomme-for-rest-of-england-series-3044159", "urlToImage": "https://c.ndtvimg.com/2022-06/2op8d3ug_colin-de-grandhomme-afp_625x300_07_June_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-06T18:52:51Z", "content": "All-rounder Colin de Grandhomme has been ruled out of the remainder of New Zealand's Test series against England with a heel injury, the Black Caps said on Monday. After the 35-year-old bowled only 3… [+1002 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US, Europe Urge Russia To End Sexual Violence In Ukraine War", "description": "The United States and Europe urged Russia on Monday to stop alleged sexual violence by its army and proxies in Ukraine, allegations that Moscow denounced as \"lies\".", "url": "https://www.ndtv.com/world-news/us-europe-urge-russia-to-end-sexual-violence-in-ukraine-war-3044143", "urlToImage": "https://c.ndtvimg.com/2022-04/2134kk8g_ukraine-russia-war-afp-650_625x300_15_April_22.jpg", "publishedAt": "2022-06-06T18:36:26Z", "content": "Russia has denied the sexual violence allegations. (Representational)\r\nUnited Nations: The United States and Europe urged Russia on Monday to stop alleged sexual violence by its army and proxies in U… [+1529 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Imposes Personal Sanctions On 61 US Officials", "description": "Russia has imposed personal sanctions on 61 USofficials including USTreasury Secretary Janet Yellen and Energy Secretary Jennifer Granholm and leading defence and media executives, the Russian foreign ministry said on Monday.", "url": "https://www.ndtv.com/world-news/russia-imposes-personal-sanctions-on-61-us-officials-3044129", "urlToImage": "https://c.ndtvimg.com/2021-10/2kldk0a4_us-russia-flags_625x300_06_October_21.jpg", "publishedAt": "2022-06-06T18:31:41Z", "content": "Russia has imposed personal sanctions on US officials. (Representational)\r\nRussia has imposed personal sanctions on 61 US officials including US Treasury Secretary Janet Yellen and Energy Secretary J… [+419 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Amid Allegations Of Interference, Manish Sisodia Meets Delhi Lt Governor", "description": "Delhi Deputy Chief Minister Manish Sisodia on Monday met Lt Governor Vinai Kumar Saxena amid allegations of interference by him in the government's work.", "url": "https://www.ndtv.com/india-news/manish-sisodia-delhi-lt-governor-vinai-kumar-saxena-delhi-deputy-chief-minister-manish-sisodia-vinai-kumar-saxena-aap-3044120", "urlToImage": "https://c.ndtvimg.com/2022-06/otajqsg8_manish-sisodia_625x300_06_June_22.jpg", "publishedAt": "2022-06-06T18:25:34Z", "content": "The AAP had accused the Lt Govermor of interference in the affairs of the government.\r\nNew Delhi: Delhi Deputy Chief Minister Manish Sisodia on Monday met LG Vinai Kumar Saxena amid allegations of in… [+1189 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Heroin Worth 250 Crores Dumped By Pak Smugglers In Gujarat's Kutch: Cops", "description": "The packets recovered in a creek area in the coastal Kutch district, dumped by Pakistani smugglers, contained heroin worth Rs 250 crore, the Gujarat Anti Terrorist Squad (ATS) said on Monday.", "url": "https://www.ndtv.com/india-news/heroin-worth-250-crores-dumped-by-pak-smugglers-in-gujarats-kutch-cops-3044090", "urlToImage": "https://c.ndtvimg.com/2018-11/psn53hc8_drugs-heroin-generic-pixabay-650_625x300_15_November_18.jpg", "publishedAt": "2022-06-06T18:17:31Z", "content": "Ahmedabad: The packets recovered in a creek area in the coastal Kutch district, dumped by Pakistani smugglers, contained heroin worth Rs 250 crore, the Gujarat Anti Terrorist Squad (ATS) said on Mond… [+1442 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Man Kills Wife, Mother-In-Law With Iron Rod In Jammu And Kashmir", "description": "A 25-year-old man Kashmir Singh killed his wife Priyanka and her mother Shanto Devi with an iron rod over domestic issues at Daryoug village in Jammu and Kashmir's Rajouri.", "url": "https://www.ndtv.com/jammu-news/man-kills-wife-mother-in-law-jammu-and-kashmir-rajouri-jammu-and-kashmir-3044032", "urlToImage": "https://i.ndtvimg.com/i/2016-06/murder-generic_650x400_81466778653.jpg", "publishedAt": "2022-06-06T17:50:54Z", "content": "Both the victims had suffered head injuries in the attack. (Representational)\r\nJammu: A man allegedly killed his wife and mother-in-law to death with an iron rod over some domestic issue in Rajouri d… [+673 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ahead Of Monsoons, Delhi Government's Plan To Manage Waterlogging", "description": "Deputy Chief Minister Manish Sisodia on Monday said the Delhi government is ready to combat waterlogging ahead of monsoon on a war footing and it is focussing on solving the problem with micro planning.", "url": "https://www.ndtv.com/delhi-news/pwd-manish-sisodia-waterlogging-in-delhi-waterlogging-3044012", "urlToImage": "https://i.ndtvimg.com/i/2016-07/delhi-waterlogging_650x400_81468502402.jpg", "publishedAt": "2022-06-06T17:36:05Z", "content": "PWD will set up a Central Control Room to monitor waterlogging in Delhi. (File)\r\nNew Delhi: Deputy Chief Minister Manish Sisodia on Monday said the Delhi government is ready to combat waterlogging on… [+2839 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Another TT player approaches court against exclusion from CWG squad", "description": "The Committee of Administrators had announced an eight-member squad in Bangalore with the women's team subject to clearance from Sports Authority of India.", "url": "https://sports.ndtv.com/othersports/another-tt-player-approaches-court-against-exclusion-from-cwg-squad-coa-says-team-not-final-3044003", "urlToImage": "https://c.ndtvimg.com/2022-06/pd6hb1s8_table-tennis_625x300_06_June_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-06T17:34:19Z", "content": "The chaos over the selection of Indian table tennis team for Commonwealth Games deepened on Monday after the CoA informed the players that the squad it announced last week is not final, even as anoth… [+2402 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Cyclist Complains Of 'Inappropriate Behaviour' By Coach, Inquiry On", "description": "The SAI formed the committee on Monday to investigate the cyclist's complaint on a priority basis and the Cycling Federation of India (CFI) too is standing by its athlete.", "url": "https://sports.ndtv.com/othersports/cyclist-complains-of-inappropriate-behaviour-by-coach-sai-forms-inquiry-committee-3043987", "urlToImage": "https://c.ndtvimg.com/2022-06/f52pkkb8_cycling-afp_625x300_06_June_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-06T17:29:07Z", "content": "Cyclist Mayuri Lute has complained of \"inappropriate behaviour\" by national team chief coach R K Sharma, prompting the Sports Authority of India (SAI) and the cycling federation to form inquiry commi… [+1516 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Court Gives Death Penalty To Varanasi Serial Blasts Convict", "description": "A local court on Monday sentenced terror convict Waliullah Khan to death for serial blasts in Varanasi that killed at least 20 people in 2006.", "url": "https://www.ndtv.com/india-news/varanasi-blast-waliullah-khan-2006-varanasi-blast-death-penalty-to-waliullah-khan-3043986", "urlToImage": "https://c.ndtvimg.com/court-generic_625x300_1527245477936.jpg", "publishedAt": "2022-06-06T17:27:38Z", "content": "At least 20 people were killed and about 100 injured in the two explosions. (Representational)\r\nGhaziabad: A local court on Monday sentenced terror convict Waliullah Khan to death for serial blasts i… [+1797 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Bullied, Then A Suicide Attempt. Now, She Is Among Youngest Indian CEOs", "description": "Radhika Gupta, the Chief Executive Officer of Edelweiss MF, has shared her inspiring journey from being bullied for her \"crooked neck\" to becoming one of the youngest CEOs in the country.", "url": "https://www.ndtv.com/india-news/bullied-then-a-suicide-attempt-now-she-is-among-youngest-indian-ceos-3043973", "urlToImage": "https://c.ndtvimg.com/2022-06/vec8l1ok_radhika-gupta_625x300_06_June_22.jpg", "publishedAt": "2022-06-06T17:24:11Z", "content": "Radhika Gupta said that she contemplated suicide at the age of 22.\r\nNew Delhi: Radhika Gupta, the Chief Executive Officer of Edelweiss MF, has shared her inspiring journey from being bullied for her … [+2179 chars]"}]}