{"status": "ok", "totalResults": 352, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "India Tackling Climate Change \"In A Very Direct Way\": PM Modi", "description": "Prime Minister Narendra Modi on Wednesday said that India remains committed to meeting the needs of the poorest and the most vulnerable, by building the next generation infrastructure to realize their aspirations.", "url": "https://www.ndtv.com/india-news/pm-modi-news-india-tackling-climate-change-in-a-very-direct-way-pm-modi-2944160", "urlToImage": "https://c.ndtvimg.com/2022-04/1cvsauj_pm-modi-twitter_625x300_15_April_22.jpg", "publishedAt": "2022-05-04T06:28:32Z", "content": "PM Modi talked about the importance of infrastructure in unleashing the human potential.\r\nNew Delhi: Prime Minister Narendra Modi on Wednesday said that India remains committed to meeting the needs o… [+2938 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "High Court Rejects Activist Varavara Rao's Plea For Default Bail", "description": "The Bombay High Court on Wednesday dismissed a petition filed by Varavara Rao and two other activists, arrested in the Elgar Parishad-Maoist links case, seeking a review of an earlier order of the HC which refused them default bail.", "url": "https://www.ndtv.com/india-news/elgar-parishad-case-high-court-rejects-activist-varavara-raos-plea-for-default-bail-2944127", "urlToImage": "https://c.ndtvimg.com/jfm8k5k_varavara-rao-at-hyd-airport_625x300_30_August_18.jpg", "publishedAt": "2022-05-04T06:21:13Z", "content": "Elgar Parishad Case: Varavara Rao is currently out in medical bail.\r\nMumbai: The Bombay High Court on Wednesday dismissed a petition filed by Varavara Rao and two other activists, arrested in the Elg… [+2093 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Dust Storm Yellow Alert Issued For Delhi, Wind Speed Likely To Be 50 Kmph", "description": "The India Meteorological Department or IMD has issued a yellow alert, warning of a dust storm or thunderstorm with winds gusting up to 50 kilometres per hour in the national capital today.", "url": "https://www.ndtv.com/delhi-news/delhi-weather-today-dust-storm-yellow-alert-issued-for-delhi-wind-speed-likely-to-be-50-kmph-2943975", "urlToImage": "https://c.ndtvimg.com/2022-05/6pdbnn1o_ncr-delhi-dust-storm-generic-istock_625x300_04_May_22.jpg", "publishedAt": "2022-05-04T06:18:38Z", "content": "Delhi Dust Storm: IMD issued a yellow alert, warning of a dust storm in Delhi. (Representational)\r\nNew Delhi: The India Meteorological Department or IMD has issued a yellow alert, warning of a dust s… [+1513 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "NASA Releases Stunning Image Of Solar Flare", "description": "On April 30, American space agency NASA managed to capture an image of a solar flare using its Solar Dynamics Observatory and posted the picture on its Instagram handle.", "url": "https://www.ndtv.com/world-news/nasa-releases-stunning-image-of-solar-flare-2944205", "urlToImage": "https://c.ndtvimg.com/2022-05/sv0r322g_solar-flare_625x300_04_May_22.jpg", "publishedAt": "2022-05-04T06:14:17Z", "content": "One can see the solar flare in the upper right portion of the image\r\nThe Sun since April 19 has released several moderate to strong solar flares. A solar flare is a sudden release of magnetic energy … [+1584 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "\"Back My Decision\": Pandya Explains Surprising Call To Bat First Vs PBKS", "description": "Gujarat Titans, who lead the IPL points table with eight wins from 10 games and are set to reach the play-offs, lost to Punjab by eight wickets on Tuesday.", "url": "https://sports.ndtv.com/ipl-2022/indian-premier-league-back-my-decision-hardik-pandya-explains-reason-behind-surprising-call-to-bat-first-against-punjab-kings-2944204", "urlToImage": "https://c.ndtvimg.com/2022-05/lg50m17g_hardik-pandya-bcciipl_625x300_04_May_22.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-04T06:13:43Z", "content": "The decision to go against the trend and bat first did not pay off but it is something Gujarat Titans needed to do to get out of their comfort zone ahead of the bigger battles that await them in the … [+1649 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Hanuman Chalisa Row: MP-MLA Couple Granted Bail By Mumbai Court", "description": "Hanuman Chalisa row: MP Navneet Rana, her MLA-husband Ravi Rana granted bail by Mumbai court, reports news agency PTI", "url": "https://www.ndtv.com/india-news/hanuman-chalisa-row-mp-navneet-rana-her-mla-husband-ravi-rana-granted-bail-by-mumbai-court-reports-news-agency-pti-2944190", "urlToImage": "https://c.ndtvimg.com/2022-04/u50chvc_rana-couple-arrest_625x300_27_April_22.jpg", "publishedAt": "2022-05-04T06:09:14Z", "content": "Independent MP Navneet Rana and her husband and MLA Ravi Rana, arrested after they declared that they would recite Hanuman Chalisa outside Maharashtra Chief Minister Uddhav Thackeray's home, were gra… [+266 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rain Brings Respite In Odisha's Bhubaneswar After Severe Heat Wave", "description": "The India Meteorological Department has predicted light to moderate rainfall in Bhubaneswar for the next few hours.", "url": "https://www.ndtv.com/bhubaneshwar-news/odisha-weather-odisha-heatwave-odisha-weather-updates-2943794", "urlToImage": "https://c.ndtvimg.com/2022-05/qsa3recg_credit-ani-twitter_625x300_04_May_22.jpg", "publishedAt": "2022-05-04T06:05:58Z", "content": "Odisha Heat Wave: Rainfall in and around Bhubaneshwar is likely to continue Wednesday morning.\r\nBhubaneswar (Odisha): Bhubaneswar, the capital of Odisha, sawrainfall on Tuesday nightand Wednesday eve… [+906 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Key Win For Trump-Backed Republican Ahead Of US Senate Race", "description": "J.D. Vance, a Republican candidate for the US Senate who received Donald Trump's endorsement, has won his party's primary election in Ohio. Once a critique of Trump, Vance became an ardent supporter who tried to emulate his style of populism.", "url": "https://www.ndtv.com/world-news/key-win-for-donald-trump-backed-republican-jd-vance-ahead-of-us-senate-race-2944176", "urlToImage": "https://c.ndtvimg.com/2022-05/uuhrso54_jd-vance-twitter-_625x300_04_May_22.jpg", "publishedAt": "2022-05-04T06:02:51Z", "content": "JD Vance at one point went on to call Trump America's Hitler.\r\nWashington: J.D. Vance, a Republican candidate for the US Senate who had received former president Donald Trump's endorsement, has won h… [+2019 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "In Hijab, What It Means To Be A Woman Rapper In Pakistan", "description": "Pakistan's breakthrough rapper Eva B has racked up millions of views online, but walking through the labyrinthine streets of her Karachi neighbourhood, she is anonymous.", "url": "https://www.ndtv.com/world-news/pakistan-rapper-eva-b-in-hijab-what-it-means-to-be-a-woman-rapper-in-pakistan-2944170", "urlToImage": "https://c.ndtvimg.com/2022-05/rensua88_pakistan-rapper-eva-b-afp_625x300_04_May_22.jpg", "publishedAt": "2022-05-04T06:01:22Z", "content": "A veil falling below her eyes, Pakistan rapper Eva B evades the attention of fans and detractors.\r\nKarachi: Pakistan's breakthrough rapper Eva B has racked up millions of views online, but walking th… [+5092 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Raj Thackeray Shares Bal Thackeray Video, Doubles Down In Loudspeaker Row", "description": "Undeterred despite being booked by the state, Raj Thcakeray on Wednesday shared a video of the Shiv Sena founder Bal Thackeray in which he is seen speaking against the use of loudspeakers and Muslims offering prayers on the roads.", "url": "https://www.ndtv.com/india-news/raj-thackeray-shares-bal-thackeray-video-doubles-down-in-loudspeaker-row-2944153", "urlToImage": "https://c.ndtvimg.com/2022-05/n9klus5o_bal-thackeray-video_650x400_04_May_22.jpg", "publishedAt": "2022-05-04T05:56:05Z", "content": "The MNS chief had given an ultimatum to the state government to remove loudspeakers by May 3.\r\nMumbai: Amid high tension in Mumbai over Maharashtra Navnirman Sena (MNS) chief Raj Thackeray's ultimatu… [+3283 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "People Must Be At The Heart Of Any Infrastructure Growth Story: PM Modi", "description": "Prime Minister Narendra Modi today pitched for resilient infrastructure with the use of modern technology and knowledge, saying this will not only help prevent disaster for the current generation but also for future generations.", "url": "https://www.ndtv.com/india-news/pm-narendra-modi-says-people-must-be-at-the-heart-of-any-infrastructure-growth-story-2944104", "urlToImage": "https://c.ndtvimg.com/2021-10/4sfkrgdo_pm-modi-pti_650x400_22_October_21.jpg", "publishedAt": "2022-05-04T05:53:01Z", "content": "PM Modi spoke at the 4th International Conference on Disaster Resilient Infrastructure. (File)\r\nNew Delhi: Prime Minister Narendra Modi today pitched for resilient infrastructure with the use of mode… [+2403 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Real Madrid v Man City, CL: When, Where To Watch Live Telecast, Streaming", "description": "Champions League: Real Madrid will host Manchester City in the Champions League semi-final 2nd leg match set to be played at the Santiago Bernabeu.", "url": "https://sports.ndtv.com/football/real-madrid-vs-manchester-city-champions-league-semi-final-2nd-leg-when-and-where-to-watch-live-telecast-live-streaming-2944148", "urlToImage": "https://c.ndtvimg.com/2022-05/5vg25r3o_real-madrid_625x300_04_May_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-04T05:52:38Z", "content": "Real Madrid will host Manchester City in the Champions League semi-final 2nd leg match set to be played at the Santiago Bernabeu. Madrid, who recently won the La Liga for the record 35th time, will a… [+1533 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "9 Arrested After 2 Tribals Accused Of Killing Cow Beaten To Death", "description": "Police have arrested nine persons in connection with the death of two tribal men who were allegedly assaulted by a group of people over suspicion of cow slaughter in Madhya Pradesh's Seoni district, an official said on Wednesday.", "url": "https://www.ndtv.com/india-news/madhya-pradesh-9-arrested-after-2-tribals-accused-of-killing-cow-beaten-to-death-2944088", "urlToImage": "https://c.ndtvimg.com/2022-05/12a0ot3_tribals-killed_625x300_03_May_22.jpg", "publishedAt": "2022-05-04T05:52:27Z", "content": "Madhya Pradesh: Two men were beaten to death for allegedly killing a cow in Madhya Pradesh.\r\nBhopal/Seoni: Police have arrested nine persons in connection with the death of two tribal men who were al… [+2884 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "LIC IPO Opens For Subscription, Booked 12% In An Hour", "description": "The initial public offering (IPO) of Life Insurance Corporation of India opened for subscription on Wednesday.", "url": "https://www.ndtv.com/business/lic-ipo-opens-for-subscription-booked-12-in-an-hour-2944134", "urlToImage": "https://c.ndtvimg.com/2022-02/cttm1th8_lic-new_625x300_14_February_22.jpg", "publishedAt": "2022-05-04T05:49:00Z", "content": "LIC IPO, with a price band of Rs 902-949 a share, will conclude on May 9.\r\nNew Delhi: The initial public offering (IPO) of Life Insurance Corporation of India opened for subscription on Wednesday. As… [+1343 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Titan's Shares Tumble By Over 3% After March Quarter Results", "description": "Titan Company's shares tumbled over 3 per cent in morning trade on Wednesday, a day after it reported a 7.21 per cent fall in consolidated net profit", "url": "https://www.ndtv.com/business/titans-shares-tumble-by-over-3-after-march-quarter-results-2944108", "urlToImage": "https://c.ndtvimg.com/2022-02/b9v87uig_jewellery-650_625x300_08_February_22.jpg", "publishedAt": "2022-05-04T05:48:57Z", "content": "Titan Company's shares dipped 3 per cent in early trade today\r\nNew Delhi: Shares of Titan Company Ltd tumbled over 3 per cent in morning trade on Wednesday, a day after the company reported a 7.21 pe… [+899 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Loudspeaker Row LIVE: Raj Thackeray's \"Deadline\" Ends, Mumbai On Alert", "description": "Several mosques in and near Mumbai kept loudspeakers off during azaan this morning following a threat by Raj Thackeray, chief of Maharashtra Navnirman Sena (MNS), to play Hanuman Chalisa on loudspeakers wherever azaan is recited on them.", "url": "https://www.ndtv.com/india-news/loudspeaker-row-live-updates-raj-thackerays-deadline-ends-mumbai-on-alert-2944118", "urlToImage": "https://c.ndtvimg.com/2022-05/681d6r6g_raj-thackeray_625x300_03_May_22.jpg", "publishedAt": "2022-05-04T05:40:25Z", "content": "Louspeaker Row: Maharashtra government has made extensive preparations to maintain law and order.\r\nNew Delhi: Several mosques in and near Mumbai kept loudspeakers off during azaan this morning follow… [+1008 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sponsored: Dynamite: Dhvani Bhanushali Turns Super Girl With Hitz Music's New Single", "description": "Dynamite has been written by Kunwar Juneja and composed by Gourov Dasgupta", "url": "https://www.ndtv.com/entertainment/sponsored-dynamite-dhvani-bhanushali-turns-super-girl-with-hitz-musics-new-single-2944095", "urlToImage": "https://c.ndtvimg.com/2022-05/hd27o5e_dhvani-bhanushali_625x300_04_May_22.jpg", "publishedAt": "2022-05-04T05:27:30Z", "content": "Dhvani Bhanushali in Dynamite (Courtesy: dhvanibhanushali22)\r\nNew Delhi: One of India's popular pop singers, Dhvani Bhanushali, releases her new single Dynamite today on Hitz Music. High on beats dan… [+1949 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Diabetes Diet: 5 Quick And Easy Breakfast Options For Healthy Morning Meals", "description": "Diabetes Diet: To help you draft your breakfast menu, here we have some healthy recipes that you can whip up in no time.", "url": "https://food.ndtv.com/food-drinks/diabetes-diet-5-quick-and-easy-breakfast-options-for-healthy-morning-meals-2944094", "urlToImage": "https://c.ndtvimg.com/2022-05/ps607uv_diabetes-diet_625x300_04_May_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-04T05:27:29Z", "content": "People struggling with diabetes have to be extra careful about their diet. Including foods with low glycaemic index values and excluding the ones with high carbohydrate and sugar level is the foremos… [+3051 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Hero MotoCorp Shares Fall By 2% After March Quarter Results", "description": "Hero MotoCorp shares fell 2 per cent in early trade, a day after its consolidated profit after tax for March quarter fell by 30 per cent", "url": "https://www.ndtv.com/business/hero-motocorp-shares-decline-over-2-pc-post-q4-earnings-2944038", "urlToImage": "https://c.ndtvimg.com/2021-05/qp3k55o_hero-motocorp-logo_625x300_09_May_21.png", "publishedAt": "2022-05-04T05:24:24Z", "content": "Hero MotoCorp's shares fell in early trade today\r\nNew Delhi: Shares of Hero MotoCorp fell over 2 per cent in early trade on Wednesday, a day after the company said its consolidated profit after tax (… [+998 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Kuldeep's Childhood Coach Says India Star Is \"Man Behind\" His Resurgence", "description": "Kuldeep Yadav himself has praised DC coach Ricky Ponting and team captain Rishabh Pant for motivating and showing confidence in him. However, his childhood coach Kapil Dev Pandey has someone else in mind", "url": "https://sports.ndtv.com/ipl-2022/kuldeep-yadavs-childhood-coach-says-this-india-star-is-man-behind-his-resurgence-2944082", "urlToImage": "https://c.ndtvimg.com/2022-05/t9t5mse8_kuldeep-yadav-bcciipl_625x300_04_May_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-04T05:23:06Z", "content": "Kuldeep Yadav is a player reborn. After his travails with Kolkata Knight Riders in the past few seasons of the Indian Premier League, the left-arm spinner is back making life difficult for the batter… [+2235 chars]"}]}