{"status": "ok", "totalResults": 544, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE: India Records 1,581 New Covid Cases In 24 Hours", "description": "India on Tuesday reported a total of 1,581 fresh coronavirus cases in the last 24 hours, taking the COVID-19 tally to 4,30,10,922. According to Union health ministry data, the active cases declined further to 23,913 today.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-23-march-2022-2837642", "urlToImage": "https://c.ndtvimg.com/2021-12/poj0l18_delhi-covid-testing-pti-650_650x400_31_December_21.jpg", "publishedAt": "2022-03-23T00:58:01Z", "content": "India COVID-19 Cases: The weekly positivity rate stood at 0.39 per cent.\r\nNew Delhi: India on Tuesday reported a total of 1,581 fresh coronavirus cases in the last 24 hours, taking the COVID-19 tally… [+486 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Wikileaks Founder Julian Assange To Marry In Prison Today", "description": "WikiLeaks founder Julian Assange will marry his long-term partner Stella Moris inside a high-security prison in southeast London on Wednesday at a small ceremony attended by four guests, two official witnesses and two security guards.", "url": "https://www.ndtv.com/world-news/wikileaks-founder-julian-assange-to-marry-partner-stella-moris-in-london-jail-today-2837635", "urlToImage": "https://c.ndtvimg.com/2022-02/angj81s8_julian-assange_625x300_10_February_22.jpg", "publishedAt": "2022-03-23T00:40:33Z", "content": "The registrar-led ceremony will take place during visiting hours at the prison\r\nLondon: WikiLeaks founder Julian Assange will marry his long-term partner Stella Moris inside a high-security prison in… [+1397 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Thousands of Afghan Girls Return To School As Taliban End Ban", "description": "Tens of thousands of girls were due to return to secondary school across Afghanistan Wednesday, more than seven months after the Taliban seized power and imposed harsh restrictions on the rights of women to be educated.", "url": "https://www.ndtv.com/world-news/afghanistan-thousands-of-afghan-girls-return-to-school-as-taliban-end-ban-2837631", "urlToImage": "https://c.ndtvimg.com/2021-08/a070en6s_herat-afp-650_625x300_18_August_21.jpg", "publishedAt": "2022-03-23T00:18:21Z", "content": "Country's education ministry said that schools in Kandahar will not open until next month.\r\nKabul: Tens of thousands of girls were due to return to secondary school across Afghanistan Wednesday, more… [+3161 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Jeff Bezos' Ex-Wife MacKenzie Is Donating Millions After \"Giving\" Pledge", "description": "American philanthropist MacKenzie Scott, the former wife of Amazon founder Jeff Bezos, has donated $436 million to Habitat for Humanity and dozens of its US affiliates, the homebuilding non-governmental organization said Tuesday.", "url": "https://www.ndtv.com/world-news/jeff-bezos-ex-wife-mackenzie-scott-is-donating-436-million-to-habitat-for-humanity-2837622", "urlToImage": "https://c.ndtvimg.com/2020-07/p9r7hv0g_mackenzie-scott-afp-650_625x300_29_July_20.jpg", "publishedAt": "2022-03-22T23:56:18Z", "content": "Scott had a net worth of about $49 billion as of 22 March 2022, according to a Forbes wealth index.\r\nSan Francisco: American philanthropist MacKenzie Scott, the former wife of Amazon founder Jeff Bez… [+2127 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "4 Killed In Knife Attack In Israel, Suspect Shot Dead: Police", "description": "A man wielding a knife stabbed several people and ran over another in southern Israel on Tuesday, killing four, in one of the deadliest attacks in the country in recent years.", "url": "https://www.ndtv.com/world-news/4-killed-in-knife-attack-in-israel-suspect-shot-dead-police-2837607", "urlToImage": "https://i.ndtvimg.com/i/2018-03/police-generic-international-afp_650x400_41520126059.jpg", "publishedAt": "2022-03-22T23:15:28Z", "content": "Israel Knife Attack: Police have not officially identified the suspect. (Representational)\r\nBeersheba, Israel: A man wielding a knife stabbed several people and ran over another in southern Israel on… [+4338 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine's Zelensky Says Peace Talks With Russia Tough, Confrontational", "description": "Ukrainian President Volodymyr Zelenskiy on Wednesday said peace talks with Russia to end the war were tough and sometimes confrontational but added \"step by step we are moving forward.\"", "url": "https://www.ndtv.com/world-news/ukraine-president-volodymyr-zelenskiy-says-peace-talks-with-russia-tough-confrontational-2837604", "urlToImage": "https://c.ndtvimg.com/2022-03/2d6ul6ck_ukraine-zelensky-afp_625x300_12_March_22.jpg", "publishedAt": "2022-03-22T22:46:26Z", "content": "Zelensky, however, said that \"step by step we are moving forward.\"\r\nKyiv:  Ukrainian President Volodymyr Zelenskiy on Wednesday said peace talks with Russia to end the war were tough and sometimes co… [+346 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Politically Motivated\": EU Slams Kremlin Critic Navalny's New Sentence", "description": "The European Union on Tuesday slammed as \"politically motivated\" a Russian court ruling extending Kremlin critic Alexei Navalny's imprisonment by nine more years.", "url": "https://www.ndtv.com/world-news/eu-slams-kremlin-critic-alexei-navalnys-new-sentence-2837599", "urlToImage": "https://i.ndtvimg.com/i/2015-05/alexei-navalny-reuters-650_650x400_71431557334.jpg", "publishedAt": "2022-03-22T22:34:11Z", "content": "EU said that it strongly condemns the ruling of Alexei Navalny.\r\nBrussels: The European Union on Tuesday slammed as \"politically motivated\" a Russian court ruling extending Kremlin critic Alexei Nava… [+786 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Pakistan PM Imran Khan Gets 2nd Notice For Violating Poll Code", "description": "Pakistan top poll body issued a second notice to PM Imran Khan over violation of the election code of conduct and asked him to submit a reply over gathering ahead of the second phase of local government (LG) polls in the Khyber Pakhtunkhwa (KP).", "url": "https://www.ndtv.com/world-news/pakistan-election-body-issues-second-notice-to-imran-khan-for-violating-poll-code-2837595", "urlToImage": "https://c.ndtvimg.com/2021-08/1d0pnkug_imran-khan_625x300_20_August_21.jpg", "publishedAt": "2022-03-22T22:22:23Z", "content": "This is the second such notice been issued to Imran Khan as earlier on Monday.\r\nIslamabad: The Election Commission of Pakistan (ECP) has issued a second notice to Prime Minister Imran Khan over viola… [+2386 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Novavax's Covid Vaccine Gets Emergency Use Nod For Kids In India", "description": "Novavax Inc said on Tuesday its COVID-19 vaccine has got emergency-use authorization from the Drugs Controller General of India for children aged 12 to 17 years.", "url": "https://www.ndtv.com/india-news/novavaxs-covid-vaccine-gets-emergency-use-nod-for-kids-aged-12-17-in-india-2837586", "urlToImage": "https://c.ndtvimg.com/2021-06/bcbk91d_novavax-covovax-reuters_625x300_17_June_21.jpg", "publishedAt": "2022-03-22T22:00:17Z", "content": "Covovax is the 4th COVID-19 vaccine to be authorised for adolescents aged 12 years and older in India.\r\nNew Delhi: Novavax Inc said on Tuesday its COVID-19 vaccine has got emergency-use authorization… [+1138 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Condemns Putin Critic Alexei Navalny's \"Sham Trial\"", "description": "The United States on Tuesday condemned a Russian court verdict that found jailed Kremlin critic Alexei Navalny guilty of additional charges, saying it was an attempt to silence him and distract from the invasion of Ukraine.", "url": "https://www.ndtv.com/world-news/us-condemns-russia-president-vladimir-putin-critic-alexei-navalnys-sham-trial-2837580", "urlToImage": "https://c.ndtvimg.com/2020-08/n2htsgmg_alexei-navalny-reuters_625x300_20_August_20.jpg", "publishedAt": "2022-03-22T21:37:45Z", "content": "A Russia on Tuesday court sentenced Kremlin Critic Alexei Navalny to 9 years in jail.\r\nWashington: The United States on Tuesday condemned a Russian court verdict that found jailed Kremlin critic Alex… [+587 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Biden Europe Trip Targets Western Unity, New Sanctions Against Russia", "description": "President Joe Biden is seeking to reinforce Western unity at a series of summits in Europe this week where new sanctions will be announced against Russia over its war in Ukraine, a top US official said Tuesday.", "url": "https://www.ndtv.com/world-news/us-president-joe-biden-europe-trip-targets-western-unity-new-sanctions-against-russia-2837569", "urlToImage": "https://c.ndtvimg.com/2021-11/hpp546qo_joe-biden-reuters_625x300_05_November_21.jpg", "publishedAt": "2022-03-22T21:08:36Z", "content": "Biden will also consult on question of China's potential participation in conflict of Ukraine.\r\nWashington: President Joe Biden is seeking to reinforce Western unity at a series of summits in Europe … [+3161 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine's Zelensky To Address NATO Virtually Tomorrow", "description": "Ukrainian President Volodymyr Zelensky has been invited to address a special NATO summit Thursday discussing the Russian invasion of his country, an official said.", "url": "https://www.ndtv.com/world-news/ukraine-president-volodymyr-zelensky-to-address-nato-virtually-tomorrow-2837543", "urlToImage": "https://c.ndtvimg.com/2022-02/lhhjo9b_ukraine-president-volodymyr-zelensky-afp-650_625x300_24_February_22.jpg", "publishedAt": "2022-03-22T20:29:18Z", "content": "Ukrainian President will address the NATO over Russian offensive in Ukraine.\r\nBrussels: Ukrainian President Volodymyr Zelensky has been invited to address a special NATO summit Thursday discussing th… [+447 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Says Iran Has \"Hard Decisions\" On Finalizing 2015 Nuclear Deal", "description": "The United States said Tuesday it is now up to Iran to make hard decisions in order to restore the 2015 deal on limiting its nuclear program in exchange for lifting sanctions.", "url": "https://www.ndtv.com/world-news/us-says-iran-has-hard-decisions-on-finalizing-2015-nuclear-deal-2837537", "urlToImage": "https://c.ndtvimg.com/2019-05/6c7epapg_iran-flag-reuters-650_625x300_20_May_19.jpg", "publishedAt": "2022-03-22T20:10:48Z", "content": "\"Onus is on Tehran to make decisions that it might consider difficult,\" US official said.\r\nWashington: The United States said Tuesday it is now up to Iran to make hard decisions in order to restore t… [+933 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Russia Would Only Use Nuclear Weapons If...\": Kremlin", "description": "Kremlin spokesman Dmitry Peskov on Tuesday said Russia would only use nuclear weapons if its very existence were threatened, Tass news agency reported.", "url": "https://www.ndtv.com/world-news/russia-would-only-use-nuclear-weapons-if-its-existence-were-threatened-says-kremlin-2837522", "urlToImage": "https://cdn.ndtv.com/static/images/ndtv_default_image_500x500.jpg", "publishedAt": "2022-03-22T19:42:20Z", "content": "Moscow: Kremlin spokesman Dmitry Peskov on Tuesday said Russia would only use nuclear weapons if its very existence were threatened, Tass news agency reported.\r\nThe comment, nearly four weeks after R… [+739 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Putin Dials France's Macron Over Russia-Ukraine Peace Talks", "description": "Russian President Vladimir Putin held a phone call with French President Emmanuel Macron on Tuesday and discussed peace talks between Russia and Ukraine, Interfax news agency said.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-vladimir-putin-dials-frances-emmanuel-macron-over-russia-ukraine-peace-talks-2837512", "urlToImage": "https://i.ndtvimg.com/i/2017-05/macron-putin-reuters_650x400_81496121260.jpg", "publishedAt": "2022-03-22T19:19:24Z", "content": "Both the leaders have discussed over peace talks between Russia and Ukraine.\r\nMoscow: Russian President Vladimir Putin held a phone call with French President Emmanuel Macron on Tuesday and discussed… [+225 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rockets Destroy Rail Station, Kill 1 In Ukraine's Dnipro Region", "description": "Rocket strikes destroyed a railway station in Ukraine's central-eastern Dnipro region on Tuesday, killing one person and damaging rails enough to prevent train passage indefinitely, Governor Valentyn Reznichenko said.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-russian-rockets-destroy-train-station-in-ukraine-central-eastern-dnipro-1-killed-2837498", "urlToImage": "https://c.ndtvimg.com/2022-03/dg3s9vjo_ukraine-war_625x300_21_March_22.jpg", "publishedAt": "2022-03-22T19:00:38Z", "content": "At least one person killed in Russian missile strike in the town of Pavlohrad, Dnipro region.\r\nKyiv: Rocket strikes destroyed a railway station in Ukraine's central-eastern Dnipro region on Tuesday, … [+345 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Wembley To Host \"Finalissima\" Between Italy And Argentina", "description": "Wembley will host the 'Finalissima' clash between European champions Italy and Copa America winners Argentina on June 1, UEFA announced on Tuesday", "url": "https://sports.ndtv.com/football/wembley-to-host-finalissima-between-italy-and-argentina-2837489", "urlToImage": "https://c.ndtvimg.com/2020-07/er93m92k_wembley-afp_625x300_11_July_20.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-03-22T18:44:32Z", "content": "Wembley will host the 'Finalissima' clash between European champions Italy and Copa America winners Argentina on June 1, UEFA announced on Tuesday. The glamour tie will take Italy back to the scene o… [+1599 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Centre Asks For Report, BJP To Send Team To Bengal After 8 Die: 10 Facts", "description": "The Centre has sought a report on the alleged political violence in Bengal's Birbhum in which eight people died. The BJP is also sending a fact-finding team to probe the biggest instance of violence since Mamata Banerjee's mega victory last year.", "url": "https://www.ndtv.com/india-news/union-home-ministry-seeks-report-on-bengal-violence-10-points-2837461", "urlToImage": "https://c.ndtvimg.com/2022-03/5250f4go_bengal-village-fire-twitter-ani_625x300_22_March_22.jpg", "publishedAt": "2022-03-22T18:21:28Z", "content": "<li>A mob allegedly threw bombs in Bogtui village on the outskirts of Rampurhat town close to dawn on Tuesday, in which 10 houses were burnt. It is suspected to be a retaliation to the murder of a Tr… [+2343 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Pilots On Crashed China Plane Didn't Answer Calls As Jet Dove: Report", "description": "Pilots of the doomed China Eastern Flight 5735 failed to respond to multiple calls from Chinese air-traffic controllers after tipping into a deadly nosedive, authorities said at a press conference on Tuesday, Bloomberg News reported.", "url": "https://www.ndtv.com/india-news/pilots-on-crashed-china-plane-didnt-answer-calls-as-jet-dove-report-2837442", "urlToImage": "https://c.ndtvimg.com/2022-03/4oiqgi7_china-plane-crash-nosedive-circled-650_625x300_21_March_22.jpg", "publishedAt": "2022-03-22T18:05:03Z", "content": "The jet speared into a hillside near Wuzhou in the Guangxi region.\r\nPilots of the doomed China Eastern Flight 5735 failed to respond to multiple calls from Chinese air-traffic controllers after tippi… [+1862 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Watch: Musk Breaks Into Dance As He Hands Over 'Made In Germany' Teslas", "description": "Tesla CEO Elon Musk danced for joy at the inauguration of his \"gigafactory\" electric car plant near Berlin on Tuesday, shrugging off two years of bureaucracy and delays to watch customers drive off with the first Model Y vehicles made in Europe.", "url": "https://www.ndtv.com/world-news/elon-musk-breaks-into-dance-as-he-hands-over-made-in-germany-teslas-2837430", "urlToImage": "https://c.ndtvimg.com/2022-03/ssj5c028_elon-musk-reuters_625x300_22_March_22.jpg", "publishedAt": "2022-03-22T17:57:20Z", "content": "Elon Musk attends the opening ceremony of the new Tesla Gigafactory for electric cars\r\nBerlin: Tesla CEO Elon Musk danced for joy at the inauguration of his \"gigafactory\" electric car plant near Berl… [+4022 chars]"}]}