{"status": "ok", "totalResults": 398, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "North Korea Congratulates China On Olympics With A Jibe At US", "description": "North Korea's Kim Jong Un vowed to strengthen cooperation with China and together \"crush\" threats and hostile policies from the United States and its allies, state media reported on Tuesday.", "url": "https://www.ndtv.com/world-news/north-korea-president-kim-jong-un-congratulates-china-on-olympics-with-a-jibe-at-us-2781582", "urlToImage": "https://c.ndtvimg.com/2021-10/m1dr7m1c_kim-jong-un_625x300_12_October_21.jpg", "publishedAt": "2022-02-22T01:45:07Z", "content": "Beijing Winter Olympics 2022 was conducted amid the global health crisis in China.\r\nSeoul: North Korea's Kim Jong Un vowed to strengthen cooperation with China and together \"crush\" threats and hostil… [+372 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE: India Records Over 16,000 New COVID-19 Cases", "description": "India on Monday reported 16,051 new COVID-19 cases and 206 fatalities. According to Ministry of Health and Family Welfare, there are 2,02,131 active cases in the country while the recovery stands at 98.33 per cent.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-22-february-2022-2781566", "urlToImage": "https://c.ndtvimg.com/2022-01/fdhokfoo_-bengaluru-covid-testing-pti-650_650x400_03_January_22.jpg", "publishedAt": "2022-02-22T00:34:48Z", "content": "Covid cases in India: Currently, there are 2,02,131 active cases in the country.\r\nNew Delhi: India on Monday reported 16,051 new COVID-19 cases and 206 fatalities. According to Ministry of Health and… [+632 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "France's Macron Says Putin \"Broke\" His Commitment On Ukraine", "description": "France described an address to the nation by Russian President Vladimir Putin on Ukraine as \"paranoid\" on Monday, accusing him of breaking promises made to his French counterpart Emmanuel Macron.", "url": "https://www.ndtv.com/world-news/frances-emmanuel-macron-says-russian-president-vladimir-putin-broke-his-commitment-on-ukraine-2781559", "urlToImage": "https://c.ndtvimg.com/2022-02/nggk48b_putin-macron-meet-over-russia-ukraine-conflict_625x300_07_February_22.jpeg", "publishedAt": "2022-02-22T00:20:04Z", "content": "Earlier, Macron condemned Putin's move and called for targeted European sanctions against Russia.\r\nParis: France described an address to the nation by Russian President Vladimir Putin on Ukraine as \"… [+1321 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US, Allies Call For Emergency UN Meeting On Ukraine Today", "description": "The United States and allies including France have requested an emergency meeting of the UN Security Council later Monday on Russia's recognition of separatist territories in Ukraine as independent, diplomats told AFP.", "url": "https://www.ndtv.com/world-news/us-allies-call-for-emergency-un-meeting-on-ukraine-today-2781549", "urlToImage": "https://i.ndtvimg.com/i/2016-02/un-security-council_650x400_71456453064.jpg", "publishedAt": "2022-02-21T23:48:34Z", "content": "The move comes after Putin signed a decree to recognise breakaway regions of Ukraine as independent.\r\nUnited Nations: The United States and allies including France have requested an emergency meeting… [+1369 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Putin Orders Army To \"Maintain Peace\" In Ukraine's Pro-Russian Regions", "description": "President Vladimir Putin on Monday ordered Russia's military to act as peacekeepers in two breakaway regions of Ukraine, just hours after he recognised them as independent.", "url": "https://www.ndtv.com/world-news/vladimir-putin-orders-army-to-maintain-peace-in-ukraines-pro-russian-regions-2781541", "urlToImage": "https://c.ndtvimg.com/2021-12/d9gktnk8_vladimir-putin-afp-650_625x300_12_December_21.jpg", "publishedAt": "2022-02-21T23:02:06Z", "content": "Putin recognised the Donetsk and Lugansk separatist republics on Monday.\r\nMoscow: President Vladimir Putin on Monday ordered Russia's military to act as peacekeepers in two breakaway regions of Ukrai… [+1292 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "France's Macron Calls For \"Targeted European Sanctions\" Against Russia", "description": "French President Emmanuel Macron on Monday condemned the Kremlin's move to recognise two eastern Ukrainian separatist regions as independent, urging the European Union to agree new sanctions against Moscow.", "url": "https://www.ndtv.com/world-news/frances-emmanuel-macron-call-for-targeted-european-sanctions-against-russia-2781534", "urlToImage": "https://c.ndtvimg.com/2021-10/9dstda2k_macron_625x300_09_October_21.jpg", "publishedAt": "2022-02-21T22:44:42Z", "content": "Macron reacted after Putin recognised the independence of the two separatist regions in eastern Ukraine.\r\nParis: French President Emmanuel Macron on Monday condemned the Kremlin's move to recognise t… [+1858 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UN Expresses Concern Over Russian Move To Recognise Ukraine Rebel Regions", "description": "UN Secretary-General Antonio Guterres condemned Russia's move to recognize two eastern Ukrainian separatist regions as independent Monday as a \"violation\" of Kyiv's sovereignty.", "url": "https://www.ndtv.com/world-news/un-expresses-concern-over-russian-move-to-recognise-ukraine-rebel-regions-2781531", "urlToImage": "https://c.ndtvimg.com/2021-08/b5204l5o_antonio-guterresunchiefafp_625x300_16_August_21.jpg", "publishedAt": "2022-02-21T22:18:26Z", "content": "Earlier, the UN urged all parties to refrain from taking \"unilateral action\" on Ukraine crisis.\r\nUnited Nations: UN Secretary-General Antonio Guterres condemned Russia's move to recognize two eastern… [+2446 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "NATO Condemns Russia's Recognition Of Ukraine Separatists", "description": "NATO chief Jens Stoltenberg on Monday condemned Russian President Vladimir Putin's recognition of rebel-held areas in east Ukraine, saying it violated international agreements Moscow had signed.", "url": "https://www.ndtv.com/world-news/nato-condemns-russias-recognition-of-ukraine-separatists-2781525", "urlToImage": "https://c.ndtvimg.com/2022-02/jqr4ql1g_russian-tanks-in-ukraine-650_625x300_16_February_22.jpg", "publishedAt": "2022-02-21T21:46:45Z", "content": "Russia's move will further undermines Ukraine's sovereignty and territorial integrity, said NATO.\r\nBrussels: NATO chief Jens Stoltenberg on Monday condemned Russian President Vladimir Putin's recogni… [+1267 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Breaking All Its Promises To World On Ukraine\": Germany Slams Russia", "description": "Russia is reneging on its engagements to the global community through its recognition of rebel-held areas in east Ukraine as independent, German Foreign Minister Annalena Baerbock said Monday.", "url": "https://www.ndtv.com/world-news/breaking-all-its-promises-to-world-on-ukraine-germany-slams-russia-2781518", "urlToImage": "https://c.ndtvimg.com/2022-02/q48jgi3o_ukraine-russia-reuters_625x300_20_February_22.jpg", "publishedAt": "2022-02-21T21:23:45Z", "content": "Germany reacted after Putin signed decree on independence of separatist Ukraine regions on Monday.\r\nBerlin: Russia is reneging on its engagements to the global community through its recognition of re… [+399 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Joe Biden Announces Sanctions On Pro-Russian Regions In Ukraine", "description": "The United States on Monday announced sanctions against rebel territories recognized by Russia in eastern Ukraine and warned that more were ready if necessary.", "url": "https://www.ndtv.com/world-news/us-president-joe-biden-announces-sanctions-on-pro-russian-regions-in-ukraine-2781510", "urlToImage": "https://c.ndtvimg.com/2021-03/gd3pq88_joe-biden-afp_650x400_12_March_21.jpg", "publishedAt": "2022-02-21T20:59:03Z", "content": "Biden plans to impose sanctions on trade and financing in two Russian-backed regions in Ukraine.\r\nWashington: The United States on Monday announced financial sanctions against rebel territories fresh… [+3241 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Putin's Recognition Of Ukraine Separatist Areas Breaches Sovereignty: UK", "description": "The apparent recognition of breakaway regions of eastern Ukraine by Russian President Vladimir Putin is a breach of international law, British Prime Minister Boris Johnson said on Monday.", "url": "https://www.ndtv.com/world-news/vladimir-putins-recognition-of-ukraine-separatist-areas-breaches-sovereignty-uk-pm-boris-johnson-2781469", "urlToImage": "https://c.ndtvimg.com/2021-11/aqvbn0e4_boris-johnson-reuters_625x300_01_November_21.jpg", "publishedAt": "2022-02-21T20:16:29Z", "content": "Vladimir Putin announced that Russia is recognising the breakaway republics of Donetsk and Lugansk.\r\nLondon: British Prime Minister Boris Johnson on Monday slammed Russia's recognition of separatist … [+1897 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Timeline: Ukraine's Turbulent History Post Independence In 1991", "description": "Russia has massed troops near Ukraine and the West has threatened economic sanctions if it launches an invasion. Moscow denies planning an invasion but has demanded sweeping Western security guarantees in a tense standoff.", "url": "https://www.ndtv.com/world-news/timeline-ukraines-turbulent-history-post-independence-in-1991-2781457", "urlToImage": "https://c.ndtvimg.com/2022-02/50a72jjg_ukraine-citizens_625x300_20_February_22.jpg", "publishedAt": "2022-02-21T19:47:16Z", "content": "In 2008, NATO promises Ukraine it will one day join the alliance.\r\nMoscow:  Russia has massed troops near Ukraine and the West has threatened economic sanctions if it launches an invasion. Moscow den… [+6588 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia's Putin Recognises Separatist Areas In Ukraine As Independent", "description": "Putin, in a televised address, demanded that \"Ukraine stop hostilities or they will be responsible\".", "url": "https://www.ndtv.com/world-news/russias-putin-recognises-separatist-areas-in-ukraine-as-independent-2781451", "urlToImage": "https://c.ndtvimg.com/2022-02/ucs5jcp8_vladimir-putin-650-afp_650x400_22_February_22.jpg", "publishedAt": "2022-02-21T19:37:04Z", "content": "Putin recognises independence of pro-Russian separatists in Ukraine\r\nRussian President Vladimir Putin has recognised separatist areas in Ukraine as independent, a move that could set off a potentiall… [+1628 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "What Will Russian Recognition Of Breakaway Ukraine Regions Mean?", "description": "Russian President Vladimir Putin told the French and German leaders on Monday that he planned to sign a decree recognising two breakaway regions in eastern Ukraine as independent.", "url": "https://www.ndtv.com/world-news/explainer-what-will-russian-recognition-of-breakaway-ukraine-regions-mean-2781442", "urlToImage": "https://c.ndtvimg.com/2022-02/s5iv9adk_donetsk-russia-afp_625x300_21_February_22.jpg", "publishedAt": "2022-02-21T19:20:51Z", "content": "For the first time, Russia is saying it does not regard the Donbass as part of Ukraine.\r\nMoscow: Russian President Vladimir Putin told the French and German leaders on Monday that he planned to sign … [+3711 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Karnataka Student Alleges Brother Attacked, Links Violence To Hijab Row", "description": "Hazra Shifa, a student from Karnataka's Udupi and one of the petitioners in the hijab ban case, has alleged that her brother was attacked by a mob of right-wing supporters, linking the violence to her decision to continue to wear a hijab.", "url": "https://www.ndtv.com/india-news/karnataka-student-alleges-brother-attacked-links-violence-to-hijab-row-2781440", "urlToImage": "https://c.ndtvimg.com/2022-02/npgcope8_brother-650_625x300_22_February_22.jpg", "publishedAt": "2022-02-21T19:18:02Z", "content": "The Karnataka High Court has imposed a temporary ban on the wearing of all religious symbols in schools\r\nBengaluru: Hazra Shifa, a student from Karnataka's Udupi and one of the petitioners in the hij… [+1745 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Australia Reopens Borders For Fully-Vaccinated Indian Travellers", "description": "Tourism Australia on Monday said the country has opened its borders for all categories of fully-vaccinated Indian travellers for quarantine-free travel.", "url": "https://www.ndtv.com/india-news/australia-reopens-borders-for-fully-vaccinated-indian-travellers-2781401", "urlToImage": "https://c.ndtvimg.com/2019-05/soicn89g_airport-generic_625x300_10_May_19.jpg", "publishedAt": "2022-02-21T18:27:32Z", "content": "We are excited to be welcoming back international visitors, said Australia. (Representational)\r\nMumbai: Tourism Australia on Monday said the country has opened its borders for all categories of fully… [+2420 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "PM Should Keep \"Ghaziabad Poet\" To Identify Terrorists: Arvind Kejriwal", "description": "Delhi Chief Minister Arvind Kejriwal hit back at the Prime Minister Narendra Modi today over his endorsement of aide-turned-critic Kumar Vishwas's comments, saying PM Modi should appoint him as a one-man force against terrorists.", "url": "https://www.ndtv.com/india-news/pm-should-keep-ghaziabad-poet-to-identify-terrorists-arvind-kejriwal-2781398", "urlToImage": "https://c.ndtvimg.com/2022-02/hrl6go48_arvind-kejriwal-up-650_625x300_21_February_22.jpg", "publishedAt": "2022-02-21T18:23:38Z", "content": "Arvind Kejriwal today said he is a \"terrorist who scares the corrupt\".\r\nLucknow: Delhi Chief Minister Arvind Kejriwal hit back at the Prime Minister Narendra Modi today over his endorsement of aide-t… [+2830 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Putin To Recognise Ukraine Rebel Territories As Independent Soon", "description": "Russian President Vladimir Putin will recognise the independence of eastern Ukraine's separatist republics, the Kremlin said in a statement Monday, adding that he had informed the French and German leaders of his decision.", "url": "https://www.ndtv.com/world-news/ukraine-crisis-putin-to-recognise-ukraine-rebel-territories-as-independent-soon-2781387", "urlToImage": "https://c.ndtvimg.com/2022-02/fjklc3m8_putin-ukraine_650x400_21_February_22.jpg", "publishedAt": "2022-02-21T18:18:23Z", "content": "\"In the near future, the president plans to sign the order,\" the Kremlin said.\r\nMoscow: Russian President Vladimir Putin will recognise the independence of eastern Ukraine's separatist republics, the… [+1455 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Edited by Debanish Achom (with inputs from Agencies)", "title": "Ukraine Crisis Live Update: Russia To Recognise Ukraine Separatist Areas", "description": "Russian President Vladimir Putin said Monday he would decide by the end of the day whether to recognise two rebel regions of Ukraine as independent, a move that could set off a potentially catastrophic conflict with Kyiv's Western-backed government.", "url": "https://www.ndtv.com/world-news/ukraine-crisis-live-updates-russias-vladimir-putin-to-recognise-ukraine-separatist-areas-as-independent-nations-2781385", "urlToImage": "https://c.ndtvimg.com/2022-02/fhc8kvmo_putin-afp_625x300_22_February_22.jpg", "publishedAt": "2022-02-21T18:15:11Z", "content": "Ukraine crisis: Vladimir Putin met with his government's leaders amid the Ukraine crisis\r\nNew Delhi: Russian President Vladimir Putin will recognise the independence of eastern Ukraine's separatist r… [+4538 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Ajax Agree 7.85 Million Euros Compensation For Abdelhak Nouri", "description": "Ajax said on Monday they will pay 7.85 million euros ($8.91 million) to the family of former player Abdelhak Nouri, who suffered brain damage after a cardiac arrest during a friendly match more than four years ago", "url": "https://sports.ndtv.com/football/ajax-agree-7-85-million-euros-compensation-for-abdelhak-nouri-2781384", "urlToImage": "https://c.ndtvimg.com/2022-02/dfnhi74g_abdelhak-nouri-twitter_625x300_21_February_22.jpg", "publishedAt": "2022-02-21T18:14:36Z", "content": "Ajax said on Monday they will pay 7.85 million euros ($8.91 million) to the family of former player Abdelhak Nouri, who suffered brain damage after a cardiac arrest during a friendly match more than … [+1450 chars]"}]}