{"status": "ok", "totalResults": 581, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Trooper Dead, 4 Injured In Major Encounter In Jammu Ahead Of PM's Visit", "description": "The presence of terrorists near a vital military installation in Jammu is a major security concern ahead of PM Modi's first political visit to the former state since August 2019.", "url": "https://www.ndtv.com/india-news/trooper-dead-4-injured-in-major-encounter-in-jammu-ahead-of-pms-visit-2909262", "urlToImage": "https://c.ndtvimg.com/2022-04/rlr5eou_jammu-sunjwan-terrorist-attack-ndtv_625x300_22_April_22.jpg", "publishedAt": "2022-04-22T01:35:38Z", "content": "Terrorists struck near the Sunjwan cantonment area in Jammu city.\r\nSrinagar: A fierce gun battle has erupted between security forces and terrorists near an army installation in Jammu, two days ahead … [+2205 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Newsdesk", "title": "Coronavirus LIVE: India Reports 2,380 New Covid Cases In 24 Hours", "description": "India on Thursday recorded at least 2,380 new COVID-19 cases, bringing the total number of coronavirus infections to 4,30,49,974. According to the Union Health Ministry data, country's active cases increased to 13,433.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-april-22-2909239", "urlToImage": "https://c.ndtvimg.com/2021-11/iulm91gs_covid-testing_625x300_11_November_21.jpg", "publishedAt": "2022-04-22T00:56:42Z", "content": "India COVID-19 LIVE: The weekly positivity rate as 0.43 per cent, according to the ministry.\r\nNew Delhi: India on Thursday recorded at least 2,380 new COVID-19 cases, bringing the total number of cor… [+749 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ex-Honduran President Extradited To US To Face Drug Charges", "description": "Former Honduran president Juan Orlando Hernandez was extradited to the United States Thursday to stand trial for allegedly aiding the smuggling of hundreds of tons of cocaine to America and receiving millions of dollars in bribes.", "url": "https://www.ndtv.com/world-news/ex-honduran-president-juan-orlando-hernandez-extradited-to-us-to-face-drug-charges-2909228", "urlToImage": "https://i.ndtvimg.com/i/2015-06/juan-orlando-hernandez_650x400_81434577361.jpg", "publishedAt": "2022-04-22T00:24:45Z", "content": "US Attorney General said that Hernandez abused his position as President of Honduras. (File)\r\nNew York: Former Honduran president Juan Orlando Hernandez was extradited to the United States Thursday t… [+3788 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Canada \"Very Supportive\" Of Sweden, Finland Joining NATO: Justin Trudeau", "description": "Canada would support including Sweden and Finland in the NATO military alliance, Prime Minister Justin Trudeau said on Thursday, after Russia's invasion of Ukraine has prompted both countries to consider joining.", "url": "https://www.ndtv.com/world-news/canada-very-supportive-of-sweden-finland-joining-nato-justin-trudeau-2909225", "urlToImage": "https://c.ndtvimg.com/2021-11/8kr7u6is_justin-trudeau-reuters_625x300_16_November_21.jpg", "publishedAt": "2022-04-22T00:10:42Z", "content": "Russia has already warned Sweden and Finland against joining NATO.\r\nOttawa: Canada would support including Sweden and Finland in the NATO military alliance, Prime Minister Justin Trudeau said on Thur… [+445 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Announces $500 Million Economic Aid package For Ukraine", "description": "The United States will provide Ukraine with a new $500 million infusion of aid to help the government in Kyiv continue paying salaries, pensions and providing services, Treasury Secretary Janet Yellen said Thursday.", "url": "https://www.ndtv.com/world-news/us-announces-500-million-economic-aid-package-for-ukraine-2909216", "urlToImage": "https://c.ndtvimg.com/2022-03/97mfb244_joe-biden-afp_625x300_31_March_22.jpg", "publishedAt": "2022-04-21T23:51:08Z", "content": "Earlier, the US had announced $800 million more military aid package for Ukraine.\r\nWashington: The United States will provide Ukraine with a new $500 million infusion of aid to help the government in… [+2284 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UK PM Boris Johnson To Offer India Help To Build Its Own Fighter Jets", "description": "Britain is set to offer India know-how to build its own fighter jets and a licence for faster deliveries of defence equipment when the prime ministers of the two countries meet on Friday, as the West tries to wean India away from Russia.", "url": "https://www.ndtv.com/india-news/uk-pm-boris-johnson-to-offer-india-help-to-build-its-own-fighter-jets-2909195", "urlToImage": "https://c.ndtvimg.com/2022-04/n96djq8k_boris-johnson-gujarat-ani_625x300_21_April_22.jpg", "publishedAt": "2022-04-21T23:16:46Z", "content": "It said that Boris Johnson expected to discuss support for new Indian-designed and built fighter jets.\r\nNew Delhi: Britain is set to offer India know-how to build its own fighter jets and a licence f… [+2022 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "WHO \"Strongly Recommends\" Pfizer's Antiviral Covid pill", "description": "The World Health Organization said Friday it \"strongly recommended\" Pfizer's Covid-19 antiviral pill Paxlovid for patients with milder forms of the disease who were still at a high risk of hospitalisation.", "url": "https://www.ndtv.com/world-news/who-strongly-recommends-pfizers-antiviral-covid-pill-2909190", "urlToImage": "https://c.ndtvimg.com/2021-12/4luj96r_pfizer-covid-pill-afp_625x300_22_December_21.jpg", "publishedAt": "2022-04-21T22:57:26Z", "content": "WHO said that the Pfizer's Covid pill can only be administered while the disease is at its early stages.\r\nGeneva: The World Health Organization said Friday it \"strongly recommended\" Pfizer's Covid-19… [+3737 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Imran Khan Seeks Intervention Of Military Establishment For Early Polls", "description": "Pakistan's former prime minister Imran Khan has sought intervention of the military establishment to ensure early elections otherwise he said his supporters will throw out the \"imported government\" after reaching the capital.", "url": "https://www.ndtv.com/world-news/former-pakistan-pm-imran-khan-seeks-intervention-of-military-establishment-for-early-polls-2909185", "urlToImage": "https://c.ndtvimg.com/2022-04/tjmcctcg_imran-khan-reuters_625x300_10_April_22.jpg", "publishedAt": "2022-04-21T22:45:21Z", "content": "Imran Khan also praised India's foreign policy at a public rally in Lahore on Thursday.\r\nIslamabad: Pakistan's former prime minister Imran Khan has sought intervention of the military establishment t… [+2843 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Delhi Government Offers Free Covid Booster Dose For 18-59 Age Group", "description": "Delhi government on Thursday announced that the precautionary or the booster COVID-19 dose will be available for free to all eligible beneficiaries aged between 18 and 59 years in all government vaccination centres.", "url": "https://www.ndtv.com/india-news/delhi-government-offers-free-covid-booster-dose-for-18-to-59-age-group-2909176", "urlToImage": "https://c.ndtvimg.com/2021-04/sifh8u34_covid-vaccine-india-coronavirus-vaccine-india-pti-photo_625x300_07_April_21.jpg", "publishedAt": "2022-04-21T22:10:47Z", "content": "Meanwhile, Delhi reported 965 new COVID-19 cases on Thursday.\r\nNew Delhi: Delhi government on Thursday announced that the precautionary or the booster COVID-19 dose will be available for free to all … [+1941 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine Physical Damage At Roughly $60 Billion So Far: World Bank", "description": "Physical damage to Ukraine's buildings and infrastructure from Russia's invasion has reached roughly $60 billion and will rise further as the war continues, World Bank President David Malpass said on Thursday.", "url": "https://www.ndtv.com/world-news/ukraine-physical-damage-at-roughly-60-billion-so-far-world-bank-2909169", "urlToImage": "https://c.ndtvimg.com/2022-03/dcp8sqro_ukraine-war-afp-650_625x300_30_March_22.jpg", "publishedAt": "2022-04-21T21:55:36Z", "content": "World Bank says that Ukraine physical damage will rise further as the war continues.\r\nWashington: Physical damage to Ukraine's buildings and infrastructure from Russia's invasion has reached roughly … [+495 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Imran Khan Ruined Pakistan's Economy: Nawaz Sharif Lashes Out At Ex-PM", "description": "Pakistan Muslim League-Nawaz (PML-N) supremo and former Prime Minister Nawaz Sharif on Thursday lashed out at recently ousted Imran Khan while addressing a gathering with Pakistan People's Party (PPP) chairman Bilawal Bhutto Zardari in London.", "url": "https://www.ndtv.com/world-news/imran-khan-ruined-pakistans-economy-nawaz-sharif-lashes-out-at-former-pm-2909160", "urlToImage": "https://c.ndtvimg.com/2019-07/tvnofip8_nawaz-sharif-reuters_625x300_07_July_19.jpg", "publishedAt": "2022-04-21T21:31:50Z", "content": "Nawaz Sharif said that the political environment of the country had worsened in Imran Khan's rule.\r\nIslamabad: Pakistan Muslim League-Nawaz (PML-N) supremo and former Prime Minister Nawaz Sharif on T… [+2185 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Amnesty India Criticises UK PM For JCB Factory Inauguration Amid Row", "description": "Hitting out at British Prime Minister Boris Johnson for inaugurating a JCB factory in Gujarat a day after municipal corporation in Delhi razed homes in Jahangirpuri using bulldozers, Amnesty India called his \"silence\" on the incident was deafening.", "url": "https://www.ndtv.com/india-news/amnesty-india-criticises-uk-pm-boris-johnson-for-jcb-firm-inauguration-amid-delhi-jahangirpuri-demolition-row-2909149", "urlToImage": "https://c.ndtvimg.com/2022-04/tjjjn0n8_boris-johnson-visits-jcb-bulldozer-factory-pti-pic_650x400_21_April_22.jpg", "publishedAt": "2022-04-21T21:10:41Z", "content": "UK PM had inaugurated a factory of UK-headquartered heavy equipment maker JCB in Gujarat on Thursday.\r\nNew Delhi: Hitting out at British Prime Minister Boris Johnson for inaugurating a JCB factory in… [+1879 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Thunderstorm, Rainfall Likely In Delhi-NCR Today: Weather Office", "description": "After witnessing a series of heatwaves in the month, the national capital region is likely to experience a dust storm or a thunderstorm on Friday, the India Meteorological Department (IMD) said.", "url": "https://www.ndtv.com/india-news/delhi-rain-thunderstorm-rainfall-likely-in-delhi-ncr-today-weather-office-2909103", "urlToImage": "https://c.ndtvimg.com/2022-01/hhih3tgo_delhi-rain-today_625x300_05_January_22.jpg", "publishedAt": "2022-04-21T20:28:08Z", "content": "Delhi Weather: Weather office predicts moderate intensity rain in Delhi-NCR on Friday. (File)\r\nNew Delhi: After witnessing a series of heatwaves in the month, the national capital region is likely to… [+1855 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Imran Khan Lauds India's Foreign Policy Again At Lahore Rally", "description": "Former Pakistan Prime Minister Imran Khan once again lauded India's foreign policy over importing oil from Russia, saying that \"New Delhi's decision is for the betterment of its people.\"", "url": "https://www.ndtv.com/world-news/imran-khan-lauds-indias-foreign-policy-again-at-lahore-rally-2909074", "urlToImage": "https://c.ndtvimg.com/2022-04/3kfhu4qo_pakistan-prime-minister-imran-khan-reuters_625x300_05_April_22.jpg", "publishedAt": "2022-04-21T19:36:11Z", "content": "Ex- Pakistan PM Imran Khan said Indian foreign policy is based on the betterment of their people. (File)\r\nIslamabad: Former Pakistan Prime Minister Imran Khan once again lauded India's foreign policy… [+3115 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine Needs $7 Billion Per Month For Economic Recovery, Says Zelensky", "description": "Ukraine President Volodymyr Zelenskiy said on Thursday that Ukraine needs $7 billion per month to make up for economic losses caused by Russia's invasion of his country.", "url": "https://www.ndtv.com/world-news/ukraine-needs-7-billion-per-month-for-economic-recovery-volodymyr-zelensky-says-2909061", "urlToImage": "https://c.ndtvimg.com/2022-04/o6tn4et4_ukrainian-president-volodymyr-zelensky_625x300_02_April_22.jpg", "publishedAt": "2022-04-21T19:22:11Z", "content": "Ukraine's Zelenskiy was addressing to a World Bank forum on Thursday. (File)\r\nKyiv: Ukraine President Volodymyr Zelenskiy said on Thursday that Ukraine needs $7 billion per month to make up for econo… [+509 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Ukrainian Blood On Hands\": UK Sanctions Russian Army Chiefs, Others", "description": "Britain on Thursday announced fresh sanctions targeting Russian army chiefs, condemned by the UK foreign minister as having Ukrainian blood on their hands.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-uk-sanctions-russian-army-chiefs-others-2909033", "urlToImage": "https://c.ndtvimg.com/2022-03/m9h12gps_russia-ukraine-war-reuters_625x300_28_March_22.jpg", "publishedAt": "2022-04-21T19:05:26Z", "content": "UK also announced further trade sanctions including import bans on Russian silver and wood.\r\nLondon: Britain on Thursday announced fresh sanctions targeting Russian army chiefs, condemned by the UK f… [+1747 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Claims Mariupol \"Liberated\", US Rushes New Aid For Ukraine", "description": "Russian President Vladimir Putin on Thursday claimed the \"liberation\" of the flattened city of Mariupol after nearly two months of fighting, demanding its trapped Ukrainian defenders be sealed into their underground last stand.", "url": "https://www.ndtv.com/world-news/russia-claims-mariupol-liberated-us-rushes-new-aid-for-ukraine-2909016", "urlToImage": "https://c.ndtvimg.com/2022-04/s0n78k4o_mariupol_625x300_21_April_22.jpg", "publishedAt": "2022-04-21T18:53:09Z", "content": "Putin said the \"liberation\" of Mariupol was a \"success\" for Russian forces\r\nZaporizhzhia, Ukraine: Russian President Vladimir Putin on Thursday claimed the \"liberation\" of the flattened city of Mariu… [+6612 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Mumbai Indians Become First Team In IPL To Start A Season With 7 Losses", "description": "IPL 2022, MI vs CSK: It has been a terrible season for Mumbai Indians as they have struggled with both bat and ball and have failed to win even a single match.", "url": "https://sports.ndtv.com/ipl-2022/mumbai-indians-become-first-team-in-ipl-history-to-start-a-season-with-7-losses-2908974", "urlToImage": "https://c.ndtvimg.com/2022-04/pmgj4l48_rohit-sharma-captain-mumbai-bcciipl_625x300_22_April_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-04-21T18:31:51Z", "content": "MS Dhoni on Thursday night did what he does best, which is to successfully guide his team to victory in the last over. This time it was on the last delivery of the innings as he hit a crucial boundar… [+1361 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "IPL 2022, MI vs CSK: Dhoni's Late Blitz Sink MI To 7th Consecutive Defeat", "description": "IPL 2022: The great M S Dhoni turned back the clock to script a three wicket victory for Chennai Super Kings against Mumbai Indians in the IPL on Thursday, following a heart-stopping finish that saw him hit a four off the last ball of the game.", "url": "https://sports.ndtv.com/ipl-2022/indian-premier-league-2022-mi-vs-csk-ms-dhonis-late-blitz-sink-mumbai-indians-to-7th-consecutive-defeat-2908973", "urlToImage": "https://c.ndtvimg.com/2022-04/t3ioh7ms_ms-dhoni_625x300_21_April_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-04-21T18:30:08Z", "content": "The great M S Dhoni turned back the clock to script a three wicket victory for Chennai Super Kings against Mumbai Indians in the IPL on Thursday, following a heart-stopping finish that saw him hit a … [+2723 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Anti-Minority\" Image Will Hurt Indian Companies, Warns Raghuram Rajan", "description": "Amid concerns over minorities being targeted in India, former Reserve Bank governor Raghuram Rajan on Thursday cautioned that an 'anti-minority' image for the country can lead to loss of market for Indian product.", "url": "https://www.ndtv.com/india-news/anti-minority-image-will-hurt-indian-companies-warns-raghuram-rajan-2908962", "urlToImage": "https://c.ndtvimg.com/2020-12/h3kdhfps_raghuram-rajan-bloomberg-650_625x300_15_December_20.jpg", "publishedAt": "2022-04-21T18:26:25Z", "content": "Warmth in international relations too is decided by such perceptions, said Raghuram Rajan\r\nNew Delhi: Amid concerns over minorities being targeted in India, former Reserve Bank governor Raghuram Raja… [+3075 chars]"}]}