{"status": "ok", "totalResults": 536, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US, Russia's \"Hostile\" Standoff At United Nations Over Spying Claims", "description": "The United States has taken aim at Russians working at the United Nations, leveling accusations of espionage for the second day running on Tuesday, in a Cold War-like twist as tensions soar over Moscow's invasion of Ukraine.", "url": "https://www.ndtv.com/world-news/russia-usa-relations-united-nations-us-russias-hostile-standoff-at-united-nations-over-spying-claims-2800323", "urlToImage": "https://c.ndtvimg.com/2022-02/4hoit0nk_united-nations-reuters_625x300_22_February_22.jpg", "publishedAt": "2022-03-03T01:54:34Z", "content": "United Nations: US asked UN to expel an employee allegedly working as a \"Russian operative.\"\r\nUnited Nations: The United States has taken aim at Russians working at the United Nations, leveling accus… [+3095 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Texas Man, Accused Of Carrying Gun To US Capitol Hill, Goes On Trial", "description": "The first criminal trial stemming from the January 6 assault on the US Capitol by Donald Trump supporters began on Wednesday with prosecutors accusing a Texas man of leading the attack on Congress.", "url": "https://www.ndtv.com/world-news/texas-man-accused-of-carrying-gun-to-us-capitol-hill-goes-on-trial-2800322", "urlToImage": "https://c.ndtvimg.com/2021-02/fr5j5bqg_capitol-riots-wp_625x300_26_February_21.jpg", "publishedAt": "2022-03-03T01:52:42Z", "content": "More than 750 people have been arrested for their roles in Capitol riots.\r\nWashington: The first criminal trial stemming from the January 6 assault on the US Capitol by Donald Trump supporters began … [+3524 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Edited by NDTV Newsdesk", "title": "UP Polls Live: Chief Minister Contests As Voting Begins For 57 UP Seats", "description": "57 seats of eastern Uttar Pradesh, spread across 10 districts, will go to polls today in the sixth and second-last phase of the 2022 UP election.", "url": "https://www.ndtv.com/india-news/up-election-2022-live-updates-chief-minister-contests-as-voting-begins-for-57-up-seats-2800319", "urlToImage": "https://c.ndtvimg.com/2022-02/1e362nig_yogi-adityanath-pti-650_650x400_11_February_22.jpg", "publishedAt": "2022-03-03T01:47:22Z", "content": "Yogi Adityanath being in the contest has spurred expectations of a big victory in all 9 seats. (File)\r\nLucknow: 57 seats in eastern Uttar Pradesh, spread across 10 districts, will go to polls today i… [+1403 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Russia-Ukraine War LIVE: Ukraine City Kharkiv Under Intense Shelling", "description": "Russian forces claim to have taken the besieged Black Sea city of Kherson in Ukraine's south but the city's mayor insists it is still in Ukrainian hands.", "url": "https://www.ndtv.com/world-news/ukraine-russia-war-live-updates-russia-says-498-troops-killed-kharkiv-under-intense-shelling-2800312", "urlToImage": "https://c.ndtvimg.com/2022-03/2uffv52g_ukraine-afp_625x300_03_March_22.jpg", "publishedAt": "2022-03-03T01:36:16Z", "content": "Russia-Ukraine War: Russia moots the possibility of ceasefire talks on Thursday with Ukraine.\r\nRussian forces claim to have taken the besieged Black Sea city of Kherson in Ukraine's south but the cit… [+1796 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "57 UP Seats Vote Today, Yogi Adityanath Contests From Stronghold: 10 Facts", "description": "Fifty-seven seats of eastern Uttar Pradesh, spread across 10 districts, will vote today in the penultimate phase of election. Among the key candidates is Chief Minister Yogi Adiyatnath, who is contesting his first assembly poll from Gorakhpur.", "url": "https://www.ndtv.com/india-news/uttar-pradesh-election-uttar-pradesh-election-2022-57-up-seats-vote-today-yogi-adityanath-contests-from-stronghold-10-facts-2800296", "urlToImage": "https://c.ndtvimg.com/2022-03/r2favpv4_uttar-pradesh-elections_625x300_03_March_22.jpg", "publishedAt": "2022-03-03T01:12:53Z", "content": "<li>With voting for 292 out of the state's 403 assembly seats already over, the focus has shifted to the crucial Purvanchal region of the state, which has 111 seats- more than a quarter of the total.… [+2012 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE Updates: India Records 7,554 New Covid Cases", "description": "India on Wednesday reported a total of 7,554 new coronavirus cases, taking the total tally of COVID-19 cases to 4,29,38,599, while the active cases dipped to 85,680, according to the Union Health Ministry data.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-3-march-2022-2800288", "urlToImage": "https://c.ndtvimg.com/2021-12/jv3q7uqk_omicron-covid-testing-generic-afp_625x300_02_December_21.jpg", "publishedAt": "2022-03-03T00:49:30Z", "content": "India COVID-19 Cases: India's active cases dipped to 85,680.\r\nNew Delhi: India on Wednesday reported a total of 7,554 new coronavirus cases, taking the total tally of COVID-19 cases to 4,29,38,599, w… [+427 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Broke Russia's \"Sneaky Plans In A Week\": Ukraine's President Zelensky", "description": "Ukrainian President Volodymyr Zelensky said Wednesday that his country had thwarted Russia's \"sneaky\" plans, saying he was proud of the \"heroic\" resistance to Moscow's invasion.", "url": "https://www.ndtv.com/world-news/broke-russias-sneaky-plans-in-a-week-ukraines-president-zelensky-2800280", "urlToImage": "https://c.ndtvimg.com/2022-03/er29dlgk_ukraine-reuters-650_625x300_02_March_22.jpg", "publishedAt": "2022-03-03T00:27:47Z", "content": "Ukrainian President said around 9,000 Russian soldiers had been killed since the invasion began.\r\nKyiv: Ukrainian President Volodymyr Zelensky said Wednesday that his country had thwarted Russia's \"s… [+985 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "World Court To Start \"Active Probe\" Into War Crimes In Ukraine: Statement", "description": "The International Criminal Court's chief prosecutor said Wednesday an active probe into possible war crimes in Ukraine \"will immediately proceed\" after his office received the backing of 39 countries.", "url": "https://www.ndtv.com/world-news/international-criminal-court-to-start-active-probe-into-war-crimes-in-ukraine-statement-2800275", "urlToImage": "https://c.ndtvimg.com/2022-02/snkvhrgg_russia-ukraine-crisis-kyiv-afp-650_625x300_28_February_22.jpg", "publishedAt": "2022-03-03T00:02:41Z", "content": "\"Our work in the collection of evidence has now commenced,\" prosecutor said.\r\nThe Hague, Netherlands: The International Criminal Court's chief prosecutor said Wednesday an active probe into possible … [+455 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine To Get Grenade Launchers, Machine Guns From Spain: Report", "description": "Spain will send a shipment of offensive weapons and ammunition including grenade launchers and machine guns to Ukraine on Friday to help it repel the Russian invasion, Spanish Defense Minister Margarita Robles said late on Wednesday.", "url": "https://www.ndtv.com/world-news/ukraine-to-get-grenade-launchers-machine-guns-from-spain-to-fight-against-russia-report-2800269", "urlToImage": "https://c.ndtvimg.com/2022-02/3f3rjmt8_ukraine-army-afp-650_625x300_26_February_22.jpg", "publishedAt": "2022-03-02T23:32:44Z", "content": "Spanish PM also said that Spain would send arms directly to Ukraine.\r\nMadrid: Spain will send a shipment of offensive weapons and ammunition including grenade launchers and machine guns to Ukraine on… [+976 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine Crisis: World Bank Stops All Its Projects In Russia, Belarus", "description": "The World Bank on Wednesday announced it was halting all of its ongoing projects in Russia and Belarus in response to the invasion of Ukraine.", "url": "https://www.ndtv.com/world-news/ukraine-crisis-world-bank-stops-all-its-projects-in-russia-belarus-2800261", "urlToImage": "https://c.ndtvimg.com/2022-02/lscu962g_ukrainekyivndtv_625x300_25_February_22.jpg", "publishedAt": "2022-03-02T23:08:07Z", "content": "Earlier, the bank had announced that it is preparing a $3 billion aid package for war-torn Ukraine.\r\nWashington: The World Bank on Wednesday announced it was halting all of its ongoing projects in Ru… [+1096 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "227 Civilians Killed, 525 Injured In Ukraine Since Russian Invasion: UN", "description": "The UN said Wednesday that it had recorded nearly 230 civilian deaths in Ukraine, including 15 children, since Russia's full-scale invasion began, warning that the actual count was likely far higher.", "url": "https://www.ndtv.com/world-news/227-civilians-killed-525-injured-in-ukraine-since-russian-invasion-un-2800257", "urlToImage": "https://c.ndtvimg.com/2022-02/bon71bpo_civilian-in-kyiv-ukraine_650x400_28_February_22.jpg", "publishedAt": "2022-03-02T22:56:04Z", "content": "Geneva: The UN said Wednesday that it had recorded nearly 230 civilian deaths in Ukraine, including 15 children, since Russia's full-scale invasion began, warning that the actual count was likely far… [+1531 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "7 Soldiers Die In Romania Helicopter Crash: Defence Ministry", "description": "Seven military personnel died after their helicopter crashed on Wednesday in eastern Romania near the Black Sea while searching for a missing fighter jet and its pilot, officials said.", "url": "https://www.ndtv.com/world-news/7-soldiers-die-in-romania-helicopter-crash-defence-ministry-2800252", "urlToImage": "https://c.ndtvimg.com/2019-11/ff2jplq_army-helicopter-generic_625x300_26_November_19.jpg", "publishedAt": "2022-03-02T22:25:37Z", "content": "Officials believe the incident took place due to unfavourable weather conditions. (Representational)\r\nBucharest: Seven military personnel died after their helicopter crashed on Wednesday in eastern R… [+1587 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"This War Is Not A Fight Against Nazism...\": France's Macron On Ukraine", "description": "French President Emmanuel Macron on Wednesday denounced the \"lies\" spread by the Russian government to justify a war in Ukraine, but said he would remain in contact with President Vladimir Putin to try and obtain a ceasefire.", "url": "https://www.ndtv.com/world-news/russian-president-putin-alone-chose-war-in-ukraine-says-frances-president-emmanuel-macron-2800246", "urlToImage": "https://c.ndtvimg.com/2022-02/3pcc2r8g_russiaukraine-crisis-afp-650_625x300_26_February_22.jpg", "publishedAt": "2022-03-02T22:04:33Z", "content": "French President Macron said that there is no NATO base in Ukraine.\r\nParis: French President Emmanuel Macron on Wednesday denounced the \"lies\" spread by the Russian government to justify a war in Ukr… [+1076 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine Crisis: Indian Air Force Flight With 200 Indians Lands In Delhi", "description": "The Indian Air Force's first evacuation flight with 200 Indians from Romanian capital Bucharest landed at the Hindon air base here in the early hours of Thursday, sources said.", "url": "https://www.ndtv.com/india-news/ukraine-crisis-1st-indian-air-force-flight-with-200-indians-from-romania-lands-in-delhi-2800243", "urlToImage": "https://i.ndtvimg.com/i/2016-05/hindon-air-base_650x400_71462593144.jpg", "publishedAt": "2022-03-02T21:35:56Z", "content": "The Indian Air Force's C-17 aircraft landed in Delhi at 1.30 am. (File)\r\nNew Delhi: The Indian Air Force's first evacuation flight with 200 Indians from Romanian capital Bucharest landed at the Hindo… [+1263 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Height Of Irresponsibility\": US Top Diplomat Slams Putin's Nuclear Threat", "description": "Top US diplomat Antony Blinken called President Vladimir Putin's \"provocative\" nuclear rhetoric \"the height of irresponsibility\" Wednesday, days after the Russian leader put his strategic forces on alert after invading Ukraine.", "url": "https://www.ndtv.com/world-news/height-of-irresponsibility-us-top-diplomat-antony-blinken-slams-russian-president-vladimir-putins-nuclear-threat-2800234", "urlToImage": "https://c.ndtvimg.com/2022-02/frldn108_russia-ukraine-crisis-afp-650_625x300_26_February_22.jpg", "publishedAt": "2022-03-02T21:01:11Z", "content": "Pentagon meanwhile said that US postponed a planned test launch of a ballistic missile over Ukraine war.\r\nWashington: Top US diplomat Antony Blinken called President Vladimir Putin's \"provocative\" nu… [+1031 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "France's Macron Says Will Keep In Touch With Putin To Stop War In Ukraine", "description": "French President Emmanuel Macron said Wednesday that he would speak with Russian leader Vladimir Putin as long as was needed to persuade him to stop Russia's war in Ukraine.", "url": "https://www.ndtv.com/world-news/frances-macron-says-will-keep-in-touch-with-putin-to-stop-war-in-ukraine-2800202", "urlToImage": "https://c.ndtvimg.com/2022-02/jugcitdo_russia-ukraine-war-kyiv-afp-650_625x300_28_February_22.jpg", "publishedAt": "2022-03-02T20:18:11Z", "content": "French President Macron said he will keep speaking with Putin as long as necessary in order to stop war.\r\nParis: French President Emmanuel Macron said Wednesday that he would speak with Russian leade… [+448 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine Crisis: Dozens Detained At Anti-War Rallies In Putin's Hometown", "description": "Dozens of anti-war demonstrators were detained in Moscow and Saint Petersburg Wednesday after jailed Kremlin critic Alexei Navalny called on Russians to protest President Vladimir Putin's invasion of Ukraine.", "url": "https://www.ndtv.com/world-news/ukraine-crisis-dozens-detained-at-anti-war-rallies-in-putins-hometown-2800181", "urlToImage": "https://c.ndtvimg.com/2022-02/bvivtct8_anti-war-protest-russia_625x300_24_February_22.jpg", "publishedAt": "2022-03-02T19:43:19Z", "content": "\"I couldn't stay at home. This war has to be stopped,\" a student said during an anti-war protest.\r\nMoscow: Dozens of anti-war demonstrators were detained in Moscow and Saint Petersburg Wednesday afte… [+1540 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Chelsea Owner Says He Will Sell Club To Help Ukraine War Victims", "description": "Chelsea owner Roman Abramovich on Wednesday confirmed he will sell the Premier League club amid Russia's invasion of Ukraine.", "url": "https://www.ndtv.com/world-news/chelsea-owner-roman-abramovich-says-he-will-sell-football-club-to-help-ukraine-war-victims-2800163", "urlToImage": "https://c.ndtvimg.com/2022-03/3rsvi6o8_russia-ukraine-tank_625x300_02_March_22.jpg", "publishedAt": "2022-03-02T19:14:56Z", "content": "\"I believe this is in the best interest of the club,\" Chelsea owner said.\r\nLondon: Chelsea owner Roman Abramovich on Wednesday confirmed he will sell the Premier League club amid Russia's invasion of… [+2070 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Kyiv Residents Staying Put Say They're Ready To Fight And Die", "description": "Wearing a blue tracksuit, Tkachenko surveyed the wreckage around him. Near the tower a gym was gutted by the force of the blast and exercise equipment still smouldered.", "url": "https://www.ndtv.com/world-news/kyiv-residents-staying-put-say-theyre-ready-to-fight-and-die-2800144", "urlToImage": "https://c.ndtvimg.com/2022-03/o7ehm0o_kyiv-ukraine-russia-afp-650_625x300_01_March_22.jpg", "publishedAt": "2022-03-02T18:51:43Z", "content": "Thousands of Ukrainians have vowed to take up arms and do what they can to protect their country.\r\nKyiv:  Ihor Tkachenko, a computer engineer from Kyiv, is not able to sign up to the civil defence fo… [+2311 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Indian Students Kept As Hostages By Ukrainians In Kharkiv, Says Russia", "description": "Ukrainian forces are keeping a large group of Indian students as \"hostages\" in Kharkiv, the Russian Defence Ministry has alleged, amid an escalating assault on the country on Wednesday.", "url": "https://www.ndtv.com/india-news/indian-students-kept-as-hostages-by-ukrainians-in-kharkiv-says-russia-2800139", "urlToImage": "https://c.ndtvimg.com/2022-03/su1oufb_indian-students-kharkiv-ndtv_625x300_03_March_22.jpg", "publishedAt": "2022-03-02T18:46:19Z", "content": "Indian students in Kharkiv complained of great difficulty in leaving the city.\r\nNew Delhi: Ukrainian forces are keeping a large group of Indian students as \"hostages\" in Kharkiv, the Russian Defence … [+2024 chars]"}]}