{"status": "ok", "totalResults": 569, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Live Updates: Street Protests Grip Lanka As Economic Crisis Escalates", "description": "Sri Lanka has declared a state of emergency giving sweeping powers to security forces. President Gotabaya Rajapaksa invoked the tough law a day after hundreds tried to storm his house in anger over an unprecedented economic crisis.", "url": "https://www.ndtv.com/world-news/sri-lanka-live-updates-street-protests-grip-lanka-as-economic-crisis-escalates-state-of-emergency-declared-2858035", "urlToImage": "https://c.ndtvimg.com/2022-03/kaogt5eo_sri-lanka-protests_625x300_31_March_22.jpg", "publishedAt": "2022-04-02T01:41:15Z", "content": "Sri Lanka's capital Colombo was placed under indefinite curfew in the wake of the violence.\r\nSri Lanka has declared a state of emergency giving sweeping powers to security forces. President Gotabaya … [+1050 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Petrol, Diesel Prices Up 80 Paise, Total Hike Rs 7.20 In Last 12 Days", "description": "Petrol and diesel prices were hiked today by 80 paise a litre each, taking the total increase in rates in the last 12 days to Rs 7.20 per litre.", "url": "https://www.ndtv.com/india-news/petrol-diesel-prices-raised-by-80-paise-total-hike-in-last-12-days-at-rs-7-20-2858032", "urlToImage": "https://c.ndtvimg.com/2021-09/ojarjui8_petrol-pump_650x400_28_September_21.jpg", "publishedAt": "2022-04-02T01:26:43Z", "content": "Petrol, diesel prices hiked by 80 paise a litre each, taking total rise to Rs 7.20 per litre in 12 days\r\nNew Delhi: Petrol and diesel prices were hiked today by 80 paise a litre each, taking the tota… [+688 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Pentagon Announces $300 Million In Additional Assistance For Ukraine", "description": "The US Defense Department announced Friday it is setting aside $300 million in \"security assistance\" for Ukraine to bolster the country's defense capabilities, adding to the $1.6 billion Washington has committed since Russia invaded in late February.", "url": "https://www.ndtv.com/world-news/pentagon-announces-300-million-in-additional-assistance-for-ukraine-2858021", "urlToImage": "https://c.ndtvimg.com/2022-03/inkdihco_ukraine-war-afp-650_625x300_24_March_22.jpg", "publishedAt": "2022-04-02T00:58:59Z", "content": "Earlier, the US said that it is providing Ukraine with supplies in case Russia deploys chemical weapons.\r\nWashington: The US Defense Department announced Friday it is setting aside $300 million in \"s… [+687 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE: India Reports Over 1,300 New Covid Cases In 24 Hours", "description": "India on Friday reported 1,335 fresh COVID-19 cases, taking the total number of coronavirus infections to 4,30,25,775. India also recorded 28 Covid-related deaths in the last 24 hours, bringing the death count to 5,21,129.", "url": "https://www.ndtv.com/world-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-2-april-2022-2858011", "urlToImage": "https://c.ndtvimg.com/2021-03/jq67i498_mumbacovid-tests-sessions-court_625x300_30_March_21.jpg", "publishedAt": "2022-04-02T00:28:38Z", "content": "The country also reported 28 Covid-related deaths in the last 24 hours.\r\nNew Delhi: India on Friday reported 1,335 fresh COVID-19 cases, taking the total number of coronavirus infections to 4,30,25,7… [+506 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Imposes Sanctions On 5 North Korean Firms Over Missile Tests", "description": "The United States on Friday imposed sanctions on five North Korean entities in response to ballistic missile tests.", "url": "https://www.ndtv.com/world-news/us-imposes-sanctions-on-5-north-korean-firms-over-missile-tests-2858008", "urlToImage": "https://c.ndtvimg.com/2021-09/smc741gk_antony-blinken-afp_625x300_24_September_21.jpg", "publishedAt": "2022-04-02T00:02:35Z", "content": "The statement said that North Korea poses a grave threat to international peace and security.\r\nWashington: The United States on Friday imposed sanctions on five North Korean entities in response to b… [+2483 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Over 3,000 People Rescued From Besieged Mariupol: Ukraine's Zelensky", "description": "Over 3,000 people have been led to safety from the besieged city of Mariupol, the Ukrainian president said Saturday.", "url": "https://www.ndtv.com/world-news/over-3-000-people-rescued-from-besieged-mariupol-ukraine-president-volodymyr-zelensky-2858001", "urlToImage": "https://c.ndtvimg.com/2022-03/33r27p2o_ukraine-war-mariupol-theatre-reuters650_625x300_17_March_22.jpg", "publishedAt": "2022-04-01T23:29:09Z", "content": "Around 30 evacuation buses pull into the city of Zaporizhzhia, according to AFP.\r\nKyiv: Over 3,000 people have been led to safety from the besieged city of Mariupol, the Ukrainian president said Satu… [+658 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Will Smith Resigns From Academy Over Oscars Slap", "description": "Will Smith has tendered his resignation from the body that awards the Oscars after his attack on Chris Rock during the weekend ceremony, a statement said Friday.", "url": "https://www.ndtv.com/world-news/will-smith-resigns-from-academy-over-oscars-slap-2857998", "urlToImage": "https://c.ndtvimg.com/2022-02/97krclh8_will-smith_625x300_28_February_22.jpg", "publishedAt": "2022-04-01T23:18:03Z", "content": "Will Smith is under fire for slapping comedian Chris Rock at the Oscars.\r\nLos Angeles: Will Smith has tendered his resignation from the body that awards the Oscars after his attack on Chris Rock duri… [+1270 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Booster Dose Of Covid Vaccine Needed To Fight Against Omicron: Study", "description": "Neutralising antibody levels waned after six months in those who were fully vaccinated against the coronavirus with Covishield, Covaxin and a mix of both with regard to Omicron variant, a study done by the National Institute of Virology indicated.", "url": "https://www.ndtv.com/india-news/booster-dose-of-covid-vaccine-needed-to-fight-against-omicron-study-2857997", "urlToImage": "https://c.ndtvimg.com/2022-01/ta80o548_booster-doses-for-seniors-pti-pic_650x400_10_January_22.jpg", "publishedAt": "2022-04-01T23:03:15Z", "content": "The study findings were published in the Journal of Travel Medicine recently.\r\nNew Delhi:  Neutralising antibody levels waned after six months in those who were fully vaccinated against the coronavir… [+2487 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Camp Of Ukrainians At US-Mexico Border Swells As More Refugees Arrive", "description": "Hundreds of Ukrainians are camping in the border city of Tijuana, Mexico, hoping to seek US asylum, a dramatic increase in arrivals just days after the Biden administration said the US would accept up to 100,000 Ukrainians fleeing from war.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-camp-of-ukrainians-at-us-mexico-border-swells-as-more-refugees-arrive-2857994", "urlToImage": "https://c.ndtvimg.com/2022-03/sn77nej8_ukraine-refugee-afp-650_625x300_06_March_22.jpg", "publishedAt": "2022-04-01T22:38:16Z", "content": "Around 100 Ukrainians are being allowed to cross into the United States daily.\r\nTijuana: Hundreds of Ukrainians are camping in the border city of Tijuana, Mexico, hoping to seek U.S. asylum, a dramat… [+3709 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine Silent On Airstrike In Russia, Mariupol Rescue Operation Fails", "description": "Ukraine refused Friday to deny it had carried out an airstrike on Russian soil, as hopes of de-escalation faded in President Vladimir Putin's war and evacuation operations for besieged Mariupol failed.", "url": "https://www.ndtv.com/world-news/ukraine-silent-on-airstrike-in-russia-mariupol-rescue-operation-fails-2857989", "urlToImage": "https://c.ndtvimg.com/2022-03/h5j8h27s_russia-ukraine-fire_625x300_16_March_22.jpg", "publishedAt": "2022-04-01T22:17:45Z", "content": "It was the first strike from Ukrainian side on Russian soil since the war begun. (File)\r\nKyiv: Ukraine refused Friday to deny it had carried out an airstrike on Russian soil, as hopes of de-escalatio… [+5294 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Cancels Its Missile Test Due To Russia Nuclear Tensions: Report", "description": "The U.S. military has canceled a test of its Minuteman III intercontinental ballistic missile that it had initially aimed only to delay in a bid to lower nuclear tensions with Russia during the war in Ukraine, the Air Force told Reuters on Friday.", "url": "https://www.ndtv.com/world-news/us-cancels-its-minuteman-iii-intercontinental-ballistic-missile-test-due-to-russia-nuclear-tensions-report-2857986", "urlToImage": "https://i.ndtvimg.com/i/2017-08/minuteman-iii-intercontinental-ballistic-missile_650x400_81501694950.jpg", "publishedAt": "2022-04-01T21:49:35Z", "content": "The US official said that next Minuteman III test is scheduled to take place later this year.\r\nWashington: The U.S. military has canceled a test of its Minuteman III intercontinental ballistic missil… [+2533 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "China Plane Crash: US Investigators Head To Beijing For Boeing 737 Probe", "description": "A team of US investigators has departed for China to probe the causes of an airliner crash that killed all 132 people on a Boeing 737-800 operated by China Eastern Airlines on March 21, the National Transportation Safety Board announced on Friday.", "url": "https://www.ndtv.com/world-news/china-plane-crash-us-investigators-head-to-beijing-for-boeing-737-probe-2857980", "urlToImage": "https://c.ndtvimg.com/2022-03/fv5o3q54_china-plane-crash-part-bloomberg_625x300_25_March_22.jpg", "publishedAt": "2022-04-01T21:25:02Z", "content": "Flight MU5735, with 132 people aboard, was crashed on March 21.\r\nWashington: A team of US investigators has departed for China to probe the causes of an airliner crash that killed all 132 people on a… [+1014 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Will Strengthen Its Western Border To Deter Attack: Kremlin", "description": "Kremlin spokesman Dmitry Peskov on Friday said Russian President Vladimir Putin had ordered the military to strengthen the country's western borders so that no one would ever think of launching an attack.", "url": "https://www.ndtv.com/world-news/russia-will-strengthen-western-border-to-deter-attack-kremlin-2857975", "urlToImage": "https://c.ndtvimg.com/2022-03/1gsbh8do_red-square-kremlin-moscowafp-_625x300_04_March_22.jpg", "publishedAt": "2022-04-01T21:01:10Z", "content": "Moscow: Kremlin spokesman Dmitry Peskov on Friday said Russian President Vladimir Putin had ordered the military to strengthen the country's western borders so that no one would ever think of launchi… [+728 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UN Official To Visit Moscow To Discuss Ukraine Situation On Sunday", "description": "A top United Nations official will visit Moscow this weekend to try to secure a \"humanitarian ceasefire\" in Ukraine, UN chief Antonio Guterres said Friday.", "url": "https://www.ndtv.com/world-news/un-official-to-visit-moscow-to-discuss-ukraine-crisis-on-sunday-says-un-chief-antonio-guterres-2857972", "urlToImage": "https://c.ndtvimg.com/2022-03/1aqq6ruk_ukraine-reuters_625x300_29_March_22.jpg", "publishedAt": "2022-04-01T20:43:25Z", "content": "Both Russia and Ukraine had agreed to meet UN top official, according to Guterres.\r\nUnited Nations: A top United Nations official will visit Moscow this weekend to try to secure a \"humanitarian cease… [+1067 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Providing Ukraine With Supplies In Case Russia...: White House", "description": "The United States is providing Ukraine with supplies and equipment in case Russia deploys chemical or biological weapons, the White House said on Friday, underscoring that this would not compromise domestic preparedness in any form.", "url": "https://www.ndtv.com/world-news/us-providing-ukraine-with-supplies-equipment-in-case-russia-deploys-chemical-weapons-white-house-2857953", "urlToImage": "https://c.ndtvimg.com/2022-03/9qhhvva_ukraine-afp_625x300_29_March_22.jpg", "publishedAt": "2022-04-01T20:22:54Z", "content": "The US says Russia might be planning a \"false flag\" operation to lay the groundwork for such an attack.\r\nWashington: The United States is providing Ukraine with supplies and equipment in case Russia … [+557 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Bulgaria Expels Russian Diplomat For Spying Amid Ukraine Crisis", "description": "Bulgaria's foreign ministry said Friday that it would expel another Russian diplomat on suspicion of spying, just two weeks after the Balkan country declared ten Russian diplomats 'persona non grata'.", "url": "https://www.ndtv.com/world-news/bulgaria-expels-russian-diplomat-for-spying-amid-ukraine-crisis-2857946", "urlToImage": "https://c.ndtvimg.com/2022-03/m8umlu2o_ukraine-war_625x300_29_March_22.jpg", "publishedAt": "2022-04-01T19:48:24Z", "content": "The ministry said that Russian diplomat has 72 hours leave the country.\r\nSofia: Bulgaria's foreign ministry said Friday that it would expel another Russian diplomat on suspicion of spying, just two w… [+2180 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine Says Russian Missiles Hit Residential Area In Odessa", "description": "Three missiles hit a residential area near the Ukrainian southern port city of Odesa on Friday, the local governor Maksym Marchenko said in a video posted online, adding there were casualties.", "url": "https://www.ndtv.com/world-news/ukraine-says-russian-missiles-hit-residential-area-in-odessa-region-2857930", "urlToImage": "https://c.ndtvimg.com/2022-03/cc0apmgk_ukraine-war_625x300_24_March_22.jpg", "publishedAt": "2022-04-01T19:18:08Z", "content": "The incident took place on Friday. (File)\r\nKyiv: Three missiles hit a residential area near the Ukrainian southern port city of Odesa on Friday, the local governor Maksym Marchenko said in a video po… [+331 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Country Urgently In Need Of Electoral Reforms, Says Karnataka Speaker", "description": "The country is in urgent need for electoral reforms as moral values have declined over the years, Karnataka assembly Speaker Vishweshwar Hegde Kageri said on Friday.", "url": "https://www.ndtv.com/karnataka-news/country-urgently-in-need-of-electoral-reforms-says-karnataka-speaker-vishweshwar-hegde-kageri-2857614", "urlToImage": "https://c.ndtvimg.com/2022-04/p7vatpig_karnataka-speaker-vishweshwar-hegde-kageri-650_625x300_02_April_22.jpg", "publishedAt": "2022-04-01T18:43:36Z", "content": "The Karnataka speaker said elections are meant to be a festival of democracy. (File)\r\nMangaluru: The country is in urgent need for electoral reforms as moral values have declined over the years, Karn… [+1098 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "1st Test: Harmer Marks SA Return After 6 Years With 4-Wicket Test Haul", "description": "South Africa vs Bangladesh, 1st Test, Day 2: Off-spinner Simon Harmer ended an absence of more than six years by taking four wickets and putting South Africa in charge on the second day of the first Test against Bangladesh at Kingsmead on Friday.", "url": "https://sports.ndtv.com/cricket/south-africa-vs-bangladesh-1st-test-day-2-report-simon-harmer-marks-south-africa-return-after-6-years-with-4-wicket-test-haul-2857904", "urlToImage": "https://c.ndtvimg.com/2022-04/ugvdvoh_simon-harmer-afp_625x300_02_April_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-04-01T18:38:40Z", "content": "Off-spinner Simon Harmer ended an absence of more than six years by taking four wickets and putting South Africa in charge on the second day of the first Test against Bangladesh at Kingsmead on Frida… [+2542 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sri Lanka Declares State Of Emergency After Unrest Over Economic Crisis", "description": "Sri Lanka declares state of emergency after unrest over economic crisis. The South Asian nation is facing severe shortages of essentials, sharp price rises and crippling power cuts in its most painful...", "url": "https://www.ndtv.com/world-news/sri-lanka-declares-state-of-emergency-after-unrest-over-economic-crisis-2857899", "urlToImage": "https://c.ndtvimg.com/2018-10/7ckdfjs8_sri-lanka-crisis_625x300_28_October_18.jpg", "publishedAt": "2022-04-01T18:33:59Z", "content": "Street protests gripped Sri Lanka Friday as demonstrators blocked main roads across the country\r\nColombo: Sri Lanka President Gotabaya Rajapaksa Friday declared a state of emergency giving security f… [+388 chars]"}]}