{"status": "ok", "totalResults": 431, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "For Naga Peace Talks, Centre's Interlocutor In Nagaland For A Week", "description": "The centre's interlocutor, who held the first round of talks with major Naga groups including the NSCN-IM and other stakeholders six months ago in Nagaland, arrived in state capital Kohima on Monday for peace talks.", "url": "https://www.ndtv.com/india-news/for-naga-peace-talks-centres-interlocutor-in-nagaland-for-a-week-2899348", "urlToImage": "https://c.ndtvimg.com/2021-06/fvu2mi8k_neiphiu-rio-twitter_625x300_12_June_21.jpg", "publishedAt": "2022-04-19T01:37:14Z", "content": "Kohima: The centre's interlocutor, who held the first round of talks with major Naga groups including the NSCN-IM and other stakeholders six months ago in Nagaland, arrived in state capital Kohima on… [+1151 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "On Ex Assam Congress Chief's Resignation Letter, Himanta Sarma's Stinger", "description": "Ripun Bora, after joining the Trinamool Congress, had blamed Assam Congress leaders for his defeat in the recent Rajya Sabha polls and even accused a section of Assam Pradesh Congress leaders of maintaining a secret understanding with the BJP", "url": "https://www.ndtv.com/india-news/ripun-bora-on-ex-assam-congress-chiefs-resignation-letter-himanta-sarmas-stinger-2899341", "urlToImage": "https://c.ndtvimg.com/2022-01/2jamb7vs_himanta-biswa-sarma-pti_625x300_12_January_22.jpg", "publishedAt": "2022-04-19T01:24:43Z", "content": "He joined the Mamata Banerjee-led Trinamool on Sunday.\r\nGuwahati: The resignation of former Assam Congress chief and former Rajya Sabha MP Ripun Bora has opened a Pandora's Box in the state.\r\nMr Bora… [+2067 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Biggest Risk Of Crypto Is Laundering, Terror Financing: Finance Minister", "description": "Amidst the pioneering fintech revolution, the biggest risk of cryptocurrency could be money laundering and its use for financing terror, said Union Minister of Finance Nirmala Sitharaman on Monday (local time).", "url": "https://www.ndtv.com/india-news/biggest-risk-of-cryptocurrency-could-be-money-laundering-its-use-for-financing-terror-sitharaman-2899322", "urlToImage": "https://c.ndtvimg.com/2022-04/e2bos8vg_nirmala-sitharaman-finance-minister_625x300_19_April_22.jpg", "publishedAt": "2022-04-19T01:08:33Z", "content": "Finance Minister Nirmala Sitharaman reached Washington today on an official visit.\r\nWashington: Amidst the pioneering fintech revolution, the biggest risk of cryptocurrency could be money laundering … [+2724 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "1,170 Kg of Marijuana Worth Rs 2.33 Crore Seized In Andhra Pradesh", "description": "The Directorate of Revenue Intelligence (DRI) has seized 1169.3 kilograms of cannabis (ganja) worth about Rs 2.33 crores from Andhra Pradesh's Anakapalle district.", "url": "https://www.ndtv.com/india-news/nearly-1-170-kg-of-cannabis-worth-rs-2-33-cr-seized-in-andhra-2899308", "urlToImage": "https://c.ndtvimg.com/2022-01/ioflkqfc_andhra-police-generic-650_625x300_30_January_22.jpg", "publishedAt": "2022-04-19T00:53:06Z", "content": "Police crane-lifted and shifted the truck along with its contents, said officials (Representational)\r\nAnakapalle (Andhra Pradesh): The Directorate of Revenue Intelligence (DRI) has seized 1169.3 kilo… [+931 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE: India Reports Over 2,000 New COVID-19 Cases In 24 Hours", "description": "India on Monday reported at least 2,183 fresh Covid cases--- nearly 90 per cent jump compared to Sunday. According to the Union Ministry of Health and Family Welfare, the country also reported 214 more Covid-related deaths, bringing the total number", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-april-19-2899307", "urlToImage": "https://c.ndtvimg.com/2021-04/skl9a748_covid-india_625x300_30_April_21.jpg", "publishedAt": "2022-04-19T00:49:43Z", "content": "India COVID-19 LIVE Updates: The country also reported 214 Covid deaths in the last 24 hours.\r\nNew Delhi: India on Monday reported at least 2,183 fresh Covid cases--- nearly 90 per cent jump from Sun… [+721 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Israel Strikes Gaza In Response To Rocket Attack: Report", "description": "Israel carried out strikes early Tuesday in the Gaza Strip after a rocket was fired from the Palestinian enclave into Israel, witnesses and its ruling Islamist movement said.", "url": "https://www.ndtv.com/world-news/israel-strikes-gaza-in-response-to-rocket-attack-report-2899304", "urlToImage": "https://c.ndtvimg.com/gaza-strip-attack-afp_625x300_1529468152493.jpg", "publishedAt": "2022-04-19T00:16:16Z", "content": "Witnesses in the Gaza Strip reported no injuries from the Israeli raid. (Representational)\r\nGaza City, Palestinian: Israel carried out strikes early Tuesday in the Gaza Strip after a rocket was fired… [+1140 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Joe Biden To Hold Call With Allies Over Ukraine Crisis Today", "description": "U.S. President Joe Biden will on Tuesday hold a call with allies to discuss the Ukraine crisis, including on how to coordinate on holding Russia accountable, the White House said.", "url": "https://www.ndtv.com/world-news/us-president-joe-biden-to-hold-call-with-allies-over-ukraine-crisis-today-2899297", "urlToImage": "https://c.ndtvimg.com/2022-02/jf0i0mi4_joe-biden_625x300_25_February_22.jpg", "publishedAt": "2022-04-18T23:48:34Z", "content": "The White House said that Biden will hold a meeting with US' allies over Ukraine situation.\r\nWashington: U.S. President Joe Biden will on Tuesday hold a call with allies to discuss the Ukraine crisis… [+416 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine Says Russian Army Captures Kreminna City In East", "description": "Russian troops on Monday captured the east Ukraine town of Kreminna, local authorities said, as Kyiv's armed forces launched salvoes on Russian forces in the nearby settlement of Rubizhne.", "url": "https://www.ndtv.com/world-news/ukraine-says-russian-army-captures-kreminna-city-in-east-2899292", "urlToImage": "https://c.ndtvimg.com/2022-04/2134kk8g_ukraine-russia-war-afp-650_625x300_15_April_22.jpg", "publishedAt": "2022-04-18T23:34:39Z", "content": "Kreminna is around 50 kilometres (31 miles) northeast of Kramatorsk.\r\nNovodruzhesk, Ukraine: Russian troops on Monday captured the east Ukraine town of Kreminna, local authorities said, as Kyiv's arm… [+1762 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Swedish Prime Minister Condemns Unrest Over Far-Right Anti-Islamic Rally", "description": "Swedish Prime Minister Magdalena Andersson has condemned the unrest that has engulfed several cities across the country following anti-Muslim and anti-immigration rallies organized by Danish far-right politician Rasmus Paludan.", "url": "https://www.ndtv.com/world-news/swedish-prime-minister-magdalena-andersson-condemns-unrest-over-far-right-anti-islamic-rally-2899287", "urlToImage": "https://c.ndtvimg.com/2022-04/fu1c1md_sweden-riots_625x300_16_April_22.jpg", "publishedAt": "2022-04-18T23:15:18Z", "content": "The police have the evidence to assume that the unrest was organized by criminal groups, she said.\r\nStockholm: Swedish Prime Minister Magdalena Andersson has condemned the unrest that has engulfed se… [+1848 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Israel says Rocket Fired From Gaza Intercepted As Jerusalem Tensions Spike", "description": "Gaza militants fired a rocket into Israel Monday, the Israeli army said, the first such incident in months and a sign that a wave of violence around a Jerusalem holy site could escalate further.", "url": "https://www.ndtv.com/world-news/israel-says-rocket-fired-from-gaza-intercepted-as-jerusalem-tensions-spike-2899284", "urlToImage": "https://c.ndtvimg.com/2021-05/gomfteqg_israel-rocket-afp_625x300_12_May_21.jpg", "publishedAt": "2022-04-18T22:59:22Z", "content": "Hamas had warned on Sunday that \"Al-Aqsa is ours and ours alone.\" (File)\r\nJerusalem: Gaza militants fired a rocket into Israel Monday, the Israeli army said, the first such incident in months and a s… [+4155 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "BJP Trying To Create \"Communal Situation\" In Country: Sharad Pawar", "description": "The BJP and its associates are trying to create \"communal situation\" in the country, NCP chief Sharad Pawar alleged on Monday, comments coming in the backdrop of violence in several states during Ram Navami and Hanuman Jayanti celebrations.", "url": "https://www.ndtv.com/india-news/bjp-associates-trying-to-create-communal-situation-in-country-ncp-chief-sharad-pawar-2899275", "urlToImage": "https://c.ndtvimg.com/2022-03/752h84b_sharad-pawar_625x300_10_March_22.jpg", "publishedAt": "2022-04-18T22:17:36Z", "content": "Mr Pawar said spread of communal ideology is a \"matter of concern.\"\r\nMumbai: The BJP and its associates are trying to create \"communal situation\" in the country, NCP chief Sharad Pawar alleged on Mon… [+2340 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine Says 2nd Phase Of War Started As Russia Launches Attack In East", "description": "Ukraine's presidential chief of staff said on Monday that \"the second phase of the war has started,\" referring to Russia's new assault in eastern Ukraine.", "url": "https://www.ndtv.com/world-news/ukraine-says-2nd-phase-of-war-started-as-russia-launches-attack-in-east-2899270", "urlToImage": "https://c.ndtvimg.com/2022-01/6bm9qbeo_russia-army-reuters_625x300_25_January_22.jpg", "publishedAt": "2022-04-18T21:45:54Z", "content": "Zelensky said on Monday that Russia has started offensive in east Ukraine.\r\nKyiv: Ukraine's presidential chief of staff said on Monday that \"the second phase of the war has started,\" referring to Rus… [+469 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "White House Says Biden Has \"No Plans\" To Visit Ukraine", "description": "President Joe Biden is not planning to visit Kyiv, despite Ukraine's Volodymyr Zelensky urging him to demonstrate US support for the fight against Russia by traveling to the embattled capital, the White House said Monday.", "url": "https://www.ndtv.com/world-news/white-house-says-biden-has-no-plans-to-visit-ukraine-2899264", "urlToImage": "https://c.ndtvimg.com/2022-03/97mfb244_joe-biden-afp_625x300_31_March_22.jpg", "publishedAt": "2022-04-18T21:25:08Z", "content": "Biden's chief spokeswoman also confirmed that there are hopes of reopening the US embassy in Kyiv.\r\nPresident Joe Biden is not planning to visit Kyiv, despite Ukraine's Volodymyr Zelensky urging him … [+1891 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UN Seeks Humanitarian Contact Group For Ukraine As Attacks Intensify", "description": "UN humanitarian chief Martin Griffiths announced Monday that he will meet Turkish President Recep Tayyip Erdogan in Turkey this week to push for the creation of a \"humanitarian contact group\" involving Ukraine and Russia.", "url": "https://www.ndtv.com/world-news/un-seeks-humanitarian-contact-group-for-ukraine-as-russian-attacks-intensify-2899259", "urlToImage": "https://c.ndtvimg.com/2022-04/rsij7lvo_mariupol-ukraine-war-reuters-650_625x300_11_April_22.jpg", "publishedAt": "2022-04-18T21:18:21Z", "content": "UN humanitarian chief said that he planned to arrive in Turkey on Wednesday.\r\nUnited Nations: UN humanitarian chief Martin Griffiths announced Monday that he will meet Turkish President Recep Tayyip … [+1955 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Begins Donbas Offensive In Eastern Ukraine: President Zelensky", "description": "Ukrainian President Volodymyr Zelensky on Monday said Russia's large-scale offensive in the eastern Donbas region had begun.", "url": "https://www.ndtv.com/world-news/russia-begins-donbas-offensive-in-eastern-ukraine-president-volodymyr-zelensky-2899256", "urlToImage": "https://c.ndtvimg.com/2022-03/qp8pef58_z-symbol-russian-tank-650_625x300_07_March_22.jpg", "publishedAt": "2022-04-18T21:03:24Z", "content": "A large Russian offensive in the Donbas region had been predicted by Ukraine's army for weeks.\r\nKyiv: Ukrainian President Volodymyr Zelensky on Monday said Russia's large-scale offensive in the easte… [+1837 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Talks With Putin Stalled Over \"Mass Killings\" In Ukraine: France's Macron", "description": "French President Emmanuel Macron on Monday said that his dialogue with Russian President Vladimir Putin has stalled after mass killings were discovered in Ukraine.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-talks-with-putin-stalled-over-mass-killings-in-ukraine-frances-emmanuel-macron-2899251", "urlToImage": "https://c.ndtvimg.com/2021-10/9dstda2k_macron_625x300_09_October_21.jpg", "publishedAt": "2022-04-18T20:48:20Z", "content": "Macron said he had spoken around 40 times since the start of the war to Ukrainian President Zelenskiy.\r\nParis: French President Emmanuel Macron said on Monday that his dialogue with Russian President… [+1351 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russian Strikes Kill 8 Civilians In East Ukraine: Authorities", "description": "Russian strikes on Monday killed at least eight civilians in the embattled eastern Ukrainian regions of Donetsk and Lugansk, local authorities said.", "url": "https://www.ndtv.com/world-news/russian-strikes-kill-8-civilians-in-east-ukraine-authorities-2899219", "urlToImage": "https://c.ndtvimg.com/2022-02/v8dp80bo_donetsk-ukraine-afp_625x300_22_February_22.jpg", "publishedAt": "2022-04-18T20:00:06Z", "content": "Ukraine on Monday evening confirmed that Kreminna had fallen to Russian forces.\r\nKyiv: Russian strikes on Monday killed at least eight civilians in the embattled eastern Ukrainian regions of Donetsk … [+1448 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Unidentified Gunmen Kill 2 Government Officials In Pakistan: Police", "description": "Unknown gunmen shot dead two excise and narcotics department officials in Pakistan's restive Khyber Pakhtunkhwa province on Monday, police said.", "url": "https://www.ndtv.com/world-news/2-government-officials-killed-in-shooting-in-pakistans-khyber-pakhtunkhwa-2899210", "urlToImage": "https://i.ndtvimg.com/i/2018-03/police-generic-international-afp_650x400_41520126059.jpg", "publishedAt": "2022-04-18T19:41:01Z", "content": "Police and rescue teams rushed to the spot and cordoned off the area. (Representational)\r\nIslamabad:  Unknown gunmen shot dead two excise and narcotics department officials in Pakistan's restive Khyb… [+376 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Court Strikes Down Covid Mask Mandate For Public Transport", "description": "A federal judge on Monday struck down the Covid-19 mask mandate for public transportation imposed by the US Centers for Disease Control and Prevention (CDC).", "url": "https://www.ndtv.com/world-news/us-court-strikes-down-covid-mask-mandate-for-public-transport-2899198", "urlToImage": "https://c.ndtvimg.com/2020-03/o9vr0t1c_us-coronavirus-reuters_625x300_31_March_20.jpg", "publishedAt": "2022-04-18T19:22:52Z", "content": "CDC recently extended face masks until May 3 amid a rise in coronavirus cases.\r\nWashington: A federal judge on Monday struck down the Covid-19 mask mandate for public transportation imposed by the US… [+1164 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "At Least 1,000 Civilians Hiding Under Steel Plant In Mariupol: Official", "description": "No fewer than 1,000 civilians are hiding in underground shelters beneath the vast Azovstal steel plant in the southeastern Ukrainian port city of Mariupol, the city council said.", "url": "https://www.ndtv.com/world-news/at-least-1-000-civilians-hiding-under-ukrainian-steel-plant-in-mariupol-official-2899167", "urlToImage": "https://c.ndtvimg.com/2022-04/b6sic24c_ukraine-mariupol-reuters_625x300_16_April_22.jpg", "publishedAt": "2022-04-18T18:52:30Z", "content": "Russia was dropping heavy bombs onto the Ukrianian-held factory in the besieged city, the council said.\r\nKyiv: No fewer than 1,000 civilians are hiding in underground shelters beneath the vast Azovst… [+570 chars]"}]}