{"status": "ok", "totalResults": 300, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Iran Executed Over 100 People Between January And March: UN Report", "description": "Iran executed more than 100 people in the first three months of 2022, continuing a worrying upward trend, according to a report by UN Secretary-General Antonio Guterres that was presented Tuesday.", "url": "https://www.ndtv.com/world-news/iran-executed-over-100-people-between-january-and-march-un-report-3088982", "urlToImage": "https://i.ndtvimg.com/i/2018-03/death-penalty-generic_650x400_51521527403.jpg", "publishedAt": "2022-06-22T00:21:23Z", "content": "More than 300 individuals were executed in 2021 in Iran, the UN report said. (Representational)\r\nGeneva: Iran executed more than 100 people in the first three months of 2022, continuing a worrying up… [+2971 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Comedian Bill Cosby Found Guilty Of Sexually Assaulting Minor In 1975", "description": "A jury in California found Tuesday that entertainer Bill Cosby sexually assaulted a teenager at the Playboy Mansion almost five decades ago.", "url": "https://www.ndtv.com/world-news/us-comedian-bill-cosby-found-guilty-of-sexually-assaulting-minor-judy-huth-in-1975-3088941", "urlToImage": "https://c.ndtvimg.com/2019-06/58qvhhv8_bill-cosby-reuters_625x300_17_June_19.jpg", "publishedAt": "2022-06-21T23:37:43Z", "content": "US jury found that comedian Bill Cosby sexually assaulted a teen Judy Huth in 70s when she was 16.\r\nLos Angeles: A jury in California found Tuesday that entertainer Bill Cosby sexually assaulted a te… [+1477 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Haven't Left Balasaheb Thackeray's Shiv Sena\": Rebel Eknath Shinde", "description": "Shiv Sena leader Eknath Shinde, who was camping in Gujarat before leaving for Assam with around 33 party MLAs following the cross-voting in Maharashtra Legislative Council (MLC) polls, said that they have not left Balasaheb Thackeray's Shiv Sena.", "url": "https://www.ndtv.com/india-news/maharashtra-political-crisis-havent-left-balasaheb-thackerays-shiv-sena-rebel-eknath-shinde-before-flying-to-guwahati-from-surat-3088934", "urlToImage": "https://c.ndtvimg.com/2022-06/tlul5gb_eknath-shinde_625x300_21_June_22.jpg", "publishedAt": "2022-06-21T23:19:11Z", "content": "Eknath Shinde left for Assam's Guwahati with his MLAs from Surat in the early hours of Wednesday.\r\nSurat: Shiv Sena leader Eknath Shinde, who was camping in Gujarat before leaving for Assam with arou… [+4713 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "6.1 Magnitude Earthquake Hits Afghanistan, Pakistan, No Damage Reported", "description": "An earthquake of magnitude 6.1 hit parts of Afghanistan and Pakistan in the wee hours of Wednesday, the US Geological Survey (USGS) said.", "url": "https://www.ndtv.com/world-news/6-1-magnitude-earthquake-hits-afghanistan-pakistan-no-damage-reported-3088926", "urlToImage": "https://i.ndtvimg.com/i/2017-09/earthquake-generic_650x400_71505899871.jpg", "publishedAt": "2022-06-21T22:57:10Z", "content": "So far, there have been no immediate reports of damage or deaths due to earthquake. (Representational)\r\nIslamabad: An earthquake of magnitude 6.1 hit parts of Afghanistan and Pakistan in the early ho… [+1134 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Presidential Polls: NDA Candidate Likely To File Nomination On June 25", "description": "BJP-led NDA's presidential candidate Droupadi Murmu is likely to her nomination on June 25, said sources on Tuesday.", "url": "https://www.ndtv.com/india-news/presidential-polls-nda-candidate-droupadi-murmu-likely-to-file-nomination-on-june-25-3088911", "urlToImage": "https://c.ndtvimg.com/2022-06/8m40kj58_draupadi-murmu-twitter-650_650x400_21_June_22.jpg", "publishedAt": "2022-06-21T22:35:11Z", "content": "The presidential elections will take place on July 18 and the votes will be counted on July 21.\r\nNew Delhi: BJP-led NDA's presidential candidate Droupadi Murmu is likely to her nomination on June 25,… [+3513 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Lawmakers Probe Trump Pressure On States To Flip Vote", "description": "Arizona's top lawmaker testified Tuesday about the intense pressure Donald Trump piled on him to overturn the 2020 election, as congressional hearings into the former president's bid to cling to power after his defeat entered a third week.", "url": "https://www.ndtv.com/world-news/captiol-riot-probe-us-lawmakers-probe-trump-pressure-on-states-to-flip-vote-3088904", "urlToImage": "https://c.ndtvimg.com/2021-02/37qfcsp8_donald-trump-650_625x300_23_February_21.jpg", "publishedAt": "2022-06-21T22:19:21Z", "content": "Capitol Riots Probe: The committee said that Trump and his allies were personally involved to flip votes.\r\nWashington: Arizona's top lawmaker testified Tuesday about the intense pressure Donald Trump… [+4693 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Lapses Unacceptable\": Kerala Minister On Doctors' Suspension Over Patient's Death", "description": "Kerala Health Minister Veena George justified the suspension of two doctors in connection with the death of a transplant patient at the government Medical College here and said no lapse committed in the treatment of common people was acceptable.", "url": "https://www.ndtv.com/india-news/lapses-unacceptable-kerala-health-minister-veena-george-on-doctors-suspension-over-patients-death-3088894", "urlToImage": "https://c.ndtvimg.com/2021-05/3clf39fg_veena-george_625x300_24_May_21.jpg", "publishedAt": "2022-06-21T21:36:43Z", "content": "Kerala government came under attack after a kidney transplant patient died at a hospital on Monday.\r\nThiruvananthapuram: Kerala Health Minister Veena George on Tuesday justified the suspension of two… [+2802 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Biden Says He Plans To Talk To Xi Jinping, Weighing Tariff Easing", "description": "President Joe Biden said Tuesday he plans to talk with his Chinese counterpart Xi Jinping as he considers lifting some tariffs imposed on Beijing in a bid to ease US inflation.", "url": "https://www.ndtv.com/world-news/us-president-joe-biden-says-he-plans-to-talk-to-xi-jinping-weighing-tariff-easing-on-china-3088884", "urlToImage": "https://c.ndtvimg.com/2022-05/592rr60g_joe-biden-potus_625x300_30_May_22.jpg", "publishedAt": "2022-06-21T21:16:15Z", "content": "According to reports, US is considering lifting some tariffs imposed on Beijing.\r\nWashington: President Joe Biden said Tuesday he plans to talk with his Chinese counterpart Xi Jinping as he considers… [+1196 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Biden Congratulates Colombia's Newly Elected Leftist President", "description": "US President Joe Biden congratulated Colombia's new leftist president, Gustavo Petro, on his election victory in a phone call Tuesday, the White House said.", "url": "https://www.ndtv.com/world-news/biden-congratulates-colombias-newly-elected-leftist-president-gustavo-petro-3088865", "urlToImage": "https://c.ndtvimg.com/2022-05/gb9u61u8_biden-afp_625x300_23_May_22.jpg", "publishedAt": "2022-06-21T20:40:22Z", "content": "Biden and Petro also discussed \"bilateral security and counter-narcotics cooperation.\"\r\nWashington: US President Joe Biden congratulated Colombia's new leftist president, Gustavo Petro, on his electi… [+933 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Top Cop Stabbed, Injured By Colleague At Police Station In Maharashtra", "description": "A senior police inspector was stabbed and injured by a colleague in the police station premises at around 9pm on Tuesday in Maharashtra's Aurangabad city.", "url": "https://www.ndtv.com/india-news/top-cop-stabbed-injured-by-colleague-at-police-station-in-maharashtras-aurangabad-3088839", "urlToImage": "https://c.ndtvimg.com/2022-05/204ao7pg_maharashtra-police_625x300_12_May_22.jpg", "publishedAt": "2022-06-21T20:26:50Z", "content": "The culprit policeman, who stabbed a senior police officer, has been arrested. (Representational)\r\nAurangabad: A senior police inspector was stabbed and injured by a colleague in the police station p… [+515 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "BJP Leader, Expelled For Prophet Remark, Says Didn't Intend To Hurt Feelings", "description": "Expelled BJP spokesperson Naveen Kumar Jindal, along with his family, visited Banke Bihari temple here on Tuesday.", "url": "https://www.ndtv.com/india-news/prophet-row-expelled-bjp-leader-naveen-kumar-jindal-says-his-intention-wasnt-to-hurt-feelings-3088830", "urlToImage": "https://c.ndtvimg.com/2022-04/p2k0df98_naveen-kumar-jindal-bjp-650_625x300_08_April_22.jpg", "publishedAt": "2022-06-21T19:59:26Z", "content": "Expelled BJP leader Naveen Kumar Jindal said he would pray to God for peace in the country. (File)\r\nMathura, Uttar Pradesh: Expelled BJP spokesperson Naveen Kumar Jindal, along with his family, visit… [+1301 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Amid Crisis, Shiv Sena Houses Its MLAs In Mumbai Hotels To Avoid Poaching", "description": "The Shiv Sena has housed its MLAs in different hotels in Mumbai after its senior leader and Maharashtra minister Eknath Shinde rebelled against the party and camped at Surat in Gujarat along with some fellow dissident legislators, an MLA said on Tues", "url": "https://www.ndtv.com/india-news/amid-crisis-shiv-sena-houses-its-mlas-in-mumbai-hotels-to-avoid-poaching-3088781", "urlToImage": "https://c.ndtvimg.com/2020-09/onm1lce_udhav-thackeray_625x300_13_September_20.jpg", "publishedAt": "2022-06-21T19:22:18Z", "content": "Uddhav Thackeray-led Sena has 55 MLAs, of which around 15 are said to be with Mr Shinde. (File)\r\nMumbai: The Shiv Sena has housed its MLAs in different hotels in Mumbai after its senior leader and Ma… [+765 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "FIH Pro League: Indian Women Beat USA 4-2", "description": "Danielle Grega gave USA the lead in the 28th minute through a field effort before the Indians forced their way back into the match by scoring through Deep Grace Ekka (31st), Navneet Kaur (32nd) and Sonika (40th) to take a 3-1 lead", "url": "https://sports.ndtv.com/hockey/fih-pro-league-indian-women-beat-usa-4-2-3088759", "urlToImage": "https://c.ndtvimg.com/2022-06/57mvgki_india-hockey_625x300_22_June_22.jpeg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-21T19:00:35Z", "content": "The Indian women's hockey team came from a goal down to beat USA 4-2 in its first match of the FIH Pro League double-header in Rotterdam on Tuesday. Danielle Grega gave USA the lead in the 28th minut… [+2225 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "At Least 15 Killed In Russian Shelling In Ukraine's Kharkiv: Governor", "description": "An eight-year-old child was among 15 people killed by Russian shelling Tuesday in the eastern Kharkiv region, governor Oleg Synegubov said.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-at-least-15-killed-in-russian-shelling-in-ukraines-kharkiv-governor-3088737", "urlToImage": "https://c.ndtvimg.com/2022-04/4m1qbmfk_ukraine-kharkiv-afp_625x300_17_April_22.jpg", "publishedAt": "2022-06-21T18:46:56Z", "content": "Ukraine War: Kharkiv city was heavily shelled by Moscow's forces at the start of the invasion.\r\nKyiv: An eight-year-old child was among 15 people killed by Russian shelling Tuesday in the eastern Kha… [+1468 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "PM Modi To Attend 14th BRICS Virtual Summit Hosted By China", "description": "14th BRICS Summit: Prime Minister Narendra Modi will join Chinese President Xi Jinping and other leaders for the 14th BRICS virtual summit hosted by China.", "url": "https://www.ndtv.com/india-news/pm-narendra-modi-to-attend-14th-brics-virtual-summit-hosted-by-china-3088720", "urlToImage": "https://c.ndtvimg.com/2019-06/4tmcpr7g_brics-leaders-pti_625x300_28_June_19.jpg", "publishedAt": "2022-06-21T18:37:08Z", "content": "The summit is taking place amid border tensions between India and China. (File)\r\nNew Delhi: Prime Minister Narendra Modi will join Chinese President Xi Jinping and Russian President Vladimir Putin at… [+2669 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Dispute Over Who Will Pay Band Fee, Groom Walks Off His Wedding In UP", "description": "A man walked off his wedding after a dispute between his and the bride's side broke out over who will pay for the brass band, police in Uttar Pradesh's Saharanpur said", "url": "https://www.ndtv.com/cities/dispute-over-who-will-pay-band-fee-groom-walks-off-his-wedding-in-ups-saharanpur-3088701", "urlToImage": "https://c.ndtvimg.com/2021-12/njd9j08o_wedding-generic_625x300_18_December_21.jpg", "publishedAt": "2022-06-21T18:24:29Z", "content": "The groom's side refused to pay and said the bride's said should pay the fee. (Representational)\r\nSaharanpur: A man on Tuesday walked off his wedding after a dispute between his and the bride's side … [+798 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Serena Williams Returns To Tennis In Eastbourne Doubles After Year Out", "description": "Serena Williams, a 23-time Grand Slam singles champion, was back in action for the first time since she made a tearful exit from Wimbledon last year", "url": "https://sports.ndtv.com/tennis/serena-williams-returns-to-tennis-in-eastbourne-doubles-after-year-out-3088700", "urlToImage": "https://c.ndtvimg.com/2022-06/daikl8ig_serena-williams-afp_625x300_14_June_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-21T18:23:20Z", "content": "Serena Williams made her comeback after a year out of tennis as the American legend teamed with Ons Jabeur in the Eastbourne International doubles on Tuesday. Williams, a 23-time Grand Slam singles c… [+1952 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Unwell Ben Stokes Misses England Training Ahead Of Third Test vs NZ", "description": "An England and Wales Cricket Board spokesperson indicated that Stokes had tested negative for Covid-19 on Tuesday morning. Stokes is being kept away from the group as a precautionary measure.", "url": "https://sports.ndtv.com/cricket/unwell-ben-stokes-misses-england-training-ahead-of-third-test-vs-new-zealand-3088680", "urlToImage": "https://c.ndtvimg.com/2022-06/htdsbfgg_ben-stokes-afp_625x300_10_June_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-21T18:17:28Z", "content": "England captain Ben Stokes missed training after feeling unwell on Tuesday as his side started their preparations for the Headingley Test. Stokes was absent while the rest of the squad trained ahead … [+2970 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "China Becomes Biggest Russian Oil Importer Amid Sanctions: Report", "description": "China's imports of oil from Moscow in May have risen 55 per cent year on year, making it the biggest Russian oil importer amid sanctions over the Ukraine war, Al Jazeera reported.", "url": "https://www.ndtv.com/world-news/china-becomes-russias-biggest-oil-importer-amid-sanctions-report-3088675", "urlToImage": "https://c.ndtvimg.com/2020-03/kl0o7hto_crude-oil-daqing-oil-field-china--reuters_625x300_13_March_20.jpg", "publishedAt": "2022-06-21T18:11:42Z", "content": "China has been Russia's biggest market for crude oil since 2016. (Representational)\r\nBeijing: Beijing's imports of oil from Moscow in May have risen 55 per cent year on year, making it the biggest Ru… [+1551 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sena Minister Questioned For 10 Hours By Probe Agency, Called Again", "description": "Maharashtra Transport Minister Anil Parab appeared before the Enforcement Directorate on Tuesday in connection with a money laundering probe. He was questioned for 10 hours today and has been summoned again tomorrow.", "url": "https://www.ndtv.com/india-news/maharashtra-minister-anil-parab-questioned-for-10-hours-by-probe-agency-called-again-3088656", "urlToImage": "https://c.ndtvimg.com/2022-06/fheq80a4_anil-parab-650_625x300_21_June_22.jpg", "publishedAt": "2022-06-21T18:00:53Z", "content": "Anil Parab is a three-time Shiv Sena legislator in the Maharashtra Legislative Council.\r\nNew Delhi: Maharashtra Transport Minister Anil Parab appeared before the Enforcement Directorate on Tuesday in… [+1063 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Proud Moment\": Naveen Patnaik On Droupadi Murmu's Presidential Candidacy", "description": "Expressing his happiness over the nomination of Droupadi Murmu as the BJP-led NDA's presidential nominee, BJD supremo and Odisha Chief Minister Naveen Patnaik said it was a proud moment for the people of his state.", "url": "https://www.ndtv.com/india-news/proud-moment-naveen-patnaik-on-droupadi-murmus-presidential-candidacy-3088650", "urlToImage": "https://c.ndtvimg.com/2019-01/ne25j4to_naveen-patnaik-pti_625x300_08_January_19.jpg", "publishedAt": "2022-06-21T18:00:10Z", "content": "Droupadi Murmu will be the first person from Odisha to occupy the presidential post if elected. (File)\r\nNew Delhi: Expressing his happiness over the nomination of Droupadi Murmu as the BJP-led NDA's … [+1564 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Charith Asalanka, Spinners Help Sri Lanka Clinch ODI Series Vs Australia", "description": "The left-handed Asalanka made 110 to guide Sri Lanka to 258 all out, a total that proved just enough to hand the hosts an unbeatable 3-1 lead in the five-match series", "url": "https://sports.ndtv.com/cricket/charith-asalanka-spinners-help-sri-lanka-clinch-odi-series-against-australia-3088645", "urlToImage": "https://c.ndtvimg.com/2022-06/ae5adp38_charith-asalanka_625x300_21_June_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-21T17:56:55Z", "content": "Charith Asalanka's maiden one-day international century and an inspired spin attack led Sri Lanka to a thrilling four-run series-clinching win over Australia on Tuesday. The left-handed Asalanka made… [+2214 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "What BJP's Choice For President Said On Her Nomination", "description": "The ruling NDA's Presidential candidate Droupadi Murmu Tuesday said she was optimistic of getting the support of all the MLAs and MPs from Odisha cutting across party lines as the daughter of the soil.", "url": "https://www.ndtv.com/india-news/what-droupadi-murmu-bjps-choice-for-president-said-on-her-nomination-3088631", "urlToImage": "https://c.ndtvimg.com/2022-06/cttn5u2o_draupadi-murmu-ndtv-650_650x400_21_June_22.jpg", "publishedAt": "2022-06-21T17:52:47Z", "content": "Droupadi Murmu, born in the Santhal community, began her political career as a councilor\r\nRairangpur (Odisha): The ruling NDA's Presidential candidate Droupadi Murmu Tuesday said she was optimistic o… [+2751 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Elderly Man Killed By Swarm Of Bees In Telangana, 10 Injured", "description": "An elderly person was killed and 10 others were injured after a swarm of bees attacked them in Jagtial district in Telangana", "url": "https://www.ndtv.com/telangana-news/elderly-man-killed-by-swarm-of-bees-in-telangana-10-injured-3088608", "urlToImage": "https://c.ndtvimg.com/2022-05/74omfd28_bees-650_625x300_22_May_22.jpg", "publishedAt": "2022-06-21T17:45:03Z", "content": "The injured were shifted to Government Headquarters hospital, police said. (Representational)\r\nKarimnagar, Telangana: An elderly person was killed and 10 others were injured after a swarm of bees att… [+720 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ashok Gehlot's Rajasthan Deja Vu As Maharashtra Crisis Unravels", "description": "Even as the Maharashtra government faces a crisis, Rajasthan Chief Minister Ashok Gehlot on Tuesday said the BJP tried to bribe Congress legislators in his state too, offering them Rs 10 crore each, but they continued to support him.", "url": "https://www.ndtv.com/india-news/ashok-gehlots-rajasthan-deja-vu-as-maharashtra-crisis-unravels-3088580", "urlToImage": "https://c.ndtvimg.com/2022-03/0g9uqq0s_ashok-gehlot-pti_625x300_15_March_22.jpg", "publishedAt": "2022-06-21T17:34:55Z", "content": "Ashok Gehlot weathered the storm for almost a month but managed to save his government.(FILE)\r\nNew Delhi: Even as the Maharashtra government faces a crisis, Rajasthan Chief Minister Ashok Gehlot on T… [+3673 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Mumbai Metro Driver, Facing Financial Strains, Dies By Suicide: Cops", "description": "A 27-year-old Mumbai Metro train driver allegedly died by suicide at his residence in Mumbai, apparently due to financial problems, a police official said on Tuesday.", "url": "https://www.ndtv.com/mumbai-news/mumbai-metro-driver-facing-financial-strains-dies-by-suicide-cops-3088572", "urlToImage": "https://c.ndtvimg.com/2022-06/ars722ac_police-generic_625x300_14_June_22.jpg", "publishedAt": "2022-06-21T17:32:17Z", "content": "Police said that no suicide note has been found. (Representational)\r\nMumbai: A 27-year-old Mumbai Metro train driver allegedly died by suicide at his residence in Mumbai, apparently due to financial … [+1056 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Confident That Droupadi Murmu Will Be A Great President\", Says PM", "description": "Droupadi Murmu: Prime Minister Narendra Modi tweeted that the former Jharkhand governor has devoted her life to serving society and expressed confidence that she will be a \"great President\".", "url": "https://www.ndtv.com/india-news/confident-that-draupadi-murmu-will-be-a-great-president-says-pm-narendra-modi-3088552", "urlToImage": "https://c.ndtvimg.com/2022-06/mgu1m9io_draupadi-murmu-pm-modi-twitter-650_650x400_21_June_22.jpg", "publishedAt": "2022-06-21T17:24:02Z", "content": "Droupadi Murmu's compassionate nature will benefit the country, PM Modi said. (File)\r\nNew Delhi: Soon after Droupadi Murmu was named as the BJP-led NDA's presidential candidate, Prime Minister Narend… [+1396 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Sadio Mane Poses in Bayern Shirt During Munich Medical Check", "description": "Broadcaster Sky showed footage of the 30-year-old touching down at Munich airport before being taken to a hospital in the city centre for a medical exam by Bayern's team doctor.", "url": "https://sports.ndtv.com/football/sadio-mane-poses-in-bayern-shirt-during-munich-medical-check-3088500", "urlToImage": "https://c.ndtvimg.com/2022-06/u8vhqpe8_sadio-mane_625x300_21_June_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-21T17:03:35Z", "content": "Sadio Mane signed autographs wearing a Bayern Munich shirt Tuesday after flying to Germany for a medical check before the Liverpool forward completes a move to the Bundesliga champions. Broadcaster S… [+950 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US To Reduce Nicotine In Cigarettes To Non-Addictive Levels: Report", "description": "President Joe Biden's administration is set to announce a new policy requiring cigarette producers to reduce nicotine to non-addictive levels, US media reported Tuesday,a move that would deal a powerful blow to the tobacco industry.", "url": "https://www.ndtv.com/world-news/us-to-reduce-nicotine-in-cigarettes-to-non-addictive-levels-report-3088459", "urlToImage": "https://c.ndtvimg.com/japan-smoking-generic-istock_625x300_1529576082053.jpg", "publishedAt": "2022-06-21T16:53:41Z", "content": "Some 13.7 percent of all US adults are current cigarette smokers. (Representational)\r\nWashington: President Joe Biden's administration is set to announce a new policy requiring cigarette producers to… [+2540 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "He'll Return, Uddhav Thackeray Says At Meeting About Eknath Shinde", "description": "Amid a political crisis growing bigger by the hour in Maharashtra, Chief Minister Uddhav Thackeray told party leaders that the sulking Minister, Eknath Shinde, camping in Surat with 21 MLAs, will return to the party fold.", "url": "https://www.ndtv.com/india-news/hell-return-uddhav-thackeray-says-at-meeting-about-eknath-shinde-3088436", "urlToImage": "https://c.ndtvimg.com/2022-06/g4ktb6do_uddhav-thackeray-650_625x300_19_June_22.jpg", "publishedAt": "2022-06-21T16:47:57Z", "content": "Mumbai: Amid a political crisis growing bigger by the hour in Maharashtra, Chief Minister Uddhav Thackeray told party leaders that the sulking Minister, Eknath Shinde, camping in Surat with 21 MLAs, … [+1702 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Real Estate Firm Fined Rs 100 Crore By Pollution Control Board In Gurgaon", "description": "The Central Pollution Control Board has imposed a fine of Rs 100 crore on real estate conglomerate Ansal Properties and Infrastructure Limited for violating several environmental laws at a residential project in Gurugram.", "url": "https://www.ndtv.com/gurgaon-news/real-estate-firm-fined-rs-100-crore-by-pollution-control-board-in-gurgaon-3088430", "urlToImage": "https://i.ndtvimg.com/i/2016-07/national-green-tribunal_650x400_41469833761.jpg", "publishedAt": "2022-06-21T16:44:27Z", "content": "A NGT panel found that the firm did not have environmental clearance for the project.\r\nNew Delhi: The Central Pollution Control Board has imposed a fine of Rs 100 crore on real estate conglomerate An… [+1885 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "You Decide Whom To Give \"Rampuri\" Knife Says Yogi Adityanath To Voters", "description": "UP Bypolls: Chief Minister Yogi Adityanath while addressing a rally in Uttar Pradesh's Rampur urged voters to place the \"Rampuri Knife\" in the right hands as it will protect the poor.", "url": "https://www.ndtv.com/india-news/up-bypolls-you-decide-whom-to-give-rampuri-knife-says-yogi-adityanath-to-voters-in-rampur-3088420", "urlToImage": "https://c.ndtvimg.com/2022-02/mkcddahg_yogi-adityanathuplakhimpur-kheripti_625x300_20_February_22.jpg", "publishedAt": "2022-06-21T16:41:46Z", "content": "Uttar Pradesh's Rampur is known for the knives it produces. (File)\r\nRampur: Uttar Pradesh Chief Yogi Adityanath on Tuesday urged voters to place the Rampuri knife in the right hands as with them it w… [+2696 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"She Will Be A Great President\": PM On BJP's Raisina Pick Draupadi Murmu", "description": "Draupadi Murmu, a tribal leader of the BJP from Odisha, is the ruling NDA's candidate for the Presidential election. \"I am confident she will be a great President of our nation,\" said PM Narendra Modi in his congratulatory tweet.", "url": "https://www.ndtv.com/india-news/president-polls-pm-modi-on-bjps-raisina-pick-draupadi-murmu-she-will-be-a-great-president-3088417", "urlToImage": "https://c.ndtvimg.com/2022-06/mgu1m9io_draupadi-murmu-pm-modi-twitter-650_650x400_21_June_22.jpg", "publishedAt": "2022-06-21T16:41:01Z", "content": "I am confident she will be a great President of our nation, said PM Modi on Draupadi Murmu.\r\nNew Delhi: Draupadi Murmu, a tribal leader of the BJP from Odisha, is the ruling NDA's candidate for the P… [+1928 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Private School Asks EWS Students To Clear Dues Of Rs 67,000", "description": "All private schools in Delhi are required to reserve 25 per cent of seats for EWS and disadvantaged group students during admissions at the entry level.", "url": "https://www.ndtv.com/education/private-school-asks-ews-students-to-clear-dues-of-rs-67000-delhi-government-says-looking-into-issue", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/6/21/shutterstock_2044525388.jpg", "publishedAt": "2022-06-21T16:34:40Z", "content": "New Delhi:At least 14 students who had been admitted to a top private school here under the EWS quota have been asked to clear dues of over Rs 67,000 in fees for the first term of this academic year … [+2123 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Who Is Draupadi Murmu, BJP's Pick For President", "description": "Draupadi Murmu, a tribal woman leader, is the Modi government's pick for presidential race. Earlier in the day, Yashwant Sinha was named the opposition's joint opposition candidate for the polls.", "url": "https://www.ndtv.com/india-news/who-is-draupadi-murmu-bjps-pick-for-president-3088316", "urlToImage": "https://c.ndtvimg.com/2022-06/dk2sond8_murmu-650_625x300_21_June_22.jpg", "publishedAt": "2022-06-21T16:09:34Z", "content": "New Delhi: Draupadi Murmu, a tribal woman leader, is the Modi government's pick for presidential race. Earlier in the day, Yashwant Sinha was named the joint opposition candidate for the polls.\r\nIf e… [+847 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Man Convicted Of Raping Minor Consumes Poison In Kerala Court To End Life", "description": "A man allegedly tried to kill himself by consuming poison in a court building in Kerala on Tuesday soon after a POCSO court punished him for raping a minor girl four years ago.", "url": "https://www.ndtv.com/kerala-news/man-convicted-of-raping-minor-consumes-poison-in-kerala-court-to-end-life-3088310", "urlToImage": "https://i.ndtvimg.com/i/2016-06/court-generic_650x400_71465821031.jpg", "publishedAt": "2022-06-21T16:07:35Z", "content": "The court sentenced the man 48-years in jail for raping the minor. (Representational)\r\nThrissur, Kerala: A man allegedly tried to kill himself by consuming poison in a court building in Kerala on Tue… [+669 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Draupadi Murmu, Former Jharkhand Governor, Is BJP's Choice For President", "description": "Draupadi Murmu, the former Governor of Jharkhand, has been named as the BJP's choice for the post of President. Ms Murmu, a tribal from Odisha, will be pitted against former Union minister Yashwant Sinha, the opposition candidate.", "url": "https://www.ndtv.com/india-news/draupadi-murmu-former-jharkhand-governor-is-bjps-choice-for-president-3088291", "urlToImage": "https://c.ndtvimg.com/2022-06/mgu1m9io_draupadi-murmu-pm-modi-twitter-650_650x400_21_June_22.jpg", "publishedAt": "2022-06-21T15:59:22Z", "content": "Draupadi Murmu, the former Governor of Jharkhand, has been named as the BJP's choice for the post of President. Ms Murmu, a tribal from Odisha, will be pitted against former Union minister Yashwant S… [+701 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Arvind Kejriwal's Deputy Faces Rs 100 Crore Defamation Case", "description": "Delhi Deputy Chief Minister Manish Sisodia faces a Rs 100 crore civil defamation case by Assam Chief Minister Himanta Biswa Sarma's wife, Riniki Bhuyan Sharma.", "url": "https://www.ndtv.com/india-news/arvind-kejriwals-deputy-faces-rs-100-crore-defamation-case-3088284", "urlToImage": "https://c.ndtvimg.com/2022-06/62thmb08_manish-sisodia-ndtv_625x300_04_June_22.jpg", "publishedAt": "2022-06-21T15:57:44Z", "content": "Guwahati: Delhi Deputy Chief Minister Manish Sisodia faces a Rs 100 crore civil defamation case by Assam Chief Minister Himanta Biswa Sarma's wife, Riniki Bhuyan Sharma.\r\nEarlier this month, Mr Sisod… [+988 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "450 Pilgrims Reach Pakistan For Maharaja Ranjit Singh's Death Anniversary", "description": "A group of 450 Sikh pilgrims on Tuesday arrived in Pakistan's Lahore from India to observe the 183rd death anniversary of the first ruler of the Sikh Empire, Maharaja Ranjit Singh.", "url": "https://www.ndtv.com/india-news/450-sikh-pilgrims-reach-pakistan-for-maharaja-ranjit-singhs-death-anniversary-3088274", "urlToImage": "https://c.ndtvimg.com/2022-06/ofof1cqo_sikh-pilgrims_625x300_21_June_22.jpg", "publishedAt": "2022-06-21T15:53:10Z", "content": "Sikh pilgrims before leaving for Pakistan.\r\nLahore: A group of 450 Sikh pilgrims on Tuesday arrived in Pakistan's Lahore from India to observe the 183rd death anniversary of the first ruler of the Si… [+1520 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Congress Directs Its Gujarat MLAs To Reach Delhi On June 22", "description": "The All India Congress Committee has its MLAs from Gujarat to travel to Delhi on Wednesday, a party leader said today.", "url": "https://www.ndtv.com/india-news/congress-directs-its-gujarat-mlas-to-reach-delhi-on-june-22-3088255", "urlToImage": "https://c.ndtvimg.com/2018-11/4ubb0l7s_congress-flag-generic-afp_625x300_06_November_18.jpg", "publishedAt": "2022-06-21T15:47:47Z", "content": "Sonia Gandhi has been summoned by the Enforcement Directorate on June 23. (Representational)\r\nAhmedabad: Amid protests against Rahul Gandhi's questioning by the Enforcement Directorate (ED) and the C… [+1013 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Racoons Play With Soap Bubbles, Internet Finds Video \"Too Cute For Words\"", "description": "Videos of animals and their innocent behaviour are very popular on social media. One of the short clips posted on Twitter is a perfect example. It shows two raccoons playing with soap bubbles along with a dog.", "url": "https://www.ndtv.com/offbeat/racoons-play-with-soap-bubbles-internet-finds-video-too-cute-for-words-3088249", "urlToImage": "https://c.ndtvimg.com/2022-06/vejbjmi8_cute-raccoons-240_625x300_21_June_22.jpg", "publishedAt": "2022-06-21T15:46:06Z", "content": "Picture shows two raccoons playing with soap bubbles along with a dog.\r\nVideos of animals and their innocent behaviour are very popular on social media. One of the short clips posted on Twitter is a … [+1182 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Ranji Trophy Final, Mumbai vs Madhya Pradesh: When And Where To Watch?", "description": "Mumbai and Madhya Pradesh will square off in the finals of the Ranji Trophy in Bengaluru", "url": "https://sports.ndtv.com/cricket/ranji-trophy-final-mumbai-vs-madhya-pradesh-when-and-where-to-watch-live-telecast-live-streaming-3088246", "urlToImage": "https://c.ndtvimg.com/2020-11/h6i1pnfg_cricket-bat-ball-afp_625x300_20_November_20.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-21T15:44:11Z", "content": "Mumbai and Madhya Pradesh are all set to square off in the finals of the Ranji Trophy in Bengaluru beginning Wednesday and it is safe to say that the Prithvi Shaw-led side are the overwhelming favour… [+1560 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Rani Rampal Misses Out As India Name FIH Women's Hockey World Cup Squad", "description": "Savita Punia will continue to lead the Indian team with Deep Grace Ekka remaining her deputy.", "url": "https://sports.ndtv.com/hockey/rani-rampal-misses-out-as-india-name-fih-womens-hockey-world-cup-squad-3088223", "urlToImage": "https://c.ndtvimg.com/2021-08/har13mu8_rani-rampal-twitter_650x400_02_August_21.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-21T15:38:56Z", "content": "Talismanic striker and former skipper Rani Rampal was on Tuesday axed from the 18-member Indian women's hockey team, to be led by goalkeeper Savita Punia, for next month's FIH World Cup. Rani, an ins… [+3312 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Delhi Schools Set To Reopen After Summer Break Amid Rise In Covid Case", "description": "According to school principals, while coronavirus is posing new threats, there is a need for parents to understand that the pandemic is nearing the endemic phase and one should get accustomed to living with it.", "url": "https://www.ndtv.com/education/delhi-schools-set-to-reopen-after-summer-break-amid-rise-in-covid-cases", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/6/21/shutterstock_2017940915.jpg", "publishedAt": "2022-06-21T15:33:42Z", "content": "New Delhi:With schools set to reopen from July 1 following summer vacation, rising Covid cases in Delhi-NCR have sparked concerns among parents even as principals said there should be no more disrupt… [+4020 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Amruta Fadnavis Takes Dig at CM Thackeray, Then Deletes Tweet", "description": "Devandra Fadnavis's Wife Amruta Takes Dig at Thackeray, Then Deletes Tweet", "url": "https://www.ndtv.com/india-news/devandra-fadnaviss-wife-amruta-takes-dig-at-thackeray-then-deletes-tweet-3088191", "urlToImage": "https://c.ndtvimg.com/2021-04/bcgf5aso_amruta-fadnavis_625x300_07_April_21.jpg", "publishedAt": "2022-06-21T15:31:06Z", "content": "Amruta Fadnavis is a banker, playback singer and social worker, according to her Twitter bio.\r\nMumbai: Amruta Fadnavis, Maharashtra BJP leader Devendra Fadnavis's wife, took an apparent dig at Chief … [+1683 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Why Ikea's Looking At Sourcing More Indian Products", "description": "Ikea India plans to source more products locally to combat rising inflation, as the Swedish furniture group looks to connect better with the country's burgeoning middle class, a top executive said on Tuesday.", "url": "https://www.ndtv.com/india-news/why-ikeas-looking-at-sourcing-more-indian-products-3088129", "urlToImage": "https://c.ndtvimg.com/2022-06/o6thaljo_ikea-reuters_625x300_21_June_22.jpg", "publishedAt": "2022-06-21T15:12:53Z", "content": "Ikea sources about 25-27% of its products locally with five suppliers in Karnataka.\r\nIkea India plans to source more products locally to combat rising inflation, as the Swedish furniture group looks … [+1852 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Then, Now And Forever\": Rubina Dilaik Shares Wedding Throwback", "description": "Abhinav Shukla too wished Rubina Dilaik on 4th wedding anniversary", "url": "https://www.ndtv.com/entertainment/us-then-now-and-forever-rubina-dilaik-shares-wedding-throwback-with-abhinav-shukla-on-anniversary-3088115", "urlToImage": "https://c.ndtvimg.com/2022-06/v7g9olr_rubina_625x300_21_June_22.jpg", "publishedAt": "2022-06-21T15:10:34Z", "content": "Rubina Dilaik with Abhinav. (courtesy: rubinadilaik)\r\nNew Delhi: TV stars Rubina Dilaik and Abhinav Shukla celebrated their 4th wedding anniversary by sharing special posts on social media. Rubina, w… [+1302 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Man Plays 'Pasoori' On Rabab In Viral Video, Internet Amazed", "description": "A Kashmiri artist has released another instrumental version of the song 'Pasoori' on a Kashmiri Rabab. It shows the craze of the song is not yet over.", "url": "https://www.ndtv.com/offbeat/man-plays-pasoori-on-rabab-in-viral-video-internet-amazed-3088108", "urlToImage": "https://c.ndtvimg.com/2022-06/9qq8e0s8_sufiyan-malik-240_625x300_21_June_22.jpg", "publishedAt": "2022-06-21T15:06:31Z", "content": "Mr Malik is a musician and an award-winning Kashmiri Rabab player.\r\nThe craze of 'Pasoori' is far from over. There are different videos on social media where people can be seen singing the famous son… [+1550 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "'Agniveers' Will Be Eligible For Gallantry Awards Says Top Army Officer", "description": "Agnipath Scheme: 'Agniveers' will be eligible for gallantry awards, the Department of Military Affairs said on Tuesday in the backdrop of protests against the Agnipath scheme in different parts of the country.", "url": "https://www.ndtv.com/india-news/agniveers-will-be-eligible-for-gallantry-awards-says-lt-general-anil-puri-department-of-military-affairs-3088047", "urlToImage": "https://c.ndtvimg.com/2022-06/952pddso_indian-army-facebook-page_625x300_14_June_22.jpg", "publishedAt": "2022-06-21T14:53:46Z", "content": "Lt General Anil Puri said the selection process will be fair, transparent, objective. (Representational)\r\nNew Delhi: Agniveers will be eligible for gallantry awards, the Department of Military Affair… [+3371 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Prithvi Shaw Opens Up On Making A Return To National Side", "description": "Opening batter Prithvi Shaw last played for India in July 2021. He has represented the nation in 12 games at the senior level.", "url": "https://sports.ndtv.com/cricket/comeback-to-the-indian-team-prithvi-shaw-opens-up-on-making-a-return-to-national-side-3088039", "urlToImage": "https://c.ndtvimg.com/2021-11/n9ojd6_prithvi-shaw-afp_625x300_29_November_21.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-21T14:50:49Z", "content": "Only three half-centuries in five Ranji Trophy games doesn't match the lofty standards that he has set for himself but a pragmatic Mumbai captain Prithvi Shaw also knows that cricket is mirror image … [+4684 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Wasim Jaffer's Epic Reply To Michael Vaughan After Ex-Captain Trolls Him", "description": "The recent Twitter banter between Wasim Jaffer and Michael Vaughan is hilarious", "url": "https://sports.ndtv.com/cricket/wasim-jaffers-epic-reply-to-michael-vaughan-goes-viral-after-ex-england-captain-trolls-him-3088020", "urlToImage": "https://c.ndtvimg.com/2022-06/4ge4d5cg_wasim-jaffer_625x300_21_June_22.jpg", "publishedAt": "2022-06-21T14:44:15Z", "content": "Michael Vaughan and Wasim Jaffer's banter on social media is legendary. The former England cricket team captain and the ex-Indian cricket team player have often pulled each other's leg on Twitter and… [+1799 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Development Of NCF For School Education Huge Decentralised Consltation", "description": "The development of National Curriculum Framework for school education is a huge consultative exercise, not limited in any way, to the national level, NCERT official said.", "url": "https://www.ndtv.com/education/development-of-curriculum-for-school-education-huge-decentralised-consultation-exercise-ncert", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/6/21/shutterstock_213333985.jpg", "publishedAt": "2022-06-21T14:43:50Z", "content": "New Delhi:The development of National Curriculum Framework (NCF) for school education is a huge decentralised consultation exercise right from villages and cities to states and Union ministries, NCER… [+4508 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Infrastructure Facilities At Govt Schools In Gujarat Almost On Par", "description": "The Gujarat High Court observed that steps taken by the state authorities in improving school infrastructure are not only satisfactory, but also almost on par with private institutions.", "url": "https://www.ndtv.com/education/infrastructure-facilities-at-government-schools-in-gujarat-almost-on-par-with-private-institutions-high-court", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/6/21/shutterstock_345916943.jpg", "publishedAt": "2022-06-21T14:41:35Z", "content": "Ahmedabad:The Gujarat High Court on Tuesday observed that steps taken by the state authorities in improving school infrastructure are not only satisfactory, but also almost on par with private instit… [+3197 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "What Rebel Eknath Shinde Told Uddhav Thackeray In 10-Minute Call", "description": "A 10-minute telephone conversation between Maharashtra Chief Minister Uddhav Thackeray and Shiv Sena rebel Eknath Shinde this evening, has failed to suggest a way out of the impasse.", "url": "https://www.ndtv.com/india-news/what-rebel-eknath-shinde-told-uddhav-thackeray-in-10-minute-call-3088006", "urlToImage": "https://c.ndtvimg.com/2022-06/ers4d45s_uddhav-thackeray-650_625x300_21_June_22.jpg", "publishedAt": "2022-06-21T14:41:19Z", "content": "Maharashtra Chief Minister Uddhav Thackeray sent his emissary to meet Eknath Shinde\r\nNew Delhi: A 10-minute telephone conversation between Maharashtra Chief Minister Uddhav Thackeray and Shiv Sena re… [+1249 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "International Yoga Day: Milind Soman Doing What He Does Best", "description": "\"Now that Ankita Konwar is a certified yoga instructor, I am sure I will improve a lot,\" wrote Milind Soman", "url": "https://www.ndtv.com/entertainment/international-yoga-day-milind-soman-doing-what-he-does-best-with-a-little-help-from-wife-ankita-konwar-3087975", "urlToImage": "https://c.ndtvimg.com/2022-06/rko3797g_milind-soman_625x300_21_June_22.jpg", "publishedAt": "2022-06-21T14:35:49Z", "content": "Milind Soman with wife Ankita. (courtesy: milindusharunning)\r\nNew Delhi: As if Milind Soman wouldn't share a post on International Yoga Day. The actor-model, who has quite a reputation as one of the … [+1838 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "International Yoga Day: Commuters Perform Yoga Inside Mumbai Local Trains", "description": "On the occasion of International Yoga Day commuters were seen practicing yoga in Mumbai local trains - captured the hearts of people all over the social media.", "url": "https://www.ndtv.com/india-news/international-yoga-day-commuters-perform-yoga-inside-mumbai-local-trains-3087965", "urlToImage": "https://c.ndtvimg.com/2022-06/9sndlpv_yoga-in-mumbai-local-240_625x300_21_June_22.jpg", "publishedAt": "2022-06-21T14:34:20Z", "content": "Women striking different yoga poses on the instruction of teachers inside the women's coach.\r\nOn the occasion of International Yoga Day, numerous photographs and videos flooded social media showing p… [+1965 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Biocon Biologics Denies Bribery Charge, Says Followed Regulations", "description": "Biocon Biologics has denied allegations of bribery against the company and its officials regarding approval for one of its products in India", "url": "https://www.ndtv.com/business/biocon-biologics-denies-bribery-charge-says-it-follows-due-regulatory-process-for-product-approvals-3087898", "urlToImage": "https://c.ndtvimg.com/md8orq4g_biocon---company-website_625x300_26_July_18.jpg", "publishedAt": "2022-06-21T14:33:47Z", "content": "Biocon Biologics has denied allegations of bribery against the company and officials\r\nNew Delhi: Biocon Biologics, an arm of Biocon Ltd, on Tuesday denied allegations of bribery against the company a… [+3237 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rahul Gandhi Questioned For 10 Hours Without Break; 50 Hours In 5 Days", "description": "Rahul Gandhi is facing the probe for alleged money-laundering via companies related to the National Herald newspaper", "url": "https://www.ndtv.com/india-news/rahul-gandhi-leaves-enforcement-directorate-office-after-10-hour-questioning-without-break-on-day-5-3087964", "urlToImage": "https://c.ndtvimg.com/2022-06/t8h7q4n8_rahul-gandhi-ed-ani-650_650x400_14_June_22.jpg", "publishedAt": "2022-06-21T14:33:43Z", "content": "Rahul Gandhi, Congress MP from Wayanad in Kerala, is facing a probe for alleged money-laundering. (File)\r\nNew Delhi: Congress leader Rahul Gandhi was given a half-an-hour break by the Enforcement Dir… [+2166 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Total Consensus Among Countries On Ukraine Joining Bloc\": EU", "description": "EU ministers on Tuesday backed granting war-torn Ukraine \"candidate status\" to join the bloc, ahead of a summit expected to formally greenlight the move later this week, France's EU minister said.", "url": "https://www.ndtv.com/world-news/total-consensus-among-countries-on-ukraine-joining-bloc-eu-3087955", "urlToImage": "https://c.ndtvimg.com/2022-06/0nnfarn_ukraine-zelensky-afp_625x300_11_June_22.jpg", "publishedAt": "2022-06-21T14:31:40Z", "content": "The EU is set to impose conditions on Ukraine over judicial reforms and tackling corruption.\r\nBrussels: EU ministers on Tuesday backed granting war-torn Ukraine \"candidate status\" to join the bloc, a… [+2286 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Asian News International", "title": "It's All About Players: Mumbai Coach Amol Muzumdar Ahead Of Ranji Final", "description": "Mumbai, who are 41-time champions have reached their 47th Ranji Trophy final overall and their first since 2016-17.", "url": "https://sports.ndtv.com/cricket/it-is-all-about-the-players-mumbai-coach-amol-muzumdar-ahead-of-ranji-trophy-final-vs-madhya-pradesh-3087949", "urlToImage": "https://i.ndtvimg.com/i/2018-03/amol-muzumdar-instagram_806x605_51520938717.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-21T14:28:11Z", "content": "Ahead of his team's Ranji Trophy final against Madhya Pradesh, Mumbai head coach Amol Muzumdar has said that the occasion is all about the players. Mumbai, who are 41-time champions have reached thei… [+2672 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Asian News International", "title": "It's All About Players: Mumbai Coach Amol Muzumdar Ahead Of Ranji Final", "description": "Mumbai, who are 41-time champions, have reached their 47th Ranji Trophy final overall and their first since 2016-17.", "url": "https://sports.ndtv.com/cricket/it-is-all-about-the-players-mumbai-coach-amol-muzumdar-ahead-of-ranji-trophy-final-vs-madhya-pradesh-3087948", "urlToImage": "https://i.ndtvimg.com/i/2018-03/amol-muzumdar-instagram_806x605_51520938717.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-21T14:28:11Z", "content": "Ahead of his team's Ranji Trophy final against Madhya Pradesh, Mumbai head coach Amol Muzumdar has said that the occasion is all about the players. Mumbai, who are 41-time champions have reached thei… [+2672 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Recession Not Really, At Worst A Slowdown: Janet Yellen", "description": "US Treasury Secretary Janet Yellen has said that though the economy may slow down in the coming months, \"a recession is not inevitable\"", "url": "https://www.ndtv.com/business/a-us-recession-not-really-at-worst-a-sharp-slowdown-janet-yellen-3087927", "urlToImage": "https://i.ndtvimg.com/i/2016-08/janet-yellen_650x400_81472226683.jpg", "publishedAt": "2022-06-21T14:23:49Z", "content": "US Treasury Secretary Janet Yellen has ruled out fears of a recession\r\nAmid threats of a US recession, the country's Treasury Secretary Janet Yellen has said that though the economy may slow down in … [+1801 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Twitter Accounts Hyped Company Seeking Covid Vaccine Trials: Report", "description": "A network of Twitter accounts pushed messages to boost the share price of a biotech company as it sought approval to run a clinical trial of its Covid-19 vaccine, according to research provided to Bloomberg News.", "url": "https://www.ndtv.com/world-news/twitter-accounts-hyped-company-seeking-covid-vaccine-trials-report-3087910", "urlToImage": "https://c.ndtvimg.com/2020-09/c5ghdeu_twitter-generic-650_625x300_10_September_20.jpg", "publishedAt": "2022-06-21T14:19:43Z", "content": "More than 100 Twitter accounts heavily promoted Ocugen stock.\r\nA network of Twitter accounts pushed messages to boost the share price of a biotech company as it sought approval to run a clinical tria… [+5802 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Mexico City Sets Guinness World Record After 14,299 Attend Boxing Class", "description": "The huge turnout easily surpassed the previous record, set in Moscow in 2017 when 3,000 people showed up for boxing class.", "url": "https://www.ndtv.com/world-news/mexico-city-sets-guinness-world-record-after-14-299-attend-boxing-class-3087902", "urlToImage": "https://c.ndtvimg.com/2022-06/m7iejub_mexico-biggest-boxing-class-650_625x300_21_June_22.jpg", "publishedAt": "2022-06-21T14:17:26Z", "content": "A huge gathering is seen during the biggest ever boxing class in Mexico City.\r\nMexico City has set a world record for hosting the largest boxing class ever, with 14,299 people taking part in a massiv… [+2072 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Qatar Airways' $1 Billion Lawsuit Over Peeling Paint On Planes", "description": "The head of Qatar Airways on Tuesday accused plane-maker Airbus of acting like a \"bully\" as their billion-dollar dispute over peeling paint looked no closer to a resolution.", "url": "https://www.ndtv.com/world-news/qatar-airways-1-billion-lawsuit-over-peeling-paint-on-planes-3087897", "urlToImage": "https://c.ndtvimg.com/2020-10/i24cgpi8_qatar-airways-650_625x300_28_October_20.jpg", "publishedAt": "2022-06-21T14:17:18Z", "content": "Qatar Airways, Airbus have been fighting in the British courts for months over the issue\r\nDoha: The head of Qatar Airways on Tuesday accused plane-maker Airbus of acting like a \"bully\" as their billi… [+1874 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Rashi Hardaha", "title": "CUET 2022: IIMC Extends Registration Date For PG Diploma Courses", "description": "The Indian Institute of Mass Communication has extended the application process for its PG Diploma courses.", "url": "https://www.ndtv.com/education/cuet-2022-iimc-extends-registration-date-for-pg-diploma-courses", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/6/21/shutterstock_741417301.jpg", "publishedAt": "2022-06-21T14:14:50Z", "content": "New Delhi:The Indian Institute of Mass Communication (IIMC) has extended the application process for IIMC Postgraduate (PG) Diploma courses 2022. From this year onwards, the IIMC will admit students … [+1844 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Kerala Court Sentences Man, 66, To 81-Years In Jail For Raping Minor", "description": "A fast track court in Kerala on Tuesday sentenced a 66-year old man to 81 years imprisonment for repeatedly raping and impregnating a minor girl in Idukki district of in Kerala", "url": "https://www.ndtv.com/india-news/kerala-fast-track-court-sentences-man-66-to-81-years-in-jail-for-raping-minor-in-idukki-3087882", "urlToImage": "https://i.ndtvimg.com/i/2016-05/arrest-generic_650x400_71463458726.jpg", "publishedAt": "2022-06-21T14:10:07Z", "content": "The prosecutor said the man was convicted based on the survivor's statement. (Representational)\r\nIdukki, Kerala: A fast track court in Kerala on Tuesday sentenced a 66-year old man to 81 years impris… [+954 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "PM, Amit Shah At BJP Parliamentary Board Meeting On Presidential Poll", "description": "The BJP parliamentary board, its top organisational body which includes Prime Minister Narendra Modi, met in New Delhi on Tuesday to deliberate on the party's candidate for the presidential poll.", "url": "https://www.ndtv.com/india-news/bjp-parliamentary-board-meets-on-presidential-poll-3087880", "urlToImage": "https://c.ndtvimg.com/2022-06/cnhab99g_pm-modi_625x300_21_June_22.jpg", "publishedAt": "2022-06-21T14:10:02Z", "content": "June 29 is the last date for filing the nomination.\r\nNew Delhi: The BJP parliamentary board, its top organisational body which includes Prime Minister Narendra Modi, met in New Delhi on Tuesday to de… [+969 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "For Big B, Every Day Is Father's Day. See New Post For Abhishek-Shweta", "description": "Abhishek and Shweta look adorable in Amitabh Bachchan's post", "url": "https://www.ndtv.com/entertainment/amitabh-bachchan-is-celebrating-fathers-day-every-day-see-his-post-for-abhishek-and-shweta-3087873", "urlToImage": "https://c.ndtvimg.com/2022-06/rfmmt5m_amitabh-bachchan_625x300_21_June_22.jpg", "publishedAt": "2022-06-21T14:06:20Z", "content": "Amitabh Bachchan's post with his kids (courtesy: amitabhbachchan)\r\nNew Delhi: Amitabh Bachchan never misses a chance to share some memorable gems from the past. On Tuesday, the veteran star posted a … [+1305 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Watch: People Gather At Stonehenge To Celebrate Longest Day Of Year", "description": "During Summer Solstice, Earth's North Pole is tilted closest to the Sun, making it appear at its highest point in the sky.", "url": "https://www.ndtv.com/world-news/summer-solstice-2022-watch-people-gather-at-stonehenge-to-celebrate-longest-day-of-year-3087829", "urlToImage": "https://c.ndtvimg.com/2022-06/48gjltf8_summer-solstice-stonehenge-650_625x300_21_June_22.jpg", "publishedAt": "2022-06-21T13:53:06Z", "content": "Summer solstice 2022: Nature lovers flocked in their thousands to the site.\r\nCrowds gathered at Stonehenge in the united Kingdom to watch the sunset ahead of the summer solstice. Also called the long… [+2283 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Asian News International", "title": "Liam Livingstone, Jason Roy Back Eoin Morgan To Regain His Batting Form", "description": "Eoin Morgan has so far failed to score a run on his side's tour to Netherlands, falling for ducks on both occasions.", "url": "https://sports.ndtv.com/cricket/liam-livingstone-jason-roy-back-white-ball-captain-eoin-morgan-to-regain-his-batting-form-3087822", "urlToImage": "https://c.ndtvimg.com/2022-02/lgtfetc8_eoin-morgan-afp_625x300_16_February_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-21T13:51:43Z", "content": "Hard-hitting English batter Liam Livingstone has backed his white-ball captain Eoin Morgan to regain his form with the bat, believing that he is just one score away from being back in form. Morgan ha… [+1957 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Watch: Aamir Khan And Son Azad Playing Football In The Rain", "description": "\"All fun and a lot of rain,\" read the caption on the video", "url": "https://www.ndtv.com/entertainment/nothing-to-see-here-just-aamir-khan-and-son-azad-playing-football-in-the-rain-3087804", "urlToImage": "https://c.ndtvimg.com/2022-06/7ll5roig_aamir-khan_625x300_21_June_22.jpg", "publishedAt": "2022-06-21T13:47:27Z", "content": "Aamir Khan and Azad in a still from the video. (courtesy: aamirkhanproductions)\r\nNew Delhi: Aamir Khan managed to scoop some time out of his busy life and decided to spend his day with son Azad in th… [+1613 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Viral Video: People Stop Traffic To Capture Beautiful Sunset In New York", "description": "Sunsets have a natural undefined beauty, and there are huge sunset lovers all over the world. People have their own lists of places where they can experience the moment. But in New York, people stopped traffic to capture beautiful sunset.", "url": "https://www.ndtv.com/world-news/viral-video-people-stop-traffic-to-capture-beautiful-sunset-in-new-york-3087787", "urlToImage": "https://c.ndtvimg.com/2022-06/aubk6ve_sun-set-240_625x300_21_June_22.jpg", "publishedAt": "2022-06-21T13:41:46Z", "content": "The big gathering of people was clicking photos of the spectacular sunset on a busy Manhattan street.\r\nSunsets have a natural undefined beauty, and there are huge sunset lovers all over the world. Pe… [+1330 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "3 Paramilitary Personnel Killed In Maoist Ambush In Odisha", "description": "Nuapada Naxal Attack: Three CRPF personnel were killed in a Maoist ambush at a security post in Odisha's Nuapada district on Tuesday, officials said.", "url": "https://www.ndtv.com/india-news/3-crpf-personnel-killed-in-maoist-ambush-in-odishas-nuapada-3087774", "urlToImage": "https://c.ndtvimg.com/2019-03/1m6r4aoo_naxal-generic_625x300_26_March_19.jpg", "publishedAt": "2022-06-21T13:38:37Z", "content": "The Maoists attacked troops who were involved in a road opening task. (Representational)\r\nNew Delhi: Three CRPF personnel were killed in a Maoist ambush at a security post in Odisha's Nuapada distric… [+439 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Watch: Carlos Brathwaite Costs Team 5-Run Penalty With Poor Fielding", "description": "Carlos Brathwaite is currently competing in the Vitality T20 Blast in England. He is leading Birmingham Bears in the tournament", "url": "https://sports.ndtv.com/cricket/not-ideal-carlos-brathwaite-costs-team-5-run-penalty-with-poor-fielding-watch-3087761", "urlToImage": "https://c.ndtvimg.com/2022-06/plscvar8_carlos-brathwaite_625x300_21_June_22.jpg", "publishedAt": "2022-06-21T13:36:49Z", "content": "Remember Carlos Brathwaite? West Indies' hero at the 2016 ICC World T20 Final, who hit four straight sixes to take his team home against England after his side needed 19 off the last over. That was h… [+2115 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Attorney General In Ukraine To Discuss War Crime", "description": "US Attorney General Merrick Garland was visiting Ukraine on Tuesday to discuss prosecution of individuals involved in war crimes in the European nation invaded by Russia in late February, a Justice Department official said.", "url": "https://www.ndtv.com/world-news/us-attorney-general-in-ukraine-to-discuss-war-crime-3087757", "urlToImage": "https://c.ndtvimg.com/2022-06/51q5s5s8_us-attorney-general-_625x300_21_June_22.jpg", "publishedAt": "2022-06-21T13:35:25Z", "content": "Merrick Garland is stopping in Ukraine on his way to the US-EU Ministerial in Paris. (File)\r\nWashington: US Attorney General Merrick Garland was visiting Ukraine on Tuesday to discuss prosecution of … [+1012 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Viral: Kartik And KJo Spotted Chatting At Award Show. Fans Are Thrilled", "description": "Kartik Aaryan and Karan Johar were spotted sitting together at an award show", "url": "https://www.ndtv.com/entertainment/viral-kartik-aaryan-and-karan-johar-spotted-chatting-at-award-show-fans-are-thrilled-3087754", "urlToImage": "https://c.ndtvimg.com/2022-06/6t5k6a0g_kartik_625x300_21_June_22.jpg", "publishedAt": "2022-06-21T13:33:46Z", "content": "Karan Johar with Kartik Aaryan. (courtesy: @AwaaraHoon)\r\nKartik Aaryan and Karan Johar are once again creating a heavy buzz on the Internet after a video of the duo having a hearty chat during an awa… [+2201 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"No Dispute About That\": Congress's Prithviraj Chavan On BJP's 134 Claim", "description": "Senior Congress leader Prithviraj Chavan today admitted that the BJP indeed has the numbers it is claiming -- 134 in a house of 287 -- as crisis hit Maharashtra's ruling alliance, in which his party is a member.", "url": "https://www.ndtv.com/india-news/no-dispute-about-that-congresss-prithviraj-chavan-on-bjps-134-claim-3087753", "urlToImage": "https://c.ndtvimg.com/2019-11/09hghsc8_prithviraj-chavan-_625x300_28_November_19.jpg", "publishedAt": "2022-06-21T13:33:45Z", "content": "\"Eknath Shinde thought that he would be the Deputy Chief Minister,\" Prithviraj Chavan said.\r\nSenior Congress leader Prithviraj Chavan today admitted that the BJP indeed has the numbers it is claiming… [+2201 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Maharashtra Crisis Plays Out At Gujarat 5-Star Hotel, Rebels Get Visitors", "description": "Drama engulfed a five-star hotel in Gujarat's Surat this evening, hours after Shiv Sena leader Eknath Shinde checked along with 21 other MLAs from Maharashtra.", "url": "https://www.ndtv.com/india-news/maharashtra-crisis-plays-out-at-gujarat-5-star-hotel-rebels-get-visitors-3087722", "urlToImage": "https://c.ndtvimg.com/2022-06/id74bta8_surat-hotel-650-_625x300_21_June_22.jpg", "publishedAt": "2022-06-21T13:26:14Z", "content": "Eknath Shinde is the most powerful Shiv Sena leader after the Thackerays\r\nMumbai: Drama engulfed a five-star hotel in Gujarat's Surat this evening, hours after Shiv Sena leader Eknath Shinde checked … [+2053 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Intention Exposed\": Bulldozers As \"Deterrent\" In UP Agnipath Protests", "description": "In a controversial move, the district police here included bulldozers in some of the flag marches in the city after the violence over the Centre's Agnipath scheme.", "url": "https://www.ndtv.com/india-news/agnipath-protests-bulldozers-as-deterrent-against-violent-agnipath-protests-in-uttar-pradesh-3087357", "urlToImage": "https://c.ndtvimg.com/2022-06/c3g62jhg_aligarh-up-agnipath-protests_625x300_18_June_22.jpg", "publishedAt": "2022-06-21T13:25:05Z", "content": "Agnipath Protests: Bulldozers are being seen as a possible deterrent against violent protests.\r\nAligarh: In a controversial move, the district police here included bulldozers in some of the flag marc… [+2046 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Watch: Congress Leader Spits On Cops Amid Rahul Gandhi Protests", "description": "Congress leader Netta D'Souza is seen spitting at the cops from inside a bus, when the Congress workers were detained by the Delhi Police.", "url": "https://www.ndtv.com/india-news/watch-congress-leader-netta-dsouza-spits-on-cops-during-protest-against-rahul-gandhis-questioning-3087707", "urlToImage": "https://c.ndtvimg.com/2022-06/s0b36c2o_congress-leader-netta-dsouza-650_625x300_21_June_22.jpg", "publishedAt": "2022-06-21T13:22:32Z", "content": "Congress leader Netta D'Souza during a protest in Delhi.\r\nCongress leader Netta D'Souza was seen spitting on a group of cops during a protest in Delhi against Enforcement Directorate's questioning of… [+2181 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Akhilesh Yadav Jabs Firms' Leaders On 'Agnipath' Support: \"1st Employ...\"", "description": "A day after several industrial leaders backed the Centre's Agnipath scheme, Samajwadi Party president Akhilesh Yadav on Tuesday asked them to first employ retired defence personnel to win the confidence of the youth.", "url": "https://www.ndtv.com/india-news/agnipath-protests-employ-retired-soldiers-akhilesh-yadav-jabs-industry-leaders-on-agnipath-3086904", "urlToImage": "https://c.ndtvimg.com/2022-03/57128n04_akhilesh-yadav-pti_625x300_25_March_22.jpg", "publishedAt": "2022-06-21T13:17:59Z", "content": "Agnipath Protests: Akhilesh Yadav said BJP should stop insulting the youth.\r\nLucknow: A day after several industrial leaders backed the Centre's Agnipath scheme, Samajwadi Party president Akhilesh Ya… [+1653 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ananya Shares Special Birthday Post For Mom Bhavana Pandey", "description": "\"You're my whole entire universe,\" Ananya's post for mom Bhavana Pandey", "url": "https://www.ndtv.com/entertainment/ananya-panday-shares-special-birthday-post-for-mom-and-best-friend-bhavana-pandey-3087659", "urlToImage": "https://c.ndtvimg.com/2022-06/u70sss08_ananya_625x300_21_June_22.jpg", "publishedAt": "2022-06-21T13:11:40Z", "content": "Ananya Panday shared picture with her sister and mother (courtesy: ananyapanday)\r\nNew Delhi: On Tuesday, Ananya Panday clicked the perfect picture with her mom Bhavana Pandey and sister Rysa Panday. … [+1396 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Congress Calls All Of Its Odisha MLAs To Delhi For Meeting", "description": "All nine Congress MLAs from Odisha have been asked to reach the national capital to attend a meeting with party seniors on Wednesday.", "url": "https://www.ndtv.com/india-news/congress-calls-all-of-its-odisha-mlas-to-delhi-for-meeting-3086789", "urlToImage": "https://c.ndtvimg.com/2018-11/4ubb0l7s_congress-flag-generic-afp_625x300_06_November_18.jpg", "publishedAt": "2022-06-21T13:11:22Z", "content": "Congress had earlier called senior party leaders of the state to Delhi.\r\nBhubaneswar: All nine Congress MLAs from Odisha have been asked to reach the national capital to attend a meeting with party s… [+1169 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Shilpa Said Yes To Rohit Shetty's Indian Police Force Because, Son Viaan", "description": "\"I told my son that Rohit Shetty has offered me a role and he jumped and he said, 'mumma you have to do it for me',\" said Shilpa Shetty", "url": "https://www.ndtv.com/entertainment/doing-rohit-shettys-indian-police-force-for-my-son-shilpa-shetty-3086845", "urlToImage": "https://c.ndtvimg.com/2022-06/lrasb3do_shilpa-shetty_625x300_21_June_22.jpg", "publishedAt": "2022-06-21T13:09:31Z", "content": "Shilpa Shetty in a still from Indian Police Force. (courtesy: theshilpashetty)\r\nMumbai: When Rohit Shetty offered Shilpa Shetty his debut series Indian Police Force, the actor says it was her son who… [+1599 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Kamala Harris Botches Juneteenth History Lesson To Children: Report", "description": "Kamala Harris, the Vice-President of United States of America (USA), made a gaffe while addressing students during the Juneteenth holiday on Monday, telling children that Black people were enslaved in America for 400 years.", "url": "https://www.ndtv.com/world-news/kamala-harris-botches-juneteenth-history-lesson-to-children-report-3087644", "urlToImage": "https://c.ndtvimg.com/2021-11/pgpji1us_kamala-harris-afp_625x300_12_November_21.jpg", "publishedAt": "2022-06-21T13:08:08Z", "content": "Kamala Harris was speaking at National Museum of African American History and Culture in Washington, DC.\r\nKamala Harris, the Vice-President of United States of America (USA), made a gaffe while addre… [+1667 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "UEFA Rubbishes French Minister's Champions League Fake Tickets Number", "description": "UEFA has launched its own probe, overseen by a former Portuguese education and sports minister.", "url": "https://sports.ndtv.com/football/uefa-rubbishes-french-ministers-champions-league-fake-tickets-number-3087636", "urlToImage": "https://c.ndtvimg.com/2022-02/lqb0i2t8_uefa_625x300_03_February_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-21T13:05:30Z", "content": "A senior UEFA representative said on Tuesday he did not believe French Interior Minister Gerald Darmanin's claims about the number of fake tickets in circulation during the chaotic scenes before last… [+1859 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Alia Bhatt Attends Kapoor Family Gathering In London", "description": "On the work front, Alia Bhatt is shooting for her Hollywood debut 'Heart of Stone' with Gal Gadot and Jamie Dornan in London.", "url": "https://www.ndtv.com/entertainment/alia-bhatt-attends-kapoor-family-gathering-in-london-3087613", "urlToImage": "https://c.ndtvimg.com/2022-06/l3a2umbg_alia-bhatt-london-dinner-270_625x300_21_June_22.jpg", "publishedAt": "2022-06-21T13:01:27Z", "content": "Alia Bhatt with Armaan Jain and other.\r\nActor Alia Bhatt recently joined a mini-Kapoor reunion in London. Alia is very close to the Kapoor family and likes to spend time with them even when Ranbir Ka… [+1498 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "India Will Not Tolerate Any Transgression By China: NSA Ajit Doval", "description": "Even as border talks between India and China continue, National Security Advisor, Ajit Doval strongly addressed the question of Chinese forays into Indian territory said that India will not tolerate any transgression by China.", "url": "https://www.ndtv.com/india-news/national-security-adviser-ajit-doval-on-india-china-india-will-not-tolerate-any-transgression-by-china-nsa-ajit-doval-3086719", "urlToImage": "https://c.ndtvimg.com/2022-06/22bersoo_ajit-doval-national-security-advisor_650x400_21_June_22.jpg", "publishedAt": "2022-06-21T12:56:01Z", "content": "India-China: NSA Ajit Doval said: \"There had been some unsavoury incidents in 2020.\"\r\nNew Delhi: Even as border talks between India and China continue, National Security Advisor, Ajit Doval strongly … [+2972 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust Of India", "title": "Kerala Health Minister Issues \"Strict Warning\" After Kidney Transplant Case", "description": "The Kerala Health Minister on Tuesday justified the suspension of two doctors in connection with the death of a transplant patient at the government Medical College here and said no lapse committed in the treatment of common people was acceptable.", "url": "https://www.ndtv.com/india-news/kerala-health-minister-issues-strict-warning-after-kidney-transplant-case-3086664", "urlToImage": "https://c.ndtvimg.com/2020-05/6tvmdl64_hospital-generic_625x300_20_May_20.jpg", "publishedAt": "2022-06-21T12:52:46Z", "content": "The state government has ordered a probe into the incident. (Representational)\r\nThiruvananthapuram: Kerala Health Minister Veena George on Tuesday justified the suspension of two doctors in connectio… [+2799 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "'Agnipath': 3 Service Chiefs Arrive At PM Modi's Residence For Meeting", "description": "Service chiefs' meeting with PM Modi comes amid an ongoing controversy over the new recruitment scheme for the armed forces.", "url": "https://www.ndtv.com/india-news/agnipath-3-service-chiefs-arrive-at-pm-modis-residence-for-meeting-3087579", "urlToImage": "https://c.ndtvimg.com/2021-03/o7fekb8o_indian-army-generic-pti-photo_625x300_27_March_21.jpg", "publishedAt": "2022-06-21T12:50:04Z", "content": "New Delhi: Chiefs of the three Indian military services arrived at Prime Minister Narendra Modi's residence on Tuesday evening amid an ongoing controversy over the Agnipath recruitment scheme for the… [+2862 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Mridusmita Deka", "title": "#JEEMains2022 Trends: Aspirants Want JEE 2022 To Be Postponed", "description": "JEE Main 2022: Students are now saying that there are floods in some parts of the country and protests against union government’s Agnipath scheme and therefore want JEE Main 2022 session 1 exam to be postponed.", "url": "https://www.ndtv.com/education/jeemains2022-trends-engineering-aspirants-want-jee-2022-be-postponed-heres-why", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/6/21/student-stressed-worried-featured-image.jpg", "publishedAt": "2022-06-21T12:48:03Z", "content": "New Delhi:With just a day left for the start of the Joint Entrance Examination (JEE) Main 2022 session 1, students are now demanding the postponement of the exam. The JEE Main 2022 session 1 has been… [+3460 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Raksha Bandhan Trailer: Akshay's Bond With Sisters Is Before All Else", "description": "Raksha Bandhan Trailer: Akshay Kumar is the definition of a doting brother", "url": "https://www.ndtv.com/entertainment/raksha-bandhan-trailer-akshay-kumars-bond-with-his-sisters-is-before-all-else-3087568", "urlToImage": "https://c.ndtvimg.com/2022-06/k6emm7mo_raksha-bandhan_625x300_21_June_22.jpg", "publishedAt": "2022-06-21T12:47:25Z", "content": "A still from Raksha Bandhan trailer. (courtesy: YouTube)\r\nNew Delhi: The trailer of Akshay Kumar's Raksha Bandhan begins with a quote that reads: \"Sometimes being a brother is even bigger than better… [+1525 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Asian News International", "title": "Wimbledon: Djokovic Top Seed In Absence Of Medvedev, Zverev", "description": "Novak Djokovic, who didn't participate in the Australian Open 2022, was recently removed as world number one by Daniil Medvedev.", "url": "https://sports.ndtv.com/tennis/wimbledon-2022-novak-djokovic-top-mens-seed-in-absence-of-daniil-medvedev-alexander-zverev-3087530", "urlToImage": "https://c.ndtvimg.com/2022-05/33pfh38o_novak-djokovic-afp-_650x400_31_May_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-21T12:36:21Z", "content": "World number three Novak Djokovic will head into next week's Grand Slam Wimbledon 2022 as the men's top seed. The defending champion is the top seed after the Russian world number one Daniil Medvedev… [+2205 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Kannada Actor Dignath Injures Neck In Goa, Airlifted To Bengaluru", "description": "Kannada actor Dignath was airlifted from Goa to Bengaluru after he suffered a neck injury on Tuesday. The actor was reported to be holidaying with family in the coastal state.", "url": "https://www.ndtv.com/india-news/kannada-actor-dignath-injures-neck-in-goa-airlifted-to-bengaluru-3087526", "urlToImage": "https://c.ndtvimg.com/2022-06/3al83f2g_dignath-650-_625x300_21_June_22.jpg", "publishedAt": "2022-06-21T12:33:43Z", "content": "Kannada actor Dignath was airlifted to Bengaluru\r\nBengaluru: Kannada actor Dignath was airlifted from Goa to Bengaluru after he suffered a neck injury on Tuesday. The actor was reported to be holiday… [+700 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ruchira Kamboj Appointed As India's Permanent Representative To UN", "description": "Ruchira Kamboj: The Ministry of External Affairs said, senior diplomat Ruchira Kamboj has been appointed as India's Permanent Representative to the United Nations in New York.", "url": "https://www.ndtv.com/india-news/senior-diplomat-ruchira-kamboj-appointed-as-indias-permanent-representative-to-united-nations-3087511", "urlToImage": "https://c.ndtvimg.com/2022-06/l0pd460s_ruchira-kamboj_625x300_21_June_22.jpg", "publishedAt": "2022-06-21T12:28:41Z", "content": "Ruchira Kamboj will succeed T S Tirumurti as the Indian ambassador to the UN.\r\nNew: Senior diplomat Ruchira Kamboj was on Tuesday appointed India's Permanent Representative to the United Nations in N… [+424 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Watch: Lewis Hamilton Pushes Mercedes Physio Into River After Winning Bet", "description": "A day after Hamilton's exploitsin Canada, Mercedes uploaded a video on their official Twitter handle in which Hamilton could be seen pushing the team team physioAngela Cullen into the river.", "url": "https://sports.ndtv.com/formula-1/watch-lewis-hamilton-pushes-mercedes-physio-into-river-after-winning-bet-with-podium-finish-at-canadian-grand-prix-3087497", "urlToImage": "https://c.ndtvimg.com/2022-06/jobfv3c8_hamilton-pushes-mercedes-physio_625x300_21_June_22.jpg", "publishedAt": "2022-06-21T12:23:40Z", "content": "Lewis Hamilton was a happy man on Sunday as he helped his side Mercedes finish on the podium, courtesy his third place finish in the Canadian Grand Prix. Notably, it was only the second podium finish… [+1603 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Twitter Deal On Hold Over \"Significant Questions\" On Fake Users: Elon Musk", "description": "Business magnate Elon Musk said Tuesday that his $44 billion move to take over Twitter remained held up by \"very significant\" questions about the number of fake users on the social network.", "url": "https://www.ndtv.com/world-news/twitter-deal-on-hold-over-significant-questions-on-fake-users-elon-musk-3087490", "urlToImage": "https://c.ndtvimg.com/2022-05/es021cg_elon-musk_625x300_09_May_22.jpg", "publishedAt": "2022-06-21T12:22:27Z", "content": "Elon Musk's took over Twitter for $44 billion but the deal has been put on hold. (File)\r\nDoha: Business magnate Elon Musk said Tuesday that his $44 billion move to take over Twitter remained held up … [+2255 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "RBI Grants 3-Months Extension For Debit, Credit Card Provisions", "description": "RBI has given a three-month extension after June 30, 2022 for provisions related to activating credit or debit cards as well as co-branding norms", "url": "https://www.ndtv.com/business/rbi-gives-3-months-extension-for-implementing-these-credit-card-provisions-details-here-3087484", "urlToImage": "https://c.ndtvimg.com/2021-07/h839kebo_visa-credit-card-reuters_625x300_15_July_21.jpg", "publishedAt": "2022-06-21T12:21:38Z", "content": "RBI has given extension for implementation of certain norms related to credit, debit cards\r\nAdhering to representations by stakeholders, the Reserve Bank of India (RBI) has given a three-month extens… [+1820 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "51 Killed By Assam Cops Since May 2021, Plea Alleges \"Fake Encounters\"", "description": "Some killed in custody while \"trying to escape after snatching a policeman's firearm\", while several were shot in the leg, as per Assam government affidavit", "url": "https://www.ndtv.com/guwahati-news/51-killed-by-assam-police-since-may-2021-plea-seeks-probe-for-fake-encounters-3087476", "urlToImage": "https://c.ndtvimg.com/2020-01/7qbdof68_assam-police-generic-pti-_625x300_26_January_20.jpg", "publishedAt": "2022-06-21T12:19:03Z", "content": "Activist demands compensation for victims after identifying fake encounters (Photo for representative)\r\nGuwahati: A total of 51 persons have been killed and 139 injured by the Assam police in a numbe… [+2123 chars]"}]}