{"status": "ok", "totalResults": 191, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "India Heading Towards \"Civil War\": Lalu Yadav's All-Out Attack On BJP", "description": "Rashtriya Janata Dal chief Lalu Yadav on Sunday launched a scathing attack against the ruling Bharatiya Janata Party at the Centre and alleged that the country is \"heading towards civil war\".", "url": "https://www.ndtv.com/india-news/india-heading-towards-civil-war-lalu-yadavs-all-out-attack-on-bjp-3041214", "urlToImage": "https://i.ndtvimg.com/i/2017-11/lalu-yadav-pti_650x400_71511090841.jpg", "publishedAt": "2022-06-06T00:03:05Z", "content": "Rashtriya Janata Dal chief Lalu Yadav appealed to the secular forces to unite and fight together.\r\nPatna (Bihar): Rashtriya Janata Dal chief Lalu Yadav on Sunday launched a scathing attack against th… [+1222 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Reach Out To People: Odisha Chief Minister To Newly Sworn-In Ministers", "description": "Odisha Chief Minister Naveen Patnaik on Sunday asked his newly inducted Ministers into the Cabinet to 'Tour' more and reach out to a maximum number of people with a view to \"strengthen the grassroots further\".", "url": "https://www.ndtv.com/india-news/odisha-new-cabinet-reach-out-to-people-odisha-chief-minister-to-newly-sworn-in-ministers-3041205", "urlToImage": "https://c.ndtvimg.com/2022-06/3f5svo4_odisha-cabinet_625x300_05_June_22.jpg", "publishedAt": "2022-06-05T23:58:34Z", "content": "Odisha: Naveen Patnaik asked his Ministers to work for the benefit of the people.\r\nBhubaneswar (Odisha): Odisha Chief Minister Naveen Patnaik on Sunday asked his newly inducted Ministers into the Cab… [+1217 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Imran Khan To Be Arrested After Bail Ends, Says Pakistan Minister: Report", "description": "Former Pakistan Prime Minister Imran Khan who was granted three-week transit bail on June 2, would be arrested by the security officials deployed outside his Bani Gala residence, country's Interior Minister Rana Sanaullah said.", "url": "https://www.ndtv.com/world-news/imran-khan-to-be-arrested-after-bail-ends-says-pakistan-minister-report-3041201", "urlToImage": "https://c.ndtvimg.com/2022-04/2dub6eug_imran-khan-afp_625x300_14_April_22.jpg", "publishedAt": "2022-06-05T23:53:53Z", "content": "Pakistan: Court granted PTI leader Imran Khan bail till June 25.\r\nIslamabad: Former Pakistan Prime Minister Imran Khan who was granted three-week transit bail on June 2, would be arrested by the secu… [+1341 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE Updates: India Logs 4,270 Covid Cases, 15 Related Deaths", "description": "India logged 4,270 new coronavirus infections taking the tally of COVID-19 cases to 4,31,76,817, while the daily positivity rate was recorded above one per cent after 34 days, according to the Union Health Ministry data updated on Sunday.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-june-6-3041238", "urlToImage": "https://c.ndtvimg.com/2022-01/3mckphk_india-coronavirusafp_625x300_29_January_22.jpg", "publishedAt": "2022-06-05T23:51:03Z", "content": "India Covid Update: The active cases comprise 0.06 per cent of the total infections.\r\nNew Delhi: India logged 4,270 new coronavirus infections taking the tally of COVID-19 cases to 4,31,76,817, while… [+515 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Shivraj Chouhan Announces ₹5 Lakh Aid For Uttarakhand Accident Victims", "description": "Madhya Pradesh Chief Minister Shivraj Singh Chouhan reached Dehradun on the intervening night of Sunday and Monday to take stock of relief operation pertaining to the bus accident of pilgrims from Panna dist in Uttarakhand's Uttarkashi district.", "url": "https://www.ndtv.com/india-news/uttarakhand-bus-accident-shivraj-chouhan-announces-5-lakh-aid-for-uttarakhand-accident-victims-3041207", "urlToImage": "https://c.ndtvimg.com/2022-06/hkegqq5_uttarakhand-bus-accident_625x300_06_June_22.jpg", "publishedAt": "2022-06-05T23:42:53Z", "content": "Uttarakhand Bus Accident: Twenty-five people were killed and three were injured in the accident.\r\nDehradun (Uttarakhand): Madhya Pradesh Chief Minister Shivraj Singh Chouhan reached Dehradun on the i… [+2000 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "A Project, Ring And Imran Khan: New Allegations Against Former Pak PM", "description": "Pakistan Muslim League-Nawaz has claimed that a troika of former Prime Minister Imran Khan, his wife Bushra Bibi and her friend Farah Gogi made \"billions\" under the tenure of the Pakistan Tehreek-e-Insaf government.", "url": "https://www.ndtv.com/world-news/imran-khan-a-project-ring-and-imran-khan-new-allegations-against-former-pak-pm-3041167", "urlToImage": "https://c.ndtvimg.com/2022-05/mtk5q5n_imran-khan-afp_625x300_24_May_22.jpg", "publishedAt": "2022-06-05T23:30:23Z", "content": "Ousted Prime Minister Imran Khan's party PTI has termed the audio \"fake\".\r\nIslamabad: Pakistan Muslim League-Nawaz has claimed that a troika of former Prime Minister Imran Khan, his wife Bushra Bibi … [+2755 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Will Hit New Targets In Ukraine If...: Putin's Warning To West Over Arms", "description": "Russian President Vladimir Putin warned Sunday that Moscow will hit new targets if the West supplies Ukraine with long-range missiles, hours after several explosions rocked the Ukrainian capital Kyiv.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-will-hit-new-targets-in-ukraine-if-putins-warning-to-west-over-arms-3041229", "urlToImage": "https://c.ndtvimg.com/2022-04/dltv7e5_vladimir-putin-afp-photo_625x300_19_April_22.jpg", "publishedAt": "2022-06-05T23:26:47Z", "content": "Russia-Ukraine War: Russia's invasion of Ukraine has entered day 102.\r\nMoscow: Russian President Vladimir Putin warned Sunday that Moscow will hit new targets if the West supplies Ukraine with long-r… [+5208 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "No Rule Of Law In West Bengal, \"But A Ruler\": Governor Jagdeep Dhankar", "description": "West Bengal Governor Jagdeep Dhankhar on Sunday said that there is no rule of law in his state as it is being governed by a \"ruler\" -- apparently referring to chief minister Mamata Banerjee.", "url": "https://www.ndtv.com/india-news/west-bengal-governor-jagdeep-dhankar-no-rule-of-law-in-west-bengal-but-a-ruler-governor-jagdeep-dhankar-3041119", "urlToImage": "https://c.ndtvimg.com/2021-05/946ip4n_jagdeep-dhankhar_625x300_14_May_21.jpg", "publishedAt": "2022-06-05T23:21:49Z", "content": "West Bengal Governor Jagdeep Dhankhar said that he has witnessed terrible situation in Bengal.\r\nJaipur: West Bengal Governor Jagdeep Dhankhar on Sunday said that there is no rule of law in his state … [+1045 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Bear Kills Couple In Madhya Pradesh's Forest, Eats Body Parts: Officials", "description": "A bear attacked and killed a couple on Sunday morning and kept devouring the corpses for over five hours in Madhya Pradesh's Panna district, an official said.", "url": "https://www.ndtv.com/india-news/madhya-pradesh-bear-kills-couple-in-madhya-pradeshs-forest-eats-body-parts-officials-3040541", "urlToImage": "https://c.ndtvimg.com/2020-02/7ai0672g_forest-generic_625x300_29_February_20.jpg", "publishedAt": "2022-06-05T22:55:46Z", "content": "Madhya Pradesh: The bear was caught after forest personnel tranquilised it. (Representational)\r\nPanna: A bear attacked and killed a couple on Sunday morning and kept devouring the corpses for over fi… [+1113 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Hizbul Mujahideen Terrorist Arrested In Jammu-Kashmir's Kishtwar", "description": "Kishtwar Police and Security Forces (17 RR) on Sunday arrested one terrorist of Hizbul Mujahideen (HM) identified as Talib Hussain in Jammu and Kashmir's Kishtwar district.", "url": "https://www.ndtv.com/india-news/hizbul-mujahideen-terrorist-arrested-in-jammu-kashmirs-kishtwar-3040337", "urlToImage": "https://c.ndtvimg.com/2019-08/sn4llgpg_jammu-and-kashmir-security-afp_625x300_14_August_19.jpg", "publishedAt": "2022-06-05T22:50:52Z", "content": "Kishtwar Police and Security Forces arrested one terrorist of Hizbul Mujahideen. (Representational)\r\nJammu (Jammu and Kashmir): Kishtwar Police and Security Forces (17 RR) on Sunday arrested one terr… [+861 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Amit Shah Condoles Loss Of Lives In Uttarakhand Bus Accident", "description": "Union Home Minister Amit Shah on Sunday expressed grief at the accident in which 25 people were killed when a bus carrying 28 pilgrims from Panna district in Madhya Pradesh fell into a gorge near Damta in Uttarkashi district.", "url": "https://www.ndtv.com/india-news/uttarakhand-bus-accident-amit-shah-condoles-loss-of-lives-in-uttarakhand-road-accident-3041105", "urlToImage": "https://c.ndtvimg.com/2022-06/hkegqq5_uttarakhand-bus-accident_625x300_06_June_22.jpg", "publishedAt": "2022-06-05T22:42:37Z", "content": "Uttarakhand Bus Accident: Twenty-five people were killed and three were injured in the accident.\r\nNew Delhi: Union Home Minister Amit Shah on Sunday expressed grief at the accident in which 25 people… [+1467 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "75% Of River Monitoring Stations Recorded Heavy Metal Pollution: Report", "description": "Twenty-five glacial lakes and water bodies in India, China and Nepal have recorded over 40 per cent rise in their water spread areas since 2009, posing a grave threat to five Indian states and two Union territories, a new report stated.", "url": "https://www.ndtv.com/india-news/centre-for-science-and-environment-report-75-of-river-monitoring-stations-recorded-heavy-metal-pollution-report-3040097", "urlToImage": "https://c.ndtvimg.com/2021-11/nkcfp4jg_yamuna-river-toxic-foam-barricade_625x300_10_November_21.jpeg", "publishedAt": "2022-06-05T22:23:23Z", "content": "The report said 45 to 64 per cent of India's forest cover is likely to become climate hotspots.\r\nNew Delhi: Twenty-five glacial lakes and water bodies in India, China and Nepal have recorded over 40 … [+2098 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine's Zelensky Visits Front-Line Troops As Russia Intensifies Attacks", "description": "Ukrainian President Volodymyr Zelensky visited front-line troops in the southeastern region of Zaporizhzhia, his office said on Sunday, a week after a similar trip to the northeastern Kharkiv region.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-ukraines-zelensky-visits-front-line-troops-as-russia-intensifies-attack-3041102", "urlToImage": "https://c.ndtvimg.com/2022-06/ah6js3os_zelensky-reuters_625x300_01_June_22.jpg", "publishedAt": "2022-06-05T22:13:50Z", "content": "Russia-Ukraine War: Ukrainian President Volodymyr Zelensky visited frontline troops.\r\nKyiv: Ukrainian President Volodymyr Zelensky visited front-line troops in the southeastern region of Zaporizhzhia… [+907 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UP Factory Owner, Operator Arrested After Explosion That Killed 13", "description": "Both the owner and the operator of the factory in Hapur where an explosion claimed 13 lives were arrested on Sunday, police said.", "url": "https://www.ndtv.com/india-news/up-hapur-factory-up-hapur-factory-fire-up-factory-owner-operator-arrested-after-explosion-that-killed-13-3041093", "urlToImage": "https://c.ndtvimg.com/2022-06/5mn8mbe_up-hapur-fire_625x300_04_June_22.jpg", "publishedAt": "2022-06-05T21:56:16Z", "content": "UP Hapur Factory Explosion: So far, 13 people have been killed, while 20 are injured.\r\nHapur (UP): Both the owner and the operator of the factory in Hapur where an explosion claimed 13 lives were arr… [+3923 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Kerala Orders Schools' Inspection Over Suspected Food Poisoning Incidents", "description": "A day after various incidents of food poisoning were reported from some parts of the State, Kerala government on Saturday convened a high-level meeting of officials of various departments and decided to conduct inspection of schools.", "url": "https://www.ndtv.com/india-news/kerala-orders-schools-inspection-over-suspected-food-poisoning-incidents-3040724", "urlToImage": "https://i.ndtvimg.com/i/2016-02/school-generic_650x400_41455025248.jpg", "publishedAt": "2022-06-05T21:51:14Z", "content": "The evaluation meeting decided to eliminate mosquito-breeding sites on Fridays. (Representational)\r\nThiruvananthapuram: A day after various incidents of food poisoning were reported from some parts o… [+1367 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Policy Of \"Denialism\": Farooq Abdullah Targets Centre On Kashmir Killings", "description": "National Conference president and Member of Parliament Farooq Abdullah on Sunday accused the BJP-led central government of pursuing a policy of \"denialism\" on Jammu and Kashmir, accusing it of presenting a rosy picture of the violence-marred region.", "url": "https://www.ndtv.com/india-news/farooq-abdullah-policy-of-denialism-farooq-abdullah-targets-centre-on-kashmir-killings-3040917", "urlToImage": "https://c.ndtvimg.com/2021-12/no0iptig_farooq-abdullah_625x300_11_December_21.jpg", "publishedAt": "2022-06-05T21:44:20Z", "content": "Kashmir Killings: Farooq Abdullah said the first step to resolving a problem is to acknowledge it.\r\nJammu: National Conference president and Member of Parliament Farooq Abdullah on Sunday accused the… [+2040 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "The \"Double-Edged Significance\" Of Queen Elizabeth's Jubilee Celebrations", "description": "While millions watched the Platinum Jubilee festivities to thank Queen Elizabeth and reflect on her 70 years on the British throne, for the monarchy itself, the four-day celebrations have also very much been about looking to the future.", "url": "https://www.ndtv.com/world-news/the-double-edged-significance-of-queen-elizabeths-jubilee-celebrations-3041089", "urlToImage": "https://c.ndtvimg.com/2022-06/2pguocsg_queen-elizabeth_625x300_04_June_22.jpg", "publishedAt": "2022-06-05T21:35:19Z", "content": "During Queen Elizabeth's long tenure, the fortunes of the monarchy have often fluctuated.\r\nLondon: While millions watched the Platinum Jubilee festivities to thank Queen Elizabeth and reflect on her … [+5225 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "India Among Largest, Fastest-Growing Startup Ecosystems Globally: PM Modi", "description": "In a virtual address for Rotary's 113th annual international convention in Houston on Sunday, Prime Minister Narendra Modi discussed the importance of sustainable development and underlined the ethos of staying in harmony with nature.", "url": "https://www.ndtv.com/india-news/pm-modi-news-india-among-largest-fastest-growing-startup-ecosystems-globally-pm-modi-3041084", "urlToImage": "https://c.ndtvimg.com/2022-06/7h76kh0g_pm-modi_625x300_05_June_22.jpg", "publishedAt": "2022-06-05T21:31:35Z", "content": "Prime Minister Narendra Modi stressed on the importance of making India self-reliant.\r\nNew Delhi: In a virtual address for Rotary's 113th annual international convention in Houston on Sunday, Prime M… [+2335 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "BJP Chief JP Nadda's 2-Day Visit To West Bengal Begins Tomorrow", "description": "BJP national president J P Nadda will be on a two-day visit to West Bengal from June 7.", "url": "https://www.ndtv.com/india-news/jp-nadda-in-west-bengal-bjp-chief-jp-naddas-2-day-visit-to-west-bengal-begins-tomorrow-3041082", "urlToImage": "https://c.ndtvimg.com/2022-05/s8rgp5og_jp-nadda-pti_625x300_30_May_22.jpg", "publishedAt": "2022-06-05T21:25:44Z", "content": "JP Nadda In Bengal: BJP national president J P Nadda will be on a two-day visit to West Bengal.\r\nKolkata: BJP national president JP Nadda will be on a two-day visit to West Bengal from June 7.\r\nParty… [+997 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russian General Killed In Eastern Ukraine: Report", "description": "A Russian general was killed in eastern Ukraine, a Russian state media journalist said on Sunday, adding to the string of high-ranking military casualties sustained by Moscow.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-russian-general-killed-in-eastern-ukraine-report-3041072", "urlToImage": "https://c.ndtvimg.com/2022-05/fc0jpgg_russia-ukraine-war-afp_625x300_31_May_22.jpg", "publishedAt": "2022-06-05T21:21:27Z", "content": "Russia-Ukraine War: Russian forces have intensified attacks to capture Sievierodonetsk.\r\nLondon: A Russian general was killed in eastern Ukraine, a Russian state media journalist said on Sunday, addi… [+1181 chars]"}]}