{"status": "ok", "totalResults": 476, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": "Sourabh Kulesh", "title": "Tecno Memory Fusion Feature Rolling Out to Select Smartphones, Will Add Virtual RAM", "description": "Tecno has announced that it is rolling out a Memory Fusion feature that will allow users to borrow additional RAM from storage capacity to offer a better experience. Tecno Camon 18, Tecno Pova Neo, Tecno Spark 8T, and Tecno Spark 8 Pro smartphones are getting…", "url": "https://gadgets.ndtv.com/mobiles/news/tecno-memory-fusion-camon-18-pova-neo-spark-8t-8-pro-add-virtual-ram-2734817", "urlToImage": "https://i.gadgets360cdn.com/large/tecno_camon_18_memory_fusion_1643360693270.jpg", "publishedAt": "2022-01-28T09:12:00Z", "content": "Tecno Camon 18, Tecno Pova Neo, Tecno Spark 8T, and Tecno Spark 8 Pro smartphones are getting a Memory Fusion feature which will allow users to borrow additional RAM from storage capacity to offer a … [+1682 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Australia Announces Billion-Dollar Package To Protect Great Barrier Reef", "description": "Australia unveiled a billion-dollar package to protect the climate-ravaged Great Barrier Reef on Friday, hoping to prevent the vast network of corals from being removed from UNESCO's World Heritage list.", "url": "https://www.ndtv.com/world-news/australia-announces-billion-dollar-package-to-protect-great-barrier-reef-2734816", "urlToImage": "https://i.ndtvimg.com/i/2017-04/great-barrier-reef-afp_650x400_51491790478.jpg", "publishedAt": "2022-01-28T09:05:21Z", "content": "A recent study found bleaching had affected 98 percent of the reef since 1998 (File)\r\nSydney: Australia unveiled a billion-dollar package to protect the climate-ravaged Great Barrier Reef on Friday, … [+3340 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Yuvraj Singh Names 4 \"Much-Deserved\" Players From India's ODI, T20I Teams", "description": "India vs West Indies: Yuvraj, one of the main architects of India's last two World Cup wins - 2007 T20 World Cup, 2011 ODI World Cup - took to Twitter to name four much-deserved cricketers from India's ODI and T20I squads.", "url": "https://sports.ndtv.com/cricket/yuvraj-singh-names-four-much-deserved-players-from-indias-odi-t20i-squads-for-west-indies-series-2734815", "urlToImage": "https://c.ndtvimg.com/2021-10/faq0dot_yuvraj-singh_640x480_17_October_21.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-01-28T09:05:17Z", "content": "Former India all-rounder Yuvraj Singh shared his thoughts on India's ODI and T20I squads, which were announced on January 26, for the home series against West Indies. Yuvraj, one of the main architec… [+2087 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Bishal Kalita", "title": "Researchers Find Similarities Between Dark Matter And Neutrinos", "description": "Researchers of the Indian Institute of Technology (IIT) Guwahati claim to have found distinctive similarities between the nature of dark matter and neutrinos.", "url": "https://www.ndtv.com/education/iit-guwahati-researchers-find-similarities-between-dark-matter-and-neutrinos", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/1/28/bc0b682d-63a8-402c-a6f5-1d894fd28471.jpg", "publishedAt": "2022-01-28T08:52:45Z", "content": "New Delhi:Researchers of the Indian Institute of Technology (IIT) Guwahati claim to have found distinctive similarities between the nature of dark matter and neutrinos. A trio of theoretical physicis… [+2484 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Bhagwant Mann Still Lives In Rented Home\": Arvind Kejriwal Jabs Rivals", "description": "Bhagwant Mann, AAP's Punjab pick, lives like a common man in a rented house unlike other state leaders who own \"big mansions and cars\", Arvind Kejriwal said today while endorsing the Chief Ministerial candidate.", "url": "https://www.ndtv.com/india-news/punjab-election-news-arvind-kejriwal-jabs-rivals-bhagwant-mann-still-lives-in-rented-home-2734787", "urlToImage": "https://c.ndtvimg.com/2022-01/k9bmcdeg_arvind-kejriwal-bhagwant-mann-punjab-townhall-twitter-_625x300_28_January_22.jpg", "publishedAt": "2022-01-28T08:51:48Z", "content": "Punjab Elections: Arvind Kejriwal and Bhagwant Mann addressed a townhall.\r\nChandigarh/ New Delhi: Bhagwant Mann, AAP's Punjab pick, lives like a common man in a rented house unlike other state leader… [+2459 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Satvik Khare", "title": "Lenovo Legion Y90 Specifications Tipped via Alleged TENAA Listing", "description": "Lenovo Legion Y90 launch seems to be around the corner as it has recently received China's TENAA certification. The listing suggests some key specifications of the upcoming gaming smartphone from Lenovo. It is said to be powered by a Snapdragon 8 Gen 1 SoC, p…", "url": "https://gadgets.ndtv.com/mobiles/news/lenovo-legion-y90-specifications-tenaa-listing-6-9-inch-oled-display-5g-octa-core-soc-2734783", "urlToImage": "https://i.gadgets360cdn.com/large/lenovo_legion_y90_lenovo_weibo_1641557658214.jpg", "publishedAt": "2022-01-28T08:50:47Z", "content": "Lenovo Legion Y90 launch seems imminent as the smartphone has recently received China's TENAA certification. The TENAA listing suggests key specifications of the upcoming gaming smartphone from Lenov… [+2334 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Akshay Kumar Takes A Leaf Out Of Rajesh Khanna's Bawarchi Playbook", "description": "Akshay Kumar has paid a tribute to his late father-in-law Rajesh Khanna. In the ad, he is acting as a cook, who works for a large family", "url": "https://www.ndtv.com/entertainment/akshay-kumar-takes-a-leaf-out-of-rajesh-khannas-bawarchi-playbook-2734760", "urlToImage": "https://c.ndtvimg.com/2022-01/2mgfntu_akshay-kumar_625x300_28_January_22.jpg", "publishedAt": "2022-01-28T08:37:43Z", "content": "Akshay pays tribute to late father-in-law Rajesh Khanna in latest ad (courtesy akshaykumar)\r\nHighlights\r\n<ul><li>Akshay Kumar's new ad is going viral on the web\r\n</li><li>The video features Akshay in… [+1984 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UN Rights Chief Welcome In Xinjiang But Not For Investigation, Says China", "description": "China's foreign ministry said the United Nations human rights chief is welcome to visit Xinjiang but not for the purpose of an investigation, when asked about a report the commissioner was invited to come in the first half of 2022.", "url": "https://www.ndtv.com/world-news/united-nations-human-rights-chief-welcome-in-xinjiang-but-not-for-investigation-says-china-2734759", "urlToImage": "https://c.ndtvimg.com/2021-06/u73jhvjk_un-human-rights-chief-michelle-bachelet-reuters-650_625x300_11_June_21.jpg", "publishedAt": "2022-01-28T08:37:37Z", "content": "China had agreed to let the chief, currently Michelle Bachelet, visit Xinjiang after the Winter Olympics\r\nBeijing: China's foreign ministry said the United Nations human rights chief is welcome to vi… [+608 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Bharat Biotech Gets Approval For Phase 3 Trials For Intranasal Booster", "description": "Vaccine manufacturer Bharat Biotech has received approval to conduct Phase-III clinical trials of an intranasal booster dose on people who have received both doses of Covaxin.", "url": "https://www.ndtv.com/india-news/coronavirus-bharat-biotech-gets-approval-for-intranasal-booster-dose-trials-2734756", "urlToImage": "https://c.ndtvimg.com/2021-10/nfkjg30o_bharat-biotech-covaxinreuters_625x300_26_October_21.jpg", "publishedAt": "2022-01-28T08:37:08Z", "content": "The Drug Controller General of India today gave the go-ahead for the Phase-III trials\r\nNew Delhi: Vaccine manufacturer Bharat Biotech has received approval to conduct Phase-III clinical trials of an … [+799 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "David Delima", "title": "PUBG New State Renamed to New State Mobile, Krafton Announces Lunar New Year Rewards", "description": "PUBG New State has been renamed to New State Mobile, publisher Krafton confirmed on Thursday. The popular battle royale game, which was released in November, has already racked up over 45 million downloads. According to Krafton, New State has always been a mo…", "url": "https://gadgets.ndtv.com/games/news/pubg-new-state-mobile-game-renamed-br-extreme-mode-lunar-new-year-rewards-krafton-2734750", "urlToImage": "https://i.gadgets360cdn.com/large/new_state_mobile_krafton_1643358675387.jpg", "publishedAt": "2022-01-28T08:33:37Z", "content": "PUBG New State is being renamed to New State Mobile, the game's publisher Krafton confirmed on Thursday. Krafton revealed the new name of the popular battle royale game for smartphones that was launc… [+2066 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Jagmeet Singh", "title": "iPhone 14 May Get eSIM-Only and Nano-SIM Card Slot Models; New ‘Trade-In Tool’ Spotted", "description": "iPhone 14 series will come with eSIM-only and nano-SIM card slot options, Emma Mohr-McClune, a Technology Service Director at GlobalData, has predicted. Separately, the first developer beta release of iOS 15.4 has suggested the development of a ‘trade-in tool…", "url": "https://gadgets.ndtv.com/mobiles/news/iphone-14-pro-max-series-esim-nano-sim-card-slot-trade-in-tool-cosmetic-scan-emma-mohr-mcclune-apple-2734736", "urlToImage": "https://i.gadgets360cdn.com/large/iphone_13_pro_max_jeremy_bezanger_image_1643358309951.jpg", "publishedAt": "2022-01-28T08:26:34Z", "content": "iPhone 14 series is speculated to debut with eSIM-only as well as nano-SIM card options. Apple was earlier rumoured to completely ditch the existing physical SIM card slot in favour of eSIM support o… [+2761 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "No Hijab Or Scarf In Student Police Cadets Uniform, Says Kerala Government", "description": "Students will not be allowed to wear hijab or full sleeve dress as part of the uniform of Student Police Cadets project, the Kerala government said today. Initiated by the Kerala Police, the Student Police Cadets trains high school students to evolve", "url": "https://www.ndtv.com/kerala-news/no-hijab-or-scarf-in-student-police-cadets-uniform-says-kerala-government-2734734", "urlToImage": "https://c.ndtvimg.com/2022-01/pe9c488o_student-police-cadetskerala-_625x300_28_January_22.jpg", "publishedAt": "2022-01-28T08:25:57Z", "content": "The project involves training students to act as a feeder organisation for the state police.\r\nThiruvananthapuram: Students will not be allowed to wear hijab or full sleeve dress as part of the unifor… [+2045 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Radhika Parashar", "title": "US Likely to Issue Executive Orders Around Crypto in National Security Memorandum: Reports", "description": "US government is expected to pass some orders around the crypto sector in the coming weeks. While not much is known about these orders, media reports citing sources say that officials will be assigned to research on crypto-related topics in the US.", "url": "https://gadgets.ndtv.com/cryptocurrency/news/us-crypto-white-house-executive-orders-national-security-joe-biden-2734488", "urlToImage": "https://i.gadgets360cdn.com/large/Bitcoin_cryptocurrency_money_laundering_david_mcbee_unsplash_large_1643266492276.jpg", "publishedAt": "2022-01-28T08:23:09Z", "content": "Cryptocurrency sector is expanding at a rapid pace and has gathered the interest of several governments around the world that wish to regulate it. Under the leadership of US President Joe Biden, the … [+2504 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Six Rockets Target Baghdad Airport In Iraq, Plane Damaged: Report", "description": "Six rockets were fired at the Iraqi capital's airport at dawn on Friday, causing damage but no casualties, two security sources said.", "url": "https://www.ndtv.com/world-news/six-rockets-target-baghdad-airport-in-iraq-plane-damaged-report-2734724", "urlToImage": "https://c.ndtvimg.com/2020-01/iq70iu4g_baghdadairportfile_625x300_03_January_20.jpg", "publishedAt": "2022-01-28T08:21:46Z", "content": "The rockets landed on Baghdad airport's runways or parking areas, said sources. (Representational)\r\nBaghdad: Six rockets were fired at the Iraqi capital's airport at dawn on Friday, causing damage bu… [+312 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Cops Attacked While Trying To Stop Illegal Cow Slaughter In Maharashtra", "description": "A team of policemen were allegedly attacked by a group of 13 persons when they tried to prevent illegal slaughter of cows in Maharashtra's Palghar district, police said on Friday.", "url": "https://www.ndtv.com/cities/maha-cops-attacked-while-trying-to-prevent-illegal-cow-slaughter-in-palghar-2734718", "urlToImage": "https://c.ndtvimg.com/rlak4li4_cow-generic-pixabay_625x300_08_August_18.jpg", "publishedAt": "2022-01-28T08:17:09Z", "content": "The incident took place in Tarapur in Maharashtra's Palghar district. (Representational image)\r\nPalghar: A team of policemen were allegedly attacked by a group of 13 persons when they tried to preven… [+1140 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "rashi.hardaha", "title": "#PostponeGATE2022 Trends: Candidates Demand Exam To Be Deferred", "description": "GATE is scheduled to be conducted from February 5 to 13 and the admit card for which has already been released. Candidates can download the hall ticket on the official website-- gate.iitkgp.ac.in.", "url": "https://www.ndtv.com/education/postpone-gate-2022-trends-on-twitter-candidates-demand-exam-postponement-gate-iitkgp-ac-in", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/1/28/gate_exam.JPG", "publishedAt": "2022-01-28T08:17:08Z", "content": "GATE 2022: The prevailing COVID-19 situation in the country has led to the postponement of several entrance and university examinations. With just a week left for the commencement of GATE 2022 exam, … [+4076 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Vanshika Tyagi", "title": "Here's How You Can link PAN with Aadhaar", "description": "If you're someone who files an Income Tax Return (ITR) every year, then you'll have to link your PAN card with your Aadhaar number by March 31 of this year.", "url": "https://gadgets.ndtv.com/how-to/features/pan-link-with-aadhaar-file-income-tax-return-2734712", "urlToImage": "https://i.gadgets360cdn.com/large/Untitled_design_2_1643358016251.jpg", "publishedAt": "2022-01-28T08:15:37Z", "content": "The Indian government has now made it mandatory to link PAN (Permanent Account Number) card with Aadhaar card for all those who file Income Tax Return in India, and the deadline has been set as March… [+1470 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Kalki Koechlin Kick-Starts The Weekend With Her Daughter And This Drink; See Pictures", "description": "Kalki Koechlin often gives us glimpses of her motherhood diaries; here is the most recent adorable activity that she enjoyed with her daughter.", "url": "https://food.ndtv.com/food-drinks/kalki-koechlin-kick-starts-the-weekend-with-her-daughter-and-this-drink-see-pictures-2734711", "urlToImage": "https://c.ndtvimg.com/2021-11/7bvqbgf8_kalki-koechlin_625x300_25_November_21.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-01-28T08:14:41Z", "content": "Actor and writer Kalki Koechlin has proved her acting mettle over the years in many films and series. She has a list of critically acclaimed movies in her kitty, and her powerful screen presence stil… [+2007 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "No Points For Guessing Where Malavika Mohanan Is Holidaying", "description": "The actress has been enjoying her beach vacation though she claims she is a \"mountain person\"", "url": "https://www.ndtv.com/entertainment/malavika-mohanan-is-exploring-the-beaches-in-maldives-pics-inside-2734707", "urlToImage": "https://c.ndtvimg.com/2022-01/7lejbrl_malavika_625x300_28_January_22.jpg", "publishedAt": "2022-01-28T08:14:08Z", "content": "Malavika Mohanan shared this image. (courtesy malavikamohanan_)\r\nHighlights\r\n<ul><li>Malavika Mohanan shared pictures from her holiday\r\n</li><li> The actress is holidaying in Maldives\r\n</li><li> \"Flo… [+2152 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Siddhant Chandra", "title": "Google Play Store Is Getting an 'Offers' Tab to Highlight Best Deals", "description": "Google is launching an 'Offers' tab on the Google Play store. The app is currently rolling out for users in the US, India, and Indonesia.", "url": "https://gadgets.ndtv.com/apps/news/google-play-store-offers-tab-games-apps-movies-deals-discounts-rewards-trials-2734700", "urlToImage": "https://i.gadgets360cdn.com/large/google_play_offers_tab_1643357471415.jpg", "publishedAt": "2022-01-28T08:11:16Z", "content": "Google Play store is getting a new Offers' tab that is designed to give users easy access to deals on games and apps. Google says the tab will provide deals across travel, shopping, media, fitness, a… [+1727 chars]"}]}