{"status": "ok", "totalResults": 198, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Fearing Building Collapse, Many In Cuba Sleep Fully Clothed, Some Stay Up", "description": "Due to a lack of oversight and maintenance, buildings collapse fully or in part in Havana with shocking frequency, even more so during the rainy and hurricane season from June to November.", "url": "https://www.ndtv.com/world-news/fearing-building-collapse-many-in-cuba-sleep-fully-clothed-some-stay-up-3124729", "urlToImage": "https://c.ndtvimg.com/2022-07/ei4q4rc_havana-buildings_625x300_04_July_22.jpg", "publishedAt": "2022-07-04T02:16:57Z", "content": "This year, the first rains of June caused 146 buildings in Havana\r\nHavana: \"When we go to sleep, it is with the fear of not waking up again,\" says Elisa Bacyan, resident in one of about 700 apartment… [+3459 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Karnataka's Sini Shetty Crowned Femina Miss India World", "description": "Sini Shetty from Karnataka was on Sunday announced the winner of Femina Miss India World 2022 title at the grand finale of VLCC Femina Miss India here.", "url": "https://www.ndtv.com/india-news/karnatakas-sini-shetty-crowned-femina-miss-india-world-3124723", "urlToImage": "https://c.ndtvimg.com/2022-07/pcif34ug_femina-miss-india_625x300_04_July_22.jpg", "publishedAt": "2022-07-04T02:09:16Z", "content": "Sini Shetty was announced winner at the grand finale in Mumbai\r\nMumbai: Sini Shetty from Karnataka was on Sunday announced the winner of Femina Miss India World 2022 title at the grand finale of VLCC… [+1859 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Devendra Fadnavis' Duty To Get OBC Reservation\": Maharashtra Minister", "description": "Nationalist Congress Party (NCP) leader Chhagan Bhujbal on Sunday said it is the responsibility of Maharashtra Deputy Chief Minister Devendra Fadnavis and his government now to get OBC reservations from the Supreme Court.", "url": "https://www.ndtv.com/india-news/devendra-fadnavis-duty-to-get-obc-reservation-maharashtra-minister-3124705", "urlToImage": "https://c.ndtvimg.com/2021-10/tu5r2lrk_chhagan-bhujbal-_625x300_23_October_21.jpg", "publishedAt": "2022-07-04T01:38:13Z", "content": "The Supreme Court did not accept the Maharashtra State Backward Class Commission's recommendation.\r\nMumbai: Nationalist Congress Party (NCP) leader Chhagan Bhujbal on Sunday said it is the responsibi… [+3954 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Eknath Shinde Faces Test To Prove Majority Today: 10 Facts", "description": "Maharashtra's four-day-old Eknath Shinde government -- formed with the aid of the BJP after two weeks of deep political crisis -- will have to prove its majority in the assembly today. The test, though, is expected to be a formality.", "url": "https://www.ndtv.com/india-news/maharashtra-crisis-shiv-sena-test-of-strength-for-eknath-shinde-today-10-facts-3124688", "urlToImage": "https://c.ndtvimg.com/2022-07/floppf3o_eknath-shinde_650x400_04_July_22.jpg", "publishedAt": "2022-07-04T01:20:06Z", "content": "<li>The test of strength comes a day after BJP's Rahul Narwekar was elected Speaker -- a significant move in view of the Shiv Sena's pending appeal to disqualify 16 rebel MLAs, including the new Chie… [+1694 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sharad Pawar Party Leader's Gaffe In Assembly. Then An Explanation", "description": "NCP leader and former Maharashtra minister Dhananjay Munde on Sunday said in the state Legislative Assembly that Milind Narvekar, a close confidante of Shiv Sena president Uddhav Thackeray, had met BJP leader Devendra Fadnavis.", "url": "https://www.ndtv.com/india-news/sharad-pawar-party-leader-dhananjay-mundes-gaffe-in-maharashtra-assembly-then-an-explanation-3124524", "urlToImage": "https://c.ndtvimg.com/2021-01/8au1lv9g_dhananjay-munde_625x300_15_January_21.jpg", "publishedAt": "2022-07-04T01:05:44Z", "content": "Dhananjay Munde has requested that the remarks be expunged. (File)\r\nMumbai: NCP leader and former Maharashtra minister Dhananjay Munde on Sunday said in the state Legislative Assembly that Milind Nar… [+1192 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE Updates: 16,103 New Cases, 31 More Deaths In India", "description": "India added 16,103 fresh coronavirus cases on Sunday, while 31 new deaths increased the country's virus-relateddeath count to 5,25,199, showed Union Health Ministry data.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-19-cases-july-4-3124668", "urlToImage": "https://c.ndtvimg.com/2021-12/h3rhcsek_covid-india-pti_625x300_05_December_21.jpg", "publishedAt": "2022-07-04T00:37:26Z", "content": "India COVID-19 Live: The recovery rate was recorded at 98.54%, the ministry said. (File)\r\nNew Delhi: India added 16,103 fresh coronavirus cases on Sunday, while 31 new deaths increased the country's … [+1086 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sri Lanka Shuts Schools Amid Fuel Crisis: Report", "description": "Amid an unprecedented fuel crisis, the Sri Lankan Education Ministry declared a holiday week from July 4 for all government and state-approved private schools.", "url": "https://www.ndtv.com/world-news/sri-lanka-shuts-schools-amid-fuel-crisis-report-3124639", "urlToImage": "https://c.ndtvimg.com/2022-07/c0737dsg_sri-lanka-fuel-crisis-afp-650_625x300_04_July_22.jpg", "publishedAt": "2022-07-04T00:20:25Z", "content": "Fuel Crisis: Sri Lanka had announced to shut down schools for a week in June too. (File)\r\nColombo: Amid an unprecedented fuel crisis, the Sri Lankan Education Ministry declared a holiday week from Ju… [+2261 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Officer Caught While Clicking Pics Of BJP's Resolution At Hyderabad Meet", "description": "A special branch officer of the state intelligence was caught red-handed while clicking photos of documents during the BJP's national executive meeting held in Hyderabad.", "url": "https://www.ndtv.com/india-news/telangana-special-branch-officer-caught-while-clicking-pics-of-bjps-resolution-at-hyderabad-meet-3124500", "urlToImage": "https://i.ndtvimg.com/i/2018-03/bjp-flag-generic_650x400_51520152255.jpg", "publishedAt": "2022-07-04T00:03:14Z", "content": "Union Minister G Kishan Reddy said that the BJP has nothing to hide. (Representational)\r\nHyderabad: A special branch officer of the state intelligence was caught red-handed while clicking photos of d… [+1992 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Amazon Founder Jeff Bezos Slams Biden's Appeal For Lower Gasoline Prices", "description": "Amazon founder Jeff Bezos has criticised President Joe Biden for calling on oil companies to lower sky-high gasoline prices, prompting the White House to come to the US leader's defense on Sunday.", "url": "https://www.ndtv.com/world-news/amazon-founder-jeff-bezos-slams-bidens-appeal-for-lower-gasoline-prices-3124653", "urlToImage": "https://c.ndtvimg.com/2022-04/28h025mg_jeff-bezos_625x300_26_April_22.jpg", "publishedAt": "2022-07-03T23:46:28Z", "content": "Gasoline prices at the pump have become a symbol of broader price rises in US. (File)\r\nNew York: Amazon founder Jeff Bezos has criticised President Joe Biden for calling on oil companies to lower sky… [+2411 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "BJP Chief Slams KCR, Says Telangana Under Rs 4.5 Lakh Crore Loss", "description": "BJP president JP Nadda on Sunday slammed the Telangana government, led by Chief Minister K Chandrashekhar Rao(also known as KCR), and said that the state was in a loss of Rs 4.5 lakh crore.", "url": "https://www.ndtv.com/india-news/bjp-chief-jp-nadda-slams-kcr-says-telangana-under-rs-4-5-lakh-crore-loss-3124484", "urlToImage": "https://c.ndtvimg.com/2022-06/2sn16mvg_jp-nadda_625x300_09_June_22.jpg", "publishedAt": "2022-07-03T23:40:27Z", "content": "People are perturbed by the corruption and injustice of KCR government, said JP Nadda. (File)\r\nHyderabad: BJP president JP Nadda on Sunday slammed the Telangana government, led by Chief Minister K Ch… [+2193 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Woman, Her Baby Among 3 Killed After Being Hit By Truck In Maharashtra", "description": "Three persons, including a six-month-old child, were killed after being hit by a truck in Pirangut area on the outskirts of Pune city of Maharashtra on Sunday evening, police said.", "url": "https://www.ndtv.com/pune-news/woman-her-baby-among-3-killed-after-being-hit-by-truck-in-maharashtra-3124539", "urlToImage": "https://c.ndtvimg.com/2019-01/bh5lk67_car-accident-generic-unsplash-650_625x300_24_January_19.jpg", "publishedAt": "2022-07-03T23:29:31Z", "content": "Pune: The truck rammed into several vehicles, said police. (Representational)\r\nPune: Three persons, including a six-month-old child, were killed after being hit by a truck in Pirangut area on the out… [+809 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "2 Women Killed In Shark Attack While Swimming In Egypt's Red Sea", "description": "Two women, one Austrian and the other Romanian, were killed in a shark attack this week off the coast of Egypt, Egypt's environment ministry and the tourists' respective foreign ministries said Sunday.", "url": "https://www.ndtv.com/world-news/2-women-killed-in-shark-attack-while-swimming-in-egypts-red-sea-3124648", "urlToImage": "https://c.ndtvimg.com/2019-11/ap3hath8_shark-generic-pixabay_625x300_27_November_19.jpg", "publishedAt": "2022-07-03T23:17:00Z", "content": "Egypt relies heavily on tourism revenues from the Red Sea. (Representational)\r\nCairo: Two women, one Austrian and the other Romanian, were killed in a shark attack this week off the coast of Egypt, E… [+2299 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "School Student Arrested For Murdering Teacher In Ayodhya: Police", "description": "A student of class 12 was arrested by Uttar Pradesh Police in Ayodhya on Sunday for allegedly murdering his teacher. According to the police, the arrested boy was in a relationship with the victim.", "url": "https://www.ndtv.com/cities/school-student-arrested-for-murdering-teacher-in-ayodhya-police-3124636", "urlToImage": "https://i.ndtvimg.com/i/2016-04/arrest-generic-istock_650x400_71461678057.jpg", "publishedAt": "2022-07-03T23:08:52Z", "content": "Ayodhya: The arrested boy was in a relationship with the victim, said police. (Representational)\r\nAyodhya: A student of class 12 was arrested by Uttar Pradesh Police in Ayodhya on Sunday for allegedl… [+736 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Video Of Cops Killing Black Man Released, More Protests In US", "description": "Several hundred protesters marched Sunday in Akron, Ohio after the release of body camera footage that showed police fatally shooting a Black man with several dozen rounds of bullets.", "url": "https://www.ndtv.com/world-news/video-of-cops-killing-black-man-released-more-protests-in-us-3124641", "urlToImage": "https://c.ndtvimg.com/2021-12/0885q2ig_us-police-generic-afp_625x300_01_December_21.jpg", "publishedAt": "2022-07-03T22:48:28Z", "content": "Black man shot dead by cops in US: Sunday marked the fourth straight day of protests. (Representational)\r\nWashington: Several hundred protesters marched Sunday in Akron, Ohio after the release of bod… [+3000 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "British Army's Twitter, YouTube Accounts Hacked, Posts Made On Crypto", "description": "The British Army regained control of its Twitter and YouTube accounts on Sunday after they were briefly hacked and used to post about cryptocurrencies and non-fungible tokens.", "url": "https://www.ndtv.com/world-news/british-armys-twitter-youtube-accounts-hacked-posts-made-on-crypto-3124626", "urlToImage": "https://c.ndtvimg.com/2022-07/43dhtmtg_british-army-generic-reuters-650_625x300_04_July_22.jpg", "publishedAt": "2022-07-03T21:55:28Z", "content": "Earlier, the Twitter account of British Army had retweeted several posts about NFTs. (File)\r\nLondon: The British Army regained control of its Twitter and YouTube accounts on Sunday after they were br… [+851 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"I Will Become A Dictator, Take Action If...\": Tamil Nadu Chief Minister", "description": "\"I will become a dictator and take action if indiscipline and irregularity rear their heads,\" Tamil Nadu Chief Minister and DMK president M K Stalin asserted in Namakkal on Sunday, addressing a party meet of representatives of urban local bodies.", "url": "https://www.ndtv.com/tamil-nadu-news/tamil-nadu-chief-minister-mk-stalin-says-i-will-become-dictator-3124220", "urlToImage": "https://c.ndtvimg.com/2022-01/lm8j5n8s_mk-stalin-pti_625x300_23_January_22.jpg", "publishedAt": "2022-07-03T21:37:14Z", "content": "MK Stalin said he became Chief Minister following his hard work for the people. (File)\r\nNamakkal (Tamil Nadu): \"I will become a dictator and take action if indiscipline and irregularity rear their he… [+2185 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Farmers' Body Accuses Centre Of Going Back On Its Promises", "description": "The Samyukta Kisan Morcha (SKM) on Sunday expressed its disappointment against the central government, accusingit of completely reneging on the written promises made to the farmers when their protest was lifted on December 9 last year.", "url": "https://www.ndtv.com/india-news/samyukta-kisan-morcha-accuses-centre-of-going-back-on-its-promises-3124490", "urlToImage": "https://c.ndtvimg.com/2021-12/q0logll8_farmers-protest-reuters-650_625x300_28_December_21.jpg", "publishedAt": "2022-07-03T21:24:11Z", "content": "\"Protest Against Betrayal\" public meetings will be organized at district level, said SKM. (File)\r\nNew Delhi: The Samyukta Kisan Morcha (SKM) on Sunday expressed its disappointment against the central… [+2295 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Friend Died After Saving Me\": Manipur Landslide Survivor Recounts Horror", "description": "Romen Phukan, 35, still can't believe he is alive. Haunted by the screams for help after the landslide hit their camp in Manipur last week, he recounts how the horror unfolded.", "url": "https://www.ndtv.com/india-news/manipur-landslide-my-friend-died-after-saving-my-life-survivor-recounts-landslide-horror-3124620", "urlToImage": "https://c.ndtvimg.com/2022-07/1prq9se4_manipur-landslide_625x300_03_July_22.jpg", "publishedAt": "2022-07-03T21:15:23Z", "content": "Manipur landslide: At least 37 people have died in the disaster. (File)\r\nGuwahati: Romen Phukan, 35, still can't believe he is alive.\r\nHaunted by the screams for help after the landslide hit their ca… [+2597 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Shinde Government In Maharashtra May Collapse In 6 Months: Sharad Pawar", "description": "Sharad Pawar on Sunday said that mid-term polls are likely in Maharashtra as the government led by rebel Shiv Sena leader Eknath Shinde may fall in the next six months.", "url": "https://www.ndtv.com/india-news/eknath-shinde-government-in-maharashtra-may-collapse-in-6-months-sharad-pawar-3124390", "urlToImage": "https://c.ndtvimg.com/2019-09/ekqv5sl4_sharad-pawar-pti_625x300_25_September_19.jpg", "publishedAt": "2022-07-03T19:29:54Z", "content": "Sharad Pawar said several rebel MLAs will return to their original party, said an NCP leader (File)\r\nMumbai: Nationalist Congress Party (NCP) chief Sharad Pawar on Sunday said that mid-term polls are… [+1471 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Public Health Emergency Declared In Puducherry's Karaikal", "description": "The Directorate of Health and Family Welfare Services of Puducherry on Sunday declared a 'public health emergency' in Karaikal region, an outlying pocket of the Union Territory, following an outbreak of acute diarrhoeal cases over the last few days.", "url": "https://www.ndtv.com/india-news/public-health-emergency-declared-in-puducherrys-karaikal-3124567", "urlToImage": "https://i.ndtvimg.com/i/2015-09/doctor-generic-hospital-generic_650x400_81441201739.jpg", "publishedAt": "2022-07-03T19:22:53Z", "content": "The Puducherry Director of Health said some patients reportedly positive for cholera. (Representational)\r\nPuducherry: The Directorate of Health and Family Welfare Services of Puducherry on Sunday dec… [+2584 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Hindu Outfits Allege Intrusion Of Extremists In Gurgaon, Want Them Ousted", "description": "Members of various Hindu outfits across Gurgaon and local villagers held a mahapanchayat in Manesar on Sunday, demanding that the FIR registered against those protesting over the killing of a tailor in Udaipur be withdrawn.", "url": "https://www.ndtv.com/india-news/hindu-outfits-allege-intrusion-of-extremists-in-gurgaon-want-them-ousted-3124334", "urlToImage": "https://c.ndtvimg.com/2018-10/ibpgcso8_gurgaon-police-650_625x300_27_October_18.jpg", "publishedAt": "2022-07-03T19:07:52Z", "content": "The outfits claimed that illegal religious conversions are going on in Gurgaon. (Representational)\r\nGurgaon: Members of various Hindu outfits across Gurgaon and local villagers held a mahapanchayat i… [+1676 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "5th Test Day 3: Pujara Fifty Puts India In Commanding Position vs England", "description": "England vs India: Cheteshwar Pujara hit a half-century as India took their lead to 257 runs at Stumps on Day 3.", "url": "https://sports.ndtv.com/england-vs-india-2022/eng-vs-ind-5th-test-day-3-cheteshwar-pujara-fifty-puts-india-in-commanding-position-3124528", "urlToImage": "https://c.ndtvimg.com/2022-07/9n12fkog_cheteshwar-pujara-afp_625x300_03_July_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-03T18:31:48Z", "content": "India's famed pace bowling unit for the umpteenth time put its team in pole position, bowling out England for 284 before the hosts just about managed to put a foot in the door by getting the top-orde… [+4606 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Harshal Hits Fifty As India Beat Northamptonshire By 10 Runs In Tour Game", "description": "After Harshal Patel lifted India from a precarious position to 149 for eight with a 36-ball 54, the visiting bowlers fired in unison to bowl out the county side for 139 with three balls to spare", "url": "https://sports.ndtv.com/england-vs-india-2022/harshal-patel-hits-fifty-as-india-beat-northamptonshire-by-10-runs-in-tour-match-3124480", "urlToImage": "https://c.ndtvimg.com/2022-07/6rlsvgf8_harshal-patel-806_625x300_03_July_22.jpg", "publishedAt": "2022-07-03T18:00:08Z", "content": "India will enter the upcoming limited overs series against England on a positive note, having beaten Northamptonshire by 10 runs after an impressive display by the bowlers in their second warm-up mat… [+1926 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Eknath Shinde Reinstated As Sena Legislative Leader Ahead Of Trust Vote", "description": "In a major setback to the Uddhav Thackeray faction a day before the crucial trust vote of the Eknath Shinde-BJP government, the newly-appointed speaker of the Maharashtra Assembly on Sunday night removed Ajay Chaudhary as the legislative party leader", "url": "https://www.ndtv.com/india-news/eknath-shinde-reinstated-as-sena-legislative-leader-ahead-of-trust-vote-3124472", "urlToImage": "https://c.ndtvimg.com/2022-07/s8pp775k_eknath-shinde-devendra-fadnavis_625x300_01_July_22.jpg", "publishedAt": "2022-07-03T17:57:35Z", "content": "The development comes as a major blow to the Uddhav Thackeray faction comprising 16 MLAs.\r\nMumbai: In a major setback to the Uddhav Thackeray faction a day before the crucial trust vote of the Eknath… [+1682 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Dutee Chand Says Faced Ragging In Sports Hostel", "description": "Odisha born Olympian Dutee Chand Sunday made a startling revelation by claiming that she too was a victim of ragging by her seniors during her stay at the Sports Hostel in Bhubaneswar.", "url": "https://sports.ndtv.com/athletics/dutee-chand-says-faced-ragging-in-sports-hostel-3124452", "urlToImage": "https://c.ndtvimg.com/2021-08/tio8u0dg_dutee-chand-afp_625x300_02_August_21.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-03T17:44:56Z", "content": "Odisha born Olympian Dutee Chand Sunday made a startling revelation by claiming that she too was a victim of ragging by her seniors during her stay at the Sports Hostel in Bhubaneswar during 2006-08.… [+1133 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"They're Everywhere\": Microplastics In Oceans, Air And Human Body", "description": "From ocean depths to mountain peaks, humans have littered the planet with tiny shards of plastic. We have even absorbed these microplastics into our bodies -- with uncertain implications.", "url": "https://www.ndtv.com/world-news/theyre-everywhere-microplastics-in-oceans-air-and-human-body-3124446", "urlToImage": "https://c.ndtvimg.com/2022-07/onicm69c_plastic-ocean_625x300_03_July_22.jpg", "publishedAt": "2022-07-03T17:37:09Z", "content": "Millions of tonnes of plastic make their way into the environment and degrade into smaller pieces.\r\nParis: From ocean depths to mountain peaks, humans have littered the planet with tiny shards of pla… [+4675 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "India U-17 Women's Assistant Coach Sacked For \"Sexual Misconduct\"", "description": "Indian women U-17 team assistant coach Alex Ambrose has been sacked for alleged sexual misconduct, SY Quraishi, a member of the Supreme Court-appointed CoA overseeing the All India Football Federation, said.", "url": "https://sports.ndtv.com/football/india-u-17-womens-assistant-coach-sacked-for-sexual-misconduct-3124435", "urlToImage": "https://c.ndtvimg.com/2020-08/180il97_football-generic-afp_625x300_27_August_20.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-03T17:26:27Z", "content": "Indian women U-17 team assistant coach Alex Ambrose has been sacked for alleged sexual misconduct, S. Y. Quraishi, a member of the Supreme Court-appointed Committee of Administrators (CoA) overseeing… [+1251 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rahul Gandhi Office Vandalism: Left Students Group Dissolves Committee", "description": "The Kerala state committee of the Students Federation of India (SFI) on Sunday decided to dissolve its Wayanad district committee in connection with the vandalism of Congress Member of Parliament Rahul Gandhi's office there allegedly by some of its a", "url": "https://www.ndtv.com/india-news/rahul-gandhi-office-vandalism-left-students-group-dissolves-committee-3124401", "urlToImage": "https://c.ndtvimg.com/2022-07/hg724m2o_rahul-gandhi-twitter_625x300_03_July_22.jpg", "publishedAt": "2022-07-03T17:13:22Z", "content": "The activists had held a protest march to Rahul Gandhi's office and had allegedly vandalised his office.\r\nThrissur: The Kerala state committee of the Students Federation of India (SFI) on Sunday deci… [+2602 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Adarsh Srivastava", "title": "CBSE, CISCE, PSEB; List of 10th, 12th Results 2022 Expected Next Week", "description": "The result for Central Board of Secondary Education (CBSE) Class 10 is expected to be released in a day or two. While the CBSE Class 12 Result 2022 is expected by next week.", "url": "https://www.ndtv.com/education/cbse-cisce-pseb-list-of-10th-12th-results-2022-be-announced-next-week", "urlToImage": "https://cache.careers360.mobi/media/presets/860X430/article_images/2022/7/3/CBSE-Board-Result-2022_4vWrW5J.jpg", "publishedAt": "2022-07-03T17:12:47Z", "content": "New Delhi:The result for Central Board of Secondary Education (CBSE) Class 10 is expected to be released in a day or two. While the CBSE Class 12 Result 2022 is expected by next week. The CBSE will p… [+2423 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Lashkar Terrorist Caught Was Jammu BJP's Minority Morcha IT Cell Chief - NDTV", "description": "<ol><li>Lashkar Terrorist Caught Was Jammu BJP's Minority Morcha IT Cell Chief  NDTV\r\n</li><li>Hats off to their courage: Bare handed villagers over power heavily armed most wanted Lashkar commander and hi  Times Now\r\n</li><li>Jammu Police Arrests Mastermind …", "url": "https://www.ndtv.com/india-news/lashkar-terrorist-caught-was-jammu-bjps-minority-morcha-it-cell-chief-3123483", "urlToImage": "https://c.ndtvimg.com/2022-07/ucfi4bbg_talib-hussain-shah_625x300_03_July_22.jpg", "publishedAt": "2022-07-03T17:12:00Z", "content": "Talib Hussain Shah and his accomplice were captured by the villagers in Jammu's Reasi\r\nSrinagar: A wanted Lashkar-e-Taiba terrorist captured in Jammu and Kashmir today was an active member of BJP. He… [+2941 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Looking For An Eknath Shinde\": Chirag Paswan's Dig At BJP, Nitish Kumar", "description": "Former Lok Janshakti Party chief Chirag Paswan on Sunday alleged that JD(U) and its ally BJP were in search of \"their own Eknath Shinde\" who could pull the rug from under the feet of his own party to benefit the rival.", "url": "https://www.ndtv.com/india-news/looking-for-an-eknath-shinde-chirag-paswans-dig-at-bjp-nitish-kumar-3124394", "urlToImage": "https://c.ndtvimg.com/2022-07/b2fk71r8_chirag-paswan-650_625x300_03_July_22.jpg", "publishedAt": "2022-07-03T17:11:01Z", "content": "Chirag Paswan at a press conference in Patna\r\nPatna: Former Lok Janshakti Party chief Chirag Paswan on Sunday alleged that JD(U) and its ally BJP were in search of \"their own Eknath Shinde\" who could… [+2844 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Several Injured In Copenhagen Mall Shooting: Police", "description": "Gunfire in a Copenhagen mall Sunday left several victims, Danish police said.", "url": "https://www.ndtv.com/world-news/several-injured-in-denmark-mall-shooting-police-responding-to-threat-news-agency-afp-3124368", "urlToImage": "https://c.ndtvimg.com/2022-07/vr34dsv_copenhagen-police-afp_625x300_03_July_22.jpg", "publishedAt": "2022-07-03T17:03:48Z", "content": "Police have urged people in the building to wait inside for their arrival.\r\nCopenhagen, Denmark: Gunfire in a Copenhagen mall Sunday has left several victims, Danish police said.\r\nPolice reinforcemen… [+895 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Carlos Sainz Claims Maiden Formula 1 Win In British Grand Prix", "description": "British Grand Prix: Starting his 150th race, Carlos Sainz kept his cool to beat Red Bull's Sergio Perez and Lewis Hamilton for Mercedes", "url": "https://sports.ndtv.com/formula-1/carlos-sainz-claims-maiden-formula-1-win-in-british-grand-prix-3124341", "urlToImage": "https://c.ndtvimg.com/2022-07/av3r4g3g_carlos-sainz-jr-afp_625x300_03_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-03T16:57:53Z", "content": "Carlos Sainz claimed his maiden Formula One win on his 150th start in a thrilling British Grand Prix at Silverstone on Sunday. The Ferrari driver kept his cool to beat Red Bull's Sergio Perez and Lew… [+1447 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Wimbledon: Sania Mirza-Mate Pavic Advance To Mixed Doubles Quarterfinals", "description": "The Indo-Croatian pair of Sania Mirza and Mate Pavic advanced to the quarter-finals of the mixed doubles event at the Wimbledon on Sunday.", "url": "https://sports.ndtv.com/wimbledon-2022/wimbledon-sania-mirza-mate-pavic-advance-to-mixed-doubles-quarterfinals-3124302", "urlToImage": "https://c.ndtvimg.com/2021-07/jfl01jlo_sania-mirza-wimbledon-afp_625x300_07_July_21.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-03T16:34:43Z", "content": "The Indo-Croatian pair of Sania Mirza and Mate Pavic advanced to the quarter-finals of the mixed doubles event at the Wimbledon on Sunday. The sixth seeded pair of Mirza and Pavic reached the mixed d… [+621 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Opposition To Aarey Metro Car Shed Likely Sponsored\": Devendra Fadnavis", "description": "Deputy Chief Minister Devendra Fadnavis on Sunday said the opposition to the to metro car shed in Aarey by some \"pseudo-environmentalists\" could be \"sponsored\".", "url": "https://www.ndtv.com/india-news/opposition-to-aarey-metro-car-shed-likely-sponsored-devendra-fadnavis-3124267", "urlToImage": "https://c.ndtvimg.com/2022-04/ctkkuna_devendra-fadnavis-presser-ndtv-650_650x400_25_April_22.jpg", "publishedAt": "2022-07-03T16:25:33Z", "content": "Devendra Fadnavis assured that no more trees will be cut for the project. (FILE)\r\nMumbai: Amid protests over the Eknath Shinde-led Maharashtra government's plan to move back the proposed Metro-3 car … [+3623 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Next 30-40 Years Will Be Era Of BJP, Says Amit Shah In Telangana", "description": "The next 30-40 years will be the era of the BJP which will make India a \"Vishwa Guru\" (world leader), Home Minister Amit Shah said on Sunday.", "url": "https://www.ndtv.com/india-news/next-30-40-years-will-be-era-of-bjp-says-amit-shah-in-telangana-3124258", "urlToImage": "https://c.ndtvimg.com/2022-07/bn63b028_amit-shah-telangana_625x300_03_July_22.jpg", "publishedAt": "2022-07-03T16:15:23Z", "content": "Amit Shah at the BJP national executive meet in Telangana\r\nHyderabad: The next 30-40 years will be the era of the BJP which will make India a \"Vishwa Guru\" (world leader), Home Minister Amit Shah sai… [+2694 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Roger Federer Says He Hopes To Play Wimbledon \"One More Time\"", "description": "Roger Federer said he hopes to play Wimbledon \"one more time\" despite being sidelined for a year with a knee injury.", "url": "https://sports.ndtv.com/wimbledon-2022/roger-federer-says-he-hopes-to-play-wimbledon-one-more-time-3124251", "urlToImage": "https://c.ndtvimg.com/2022-07/vep3opl8_roger-federer-afp_625x300_03_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-03T16:12:50Z", "content": "Roger Federer said Sunday he hopes to play Wimbledon \"one more time\" despite being sidelined for a year with a knee injury. \"I hope I can come back one more time. I've missed it here,\" said the eight… [+2429 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Shivanarine Chanderpaul Appointed Head Coach Of USA Women's, U-19 Teams", "description": "West Indies batting great Shivanarine Chanderpaul has been appointed head coach of the United States of America's senior women's and U-19 teams for a period of 18 months, the country's cricket board said on Sunday", "url": "https://sports.ndtv.com/cricket/shivanarine-chanderpaul-appointed-head-coach-of-usa-womens-and-u-19-teams-3124239", "urlToImage": "https://i.ndtvimg.com/i/2015-05/shivnarine-chanderpaul_650x488_51432820013.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-03T16:05:04Z", "content": "West Indies batting great Shivanarine Chanderpaul has been appointed head coach of the United States of America's senior women's and U-19 teams for a period of 18 months, the country's cricket board … [+1555 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Women's Hockey World Cup: India, England Play Out 1-1 Draw", "description": "India and England drew 1-1 in their Women's Hockey World Cup Pool B encounter on Sunday.", "url": "https://sports.ndtv.com/hockey/womens-hockey-world-cup-india-england-play-out-1-1-draw-3124238", "urlToImage": "https://c.ndtvimg.com/2022-07/p9okrcgo_india-women-hockey-india_625x300_03_July_22.jpeg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-03T16:05:01Z", "content": "The Indian women's hockey team played out a hard-fought 1-1 draw against England in its opening match of the FIH World Cup here on Sunday. England took the lead through Isabella Petter in the ninth m… [+1950 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Over 18.35 Lakh People Still Affected, 5 More Die In Assam Floods", "description": "Assam's flood situation improved on Sunday as the number of affected people declined to over 18.35 lakh from the previous day's 22.17 lakh even as five more persons lost their lives due to the deluge, an official bulletin said.", "url": "https://www.ndtv.com/india-news/over-18-35-lakh-people-still-affected-5-more-die-in-assam-floods-3124215", "urlToImage": "https://c.ndtvimg.com/2022-06/ptoq20q8_assam-floods_625x300_25_June_22.jpg", "publishedAt": "2022-07-03T15:53:32Z", "content": "More than 18,35,500 people are still affected due to the flood across 23 districts.\r\nGuwahati: Assam's flood situation improved on Sunday as the number of affected people declined to over 18.35 lakh … [+647 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Vishesh Roy", "title": "\"A Little Faster Than Southee, Eh\": Kohli's Savage Sledge vs England Star", "description": "England vs India: The Virat Kohli vs Jonny Bairstow sledge match was a rather entertaining sublot on Days 2 and 3 of the Test in Edgbaston.", "url": "https://sports.ndtv.com/england-vs-india-2022/a-little-faster-than-southee-eh-virat-kohlis-savage-sledge-against-england-star-watch-3124200", "urlToImage": "https://c.ndtvimg.com/2022-07/4bd8dnvg_virat-kohli-afp_625x300_03_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-03T15:48:17Z", "content": "Virat Kohli knows how to get under the skin of the opposition and he tries his best to disturb the concentration of the batters. So it was no surprise that Kohli decided to have a go at Jonny Bairsto… [+1624 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Punjab Chief Minister Bhagwant Mann To Expand Cabinet On Monday", "description": "Punjab Chief Minister Bhagwant Mann will expand his cabinet on July 4 and five MLAs are expected to be inducted as ministers.", "url": "https://www.ndtv.com/india-news/punjab-chief-minister-bhagwant-mann-to-expand-cabinet-on-monday-3124188", "urlToImage": "https://c.ndtvimg.com/2022-03/krcl73k8_bhagwant-mannkoo_625x300_17_March_22.jpg", "publishedAt": "2022-07-03T15:43:31Z", "content": "Chandigarh: Punjab Chief Minister Bhagwant Mann will expand his cabinet on July 4 and five MLAs are expected to be inducted as ministers, party sources said on Sunday.\r\nThe oath-taking ceremony will … [+1527 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Strategic Bridge At India-China Border Washed Away In Flash Flood: Report", "description": "A Bailey bridge, connecting two strategic locations in Kurung Kumey district of Arunachal Pradesh, was washed away in a flash flood, an official of the Border Roads Organisation (BRO) said on Sunday.", "url": "https://www.ndtv.com/india-news/strategic-bridge-at-india-china-border-in-arunachal-washed-away-in-flash-flood-report-3124175", "urlToImage": "https://c.ndtvimg.com/2020-09/eh2umj1g_india-china-border-arunachal-pradesh_625x300_02_September_20.jpg", "publishedAt": "2022-07-03T15:36:56Z", "content": "New Delhi: A Bailey bridge, connecting two strategic locations in Kurung Kumey district of Arunachal Pradesh, was washed away in a flash flood, an official of the Border Roads Organisation (BRO) said… [+993 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Glacier Collapses In Italian Alps, 5 Dead: Rescuers", "description": "An avalanche sparked by the collapse of a glacier in the northern Italian Alps killed at least five people and injured eight others on Sunday, an emergency services spokeswoman said.", "url": "https://www.ndtv.com/world-news/glacier-collapses-in-italian-alps-3124168", "urlToImage": "https://c.ndtvimg.com/2022-07/jstt1j98_italy-glacier-collapse_625x300_03_July_22.jpg", "publishedAt": "2022-07-03T15:33:30Z", "content": "The glacier collapsed on the mountain of Marmolada.\r\nRome, Italy: An avalanche sparked by the collapse of the largest glacier in the Italian Alps killed at least five people and injured eight others … [+1489 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Adarsh Srivastava", "title": "NATA 2022: Phase 2 Admit Card Release Date; Details On Exam Here", "description": "The Council of Architecture (COA) will issue the National Aptitude Test in Architecture (NATA) 2022 phase 2 admit card tomorrow, July 04. The candidates would be able to download their NATA phase 2 admit card from the official website- nata.in.", "url": "https://www.ndtv.com/education/nata-2022-phase-2-admit-card-release-date-details-on-exam-here", "urlToImage": "https://cache.careers360.mobi/media/presets/860X430/article_images/2022/7/3/NATA-Admit-Card-2022.jpg", "publishedAt": "2022-07-03T15:28:20Z", "content": "New Delhi:The Council of Architecture (COA) will issue the National Aptitude Test in Architecture (NATA) 2022 phase 2 admit card tomorrow, July 04. The candidates would be able to download their NATA… [+1663 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Zhou Escapes Serious Injury After Multi-Car Horror Crash At British GP", "description": "The British Grand Prix was red-flagged after a horror opening-corner multi-car smash at Silverstone on Sunday, with Zhou Guanyu's Alfa Romeo flipped upside down and hurtling over the barrier.", "url": "https://sports.ndtv.com/formula-1/multi-car-horror-crash-sees-red-flag-at-british-grand-prix-3124130", "urlToImage": "https://c.ndtvimg.com/2022-07/322rtqp_zhou-guanyu-crash-afp_625x300_03_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-03T15:14:57Z", "content": "The British Grand Prix was red-flagged after a horror opening-corner multi-car smash at Silverstone on Sunday, with Zhou Guanyu's Alfa Romeo flipped upside down and hurtling over the circuit's safety… [+3023 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Legality To Be Checked\": Union Minister On Aurangabad Name Change", "description": "The previous MVA government under Uddhav Thackeray should not take credit for approving the renaming of Aurangabad as Sambhajinagar as it was taken in haste and will be done properly by the Centre, Union minister Bhagwat Karad said on Sunday.", "url": "https://www.ndtv.com/india-news/legality-to-be-checked-union-minister-on-aurangabad-name-change-3124079", "urlToImage": "https://c.ndtvimg.com/2022-07/j5r8tuh_uddhav-thackeray-650_625x300_01_July_22.jpg", "publishedAt": "2022-07-03T14:56:52Z", "content": "The earlier MVA government must not take credit, said Union Minister Bhagwat Karad\r\nAurangabad: The previous MVA government under Uddhav Thackeray should not take credit for approving the renaming of… [+1109 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "People Of Telangana Want 'Double Engine Growth': PM Modi At Public Meet", "description": "Prime Minister Narendra Modi on Sunday said the NDA government at the Centre has been trying to bring positive change in every Indian's life and the people of Telangana want a  a 'double engine growth' in the state.", "url": "https://www.ndtv.com/india-news/people-of-telangana-want-double-engine-growth-pm-narendra-modi-at-public-meet-in-hyderabad-bjp-executive-meet-3124049", "urlToImage": "https://c.ndtvimg.com/2022-07/gf3ep9qg_pm-modi-650_625x300_03_July_22.jpg", "publishedAt": "2022-07-03T14:49:15Z", "content": "Elections are due in Telangana next year.\r\nHyderabad: Prime Minister Narendra Modi on Sunday said the NDA government at the Centre has been trying to bring positive change in every Indian's life and … [+1372 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Abhimanyu Bose", "title": "Jonny Bairstow Replies To Virat Kohli Sledging With Scintillating Century", "description": "England vs India: Jonny Bairstow smashed his third consecutive Test century to help take England to a respectable score in the 5th Test against India.", "url": "https://sports.ndtv.com/england-vs-india-2022/jonny-bairstow-replies-to-virat-kohli-sledging-with-scintillating-century-3124041", "urlToImage": "https://c.ndtvimg.com/2022-07/gcgmmc3_jonny-bairstow-afp_625x300_03_July_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-03T14:46:21Z", "content": "England star Jonny Bairstow had started slow on Day 2 of the rescheduled 5th Test against India as the hosts went to Stumps at 84/5. On Day 3 too, he started cautiously, as Mohammed Shami zipped the … [+1464 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Man Dies After Truck Powered By Jet Engines Crashes During Air Show In US", "description": "The driver of a truck powered by jet engines was killed during a high-speed accident in front of spectators at an air show in the US state of Michigan. The man identified as Chris Darnell died at the Battle Field of Flight Air Show.", "url": "https://www.ndtv.com/world-news/man-dies-after-truck-powered-with-jet-engines-crashes-at-air-show-in-us-michigan-3124008", "urlToImage": "https://c.ndtvimg.com/2022-07/ds4m26jo_shockwave-jet-truck-650_625x300_03_July_22.jpg", "publishedAt": "2022-07-03T14:33:49Z", "content": "The truck was modified to carry three jet engines on the back.\r\nWashington: The driver of a truck powered by jet engines was killed during a high-speed accident in front of spectators at an air show … [+1432 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Exorbitantly High\" Airfares Hurt Tourism: Kerala Chief Minister To PM", "description": "Kerala Chief Minister Pinarayi Vijayan has asked Prime Minister Narendra Modi to intervene in the issue of rising air fares in the country.", "url": "https://www.ndtv.com/kerala-news/exorbitantly-high-airfares-hurt-tourism-kerala-chief-minister-pinarayi-vijayan-to-pm-narendra-modi-3124007", "urlToImage": "https://c.ndtvimg.com/2022-03/sqnil7cg_pm-modi-pinarayi-vijayan_625x300_24_March_22.jpg", "publishedAt": "2022-07-03T14:32:31Z", "content": "Pinarayi Vijayan asked PM Narendra Modi to intervene on high air fares (File)\r\nThiruvananthapuram: Kerala Chief Minister Pinarayi Vijayan has asked Prime Minister Narendra Modi to intervene in the is… [+2312 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Learn From Mistakes Of Parties In \"Terminal Decline\": PM To BJP Workers", "description": "Prime Minister Narendra Modi on Sunday asked BJP members to learn from mistakes of the parties which ruled India for long but are now in \"terminal decline\".", "url": "https://www.ndtv.com/india-news/pm-modi-in-hyderabd-for-bjp-national-executive-meeting-learn-from-mistakes-of-parties-in-terminal-decline-3123952", "urlToImage": "https://c.ndtvimg.com/2022-07/qasfue6g_pm-modi-pti_625x300_03_July_22.jpg", "publishedAt": "2022-07-03T14:12:22Z", "content": "PM Modi asserted that his government has worked for everyone.\r\nHyderabad: Prime Minister Narendra Modi on Sunday asked BJP members to learn from mistakes of the parties which ruled India for long but… [+3504 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Adarsh Srivastava", "title": "JEECUP Answer Key 2022 Out; Check Direct Link, Steps To Download", "description": "The Joint Entrance Examination Council Uttar Pradesh (JEECUP) answer key 2022 has been released today (July 03) by the Uttar Pradesh Joint Entrance Examination (UPJEE). The JEECUP answer key download link has been activated on jeecup.admissions.nic.in.", "url": "https://www.ndtv.com/education/jeecup-answer-key-2022-out-check-direct-link-steps-download", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/3/JEECUP-Answer-Key-2022.jpg", "publishedAt": "2022-07-03T14:08:46Z", "content": "New Delhi:The Joint Entrance Examination Council Uttar Pradesh (JEECUP) answer key 2022 has been released today (July 03) by the Uttar Pradesh Joint Entrance Examination (UPJEE). The JEECUP answer ke… [+1808 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Abhimanyu Bose", "title": "Watch: Kohli Blows A Kiss After Taking Catch To Dismiss Jonny Bairstow", "description": "England vs India: Virat Kohli took the catch that saw Jonny Bairstow's belligerent knock come to an end after much drama between the two.", "url": "https://sports.ndtv.com/england-vs-india-2022/eng-vs-ind-5th-test-virat-kohli-blows-a-kiss-after-taking-catch-to-dismiss-jonny-bairstow-watch-3123924", "urlToImage": "https://c.ndtvimg.com/2022-07/u792lapo_virat-kohli-blows-kiss-afp_625x300_03_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-03T14:02:52Z", "content": "The Jonny Bairstow-Virat Kohli drama was the centre of attention on Day 3 of the ongoing rescheduled 5th Test between England and India at Edgbaston. With Bairstow seemingly struggling, Kohli was see… [+1850 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Maharashtra Governor Sweeps Path Of Rath Yatra With Broom In Mumbai", "description": "Maharashtra Governor Bhagat Singh Koshyari swept the path of the Lord Jagannath Rath Yatra organized by International Society for Krishna Consciousness (ISKCON) in Mumbai with a broom on Sunday.", "url": "https://www.ndtv.com/india-news/maharashtra-governor-bhagat-singh-koshiyari-sweeps-path-of-lord-jagannaths-rath-yatra-with-broom-in-mumbai-iskcon-mumbai-3123911", "urlToImage": "https://c.ndtvimg.com/2022-07/60a7kfuo_rath-yatra-maharashtra-governor-650_625x300_03_July_22.jpg", "publishedAt": "2022-07-03T13:58:53Z", "content": "The Rath Yatra festival is celebrated across the world.\r\nMumbai: Maharashtra Governor Bhagat Singh Koshyari swept the path of the Lord Jagannath Rath Yatra with a broom. The Rath Yatra was organized … [+1579 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Supreme Court Judge Quotes PM's 'Think Globally, Act Locally' Approach", "description": "Supreme Court judge Justice Vikram Nath on Sunday quoted Prime Minister Narendra Modi's approach of \"thinking globally but acting locally\" and said while taking the international goals forward, the domestic interests should not be lost sight of.", "url": "https://www.ndtv.com/india-news/supreme-court-judge-quotes-pms-think-globally-act-locally-approach-3123898", "urlToImage": "https://c.ndtvimg.com/2022-06/84eooouo_pm-modi-germany_625x300_26_June_22.jpg", "publishedAt": "2022-07-03T13:53:53Z", "content": "The judge said PM's approach implies our vision must be concerned about rights of others\r\nNew Delhi: Supreme Court judge Justice Vikram Nath on Sunday quoted Prime Minister Narendra Modi's approach o… [+5242 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Man Trespasses Into Mamata Banerjee's House In Kolkata, Spends Night", "description": "A man sneaked into Chief Minister Mamata Banerjee's residence in south Kolkata's Kalighat area in the early hours of Sunday and spend the entire night sitting in a corner without anyone noticing him, the police said.", "url": "https://www.ndtv.com/india-news/man-trespasses-into-west-bengal-chief-minister-mamata-banerjees-house-in-kolkata-spends-night-3123859", "urlToImage": "https://c.ndtvimg.com/2021-07/7m3hoq48_mamata-banerjee_650x400_07_July_21.jpg", "publishedAt": "2022-07-03T13:36:45Z", "content": "The police said he was spotted by the security personnel in the morning. (File)\r\nKolkata: A man sneaked into Chief Minister Mamata Banerjee's residence in south Kolkata's Kalighat area in the early h… [+1097 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Watch: Adele Pauses London Concert Midway To Help Fans, Internet Hails", "description": "British singer-songwriter Adele is winning hearts online after videos of her stopping a live concert to help a fan in distress surfaced on social media.", "url": "https://www.ndtv.com/world-news/watch-adele-pauses-london-concert-midway-to-help-fans-internet-hails-3123853", "urlToImage": "https://i.ndtvimg.com/mt/movies/2014-01/adele-630.jpg", "publishedAt": "2022-07-03T13:33:27Z", "content": "Adele returned to stage for her first concert in five years. (File)\r\nBritish singer-songwriter Adele is winning hearts online after videos of her stopping a live concert to help a fan in distress sur… [+2147 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Adarsh Srivastava", "title": "JEE Main 2022: Anger, Protests Over Chemistry Answer Key NTA Releases", "description": "The National Testing Agency, on Saturday, June 2, released the JEE Main answer key 2022 for session 1 examination. However, the students have found many discrepancies in the chemistry section of shift 1 paper held on June 29.", "url": "https://www.ndtv.com/education/jee-main-2022-anger-protests-over-chemistry-paper-after-nta-releases-answer-key", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/3/JEE-Main-2022-Answer-Key.jpg", "publishedAt": "2022-07-03T13:25:48Z", "content": "New Delhi:The National Testing Agency, on Saturday, June 2, released the JEE Main answer key 2022 for session 1 examination. However, the students have found many discrepancies in the Chemistry secti… [+1705 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Mumbai Ex Top Cop Summoned By Central Agency In Money Laundering Case", "description": "Former Police Commissioner of Mumbai, Sanjay Pandey, has been summoned by the Enforcement Directorate or ED to appear before it on July 5 in connection with a money laundering case.", "url": "https://www.ndtv.com/india-news/mumbai-ex-top-cop-sanjay-pandey-summoned-by-central-probe-agency-in-money-laundering-case-news-agency-pti-3123818", "urlToImage": "https://c.ndtvimg.com/2022-07/r2ruv6c_sanjay-pandey_650x400_03_July_22.jpg", "publishedAt": "2022-07-03T13:12:48Z", "content": "New Delhi: Former Police Commissioner of Mumbai, Sanjay Pandey, has been summoned by the Enforcement Directorate or ED to appear before it in Delhi on July 5 in connection with a money laundering cas… [+248 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "\"Whatever Makes You Truly Happy\": PV Sindhu's Dance Goes Viral", "description": "Two-time Olympic medallist PV Sindhu on Saturday took to Instagram to share a video of her dancing to a remix of two trending songs.", "url": "https://sports.ndtv.com/badminton/whatever-makes-you-truly-happy-pv-sindhus-dance-goes-viral-3123810", "urlToImage": "https://c.ndtvimg.com/2022-07/o8jv4d48_pv-sindhu-806_625x300_03_July_22.jpg", "publishedAt": "2022-07-03T13:09:46Z", "content": "Two-time Olympic medallist PV Sindhu on Saturday took to Instagram to share a video of her dancing to a remix of two trending songs. \"Whatever makes you truly happy, do that!!\" the star shuttler capt… [+1031 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Alia Bhatt Shows How She \"Sipped Koffee This Year\". See Post", "description": "Alia Bhatt has shared her look from Koffee With Karan Season 7", "url": "https://www.ndtv.com/entertainment/alia-bhatt-shows-how-she-sipped-koffee-this-year-see-post-3123808", "urlToImage": "https://c.ndtvimg.com/2022-07/bgl967uo_alia_625x300_03_July_22.jpg", "publishedAt": "2022-07-03T13:08:09Z", "content": "Alia Bhatt shared this picture. (courtesy: aliaabhatt)\r\nAlia Bhatt shared a set of stunning pictures on her Instagram handle on Sunday. The actress, who is expecting her first child with her husband … [+1585 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Vedant Yadav", "title": "Sehwag Trolls Kohli As Bairstow Goes Berserk After Sledging Match", "description": "Virat Kohli's sledging contest with Jonny Bairstow seemed to fire up the England batter and Virender Sehwag came up with a hilarious tweet to sum it up.", "url": "https://sports.ndtv.com/england-vs-india-2022/eng-vs-ind-5th-test-virender-sehwag-trolls-virat-kohli-as-jonny-bairstow-goes-berserk-after-sledging-match-3123803", "urlToImage": "https://c.ndtvimg.com/2022-07/dj82tn08_jonny-bairstow-afp_625x300_03_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-03T13:06:29Z", "content": "Jonny Bairstow led England's revival on Day 3 after the Indian bowlers had taken over the proceedings of the ongoing fifth Test at Edgbaston in Birmingham. After starting cautiously on Day 2, Bairsto… [+1829 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Advanced Wall Radar, Rescue Dogs Look For Survivors In Manipur Landslide", "description": "The death count due to a massive landslide at a Territorial Army Camp in Manipur's Noney district has increased to 37, officials said on Saturday.", "url": "https://www.ndtv.com/india-news/advanced-wall-radar-rescue-dogs-look-for-survivors-in-manipur-landslide-3123789", "urlToImage": "https://c.ndtvimg.com/2022-07/1prq9se4_manipur-landslide_625x300_03_July_22.jpg", "publishedAt": "2022-07-03T12:57:17Z", "content": "Guwahati: The death count due to a massive landslide at a Territorial Army Camp in Manipur's Noney district has increased to 37, officials said on Saturday. Search operations are still for another 28… [+1345 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Will Find Out\": Devendra Fadnavis After BJP Alleges Amravati Cover-Up", "description": "In the 12 days since the killing, the police had arrested six people, but had not linked it to Nupur Sharma's comment.", "url": "https://www.ndtv.com/india-news/amravati-murder-devendra-fadnavis-after-bjp-alleges-cover-up-will-find-out-3123784", "urlToImage": "https://c.ndtvimg.com/2022-06/uhap4aqg_devendra-fadnavis_650x400_30_June_22.jpeg", "publishedAt": "2022-07-03T12:52:30Z", "content": "Devendra Fadnavis said the Amravati murder was a case of \"shocking cruelty\" (File)\r\nMumbai: Maharashtra Deputy Chief Minister Devendra on Sunday said that the murder of a chemist in the state's Amrav… [+1802 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "On Uber Fare For Ride Within Mumbai, Customer Says \"Flight To Goa Cheaper\"", "description": "The exorbitant fare charged by ride-hailing company Uber for ferrying a passenger stunned a Mumbai resident recently.", "url": "https://www.ndtv.com/india-news/on-uber-fare-for-ride-within-mumbai-customer-says-flight-to-goa-cheaper-3123769", "urlToImage": "https://i.ndtvimg.com/i/2017-11/app-based-cab-generic_650x400_61510397498.jpg", "publishedAt": "2022-07-03T12:42:56Z", "content": "The person was trying to book a cab home in the pouring rain\r\nMumbai: The exorbitant fare charged by ride-hailing company Uber for ferrying a passenger stunned a Mumbai resident recently. The person … [+2907 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Rohit Sharma Out Of Isolation After Testing Negative: Report", "description": "According to a report, Indian captain Rohit Sharma is finally out of isolation after having tested negative for COVID-19 and will now be available for the white-ball series against England beginning with the first T20I in Southampton on July 7", "url": "https://sports.ndtv.com/england-vs-india-2022/rohit-sharma-out-of-isolation-after-testing-negative-report-3123763", "urlToImage": "https://c.ndtvimg.com/2022-02/h3hpgabg_rohit-sharma-bcci_625x300_16_February_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-03T12:41:42Z", "content": "Indian captain Rohit Sharma is finally out of isolation after having tested negative for COVID-19 and will now be available for the white-ball series against England beginning with the first T20I in … [+1004 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Supreme Court Judge Who Heard Nupur Sharma Plea Slams \"Personal Attacks\"", "description": "A judge who was part of the Supreme Court bench that strongly criticised the BJP's Nupur Sharma for her comments on Prophet Muhammed, today made strong remarks about personal attack on judges for their judgments.", "url": "https://www.ndtv.com/india-news/supreme-court-judge-who-heard-nupur-sharma-plea-slams-personal-attacks-for-judgments-says-can-lead-to-dangerous-scenario-3123736", "urlToImage": "https://c.ndtvimg.com/2022-07/n0oj5mcg_justice-jamshed-b-pardiwala_650x400_03_July_22.jpg", "publishedAt": "2022-07-03T12:33:29Z", "content": "A judge who was part of the Supreme Court bench that slammed the BJP's Nupur Sharma for her comments on Prophet Muhammed, today made strong remarks about personal attack on judges for their judgments… [+2657 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Watch: Group Of Children Sharing One Umbrella Leaves Internet Nostalgic", "description": "An adorable video showing a group of children walking beside a road trying to fit into a single umbrella has won hearts on the internet.", "url": "https://www.ndtv.com/offbeat/viral-video-group-of-children-sharing-one-umbrella-leaves-internet-nostalgic-3123735", "urlToImage": "https://c.ndtvimg.com/2022-07/jjur5s9_kids-sharing-umbrella-_625x300_03_July_22.jpg", "publishedAt": "2022-07-03T12:33:04Z", "content": "The videohas been viewed more than 1.1 million times.\r\nAn adorable video showing a group of children walking beside a road trying to fit into a single umbrella has won hearts on the internet. \r\nThe c… [+1609 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sri Lanka Left With Less Than A Day's Worth Of Fuel: Sri Lankan Minister", "description": "Sri Lanka has less than a day's worth of fuel left, the energy minister said Sunday, with public transport grinding to a halt. He said the petrol reserves in the country were at about 4,000 tonnes.", "url": "https://www.ndtv.com/world-news/sri-lanka-left-with-less-than-a-days-worth-of-fuel-sri-lankan-minister-kanchana-wijesekera-3123704", "urlToImage": "https://c.ndtvimg.com/2022-05/o4m100fo_sri-lanka-fuel-shortage-reuters_625x300_17_May_22.jpg", "publishedAt": "2022-07-03T12:19:39Z", "content": "Most shops were closed Sunday, with the situation expected to worsen on Monday. (File)\r\nColombo: Sri Lanka has less than a day's worth of fuel left, the energy minister said Sunday, with public trans… [+2448 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Adarsh Srivastava", "title": "KEAM 2022 Tomorrow: Know Exam Timings, Guidelines Here", "description": "The Commissioner for Entrance Examinations, CEE Kerala is all set to conduct the KEAM 2022 exam tomorrow  (July 4). Candidates registered for the exam can check the KEAM exam day guidelines, test timings and other details below.", "url": "https://www.ndtv.com/education/keam-2022-tomorrow-know-exam-timings-guidelines-here", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/3/KEAM-2022-Exam-Day-Guidelines.jpg", "publishedAt": "2022-07-03T12:18:35Z", "content": "The Commissioner for Entrance Examinations, CEE Kerala is all set to conduct the KEAM 2022 exam tomorrow (July 4). Candidates registered for the exam can check the KEAM exam day guidelines, test timi… [+2206 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Debina And Gurmeet Share First Pic Of Daughter Lianna. See Adorable Post", "description": "\"Our hearts are so full - knowing that we are part of a beautiful community,\" wrote Debina Bonnerjee", "url": "https://www.ndtv.com/entertainment/debina-bonnerjee-and-gurmeet-choudhary-share-first-pic-of-daughter-lianna-see-adorable-post-3123698", "urlToImage": "https://c.ndtvimg.com/2022-07/8srcvqh8_debina_625x300_03_July_22.jpg", "publishedAt": "2022-07-03T12:14:56Z", "content": "First picture of Debina and Gurmeet's daughter. (courtesy: debinabon)\r\nTV stars Debina Bonnerjee and Gurmeet Choudhary have treated their Insta fams with an adorable picture of their daughter Lianna … [+1426 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Delhi Assembly's Two-Day Monsoon Session To Start From Tomorrow", "description": "The two-day Monsoon session of the Delhi Assembly will commence on Monday, in which the AAP government will table a Bill to increase the salaries of MLAs, an Assembly bulletin said.", "url": "https://www.ndtv.com/delhi-news/delhi-assemblys-two-day-monsoon-session-to-start-from-tomorrow-3123676", "urlToImage": "https://c.ndtvimg.com/2021-12/pt0qh61g_delhi-assembly-650_625x300_14_December_21.jpg", "publishedAt": "2022-07-03T12:04:32Z", "content": "According to the bulletin the session will commence on July 4 at 11 am.\r\nNew Delhi: The two-day Monsoon session of the Delhi Assembly will commence on Monday, in which the AAP government will table a… [+2532 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "PM Modi Refers To Hyderabad As Bhagyanagar, Sparks Buzz On Name Change", "description": "Hyderabad or Bhagyanagar? Prime Minister Naredra Modi, in the city for the big BJP meet, referred to Telangana capital as Bhagyanagar during his address to the delegates from across the country.", "url": "https://www.ndtv.com/india-news/pm-modi-refers-to-hyderabad-as-bhagyanagar-sparks-buzz-on-name-change-3123664", "urlToImage": "https://c.ndtvimg.com/2022-07/77gsodig_pm-hyderabad-650_625x300_03_July_22.jpg", "publishedAt": "2022-07-03T11:58:21Z", "content": "The RSS and BJP leaders have been demanding to rename the Hyderabad as Bhagyanagar.\r\nHyderabad: Hyderabad or Bhagyanagar? Prime Minister Naredra Modi, in the city for the big BJP meet, referred to Te… [+1499 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Video Shows Devotees Celebrating Rath Yatra Festival On Florida Beach", "description": "A video of Lord Jagannath's Rath Yatra being held at Florida beach in the United States is going viral on the internet.", "url": "https://www.ndtv.com/world-news/viral-video-shows-devotees-in-us-celebrating-rath-yatra-festival-on-florida-beach-3123646", "urlToImage": "https://c.ndtvimg.com/2022-07/61bv9ofo_rath-yatra-in-us_625x300_03_July_22.jpg", "publishedAt": "2022-07-03T11:51:31Z", "content": "The video was shot in Tampa, Florida.\r\nA video of Lord Jagannath's Rath Yatra being held at Florida beach in the United States is going viral on the internet. \r\nRath Yatra was celebrated across India… [+1565 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Karisma Kapoor Enjoyed Delicious Sweet Delights On Saturday", "description": "Karisma Kapoor satiated her sweet tooth with tasty desserts on Saturday. Guess what she ate?", "url": "https://food.ndtv.com/news/karisma-kapoor-enjoys-her-weekend-with-delicious-sweet-delights-3123643", "urlToImage": "https://c.ndtvimg.com/2022-05/q2rh6c0o_karisma-kapoor_625x300_23_May_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-03T11:50:53Z", "content": "Karisma Kapoor continues to stun us with her beauty and envious fitness regime. But do you know what's more interesting? It's fantastic how she doesn't refrain from the urge to devour her favourite f… [+2516 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Abhimanyu Bose", "title": "Watch: Bumrah's Cheeky Celebration As He Gets Wicket After A No-Ball", "description": "England vs India: Jasprit Bumrah benefited from some good fortune as two no-balls led to wickets off the extra deliveries.", "url": "https://sports.ndtv.com/england-vs-india-2022/eng-vs-ind-5th-test-jasprit-bumrahs-cheeky-celebration-as-he-gets-wicket-after-a-no-ball-watch-3123635", "urlToImage": "https://c.ndtvimg.com/2022-07/9qf093u_jasprit-bumrah-celebration-afp_625x300_03_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-03T11:47:34Z", "content": "Jasprit Bumrah, in his first match as India captain, first put on a show with the bat and then ripped through England's top order in the ongoing rescheduled 5th Test at Edgbaston. Bumrah got the wick… [+1649 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "India Gifts 75 Ambulances, 17 School Buses To Nepal", "description": "India on Sunday gifted 75 ambulances and 17 school buses to Nepal as part of its ongoing efforts to build on the \"robust and longstanding\" partnership between the two countries.", "url": "https://www.ndtv.com/india-news/india-gifts-75-ambulances-17-school-buses-to-nepal-3123633", "urlToImage": "https://c.ndtvimg.com/2022-07/6lvla4p_india-nepal_625x300_03_July_22.jpg", "publishedAt": "2022-07-03T11:46:41Z", "content": "In 2021, India had gifted 39 ambulances equipped with ventilators to Nepal.\r\nKathmandu: India on Sunday gifted 75 ambulances and 17 school buses to Nepal as part of its ongoing efforts to build on th… [+2232 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Twitter CEO Parag Agrawal, Hands Full At Coffee Counter, Serves Staff", "description": "Twitter's chief executive officer Parag Agrawal attended a number of business events in London last week. During that time, despite all the activity, Mr Agrawal even made time to serve coffee to the staff.", "url": "https://www.ndtv.com/india-news/twitter-ceo-parag-agrawal-serves-coffee-at-the-social-media-giant-s-london-office-3123627", "urlToImage": "https://c.ndtvimg.com/2022-07/mv2i05o_parag-agrawal-coffee_625x300_03_July_22.jpg", "publishedAt": "2022-07-03T11:44:55Z", "content": "Parag Agrawal was seen taking coffee orders at Twitter's London office.\r\nTwitter's chief executive officer Parag Agrawal attended a number of business events in London last week. During that time, Mr… [+2043 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Take India From \"Appeasement To Fulfilment\": PM Modi To BJP Leaders", "description": "Prime Minister Narendra Modi today asked BJP leaders to take India from \"appeasement to fulfilment\", former Union Minister Ravi Shankar Prasad said after the party's national executive meeting in Telangana.", "url": "https://www.ndtv.com/india-news/pm-told-bjp-leaders-to-take-india-from-appeasement-to-fulfilment-says-ex-union-minister-after-bjps-mega-meet-in-telangana-3123576", "urlToImage": "https://c.ndtvimg.com/2021-06/2dr9i44k_narendra-modi-wave-narendra-modi-india-flag-ndtv-file-photo_625x300_15_June_21.jpg", "publishedAt": "2022-07-03T11:32:59Z", "content": "New Delhi: Prime Minister Narendra Modi today asked BJP leaders to take India from \"appeasement to fulfilment\", former Union Minister Ravi Shankar Prasad said after the party's national executive mee… [+652 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Builders Let Farmers Pay For Homes In Watermelons, Peaches In China", "description": "Struggling developers in China have started taking payment for homes in watermelons, peaches and other agricultural produce as they attempt to lure buyers deterred by a property market slump, state media reported.", "url": "https://www.ndtv.com/world-news/builders-let-farmers-pay-for-homes-in-watermelons-peaches-in-china-3123535", "urlToImage": "https://c.ndtvimg.com/2021-06/b6t3g4kg_china-flag-reuters_625x300_13_June_21.jpg", "publishedAt": "2022-07-03T11:19:04Z", "content": "In a small town of Wuxi, another developer was taking peaches as payment. (File)\r\nBeijing: Struggling developers in China have started taking payment for homes in watermelons, peaches and other agric… [+1596 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Parul Chaudhary Sets New 3000m National Record In Los Angeles", "description": "Parul Chaudhary was trailing at fifth spot in the the race, but the Indian gained momentum in last two laps to claim a podium finish", "url": "https://sports.ndtv.com/athletics/parul-chaudhary-sets-new-3000m-national-record-in-los-angeles-3123527", "urlToImage": "https://c.ndtvimg.com/2022-07/8nmr2tm8_parul-chaudhary-806_625x300_03_July_22.jpg", "publishedAt": "2022-07-03T11:14:44Z", "content": "Indian runner Parul Chaudhary smashed the national record at the Sound Running meet in Los Angeles as she became the first athlete from the country to clock a sub-nine minute time in the women's 3000… [+732 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Janhvi Shares Throwback Pics From Her Amsterdam Diaries - Bonus Nysa", "description": "Janhvi Kapoor and Nysa Devgan twinned in red outfits", "url": "https://www.ndtv.com/entertainment/janhvi-kapoor-shares-throwback-pics-from-her-amsterdam-diaries-bonus-nysa-devgan-3123514", "urlToImage": "https://c.ndtvimg.com/2022-07/grt8dfpg_janhvi-kapoor_625x300_03_July_22.jpg", "publishedAt": "2022-07-03T11:11:01Z", "content": "A picture from Janhvi Kapoor's Amsterdam diaries. (courtesy: janhvikapoor)\r\nJanhvi Kapoor has treated her Insta family to a series of pictures from her Amsterdam vacation with friends. The throwback … [+1339 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Here's How \"Just Another Day\" In Disha Patani's Life Looks Like", "description": "Disha Patani shared a video on Instagram and mentioned \"just another day in the life\"", "url": "https://www.ndtv.com/entertainment/disha-patani-works-out-at-the-gym-says-it-s-just-another-day-in-the-life-3123500", "urlToImage": "https://c.ndtvimg.com/2022-07/l21tirq_disha_625x300_03_July_22.jpg", "publishedAt": "2022-07-03T11:05:14Z", "content": "Disha Patani's Sunday diaries. (courtesy: dishapatani)\r\nIf there's one person in Bollywood who knows how to stay true to her fitness regime, it has to be Disha Patani. So, if you are feeling lazy and… [+1957 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UP Man Found In Temple With Throat Slit, Was Killed By Cousin: Cops", "description": "The victim has been identified as 35-year-old Pankaj Shukla, a resident of Amethi, who was visiting his maternal grandfather's village.", "url": "https://www.ndtv.com/india-news/ayodhya-up-man-found-in-temple-with-throat-slit-was-killed-by-cousin-cops-3123493", "urlToImage": "https://c.ndtvimg.com/2022-07/5m929ff_ayodhya-temple-murder-twitter_625x300_03_July_22.jpg", "publishedAt": "2022-07-03T11:02:37Z", "content": "Pankaj Shukla was murdered by his maternal cousin Gullu Mishra, police said.\r\nLucknow: A man sleeping in a village temple in Uttar Pradesh's Ayodhya district was killed by his cousin, who slit his th… [+661 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Many IndiGo Flights Delayed, Aviation Regulator Seeks Explanation: Report", "description": "IndiGo airline's operation were affected across the country today with several of its flights facing delays due to the non-availability of crew members.", "url": "https://www.ndtv.com/india-news/many-indigo-flights-across-country-delayed-aviation-regulator-seeks-explanation-news-agency-ani-3123486", "urlToImage": "https://c.ndtvimg.com/2022-03/99rtpnd8_indigo_625x300_31_March_22.jpg", "publishedAt": "2022-07-03T10:58:21Z", "content": "The aviation regulator has sought an explanation from the airline over the massive delays.\r\nNew Delhi: IndiGo airline's operation were affected across the country with several of its flights facing d… [+733 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Lashkar Terrorist Caught In Jammu Was BJP's IT Cell Chief", "description": "A wanted Lashkar-e-Taiba terrorist captured in Jammu and Kashmir today was an active member of BJP. He was also the party's Minority Morcha social media in-charge in Jammu.", "url": "https://www.ndtv.com/india-news/lashkar-terrorist-caught-in-jammu-was-bjps-it-cell-chief-3123483", "urlToImage": "https://c.ndtvimg.com/2022-07/ucfi4bbg_talib-hussain-shah_625x300_03_July_22.jpg", "publishedAt": "2022-07-03T10:56:48Z", "content": "Talib Hussain Shah and his accomplice were captured by the villagers in Jammu's Reasi\r\nSrinagar: A wanted Lashkar-e-Taiba terrorist captured in Jammu and Kashmir today was an active member of BJP. He… [+2934 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Amber Heard Asks Court To Dismiss Verdict In Defamation Case: Report", "description": "Amber Heard's attorneys contended that the $10 million verdict given to her ex-husband, Johnny Depp, is not supported by available evidence", "url": "https://www.ndtv.com/world-news/amber-heard-files-new-appeal-to-dismiss-verdict-in-defamation-case-involving-johnny-depp-3123470", "urlToImage": "https://c.ndtvimg.com/2022-06/jq7jlg74_johnny-deppamber-heard-afp_625x300_02_June_22.jpg", "publishedAt": "2022-07-03T10:51:26Z", "content": "Amber Heard is attempting to appeal or overturn the June judgment in the high-profile defamation case she and her ex-husband Johnny Depp were involved in. Less than a month after losing the defamatio… [+1922 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Watch: Drops A Sitter And Then Takes A Screamer - The Bumrah-Stokes Story", "description": "Right after dropping an easy catch, Bumrah made up for the mistake as he held onto a stunning catch to send England captain Ben Stokes back to the pavilion.", "url": "https://sports.ndtv.com/england-vs-india-2022/india-vs-england-drops-a-sitter-and-then-takes-a-screamer-the-jasprit-bumrah-ben-stokes-story-watch-3123464", "urlToImage": "https://c.ndtvimg.com/2022-07/iuplkbm_jasprit-bumrah-twitter-_625x300_03_July_22.jpg", "publishedAt": "2022-07-03T10:46:32Z", "content": "Jonny Bairstow and Ben Stokes made a good start for England on Day 3 of the ongoing rescheduled Test against India at Edgbaston as the duo scored briskly, putting pressure on the Jasprit Bumrah-led s… [+1537 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Watch: PV Sindhu's Dance To Remix Of Viral Songs", "description": "Apart from her shuttling skill, star badminton player and two-time Olympics medallist PV Sindhu is known for her dance skills as well. She recently posted a dance video on Instagram in which she can be seen tapping her feet to a trending remix.", "url": "https://www.ndtv.com/offbeat/watch-pv-sindhu-dances-to-remix-of-viral-songs-internet-calls-her-all-rounder-3123463", "urlToImage": "https://c.ndtvimg.com/2022-03/npdircd_pv-sindhu-_625x300_09_March_22.jpg", "publishedAt": "2022-07-03T10:45:11Z", "content": "The post has garnered more than 221,000 likes and thousands of comments. (File)\r\nApart from her shuttling skill, star badminton player and two-time Olympics medallist PV Sindhu is known for her dance… [+1615 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Says It Now Controls Entire Lugansk Region Of Ukraine", "description": "Russia-Ukraine war: Russia's defence minister, Sergei Shoigu, said Sunday that Moscow's forces have taken the strategic Ukrainian city of Lysychansk and now control the entire region of Lugansk.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-russia-claims-control-over-entire-lugansk-region-of-ukraine-lysychansk-city-war-in-ukraine-3123462", "urlToImage": "https://c.ndtvimg.com/2022-06/2hdrs3_lysychansk-ukraine-afp_625x300_09_June_22.jpg", "publishedAt": "2022-07-03T10:42:38Z", "content": "Russian defence minister said they have \"completely surrounded\" the Ukrainian force. (File)\r\nMoscow: Russia's defence minister, Sergei Shoigu, said Sunday that Moscow's forces have taken the strategi… [+1108 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Arnab Mitra", "title": "PSEB Likely To Announce 10th Result 2022 Tomorrow: Official", "description": "Punjab Board 10th Result 2022: PSEB is likely to announce the Class 10 result 2022 on Monday, July 4. Check 10th result 2022 on the website- pseb.ac.in", "url": "https://www.ndtv.com/education/punjab-board-pseb-10th-result-2022-release-date-time-direct-link-at-pseb-ac-in", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/3/Assam_result_860.jpg", "publishedAt": "2022-07-03T10:33:29Z", "content": "PSEB 10th Result 2022: The Punjab School Education Board, PSEB is likely to announce Class 10 result 2022 on Monday, July 4. PSEB official told Careers360 that the Class 10 result date will be confir… [+1490 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "21-Year-Old Killed, Body Thrown In Drain In UP's Meerut; 3 Arrested", "description": "A 21-year-old law student was killed, his body packed in a gunny bag and thrown into a drain in Uttar Pradesh's Meerut, said the police. Three people have been arrested in the case, it added.", "url": "https://www.ndtv.com/india-news/man-21-killed-body-thrown-in-drain-in-ups-meerut-3-arrested-3123432", "urlToImage": "https://c.ndtvimg.com/2022-07/105oqqv4_meerut-police-650_625x300_03_July_22.jpg", "publishedAt": "2022-07-03T10:30:42Z", "content": "Asked how he was killed, the officer said the post-mortem report is still awaited.\r\nNew Delhi: A 21-year-old law student was killed, his body packed in a gunny bag and thrown into a drain in Uttar Pr… [+700 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Opinion: Opinion: What's Chipping Away At The Nitish Kumar-BJP Alliance", "description": "To check the status of Bihar Chief Minister Nitish Kumar's relationship with senior partner BJP, take a quick look at three incidents from the four-day assembly session last week.", "url": "https://www.ndtv.com/opinion/whats-chipping-away-at-the-nitish-kumar-bjp-alliance-3123427", "urlToImage": "https://c.ndtvimg.com/2022-07/m72f5n2g_nitish-kumar_625x300_03_July_22.jpg", "publishedAt": "2022-07-03T10:26:18Z", "content": "To check the status of Bihar Chief Minister Nitish Kumar's relationship with senior partner BJP, take a quick look at three incidents from the four-day assembly session last week.\r\n1.For the first ti… [+5791 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Watch: Virat Kohli, Jonny Bairstow In Feisty Sledging Match In Edgbaston", "description": "ENG vs IND: The proceedings on Day 3 at Edgbaston got off to a fiery start after Jonny Bairstow and Virat Kohli were involved in a feisty exchange.", "url": "https://sports.ndtv.com/england-vs-india-2022/india-vs-england-virat-kohli-jonny-bairstow-in-feisty-sledging-match-in-edgbaston-watch-3123418", "urlToImage": "https://c.ndtvimg.com/2022-07/25r6pjqo_kohli-bairstow-twitter-_625x300_03_July_22.jpg", "publishedAt": "2022-07-03T10:19:40Z", "content": "In the ongoing Edgbaston Test between India and England, the visitors are on top after scoring 416 runs in the first innings and then the taking five wickets with England's score reading 84 at Stumps… [+1139 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Adarsh Srivastava", "title": "AP EAPCET 2022 From Tomorrow; COVID-19, Important Exam Day Instruction", "description": "The Andhra Pradesh Engineering Agricultural and Pharmacy Common Entrance Test (AP EAPCET) 2022 examination is slated to be commenced tomorrow (July 4). The AP EAPCET admit card 2022 has been issued by the JNTU on June 27, on the official website - cets.apsche…", "url": "https://www.ndtv.com/education/ap-eapcet-2022-from-tomorrow-covid-19-important-exam-day-instructions-here", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/2/AP-EAPCET-2022-Exam-Day-Guidelines.jpg", "publishedAt": "2022-07-03T10:12:16Z", "content": "New Delhi:AP EAPCET 2022: The Andhra Pradesh Engineering Agricultural and Pharmacy Common Entrance Test (AP EAPCET) 2022 examination is slated to be commenced tomorrow (July 4). The AP EAPCET admit c… [+2582 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Video: Heavy Rain In Parts Of Delhi, Some Roads Flooded, Traffic Affected", "description": "Heavy rain lashed parts of Delhi with the onset of the monsoon, affecting traffic movement on Sunday. While bringing respite from the heat, some roads were flooded in parts of the city.", "url": "https://www.ndtv.com/delhi-news/heavy-rain-in-parts-of-delhi-traffic-affected-3123319", "urlToImage": "https://c.ndtvimg.com/2022-07/e00tle5_delhi-rain_650x400_03_July_22.jpg", "publishedAt": "2022-07-03T09:50:41Z", "content": "Weather experts have suggested that the monsoon will yield good rainfall in first 10 days in Delhi.\r\nNew Delhi: Heavy rain lashed parts of Delhi with the onset of the monsoon, affecting traffic movem… [+1344 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Manipur Landslide: 8 People From Assam Including Army Personnel Killed", "description": "At least eight people from Assam, including one army jawan, have died in a massive landslide at the Tupul railway yard construction site in Manipur's Noney district, Assam cabinet minister Pijush Hazarika said.", "url": "https://www.ndtv.com/india-news/manipur-landslide-8-people-from-assam-including-army-personnel-killed-3123306", "urlToImage": "https://c.ndtvimg.com/2022-06/til1sg28_manipur-landslide_625x300_30_June_22.jpg", "publishedAt": "2022-07-03T09:47:07Z", "content": "Most of the people engaged at the railway construction site are from Assam's Morigaon district.\r\nAt least eight people from Assam, including one army jawan, have died in a massive landslide at the Tu… [+1390 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Claims It Has Encircled Key Eastern Ukrainian City Of Lysychansk", "description": "Russian troops have encircled the eastern Ukrainian city of Lysychansk, Ukraine's last major stronghold in the Luhansk region, the Russian defence ministry said on Sunday.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-russia-claims-it-has-encircled-key-eastern-ukrainian-city-of-lysychansk-3123294", "urlToImage": "https://c.ndtvimg.com/2022-07/j9n8rpbc_russia-ukraine-reuters_625x300_03_July_22.jpg", "publishedAt": "2022-07-03T09:41:13Z", "content": "Calls to the Ukrainian General Staff and Defence Ministry went unanswered.\r\nRussian troops have encircled the eastern Ukrainian city of Lysychansk, Ukraine's last major stronghold in the Luhansk regi… [+1081 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Can They Look Us In The Eye?\": Aaditya Thackeray's Barb At Shinde Camp", "description": "Shiv Sena leader Aaditya Thackeray on Sunday took a jibe at the Eknath Shinde faction, saying that the MLAs backing him cannot look them in the eye.", "url": "https://www.ndtv.com/india-news/can-they-look-us-in-the-eye-aaditya-thackerays-barb-at-shinde-camp-3123286", "urlToImage": "https://c.ndtvimg.com/2022-07/tmolfmok_aaditya-thackeray_625x300_03_July_22.jpg", "publishedAt": "2022-07-03T09:35:34Z", "content": "New Delhi: Shiv Sena leader Aaditya Thackeray on Sunday took a jibe at the Eknath Shinde faction, saying that the MLAs backing him cannot look them in the eye.\r\nMr Thackeray's comments came after the… [+1338 chars]"}]}