{"status": "ok", "totalResults": 291, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Instagram Down For Thousands Of Users: Report", "description": "Thousands of users of Meta Platforms Inc's Instagram on Thursday reported issues with the photo-sharing application, according to Downdetector.com.", "url": "https://www.ndtv.com/world-news/instagram-down-for-thousands-of-users-report-3159459", "urlToImage": "https://c.ndtvimg.com/2018-10/6447var_instagram-generic_650x400_03_October_18.jpg", "publishedAt": "2022-07-14T22:01:07Z", "content": "Late last year, Meta had a nearly 6-hour-long outage which kept WhatsApp and Instagram out of reach.\r\nCalifornia: Thousands of users of Meta Platforms Inc's Instagram on Thursday reported issues with… [+734 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "1985 Air India Bombing Suspect Shot Dead In Canada: Report", "description": "An acquitted suspect in the 1985 Air India bombings that killed 331 people was shot dead Thursday in an apparent targeted shooting in westernmost Canada, local media reported.", "url": "https://www.ndtv.com/world-news/1985-air-india-bombing-suspect-ripudaman-singh-malik-shot-dead-in-canada-report-3159456", "urlToImage": "https://i.ndtvimg.com/mt/2011-02/grid_295x200_Kanishka_bombing.jpg", "publishedAt": "2022-07-14T21:39:51Z", "content": "At least 331 people were killed in 1985 Air India bombings.\r\nOttawa: An acquitted suspect in the 1985 Air India bombings that killed 331 people was shot dead Thursday in an apparent targeted shooting… [+2007 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ivana Trump, Donald Trump's First Wife, Dies At 73", "description": "Ivana Trump -- Donald Trump's first wife and mother of his three eldest children -- has died at the age of 73, the former president announced Thursday.", "url": "https://www.ndtv.com/world-news/ivana-trump-donald-trumps-first-wife-dies-at-73-3159426", "urlToImage": "https://i.ndtvimg.com/i/2016-11/ivana-trump_650x400_41479129934.jpg", "publishedAt": "2022-07-14T20:51:16Z", "content": "Donald Trump and Ivana Trump divorced in the early '90s.\r\nNew York: Ivana Trump -- Donald Trump's first wife and mother of his three eldest children -- has died at the age of 73, the former president… [+2063 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rajya Sabha Releases Code Of Conduct For Members Ahead Of Monsoon Session", "description": "Ahead of the Monsoon Session of Parliament which is slated to begin from Monday, Rajya Sabha Secretariat has once again reiterated the ethical code of conduct applicable for the members.", "url": "https://www.ndtv.com/india-news/rajya-sabha-releases-code-of-conduct-for-members-ahead-of-monsoon-session-3159425", "urlToImage": "https://c.ndtvimg.com/2020-09/5u6qtss_rajya-sabha-generic-pti-photo_625x300_23_September_20.jpg", "publishedAt": "2022-07-14T20:45:44Z", "content": "Monsoon Session of Parliament will begin from Monday.\r\nNew Delhi: Ahead of the Monsoon Session of Parliament which is slated to begin from Monday, Rajya Sabha Secretariat has once again reiterated th… [+3838 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "At Least 23 Killed In Ukraine's Vinnytsia After Russian Missiles Strike", "description": "Russian missiles struck Vinnytsia in central Ukraine Thursday, killing at least 23 people including three children, in what President Volodymyr Zelensky called \"an open act of terrorism\".", "url": "https://www.ndtv.com/world-news/at-least-23-killed-in-ukraines-vinnytsia-after-russian-missiles-strike-3159417", "urlToImage": "https://c.ndtvimg.com/2022-07/a94c4if8_odessa-strike-_625x300_02_July_22.jpg", "publishedAt": "2022-07-14T20:32:12Z", "content": "Ukraine War: There were 8 rockets, two of which hit the centre of the city, Zelensky said.\r\nKyiv: Russian missiles struck Vinnytsia in central Ukraine Thursday, killing at least 23 people including t… [+5121 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "2 Journalists Shot At By Unidentified Assailants In UP: Police", "description": "Two journalists working for local newspapers were allegedly shot at by unidentified assailants in Kaliyari market area here, police said on Thursday.", "url": "https://www.ndtv.com/india-news/2-journalists-shot-at-by-unidentified-assailants-in-up-police-3159390", "urlToImage": "https://c.ndtvimg.com/2022-06/ars722ac_police-generic_625x300_14_June_22.jpg", "publishedAt": "2022-07-14T20:02:36Z", "content": "Police has formed a team to identify and arrest the assailants. (Representational)\r\nSonbhadra, Uttar Pradesh: Two journalists working for local newspapers were allegedly shot at by unidentified assai… [+550 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Reece Topley Topples India, England Win By 100 Runs To Level ODI Series", "description": "Reece Topley's 6 for 24 headlined a fine England bowling performance in a series-levelling 100-run win while defending a modest target in the second ODI", "url": "https://sports.ndtv.com/england-vs-india-2022/reece-topley-topples-india-england-win-by-100-runs-to-level-odi-series-1-1-3159375", "urlToImage": "https://c.ndtvimg.com/2022-07/04h06c_topley-afp_625x300_15_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-14T19:34:30Z", "content": "Indian top-order fell like ninepins as Reece Topley's 6 for 24 headlined a fine England bowling performance in a series-levelling 100-run win while defending a modest target in the second ODI at the … [+4657 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Atrocity\": EU Slams Russia After Missiles Attack On Ukraine's Vinnytsia", "description": "The European Union strongly condemned what it called an \"atrocity\" after Russian missiles struck Vinnytsia in central Ukraine Thursday, killing at least 23 people including three children.", "url": "https://www.ndtv.com/world-news/atrocity-eu-slams-russia-after-missiles-attack-on-ukraines-vinnytsia-3159371", "urlToImage": "https://c.ndtvimg.com/2022-07/a94c4if8_odessa-strike-_625x300_02_July_22.jpg", "publishedAt": "2022-07-14T19:30:04Z", "content": "Ukraine War: 23 people including 3 children killed in Russian missiles attack in Ukraine's Vinnytsia.\r\nBrussels: The European Union strongly condemned what it called an \"atrocity\" after Russian missi… [+573 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "2 Dams Supplying Water To Mumbai Start Overflowing After Heavy Rainfall", "description": "At least two dams supplying water to Mumbai and located in Palghar district - Modak Sagar and Tansa - have started overflowing due to incessant rains in their catchment areas, an official said on Thursday.", "url": "https://www.ndtv.com/mumbai-news/2-dams-modak-sagar-tansa-supplying-water-to-mumbai-start-overflowing-after-heavy-rainfall-3159319", "urlToImage": "https://c.ndtvimg.com/2019-08/hmba2u9o_venar-lake_625x300_01_August_19.jpg", "publishedAt": "2022-07-14T18:52:59Z", "content": "2 gates of the Modak Sagar dam were opened and 239.13 cumecs of water was discharged, the authority said.\r\nMumbai: At least two dams supplying water to Mumbai and located in Palghar district - Modak … [+894 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rahul Gandhi Video: Supreme Court To Hear Zee News Anchor's Plea Today", "description": "The Supreme Court agreed to hear on Friday a plea of an editor of a TV news channel challenging the summons issued to him for playing a doctored clip of Congress leader Rahul Gandhi during the telecast of a programme on July 1.", "url": "https://www.ndtv.com/india-news/rahul-gandhi-video-supreme-court-to-hear-zee-news-anchors-plea-today-3159304", "urlToImage": "https://c.ndtvimg.com/2022-07/pkfrtrj_zee-anchor_650x400_05_July_22.jpg", "publishedAt": "2022-07-14T18:39:23Z", "content": "New Delhi: The Supreme Court agreed to hear on Friday a plea of an editor of a TV news channel challenging the summons issued to him for playing a doctored clip of Congress leader Rahul Gandhi during… [+1041 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Delhi Woman Dies By Suicide Allegedly Over \"14 Forced Abortion\"", "description": "A 33-year-old woman allegedly committed suicide after being \"forced to undergo abortion 14 times\" by her live-in partner in a span of eight years, police said on Thursday citing a suicide note.", "url": "https://www.ndtv.com/delhi-news/delhi-woman-dies-by-suicide-allegedly-over-14-forced-abortion-3159300", "urlToImage": "https://c.ndtvimg.com/2018-11/ugua930g_delhi-police-generic_625x300_25_November_18.jpg", "publishedAt": "2022-07-14T18:34:24Z", "content": "A case of abetment to suicide has been filed, police said (Representational)\r\nNew Delhi: A 33-year-old woman allegedly committed suicide after being \"forced to undergo abortion 14 times\" by her live-… [+1934 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"No Comment\": Foreign Ministry On Hamid Ansari Row Over Pak Journalist", "description": "The Ministry of External Affairs Thursday steered clear of the controversy involving former vice president Hamid Ansari over claims of a Pakistani journalist, saying it does not want to comment on the issue.", "url": "https://www.ndtv.com/india-news/no-comment-foreign-ministry-on-hamid-ansari-row-over-pakistan-journalist-nusrat-mirza-3159285", "urlToImage": "https://i.ndtvimg.com/i/2016-05/hamid-ansari_650x400_41464509573.jpg", "publishedAt": "2022-07-14T18:27:43Z", "content": "Hamid Ansari has denied meeting or inviting the Pakistani journalist\r\nNew Delhi: The Ministry of External Affairs Thursday steered clear of the controversy involving former vice president Hamid Ansar… [+1439 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sikh Body Slams Bhagwant Mann Over Checking Of Vehicle Carrying Holy Scriptures At Wedding", "description": "The Shiromani Gurdwara Parbandhak Committee on Thursday claimed that the vehicle carrying the holy Guru Granth Sahib was \"checked\" on the marriage ceremony of Punjab Chief Minister Bhagwant Mann, calling it an \"insult to the honour of the Guru\".", "url": "https://www.ndtv.com/india-news/sikh-body-slams-bhagwant-mann-over-checking-of-vehicle-carrying-holy-scriptures-at-wedding-3159273", "urlToImage": "https://c.ndtvimg.com/2022-07/6rhpcoag_bhagwant-mann-wedding_625x300_07_July_22.jpg", "publishedAt": "2022-07-14T18:22:28Z", "content": "On July 7, Bhagwant Mann got married to Dr Gurpreet Kaur\r\nAmritsar: The Shiromani Gurdwara Parbandhak Committee on Thursday claimed that the vehicle carrying the holy Guru Granth Sahib was \"checked\" … [+1140 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "KWK: The ROFL Reason Sara Loved Alia-Ranbir's Balcony Wedding", "description": "Koffee With Karan 7: \"They did not have to go abroad and all. Just their balcony,\" said Sara Ali Khan", "url": "https://www.ndtv.com/entertainment/koffee-with-karan-7-the-rofl-reason-sara-ali-khan-loved-alia-bhatt-and-ranbir-kapoors-balcony-wedding-3159236", "urlToImage": "https://c.ndtvimg.com/2022-07/np4rmfo_alia-bhatt_625x300_14_July_22.jpg", "publishedAt": "2022-07-14T18:07:29Z", "content": "Alia Bhatt and Ranbir Kapoor's wedding pic. (courtesy: aliaabhatt)\r\nNew Delhi: The first season of Karan Johar's talk show Koffee With Karan 7 began with Alia Bhatt describing how dreamy her and Ranb… [+2321 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Congress Leader Allegedly Harassed Teacher With Video, Charged", "description": "A First Information Report has been filed against the district president of the Congress and his wife for allegedly harassing a Dalit woman teacher by making an obscene video of her.", "url": "https://www.ndtv.com/india-news/congress-leader-allegedly-harassed-teacher-with-video-charged-up-cops-3159234", "urlToImage": "https://c.ndtvimg.com/2020-08/psarcvh8_up-police-generic_625x300_16_August_20.jpg", "publishedAt": "2022-07-14T18:03:22Z", "content": "Police have filed a case against a Congress leader and his wife (Representational)\r\nGonda, UP: A First Information Report has been filed against the district president of the Congress and his wife fo… [+969 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Adani Group, Partner Win Tender For Privatisation Of Israeli Port", "description": "Adani group Chairman Gautam Adani on Thursday said the group has won the tender for privatization of a port in Israel in partnership with Gadot.", "url": "https://www.ndtv.com/india-news/adani-group-partner-win-tender-for-privatisation-of-israeli-port-3159229", "urlToImage": "https://c.ndtvimg.com/2021-07/2rnf431_adani-logo-reuters-generic-650_625x300_20_July_21.jpg", "publishedAt": "2022-07-14T18:00:31Z", "content": "The Port of Haifa is the largest of Israel's three major international seaports.\r\nMumbai: Adani group Chairman Gautam Adani on Thursday said the group has won the tender for privatization of a port i… [+539 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Won't Support Any Law On 2-Child Policy, Says Asaduddin Owaisi", "description": "AIMIM president Asaduddin Owaisi on Thursday said he would not support any law if the Centre brings in a two-child norm/policy in the country.", "url": "https://www.ndtv.com/india-news/wont-support-any-law-on-2-child-policy-says-asaduddin-owaisi-3159209", "urlToImage": "https://c.ndtvimg.com/2022-04/uq3g44r_owaisi_625x300_26_April_22.jpg", "publishedAt": "2022-07-14T17:52:48Z", "content": "Hyderabad: AIMIM president Asaduddin Owaisi on Thursday said he would not support any law if the Centre brings in a two-child norm/policy in the country.\r\n\"The mistake China did, India should not. I … [+1656 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "What Happens On Sara-Janhvi's Trips, Makes Its Way To Koffee With Karan", "description": "Sara Ali Khan and Janhvi Kapoor are travel buddies", "url": "https://www.ndtv.com/entertainment/what-happens-on-sara-ali-khan-and-janhvi-kapoors-trips-makes-its-way-to-koffee-with-karan-7-3159109", "urlToImage": "https://c.ndtvimg.com/2022-07/gj0966mg_janhvi-kapoor_625x300_14_July_22.jpg", "publishedAt": "2022-07-14T17:19:04Z", "content": "Sara Ali Khan and Janhvi Kapoor are travel buddies. (courtesy: saraalikhan95)\r\nNew Delhi: Both Sara Ali Khan and Janhvi Kapoor love to travel and together they went to Kedarnath, LA and Goa. But we a… [+2337 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Assam Chief Minister \"Trying To Save\" Teen Arrested For \"Anti-National\" Poem", "description": "Assam Chief Minister Himanta Biswa Sarma on Thursday said Barshashree Buragohain, a college student, was arrested for wanting to join ULFA(I) and not for penning an \"anti-national\" poem, amid the public outcry seeking her release.", "url": "https://www.ndtv.com/india-news/trying-to-save-her-assam-chief-minister-on-teen-arrested-for-anti-national-poem-3159092", "urlToImage": "https://c.ndtvimg.com/2022-01/4p8h6d2g_himanta-biswa-sarma-650_625x300_18_January_22.jpg", "publishedAt": "2022-07-14T17:09:55Z", "content": "Guwahati: Assam Chief Minister Himanta Biswa Sarma on Thursday said Barshashree Buragohain, a college student, was arrested for wanting to join ULFA(I) and not for penning an \"anti-national\" poem, am… [+2628 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Assam Woman Charged With Waging War May Get To Write Exam", "description": "After a social media outrage, 19-year-old Assam student Barshshree Buragohain, who is in jail for the last two months, may get to write her semester exams and the Assam government may consider not challenging her bail petitions, officials have said.", "url": "https://www.ndtv.com/india-news/assam-woman-barshshree-buragohain-charged-with-waging-war-may-get-to-write-exam-3159082", "urlToImage": "https://c.ndtvimg.com/court-generic_625x300_1527245477936.jpg", "publishedAt": "2022-07-14T17:07:04Z", "content": "Assam student Barshshree Buragohain, who is in jail, may get to write her semester exams\r\nGuwahati: After a social media outrage, 19-year-old Assam student Barshshree Buragohain, who is in jail for t… [+3106 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "After Lalit Modi's \"Just Dating\" Post, Sushmita Sen's Brother Says...", "description": "Lalit Modi posted pictures with Sushmita Sen on Thursday night", "url": "https://www.ndtv.com/entertainment/pleasantly-surprised-says-sushmita-sens-brother-after-lalit-modi-makes-relationship-social-media-official-with-the-actress-3159012", "urlToImage": "https://c.ndtvimg.com/2022-07/igvk5p18_sushmita_625x300_14_July_22.jpg", "publishedAt": "2022-07-14T16:46:03Z", "content": "Lalit Modi with Sushmita Sen. (courtesy: lalitkmodi)\r\nNew Delhi: Lalit Modi, the first chairman of Indian Premier League, made his relationship with actress Sushmita Sen social media official on Thur… [+2125 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Emirates Airline Rejects Heathrow Demand To Cut Passengers", "description": "Emirates on Thursday rejected an order from London Heathrow for airlines to reduce passenger numbers to ease summer travel chaos sparked by staff shortages.", "url": "https://www.ndtv.com/world-news/emirates-airline-rejects-heathrow-demand-to-cut-passengers-3159007", "urlToImage": "https://c.ndtvimg.com/2019-02/44paagjg_emirates-reuters_625x300_27_February_19.jpg", "publishedAt": "2022-07-14T16:43:12Z", "content": "Emirates operates six daily return flights between Dubai and Heathrow.\r\nLondon, United Kingdom: Emirates on Thursday rejected an order from London Heathrow for airlines to reduce passenger numbers to… [+1697 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Rashi Hardaha", "title": "JIPMAT 2022 Answer Key Out; Direct Link, Steps To Raise Objections", "description": "JIPMAT 2022 Answer Key: The NTA JIPMAT provisional answer key and question paper is available on the official website-- jipmat.nta.nic.in. Candidates can check and download the answer key of JIPMAT 2022 by using their application number.", "url": "https://www.ndtv.com/education/jipmat-2022-answer-key-out-direct-link-jipmat-nta-nic-in-steps-to-raise-objections", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/14/jipmat_2022_answer_key.jpg", "publishedAt": "2022-07-14T16:43:00Z", "content": "JIPMAT 2022 Answer Key: The National Testing Agency (NTA) has issued the answer key for the Joint Integrated Programme in Management Admission Test (JIPMAT) 2022 today, July 14. Along with the provis… [+1626 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Tripura Chief Minister Sends 100 Boxes Of Pineapples To Bangladesh PM", "description": "In a goodwill gesture, Tripura Chief Minister Manik Saha on Thursday sent 100 boxes of pineapples to Bangladesh Prime Minister Sheikh Hasina.", "url": "https://www.ndtv.com/india-news/tripura-chief-minister-sends-100-boxes-of-pineapples-to-bangladesh-pm-3158136", "urlToImage": "https://c.ndtvimg.com/2019-10/277f927c_sheikh-hasina-pti_625x300_04_October_19.jpg", "publishedAt": "2022-07-14T16:34:41Z", "content": "Earlier, Sheikh Hasina had sent 600-kg mangoes for the Tripura chief minister.\r\nAgartala: In a goodwill gesture, Tripura Chief Minister Manik Saha on Thursday sent 100 boxes of pineapples to Banglade… [+1386 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "No Government In Maharashtra, Sena's Sanjay Raut Says. Then, A Question", "description": "Shiv Sena leader Sanjay Raut on Thursday claimed there is no government in place in Maharashtra at present as the Eknath Shinde-led dispensation is \"illegal\", and asked where Governor Bhagat Singh Koshiyari is.", "url": "https://www.ndtv.com/india-news/maharashtra-political-crisis-no-government-in-maharashtra-senas-sanjay-raut-says-then-a-question-3158070", "urlToImage": "https://c.ndtvimg.com/2022-07/4oebfmvg_sanjay-raut-pti-650_650x400_01_July_22.jpg", "publishedAt": "2022-07-14T16:29:54Z", "content": "There is no government in the state because this is an illegal government,\" Sanjay Raut said.\r\nMumbai/Nagpur: Shiv Sena leader Sanjay Raut on Thursday claimed there is no government in place in Mahar… [+3183 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Chahal Takes 4/47 vs ENG, Breaks Amarnath's 39-Year-Old Record At Lord's", "description": "With the figures of 4/47, Chahal has now got the best returns for an Indian bowler in ODIs at Lord's. He surpassed Mohinder Amarnath's figures of 3/12 against West Indies in the 1983 World Cup Final.", "url": "https://sports.ndtv.com/england-vs-india-2022/yuzvendra-chahal-takes-4-wicket-haul-vs-england-breaks-mohinder-amarnaths-39-year-old-record-at-lords-3158953", "urlToImage": "https://c.ndtvimg.com/2022-07/9dk74a6o_yuzvendra-chahal-afp_625x300_14_July_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-14T16:27:02Z", "content": "Yuzvendra Chahal's clever variations complemented by Hardik Pandya's steady fast medium bowling saw India bowl out England for a manageable 246 in 49 overs in the second ODI at the Lord's on Thursday… [+2876 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Mask Fines Could Return In Bengaluru Amid Rising Covid Cases", "description": "With COVID-19 cases on the rise, the Karnataka government is mulling over imposing fines for not wearing masks in public places here.", "url": "https://www.ndtv.com/india-news/coronavirus-mask-fines-could-return-in-bengaluru-amid-rising-covid-cases-3158030", "urlToImage": "https://c.ndtvimg.com/2020-05/29l0puog_karnataka-coronavirus-afp_625x300_30_May_20.jpg", "publishedAt": "2022-07-14T16:25:05Z", "content": "Covid In Karnataka: Karnataka reported 1,231 fresh Covid cases.\r\nBengaluru: With COVID-19 cases on the rise, the Karnataka government is mulling over imposing fines for not wearing masks in public pl… [+1995 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Heavy Rainfall In Parts Of Kerala, Alert Issued For Some Districts", "description": "Incessant rains and unprecedented winds have wreaked havoc in northern Kerala in the last few days with rivers overflowing in parts of Kasaragod, Kozhikode and Wayanad districts necessitating shifting of people to shelters.", "url": "https://www.ndtv.com/india-news/kerala-heavy-rainfall-heavy-rainfall-in-parts-of-kerala-alert-issued-for-some-districts-3157999", "urlToImage": "https://c.ndtvimg.com/2022-05/r1dk7qu4_kerala-rain-pti_625x300_19_May_22.jpg", "publishedAt": "2022-07-14T16:20:09Z", "content": "Kerala Heavy Rainfall: Heavy rains were reported in the northernmost district of Kasaragod.\r\nKozhikode (Ker): Incessant rains and unprecedented winds have wreaked havoc in northern Kerala in the last… [+1900 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "No One Can Put Up Illegal Hoardings If...: What Bombay High Court Said", "description": "The Bombay High Court on Thursday said that without the encouragement of political leaders no one would be putting up hoardings, many of which are illegal.", "url": "https://www.ndtv.com/india-news/bombay-high-court-noone-can-put-up-illegal-hoardings-if-what-bombay-high-court-said-3157857", "urlToImage": "https://c.ndtvimg.com/court-generic_625x300_1527245477936.jpg", "publishedAt": "2022-07-14T16:14:57Z", "content": "Bombay High Court: The bench then said that political leaders ought to take up the issue.\r\nMumbai: The Bombay High Court on Thursday said that without the encouragement of political leaders no one wo… [+1504 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Over 1 Lakh Trees Cut For Srinagar Ring Road, Reveals RTI Reply", "description": "More than 1.10 lakh private trees of Apple, Chinar, Walnut, Mullberry among other species valued at Rs 13.76 crore have been chopped down by the NHAI to lay down the Srinagar Ring Road, an RTI reply has revealed.", "url": "https://www.ndtv.com/india-news/srinagar-ring-road-over-1-lakh-trees-cut-for-srinagar-ring-road-reveals-rti-reply-3158925", "urlToImage": "https://c.ndtvimg.com/2019-06/b5h1njb8_letter-generic_625x300_09_June_19.jpg", "publishedAt": "2022-07-14T16:13:01Z", "content": "Srinagar Ring Road: The 42.10 km project with a cost of Rs 939.41 crore. (Representational)\r\nSrinagar: More than 1.10 lakh private trees of Apple, Chinar, Walnut, Mullberry among other species valued… [+2430 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UK Dentists Warn People Against Viral \"Turkey Teeth\" Trend. Here's Why", "description": "A dental trend known as \"Turkey teeth\" that involves travelling abroad to get cut-price treatment is leaving hundreds of Britishers with serious complications.", "url": "https://www.ndtv.com/world-news/uk-dentists-warn-people-against-viral-turkey-teeth-trend-heres-why-3158915", "urlToImage": "https://c.ndtvimg.com/2022-07/5bi9go38_dentist-generic_625x300_14_July_22.jpg", "publishedAt": "2022-07-14T16:11:22Z", "content": "Hashtag \"Turkey Teeth\" reached more than 130 million views on TikTok. (Pixabay/Representative)\r\nA dental trend known as Turkey teeth that involves travelling abroad to get cut-price treatment is leav… [+2127 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "KWK: Sara-Janhvi's Very \"Cheesy\" Episode With A Side Of Vijay Deverakonda", "description": "Koffee With Karan 7: Sara Ali Khan and Janhvi Kapoor were at their unfiltered best", "url": "https://www.ndtv.com/entertainment/koffee-with-karan-7-sara-ali-khan-and-janhvi-kapoors-very-cheesy-episode-with-a-side-of-vijay-deverakonda-3158883", "urlToImage": "https://c.ndtvimg.com/2022-07/eko7hla_janhvi-kapoor_625x300_14_July_22.jpg", "publishedAt": "2022-07-14T16:00:52Z", "content": "Janhvi Kapoor in a still from the show. (courtesy: YouTube)\r\nNew Delhi: Tonight's episode of Koffee With Karan 7 was a platter full of spilled beans by Sara Ali Khan and Janhvi Kapoor with a drizzle … [+3197 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Rashi Hardaha", "title": "Dharmendra Pradhan To Announce NIRF Ranking 2022 Tomorrow", "description": "NIRF 2022 Rankings: Union Education Minister Dharmendra Pradhan will announce NIRF India ranking 2022 at 11 am tomorrow.", "url": "https://www.ndtv.com/education/education-minister-dharmendra-pradhan-to-announce-nirf-ranking-2022-tomorrow", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/14/dharmendra_pradhan_nirf_ranking_2022.jpg", "publishedAt": "2022-07-14T16:00:48Z", "content": "NIRF 2022 Rankings: Union Education Minister Dharmendra Pradhan will announce the list of India's top Higher Education Institutions (HEIs) in the National Institutional Ranking Framework (NIRF) 2022 … [+1646 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Twitter In Meltdown As Lalit Modi Refers To Sushmita Sen As \"Better Half\"", "description": "In an tweet posted in the evening, Modi wrote: \"Just back in london after a whirling global tour #maldives # sardinia with the families - not to mention my #betterhalf @sushmitasen47 - a new beginning a new life finally. Over the moon.\"", "url": "https://sports.ndtv.com/cricket/former-ipl-chairman-lalit-modi-refers-to-sushmita-sen-as-better-half-sends-twitter-in-a-tizzy-3158861", "urlToImage": "https://c.ndtvimg.com/2022-07/q6n9f658_lalit-modi-sushmita-sen_625x300_14_July_22.jpg", "publishedAt": "2022-07-14T15:55:21Z", "content": "Lalit Modi, the first chairman of Indian Premier League, on Thursday sent social media into a frenzy after he announced a \"new beginning\" with actor Sushmita Sen. In an tweet posted in the evening, M… [+2230 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "A Page From Mom-To-Be Sonam Kapoor's Maternity Diaries. See Pic", "description": "Sonam Kapoor has shared a new picture in a yellow ensemble", "url": "https://www.ndtv.com/entertainment/a-page-from-mom-to-be-sonam-kapoors-maternity-diaries-see-pic-3158840", "urlToImage": "https://c.ndtvimg.com/2022-07/33tb0b58_sonam-kapoor_625x300_14_July_22.jpg", "publishedAt": "2022-07-14T15:47:27Z", "content": "Sonam Kapoor shared this picture. (courtesy: jyothykrishna)\r\nSonam Kapoor, who is soon going to welcome her first child, has been treating her Insta family to adorable pictures and videos of herself … [+1384 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Gold, 8 More Items Put Under Customs' Controlled Delivery Regulation", "description": "The customs department has issued controlled delivery regulations authorising officers to track suspicious consignments of items, including gold, precious stones, drugs and cigarettes.", "url": "https://www.ndtv.com/india-news/customs-department-puts-gold-8-more-items-under-controlled-delivery-regulation-3158809", "urlToImage": "https://i.ndtvimg.com/i/2017-11/gold-generic-pixabay_650x400_61511083918.jpg", "publishedAt": "2022-07-14T15:40:24Z", "content": "The move, an official said, is aimed at checking smuggling and to trace the real culprit.\r\nNew Delhi: The customs department has issued controlled delivery regulations authorising officers to track s… [+1256 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Dalai Lama's Message To China Ahead Of Month-Long Ladakh Stay", "description": "Tibetan spiritual leader the Dalai Lama is visiting Ladakh, the first visit after Jammu and Kashmir was divided into two Union Territories in August 2019.", "url": "https://www.ndtv.com/india-news/dalai-lamas-message-to-china-ahead-of-month-long-ladakh-stay-3158808", "urlToImage": "https://i.ndtvimg.com/i/2017-08/dalai-lama-reuters_650x400_51502525666.jpg", "publishedAt": "2022-07-14T15:38:57Z", "content": "The Dalai Lama will spend a month in Ladakh (File)\r\nSrinagar: Tibetan spiritual leader the Dalai Lama is visiting Ladakh, the first visit after Jammu and Kashmir was divided into two Union Territorie… [+1789 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTVSports", "title": "England vs India: England vs India, 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports", "description": "Live Updates of Today Match between England vs India from Lord's, London. Check commentary and full scoreboard of the match.", "url": "https://sports.ndtv.com/england-vs-india-2022/england-vs-india-live-score-over-2nd-odi-odi-46-50-updates-3158764", "urlToImage": "https://edata.ndtv.com/twittergft/sport_automated_story/big_637934296884693188.png", "publishedAt": "2022-07-14T15:27:50Z", "content": "Follow the England vs India, 2022 live cricket score on Sports.NDTV.com. After 47.2 overs, England are 237/8. Get live score, ball by ball commentary and much more. Keep track of England vs India, 20… [+2214 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "NDA President Pick Draupadi Murmu Meets MPs, MLAs In Mumbai, Seeks Support", "description": "The National Democratic Alliance's Presidential candidate Droupadi Murmu arrived in Mumbai on Thursday afternoon to meet and interact with the ruling alliance's MPs and MLAs.", "url": "https://www.ndtv.com/india-news/presidential-elections-nda-president-pick-draupadi-murmu-meets-mps-mlas-in-mumbai-seeks-support-3157659", "urlToImage": "https://c.ndtvimg.com/2022-06/8m40kj58_draupadi-murmu-twitter-650_650x400_21_June_22.jpg", "publishedAt": "2022-07-14T15:21:47Z", "content": "President Elections: Droupadi Murmu met BJP MLAs and MPs in Mumbai.\r\nMumbai: The National Democratic Alliance's Presidential candidate Droupadi Murmu arrived in Mumbai on Thursday afternoon to meet a… [+902 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rupee On The Brink Of 80 Per Dollar, Closes At 79.99 After Settlements", "description": "The rupee ended Thursday on the brink of 80 per dollar, just a technicality of a touch lower at 79.99 against the greenback keeping it away from the key psychological level.", "url": "https://www.ndtv.com/business/rupee-on-the-brink-of-80-per-dollar-closes-at-79-99-after-setllements-3158728", "urlToImage": "https://c.ndtvimg.com/2021-06/db8gkdio_rupee_625x300_29_June_21.jpeg", "publishedAt": "2022-07-14T15:18:41Z", "content": "Rupee edges closer to 80-mark, slides 18 paise to 79.99 vs dollar\r\nThe rupee ended Thursday on the brink of 80 per dollar, just a technicality of a touch lower at 79.99 against the greenback, keeping… [+1218 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Over 19,000 People Moved To Relief Camps In Telangana Amid Heavy Rains", "description": "More than 19,000 people have been shifted to relief camps across Telangana as rains continued to pound several parts of the state leading to inundation of low-lying areas.", "url": "https://www.ndtv.com/india-news/telangana-heavy-rainfall-over-19-000-people-moved-to-relief-camps-in-telangana-amid-heavy-rains-3157614", "urlToImage": "https://c.ndtvimg.com/2022-07/66us5k6_hyderabad-rain-650_625x300_09_July_22.jpg", "publishedAt": "2022-07-14T15:17:01Z", "content": "Telangana Heavy Rainfall: More than 10 people have died in various rain-related incidents.\r\nHyderabad: More than 19,000 people have been shifted to relief camps across Telangana as rains continued to… [+2022 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Watch: Fishermen In Chile Catch 16-Feet Long Deep-Sea Creature", "description": "A group of fishermen recently reeled in an incredible 16-feet monster fish in Chile and a video of the creature being hoisted up by a crane has surfaced online.", "url": "https://www.ndtv.com/offbeat/watch-fishermen-in-chile-catch-16-feet-long-deep-sea-creature-3158717", "urlToImage": "https://c.ndtvimg.com/2022-07/rtv44u1g_oarfish_625x300_14_July_22.jpg", "publishedAt": "2022-07-14T15:14:55Z", "content": "The video garnered nearly 10 million views on TikTok.\r\nA group of fishermen recently reeled in an incredible 16-feet monster fish in Chile and a video of the creature being hoisted up by a crane has … [+1487 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTVSports", "title": "England vs India: England vs India, 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports", "description": "Live Updates of Today Match between England vs India from Lord's, London. Check commentary and full scoreboard of the match.", "url": "https://sports.ndtv.com/england-vs-india-2022/england-vs-india-live-score-over-2nd-odi-odi-41-45-updates-3158682", "urlToImage": "https://edata.ndtv.com/twittergft/sport_automated_story/big_637934288521627154.png", "publishedAt": "2022-07-14T15:13:51Z", "content": "A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com. After 44.5 overs, England are 220/7. The live updates of England vs India scorecard is also… [+4837 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Need Citizens' Register To Deport Illegals: Manipur Tribal Bodies To PM", "description": "At a time when Assam has been battling with the National Register of Citizens, or NRC, 19 influential tribal organisations have stepped up the demand for the implementation of the NRC in Manipur to protect indigenous people.", "url": "https://www.ndtv.com/india-news/nrc-need-national-register-of-citizens-to-deport-illegals-manipur-tribal-bodies-to-pm-narendra-modi-3158691", "urlToImage": "https://c.ndtvimg.com/2022-02/or0q48l8_imphal-manipur_625x300_02_February_22.jpg", "publishedAt": "2022-07-14T15:09:09Z", "content": "Manipur tribal organisations have demanded NRC in the state\r\nGuwahati: At a time when Assam has been battling with the National Register of Citizens, or NRC, 19 influential tribal organisations have … [+2240 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "KK's Wife Jyothy Krishna Remembers Singer In An Emotional Post", "description": "KK died on May 31 this year in Kolkata after his concert at a college festival", "url": "https://www.ndtv.com/entertainment/miss-you-sweetheart-kks-wife-jyothy-krishna-remembers-singer-in-an-emotional-post-3158655", "urlToImage": "https://c.ndtvimg.com/2022-07/avqeokhg_kk_625x300_14_July_22.jpg", "publishedAt": "2022-07-14T15:02:20Z", "content": "KK with his wife Jyothy Krishna. (courtesy: jyothykrishna)\r\nLate singer KK's wife, Jyothy Krishna, has shared a post for the first time after the death of her husband on Instagram. Jyothy Krishna, wh… [+1818 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "JKBOSE Result 2022: Girls Outshine Boys In Class 10 Exams", "description": "JKBOSE 10th Result 2022: While the pass percentage for girls was 83.65, that for boys was 78.01, a JKBOSE spokesperson said.", "url": "https://www.ndtv.com/education/jkbose-result-2022-girls-outshine-boys-in-jammu-and-kashmir-board-class-10-exams", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/14/jkbose.jpg", "publishedAt": "2022-07-14T14:57:44Z", "content": "Jammu:Girls outperformed boys in the Class 10 exams conducted by the Jammu and Kashmir Board of School Education, the results for which were declared on Thursday. While the pass percentage for girls … [+1608 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Delhi Class 12 Boy Arrested For Stabbing Classmates Amid Quarrel: Cops", "description": "A student was arrested for allegedly stabbing his classmates following a quarrel at a government school in south Delhi's Bhati Mines area, police said on Thursday.", "url": "https://www.ndtv.com/delhi-news/delhi-news-delhi-class-12-boy-arrested-for-stabbing-classmates-amid-a-quarrel-cops-3157475", "urlToImage": "https://c.ndtvimg.com/2019-05/fkcrjpmg_delhi-police-generic_625x300_27_May_19.jpg", "publishedAt": "2022-07-14T14:53:09Z", "content": "Delhi: According to police, they received information on Wednesday morning. (Representational)\r\nNew Delhi: A student was arrested for allegedly stabbing his classmates following a quarrel at a govern… [+813 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Anti-Drug Agency Seizes Over 1,100 Kg Poppy Straw In Jammu And Kashmir", "description": "Two major attempts to smuggle narcotic substances were foiled with the recovery of over 1,100 kg of poppy straw from two Punjab-bound vehicles at different places in Jammu and Kathua districts, officials said on Thursday.", "url": "https://www.ndtv.com/india-news/jammu-and-kashmir-2-major-narcotic-smuggling-bids-foiled-over-1-100-kg-of-poppy-straw-seized-3158605", "urlToImage": "https://c.ndtvimg.com/144povgk_police-istock_625x300_15_August_18.jpg", "publishedAt": "2022-07-14T14:50:53Z", "content": "Two major attempts to smuggle narcotic substances were foiled.\r\nJammu/Kathua: Two major attempts to smuggle narcotic substances were foiled with the recovery of over 1,100 kg of poppy straw from two … [+1592 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Watch: Kohli, Bairstow Engrossed In Conversation Ahead Of Lord's ODI", "description": "Both Kohli and Bairstow were involved in a heated argument during the rescheduled 5th Test in Birmingham earlier this month.", "url": "https://sports.ndtv.com/england-vs-india-2022/watch-virat-kohli-jonny-bairstow-engrossed-in-conversation-ahead-of-england-vs-india-2nd-odi-at-lords-3158604", "urlToImage": "https://c.ndtvimg.com/2022-07/8j05re5o_kohli-bairstow-lords_625x300_14_July_22.jpg", "publishedAt": "2022-07-14T14:50:51Z", "content": "India are taking on world champions England in the second ODI of the three-match series currently at the Lord's Cricket Ground in London. There was a big boost for India ahead of the start of the mat… [+1369 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTVSports", "title": "England vs India Live Score Ball by Ball, England vs India, 2022 Live Cricket Score Of Today's Match on NDTV Sports", "description": "Live Updates of Today Match between England vs India from Lord's, London. Check commentary and full scoreboard of the match.", "url": "https://sports.ndtv.com/england-vs-india-2022/england-vs-india-live-score-over-2nd-odi-odi-36-40-updates-3158579", "urlToImage": "https://edata.ndtv.com/twittergft/sport_automated_story/big_637934277725053996.png", "publishedAt": "2022-07-14T14:50:05Z", "content": "Follow the England vs India, 2022 live cricket score on Sports.NDTV.com. After 40.3 overs, England are 207/6. Get live score, ball by ball commentary and much more. Keep track of England vs India, 20… [+4543 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "KWK: Janhvi Reflects On Life Before And After Mom Sridevi's Death", "description": "Koffee With Karan 7: \"It almost hurts to remember the person that I was,\" said Janhvi Kapoor", "url": "https://www.ndtv.com/entertainment/koffee-with-karan-7-janhvi-kapoor-reflects-on-life-before-and-after-mom-sridevis-death-3158569", "urlToImage": "https://c.ndtvimg.com/2022-07/eordm4ro_sridevi_625x300_14_July_22.jpg", "publishedAt": "2022-07-14T14:42:41Z", "content": "A throwback of Janhvi Kapoor with Sridevi. (courtesy: sridevi.kapoor)\r\nNew Delhi: The second episode of Koffee With Karan 7, was a cauldron of emotions. The episode began with Sara Ali Khan and Janhv… [+1878 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sri Lankan President Gotabaya Rajapaksa E-Mails Resignation: Official", "description": "Sri Lanka's President Gotabaya Rajapaksa e-mailed his resignation on Thursday, shortly after he reached Singapore, a spokesman for the parliamentary speaker said.", "url": "https://www.ndtv.com/world-news/sri-lankan-president-gotabaya-rajapaksa-e-mails-resignation-official-3158564", "urlToImage": "https://c.ndtvimg.com/2019-11/o0t0sdvk_gotabaya-rajapaksa-reuters_625x300_16_November_19.jpg", "publishedAt": "2022-07-14T14:41:22Z", "content": "Gotabaya Rajapaksa e-mailed his resignation shortly after he reached Singapore.\r\nColombo, Sri Lanka: Sri Lanka's President Gotabaya Rajapaksa e-mailed his resignation on Thursday, shortly after he re… [+310 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"New Life Finally\": Lalit Modi Posts Pics With \"Better Half\" Sushmita Sen", "description": "Lalit Modi, former IPL chairman, today posted a cryptic tweet announcing actor Sushmita Sen as his better half.", "url": "https://www.ndtv.com/india-news/lalit-modi-sushmita-sen-relationship-better-half-new-life-finally-lalit-modi-posts-pics-with-better-half-sushmita-sen-3158560", "urlToImage": "https://c.ndtvimg.com/2022-07/pidir1s8_lalit-modi-sushmita-sen_625x300_14_July_22.jpg", "publishedAt": "2022-07-14T14:41:02Z", "content": "New Delhi: Lalit Modi, the first chairman of Indian Premier League, today announced a \"new beginning\" with actor Sushmita Sen. Calling Ms Sen his better half, Lalit Modi sent their fans into a frenzy… [+1667 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTVSports", "title": "England vs India Live Score Ball by Ball, England vs India, 2022 Live Cricket Score Of Today's Match on NDTV Sports", "description": "Live Updates of Today Match between England vs India from Lord's, London. Check commentary and full scoreboard of the match.", "url": "https://sports.ndtv.com/england-vs-india-2022/england-vs-india-live-score-over-2nd-odi-odi-31-35-updates-3158516", "urlToImage": "https://edata.ndtv.com/twittergft/sport_automated_story/big_637934265779855156.png", "publishedAt": "2022-07-14T14:40:02Z", "content": "A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com. After 35.3 overs, England are 169/6. The live updates of England vs India scorecard is also… [+4620 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Donations To National Parties Decreased By 41% In 2020-21: Report", "description": "The donations that recognised national parties received during financial year 2020-21 decreased by over Rs 420 crore, a sharp fall of 41.49 per cent from the previous fiscal, a poll reform advocacy group said on Thursday.", "url": "https://www.ndtv.com/india-news/association-for-democratic-reforms-donations-to-national-parties-decreased-by-41-in-2020-21-report-3157990", "urlToImage": "https://c.ndtvimg.com/2021-06/3ve7ct0s_bjp-flag_625x300_06_June_21.jpg", "publishedAt": "2022-07-14T14:34:49Z", "content": "A total of over Rs 246 crore was donated to the national parties from Delhi.\r\nNew Delhi: The donations that recognised national parties received during financial year 2020-21 decreased by over Rs 420… [+2490 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "India Hopes For Early Solution To Sri Lanka Crisis", "description": "As Sri Lanka reels under political and economic crisis, India on Thursday said it continues to stand with the Lankan people and hoped for an early solution to the situation.", "url": "https://www.ndtv.com/india-news/india-hopes-for-early-solution-to-sri-lanka-crisis-3158536", "urlToImage": "https://c.ndtvimg.com/2022-07/9nvbv8l_sri-lanka-protestors-buildings_625x300_14_July_22.jpg", "publishedAt": "2022-07-14T14:33:41Z", "content": "New Delhi: As Sri Lanka reels under political and economic crisis, India on Thursday said it continues to stand with the Lankan people and hoped for an early solution to the situation, especially rel… [+1576 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Joe Biden Talks Joint Investment With Israel, India, UAE", "description": "US President Joe Biden held joint investment talks Thursday with Israel, India and the United Arab Emirates, as Washington seeks to counter the global reach of China.", "url": "https://www.ndtv.com/world-news/joe-biden-talks-joint-investment-with-israel-india-uae-3158494", "urlToImage": "https://c.ndtvimg.com/2022-07/n24017gg_joe-biden-afp_625x300_14_July_22.jpg", "publishedAt": "2022-07-14T14:27:51Z", "content": "Joe Biden held joint investment talks Thursday with Israel, India and the United Arab Emirates.\r\nJerusalem, Undefined: US President Joe Biden held joint investment talks Thursday with Israel, India a… [+1183 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Indian Navy Rescues 6 Fishermen Stranded Off Tamil Nadu Coast", "description": "An Indian Navy's patrol vessel on Wednesday rescued six fishermen who were stranded on their capsized boat off the Nagapattinam coast in Tamil Nadu.", "url": "https://www.ndtv.com/india-news/indian-navy-rescues-6-fishermen-stranded-off-tamil-nadu-coast-3157376", "urlToImage": "https://c.ndtvimg.com/2022-07/0al3ll3c_india-navy-rescue_625x300_14_July_22.jpg", "publishedAt": "2022-07-14T14:25:36Z", "content": "Tamil Nadu: An Indian Navy's patrol vessel rescued six fishermen .\r\nNew Delhi: An Indian Navy's patrol vessel on Wednesday rescued six fishermen who were stranded on their capsized boat off the Nagap… [+763 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "India's First Monkeypox Case Reported In Kerala, Man Who Came From UAE", "description": "kerala Health Minister Veena George says he landed at Thiruvananthapuram airport and all WHO guidelines are being followed", "url": "https://www.ndtv.com/india-news/indias-first-monkeypox-case-reported-in-kerala-3158478", "urlToImage": "https://c.ndtvimg.com/2022-05/fvkatugs_monkeypox_625x300_28_May_22.jpg", "publishedAt": "2022-07-14T14:23:42Z", "content": "Thiruvananthapuram: A man who travelled from the UAE has tested positive for monkeypox in Kerala, state Health Minister Veena George said today. He landed at the Thiruvananthapuram airport and is \"qu… [+1387 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Stars Descend At Lord's: Dhoni, Sachin, Ganguly, Harbhajan In Attendance", "description": "Several former Indian cricket team stars including MS Dhoni, Sourav Ganguly, Sachin Tendulkar, Harbhajan Singh, Suresh Raina were present at the Lord's for the second ODI", "url": "https://sports.ndtv.com/england-vs-india-2022/ms-dhoni-sachin-tendulkar-sourav-ganguly-harbhajan-singh-suresh-raina-stars-descend-at-lords-see-pics-3158471", "urlToImage": "https://c.ndtvimg.com/2022-07/tfjbrc9_dhoni-raina_625x300_14_July_22.jpg", "publishedAt": "2022-07-14T14:22:36Z", "content": "The second ODI between India and England at Lord's on Thursday will be a great opportunity for the Rohit Sharma-led visitors to seal the series. India had won the first ODI of the three-match contest… [+2781 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTVSports", "title": "England vs India Live Score Ball by Ball, England vs India, 2022 Live Cricket Score Of Today's Match on NDTV Sports", "description": "Live Updates of Today Match between England vs India from Lord's, London. Check commentary and full scoreboard of the match.", "url": "https://sports.ndtv.com/england-vs-india-2022/england-vs-india-live-score-over-2nd-odi-odi-26-30-updates-3158412", "urlToImage": "https://edata.ndtv.com/twittergft/sport_automated_story/big_637934255914566620.png", "publishedAt": "2022-07-14T14:21:45Z", "content": "Follow the England vs India, 2022 live cricket score on Sports.NDTV.com. After 30.2 overs, England are 152/6. Get live score, ball by ball commentary and much more. Keep track of England vs India, 20… [+5459 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Assam Woman Dies After In-Laws Force Her To Consume Acid: Police", "description": "In a shocking incident, a woman died after being allegedly forced to drink acid by her in-laws in Assam's Karimganj district, police said on Thursday.", "url": "https://www.ndtv.com/india-news/assam-assam-woman-dies-after-in-laws-force-her-to-consume-acid-police-3157027", "urlToImage": "https://c.ndtvimg.com/2019-06/hf08g2no_murder-generic_625x300_27_June_19.jpg", "publishedAt": "2022-07-14T14:21:07Z", "content": "Assam: The woman allegedly died after being forced to consume acid. (Representational)\r\nKarimganj (Assam): In a shocking incident, a woman died after being allegedly forced to drink acid by her in-la… [+801 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Maharashtra: Schools To Remain Shut In Latur For Two Days Amid Rains", "description": "As per the order, although schools will remain closed, teachers and non-teaching staff will have to be present in the premises, as the Disaster Management Act 2005 has been imposed in the district. The district has been witnessing incessant rains since the la…", "url": "https://www.ndtv.com/education/maharashtra-schools-remain-shut-in-latur-for-two-days-amid-rain-warning", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/14/rain-featured-image.jpg", "publishedAt": "2022-07-14T14:19:52Z", "content": "Latur:In light of the forecast for rainfall and possibility of floods, the administration has declared a two-day holiday for all schools in Maharashtra's Latur district, an official said on Thursday.… [+1062 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "On Bal Thackeray Memorial, Mumbai Municipal Body's Response In Court", "description": "The Brihanmumbai Municipal Corporation and a heritage panel told the Bombay High Court on Thursday that all necessary procedures were followed for the construction of Shiv Sena founder Bal Thackeray's memorial in Mumbai.", "url": "https://www.ndtv.com/india-news/on-bal-thackeray-memorial-mumbai-municipal-bodys-response-in-court-3157311", "urlToImage": "https://i.ndtvimg.com/i/2015-12/bombay-high-court_650x400_81449736723.jpg", "publishedAt": "2022-07-14T14:16:49Z", "content": "Bombay High Court: The petition was filed in April 2017.\r\nMumbai: The Brihanmumbai Municipal Corporation and a heritage panel told the Bombay High Court on Thursday that all necessary procedures were… [+1420 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rishi Sunak Tops Second Round Of Voting To Succeed Boris Johnson As UK PM", "description": "Former British finance minister Rishi Sunak won the most votes in the second round of voting to succeed Boris Johnson as leader of the Conservative Party and prime minister, as one candidate was eliminated.", "url": "https://www.ndtv.com/world-news/rishi-sunak-tops-second-round-of-voting-to-succeed-boris-johnson-as-uk-pm-3158441", "urlToImage": "https://c.ndtvimg.com/2021-08/urn5beog_rishi-sunak-reuters-650_625x300_09_August_21.jpg", "publishedAt": "2022-07-14T14:13:15Z", "content": "Rishi Sunak won the most votes in the second round of voting.\r\nLondon: Former British finance minister Rishi Sunak won the most votes in the second round of voting to succeed Boris Johnson as leader … [+498 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Mridusmita Deka", "title": "CUET UG 2022 Starts Tomorrow; Things To Carry To The Exam Centre", "description": "CUET 2022: The CUET 2022 exam guidelines include shift timing and lists of items the applicants can carry to exam centres.", "url": "https://www.ndtv.com/education/cuet-ug-2022-starts-tomorrow-things-to-carry-exam-centre-5-points-on-nta-exam-guidelines", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/14/exam-day-guidelines-featured-image.jpg", "publishedAt": "2022-07-14T14:10:12Z", "content": "New Delhi:With around 14.9 lakh aspirants this year, CUET will be held from tomorrow, July 15 for admission to undergraduate programmes in Central Universities. The CUET 2022 exam guidelines include … [+2245 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Right Name For 'Operation Kamal' Is 'Operation...\": Yashwant Sinha's Jibe", "description": "Opposition parties' Presidential candidate Yashwant Sinha on Thursday accused the ruling Bharatiya Janata Party (BJP) of indulging in horse trading in the election for the country's highest constitutional post and sought a probe into it.", "url": "https://www.ndtv.com/india-news/right-name-for-operation-kamal-is-operation-yashwant-sinhas-bjp-jibe-3158424", "urlToImage": "https://c.ndtvimg.com/2022-06/s4315gn_yashwant-sinha-pti_625x300_24_June_22.jpg", "publishedAt": "2022-07-14T14:09:10Z", "content": "Yashwant Sinha said BJP has become fearful of the outcome of a fair presidential election.(File)\r\nBhopal: Opposition parties' Presidential candidate Yashwant Sinha on Thursday accused the ruling Bhar… [+2534 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "What Devendra Fadnavis Said On Mumbai-Ahmedabad Bullet Train Project", "description": "The Maharashtra government has given all the clearances for expediting the Mumbai-Ahmedabad bullet train project, Deputy Chief Minister Devendra Fadnavis said on Thursday.", "url": "https://www.ndtv.com/india-news/what-devendra-fadnavis-said-on-mumbai-ahmedabad-bullet-train-project-3157742", "urlToImage": "https://c.ndtvimg.com/2019-11/roj9c3q8_devendra-fadnavis-pti_625x300_10_November_19.jpg", "publishedAt": "2022-07-14T14:06:20Z", "content": "Devendra Fadnavis said Chief Minister Eknath Shinde has given all the clearances for the project.\r\nMumbai/New Delhi: The Maharashtra government has given all the clearances for expediting the Mumbai-… [+4073 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "2 Washed Away While Rescuing Pregnant Woman In Flood-Hit Telangana District", "description": "The bodies of two personnel of a rescue team who were swept away in a swollen stream in Kumuram Bheem Asifabad district while evacuating a pregnant woman were found on Thursday, police said.", "url": "https://www.ndtv.com/india-news/two-washed-away-while-rescuing-pregnant-woman-in-flood-hit-telangana-district-3158404", "urlToImage": "https://c.ndtvimg.com/2022-07/lguf00dg_telangana-floods_625x300_14_July_22.jpg", "publishedAt": "2022-07-14T14:05:04Z", "content": "Rains have been lashing Telangana for the past six days\r\nHyderabad: The bodies of two personnel of a rescue team who were swept away in a swollen stream in Kumuram Bheem Asifabad district while evacu… [+1240 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Pakistan Man Boils Wife In Cauldron In Front Of His Children: Report", "description": "In a gruesome incident, a Pakistani man has allegedly killed and boiled his wife in a cauldron in front of his six children here in the country's Sindh province.", "url": "https://www.ndtv.com/world-news/pakistan-man-boils-wife-in-cauldron-in-front-of-his-children-report-3158383", "urlToImage": "https://c.ndtvimg.com/2021-12/4cv2tjk8_pakistan-police-karachi-afp-file-photo_625x300_11_December_21.jpg", "publishedAt": "2022-07-14T13:59:39Z", "content": "Police found the woman's body in a cauldron in the kitchen of a private school. (File)\r\nKarachi: In a gruesome incident, a Pakistani man has allegedly killed and boiled his wife in a cauldron in fron… [+1918 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "NDA President Pick Draupadi Murmu Meets BJP Lawmakers In Goa; Seeks Support", "description": "Legislators and MPs of the BJP and its supporting parties in Goa on Thursday attended a meeting with the National Democratic Alliance's nominee Droupadi Murmu for the presidential election.", "url": "https://www.ndtv.com/india-news/presidential-elections-nda-president-pick-draupadi-murmu-meets-bjp-lawmakers-in-goa-seeks-support-3157096", "urlToImage": "https://c.ndtvimg.com/2022-06/8m40kj58_draupadi-murmu-twitter-650_650x400_21_June_22.jpg", "publishedAt": "2022-07-14T13:57:14Z", "content": "President Elections: Droupadi Murmu met BJP MLAs and MPs in Goa.\r\nPanaji: Legislators and MPs of the BJP and its supporting parties in Goa on Thursday attended a meeting with the National Democratic … [+1841 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Rashi Hardaha", "title": "ICAI Announces CA Inter, Final November 2022 Exam Dates", "description": "ICAI CA Inter, Final November Exams 2022: As per the schedule, the ICAI CA Inter exam 2022 will be held from November 1 to 17, while the CA Final 2022 exam will be conducted between November 1 to 16.", "url": "https://www.ndtv.com/education/icai-announces-ca-inter-final-november-2022-exam-dates-check-schedule-here", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/14/icai_ca_exams_2022.jpg", "publishedAt": "2022-07-14T13:56:29Z", "content": "ICAI CA Inter, Final November Exams 2022: The Institute of Chartered Accountants of India (ICAI) has announced the schedule for the Chartered Accountancy (CA) Intermediate and Final November 2022 exa… [+1572 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Lanka President Gotabaya Rajapaksa, Who Fled Amid Massive Protests, Quits", "description": "Sri Lankan President Gotabaya Rajapaksa has resigned after landing in Singapore since he fled the island nation on Tuesday.", "url": "https://www.ndtv.com/world-news/sri-lanka-president-gotabaya-rajapaksa-who-fled-the-country-resigns-3158353", "urlToImage": "https://c.ndtvimg.com/2022-07/67hn949o_gotabaya-rajapaksa-sri-lanka-reuters-650_625x300_13_July_22.jpg", "publishedAt": "2022-07-14T13:53:31Z", "content": "Sri Lankan President Gotabaya Rajapaksa has fled to Singapore\r\nColombo/New Delhi: Sri Lankan President Gotabaya Rajapaksa has resigned after landing in Singapore since he fled the island nation on Tu… [+2355 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTVSports", "title": "England vs India Live Score Ball by Ball, England vs India, 2022 Live Cricket Score Of Today's Match on NDTV Sports", "description": "Live Updates of Today Match between England vs India from Lord's, London. Check commentary and full scoreboard of the match.", "url": "https://sports.ndtv.com/england-vs-india-2022/england-vs-india-live-score-over-2nd-odi-odi-21-25-updates-3158309", "urlToImage": "https://edata.ndtv.com/twittergft/sport_automated_story/big_637934242090511704.png", "publishedAt": "2022-07-14T13:49:56Z", "content": "A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com. After 25.2 overs, England are 123/5. The live updates of England vs India scorecard is also… [+5172 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Asian News International", "title": "CSK Batter Robin Uthappa, Wife Shheethal Introduce 'Newest Angel'. See Pic", "description": "Robin Uthappa penned that he was grateful they were blessed with a baby daughter as he shared the first glimpses of a newborn child with the world.", "url": "https://sports.ndtv.com/cricket/love-to-introduce-our-newest-angel-csk-batter-robin-uthappa-and-wife-shheethal-blessed-with-baby-girl-3158325", "urlToImage": "https://c.ndtvimg.com/2022-07/uicbqeng_uthappa-wife-_625x300_14_July_22.jpg", "publishedAt": "2022-07-14T13:47:02Z", "content": "Chennai Super Kings batter Robin Uthappa and his wife Shheethal have been blessed with a baby daughter, whom they have named Trinity Thea Uthappa. He took to his Instagram on Thursday and wrote a hea… [+786 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sharad Pawar Behind Earlier Splits In Party, Alleges Sena Rebel Faction", "description": "A key member of the rebel faction of Shiv Sena Member of Legislative Assembly in Maharashtra has claimed Nationalist Congress Party president Sharad Pawar was behind the earlier splits in the party.", "url": "https://www.ndtv.com/india-news/sharad-pawar-behind-earlier-splits-in-party-alleges-sena-rebel-faction-3158297", "urlToImage": "https://c.ndtvimg.com/2022-06/09og4vf8_sharad-pawar-ndtv-650_650x400_23_June_22.jpg", "publishedAt": "2022-07-14T13:40:21Z", "content": "Deepak Kesarkar sought to know what Sharad Pawar gained by causing pain to Bal Thackeray.\r\nMumbai: A key member of the rebel faction of Shiv Sena Member of Legislative Assembly in Maharashtra has cla… [+2277 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Shriya Saran And Jr NTR In A Major Throwback Pic", "description": "Shriya Saran and Jr NTR worked together in the movie Naa Alludu", "url": "https://www.ndtv.com/entertainment/shriya-saran-and-jr-ntr-in-a-major-throwback-pic-3158296", "urlToImage": "https://c.ndtvimg.com/2022-07/46dnj3h_shriya_625x300_14_July_22.jpg", "publishedAt": "2022-07-14T13:39:51Z", "content": "Shriya Saran shared this picture. (courtesy: shriya_saran1109)\r\nShriya Saran has treated her Insta family to a major throwback picture posing with her Naa Alludu co-star Jr NTR. Yes, in the image, Sh… [+1370 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Bihar Cop Compares Popular Front Of India With RSS, Triggers Huge Row", "description": "A senior officer of the Bihar Police set off a controversy today after giving a statement on a terror module they had detected.", "url": "https://www.ndtv.com/india-news/bihar-cop-compares-popular-front-of-india-with-rss-triggers-huge-row-3158288", "urlToImage": "https://c.ndtvimg.com/2022-07/5qdiv48_patna-ssp-controversy-650_650x400_14_July_22.jpg", "publishedAt": "2022-07-14T13:37:59Z", "content": "Patna: A senior officer of the Bihar Police set off a controversy today after giving a statement on a terror module they had detected. While explaining the modus operandi of the group, which was tryi… [+1053 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Jharkhand Mukti Morcha Latest Non-NDA Party To Back Droupadi Murmu", "description": "If elected, which all but done as the BJP-led NDA has the numbers, Droupadi Murmu will be the first woman from a tribal community to be President of India.", "url": "https://www.ndtv.com/india-news/jharkhand-mukti-morcha-backs-droupadi-murmu-for-president-latest-non-nda-party-on-list-3158256", "urlToImage": "https://c.ndtvimg.com/2022-06/hlulm5lo_droupadi-murmu_625x300_21_June_22.jpg", "publishedAt": "2022-07-14T13:29:06Z", "content": "Ranchi: The Jharkhand Mukti Morcha (JMM) has joined the list of non-NDA parties that have declared support for NDA candidate Droupadi Murmu citing her tribal identity for the July 18 Presidential ele… [+795 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Heaven Meets Earth\": Minister Shares Stunning Video Of Dudhsagar Falls", "description": "During monsoon, the Dudhsagar waterfalls or 'Sea of Milk' are fed by rain, resulting in a huge gush of water.", "url": "https://www.ndtv.com/india-news/heaven-meets-earth-minister-shares-stunning-video-of-dudhsagar-waterfall-3158240", "urlToImage": "https://c.ndtvimg.com/2022-07/8d384omo_dudhsagar-waterfall-koo-650_625x300_14_July_22.jpg", "publishedAt": "2022-07-14T13:24:54Z", "content": "The Dudhsagar waterfalls are formed by the Mandovi river on its journey from the Western Ghats to Panaji.\r\nMonsoon's splendid beauty lies in witnessing the cascading roar of waterfalls. A video of Go… [+1727 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTVSports", "title": "England vs India Live Score Ball by Ball, England vs India, 2022 Live Cricket Score Of Today's Match on NDTV Sports", "description": "Live Updates of Today Match between England vs India from Lord's, London. Check commentary and full scoreboard of the match.", "url": "https://sports.ndtv.com/england-vs-india-2022/england-vs-india-live-score-over-2nd-odi-odi-16-20-updates-3158189", "urlToImage": "https://edata.ndtv.com/twittergft/sport_automated_story/big_637934224686110768.png", "publishedAt": "2022-07-14T13:23:52Z", "content": "A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com. After 19.1 overs, England are 91/4. The live updates of England vs India scorecard is also … [+4442 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Asian News International", "title": "Bangladesh Pacer Shohidul Islam Suspended For Doping Violation", "description": "Bangladesh pacer Shohidul Islam has been suspended for 10 months after pleading guilty to breaching Article 2.1 of the ICC Anti-Doping Code.", "url": "https://sports.ndtv.com/cricket/bangladesh-pacer-shohidul-islam-suspended-for-doping-violation-3158231", "urlToImage": "https://c.ndtvimg.com/2022-07/vf6qmni8_shohidul-islam-afp_625x300_14_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-14T13:22:17Z", "content": "Bangladesh pacer Shohidul Islam has been suspended for 10 months after pleading guilty to breaching Article 2.1 of the ICC Anti-Doping Code. The 27-year-old pacer has represented Bangladesh in one T2… [+1308 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sri Lanka President On Private Visit, Not Granted Asylum: Singapore", "description": "Sri Lanka's President Gotabaya Rajapaksa was allowed to enter Singapore Thursday on a private visit and has not been granted asylum, the city-state said, after the leader arrived from the Maldives.", "url": "https://www.ndtv.com/world-news/sri-lanka-crisis-singapore-says-sri-lanka-president-on-private-visit-not-granted-asylum-3158218", "urlToImage": "https://c.ndtvimg.com/2020-10/lvrfesjo_sri-lankan-president-gotabaya-rajapaksareuters_625x300_23_October_20.jpg", "publishedAt": "2022-07-14T13:20:35Z", "content": "Gotabaya Rajapaksa arrived in Singapore on Thursday.\r\nSingapore: Sri Lanka's President Gotabaya Rajapaksa was allowed to enter Singapore Thursday on a private visit and has not been granted asylum, t… [+968 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Rashi Hardaha", "title": "TS LAWCET, PGLCET 2022: Last Date To Submit Application Form Extended,", "description": "TS LAWCET, PGLCET 2022: The last date to apply for the Telangana Law Common Entrance Test (LAWCET) 2022 and TS Post Graduate Law Common Entrance Test (PGLCET) 2022 is now July 15.", "url": "https://www.ndtv.com/education/ts-lawcet-pglcet-2022-last-date-to-submit-application-form-extended-check-details", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/14/TS_LAWCET.jpg", "publishedAt": "2022-07-14T13:15:51Z", "content": "TS LAWCET, PGLCET 2022: The Telangana State Council of Higher Education (TSCHE) has extended the registration deadline for the TS Law Common Entrance Test (LAWCET) and Post Graduate Law Common Entran… [+1510 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Watch: Sri Lanka In Turmoil", "description": "Hot Mic with Nidhi Razdan: Dramatic developments have been unfolding in Sri Lanka over the last 24 hours, as the world watches closely to see what will happen next. Prime Minister Ranil Wickremesinghe has taken over as the acting President, while pro", "url": "https://www.ndtv.com/world-news/sri-lanka-in-turmoil-hot-mic-with-nidhi-razdan-3158146", "urlToImage": "https://c.ndtvimg.com/2022-07/793imknk_hot-mic_625x300_14_July_22.jpg", "publishedAt": "2022-07-14T13:10:45Z", "content": "Hi, this is Hot Mic and I'm Nidhi Razdan.\r\nDramatic developments in Sri Lanka over the last 24 hours as the world watches closely to see what will happen next. Protesters have taken over the prime mi… [+6262 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Kerala, Ahmedabad On Time Magazine's List Of World's Greatest Places", "description": "Apart from these two cities, other places which made to the list of top 50 include Seoul, Buahan in Bali, the Great Barrier Reef in Australia, and many more.", "url": "https://www.ndtv.com/india-news/kerala-ahmedabad-on-time-magazines-list-of-worlds-greatest-places-of-2022-3158128", "urlToImage": "https://c.ndtvimg.com/2019-01/1o6ej8f_kerala-generic-pixabay-650_625x300_31_January_19.jpg", "publishedAt": "2022-07-14T13:08:48Z", "content": "Kerala is famous for its backwaters. (Representative Photo)\r\nKerala and Ahmedabad have been listed by the Time Magazine among 50 extraordinary destinations to explore in its list of \"World's Greatest… [+1554 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Inside Hrithik Roshan And Saba Azad's Paris Vacation", "description": "\"Where the jazz cats at??\" wrote Saba Azad", "url": "https://www.ndtv.com/entertainment/inside-hrithik-roshan-and-saba-azads-paris-vacation-3158105", "urlToImage": "https://c.ndtvimg.com/2022-07/dm8fuus8_hrithik_625x300_14_July_22.jpg", "publishedAt": "2022-07-14T13:03:13Z", "content": "A picture from Saba Azad and Hrithik Roshan's Paris vacation. (courtesy: sabazad)\r\nSaba Azad, who was on a romantic getaway to Paris with boyfriend Hrithik Roshan, has treated her Insta family to new… [+1793 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Days After Expelling O Panneerselvam, AIADMK Sacks His Son, 17 Others", "description": "Days After Expelling O Panneerselvam, AIADMK Sacks His Son, 17 Others", "url": "https://www.ndtv.com/india-news/days-after-expelling-o-panneerselvam-aiadmk-sacks-his-son-17-others-3158098", "urlToImage": "https://i.ndtvimg.com/i/2017-02/o-panneerselvam_650x400_71486534824.jpg", "publishedAt": "2022-07-14T13:01:46Z", "content": "Chennai: Tamil Nadu's opposition  AIADMK led by E Palaniswami has sacked the son of political rival O Panneerselvam and 17 other leaders. Mr Panneerselvam was sacked a few days ago amid the tussle fo… [+202 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTVSports", "title": "England vs India Live Score Ball by Ball, England vs India, 2022 Live Cricket Score Of Today's Match on NDTV Sports", "description": "Live Updates of Today Match between England vs India from Lord's, London. Check commentary and full scoreboard of the match.", "url": "https://sports.ndtv.com/england-vs-india-2022/england-vs-india-live-score-over-2nd-odi-odi-11-15-updates-3158063", "urlToImage": "https://edata.ndtv.com/twittergft/sport_automated_story/big_637934206287828186.png", "publishedAt": "2022-07-14T13:01:44Z", "content": "A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com. After 13.5 overs, England are 69/1. The live updates of England vs India scorecard is also … [+3022 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Plane Carrying Sri Lanka's President Lands In Singapore", "description": "Sri Lanka's president arrived in Singapore Thursday, as protestors who chased him from his residence demanded he keep his promise to step down over his country's worst-ever economic crisis.", "url": "https://www.ndtv.com/world-news/sri-lanka-crisis-plane-carrying-sri-lankas-president-gotabaya-rajapaksa-lands-in-singapore-3158091", "urlToImage": "https://c.ndtvimg.com/2022-07/67hn949o_gotabaya-rajapaksa-sri-lanka-reuters-650_625x300_13_July_22.jpg", "publishedAt": "2022-07-14T12:58:32Z", "content": "As president, Gotabaya Rajapaksa enjoys immunity from arrest.\r\nColombo, Sri Lanka: Sri Lanka's president arrived in Singapore Thursday, as protestors who chased him from his residence demanded he kee… [+4104 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "WHO To Reconvene Monkeypox Emergency Panel On July 21", "description": "The World Health Organization said Thursday it would reconvene its expert monkeypox committee on July 21 to decide whether the outbreak constitutes a global health emergency.", "url": "https://www.ndtv.com/world-news/who-to-reconvene-monkeypox-emergency-panel-on-july-21-3158069", "urlToImage": "https://c.ndtvimg.com/2022-05/3e0jgjh8_monkeypox-reuters_625x300_22_May_22.jpg", "publishedAt": "2022-07-14T12:52:29Z", "content": "A surge in monkeypox infections has been reported since early May.\r\nGeneva, Switzerland: The World Health Organization said Thursday it would reconvene its expert monkeypox committee on July 21 to de… [+3463 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "On Camera, Maharashtra Man Goes Missing After Dive Into Flooded River", "description": "A man from Maharashtra has gone missing after he jumped into an overflowing river. The incident occurred in Maharashtra's Malegaon yesterday.", "url": "https://www.ndtv.com/india-news/on-camera-maharashtra-man-goes-missing-after-dive-into-flooded-river-3158068", "urlToImage": "https://c.ndtvimg.com/2022-07/8rk6evo8_mumbai-man-dives-in-river_625x300_14_July_22.jpg", "publishedAt": "2022-07-14T12:52:25Z", "content": "New Delhi: A man from Maharashtra has gone missing after he jumped into an overflowing river. The incident occurred in Maharashtra's Malegaon yesterday.\r\nIn a video of the dive that has gone viral on… [+862 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Thousands Of Twitter Users Across The World Report Outage", "description": "Twitter is down for many users across the world, data on the website Downdetector that tracks website issues show. The microblogging website run by CEO Parag Agrawal saw one of the longest outages in years, The Guardian reported.", "url": "https://www.ndtv.com/world-news/thousands-of-twitter-users-across-the-world-report-outage-3158045", "urlToImage": "https://c.ndtvimg.com/2021-02/alobemt_twitter-generic-reuters_650x400_10_February_21.jpg", "publishedAt": "2022-07-14T12:46:25Z", "content": "Many Twitter users reported outage across the world today\r\nNew Delhi: Twitter is down for many users across the world, data on the website Downdetector that tracks technical issues show. The microblo… [+181 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Watch: This Woman Climbs Through McDonald's Window To Make Her Own Food", "description": "The woman climbed the window at a McDonald's outlet to get into the kitchen to make her own food, after the staff refused to take her order. Read on to know more.", "url": "https://food.ndtv.com/news/watch-this-woman-climbs-through-mcdonalds-window-to-make-her-own-food-3158026", "urlToImage": "https://c.ndtvimg.com/2022-07/hldjf3mg_woman-climbs-into-mcdonalds-650_625x300_14_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-14T12:42:35Z", "content": "We spend hours surfing social media. One of the major reasons for the same is the viral content taking the internet by storm. Every day, we come across some funny, interesting or bizarre content that… [+1630 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "CUET UG 2022: DU To Admit Extra Students Under SC, ST Category", "description": "This year, the Delhi University will be offering 70,000 seats in undergraduate programmes across several colleges through the new Common University Entrance Test (CUET).", "url": "https://www.ndtv.com/education/cuet-ug-2022-delhi-university-to-admit-extra-students-under-sc-st-category-to-fill-maximum-seats-says-vice-chancellor", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/14/delhi_university.JPG", "publishedAt": "2022-07-14T12:42:34Z", "content": "Delhi University will admit 20 per cent \"extra students\" under unreserved and OBC categories and 30 per cent in the SC,ST category to fill the maximum seats in undergraduate courses in the first roun… [+2546 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Need To Strengthen Monitoring Network In Delhi-NCR: Air Quality Panel", "description": "The Commission for Air Quality Management (CAQM) has recommended strengthening of the air quality monitoring network in the national capital region (NCR) to identify pollution hotspots and assess transboundary movement of pollution.", "url": "https://www.ndtv.com/india-news/delhi-pollution-need-to-strengthen-monitoring-network-in-delhi-ncr-air-quality-panel-3157063", "urlToImage": "https://c.ndtvimg.com/2021-12/quj1vgd_delhi-pollution-pti-delhi-air-quality-pti-photo_625x300_16_December_21.jpg", "publishedAt": "2022-07-14T12:39:46Z", "content": "Delhi Pollution: The recommendation is part of a policy formulated by the panel to curb air pollution.\r\n   New Delhi: The Commission for Air Quality Management (CAQM) has recommended strengthening of… [+4212 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ankita Lokhande And Vicky Jain Are Celebrating 6 Months Of Being Married", "description": "\"Happy 6 months to us baby,\" wrote Ankita Lokhande", "url": "https://www.ndtv.com/entertainment/ankita-lokhande-and-vicky-jain-are-celebrating-6-months-of-being-married-see-pics-3158008", "urlToImage": "https://c.ndtvimg.com/2022-07/h3qk44ig_ankita-_625x300_14_July_22.jpg", "publishedAt": "2022-07-14T12:39:43Z", "content": "Ankita Lokhande with Vicky Jain. (courtesy: lokhandeankita)\r\nNew Delhi: Ankita Lokhande and Vicky Jain celebrate their six-month anniversary today. The couple got married last year. Sharing pictures … [+1471 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Mysterious Ebola-Like Disease Kills 3 In Tanzania, Probe Launched", "description": "This comes days after Ghana reported two suspected cases of the Marburg virus, which belongs to the same family as Ebola.", "url": "https://www.ndtv.com/world-news/mysterious-ebola-like-disease-kills-3-in-tanzania-probe-launched-3158007", "urlToImage": "https://c.ndtvimg.com/2020-11/4prh1ce8_congo-declares-end-of-ebola-outbreak-that-killed-55-650_625x300_18_November_20.jpg", "publishedAt": "2022-07-14T12:39:38Z", "content": "The mysterious illness has symptoms like Ebola. (Representative Photo)\r\nThree people have died from a mysterious Ebola-like disease in Africa's Tanzania, prompting the government to dispatch a team o… [+1738 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sri Lanka President On Private Visit, Not Granted Asylum: Singapore", "description": "Sri Lanka President Gotabaya Rajapaksa is on a private visit and has notbeen granted asylum, the Singapore government said today shortly before his flight was expected to land.", "url": "https://www.ndtv.com/world-news/sri-lanka-president-on-private-visit-not-granted-asylum-singapore-3157997", "urlToImage": "https://c.ndtvimg.com/2022-04/9p6ua618_sri-lankas-president-rajapaksa-reuters-650_650x400_06_April_22.jpg", "publishedAt": "2022-07-14T12:37:59Z", "content": "Colombo: Sri Lanka President Gotabaya Rajapaksa is on a private visit and has not been granted asylum, the Singapore government said today shortly before his flight was expected to land in the city s… [+1469 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Mridusmita Deka", "title": "NIRF Rankings 2022 To Rank India's Top Colleges Tomorrow", "description": "The broad categories adopted to rank institutes, as per NIRF website, are Teaching, Learning and Resources; Research and Professional Practice; Graduation Outcomes; Outreach and Inclusivity and Peer Perception.", "url": "https://www.ndtv.com/education/nirf-rankings-2022-rank-indias-top-colleges-tomorrow-heres-list-from-last-year", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/14/ranking-featured-image.jpg", "publishedAt": "2022-07-14T12:36:40Z", "content": "New Delhi:The Union Education Minister Dharmendra Pradhan will release the National Institutional Ranking Framework (NIRF) tomorrow, July 15 to rank colleges and institutes in India. NIRF India Ranki… [+3455 chars]"}]}