{"status": "ok", "totalResults": 572, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Xi Jinping Warns For Questioning China's Zero-Covid Policy", "description": "Chinese President Xi Jinping issued the strongest warning yet against anyone who questions the country's zero-Covid policy.", "url": "https://www.ndtv.com/world-news/xi-jinping-warns-for-questioning-chinas-zero-covid-policy-2953549", "urlToImage": "https://c.ndtvimg.com/2021-10/6sji2t9c_xi-jinping_625x300_09_October_21.jpg", "publishedAt": "2022-05-06T22:07:29Z", "content": "Xi Jinping has put his personal stamp on China's zero-Covid strategy to fight against pandemic.\r\nBeijing: Chinese President Xi Jinping issued the strongest warning yet against anyone who questions th… [+3312 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Biden Announces More Artillery, Radars For Ukraine's War Against Russia", "description": "President Joe Biden on Friday announced new US commitments of weaponry for Ukraine in its fight to repel Russia's invasion, but said funding was close to running out and urged Congress to authorize more.", "url": "https://www.ndtv.com/world-news/us-president-biden-announces-more-artillery-radars-for-ukraines-war-against-russia-2953536", "urlToImage": "https://c.ndtvimg.com/2022-05/n9jpkq3c_joe-biden-reuters_625x300_03_May_22.jpg", "publishedAt": "2022-05-06T21:23:52Z", "content": "Ukraine War: A senior US official said the package for Ukraine was worth $150 million.\r\nWashington: President Joe Biden announced Friday a new US weapons package worth $150 million for Ukraine's figh… [+1376 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Uzbekistan Not To Ready Recognise Taliban Government In Afghanistan", "description": "An envoy of Uzbekistan said that the country is not ready to recognize the Taliban regime in Afghanistan.", "url": "https://www.ndtv.com/world-news/uzbekistan-not-to-ready-recognise-taliban-government-in-afghanistan-2953533", "urlToImage": "https://c.ndtvimg.com/2021-10/g9ctmgnc_taliban-government_625x300_21_October_21.jpg", "publishedAt": "2022-05-06T21:13:28Z", "content": "Uzbek official said, it wants a \"collective voice\" over recognition of Taliban regime in Afghanistan.\r\nKabul: An envoy of Uzbekistan said that the country is not ready to recognize the Taliban regime… [+2128 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Tajinder Bagga Produced Before Magistrate At Midnight, Released: Lawyer", "description": "The Delhi police produced Tejinder Pal Singh Bagga at the residence of Duty Magistrate Swayam Siddha Tripathi on Friday midnight.", "url": "https://www.ndtv.com/india-news/bjps-tajinder-pal-singh-bagga-produced-before-magistrate-at-midnight-released-lawyer-2953526", "urlToImage": "https://c.ndtvimg.com/2020-01/s6via88g_bjp-leader-tajinder-pal-bagga_625x300_21_January_20.jpg", "publishedAt": "2022-05-06T20:57:13Z", "content": "Tajinder Pal Singh Bagga was arrested yesterday by the Punjab Police in a case registered at Mohali.\r\nNew Delhi: The Delhi police produced Tajinder Pal Singh Bagga at the residence of Duty Magistrate… [+1925 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Adds Putin Critic Navalny Allies, Rapper To \"Foreign Agents\" List", "description": "Russia on Friday added new figures critical of the Kremlin to its list of \"foreign agents,\" including two exiled allies of jailed opposition leader Alexei Navalny and a popular rapper.", "url": "https://www.ndtv.com/world-news/russia-adds-putin-critic-navalny-allies-rapper-alisher-morgenshtern-to-foreign-agents-list-2953511", "urlToImage": "https://c.ndtvimg.com/2022-03/1gsbh8do_red-square-kremlin-moscowafp-_625x300_04_March_22.jpg", "publishedAt": "2022-05-06T20:33:26Z", "content": "Russia also placed popular rapper Alisher Morgenshtern on the \"foreign agents\" list.\r\nMoscow: Russia on Friday added new figures critical of the Kremlin to its list of \"foreign agents,\" including two… [+1676 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "India Expresses \"Deep Concern\" Over Worsening Situation In Ukraine", "description": "India on Friday said that it remained deeply concerned about the worsening situation in Ukraine and reiterated its call for an immediate cessation of violence and end to the hostilities.", "url": "https://www.ndtv.com/india-news/india-expresses-deep-concern-over-worsening-situation-in-ukraine-2953475", "urlToImage": "https://c.ndtvimg.com/2022-03/a2ukbeio_ukraine-war-afp-240_625x300_24_March_22.jpg", "publishedAt": "2022-05-06T19:58:11Z", "content": "India also appreciated the efforts of the UN in evacuating the civilian population from Mariupol.\r\nNew York: India on Friday said that it remained deeply concerned about the worsening situation in Uk… [+1419 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UK Opposition Leader Faces Police Probe Over 'Partygate'", "description": "Keir Starmer, leader of the UK's opposition Labour Party, will face a police probe into whether a campaign gathering in 2021 breached lockdown rules, weeks after Prime Minister Boris Johnson was fined for breaking the rules.", "url": "https://www.ndtv.com/world-news/uk-opposition-leader-keir-starmer-faces-police-probe-over-partygate-2953449", "urlToImage": "https://c.ndtvimg.com/2020-04/an24fi44_uk-labour-leader-keir-starmer-twitter_625x300_30_April_20.jpg", "publishedAt": "2022-05-06T19:25:32Z", "content": "UK Partygate: The report said that Keir Starmer was seen in a party last year in April. (File)\r\nLondon: Keir Starmer, leader of the UK's opposition Labour Party, will face a police probe into whether… [+3186 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UN Security Council Declaration Backs \"Peaceful\" Ukraine Solution", "description": "The UN Security Council on Friday unanimously adopted its first declaration on Ukraine since Russia invaded in February, backing the Secretary-General's efforts to find a \"peaceful solution\" to the war.", "url": "https://www.ndtv.com/world-news/ukraine-war-unanimous-un-security-council-declaration-backs-peaceful-ukraine-solution-2953419", "urlToImage": "https://c.ndtvimg.com/2022-03/dcp8sqro_ukraine-war-afp-650_625x300_30_March_22.jpg", "publishedAt": "2022-05-06T18:56:12Z", "content": "Ukraine War: The declaration is the first show of unity from the UN Security Council. (File)\r\nUnited Nations: The UN Security Council on Friday unanimously adopted its first declaration on Ukraine si… [+1456 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Airtel Broadband Outage In Parts Of Delhi, Nearby Cities, Say Users", "description": "Airtel broadband services on Friday suffered a major outage in parts of Delhi and nearby cities, say users. It is not clear what caused the outage", "url": "https://www.ndtv.com/india-news/airtel-broadband-outage-in-parts-of-delhi-nearby-cities-say-users-2953411", "urlToImage": "https://c.ndtvimg.com/2021-08/9bbgfnno_airtel-reuters_625x300_23_August_21.jpeg", "publishedAt": "2022-05-06T18:47:45Z", "content": "The company is yet to issue a statement on the outage.\r\nAirtel broadband services on Friday suffered a major outage in parts of Delhi and nearby cities, say users. It is not clear what caused the out… [+576 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Sees North Korea Nuclear Test \"As Early As This Month\"", "description": "The United States said Friday that it believes North Korea may be preparing a nuclear test as soon as this month, its first since 2017.", "url": "https://www.ndtv.com/world-news/us-sees-north-korea-nuclear-test-as-early-as-this-month-2953396", "urlToImage": "https://c.ndtvimg.com/2022-04/ng3ildto_north-korea-weapons-test-north-korea-nuclear-weapons_625x300_17_April_22.jpeg", "publishedAt": "2022-05-06T18:44:51Z", "content": "The US went public with its assessment amid mounting frustration with North Korea. (Representational)\r\nWashington: The United States said Friday that it believes North Korea may be preparing a nuclea… [+1615 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Bali To Deport Russian Couple For Nude Photos On Sacred Tree", "description": "A Russian influencer and her husband will be deported from Bali after staging a nude photo shoot on a sacred tree in violation of local culture, officials on the Indonesian holiday island said Friday.", "url": "https://www.ndtv.com/world-news/indonesias-bali-to-deport-russian-influencer-couple-for-nude-photos-on-sacred-banyan-tree-2953395", "urlToImage": "https://c.ndtvimg.com/2022-05/ettb2s4o_bali-beach_625x300_07_May_22.jpg", "publishedAt": "2022-05-06T18:44:45Z", "content": "The couple will be banned from Indonesia for at least six months. (Representational)\r\nDenpasar, Indonesia: A Russian influencer and her husband will be deported from Bali after staging a nude photo s… [+1807 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "India, Pakistan Must Brace For Even Worse Heatwaves: Climate Scientists", "description": "The devastating heatwave that gripped India and Pakistan over the last two months is unprecedented, but worse -- perhaps far worse -- is on the horizon as climate change continues apace, top climate scientists told AFP.", "url": "https://www.ndtv.com/india-news/india-pakistan-must-brace-for-even-worse-heatwaves-climate-scientists-2953384", "urlToImage": "https://c.ndtvimg.com/2022-05/k69394vk_delhi-heatwave-reuters_625x300_02_May_22.jpg", "publishedAt": "2022-05-06T18:34:58Z", "content": "Heatwave: Continued global warming guarantees greater heat extremes in coming decades. (File)\r\nParis: The devastating heatwave that gripped India and Pakistan over the last two months is unprecedente… [+5242 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Evidence Shows Russia Committed War Crimes In Ukraine: Human Rights Group", "description": "Amnesty International said on Friday there was compelling evidence that Russian troops had committed war crimes, including extrajudicial executions of civilians, when they occupied an area outside Ukraine's capital.", "url": "https://www.ndtv.com/world-news/evidence-shows-russia-committed-war-crimes-in-ukraine-human-rights-group-2953376", "urlToImage": "https://c.ndtvimg.com/2022-04/oi3hocag_kyiv-attack-ukraine-war-afp-650_625x300_29_April_22.jpg", "publishedAt": "2022-05-06T18:29:54Z", "content": "Russia occupied an area outside Ukraine's capital Kyiv in February and March.\r\nKyiv: Amnesty International said on Friday there was compelling evidence that Russian troops had committed war crimes, i… [+3193 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "3 IAS Officers Sentenced To 1-Month Jail For Contempt Of Court In Andhra", "description": "The Andhra Pradesh High Court on Friday sentenced three IAS officers, including a Special Chief Secretary, to a jail term of one month and also ordered them to pay a fine of Rs 2,000 each holding them guilty of contempt of court.", "url": "https://www.ndtv.com/andhra-pradesh-news/3-ias-officers-sentenced-to-1-month-jail-for-contempt-of-court-in-andhra-2953349", "urlToImage": "https://c.ndtvimg.com/court-generic_625x300_1527245477936.jpg", "publishedAt": "2022-05-06T18:19:37Z", "content": "The officials failed to implement the court order in true spirit, the judge said\r\nAmaravati: The Andhra Pradesh High Court on Friday sentenced three IAS officers, including a Special Chief Secretary,… [+2128 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "IPL 2022: Mumbai Indians Edge Past Gujarat Titans, Win By 5 Runs", "description": "IPL 2022, GT vs MI: Murugan Ashwin took two wickets as Mumbai Indians defeated Gujarat Titans by five runs at the Brabourne Stadium in Mumbai on Friday.", "url": "https://sports.ndtv.com/ipl-2022/ipl-2022-gt-vs-mi-mumbai-indians-edge-past-gujarat-titans-win-by-5-runs-2953342", "urlToImage": "https://c.ndtvimg.com/2022-05/bdbft0q8_mi-bcci-ipl_625x300_06_May_22.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-06T18:16:14Z", "content": "Pacer Daniel Sams displayed ice-cool temperament as he conceded just three runs in the last over to help Mumbai Indians pull off a stunning five-run victory over table-toppers Gujarat Titans in an IP… [+3861 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Germany Withdraws Case Against Italy Over Nazi Compensation Claims", "description": "The International Court of Justice said on Friday that Germany withdrew its case against Italy which Berlin said wrongly continued to claim World War II compensation.", "url": "https://www.ndtv.com/world-news/world-war-2-compensation-germany-withdraws-case-against-italy-over-nazi-compensation-claims-2953313", "urlToImage": "https://c.ndtvimg.com/2019-07/3qb1idb8_international-court-of-justice_625x300_17_July_19.jpg", "publishedAt": "2022-05-06T18:11:15Z", "content": "Germany decided to withdraw the case following recent developments in Italy, ICJ said. (Representational)\r\nThe Hague: The International Court of Justice said on Friday that Germany withdrew its case … [+1609 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Says Probing Deaths Of 5 Children Linked To Mystery Liver Disease - NDTV", "description": "<ol><li>US Says Probing Deaths Of 5 Children Linked To Mystery Liver Disease  NDTV\r\n</li><li>Alarming Global Rise in Pediatric Hepatitis: Expert Q&A  Medscape\r\n</li><li>Mysterious Hepatitis Outbreak Detected in Children in 20 Countries Around the World; WHO R…", "url": "https://www.ndtv.com/world-news/us-says-probing-deaths-of-5-children-linked-to-mystery-liver-disease-hepatitis-2953323", "urlToImage": "https://i.ndtvimg.com/i/2017-09/hepatitis-action-plan-to-come-in-october_650x400_41505196638.jpg", "publishedAt": "2022-05-06T18:05:14Z", "content": "The USCDC said it's probing 109 childhood cases of a mysterious form of hepatitis. (Representational)\r\nWashington: The US Centers for Disease Control and Prevention is investigating 109 childhood cas… [+376 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "To Make Nightlife Happening, Delhi To Allow Bars To Serve Liquor Till 3 am", "description": "In a move aimed at making the nightlife more happening, the Delhi government has taken a policy decision to allow bars to serve liquor till 3 am.", "url": "https://www.ndtv.com/delhi-news/to-make-nightlife-happening-delhi-to-allow-bars-to-serve-liquor-till-3-am-2953294", "urlToImage": "https://c.ndtvimg.com/2019-09/qsmper28_sidecar-gk2_625x300_22_September_19.jpg", "publishedAt": "2022-05-06T17:56:21Z", "content": "The restaurants within hotels are already allowed to serve liquor round the clock. (Representational)\r\nNew Delhi: In a move aimed at making the nightlife more happening, the Delhi government has take… [+2330 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Cities Have Become Heat Islands\": Top Official On Heatwave Situation", "description": "Some 80% of the states are prone to heatwaves and most have plans ready to alter office and school timings as well as working hours for labourers to avoid the hottest time of day when necessary, a government official told Reuters on Friday.", "url": "https://www.ndtv.com/india-news/cities-have-become-heat-islands-top-official-on-heatwave-situation-2951716", "urlToImage": "https://c.ndtvimg.com/2022-04/7htdorbo_prayagraj-heatwave_625x300_29_April_22.jpg", "publishedAt": "2022-05-06T17:48:14Z", "content": "Heatwave in India: Power demand has hit multi-year highs. (File)\r\nNew Delhi: Some 80% of the states are prone to heatwaves and most have plans ready to alter office and school timings as well as work… [+1722 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Viral Video: Advocate Beats Woman In Court Campus In Madhya Pradesh", "description": "A 58-year-old advocate allegedly thrashed a woman litigant in full public view outside a courtroom in Beohari area of Madhya Pradesh's Shahdol district, after which the former was booked, a police official said on Friday.", "url": "https://www.ndtv.com/cities/in-viral-video-advocate-beats-woman-in-court-campus-in-madhya-pradesh-2953281", "urlToImage": "https://c.ndtvimg.com/2022-05/v805lr0o_court_625x300_06_May_22.jpg", "publishedAt": "2022-05-06T17:46:26Z", "content": "The advocate is woman's estranged husband's lawyer.\r\nShahdol: A 58-year-old advocate allegedly thrashed a woman litigant in full public view outside a courtroom in Beohari area of Madhya Pradesh's Sh… [+923 chars]"}]}