{"status": "ok", "totalResults": 553, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia-Ukraine War Updates: Russia Attacks Ukraine's Nuclear Power Plant", "description": "The Zaporizhzhia nuclear power plant in Ukraine, the largest of its kind in Europe, was on fire early morning today after an attack by Russian troops, the mayor of the nearby town of Energodar said.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-live-updates-fire-at-ukraines-nuclear-power-plant-after-russian-attack-2802616", "urlToImage": "https://c.ndtvimg.com/2022-03/73b5t9mc_ukraine-nuclear-plant-attack_625x300_04_March_22.jpg", "publishedAt": "2022-03-04T01:46:43Z", "content": "Russia-Ukraine War LIVE Updates: Russia's invasion of its neighbor is entering its ninth day.\r\nThe Zaporizhzhia nuclear power plant in Ukraine, the largest of its kind in Europe, was on fire early mo… [+995 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Posted by Amit Rajpurohit", "title": "Coronavirus LIVE Updates: India Records 6,561 New Covid Cases", "description": "India's COVID-19 case tally rose to 4,29,45,160 with 6,561 people testing positive for the infection in a day while active cases declined to 77,152 on Thursday.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-4-march-2022-2802612", "urlToImage": "https://c.ndtvimg.com/2022-01/fdhokfoo_-bengaluru-covid-testing-pti-650_650x400_03_January_22.jpg", "publishedAt": "2022-03-04T01:35:29Z", "content": "It was for 25 consecutive days that India recorded less than one lakh daily COVID-19 cases.\r\nNew Delhi: India's COVID-19 case tally rose to 4,29,45,160 with 6,561 people testing positive for the infe… [+290 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Attacks Ukrainian Nuclear Plant, Kyiv Urges Ceasefire: 10 Facts", "description": "Europe's biggest nuclear power plant, the Zaporizhzhia facility in Ukraine, was on fire after a Russian attack, the mayor of a nearby town said. Firefighters could not battle the blaze because they were being fired upon by Russian troops.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-vladimir-putin-biden-latest-developments-updates-on-kyiv-kharkiv-russian-invasion-2802607", "urlToImage": "https://c.ndtvimg.com/2022-03/73b5t9mc_ukraine-nuclear-plant-attack_625x300_04_March_22.jpg", "publishedAt": "2022-03-04T01:32:06Z", "content": "<li>Russian President Vladimir Putin today said that the invasion of Ukraine is \"going to plan\". In a televised address, Putin said that Russia was rooting out \"neo-Nazis\", and said that he will neve… [+1852 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Manipur's Naga Hills May Decide Who Wins State Polls This Time", "description": "The second phase of the Manipur elections on Saturday will see a closely watched contest in 11 constituencies in the hilly areas of the state dominated by the Naga tribe.", "url": "https://www.ndtv.com/assembly-manipur/manipurs-naga-hills-may-decide-who-wins-state-polls-this-time-2802604", "urlToImage": "https://c.ndtvimg.com/2022-03/dlf9gbl8_manipur-election-ani_625x300_03_March_22.jpg", "publishedAt": "2022-03-04T01:20:13Z", "content": "Ukhrul: The second phase of the Manipur elections on Saturday will see a closely watched contest in 11 constituencies in the hilly areas of the state dominated by the Naga tribe.\r\nIn the past five ye… [+2573 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Fire At Ukraine's Nuclear Power Plant After Russian Attack: Report", "description": "The Zaporizhzhia nuclear power plant in Ukraine, the largest of its kind in Europe, was on fire early on Friday after an attack by Russian troops, the mayor of the nearby town of Energodar said.", "url": "https://www.ndtv.com/world-news/russia-ukraine-crisis-fire-at-ukraines-nuclear-power-plant-after-russian-attack-2802588", "urlToImage": "https://c.ndtvimg.com/2022-03/p7v2ev64_russia-strikes-ukraine-russia-ukraine-war-reuters_625x300_03_March_22.jpg", "publishedAt": "2022-03-04T00:34:31Z", "content": "Russia's invasion of its neighbor is entering its ninth day.\r\nLviv: The Zaporizhzhia nuclear power plant in Ukraine, the largest of its kind in Europe, was on fire early on Friday after an attack by … [+1973 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Facebook, Multiple Media Websites Partially Down In Russia: Report", "description": "Facebook and multiple media websites were partially inaccessible in Russia on Friday, as authorities crack down on critical voices as fighting escalates in Ukraine.", "url": "https://www.ndtv.com/world-news/facebook-multiple-media-websites-partially-down-in-russia-report-2802586", "urlToImage": "https://c.ndtvimg.com/2019-02/j8jhvq5o_facebook-generic_625x300_11_February_19.jpg", "publishedAt": "2022-03-04T00:18:05Z", "content": "The monitoring NGO GlobalCheck also said the sites were partially down.\r\nMoscow: Facebook and multiple media websites were partially inaccessible in Russia on Friday, as authorities crack down on cri… [+287 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Son Testifies Against Father In US Capitol Attack Trial", "description": "The son of a Texas man charged with storming the US Capitol delivered emotional testimony against his father on Thursday at the first trial stemming from the January 6 attack on Congress by Donald Trump supporters.", "url": "https://www.ndtv.com/world-news/son-testifies-against-father-guy-reffitt-in-us-capitol-attack-trial-2802581", "urlToImage": "https://c.ndtvimg.com/2021-01/ka676kk8_us-capitol-attack_625x300_07_January_21.jpg", "publishedAt": "2022-03-04T00:01:28Z", "content": "Reffitt could face up to 20 years in prison if convicted.\r\nWashington: The son of a Texas man charged with storming the US Capitol delivered emotional testimony against his father on Thursday at the … [+2827 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "74-Year-Old Man Jailed For 10 Years For Raping Minor In Odisha", "description": "A court in Odisha's Mayurbhanj district has sentenced a 74-year-old man to 10 years of imprisonment for raping a teenager four years ago.", "url": "https://www.ndtv.com/india-news/74-year-old-man-jailed-for-10-years-for-raping-minor-in-odisha-2802579", "urlToImage": "https://i.ndtvimg.com/i/2015-03/jail-generic_650x400_61426190318.jpg", "publishedAt": "2022-03-03T23:33:34Z", "content": "The POCSO judge also imposed a fine of Rs 10,000 on the man.\r\nBaripada: A court in Odisha's Mayurbhanj district has sentenced a 74-year-old man to 10 years of imprisonment for raping a teenager four … [+713 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Biden Administration Extends Immigration Relief To Ukrainians In US", "description": "The United States announced on Thursday that it was granting \"temporary protected status\" to Ukrainians in the country for the next 18 months.", "url": "https://www.ndtv.com/world-news/biden-administration-extends-immigration-relief-to-ukrainians-in-us-2802573", "urlToImage": "https://c.ndtvimg.com/2022-03/utvlj49k_-joe-biden-state-of-union_625x300_02_March_22.jpg", "publishedAt": "2022-03-03T23:15:32Z", "content": "The Department of Homeland Security said it will allow Ukrainians to remain in the country.\r\nWashington: The United States announced on Thursday that it is granting \"temporary protected status\" to Uk… [+1293 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US To Reopen Consulate In Cuba With Limited Services", "description": "The United States consulate, closed since 2017 following alleged \"sonic attacks\" against diplomatic staff, will resume a limited service issuing visas, its embassy in Havana said Thursday.", "url": "https://www.ndtv.com/world-news/us-to-reopen-consulate-in-cuba-with-limited-services-2802564", "urlToImage": "https://c.ndtvimg.com/98ni7clo_us-flag_625x300_02_September_18.jpg", "publishedAt": "2022-03-03T22:46:47Z", "content": "The US consulate was closed since 2017 following alleged \"sonic attacks.\" (File Photo)\r\nHavana: The United States consulate, closed since 2017 following alleged \"sonic attacks\" against diplomatic sta… [+3596 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Feel The Squeeze\": Russia's Pro-Putin Oligarchs Sanctioned By US", "description": "The United States imposed sanctions on the ultra-wealthy Russian oligarchs at the heart of President Vladimir Putin's regime Thursday in the latest ratcheting up of pressure on the Kremlin to halt its invasion of Ukraine.", "url": "https://www.ndtv.com/world-news/russia-ukraine-crisis-russias-pro-putin-oligarchs-sanctioned-by-us-2802562", "urlToImage": "https://c.ndtvimg.com/2022-01/21kuv6pk_russia-tank-reuters_625x300_14_January_22.jpg", "publishedAt": "2022-03-03T22:20:36Z", "content": "\"We want the people around him (Putin) to feel the squeeze,\" the White House said.\r\nWashington: The United States imposed sanctions on the ultra-wealthy Russian oligarchs at the heart of President Vl… [+4386 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "AAP's Delhi MLA Injured In Road Accident In Uttar Pradesh", "description": "AAP MLA Akhilesh Pati Tripathi sustained serious injuries on Thursday after his car overturned on the Lucknow-Agra expressway in Uttar Pradesh's Unnao while he was returning from the Assembly poll campaigning, party said.", "url": "https://www.ndtv.com/india-news/aaps-delhi-mla-akhilesh-pati-tripathi-injured-in-road-accident-in-uttar-pradesh-2802559", "urlToImage": "https://c.ndtvimg.com/2021-04/dds8qt1c_akhilesh-pati-tripathi-facebook_625x300_09_April_21.jpg", "publishedAt": "2022-03-03T21:49:43Z", "content": "\"The doctors have said that he is out of danger,\" the party spokesman said. (File)\r\nNew Delhi: AAP MLA Akhilesh Pati Tripathi sustained serious injuries on Thursday after his car overturned on the Lu… [+965 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Heroin Worth Rs 6 Crore Extracted From Woman's Body Over 12 Days", "description": "In probably the first such case in Rajasthan, 88 capsules containing 862 gm heroin worth Rs 6 crore were extracted from a woman.", "url": "https://www.ndtv.com/india-news/heroin-worth-rs-6-crore-extracted-from-womans-body-over-12-days-in-rajasthan-2802550", "urlToImage": "https://c.ndtvimg.com/2022-01/r0g7nafo_heroin_625x300_12_January_22.jpg", "publishedAt": "2022-03-03T21:28:07Z", "content": "The woman, a Sudan national, arrived at the Jaipur airport from Sharjah. (Representational)\r\nJaipur: In probably the first such case in Rajasthan, 88 capsules containing 862 gm heroin worth Rs 6 cror… [+943 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "33 Killed, 18 Injured In Russian Strikes In Ukraine's Chernihiv City", "description": "Thirty-three people died Thursday when Russian forces hit residential areas, including schools and a high-rise apartment building, in the northern Ukrainian city of Chernihiv, officials said.", "url": "https://www.ndtv.com/world-news/russia-ukraine-crisis-33-killed-18-injured-in-russian-strikes-in-ukraines-chernihiv-city-2802547", "urlToImage": "https://c.ndtvimg.com/2022-03/gnsjcbto_ukraine-chernihivreuters-650_625x300_03_March_22.jpg", "publishedAt": "2022-03-03T20:57:59Z", "content": "Authorities said 18 people also injured in Russian air strikes.\r\nKyiv: Thirty-three people died Thursday when Russian forces hit residential areas, including schools and a high-rise apartment buildin… [+1561 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "In Call With Putin, Saudi Prince Offers To Mediate In Russia-Ukraine War", "description": "Saudi Crown Prince Mohammed bin Salman offered to host mediation talks between Russia and Ukraine in a phone call Thursday with Russian leader Vladimir Putin as the conflict entered its second week.", "url": "https://www.ndtv.com/world-news/in-phone-call-with-putin-saudi-crown-prince-mohammed-bin-salman-offers-to-mediate-in-russia-ukraine-war-2802544", "urlToImage": "https://i.ndtvimg.com/i/2018-03/saudi-crown-prince_650x400_51520318852.jpg", "publishedAt": "2022-03-03T20:41:11Z", "content": "\"Kingdom is ready to make efforts to mediate between all parties,\" Saudi's MBS said.\r\nRiyadh: Saudi Crown Prince Mohammed bin Salman offered to host mediation talks between Russia and Ukraine in a ph… [+1447 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine Crisis: UK Imposes Sanctions On Ex-Russian Deputy PM, Billionaire", "description": "The UK government said Thursday it was imposing sanctions on billionaire businessman Alisher Usmanov and former deputy prime minister Igor Shuvalov as part of punitive measures over Moscow's invasion of Ukraine.", "url": "https://www.ndtv.com/world-news/ukraine-invasion-uk-imposes-sanctions-on-ex-russian-deputy-pm-igor-shuvalov-billionaire-alisher-usmanov-2802526", "urlToImage": "https://c.ndtvimg.com/2022-02/pf6f8lc8_ukraine-kyiv-smoke-reuters_625x300_27_February_22.jpg", "publishedAt": "2022-03-03T20:08:26Z", "content": "The UK has been targeting Russian oligarchs since Moscow's invasion.\r\nLondon: The UK government said Thursday it was imposing sanctions on billionaire businessman Alisher Usmanov and former deputy pr… [+1765 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Emmanuel Macron To Run For Second Term In France Presidential Elections", "description": "French President Emmanuel Macron announced Thursday that he will seek a second term in office at elections next month, with Russia's war in Ukraine likely to eclipse the campaign but boost his chances.", "url": "https://www.ndtv.com/world-news/emmanuel-macron-to-run-for-second-term-in-france-presidential-elections-2802518", "urlToImage": "https://c.ndtvimg.com/2021-04/11394ivo_emmanuel-macron-reuters_625x300_01_April_21.jpg", "publishedAt": "2022-03-03T19:37:50Z", "content": "Macron acknowledged that the election would not be a normal one due to Russia's war on Ukraine.\r\nParis: French President Emmanuel Macron announced Thursday that he will seek a second term in office a… [+4048 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "War Of Words Over Ukraine At UN As Nuclear Fears Grow", "description": "Diplomats in Geneva slammed Russia on Thursday for its \"unprovoked\" and \"unjustified\" invasion of Ukraine, while the UN warned the rising nuclear threat put all of humanity at risk.", "url": "https://www.ndtv.com/world-news/war-of-words-over-ukraine-at-un-as-nuclear-fears-grow-2802511", "urlToImage": "https://c.ndtvimg.com/2022-03/ktpod94g_unga-generic-russia-ukraine-afp-650_625x300_01_March_22.jpg", "publishedAt": "2022-03-03T19:29:26Z", "content": "Moscow has the world's largest arsenal of nuclear weapons and a huge cache of ballistic missiles.\r\nGeneva: Diplomats in Geneva slammed Russia on Thursday for its \"unprovoked\" and \"unjustified\" invasi… [+3843 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UK's Queen Elizabeth Donates For Ukraine Refugees", "description": "Queen Elizabeth II has donated to an appeal for funds to help Ukrainian refugees, an alliance of leading UK aid charities said Thursday.", "url": "https://www.ndtv.com/world-news/uks-queen-elizabeth-donates-for-ukraine-refugees-2802494", "urlToImage": "https://c.ndtvimg.com/2022-03/48be8em_ukraine-capital-kyiv-afp_625x300_03_March_22.jpg", "publishedAt": "2022-03-03T19:02:53Z", "content": "The charities and their local partners are providing food, water, shelter and medical assistance.\r\nLondon: Queen Elizabeth II has donated to an appeal for funds to help Ukrainian refugees, an allianc… [+1734 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Desperate SOS From Indian Students Amid Blasts, Airstrikes In Ukraine", "description": "In north-eastern Ukraine's Sumy, around 60 kilometres from Russia, stranded Indian students are sending SOS messages, seeking evacuation, amid increasing airstrikes.", "url": "https://www.ndtv.com/india-news/ukraine-russia-war-desperate-sos-messages-from-indian-students-amid-blasts-airstrikes-in-ukraine-2802485", "urlToImage": "https://c.ndtvimg.com/2022-03/k20bb5ig_student-650_625x300_04_March_22.jpg", "publishedAt": "2022-03-03T18:48:06Z", "content": "Ukraine war: Around 700 Indian students have been stranded in Sumy\r\nThiruvananthapuram: In north-eastern Ukraine's Sumy, around 60 kilometres from Russia, stranded Indian students are sending SOS mes… [+3264 chars]"}]}