{"status": "ok", "totalResults": 367, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Spotify To Add Content Advisory To Covid-Related Podcasts After Backlash", "description": "Music streaming giant Spotify announced Sunday that it would start guiding listeners of podcasts discussing Covid-19 to more information about the pandemic, following a row that saw artist Neil Young remove his music from the platform.", "url": "https://www.ndtv.com/world-news/covid-misinformation-spotify-to-add-content-advisory-to-covid-related-podcasts-after-misinformation-backlash-2738892", "urlToImage": "https://i.ndtvimg.com/i/2018-04/spotify-logo-reuters_650x400_81524590917.jpg", "publishedAt": "2022-01-31T01:38:25Z", "content": "The \"new effort to combat misinformation\" will roll out in the next few days, said Spotify's CEO,\r\nSan Francisco: Music streaming giant Spotify announced Sunday that it would start guiding listeners … [+3378 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "LIVE: 2.34 Lakh Fresh Covid Cases, Positivity Rises From 13.39% To 14.50%", "description": "India's daily Covid curve showed marginal improvement as the country reported 2.34 lakh cases on Sunday, taking the total tally to 4.10 crore. The active cases now comprise 4.59 per cent of the total infections.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-latest-news-today-india-covid-19-cases-31-january-2022-2738874", "urlToImage": "https://c.ndtvimg.com/2022-01/3ll3qsn8_coronavirus-india-afp_650x400_13_January_22.jpg", "publishedAt": "2022-01-30T23:31:18Z", "content": "Coronavirus LIVE Updates: he active cases now comprise 4.59 per cent of the total infections. (File)\r\nNew Delhi: India's daily Covid curve showed marginal improvement as the country reported 2.34 lak… [+1626 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UAE Destroys Houthi Missile For Third Time This Month", "description": "The UAE said Monday it intercepted and destroyed a ballistic missile launched by Yemen's Huthi rebels towards the Gulf country with no casualties reported, the third such incident this month.", "url": "https://www.ndtv.com/world-news/uae-destroys-houthi-missile-for-third-time-this-month-2738871", "urlToImage": "https://c.ndtvimg.com/2020-11/1knq334k_uae-generic-650_625x300_07_November_20.jpg", "publishedAt": "2022-01-30T23:04:30Z", "content": "UAE said that debris fell in an unpopulated area and there were no casualties. (Representational)\r\nDubai: The UAE said Monday it intercepted and destroyed a ballistic missile launched by Yemen's Huth… [+2833 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Six Members Of Family Murdered In Violent Mexican State", "description": "Six members of a family were murdered in a rural community in Mexico's Guanajuato state, one of the most violent in the country, local authorities said Sunday.", "url": "https://www.ndtv.com/world-news/six-members-of-family-murdered-in-violent-mexicos-guanajuato-2738868", "urlToImage": "https://i.ndtvimg.com/i/2017-06/police-line-do-not-cross_650x400_41498536630.jpg", "publishedAt": "2022-01-30T22:49:32Z", "content": "The attack took place on Saturday night. (Representational)\r\nSilao: Six members of a family were murdered in a rural community in Mexico's Guanajuato state, one of the most violent in the country, lo… [+1131 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "5 Dead, Several Injured After Bus Mows Down Bystanders In UP", "description": "At least five people have been killed and several injured after an electric bus lost control and mowed down several bystanders near the Tat Mill crossroad in Kanpur on Sunday, informed local police.", "url": "https://www.ndtv.com/kanpur-news/5-dead-several-injured-after-bus-mows-down-bystanders-in-ups-kanpur-2738867", "urlToImage": "https://c.ndtvimg.com/2022-01/kj56o56_kanpur-bus-accident-650_625x300_31_January_22.jpg", "publishedAt": "2022-01-30T22:44:23Z", "content": "Three cars and many bikes have been destroyed by the bus in the accident.\r\nKanpur: At least five people have been killed and several injured after an electric bus lost control and mowed down several … [+1001 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Urges North Korea To Join Direct Talks After Missile Test", "description": "The United States on Sunday made a direct appeal to North Korea to join direct talks with no preconditions about its nuclear and missile programs, after Pyongyang sent a suspected intermediate-range ballistic missile soaring into space.", "url": "https://www.ndtv.com/world-news/us-urges-north-korea-to-join-direct-talks-after-missile-test-2738865", "urlToImage": "https://c.ndtvimg.com/2021-03/jspdl0so_north-korea-us-flag-reuters650_625x300_27_March_21.jpg", "publishedAt": "2022-01-30T22:35:59Z", "content": "US has repeatedly sought talks with North Korea but has been rebuffed each time. (File)\r\nWashington: The United States on Sunday made a direct appeal to North Korea to join direct talks with no preco… [+1505 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "North Korea Says Tested Hwasong-12 Missile, Took Pictures From Space", "description": "North Korea confirmed on Monday it had tested a Hwasong-12 intermediate-range ballistic missile (IRBM) on Sunday, according to state news agency KCNA, the first time a nuclear-capable missile of that size has been launched since 2017.", "url": "https://www.ndtv.com/world-news/north-korea-says-tested-hwasong-12-missile-took-pictures-from-space-2738862", "urlToImage": "https://c.ndtvimg.com/2022-01/iocedn88_north-korea-tested-hwasong12-missile-reuters-650_625x300_31_January_22.jpg", "publishedAt": "2022-01-30T22:30:30Z", "content": "Photos showed space-based images of North Korea and surrounding areas through a round camera lens.\r\nSeoul: North Korea confirmed on Monday it had tested a Hwasong-12 intermediate-range ballistic miss… [+2678 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Congress A Dilapidated Building, May Fall Anytime: UP Minister", "description": "Uttar Pradesh Deputy Chief Minister Dinesh Sharma on Sunday likened the Congress party to a \"dilapidated building\", liable to \"collapse anytime\".", "url": "https://www.ndtv.com/india-news/up-assembly-elections-2022-congress-a-dilapidated-building-may-fall-anytime-up-deputy-chief-minister-dinesh-sharma-2738860", "urlToImage": "https://c.ndtvimg.com/2019-12/13om7kog_dinesh-sharma_625x300_30_December_19.jpg", "publishedAt": "2022-01-30T22:19:01Z", "content": "\"Dynastic politics is rampant in opposition parties,\" UP Deputy Chief Minister Dinesh Sharma said (File)\r\nShahjahanpur: Uttar Pradesh Deputy Chief Minister Dinesh Sharma on Sunday likened the Congres… [+1188 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Taliban Have Killed Scores Of Former Afghan Officials, Others: UN Report", "description": "A U.N. report seen by Reuters says the Taliban and its allies are believed to have killed scores of former Afghan officials, security force members and people who worked with the international military contingent since the U.S.-led pullout.", "url": "https://www.ndtv.com/world-news/taliban-have-killed-scores-of-former-afghan-officials-others-un-report-2738856", "urlToImage": "https://c.ndtvimg.com/2022-01/1tip0e6o_taliban-afp_625x300_17_January_22.jpg", "publishedAt": "2022-01-30T22:05:37Z", "content": "U.N. report says Taliban and its allies are believed to have killed scores of former Afghan officials\r\nWashington: A U.N. report seen by Reuters says the Taliban and its allies are believed to have k… [+1895 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Taliban To Reopen Afghan Public Universities, No Word On Female Students", "description": "Afghanistan's public universities, closed since the Taliban seized power in August, will reopen in February, the Taliban acting higher education minister said on Sunday, without specifying whether female students would be able to return.", "url": "https://www.ndtv.com/world-news/taliban-to-reopen-afghan-public-universities-no-word-on-female-students-2738855", "urlToImage": "https://c.ndtvimg.com/2022-01/s39joc78_taliban-reutersafghanistan-650_625x300_31_January_22.jpg", "publishedAt": "2022-01-30T21:55:19Z", "content": "The hardline group took over the country on August 15 last year as foreign forces withdrew.\r\nKabul: Afghanistan's public universities, closed since the Taliban seized power in August, will reopen in … [+1065 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Joe Biden Demands Taliban To Free Last US Hostage In Afghanistan", "description": "US President Joe Biden called on the Taliban Sunday to \"immediately release\" the man believed to be its last American hostage, withholding any hope of recognizing the militants' rule in Afghanistan until he is free.", "url": "https://www.ndtv.com/world-news/president-joe-biden-demands-taliban-to-free-last-us-hostage-in-afghanistan-2738854", "urlToImage": "https://c.ndtvimg.com/2022-01/dab01s4s_joe-biden-_625x300_28_January_22.jpg", "publishedAt": "2022-01-30T21:46:55Z", "content": "\"Threatening safety of Americans or any innocent civilians is always unacceptable,\" Joe Biden said (File)\r\nWashington: US President Joe Biden called on the Taliban Sunday to \"immediately release\" the… [+2065 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Doctor's 8-Year-Old Son Kidnapped, Killed By His Ex-Employees: UP Cops", "description": "The Bulandshahr police on Sunday recovered the body of an eight-year-old son of a doctor, missing for the last two days.", "url": "https://www.ndtv.com/cities/doctors-8-year-old-son-kidnapped-killed-by-his-ex-employees-in-bulandshahr-up-cops-2738851", "urlToImage": "https://c.ndtvimg.com/2020-08/b07vcmco_up-police-generic_650x400_16_August_20.jpg", "publishedAt": "2022-01-30T21:30:07Z", "content": "The child's father had reported matter to police soon after his son had gone missing (Representational)\r\nBulandshahr: The Bulandshahr police on Sunday recovered the body of an eight-year-old son of a… [+1063 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Navjot Sidhu Did Nothing For People Of His Constituency: Akali Dal Leader", "description": "Former Punjab minister Bikram Singh Majithia on Sunday accused Navjot Singh Sidhu of doing nothing for the people of the Amritsar East constituency from where the state Congress chief is seeking re-election.", "url": "https://www.ndtv.com/india-news/punjab-assembly-elections-2022-navjot-singh-sidhu-did-nothing-for-people-of-his-constituency-shiromani-akali-dal-leader-bikram-singh-majithia-2738848", "urlToImage": "https://c.ndtvimg.com/2020-11/6c27m3o_bikram-majithia-650_625x300_21_November_20.jpg", "publishedAt": "2022-01-30T21:18:18Z", "content": "SAD has fielded Bikram Majithia from Majitha Assembly segment as well as from Amritsar East seat. (File)\r\nMajitha: Former Punjab minister Bikram Singh Majithia on Sunday accused Navjot Singh Sidhu of… [+1259 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Kid With Little Knowledge Of History\": BJP Slams Akhilesh Yadav Ally", "description": "Days after Jayant Chaudhary's terse \"not a coin, won't flip\" response to the BJP's apparent attempt to woo him, Union Minister Dharmendra Pradhan said the Rashtriya Lok Dal chief was a \"kid with little knowledge of history\".", "url": "https://www.ndtv.com/india-news/up-assembly-elections-2022-kid-with-little-knowledge-of-history-union-minister-dharmendra-pradhan-slams-akhilesh-yadav-ally-rashtriya-lok-dal-chief-ja-2738844", "urlToImage": "https://c.ndtvimg.com/2022-01/vb4j048o_dharmendra-pradhan_625x300_15_January_22.jpg", "publishedAt": "2022-01-30T21:00:43Z", "content": "Jayant Chaudhary has just entered field and is not aware of ground realities: Dharmendra Pradhan (File)\r\nAgra: Days after Jayant Chaudhary's terse \"not a coin, won't flip\" response to the BJP's appar… [+2449 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Akhilesh Yadav As Chief Minister Sided With Terrorism, Alleges BJP Chief", "description": "BJP national president JP Nadda on Sunday alleged that Akhilesh Yadav, as chief minister, had withdrawn cases against those accused of attacking a CRPF camp in Uttar Pradesh's Rampur in 2008.", "url": "https://www.ndtv.com/india-news/up-assembly-elections-2022-akhilesh-yadav-has-sided-with-terrorism-alleges-bjp-chief-jp-nadda-2738840", "urlToImage": "https://c.ndtvimg.com/2021-10/2bt60t3g_jp-nadda-in-national-office-bearers-meeting_625x300_18_October_21.jpg", "publishedAt": "2022-01-30T20:38:59Z", "content": "JP Nadda also wondered why rivals of the BJP like leaders of other countries instead of India. (File)\r\nFirozabad/Hathras: BJP national president JP Nadda on Sunday alleged that Akhilesh Yadav, as chi… [+3769 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Opposition Likely To Raise Pegasus, Farmers' Issues In Budget Session", "description": "Opposition parties are likely to raise the Pegasus snooping allegations, farmers' issues and the border row with China in the Budget session of Parliament which is starting from today.", "url": "https://www.ndtv.com/india-news/opposition-likely-to-raise-pegasus-farmers-issues-in-budget-session-2738814", "urlToImage": "https://c.ndtvimg.com/2019-07/rtvrrj68_parliament-generic-pti_625x300_23_July_19.jpg", "publishedAt": "2022-01-30T20:26:58Z", "content": "The Budget session is being held in the shadow of the third wave of the COVID-19 pandemic (File)\r\nNew Delhi: Opposition parties are likely to raise the Pegasus snooping allegations, farmers' issues a… [+4839 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Personal Tragedies Turned Them Into Road Safety Crusaders", "description": "Raghvendra Kumar, a resident of Madhubani in Bihar, sold his ancestral land so that he could distribute over 50,000 helmets among those who ride two wheelers without the protective gear.", "url": "https://www.ndtv.com/india-news/personal-tragedies-turned-them-into-road-safety-crusaders-2738810", "urlToImage": "https://c.ndtvimg.com/2021-01/kfovj4no_indoredancingcop650_625x300_18_January_21.jpg", "publishedAt": "2022-01-30T20:17:34Z", "content": "Ranjeet Singh, a traffic cop has been using late pop icon Michael Jackson's 'moonwalk' to control traffic\r\nNew Delhi: Raghvendra Kumar, a resident of Madhubani in Bihar, sold his ancestral land so th… [+3430 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "2,300 Kg Ganja Seized From Truck In Assam, 2 Arrested: Police", "description": "Ganja weighing 2,300 kg was seized from a truck in Assam's Karimganj district near the interstate border with Tripura, police said.", "url": "https://www.ndtv.com/india-news/2-300-kg-ganja-seized-from-truck-in-assam-2-arrested-police-2738805", "urlToImage": "https://c.ndtvimg.com/2022-01/o7e267lg_2300-kg-ganja-seized-from-truck-in-assam-650_625x300_31_January_22.jpg", "publishedAt": "2022-01-30T20:04:13Z", "content": "Chief Minister Himanta Biswa Sarma complimented the police for the drugs haul.\r\nGuwahati: Ganja weighing 2,300 kg was seized from a truck in Assam's Karimganj district near the interstate border with… [+937 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "TV Actor Tejasswi Prakash Is The Winner Of Big Boss 15", "description": "TV star Tejasswi Prakash on Saturday beat actor-model Pratik Sehajpal to emerge as the winner of reality show \"Bigg Boss\" season 15.", "url": "https://www.ndtv.com/india-news/tv-actor-tejasswi-prakash-is-the-winner-of-big-boss-15-2738791", "urlToImage": "https://c.ndtvimg.com/2022-01/lkc8eqng_tejasswi-prakash-big-boss-winner-650temporary-do-not-use_625x300_31_January_22.jpeg", "publishedAt": "2022-01-30T19:33:33Z", "content": "Tejasswi Prakash entered the show as a title favourite, courtesy her popularity as a TV star.\r\nMumbai: TV star Tejasswi Prakash on Saturday beat actor-model Pratik Sehajpal to emerge as the winner of… [+1893 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Clash During Assam Eviction Drive, Police Use Tear Gas", "description": "Locals clashed with police during an eviction drive in Assam's Karbi Anglong district near the inter-state border with Nagaland on Sunday, officials said.", "url": "https://www.ndtv.com/cities/assam-clash-during-karbi-anglong-eviction-drive-police-use-tear-gas-2738569", "urlToImage": "https://c.ndtvimg.com/2020-01/7qbdof68_assam-police-generic-pti-_625x300_26_January_20.jpg", "publishedAt": "2022-01-30T18:13:20Z", "content": "Assam clash: Two policemen received minor injuries in the clash, officials said. (Representational)\r\nDiphu (Assam): Locals clashed with police during an eviction drive in Assam's Karbi Anglong distri… [+1660 chars]"}]}