{"status": "ok", "totalResults": 283, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "India, Pakistan Have A Lot To Gain From Mutually Beneficial Trade: Pak PM", "description": "Pakistan Prime Minister Shehbaz Sharif has said that Islamabad is looking to forge partnerships for its geo-economics strategy, especially within the region, which apparently includes New Delhi.", "url": "https://www.ndtv.com/world-news/india-pakistan-have-a-lot-to-gain-from-mutually-beneficial-trade-pak-pm-shehbaz-sharif-3027524", "urlToImage": "https://c.ndtvimg.com/vl3o3ykk3h_shehbaz-sharif-afp-_625x300.jpg", "publishedAt": "2022-05-31T22:25:57Z", "content": "Pakistan PM Shehbaz Sharif arrived in Turkey on Tuesday for a three-day official visit.\r\nIslamabad: Pakistan Prime Minister Shehbaz Sharif has said that Islamabad is looking to forge partnerships for… [+2021 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Iran Says UN Nuclear Watchdog Report On Undeclared Sites \"Not Fair\"", "description": "Iran condemned as \"not fair\" Tuesday a report by the UN nuclear watchdog on traces of nuclear material found at three undeclared sites.", "url": "https://www.ndtv.com/world-news/iran-says-un-nuclear-watchdog-report-on-undeclared-sites-not-fair-3027521", "urlToImage": "https://c.ndtvimg.com/2019-05/6c7epapg_iran-flag-reuters-650_625x300_20_May_19.jpg", "publishedAt": "2022-05-31T22:06:38Z", "content": "Iran said that UN Nuclear Watchdog's report is not a fair and balanced.\r\nTehran: Iran condemned as \"not fair\" Tuesday a report by the UN nuclear watchdog on traces of nuclear material found at three … [+4387 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine Reports 'Shutdown Of All Communications' In Russian-Occupied Kherson", "description": "Ukrainian officials are reporting a \"shutdown of all communications\" in the Russian-occupied southern region of Kherson.", "url": "https://www.ndtv.com/world-news/ukraine-reports-shutdown-of-all-communications-in-russian-occupied-kherson-3027518", "urlToImage": "https://c.ndtvimg.com/2022-05/csd36oq_russia-ukraine-war-donbas-_625x300_29_May_22.jpg", "publishedAt": "2022-05-31T21:45:45Z", "content": "Ukraine war: Mobile communication and the Internet blocked in Kherson region, Ukraine offical said.\r\nKyiv: Ukrainian officials are reporting a \"shutdown of all communications\" in the Russian-occupied… [+655 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "From Sonu Nigam To Shreya Ghoshal, Music Industry Mourns KK's Sudden Demise", "description": "Several celebrities from the Indian music industry paid heartfelt tributes to Krishnakumar Kunnath, better known as KK, after the demise of the popular playback singer.", "url": "https://www.ndtv.com/india-news/singer-kk-dies-from-sonu-nigam-to-shreya-ghoshal-music-industry-mourns-singers-sudden-demise-3027513", "urlToImage": "https://c.ndtvimg.com/2022-06/br4rbbeg_singer-kk_625x300_01_June_22.jpg", "publishedAt": "2022-05-31T21:26:22Z", "content": "KK, who was just 54 years old, is survived by his wife and two children.\r\nMumbai: Several celebrities from the Indian music industry paid heartfelt tributes to Krishnakumar Kunnath, better known as K… [+2493 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "1 Killed, 2 Injured In Shooting At US High School: Police", "description": "An elderly woman was killed and two other persons were injured when gunfire erupted at a high school graduation ceremony in New Orleans on Tuesday (local time).", "url": "https://www.ndtv.com/world-news/us-1-killed-2-injured-in-shooting-at-high-school-in-new-orleans-3027504", "urlToImage": "https://c.ndtvimg.com/2018-09/hms9qqjc_us-police-generic_625x300_14_September_18.jpg", "publishedAt": "2022-05-31T21:00:19Z", "content": "New Orleans incident happened days after Texas school shooting which killed 21 people. (Representational)\r\nNew Orleans: An elderly woman was killed and two other persons were injured when gunfire eru… [+733 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Hails EU's Russian Oil Ban, Urges Long-Term Effort", "description": "The United States on Tuesday hailed a European Union decision to scale back Russian oil imports and called for long-term efforts to further reduce dependence on Moscow.", "url": "https://www.ndtv.com/world-news/us-hails-eus-russian-oil-ban-urges-long-term-effort-3027461", "urlToImage": "https://c.ndtvimg.com/2021-07/7arkdhhk_ned-price_625x300_02_July_21.jpg", "publishedAt": "2022-05-31T20:02:20Z", "content": "Ukraine war: EU leaders on Monday agreed to ban more than two-thirds of Russian oil imports.\r\nWashington: The United States on Tuesday hailed a European Union decision to scale back Russian oil impor… [+1451 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Over 69% Voter Turnout In Odisha's Brajrajnagar Assembly Bypoll: Official", "description": "Over 69 per cent polling was registered in the by-election to Brajrajnagar assembly segment in Odisha's Jharsuguda district, where voting was largely \"incident-free\" on Tuesday, Chief Electoral Officer SK Lohani said.", "url": "https://www.ndtv.com/india-news/over-69-voter-turnout-in-odishas-brajrajnagar-assembly-bypoll-official-3027452", "urlToImage": "https://c.ndtvimg.com/2020-11/mpbfnv4_election-generic-afp650_625x300_02_November_20.jpg", "publishedAt": "2022-05-31T19:35:17Z", "content": "Odisha Bypoll: The elections were conducted amid strict adherence to Covid norms, official said.\r\nBhubaneswar: Over 69 per cent polling was registered in the by-election to Brajrajnagar assembly segm… [+1843 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Closes In On Key City Of Ukraine As EU Agrees On Partial Oil Ban", "description": "Russian forces now control \"most\" of eastern Ukraine's key city of Severodonetsk, a regional governor said Tuesday, while EU leaders were split over banning gas from Moscow after agreeing to embargo most of its oil.", "url": "https://www.ndtv.com/world-news/russia-inches-closer-to-capture-severodonetsk-in-eastern-ukraine-3027432", "urlToImage": "https://c.ndtvimg.com/2022-05/6boe0isg_severodonetsk-russia-ukraine-war-afp_625x300_19_May_22.jpg", "publishedAt": "2022-05-31T19:22:36Z", "content": "Ukraine war: The local governor said \"90 percent\" of Severodonetsk had been destroyed by Russian army.\r\nKyiv: Russian forces now control \"most\" of eastern Ukraine's key city of Severodonetsk, a regio… [+5213 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Bombing In Myanmar's Commercial Hub Kills 1, Injures 9", "description": "A bomb blast in a busy neighbourhood of Myanmar's commercial hub Yangon killed one person and injured nine others on Tuesday, police and junta authorities said.", "url": "https://www.ndtv.com/world-news/bombing-in-myanmars-commercial-hub-kills-1-injures-9-3027424", "urlToImage": "https://c.ndtvimg.com/2022-06/46ebdo38_myanmar-blast_625x300_01_June_22.jpg", "publishedAt": "2022-05-31T19:15:33Z", "content": "Myanmar Blast: The blast came from a \"homemade mine\".\r\nA bomb blast in a busy neighbourhood of Myanmar's commercial hub Yangon killed one person and injured nine others on Tuesday, police and junta a… [+2492 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "German Regulator Warns Banks Over Possible Cyber Attacks", "description": "The German financial regulator BaFin on Tuesday issued a fresh warning to the nation's financial sector of the increased danger of cyber attacks.", "url": "https://www.ndtv.com/world-news/german-regulator-warns-banks-over-possible-cyber-attacks-3026649", "urlToImage": "https://c.ndtvimg.com/2022-04/hc7as9jg_cyber-attack_625x300_07_April_22.jpg", "publishedAt": "2022-05-31T19:12:03Z", "content": "German financial regulator BaFin issued a warning on cyber attacks. (Representational)\r\nFRANKFURT: The German financial regulator BaFin on Tuesday issued a fresh warning to the nation's financial sec… [+130 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine Identifies Over 15,000 War Crime Cases Since Russia Invasion", "description": "Ukraine has identified several thousand suspected war crimes in the eastern Donbas region where Russian forces are pressing their offensive, Kyiv's chief prosecutor said Tuesday.", "url": "https://www.ndtv.com/world-news/ukraine-identifies-over-15-000-war-crime-cases-since-russia-invasion-3027422", "urlToImage": "https://c.ndtvimg.com/2022-05/csd36oq_russia-ukraine-war-donbas-_625x300_29_May_22.jpg", "publishedAt": "2022-05-31T19:09:59Z", "content": "Russia-Ukraine War: Ukraine had identified 15,000 war crimes cases since the Russian invasion.\r\nKyiv: Ukraine has identified several thousand suspected war crimes in the eastern Donbas region where R… [+3018 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Germany's Help To Ukraine Amid Russia War: Soviet Weapons", "description": "Germany will deliver infantry fighting vehicles (IFV) to Greece so that the government in Athens can pass on Soviet-style weapons to Ukraine, German Chancellor Olaf Scholz said on Tuesday.", "url": "https://www.ndtv.com/world-news/germanys-help-to-ukraine-amid-russia-war-soviet-weapons-3026583", "urlToImage": "https://c.ndtvimg.com/2022-05/fc0jpgg_russia-ukraine-war-afp_625x300_31_May_22.jpg", "publishedAt": "2022-05-31T19:05:15Z", "content": "Germany has been criticized for dragging its feet on heavy arms deliveries to Kyiv.\r\nBrussels: Germany will deliver infantry fighting vehicles (IFV) to Greece so that the government in Athens can pas… [+620 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Don't Rule Out Anything: France's Macron On EU Sanctions On Russia", "description": "French President Emmanuel Macron said that following a sixth European Union package of sanctions against Russia nothing could be ruled out in terms of additional sanctions in the coming weeks.", "url": "https://www.ndtv.com/world-news/dont-rule-out-anything-frances-macron-on-eu-sanctions-on-russia-3026502", "urlToImage": "https://c.ndtvimg.com/2022-05/vf1vsh44_macron-afp_625x300_31_May_22.jpg", "publishedAt": "2022-05-31T18:59:51Z", "content": "French President Macron said nothing could be ruled out in terms of sanctions.\r\nParis: French President Emmanuel Macron said that following a sixth European Union package of sanctions against Russia … [+366 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "KK Dies At 53: The Versatile Singer's Top 10 Songs", "description": "Singer KK died hours after a concert performance in Kolkata. The 54-year-old singer fell ill while performing and was brought to the hospital, where he was declared dead.", "url": "https://www.ndtv.com/india-news/singer-kks-death-singer-kk-dies-at-53-top-10-songs-3027412", "urlToImage": "https://c.ndtvimg.com/2022-06/br4rbbeg_singer-kk_625x300_01_June_22.jpg", "publishedAt": "2022-05-31T18:55:50Z", "content": "Singer KK's Death: Singer KK died hours after a concert performance in Kolkata.\r\nNew Delhi: Singer KK died hours after a concert performance in Kolkata. The 54-year-old singer fell ill while performi… [+764 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Struck A Chord With People Of All Age Groups\": PM's Tribute To Singer KK", "description": "Popular singer Krishnakumar Kunnath, popularly known as KK, died hours after his concert in Kolkata on Tuesday. He was 53.  \"We will always remember him through his songs,\" tweeted Prime Minister Narendra Modi.", "url": "https://www.ndtv.com/india-news/singer-kk-dies-in-kolkata-his-songs-reflected-wide-range-of-emotions-pms-tribute-to-singer-kk-3027386", "urlToImage": "https://c.ndtvimg.com/2022-06/e72nj848_singer-kk-koo-650_650x400_01_June_22.jpg", "publishedAt": "2022-05-31T18:36:58Z", "content": "Kolkata: Popular singer Krishnakumar Kunnath, popularly known as KK, died hours after his concert in Kolkata on Tuesday. He was 53.  \"We will always remember him through his songs,\" tweeted Prime Min… [+1909 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ishwar Singh Appointed As Punjab's Additional Director General Of Police", "description": "The Punjab government on Tuesday appointed senior police officer Ishwar Singh as the additional director general of police (law and order), a week after it shifted Naresh Kumar from the post.", "url": "https://www.ndtv.com/india-news/ishwar-singh-appointed-as-punjabs-additional-director-general-of-police-3027384", "urlToImage": "https://c.ndtvimg.com/2022-06/8jh8j9f8_police-generic-_625x300_01_June_22.jpg", "publishedAt": "2022-05-31T18:36:48Z", "content": "Punjab government appointed 1993-batch IPS officer Varinder Kumar to fill in Mr Singh's position.\r\nChandigarh: The Punjab government on Tuesday appointed senior police officer Ishwar Singh as the add… [+631 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Rashi Hardaha", "title": "IGNOU Admission 2022: Registration For July Session Begins", "description": "IGNOU July Admission 2022: Learners who want to take admission to the open university can register themselves on the official website – ignouadmission.samarth.edu.in. The last date to register for the IGNOU July 2022 session is July 31.", "url": "https://www.ndtv.com/education/ignou-admission-2022-registration-for-july-session-begins-ignouadmission-samarth-edu-in", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/5/31/shutterstock_2032476104_1DXgRmj.jpg", "publishedAt": "2022-05-31T18:20:56Z", "content": "IGNOU Admission 2022: The fresh registration for admission to various undergraduate (UG) and postgraduate (PG) courses offered by the Indira Gandhi National Open University (IGNOU) for the July 2022 … [+1156 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Singer KK Dies After Performing At Concert In Kolkata", "description": "Singer KK died hours after a concert in Kolkata today. His official Instagram page has visuals of a concert in a Kolkata auditorium held some 10 hours ago.", "url": "https://www.ndtv.com/india-news/singer-kk-dies-while-performing-in-kolkata-3027335", "urlToImage": "https://c.ndtvimg.com/2022-05/51i6p9fg_singer-kk-insta-650_650x400_31_May_22.jpg", "publishedAt": "2022-05-31T18:09:56Z", "content": "Singer KK was brought dead to CMRI, the hospital told NDTV\r\nKolkata: Singer KK died hours after a concert in Kolkata today. His official Instagram page has visuals of a concert in a Kolkata auditoriu… [+1567 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Nepal Tightens Rules For Flights After Deadly Plane Crash", "description": "Nepal on Tuesday tightened flight permit rules for airlines by making it mandatory to have clear weather throughout the route, after a preliminary investigation indicated that bad weather was the main cause of Sunday's plane crash.", "url": "https://www.ndtv.com/world-news/nepal-tightens-rules-for-flights-after-deadly-plane-crash-3027307", "urlToImage": "https://c.ndtvimg.com/2022-05/s7u0082_nepal-plane-crash-pti_625x300_30_May_22.jpg", "publishedAt": "2022-05-31T17:52:23Z", "content": "The new provision is applicable to all flights following the Visual Flight Rules.\r\nKathmandu: Nepal on Tuesday tightened flight permit rules for airlines by making it mandatory to have clear weather … [+2740 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Supreme Court Directs NIOS To Fix Exam centres Within 10 Kms", "description": "The Supreme Court has directed the NIOS to fix the examination centres within a distance of 10 kilometres from the accredited institutions.", "url": "https://www.ndtv.com/education/supreme-court-directs-nios-to-fix-exam-centres-within-10-kms-from-accredited-institutions", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/5/31/shutterstock_776326447_cQxgXck.jpg", "publishedAt": "2022-05-31T17:51:47Z", "content": "New Delhi:The Supreme Court has directed the National Institute of Open Schooling (NIOS) to fix the examination centres within a distance of 10 kilometres from the accredited institutions to enable s… [+3859 chars]"}]}