{"status": "ok", "totalResults": 197, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Texas Lawmakers Slam \"Lackadaisical\" Police Response To School Shooting", "description": "Texas state lawmakers on Sunday slammed law enforcement's slow response to the shooting in Uvalde, where a gunman killed 19 children and two teachers, saying more decisive action could have saved lives.", "url": "https://www.ndtv.com/world-news/texas-lawmakers-slam-lackadaisical-police-response-to-school-shooting-3167498", "urlToImage": "https://c.ndtvimg.com/2022-05/12839lqo_texas-school-shooting_625x300_29_May_22.jpg", "publishedAt": "2022-07-17T22:28:11Z", "content": "73 minutes elapsed between the first officers' arrival and the shooter's death.\r\nWashington: Texas state lawmakers on Sunday slammed law enforcement's slow response to the shooting in Uvalde, where a… [+2661 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Prepares For Next Ukraine Offensive In Face Of New Western Weapons", "description": "Russia is preparing for the next stage of its offensive in Ukraine, a Ukrainian military official said, after Moscow said its forces would step up military operations in \"all operational areas\".", "url": "https://www.ndtv.com/world-news/russia-prepares-for-next-ukraine-offensive-in-face-of-new-western-weapons-3167493", "urlToImage": "https://c.ndtvimg.com/2022-05/fc0jpgg_russia-ukraine-war-afp_625x300_31_May_22.jpg", "publishedAt": "2022-07-17T22:01:56Z", "content": "Ukrainian military said Russia appeared to be preparing an offensive toward Sloviansk\r\nKyiv: Russia is preparing for the next stage of its offensive in Ukraine, a Ukrainian military official said, af… [+5325 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Original BJP Not Running Karnataka Government: DK Shivakumar", "description": "Karnataka Congress president DK Shivakumar on Sunday said that the state has a coalition government and it is not being run by those from the \"original BJP\".", "url": "https://www.ndtv.com/karnataka-news/original-bjp-not-running-karnataka-government-dk-shivakumar-3167488", "urlToImage": "https://c.ndtvimg.com/2022-03/93mqb1lo_dk-shivakumar-ndtv-650_650x400_11_March_22.jpg", "publishedAt": "2022-07-17T21:44:14Z", "content": "DK Shivakumar claimed that there were a lot of issues within the ruling party.\r\nBengaluru: Karnataka Congress president DK Shivakumar on Sunday said that the state has a coalition government and it i… [+1530 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russian Journalist Who Protested Ukraine War On Live TV Detained", "description": "Russian police on Sunday detained journalist Marina Ovsyannikova, who in March interrupted a live TV broadcast to denounce the military action in Ukraine, her lawyer said.", "url": "https://www.ndtv.com/world-news/russian-journalist-who-protested-ukraine-war-on-live-tv-detained-3167486", "urlToImage": "https://c.ndtvimg.com/2022-05/dh4ebmoo_vladimir-putin-reuters_625x300_15_May_22.jpg", "publishedAt": "2022-07-17T21:28:46Z", "content": "Russian President Vladimir launched an invasion of Ukraine in March earlier this year.\r\nMoscow: Russian police on Sunday detained journalist Marina Ovsyannikova, who in March interrupted a live TV br… [+330 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Iran Technically Capable Of Building Nuclear Bomb: Report", "description": "Iran has the technical capacity to build a nuclear weapon but has not taken a decision to do so, an official told the Al Jazeera broadcaster on Sunday.", "url": "https://www.ndtv.com/world-news/iran-technically-capable-of-building-nuclear-bomb-report-3167481", "urlToImage": "https://c.ndtvimg.com/2021-08/o7opm26k_ebrahim-raisi-afp-650_625x300_06_August_21.jpg", "publishedAt": "2022-07-17T21:13:33Z", "content": "Tehran has \"not made a decision to build an atomic bomb\", the report adds.\r\nTehran: Iran has the technical capacity to build a nuclear weapon but has not taken a decision to do so, an official told t… [+2763 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Joe Biden Dismisses Saudi Arabia's Account Of Jamal Khashoggi's Murder", "description": "US President Joe Biden on Saturday differed with Saudi Arabia in their account of discussions at a bilateral summit about the 2018 murder of Saudi journalist Jamal Khashoggi, a major point of contention between the two countries.", "url": "https://www.ndtv.com/world-news/joe-biden-dismisses-saudi-arabias-account-of-jamal-khashoggis-murder-3167471", "urlToImage": "https://c.ndtvimg.com/2022-07/kiq0kojo_biden-saudi-arabia_625x300_17_July_22.jpg", "publishedAt": "2022-07-17T20:53:20Z", "content": "Jamal Khashoggi had been living in self-imposed exile in Virginia.\r\nUS President Joe Biden on Saturday differed with Saudi Arabia in their account of discussions at a bilateral summit about the 2018 … [+1745 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UK Prime Minister Contenders Clash Over Tax Cuts In Television Debate", "description": "The five Conservative contenders still vying to be Britain's next prime minister clashed over tax cuts in a second televised debate on Sunday, with the two frontrunners - Rishi Sunak and Liz Truss - stepping up their battle on the economy.", "url": "https://www.ndtv.com/world-news/uk-prime-minister-contenders-clash-over-tax-cuts-in-television-debate-3167470", "urlToImage": "https://c.ndtvimg.com/2022-07/0t9s8pq8_rishi-sunak_625x300_16_July_22.jpg", "publishedAt": "2022-07-17T20:40:01Z", "content": "Ex-finance minister Rishi Sunak has emerged as the favourite among 358 Conservative lawmakers.\r\nLondon: The five Conservative contenders still vying to be Britain's next prime minister clashed over t… [+3034 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Climate Change Affects Everyone\": Europe Fights Wildfires In Searing Heat", "description": "Authorities across southern Europe battled on Sunday to control huge wildfires in countries including Spain, Greece and France, with hundreds of deaths blamed on soaring temperatures that scientists say are consistent with climate change.", "url": "https://www.ndtv.com/world-news/climate-change-affects-everyone-europe-fights-wildfires-in-searing-heat-3167441", "urlToImage": "https://c.ndtvimg.com/2022-07/9926dlhg_europe-wildfire_625x300_16_July_22.jpg", "publishedAt": "2022-07-17T20:17:24Z", "content": "More than 1,000 deaths have been attributed to the nearly week-long heatwave in Portugal and Spain.\r\nJerte (Spain): Authorities across southern Europe battled on Sunday to control huge wildfires in c… [+3982 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine's Volodymyr Zelensky Fires Security Chief, Prosecutor General", "description": "Ukraine's President Volodymyr Zelensky issued executive orders late on Sunday dismissing the State Security Service head and the Prosecutor General.", "url": "https://www.ndtv.com/world-news/ukraines-volodymyr-zelensky-fires-security-chief-prosecutor-general-3167437", "urlToImage": "https://c.ndtvimg.com/2022-06/kjvk90ns_zelensky-afp_625x300_06_June_22.jpg", "publishedAt": "2022-07-17T20:07:53Z", "content": "No reason was immediately given for the sackings.\r\nKyiv: Ukraine's President Volodymyr Zelensky issued executive orders late on Sunday dismissing the State Security Service head and the Prosecutor Ge… [+422 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Amid Turmoil, Imran Khan's Party Wins Punjab Bypolls", "description": "Pakistan Tehreek-e-Insaf (PTI) has won the by-elections on Punjab Assembly seats which were held on Sunday.", "url": "https://www.ndtv.com/world-news/amid-turmoil-imran-khans-party-wins-punjab-bypolls-3167420", "urlToImage": "https://c.ndtvimg.com/2022-05/mtk5q5n_imran-khan-afp_625x300_24_May_22.jpg", "publishedAt": "2022-07-17T19:37:10Z", "content": "The polling began at 8 am and continued till 5 pm but in several districts.\r\nPunjab: Pakistan Tehreek-e-Insaf (PTI) has won the by-elections on Punjab Assembly seats which were held on Sunday.\r\nPakis… [+2404 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Journalist Detained By Intelligence Services In Congo: Report", "description": "The Democratic Republic of Congo's intelligence service has detained US journalist Stavros Nicolas Niarchos after he allegedly approached armed groups in the country's southeast, a senior government official said Sunday.", "url": "https://www.ndtv.com/world-news/us-journalist-detained-by-intelligence-services-in-congo-report-3167408", "urlToImage": "https://i.ndtvimg.com/i/2017-07/handcuff-stockshot-650_650x400_41500981444.jpg", "publishedAt": "2022-07-17T19:20:52Z", "content": "Niarchos travelled to the DRC to report on nature conservation, the economy and culture.\r\nKinhasa (Congo): The Democratic Republic of Congo's intelligence service has detained US journalist Stavros N… [+1609 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Took All Possible Steps To Address Crisis\": Sri Lanka's Rajapaksa", "description": "Sri Lanka's ousted president, who fled overseas this week to escape a popular uprising against his government, has said he took \"all possible steps\" to avert the economic crisis that has engulfed the island nation.", "url": "https://www.ndtv.com/world-news/took-all-possible-steps-to-address-crisis-sri-lankas-rajapaksa-3167401", "urlToImage": "https://c.ndtvimg.com/2022-07/67hn949o_gotabaya-rajapaksa-sri-lanka-reuters-650_625x300_13_July_22.jpg", "publishedAt": "2022-07-17T19:07:58Z", "content": "Gotabaya Rajapaksa's resignation was accepted by parliament on Friday.\r\nColombo: Sri Lanka's ousted president, who fled overseas this week to escape a popular uprising against his government, has sai… [+3737 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Woman Fakes Kidnapping In India After Running Out Of Money: Police", "description": "A 27-year-old US citizen staying here allegedly staged her own kidnapping after she ran out of money in an attempt to extort cash from her parents, police said on Sunday.", "url": "https://www.ndtv.com/india-news/us-woman-fakes-kidnapping-in-india-after-running-out-of-money-police-3167399", "urlToImage": "https://c.ndtvimg.com/2019-05/fkcrjpmg_delhi-police-generic_625x300_27_May_19.jpg", "publishedAt": "2022-07-17T18:56:13Z", "content": "The US citizen's father is an ex-army officer.\r\nNew Delhi: A 27-year-old US citizen staying here allegedly staged her own kidnapping after she ran out of money in an attempt to extort cash from her p… [+3029 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Amid Crisis, Sri Lanka Lowers Fuel Prices, 1st Decrease Since February", "description": "Sri Lanka's state-run Ceylon Petroleum Corporation (CPC) on Sunday reduced the diesel and petrol retail prices, the first decrease after five hikes since February.", "url": "https://www.ndtv.com/world-news/amid-crisis-sri-lanka-lowers-fuel-prices-1st-decrease-since-february-3167386", "urlToImage": "https://c.ndtvimg.com/2022-07/9nvbv8l_sri-lanka-protestors-buildings_625x300_14_July_22.jpg", "publishedAt": "2022-07-17T18:48:44Z", "content": "The new prices will be effective from 10.00 pm on Sunday.\r\nColombo: Sri Lanka's state-run Ceylon Petroleum Corporation (CPC) on Sunday reduced the diesel and petrol retail prices, the first decrease … [+2233 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Shiv Sena To Support Opposition's Vice Presidential Candidate: Sanjay Raut", "description": "Shiv Sena MP Sanjay Raut on Sunday said the party will support the opposition's Vice Presidential candidate Margaret Alva.", "url": "https://www.ndtv.com/india-news/shiv-sena-to-support-oppositions-vice-presidential-candidate-sanjay-raut-3167381", "urlToImage": "https://c.ndtvimg.com/2022-07/4oebfmvg_sanjay-raut-pti-650_650x400_01_July_22.jpg", "publishedAt": "2022-07-17T18:44:34Z", "content": "The last date for filing of nominations for the VP election is July 19.\r\nNew Delhi: Shiv Sena MP Sanjay Raut on Sunday said the party will support the opposition's Vice Presidential candidate Margare… [+2735 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "High Court Refuses To Dismiss Case Against Man For Remarks On PM, Others", "description": "The Allahabad High Court has dismissed a petition of a person to quash an FIR registered against him for allegedly making derogatory remarks against Prime Minister Narendra Modi, Union Home Minister Amit Shah and other central ministers.", "url": "https://www.ndtv.com/india-news/high-court-refuses-to-dismiss-case-against-man-for-remarks-on-pm-modi-amit-shah-3167376", "urlToImage": "https://i.ndtvimg.com/i/2017-11/modi-shah-bjp-central-election-committee-pti_650x400_81510916053.jpg", "publishedAt": "2022-07-17T18:36:53Z", "content": "The case was registered at a police station Meerganj in Jaunpur district.\r\nPrayagraj (UP): The Allahabad High Court has dismissed a petition of a person to quash an FIR registered against him for all… [+1503 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "\"Will Remember For The Rest Of My Life\": Rishabh Pant On Ton vs England", "description": "Rishabh Pant scored 125* off 113 balls to help India beat England by five wickets in the series-deciding third ODI", "url": "https://sports.ndtv.com/england-vs-india-2022/will-remember-for-the-rest-of-my-life-rishabh-pant-after-guiding-india-to-series-win-vs-england-3167371", "urlToImage": "https://c.ndtvimg.com/2022-07/4s0qjd3_rishabh-pant_625x300_17_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-17T18:30:03Z", "content": "India captain Rohit Sharma on Sunday acknowledged that there are \"some solid guys\" waiting in the wings but said his team will need to improve further moving ahead. Chasing 260 to win the series-deci… [+3405 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Former Kerala Minister Thomas Isaac Issued Notice By Probe Agency", "description": "The Enforcement Directorate (ED) has served notice to senior CPI(M) leader Thomas Isaac seeking his appearance before it in connection with its probe into alleged violations in the financial dealings of KIIFB when he was the Kerala Finance Minister.", "url": "https://www.ndtv.com/kerala-news/former-kerala-minister-thomas-isaac-issued-notice-by-probe-agency-3167368", "urlToImage": "https://c.ndtvimg.com/2021-01/n860a1j8_thomas-isaac-_625x300_15_January_21.jpg", "publishedAt": "2022-07-17T18:28:07Z", "content": "Mr Isaac said he has not received any such notices from the Enforcement Directorate.\r\nThiruvananthapuram: The Enforcement Directorate (ED) has served notice to senior CPI(M) leader Thomas Isaac seeki… [+1382 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Har Ghar Tiranga Campaign: Tricolour To Be Hoisted Atop 20 Crore Homes", "description": "The tricolour will be hoisted atop more than 20 crore houses across the country for three days next month under the central government's 'Har Ghar Tiranga' campaign, according to an official statement.", "url": "https://www.ndtv.com/india-news/har-ghar-tiranga-campaign-tricolour-to-be-hoisted-over-20-crore-homes-3167364", "urlToImage": "https://i.ndtvimg.com/i/2016-05/tricolour-650_650x400_81463935663.jpg", "publishedAt": "2022-07-17T18:24:01Z", "content": "People should also take a selfie with the tricolour and upload it, Amit Shah said.\r\nNew Delhi: The tricolour will be hoisted atop more than 20 crore houses across the country for three days next mont… [+3152 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "After 70 Days, Passenger Train Services To Resume In Parts Of North-East", "description": "After nearly 70 days, the Northeast Frontier Railway (NFR) will resume passenger train services in Lumding-Badarpur section in Assam on July 22.", "url": "https://www.ndtv.com/india-news/after-70-days-passenger-train-services-to-resume-in-parts-of-north-east-3167352", "urlToImage": "https://c.ndtvimg.com/2021-08/1d1cm4ho_train-generic-unsplash-650_625x300_15_August_21.jpg", "publishedAt": "2022-07-17T18:19:28Z", "content": "Landslides and rains since May 13 had damaged railway tracks in parts of north-east (Representational)\r\nGuwahati: After nearly 70 days, the Northeast Frontier Railway (NFR) will resume passenger trai… [+1406 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Do You Think Sanctions On Russia Will Help, Asks Lanka's Acting President", "description": "Sri Lanka's acting President Ranil Wickremesinghe said the sanctions on Russia by the west will not bring the country to its knees but will affect the third world. He asked whether the sanctions on Russia will help the world or not.", "url": "https://www.ndtv.com/world-news/do-you-think-sanctions-on-russia-will-help-asks-sri-lankas-acting-president-ranil-3167299", "urlToImage": "https://c.ndtvimg.com/2022-05/h8lp2a4k_ranil-wickremesinghe-sri-lanka-pm_625x300_13_May_22.jpg", "publishedAt": "2022-07-17T17:55:54Z", "content": "Ranil Wickremesinghe urged all sides to agree to a ceasefire in Russia-Ukraine war. (File)\r\nColombo: Sri Lanka's interim President Ranil Wickremesinghe on Sunday told the West that the sanctions on R… [+3998 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Pant's Unbeaten Century, Hardik's All-Round Heroics Hand India ODI Series", "description": "Rishabh Pant's maiden ODI century and Hardik Pandya's all-round heroics fired India to an emphatic five-wicket win over England in the series-deciding third match here on Sunday", "url": "https://sports.ndtv.com/england-vs-india-2022/india-vs-england-3rd-odi-report-rishabh-pants-unbeaten-century-hardik-pandyas-all-round-heroics-hand-india-odi-series-3167255", "urlToImage": "https://c.ndtvimg.com/2022-07/lkqmuvs_rishabh-pant-hardik-pandya-806_625x300_17_July_22.jpg", "publishedAt": "2022-07-17T17:38:28Z", "content": "Rishabh Pant's maiden ODI century and Hardik Pandya's all-round heroics fired India to an emphatic five-wicket win over England in the series-deciding third match here on Sunday. The visitors claimed… [+4577 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ex Goa Chief Minister Removed As Permanent Invitee To Top Congress Panel", "description": "Former Goa Chief Minister Digambar Kamat was removed as a permanent invitee to the Congress Working Committee with immediate effect, this comes after his alleged role in recent political crisis in Goa Congress.", "url": "https://www.ndtv.com/india-news/ex-goa-chief-minister-digambar-kamat-removed-as-permanent-invitee-to-congress-working-committee-3167247", "urlToImage": "https://c.ndtvimg.com/2019-03/2745r8po_digambar-kamat_625x300_17_March_19.jpg", "publishedAt": "2022-07-17T17:33:03Z", "content": "The Congress's local unit accused Digambar Kamat of conspiring with the BJP\r\nNew Delhi: Congress president Sonia Gandhi on Sunday cracked the whip and removed former Goa chief minister Digambar Kamat… [+1004 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Manipur Governor La Ganesan Given Additional Charge Of Bengal", "description": "President Ram Nath Kovind has accepted the resignation of West Bengal Governor Jagdeep Dhankhar, who has been nominated as the vice president candidate by the National Democratic Alliance (NDA), a Rashtrapati Bhavan communique said.", "url": "https://www.ndtv.com/india-news/manipur-governor-la-ganesan-given-additional-charge-of-bengal-3167231", "urlToImage": "https://c.ndtvimg.com/2022-07/15on54r8_la-ganesan-650_625x300_17_July_22.jpg", "publishedAt": "2022-07-17T17:24:38Z", "content": "New Delhi: President Ram Nath Kovind has accepted the resignation of West Bengal Governor Jagdeep Dhankhar, who has been nominated as the vice president candidate by the National Democratic Alliance … [+749 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "18 Students From Bengal In ICSE Top Three Rank Holders List", "description": "A total of 18 students from West Bengal were among the 110 who figure in the top three rank holders list of the Indian Certificate of Secondary Education (ICSE) exams, the results of which were announced on Sunday.", "url": "https://www.ndtv.com/education/18-students-from-bengal-in-icse-top-three-rank-holders-list", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/16/ICSE-Result-2022.jpg", "publishedAt": "2022-07-17T17:18:04Z", "content": "Kolkata:A total of 18 students from West Bengal were among the 110 who figure in the top three rank holders list of the Indian Certificate of Secondary Education (ICSE) exams, the results of which we… [+1333 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ailing Teen Rescued From Village Cut Off By Flood In Maharashtra: Report", "description": "A 17-year-old boy, who was critically ill and in urgent need of medical treatment, was rescued from a remote village cut off by flood waters in Maharashtra's Chandrapur district in a joint effort by the locals and authorities.", "url": "https://www.ndtv.com/nagpur-news/ailing-teen-rescued-from-remote-village-cut-off-by-flood-in-maharashtras-chandrapur-report-3167209", "urlToImage": "https://c.ndtvimg.com/2021-07/jiser94g_sangli-maharashtra-floods_625x300_26_July_21.jpg", "publishedAt": "2022-07-17T17:12:38Z", "content": "The village with a population of 1,500 was completely cut off dur to flood waters. (Representational)\r\nNagpur: A 17-year-old boy, who was critically ill and in urgent need of medical treatment, was r… [+2710 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "'Har Ghar Tiranga' Programme: Over 3 Crore Flags To Be Hoisted Across UP", "description": "Uttar Pradesh Chief Minister Yogi Adityanath said all the preparations for the upcoming 'Har Ghar Tiranga' programme to mark the 75th Independence Day next month have been completed and 3.18 crore tricolours will be hoisted across the state", "url": "https://www.ndtv.com/india-news/har-ghar-tiranga-programme-over-3-crore-flags-to-be-hoisted-across-up-3167197", "urlToImage": "https://c.ndtvimg.com/indian-flag-tricolour-generic-pixabay_625x300_1529830758454.jpg", "publishedAt": "2022-07-17T17:08:03Z", "content": "Flags will be sent to all district headquarters by July 31. (Representational)\r\nLucknow: Uttar Pradesh Chief Minister Yogi Adityanath on Sunday said all the preparations for the upcoming 'Har Ghar Ti… [+1450 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Help Desks At Airports: How Kerala Stepped Up Monkeypox Surveillance", "description": "Extensive training for doctors and officials of local bodies as well as help desks in all the four international airports in Kerala are some of the latest steps taken by the State government to deal with monkeypox.", "url": "https://www.ndtv.com/kerala-news/help-desks-at-airports-how-kerala-stepped-up-monkeypox-surveillance-3167192", "urlToImage": "https://c.ndtvimg.com/2022-05/iagsqfo_monkeypox-reuters_625x300_28_May_22.jpg", "publishedAt": "2022-07-17T17:07:50Z", "content": "Kerala has stepped up surveillance for any signs of Monkeypox\r\nThiruvananthapuram: Extensive training for doctors and officials of local bodies as well as help desks in all the four international air… [+3459 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Congress Leader Siddaramaiah Says 2023 State Polls Will Be His Last", "description": "Senior Congress leader Siddaramaiah on Sunday strongly reiterated that the 2023 Assembly election would be his last, and that he would not be contesting that poll from Chamundeshwari segment where he had faced defeat in 2018.", "url": "https://www.ndtv.com/india-news/ex-karnataka-chief-minister-siddaramaiah-says-2023-state-polls-will-be-his-last-3167161", "urlToImage": "https://c.ndtvimg.com/2022-06/nfjk8evg_siddaramaiah-twitter_625x300_09_June_22.jpg", "publishedAt": "2022-07-17T16:55:53Z", "content": "Mysuru, Karnataka: Senior Congress leader Siddaramaiah on Sunday strongly reiterated that the 2023 Assembly election would be his last, and that he would not be contesting that poll from Chamundeshwa… [+3041 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Adarsh Srivastava", "title": "AP ICET 2022 Admit Card Tomorrow: Official Website; Steps To Download", "description": "The Andhra University, Visakhapatnam will release the Andhra Pradesh Integrated Common Entrance Test (AP ICET) 2022 admit card tomorrow, July 18.", "url": "https://www.ndtv.com/education/ap-icet-2022-admit-card-tomorrow-official-website-steps-to-download", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/16/AP-ICET-2022-Admit-Card.jpg", "publishedAt": "2022-07-17T16:51:27Z", "content": "New Delhi:AP ICET 2022: The Andhra University, Visakhapatnam will release the Andhra Pradesh Integrated Common Entrance Test (AP ICET) 2022 admit card tomorrow, July 18. The candidates can download t… [+1841 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Venkaiah Naidu Seeks Good Monsoon Session In Rajya Sabha As \"Farewell Gift\"", "description": "Rajya Sabha Chairma Venkaiah Naidu on Sunday while seeking cooperation of all sections of the House, asked for a good monsoon session as a \"farewell gift\" to him, according to sources.", "url": "https://www.ndtv.com/india-news/rajya-sabha-chairman-venkaiah-naidu-seeks-good-monsoon-session-in-rajya-sabha-as-farewell-gift-3167138", "urlToImage": "https://c.ndtvimg.com/2022-07/k6vitmh_venkaiah-naidu-650_625x300_17_July_22.jpg", "publishedAt": "2022-07-17T16:42:20Z", "content": "Vice President met leaders of all parties of the House at his residence on Sunday.\r\nNew Delhi: Rajya Sabha Chairman M Venkaiah Naidu on Sunday while seeking the cooperation of all sections of the Hou… [+3746 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Zimbabwe Beat Netherlands In T20 World Cup Qualifying Final", "description": "Beating the Dutch confirmed Zimbabwe as the dominant team in southern city Bulawayo as they won all five matches, including three in Group A and a semi-final, under new coach Dave Houghton.", "url": "https://sports.ndtv.com/t20-world-cup-2022/zimbabwe-beat-netherlands-in-t20-world-cup-qualifying-final-3167116", "urlToImage": "https://c.ndtvimg.com/2022-07/2i9c52d8_zimabwe_625x300_17_July_22.jpg", "publishedAt": "2022-07-17T16:32:06Z", "content": "Hosts Zimbabwe defeated the Netherlands by 37 runs on Sunday in the final of a Twenty20 World Cup qualifying tournament and will play Ireland, Scotland and the West Indies at the finals. Netherlands … [+1246 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Delhi Man Shot Dead By Friend in Azadpur: Police", "description": "A 23-year-old man was shot dead in Azadpur area allegedly by one of his friend after heated arguments over a minor issue, police said on Sunday.", "url": "https://www.ndtv.com/india-news/delhi-man-shot-dead-by-friend-in-azadpur-police-3167103", "urlToImage": "https://c.ndtvimg.com/2022-04/oqenpoik_delhi-police-generic-jahangirpuri-ani_625x300_26_April_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675?ver-20220701.02", "publishedAt": "2022-07-17T16:28:07Z", "content": "A case under Section 302 (murder) of the Indian Penal Code has been registered.(File)\r\nNew Delhi: A 23-year-old man was shot dead in Azadpur area allegedly by one of his friend after heated arguments… [+1428 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Woman Faked Kidnapping In India To \"Emotionally Blackmail\" Parents", "description": "An American woman faked her own kidnapping in India to \"emotionally blackmail\" her parents in the US, the police said. The Delhi Police solved the case within 24 hours of its registration.", "url": "https://www.ndtv.com/india-news/us-woman-faked-kidnapping-in-india-to-emotionally-blackmail-parents-3167092", "urlToImage": "https://c.ndtvimg.com/2019-05/fkcrjpmg_delhi-police-generic_625x300_27_May_19.jpg", "publishedAt": "2022-07-17T16:24:09Z", "content": "Police also found that her Visa had expired on June 6. (Representational)\r\nNew Delhi: An American woman faked her own kidnapping in India to \"emotionally blackmail\" her parents in the US, the police … [+1660 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Woman Strangled, Dumped Near UP Expressway By Live-In Partner", "description": "A 43-year-old man was arrested for allegedly strangling his live-in partner during a fight over transfer of money to a female neighbour in south Delhi's Govindpuri area, police said on Sunday.", "url": "https://www.ndtv.com/india-news/woman-strangled-dumped-near-up-expressway-by-live-in-partner-3167088", "urlToImage": "https://i.ndtvimg.com/i/2018-03/dead-woman-generic_650x400_81521636166.jpg", "publishedAt": "2022-07-17T16:22:28Z", "content": "The body was dumped near the service lane of the Yamuna Expressway. (Representational)\r\nNew Delhi: A 43-year-old man was arrested for allegedly strangling his live-in partner during a fight over tran… [+2478 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Manchester United Agree Deal With Ajax For Argentina's Lisandro Martinez", "description": "Ajax confirmed United will pay an initial 57 million euros ($57 million, 48 million pounds) with a further 10 million euros in performance-related bonuses.", "url": "https://sports.ndtv.com/football/manchester-united-agree-deal-with-ajax-for-argentinas-lisandro-martinez-3167061", "urlToImage": "https://c.ndtvimg.com/2022-07/2mh2hido_lisandro-martinez-806_625x300_17_July_22.jpg", "publishedAt": "2022-07-17T16:12:20Z", "content": "Argentine international defender Lisandro Martinez is set to become Manchester United's third signing of the transfer window after the English giants agreed a deal with Ajax on Sunday. Ajax confirmed… [+943 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "13-Year-Old Girl Raped By Father In Fatehpur: Police", "description": "A wife has registered a case against her husband for allegedly raping their daughter, police said here on Sunday.", "url": "https://www.ndtv.com/india-news/13-year-old-girl-raped-by-father-in-fatehpur-police-3167060", "urlToImage": "https://c.ndtvimg.com/2021-06/1d9stjf8_up-police-generic_625x300_24_June_21.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675?ver-20220701.02", "publishedAt": "2022-07-17T16:10:51Z", "content": "Police said that the accused person is missing, and efforts are on to nab him.(File)\r\nFatehpur: A wife has registered a case against her husband for allegedly raping their daughter, police said here … [+660 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Adarsh Srivastava", "title": "NEET UG 2022: 95 Per Cent Candidates Appeared For Medical Entrance", "description": "National Testing Agency (NTA) successfully concluded the National Eligibility-cum-Entrance Test Undergraduate (NEET UG) 2022 on July 17.", "url": "https://www.ndtv.com/education/neet-ug-2022-95-cent-candidates-appeared-for-medical-entrance-exam", "urlToImage": "https://cache.careers360.mobi/media/presets/860X430/article_images/2022/7/16/NEET-UG-Exam-2022.jpg", "publishedAt": "2022-07-17T16:10:04Z", "content": "National Testing Agency (NTA) successfully concluded the National Eligibility-cum-Entrance Test Undergraduate (NEET UG) 2022 on July 17. A total of 95 per cent attendance was recorded for the all Ind… [+387 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Man Hacks 70-Year-Old Woman To Death On Witchcraft Suspicions", "description": "A 70-year-old tribal woman was allegedly hacked to death by a villager who suspected her of performing witchcraft in Odisha's Mayurbhanj district, police said on Sunday.", "url": "https://www.ndtv.com/india-news/man-hacks-70-year-old-woman-to-death-on-witchcraft-suspicions-3167040", "urlToImage": "https://c.ndtvimg.com/2019-06/hf08g2no_murder-generic_625x300_27_June_19.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675?ver-20220701.02", "publishedAt": "2022-07-17T16:01:44Z", "content": "Gangi Jamuda was admitted to the Sub-Divisional Hospital Rairangpur where she succumbed to injuries.\r\nBaripada, Odisha: A 70-year-old tribal woman was allegedly hacked to death by a villager who susp… [+751 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Naveen Patnaik's BJD To Support Jadgeep Dhankhar In Vice President Poll", "description": "Naveen Patnaik-led BJD has decided to support the National Democratic Alliance's vice presidential nominee Jagdeep Dhankhar, party leader  Pinaki Misra said to Press Trust of India on Sunday.", "url": "https://www.ndtv.com/india-news/naveen-patnaik-led-bjd-to-support-jadgeep-dhankhar-in-vice-president-poll-3167039", "urlToImage": "https://c.ndtvimg.com/2019-03/m53co35c_naveen-patnaik-odisha-pti_625x300_18_March_19.jpg", "publishedAt": "2022-07-17T16:00:44Z", "content": "BJP had announced Jagdeep Dhankhar as the Vice President candidate. (File)\r\nNew Delhi: Naveen Patnaik-led BJD has decided to support the National Democratic Alliance's vice presidential nominee Jagde… [+482 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Sri Lanka Premier League Postponed Due To Economic Crisis In Island Nation", "description": "The Sri Lanka board did not immediately announce when the postponed league would take place. Despite the crisis, Sri Lanka had successfully hosted Australia for a month-long series that ended last week.", "url": "https://sports.ndtv.com/cricket/sri-lanka-premier-league-postponed-due-to-economic-crisis-in-island-nation-3167029", "urlToImage": "https://c.ndtvimg.com/2022-07/m4g544s_sri-lanka-reuters-latest_625x300_17_July_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-17T15:55:17Z", "content": "The Lanka Premier League was on Sunday postponed indefinitely due to the ongoing \"economic situation\" in Sri Lanka. The T20 League was scheduled to be held from August 1 to 21. Sri Lanka is currently… [+1908 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Neither Ornamental Nor Political\": Outgoing Veep On Governor's Post", "description": "Mr Naidu, who is also the Rajya Sabha Chairman, today sought a good monsoon session of the parliament as a \"farewell gift\" in the All Party Meeting today to deliberate on the agenda of the upcoming session, sources said.", "url": "https://www.ndtv.com/india-news/neither-ornamental-nor-political-vice-president-m-venkaiah-naidu-on-governors-post-3167006", "urlToImage": "https://c.ndtvimg.com/2021-10/bm8m8mt8_m-venkaiah-naidushillong_625x300_04_October_21.jpg", "publishedAt": "2022-07-17T15:46:50Z", "content": "Mr Naidu pointed out how motivating people to get vaccinated \"has had positive outcomes\".\r\nNew Delhi: Barely a month before his term ends, Vice President M Venkaiah Naidu today called upon Governors … [+2765 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Tribals, Women Delighted Over My Nomination, Says Droupadi Murmu", "description": "National Democratic Alliance candidate Droupadi Murmu on Sunday said tribals and women in the country are excited and delighted over her nomination for the Presidential election, according to sources.", "url": "https://www.ndtv.com/india-news/tribals-women-delighted-over-my-nomination-says-presidential-poll-candidate-droupadi-murmu-3166995", "urlToImage": "https://c.ndtvimg.com/2022-06/hlulm5lo_droupadi-murmu_625x300_21_June_22.jpg", "publishedAt": "2022-07-17T15:45:04Z", "content": "A mock drill for voting in the July 18 Presidential poll was carried out. (File)\r\nNew Delhi: A day before the presidential poll, NDA candidate Droupadi Murmu interacted with MPs from NDA on Sunday an… [+1456 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Home Guard Jawans Help Woman Deliver Baby In Rain-Hit Bijapur", "description": "A team of Home Guard jawans helped a tribal woman deliver a baby on the banks of a swollen river in Chhattisgarh's rain-hit Bijapur district on Sunday, police said.", "url": "https://www.ndtv.com/india-news/home-guard-jawans-help-woman-deliver-baby-in-rain-hit-bijapur-3166949", "urlToImage": "https://c.ndtvimg.com/baby-generic_625x300_1529330292820.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675?ver-20220701.02", "publishedAt": "2022-07-17T15:30:50Z", "content": "Both the new-born and the mother were taken across the river on a rescue boat.(Representational)\r\nBijapur: A team of Home Guard jawans helped a tribal woman deliver a baby on the banks of a swollen r… [+2335 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Arrests Will Be Made For Seeking Rights\": Rahul Gandhi Slams Centre", "description": "Former Congress chief Rahul Gandhi on Sunday hit out at the government over the issue of unemployment and action against protesting youths, saying \"arrests will be made for seeking rights in New India\".", "url": "https://www.ndtv.com/india-news/arrests-will-be-made-for-seeking-rights-in-new-india-rahul-gandhi-slams-centre-3166948", "urlToImage": "https://c.ndtvimg.com/2022-07/hg724m2o_rahul-gandhi-twitter_625x300_03_July_22.jpg", "publishedAt": "2022-07-17T15:29:25Z", "content": "Rahul Gandhi said the government is destroying the future of the country. (File)\r\nNew Delhi: Former Congress chief Rahul Gandhi Sunday hit out at the government over the issue of unemployment and act… [+1580 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Watch: MS Dhoni Takes A Walk In England, Fans Cheer For Ex-India Captain", "description": "MS Dhoni was recently seen watching the first ODI between India and England along with former India players Suresh Raina and Harbhajan Singh", "url": "https://sports.ndtv.com/england-vs-india-2022/ms-dhoni-takes-a-walk-in-england-fans-cheer-for-former-indian-cricket-team-captain-watch-3166900", "urlToImage": "https://c.ndtvimg.com/2022-07/o7hvki1_ms-dhoni_625x300_16_July_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-17T15:13:27Z", "content": "MS Dhoni is currently in England. The former Indian cricket team captain was recently seen watching the first ODI between India and England along with former India players Suresh Raina and Harbhajan … [+2280 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "CBI To Act Against AAP's Amanatullah Khan In \"Illegal Appointments\" Case", "description": "The Delhi government's revenue department's sub-divisional magistrate (headquarters) had in November 2016 filed a complaint alleging \"arbitrary and illegal\" appointments by Mr Khan to various existing and non-existing posts in the Delhi Waqf Board.", "url": "https://www.ndtv.com/india-news/delhi-lieutenant-governor-grants-cbi-sanction-to-prosecute-aaps-amanatullah-khan-in-waqf-board-case-sources-3166896", "urlToImage": "https://c.ndtvimg.com/2022-05/0gd5uf8g_amanatullah-khan-650_625x300_13_May_22.jpg", "publishedAt": "2022-07-17T15:11:49Z", "content": "Sources said the CBI had moved its request in May this year.\r\nNew Delhi: Lieutenant Governor VK Saxena has granted the CBI sanction to prosecute AAP MLA and Delhi Waqf Board Chairman Amanatullah Khan… [+957 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "4-Month-Old Baby Dies After Monkey Throws Him Off Building In UP: Report", "description": "A four-month-old baby boy died after he was thrown off the roof of a three-storey house by a monkey in a rural area of Bareilly, an official said to Press Trust of India on Sunday.", "url": "https://www.ndtv.com/india-news/4-month-old-baby-dies-after-monkey-throws-him-off-building-in-up-report-3166882", "urlToImage": "https://c.ndtvimg.com/2019-07/j9qv36mg_monkeys-in-delhicensus_625x300_23_July_19.jpg", "publishedAt": "2022-07-17T15:07:12Z", "content": "The monkey garbbed the baby and threw him off the roof. (Representational)\r\nBareilly, Uttar Pradesh: A four-month-old baby boy died after he was thrown off the roof of a three-storey house by a monke… [+864 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "West's Refusal To Recognise Crimea As Russian A Threat: Ex Russia President", "description": "The refusal of Ukraine and NATO powers to recognise Moscow's authority over Crimea represents a \"systemic threat\" for Russia, former Russian president Dmitry Medvedev said on Sunday.", "url": "https://www.ndtv.com/world-news/medvedev-wests-refusal-to-recognise-crimea-as-russian-is-a-threat-3166869", "urlToImage": "https://c.ndtvimg.com/2022-07/m5s182lg_dmitry-medvedev_625x300_17_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675?ver-20220701.02", "publishedAt": "2022-07-17T15:00:36Z", "content": "A Ukrainian official suggested that Crimea could be a target for US-made HIMARS missiles.(File)\r\nMoscow: The refusal of Ukraine and NATO powers to recognise Moscow's authority over Crimea represents … [+1515 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Allegations Against Ahmed Patel Is \"Politics Of Vengeance\": Ashok Gehlot", "description": "Rajasthan Chief Minister Ashok Gehlot said the allegation against late Congress leader Ahmed Patel by the Gujarat Police's Special Investigation Team is part of \"politics of vengeance\" and shows proof of the BJP-RSS character.", "url": "https://www.ndtv.com/india-news/allegations-against-ahmed-patel-is-politics-of-vengeance-rajasthan-chief-minister-ashok-gehlot-3166824", "urlToImage": "https://c.ndtvimg.com/2022-06/io52snko_ashok-gehlot_650x400_15_June_22.jpg", "publishedAt": "2022-07-17T14:41:00Z", "content": "Levels against Ahmed Patel is for political gains, said Ashok Gehlot. (File)\r\nJaipur: Rajasthan Chief Minister Ashok Gehlot on Sunday condemned the allegations against late Congress leader Ahmed Pate… [+1505 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Wishful Thinking\": UK Military Chief On Putin Health Rumours", "description": "The head of Britain's armed forces has dismissed as \"wishful thinking\" speculation that Russian President Vladimir Putin is suffering from ill-health or could be assassinated.", "url": "https://www.ndtv.com/world-news/wishful-thinking-uk-military-chief-on-putin-health-rumours-3166808", "urlToImage": "https://c.ndtvimg.com/2022-07/1o5u5ig8_putin-latest_625x300_17_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675?ver-20220701.02", "publishedAt": "2022-07-17T14:34:01Z", "content": "Admiral Tony Radakin said that Russia poses \"the biggest threat\" to the UK.\r\nLondon: The head of Britain's armed forces has dismissed as \"wishful thinking\" speculation that Russian President Vladimir… [+2237 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Video: UP Man's Short-Lived 'Shaktimaan Moment' On Top Of Moving Truck", "description": "A man is seen doing push-ups on top of a moving garbage truck in Uttar Pradesh. The shirtless thrillseeker then stands on the vehicle but loses control moments later, bringing an end to his short-lived superhero moment.", "url": "https://www.ndtv.com/india-news/up-mans-short-lived-shaktimaan-moment-on-top-of-moving-truck-3166794", "urlToImage": "https://c.ndtvimg.com/2022-07/ab7qjr3g_up-man-pushups_625x300_17_July_22.jpg", "publishedAt": "2022-07-17T14:29:33Z", "content": "The man was badly injured due to the fall.\r\nNew Delhi: A man is seen doing push-ups on top of a moving garbage truck in Uttar Pradesh's capital city Lucknow. The shirtless thrillseeker then stands on… [+918 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Tehran Capable Of Making Nuclear Bomb, Says Ali Khamenie's Adviser: Report", "description": "Tehran is technically capable of making a nuclear bomb but has yet to decide whether to build one, a senior adviser to Iran's Supreme Leader Ali Khamenei told Al Jazeera's Arabic service on Sunday.", "url": "https://www.ndtv.com/world-news/tehran-capable-of-making-nuclear-bomb-says-ali-khamenies-adviser-report-3166764", "urlToImage": "https://c.ndtvimg.com/2022-07/kea2tdm8_iran-nuclear-_625x300_17_July_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675?ver-20220701.02", "publishedAt": "2022-07-17T14:20:34Z", "content": "Iran has long denied seeking nuclear weapons.\r\nDubai: Tehran is technically capable of making a nuclear bomb but has yet to decide whether to build one, a senior adviser to Iran's Supreme Leader Ali … [+1340 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "70-Year-Old Woman Stabbed To Death By Son In Uttar Pradesh: Cops", "description": "A 70-year-old woman was stabbed to death by her 32-year-old son in a village in Uttar Pradesh's Sant Kabir Nagar, the police said on Sunday.", "url": "https://www.ndtv.com/cities/70-year-old-woman-stabbed-to-death-by-son-in-uttar-pradesh-cops-3166753", "urlToImage": "https://c.ndtvimg.com/2022-06/ars722ac_police-generic_625x300_14_June_22.jpg", "publishedAt": "2022-07-17T14:17:22Z", "content": "The police the body has been sent for post mortem and the man has been arrested. (Representational)\r\nSant Kabir Nagar, Uttar Pradesh: A woman was allegedly stabbed to death by her 32-year-old son in … [+666 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "53-Year-Old Man Sets Record For Pushing Peanut Up Mountain Using His Nose", "description": "A man from the United States recently broke a strange record by pushing a peanut up a mountain using his nose.", "url": "https://www.ndtv.com/offbeat/53-year-old-man-in-us-sets-record-for-pushing-peanut-up-mountain-using-his-nose-3166716", "urlToImage": "https://c.ndtvimg.com/2022-07/n2laq6mg_peanut-push_625x300_17_July_22.jpg", "publishedAt": "2022-07-17T14:01:41Z", "content": "Previously, a man had pushed a peanut up Pikes Peak with his nose 93 years ago.\r\nA man from the United States recently broke a strange record by pushing a peanut up a mountain using his nose. 53-year… [+1760 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTVSports", "title": "England vs India: England vs India, 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports", "description": "Live Updates of Today Match between England vs India from Old Trafford, Manchester. Check commentary and full scoreboard of the match.", "url": "https://sports.ndtv.com/england-vs-india-2022/england-vs-india-live-score-over-3rd-odi-odi-46-50-updates-3166667", "urlToImage": "https://edata.ndtv.com/twittergft/sport_automated_story/big_637936837016142842.png", "publishedAt": "2022-07-17T13:59:59Z", "content": "Follow the England vs India, 2022 live cricket score on Sports.NDTV.com. After 45.5 overs, England are 259. Get live score, ball by ball commentary and much more. Keep track of England vs India, 2022… [+4070 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Honour To Be Nominated For Vice President Poll, Says Margaret Alva", "description": "Joint opposition candidate for the vice presidential election Margaret Alva on Sunday said she accepts with \"great humility\" her nomination for the August 6 poll and thanked leaders of various parties for reposing faith in her.", "url": "https://www.ndtv.com/india-news/honour-to-be-nominated-for-vice-president-poll-says-opposition-candidate-margaret-alva-3166681", "urlToImage": "https://c.ndtvimg.com/2022-07/vsdghqtk_margaret-alva_625x300_17_July_22.jpg", "publishedAt": "2022-07-17T13:47:14Z", "content": "The last date for filing nominations for the Vice President elections is July 19. (File)\r\nNew Delhi: Joint opposition candidate for the vice presidential election Margaret Alva on Sunday said she acc… [+1357 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Border Police Creates 1st Mountain Warfare Training School In Northeast", "description": "The Indo-Tibetan Border Police has created its first mountain-warfare training centre in northeast India, its second overall, to skill its troops in high-altitude combat and survival tactics as part of their mandate to guard the border with China.", "url": "https://www.ndtv.com/india-news/border-police-creates-1st-mountain-warfare-training-school-in-northeast-3166668", "urlToImage": "https://c.ndtvimg.com/2022-06/1na0e2ig_itbp-yoga-650_625x300_06_June_22.jpg", "publishedAt": "2022-07-17T13:40:52Z", "content": "New Delhi: The Indo-Tibetan Border Police (ITBP) has created its first mountain-warfare training centre in northeast India, its second overall, to skill its troops in high-altitude combat and surviva… [+3312 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Defiant Babar Azam Ton Leads Pakistan Fight Back In 1st Test vs Sri Lanka", "description": "Sri Lanka were 36 for one at stumps after skipper Dimuth Karunaratne fell lbw to left-arm spinner Mohammad Nawaz, for 16.", "url": "https://sports.ndtv.com/cricket/defiant-babar-azam-ton-leads-pakistan-fight-back-in-first-test-vs-sri-lanka-3166656", "urlToImage": "https://c.ndtvimg.com/2022-07/qkcnshi_babar-azam-afp_625x300_17_July_22.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-17T13:36:24Z", "content": "Pakistan skipper Babar Azam made a defiant 119 to thwart a Sri Lankan spin attack led by Prabath Jayasuriya on day two of an evenly poised first Test on Sunday. Azam single-handedly took the tourists… [+2225 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Mass Casualty Crash\": Dust Storm Causes 21-Vehicle Pile-Up On US Highway", "description": "At least six people died on Friday after a dust storm caused a pile-up of 21 vehicles in Montana, United States.", "url": "https://www.ndtv.com/world-news/mass-casualty-crash-dust-storm-causes-21-vehicle-pile-up-on-us-highway-3166642", "urlToImage": "https://c.ndtvimg.com/2022-07/jvtle3o8_car-crash_625x300_17_July_22.jpg", "publishedAt": "2022-07-17T13:29:28Z", "content": "It is still not clear how many were injured in the incident.\r\nAt least six people died on Friday after a dust storm caused a pile-up of 21 vehicles in Montana, United States. \r\nAccording to CNN, stro… [+1807 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Preparing For Next Stage Of Offensive: Ukraine", "description": "Russia is preparing for the next stage of its offensive in Ukraine, a Ukrainian military official said, after Moscow said its forces would step up military operations in \"all operational areas\".", "url": "https://www.ndtv.com/world-news/russia-preparing-for-next-stage-of-offensive-ukraine-3166636", "urlToImage": "https://c.ndtvimg.com/2022-07/4cu9v6u8_reuters_625x300_17_July_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675?ver-20220701.02", "publishedAt": "2022-07-17T13:28:58Z", "content": "Ukraine says at least 40 people have been killed in Russian shelling of urban areas since Thursday.\r\nKyiv: Russia is preparing for the next stage of its offensive in Ukraine, a Ukrainian military off… [+4575 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTVSports", "title": "England vs India Live Score Ball by Ball, England vs India, 2022 Live Cricket Score Of Today's Match on NDTV Sports", "description": "Live Updates of Today Match between England vs India from Old Trafford, Manchester. Check commentary and full scoreboard of the match.", "url": "https://sports.ndtv.com/england-vs-india-2022/england-vs-india-live-score-over-3rd-odi-odi-41-45-updates-3166598", "urlToImage": "https://edata.ndtv.com/twittergft/sport_automated_story/big_637936817468976849.png", "publishedAt": "2022-07-17T13:27:45Z", "content": "Follow the England vs India, 2022 live cricket score on Sports.NDTV.com. After 45.2 overs, England are 257/8. Get live score, ball by ball commentary and much more. Keep track of England vs India, 20… [+4251 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "32 Bills To Be Presented In Parliament For Monsoon Session, Says Minister", "description": "A day before the start of the monsoon session of the Parliament, the parliamentary affairs minister Prahlad Joshi said 32 bills from various departments will be presented in the two house in the Monsoon Session.", "url": "https://www.ndtv.com/india-news/32-bills-to-be-presented-in-parliament-for-monsoon-session-says-parliamentary-affairs-minister-prahlad-joshi-3166628", "urlToImage": "https://c.ndtvimg.com/2022-01/gs449418_parliamentt_625x300_31_January_22.jpg", "publishedAt": "2022-07-17T13:25:36Z", "content": "An all-party meeting was held ahead of the parliament's monsoon session.\r\nNew Delhi: A day before the start of the monsoon session of Parliament, the government on Sunday said 32 bills have been indi… [+5379 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Indian TT Players Rue Absence Of Sports Psychologist In CWG Support Staff", "description": "Sharath Kamal, arguably India's finest player ever, reigning national champion Sreeja Akula and Reeth Rishya said sports psychologist's presence in the contingent would have made a big difference.", "url": "https://sports.ndtv.com/table-tennis/indian-tt-players-rue-absence-of-sports-psychologist-in-cwg-support-staff-3166620", "urlToImage": "https://c.ndtvimg.com/2021-07/vm8vp0f_sharath-kamal-afp_650x400_27_July_21.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-17T13:21:23Z", "content": "The absence of sports psychologist Gayatri Vartak from India's 14-member table tennis contingent for the upcoming Commonwealth Games has not gone down well with the players. Vartak, a former badminto… [+2617 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sushmita Sen Says She Prefers Diamonds Over Gold, Still Buys It Herself", "description": "\"It's heartbreaking to see just how miserable and unhappy the world around us is becoming,\" Sushmita Sen wrote in her latest post on Instagram, along with a serene photo of herself in an infinity pool.", "url": "https://www.ndtv.com/india-news/sushmita-sen-says-she-prefers-diamonds-over-gold-still-buys-it-herself-3166610", "urlToImage": "https://c.ndtvimg.com/2022-07/en3jg26o_sushmita-sen-instagram_625x300_17_July_22.jpg", "publishedAt": "2022-07-17T13:19:20Z", "content": "Sushmita Sen shared a new post about the hype around her dating Lalit Modi.\r\nThe subject of unending commentary and scrutiny since IPL founder Lalit Modi's announcement of their relationship this wee… [+2606 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Anjum Moudgil Wins 50m 3 Positions Bronze At Changwon Shooting World Cup", "description": "This is Anjum Moudgil's second straight shooting World Cup medal of the year. She had won silver in the same event in Baku held last month.", "url": "https://sports.ndtv.com/othersports/anjum-moudgil-wins-50m-3-positions-bronze-medal-at-changwon-shooting-world-cup-3166600", "urlToImage": "https://c.ndtvimg.com/2021-03/i3u81e2g_anjum-moudgil-twitter_650x400_25_March_21.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-17T13:16:01Z", "content": "Olympian Anjum Moudgil won the bronze medal in the women's 50m rifle 3 positions (3P) event at the ISSF World Cup Changwon 2022 in Changwon, South Korea on Sunday. This is Anjum Moudgil's second stra… [+1105 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Video: Row Over UP Man Pushing Garbage Cart With PM, Yogi Adityanath Pics", "description": "A man was seen pushing a garbage cart in Uttar Pradesh's Mathura, a scene nothing too out of the ordinary but for the framed photos of Prime Minister Narendra Modi and Uttar Pradesh Chief Minister in the pile of the discarded items.", "url": "https://www.ndtv.com/india-news/video-row-over-up-man-pushing-garbage-cart-with-pm-yogi-adityanath-pics-3166566", "urlToImage": "https://c.ndtvimg.com/2022-07/jfl6qgbo_pm-modis-photo-in-garbage-cart_625x300_17_July_22.jpg", "publishedAt": "2022-07-17T13:06:37Z", "content": "PM Modi's photo was found in a garbage cart in Uttar Pradesh.\r\nNew Delhi: A man was seen pushing a garbage cart in Uttar Pradesh's Mathura, a scene nothing too out of the ordinary but for the framed … [+1282 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Asian News International", "title": "Prabath Jayasuriya Enters Elite List With 5-For vs Pakistan in Galle Test", "description": "Jayasuriya became the first Sri Lankan and third overall in the history to take three five-wicket hauls in the first three Test innings.", "url": "https://sports.ndtv.com/cricket/sri-lankas-prabath-jayasuriya-enters-elite-list-with-five-for-against-pakistan-in-galle-test-3166565", "urlToImage": "https://c.ndtvimg.com/2022-07/701fhoa8_prabath-jayasuriya-afp_625x300_16_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-17T13:06:13Z", "content": "Sri Lanka spinner Prabath Jayasuriya carved his name in history books of elite bowlers as he bagged his third consecutive haul of five wickets or more to put Pakistan under pressure on the second day… [+1042 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Air India Express Flight Diverted To Muscat After Burning Smell In Cabin", "description": "An Air India Express aircraft while operating from Calicut to Dubai was diverted to Muscat after a burning smell was observed from one of the vents in the forward galley of the flight on Saturday.", "url": "https://www.ndtv.com/india-news/air-india-express-flight-diverted-to-muscat-after-burning-smell-in-cabin-3166558", "urlToImage": "https://c.ndtvimg.com/2020-08/dotc1f64_air-india-express-generic_625x300_25_August_20.jpg", "publishedAt": "2022-07-17T13:04:21Z", "content": "A burning smell came from one of the vents in the forward galley. (Representational)\r\nNew Delhi: An Air India Express aircraft while operating from Calicut to Dubai was diverted to Muscat after a bur… [+2501 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "All 8-Member Crew Killed In Ukrainian Cargo Plane Crash In Greece", "description": "All eight crew members of a cargo plane that crashed near the Greek city of Kavala died in the accident, Serbia's defence minister said on Sunday.", "url": "https://www.ndtv.com/world-news/all-8-crew-killed-in-ukrainian-cargo-plane-crash-in-greece-3166557", "urlToImage": "https://c.ndtvimg.com/2022-07/ajacmbf8_greek-plane_625x300_17_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675?ver-20220701.02", "publishedAt": "2022-07-17T13:03:16Z", "content": "Eyewitnesses said on Saturday they saw the aircraft on fire and heard explosions.\r\nKavala, Greece: All eight crew members of a cargo plane that crashed near the Greek city of Kavala died in the accid… [+3395 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Arnab Mitra", "title": "NEET Analysis: 'Chemistry Was Difficult'; Check Candidates' Reactions", "description": "NEET UG 2022 Analysis: Sahil Chowdhury, a NEET UG 2022 aspirant told Careers360, that the Biology, Physics section were easy, however the Physical Chemistry was a bit difficult", "url": "https://www.ndtv.com/education/neet-ug-2022-paper-analysis-check-candidates-teachers-reactions-ntaneet-nic-in", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/16/NEET_P_860.jpeg", "publishedAt": "2022-07-17T12:53:28Z", "content": "NEET UG 2022 Paper Analysis: The candidates who have appeared in the National Eligibility cum Entrance Test Undergraduate (NEET UG 2022) exam today, July 17 found the paper easy except few sections i… [+1164 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Cricketer Booked For Forging Documents To Get Into Tripura Team", "description": "The cricketer, a resident of Barrackpore town in West Bengal's North 24 Parganas district, allegedly forged documents such as Permanent Resident of Tripura Certificate (PRTC)", "url": "https://sports.ndtv.com/cricket/cricketer-booked-for-forging-documents-to-get-into-tripura-team-3166539", "urlToImage": "https://c.ndtvimg.com/2020-08/m0ftlb6c_cricket-ball-generic-afp_625x300_11_August_20.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-17T12:53:12Z", "content": "A case was filed against a cricketer from West Bengal who allegedly forged documents to get into the Tripura under-19 team, police said on Sunday. The cricketer, a resident of Barrackpore town in Wes… [+892 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sri Lanka Protest Movement Reaches 100 Days", "description": "Sri Lanka's protest movement reached its 100th day Sunday, having forced one president from office and now turning its sights on his successor as the country's economic crisis continues.", "url": "https://www.ndtv.com/world-news/sri-lanka-protest-movement-reaches-100-days-3166524", "urlToImage": "https://c.ndtvimg.com/2022-07/m4g544s_sri-lanka-reuters-latest_625x300_17_July_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675?ver-20220701.02", "publishedAt": "2022-07-17T12:44:18Z", "content": "The campaign to oust Rajapaksa drew people from across Sri Lanka.\r\nColombo: Sri Lanka's protest movement reached its 100th day Sunday, having forced one president from office and now turning its sigh… [+3649 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Chris Hemsworth Skipped Meat Before Kissing Natalie Portman In Thor", "description": "Hollywood star Natalie Portman recently revealed that her 'Thor: Love and Thunder' co-star Chris Hemsworth was so considerate of her being a vegan that he purposely avoided eating meat before filming a kissing scene.", "url": "https://www.ndtv.com/offbeat/chris-hemsworth-stopped-eating-meat-before-kissing-vegan-thor-co-star-natalie-portman-3166506", "urlToImage": "https://c.ndtvimg.com/2022-07/uhlbo5oo_thor_625x300_17_July_22.jpg", "publishedAt": "2022-07-17T12:35:56Z", "content": "'Thor: Love and Thunder'was released on July 8.\r\nHollywood star Natalie Portman recently revealed that her Thor: Love and Thunder co-star Chris Hemsworth was so considerate of her being a vegan that … [+1765 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTVSports", "title": "England vs India: England vs India, 2022 Live Cricket Score, Live Score Of Today's Match on NDTV Sports", "description": "Live Updates of Today Match between England vs India from Old Trafford, Manchester. Check commentary and full scoreboard of the match.", "url": "https://sports.ndtv.com/england-vs-india-2022/england-vs-india-live-score-over-3rd-odi-odi-26-30-updates-3166419", "urlToImage": "https://edata.ndtv.com/twittergft/sport_automated_story/big_637936776645252742.png", "publishedAt": "2022-07-17T12:31:15Z", "content": "A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com. After 30.3 overs, England are 163/5. The live updates of England vs India scorecard is also… [+4660 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Uddhav Thackeray Vs Eknath Shinde In Supreme Court On Wednesday", "description": "Uddhav Thackeray vs Eknath Shinde in Supreme Court on Wednesday, Chief Justice to hear case", "url": "https://www.ndtv.com/india-news/uddhav-thackeray-vs-eknath-shinde-in-supreme-court-on-wednesday-chief-justice-to-hear-case-3166479", "urlToImage": "https://c.ndtvimg.com/2022-07/j5r8tuh_uddhav-thackeray-650_625x300_01_July_22.jpg", "publishedAt": "2022-07-17T12:26:50Z", "content": "New Delhi: A bench headed by Chief Justice Of India NV Ramana will on Wednesday hear cases related to the dispute between Maharashtra Chief Minister Eknath Shinde and Shiv Sena chief Uddhav Thackeray… [+1141 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Watch: Kohli's Advice Helps Siraj Scalp Bairtsow And Root In One Over?", "description": "Mohammed Siraj took the wickets of Jonny Bairstow and Joe Root in the same over in the third ODI", "url": "https://sports.ndtv.com/england-vs-india-2022/india-vs-england-3rd-odi-did-virat-kohlis-advice-help-mohammed-siraj-scalp-jonny-bairtsow-and-joe-root-in-one-over-watch-3166478", "urlToImage": "https://c.ndtvimg.com/2022-07/82rs7sc8_siraj-kohli-afp_625x300_17_July_22.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-17T12:26:36Z", "content": "Mohammed Siraj gave India a great start in the third and deciding ODI against England in Manchester on Sunday. Playing in place of the injured Jasprit Bumrah, Siraj took the wickets of Jonny Bairstow… [+1834 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sanjay Raut Seeks President Rule In Maharashtra Until Supreme Court Order", "description": "Shiv Sena MP Sanjay Raut demanded that till the constitution bench of the Supreme Court gives its verdict on the disqualification of rebel Shiv Sena MLAs, President's rule should be imposed in Maharashtra.", "url": "https://www.ndtv.com/india-news/shiv-senas-sanjay-raut-seeks-president-rule-in-maharashtra-until-supreme-court-order-3166468", "urlToImage": "https://c.ndtvimg.com/2022-06/tp1o9p6o_sanjay-raut_650x400_21_June_22.jpg", "publishedAt": "2022-07-17T12:22:31Z", "content": "A senior BJP leader has said the Maharashtra cabinet may be expanded on July 20 or 21. (File)\r\nMumbai: Shiv Sena MP Sanjay Raut has demanded the imposition of President's rule in Maharashtra till the… [+3107 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Cloudburst A Foreign Conspiracy\": Telangana's KCR In Flood-Hit Area", "description": "Telangana Chief Minister K Chandrashekar Rao today said the floods in the state's Godavari region were the result of a cloudburst -- suspected to be a \"conspiracy planned by other countries\".", "url": "https://www.ndtv.com/india-news/cloudburst-a-foreign-conspiracy-telanganas-kcr-in-flood-hit-area-3166454", "urlToImage": "https://c.ndtvimg.com/2022-07/l2tfl5u_kcr-telangana-floods_625x300_17_July_22.jpg", "publishedAt": "2022-07-17T12:14:26Z", "content": "Hyderabad: Telangana Chief Minister K Chandrashekar Rao today said the floods in the state's Godavari region were the result of a cloudburst -- suspected to be a \"conspiracy planned by other countrie… [+1764 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Key Accused In UP Politician's Murder On Run Since 2005 Arrested: Cops", "description": "A key accused in the killing of Samajwadi Party leader Shiv Sagar Singh in Uttar Pradesh's Kaushambi has been arrested after being on the run since 2005, police officials said on Sunday.", "url": "https://www.ndtv.com/india-news/key-accused-in-samajwadi-party-politician-shiv-sagar-singhs-killer-on-run-since-2005-arrested-in-madhya-pradesh-up-police-3166425", "urlToImage": "https://c.ndtvimg.com/2018-12/pjoph2ag_up-police-generic-650_625x300_31_December_18.jpg", "publishedAt": "2022-07-17T12:09:51Z", "content": "The politician was accused of killing the man's father in 1994, the police said. (Representational)\r\nNoida: A key accused in the sensational killing of a Samajwadi Party leader in Uttar Pradesh's Kau… [+4062 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "PM Modi Congratulates PV Sindhu On Singapore Open Title Win", "description": "Prime Minister Narendra Modi congratulated ace Indian shuttler PV Sindhu after she clinched the Singapore Open 2022 title on Sunday.", "url": "https://www.ndtv.com/india-news/pm-modi-congratulates-pv-sindhu-on-singapore-open-title-win-3166424", "urlToImage": "https://c.ndtvimg.com/2022-05/pe1vf77o_pm-modi-pti-650_625x300_17_May_22.jpg", "publishedAt": "2022-07-17T12:09:46Z", "content": "PM Modi congratulated ace Indian shuttler PV Sindhu after she clinched the Singapore Open 2022 title.\r\nNew Delhi: Prime Minister Narendra Modi congratulated ace Indian shuttler PV Sindhu after she cl… [+2157 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Adarsh Srivastava", "title": "ICSE 10th Result 2022 Out: Girls Shine In Merit List; Meet The Toppers", "description": "Indian Certificate of Secondary Education (ICSE) Class 10 result 2022 is declared today, July 17, by the Council for the Indian School Certificate Examinations (CISCE).", "url": "https://www.ndtv.com/education/icse-10th-result-2022-out-girls-shine-in-merit-list-meet-toppers", "urlToImage": "https://cache.careers360.mobi/media/presets/860X430/article_images/2022/7/16/ICSE-Class-10-Result-2022.jpg", "publishedAt": "2022-07-17T12:09:41Z", "content": "New Delhi:ICSE 10th Result 2022: Indian Certificate of Secondary Education (ICSE) Class 10 result 2022 is declared today, July 17, by the Council for the Indian School Certificate Examinations (CISCE… [+1504 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "5 Facts About Margaret Alva, Opposition's Vice President Pick", "description": "The Opposition is pitting former Union minister Margaret Alva against BJP's Jagdeep Dhankhar in the vice-presidential elections. The announcement was made by Nationalist Congress Party chief Sharad Pawar after an Opposition meeting today.", "url": "https://www.ndtv.com/india-news/margaret-alva-is-oppositions-vice-president-pic-5-facts-about-the-ex-union-minister-3166407", "urlToImage": "https://c.ndtvimg.com/2022-07/vsdghqtk_margaret-alva_625x300_17_July_22.jpg", "publishedAt": "2022-07-17T12:05:40Z", "content": "<li>Margaret Alva was born on April 14, 1942 in Karnataka's Mangalore. During her school and college days, Ms Alva was an active debater and was also involved with several students' movements.\r\n</li>… [+488 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Vicky Kaushal Enjoys Pool Time With His Boys In The Maldives. See Pics", "description": "Vicky Kaushal and Katrina Kaif are on birthday vacation in the Maldives", "url": "https://www.ndtv.com/entertainment/vicky-kaushal-enjoys-pool-time-with-his-boys-in-the-maldives-see-pics-3166403", "urlToImage": "https://c.ndtvimg.com/2022-07/54jpqr8g_vicky-kaushal_625x300_17_July_22.jpg", "publishedAt": "2022-07-17T12:03:27Z", "content": "Vicky Kaushal shared this picture. (courtesy: vickykaushal09)\r\nVicky Kaushal and Katrina Kaif are currently in the Maldives celebrating the actress' 39th birthday. The Sardar Udham actor has shared n… [+1457 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "AAP Makes Madhya Pradesh Debut With Singrauli Mayoral Win", "description": "Of the 11 civic bodies in Madhya Pradesh where mayoral elections were held recently, the BJP has so far emerged victorious in Burhanpur, Satna, Khandwa, and Sagar, while the AAP opened its account by winning in Singrauli.", "url": "https://www.ndtv.com/india-news/aap-makes-madhya-pradesh-debut-with-singrauli-mayoral-win-3166398", "urlToImage": "https://c.ndtvimg.com/2022-07/2d8eerag_aap-rani-agrawal-twitter_625x300_17_July_22.jpeg", "publishedAt": "2022-07-17T12:02:04Z", "content": "Rani Agrawal defeated Bharatiya Janata Party candidate Chandra Pratap Vishwakarma.\r\nBhopal: With its candidate Rani Agrawal winning the mayoral poll in Singrauli by over 9,300 votes, the Aam Aadmi Pa… [+2420 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Police Vehicles Torched After Teen Found Dead In Tamil Nadu School", "description": "At least ten police personnel were injured as violent protesters pelted stones at the police at Sakthi Matric Higher Secondary School in Tamil Nadu's Kallakurichi district after a teenaged girl killed herself on Tuesday.", "url": "https://www.ndtv.com/india-news/vehicles-torched-after-teen-found-dead-in-tamil-nadu-school-10-cops-injured-3166380", "urlToImage": "https://c.ndtvimg.com/2022-07/uudlt498_tamil-nadu-bus-torched_625x300_17_July_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675?ver-20220701.02", "publishedAt": "2022-07-17T11:55:19Z", "content": "On Sunday morning, as the protests grew bigger, a thousand people joined in.\r\nKallakurichi district: At least ten police personnel were injured as violent protesters pelted stones at the police at Sa… [+1892 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTVSports", "title": "England vs India Live Score Ball by Ball, England vs India, 2022 Live Cricket Score Of Today's Match on NDTV Sports", "description": "Live Updates of Today Match between England vs India from Old Trafford, Manchester. Check commentary and full scoreboard of the match.", "url": "https://sports.ndtv.com/england-vs-india-2022/england-vs-india-live-score-over-3rd-odi-odi-21-25-updates-3166359", "urlToImage": "https://edata.ndtv.com/twittergft/sport_automated_story/big_637936762355491078.png", "publishedAt": "2022-07-17T11:51:49Z", "content": "Follow the England vs India, 2022 live cricket score on Sports.NDTV.com. After 25.0 overs, England are 131/4. Get live score, ball by ball commentary and much more. Keep track of England vs India, 20… [+3964 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Watch: Anand Mahindra Shares \"Simple Yet Creative\" Staircase Design", "description": "Anand Mahindra is an avid social media user and he frequently shares fascinating posts that pique the interest of internet users. This time too, he has caught netizens' attention by sharing a video that shows a \"simple yet creative\" staircase.", "url": "https://www.ndtv.com/offbeat/watch-anand-mahindra-shares-simple-yet-creative-staircase-design-internet-calls-it-brilliant-3166336", "urlToImage": "https://c.ndtvimg.com/2022-02/hfno0a4_anand-mahindra_625x300_09_February_22.jpg", "publishedAt": "2022-07-17T11:36:18Z", "content": "The video has racked up over one million views and more than 50,000 likes\r\nAnand Mahindra, the chairman of Mahindra Group, is an avid social media user and he frequently shares fascinating posts that… [+2385 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTVSports", "title": "England vs India Live Score Ball by Ball, England vs India, 2022 Live Cricket Score Of Today's Match on NDTV Sports", "description": "Live Updates of Today Match between England vs India from Old Trafford, Manchester. Check commentary and full scoreboard of the match.", "url": "https://sports.ndtv.com/england-vs-india-2022/england-vs-india-live-score-over-3rd-odi-odi-16-20-updates-3166297", "urlToImage": "https://edata.ndtv.com/twittergft/sport_automated_story/big_637936745455443883.png", "publishedAt": "2022-07-17T11:27:47Z", "content": "A dedicated team of experts bring you live score, live cricket score, live match update on Sports.NDTV.com. After 18.3 overs, England are 85/4. The live updates of England vs India scorecard is also … [+3536 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Amid Lalit Modi Buzz, Sushmita Sen's +1 For Story On Her Dating Choices", "description": "Actor Sushmita Sen expressed her support for a comment on Sunday about her dating life that has become headline news since IPL founder Lalit Modi's announcement this week that they were seeing each other.", "url": "https://www.ndtv.com/india-news/sushmita-sens-1-for-story-on-her-dating-choices-amid-lalit-modi-buzz-3166309", "urlToImage": "https://c.ndtvimg.com/2022-07/03hhcl4_-sushmita-sen_625x300_14_July_22.jpg", "publishedAt": "2022-07-17T11:25:52Z", "content": "Sushmita Sen posted a new tweet about the hype around her dating Lalit Modi.\r\nNew Delhi: Actor Sushmita Sen expressed her appreciation for comments on Sunday about her dating life that has become hea… [+772 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ex-Union Minister Margaret Alva Is Opposition's Vice President Candidate", "description": "Ex Union Minister Margaret Alva is Opposition's Vice Presidential election candidate", "url": "https://www.ndtv.com/india-news/ex-union-minister-margaret-alva-is-opposition-s-vice-presidential-election-candidate-3166290", "urlToImage": "https://c.ndtvimg.com/2022-07/1drr7iv_margaret-alva_650x400_17_July_22.jpg", "publishedAt": "2022-07-17T11:20:18Z", "content": "Margaret Alva was picked by the opposition after a meeting today.\r\nNew Delhi: Former Union minister and four-time Governor Margaret Alva is the Opposition's choice for the post of Vice President of I… [+1996 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTVSports", "title": "England vs India Live Score Ball by Ball, England vs India, 2022 Live Cricket Score Of Today's Match on NDTV Sports", "description": "Live Updates of Today Match between England vs India from Old Trafford, Manchester. Check commentary and full scoreboard of the match.", "url": "https://sports.ndtv.com/england-vs-india-2022/england-vs-india-live-score-over-3rd-odi-odi-11-15-updates-3166209", "urlToImage": "https://edata.ndtv.com/twittergft/sport_automated_story/big_637936727376943479.png", "publishedAt": "2022-07-17T11:02:11Z", "content": "Follow the England vs India, 2022 live cricket score on Sports.NDTV.com. After 13.1 overs, England are 74/3. Get live score, ball by ball commentary and much more. Keep track of England vs India, 202… [+2640 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Asian News International", "title": "Watch: Gritty PV Sindhu Clinches Singapore Open Final vs Chinese Star", "description": "India's PV Sindhu on Sunday defeated China's Wang Zhi Yi 21-9, 11-21, 21-15 in the final match of women's singles at the Singapore Open 2022.", "url": "https://sports.ndtv.com/badminton/pv-sindhu-registers-special-win-clinches-singapore-open-for-maiden-super-500-title-of-2022-watch-3166222", "urlToImage": "https://c.ndtvimg.com/2022-07/mo27mqeo_pv-sindhu-afp_625x300_17_July_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-17T10:57:07Z", "content": "Ace Indian shuttler and Olympic medalist PV Sindhu clinched the Singapore Open 2022 title after defeating China's Wang Zhi Yi in the final of the women's singles category on Sunday. Playing on court … [+1491 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Caught Drink Driving In Punjab? Punishment Includes Blood Donation", "description": "The first offence of exceeding a speed limit will attract a fine of Rs 1,000 and suspension of the offender's driver's license for three months. For drunk driving, the fine is Rs 5,000 in addition to the license suspension for the same duration.", "url": "https://www.ndtv.com/india-news/in-new-traffic-rules-blood-donation-among-fines-for-drunk-driving-overspeeding-in-punjab-3166214", "urlToImage": "https://c.ndtvimg.com/2022-04/5auk1u78_punjab-police-generic-650_625x300_24_April_22.jpg", "publishedAt": "2022-07-17T10:56:16Z", "content": "All traffic offences carry some monetary fine and suspension of license for 3 months. (file)\r\nChandigarh: Exceeding the speed limit or driving under the influence of alcohol or drugs in Punjab will n… [+1786 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Nothing To See Here. Just Rashmika Stealing The Show Like A Red Rose", "description": "Rashmika Mandanna's latest post has our attention", "url": "https://www.ndtv.com/entertainment/rashmika-mandanna-looks-nothing-less-than-a-red-rose-3166208", "urlToImage": "https://c.ndtvimg.com/2022-07/1ei5p4f_rashmika_625x300_17_July_22.jpg", "publishedAt": "2022-07-17T10:54:57Z", "content": "Rashmika Mandanna shared this picture. (courtesy: rashmika_mandanna)\r\nRashmika Mandanna's social media timeline is a treat to watch. From pulling uber-cool looks to giving diva vibes, the actress is … [+1567 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ibrahim Ali Khan And Mahikaa Rampal Party With Friends In London", "description": "Ibrahim Ali Khan and Mahikaa Rampal's common friend Orhan Awatramani shared several pictures on Instagram", "url": "https://www.ndtv.com/entertainment/saif-ali-khans-son-ibrahim-and-arjun-rampals-daughter-mahikaa-party-with-friends-in-london-see-pics-3166203", "urlToImage": "https://c.ndtvimg.com/2022-07/p8fg2l3_ibrahim_625x300_17_July_22.jpg", "publishedAt": "2022-07-17T10:51:48Z", "content": "Ibrahim Ali Khan(L) and Mahikaa Rampal(R). (courtesy: saraalikhan95) (courtesy: orry1)\r\nSaif Ali Khan's son Ibrahim Ali Khan and Arjun Rampal's daughter Mahikaa Rampal partied together with their fri… [+1485 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Is Rahul Gandhi Even In India?\" KCR's Daughter K Kavitha Asks", "description": "Days before the trip of Congress leader Rahul Gandhi to Telangana's Sircilla on July 21, state MLC K Kavitha on Sunday enquired about his whereabouts while mentioning that he would get to learn a lot from the state.", "url": "https://www.ndtv.com/telangana-news/kcrs-daughter-k-kavitha-is-rahul-gandhi-even-in-india-3166196", "urlToImage": "https://c.ndtvimg.com/2019-05/9due4kt_k-kavitha-twitter-650_625x300_23_May_19.jpg", "publishedAt": "2022-07-17T10:49:23Z", "content": "K Kavitha on enquired about Rahul Gandhi's whereabouts.\r\nHyderabad (Telangana): Days before the trip of Congress leader Rahul Gandhi to Telangana's Sircilla on July 21, state MLC K Kavitha on Sunday … [+1840 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "From Closest To Uncontested, 10 Facts On India's Presidential Elections", "description": "The election for the next President will be held on Monday. The counting of votes will be on Thursday, while the swearing-in will be on July 25.", "url": "https://www.ndtv.com/india-news/from-closest-to-uncontested-10-facts-on-indias-presidential-elections-3166184", "urlToImage": "https://c.ndtvimg.com/2022-06/h7ru9m08_rashtrapati-bhavan_650x400_09_June_22.jpg", "publishedAt": "2022-07-17T10:46:14Z", "content": "<li>Fourteen people have been elected as the President of India since India became a republic in 1950, with 12 of them completing their full term of five years. Rajendra Prasad, the inaugural Preside… [+3069 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Amul Celebrates World Emoji Day With Bunch of \"Yumojis\"", "description": "Amul Topical's World Emoji Day creativity is simply on point, managing to gather some laughs. Agree?", "url": "https://food.ndtv.com/news/world-emoji-day-amul-topical-gives-a-yumojis-twist-to-the-day-3165769", "urlToImage": "https://c.ndtvimg.com/2022-07/o31jmc8o_amul_625x300_17_July_22.png?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-17T10:42:41Z", "content": "Amul has marked World Emoji Day by creating a series of yumojis. In the new tropical that the dairy brand has shared on Instagram, the face of its mascot, The Butter Girl, is seen in the form of thre… [+1212 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Babar Azam Scores Century To Rescue Pakistan vs Sri Lanka In 1st Test", "description": "Babar Azam scored his 7th Test ton in the ongoing first Test against Sri Lanka at Galle International Stadium", "url": "https://sports.ndtv.com/cricket/sri-lanka-vs-pakistan-1st-test-babar-azam-scores-century-to-rescue-pakistan-3166173", "urlToImage": "https://c.ndtvimg.com/2022-07/62lu0bso_babar-azam-afp_625x300_17_July_22.jpeg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-17T10:41:16Z", "content": "Pakistan captain Babar Azam continued his rich vein of form in the ongoing first match against Sri Lanka at Galle International Stadium as he completed his seventh Test ton. No Pakistan batter was ab… [+1185 chars]"}]}