{"status": "ok", "totalResults": 399, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sri Lankan Cabinet Resigns, Protesters Defy Curfew: 10 Points", "description": "Sri Lanka's entire cabinet resigned from their posts Sunday as the ruling political clan seeks to resolve a mounting economic crisis", "url": "https://www.ndtv.com/world-news/sri-lanka-crisis-sri-lankan-cabinet-resigns-protesters-defy-curfew-10-points-2860859", "urlToImage": "https://c.ndtvimg.com/2022-04/uk1hoiv8_sri-lanka-crisis_625x300_04_April_22.jpg", "publishedAt": "2022-04-04T02:08:47Z", "content": "<li>All 26 ministers in the cabinet aside from President Gotabaya Rajapaksa and his elder brother Prime Minister Mahinda Rajapaksa submitted letters of resignation at a late-night meeting. \r\n</li><li… [+2066 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "In Ukraine Street, Body With Hands Tied, A Bullet Wound To The Head", "description": "A man lay sprawled by the roadside in the Ukrainian city of Bucha on Sunday, his hands tied behind his back and a bullet wound to his head, one of hundreds of local residents that officials say have been found dead in the wake of Russian occupation.", "url": "https://www.ndtv.com/world-news/in-ukraine-street-body-with-hands-tied-a-bullet-wound-to-the-head-2860857", "urlToImage": "https://c.ndtvimg.com/2022-04/0pbr5a78_kyiv-bucha-afp_625x300_03_April_22.jpg", "publishedAt": "2022-04-04T02:06:23Z", "content": "Russia has said not a single local resident suffered from any violent actions. (File)\r\nBucha: A man lay sprawled by the roadside in the Ukrainian city of Bucha on Sunday, his hands tied behind his ba… [+7949 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine War Updates: 410 Civilian Bodies, \"Mass Graves\" Discovered Near Kyiv", "description": "Global outrage at accusations of Russian war crimes in Ukraine mounted after the discovery of mass graves and \"executed\" civilians near Kyiv.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-live-updates-410-civilian-bodies-mass-graves-discovered-near-kyiv-2860854", "urlToImage": "https://c.ndtvimg.com/2022-04/44tbs6qg_kharkiv-ukraine-russia-war-afp-650_625x300_04_April_22.jpg", "publishedAt": "2022-04-04T01:54:44Z", "content": "Ukraine War: Russia invaded Ukraine on February 24. (File)\r\nKyiv: Global outrage at accusations of Russian war crimes in Ukraine mounted after the discovery of mass graves and \"executed\" civilians ne… [+589 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Army Initiates Court-Martial Proceedings Against Captain In J&K Operation", "description": "Indian Army has initiated general court-martial proceedings against a Captain in Operation Amshipura, Shopian in Jammu and Kashmir in July 2020.", "url": "https://www.ndtv.com/india-news/operation-amshipura-army-initiates-court-martial-proceedings-against-captain-in-j-2860795", "urlToImage": "https://i.ndtvimg.com/i/2015-12/indian-army-generic-afp_650x400_51449863673.jpg", "publishedAt": "2022-04-04T01:49:42Z", "content": "Indian Army is committed to the ethical conduct of operations, said the PRO. (Representational)\r\nSrinagar: Indian Army has initiated general court-martial proceedings against a Captain in Operation A… [+519 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "LIVE: Imran Khan's Parliament Dissolution Move In Supreme Court Today", "description": "Pakistan's Supreme Court is set to hear today the arguments related to Imran Khan's dissolution of the parliament ahead of a no-confidence vote that was dismissed by the Deputy Speaker.", "url": "https://www.ndtv.com/world-news/pakistan-crisis-live-updates-imran-khans-parliament-dissolution-move-in-supreme-court-today-2860843", "urlToImage": "https://c.ndtvimg.com/2022-04/e6pj6mag_imran-khan-placard-afp-650_625x300_04_April_22.jpg", "publishedAt": "2022-04-04T01:36:06Z", "content": "Pakistan crisis: Imran Khan has alleged a conspiracy to take down his government.\r\nPakistan's Supreme Court is set to hear today the arguments related to Imran Khan's dissolution of the parliament ah… [+417 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Sri Lanka Crisis Live: Sri Lankan Cabinet Resigns As Crisis Worsens", "description": "Sri Lanka's entire cabinet aside from President Gotabaya Rajapaksa and his sibling Prime MinisterMahinda Rajapaksa resigned from their posts Sunday as the ruling political clan seeks to resolve a mounting economic crisis.", "url": "https://www.ndtv.com/world-news/sri-lanka-crisis-live-updates-sri-lankan-cabinet-resigns-amid-worsening-economic-crisis-2860841", "urlToImage": "https://c.ndtvimg.com/2022-04/gpome0a_sri-lanka-crisis_625x300_04_April_22.jpg", "publishedAt": "2022-04-04T01:31:09Z", "content": "New Delhi: Sri Lanka's entire cabinet aside from President Gotabaya Rajapaksa and his sibling Prime Minister Mahinda Rajapaksa resigned from their posts Sunday as the ruling political clan seeks to r… [+759 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Petrol, Diesel Prices Up Again, 12th Hike In 2 Weeks", "description": "Petrol and diesel prices were on Monday hiked by 40 paise a litre each, taking the total increase in rates in the last two weeks to Rs 8.40 per litre.", "url": "https://www.ndtv.com/india-news/petrol-diesel-prices-up-again-12th-hike-in-2-weeks-2860837", "urlToImage": "https://c.ndtvimg.com/2021-09/ojarjui8_petrol-pump_650x400_28_September_21.jpg", "publishedAt": "2022-04-04T01:18:14Z", "content": "In all, petrol prices have gone up by Rs 8.40 per litre. (File photo)\r\nNew Delhi: Petrol and diesel prices were on Monday hiked by 40 paise a litre each, taking the total increase in rates in the las… [+661 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rahul Gandhi To Meet Telangana Congress Leaders In Delhi Today", "description": "Congress leader Rahul Gandhi will meet party leaders of Telangana today in the evening and discuss the political situation prevailing along with brainstorming on the Assembly elections scheduled next year in the state, said the sources.", "url": "https://www.ndtv.com/india-news/rahul-gandhi-to-meet-telangana-congress-leaders-today-assembly-elections-paddy-procurement-among-top-agenda-2860799", "urlToImage": "https://c.ndtvimg.com/2022-02/bqb3rc3k_rahul-gandhi-pti_625x300_15_February_22.jpg", "publishedAt": "2022-04-04T01:13:34Z", "content": "This is Rahul Gandhi's second meeting with the Telangana Congress leaders in the last seven days. (File)\r\nNew Delhi: Congress leader Rahul Gandhi will meet party leaders of Telangana today in the eve… [+1445 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Nitin Gadkari Visits Raj Thackeray House, Says \"Not A Political Meeting\"", "description": "Union Minister Nitin Gadkari on Sunday met Maharashtra Navnirman Sena chief Raj Thackeray at the latter's residence in Mumbai and called it a family meeting, denying anything political behind this meeting.", "url": "https://www.ndtv.com/india-news/nitin-gadkari-visits-raj-thackeray-house-says-not-a-political-meeting-2860772", "urlToImage": "https://c.ndtvimg.com/2022-03/gfgh70v_nitin-gadkari-twitter_625x300_28_March_22.jpg", "publishedAt": "2022-04-04T00:59:22Z", "content": "Nitin Gadkari said he has a good relationship with Raj Thackeray and his family members. (File)\r\nMumbai: Union Minister Nitin Gadkari on Sunday met Maharashtra Navnirman Sena chief Raj Thackeray at t… [+1179 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Grammys 2022: Silk Sonic's Leave The Door Open Wins Song Of The Year", "description": "The Grammys were meant to be held in January and were postponed because of a spike in COVID numbers due to the Omicron variant", "url": "https://www.ndtv.com/entertainment/grammy-awards-2022-silk-sonics-leave-the-door-open-wins-song-of-the-year-list-of-winners-2860830", "urlToImage": "https://c.ndtvimg.com/2022-04/cq383gdg_bruno-mars_625x300_04_April_22.jpg", "publishedAt": "2022-04-04T00:58:56Z", "content": "Bruno Mars, Dernst Emile II, and Anderson .Paak accept the Song Of The Year award. (Image courtesy: AFP)\r\nNew Delhi: The 64th edition of the biggest musical night began with Silk Sonic winning Grammy… [+3534 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "IPL Betting Racket Busted In Pune, Rs 27 Lakh Seized: Police", "description": "As many as four people were booked for betting in the IPL match in Pune and an amount of Rs 27 lakh cash was seized, said Pimpri Chinchwad police.", "url": "https://www.ndtv.com/pune-news/ipl-betting-racket-busted-in-pune-rs-27-lakh-seized-police-2860804", "urlToImage": "https://c.ndtvimg.com/2021-05/9peonr88_pune-police-generic-twitter-650_625x300_17_May_21.jpg", "publishedAt": "2022-04-04T00:49:22Z", "content": "IPL betting racket: The police have registered FIR against four people. (Representational)\r\nPune: As many as four people were booked for betting in the IPL match in Pune and an amount of Rs 27 lakh c… [+992 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Satellite Images Show 45-Foot Trench Near Ukraine Capital: US Firm", "description": "Satellite images show a 45-foot-long trench dug into the grounds of a Ukrainian church where a mass grave was found this week after Russian forces withdrew from the town of Bucha, a private UScompany said on Sunday.", "url": "https://www.ndtv.com/world-news/ukraine-russia-war-satellite-images-show-45-foot-trench-at-grave-site-in-bucha-near-kyiv-2860789", "urlToImage": "https://c.ndtvimg.com/2022-04/pcv5fu2o_trench-in-bucha-ukraine-reuters-650_625x300_04_April_22.jpg", "publishedAt": "2022-04-04T00:33:22Z", "content": "Ukraine accused Russian forces of carrying out a \"massacre\" in Bucha.\r\nSatellite images show a 45-foot-long trench dug into the grounds of a Ukrainian church where a mass grave was found this week af… [+1256 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE Updates: India Recorded 1,096 New Covid Cases On Sunday", "description": "India reported 1,096 fresh COVID-19 cases and 81related deaths on Saturday, said the Union health ministry.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-4-april-2022-2860815", "urlToImage": "https://c.ndtvimg.com/2022-01/nr0feopo_coronavirus-india-afp-january_650x400_11_January_22.jpg", "publishedAt": "2022-04-04T00:15:54Z", "content": "COVID-19 live: Health Ministry data showed active cases declined to 13,013. (File)\r\nNew Delhi: India reported 1,096 fresh COVID-19 cases and 81 related deaths on Saturday, said the Union health minis… [+451 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Hungary PM Viktor Orban Wins Fourth Term With Comfortable Victory", "description": "Official results from Hungary's general election on Sunday showed nationalist Hungarian Prime Minister Viktor Orban's Fidesz party had won a fourth term in office by a much greater margin than pre-election polls had suggested.", "url": "https://www.ndtv.com/world-news/hungary-pm-viktor-orban-wins-fourth-term-with-comfortable-victory-2860810", "urlToImage": "https://c.ndtvimg.com/2022-04/4ojpmkn_hungary-pm-viktor-orban-afp-650_625x300_04_April_22.jpg", "publishedAt": "2022-04-03T23:48:22Z", "content": "Hungary PM Viktor Orban is already the longest-serving head of government in the EU.\r\nBudapest: Official results from Hungary's general election on Sunday showed nationalist Hungarian Prime Minister … [+4624 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Over 90 Dead In Boat Tragedy In Mediterranean Sea: UN", "description": "Nearly 100 people have died in international waters after setting off from Libya in an overcrowded boat, international organisations said.", "url": "https://www.ndtv.com/world-news/over-90-dead-in-boat-tragedy-in-mediterranean-sea-un-2860808", "urlToImage": "https://i.ndtvimg.com/i/2016-08/overturned-boat-generic_650x400_41471893107.jpg", "publishedAt": "2022-04-03T23:35:35Z", "content": "Mediterranean boat tragedy: A commercial tanker rescued four people from a life raft. (Representational)\r\nGeneva: Nearly 100 people have died in international waters after setting off from Libya in a… [+2031 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Jordan's Prince Hamza Renounces Royal Title, Protesting Policies", "description": "Prince Hamza bin al-Hussein, a former heir to Jordan's throne who was placed under house arrest last year, announced on Sunday he was giving up his royal title in protest over Jordan's current policies.", "url": "https://www.ndtv.com/world-news/jordans-prince-hamza-bin-al-hussein-renounces-royal-title-protesting-policies-2860806", "urlToImage": "https://c.ndtvimg.com/2022-04/j9fguai_jordan-prince-hamza-reuters-650_625x300_04_April_22.jpg", "publishedAt": "2022-04-03T23:16:24Z", "content": "Prince Hamza said he would continue to serve Jordan in his private life (File)\r\nAmman: Prince Hamza bin al-Hussein, a former heir to Jordan's throne who was placed under house arrest last year, annou… [+2057 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Canada Woman Found Dismembered, Stuffed In Bag; Son Arrested", "description": "Canadian police said Sunday they have arrested the son of a woman whose dismembered body was found stuffed in a plastic bag on a Toronto sidewalk this week, and charged him with murder.", "url": "https://www.ndtv.com/world-news/canada-woman-found-dismembered-stuffed-in-bag-son-arrested-2860801", "urlToImage": "https://c.ndtvimg.com/2020-09/n36j3h0s_canada-police-generic_625x300_27_September_20.jpg", "publishedAt": "2022-04-03T23:07:46Z", "content": "Canada: The victim was later identified as a 46-year-old manicurist. (Representational)\r\nOttawa: Canadian police said Sunday they have arrested the son of a woman whose dismembered body was found stu… [+1002 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Fraud Loan Racket Busted For Morphing Clients' Pics, Extortion: Delhi Cops", "description": "The Delhi Police have arrested eight people for allegedly extorting money from people using their morphed pictures obtained through a bugged loan app, officials said.", "url": "https://www.ndtv.com/india-news/fraud-loan-racket-busted-for-morphing-clients-pictures-through-app-extorting-money-delhi-police-2860752", "urlToImage": "https://c.ndtvimg.com/2021-12/fpinh51g_delhi-christmasdelhi-police-genericafp650_625x300_25_December_21.jpg", "publishedAt": "2022-04-03T22:59:04Z", "content": "Fraud loan racket: Delhi Police said the extorted money was routed by way of crypto. (Representational)\r\nNew Delhi: The Delhi Police have arrested eight people for allegedly extorting money from peop… [+4037 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "On Mass Graves, Ukraine President's Question To Russian Soldiers' Mothers", "description": "Ukraine's President Volodymyr Zelensky on Sunday said Russia's leadership was responsible for civilian killings in Bucha, outside Kyiv, where bodies were found lying in the street after the town was retaken by Ukrainian forces.", "url": "https://www.ndtv.com/world-news/ukraine-war-on-mass-graves-ukraine-president-volodymyr-zelenskys-question-to-russian-soldiers-mothers-2860796", "urlToImage": "https://c.ndtvimg.com/2022-04/gug3lmr_ukraine-bucha_625x300_03_April_22.jpg", "publishedAt": "2022-04-03T22:24:58Z", "content": "Ukraine War: Russia has denied killing civilians in Bucha, as alleged by Ukraine.\r\nKyiv: Ukraine's President Volodymyr Zelensky on Sunday said Russia's leadership was responsible for civilian killing… [+2507 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Pak Court Bars \"Unconstitutional\" Steps By State As Parliament Dissolved", "description": "Pakistan's Supreme Court has barred all state institutions from taking any \"unconstitutional\" steps after the dismissal of the no-confidence vote in the National Assembly against Prime Minister Imran Khan.", "url": "https://www.ndtv.com/world-news/pakistan-supreme-court-bars-unconstitutional-steps-by-state-as-parliament-dissolved-2860660", "urlToImage": "https://c.ndtvimg.com/b85qm20g_pakistan-supreme-court-reuters_625x300_21_July_18.jpg", "publishedAt": "2022-04-03T21:47:20Z", "content": "Pakistan President Arif Alvi earlier dissolved the National Assembly on advice of PM Imran Khan. (File)\r\nIslamabad: Pakistan's Supreme Court on Sunday barred all state institutions from taking any \"u… [+4250 chars]"}]}