{"status": "ok", "totalResults": 299, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "1 Killed, 4 Injured In Paris Bar Shooting, Suspect Arrested: Police", "description": "A gunman killed one individual and wounded four others during a shooting Monday night in Paris, local police said, adding that a suspect was in custody.", "url": "https://www.ndtv.com/world-news/1-killed-4-injured-in-paris-bar-shooting-suspect-arrested-police-3171213", "urlToImage": "https://c.ndtvimg.com/2022-04/v3q56dto_france-police-paris-police-afp-650_625x300_25_April_22.jpg", "publishedAt": "2022-07-19T00:30:36Z", "content": "According to the official, The incident took place at a cafe. (Representational)\r\nParis: A gunman killed one individual and wounded four others during a shooting Monday night in Paris, local police s… [+453 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Assembly Is Not A \"Kaurava Sabha\" To Abuse Women: Opposition To Kerala Government", "description": "Do not turn the Kerala Legislative Assembly into a 'Kaurava Sabha' where women are abused, the Congress-led UDF opposition said in the House on Monday.", "url": "https://www.ndtv.com/india-news/dont-turn-assembly-into-kaurava-sabha-opposition-slams-kerala-government-3171210", "urlToImage": "https://c.ndtvimg.com/2021-05/7cdstfgg_kerala-assembly-lakshadweep-resolution_625x300_31_May_21.jpg", "publishedAt": "2022-07-19T00:21:39Z", "content": "Opposition leader VD Satheesan said women can't be abused in Assembly. (File)\r\nThiruvananthapuram: Do not turn the Kerala Legislative Assembly into a 'Kaurava Sabha' where women are abused, the Congr… [+2362 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Boris Johnson-Led UK Government Wins Confidence Vote", "description": "British Prime Minister Boris Johnson's government on Monday won a confidence vote it had called in itself, with members of the governing Conservative Party voting in support of ministers to avoid triggering a national election.", "url": "https://www.ndtv.com/world-news/boris-johnson-led-uk-government-wins-confidence-vote-3171199", "urlToImage": "https://c.ndtvimg.com/2022-07/1b62l3r_boris-johnson_625x300_07_July_22.jpg", "publishedAt": "2022-07-18T23:44:19Z", "content": "The Boris Johsnon led government won the vote by 349 to 238.\r\nLondon: British Prime Minister Boris Johnson's government on Monday won a confidence vote it had called in itself, with members of the go… [+770 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Bill To Amend Family Courts Act Introduced In Lok Sabha", "description": "A bill was introduced in the Lok Sabha on Monday which seeks to amend Family Courts Act to provide for establishing family courts in Himachal Pradesh from February 15, 2019, and in Nagaland from September 12, 2008.", "url": "https://www.ndtv.com/india-news/bill-to-amend-family-courts-act-introduced-in-lok-sabha-3171194", "urlToImage": "https://c.ndtvimg.com/2022-02/1gn6iol8_kiren-rijijurajyasabhatwitter_625x300_03_February_22.jpg", "publishedAt": "2022-07-18T23:25:57Z", "content": "The bill was introduced by Union Law Minister Kiren Rijiju. (File)\r\nNew Delhi: A bill was introduced in the Lok Sabha on Monday which seeks to amend Family Courts Act to provide for establishing fami… [+1922 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "5 Injured In Shooting At Bar In Southern Spain, Suspect Arrested", "description": "At least five people were injured when a shooting and knife fight broke out early on Monday at the open-air Opium nightclub in Marbella in southern Spain.", "url": "https://www.ndtv.com/world-news/5-injured-in-shooting-at-marbella-bar-in-southern-spain-suspect-arrested-3171165", "urlToImage": "https://i.ndtvimg.com/i/2018-03/police-generic-international-afp_650x400_41520126059.jpg", "publishedAt": "2022-07-18T22:31:34Z", "content": "Police have also arrested a 26-year-old suspect in the case. (Representational)\r\nMadrid: At least five people were injured when a shooting and knife fight broke out early on Monday at the open-air Op… [+861 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Successfully Tests Hypersonic Missile: Pentagon", "description": "The US has successfully tested a Raytheon Technologies Corp air-breathing hypersonic weapon capable of speeds faster than five times the speed of sound, making it the third successful test of that class of weapon since 2013, the Pentagon said.", "url": "https://www.ndtv.com/world-news/us-successfully-flight-tests-3rd-hypersonic-missile-pentagon-3171153", "urlToImage": "https://c.ndtvimg.com/2021-10/6e8i71v_missile-generic_650x400_17_October_21.jpg", "publishedAt": "2022-07-18T22:12:55Z", "content": "The US and its global rivals are increasing their pace to build hypersonic weapons. (Representational)\r\nWashington: The United States has successfully tested a Raytheon Technologies Corp air-breathin… [+2207 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Turkey's Erdogan Renews Threat To \"Freeze\" Swedish, Finland's NATO Bid", "description": "Turkish President Recep Tayyip Erdogan on Monday renewed his threat to \"freeze\" the NATO membership bids of both Sweden and Finland unless the military alliance complies with Ankara's conditions.", "url": "https://www.ndtv.com/world-news/turkey-president-recep-tayyip-erdogan-renews-threat-to-freeze-swedish-finlands-nato-bid-3171134", "urlToImage": "https://c.ndtvimg.com/2020-06/qo1p6jug_tayyip-erdogan-reuters_625x300_20_June_20.jpg", "publishedAt": "2022-07-18T21:27:32Z", "content": "Last month in June, Turkey agreed to support Sweden and Finland's NATO bid in Spain.\r\nIstanbul: Turkish President Recep Tayyip Erdogan on Monday renewed his threat to \"freeze\" the NATO membership bid… [+2406 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UP Woman Accuses Man Of Hiding Religion, Living With Her For Months: Police", "description": "A woman has accused a man of having sex with her for months without marrying her and hiding the fact that he was Muslim, police here said on Monday.", "url": "https://www.ndtv.com/india-news/up-woman-accuses-man-of-hiding-religion-living-with-her-for-months-police-3171129", "urlToImage": "https://c.ndtvimg.com/2022-06/ars722ac_police-generic_625x300_14_June_22.jpg", "publishedAt": "2022-07-18T21:07:54Z", "content": "A legal action would be initiated against him, police said. (Representational)\r\nGhaziabad: A woman has accused a man of having sex with her for months without marrying her and hiding the fact that he… [+1223 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ex-Mumbai Police Chief Questioned By Probe Agency In NSE Co-Location Case", "description": "The Enforcement Directorate on Monday questioned former Mumbai Police Commissioner Sanjay Pandey for 3 hours in the National Stock Exchange (NSE)-co-location case.", "url": "https://www.ndtv.com/india-news/ex-mumbai-police-chief-sanjay-pandey-questioned-by-probe-agency-in-nse-co-location-case-3171122", "urlToImage": "https://c.ndtvimg.com/2022-07/r2ruv6c_sanjay-pandey_650x400_03_July_22.jpg", "publishedAt": "2022-07-18T20:49:51Z", "content": "Earlier on July 15, ED summoned Mr Pandey in the NSE-co location case.\r\nMumbai: The Enforcement Directorate on Monday questioned former Mumbai Police Commissioner Sanjay Pandey for 3 hours in the Nat… [+1703 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Julian Assange Committed \"No Serious Crime\": Mexico President To Biden", "description": "Mexican President Andres Manuel Lopez Obrador said Monday he had interceded with US President Joe Biden on behalf of WikiLeaks founder Julian Assange, insisting that he had committed no serious crime.", "url": "https://www.ndtv.com/world-news/julian-assange-committed-no-serious-crime-mexico-president-to-joe-biden-3171095", "urlToImage": "https://c.ndtvimg.com/2022-02/angj81s8_julian-assange_625x300_10_February_22.jpg", "publishedAt": "2022-07-18T20:25:22Z", "content": "The British government last month approved Assange's extradition to the US, prompting an appeal.\r\nMexico City: Mexican President Andres Manuel Lopez Obrador said Monday he had interceded with US Pres… [+1362 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Biden's Top Medical Advisor Dr Fauci Announces Plans For Retirement", "description": "Anthony Fauci, who has helmed the United States' response to infectious disease outbreaks since the 1980s, will retire by the end of President Joe Biden's current term, he said in interviews Monday.", "url": "https://www.ndtv.com/world-news/joe-bidens-top-medical-advisor-dr-fauci-announces-plans-for-retirement-3171090", "urlToImage": "https://c.ndtvimg.com/2020-08/4ebcv3mo_anthonyfauci650_625x300_06_August_20.jpg", "publishedAt": "2022-07-18T20:15:58Z", "content": "Fauci now lives with security protection after his family received death threats and harassment.\r\nWashington: Anthony Fauci, who has helmed the United States' response to infectious disease outbreaks… [+2663 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rishi Sunak Widens Lead In Race To Become UK PM After Party Vote", "description": "Former finance minister Rishi Sunak widened his lead in the latest round of voting Monday by Conservative MPs to decide Britain's next prime minister, but the race to get in the final two tightened.", "url": "https://www.ndtv.com/world-news/rishi-sunak-widens-lead-in-race-to-become-uk-pm-after-party-vote-3171070", "urlToImage": "https://c.ndtvimg.com/2022-07/dktbbano_rishi-sunak-reuters-650_625x300_14_July_22.jpg", "publishedAt": "2022-07-18T19:44:38Z", "content": "Former finance minister Rishi Sunak widened his lead in the latest round of voting on Monday.\r\nLondon: Former finance minister Rishi Sunak widened his lead in the latest round of voting Monday by Con… [+3681 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Congress Sonipat MLA Resigns Over \"Threat Call\", Then A U-Turn", "description": "Main opposition Congress' Sonipat MLA Surender Panwar, who recently claimed receiving threat calls, sent his resignation to the assembly Speaker, but has withdrawn it after five days.", "url": "https://www.ndtv.com/india-news/congress-sonipat-mla-surender-panwarresigns-over-threat-call-then-a-u-turn-3171055", "urlToImage": "https://c.ndtvimg.com/2020-01/dqh52igg_congress-generic_625x300_21_January_20.jpg", "publishedAt": "2022-07-18T19:27:53Z", "content": "Congress Sonipat MLA Surender Panwar said that he resigned due to personal reason.\r\nChandigarh: Main opposition Congress' Sonipat MLA Surender Panwar, who recently claimed receiving threat calls, sen… [+3516 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Religious Events Can't Hinder Traffic\": Yogi Adityanath Amid Kanwar Yatra", "description": "Uttar Pradesh Chief Minister Yogi Adityanath on Monday said roads are for people to commute and no religious activity should be allowed to hinder traffic movement.", "url": "https://www.ndtv.com/india-news/religious-events-cant-hinder-traffic-uttar-pradesh-chief-minister-yogi-adityanath-amid-kanwar-yatra-3171018", "urlToImage": "https://c.ndtvimg.com/2022-02/mkcddahg_yogi-adityanathuplakhimpur-kheripti_625x300_20_February_22.jpg", "publishedAt": "2022-07-18T18:57:09Z", "content": "No religious events should be allowed to hinder the traffic, UP Chief Minister said amid Kanwar Yatra.\r\nLucknow: Uttar Pradesh Chief Minister Yogi Adityanath on Monday said roads are for people to co… [+1586 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Delhi Gang Selling New-Born Babies Busted, 7 Arrested: Police", "description": "A two-and-a-half-month-old baby was recovered with the arrest of five women and two men, all part of gang which allegedly sold newborns to clients on pretext of giving them for adoption, police said on Monday.", "url": "https://www.ndtv.com/india-news/delhi-gang-selling-new-born-babies-busted-7-arrested-police-3171007", "urlToImage": "https://c.ndtvimg.com/2021-10/oh6j1t64_baby-generic_625x300_13_October_21.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675?ver-20220701.02", "publishedAt": "2022-07-18T18:49:47Z", "content": "A team was also immediately sent to Jharkhand to nab Qutabuddin.(Representational)\r\nNew Delhi: A two-and-a-half-month-old baby was recovered with the arrest of five women and two men, all part of gan… [+2486 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Indian Army Flags Off Motorcycle Expedition To Commemorate Kargil Victory", "description": "To commemorate the 23 years of victory over Pakistan in the Kargil War of 1999, the Indian Army on Monday organised a motorcycle expedition from New Delhi to the Kargil War Memorial at Dras (Ladakh).", "url": "https://www.ndtv.com/india-news/indian-army-flags-off-motorcycle-expedition-to-commemorate-kargil-victory-3171002", "urlToImage": "https://c.ndtvimg.com/2022-07/6g7v1lqg_bike_625x300_18_July_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675?ver-20220701.02", "publishedAt": "2022-07-18T18:46:18Z", "content": "During the rally, the team will traverse through high mountain passes and arduous tracks.\r\nNew Delhi: To commemorate the 23 years of victory over Pakistan in the Kargil War of 1999, the Indian Army o… [+1389 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Assam Opposition Alleges Discrimination In MLA Schemes To Chief Minister", "description": "Opposition MLAs in Assam -- from the Congress and CPM -- and Independent legislator Akhil Goi have alleged discrimination in allotment of schemes by the Assam government in their constituencies.", "url": "https://www.ndtv.com/india-news/assam-opposition-alleges-discrimination-in-mla-schemes-to-chief-minister-3170994", "urlToImage": "https://c.ndtvimg.com/2019-01/4fkcedhs_assam-generic_625x300_02_January_19.jpg", "publishedAt": "2022-07-18T18:42:49Z", "content": "Guwahati: Opposition MLAs in Assam -- from the Congress and CPM -- and Independent legislator Akhil Goi have alleged discrimination in allotment of schemes by the Assam government in their constituen… [+2135 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Kerala Congress Chief Apologises For Remarks Against CPI(M) Leader", "description": "KPCC president K Sudhakaran on Monday tendered an apology over his derogatory remarks against CPI(M) leader and former minister, MM Mani and said it was not intended.", "url": "https://www.ndtv.com/india-news/kerala-congress-chief-apologises-for-derogatory-remarks-against-cpi-m-leader-3170992", "urlToImage": "https://c.ndtvimg.com/2019-01/vpecd1mo_k-sudhakaran_625x300_24_January_19.jpg", "publishedAt": "2022-07-18T18:41:12Z", "content": "K Sudhakaran issued a statement saying it was a mistake and expressed apologies.(FILE)\r\nThiruvananthapuram: KPCC president K Sudhakaran on Monday tendered an apology over his derogatory remarks again… [+3018 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Delhi High Court Rejects Plea To Stop Spicejet Airline", "description": "The Delhi High Court on Monday rejected public interest litigation (PIL) seeking to stop the operation of SpiceJet airline for allegedly flying its aircraft in breach of professional and safety obligations.", "url": "https://www.ndtv.com/india-news/delhi-high-court-rejects-plea-to-stop-spicejet-airline-3170981", "urlToImage": "https://c.ndtvimg.com/2022-07/qf10s6n8_spicejet-landing-karachi-650_650x400_05_July_22.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=675?ver-20220701.02", "publishedAt": "2022-07-18T18:35:55Z", "content": "The court said the \"DGCA is very much working\".(File)\r\nNew Delhi: The Delhi High Court on Monday rejected public interest litigation (PIL) seeking to stop the operation of SpiceJet airline for allege… [+2573 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Video: Car Washed Away In Heavy Rain In Madhya Pradesh's Ujjain", "description": "A jeep was washed away amid heavy rains in Ujjain. All the passengers in the vehicles are safe.", "url": "https://www.ndtv.com/india-news/video-car-washed-away-in-heavy-rain-in-madhya-pradeshs-ujjain-3170976", "urlToImage": "https://c.ndtvimg.com/2022-07/c4jiptog_ujjain-jeep-washed-away_625x300_19_July_22.jpg", "publishedAt": "2022-07-18T18:32:20Z", "content": "A video of the incident shows the jeep get caught in a strong current and washed away off the bridge.\r\nBhopal: Their car got stuck as they were crossing a bridge amid heavy rains. They stepped out an… [+738 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Asian News International", "title": "West Indies Cricketers Lendl Simmons, Denesh Ramdin Announce Retirement", "description": "Denesh Ramdin played 284 matches for West Indies, while Lendl Simmons represented the side in 144 matches.", "url": "https://sports.ndtv.com/cricket/west-indies-cricketers-lendl-simmons-denesh-ramdin-announce-retirement-3170957", "urlToImage": "https://c.ndtvimg.com/2020-01/tf3qq7p8_lendl-simmons-t20i-afp_625x300_20_January_20.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-18T18:22:45Z", "content": "Former West Indies skipper Denesh Ramdin announced his retirement from international cricket with immediate effect on Monday. Ramdin played his last match for West Indies in a T20I in December 2019. … [+1731 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "10 Captive-Bred Vultures Of Critically Endangered Species Released In Bengal", "description": "India marked a landmark moment for vulture conservation with the second phase of reintroduction programme of critically endangered Oriental White-backed Vulture at Rajabhatkhawa near the Buxa Tiger Reserve in Alipurduar of West Bengal.", "url": "https://www.ndtv.com/india-news/10-captive-bred-vultures-of-critically-endangered-species-released-in-bengal-3170941", "urlToImage": "https://c.ndtvimg.com/2022-07/pu4ev2j_vulture-conservation-650_625x300_18_July_22.jpg", "publishedAt": "2022-07-18T18:16:03Z", "content": "Ten critically endangered Oriental White-backed Vulture were released from an aviary\r\nRajabhatkhawa, Alipurduar, West Bengal: India marked a landmark moment for vulture conservation with the second p… [+4853 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "AAP Holds Protests In Gujarat Against PM Modi's 'Revdi Culture' Remark", "description": "Workers of the Aam Aadmi Party (AAP) held demonstrations across Gujarat to protest Prime Minister Narendra Modi's recent remark on \"revdi culture\" of offering freebies to people for votes.", "url": "https://www.ndtv.com/india-news/aap-holds-protests-in-gujarat-against-pm-modis-revadi-culture-remark-3170901", "urlToImage": "https://c.ndtvimg.com/2022-07/t88ftapo_aap_625x300_18_July_22.jpg", "publishedAt": "2022-07-18T17:56:06Z", "content": "AAP has based its electoral campaign in Gujarat by showcasing the Delhi model.\r\nAhmedabad: Workers of the Aam Aadmi Party (AAP) held demonstrations across Gujarat to protest Prime Minister Narendra M… [+1905 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Renowned Ghazal Singer Bhupinder Singh Dies At 82", "description": "Renowned ghazal singer Bhupinder Singh, known for crooning classics like \"Naam Gum Jayega\" and \"Dil Dhoondta Hai\", died on Monday due to suspected colon cancer and COVID-19-related complications at a city hospital, his wife Mitali Singh said.", "url": "https://www.ndtv.com/india-news/renowned-ghazal-singer-bhupinder-singh-dies-at-82-3170868", "urlToImage": "https://c.ndtvimg.com/2022-07/7dtpej6s_bhupinder-singh_625x300_18_July_22.jpg", "publishedAt": "2022-07-18T17:46:50Z", "content": "Mumbai: Renowned ghazal singer Bhupinder Singh, known for crooning classics like \"Naam Gum Jayega\" and \"Dil Dhoondta Hai\", died on Monday due to suspected colon cancer and COVID-19-related complicati… [+2806 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Schools In Meerut To Be Closed Till July 27 Due To Kanwar Yatra", "description": "The decision has been taken keeping in mind the problems students might face due to route diversions during the yatra.", "url": "https://www.ndtv.com/education/schools-in-uttar-pradeshs-meerut-to-be-closed-till-july-27-due-to-kanwar-yatra", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/18/shutterstock_1678762114.jpg", "publishedAt": "2022-07-18T17:33:45Z", "content": "Meerut:The Meerut administration on Monday ordered closure of all schools in the district till July 27 in view of the ongoing Kanwar Yatra. On directives of the administration, District Inspector of … [+595 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Debunking Fake News Is Not Crime\": Amnesty India On Mohammed Zubair Case", "description": "Human rights group Amnesty India has demanded immediate and unconditional release of fact-checking website Alt News co-founder Mohammed Zubair, saying debunking fake news is not a crime.", "url": "https://www.ndtv.com/india-news/debunking-fake-news-is-not-crime-amnesty-india-on-mohammed-zubair-case-3170825", "urlToImage": "https://c.ndtvimg.com/2022-06/26njv9s4_mohammed-zubair-ani-650_625x300_30_June_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675?ver-20220701.02", "publishedAt": "2022-07-18T17:31:24Z", "content": "His detention is a reminder that \"you are not allowed to speak the truth in India\": Amnesty india.(File)\r\nNew Delhi: Human rights group Amnesty India has demanded immediate and unconditional release … [+979 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Asian News International", "title": "CBI Books Ex-President of IOA, HI Officials In Corruption Case", "description": "A senior CBI official informed that they conducted the raids after preliminary enquiry and registered a case against the former IOA president Narinder Dhruv Batra and other office bearers of the IOA in New Delhi.", "url": "https://sports.ndtv.com/othersports/cbi-books-ex-president-of-indian-olympic-association-hockey-india-officials-in-corruption-case-3170802", "urlToImage": "https://c.ndtvimg.com/2019-11/m79mo488_narinder-batra-afp_625x300_14_November_19.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-18T17:24:06Z", "content": "The Central Bureau of Investigation (CBI) on Monday conducted searches at the premises of Hockey India (HI) and the Indian Olympic Association (IOA) at Delhi and Jammu in a corruption case. A senior … [+1389 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Over 80 Lakh National Flags To Be Hoisted In Assam", "description": "Along with the rest of the country, 80 lakh national flags will be hoisted in houses, offices and commercial establishments across Assam from August 13 to 15, officials have said.", "url": "https://www.ndtv.com/india-news/over-80-lakh-national-flags-to-be-hoisted-in-assam-3170794", "urlToImage": "https://c.ndtvimg.com/indian-flag-tricolour-generic-pixabay_625x300_1529830758454.jpg", "publishedAt": "2022-07-18T17:19:57Z", "content": "The idea behind the initiative is to invoke the feeling of patriotism in the hearts of the people\r\nGuwahati: Along with the rest of the country, 80 lakh national flags will be hoisted in houses, offi… [+1284 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russian Shelling Kills 6 In Donbas, EU Defends Sanctions On Moscow", "description": "Russian shelling of a town in eastern Ukraine Monday killed six people, Kyiv said, as EU ministers meeting in Brussels insisted that the pressure of Western sanctions on Moscow was working.", "url": "https://www.ndtv.com/world-news/russian-shelling-kills-6-in-donbas-eu-defends-sanctions-on-moscow-3170787", "urlToImage": "https://c.ndtvimg.com/2022-07/9q9dkr3_russia-ukraine_625x300_18_July_22.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=675?ver-20220701.02", "publishedAt": "2022-07-18T17:16:12Z", "content": "Russia has captured the sister cities of Lysychansk and Severodonetsk.\r\nKyiv: Russian shelling of a town in eastern Ukraine Monday killed six people, Kyiv said, as EU ministers meeting in Brussels in… [+5157 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Not Going To Be Scared\": Opposition's Vice President Pick Margaret Alva", "description": "Opposition vice-presidential candidate Margaret Alva on Monday said she will contest against National Democratic Alliance (NDA) contender Jagdeep Dhankhar and will not get scared by anyone.", "url": "https://www.ndtv.com/india-news/not-going-to-be-scared-oppositions-vice-president-pick-margaret-alva-3170757", "urlToImage": "https://i.ndtvimg.com/i/2016-07/margaret-alva_650x400_81468694725.jpg", "publishedAt": "2022-07-18T17:08:46Z", "content": "New Delhi: Opposition vice-presidential candidate Margaret Alva on Monday said she will contest against National Democratic Alliance (NDA) contender Jagdeep Dhankhar and will not get scared by anyone… [+1614 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Kerala Police Summons Film Director For Social Media Post On Hindu Gods", "description": "Kerala police on Monday issued notice to director Akhila Henry, popularly known as Kunjila Mascillamani, to appear before it in connection with a case filed against her in May for a social media post allegedly insulting Hindu Gods.", "url": "https://www.ndtv.com/india-news/kerala-police-summons-film-director-kunjila-mascillamani-for-social-media-post-on-hindu-gods-3170739", "urlToImage": "https://c.ndtvimg.com/2022-07/toms1028_kunjila-mascillamani_625x300_18_July_22.jpg", "publishedAt": "2022-07-18T17:04:17Z", "content": "Thrissur, Kerala: Kerala police on Monday issued notice to director Akhila Henry, popularly known as Kunjila Mascillamani, to appear before it in connection with a case filed against her in May for a… [+807 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "World Democracy And Freedom Under Assault: Prince Harry At UN", "description": "Britain's Prince Harry told the UN Monday that the overturning of constitutional rights in the United States was part of \"a global assault on democracy and freedom.\"", "url": "https://www.ndtv.com/world-news/world-democracy-and-freedom-under-assault-prince-harry-at-un-3170738", "urlToImage": "https://c.ndtvimg.com/2022-07/qnrgbc1_prince-harry_625x300_18_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675?ver-20220701.02", "publishedAt": "2022-07-18T17:04:14Z", "content": "Prince Harry cited the continuing fallout from the pandemic and climate change.\r\nUnited Nations: Britain's Prince Harry told the UN Monday that the overturning of constitutional rights in the United … [+2277 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "JMI Records Over 70% Attendance On Day 1 Of New Academic Session", "description": "Jamia Millia Islamia recorded more than 70 per cent attendance on the first day of the academic session 2022-23.", "url": "https://www.ndtv.com/education/jamia-millia-islamia-records-over-70-percent-attendance-on-day-1-of-new-academic-session", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/18/Jamia-Millia-Islamia.jpg", "publishedAt": "2022-07-18T17:03:16Z", "content": "New Delhi:Jamia Millia Islamia recorded more than 70 per cent attendance on the first day of the academic session 2022-23, university officials said on Monday. Starting Monday, the Central University… [+1253 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Company Founded By Mumbai Ex Top Cop Violated SEBI Norms: CBI", "description": "A company founded by Mumbai's former police commissioner Sanjay Pandey had allegedly violated SEBI norms in auditing two NSE stock brokers who were using the scam-tainted co-location facility, officials said Monday.", "url": "https://www.ndtv.com/india-news/company-founded-by-mumbai-ex-top-cop-violated-sebi-norms-cbi-3170640", "urlToImage": "https://c.ndtvimg.com/2021-08/fo97nvac_cbi-building-facebook_625x300_25_August_21.jpeg", "publishedAt": "2022-07-18T16:34:46Z", "content": "New Delhi: A company founded by Mumbai's former police commissioner Sanjay Pandey had allegedly violated SEBI norms in auditing two NSE stock brokers who were using the scam-tainted co-location facil… [+3745 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Vice President Poll: Opposition Leaders At Sharad Pawar Home For Strategy", "description": "Leaders of opposition parties on Monday met at the residence of NCP chief Sharad Pawar to chalk out the joint strategy for their vice presidential candidate Margaret Alva.", "url": "https://www.ndtv.com/india-news/vice-president-poll-opposition-leaders-at-sharad-pawar-home-for-strategy-3170603", "urlToImage": "https://c.ndtvimg.com/2022-07/28o5m14k_pawar-meet-650_625x300_18_July_22.jpg", "publishedAt": "2022-07-18T16:25:19Z", "content": "The vice presidential election will be held on August 6\r\nNew Delhi: Leaders of opposition parties on Monday met at the residence of NCP chief Sharad Pawar to chalk out the joint strategy for their vi… [+1181 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Centre Sets Up Committee To Strengthen Minimum Support Price System", "description": "The government on Monday formed a committee on Minimum Support Price (MSP), eight months after it promised to set up such a panel while withdrawing the three contentious farm laws.", "url": "https://www.ndtv.com/india-news/centre-sets-up-committee-to-strengthen-minimum-support-price-system-3170590", "urlToImage": "https://c.ndtvimg.com/2019-07/sabomsfo_kharif-crops-hit-monsoon-deficit-650_625x300_02_July_19.jpg", "publishedAt": "2022-07-18T16:23:28Z", "content": "The panel will look at ways to strengthen the Agricultural Marketing System. (Representational)\r\nNew Delhi: The government on Monday formed a committee on Minimum Support Price (MSP), eight months af… [+2654 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ladakh Row: India, China Agree To Work Out Mutually Acceptable Resolution", "description": "The Indian and Chinese armies agreed to work out a mutually acceptable resolution of the remaining issues in eastern Ladakh at the earliest during their 16th round of high-level talks on Sunday.", "url": "https://www.ndtv.com/india-news/ladakh-row-india-china-agree-to-work-out-mutually-acceptable-resolution-3170583", "urlToImage": "https://c.ndtvimg.com/2021-12/2ldtl09g_leh-ladakh_625x300_24_December_21.jpg", "publishedAt": "2022-07-18T16:20:36Z", "content": "The two sides agreed to maintain the security and stability on the ground in the region.\r\nNew Delhi: The Indian and Chinese armies agreed to work out a mutually acceptable resolution of the remaining… [+2215 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "In Assam, Congress, Ex-Ally Exchange Tit-For-Tat Cross-Voting Allegations", "description": "The Opposition unity once again took a hit today during the voting for presidential election in the Assam. The two main opposition parties -- the Congress and the AIUDF -- accused each other of cross-voting.", "url": "https://www.ndtv.com/india-news/in-assam-congress-ex-ally-exchange-tit-for-tat-cross-voting-allegations-3170489", "urlToImage": "https://c.ndtvimg.com/2022-07/3q8i8q98_draupadi-murmu-yashwant-sinha_625x300_18_July_22.jpg", "publishedAt": "2022-07-18T15:57:03Z", "content": "NDA's Droupadi Murmu is up against opposition's Yashwant Sinha.\r\nGuwahati: The Opposition unity once again took a hit today during the voting for presidential election in the Assam. The two main oppo… [+2008 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "We Have To Respect Our Weapon, Then Only World Will Respect Them: PM Modi", "description": "The world will not respect our indigenously developed weapons unless we do it ourselves, said Prime Minister Narendra Modi on Monday.", "url": "https://www.ndtv.com/india-news/we-have-to-respect-our-weapon-then-only-world-will-respect-them-pm-modi-3170485", "urlToImage": "https://c.ndtvimg.com/2022-07/e9i8f018_pm-modi_625x300_18_July_22.jpg", "publishedAt": "2022-07-18T15:55:00Z", "content": "New Delhi: The world will not respect our indigenously developed weapons unless we do it ourselves, said Prime Minister Narendra Modi on Monday.\r\nSpeaking at Naval Innovation and Indigenisation Organ… [+1749 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "\"Dande Pe Daal...\": Pant's Input To Chahal Before He Gets Topley. Watch", "description": "Yuzvendra Chahal did exactly what Rishabh Pant asked him to do and the result saw the ball disturbing the stumps of Reece Topley.", "url": "https://sports.ndtv.com/england-vs-india-2022/india-vs-england-dande-pe-daal-rishabh-pants-input-helps-yuzvendra-chahal-dismiss-reece-topley-watch-3170484", "urlToImage": "https://c.ndtvimg.com/2022-07/9dk74a6o_yuzvendra-chahal-afp_625x300_14_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-18T15:54:15Z", "content": "Rishabh Pant was at his very best on Sunday as the player helped India beat England by five wickets in the ODI-series decider. Pant scored an unbeaten 125 off 113 balls to help India chase down 260 r… [+1454 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Rashi Hardaha", "title": "Telangana TS DEECET 2022 Hall Ticket Issued; Direct Link To Download", "description": "TS DEECET 2022 Hall Ticket: To access the Telangana DEECET 2022 hall ticket, the candidates will need to enter their registration number, payment reference ID, mobile number, and date of birth.", "url": "https://www.ndtv.com/education/telangana-ts-deecet-2022-hall-ticket-issued-direct-link-to-download", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/18/ts_deecet_hall_ticket.jpg", "publishedAt": "2022-07-18T15:51:12Z", "content": "TS DEECET 2022 Hall Ticket: The Telangana State Diploma in Elementary Education Common Entrance Test (TS DEECET) 2022 admit card has been released today, July 18. The Department of School Education, … [+1109 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Modiji's Masterstroke\": Opposition's Barb On GST Rate Hike", "description": "The Opposition on Monday attacked the centre over imposing Goods and Services Tax (GST) on packaged food items such as milk and curd, saying it was Prime Minister Narendra Modi's \"masterstroke\" of making India miserable.", "url": "https://www.ndtv.com/india-news/modijis-masterstroke-oppositions-barb-on-gst-rate-hike-3170465", "urlToImage": "https://c.ndtvimg.com/2022-07/ta2t557o_gst_625x300_18_July_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675?ver-20220701.02", "publishedAt": "2022-07-18T15:48:55Z", "content": "Priyanka Gandhi said: \"the poor and middle class were being maligned with the talk of \"Revadi culture\".\r\nNew Delhi: The Opposition on Monday attacked the centre over imposing Goods and Services Tax (… [+4142 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Monkeypox FAQs: Here's All You Need To Know", "description": "India reported its second case of monkeypox in Kerala's Kannur district on Monday. The 31-year-old patient, who travelled from Dubai, is currently undergoing treatment at a hospital.", "url": "https://www.ndtv.com/india-news/monkeypox-faqs-heres-all-you-need-to-know-3170460", "urlToImage": "https://c.ndtvimg.com/2022-06/7ucfmppg_monkeypox_625x300_09_June_22.jpg", "publishedAt": "2022-07-18T15:48:44Z", "content": "Monkeypox is a viral zoonotic infection caused by the monkeypox virus (Representational photo)\r\nNew Delhi: India reported its second case of monkeypox in Kerala's Kannur district on Monday. The 31-ye… [+3710 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "BJP's Sunny Deol Among 8 MPs Who Did Not Vote In Presidential Poll", "description": "BJP MP and actor Sunny Deol was among eight MPs who missed casting their votes in the presidential poll on Monday due to various reasons.", "url": "https://www.ndtv.com/india-news/8-mps-including-bjps-sunny-deol-fail-to-cast-vote-in-presidential-poll-3170390", "urlToImage": "https://c.ndtvimg.com/2020-12/1vmi8kh4_sunny-deol-_625x300_06_December_20.jpg", "publishedAt": "2022-07-18T15:31:02Z", "content": "Sunny Deol is abroad for medical treatment. (FILE)\r\nNew Delhi: BJP MP and actor Sunny Deol was among eight MPs who missed casting their votes in the presidential poll on Monday due to various reasons… [+1316 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Video: Assam Auto Driver Punched, Kicked By Cops For Not Stopping", "description": "An autorickshaw driver was kicked, thrashed, punched repeatedly in full public view by two policemen, one in civilian attire, on a street in Assam's Karbi Anglong for allegedly not stopping when the policemen signalled him to do so.", "url": "https://www.ndtv.com/india-news/in-video-assam-auto-driver-punched-kicked-by-cops-for-not-stopping-3170387", "urlToImage": "https://c.ndtvimg.com/2022-07/0fd1tfv_assam-auto-driver-650_625x300_18_July_22.jpg", "publishedAt": "2022-07-18T15:30:54Z", "content": "They policemen held him by his neck and throw him into the waiting police car.\r\nGuwahati: An autorickshaw driver was kicked, thrashed, punched repeatedly in full public view by two policemen, one in … [+676 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Zlatan Ibrahimovic Extends Stay With Italian Champions AC Milan", "description": "Zlatan Ibrahimovic is out of action until at least early next year after having had the anterior cruciate ligament in his left knee reconstructed in May.", "url": "https://sports.ndtv.com/football/zlatan-ibrahimovic-extends-stay-with-italian-champions-ac-milan-3170380", "urlToImage": "https://c.ndtvimg.com/2022-05/doocini8_zlatan-ibrahimovic-afp_625x300_27_May_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-18T15:30:28Z", "content": "Zlatan Ibrahimovic will stay at AC Milan for at least one more year after the veteran striker signed a new one-year contract with the Italian champions on Monday. \"AC Milan is pleased to announce the… [+1105 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Shinde Faction Set To Form Separate Group In Lok Sabha, Claims Party Leader", "description": "At least 12 of the 19 Members of Parliament (MPs) of Shiv Sena will form a separate group in the Lok Sabha and meet Speaker Om Birla to submit a formal letter, a Shiv Sena MP from Maharashtra claimed on Monday.", "url": "https://www.ndtv.com/india-news/12-shiv-sena-mps-to-form-separate-group-in-lok-sabha-claims-party-leader-3170368", "urlToImage": "https://c.ndtvimg.com/2022-07/84k755ho_maharashtra-chief-minister-eknath-shinde-pti-pic_650x400_04_July_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675?ver-20220701.02", "publishedAt": "2022-07-18T15:26:26Z", "content": "The move to form a separate group of 12 Shiv Sena MPs comes weeks after a rebellion of 40 MLAs.(File)\r\nMumbai: A group of 12 Shiv Sena Members of Parliament (MPs) on Monday attended the \"national exe… [+3064 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "AAP MP To Donate Salary For Higher Education Of Punjabi Students", "description": "AAP MP Vikramjit Singh Sahney announced he will donate his entire salary and that of his staff to support higher education of students coming from economically weaker sections in Punjab.", "url": "https://www.ndtv.com/education/aam-aadmi-party-mp-commits-to-donate-entire-salary-for-higher-education-of-punjabi-students", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/18/shutterstock_1668238435.jpg", "publishedAt": "2022-07-18T15:23:59Z", "content": "New Delhi:Newly elected AAP MP Vikramjit Singh Sahney on Monday announced he will donate his entire salary and that of his staff to support higher education of students coming from economically weake… [+1004 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "IIT-Palakkad, Continental's Technical Center India Ink Pact", "description": "Under the collaboration, Continental and IIT-Palakkad will research, develop and build competencies in optimising high-performance computing, simulation models for image and video processing chain for autonomous driving, and autonomous mobility safety feature…", "url": "https://www.ndtv.com/education/iit-palakkad-continentals-technical-center-india-ink-pact-for-research-on-autonomous-driving-technologies", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/18/iit-palakkad.jpg", "publishedAt": "2022-07-18T15:22:22Z", "content": "Mumbai:Continental's Technical Center India (TCI) has signed a pact with IIT-Palakkad for a 3-year joint research programme, focusing on autonomous driving technologies, connected mobility and safety… [+2397 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "SL vs PAK: Nawaz Relishing Test Return With \"Dream\" Five-Wicket Haul", "description": "Mohammad Nawaz made his debut across formats in 2016 but his Test career came to a halt after just three matches against West Indies in the United Arab Emirates.", "url": "https://sports.ndtv.com/cricket/sri-lanka-vs-pakistan-mohammad-nawaz-relishing-test-return-with-dream-five-wicket-haul-3170342", "urlToImage": "https://c.ndtvimg.com/2022-07/g77vtang_mohammad-nawaz-afp_625x300_18_July_22.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-18T15:17:59Z", "content": "Pakistan all-rounder Mohammad Nawaz said Monday that his maiden five-wicket haul on return to Test cricket was a \"dream\" performance he aimed to repeat. The 28-year-old Nawaz, who played just three T… [+1775 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Supreme Court Stays Court Judge's Directions On Bail Plea In Bribery Case", "description": "The Supreme Court on Monday stayed directions of Karnataka High Court judge Justice H P Sandesh in a bail plea in a bribery case. The Supreme Court bench comprising CJI NV Ramana said the high court judge made some \"irrelevant observations\".", "url": "https://www.ndtv.com/india-news/supreme-court-stays-karnataka-high-court-judgejustice-h-p-sandeshs-directions-on-bail-plea-in-bribery-case-3170335", "urlToImage": "https://c.ndtvimg.com/2020-08/iffcjvrg_supreme-court_625x300_25_August_20.jpg", "publishedAt": "2022-07-18T15:14:11Z", "content": "The Supreme Court said it requests the High Court to consider bail plea of the accused.\r\nNew Delhi: In a significant development, the Supreme Court on Monday stayed directions, including seeking clos… [+4163 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "New Tax Changes To Offset Fuel Duty Cut And Boost Collection: Report", "description": "Changes in import duty and a windfall tax on fuel exports will offset duty cuts on fuels and increase overall tax collection over the budget target this fiscal to Rs 20.70 lakh crore, per a report.", "url": "https://www.ndtv.com/business/tax-changes-to-offset-duty-cut-on-fuel-boost-tax-mop-up-by-rs-1-35-lakh-crore-over-budget-target-report-3170331", "urlToImage": "https://c.ndtvimg.com/2022-07/fpfot7k8_image_625x300_18_July_22.jpg", "publishedAt": "2022-07-18T15:12:59Z", "content": "Tax changes to offset duty cut on fuel; boost tax mop-up over budget target: Report\r\nMumbai: Changes in import duty and a windfall tax on fuel exports will offset duty cuts on fuels and increase over… [+4126 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Katrina-Vicky And Friends Had This Much Fun In Maldives. See New Pics", "description": "Katrina Kaif celebrated her birthday with friends in the Maldives", "url": "https://www.ndtv.com/entertainment/katrina-kaif-vicky-kaushal-and-friends-had-this-much-fun-in-maldives-see-new-pics-3170310", "urlToImage": "https://c.ndtvimg.com/2022-07/49ihccc8_vicky-kaushal_625x300_18_July_22.jpg", "publishedAt": "2022-07-18T15:07:36Z", "content": "A still from Vicky Kaushal's video. (courtesy: vickykaushal09)\r\nNew Delhi: The posts from Katrina Kaif and Vicky Kaushal's Maldives diaries keep getting better and better. On Monday, Vicky Kaushal po… [+2066 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Mridusmita Deka", "title": "NTA Asks Candidates To Reach Day 3 CUET Exam Centre As On Admit Card", "description": "CUET UG 2022: The third day of entrance test for admission to UG courses in central universities is scheduled to be held tomorrow, July 19.", "url": "https://www.ndtv.com/education/cuet-ug-2022-nta-asks-candidates-to-reach-day-3-exam-centre-as-mentioned-on-admit-card", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/18/cuet-exam-centre-admit-card-featured-image.jpg", "publishedAt": "2022-07-18T15:02:32Z", "content": "New Delhi:The Common Universities Entrance Test Undergraduate (CUET UG) is underway. The CUET UG 2022 exam which started the exam on Friday, July 15 will end on August 20. The third day of entrance t… [+1796 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Do Periodic Review Of Mask Norms In Flights: Court To Aviation Regulator", "description": "The Delhi High Court asked the Directorate General of Civil Aviation to carry out a periodic review of the Covid situation to decide the norms on wearing masks during air travel while complying with the instructions issued by the government.", "url": "https://www.ndtv.com/india-news/do-periodic-review-of-mask-norms-on-flights-delhi-high-court-to-aviation-regulator-dgca-3170267", "urlToImage": "https://c.ndtvimg.com/2021-05/lg1rco9_delhi-high-court-_625x300_18_May_21.jpg", "publishedAt": "2022-07-18T14:58:46Z", "content": "The court said, things have changed and now there are few cases of Covid.\r\nNew Delhi: The Delhi High Court on Monday asked the Directorate General of Civil Aviation (DGCA) to carry out a periodic rev… [+3751 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Aditya Kumar", "title": "\"Countless ODI Memories\": Stokes' Sudden ODI Retirement Breaks Internet", "description": "England all-rounder Ben Stokes has played 104 ODIs for the side so far scoring 2919 runs and taking 74 wickets.", "url": "https://sports.ndtv.com/cricket/countless-odi-memories-ben-stokes-sudden-odi-retirement-breaks-the-internet-3170264", "urlToImage": "https://c.ndtvimg.com/2022-07/bpng1osg_ben-stokes-twitter_625x300_18_July_22.jpg", "publishedAt": "2022-07-18T14:58:39Z", "content": "Ben Stokes on Monday surprised the world by announcing sudden retirement from ODI cricket. The southpaw informed on social media that England's upcoming ODI against South Africa on Tuesday, which wil… [+2560 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Supreme Court Tells Amrapali Group To First Give Home Buyers Their Flats", "description": "The Supreme Court listed its priority to the Amrapali Group and said it has to first give buyers their homes and thereafter at the end it will \"certainly look\" into their claims of money lenders of the real estate group.", "url": "https://www.ndtv.com/india-news/youll-be-in-the-queue-supreme-court-tells-amrapali-groups-to-first-give-buyers-their-homes-3170204", "urlToImage": "https://c.ndtvimg.com/2021-04/hmt8eqi8_supreme-court-_650x400_30_April_21.jpg", "publishedAt": "2022-07-18T14:45:03Z", "content": "The Supreme Court bench said it would take the rest of the matter on June 25.\r\nNew Delhi: The Supreme Court Monday clarified that its priority is that hassled home buyers of Amrapali Group of compani… [+4905 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Adarsh Srivastava", "title": "Telangana TS ICET 2022 Admit Card Out: Direct Link; Steps To Download", "description": "Kakatiya University, Warangal has released the Telangana State Integrated Common Entrance Test (TSICET) 2022 hall ticket today, July 18.", "url": "https://www.ndtv.com/education/telangana-ts-icet-2022-admit-card-out-direct-link-steps-download", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/18/TS-ICET-2022-Admit-Card.jpg", "publishedAt": "2022-07-18T14:37:33Z", "content": "New Delhi:TS ICET 2022 Admit Card: Kakatiya University, Warangal has released the Telangana State Integrated Common Entrance Test (TSICET) 2022 hall ticket today, July 18. Candidates can download the… [+2153 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Jharkhand Girl Allegedly Kills Husband After Being Asked Not To Wear Jeans", "description": "The police on Monday detained a teenage girl following a complaint by her in-laws that she killed her 18-year-old husband during a fight over her wearing jeans, an officer in Jharkhands Jamtara district said.", "url": "https://www.ndtv.com/india-news/jharkhand-girl-allegedly-kills-husband-after-being-asked-not-to-wear-jeans-3170153", "urlToImage": "https://i.ndtvimg.com/i/2018-02/police-generic_650x400_51519652141.jpg", "publishedAt": "2022-07-18T14:34:39Z", "content": "The police are investigating the case from all angles (Representational)\r\nJamtara, Jharkhand: The police on Monday detained a teenage girl following a complaint by her in-laws that she killed her 18-… [+1919 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Set To Be President, Droupadi Murmu No Stranger To Being 1st At Something", "description": "Droupadi Murmu, BJP-led NDA candidate, is poised to win the presidential polls, though results will be out on July 21. NDTV visited her village in Odisha, tracing her story from when she first left for Bhubaneshwar", "url": "https://www.ndtv.com/india-news/set-to-be-president-droupadi-murmu-no-stranger-to-being-first-at-something-from-tribal-village-in-odisha-to-delhis-raisina-hill-3170148", "urlToImage": "https://c.ndtvimg.com/2022-06/sgu1ksjo_droupadi-murmu-in-parliament-pti-pic_650x400_24_June_22.jpg", "publishedAt": "2022-07-18T14:34:21Z", "content": "Rairangur (Odisha): Droupadi Murmu is no stranger to being the first at something. She is set to be the first tribal President of India, but it started when she was barely out of her teens when she l… [+2103 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Asian News International", "title": "\"Future Of ODIs Uncertain\": Ex-India Star Comments Post Stokes' Retirement", "description": "Ben Stokes has played 104 ODI matches and is set to end his international career in the ODI format on his home ground in Durham.", "url": "https://sports.ndtv.com/cricket/future-of-odis-looks-uncertain-ex-india-stars-bold-prediction-after-ben-stokes-retirement-3170132", "urlToImage": "https://c.ndtvimg.com/2019-12/cb1ll6h8_ben-stokes-afp_650x400_24_December_19.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-18T14:27:51Z", "content": "Former Indian spinner Pragyan Ojha feels the future of One Day International (ODI) cricket looks uncertain as compared to Tests, after England all-rounder Ben Stokes announced that he will retire fro… [+1438 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UK TV Debate Cancelled After Conservative MPs Fear Damage To Party Image", "description": "Television bosses in the UK were forced to cancel a debate on Sky News after Conservative Party MPs fear damage these television debates can do to the image of the party, exposing, disagreements, splits within the party.", "url": "https://www.ndtv.com/world-news/uk-tv-debate-cancelled-after-conservative-mps-fear-damage-to-party-image-3170094", "urlToImage": "https://c.ndtvimg.com/2022-07/8pq3ale4_uk-pm-race-afp_625x300_16_July_22.jpg", "publishedAt": "2022-07-18T14:19:04Z", "content": "Rishi Sunak, Liz Truss pulled out of the Sky News debate which was scheduled for Tuesday night.\r\nLondon: Television bosses were on Monday forced to scrap a planned debate between contenders for the l… [+2694 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Love Goan Food? The Lodhi, New Delhi Presents An Exclusive Pop-Up With Goa's Cavatina", "description": "The Lodhi, Delhi is calling all Goan food lovers for an exclusive pop-up 'Gourmet Goan Gusto' in collaboration with Cavatina.", "url": "https://food.ndtv.com/reviews/love-goan-food-the-lodhi-new-delhi-presents-an-exclusive-pop-up-with-goas-cavatina-3170093", "urlToImage": "https://c.ndtvimg.com/2022-07/gqkfcqro_goan-food-the-lodhi_625x300_18_July_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-18T14:18:47Z", "content": "Lush green landscapes, serene beaches and the invigorating aroma of seafood - Goa is a haven for foodies. Bringing the authentic flavours of Goa straight to our city, The Lodhi, Delhi is calling all … [+2697 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Neha Dhupia Is Living Her Best Life In Maldives. See Pics", "description": "Neha Dhupia checked into Maldives a few days ago", "url": "https://www.ndtv.com/entertainment/neha-dhupia-is-living-her-best-life-in-maldives-see-pics-3170084", "urlToImage": "https://c.ndtvimg.com/2022-07/45gv2pl8_neha-dhupia_625x300_18_July_22.jpg", "publishedAt": "2022-07-18T14:17:50Z", "content": "Neha Dhupia shared this image. (courtesy: nehadhupia)\r\nNew Delhi: Neha Dhupia is holidaying at a celeb-approved location, pictures from which she shared on her Instagram profile on Monday. Any guesse… [+1268 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Probe Agency Arrests 8 For Allegedly 'Rigging' Medical Exam NEET", "description": "The Central Bureau of Investigation arrested eight people today for involvement in a \"rigging racket\" in the NEET medical entrance exam on Sunday.", "url": "https://www.ndtv.com/india-news/neet-2022-probe-agency-arrests-8-for-allegedly-rigging-medical-exam-neet-3170057", "urlToImage": "https://c.ndtvimg.com/2022-07/pclu1cvg_exam-generic_625x300_06_July_22.jpg", "publishedAt": "2022-07-18T14:13:02Z", "content": "New Delhi: The Central Bureau of Investigation arrested eight people today for involvement in a \"rigging racket\" in the NEET medical entrance exam on Sunday. Officials alleged that the impersonators … [+880 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Team Careers360", "title": "NEET Rank Predictor 2022 Launched; Check Estimated Rank In NEET UG", "description": "Candidates who are worried about their rank in the medical entrance exam can check the \"NEET Rank Predictor 2022\" launched by Careers360. The NEET rank predictor tool helps the candidate calculate the estimated rank in the NEET exam.", "url": "https://www.ndtv.com/education/neet-rank-predictor-2022-launched-heres-how-to-predict-estimated-rank-in-neet-ug-exam", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/18/neet-rank-predictor.jpg", "publishedAt": "2022-07-18T14:11:51Z", "content": "New Delhi:The National Eligibility cum Entrance Test (NEET) 2022 was held on July 17. The National Testing Agency (NTA) conducted the NEET UG 2022 exam in the offline mode as pen and paper-based at 5… [+2173 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "\"Do Not Miss\": Indian Dressing Room Celebrates Series Win vs ENG. Watch", "description": "BCCI shared a video on social media in which the players of the Indian team could be seen celebrating their ODI series win over England", "url": "https://sports.ndtv.com/england-vs-india-2022/india-vs-england-3rd-odi-do-not-miss-indian-dressing-room-celebrates-memorable-series-win-vs-england-watch-3170039", "urlToImage": "https://c.ndtvimg.com/2022-07/hq4pki7_rohit-sharma-afp_625x300_18_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-18T14:08:28Z", "content": "Team India on Sunday defeated England by five wickets in the third and deciding ODI to clinch the series 2-1. Chasing a 260-run target against England in the match at Old Trafford in Manchester, Indi… [+1638 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Many Shortcomings Found During Spot Check On Airlines: Aviation Watchdog", "description": "Inadequate equipment and improper repairs are among the multiple shortcomings that led to increasing instances of mechanical issues in flights, aviation regulator DGCA has said after a series of unscheduled landings and minor incidents.", "url": "https://www.ndtv.com/india-news/many-shortcomings-found-during-spot-check-on-airlines-aviation-watchdog-3170031", "urlToImage": "https://i.ndtvimg.com/i/2018-04/plane-generic-unsplash_650x400_61523436038.jpg", "publishedAt": "2022-07-18T14:06:12Z", "content": "New Delhi: Inadequate equipment and improper repairs are among the multiple shortcomings that led to increasing instances of mechanical issues in flights, aviation regulator DGCA has said after a ser… [+1145 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Kerala Congress Chief Justifies Chimpanzee Cut Out With CPI Leader's Face", "description": "Kerala Congress chief justified Mahila Congress's protest against CPI(M) leader M M Mani by holding a cut-out of a chimpanzee with the leader's face. The Kerala Congress chief said, \"that's his face. We can show the original right?\"", "url": "https://www.ndtv.com/india-news/thats-his-face-kerala-congress-chief-k-sudhakaran-justifies-chimpanzee-cut-out-with-cpi-m-leader-m-m-manis-face-3169997", "urlToImage": "https://c.ndtvimg.com/2019-01/vpecd1mo_k-sudhakaran_625x300_24_January_19.jpg", "publishedAt": "2022-07-18T13:56:55Z", "content": "Neither the CPI(M) nor M M Mani have responded to the issue yet. (File)\r\nThiruvananthapuram: Hours after the Mahila Congress held a protest on Monday against senior CPI(M) leader and MLA M M Mani by … [+2073 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Monkeypox: Centre Asks For Strict Screening Of All International Passengers", "description": "The Centre on Monday asked ports and airports to ensure strict health screening of all international travellers to contain the spread of monkeypox on the day India reported its second case from Kerala.", "url": "https://www.ndtv.com/india-news/amid-monkeypox-concerns-centre-asks-for-strict-screening-of-all-international-passengers-at-ports-airports-3169965", "urlToImage": "https://c.ndtvimg.com/2022-05/iagsqfo_monkeypox-reuters_625x300_28_May_22.jpg", "publishedAt": "2022-07-18T13:50:44Z", "content": "The symptoms of monkeypox include a high fever, swollen lymph nodes and a blistery chickenpox-like rash.\r\nNew Delhi: The Centre on Monday asked ports and airports to ensure strict health screening of… [+1752 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "EWS Admission In Private Schools: Delhi Govt Relaxes Distance Criteria", "description": "Students seeking admission to entry-level classes in private schools under the EWS, DG and CWSN category will now be able to choose an institution within a 3-km radius of their residence.", "url": "https://www.ndtv.com/education/ews-admission-in-private-schools-delhi-government-relaxes-distance-criteria-3-km-from-1-km", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/18/Delhi-Schools.jpg", "publishedAt": "2022-07-18T13:49:48Z", "content": "New Delhi:Students seeking admission to entry-level classes in private schools under the EWS, DG and CWSN category will now be able to choose an institution within a 3-km radius of their residence in… [+1330 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"What About Pratibha Patil\": Tejashwi Yadav's Takedown of BJP", "description": "Bihar's opposition leader Tejashwi Yadav, targetted by the BJP over his \"statue\" comment on NDA's  presidential candidate Droupadi Murmu, today hit back at the ruling party", "url": "https://www.ndtv.com/india-news/what-about-pratibha-patil-tejashwi-yadavs-takedown-of-bjp-3169958", "urlToImage": "https://c.ndtvimg.com/2022-07/5j8a8ce8_tejashwi-yadav-at-a-recent-party-programme_625x300_12_July_22.jpg", "publishedAt": "2022-07-18T13:47:52Z", "content": "\"We don't want any statue in Rashtrapati Bhavan,\" Tejashwi Yadav had said earlier.\r\nBihar's opposition leader Tejashwi Yadav, targetted by the BJP over his \"statue\" comment on NDA's  presidential can… [+1797 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Kartik Aaryan To Star In Kabir Khan-Sajid Nadiadwala's New Project", "description": "\"Super excited to embark on this exciting journey with one of my favorite filmmakers,\" wrote Kartik Aaryan", "url": "https://www.ndtv.com/entertainment/kartik-aaryan-announces-new-project-based-on-true-story-with-sajid-nadiadwala-kabir-khan-3168473", "urlToImage": "https://c.ndtvimg.com/2022-07/fueot758_kartik-aaryan_625x300_18_July_22.jpg", "publishedAt": "2022-07-18T13:45:23Z", "content": "Kartik Aaryan shared this image. (courtesy: kartikaaryan)\r\nNew Delhi: Bollywood actor Kartik Aaryan, on Monday, revealed that he has signed a project with Sajid Nadiadwala's production house which wi… [+1774 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Mridusmita Deka", "title": "JEE Main 2022 Delayed; Not To Start From July 21: NTA", "description": "The Joint Entrance Examination Main (JEE Main) session 2 exam will not be held from July 21, the National Testing Agency (NTA) Director General Vineet Joshi confirmed.", "url": "https://www.ndtv.com/education/jee-main-2022-july-session-2-deferred-not-to-start-from-july-21-nta", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/18/dates.jpg", "publishedAt": "2022-07-18T13:36:35Z", "content": "New Delhi:The Joint Entrance Examination Main (JEE Main) session 2 exam will not be held from July 21, the National Testing Agency (NTA) Director General Vineet Joshi confirmed. The JEE Main 2022 sec… [+1715 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Asian News International", "title": "\"Superstar In Every Format\": ECB CEO Clare Connor Praises Ben Stokes", "description": "Ben Stokes on Monday announced that he will be playing his last ODI match on Tuesday, which will be against South Africa.", "url": "https://sports.ndtv.com/cricket/superstar-in-every-format-ecb-ceo-clare-connor-praises-ben-stokes-3169898", "urlToImage": "https://c.ndtvimg.com/2022-07/tstn1bao_ben-stokes-afp_625x300_15_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-18T13:35:23Z", "content": "After all-rounder, Ben Stokes announced his retirement from the One-Day International cricket, England Cricket Board's interim CEO, Clare Connor lavished praise on him. Stokes on Monday announced tha… [+1959 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "How Netflix Plans To Find Its Inner 'Star Wars'", "description": "Netflix broke Hollywood's rules to create a $82 billion global streaming colossus that the rest of the entertainment industry rushed to copy. But as growth slows, it is looking backwards for a way forward, borrowing a page from Walt Disney's playbook.", "url": "https://www.ndtv.com/business/how-netflix-a-82-billion-colossus-plans-to-find-its-inner-star-wars-3169861", "urlToImage": "https://c.ndtvimg.com/2022-07/kvfu6dog_reuters-image_625x300_18_July_22.jpg", "publishedAt": "2022-07-18T13:30:48Z", "content": "How Netflix plans to find its inner Star Wars\r\nNetflix broke Hollywood's rules to create a $82 billion global streaming colossus that the rest of the entertainment industry rushed to copy. But as gro… [+7638 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "'Johnny Depp Shot': US Bar Offers Drink To Customers Feeling \"Unsafe\"", "description": "Johnny Depp had sued Amber Heard for an op-ed she wrote for The Washington Post describing herself as a \"public figure representing domestic abuse\".", "url": "https://www.ndtv.com/offbeat/johnny-depp-shot-us-bar-offers-drink-to-customers-feeling-unsafe-3169857", "urlToImage": "https://c.ndtvimg.com/2022-07/3m4g4f2o_johnny-depp-shot-650_625x300_18_July_22.jpg", "publishedAt": "2022-07-18T13:29:34Z", "content": "The advertisement of 'Johnny Depp Shot' as posted by a user on Reddit.\r\nThe legal battle between actor Johnny Depp and his former wife Amber Heard was one of the most-discussed events on the internet… [+2018 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Presidential Polls See 98.90% Voter Turnout In Parliament", "description": "Voting for the presidential poll ended on Monday with the 98.90 per cent of the electors permitted to vote in the parliament house exercising their franchise, Returning Officer PC Mody said.", "url": "https://www.ndtv.com/india-news/presidential-polls-see-98-90-voter-turnout-in-parliament-3169850", "urlToImage": "https://c.ndtvimg.com/2022-07/ruv3l4c8_shashi-tharoor_625x300_18_July_22.jpg", "publishedAt": "2022-07-18T13:27:38Z", "content": "New Delhi: Voting for the presidential poll ended on Monday with the 98.90 per cent of the electors permitted to vote in the parliament house exercising their franchise, Returning Officer PC Mody sai… [+827 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Asian News International", "title": "\"Rollercoaster Of Emotions\": PV Sindhu On Singapore Open Triumph", "description": "Olympic medallist PV Sindhu clinched the Singapore Open 2022 title after defeating China's Wang Zhiyi in the final", "url": "https://sports.ndtv.com/badminton/rollercoaster-of-emotions-pv-sindhu-on-singapore-open-triumph-3169454", "urlToImage": "https://c.ndtvimg.com/2022-07/m1hcmapg_pv-sindhu-singapore-open-twitter_625x300_18_July_22.jpg", "publishedAt": "2022-07-18T13:25:42Z", "content": "Following her Singapore Open 2022 title win against China's Wang Zhiyi, ace shuttler PV Sindhu said it was a rollercoaster of emotions. Olympic medallist PV Sindhu clinched the Singapore Open 2022 ti… [+2349 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Not Even In My Dreams...\": Jagdeep Dhankhar On Being Vice President Pick", "description": "Shortly after filing his nomination, National Democratic Alliance's (NDA) vice-presidential candidate West Bengal Governor Jagdeep Dhankhar said that he is grateful to Prime Minister Narendra Modi and his leadership for this opportunity.", "url": "https://www.ndtv.com/india-news/not-even-in-my-dreams-jagdeep-dhankhar-on-being-vice-president-pick-3169837", "urlToImage": "https://c.ndtvimg.com/2022-07/4oc6bd58_dhanker_625x300_18_July_22.jpg", "publishedAt": "2022-07-18T13:24:17Z", "content": "Jagdeep Dhankhar filed his nomination papers for the Vice-President's post today.\r\nNew Delhi: Shortly after filing his nomination, National Democratic Alliance's (NDA) vice-presidential candidate Wes… [+3308 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Viral Pic Of Shah Rukh Khan From The Sets Of Dunki In London", "description": "What's keeping Shah Rukh Khan busy?", "url": "https://www.ndtv.com/entertainment/viral-pic-of-shah-rukh-khan-from-the-sets-of-dunki-in-london-3169823", "urlToImage": "https://c.ndtvimg.com/2022-07/7m0jvi0g_srk_625x300_18_July_22.jpg", "publishedAt": "2022-07-18T13:20:01Z", "content": "SRK on the sets of Dunki. (courtesy: SRKian_yug)\r\nNew Delhi: Shah Rukh Khan, who was pictured at the Mumbai airport over the weekend, is currently shooting for a schedule of Rajkumar Hirani's Dunki i… [+1793 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rupee Has Depreciated By 25% Since December 2014, Says Finance Minister", "description": "The Indian rupee has declined by about 25 per cent since December 31, 2014, and is nearing 80 against the dollar, the Lok Sabha was informed on Monday.", "url": "https://www.ndtv.com/business/rupee-depreciates-by-25-since-december-2014-3169809", "urlToImage": "https://c.ndtvimg.com/2022-05/buddne1o_rupee_640x480_09_May_22.jpg", "publishedAt": "2022-07-18T13:17:40Z", "content": "Rupee has depreciated by 25% since December 2014\r\nNew Delhi: The Indian rupee has declined by about 25 per cent since December 31, 2014, and is nearing 80 against the dollar, the Lok Sabha was inform… [+2345 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Mairaj Khan Wins Historic Skeet Gold In Shooting World Cup", "description": "Veteran Indian shooter Mairaj Ahmed Khan on Monday created history by winning the country's first-ever ISSF World Cup gold medal in men's skeet", "url": "https://sports.ndtv.com/shooting/mairaj-khan-wins-historic-skeet-gold-in-shooting-world-cup-3169806", "urlToImage": "https://c.ndtvimg.com/2022-07/u9ahuf68_mairaj-ahmed-khan-twitter_625x300_18_July_22.jpg", "publishedAt": "2022-07-18T13:17:33Z", "content": "Veteran Indian shooter Mairaj Ahmed Khan on Monday created history by winning the country's first-ever ISSF World Cup gold medal in men's skeet in Changwon. In the 40-shot final, the 46-year-old from… [+1845 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Dinesh Chandimal Powers Sri Lanka's Lead vs Pakistan Past 300 In 1st Test", "description": "The hosts were 329 for nine when bad light stopped play for the day in Galle. Chandimal, on 86, and Prabath Jayasuriya, on four, were batting at close of play with Sri Lanka leading by 333 in their second innings.", "url": "https://sports.ndtv.com/cricket/dinesh-chandimal-powers-sri-lankas-lead-vs-pakistan-past-300-in-first-test-3169794", "urlToImage": "https://c.ndtvimg.com/2022-07/8gk8kie8_dinesh-chandimal_625x300_18_July_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-18T13:13:48Z", "content": "Red hot Dinesh Chandimal struck his second successive half-century to take Sri Lanka's lead past 300 and thwart the Pakistan attack on day three of the opening Test on Monday. The hosts were 329 for … [+2761 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Will Never Travel By IndiGo Again\": Kerala Leader After 3-Week Flying Ban", "description": "Convener of the ruling Left Democratic Front in Kerala E P Jayarajan on Monday said neither he nor his family would ever travel by Indigo, after the three- week flying ban imposed on him by the airline,", "url": "https://www.ndtv.com/india-news/will-never-travel-by-indigo-again-says-kerala-ldf-leader-after-3-week-flying-ban-3169792", "urlToImage": "https://c.ndtvimg.com/2020-07/610p2o88_kerala-industries-minister-ep-jayarajanani-_625x300_23_July_20.jpg", "publishedAt": "2022-07-18T13:13:44Z", "content": "E P Jayarajan allegedly pushed two youth Congress workers who raised slogans. (File)\r\nThiruvananthapuram: Convener of the ruling Left Democratic Front in Kerala E P Jayarajan on Monday said neither h… [+3204 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Adarsh Srivastava", "title": "CUET UG 2022 Day 3 Exam Tomorrow: Shift Timing; Important Guidelines", "description": "Common University Entrance Test - Undergraduate 2022 (CUET UG) 2022 for phase 1 day 3 will be conducted on July 19.", "url": "https://www.ndtv.com/education/cuet-ug-2022-day-3-exam-tomorrow-shift-timing-important-guidelines-for-candidates", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/18/CUET-UG-2022-Exam-Day-Guidelines.jpg", "publishedAt": "2022-07-18T13:13:09Z", "content": "New Delhi:CUET 2022 UG: Common University Entrance Test - Undergraduate 2022 (CUET UG) 2022 for phase 1 day 3 will be conducted on July 19. The National Testing Agency (NTA) will organise the exam in… [+2336 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Maharashtra Chief Minister Eknath Shinde On 1-Day Delhi Visit Tomorrow", "description": "Maharashtra Chief Minister Eknath Shinde will leave for New Delhi late Monday night, though his office has not given any reason for the one-day visit.", "url": "https://www.ndtv.com/india-news/maharashtra-chief-minister-eknath-shinde-on-1-day-delhi-visit-tomorrow-3169751", "urlToImage": "https://c.ndtvimg.com/2022-07/84k755ho_maharashtra-chief-minister-eknath-shinde-pti-pic_650x400_04_July_22.jpg", "publishedAt": "2022-07-18T13:11:48Z", "content": "Maharashtra Chief Minister Eknath Shinde: It will be Eknath Shinde's second visit to Delhi.\r\nMumbai: Maharashtra Chief Minister Eknath Shinde will leave for New Delhi late Monday night, though his of… [+631 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Nupur Sharma Wants Protection From Arrest In Cases Over Prophet Comments", "description": "Nupur Sharma had earlier urged court to club FIRs filed in different parts of the country, but the court had refused, made scathing comments on her.", "url": "https://www.ndtv.com/india-news/nupur-sharma-wants-protection-from-arrest-in-cases-over-prophet-comments-3169765", "urlToImage": "https://i.ndtvimg.com/i/2017-04/nupur-sharma-bjp_650x400_81492487863.jpg", "publishedAt": "2022-07-18T13:06:04Z", "content": "New Delhi: Citing \"renewed\" threats after the Supreme Court's \"unexpected and strong criticism\" of her, suspended BJP leader Nupur Sharma has again approached the court to halt her possible arrest an… [+695 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "CBI Questions 2 Former Mumbai Police Chiefs In Case Against Anil Deshmukh", "description": "The CBI has questioned former Mumbai police commissioners Sanjay Pandey and Param Bir Singh in connection with a corruption case against Maharashtra ex-home minister Anil Deshmukh, officials said.", "url": "https://www.ndtv.com/india-news/cbi-questions-2-former-mumbai-police-chiefs-in-case-against-former-maharashtra-minister-anil-deshmukh-3169727", "urlToImage": "https://c.ndtvimg.com/2021-03/6qusfkc_anil-deshmukh_625x300_23_March_21.jpg", "publishedAt": "2022-07-18T13:01:49Z", "content": "Anil Deshmukh is in judicial custody for allegedly demanding Rs 100 crore from bars every month. (File)\r\nNew Delhi: The CBI has questioned former Mumbai Police commissioners Sanjay Pandey and Param B… [+2536 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "7 Of The Best Dhabas/Restaurants On Delhi-Punjab Highway You Must Stop At For A Hearty Meal", "description": "We have listed down some of the most popular dhabas and restaurants on the Chandigarh-Punjab highway that are actually good!", "url": "https://food.ndtv.com/food-drinks/7-of-the-best-dhabas-restaurants-on-delhi-punjab-highway-you-must-stop-at-for-a-hearty-meal-3169719", "urlToImage": "https://c.ndtvimg.com/2022-07/tgrdtl68_dhaba-food-indian-_625x300_18_July_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-18T12:59:29Z", "content": "When the destination is only a few hours away, we all prefer to hit the road than board a train or a plane, just because road trips are always more exciting. And what makes the journey more fun is al… [+3584 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Rashi Hardaha", "title": "JEECUP 2022 Result Declared At Jeecup.admissions.nic.in; Direct Link", "description": "JEECUP Result 2022: The JEECUP 2022 result is now available for download at jeecup.admissions.nic.in. Candidates who appeared for the UP Polytechnic exam 2022 can access the rank card of JEECUP 2022 using their application number and date of birth.", "url": "https://www.ndtv.com/education/jeecup-2022-result-declared-at-jeecup-admissions-nic-in-direct-link-here", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/18/jeecup_2022_result.jpg", "publishedAt": "2022-07-18T12:56:44Z", "content": "JEECUP Result 2022: The Joint Entrance Examination Council, Uttar Pradesh (JEECUP) has announced result for the UP Joint Entrance Examination (Polytechnic), or JEECUP 2022 today, July 18. The JEECUP … [+1438 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Mumbai Man's Body Found Inside Bed At Home, Wife Missing: Cops", "description": "The decomposed body of a 23-year-old tailor was found inside the storage area of a bed in his rented home in Mumbai's Sakinaka on Monday and his wife is a suspect as she is missing, a police official said.", "url": "https://www.ndtv.com/mumbai-news/mumbai-mans-body-found-inside-bed-at-home-wife-missing-cops-3169591", "urlToImage": "https://c.ndtvimg.com/2021-09/h868cgro_-goa-police-_625x300_28_September_21.jpg", "publishedAt": "2022-07-18T12:54:40Z", "content": "Mumbai: Murder and disappearance of evidence case was registered, police said. (Representational)\r\nMumbai: The decomposed body of a 23-year-old tailor was found inside the storage area of a bed in hi… [+640 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "An Update On Shanaya's Debut Film Bedhadak - Filming Begins Next Year", "description": "Shanaya Kapoor will mark her big Bollywood debut with Bedhadak", "url": "https://www.ndtv.com/entertainment/an-update-on-shanaya-kapoors-debut-film-bedhadak-filming-begins-next-year-3169699", "urlToImage": "https://c.ndtvimg.com/2022-07/flgodio_shanaya-kapoor_625x300_18_July_22.jpg", "publishedAt": "2022-07-18T12:53:57Z", "content": "Bedhadak poster. (courtesy: karanjohar)\r\nKaran Johar has shared an update on Bedhadak, starring Shanaya Kapoor, Lakshya Lalwani and Gurfateh Pirzada, amid the news of the movie being shelved. The fil… [+1470 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Viral: Brahmastra Song Kesariya Prompts Meme-Fest On Twitter", "description": "Twitter users shared a couple of memes on how the two words seemed out of place in the otherwise flawless track", "url": "https://www.ndtv.com/entertainment/viral-brahmastra-song-kesariya-prompts-meme-fest-on-twitter-3169683", "urlToImage": "https://c.ndtvimg.com/2022-07/mobpoqd8_kesariya_625x300_18_July_22.jpg", "publishedAt": "2022-07-18T12:51:35Z", "content": "A still from Kesariya. (courtesy: YouTube)\r\nNew Delhi: The first song from Ayan Mukerji's Brahmastra, titled Kesariya has been trending ever since it released on Sunday. The song, beautifully sung by… [+2474 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "On 2019 Easter Attacks Probe, Sri Lanka Acting President's Request To UK", "description": "Sri Lanka's Acting President Ranil Wickremesinghe on Monday sought the assistance of the British government and their intelligence services in the investigation of the Easter Sunday suicide attacks that killed nearly 270 people.", "url": "https://www.ndtv.com/world-news/sri-lankas-acting-president-wickremesinghe-on-easter-attacks-probe-sri-lankas-acting-presidents-request-to-uk-3169156", "urlToImage": "https://c.ndtvimg.com/2019-04/6d33rc3g_sri-lanka-attacks-reuters-650_650x400_25_April_19.jpg", "publishedAt": "2022-07-18T12:50:38Z", "content": "Sri Lanka Easter Attacks: The Easter attack stirred a political storm in Sri Lanka.\r\nColombo: Sri Lanka's Acting President Ranil Wickremesinghe on Monday sought the assistance of the British governme… [+2625 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Arnab Mitra", "title": "'Confused Between CUET And Plus Two,' Says ICSE Topper Kanishka Mittal", "description": "ICSE Result 2022: Ms Mittal took Humanities in Plus Two for her love of subjects like History. As for career goals, she has two options in mind - Law and Bachelor of Arts (BA)", "url": "https://www.ndtv.com/education/confused-between-cuet-and-plus-two-says-icse-topper-kanishka-mittal", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/18/ICSE_result_860.jpeg", "publishedAt": "2022-07-18T12:49:50Z", "content": "ICSE Result 2022: Lucknow's Kanishka Mittal has topped the Indian Certificate of Secondary Education (ICSE) Class 10 exam 2022 by securing 499 marks (99.80 per cent). While pleased with her performan… [+2203 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Swedish Fashion Retailer H&M To Shut Operations In Russia Amid Ukraine War", "description": "Swedish fashion retailer H&M said on Monday it had decided to wind down operations in Russia, after pausing all sales there in March following Moscow's invasion of Ukraine.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-swedish-fashion-retailer-h-m-to-shut-operations-in-russia-amid-ukraine-war-3169662", "urlToImage": "https://c.ndtvimg.com/2022-07/uo3paji_russia-ukraine-war-reuters_625x300_06_July_22.jpg", "publishedAt": "2022-07-18T12:47:55Z", "content": "Russia-Ukraine War: Russian invasion of Ukraine triggered unprecedented sanctions.\r\nMoscow: Swedish fashion retailer H&amp;M said on Monday it had decided to wind down operations in Russia, after pau… [+1334 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sri Lanka's Crisis A Warning To Other Countries With High Debt: IMF Chief", "description": "International Monetary Fund (IMF) chief Kristalina Georgieva has cited the example of the unprecedented economic crisis in Sri Lanka to warn other countries that they could also face a similar situation in the face of high debt levels and limited policy space.", "url": "https://www.ndtv.com/business/crisis-in-sri-lanka-a-warning-to-other-countries-with-high-debt-levels-and-limited-policy-space-imf-chief-3169649", "urlToImage": "https://c.ndtvimg.com/2022-07/d30op7ug_reuters-image_625x300_18_July_22.jpg", "publishedAt": "2022-07-18T12:45:21Z", "content": "Sri Lanka's crisis a warning to other countries with high debt levels: IMF chief\r\nSingapore: International Monetary Fund (IMF) chief Kristalina Georgieva has cited the example of the unprecedented ec… [+2834 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Hurting People When They Need Relief: BJP's Varun Gandhi On GST Rate Move", "description": "BJP MP Varun Gandhi on Monday criticised imposing GST on packaged food items such as milk, curd and rice, saying this will hurt people already struggling with \"record-breaking unemployment\".", "url": "https://www.ndtv.com/india-news/hurting-them-when-they-need-relief-bjps-varun-gandhi-on-new-gst-rate-move-3169631", "urlToImage": "https://c.ndtvimg.com/2021-10/aqf7gchg_varun-gandhi_625x300_10_October_21.jpg", "publishedAt": "2022-07-18T12:42:16Z", "content": "Varun Gandhi said the decision has been taken \"during record breaking unemployment\". (File)\r\nNew Delhi: BJP MP Varun Gandhi on Monday criticised imposing GST on packaged food items such as milk, curd… [+861 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "From Oil To Atta, Prices Have Soared Across Essentials, GST Adds To Pain", "description": "The prices from oil to atta and across essentials have soared because of supply-driven shortages, and the new GST rates on these commodities will add to the already-stretched household budgets.", "url": "https://www.ndtv.com/business/from-oil-to-atta-prices-have-soared-across-essentials-now-gst-pressure-3169611", "urlToImage": "https://c.ndtvimg.com/2022-07/ji8utb0o_image_625x300_18_July_22.jpg", "publishedAt": "2022-07-18T12:41:16Z", "content": "From oil to atta, prices have already soared across essentials, now GST pressure\r\nThe prices from oil to atta and across essentials have soared because of supply-driven shortages, and the new GST rat… [+1830 chars]"}]}