{"status": "ok", "totalResults": 330, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "9 Dead In Assam Floods, Over 6 Lakh Affected: 10 Facts", "description": "More than 6.62 lakh people over 27 districts of Assam have been affected by the floods and landslides triggered by incessant rains in the state", "url": "https://www.ndtv.com/india-news/9-die-in-assam-floods-over-6-lakh-affected-10-facts-2989045", "urlToImage": "https://c.ndtvimg.com/2022-05/ml4bl6uk_assam-floods-pti_625x300_16_May_22.jpg", "publishedAt": "2022-05-19T02:15:11Z", "content": "<li>The Assam State Disaster Management Authority said around 2.88 lakh people are affected in Nagaon district followed by 1.19 people in Cachar, 1.07 lakh in Hojai, 60562 in Darrang, 27282 in Biswan… [+1944 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Says Nearly 700 Ukrainian Fighters Surrender In Mariupol", "description": "Moscow said nearly 700 more Ukrainian fighters had surrendered in Russian-held Mariupol as it shored up a key gain in the south, while the United States became the latest Western country to reopen its embassy in Kyiv.", "url": "https://www.ndtv.com/world-news/russia-says-nearly-700-ukrainian-fighters-surrender-in-mariupol-2989043", "urlToImage": "https://c.ndtvimg.com/2022-03/m62t0bo4_mariupol-ukraine-reuters_625x300_21_March_22.jpg", "publishedAt": "2022-05-19T02:10:42Z", "content": "Ukraine War: Russia said an additional 694 more fighters surrendered, bringing the total number to 959.\r\nKyiv:  Moscow said nearly 700 more Ukrainian fighters had surrendered in Russian-held Mariupol… [+4773 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Confirms 1st Case Of Monkeypox In Man Who Recently Travelled To Canada", "description": "Health authorities in Canada's Quebec province are investigating more than a dozen suspected cases of monkeypox, a rare but potentially serious virus, public broadcaster CBC reported Wednesday.", "url": "https://www.ndtv.com/world-news/us-confirms-1st-case-of-monkeypox-in-man-who-recently-travelled-to-canada-2989042", "urlToImage": "https://c.ndtvimg.com/2022-05/s6afg724_monkeypox-reuters_625x300_19_May_22.jpg", "publishedAt": "2022-05-19T02:09:21Z", "content": "Skin lesions in arms and torso of a patient due to monkeypox. (FILE)\r\nMontreal: Health authorities in Canada's Quebec province are investigating more than a dozen suspected cases of monkeypox, a rare… [+2180 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Mridusmita Deka", "title": "Karnataka Board Result 2022 Live: SSLC 10th Result At 12:30 PM Today", "description": "Karnataka 10th SSLC Result 2022: The SSLC result 2022 Karnataka online websites are sslc.karnataka.gov.in and karresults.nic.in. Keep following this blog for latest updates on result links, steps to download marksheets and toppers list.", "url": "https://www.ndtv.com/education/karnataka-sslc-result-2022-declared-live-10th-kseeb-sslc-karnataka-gov-in-karresults-nic-in-direct-link-how-to-check-updates", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/5/18/karnataka-sslc-result-2022-featured-image.jpg", "publishedAt": "2022-05-19T01:57:38Z", "content": "SSLC 10th Result Karnataka Board: The Karnataka Secondary Education Examination Board, or KSEEB, will declare the Class 10 Secondary School Leaving Certificate (SSLC) exam results for the 2022 board … [+1257 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"In The Past I Voted...\": Elon Musk On How His Choice Changed, And Why", "description": "Tesla boss Elon Musk said on Wednesday that even though he voted for Democrats in the past, he will now vote for Republicans. Musk said that he previously voted for Democrats \"because they were (mostly) the kindness party.\"", "url": "https://www.ndtv.com/world-news/elon-musk-on-how-his-choice-changed-and-why-in-the-past-i-voted-2989024", "urlToImage": "https://c.ndtvimg.com/2022-05/7fja90s8_elon-musk-afp_625x300_12_May_22.jpg", "publishedAt": "2022-05-19T01:35:55Z", "content": "This was the latest in the series of tweets from Elon Musk, expressing discontent with Democrats.\r\nNew Delhi: Tesla boss Elon Musk said on Wednesday that even though he voted for Democrats in the pas… [+1791 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Arnab Mitra", "title": "Karnataka KSEEB To Announce SSLC Class 10 Result 2022 Today", "description": "SSLC Result Karnataka Class 10: The SSLC Class 10 result 2022 will be available on the official website- sslc.karnataka.gov.in, once released. The students can also access the 10th result from the private website- manabadi.co.in.", "url": "https://www.ndtv.com/education/karnataka-kseeb-to-announce-sslc-class-10-result-2022-today-sslc-karnataka-gov-in-manabadi", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/5/18/exam-result-featured-image_LqH5le8.jpg", "publishedAt": "2022-05-19T01:24:58Z", "content": "Karnataka SSLC Result 2022: The Karnataka Secondary Education Examination Board (KSEEB) will announce the Secondary School Leaving Certificate (SSLC) Class 10 result 2022 on Thursday, May 19. The SSL… [+1525 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Woman, Her 2 Daughters, Their Lovers Arrested For Poisoning Family In UP: Cops", "description": "In Uttar Pradesh's Greater Noida, the police have arrested a woman, her two daughters and their boyfriends for allegedly poisoning the dinner of her family with an intent to kill them, officials said on Wednesday.", "url": "https://www.ndtv.com/india-news/woman-her-2-daughters-their-lovers-arrested-for-poisoning-family-in-up-cops-2988993", "urlToImage": "https://c.ndtvimg.com/2020-07/1po0gju8_noida-police-generic-_625x300_23_July_20.jpg", "publishedAt": "2022-05-19T00:52:41Z", "content": "4 family members had fallen ill after consuming poison which was mixed in their dinner, police said.\r\nNoida: In Uttar Pradesh's Greater Noida, the police have arrested a woman, her two daughters and … [+1751 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE: India Reports 1,829 New COVID-19 Cases In 24 Hours", "description": "India on Wednesday reported at least 1,829 new Covid cases, taking the total number of infections to 4,31,27,199. According to the Union Health Ministry, the active cases dipped to 15,647 in the last 24 hours.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-may-19-2988982", "urlToImage": "https://c.ndtvimg.com/2021-08/4fmrmba_coronavirus-india-reuters-august-30_650x400_30_August_21.jpg", "publishedAt": "2022-05-19T00:25:33Z", "content": "India Covid Live: At least 33 new covid deaths reported in India on Wednesday.\r\nNew Delhi: India on Wednesday reported at least 1,829 new Covid cases, taking the total number of infections to 4,31,27… [+572 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Student Stabs His Girlfriend's Classmate For Talking To Her: Police", "description": "A class 12 student allegedly stabbed his girlfriend's classmate for talking to her in Rajendranagar Mandal of Ranga Reddy district in Telangana, the police said.", "url": "https://www.ndtv.com/india-news/student-stabs-his-girlfriends-classmate-for-talking-to-her-in-telangana-police-2988971", "urlToImage": "https://c.ndtvimg.com/knife-stabbing-generic-pixabay-650_625x300_1529019833273.jpg", "publishedAt": "2022-05-18T23:56:23Z", "content": "According to the police, the victim has been identified as Durga Prasad.\r\nHyderabad: A class 12 student allegedly stabbed his girlfriend's classmate for talking to her in Rajendranagar Mandal of Rang… [+613 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Man Stabs Mother-In-Law To Death After Wife Goes Missing In Andhra: Cops", "description": "A man allegedly stabbed his mother-in-law to death in Andhra's Kakinada district after he failed to find his wife, who left him months ago, at her place, according to a police official on Wednesday.", "url": "https://www.ndtv.com/india-news/man-stabs-mother-in-law-to-death-after-wife-goes-missing-in-andhra-pradesh-2988966", "urlToImage": "https://c.ndtvimg.com/2018-10/2j46hlug_police-generic_625x300_27_October_18.jpg", "publishedAt": "2022-05-18T23:36:53Z", "content": "The police have registered a case against accused Ramesh for killing her mother-in-law.\r\nKakinada, Andhra Pradesh: A man allegedly stabbed his mother-in-law to death in Andhra's Kakinada district aft… [+983 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Johnny Depp Grabbed Amber Heard By Hair, Hit Her Repeatedly: Sister", "description": "Johnny Depp grabbed his then-wife Amber Heard by the hair and repeatedly struck her in the face during a heated argument about a month after their marriage, her sister said Wednesday.", "url": "https://www.ndtv.com/world-news/johnny-depp-grabbed-amber-heard-by-hair-hit-her-repeatedly-sister-2988963", "urlToImage": "https://c.ndtvimg.com/2022-04/h5bpk09c_johnny-depp-defamation-trial_625x300_26_April_22.jpg", "publishedAt": "2022-05-18T23:18:54Z", "content": "\"if he (Johnny Depp) was drinking there was almost always a fight,\" Amber Heard's sister said.\r\nWashington: Johnny Depp grabbed his then-wife Amber Heard by the hair and repeatedly struck her in the … [+3241 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Wheat Shouldn't Go Way Of Covid Vaccines: India Calls Out West On Exports", "description": "Calling out the West, India on Wednesday said that food grains should not go the way of the Covid-19 vaccines as it voiced concern over hoarding and discrimination amid the \"unjustified increase\" in food prices.", "url": "https://www.ndtv.com/india-news/food-grains-shouldnt-go-the-way-of-covid-vaccines-india-to-west-2988954", "urlToImage": "https://c.ndtvimg.com/2022-05/hr3b1ulo_wheat-generic-wheat-export-generic-reuters_625x300_17_May_22.jpg", "publishedAt": "2022-05-18T22:55:59Z", "content": "Food crisis: India emphasised that it will play its due role in advancing global food security.\r\nUnited Nations: Calling out the West, India on Wednesday said that food grains should not go the way o… [+5337 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Gurugram: Man Arrested For Issuing Fake GST Invoices Worth Rs 160 Crore", "description": "Directorate General of GST Intelligence Gurugram has arrested a person in connection with a case wherein a total Input Tax Credit (ITC) of over Rs 160 crore has been utilized and passed on by a network of nonexistent and fake firms.", "url": "https://www.ndtv.com/india-news/gurugram-man-arrested-for-issuing-fake-gst-invoices-worth-rs-160-crore-2988951", "urlToImage": "https://i.ndtvimg.com/i/2016-05/arrest-generic_650x400_71463458726.jpg", "publishedAt": "2022-05-18T22:35:54Z", "content": "The man was identified as Pawan Kumar Sharma who arrested on May 13. (Representational)\r\nNew Delhi: Directorate General of GST Intelligence Gurugram has arrested a person in connection with a case wh… [+2211 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Minor Claims Secret Filming In Washroom, Moves Court Alleging Cops' Inaction", "description": "A minor girl has moved the Rajasthan High Court alleging inaction by police into her complaint that a person had secretly filmed her while she was in a washroom at a prominent club here and demanding a CBI inquiry into it.", "url": "https://www.ndtv.com/india-news/minor-claims-secret-filming-at-jodhpur-club-in-washroom-moves-court-alleging-cops-inaction-2988946", "urlToImage": "https://c.ndtvimg.com/court-generic_625x300_1527245477936.jpg", "publishedAt": "2022-05-18T22:11:40Z", "content": "Court also summoned the investigating officer with case diary related to the matter. (Representational)\r\nJodhpur: A minor girl has moved the Rajasthan High Court alleging inaction by police into her … [+1931 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Woman Dies By Suicide After Boyfriend Blocks Her On WhatsApp: Cops", "description": "A 20-year-old woman allegedly hanged herself to death at her boyfriend's house located along the railway tracks in suburban Dahisar apparently after he blocked her number on WhatsApp following an argument with her, police said on Wednesday.", "url": "https://www.ndtv.com/india-news/woman-dies-by-suicide-after-boyfriend-blocks-her-on-whatsapp-cops-2988941", "urlToImage": "https://c.ndtvimg.com/2021-03/3d9746ug_dead-body-generic_625x300_03_March_21.jpg", "publishedAt": "2022-05-18T21:57:02Z", "content": "The woman, identified as Pranali Lokare, was found hanging on Monday morning, police said.\r\nMumbai: A 20-year-old woman allegedly hanged herself to death at her boyfriend's house located along the ra… [+1426 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UN Urges Ukraine Grain Release Amid Global Food Crisis", "description": "The UN warned Wednesday that a growing global food crisis could last years if it goes unchecked, as the World Bank announced an additional $12 billion in funding to mitigate its \"devastating effects.\"", "url": "https://www.ndtv.com/world-news/un-urges-ukraine-grain-release-amid-global-food-crisis-2988930", "urlToImage": "https://c.ndtvimg.com/2020-02/il1pp214_antonio-guterres-reuters_625x300_28_February_20.jpg", "publishedAt": "2022-05-18T21:42:37Z", "content": "The war threatens to tip tens of millions of people over the edge into food insecurity, UN chief said.\r\nUnited Nations: The UN warned Wednesday that a growing global food crisis could last years if i… [+4175 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Explained: What Is Monkeypox And Why Cases Are Rising In Europe", "description": "A handful of cases of monkeypox have now been reported or are suspected in the United Kingdom, Portugal and Spain.", "url": "https://www.ndtv.com/world-news/what-is-monkeypox-and-why-cases-are-rising-in-europe-2988924", "urlToImage": "https://c.ndtvimg.com/2022-05/rkjst6a_monkeypox-disease-650_625x300_10_May_22.jpg", "publishedAt": "2022-05-18T21:09:38Z", "content": "Monkeypox is a virus that causes fever symptoms as well as a distinctive bumpy rash.\r\nLondon: A handful of cases of monkeypox have now been reported or are suspected in the United Kingdom, Portugal a… [+2866 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "No improvement In Situation After Article 370 Removal: Omar Abdullah", "description": "National Conference vice-president Omar Abdullah on Wednesday said there has been no improvement in the security situation in Jammu and Kashmir following the abrogation of Articles 370 and 35A.", "url": "https://www.ndtv.com/india-news/no-improvement-in-security-situation-in-jammu-and-kashmir-after-article-370-removal-omar-abdullah-2988919", "urlToImage": "https://c.ndtvimg.com/2019-08/0a5qmd44_omar-abdullah-pti_625x300_05_August_19.jpg", "publishedAt": "2022-05-18T20:53:54Z", "content": "Omar Abdullah also called for respecting the sentiments of the people in view of the loudspeaker ban.\r\nSrinagar: National Conference vice-president Omar Abdullah on Wednesday said there has been no i… [+1004 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Exiled Ex-Spanish King Juan Carlos To Return Home: Royal Household", "description": "Spain's former king Juan Carlos will return to Spain this week after nearly two years in exile in the United Arab Emirates, the royal household said on Wednesday.", "url": "https://www.ndtv.com/world-news/exiled-ex-spanish-king-juan-carlos-to-return-home-royal-household-2988900", "urlToImage": "https://c.ndtvimg.com/2020-08/h0vibcv8_spains-former-king-juan-carlos-afp_625x300_04_August_20.jpg", "publishedAt": "2022-05-18T20:31:48Z", "content": "Juan Carlos will stay in Sanxenxo in Spain's northwest and will see his son, the Royal House said.\r\nMadrid: Spain's former king Juan Carlos will return to Spain this week after nearly two years in ex… [+1227 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "North Korea Could Conduct \"Nuclear Test\" Ahead Of Biden's Asia trip: US", "description": "The United States believes there is a \"genuine possibility\" that North Korea could conduct a nuclear test or other saber rattling while Joe Biden is on his first trip as president to Asia, a top US official said Wednesday.", "url": "https://www.ndtv.com/world-news/us-says-north-korea-could-conduct-nuclear-test-ahead-of-joe-bidens-asia-trip-2988870", "urlToImage": "https://c.ndtvimg.com/2022-05/efkeqoc4_north-korea-missilereuters_625x300_18_May_22.jpg", "publishedAt": "2022-05-18T20:00:05Z", "content": "US said North Korea is preparing long range missile tests or a nuclear test during Biden's Asia trip.\r\nWashington: The United States believes there is a \"genuine possibility\" that North Korea could c… [+1325 chars]"}]}