{"status": "ok", "totalResults": 295, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Fauda Actor Sings Hindi Song, Says Happy To Get Offer From Bollywood", "description": "Tsahi Halevi also said that he would be happy to get an offer from the Indian film industry.", "url": "https://www.ndtv.com/entertainment/fauda-actor-tsahi-halevi-sings-tere-jaisa-yaar-kahan-says-india-has-lot-of-creativity-2950441", "urlToImage": "https://c.ndtvimg.com/2022-05/kd44nai8_fauda-actor-tsahi-halevi-650_625x300_06_May_22.jpg", "publishedAt": "2022-05-06T02:27:39Z", "content": "'Fauda' actor Tsahi Halevi is in India on the occasion of the 74th Independence Day of Israel.\r\nIsraeli actor Tsahi Halevi, who gained fame after the 'Fauda' series, hummed a few lines from Hindi son… [+1573 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "No Second Hearing Once A Person Is Declared Citizen: Gauhati High Court", "description": "The Foreigners' Tribunal bench of Gauhati High Court indicated Thursay that once the tribunal has declared someone to be an Indian, the same person can't be declared a non-Indian if brought before it a second time.", "url": "https://www.ndtv.com/india-news/no-second-hearing-once-a-person-is-declared-citizen-gauhati-high-court-2950416", "urlToImage": "https://i.ndtvimg.com/i/2015-12/gauhati-high-court-650_650x400_61450447923.jpg", "publishedAt": "2022-05-06T01:39:13Z", "content": "The High Court made the announcement while hearing a bunch of petitions earlier this week on citizenship.\r\nThe Foreigners' Tribunal bench of Gauhati High Court has indicated that once the tribunal ha… [+2264 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US' Assurances To Sweden, Finland Over NATO Membership Amid Ukraine War", "description": "The United States is confident it can address any security concerns Sweden and Finland may have about the period of time after they apply for NATO membership and before they are accepted into the alliance, the White House said on Thursday.", "url": "https://www.ndtv.com/world-news/us-offers-assurances-to-sweden-finland-over-nato-membership-amid-ukraine-war-2950414", "urlToImage": "https://c.ndtvimg.com/2019-11/t015ele8_nato-flags_625x300_27_November_19.jpg", "publishedAt": "2022-05-06T01:32:30Z", "content": "Both Sweden and Finland are expected to make a decision about whether to apply to join NATO this month.\r\nWashington: The United States is confident it can address any security concerns Sweden and Fin… [+1214 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE: India Logs 3,275 New Covid Cases, 55 Deaths In 24 Hours", "description": "India reported 3,275 new COVID-19 cases in the last 24 hours, taking the coronavirus tally to 4,30,91,393. The country also recorded 55 new covid-related fatalities, bringing the total number of deaths to 523,975.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-may-6-2950393", "urlToImage": "https://c.ndtvimg.com/2022-01/3mckphk_india-coronavirusafp_625x300_29_January_22.jpg", "publishedAt": "2022-05-06T00:37:30Z", "content": "India Covid Live Updates: The country also reported 55 new Covid deaths on Thursday.\r\nNew Delhi: India reported 3,275 new COVID-19 cases in the last 24 hours, taking the coronavirus tally to 4,30,91,… [+509 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Biden Names Karine Jean-Pierre As First Black White House Press Secretary", "description": "US President Joe Biden on Thursday named Karine Jean-Pierre as the next White House press secretary, the first Black person to hold the high-profile post.", "url": "https://www.ndtv.com/world-news/biden-names-karine-jean-pierre-as-first-black-woman-white-house-press-secretary-2950390", "urlToImage": "https://c.ndtvimg.com/2022-05/3r20vemo_karine-jeanpierre-white-house-press-secretary_625x300_06_May_22.jpg", "publishedAt": "2022-05-06T00:29:09Z", "content": "Karine Jean-Pierre also served under Biden during his tenure as Obama's vice president.\r\nWashington: US President Joe Biden on Thursday named Karine Jean-Pierre as the next White House press secretar… [+2839 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Has Destroyed Hundreds Of Hospitals In Ukraine: President Zelensky", "description": "Russia's invasion of Ukraine has devastated hundreds of hospitals and other institutions and left doctors without drugs to tackle cancer or the ability to perform surgery, President Volodymyr Zelenskiy said on Thursday.", "url": "https://www.ndtv.com/world-news/russia-has-destroyed-hundreds-of-hospitals-in-ukraine-president-volodymyr-zelensky-2950385", "urlToImage": "https://c.ndtvimg.com/2022-03/2d6ul6ck_ukraine-zelensky-afp_625x300_12_March_22.jpg", "publishedAt": "2022-05-06T00:09:36Z", "content": "Ukraine war: President Zelensky was addressing to a medical charity group on Thursday. (File)\r\nKyiv: Russia's invasion of Ukraine has devastated hundreds of hospitals and other institutions and left … [+1234 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Amber Heard Says Johnny Depp Sexually Assaulted Her With \"Bottle\"", "description": "Amber Heard testified on Thursday that her ex-husband Johnny Depp sexually assaulted her and threatened to \"carve up\" her face with a broken bottle during a heated argument one month after their 2015 marriage.", "url": "https://www.ndtv.com/world-news/amber-heard-says-johnny-depp-sexually-assaulted-her-during-pirates-shooting-in-australia-2950375", "urlToImage": "https://i.ndtvimg.com/i/2014-12/johnny-depp-amber-heard_625x300_81417700697.jpg", "publishedAt": "2022-05-05T23:45:19Z", "content": "Johnny Depp Vs Amber Heard: The case has been going on since April 11.\r\nWashington: Amber Heard testified on Thursday that her ex-husband Johnny Depp sexually assaulted her and threatened to \"carve u… [+4166 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine War Must End For The Sake Of People Of Entire World: UN Chief", "description": "The United Nations and several countries called Thursday for an end to Russia's war in Ukraine, with little mention of reviving the two countries' apparently stalled peace talks.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-war-must-end-for-the-sake-of-people-of-entire-world-says-un-chief-2950362", "urlToImage": "https://c.ndtvimg.com/2022-04/vsscb26g_kyiv-ukraine-russia-war-afp-650_625x300_03_April_22.jpg", "publishedAt": "2022-05-05T23:19:49Z", "content": "Ukraine War: Over 12 million people are believed to have fled their homes in Ukraine since war began.\r\nUnited Nations: The United Nations and several countries called Thursday for an end to Russia's … [+1705 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Loudspeaker Issue Not Limited To One Community, Says Maharashtra Minister", "description": "The issue of loudspeakers is not limited to only one section of society now and will affect everybody, Congress leader and Maharashtra revenue minister Balasaheb Thorat said here on Thursday.", "url": "https://www.ndtv.com/india-news/loudspeaker-issue-not-limited-to-one-community-says-maharashtra-minister-balasaheb-thorat-2950348", "urlToImage": "https://c.ndtvimg.com/loudspeakers-generic-pixabay-650_625x300_1527530964626.jpg", "publishedAt": "2022-05-05T22:54:32Z", "content": "Loudspeaker row: Mr Thorat said such issues are being raised to divert attention from inflation.\r\nAurangabad: The issue of loudspeakers is not limited to only one section of society now and will affe… [+908 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "JP Nadda Says People Want BJP's \"Double Engine\" Govt In Telangana", "description": "Citing the Bharatiya Janata Party's victories in Dubbaka and Huzarabad bypolls in 2020 and 2021, BJP chief JP Nadda on Thursday said that people want change now and they want BJP's double engine government in Telangana.", "url": "https://www.ndtv.com/india-news/jp-nadda-says-people-want-bjps-double-engine-govt-in-telangana-2950341", "urlToImage": "https://c.ndtvimg.com/2022-04/kfqjf6co_jp-nadda_625x300_17_April_22.jpg", "publishedAt": "2022-05-05T22:35:37Z", "content": "Addressing a crown on Thursday, JP Nadda said that people in Telangana want change now.\r\nCiting the Bharatiya Janata Party's victories in Dubbaka and Huzarabad bypolls in 2020 and 2021, BJP chief JP … [+847 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Biden To Discuss North Korea, Russian Invasion On Asia Trip: White House", "description": "U.S. President Joe Biden will discuss North Korea's nuclear and missile programs with his counterparts in South Korea and Japan during a trip to those two countries later this month, White House press secretary Jen Psaki told reporters on Thursday.", "url": "https://www.ndtv.com/world-news/biden-to-discuss-north-korea-russian-invasion-on-asia-trip-white-house-2950339", "urlToImage": "https://c.ndtvimg.com/2022-05/n9jpkq3c_joe-biden-reuters_625x300_03_May_22.jpg", "publishedAt": "2022-05-05T22:20:03Z", "content": "Joe Biden will travel to South Korea and Japan this month and attend the Quad summit in Tokyo.\r\nWashington: U.S. President Joe Biden will discuss North Korea's nuclear and missile programs with his c… [+514 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Pentagon Says US Is Not Providing Ukraine Info To Kill Russian Generals", "description": "The US Defense Department denied Thursday that it provided intelligence on the locations of Russian generals on the battlefield so that Ukraine forces could kill them.", "url": "https://www.ndtv.com/world-news/pentagon-says-us-is-not-providing-ukraine-info-to-kill-russian-generals-2950338", "urlToImage": "https://c.ndtvimg.com/2022-03/cc0apmgk_ukraine-war_625x300_24_March_22.jpg", "publishedAt": "2022-05-05T22:06:24Z", "content": "Ukraine war: The White House has slammed the New York Times report as \"irresponsible.\"\r\nWashington: The US Defense Department denied Thursday that it provided intelligence on the locations of Russian… [+3263 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Gujarat: Anti-Terror Squad Arrests 24, Seizes 54 Country-Made Pistols", "description": "The Gujarat Anti Terrorist Squad (ATS) has busted an illegal arms racket and arrested 24 persons besides seizing 54 country-made guns from parts of the state, mostly the Saurasthra region, a senior official said on Thursday.", "url": "https://www.ndtv.com/india-news/gujarat-anti-terror-squad-arrests-24-seizes-54-country-made-pistols-2950329", "urlToImage": "https://i.ndtvimg.com/i/2016-05/arrest-generic_650x400_71463458726.jpg", "publishedAt": "2022-05-05T21:26:30Z", "content": "Gujarat ATS has seized 54 illegal guns and arrested 24 persons in multiple raids. (Representational)\r\nAhmedabad: The Gujarat Anti Terrorist Squad (ATS) has busted an illegal arms racket and arrested … [+1536 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "S Jaishankar Says PM's 2017 Israel Visit Was \"Goosebump Moment\" For Him", "description": "Calling the relationship between India and Israel \"truly special\", External Affairs Minister (EAM) S Jaishankar on Thursday said that Prime Minister Narendra Modi's visit to Israel in 2017 was a \"goosebump moment\" for him.", "url": "https://www.ndtv.com/india-news/s-jaishankar-says-pm-modis-2017-israel-visit-was-goosebump-moment-for-him-2950324", "urlToImage": "https://c.ndtvimg.com/2022-04/58h2h1go_s-jaishankar-pti_625x300_13_April_22.jpg", "publishedAt": "2022-05-05T20:43:08Z", "content": "S Jaishankar was addressing the gathering on Thursday on Israel's independence Day.\r\nNew Delhi: Calling the relationship between India and Israel \"truly special\", External Affairs Minister (EAM) S Ja… [+2389 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Plea Seeks Removal Of 'Defamatory Content' On Ayurveda From Wikipedia", "description": "A PIL has been filed to direct the Respondent the Ministry of Ayush and Ministry of IT and Electronics to take necessary steps that compel Wikimedia Foundation to remove references from articles regarding Ayurveda published on its website.", "url": "https://www.ndtv.com/india-news/plea-seeks-removal-of-defamatory-content-on-ayurveda-from-wikipedia-2950295", "urlToImage": "https://c.ndtvimg.com/2022-02/a1ooga8_supreme-court-of-india_650x400_14_February_22.jpg", "publishedAt": "2022-05-05T20:28:30Z", "content": "The petition said that matter showing about Ayurveda on Wikipedia is poorly researched.\r\nNew Delhi: A Public Interest Litigation (PIL) has been filed in the Supreme Court to direct the Respondent the… [+2879 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Cop Arrested, Suspended From Duty For Raping Tribal Woman In Rajasthan", "description": "A police officer has been arrested and suspended from duty for allegedly raping a 25-year-old tribal woman in Rajasthan's Jhalawar district, police said on Thursday.", "url": "https://www.ndtv.com/india-news/jhalawar-rape-cop-arrested-suspended-from-duty-for-raping-tribal-woman-in-rajasthan-2950283", "urlToImage": "https://c.ndtvimg.com/2019-05/em980mag_rajasthan-police-generic-twitter-650_625x300_28_May_19.jpg", "publishedAt": "2022-05-05T20:11:17Z", "content": "Jhalawar rape: The accused police officer is set to retire in six months. (Representational)\r\nKota: A police officer has been arrested and suspended from duty for allegedly raping a 25-year-old triba… [+1864 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UN Says Its 3rd Evacuation Operation Underway In Ukraine's Mariupol", "description": "A third operation is under way to evacuate civilians from the Ukrainian port city of Mariupol and the besieged Azovstal steel plant, U.N. Secretary-General Antonio Guterres told the U.N. Security Council on Thursday.", "url": "https://www.ndtv.com/world-news/un-chief-antonio-guterres-says-its-3rd-evacuation-operation-underway-in-ukraines-mariupol-2950272", "urlToImage": "https://c.ndtvimg.com/2022-04/rsij7lvo_mariupol-ukraine-war-reuters-650_625x300_11_April_22.jpg", "publishedAt": "2022-05-05T19:53:37Z", "content": "Ukraine War: UN-Red Cross operation underway to evacuate civilians from stricken Mariupol plant.\r\nUnited Nation: A third operation is under way to evacuate civilians from the Ukrainian port city of M… [+812 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Covid Killed Nearly 15 Million People Worldwide In 2020-21: WHO", "description": "The Covid-19 pandemic killed around 15 million people worldwide in 2020 and 2021, the WHO estimated Thursday -- nearly triple the number of deaths officially attributed to the disease.", "url": "https://www.ndtv.com/world-news/covid-killed-nearly-15-million-people-worldwide-in-2020-21-who-2950264", "urlToImage": "https://c.ndtvimg.com/2022-04/tllrmflg_shanghai-covid-china-covid-afp-650_625x300_16_April_22.jpg", "publishedAt": "2022-05-05T19:37:13Z", "content": "According to WHO, 82% of Covid deaths were estimated to be people aged over 60. (File)\r\nGeneva: The Covid-19 pandemic killed around 15 million people worldwide in 2020 and 2021, the WHO estimated Thu… [+4576 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "At Least 3 Killed In Attack In Central Israel On Independence Day", "description": "At least three people were killed in an attack in the central Israeli city of Elad as the Jewish state marked its independence day on Thursday, medics said.", "url": "https://www.ndtv.com/world-news/at-least-3-killed-in-attack-in-central-israels-elad-on-independence-day-2950241", "urlToImage": "https://i.ndtvimg.com/i/2018-03/police-generic-international-afp_650x400_41520126059.jpg", "publishedAt": "2022-05-05T19:09:40Z", "content": "3 people killed and several others hurt in a attack in central city of Elad. (Representational)\r\nBlad, Israel: At least three people were killed in an attack in the central Israeli city of Elad as th… [+1580 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "In Telangana, JP Nadda Accuses KCR Of Corruption, Copying Central Schemes", "description": "If Telangana Chief Minister K Chandrashekhar Rao went to Delhi to boast about his schemes and talk about the alleged incompetence of the BJP government in Delhi, BJP chief JP Nadda hit back during his visit to the state.", "url": "https://www.ndtv.com/india-news/in-telangana-jp-nadda-accuses-kcr-of-corruption-copying-central-schemes-2950222", "urlToImage": "https://c.ndtvimg.com/2022-04/ld9fsukg_jp-nadda-twitter_625x300_10_April_22.jpg", "publishedAt": "2022-05-05T18:51:02Z", "content": "Hyderabad: If Telangana Chief Minister K Chandrashekhar Rao went to Delhi to boast about his schemes and talk about the alleged incompetence of the BJP government in Delhi, BJP chief JP Nadda hit bac… [+2345 chars]"}]}