{"status": "ok", "totalResults": 296, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "2 Lashkar Terrorists Killed In Kashmir Encounter Today, 1 Was From Pak", "description": "Two terrorists of Lashkar-e-Taiba (LeT) were killed in an encounter with security forces in the Chaktaras Kandi area of Jammu and Kashmir's Kupwara district Tuesday morning.", "url": "https://www.ndtv.com/india-news/2-lashkar-terrorists-including-1-pakistani-killed-in-kupwara-encounter-3044398", "urlToImage": "https://c.ndtvimg.com/2020-12/l55s50m_indian-army_625x300_19_December_20.jpg", "publishedAt": "2022-06-07T02:22:59Z", "content": "The encounter started early in the morning today. (Representational)\r\nKupwara (Jammu and Kashmir): Two terrorists of Lashkar-e-Taiba (LeT) were killed in an encounter with security forces in the Chak… [+769 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "India's Damage Control As 14 Nations Condemn Remarks On Prophet: 10 Facts", "description": "The diplomatic outrage over the remarks on Prophet Muhammad by BJP leaders Nupur Sharma and Naveen Kumar Jindal continued even as the government sought to defuse the anger, asserting that it respects all religions.", "url": "https://www.ndtv.com/india-news/indias-damage-control-as-14-nations-condemn-remarks-on-prophet-10-points-3044396", "urlToImage": "https://c.ndtvimg.com/2019-06/oaldvrg_modi-mbs-pm-modi-saudi-prince-mohammed-bin-salman-twitter_625x300_28_June_19.jpg", "publishedAt": "2022-06-07T02:20:30Z", "content": "<li>At least 15 countries, including Iran, Iraq, Kuwait, Qatar, Saudi Arabia, Oman, the UAE, Iran, Jordan, Afghanistan, Bahrain, Maldives, Libya and Indonesia have lodged official protests against In… [+2115 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Colombia Discovers 2 Other Historical Shipwrecks Near San Jose Galleon", "description": "Colombian naval officials conducting underwater monitoring of the long-sunken San Jose galleon have discovered two other historical shipwrecks nearby, President Ivan Duque said on Monday.", "url": "https://www.ndtv.com/world-news/colombia-discovers-2-other-historical-shipwrecks-near-san-jose-galleon-3044383", "urlToImage": "https://c.ndtvimg.com/2022-06/15d787uc_colombia-reuters_625x300_07_June_22.jpg", "publishedAt": "2022-06-07T02:00:18Z", "content": "A remotely operated vehicle reached 900 meters depth.\r\nBogota: Colombian naval officials conducting underwater monitoring of the long-sunken San Jose galleon have discovered two other historical ship… [+1457 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Delhi Government To Open 100 More Mohalla Clinics Across City", "description": "The Kejriwal government will soon open 100 more Mohalla clinics across the city to provide primary healthcare services to residents. Preparations for these upcoming clinics are underway and will be completed soon.", "url": "https://www.ndtv.com/india-news/delhi-to-get-100-more-mohalla-clinics-across-city-manish-sisodia-3044380", "urlToImage": "https://c.ndtvimg.com/2021-08/2d9n2fp_mohalla-clinic_625x300_30_August_21.jpg", "publishedAt": "2022-06-07T01:52:38Z", "content": "A reports says that every day over 60,000 people are treated in these Mohalla Clinics. (File)\r\nNew Delhi: The Kejriwal government will soon open 100 more Mohalla clinics across the city to provide pr… [+1771 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Encounter Breaks Out In Jammu And Kashmir's Kupwara: Police", "description": "Encounter has started in the Chaktaras Kandi area of Jammu and Kashmir's Kupwara district.", "url": "https://www.ndtv.com/india-news/encounter-breaks-out-in-jammu-and-kashmirs-kupwara-police-3044370", "urlToImage": "https://c.ndtvimg.com/2022-01/52iv7a4s_jammu-and-kashmir-encounter-pti_625x300_22_January_22.jpg", "publishedAt": "2022-06-07T01:34:23Z", "content": "Earlier, a Pakistani terrorist affiliated with Lashkar-e-Taiba killed in an encounter in J&amp;K's Sopor.\r\nKupwara, Jammu And Kashmir: Encounter has started in the Chaktaras Kandi area of Jammu and K… [+747 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Don't Call Us Pro-China, We Are Pro-US: Taiwan's Opposition Party", "description": "It is wrong to label Taiwan's main opposition party the Kuomintang (KMT) as being pro-China as it has always been pro-US and is dedicated to defending the island though also to talking to Beijing, its chairman said in Washington.", "url": "https://www.ndtv.com/world-news/dont-call-us-pro-china-we-are-pro-us-taiwans-opposition-party-3044369", "urlToImage": "https://c.ndtvimg.com/2022-06/noid88bo_taiwan-opposition-reuters_625x300_07_June_22.jpg", "publishedAt": "2022-06-07T01:34:02Z", "content": "KMT Chairman Eric Chu decried those who call them pro-China.\r\nTaipei: It is wrong to label Taiwan's main opposition party the Kuomintang (KMT) as being pro-China as it has always been pro-US and is d… [+2042 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Conclusive, Decisive Result\": UK PM Boris Johnson After Trust Vote Win", "description": "British Prime Minister Boris Johnson survived a confidence vote on Monday but a large rebellion in his Conservative Party over the so-called \"partygate\" scandal dealt a blow to his authority and leaves him with a struggle to win back support.", "url": "https://www.ndtv.com/world-news/conclusive-decisive-result-uk-pm-boris-johnson-after-trust-vote-win-3044359", "urlToImage": "https://c.ndtvimg.com/2022-06/atbqrg54_boris-johnson-reuters_625x300_06_June_22.jpg", "publishedAt": "2022-06-07T01:19:58Z", "content": "The vote saw 211 lawmakers cast ballots in favour of PM Boris Johnson against 148.\r\nLondon: British Prime Minister Boris Johnson survived a confidence vote on Monday but a large rebellion in his Cons… [+4634 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE Updates: India Reports 4,518 New Covid Cases In 24 Hours", "description": "India on Monday reported at least 4,518 new coronavirus infections, taking the tally of COVID-19 cases to 4,31,81335. The daily positivity rate was recorded above one per cent after 34 days, according to the Union Health Ministry data updated.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-june-7-3044343", "urlToImage": "https://c.ndtvimg.com/2021-12/k11vj84g_coronavirus-india-afp-december_650x400_07_December_21.jpg", "publishedAt": "2022-06-07T00:30:58Z", "content": "India COVID-19 LIVE: The active cases rose to 25,782, according to health ministery on Monday.\r\nNew Delhi: India on Monday reported at least 4,518 new coronavirus infections, taking the tally of COVI… [+568 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Mridusmita Deka", "title": "Assam HSLC Result 2022 Live: SEBA Class 10 Matric Result Today", "description": "Assam HSLC Result 2022 Live Updates: Class 10 Matric result will be announced today. Keep following this blog for latest updates on HSLC result timing, official websites to check result, direct links and more.", "url": "https://www.ndtv.com/education/seba-hslc-result-2022-live-updates-assam-board-10th-results-announced-sebaonline-resultssebaonline-org-resultsassam-nic-in", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/6/6/assam-board-hslc-2022-matric-result-featured-image.jpg", "publishedAt": "2022-06-07T00:26:48Z", "content": "Assam HSLC Result 2022: The Board of Secondary Education Assam (SEBA) will declare the Class 10 High School Leaving Certificate (HSLC) exam results for the 2022 board exams today, June 7. The HSLC Ma… [+1142 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Prince Harry, Meghan Release Picture Of Daughter Lilibet On 1st Birthday", "description": "A new photo released on Monday by Prince Harry and Meghan Markle showed their daughter Lilibet celebrating her first birthday in a backyard picnic over the weekend.", "url": "https://www.ndtv.com/world-news/prince-harry-meghan-markle-release-picture-of-daughter-lilibet-on-her-1st-birthday-3044335", "urlToImage": "https://c.ndtvimg.com/2022-06/vpoqmg5g_lilibet-_625x300_07_June_22.jpg", "publishedAt": "2022-06-07T00:16:53Z", "content": "Lilibet's adorable picture taken by a family friend on her 1st birthday, the spokesperson said.\r\nLondon:  A new photo released on Monday by Prince Harry and Meghan Markle showed their daughter Lilibe… [+837 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Israel Government Loses Vote On Upholding Country's Law In West Bank", "description": "Israel's government suffered a defeat at the hands of the opposition Monday which voted down a push to uphold Israeli law in settlements on the occupied West Bank, posing a challenge to the ruling coalition.", "url": "https://www.ndtv.com/world-news/israel-government-loses-vote-on-upholding-countrys-law-in-west-bank-3044327", "urlToImage": "https://c.ndtvimg.com/2022-02/0pl5j6co_israels-prime-minister-nafatali-bennett-_625x300_07_February_22.jpg", "publishedAt": "2022-06-06T23:54:20Z", "content": "According reports, former PM Benjamin Netanyahu's party will not oppose pro-settlement measures.\r\nJerusalem: Israel's government suffered a defeat at the hands of the opposition Monday which voted do… [+1929 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "AAP Only \"Antidote\" For BJP: Arvind Kejriwal In Gujarat", "description": "Showcasing the expansion of Aam Aadmi Party in poll-bound Gujarat, Delhi Chief Minister and AAP national convenor Arvind Kejriwal on Monday held a roadshow in the Mehsana district.", "url": "https://www.ndtv.com/india-news/aap-only-antidote-for-bjp-delhi-chief-minister-arvind-kejriwal-in-gujarat-3044326", "urlToImage": "https://c.ndtvimg.com/2022-06/3ii48c5o_arvind-kejriwal-kashmiri-pandits-rally-twitter_625x300_05_June_22.jpg", "publishedAt": "2022-06-06T23:35:13Z", "content": "Earlier, Delhi CM Arvind Kejriwal said that \"BJP is incapable of handling Kashmir\".\r\nMehsana, Gujarat: Showcasing the expansion of Aam Aadmi Party in poll-bound Gujarat, Delhi Chief Minister and AAP … [+2079 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US To Seize 2 Planes Linked To Russian Oligarch Abramovich Over Ukraine", "description": "The US Justice Department ordered the seizure Monday of two aircraft owned by Russian oligarch Roman Abramovich, saying they had been used in violation of sanctions on Russia imposed over its invasion of Ukraine.", "url": "https://www.ndtv.com/world-news/us-to-seize-2-planes-linked-to-russian-oligarch-abramovich-over-ukraine-war-3044317", "urlToImage": "https://c.ndtvimg.com/2022-03/j4jsq1do_roman-abramovich-afp_625x300_12_March_22.jpg", "publishedAt": "2022-06-06T23:11:02Z", "content": "Since the Ukraine war began, Roman Abramovich has also been hit with sanctions in Europe.\r\nWashington: The US Justice Department ordered the seizure Monday of two aircraft owned by Russian oligarch R… [+2898 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "British Woman Raped At Beach In Goa; Accused Arrested: Police", "description": "The Goa Police on Monday arrested a 32-year-old man for allegedly raping a British woman at the famous Sweet Lake near Arambol beach in North Goa.", "url": "https://www.ndtv.com/india-news/british-woman-raped-at-beach-in-goa-accused-arrested-police-3044306", "urlToImage": "https://i.ndtvimg.com/i/2017-03/police-generic_650x400_71490246814.jpg", "publishedAt": "2022-06-06T22:46:08Z", "content": "The victim, who is on a Goa visit with her husband, filed a complaint Monday. (Representational)\r\nPanaji: The Goa Police on Monday arrested a 32-year-old man for allegedly raping a British woman at t… [+535 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Syria Intercepts Israeli Missiles Over Damascus; No Casualties: Reports", "description": "Syrian air defence intercepted Israeli missiles south of Damascus on Monday, with no casualties reported, a military source told Syria's official news agency SANA.", "url": "https://www.ndtv.com/world-news/syria-intercepts-israeli-missiles-over-damascus-no-casualties-reports-3044298", "urlToImage": "https://c.ndtvimg.com/2021-10/6e8i71v_missile-generic_650x400_17_October_21.jpg", "publishedAt": "2022-06-06T22:28:28Z", "content": "The conflict in Syria has killed nearly half a million people since war began in 2011. (Representational)\r\nDamascus: Syrian air defence intercepted Israeli missiles south of Damascus on Monday, with … [+1644 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Kanpur Clash: Top Cop Dismisses Reports Of Attack On Police During Arrest Of Accused", "description": "Kanpur police on Monday refuted the reports of an attack on the police team that went to arrest an accused in the violence that occurred in the city on June 3, and termed the information \"untrue and misleading\".", "url": "https://www.ndtv.com/india-news/kanpur-clash-top-cop-dismisses-reports-of-attack-on-police-during-arrest-of-accused-3044297", "urlToImage": "https://c.ndtvimg.com/2022-06/fjq39nm_kanpur-clash_625x300_03_June_22.jpg", "publishedAt": "2022-06-06T22:09:30Z", "content": "Police said that reports of attack on police team that went to arrest an accused is misleading.\r\nKanpur:  Kanpur police on Monday refuted the reports of an attack on the police team that went to arre… [+630 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Blinken Says Reports Of Russia Stealing Ukraine Grain \"Credible\"", "description": "US Secretary of State Antony Blinken gave support Monday to reports that Russia has stolen grain from Ukraine for resale, even as Moscow blocks the country from exporting its own corn.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-antony-blinken-says-reports-of-russia-stealing-ukraine-grain-credible-3044289", "urlToImage": "https://c.ndtvimg.com/2021-09/smc741gk_antony-blinken-afp_625x300_24_September_21.jpg", "publishedAt": "2022-06-06T21:28:02Z", "content": "The war \"is having a devastating impact on global food security, Blinken said in a statement.\r\nWashington: US Secretary of State Antony Blinken gave support Monday to reports that Russia has stolen g… [+1852 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UK PM Hails \"Convincing\" Win In Party Confidence Vote", "description": "British Prime Minister Boris Johnson vowed late Monday to plough on with governing after winning what he called a \"convincing\" victory in a Conservative confidence vote, despite a sizeable rebellion.", "url": "https://www.ndtv.com/world-news/uk-pm-boris-johnson-says-confidence-vote-win-is-convincing-3044278", "urlToImage": "https://c.ndtvimg.com/2022-03/8246og6s_boris-johnson-afp_625x300_04_March_22.jpg", "publishedAt": "2022-06-06T21:10:05Z", "content": "UK PM Boris Johnson secured the support of 59% of his lawmakers' in no-trust vote over partygate. (File)\r\nLondon: British Prime Minister Boris Johnson vowed late Monday to plough on with governing af… [+412 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Pakistani Terrorist Killed In Encounter In J&K's Baramulla: Police", "description": "A Pakistani terrorist of Lashkar-e-Taiba (LeT) was killed in an encounter with security forces in Baramulla district of Jammu and Kashmir on Monday, while three terrorists managed to escape, police said.", "url": "https://www.ndtv.com/india-news/pakistani-terrorist-killed-in-encounter-in-j-ks-baramulla-police-3044261", "urlToImage": "https://c.ndtvimg.com/2019-03/d5srpipo_jammu-kashmir-encounter-_625x300_30_March_19.jpg", "publishedAt": "2022-06-06T20:35:39Z", "content": "Kashmir zone IGP said one Pakistani terrorist was killed in the encounter. (Reprsentational)\r\nSrinagar: A Pakistani terrorist of Lashkar-e-Taiba (LeT) was killed in an encounter with security forces … [+1131 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Mumbai Police Record Salman Khan's Father's Statement Over Threat Letter", "description": "Mumbai Police on Monday recorded the statement of Bollywood actor Salman Khan's father Salim Khan, a day after a letter threatened that the father-son duo will meet the fate of Punjabi singer Sidhu Moosewala.", "url": "https://www.ndtv.com/india-news/mumbai-police-record-salman-khans-father-salim-khan-statement-over-threat-letter-3044228", "urlToImage": "https://c.ndtvimg.com/2021-05/t99aicu_radhe-salim-khan-_625x300_28_May_21.jpg", "publishedAt": "2022-06-06T20:08:51Z", "content": "Mumbai police commissioner said the police were taking the threat letter very seriously. (File)\r\nMumbai: Mumbai Police on Monday recorded the statement of Bollywood actor Salman Khan's father Salim K… [+2112 chars]"}]}