{"status": "ok", "totalResults": 488, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Curfew Extended In Rajasthan's Karauli Till April 7 After Violence", "description": "Curfew in violence-hit Rajasthan's Karauli was extended till April 7 on Monday considering the law and order situation.", "url": "https://www.ndtv.com/india-news/curfew-extended-till-april-7-in-rajasthans-karauli-after-violence-2863077", "urlToImage": "https://c.ndtvimg.com/2019-05/em980mag_rajasthan-police-generic-twitter-650_625x300_28_May_19.jpg", "publishedAt": "2022-04-05T01:51:42Z", "content": "Around 35 people were injured in the violence, police said. (Representational)\r\nJaipur: Curfew in violence-hit Rajasthan's Karauli was extended till April 7 on Monday considering the law and order si… [+3004 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Edited by NDTV News Desk", "title": "Ukraine War Updates: Biden Outlines Next Phase Of Sanctions On Russia", "description": "The recent discovery of bodies scattered on the streets of the Ukrainian town of Bucha after the withdrawal of Russian forces has sparked global outrage.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-live-updates-biden-outlines-next-phase-of-sanctions-on-russia-2863076", "urlToImage": "https://c.ndtvimg.com/2022-04/uhk608bo_bucha-killings-ukraine-afp_625x300_04_April_22.jpg", "publishedAt": "2022-04-05T01:49:14Z", "content": "Ukraine War: Bodies were collected off the streets of Ukraine's Bucha following the civilian killings.\r\nKyiv: The recent discovery of bodies scattered on the streets of the Ukrainian town of Bucha af… [+2554 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Sri Lanka Crisis Live: Opposition Rejects Unity Offer As Crisis Escalates", "description": "Sri Lanka's opposition has dismissed President Gotabaya Rajapaksa's invitation to join a unity government as \"nonsensical\" and instead demanded he resigns over the country's worsening shortages of food, fuel and medicines.", "url": "https://www.ndtv.com/world-news/sri-lanka-crisis-live-updates-lanka-opposition-rejects-presidents-unity-offer-as-crisis-escalates-2863065", "urlToImage": "https://c.ndtvimg.com/2022-04/18v6rvk_sri-lanka-crisis_625x300_05_April_22.jpg", "publishedAt": "2022-04-05T01:21:28Z", "content": "Sri Lanka is facing its worst economic crisis since 1948\r\nColombo: Sri Lanka's opposition has dismissed President Gotabaya Rajapaksa's invitation to join a unity government as \"nonsensical\" and inste… [+918 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE: India Recirds 913 New Covid Cases In 24 Hours", "description": "India on Monday recorded 913 new COVID-19 cases and 81 related deaths. The virus-related death count stands at 5,21,358 after 13 virus-related deaths were reported, according to the Union health ministry.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-5-april-2022-2863056", "urlToImage": "https://c.ndtvimg.com/2021-06/6i1ieuso_india-covid-afp_625x300_03_June_21.jpg", "publishedAt": "2022-04-05T00:38:49Z", "content": "India Covid-19 Cases: The recovery rate is currently at 98.76 per cent.\r\nNew Delhi: India on Monday recorded 913 new COVID-19 cases and 81 related deaths. The virus-related death count stands at 5,21… [+453 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Planning To Send \"Thousands Of Soldiers\" To Eastern Ukraine: US", "description": "Russia is ramping up its campaign against eastern Ukraine, with probable plans to \"deploy tens of thousands of soldiers\" to that region, the White House said on Monday, as it works will allies to unload fresh sanctions against Moscow.", "url": "https://www.ndtv.com/world-news/russia-planning-to-send-thousands-of-soldiers-to-eastern-ukraine-us-2863049", "urlToImage": "https://c.ndtvimg.com/2022-01/6bm9qbeo_russia-army-reuters_625x300_25_January_22.jpg", "publishedAt": "2022-04-05T00:01:31Z", "content": "The goal was likely to \"surround and overwhelm\" Ukrainian forces in the region, Sullivan said.\r\nWashington: Russia probably plans to deploy tens of thousands of soldiers in eastern Ukraine as it shif… [+1944 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russian Forces Responsible For Atrocities In Ukraine's Bucha: Pentagon", "description": "Russian forces are obviously responsible for the atrocities in the Ukrainian town on Bucha, the Pentagon said on Monday, even as it acknowledged it was not yet sure precisely which units were operating in the area.", "url": "https://www.ndtv.com/world-news/russian-forces-responsible-for-atrocities-in-ukraines-bucha-pentagon-2863043", "urlToImage": "https://c.ndtvimg.com/2022-04/uhk608bo_bucha-killings-ukraine-afp_625x300_04_April_22.jpg", "publishedAt": "2022-04-04T23:38:57Z", "content": "\"These atrocities occurred and occurred at the hands of Russians,\" Pentagon said.\r\nWashington: Russian forces are obviously responsible for the atrocities in the Ukrainian town on Bucha, the Pentagon… [+626 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine Says No Place For Russia On UN Human Rights Body", "description": "There should be no place for Russia on the United Nations Human Rights Council, Ukraine's Foreign Minister Dmytro Kuleba said on Tuesday.", "url": "https://www.ndtv.com/world-news/ukraine-says-no-place-for-russia-on-un-human-rights-body-2863042", "urlToImage": "https://c.ndtvimg.com/2019-09/hn4id8qg_un-human-rights-council-afp-650_650x400_10_September_19.jpg", "publishedAt": "2022-04-04T23:24:08Z", "content": "Kyiv: There should be no place for Russia on the United Nations Human Rights Council, Ukraine's Foreign Minister Dmytro Kuleba said on Tuesday.\r\n\"Spoke with UN Secretary General @AntonioGuterres on t… [+380 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "13-Year-Old Boy Kidnaps, Kills His Friend In Delhi: Police", "description": "An eight-year-old boy was allegedly abducted and killed by his 13-year-old friend in Delhi's Rohini following a fight, police said on Monday.", "url": "https://www.ndtv.com/india-news/13-year-old-boy-kidnaps-kills-his-friend-in-delhis-rohini-police-2863038", "urlToImage": "https://c.ndtvimg.com/5evuq9is_dead-body-generic_625x300_28_August_18.jpg", "publishedAt": "2022-04-04T23:12:27Z", "content": "The victim's parents work as site labourers and helpers in the area, police said. (Representational)\r\nNew Delhi: An eight-year-old boy was allegedly abducted and killed by his 13-year-old friend in D… [+1871 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Lucknow-Bound Flight Returns To Nagpur Over Suspected Technical Glitch", "description": "A Lucknow-bound IndiGo flight on Monday returned safely to the Nagpur airport from where it had taken off for its destination following a suspected technical snag, the private airline said.", "url": "https://www.ndtv.com/india-news/lucknow-bound-flight-returns-to-nagpur-over-suspected-technical-glitch-2863035", "urlToImage": "https://c.ndtvimg.com/2022-02/ulepag3g_indigobloomberg_625x300_04_February_22.jpg", "publishedAt": "2022-04-04T22:52:22Z", "content": "\"All passengers are safe and the aircraft is under further inspection,\" the airline said.\r\nNagpur: A Lucknow-bound IndiGo flight on Monday returned safely to the Nagpur airport from where it had take… [+645 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine's Zelensky Says He Will Address UN Security Council Today", "description": "Ukraine President Volodymyr Zelenskiy said he will address the United Nations Security Council on Tuesday, after saying it is in Kyiv's interest to have the most open investigation into the killing of civilians in Ukraine.", "url": "https://www.ndtv.com/world-news/ukraines-zelensky-says-he-will-address-un-security-council-today-2863029", "urlToImage": "https://c.ndtvimg.com/2022-03/djvkmrso_volodymyr-zelensky-netflix-show-servant-of-the-people-650_625x300_16_March_22.jpg", "publishedAt": "2022-04-04T22:31:35Z", "content": "\"I would like to emphasise that we are interested in transparent investigation,\" Zelensky said.\r\nKyiv:  Ukraine President Volodymyr Zelenskiy said he will address the United Nations Security Council … [+748 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "More Sanctions On Russia: US Lays Out Next Phase Of Response Against Putin", "description": "More sanctions on Moscow, more weapons for Ukraine, and a probe into alleged war crimes by Russian soldiers: the United States is upping pressure on multiple fronts against President Vladimir Putin, officials said Monday.", "url": "https://www.ndtv.com/world-news/more-sanctions-on-russia-us-lays-out-next-phase-of-response-against-vladimir-putin-2863027", "urlToImage": "https://c.ndtvimg.com/2022-03/6dp1afqo_joe-biden-in-warsaw-afp-650_625x300_26_March_22.jpg", "publishedAt": "2022-04-04T22:13:02Z", "content": "You can expect further sanctions announcements this week, the White House official said.\r\nWashington: More sanctions on Moscow, more weapons for Ukraine, and a probe into alleged war crimes by Russia… [+3342 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Will Strike South Korea With Nuclear Weapons If...: Kim Jong Un's Sister", "description": "North Korea opposes war, but if South Korea chooses military confrontation or makes a preemptive strike, then the North's nuclear forces will have to attack, the powerful sister of leader Kim Jong Un said on Tuesday.", "url": "https://www.ndtv.com/world-news/will-strike-south-korea-with-nuclear-weapons-if-north-korea-leader-kim-jong-uns-sister-kim-yo-jong-2863024", "urlToImage": "https://c.ndtvimg.com/2022-04/13dld3vo_kim-yo-jong-sister-of-kim-jong-un-reuters-240_625x300_03_April_22.jpg", "publishedAt": "2022-04-04T22:02:24Z", "content": "Earlier, North Korea warned action against Seoul over remarks on military ability.\r\nSeol: North Korea opposes war, but if South Korea chooses military confrontation or makes a preemptive strike, then… [+460 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Completely Unjustifiable\": Canada Accuses Russia Of Bucha \"War Crimes\"", "description": "Canada's foreign minister accused Russia of \"war crimes\" Monday after dead bodies were found scattered on the streets of Bucha, outside Kyiv, and warned of imminent new sanctions.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-canada-accuses-russia-of-bucha-war-crimes-2863019", "urlToImage": "https://c.ndtvimg.com/2022-04/eli5kn0g_bucha-street-ukraine-afp_625x300_02_April_22.jpg", "publishedAt": "2022-04-04T21:31:06Z", "content": "\"We will continue to impose severe costs on the Russian regime,\" Canadian Foreign Minister said.\r\nMontreal: Canada's foreign minister accused Russia of \"war crimes\" Monday after dead bodies were foun… [+1745 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine Mayor, Her Family Members Found Dead With Hands Tied: Police", "description": "Ukrainian authorities have found the bodies of five civilians with their hands tied in a village west of Kiev, including those of the mayor, her husband and son.", "url": "https://www.ndtv.com/world-news/ukraine-mayor-her-family-members-found-dead-with-hands-tied-police-2863015", "urlToImage": "https://c.ndtvimg.com/2022-03/f7oqcdh8_ukraine-war-kharkiv-afp-650_625x300_24_March_22.jpg", "publishedAt": "2022-04-04T21:16:51Z", "content": "Residents said the mayor and her husband had refused to collaborate with the Russian forces.\r\nMotyzhyn, Ukraine: Ukrainian authorities have found the bodies of five civilians with their hands tied in… [+1024 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US To Build Case For Russia War Crimes In World Court: White House", "description": "U.S. President Joe Biden will consult allies to ensure Russia and President Vladimir Putin pay the price for war crimes being committed in Ukraine, national security adviser Jake Sullivan said on Monday.", "url": "https://www.ndtv.com/world-news/us-to-build-case-for-russia-war-crimes-in-world-court-white-house-2863014", "urlToImage": "https://c.ndtvimg.com/2022-04/44tbs6qg_kharkiv-ukraine-russia-war-afp-650_625x300_04_April_22.jpg", "publishedAt": "2022-04-04T20:58:38Z", "content": "He said consultations might take place regarding the matter at the ICC or another venue.\r\nWashington: U.S. President Joe Biden will consult allies to ensure Russia and President Vladimir Putin pay th… [+1607 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "France Says It Is Expelling Russian Diplomats Over \"Security Concerns\"", "description": "France's Ministry for Europe and Foreign Affairs has said that the country has decided to expel \"many\" Russian diplomats, \"whose activities are contrary to our security interests.\"", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-france-says-it-is-expelling-russian-diplomats-over-security-concerns-2863011", "urlToImage": "https://c.ndtvimg.com/2021-10/9dstda2k_macron_625x300_09_October_21.jpg", "publishedAt": "2022-04-04T20:34:19Z", "content": "The ministry said in a statement that \"the action is part of a European approach.\"\r\nParis: France's Ministry for Europe and Foreign Affairs has said that the country has decided to expel \"many\" Russi… [+906 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Approves Sale Of 8 F-16 Fighter Jets To Bulgaria Amid Ukraine War", "description": "The US Defense Department approved Monday the sale of eight F-16 combat aircraft to Bulgaria for $1.67 billion, bolstering its air force as the regional threat has risen after Russia's invasion of Ukraine.", "url": "https://www.ndtv.com/world-news/us-approves-sale-of-8-f-16-fighter-jets-to-bulgaria-amid-ukraine-war-2862979", "urlToImage": "https://c.ndtvimg.com/7cbf7cd_lockheed-martin-f-16_625x300_04_September_18.jpg", "publishedAt": "2022-04-04T20:13:19Z", "content": "US expedited its efforts to bolster the militaries of its NATO allies amid Ukraine war.\r\nWashington: he US Defense Department approved Monday the sale of eight F-16 combat aircraft to Bulgaria for $1… [+1370 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "10 Killed, 46 Injured In Russian Strikes On Mykolaiv City: Mayor", "description": "Ten civilians were killed and 46 wounded in the Russian bombardment of the Ukrainian town of Mykolaiv, the town's mayor Oleksandr Senkevich said in a video statement Monday.", "url": "https://www.ndtv.com/world-news/10-killed-46-injured-in-russian-strikes-on-mykolaiv-city-of-ukraine-mayor-2862966", "urlToImage": "https://c.ndtvimg.com/2022-03/jpl2arl8_mykolaiv-afp_625x300_13_March_22.jpg", "publishedAt": "2022-04-04T19:50:45Z", "content": "Mykolaiv's mayor said that number of casualties could still rising in the city.\r\nKyiv: Ten civilians were killed and 46 wounded in the Russian bombardment of the Ukrainian town of Mykolaiv, the town'… [+413 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "India, Japan To Hold 2+2 Talks In Mid April In Tokyo", "description": "Defence Minister Rajnath Singh and External Affairs Minister S Jaishankar are scheduled to visit Tokyo in mid-April to hold the next edition of the '2+2' dialogue with their Japanese counterparts.", "url": "https://www.ndtv.com/india-news/india-japan-to-hold-2-2-talks-in-mid-april-in-tokyo-2862948", "urlToImage": "https://c.ndtvimg.com/2021-04/fquulb4o_indiajapanflag_625x300_10_April_21.jpg", "publishedAt": "2022-04-04T19:21:37Z", "content": "Mr Jaishankar and Mr Singh are set to travel to Tokyo after concluding a visit to the US.\r\nNew Delhi: Defence Minister Rajnath Singh and External Affairs Minister S Jaishankar are scheduled to visit … [+1960 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Conman Sukesh Chandrashekhar Arrested In Election Commission Bribery Case", "description": "Jailed conman Sukesh Chandrashekhar has been arrested by the Enforcement Directorate in another money laundering case linked to the 2017 Election Commission bribery instance.", "url": "https://www.ndtv.com/india-news/conman-sukesh-chandrashekhar-arrested-in-election-commission-bribery-case-2862900", "urlToImage": "https://c.ndtvimg.com/2021-09/o86ohdqo_sukesh-chandrashekhar-extortion-hawala-racket_625x300_04_September_21.jpg", "publishedAt": "2022-04-04T18:24:26Z", "content": "Chandrashekar was arrested in April 2017 from a five star hotel by the Delhi Police\r\nNew Delhi: Jailed conman Sukesh Chandrashekhar has been arrested by the Enforcement Directorate in another money l… [+2279 chars]"}]}