{"status": "ok", "totalResults": 633, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Warns Turkey Against New Military Operation In Syria", "description": "The United States on Tuesday warned Turkey against launching a new military operation in northern Syria, saying the uneasy NATO ally would be putting US troops at risk.", "url": "https://www.ndtv.com/world-news/us-warns-turkey-against-new-military-operation-in-syria-3006721", "urlToImage": "https://i.ndtvimg.com/i/2018-01/turkey-syria-reuters_650x400_61516533141.jpg", "publishedAt": "2022-05-24T22:38:28Z", "content": "Turkey launched 3 offensives into Syria since 2016 aimed at crushing Syrian Kurdish fighters. (File)\r\nWashington: The United States on Tuesday warned Turkey against launching a new military operation… [+3030 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Joe Biden To Speak On Texas School Shooting: White House", "description": "President Joe Biden will speak this evening on the latest school shooting in the United States after 14 students and a teacher were killed in Texas, White House spokeswoman Karine Jean-Pierre said Tuesday.", "url": "https://www.ndtv.com/world-news/joe-biden-to-speak-on-texas-school-shooting-white-house-3006718", "urlToImage": "https://c.ndtvimg.com/2022-05/n9jpkq3c_joe-biden-reuters_625x300_03_May_22.jpg", "publishedAt": "2022-05-24T22:21:27Z", "content": "Texas Shooting: The White House officials said that Joe Biden will address on the incident this evening.\r\nWashington: President Joe Biden will speak this evening on the latest school shooting in the … [+398 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "North Korea Tests Ballistic Missile Off East Coast: South Korea", "description": "North Korea fired an unspecified ballistic missile off its east coast on Wednesday, Seoul's Joint Chiefs of Staff said, days after South Korea and U.S. leaders agreed to scale up joint military drills and deployment of American weapons.", "url": "https://www.ndtv.com/world-news/north-korea-fires-ballistic-missile-as-us-president-joe-biden-concludes-asia-trip-3006715", "urlToImage": "https://c.ndtvimg.com/2022-05/nm4gbs14_north-korea-missilereuters_625x300_19_May_22.jpg", "publishedAt": "2022-05-24T22:07:15Z", "content": "Japan's Coast Guard also reported a suspected ballistic missile launch by North Korea.\r\nSeol:  North Korea fired an unspecified ballistic missile off its east coast on Wednesday, Seoul's Joint Chiefs… [+670 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Plot To Kill George W Bush In Revenge For Iraq War Foiled: FBI", "description": "An Iraqi man who sought political asylum in the United States plotted to kill former president George W. Bush, the Justice Department said Tuesday.", "url": "https://www.ndtv.com/world-news/plot-to-kill-george-w-bush-in-revenge-for-iraq-invasion-foiled-fbi-3006708", "urlToImage": "https://i.ndtvimg.com/i/2017-10/george-w-bush-afp_650x400_61508466075.jpg", "publishedAt": "2022-05-24T21:42:23Z", "content": "Accused told that they wanted to kill George W Bush for 2013 Iraq invasion.\r\nWashington: An Iraqi man who sought political asylum in the United States plotted to kill former president George W. Bush,… [+1722 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Hungary Imposes State Of Emergency Over Russia-Ukraine War", "description": "Hungary's prime minister Viktor Orban on Tuesday imposed a new state of emergency in the country, citing the challenges posed by the ongoing war in neighbouring Ukraine.", "url": "https://www.ndtv.com/world-news/hungary-imposes-state-of-emergency-over-russia-ukraine-war-3006697", "urlToImage": "https://i.ndtvimg.com/i/2017-07/hungarian-prime-minister-viktor-orban-reuters_650x400_51500720817.jpg", "publishedAt": "2022-05-24T21:10:21Z", "content": "Hungary Emergency: Hungary is already under a state of emergency-- linked to the Covid pandemic.\r\nBudapest: Hungary's prime minister Viktor Orban on Tuesday imposed a new state of emergency in the co… [+1532 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US: 2 Killed, Several Injured In Shooting At Texas Primary School", "description": "Two children were killed and a dozen injured Tuesday after a gunman opened fire at an elementary school in Texas, police and a local hospital said.", "url": "https://www.ndtv.com/world-news/us-2-killed-several-injured-in-shooting-at-texas-primary-school-3006690", "urlToImage": "https://c.ndtvimg.com/2018-09/hms9qqjc_us-police-generic_625x300_14_September_18.jpg", "publishedAt": "2022-05-24T20:33:59Z", "content": "Texas Shooting: Official said at least 13 people hospitalised following the incident. (Representational)\r\nHouston: Two people were killed and a dozen children injured Tuesday after a gunman opened fi… [+1059 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "BJP Leader Hacked To Death In Chennai: Police", "description": "Tamil Nadu BJP Central District Chairman of the SC/ST wing, Balachandran, was hacked to death by three unidentified assailants in Chintadripet, a locality in Tamil Nadu's Chennai on Tuesday.", "url": "https://www.ndtv.com/india-news/tamil-nadu-bjp-leader-balachandran-hacked-to-death-in-chennai-police-3006662", "urlToImage": "https://i.ndtvimg.com/i/2017-03/police-generic_650x400_51490324353.jpg", "publishedAt": "2022-05-24T20:17:21Z", "content": "As per information, 3 unidentified persons came on a bike to kill him and escaped. (Representational)\r\nChennai: Tamil Nadu BJP Central District Chairman of the SC/ST wing, Balachandran, was hacked to… [+1595 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Iran Building Collapse: Death Count Rises To 14, Dozens Feared Trapped", "description": "The death toll from the collapse of a tower block in southwestern Iran rose to 14 on Tuesday, as the authorities announced the arrest of officials accused of being \"responsible\" for the tragedy.", "url": "https://www.ndtv.com/world-news/iran-building-collapse-death-count-rises-to-14-dozens-feared-trapped-3006652", "urlToImage": "https://c.ndtvimg.com/2022-05/4vcd2gmg_abadan-building-accident-reuters_625x300_24_May_22.jpg", "publishedAt": "2022-05-24T19:54:45Z", "content": "Iran Building Collapse: The provincial judiciary said 10 people arrested in connection with the incident.\r\nTehran: The death toll from the collapse of a tower block in southwestern Iran rose to 14 on… [+1783 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "10 Killed After Gunmen Open Fire On Bars, Hotel In Mexico", "description": "Gunmen killed 10 people in an attack on a hotel and two bars in Mexico's central city of Celaya, with calling cards claiming the massacre left behind by a known criminal group, authorities said Tuesday.", "url": "https://www.ndtv.com/world-news/10-killed-after-gunmen-open-fire-on-bars-hotel-in-celaya-in-mexico-3006630", "urlToImage": "https://i.ndtvimg.com/i/2018-03/police-generic-international-afp_650x400_41520126059.jpg", "publishedAt": "2022-05-24T19:15:01Z", "content": "Mexico Shooting: Authorities did not say which group was involved in attack in Celaya. (Representational)\r\nCelaya, Mexico: Gunmen killed 10 people in an attack on a hotel and two bars in Mexico's cen… [+1864 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Eliminator, LSG vs RCB: When And Where To Watch Live Telecast, Streaming", "description": "Lucknow Super Giants and Royal Challengers Bangalore clash in the IPL 2022 Eliminator at the Eden Gardens in Kolkata on Wednesday.", "url": "https://sports.ndtv.com/ipl-2022/ipl-2022-eliminator-lucknow-super-giants-vs-royal-challengers-bangalore-when-and-where-to-watch-live-telecast-live-streaming-3004818", "urlToImage": "https://c.ndtvimg.com/2022-05/9k8le1v_kl-rahul-faf-du-plessis-bcciipl_625x300_24_May_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-24T18:59:40Z", "content": "Lucknow Super Giants and Royal Challengers Bangalore clash in the IPL 2022 Eliminator at the Eden Gardens in Kolkata on Wednesday. At stake will be a place in Qualifier 2, which is scheduled to be he… [+1091 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Jo-Wilfried Tsonga Says Tearful Farewell After French Open Defeat", "description": "The 37-year-old Tsonga, who announced last month he would retire following the French Open, was beaten 6-7 (6/8), 7-6 (7/4), 6-2, 7-6 (7/0) by Casper Ruud", "url": "https://sports.ndtv.com/french-open-2022/jo-wilfried-tsonga-says-tearful-farewell-after-french-open-defeat-3006620", "urlToImage": "https://c.ndtvimg.com/2022-05/egndureg_tsonga-afp_625x300_25_May_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-24T18:56:13Z", "content": "Jo-Wilfried Tsonga, a former Australian Open runner-up and world number five, bid an emotional goodbye to tennis at Roland Garros on Tuesday after losing in the first round to Casper Ruud. The 37-yea… [+1781 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Karti Chidambaram Likely To Appear Before CBI Today In Visa Scam Case", "description": "Congress MP Karti Chidambaram is likely to appear before the CBI on Wednesday to join the investigation into an alleged scam pertaining to issuance of visa to 263 Chinese nationals in 2011 when his father P Chidambaram was the home minister.", "url": "https://www.ndtv.com/india-news/karti-chidambaram-likely-to-appear-before-cbi-today-in-visa-scam-case-3006614", "urlToImage": "https://c.ndtvimg.com/2022-05/3723k7ig_karti-chidambaram-pti-pic_650x400_17_May_22.jpg", "publishedAt": "2022-05-24T18:48:21Z", "content": "Karti Chidambaram in a statement denied all allegations made against him. (File)\r\nNew Delhi: Congress MP Karti Chidambaram is likely to appear before the CBI on Wednesday to join the investigation in… [+4364 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Miller, Pandya Take Gujarat Titans Into IPL 2022 Final With Win Over RR", "description": "Royals rode on Jos Buttler's 56-ball-89 to post 188 for six in 20 overs. Hardik Pandya (40* off 27 balls) and Miller (68* off 38 balls) added 101 runs in exactly 10 overs to seal the deal with three balls to spare.", "url": "https://sports.ndtv.com/ipl-2022/david-miller-hardik-pandya-take-gujarat-titans-into-ipl-2022-final-with-win-over-rajasthan-royals-3006605", "urlToImage": "https://c.ndtvimg.com/2022-05/ckehselg_pandya-miller-bcciipl_625x300_25_May_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-24T18:42:22Z", "content": "David Miller hit three effortless sixes which looked like action replays as Gujarat Titans, under their inspirational skipper Hardik Pandya, made a mockery of all the odds to reach the final of IPL-1… [+4381 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Maharashtra Gets Rs 80,000 Crore Investment Pledges At Davos", "description": "ReNew Power will invest a huge Rs 50,000 crore in renewable power generation in the state with a generating capacity of 10,000 to 12,000 Megawatts.", "url": "https://www.ndtv.com/india-news/maharashtra-gets-rs-80-000-crore-investment-pledges-at-davos-3006583", "urlToImage": "https://c.ndtvimg.com/2022-05/fi1ggt2c_maharashtra-davos-delegation-ndtv_625x300_24_May_22.jpg", "publishedAt": "2022-05-24T18:29:01Z", "content": "Maharashtra signed two MoUs of strategic co-operation at Davos.\r\nDavos: The Maharashtra government on Tuesday said its delegation had a successful visit to the World Economic Forum annual meeting in … [+1150 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Heavy Rain Kills 39 People In One Day In Uttar Pradesh: Officials", "description": "Thirty nine people lost their lives and three were injured in various rain-related incidents in Uttar Pradesh in a day, the state government said today. Most of these casualties were due to dust storms, lightning, thunderstorms and drowning.", "url": "https://www.ndtv.com/india-news/heavy-rains-kill-39-people-in-one-day-in-uttar-pradesh-officials-3006578", "urlToImage": "https://c.ndtvimg.com/2022-05/7eln201_delhi-rain-thunderstorm-650_650x400_21_May_22.jpg", "publishedAt": "2022-05-24T18:26:53Z", "content": "Five lives were lost due to lightning, one each in Aligarh, Shahjahanpur and Banda. (Representational)\r\nLucknow: Thirty nine people lost their lives and three were injured in various rain-related inc… [+1273 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Himachal Climber Scales Four 8,000 Metre Peaks In Less Than One Month", "description": "Baljeet Kaur has become the first Indian mountaineer to scale four 8,000 metre peaks in less than a month after she successfully climbed Mount Lhotse, the fourth highest mountain in the world.", "url": "https://www.ndtv.com/india-news/himachal-pradesh-climber-scales-4-8-000-metre-peaks-in-less-than-1-month-3006569", "urlToImage": "https://c.ndtvimg.com/2022-05/uebged9o_baljeet-kaur_625x300_24_May_22.jpg", "publishedAt": "2022-05-24T18:22:12Z", "content": "Baljeet Kaur successfully scaled the world's fourth highest peak with her guide Mingma Sherpa.\r\nKathmandu: Baljeet Kaur has become the first Indian mountaineer to scale four 8,000 metre peaks in less… [+797 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Large Gatherings Banned Near Mosque In Mangaluru Till Thursday", "description": "Large gatherings have been banned within 500-meter area of Malali Juma Masjid in Mangaluru on Tuesday.", "url": "https://www.ndtv.com/karnataka-news/large-gatherings-banned-near-mosque-in-mangaluru-till-thursday-3006563", "urlToImage": "https://i.ndtvimg.com/i/2017-03/police-generic_650x400_51490324353.jpg", "publishedAt": "2022-05-24T18:18:32Z", "content": "Section 144 will be in place from 8 pm of May 24 to 8 am of May 26. (Representational photo)\r\nMangaluru, Karnataka: Large gatherings have been banned within 500-meter area of Malali Juma Masjid in Ma… [+435 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Woman Killed, Husband Missing In Tiger Attack In Maharashtra's Chandrapur", "description": "A 55-year-old woman was mauled to death by a tiger in Maharashtra's Chandrapur district on today, while her husband is missing after the attack, a forest department official said.", "url": "https://www.ndtv.com/cities/woman-killed-husband-missing-in-tiger-attack-in-maharashtras-chandrapur-3006556", "urlToImage": "https://c.ndtvimg.com/2022-02/3hqj2ffg_tiger_625x300_18_February_22.jpg", "publishedAt": "2022-05-24T18:15:51Z", "content": "The incident took place when the woman was plucking tundu leaves with her husband. (Representational)\r\nChandrapur, Maharashtra: A 55-year-old woman was mauled to death by a tiger in Maharashtra's Cha… [+616 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Premier League Board Approve Chelsea Takeover By Todd Boehly Group", "description": "A Premier League statement said on Tuesday: \"The Premier League Board has today approved the proposed takeover of Chelsea Football Club by the Todd Boehly/Clearlake Consortium.\"", "url": "https://sports.ndtv.com/football/premier-league-board-approve-chelsea-takeover-by-todd-boehly-group-3006540", "urlToImage": "https://c.ndtvimg.com/2022-05/t7eohrl8_chelsea-logo-afp_625x300_24_May_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-24T18:09:54Z", "content": "Todd Boehly's proposed takeover of Chelsea moved a step closer to completion on Tuesday when the Premier League board announced it had approved his purchase of the London club.\r\nBoehly's consortium a… [+394 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "On Camera: Man Cuts Sadhu's Hair, Shouts Abuses In Madhya Pradesh Market", "description": "A man after a disagreement dragged a sadhu in a hair salon in a busy Madhya Pradesh market and cut his hair, showed a disturbing video. The incident took place in tribal zone of Patajan village in Khalwa.", "url": "https://www.ndtv.com/bhopal-news/on-camera-man-hurl-abuses-cuts-sadhus-hair-in-public-arrested-3006531", "urlToImage": "https://c.ndtvimg.com/2022-05/8ao7v8cc_sadhu-assaulted_625x300_24_May_22.jpg", "publishedAt": "2022-05-24T18:05:04Z", "content": "Based on the video, a case has been registered against the accused, the police said.\r\nKhandwa, Madhya Pradesh: A man after a disagreement dragged a sadhu in a hair salon in a busy Madhya Pradesh mark… [+1457 chars]"}]}