{"status": "ok", "totalResults": 571, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Insensitive\" Words Removed As New York Times Makes Wordle Its Own", "description": "Some four-letter words are taboo, but the New York Times has added a few five-lettered ones to the list -- by removing them from the hit game Wordle.", "url": "https://www.ndtv.com/world-news/wordle-insensitive-words-removed-as-new-york-times-makes-wordle-its-own-2770835", "urlToImage": "https://c.ndtvimg.com/2022-01/57ktgfr8_wordle-afp_625x300_27_January_22.jpg", "publishedAt": "2022-02-16T01:53:02Z", "content": "The New York Times announced that it bought Wordle, a game played by millions.\r\nWashington: Some four-letter words are taboo, but the New York Times has added a few five-lettered ones to the list -- … [+1483 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Strong Protection For Babies Born To Covid-Vaccinated Moms: US Study", "description": "Babies born to mothers fully vaccinated against the coronavirus during pregnancy were around 60 percent less likely to be hospitalized with severe Covid, a new study by the US Centers for Disease Control and Prevention said Tuesday.", "url": "https://www.ndtv.com/world-news/coronavirus-covid-vaccine-coronavirus-vaccine-strong-protection-for-babies-born-to-covid-vaccinated-moms-us-study-2770832", "urlToImage": "https://c.ndtvimg.com/2021-06/r6e5kmv8_vaccine-generic-650_625x300_25_June_21.jpeg", "publishedAt": "2022-02-16T01:46:37Z", "content": "Coronavirus: The CDC carried out a study involving 379 babies aged up to six months.\r\nWashington: Babies born to mothers fully vaccinated against the coronavirus during pregnancy were around 60 perce… [+2563 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "In A First, Woman Reported Cured Of HIV After Bone Marrow Transplant", "description": "A US patient with leukemia has become the first woman and the third person to date to be cured of HIV after receiving a bone marrow transplant from a donor who was naturally resistant to the virus that causes AIDS, researchers reported on Tuesday.", "url": "https://www.ndtv.com/world-news/in-a-first-woman-reported-cured-of-hiv-after-bone-marrow-transplant-2770830", "urlToImage": "https://c.ndtvimg.com/2019-05/u3d2k0b8_hiv-aids-pixabay-650_625x300_03_May_19.jpg", "publishedAt": "2022-02-16T01:43:32Z", "content": "Scientists believe these individuals then develop an immune system resistant to HIV.\r\nChicago, United States: A US patient with leukemia has become the first woman and the third person to date to be … [+2485 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Satvik Khare", "title": "Realme 9 Pro 5G, Realme 9 Pro+ 5G India Launch Today: How to Watch Livestream, Expected Price, Specifications", "description": "Realme 9 Pro 5G and Realme 9 Pro+ 5G will launch in India today at 1:30pm IST. The launch event will be livestreamed on Realme's official YouTube channel. Realme 9 Pro+ has been confirmed to be powered by a MediaTek Dimensity 920 SoC, paired with Arm Mali-G68…", "url": "https://gadgets.ndtv.com/mobiles/news/realme-9-pro-plus-india-launch-today-watch-livestream-price-specifications-expected-2770036", "urlToImage": "https://i.gadgets360cdn.com/large/realme_9_pro_plus_india_launch_date_image_1643866935235.jpg", "publishedAt": "2022-02-16T01:30:01Z", "content": "Realme 9 Pro 5G and Realme 9 Pro+ 5G will launch in India today. The new smartphone series from Realme has had some of its key specifications confirmed via a dedicated microsite. Realme 9 Pro+ 5G wil… [+2461 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Canada Truckers Refuse To End Protest Despite Emergency Powers", "description": "Trucker-led protesters occupying the Canadian capital showed no sign of backing down Tuesday, despite a newly invoked state of emergency granting wide new powers to end their weeks-long protest over Covid rules.", "url": "https://www.ndtv.com/world-news/hold-the-line-canada-truckers-refuse-to-end-protest-despite-emergency-powers-2770819", "urlToImage": "https://c.ndtvimg.com/2022-02/5v7rrn9_canada-trucker-blockade-poses-risk-to-supply-chain-auto-industry-says-us-government_625x300_13_February_22.jpg", "publishedAt": "2022-02-16T01:12:46Z", "content": "Justin Trudeau said the military would not be deployed at this time.\r\nOttawa: Trucker-led protesters occupying the Canadian capital showed no sign of backing down Tuesday, despite a newly invoked sta… [+4765 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus Highlights: 27,409 Fresh COVID-19 Cases In India", "description": "India reported 27,409 new COVID-19 cases on Tuesday, bringing the Covid tally to 4,26,92,943. According to the Ministry of Health, the daily positivity rate in India has been recorded at 2.23 per cent and the weekly positivity rate at 3.63 per cent.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-16-february-2022-2770805", "urlToImage": "https://c.ndtvimg.com/2020-11/mls1442o_covid-testingdelhinoidaborderpti_625x300_18_November_20.jpg", "publishedAt": "2022-02-16T00:11:06Z", "content": "Covid-19 Cases in India: The recovery rate was recorded at 97.82 per cent.\r\nNew Delhi: India reported 27,409 new COVID-19 cases on Tuesday, bringing the Covid tally to 4,26,92,943. According to the M… [+530 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Senators Send Solidarity Message To People Of Ukraine", "description": "US senators joined together Tuesday to express a \"message of solidarity\" to the Ukrainian people and a warning to Russia's Vladimir Putin, although the chamber failed to agree on drafting sanctions against Moscow.", "url": "https://www.ndtv.com/world-news/us-senate-sends-solidarity-message-to-ukraine-warns-russian-president-vladimir-putin-2770801", "urlToImage": "https://i.ndtvimg.com/i/2016-06/us-senate_650x400_51466076372.jpg", "publishedAt": "2022-02-15T23:58:11Z", "content": "\"In this dark hour, we are sending a message of solidarity to the people of Ukraine\", the statement said.\r\nWashington: US senators joined together Tuesday to express a \"message of solidarity\" to the … [+1812 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Ex-Policeman Charged In George Floyd's Death Defends Actions: Report", "description": "A former Minneapolis police officer charged with violating the civil rights of George Floyd took the witness stand on Tuesday to defend his actions during the fatal May 2020 arrest of the 46-year-old Black man.", "url": "https://www.ndtv.com/world-news/us-ex-policeman-charged-in-george-floyds-death-defends-actions-report-2770798", "urlToImage": "https://c.ndtvimg.com/2020-06/5s6ofqec_george-floyd-reuters-650_625x300_06_June_20.jpg", "publishedAt": "2022-02-15T23:34:41Z", "content": "Ex-policeman said officers \"were not trying to hurt\" Floyd but were \"just trying to restrain him.\" (file)\r\nSaint Paul: A former Minneapolis police officer charged with violating the civil rights of G… [+2953 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sea Level Expected To Rise A Foot On US Coasts By 2050: Report", "description": "The US coastline is expected to experience up to a foot (30 centimeters) of sea-level rise by the year 2050 because of climate change, making damaging floods far more common than today, a US government study said Tuesday.", "url": "https://www.ndtv.com/world-news/sea-level-expected-to-rise-a-foot-on-us-coasts-by-2050-report-2770794", "urlToImage": "https://c.ndtvimg.com/2020-01/j4ktmop4_rising-sea-level-generic-unsplash_625x300_16_January_20.jpg", "publishedAt": "2022-02-15T23:09:32Z", "content": "About two feet of sea level rise is thought increasingly likely between 2020 and 2100, the report said.\r\nWashington: The US coastline is expected to experience up to a foot (30 centimeters) of sea-le… [+2881 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"See Doctor For Paranoia Over Ukraine\": Russia Mocks West's War Fear", "description": "Russia's deputy ambassador to the United Nations on Tuesday told western leaders they should see a doctor for their \"paranoia\" over fears that the 100,000 or so Russian troops massed on Ukraine's borders might invade.", "url": "https://www.ndtv.com/world-news/see-doctor-for-paranoia-over-ukraine-russia-mocks-wests-war-fear-2770789", "urlToImage": "https://c.ndtvimg.com/2022-02/gun9gfu_russia-ukraine-conflict-afp_625x300_12_February_22.jpg", "publishedAt": "2022-02-15T22:51:38Z", "content": "\"Our troops are on our territory, (they) represent (a) threat to no one,\" said Russian Diplomat.\r\nMoscow: Russia's deputy ambassador to the United Nations on Tuesday told western leaders they should … [+1006 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Not Our Enemy\": What Biden Said On Russian Troop Pullback From Ukraine", "description": "US President Joe Biden said Tuesday that there was still time to resolve the Ukraine crisis through diplomacy but warned that sanctions are \"ready to go\" if Russian troops attack the country.", "url": "https://www.ndtv.com/world-news/not-our-enemy-what-joe-biden-said-on-russian-troop-pullback-from-ukraine-2770787", "urlToImage": "https://c.ndtvimg.com/2021-02/aoc9o6rc_joe-biden_625x300_23_February_21.jpg", "publishedAt": "2022-02-15T22:30:36Z", "content": "\"We should give the diplomacy every chance to succeed,\" Biden Said in a press conference at White House.\r\nWashington: US President Joe Biden said Tuesday that there was still time to resolve the Ukra… [+4393 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine Crisis: US Tells Russia It Wants Proof On Troops Withdrawal", "description": "US Secretary of State Antony Blinken told Russian Foreign Minister Sergei Lavrov on Tuesday that the US has ongoing concerns about Russia's ability to launch an invasion of Ukraine and needs to see \"verifiable, credible, meaningful escalation.\"", "url": "https://www.ndtv.com/world-news/us-tells-russia-it-wants-proof-on-troops-withdrawal-from-ukraine-2770782", "urlToImage": "https://c.ndtvimg.com/2021-09/o8qndj7_antony-blinken_625x300_07_September_21.jpg", "publishedAt": "2022-02-15T22:01:49Z", "content": "Russia said some of its troops were returning to base after exercises near Ukraine.\r\nWashington: US Secretary of State Antony Blinken told Russian Foreign Minister Sergei Lavrov on Tuesday that the U… [+1312 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Joe Biden Says Russian Attack On Ukraine \"Still Very Much Possibility\"", "description": "President Joe Biden urged Russia to step back from the brink of war on Tuesday and said reports that Russia has withdrawn some forces from the Ukraine border have not been verified.", "url": "https://www.ndtv.com/world-news/us-president-joe-biden-says-russian-attack-on-ukraine-still-very-much-possibility-2770776", "urlToImage": "https://c.ndtvimg.com/2021-03/smj2fbeo_joe-biden-afp-_625x300_26_March_21.jpg", "publishedAt": "2022-02-15T21:22:02Z", "content": "Joe Biden said if Russia were to attack Americans in Ukraine, \"we will respond forcefully.\"\r\nWashington: President Joe Biden urged Russia to step back from the brink of war on Tuesday and said report… [+1006 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "France Slams Russian Bid To Recognise Separatist Ukraine Regions", "description": "France's foreign minister said on Tuesday that if Moscow recognised two Russian-backed breakaway regions in eastern Ukraine as independent it would be an \"attack without weapons\".", "url": "https://www.ndtv.com/world-news/attack-without-weapons-france-slams-russian-bid-to-recognise-separatist-ukraine-regions-2770771", "urlToImage": "https://c.ndtvimg.com/2021-04/11394ivo_emmanuel-macron-reuters_625x300_01_April_21.jpg", "publishedAt": "2022-02-15T21:07:20Z", "content": "The Kremlin said on Tuesday some of its troops were returning to base after exercises near Ukraine.\r\nParis: France's foreign minister said on Tuesday that if Moscow recognised two Russian-backed brea… [+1333 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Canada Announces To Ease Covid Health Measures For Travellers At Borders", "description": "Canadian officials announced Tuesday an easing of Covid-19 checks and rules for travelers arriving at its borders, including no longer requiring PCR tests.", "url": "https://www.ndtv.com/world-news/canada-announces-to-ease-covid-health-measures-for-travellers-at-borders-2770764", "urlToImage": "https://c.ndtvimg.com/2021-11/iet9g8kk_canada-border-afp_625x300_23_November_21.jpg", "publishedAt": "2022-02-15T20:37:03Z", "content": "Fully vaccinated people entering Canada will no longer have to take a pre-arrival PCR test.\r\nOttawa: Canadian officials announced Tuesday an easing of Covid-19 checks and rules for travelers arriving… [+546 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Vietnam To Lift Covid Curbs on International Flights For Fully Vaccinated", "description": "Vietnam will lift coronavirus restrictions on international flights for fully vaccinated passengers from Tuesday, the country's aviation authority said in a statement.", "url": "https://www.ndtv.com/world-news/coronavirus-vietnam-to-lift-covid-curbs-on-international-flights-for-fully-vaccinated-2770732", "urlToImage": "https://c.ndtvimg.com/2021-12/h0tb5pt8_covid-airport-generic-afp-world_625x300_30_December_21.jpg", "publishedAt": "2022-02-15T20:11:13Z", "content": "More than 90% of adults in the Vietnam have received two COVID-19 vaccine doses. (Representational)\r\nHanoi: Vietnam will lift coronavirus restrictions on international flights for fully vaccinated pa… [+1450 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Biden, Macron Agree On Checking Russian Claims On Troops Withdrawal", "description": "France's President Emmanuel Macron and his US counterpart Joe Biden agreed Tuesday on the need to verify Russian claims it was beginning to withdraw troops from the Ukrainian border, the French presidency said.", "url": "https://www.ndtv.com/world-news/us-president-joe-biden-france-president-emmanuel-macron-agree-on-checking-russian-claims-on-troops-withdrawal-from-ukraine-border-2770714", "urlToImage": "https://c.ndtvimg.com/2021-10/h8hfa1os_-biden-macron_625x300_06_October_21.jpg", "publishedAt": "2022-02-15T19:27:13Z", "content": "\"There is a dynamic that must be verified and consolidated\", French Macron said.\r\nParis: France's President Emmanuel Macron and his US counterpart Joe Biden agreed Tuesday on the need to verify Russi… [+1327 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "On Suhana Khan's Red Saree Pic, This Is What Gauri Khan Commented", "description": "Manish Malhotra shared pictures of Suhana Khan in a red saree", "url": "https://www.ndtv.com/entertainment/on-suhana-khans-red-saree-pic-this-is-what-gauri-khan-commented-2770680", "urlToImage": "https://c.ndtvimg.com/2022-02/0397e24o_suhana-khan_625x300_16_February_22.jpg", "publishedAt": "2022-02-15T18:46:16Z", "content": "Manish Malhotra posted this. (Image courtesy: manishmalhotra05)\r\nHighlights\r\n<ul><li>Manish Malhotra shared a set of pictures\r\n</li><li>\"S U H A N A,\" wrote Manish Malhotra\r\n</li><li>Gauri Khan wrote… [+1844 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Sends Hypersonic-Armed Fighter Jets To Syria For Drills: Report", "description": "Russia has deployed MiG-31K fighter jets with hypersonic Kinzhal missiles and long-range Tupolev Tu-22M strategic bombers to its air base in Syria for naval exercises, Interfax news agency reported on Tuesday, citing the defence ministry.", "url": "https://www.ndtv.com/world-news/russia-sends-hypersonic-armed-fighter-jets-to-syria-for-drills-report-2770664", "urlToImage": "https://c.ndtvimg.com/2022-02/otdigqao_russia-fighter-jet-mig-31-reuters-650_625x300_15_February_22.jpg", "publishedAt": "2022-02-15T18:24:35Z", "content": "The fighter jets have been dispatched to Russia's Hmeimim air base. (File)\r\nMoscow: Russia has deployed MiG-31K fighter jets with hypersonic Kinzhal missiles and long-range Tupolev Tu-22M strategic b… [+1478 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Parliament Asks Putin To Recognise Breakaway East Ukraine Regions", "description": "Russia's lower house of parliament voted on Tuesday to ask President Vladimir Putin to recognise two Russian-backed breakaway regions in eastern Ukraine as independent, the house speaker said.", "url": "https://www.ndtv.com/world-news/russia-parliament-asks-vladimir-putin-to-recognise-breakaway-east-ukraine-regions-2770660", "urlToImage": "https://c.ndtvimg.com/2022-02/mv01sfag_russia-parliament-reuters-650_625x300_15_February_22.jpg", "publishedAt": "2022-02-15T18:17:02Z", "content": "Russia denies any Ukraine invasion plans and has accused the West of hysteria. (File)\r\nMoscow: Russia's lower house of parliament voted on Tuesday to ask President Vladimir Putin to recognise two Rus… [+2341 chars]"}]}