{"status": "ok", "totalResults": 277, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Health Authority Says Moderna Covid Vaccine Effective In Under-Fives", "description": "US health authorities confirmed on Friday that data provided by drug-maker Moderna on the efficacy of its Covid-19 vaccine among very young children were accurate.", "url": "https://www.ndtv.com/world-news/covid-19-us-health-authority-says-moderna-vaccine-effective-in-under-fives-3057386", "urlToImage": "https://c.ndtvimg.com/2021-06/d8o4bnc_moderna-inc-650_625x300_30_June_21.jpeg", "publishedAt": "2022-06-10T21:48:36Z", "content": "Moderna's vaccine is currently only authorized for people aged 18 and older in the US.\r\nWashington: US health authorities confirmed on Friday that data provided by drug-maker Moderna on the efficacy … [+2227 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Eye Is Not Blinking\": Justin Bieber Says Suffering From Facial Paralysis", "description": "Justin Bieber on Friday told fans in a video posted to Instagram that he's been diagnosed with Ramsay Hunt Syndrome, which is causing him partial facial paralysis.", "url": "https://www.ndtv.com/world-news/justin-bieber-says-suffering-from-facial-paralysis-3057375", "urlToImage": "https://c.ndtvimg.com/2021-12/t1m49ufo_justin-bieberafp_625x300_01_December_21.jpg", "publishedAt": "2022-06-10T21:19:34Z", "content": "Justin Bieber recently announced he was pausing his Justice World Tour due to illness.\r\nNew York: Justin Bieber on Friday told fans in a video posted to Instagram that he's been diagnosed with Ramsay… [+1188 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Monkeypox Cases Harder To Detect, Say US Health Experts", "description": "US health experts said Friday that cases of monkeypox that are being detected at the moment do not necessarily display the usual symptoms, making the disease more difficult to diagnose.", "url": "https://www.ndtv.com/world-news/monkeypox-cases-harder-to-detect-say-us-health-experts-3057368", "urlToImage": "https://c.ndtvimg.com/2022-05/0kvsbm5o_monkeypox-virus_625x300_27_May_22.jpg", "publishedAt": "2022-06-10T21:06:55Z", "content": "Monkeypox: As of June 9, around 1,300 cases had been identified worldwide.\r\nWashington: US health experts said Friday that cases of monkeypox that are being detected at the moment do not necessarily … [+2000 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "On Camera, 2 Men Stop Car On Mumbai Sea-Link To Save Bird, Killed By Taxi", "description": "A 43-year-old businessman and his driver, who got down from their car to save an injured bird on Bandra-Worli Sea Link, died after being hit by a taxi on May 30, police said on Friday.", "url": "https://www.ndtv.com/india-news/mumbai-bizman-driver-get-down-on-sealink-to-save-injured-bird-killed-by-speeding-taxi-3057359", "urlToImage": "https://i.ndtvimg.com/i/2016-08/accident-generic_650x400_61471695567.jpg", "publishedAt": "2022-06-10T20:39:18Z", "content": "The case was registered against taxi driver for rash and negligent driving. (Representational)\r\nMumbai: A 43-year-old businessman and his driver, who got down from their car to save an injured bird o… [+1048 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Congress Says Ajay Maken Wins, Recounting On In Haryana Rajya Sabha Polls", "description": "The Congress tweeted its leader Ajay Maken has won the Rajya Sabha elections from Haryana. However, a recounting is on after a vote was rejected. The BJP's Krishan Lal Panwar won the second seat in Haryana.", "url": "https://www.ndtv.com/india-news/rajya-sabha-elections-congress-wins-seat-in-haryana-beats-bjp-backed-media-baron-3057328", "urlToImage": "https://c.ndtvimg.com/2020-09/5u6qtss_rajya-sabha-generic-pti-photo_625x300_23_September_20.jpg", "publishedAt": "2022-06-10T20:27:38Z", "content": "Haryana Rajya Sabha elections: Congress and BJP won one seat each\r\nChandigarh: The Congress tweeted its leader Ajay Maken has won the Rajya Sabha elections from Haryana. However, a recounting is on a… [+1102 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Officially Quits UN Tourism Body After Suspension Over Ukraine", "description": "Moscow on Friday officially announced its withdrawal from the United Nations World Tourism Organization which suspended Russia in April over its military operation in Ukraine.", "url": "https://www.ndtv.com/world-news/russia-officially-quits-un-tourism-body-after-suspension-over-ukraine-3057318", "urlToImage": "https://c.ndtvimg.com/2022-02/6j8mr0f8_vladimir-putin-afp_625x300_23_February_22.jpg", "publishedAt": "2022-06-10T20:06:16Z", "content": "The UN tourism agency had suspended Russia on April 27, saying Ukraine was against its \"values\".\r\nMoscow: Moscow on Friday officially announced its withdrawal from the United Nations World Tourism Or… [+655 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Facebook Probing Outgoing Executive's Use Of Company Resources: Report", "description": "Lawyers are investigating Meta Platforms Inc's outgoing operations chief Sheryl Sandberg's use of company resources over several years, the Wall Street Journal reported on Friday, citing people familiar with the matter.", "url": "https://www.ndtv.com/world-news/facebook-probing-outgoing-executive-sheryl-sandbergs-use-of-company-resources-report-3057298", "urlToImage": "https://c.ndtvimg.com/2020-03/me9bmuko_facebook-coo-sheryl-sandberg-_625x300_18_March_20.jpg", "publishedAt": "2022-06-10T19:35:28Z", "content": "Sandberg said that she will continue to serve on Meta's board after leaving the company in the fall.\r\nSan Francisco: Lawyers are investigating Meta Platforms Inc's outgoing operations chief Sheryl Sa… [+1287 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Counting Of Rajya Sabha Votes Stalled In Haryana Over Claims of Irregularities", "description": "The counting of votes for the two Rajya Sabha seats in Haryana got stalled indefinitely today as the ruling BJP complained about cross-voting and when turned down by the local poll observer, approached the Election Commission in Delhi.", "url": "https://www.ndtv.com/india-news/rajya-sabha-elections-counting-of-rajya-sabha-votes-stalled-in-haryana-over-claims-of-irregularities-3057289", "urlToImage": "https://c.ndtvimg.com/2019-07/ufqclhug_parliament-generic-reuters_625x300_31_July_19.jpg", "publishedAt": "2022-06-10T19:24:59Z", "content": "Rajya Sabha Elections:The BJP sought cancellation of the votes of two Congress members.\r\nNew Delhi: The counting of votes for the two Rajya Sabha seats in Haryana got stalled indefinitely today as th… [+2919 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rajya Sabha Polls: Why Maharashtra Counting Delayed For Hours Explained", "description": "The counting for election to six Rajya Sabha seats from Maharashtra was delayed for several hours on Friday as the BJP questioned the validity of ballots cast by three MLAs of the ruling Maha Vikas Aghadi, or MVA, coalition.", "url": "https://www.ndtv.com/india-news/rajya-sabha-polls-why-maharashtra-counting-delayed-for-hours-explained-3057279", "urlToImage": "https://i.ndtvimg.com/i/2016-08/election-commission_650x400_51471943512.jpg", "publishedAt": "2022-06-10T19:11:34Z", "content": "Counting of votes in Maharashtra Rajya Sabha election was delayed\r\nMumbai: The counting for election to six Rajya Sabha seats from Maharashtra was delayed for several hours on Friday as the BJP quest… [+3254 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Prophet Row: Internet Suspended In Ranchi Till Tomorrow After Protests", "description": "All internet services were temporarily suspended in Ranchi till 6 am on Saturday i.e June 11, in wake of protests in the city on Friday over controversial remarks on Prophet Muhammad.", "url": "https://www.ndtv.com/india-news/prophet-row-internet-suspended-in-jharkhands-ranchi-till-tomorrow-after-protests-3057277", "urlToImage": "https://c.ndtvimg.com/2022-06/dpnms0t_ranchi-prophet-protest_625x300_10_June_22.jpg", "publishedAt": "2022-06-10T19:08:17Z", "content": "Ranchi Protest: At least six people were injured during protests on Friday over Prophet remark.\r\nRanchi: All internet services were temporarily suspended in Ranchi till 6 am on Saturday i.e June 11, … [+3708 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Legal Action To Be Taken: Delhi Police On Protests Over Prophet Remarks", "description": "Delhi Deputy Commissioner of Police assured legal action against the protestors who took to the streets to mark their protest over the controversial remarks of suspended BJP leader Nupur Sharma and expelled leader Naveen Jindal.", "url": "https://www.ndtv.com/india-news/legal-action-to-be-taken-delhi-police-on-protests-over-prophet-remarks-3056554", "urlToImage": "https://c.ndtvimg.com/2022-06/1phqubeo_delhi-jamam-masjid-prophet-protests_625x300_10_June_22.jpg", "publishedAt": "2022-06-10T19:08:12Z", "content": "Delhi: Protests erupted outside the Jama Masjid in Delhi after Friday prayers.\r\nNew Delhi: Assuring legal action against the protestors who took to the streets to mark their protest over the controve… [+2272 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Heat Wave In Northwest, Central India Eases Slightly: Weather Office", "description": "The ongoing heatwave spell in northwest and central India eased a little on Friday and maximum temperatures are likely to fall by two to three degrees by next week, the India Meteorological Department (IMD) said.", "url": "https://www.ndtv.com/india-news/heat-wave-in-northwest-central-india-eases-slightly-weather-office-3056609", "urlToImage": "https://c.ndtvimg.com/2022-05/vle12j38_ajmer-rajasthan-heatwave-pti_625x300_07_May_22.jpg", "publishedAt": "2022-06-10T19:00:46Z", "content": "Northwest and central India is reeling under a heatwave spell.\r\nNew Delhi: The ongoing heatwave spell in northwest and central India eased a little on Friday and maximum temperatures are likely to fa… [+2083 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Boy, 11, Falls Into Borewell In Chhattisgarh; Rescue Ops Underway", "description": "An 11-year-old boy fell into a 80-feet deep abandoned borewell at a village in Chhattisgarh's Janjgir-Champa district on Friday, an official said.", "url": "https://www.ndtv.com/india-news/boy-11-falls-into-borewell-in-chhattisgarh-rescue-ops-underway-3056691", "urlToImage": "https://i.ndtvimg.com/i/2016-02/child-borewell_650x400_71454346989.jpg", "publishedAt": "2022-06-10T18:55:44Z", "content": "Chhattisgarh: The child, Rahul Sahu, fell into the abandoned borewell. (Representational)\r\nJanjgir: An 11-year-old boy fell into a 80-feet deep abandoned borewell at a village in Chhattisgarh's Janjg… [+1332 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Keep Faith In Your Abilities, Move Ahead: President Kovind Tells Students", "description": "President Ram Nath Kovind on Friday exhorted the students to keep faith in their abilities and move forward, noting that the country's youth have the capability to utilise opportunities lying in front of them.", "url": "https://www.ndtv.com/india-news/keep-faith-in-your-abilities-move-ahead-president-kovind-tells-students-3056695", "urlToImage": "https://c.ndtvimg.com/2020-09/46c72q8o_president-ram-nath-kovind-pti_625x300_19_September_20.jpg", "publishedAt": "2022-06-10T18:52:43Z", "content": "President Ram Nath Kovind will visit Atal Tunnel Rohtang, which connects Kullu and Lahaul-Spiti.\r\nShimla: President Ram Nath Kovind on Friday exhorted the students to keep faith in their abilities an… [+3646 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Before 2014... Policy Making Not Given Attention: Home Minister Amit Shah", "description": "Union Home Minister Amit Shah on Friday said many sectors remained unexplored in the country in the past due to lack of conducive policies.", "url": "https://www.ndtv.com/india-news/before-2014-policy-making-not-given-attention-home-minister-amit-shah-3056780", "urlToImage": "https://c.ndtvimg.com/2022-06/o5t035rk_amit-shah-pti-650-_625x300_10_June_22.jpg", "publishedAt": "2022-06-10T18:48:46Z", "content": "Amit Shah spoke at the launch of headquarters of the Indian National Space Promotion.\r\nAhmedabad: Union Home Minister Amit Shah on Friday said many sectors remained unexplored in the country in the p… [+1506 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Delhi Man Fakes Kidnapping As Parents Opposed His Relationship: Police", "description": "A 24-year-old man faked his kidnapping in central Delhi as his parents were allegedly against his relationship, police said on Friday.", "url": "https://www.ndtv.com/india-news/delhi-man-fakes-kidnapping-as-parents-opposed-his-relationship-police-3056938", "urlToImage": "https://c.ndtvimg.com/2021-09/h868cgro_-goa-police-_625x300_28_September_21.jpg", "publishedAt": "2022-06-10T18:45:51Z", "content": "He disclosed that he loves a girl of his locality and wants to marry her, police said. (Representational)\r\nNew Delhi: A 24-year-old man faked his kidnapping in central Delhi as his parents were alleg… [+1203 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "World Gin Day 2022: 5 Homegrown Gin Brands You Must Try - NDTV Food Recommends", "description": "This World Gin Day 2022, we handpicked some of our favourite homegrown gin brands for you. Take a look.", "url": "https://food.ndtv.com/lists/world-gin-day-2022-5-homegrown-gin-brands-you-must-try-ndtv-food-recommends-3057234", "urlToImage": "https://i.ndtvimg.com/i/2016-08/gin-and-tonic_625x350_71472122912.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-10T18:39:14Z", "content": "Let's agree - India has experienced a gin revolution in the past few years. We have seen Indian gin landscape blooming like never before. What used to be the tiniest section on the bar menu has now t… [+4196 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Iran's Nuclear Tactics Leaves Biden in Tough Spot", "description": "A flare-up in tensions between the UN nuclear monitor and Iran this week has left US President Joe Biden in an increasingly tight jam.", "url": "https://www.ndtv.com/world-news/irans-nuclear-tactics-leaves-biden-in-tough-spot-3057197", "urlToImage": "https://c.ndtvimg.com/2022-06/q6pll2vo_joe-biden-afp_625x300_03_June_22.jpg", "publishedAt": "2022-06-10T18:18:17Z", "content": "Talks between Iran and the major powers resumed last year at Biden's impetus.\r\nWashington: A flare-up in tensions between the UN nuclear monitor and Iran this week has left US President Joe Biden in … [+4762 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "2nd Test: Mitchell, Blundell Help NZ Take Command vs England On Day 1", "description": "Daryl Mitchell led the New Zealand charge as the tourists powered to 318-4 against England by close of play on the first day of the second Test on Friday", "url": "https://sports.ndtv.com/cricket/england-vs-new-zealand-2nd-test-daryl-mitchell-tom-blundell-help-new-zealand-take-command-on-day-1-3057167", "urlToImage": "https://c.ndtvimg.com/2022-06/86jc1mdo_daryl-mitchell-tom-blundell-afp_625x300_10_June_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-10T18:03:35Z", "content": "Daryl Mitchell led the New Zealand charge as the tourists powered to 318-4 against England by close of play on the first day of the second Test on Friday. Mitchell's aggressive 81 not out and an unbe… [+3457 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Rolls Out Measures To Resolve Migration Crisis At Americas Summit", "description": "The United States on Friday unveiled a long list of measures to confront the migration crisis as President Joe Biden and fellow leaders prepared to issue a joint declaration thrashed out at a fractious Summit of the Americas.", "url": "https://www.ndtv.com/world-news/summit-of-the-americas-us-rolls-out-measures-to-resolve-migration-crisis-at-americas-summit-3057142", "urlToImage": "https://c.ndtvimg.com/2022-06/dqa4ufbo_joe-biden-reuters_625x300_10_June_22.jpg", "publishedAt": "2022-06-10T17:50:12Z", "content": "The plan caps a summit hosted by Joe Biden that was designed to reassert US leadership.\r\nLos Angeles: The United States on Friday unveiled a long list of measures to confront the migration crisis as … [+4975 chars]"}]}