{"status": "ok", "totalResults": 457, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Return To Path Of Diplomacy\": India Expresses Concern Over Ukraine", "description": "India said that it was deeply concerned over the deteriorating situation in Ukraine and reiterated its call for immediate cessation of violence and end to hostilities, saying all differences can only be bridged through honest, sincere and dialogue.", "url": "https://www.ndtv.com/india-news/return-to-path-of-diplomacy-india-expresses-concern-over-ukraine-crisis-2795961", "urlToImage": "https://c.ndtvimg.com/2022-02/1p8eqlbg_russia-ukraine-crisis-afp-650_625x300_27_February_22.jpg", "publishedAt": "2022-03-01T01:26:22Z", "content": "\"This important humanitarian necessity must be immediately addressed,\" Indian envoy said at UN.\r\nUnited Nations: India has said that it was deeply concerned over the deteriorating situation in Ukrain… [+2131 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE: India Reports Over 8,000 New Covid Cases In 24 Hours", "description": "India on Monday reported at least 8,013 new COVID-19 cases--22 per cent lower than yesterday's daily spike of over 10,000 cases. According to Union Health Ministry, India's total tally of COVID-19 cases rose to 4,29,24,130.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-1-march-2022-2795946", "urlToImage": "https://c.ndtvimg.com/2021-12/poj0l18_delhi-covid-testing-pti-650_650x400_31_December_21.jpg", "publishedAt": "2022-03-01T00:50:50Z", "content": "India Covid cases: The daily COVID-19 cases have remained less than one lakh for 22 consecutive days.\r\nNew Delhi: India on Monday reported at least 8,013 new COVID-19 cases--22 per cent lower than ye… [+561 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Microsoft To Remove Russian-Linked News Apps, Media Ads From Its Platform", "description": "Microsoft Corp said on Monday it would remove Russian state-owned media outlet RT's mobile apps from the Windows App store and ban advertisements on Russian state-sponsored media, as global tech firms respond to Moscow's invasion of Ukraine.", "url": "https://www.ndtv.com/world-news/microsoft-to-remove-russian-linked-news-apps-media-ads-from-its-platform-2795936", "urlToImage": "https://c.ndtvimg.com/2022-02/q9vvs3sg_russia-ukraine-crisis-military-reuters-650_625x300_24_February_22.jpg", "publishedAt": "2022-03-01T00:07:03Z", "content": "The company said it would not display any state-sponsored RT and Sputnik content.\r\nWashington: Microsoft Corp said on Monday it would remove Russian state-owned media outlet RT's mobile apps from the… [+1262 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Used A Vacuum Bomb During Invasion, Claims Ukraine", "description": "Russia used a vacuum bomb on Monday in its invasion of Ukraine, the Ukrainian ambassador to the U.S., Oksana Markarova, said.", "url": "https://www.ndtv.com/world-news/russia-used-a-vacuum-bomb-during-invasion-claims-ukraine-2795934", "urlToImage": "https://c.ndtvimg.com/2022-02/g4286508_russia-ukraine-crisis-afp-650_625x300_27_February_22.jpg", "publishedAt": "2022-02-28T23:48:34Z", "content": "The aerosol bomb or vacuum bomb prohibited by the Geneva convention.\r\nWashington: Russia used a vacuum bomb on Monday in its invasion of Ukraine, the Ukrainian ambassador to the US, Oksana Markarova,… [+340 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Twitter, Facebook To Restrict Russian-Linked News Outlets In Europe", "description": "Social media giants Twitter and Facebook parent Meta moved Monday to curb the presence on their platforms of Russian state-linked news outlets, which stand accused of pushing misinformation about Moscow's invasion of Ukraine.", "url": "https://www.ndtv.com/world-news/twitter-facebook-to-restrict-russian-linked-news-outlets-rt-sputnik-in-europe-2795930", "urlToImage": "https://c.ndtvimg.com/2022-02/4vvb0mt_russia-ukraine-crisis-afp-650_625x300_25_February_22.jpg", "publishedAt": "2022-02-28T23:32:54Z", "content": "Meta said it would be restricting access in the European Union to RT and Sputnik.\r\nSan Francisco, United States: Social media giants Twitter and Facebook parent Meta moved Monday to curb the presence… [+3348 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine President Seeks Ban On Russia In All Global Airports, Ports", "description": "Ukrainian President Volodymyr Zelensky on Monday sought a global ban on Russian planes and ships as punishment for attacking his country.", "url": "https://www.ndtv.com/world-news/ukraine-president-volodymyr-zelensky-seeks-ban-on-russia-in-all-global-airports-ports-2795924", "urlToImage": "https://c.ndtvimg.com/2022-02/t6vi5sa8_russia-ukraine-crisis-650_625x300_27_February_22.jpg", "publishedAt": "2022-02-28T23:06:17Z", "content": "\"We must close entry for this state in all ports,\" says Ukrainian President.\r\nKyiv: Ukrainian President Volodymyr Zelensky on Monday sought a global ban on Russian planes and ships using foreign airp… [+1584 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Expulsion Of Diplomats A \"Hostile Move\", Says Russia", "description": "Russia's ambassador in Washington on Monday described the US expulsion of 12 UN staff as a \"hostile move\".", "url": "https://www.ndtv.com/india-news/ukraine-crisis-us-expulsion-of-diplomats-a-hostile-move-says-russia-2795910", "urlToImage": "https://c.ndtvimg.com/2022-02/tvpkfh_russia-ukraine-crisis-afp-650_625x300_27_February_22.jpg", "publishedAt": "2022-02-28T22:16:45Z", "content": "US said that those ordered to leave had \"abused their privileges\" of residency in the United States.\r\nMoscow: Russia's ambassador in Washington on Monday described the US expulsion of 12 UN staff as … [+496 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Canada Announces Ban On Oil Imports From Russia Over Ukraine Crisis", "description": "Canadian Prime Minister Justin Trudeau announced Monday a ban on Russian oil imports, saying oil revenues have helped to prop up President Vladimir Putin and Russian oligarchs.", "url": "https://www.ndtv.com/world-news/canada-announces-ban-on-oil-imports-from-russia-over-ukraine-crisis-2795899", "urlToImage": "https://c.ndtvimg.com/2022-02/hu44ikr_ukraine-russia-conflict-afp-650_625x300_24_February_22.jpg", "publishedAt": "2022-02-28T21:56:46Z", "content": "\"Putin was terribly wrong and this measure sends a powerful message,\" Justin Trudeau said.\r\nOttawa: Canadian Prime Minister Justin Trudeau announced Monday a ban on Russian oil imports, saying oil re… [+1915 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "International Criminal Court To Open Probe Into \"War Crimes\" In Ukraine", "description": "International Criminal Court prosecutor Karim Khan said Monday he was launching an investigation on the \"situation in Ukraine\" following Russia's invasion.", "url": "https://www.ndtv.com/world-news/international-criminal-court-to-open-probe-into-war-crimes-in-ukraine-2795895", "urlToImage": "https://c.ndtvimg.com/2022-02/qhfk5sm_russia-ukraine-crisis-ukraine-army-afp-650_625x300_28_February_22.jpg", "publishedAt": "2022-02-28T21:32:44Z", "content": "Prosecutor said he decided to proceed with opening an investigation into the situation in Ukraine.\r\nThe Hague, Netherlands: International Criminal Court prosecutor Karim Khan said Monday he was launc… [+1070 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "EU Imposes Sanctions On Putin's Spokesman Among 26 High-Profile Russians", "description": "Kremlin spokesman Dmitry Peskov is among 26 prominent people sanctioned by the European Union for Russia's invasion of Ukraine, according to the decision published on Monday on the EU's official journal.", "url": "https://www.ndtv.com/world-news/eu-imposes-sanctions-on-putins-spokesman-among-26-high-profile-russians-2795888", "urlToImage": "https://c.ndtvimg.com/2022-02/2el7hq9o_russia-ukraine-war-afp-650_625x300_26_February_22.jpg", "publishedAt": "2022-02-28T21:10:22Z", "content": "The listings include oligarchs and businessmen active in the oil, banking and finance sectors.\r\nBrussels: Kremlin spokesman Dmitry Peskov is among 26 prominent people sanctioned by the European Union… [+1117 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia's Attack Slowing Down? Not So Fast, Experts Say", "description": "The Russian army may have advanced less fast than planned in five days of war in Ukraine, but experts on Monday warned against jumping to conclusions from the apparent slowdown.", "url": "https://www.ndtv.com/world-news/russias-attack-slowing-down-not-so-fast-experts-say-2795883", "urlToImage": "https://c.ndtvimg.com/2022-02/5ftbdjpg_russia-ukraine-crisis-reuters-650_625x300_27_February_22.jpg", "publishedAt": "2022-02-28T20:46:20Z", "content": "Moscow has also accused Ukraine of using civilians as human shields.\r\nParis: The Russian army may have advanced less fast than planned in five days of war in Ukraine, but experts on Monday warned aga… [+3763 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "As Refugees Pour In, A Defiant Ukrainian City Prepares For War", "description": "For millions of Ukrainians, the Russian invasion five days ago brought death, terror and uncertainty. For Mila Hadzieva, an IT manager in the western city of Lviv, it brought a searing clarity of purpose.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-as-refugees-pour-in-a-defiant-ukrainian-city-lviv-prepares-for-war-2795862", "urlToImage": "https://c.ndtvimg.com/2022-03/rjck5pv8_ukraine-refugees-reuters_625x300_01_March_22.jpg", "publishedAt": "2022-02-28T20:20:27Z", "content": "Hundreds waited in the freezing cold at Lviv's station, hoping to board a rare train to Poland.\r\nLviv, Ukraine: For millions of Ukrainians, the Russian invasion five days ago brought death, terror an… [+3331 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "12 Russian UN Diplomats Expelled From US Over Ukraine Crisis: Official", "description": "Twelve members of Russia's diplomatic mission to the UN have been ordered to leave the United States by the end of March, Russia's ambassador to the world body said Monday.", "url": "https://www.ndtv.com/world-news/12-russian-un-diplomats-expelled-from-us-over-ukraine-crisis-official-2795857", "urlToImage": "https://c.ndtvimg.com/2022-03/ktpod94g_unga-generic-russia-ukraine-afp-650_625x300_01_March_22.jpg", "publishedAt": "2022-02-28T20:15:04Z", "content": "The Russian mission to the UN has around 100 staff, according to a Russian diplomatic source.\r\nUnited Nations: Twelve members of Russia's diplomatic mission to the UN have been ordered to leave the U… [+959 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Maharashtra Minister Files Plea Against Arrest In Money Laundering Case", "description": "Maharashtra minister Nawab Malik on Monday approached the Bombay High Court seeking quashing of the case registered against him by the Enforcement Directorate  probing money laundering linked to fugitive Underworld don Dawood Ibrahim.", "url": "https://www.ndtv.com/india-news/maharashtra-minister-nawab-malik-files-plea-in-high-court-against-arrest-in-money-laundering-case-2795834", "urlToImage": "https://c.ndtvimg.com/2022-02/92rkhos_nawab-malik-arrest-ani-650-_650x400_23_February_22.jpg", "publishedAt": "2022-02-28T19:30:13Z", "content": "Mr Malik is presently in the custody of the ED till March 3.\r\nMumbai: Maharashtra minister Nawab Malik, arrested last week, on Monday approached the Bombay High Court seeking quashing of the case reg… [+2054 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Ghost of Kyiv\" Real Or Urban Legend? Some Facts About Ukraine's \"Ace\"", "description": "Ghost of Kyiv: A Ukrainian fighter pilot has been credited with shooting down 10 Russian jets on Day 1 of the invasion.", "url": "https://www.ndtv.com/world-news/ghost-of-kyiv-real-or-urban-legend-some-facts-about-ukraines-ace-2795817", "urlToImage": "https://c.ndtvimg.com/2022-03/p71vr6c_ghost-of-kyiv_625x300_01_March_22.jpg", "publishedAt": "2022-02-28T19:02:18Z", "content": "The \"Ghost of Kyiv\" serves as a massive morale booster for Ukrainian forces\r\nNew Delhi: A Ukrainian fighter pilot has been credited with shooting down 10 Russian jets on Day 1 of the invasion. Though… [+2221 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Isolated Russia Defends Ukraine War At UN General Assembly", "description": "Facing deepening isolation on the world stage, Russia faced a crucial test of support Monday as the 193 members of the UN General Assembly held an extraordinary debate on a resolution condemning Moscow's \"aggression\" in Ukraine.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-isolated-russia-defends-ukraine-war-at-un-general-assembly-2795810", "urlToImage": "https://c.ndtvimg.com/2022-03/ktpod94g_unga-generic-russia-ukraine-afp-650_625x300_01_March_22.jpg", "publishedAt": "2022-02-28T18:50:24Z", "content": "Russia-Ukraine crisis: UN Secretary-General said the fighting in Ukraine must stop.\r\nUnited Nations: Facing deepening isolation on the world stage, Russia faced a crucial test of support Monday as th… [+4038 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "In Bengaluru, Schools Focus On Exams, Say Hijab Not An Issue", "description": "The annual exams are on in Karnataka schools and while in the districts, many students in hijab have been unable to take them, schools in Bengaluru have steered clear of controversy and focused on education.", "url": "https://www.ndtv.com/india-news/in-bengaluru-schools-focus-on-exams-say-hijab-not-an-issue-2795808", "urlToImage": "https://c.ndtvimg.com/2022-02/ecpm8al8_karnataka-hijab-pti-650_625x300_16_February_22.jpg", "publishedAt": "2022-02-28T18:48:45Z", "content": "Karnataka high court said religious attire will not be allowed in educational institutions\r\nBengaluru: The annual exams are on in Karnataka schools and while in the districts, many students in hijab … [+4004 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Ukrainian Tennis Players Ask WTA To Take A Stand On Invasion", "description": "Two Ukrainian women tennis players aimed a swing at the WTA on Monday when they criticised the organisation for not taking a position on the Russian invasion of their country", "url": "https://sports.ndtv.com/tennis/ukrainian-tennis-players-ask-wta-to-take-a-stand-on-invasion-2795804", "urlToImage": "https://c.ndtvimg.com/2022-03/90d8td5g_wta-twitter_625x300_01_March_22.jpg", "publishedAt": "2022-02-28T18:46:32Z", "content": "Two Ukrainian women tennis players aimed a swing at the WTA on Monday when they criticised the organisation for not taking a position on the Russian invasion of their country. Marta Kostyuk, ranked 5… [+2411 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Says Ukraine Neutrality, Demilitarisation Key To Ending Conflict", "description": "Russian President Vladimir Putin told his French counterpart on Monday that the demilitarisation of Ukraine and Western recognition of Russian sovereignty over the Crimean peninsula were prerequisites to ending fighting in Ukraine, the Kremlin said.", "url": "https://www.ndtv.com/world-news/russia-ukraine-crisis-russia-says-ukraine-neutrality-demilitarisation-key-to-ending-conflict-2795790", "urlToImage": "https://c.ndtvimg.com/2022-03/kcfon7ag_russia-ukraine-kyiv-afp-650_625x300_01_March_22.jpg", "publishedAt": "2022-02-28T18:32:34Z", "content": "Russia-Ukraine War: Putin's remark came during a call with his French counterpart.\r\nMoscow: Russian President Vladimir Putin on Monday levelled conditions on ending Moscow's offensive against Ukraine… [+6908 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Russia Expelled From World Cup, Clubs Banned From International Competitions - NDTVSports.com", "description": "<ol><li>Russia Expelled From World Cup, Clubs Banned From International Competitions  NDTVSports.com\r\n</li><li>FIFA bans matches in Russia, no flag or anthem for team  Times of India\r\n</li><li>FIFA and UEFA suspend Russian national and club teams 'until furth…", "url": "https://sports.ndtv.com/football/fifa-expels-russia-from-football-world-cup-2795466", "urlToImage": "https://c.ndtvimg.com/2020-12/cpnmiteo_fifa-world-cup-trophy-afp_625x300_07_December_20.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-02-28T18:26:00Z", "content": "Russia has been expelled from the World Cup after being suspended from all international competitions \"until further notice\", FIFA and UEFA announced in a joint statement on Monday, while European fo… [+3767 chars]"}]}