{"status": "ok", "totalResults": 342, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US-Led Coalition Says It Detained Senior Islamic State Leader In Syria", "description": "The US-led coalition said it had detained a senior Islamic State group leader in Syria during an early-morning operation on Thursday.", "url": "https://www.ndtv.com/world-news/us-led-coalition-says-it-detained-senior-islamic-state-leader-in-syria-3071328", "urlToImage": "https://i.ndtvimg.com/i/2015-02/us-coalition-warplanes_650x400_61423745823.jpg", "publishedAt": "2022-06-16T02:10:36Z", "content": "The coalition conducts raids and strikes targeting members of the Islamic State group.\r\nBeirut: The US-led coalition said it had detained a senior Islamic State group leader in Syria during an early-… [+1686 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "47 Countries Express Concern Over China's Xinjiang \"Abuses\" At UN: Report", "description": "Forty-seven countries voiced concern about abuses in China's far-western Xinjiang region, and demanded that the United Nations rights chief publish a long-delayed report on Uyghurs' repression.", "url": "https://www.ndtv.com/world-news/47-countries-express-concern-over-chinas-xinjiang-abuses-against-uyghurs-at-un-report-3071323", "urlToImage": "https://c.ndtvimg.com/2019-09/hn4id8qg_un-human-rights-council-afp-650_650x400_10_September_19.jpg", "publishedAt": "2022-06-16T01:54:14Z", "content": "The joint statement also voiced concern about reports of \"torture\" of Uyghur Muslims in Xinjiang.\r\nGeneva: Forty-seven countries voiced concern about abuses in China's far-western Xinjiang region, an… [+2632 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Brazillian Stripper Interrupts Peruvian President's Corruption Hearing", "description": "A video of a dancing Brazilian stripper interrupted a virtual public hearing of Peruvian President Pedro Castillo's corruption investigation on Wednesday.", "url": "https://www.ndtv.com/world-news/brazillian-stripper-interrupts-peruvian-presidents-corruption-hearing-3071317", "urlToImage": "https://c.ndtvimg.com/2022-06/3teqitag_brazil-stripper-reuters-_625x300_16_June_22.jpg", "publishedAt": "2022-06-16T01:45:35Z", "content": "The video appeared through the user account of Benji Espinosa, a member of Castillo's defense team.\r\nLima: A video of a dancing Brazilian stripper interrupted a virtual public hearing of Peruvian Pre… [+1647 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "North Korea Expands Restoration At Nuke Test Site To 2nd Tunnel: Report", "description": "North Korea appears to be expanding restoration work at its nuclear test site to include a second tunnel, a U.S.-based think tank said on Thursday, as South Korean and U.S. officials say a new nuclear test could happen any day.", "url": "https://www.ndtv.com/world-news/north-korea-expands-restoration-at-nuke-test-site-to-2nd-tunnel-report-3071303", "urlToImage": "https://i.ndtvimg.com/i/2017-11/north-korea-nuclear-test-kim-jong-un-reuters_650x400_41511839822.jpg", "publishedAt": "2022-06-16T01:23:04Z", "content": "North Korea conducted six underground nuclear tests at the site from 2006 to 2017. (Representational)\r\nSeoul: North Korea appears to be expanding restoration work at its nuclear test site to include … [+1795 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Amid Covid Fight, N Korea Reports Outbreak Of Another Infectious Disease", "description": "North Korea has reported an outbreak of an unidentified intestinal epidemic on Thursday, potentially adding to strains on the isolated country's healthcare system which is battling an unprecedented COVID-19 wave.", "url": "https://www.ndtv.com/world-news/amid-covid-fight-n-korea-reports-outbreak-of-another-infectious-disease-3071302", "urlToImage": "https://c.ndtvimg.com/2022-05/bqo0tvn8_north-korea-covid-afp_625x300_17_May_22.jpg", "publishedAt": "2022-06-16T01:22:27Z", "content": "North Korea reported 26,010 more people with fever symptoms on Thursday.\r\nSeoul: North Korea has reported an outbreak of an unidentified intestinal epidemic on Thursday, potentially adding to strains… [+1666 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Former US President Ronald Reagan's Shooter Released After 41 Years", "description": "John Hinckley, who tried to assassinate US president Ronald Reagan in 1981, regained his freedom fully on Wednesday, six years after he was released from a psychiatric hospital.", "url": "https://www.ndtv.com/world-news/former-us-president-ronald-reagans-shooter-john-hinckley-released-after-41-years-3071291", "urlToImage": "https://i.ndtvimg.com/i/2016-07/john-hinckley-reuters_650x400_71469647404.jpg", "publishedAt": "2022-06-16T00:55:56Z", "content": "John Hinckley shot Reagan and three others with a revolver outside a Washington hotel in 1981.\r\nWashington: John Hinckley, who tried to assassinate US president Ronald Reagan in 1981, regained his fr… [+2168 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE: India Reports 8,822 New Covid Cases, 15 Deaths In 24 Hours", "description": "India recorded 8,822 new coronavirus cases on Wednesday, bringing the total number of COVID-19 cases to 4,32,45,517.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-16-june-3071282", "urlToImage": "https://c.ndtvimg.com/2020-11/tic69pi_delhi-covid19-testing-pti-november-2020_650x400_23_November_20.jpg", "publishedAt": "2022-06-16T00:45:28Z", "content": "With 5,718 recoveries in the last 24 hours, the total recoveries have reached 4,26,67,088.\r\nNew Delhi: India recorded 8,822 new coronavirus cases on Wednesday, bringing the total number of COVID-19 c… [+542 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Global Food Crisis Will Drive Record Displacement Levels Higher: UN", "description": "A food security crisis stoked by the Ukraine war is set to push more people to flee their homes in poorer countries, driving record levels of global displacement even higher, the head of the U.N. refugee agency (UNHCR) said.", "url": "https://www.ndtv.com/world-news/global-food-crisis-will-drive-record-displacement-levels-higher-un-3071277", "urlToImage": "https://c.ndtvimg.com/2021-09/gsd0jr24_afghan-children_625x300_02_September_21.jpg", "publishedAt": "2022-06-16T00:29:17Z", "content": "The UN refugee body said that it is now more than double the 42.7 million people displaced in 2012.\r\nUnited Nations: A food security crisis stoked by the Ukraine war is set to push more people to fle… [+2107 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Saudi Embassy Street In Washington Renamed \"Jamal Khashoggi Way\"", "description": "The street in front of Saudi Arabia's embassy in Washington was renamed Wednesday for Jamal Khashoggi as activists vowed never to forget the slain journalist despite President Joe Biden's planned visit to the kingdom.", "url": "https://www.ndtv.com/world-news/jamal-khashoggi-way-washington-renames-street-in-front-of-saudi-embassy-3071254", "urlToImage": "https://c.ndtvimg.com/2022-06/pedd0718_jamal-khashoggi-way_625x300_16_June_22.jpg", "publishedAt": "2022-06-15T23:42:18Z", "content": "The street in front of Saudi Arabia's embassy in Washington renamed as Jamal Khashoggi Way.\r\nWashington: The street in front of Saudi Arabia's embassy in Washington was renamed Wednesday for Jamal Kh… [+2758 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Two US Citizens In Ukraine Feared Captured By Russia: Families", "description": "Two U.S. citizens who traveled to Ukraine as volunteer fighters against Russian forces have been missing for a week and are feared captured, family members said on Wednesday.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-two-us-citizens-missing-in-ukraine-feared-captured-by-russia-families-3071248", "urlToImage": "https://c.ndtvimg.com/2022-03/jfhfb1bg_russia-ukraine-war-kharkiv-reuters-650_625x300_01_March_22.jpg", "publishedAt": "2022-06-15T23:17:48Z", "content": "Ukraine War: The two US citizens, who went missing, were traveled to Ukraine to fight against Russia.\r\nWashington: Two U.S. citizens who traveled to Ukraine as volunteer fighters against Russian forc… [+2836 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rain Lashes Parts Of Delhi-NCR; Brings Respite From Heat", "description": "Parts of Delhi and the National Capital Region (NCR) received rains in the early hours of Thursday.", "url": "https://www.ndtv.com/india-news/delhi-rains-rain-lashes-parts-of-delhi-ncr-brings-respite-from-heat-3071241", "urlToImage": "https://c.ndtvimg.com/2021-12/tbcqevag_delhi-rains-ndtv-650_625x300_02_December_21.jpg", "publishedAt": "2022-06-15T22:58:23Z", "content": "Delhi Rains: The weather office predicts the moderate rain for 6 days in Delhi. (Representational)\r\nNew Delhi: Parts of Delhi and the National Capital Region (NCR) received rains in the early hours o… [+969 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Grateful\": Zelensky Thanks Biden For New US Arms Package To Ukraine", "description": "Ukrainian President Volodymyr Zelensky said Wednesday he was \"grateful\" for a new American arms package to Kyiv after speaking to US President Joe Biden.", "url": "https://www.ndtv.com/world-news/volodymyr-zelensky-thanks-biden-for-new-us-arms-package-to-ukraine-3071234", "urlToImage": "https://c.ndtvimg.com/2022-06/ah6js3os_zelensky-reuters_625x300_01_June_22.jpg", "publishedAt": "2022-06-15T22:32:27Z", "content": "Ukraine War: Zelensky said the US' move will help especially (the eastern region of) in Donbas.\r\nKyiv: Ukrainian President Volodymyr Zelensky said Wednesday he was \"grateful\" for a new American arms … [+1538 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Weather Office Predicts Rain, Thunderstorm In Delhi, Haryana Today", "description": "Delhi and Haryana are likely to receive thunderstorms with light to moderate rains on Thursday, as per India Meteorological Department.", "url": "https://www.ndtv.com/india-news/weather-office-predicts-rain-thunderstorm-in-delhi-haryana-today-3071227", "urlToImage": "https://c.ndtvimg.com/2021-08/f9oo0u9g_delhi-rain-ndtv_625x300_01_August_21.jpg", "publishedAt": "2022-06-15T22:07:01Z", "content": "Delhi Rains: Winds are expected at a speed of 30-40 KM per hour, weather office said. (Representational)\r\nNew Delhi: Delhi and Haryana are likely to receive thunderstorms with light to moderate rains… [+706 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Tamil Nadu: Power Struggle Again In AIADMK, Back-To-Back Meetings On", "description": "Separate closed door meetings and back-to-back parleys on Wednesday over who should lead the party indicated a gathering storm of power struggle in the AIADMK between top leaders, O Panneerselvam and Edappadi K Palaniswami.", "url": "https://www.ndtv.com/india-news/tamil-nadu-power-struggle-again-in-aiadmk-back-to-back-meetings-on-3071216", "urlToImage": "https://c.ndtvimg.com/2022-06/hikacrus_aiadmk-leaders-650_625x300_14_June_22.jpg", "publishedAt": "2022-06-15T21:28:11Z", "content": "Supporters of OPS staged a protest here opposing 'removal' of posters in support of their leader.\r\nChennai: Separate closed door meetings and back-to-back parleys on Wednesday over who should lead th… [+3690 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Fresh Landslides In Assam, Heavy Rains In Guwahati", "description": "Fresh landslides were reported from various parts of Guwahati for the second consecutive day on Wednesday amid incessant rainfall, which also led to heavy waterlogging in most parts of the city, officials said.", "url": "https://www.ndtv.com/india-news/fresh-landslides-in-assam-heavy-rains-in-guwahati-3071211", "urlToImage": "https://c.ndtvimg.com/2022-06/hblp4hu_assam-landslide_625x300_14_June_22.jpg", "publishedAt": "2022-06-15T21:15:22Z", "content": "Assam Rains: The state has registered 42 deaths due to floods and landslides this year. (File)\r\nGuwahati:  Fresh landslides were reported from various parts of Guwahati for the second consecutive day… [+2999 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Stop Excluding Women From Peace Talks In Global Conflicts: UN Chief", "description": "Men must stop excluding women from peace talks around the world, UN chief Antonio Guterres said Wednesday, warning that in conflicts such as Russia's invasion of Ukraine the situation is actually \"going backwards.\"", "url": "https://www.ndtv.com/world-news/stop-excluding-women-from-peace-talks-in-global-conflicts-un-chief-3071208", "urlToImage": "https://c.ndtvimg.com/2022-05/bbkdiah4_antonio-guterres_625x300_18_May_22.jpg", "publishedAt": "2022-06-15T20:59:40Z", "content": "The rights and freedoms of wome deliberately targeted, said UN chief Antonio Guterres\r\nUnited Nations: Men must stop excluding women from peace talks around the world, UN chief Antonio Guterres said … [+1846 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ranchi Violence: Explanation Sought From Top Cop Over Posters Of Accused", "description": "A day after Jharkhand police put up posters carrying photographs of those allegedly involved in the recent violent protests in Ranchi, the state's Home Secretary Rajiv Arun Ekka sought an explanation from the SSP over the  \"unlawful\" act.", "url": "https://www.ndtv.com/india-news/jharkhand-10-june-violence-explanation-sought-from-ranchi-top-cop-over-posters-of-violence-accused-3071203", "urlToImage": "https://c.ndtvimg.com/2022-06/ephogogg_ranchi-violence_625x300_11_June_22.jpg", "publishedAt": "2022-06-15T20:49:37Z", "content": "Ranchi Violence: Police said that 29 people have been arrested so far in connection with the incident.\r\nRanchi, Jharkhand: A day after Jharkhand police put up posters carrying photographs of those al… [+2064 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"On Wrong Side Of History\": US Slams China For Backing Russia On Ukraine", "description": "The United States expressed concern Wednesday about China's alignment with Russia, warning that nations which side with President Vladimir Putin on Ukraine will be \"on the wrong side of history.\"", "url": "https://www.ndtv.com/world-news/us-warns-china-against-being-on-wrong-side-of-history-on-ukraine-3071176", "urlToImage": "https://c.ndtvimg.com/2022-02/ep90im0k_putin-xi-jinping_625x300_04_February_22.jpg", "publishedAt": "2022-06-15T20:29:41Z", "content": "Ukraine War: China has refused to condemn Russia's invasion of Ukraine.\r\nWashington: The United States expressed concern Wednesday about China's alignment with Russia, warning that nations which side… [+1590 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Expresses \"Serious Concern\" Over Israeli Strikes In Syria", "description": "Russia expressed \"serious concern\" on Wednesday to Israel's ambassador about air strikes that shut down Syria's Damascus International Airport last week, the foreign ministry said in a statement.", "url": "https://www.ndtv.com/world-news/russia-expresses-serious-concern-over-israeli-strikes-in-syria-3071164", "urlToImage": "https://i.ndtvimg.com/i/2018-04/syria-air-strikes-afp_650x400_51523674090.jpg", "publishedAt": "2022-06-15T20:03:00Z", "content": "For several years, Israel has been attacking what it has described as Iranian-linked targets in Syria.\r\nMoscow: Russia expressed \"serious concern\" on Wednesday to Israel's ambassador about air strike… [+1617 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Biden's Top Medical Advisor Dr Anthony Fauci Tests Positive For COVID-19", "description": "Top scientist Anthony Fauci, the face of America's response to the Covid-19 pandemic, tested positive Wednesday for the virus on a rapid antigen test, the National Institutes of Health said.", "url": "https://www.ndtv.com/world-news/us-top-coronavirus-advisor-dr-anthony-fauci-tests-positive-for-covid-19-3071127", "urlToImage": "https://c.ndtvimg.com/2021-06/puntic2_anthony-fauci-reuters_625x300_22_June_21.jpg", "publishedAt": "2022-06-15T19:19:38Z", "content": "Anthony Fauci, Joe Biden's top medical advisor, said that he is currently experiencing mild symptoms.\r\nWashington: Top scientist Anthony Fauci, the face of America's response to the Covid-19 pandemic… [+452 chars]"}]}