{"status": "ok", "totalResults": 437, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Government Dismisses Reports On LIC IPO Data Claiming Massive Covid Deaths In 2021", "description": "The government Saturday dismissed as \"speculative\" media reports related to LIC IPO data claiming that Covid-related deaths in 2021 could be much higher than those recorded officially.", "url": "https://www.ndtv.com/india-news/government-dismisses-reports-on-lic-ipo-data-claiming-massive-covid-deaths-in-2021-2778333", "urlToImage": "https://c.ndtvimg.com/2022-02/375b6n3o_lic-fresh_625x300_18_February_22.jpg", "publishedAt": "2022-02-20T01:22:22Z", "content": "New Delhi: The government Saturday dismissed as \"speculative\" media reports related to LIC IPO data claiming that Covid-related deaths in 2021 could be much higher than those recorded officially.\r\nTh… [+3071 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Elections Live Updates: Punjab, 59 Constituencies In UP To Vote Today", "description": "Punjab and 59 constituencies across 16 districts of Uttar Pradesh (Phase 3 for UP) will go to polls today. Polling in Punjab will be held from 8 am to 6 pm. In UP, it will be from 7 am and 6 pm.", "url": "https://www.ndtv.com/india-news/assembly-elections-2022-live-updates-punjab-59-constituencies-in-up-to-vote-today-2778325", "urlToImage": "https://c.ndtvimg.com/2022-02/s8v6ikmg_election-2022-election-generic-evm-generic-ani-650_625x300_20_February_22.jpg", "publishedAt": "2022-02-20T00:55:29Z", "content": "Assembly elections 2022: Counting of votes in both the states will take place on March 10. (File)\r\nPunjab and 59 constituencies across 16 districts of Uttar Pradesh (Phase 3 for UP) will go to polls … [+2035 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE Updates: 22,270 New Covid Cases In India, 635 In Delhi", "description": "India recorded 22,270 new COVID-19 cases and 325 related deaths yesterday, with the virus-related death count rising to 5,11,230 across the country.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-19-february-2022-2778316", "urlToImage": "https://c.ndtvimg.com/2021-12/h3rhcsek_covid-india-pti_625x300_05_December_21.jpg", "publishedAt": "2022-02-19T23:57:17Z", "content": "Covid-19 Cases in India: 175.33 crore vaccine doses have been administered. (File)\r\nNew Delhi: India recorded 22,270 new COVID-19 cases and 325 related deaths yesterday, with the virus-related death … [+1006 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Putin Oversees Nuclear Drills; US Says Russia 'Poised To Strike' Ukraine", "description": "Russia's strategic nuclear forces held exercises overseen by President Vladimir Putin on Saturday, and Washington accused Russian troops massed near Ukraine's border of advancing and being \"poised to strike\".", "url": "https://www.ndtv.com/world-news/as-vladimir-putin-oversees-nuclear-drills-us-says-russia-poised-to-strike-ukraine-2778321", "urlToImage": "https://c.ndtvimg.com/2022-02/avbjt94o_russia-drill-reuters-650_625x300_20_February_22.jpg", "publishedAt": "2022-02-19T23:53:40Z", "content": "Kremlin said Russia has test-launched hypersonic and cruise missiles at sea during the nuclear drills.\r\nDonetsk/Moscow: Russia's strategic nuclear forces held exercises overseen by President Vladimir… [+6477 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Could Launch An Attack Against Ukraine Any Time: White House", "description": "The White House on Saturday said that Russia could launch an attack against Ukraine at any time and said USPresident Joe Biden will convene a National Security Council meeting on Sunday to discuss the situation.", "url": "https://www.ndtv.com/world-news/russia-could-launch-an-attack-against-ukraine-any-time-white-house-2778314", "urlToImage": "https://c.ndtvimg.com/2022-02/l18k5sf8_ukraine-army-reuters-650_625x300_20_February_22.jpg", "publishedAt": "2022-02-19T23:40:35Z", "content": "US accused Russian troops of advancing towards Ukraine and being \"poised to strike.\" (Representational)\r\nWashington: The White House on Saturday said that Russia could launch an attack against Ukrain… [+453 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Britain To Set Out Plans To Scrap Covid Self-Isolation Rules", "description": "British Prime Minister Boris Johnson intends to set out plans next week to remove self-isolation requirements for people infected with COVID-19, his office said on Saturday.", "url": "https://www.ndtv.com/world-news/britain-to-set-out-plans-to-scrap-covid-self-isolation-rules-2778308", "urlToImage": "https://c.ndtvimg.com/2022-02/crivfudo_uk-covid-reuters-650_625x300_20_February_22.jpg", "publishedAt": "2022-02-19T23:01:22Z", "content": "UK: COVID-19 restrictions are unpopular with many members of Johnson's Conservative Party. (File)\r\nLondon: British Prime Minister Boris Johnson intends to set out plans next week to remove self-isola… [+2080 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Telangana's KCR To Meet Uddhav Thackeray In Mumbai Today", "description": "Days after giving a call to Opposition parties to unite against the BJP, Telangana Chief Minister K Chandrashekar Rao will visit Mumbai on Sunday where he is scheduled to meet his Maharashtra counterpart Uddhav Thackeray.", "url": "https://www.ndtv.com/india-news/telanganas-k-chandrashekhar-rao-to-meet-uddhav-thackeray-in-mumbai-today-2778302", "urlToImage": "https://c.ndtvimg.com/2021-10/t55b21a8_kcr-antidrugs-meet_625x300_20_October_21.jpg", "publishedAt": "2022-02-19T22:46:24Z", "content": "KCR will leave for Mumbai on Sunday morning and will return to Hyderabad by evening. (File)\r\nHyderabad: Days after giving a call to Opposition parties to unite against the BJP, Telangana Chief Minist… [+1204 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Canada's Show Of Force As Police Clear Anti-Vaccine Protests' Main Hub", "description": "Police in riot gear cleared the main protest hub in downtown Ottawa Saturday, using batons and pepper spray and making dozens of arrests, as they worked to flush out a hard core of demonstrators occupying the Canadian capital.", "url": "https://www.ndtv.com/world-news/canadas-show-of-force-as-police-clear-anti-vaccine-protests-main-hub-2778306", "urlToImage": "https://c.ndtvimg.com/2022-02/jjpack_canada-protest-afp-650_625x300_20_February_22.jpg", "publishedAt": "2022-02-19T22:30:04Z", "content": "Canada protest: The Ottawa police operation was the largest ever seen in the capital.\r\nOttawa: Police in riot gear cleared the main protest hub in downtown Ottawa Saturday, using batons and pepper sp… [+4549 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Security Body Reports Over 1,500 Ceasefire Violations In East Ukraine", "description": "Observers from the OSCE European security body on Saturday reported more than 1,500 ceasefire violations in east Ukraine in a single day, the highest number this year.", "url": "https://www.ndtv.com/world-news/european-security-body-reports-1-500-ceasefire-violations-in-east-ukraine-2778301", "urlToImage": "https://c.ndtvimg.com/2022-02/g40iedt_ukraine-army_120x90_20_February_22.jpg?im=FaceCrop,algorithm=dnn,width=620,height=350", "publishedAt": "2022-02-19T22:20:59Z", "content": "Russia-Ukraine: The shelling in the eight-year conflict spiked sharply this week. (Representational)\r\nKyiv: Observers from the OSCE European security body on Saturday reported more than 1,500 ceasefi… [+977 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Brazil Floods Death Count Rises To 139 With More Bodies Retrieved", "description": "Rescue workers pulled more bodies Saturday from the muddy wreckage left by devastating floods and landslides in the Brazilian city of Petropolis, where the death count rose to 139, including 26 children.", "url": "https://www.ndtv.com/world-news/brazil-floods-death-count-rises-to-139-with-more-bodies-retrieved-2778299", "urlToImage": "https://c.ndtvimg.com/2022-02/m703qf5o_brazil-flood-afp-240_120x90_20_February_22.jpg?im=FaceCrop,algorithm=dnn,width=620,height=350", "publishedAt": "2022-02-19T22:00:40Z", "content": "Brazil flood: 91 of the 139 bodies recovered so far have been identified.\r\nPetropolis: Rescue workers pulled more bodies Saturday from the muddy wreckage left by devastating floods and landslides in … [+3676 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "All Signs Suggest Russia Planning Full-Fledged Ukraine Attack: NATO Chief", "description": "The signals coming out of Russia suggest that Moscow is readying for a \"full-fledged attack\" on Ukraine, NATO chief Jens Stoltenberg said Saturday, echoing US warnings of an imminent invasion.", "url": "https://www.ndtv.com/world-news/all-signs-suggest-russia-planning-full-fledged-attack-on-ukraine-nato-chief-jens-stoltenberg-2778298", "urlToImage": "https://c.ndtvimg.com/2022-01/6bm9qbeo_russia-army-reuters_625x300_25_January_22.jpg", "publishedAt": "2022-02-19T21:50:43Z", "content": "Ukraine-Russia: We agree the risk of an attack is very high, said the NATO chief. (Representational)\r\nMunich: The signals coming out of Russia suggest that Moscow is readying for a \"full-fledged atta… [+457 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Congress Has Lost Morality To Be In Opposition: Karnataka Chief Minister", "description": "As Congress MLAs continue their protest in Karnataka Assembly demanding minister KS Eshwarappa's resignation over his saffron flag remark, Chief Minister Basavaj Bommai said Congress has lost the morality to be the Opposition party.", "url": "https://www.ndtv.com/karnataka-news/karnataka-protests-congress-has-lost-morality-to-be-in-opposition-karnataka-chief-minister-basavaraj-bommai-2778247", "urlToImage": "https://c.ndtvimg.com/2021-09/mbojk3gc_basavaraj-bommai_625x300_15_September_21.jpg", "publishedAt": "2022-02-19T21:40:10Z", "content": "Basavaraj Bommai said the Congress was misleading the assembly and people. (File)\r\nBengaluru: As Congress MLAs continue their protest in Karnataka Assembly demanding minister KS Eshwarappa's resignat… [+1103 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Multiple Loud Blasts Heard In Centre Of Rebel-Held Ukraine City: Report", "description": "Multiple explosions could be heard late on Saturday and early on Sunday in the centre of the separatist-controlled city of Donetsk in eastern Ukraine, a Reuters reporter said.", "url": "https://www.ndtv.com/world-news/multiple-loud-explosions-heard-in-centre-of-rebel-held-city-in-ukraine-report-2778291", "urlToImage": "https://c.ndtvimg.com/2022-02/1vj4pfa8_ukraine-generic-soldiers-ukraine-army-reuters-240_120x90_20_February_22.jpg?im=FaceCrop,algorithm=dnn,width=620,height=350", "publishedAt": "2022-02-19T21:23:49Z", "content": "Ukraine: The origin of the explosions was not clear. (Representational)\r\nDonetsk, Ukraine: Multiple explosions could be heard late on Saturday and early on Sunday in the centre of the separatist-cont… [+298 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Canada Police Move To Clear Last Anti-Vax Protesters, Over 100 Arrested", "description": "Police in Canada moved Friday to dislodge the final truckers and protesters from downtown Ottawa, in a mostly peaceful operation aimed at bringing an end to three weeks of demonstrations over Covid-19 health rules.", "url": "https://www.ndtv.com/world-news/canada-police-move-to-clear-last-anti-vax-protesters-over-100-arrested-2778287", "urlToImage": "https://c.ndtvimg.com/2022-02/ga5pbnv8_canada-covid-protest-afp_120x90_20_February_22.jpg?im=FaceCrop,algorithm=dnn,width=620,height=350", "publishedAt": "2022-02-19T21:09:44Z", "content": "Canada Covid protest: Police said the operation was going as planned but would take time.\r\nOttawa: Police in Canada moved Friday to dislodge the final truckers and protesters from downtown Ottawa, in… [+4736 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Such Convicts Are Like Man-Eater Leopard: Court In Ahmedabad Blasts Case", "description": "The 38 convicts in the 2008 Ahmedabad serial blasts case deserve death sentence as allowing them to remain in society is akin to releasing a \"man-eater leopard\" in public, the special court said in its order.", "url": "https://www.ndtv.com/india-news/such-convicts-are-like-man-eater-leopard-court-on-ahmedabad-blast-case-2778201", "urlToImage": "https://c.ndtvimg.com/2019-07/att9hsso_court-generic_625x300_27_July_19.jpg", "publishedAt": "2022-02-19T20:54:47Z", "content": "2008 Ahmedabad blasts: The convicts created unrest in peaceful society, said the court (Representational)\r\nAhmedabad: The 38 convicts in the 2008 Ahmedabad serial blasts case deserve the death senten… [+4082 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rajasthan Journalist Arrested In Teachers' Exam Paper Leak Case: Police", "description": "A news channel reporter was arrested on Saturday in connection with the Rajasthan Eligibility Examination for Teachers-2021 (REET) paper leak case, police said.", "url": "https://www.ndtv.com/india-news/rajasthan-journalist-arrested-in-teachers-exam-paper-leak-cases-police-2778198", "urlToImage": "https://i.ndtvimg.com/i/2016-04/arrest-generic-istock_650x400_71461678057.jpg", "publishedAt": "2022-02-19T20:31:35Z", "content": "REET paper leak: So far, 40 people have been arrested in this connection. (Representational)\r\nJaipur: A news channel reporter was arrested on Saturday in connection with the Rajasthan Eligibility Exa… [+726 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "India-China Ties Going Through Very Difficult Phase: S Jaishankar", "description": "India's relations with China is going through a \"very difficult phase\" after China violated border agreements, Foreign Minister S Jaishankar said on Saturday, underlining that the \"state of the border will determine the state of the relationship\".", "url": "https://www.ndtv.com/india-news/india-china-ties-going-through-very-difficult-phase-s-jaishankar-2778194", "urlToImage": "https://c.ndtvimg.com/2022-02/mk6p6m38_s-jaishankar-650_625x300_12_February_22.jpg", "publishedAt": "2022-02-19T20:21:41Z", "content": "India-China ties: S Jaishankar said the state of border will determine the state of relationship (File)\r\nMunich: India's relations with China right now was going through a \"very difficult phase\" afte… [+4308 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "At UP Election Rally, Amit Shah's Dig At Nehru Over Long-Pending Projects", "description": "Union Home Minister Amit Shah on Saturday said the agenda of the BJP is to make Uttar Pradesh a \"proud state once again\".", "url": "https://www.ndtv.com/india-news/up-polls-at-up-election-rally-amit-shahs-dig-at-nehru-over-long-pending-projects-2778190", "urlToImage": "https://c.ndtvimg.com/2022-02/lg40f658_amit-shah_625x300_17_February_22.jpg", "publishedAt": "2022-02-19T20:08:15Z", "content": "UP Polls: BJP's agenda is to make UP a \"proud state once again\", said Amit Shah. (File)\r\nLucknow: Union Home Minister Amit Shah on Saturday said the agenda of the BJP is to make Uttar Pradesh a \"prou… [+2384 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Hospital Crisis In Hong Kong Amid Worst-Ever Covid Outbreak", "description": "Hong Kong is in the throes of its worst-ever coronavirus outbreak, as residents are suddenly confronted with a severely overstretched healthcare system and a tightening of restrictions even as much of the world opens up.", "url": "https://www.ndtv.com/world-news/hospital-crisis-in-hong-kong-amid-worst-ever-covid-outbreak-2778243", "urlToImage": "https://c.ndtvimg.com/2022-02/c00qe7e8_hong-kong_120x90_20_February_22.jpg?im=FaceCrop,algorithm=dnn,width=620,height=350", "publishedAt": "2022-02-19T19:52:51Z", "content": "COVID-19: Hong Kong has long adhered to the mainland's \"zero-Covid\" policy.\r\nHong Kong: Hong Kong is in the throes of its worst-ever coronavirus outbreak, as residents are suddenly confronted with a … [+5102 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Drugs Worth Rs 9.82 Crore Seized At Bengaluru Airport; 3 Arrested", "description": "The Customs and Intelligence units of the Bengaluru International Airport on Saturday said they have seized drugs worth Rs 9.82 crore and arrested three people, including a Nigerian.", "url": "https://www.ndtv.com/bangalore-news/bengaluru-drugs-haul-drugs-worth-rs-9-82-crore-seized-at-bengaluru-airport-3-arrested-2778020", "urlToImage": "https://c.ndtvimg.com/2019-05/mvt4e0f4_drugs-generic_625x300_02_May_19.jpg", "publishedAt": "2022-02-19T19:35:13Z", "content": "Bengaluru: The drugs had arrived from Zambia and Belgium, said officials. (Representational)\r\nBengaluru: The Customs and Intelligence units of the Bengaluru International Airport on Saturday said the… [+842 chars]"}]}