{"status": "ok", "totalResults": 286, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE: India Records Over 3,000 New Covid Cases In 24 Hours", "description": "India on Monday reported at least 3,207 new coronavirus infections, taking the total tally of COVID-19 cases to 4,31,05,401, while the active cases dipped to 20,403, according to the Union Health Ministry data updated.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-india-covid-cases-may-10-2961210", "urlToImage": "https://c.ndtvimg.com/2021-12/91fs4qmg_coronavirus-india-afp-december_650x400_08_December_21.jpg", "publishedAt": "2022-05-10T00:34:12Z", "content": "India COVID-19 Live: India reported 29 Covid-related deaths on Monday.\r\nNew Delhi: India on Monday reported at least 3,207 new coronavirus infections, taking the total tally of COVID-19 cases to 4,31… [+558 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Cashier Attacked, Looted Of Rs 10 Lakh In Chhattisgarh: Official", "description": "Three unidentified men attacked a cashier working with a property dealer and looted Rs 10 lakh from him in Chhattisgarh's capital Raipur on Monday, police said.", "url": "https://www.ndtv.com/india-news/cashier-attacked-looted-of-rs-10-lakh-in-chhattisgarhs-raipur-official-2961205", "urlToImage": "https://c.ndtvimg.com/144povgk_police-istock_625x300_15_August_18.jpg", "publishedAt": "2022-05-10T00:19:41Z", "content": "Raipur robbery: The police have launched a manhunt for the robbers. (Representational)\r\nRaipur: Three unidentified men attacked a cashier working with a property dealer and looted Rs 10 lakh from him… [+649 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Student, 13, Found Hanging In School In UP: Police", "description": "The body of a Class 8 student was found hanging under suspicious circumstances behind his school in Uttar Pradesh's Jaunpur district on Monday, police said.", "url": "https://www.ndtv.com/india-news/student-13-found-hanging-in-school-in-ups-jaunpur-police-2961204", "urlToImage": "https://i.ndtvimg.com/i/2017-03/police-generic_650x400_71490246814.jpg", "publishedAt": "2022-05-10T00:04:25Z", "content": "It was not known when he came to the school and took the extreme step, principal said. (Representational)\r\nJaunpur, UP: The body of a Class 8 student was found hanging under suspicious circumstances … [+957 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Delhi Man Arrested In Rs 1,146 Crore Money Laundering Case: Probe Agency", "description": "Enforcement Directorate (ED) has arrested Delhi-based Deepak Nayyar in a case linked to the alleged laundering of funds worth Rs 1,146 crore by forging Air Way Bills of reputed companies in the guise of freight forwarding services on May 5.", "url": "https://www.ndtv.com/india-news/delhi-man-deepak-nayyar-arrested-in-rs-1-146-crore-money-laundering-case-enforcement-directorate-2961202", "urlToImage": "https://c.ndtvimg.com/enforcement-directorate_625x300_1526972931080.jpg", "publishedAt": "2022-05-09T23:53:10Z", "content": "Mr Nayyar has been remanded to ED Custody from May 6 to May 20. (Representational)\r\nEnforcement Directorate (ED) has arrested Delhi-based Deepak Nayyar in a case linked to the alleged laundering of f… [+2161 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "France's Macron Says He Knows Name Of His Country's Next Prime Minister", "description": "Emmanuel Macron, who was just re-elected French president, said on Monday he knew the name of the country's next prime minister, due to succeed Jean Castex.", "url": "https://www.ndtv.com/world-news/frances-macron-says-he-knows-name-of-his-countrys-next-prime-minister-2961196", "urlToImage": "https://c.ndtvimg.com/2021-09/3g913r18_macron_625x300_20_September_21.jpg", "publishedAt": "2022-05-09T23:41:01Z", "content": "Emmanuel Macron on Tuesday was in Berlin attended press conference with German Chancellor Scholz. (File)\r\nBerlin: Emmanuel Macron, who was just re-elected French president, said on Monday he knew the… [+622 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Culprits Of Bihar Civil Services Exam Paper Leak To Be Punished: Nitish Kumar", "description": "Bihar Chief Minister Nitish Kumar on Monday said that strict action will be taken against the perpetrators of Bihar Public Service Commission (BPSC) Preliminary exam paper leak.", "url": "https://www.ndtv.com/india-news/bihar-civil-services-exam-paper-leak-chief-minister-nitish-kumar-says-culprits-wont-be-spared-2961187", "urlToImage": "https://c.ndtvimg.com/2022-04/clf0oi68_nitish-kumar_625x300_18_April_22.jpg", "publishedAt": "2022-05-09T23:23:23Z", "content": "BPSC paper leak: Over 6 lakh candidates were to sit for the exam on Sunday.\r\nPatna: Bihar Chief Minister Nitish Kumar on Monday said that strict action will be taken against the perpetrators of Bihar… [+1160 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Will Increase Pressure On Taliban To Protect Afghan Women's Rights: US", "description": "The United States will take steps to increase pressure on Afghanistan's Taliban government to reverse some of its recent decisions restricting the rights of women and girls if the hardline group shows no sign of rescinding the actions on its own.", "url": "https://www.ndtv.com/world-news/will-increase-pressure-on-taliban-to-protect-afghan-womens-rights-us-after-new-hijab-rule-in-afghanistan-2961178", "urlToImage": "https://c.ndtvimg.com/2021-09/ev8j2gb_afghan-womenheratreuters_625x300_12_September_21.jpg", "publishedAt": "2022-05-09T22:58:16Z", "content": "Afghanistan Hijab Rule: Taliban has restricted women from working, including limited their travel.\r\nWashington: The United States will take steps to increase pressure on Afghanistan's Taliban governm… [+2559 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Biden Signs Bill To Speed US Weapons Deliveries To Ukraine Against Russia", "description": "President Joe Biden on Monday resurrected a World War II measure used to boost US allies fighting Nazi Germany, allowing the government to accelerate weapons shipments to Ukraine for its battle against Russia's invasion.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-us-president-joe-biden-signs-lend-lease-act-to-speed-weapons-deliveries-to-ukraine-against-russia-2961169", "urlToImage": "https://c.ndtvimg.com/2022-02/jf0i0mi4_joe-biden_625x300_25_February_22.jpg", "publishedAt": "2022-05-09T22:33:36Z", "content": "Washington: President Joe Biden on Monday resurrected a World War II measure used to boost US allies fighting Nazi Germany, allowing the government to accelerate weapons shipments to Ukraine for its … [+2718 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"To Keep Women Out Of Work\": Malala Yousafzai On Taliban's New Hijab Rule", "description": "Nobel Prize laureate Malala Yousafzai has expressed fear for women and girls in Afghanistan after the Taliban issued a decree making the hijab compulsory for women in Afghanistan.", "url": "https://www.ndtv.com/world-news/malala-yousafzai-expresses-fear-on-talibans-hijab-rule-in-afghanistan-2961163", "urlToImage": "https://c.ndtvimg.com/2021-09/tiecl8e_malala-yousafzai_625x300_24_September_21.jpg", "publishedAt": "2022-05-09T22:16:23Z", "content": "Malala Yousafzai urged world leaders to take action against Taliban for forcing women to wear veil.\r\nNew Delhi: Nobel Prize laureate Malala Yousafzai has expressed fear for women and girls in Afghani… [+2114 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Pulitzer Board Honours Ukrainian Journalists Covering Russia's Invasion", "description": "The Pulitzer Prize Board honored Ukrainian journalists on Monday for their \"courage, endurance and commitment to truthful\" coverage of Russia's invasion of their country.", "url": "https://www.ndtv.com/world-news/pulitzer-board-honours-ukrainian-journalists-covering-russias-invasion-2961148", "urlToImage": "https://c.ndtvimg.com/2022-03/ghc4vk08_ukraine-war-afp_625x300_20_March_22.jpg", "publishedAt": "2022-05-09T21:18:41Z", "content": "At least 7 journalists, including 3 from Ukraine, have been killed since Russia launched war on Feb 24.\r\nNew York: The Pulitzer Prize Board honored Ukrainian journalists on Monday for their \"courage,… [+2359 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "France, Germany Assure \"Full Support\" To Ukraine Amid Rising Tensions", "description": "French President Emmanuel Macron and German Chancellor Olaf Scholz showed Ukraine their \"full support\" on Monday as they visited Berlin's symbolically important Brandenburg Gate, illuminated in Ukraine's national colours, AFP saw.", "url": "https://www.ndtv.com/world-news/france-germany-assure-full-support-to-ukraine-amid-rising-tensions-2961140", "urlToImage": "https://c.ndtvimg.com/2022-03/48be8em_ukraine-capital-kyiv-afp_625x300_03_March_22.jpg", "publishedAt": "2022-05-09T20:58:38Z", "content": "German Chancellor in particular has come under fire for arms deliveries to Ukraine deemed insufficient.\r\nBerlin: French President Emmanuel Macron and German Chancellor Olaf Scholz showed Ukraine thei… [+1462 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Says Moscow Is \"Forcibly\" Taking Ukrainians To Russia", "description": "The Pentagon has seen indications that Ukrainians caught up in Russia's invasion are being forcibly removed from their homeland and sent to Russia, a senior US defense official said Monday.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-us-says-moscow-is-forcibly-taking-ukrainians-to-russia-2961129", "urlToImage": "https://c.ndtvimg.com/2022-04/1mnsct3s_-russia-ukraine-war_625x300_12_April_22.jpg", "publishedAt": "2022-05-09T20:42:25Z", "content": "Russia-Ukraine war: Pentagon said that Ukrainians being taken \"against their will\" into Russia amid war.\r\nWashington: The Pentagon said Monday it has seen indications that Ukrainians caught up in Rus… [+1604 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Covid Positive Accident Victim Taken In By Delhi Hospital On Day 3, Saved", "description": "A 19-year-old Covid patient, who was severely injured in a bike-bus collision, was saved from having his hand amputated after doctors at a city hospital here performed a high-risk surgery two days later.", "url": "https://www.ndtv.com/india-news/covid-positive-accident-victim-taken-in-by-delhi-hospital-on-day-3-saved-2961088", "urlToImage": "https://i.ndtvimg.com/i/2015-03/ambulance-generic_650x400_51425838004.jpg", "publishedAt": "2022-05-09T19:53:53Z", "content": "Earlier, no hospitals were willing to operate him as he tested coronavirus positive. (Representational)\r\nNew Delhi: A 19-year-old Covid patient, who was severely injured in a bike-bus collision, was … [+3433 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sri Lanka's Day Of Deadly Violence: Here's All You Need To Know", "description": "At least five people were killed and almost 200 wounded in Sri Lanka on Monday in a wave of violence between government supporters and demonstrators demanding President Gotabaya Rajapaksa's resignation.", "url": "https://www.ndtv.com/world-news/sri-lankas-day-of-deadly-violence-heres-all-you-need-to-know-2961079", "urlToImage": "https://c.ndtvimg.com/2022-05/ii8ov2c4_sri-lanka-protest-afp_625x300_09_May_22.jpg", "publishedAt": "2022-05-09T19:35:15Z", "content": "Sri Lanka Economic Crisis: A political office of the Rajapaksas was also destroyed in an arson attack.\r\nColombo: At least five people were killed and almost 200 wounded in Sri Lanka on Monday in a wa… [+4287 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Patently Absurd\": US Slams Putin's Victory Day Speech On Ukraine", "description": "The United States said Monday that President Vladimir Putin was \"absurd\" and insulting history by casting Russia's invasion of Ukraine as a defensive operation on the anniversary of victory over Nazi Germany.", "url": "https://www.ndtv.com/world-news/patently-absurd-us-slams-russian-president-vladimir-putins-victory-day-speech-on-ukraine-2961046", "urlToImage": "https://c.ndtvimg.com/2022-05/4d67mv3k_putin-victory-day-_625x300_09_May_22.jpg", "publishedAt": "2022-05-09T19:06:21Z", "content": "Russia-Ukraine war: \"To call Ukraine war a defensive action is patently absurd,\" US said.\r\nWashington: The United States said Monday that President Vladimir Putin was \"absurd\" and insulting history b… [+449 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Winning start for Lovlina Borgohain At Women's World Boxing Championships", "description": "Returning to competitive boxing for the first time since her podium finish at the Tokyo Games last year, Lovlina (70kg) won by a 3-2 split decision against the Chinese Taipei boxer", "url": "https://sports.ndtv.com/othersports/winning-start-for-lovlina-borgohain-at-womens-world-boxing-championships-beats-chen-by-split-decision-2961005", "urlToImage": "https://c.ndtvimg.com/2021-08/lbeg6bj_lovlina-borgohain-afp_650x400_04_August_21.jpg", "publishedAt": "2022-05-09T18:33:41Z", "content": "Tokyo Olympics bronze medallist Lovlina Borgohain upstaged former champion Chen Nien-Chin in the light middleweight division on Monday to enter the round of 16 at the IBA Women's World Boxing Champio… [+1551 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Supreme Court Stays Proceedings Before High Courts On IT Rules", "description": "The Supreme Court Monday stayed further proceedings before the high courts in matters involving challenges to the Information Technology (Intermediary Guidelines and Digital Media Ethics Code) Rules 2021", "url": "https://www.ndtv.com/india-news/supreme-court-stays-proceedings-before-high-courts-in-matters-challenging-it-rules-2960964", "urlToImage": "https://c.ndtvimg.com/2020-03/voni7s98_supreme-court-new_650x400_12_March_20.jpg", "publishedAt": "2022-05-09T18:21:44Z", "content": "The bench also issued notices on the petitions before it in which notices were not yet issued.\r\nNew Delhi: The Supreme Court Monday stayed further proceedings before the high courts in matters involv… [+3052 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Baris Restaurant, Delhi Offers Unique Mediterranean Experience Like No Other", "description": "I recently tried Baris restaurant that specialises in Eastern Mediterranean & Middle Eastern cuisines.", "url": "https://food.ndtv.com/reviews/baris-restaurant-delhi-offers-unique-mediterranean-experience-like-no-other-2960963", "urlToImage": "https://c.ndtvimg.com/2022-05/0ri4b6rg_baris-restaurant_625x300_09_May_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-09T18:21:42Z", "content": "When everyday homemade food gets a bit too mundane, our taste buds start hankering for something different. But sadly, now even Italian and Chinese foods have become repetitive. There are times when … [+2586 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Despite Bumrah's heroics, KKR defeat MI By 52 Runs To Stay In The Hunt", "description": "Jasprit Bumrah finally rose to the occasion with a five-wicket haul to restrict KKR to 165 for nine. But MI were all out for 113", "url": "https://sports.ndtv.com/ipl-2022/mi-vs-kkr-indian-premier-league-2022-despite-jasprit-bumrahs-heroics-kolkata-knight-riders-defeat-mumbai-indians-by-massive-52-runs-to-stay-in-the-hun-2960959", "urlToImage": "https://c.ndtvimg.com/2022-05/vsjhgsuo_kkr-mi-bcciipl_625x300_09_May_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-09T18:19:24Z", "content": "Kolkata Knight Riders finally found the team balance they were looking for to outclass Mumbai Indians by 52 runs in Mavi Mumbai on Monday and keep their slim IPL play-off hopes alive. Lead Mumbai Ind… [+2925 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Digital Census For India by 2024: Amit Shah", "description": "The upcoming census would be digitized and completed by 2024, said Home Minister Amit Shah in Assam on Monday.", "url": "https://www.ndtv.com/india-news/digital-census-for-india-by-2024-amit-shah-2960956", "urlToImage": "https://c.ndtvimg.com/2022-05/122blrpg_amit-shah-in-assam_625x300_09_May_22.jpg", "publishedAt": "2022-05-09T18:18:28Z", "content": "Amit Shah said census was especially crucial in a population sensitive state like Assam.\r\nGuwahati: The upcoming census would be digitized and completed by 2024, said Home Minister Amit Shah in Assam… [+2442 chars]"}]}