{"status": "ok", "totalResults": 369, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Voters Don't Run After Money\": Manipur's Youngest Leader With No Assets", "description": "On a door-to-door campaign is Ningthoujam Popilal Singh, 26, the youngest candidatecontesting the Manipur assembly election in Sekmai constituency - the only Scheduled Caste reserved seat in Manipur.", "url": "https://www.ndtv.com/india-news/voters-dont-run-after-money-manipurs-youngest-leader-ningthoujam-popilal-singh-with-no-assets-2779519", "urlToImage": "https://c.ndtvimg.com/2022-02/a3ojush_ningthoujam-popilal-singh_625x300_20_February_22.jpg", "publishedAt": "2022-02-21T00:46:10Z", "content": "Ningthoujam Popilal Singh, 26, is the youngest candidates in Manipur election.\r\nGuwahati: On a door-to-door campaign is Ningthoujam Popilal Singh, 26, the youngest candidate contesting the Manipur as… [+1422 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Video: Student Trapped In Karnataka's Nandi Hills Rescued By Air Force", "description": "Indian Air Force and Chikkaballapur Police rescued a 19-year-old student who fell 300 feet from a steep cliff onto a rocky ledge in Nandi Hills in Karnataka on Sunday evening.", "url": "https://www.ndtv.com/karnataka-news/watch-student-trapped-in-karnatakas-nandi-hills-rescued-by-air-force-2779586", "urlToImage": "https://c.ndtvimg.com/2022-02/nkdmatog_nandi-hills-rescue-650_625x300_21_February_22.jpg", "publishedAt": "2022-02-21T00:37:03Z", "content": "Nandi Hills, Karnataka: The Air Force used a Mi17 helicopter to rescue the student.\r\nNandi Hills (Karnataka): Indian Air Force and Chikkaballapur Police rescued a 19-year-old student who fell 300 fee… [+1769 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Joe Biden, France's Macron Speak As Ukraine Fears Russia Invasion", "description": "U.S. President Joe Biden spoke with French President Emmanuel Macron on Sunday, the White House said, amid Western fears Russia is planning to invade Ukraine, which Moscow denies. Earlier,", "url": "https://www.ndtv.com/world-news/biden-spoke-with-frances-macron-on-sunday-white-house-2779581", "urlToImage": "https://c.ndtvimg.com/2021-10/h8hfa1os_-biden-macron_625x300_06_October_21.jpg", "publishedAt": "2022-02-21T00:23:55Z", "content": "The Biden-Macron talk comes as West fears Russia is planning to invade Ukraine. (File)\r\nUS President Joe Biden spoke with French President Emmanuel Macron on Sunday, the White House said, amid Wester… [+309 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Putin, France's Macron Talk For Second Time In A Day Amid Ukraine Crisis", "description": "French President Emmanuel Macron and Russian counterpart Vladimir Putin spoke for an hour late on Sunday evening in their second conversation of the day, the French presidency said.", "url": "https://www.ndtv.com/world-news/russia-ukraine-crisis-putin-frances-macron-talk-for-second-time-in-a-day-amid-ukraine-crisis-2779614", "urlToImage": "https://i.ndtvimg.com/i/2017-05/macron-putin-reuters_650x400_81496121260.jpg", "publishedAt": "2022-02-21T00:15:05Z", "content": "Russia-Ukraine Crisis: Macron and Putin spoke for an hour during their second conversation. (File)\r\nParis: French President Emmanuel Macron and Russian counterpart Vladimir Putin spoke for an hour la… [+391 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE Updates: India Reported 19,968 New Covid Cases On Sunday", "description": "India reported 19,968 new COVID-19 cases and 673 related deaths yesterday, with the virus-related death count rising to 5,11,903 across the country.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-2779612", "urlToImage": "https://c.ndtvimg.com/2022-02/160abneg_covid-test-pti-650_625x300_21_February_22.jpg", "publishedAt": "2022-02-21T00:01:53Z", "content": "Covid cases in India: Currently, there are 2,24,187 active cases in the country.\r\nNew Delhi: India reported 19,968 new COVID-19 cases and 673 related deaths yesterday, with the virus-related death co… [+1092 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Could Lose Financial Markets Access If It Invades Ukraine: EU", "description": "European Commission President Ursula von der Leyen disclosed some details of the sanctions Moscow would face if it invaded Ukraine, saying Russia would be cut off from international", "url": "https://www.ndtv.com/world-news/russia-could-lose-financial-markets-access-if-it-invades-ukraine-eu-chief-ursula-von-der-leyen-2779599", "urlToImage": "https://c.ndtvimg.com/2022-02/piisel5_russian-troops_650x400_19_February_22.jpg", "publishedAt": "2022-02-20T23:22:36Z", "content": "The EU Chief said sanctions on Russia would not be imposed until after any Ukraine invasion. (File)\r\nBerlin: European Commission President Ursula von der Leyen disclosed some details of the sanctions… [+1799 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Intel Shows Russia Gave Orders To 'Attack' Ukraine: US Media", "description": "US media reported Sunday that the US received intelligence last week saying the Russian military has been ordered to move forward with an attack against Ukraine, citing anonymous sources.", "url": "https://www.ndtv.com/world-news/intel-shows-russia-gave-orders-to-attack-ukraine-us-media-2779602", "urlToImage": "https://c.ndtvimg.com/2022-02/q48jgi3o_ukraine-russia-reuters_625x300_20_February_22.jpg", "publishedAt": "2022-02-20T23:15:35Z", "content": "Russia denies it has plans to attack Ukraine but is seeking a guarantee that it'll never join NATO (File)\r\nWashington: US media reported Sunday that the US received intelligence last week saying the … [+1757 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "New Russian Deployments Near Ukraine Border, Show Satellite Images", "description": "There have been multiple new field deployments of armored equipment and troops in Russia near the border with Ukraine amid fears of an invasion, according to satellite imagery from UScompany Maxar.", "url": "https://www.ndtv.com/world-news/new-russian-deployments-near-ukraine-border-show-satellite-images-2779589", "urlToImage": "https://c.ndtvimg.com/2022-02/6d4n4748_russia-deployments-reuters-650_625x300_21_February_22.jpg", "publishedAt": "2022-02-20T23:07:58Z", "content": "Russia's new field deployments near Ukraine include armored equipment and troops, showed images. (File)\r\nThere have been multiple new field deployments of armored equipment and troops in Russia near … [+434 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Blog: Blog: Living In Constant Fear, Story Of An Indian Student In Ukraine", "description": "With tensions between Ukraine and Russia rising, Indian students in Ukraine have families that are worried sick.", "url": "https://www.ndtv.com/blog/living-in-constant-fear-story-of-an-indian-student-in-ukraine-2779597", "urlToImage": "https://c.ndtvimg.com/2022-02/qrp6kbkg_ukraine-650_625x300_21_February_22.jpg", "publishedAt": "2022-02-20T22:56:02Z", "content": "Like many young Indians in far-flung corners of the world, the life of an Indian student in Ukraine used to involve attending classes, homework, revising lessons, shopping for essentials, hanging out… [+3926 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Arvind Kejriwal Tells Big Lies, Either Flips Or Apologizes: CS Channi", "description": "Punjab Chief Minister Charanjit Singh Channi on Sunday called Aam Aadmi Party (AAP) national convener Arvind Kejriwal a \"liar\" and said if elected to power, the AAP won't bring any change in the state.", "url": "https://www.ndtv.com/india-news/arvind-kejriwal-tells-big-lies-either-flips-or-apologizes-charanjit-singh-channi-2779564", "urlToImage": "https://c.ndtvimg.com/2022-02/9p92kfi_punjab-chief-minister-charanjit-singh-channi_650x400_15_February_22.jpg", "publishedAt": "2022-02-20T22:37:57Z", "content": "CS Channi also called the leaders of AAP those who were \"rejected\" from everywhere. (File)\r\nMorinda (Punjab): Punjab Chief Minister Charanjit Singh Channi on Sunday called Aam Aadmi Party (AAP) natio… [+1178 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "'Swissleaks' Investigation Targets Credit Suisse Bank", "description": "Credit Suisse bank held tens of billions of euros of dirty money for decades, a new cross-border media investigation claimed Sunday, based on a massive date leak from an insider.", "url": "https://www.ndtv.com/world-news/swissleaks-investigation-targets-credit-suisse-bank-2779592", "urlToImage": "https://i.ndtvimg.com/i/2016-03/credit-suisse_625x300_51458879284.jpg", "publishedAt": "2022-02-20T22:30:01Z", "content": "'Swissleaks' case: Credit Suisse was hit by a series of setbacks a year ago. (Representational)\r\nParis: Credit Suisse bank held tens of billions of euros of dirty money for decades, a new cross-borde… [+2515 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Priyanka Gandhi Meets Family Of Girl Found Dead In UP's Unnao", "description": "Congress leader Priyanka Gandhi Vadra on Sunday met the relatives of the 22-year-old missing woman whose body was recently recovered from a plot owned by a late former minister's son Rajol Singh earlier this month in Unnao.", "url": "https://www.ndtv.com/india-news/priyanka-gandhi-vadra-meets-family-of-girl-found-dead-in-ups-unnao-2779585", "urlToImage": "https://c.ndtvimg.com/2022-02/p6jjct04_priyanka-gandhi-vadra-pti_625x300_17_February_22.jpg", "publishedAt": "2022-02-20T22:06:20Z", "content": "Unnao, UP: Priyanka Gandhi said that the family wants justice and not aid. (File)\r\nUnnao (Uttar Pradesh): Congress leader Priyanka Gandhi Vadra on Sunday met the relatives of the 22-year-old missing … [+1126 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Embassy In Russia Tells Americans To \"Have Evacuation Plans\"", "description": "The US embassy in Moscow warned Americans late Sunday of potential attacks in public places in Russia, including along border with Ukraine where the Kremlin has massed troops in advance of a feared invasion.", "url": "https://www.ndtv.com/world-news/us-embassy-in-russia-tells-americans-to-have-evacuation-plans-2779584", "urlToImage": "https://c.ndtvimg.com/2022-02/mt2k68ko_us-russia-generic-afp-650_625x300_21_February_22.jpg", "publishedAt": "2022-02-20T21:40:05Z", "content": "US embassy told Americans in Russia to have evacuation plans that don't rely on US aid (Representational)\r\nMoscow: The US embassy in Moscow warned Americans late Sunday of potential attacks in public… [+1786 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Tension In Karnataka's Shivamogga Over Right-Wing Activist's Murder", "description": "A 26-year-old Bajrang Dal activist Harsha was allegedly murdered on Sunday at around 9 pm in Karnataka's Shivamogga.", "url": "https://www.ndtv.com/karnataka-news/tension-in-karnatakas-shivamogga-over-right-wing-activists-murder-2779580", "urlToImage": "https://c.ndtvimg.com/2022-02/miu4c7v8_shivamogga-tension-over-murder-650_625x300_21_February_22.jpg", "publishedAt": "2022-02-20T21:33:48Z", "content": "Shivamogga, Karnataka: Security has been tightened in the city following the activist's death.\r\nShivamogga (Karnataka): A 26-year-old Bajrang Dal activist Harsha was allegedly murdered on Sunday at a… [+396 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Election Turnout: Nearly 70% Polling In Punjab, Over 61% In UP Till 5 PM", "description": "Nearly 70 per cent polling was recorded till 5 pm in the assembly elections in Punjab, while in the third of the seven phase polls in Uttar Pradesh, it was over 61 per cent, according to official data.", "url": "https://www.ndtv.com/india-news/election-turnout-nearly-70-in-punjab-over-61-in-up-till-5-pm-2779545", "urlToImage": "https://c.ndtvimg.com/2022-02/ae2fk1v_punjab-elections-2022-ani-650_625x300_21_February_22.jpg", "publishedAt": "2022-02-20T21:06:51Z", "content": "UP polls and Punjab polls results will be declared on March 10.\r\nNew Delhi: Nearly 70 per cent polling was recorded till 5 pm in the assembly elections in Punjab, while in the third of the seven phas… [+4842 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "PM Modi Wishes UK's Queen Elizabeth Speedy Recovery From Covid", "description": "Prime Minister Narendra Modi on Sunday wished a speedy recovery to Britain's Queen Elizabeth II from Covid-19.", "url": "https://www.ndtv.com/world-news/pm-narendra-modi-wishes-uks-queen-elizabeth-speedy-recovery-from-covid-2779563", "urlToImage": "https://i.ndtvimg.com/i/2015-11/pm-modi-with-queen_650x400_71447429265.jpg", "publishedAt": "2022-02-20T20:48:17Z", "content": "Britain's Queen Elizabeth II, 95, has tested positive for COVID with \"mild, cold-like\" symptoms. (File)\r\nNew Delhi: Prime Minister Narendra Modi on Sunday wished a speedy recovery to Britain's Queen … [+1317 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Canada Police Reclaim Capital After Truckers' Anti-Vaccine Protest Ends", "description": "The last big rigs were towed Sunday out of Canada's capital, where the streets were quiet for the first time in almost a month after a massive police operation ended a drawn-out siege by protesters opposing Covid health rules.", "url": "https://www.ndtv.com/world-news/canada-police-reclaim-capital-after-truckers-anti-vaccine-protest-ends-2779574", "urlToImage": "https://c.ndtvimg.com/2022-02/6d5tlrlg_canada-protest-ends-afp-650_625x300_21_February_22.jpg", "publishedAt": "2022-02-20T20:37:05Z", "content": "Canada protest: Police said a total of 191 have been arrested.\r\nOttawa: The last big rigs were towed Sunday out of Canada's capital, where the streets were quiet for the first time in almost a month … [+4195 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia, Ukraine Call For Talks, Blame Each Other Over Intense Shelling", "description": "Ukraine and Russia called for intensified diplomatic efforts Sunday to avert all-out war, each blaming the other for a sharp escalation in shelling on the front line separating Kyiv's forces from Moscow-backed separatists.", "url": "https://www.ndtv.com/world-news/russia-ukraine-call-for-talks-blame-each-other-over-intense-shelling-2779565", "urlToImage": "https://c.ndtvimg.com/2022-02/qb16smb8_ukraine-shelling-afp-650_625x300_21_February_22.jpg", "publishedAt": "2022-02-20T20:27:01Z", "content": "Bombardments were heard near the front line between Ukraine forces and Russia-backed rebels.\r\nKyiv: Ukraine and Russia called for intensified diplomatic efforts Sunday to avert all-out war, each blam… [+5524 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Tumbler Removed From Man's Colon. Doctors Wonder How It Reached There", "description": "A 55-year-old man, suffering from acute constipation and abdominal pain, was on Sunday operated upon by a team of doctors in Bihar who extracted a glass tumbler from his colon.", "url": "https://www.ndtv.com/india-news/glass-tumbler-extracted-from-man-s-colon-in-bihar-2779231", "urlToImage": "https://c.ndtvimg.com/2022-01/du0tfgj_surgery-generic-afp_625x300_11_January_22.jpg", "publishedAt": "2022-02-20T20:01:40Z", "content": "Bihar: Doctors are not convinced with patient's claim to have swallowed the tumbler. (Representational)\r\nMuzaffarpur (Bihar): A 55-year-old man, suffering from acute constipation and abdominal pain, … [+2233 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "India, US In Talks To Boost Economic Ties Beyond Free Trade Deal: Minister", "description": "India and the US are in dialogue to look at ways, beyond a free trade agreement, to promote economic ties by providing better market access and enhanced engagement on investments, Commerce and Industry Minister Piyush Goyal said on Sunday.", "url": "https://www.ndtv.com/india-news/india-us-in-talks-to-boost-economic-ties-beyond-free-trade-deal-minister-piyush-goyal-2779555", "urlToImage": "https://c.ndtvimg.com/2019-09/70c5eb9k_piyush-goyal-pti-_625x300_20_September_19.jpg", "publishedAt": "2022-02-20T19:48:44Z", "content": "Piyush Goyal said India, US are working on many things to further boost economic ties. (File)\r\nNew Delhi: India and the US are in dialogue to look at ways, beyond a free trade agreement, to promote e… [+2147 chars]"}]}