{"status": "ok", "totalResults": 499, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "IPL 2022 Points Table, Orange Cap, Purple Cap List After GT vs DC", "description": "IPL 2022: Gujarat Titans (GT) made it two wins in two matches after defeating Delhi Capitals (DC) by 14 runs at the MCA Stadium in Pune.", "url": "https://sports.ndtv.com/ipl-2022/ipl-2022-updated-points-table-latest-orange-cap-and-purple-cap-lists-after-gt-vs-dc-match-10-2859540", "urlToImage": "https://c.ndtvimg.com/2022-04/apljfll_gujarat-titans-team-bcciipl_625x300_03_April_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-04-03T03:43:14Z", "content": "Gujarat Titans (GT) made it two wins in two matches after defeating Delhi Capitals (DC) by 14 runs at the MCA Stadium in Pune. After posing a total of 171 for six, on the back of Shubman Gill's knock… [+1794 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Debika Chakraborty", "title": "PGDBA 2022 Exam Today; Check Examination Pattern, Important Details", "description": "The PGDBA 2022 exam is held for the students who wish to enrol in the Postgraduate Diploma course for Business Analytics jointly offered by IIT Kharagpur, IIM Calcutta and ISI.", "url": "https://www.ndtv.com/education/pgdba-2022-exam-today-check-examination-pattern-important-details", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/4/2/Exam-featured-image.jpg", "publishedAt": "2022-04-03T03:39:58Z", "content": "New Delhi:Post Graduate Diploma in Business Analytics (PGDBA) Exam 2022 is scheduled to be held today, April 3 by IIT Kharagpur. The PGDBA 2022 exam is held for the students who wish to enrol in the … [+1893 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Vishesh Roy", "title": "Watch: Ravi Shastri Recreates India's 2011 World Cup Winning Moment", "description": "Celebrating the 11th year anniversary of Team India's 2011 World Cup triumph, Ravi Shastri on Saturday recreated the World Cup winning moment.", "url": "https://sports.ndtv.com/cricket/watch-ravi-shastri-recreates-indias-2011-world-cup-winning-moment-2859526", "urlToImage": "https://c.ndtvimg.com/2022-04/dahanr8g_ravi-shastri-commentary-twitter_625x300_03_April_22.jpg", "publishedAt": "2022-04-03T03:24:56Z", "content": "The 2011 World Cup triumph is a memory that is close to every Indian cricket fan and one cannot get over that night where MS Dhoni and his team gave a billion people a reason to rejoice. In the summi… [+2156 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Premier League: Manchester United Slip Up Again In Race For Top Four", "description": "Manchester United boss Ralf Rangnick bemoaned his lack of attacking options after a 1-1 draw against Leicester City on Saturday badly damaged their hopes of securing Champions League football for next season.", "url": "https://sports.ndtv.com/english-premier-league/premier-league-manchester-united-slip-up-again-in-race-for-top-four-2859514", "urlToImage": "https://c.ndtvimg.com/2022-04/muhagvo_manchester-united-ralf-rangnick-afp_625x300_03_April_22.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-04-03T02:58:48Z", "content": "Manchester United boss Ralf Rangnick bemoaned his lack of attacking options after a 1-1 draw against Leicester City on Saturday badly damaged their hopes of securing Champions League football for nex… [+2918 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sri Lanka Arrests 12 Indian Fishermen For Allegedly Fishing In Its Waters", "description": "As many as 12 Indian fishermen from Tamil Nadu have been arrested by the Sri Lankan navy for allegedly fishing in its waters, a Fisheries official here said on Sunday.", "url": "https://www.ndtv.com/india-news/sri-lankan-navy-arrests-12-indian-fishermen-2859509", "urlToImage": "https://c.ndtvimg.com/2021-06/1a45bbc8_fishing-boat-generic-unsplash_625x300_06_June_21.jpg", "publishedAt": "2022-04-03T02:53:38Z", "content": "The fishermen were allegedly fishing in Sri Lankan waters. (Representational image)\r\nRameswaram (TN): As many as 12 Indian fishermen from Tamil Nadu have been arrested by the Sri Lankan navy for alle… [+581 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Social Media Blocked, Curfew In Sri Lanka As Protests Spread: 10 Points", "description": "The Sri Lankan government, battling nationwide protests over the economic crisis, has blocked access to all social media sites in its latest bid to quell protests against President Gotabaya Rajapaksa.", "url": "https://www.ndtv.com/world-news/social-media-blocked-curfew-in-sri-lanka-as-protests-spread-10-points-2859507", "urlToImage": "https://c.ndtvimg.com/2022-04/49dduud_sri-lanka-protests-_625x300_03_April_22.jpg", "publishedAt": "2022-04-03T02:49:39Z", "content": "<li>Access to all social media sites, including Facebook, Twitter, Instagram, WhatsApp and YouTube, following a governemt order late on Saturday. The Sri Lankan government said the decision was taken… [+2308 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Cricket To Politics, A Recap Of The Imran Khan Story Ahead Of Trust Vote", "description": "An all-rounder who led Pakistan to the zenith of world cricket, a politician who came to power riding on the promise of cleaning the system and a Prime Minister who now faces a no-trust vote - Imran Khan has always lived under the spotlight.", "url": "https://www.ndtv.com/world-news/cricket-to-politics-a-recap-of-the-imran-khan-story-ahead-of-trust-vote-2859492", "urlToImage": "https://c.ndtvimg.com/2022-04/gbfkt7q8_imran-profile_625x300_03_April_22.jpg", "publishedAt": "2022-04-03T02:05:32Z", "content": "<li>Imran Khan's government is in danger after a key ally struck a deal with the opposition Pakistan Peoples Party. Pakistan's National Assembly has a strength of 342 members, with the majority mark … [+2266 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "4 Maharashtra Ashram School Students Fall Sick, Food Poisoning Suspected", "description": "Four students of an ashram school in Dhabade in Thane district's Bhiwandi area fell ill due to suspected food poisoning, civic health officials said on Saturday.", "url": "https://www.ndtv.com/cities/four-ashram-school-students-fall-ill-in-bhiwandi-food-poisoning-suspected-2859371", "urlToImage": "https://i.ndtvimg.com/i/2016-11/school-children-generic-istock_650x400_51478266071.jpg", "publishedAt": "2022-04-03T01:51:30Z", "content": "The four children complained of uneasiness after having food, said an official. (Representational)\r\nThane: Four students of an ashram school in Dhabade in Thane district's Bhiwandi area fell ill due … [+999 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "China Reports Over 13,000 New Covid Cases As Outbreak Spreads", "description": "China Sunday reported 13,146 Covid cases, the highest since the peak of the first wave more than two years ago, as the highly transmissible Omicron variant spread to more than a dozen provinces.", "url": "https://www.ndtv.com/world-news/china-reports-over-13-000-new-covid-19-cases-as-outbreak-spreads-2859481", "urlToImage": "https://c.ndtvimg.com/2022-04/uvrjp6c4_shanghai-china-covid-reuters_625x300_02_April_22.jpg", "publishedAt": "2022-04-03T01:29:50Z", "content": "China reported 13,146 Covid cases as Omicron variant spread to more than a dozen provinces. (File)\r\nBeijing: China Sunday reported 13,146 Covid cases, the highest since the peak of the first wave mor… [+976 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Petrol, Diesel Prices Hiked Again, Delhi Rates Up By Rs 8 In 13 days", "description": "Petrol and diesel prices were on Sunday again hiked by 80 paise a litre each, taking the total increase in rates in less then two weeks to Rs 8 per litre.", "url": "https://www.ndtv.com/india-news/petrol-and-diesel-prices-hiked-again-delhi-rates-up-by-rs-8-in-13-days-2859480", "urlToImage": "https://c.ndtvimg.com/2021-09/ojarjui8_petrol-pump_650x400_28_September_21.jpg", "publishedAt": "2022-04-03T01:26:40Z", "content": "Rates have been increased across the country and vary from state to state depending on local taxation.\r\nNew Delhi: Petrol and diesel prices were on Sunday again hiked by 80 paise a litre each, taking… [+580 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Edited by NDTV News Desk", "title": "LIVE: Ukraine Claims Kyiv Region As Russian Pullback Reveals Horror", "description": "Ukraine said Saturday it has regained control of the Kyiv region, with Russian troops retreating from around the capital and Chernigiv city, as evidence emerged of possible civilian killings in areas the invading forces have been occupying", "url": "https://www.ndtv.com/world-news/ukraine-russia-crisis-live-updates-ukraine-russia-war-latest-news-ukraine-russia-latest-news-today-3-april-2022-2859476", "urlToImage": "https://c.ndtvimg.com/2022-04/ghf5tveo_kyiv-outskirts-ukraine-russia-war-afp-650_625x300_03_April_22.jpg", "publishedAt": "2022-04-03T01:20:24Z", "content": "Ukraine-Russia LIVE Updates: More than 10 million have had to flee their homes. (File)\r\nUkraine said Saturday it has regained control of the Kyiv region, with Russian troops retreating from around th… [+3281 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Army Dedicates First Floating Hamlet On Srinagar's Dal Lake To Citizens", "description": "The Army on Saturday dedicated the soft launch of Kashmir's first floating hamlet on the famous Dal Lake in Srinagar to the people of Jammu and Kashmir, a defence spokesperson said.", "url": "https://www.ndtv.com/india-news/jammu-and-kashmir-army-dedicates-first-floating-hamlet-on-srinagars-dal-lake-to-citizens-2859392", "urlToImage": "https://c.ndtvimg.com/2022-04/l6r0ri0g_srinagar-floating-hamlet-650_625x300_03_April_22.jpg", "publishedAt": "2022-04-03T00:59:41Z", "content": "The Chinar Corps commander said Dal Lake is the jewel in the crown of Kashmir.\r\nSrinagar: The Army on Saturday dedicated the soft launch of Kashmir's first floating hamlet on the famous Dal Lake in S… [+1633 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Earthquake Of 3.6 Magnitude Strikes Near Tirupati In Andhra Pradesh", "description": "An earthquake of magnitude 3.6 on the Richter scale occurred 85 km Northeast of Andhra Pradesh's Tirupati, said National Center for Seismology on Sunday.", "url": "https://www.ndtv.com/andhra-pradesh-news/earthquake-of-3-6-magnitude-strikes-near-tirupati-in-andhra-pradesh-2859459", "urlToImage": "https://i.ndtvimg.com/i/2017-09/earthquake-generic_650x400_71505899871.jpg", "publishedAt": "2022-04-03T00:41:28Z", "content": "Earthquake near Tirupati: The time of the earthquake is said to be around 1.10 am. (Representational)\r\nTirupati: An earthquake of magnitude 3.6 on the Richter scale occurred 85 km Northeast of Andhra… [+790 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Live Updates: Imran Khan Set To Face Crucial No-Trust Vote Today", "description": "Pakistan Prime Minister Imran Khan is set to face the no-confidence vote in the National Assembly today that could see him thrown out of office.", "url": "https://www.ndtv.com/world-news/imran-khan-no-trust-vote-live-updates-imran-khan-set-to-face-crucial-no-trust-vote-today-2859455", "urlToImage": "https://c.ndtvimg.com/2022-03/unum3alo_imran-khan-reuters_625x300_31_March_22.jpg", "publishedAt": "2022-04-03T00:20:10Z", "content": "Imran Khan No-Trust Vote: Mr Khan said he'll not resign and insisted he'll \"fight till last ball\". (File)\r\nPakistan Prime Minister Imran Khan is set to face the no-confidence vote in the National Ass… [+1251 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE: India Reported 1,260 New Covid Cases On Saturday", "description": "India reported 1,260 fresh COVID-19 cases and 83 related deaths on Saturday, said the Union health ministry. The virus-related death count stands at5,21,264, according to yesterday's update.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-3-april-2022-2859463", "urlToImage": "https://c.ndtvimg.com/2022-02/160abneg_covid-test-pti-650_625x300_21_February_22.jpg", "publishedAt": "2022-04-03T00:17:54Z", "content": "COVID-19 Live: The recovery rate is currently at 98.76 per cent, the ministry said. (File)\r\nNew Delhi: India reported 1,260 fresh COVID-19 cases and 83 related deaths on Saturday, said the Union heal… [+648 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Imran Khan's Fight For Survival As No-Trust Vote Comes Up: 10 Points", "description": "Pakistan Prime Minister Imran Khan, facing the biggest challenge to his rule since being elected in 2018, has called on his supporters to take to the streets as a no-trust vote that could see him thrown out of office comes up today.", "url": "https://www.ndtv.com/world-news/imran-khan-no-trust-vote-imran-khans-fight-for-survival-as-no-trust-vote-comes-up-10-points-2859448", "urlToImage": "https://c.ndtvimg.com/2022-04/rpb3e0d4_imran-khan_625x300_02_April_22.jpg", "publishedAt": "2022-04-02T23:16:45Z", "content": "<li>Mr Khan's Pakistan Tehreek-e-Insaf party (PTI) effectively lost its majority in the 342-member assembly last week when a key coalition partner said its seven lawmakers would vote with the opposit… [+2043 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "France's Macron Calls For \"Mobilisation\" At First Rally Ahead Of Polls", "description": "French President Emmanuel Macron called on tens of thousands of cheering but increasingly nervous supporters to help him win a second term as he held his first election campaign rally on Saturday just a week from the start of voting.", "url": "https://www.ndtv.com/world-news/frances-macron-calls-for-mobilisation-at-1st-rally-as-poll-race-tightens-2859446", "urlToImage": "https://c.ndtvimg.com/2022-04/m73t1dm8_emmanuel-macron-france-afp-650_625x300_03_April_22.jpg", "publishedAt": "2022-04-02T23:06:48Z", "content": "France: \"I don't want either arrogance or defeatism, I want a general mobilisation,\" said Emmanuel Macron\r\nParis: French President Emmanuel Macron called on tens of thousands of cheering but increasi… [+4528 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "North Korea Warns Action Against Seoul Over Preemptive Strike Remarks", "description": "Kim Yo Jong, the sister of North Korean leader Kim Jong Un, said on Sunday the South Korean defence minister's remarks about a preemptive strike against the north \"has further", "url": "https://www.ndtv.com/world-news/north-korea-warns-action-against-seoul-over-preemptive-strike-remarks-2859443", "urlToImage": "https://c.ndtvimg.com/2022-04/aue1q6g_kim-yo-jong-sister-of-kim-jong-un-reuters-650_625x300_03_April_22.jpg", "publishedAt": "2022-04-02T22:51:57Z", "content": "North Korea's Kim Yo Jong said South Korea \"may face a serious threat\" due to such remarks. (File)\r\nSeoul: Kim Yo Jong, the sister of North Korean leader Kim Jong Un, said on Sunday the South Korean … [+518 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "8 Killed, 13 Missing In Brazil Flash Floods, Landslides", "description": "Torrential rains triggered flash floods and landslides across Brazil's Rio de Janeiro state, killing at least eight people including six children and leaving 13 missing, authorities said Saturday.", "url": "https://www.ndtv.com/world-news/8-killed-13-missing-in-brazils-rio-de-janeiro-flash-floods-landslides-2859441", "urlToImage": "https://c.ndtvimg.com/2022-04/ccut4e3o_brazil-landslide-afp-650_625x300_03_April_22.jpg", "publishedAt": "2022-04-02T21:43:07Z", "content": "Brazil floods: The eight casualties include six children, authorities said. (File)\r\nRio de Janeiro: Torrential rains triggered flash floods and landslides across Brazil's Rio de Janeiro state, killin… [+1557 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine Says Russia \"Verbally\" Agreed To Its Proposals", "description": "Ukraine's top negotiator in peace talks with Russia said Saturday that Moscow had \"verbally\" agreed to key Ukrainian proposals, raising hopes that talks to end fighting are moving forward.", "url": "https://www.ndtv.com/world-news/ukraine-russia-war-ukraine-says-russia-verbally-agreed-to-its-proposals-2859438", "urlToImage": "https://c.ndtvimg.com/2022-04/ghf5tveo_kyiv-outskirts-ukraine-russia-war-afp-650_625x300_03_April_22.jpg", "publishedAt": "2022-04-02T20:53:16Z", "content": "The Ukraine negotiator said there was \"no official confirmation in writing\" by Russia. (File)\r\nKyiv: Ukraine's top negotiator in peace talks with Russia said Saturday that Moscow had \"verbally\" agree… [+1681 chars]"}]}