{"status": "ok", "totalResults": 287, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "North Korea Appoints Veteran Diplomat As First Female Foreign Minister", "description": "North Korea has appointed veteran diplomat Choe Son-hui as its first female foreign minister, state media reported Saturday, as Pyongyang pushes ahead with a blitz of sanctions-busting weapons tests and ignores US calls for talks.", "url": "https://www.ndtv.com/world-news/north-korea-appoints-veteran-diplomat-as-first-female-foreign-minister-3057486", "urlToImage": "https://c.ndtvimg.com/2022-06/uvqahudo_-choe-son-hui_625x300_11_June_22.jpg", "publishedAt": "2022-06-11T02:19:00Z", "content": "Choe Son-hui replaces Ri Son Gwon, a hardline former military official. (File)\r\nSeoul: North Korea has appointed veteran diplomat Choe Son-hui as its first female foreign minister, state media report… [+1666 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Hizbul Mujahideen Terrorist Killed In Encounter In Jammu-Kashmir's Kulgam", "description": "One terrorist of the proscribed terror outfit Hizb-ul-Mujahideen (HM) was killed during the encounter with security forces, police said on Saturday.", "url": "https://www.ndtv.com/india-news/hizbul-mujahideen-terrorist-killed-in-encounter-in-jammu-kashmirs-kulgam-3057475", "urlToImage": "https://c.ndtvimg.com/2022-04/ieovl3cc_jammu-sunjwan-terrorist-attack-pti_625x300_22_April_22.jpg", "publishedAt": "2022-06-11T01:51:44Z", "content": "The encounter broke out in the Khandipora area in the wee hours of Friday-Saturday. (Representational)\r\nKulgam, Jammu And Kashmir: One terrorist of the proscribed terror outfit Hizb-ul-Mujahideen (HM… [+659 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE: India Logs 7,584 New COVID-19 Cases In 24 Hours", "description": "India on Friday reported a total of 7,584 new coronavirus infections in the last 24 hours. The new additions have taken the total number of coronavirus cases in country to 4,32,05,106.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-11-june-3057444", "urlToImage": "https://c.ndtvimg.com/2022-06/ka52tqlg_coronavirus-india-testing-afp-pic_650x400_09_June_22.jpg", "publishedAt": "2022-06-11T01:03:08Z", "content": "India Coronavirus Live: The country reported 24 Covid-related deaths on Friday.\r\nNew Delhi: India on Friday reported a total of 7,584 new coronavirus infections in the last 24 hours. The new addition… [+407 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "EU Unity Must Not Be Compromised Over Ukraine Candidate Status: France", "description": "A decision to give Ukraine candidate status to the European Union has to be done without weakening the bloc and to ensure Kyiv is not left in limbo for years, a French presidential official said on Friday.", "url": "https://www.ndtv.com/world-news/eu-unity-must-not-be-compromised-over-ukraine-candidate-status-france-3057439", "urlToImage": "https://c.ndtvimg.com/2022-03/u10q85a_antitank-constructions-kyivukrainereuters_625x300_07_March_22.jpg", "publishedAt": "2022-06-11T00:40:40Z", "content": "Ukraine War: There are divisions within the 27-member bloc on giving the Ukraine candidacy status.\r\nParis: A decision to give Ukraine candidate status to the European Union has to be done without wea… [+2872 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Two Lashkar Terrorists Arrested In Jammu And Kashmir's Baramulla", "description": "Indian Army in a joint operation with Jammu and Kashmir Police arrested two active terrorists linked with proscribed terror outfit Lashkar-e-Taiba (LeT) in Baramulla, informed the police officials on Friday.", "url": "https://www.ndtv.com/india-news/two-lashkar-terrorists-arrested-in-jammu-and-kashmirs-baramulla-3057431", "urlToImage": "https://i.ndtvimg.com/i/2018-05/jammu-and-kashmir-army-generic-reuters_650x400_81525620118.jpg", "publishedAt": "2022-06-11T00:14:24Z", "content": "The Police registered a case under relevant sections of law against 2 Lashkar terrorists.\r\nBaramulla: Indian Army in a joint operation with Jammu and Kashmir Police arrested two active terrorists lin… [+826 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Minor Girl Sexually Assaulted In Hyderabad, Accused Arrested: Police", "description": "Hyderabad police on Friday arrested a man for allegedly sexually assaulting a minor girl, repeatedly for the last three to four days. According to the police, the victim was sent for medical examination and her statement was recorded by a lady police", "url": "https://www.ndtv.com/india-news/minor-girl-sexually-assaulted-in-hyderabad-accused-arrested-police-3057424", "urlToImage": "https://i.ndtvimg.com/i/2017-03/police-generic_650x400_71490246814.jpg", "publishedAt": "2022-06-11T00:03:03Z", "content": "Earlier, 2 more rape incidents involving minors were reported in Hyderabad on Monday. (Representational)\r\nHyderabad: Hyderabad police on Friday arrested a man for allegedly sexually assaulting a mino… [+1387 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Insurer To Pay $5.2 Million To Woman Who Caught Sexually Transmitted Disease In Car", "description": "A US woman who contracted a sexually transmitted disease from her partner during romantic encounters in his car has been awarded $5.2 million in damages from his vehicle insurance company.", "url": "https://www.ndtv.com/world-news/car-insurer-to-pay-5-2-million-to-us-woman-who-caught-sexually-transmitted-disease-in-vehicle-3057417", "urlToImage": "https://c.ndtvimg.com/2022-06/umh16is_car-generic_625x300_11_June_22.jpg", "publishedAt": "2022-06-10T23:39:35Z", "content": "Reports of the ruling quickly went viral on social media, prompting humor as well as outrage.\r\nWashington: A US woman who contracted a sexually transmitted disease from her partner during romantic en… [+1783 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "More Than 130 Arrested In UP After Protests Over Remarks On Prophet", "description": "10 People pelted stones at police personnel in Prayagraj and Saharanpur and protests broke out after Friday prayers in at least four other cities in Uttar Pradesh over a now-suspended BJP leader's recent remarks on Prophet Mohammad.", "url": "https://www.ndtv.com/india-news/more-than-130-arrested-in-up-after-protests-over-remarks-on-prophet-3057404", "urlToImage": "https://c.ndtvimg.com/2022-06/qtd2cm3c_prayagraj-prophet-protest_625x300_10_June_22.jpg", "publishedAt": "2022-06-10T23:01:22Z", "content": "Prophet Row: Police have arrested more than 130 people from six districts of the state.\r\nLucknow: 10 People pelted stones at police personnel in Prayagraj and Saharanpur and protests broke out after … [+4238 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "China Must Refrain From Further Destabilising Actions Towards Taiwan: US", "description": "On the sidelines of the annual Shangri La Dialogue in Singapore during an interaction on Friday, US Defense Secretary Lloyd Austin warned his Chinese counterpart that Beijing must \"refrain from further destabilizing actions towards Taiwan\".", "url": "https://www.ndtv.com/world-news/china-must-refrain-from-further-destabilising-actions-towards-taiwan-us-3057396", "urlToImage": "https://c.ndtvimg.com/2021-06/46qest4_us-defense-secretary-lloyd-austinreuters_625x300_03_June_21.jpg", "publishedAt": "2022-06-10T22:34:09Z", "content": "Tensions have grown in a severe manner between the US and China over Taiwan amid Ukraine war.\r\nWashington: On the sidelines of the annual Shangri La Dialogue in Singapore during an interaction on Fri… [+2642 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Huge Loss For Team Thackeray, BJP Scoops 6th Seat In Maharashtra", "description": "Maharashtra's ruling alliance suffered a massive setback today with the BJP winning a third seat in the state in straight fight against the Shiv Sena.", "url": "https://www.ndtv.com/india-news/rajya-sabha-elections-huge-loss-for-team-thackeray-bjp-scoops-6th-seat-in-maharashtra-3057395", "urlToImage": "https://c.ndtvimg.com/2021-09/9acavet8_uddhav-thackeraymumbainagpur-bullet-train-projectaurangabad_625x300_17_September_21.jpg", "publishedAt": "2022-06-10T22:31:30Z", "content": "Maharashtra's ruling alliance suffered a massive setback today with the BJP winning a third seat in the state in straight fight against the Shiv Sena. With this, the state's numbers in the six Rajya … [+834 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Health Authority Says Moderna Covid Vaccine Effective In Under-Fives", "description": "US health authorities confirmed on Friday that data provided by drug-maker Moderna on the efficacy of its Covid-19 vaccine among very young children were accurate.", "url": "https://www.ndtv.com/world-news/covid-19-us-health-authority-says-moderna-vaccine-effective-in-under-fives-3057386", "urlToImage": "https://c.ndtvimg.com/2021-06/d8o4bnc_moderna-inc-650_625x300_30_June_21.jpeg", "publishedAt": "2022-06-10T21:48:36Z", "content": "Moderna's vaccine is currently only authorized for people aged 18 and older in the US.\r\nWashington: US health authorities confirmed on Friday that data provided by drug-maker Moderna on the efficacy … [+2227 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Eye Is Not Blinking\": Justin Bieber Says Suffering From Facial Paralysis", "description": "Justin Bieber on Friday told fans in a video posted to Instagram that he's been diagnosed with Ramsay Hunt Syndrome, which is causing him partial facial paralysis.", "url": "https://www.ndtv.com/world-news/justin-bieber-says-suffering-from-facial-paralysis-3057375", "urlToImage": "https://c.ndtvimg.com/2021-12/t1m49ufo_justin-bieberafp_625x300_01_December_21.jpg", "publishedAt": "2022-06-10T21:19:34Z", "content": "Justin Bieber recently announced he was pausing his Justice World Tour due to illness.\r\nNew York: Justin Bieber on Friday told fans in a video posted to Instagram that he's been diagnosed with Ramsay… [+1188 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Monkeypox Cases Harder To Detect, Say US Health Experts", "description": "US health experts said Friday that cases of monkeypox that are being detected at the moment do not necessarily display the usual symptoms, making the disease more difficult to diagnose.", "url": "https://www.ndtv.com/world-news/monkeypox-cases-harder-to-detect-say-us-health-experts-3057368", "urlToImage": "https://c.ndtvimg.com/2022-05/0kvsbm5o_monkeypox-virus_625x300_27_May_22.jpg", "publishedAt": "2022-06-10T21:06:55Z", "content": "Monkeypox: As of June 9, around 1,300 cases had been identified worldwide.\r\nWashington: US health experts said Friday that cases of monkeypox that are being detected at the moment do not necessarily … [+2000 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "On Camera, 2 Men Stop Car On Mumbai Sea-Link To Save Bird, Killed By Taxi", "description": "A 43-year-old businessman and his driver, who got down from their car to save an injured bird on Bandra-Worli Sea Link, died after being hit by a taxi on May 30, police said on Friday.", "url": "https://www.ndtv.com/india-news/mumbai-bizman-driver-get-down-on-sealink-to-save-injured-bird-killed-by-speeding-taxi-3057359", "urlToImage": "https://i.ndtvimg.com/i/2016-08/accident-generic_650x400_61471695567.jpg", "publishedAt": "2022-06-10T20:39:18Z", "content": "The case was registered against taxi driver for rash and negligent driving. (Representational)\r\nMumbai: A 43-year-old businessman and his driver, who got down from their car to save an injured bird o… [+1048 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Congress Says Ajay Maken Wins, Recounting On In Haryana Rajya Sabha Polls", "description": "The Congress tweeted its leader Ajay Maken has won the Rajya Sabha elections from Haryana. However, a recounting is on after a vote was rejected. The BJP's Krishan Lal Panwar won the second seat in Haryana.", "url": "https://www.ndtv.com/india-news/rajya-sabha-elections-congress-wins-seat-in-haryana-beats-bjp-backed-media-baron-3057328", "urlToImage": "https://c.ndtvimg.com/2020-09/5u6qtss_rajya-sabha-generic-pti-photo_625x300_23_September_20.jpg", "publishedAt": "2022-06-10T20:27:38Z", "content": "Haryana Rajya Sabha elections: Congress and BJP won one seat each\r\nChandigarh: The Congress tweeted its leader Ajay Maken has won the Rajya Sabha elections from Haryana. However, a recounting is on a… [+1102 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Officially Quits UN Tourism Body After Suspension Over Ukraine", "description": "Moscow on Friday officially announced its withdrawal from the United Nations World Tourism Organization which suspended Russia in April over its military operation in Ukraine.", "url": "https://www.ndtv.com/world-news/russia-officially-quits-un-tourism-body-after-suspension-over-ukraine-3057318", "urlToImage": "https://c.ndtvimg.com/2022-02/6j8mr0f8_vladimir-putin-afp_625x300_23_February_22.jpg", "publishedAt": "2022-06-10T20:06:16Z", "content": "The UN tourism agency had suspended Russia on April 27, saying Ukraine was against its \"values\".\r\nMoscow: Moscow on Friday officially announced its withdrawal from the United Nations World Tourism Or… [+655 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Facebook Probing Outgoing Executive's Use Of Company Resources: Report", "description": "Lawyers are investigating Meta Platforms Inc's outgoing operations chief Sheryl Sandberg's use of company resources over several years, the Wall Street Journal reported on Friday, citing people familiar with the matter.", "url": "https://www.ndtv.com/world-news/facebook-probing-outgoing-executive-sheryl-sandbergs-use-of-company-resources-report-3057298", "urlToImage": "https://c.ndtvimg.com/2020-03/me9bmuko_facebook-coo-sheryl-sandberg-_625x300_18_March_20.jpg", "publishedAt": "2022-06-10T19:35:28Z", "content": "Sandberg said that she will continue to serve on Meta's board after leaving the company in the fall.\r\nSan Francisco: Lawyers are investigating Meta Platforms Inc's outgoing operations chief Sheryl Sa… [+1287 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Counting Of Rajya Sabha Votes Stalled In Haryana Over Claims of Irregularities", "description": "The counting of votes for the two Rajya Sabha seats in Haryana got stalled indefinitely today as the ruling BJP complained about cross-voting and when turned down by the local poll observer, approached the Election Commission in Delhi.", "url": "https://www.ndtv.com/india-news/rajya-sabha-elections-counting-of-rajya-sabha-votes-stalled-in-haryana-over-claims-of-irregularities-3057289", "urlToImage": "https://c.ndtvimg.com/2019-07/ufqclhug_parliament-generic-reuters_625x300_31_July_19.jpg", "publishedAt": "2022-06-10T19:24:59Z", "content": "Rajya Sabha Elections:The BJP sought cancellation of the votes of two Congress members.\r\nNew Delhi: The counting of votes for the two Rajya Sabha seats in Haryana got stalled indefinitely today as th… [+2919 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rajya Sabha Polls: Why Maharashtra Counting Delayed For Hours Explained", "description": "The counting for election to six Rajya Sabha seats from Maharashtra was delayed for several hours on Friday as the BJP questioned the validity of ballots cast by three MLAs of the ruling Maha Vikas Aghadi, or MVA, coalition.", "url": "https://www.ndtv.com/india-news/rajya-sabha-polls-why-maharashtra-counting-delayed-for-hours-explained-3057279", "urlToImage": "https://i.ndtvimg.com/i/2016-08/election-commission_650x400_51471943512.jpg", "publishedAt": "2022-06-10T19:11:34Z", "content": "Counting of votes in Maharashtra Rajya Sabha election was delayed\r\nMumbai: The counting for election to six Rajya Sabha seats from Maharashtra was delayed for several hours on Friday as the BJP quest… [+3254 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Prophet Row: Internet Suspended In Ranchi Till Tomorrow After Protests", "description": "All internet services were temporarily suspended in Ranchi till 6 am on Saturday i.e June 11, in wake of protests in the city on Friday over controversial remarks on Prophet Muhammad.", "url": "https://www.ndtv.com/india-news/prophet-row-internet-suspended-in-jharkhands-ranchi-till-tomorrow-after-protests-3057277", "urlToImage": "https://c.ndtvimg.com/2022-06/dpnms0t_ranchi-prophet-protest_625x300_10_June_22.jpg", "publishedAt": "2022-06-10T19:08:17Z", "content": "Ranchi Protest: At least six people were injured during protests on Friday over Prophet remark.\r\nRanchi: All internet services were temporarily suspended in Ranchi till 6 am on Saturday i.e June 11, … [+3708 chars]"}]}