{"status": "ok", "totalResults": 264, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "On Camera, UP Cops Savagely Thrashing Men Is \"Return Gift\" For BJP MLA", "description": "According to reports, the video was shot two days ago in a police station in Saharanpur, where protests and clashes erupted after Friday prayers over the controversial remarks against Prophet Muhammad by two former BJP spokespersons.", "url": "https://www.ndtv.com/india-news/on-camera-up-cops-savagely-thrashing-men-is-return-gift-for-bjp-mla-3059894", "urlToImage": "https://c.ndtvimg.com/2022-06/2cojeekc_up-police-brutality-ndtv_625x300_12_June_22.jpg", "publishedAt": "2022-06-12T06:23:14Z", "content": "Two policemen were seen mercilessly beating around nine men.\r\nLucknow: Around nine men beg and try to block blows raining incessantly on them from two policemen armed with sticks in what appears to b… [+2834 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine Says It Still Controls Chemical Plant Sheltering Hundreds", "description": "Bitter fighting raged in Sievierodonetsk, but the region's governor said Ukraine remained in control of an industrial area and chemical plant in the eastern city where hundreds of civilians are sheltering from incessant Russian shelling.", "url": "https://www.ndtv.com/india-news/ukraine-says-it-still-controls-chemical-plant-sheltering-hundreds-3059887", "urlToImage": "https://c.ndtvimg.com/2022-06/pdm3anrg_ukraine-russia_625x300_12_June_22.jpg", "publishedAt": "2022-06-12T06:18:05Z", "content": "Russian President Vladimir Putin calls the invasion a \"special military operation\".\r\nKyiv: Bitter fighting raged in Sievierodonetsk, but the region's governor said Ukraine remained in control of an i… [+5633 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Rashi Hardaha", "title": "JEE Main 2022 Admit Card Soon; Know Exam Pattern, Preparation Tips", "description": "JEE Main 2022: The Joint Entrance Examination (JEE) Main 2022 admit card is expected to be released soon at jeemain.nta.nic.in.", "url": "https://www.ndtv.com/education/jee-main-2022-admit-card-soon-know-exam-pattern-preparation-tips-jeemain-nta-nic-in", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/6/11/shutterstock_1840982452_1.jpg", "publishedAt": "2022-06-12T06:09:31Z", "content": "JEE Main 2022: The Joint Entrance Examination (JEE) Main 2022 is approaching. The JEE Main 2022 session 1 exam is scheduled to be conducted between June 20 and June 29. The National Testing Agency (N… [+2448 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Farah Khan Says, \"Vicky Has Found Someone Else\". Katrina's Epic Reply", "description": "Farah Khan shared a picture with Vicky Kaushal", "url": "https://www.ndtv.com/entertainment/farah-khan-says-vicky-kaushal-has-found-someone-else-katrina-kaifs-epic-reply-3059854", "urlToImage": "https://c.ndtvimg.com/2022-06/vn3m30go_vicky-kaushal_625x300_12_June_22.jpg", "publishedAt": "2022-06-12T06:04:13Z", "content": "Katrina Kaif (L), Farah Khan with Vicky Kaushal (R). (courtesy: farahkhankunder) (courtesy: katrinakaif)\r\nNew Delhi: Katrina Kaif, Vicky Kaushal and Farah Khan are creating a heavy buzz on the intern… [+1552 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Johnny Depp's Lawyer Camille Vasquez Shuts Down Dating Rumors with Actor", "description": "Lawyer Camille Vasquez has denied rumours she and actor Johnny Depp are dating. She was one of Depp's lead attorneys during his six-week defamation trial against Amber Heard.", "url": "https://www.ndtv.com/world-news/johnny-depps-lawyer-camille-vasquez-shuts-down-dating-rumors-with-hollywood-actor-3059839", "urlToImage": "https://c.ndtvimg.com/2022-06/gb0gfafg_johnny-depp-camille-vasquez_625x300_03_June_22.jpg", "publishedAt": "2022-06-12T05:52:58Z", "content": "Ms Vasquez was recently made a partner at the Brown Rudnick law firm.\r\nLawyer Camille Vasquez has denied rumours she and actor Johnny Depp are dating. \r\nMs Vasquez was one of Mr Depp's lead attorneys… [+2156 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Tesla's China Output Decline Trending Deeper Than Elon Musk's Forecast", "description": "Production at Tesla Inc's Shanghai factory is on track to fall by over a third this quarter from the first three months of the year as China's zero-COVID lockdowns caused deeper disruptions to output than Elon Musk had predicted.", "url": "https://www.ndtv.com/business/teslas-china-output-decline-trending-deeper-than-elon-musks-forecast-3059827", "urlToImage": "https://c.ndtvimg.com/2022-06/epoj4qt8_reuters-image_625x300_12_June_22.jpg", "publishedAt": "2022-06-12T05:44:58Z", "content": "Tesla's China output decline trending deeper than Musk forecast; data and memos\r\nProduction at Tesla Inc's Shanghai factory is on track to fall by over a third this quarter from the first three month… [+3651 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Rashi Hardaha", "title": "BITSAT 2022: Last Date To Register Today; Direct Link, Steps To Apply", "description": "The BITSAT 2022 application form is available on the official website BITS Pilani. Candidates who have not applied yet can apply online at bitsadmission.com.", "url": "https://www.ndtv.com/education/bitsat-2022-last-date-register-today-direct-link-steps-to-apply-bitsadmission-com", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/6/11/shutterstock_434406454_2.jpg", "publishedAt": "2022-06-12T05:35:57Z", "content": "BITSAT 2022 Registration: The last day to apply for the for Birla Institute of Technology and Science Admission Test (BITSAT) 2022 is today, June 12. The BITSAT 2022 application form is available on … [+1475 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Vishesh Roy", "title": "\"IPL Generates More Revenue Than English Premier League\": Sourav Ganguly", "description": "BCCI President Sourav Ganguly has said that the Indian Premier League generates more revenue than football's English Premier League and he feels happy after seeing the game he loves evolving so much.", "url": "https://sports.ndtv.com/cricket/ipl-generates-more-revenue-than-english-premier-league-bcci-president-sourav-ganguly-3059808", "urlToImage": "https://c.ndtvimg.com/2021-12/vt076gao_sourav-ganguly_625x300_18_December_21.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-12T05:32:55Z", "content": "The Indian Premier League (IPL) is one of the fastest growing sports tournaments in the world and it enjoys a massive fan following. Every cricketer in the world looks to play in the tournament and f… [+2211 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Taiwan Says Won't \"Close Door To China\", Will Engage On Equal Basis", "description": "Taiwan does not want to close the door to China and is willing to engage in the spirit of goodwill, but on an equal basis and without political preconditions, Premier Su Tseng-chang said on Sunday.", "url": "https://www.ndtv.com/world-news/taiwan-says-wont-close-door-to-china-will-engage-on-equal-basis-3059807", "urlToImage": "https://c.ndtvimg.com/2022-06/o36b5u7_china-taiwan_625x300_12_June_22.jpg", "publishedAt": "2022-06-12T05:32:32Z", "content": "China has never renounced the use of force to bring Taiwan under its control. (Representational)\r\nSingapore: Taiwan does not want to close the door to China and is willing to engage in the spirit of … [+1878 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ananya Can't Stop Dancing In These Pics From KJo's Birthday Bash Prove It", "description": "Ananya Panday loves dancing and these pictures from Karan Johar's birthday party prove it", "url": "https://www.ndtv.com/entertainment/ananya-panday-can-t-stop-won-t-stop-dancing-and-she-has-pics-to-prove-it-3059801", "urlToImage": "https://c.ndtvimg.com/2022-06/9oa088j_ananya-panday_625x300_12_June_22.jpg", "publishedAt": "2022-06-12T05:31:51Z", "content": "Ananya Panday looking alluring in the picture. (courtesy: ananyapanday)\r\nAnanya Panday is one of the brightest young stars on the block with a well-rounded kitty of films and an enviable social media… [+1734 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rate Hikes Will Test The Buy Now Pay Later Business Model", "description": "Reduced consumer spending, rising interest rates and trickier credit conditions spell trouble for Buy Now Pay Later lenders, raising the prospect of consolidation in the sector.", "url": "https://www.ndtv.com/business/rate-hikes-will-test-the-buy-now-pay-later-business-model-3059794", "urlToImage": "https://c.ndtvimg.com/2022-06/pvpdn9g_reuters-image_625x300_12_June_22.jpg", "publishedAt": "2022-06-12T05:27:30Z", "content": "Buy Now Pay Later business model faces test as rates rise\r\nReduced consumer spending, rising interest rates and trickier credit conditions spell trouble for Buy Now Pay Later lenders, raising the pro… [+5578 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "War In Ukraine Hits Livelihood Of Lakhs Of Gujarat's Diamond Workers", "description": "The Russia-Ukraine war has adversely affected the livelihood of lakhs of workers of the diamond industry in Gujarat, especially in the Saurashtra region where many many units import small-size Russian diamonds for processing and polishing.", "url": "https://www.ndtv.com/india-news/russia-ukraine-war-war-in-ukraine-hits-livelihood-of-lakhs-of-gujarats-diamond-industry-workers-3059792", "urlToImage": "https://c.ndtvimg.com/2018-09/o1q6dpco_diamonds_625x300_19_September_18.jpg", "publishedAt": "2022-06-12T05:25:57Z", "content": "Some diamond units have cut working hours by 5-10 per cent, said a diamond trader. (Representational)\r\nAhmedabad: The Russia-Ukraine war has adversely affected the livelihood of lakhs of workers of t… [+3660 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Maintaining Good Relations In India And China's Interest: Chinese Minister", "description": "China and India are neighbours and maintaining a good relationship meets the interests of both countries, Chinese Defence Minister General Wei Fenghe said on Sunday, stressing that the two nations are working together for peace along the Line of Actu", "url": "https://www.ndtv.com/india-news/maintaining-good-relationship-meets-interests-of-both-india-and-china-chinese-defence-minister-3059783", "urlToImage": "https://c.ndtvimg.com/g6l5ouj4_chinese-defence-minister-wei-fenghe-reuters-650_625x300_19_August_18.jpg", "publishedAt": "2022-06-12T05:21:16Z", "content": "Wei Fenghe said that the two nations are working together for peace along the border.(File photo)\r\nSingapore: China and India are neighbours and maintaining a good relationship meets the interests of… [+2064 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "For India Cricket Rights, Media Giants In Pitch Battle", "description": "Disney, Sony and India's Reliance will vie on Sunday for media rights to Indian Premier League (IPL), the world's richest cricket league, expected to fetch up to $6 billion.", "url": "https://www.ndtv.com/business/for-india-cricket-rights-media-giants-in-pitch-battle-3059778", "urlToImage": "https://c.ndtvimg.com/2022-06/dp3a7qm_reuters-image_625x300_12_June_22.jpg", "publishedAt": "2022-06-12T05:15:41Z", "content": "Media giants in pitch battle for India cricket rights\r\nDisney, Sony and India's Reliance will vie on Sunday for media rights to Indian Premier League (IPL), the world's richest cricket league, expect… [+2816 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Government Loses $111 Million Gas Field Appeal Against Reliance, Shell", "description": "The government has lost its appeal in the English High Court against a $111 million arbitration award in favour of Reliance Industries Ltd and Shell in a cost recovery dispute in the western offshore Panna-Mukta and Tapti oil and gas fields.", "url": "https://www.ndtv.com/business/govt-loses-challenge-to-usd-111-mn-arbitration-award-in-dispute-with-reliance-shell-3059773", "urlToImage": "https://c.ndtvimg.com/2022-05/f0dioa5k_shell-logo_625x300_01_May_22.jpg", "publishedAt": "2022-06-12T05:13:30Z", "content": "Government loses $111 million arbitration challenge in dispute with Reliance/Shell\r\nNew Delhi: The government has lost its appeal in the English High Court against a $111 million arbitration award in… [+5397 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Shots Fired At Police In Search Operation In Delhi, 2 Injured", "description": "The Delhi Police conducted search operations in the Yamuna Khadar area in Delhi. After reaching the spot, around 4 to 5 persons opened fire at the police, 2 people were injured and 1 person was arrested in the operation.", "url": "https://www.ndtv.com/delhi-news/shots-fired-at-police-in-search-operation-in-delhis-yamuna-khadar-area-2-injured-1-arrested-3059762", "urlToImage": "https://c.ndtvimg.com/2019-05/fkcrjpmg_delhi-police-generic_625x300_27_May_19.jpg", "publishedAt": "2022-06-12T05:08:44Z", "content": "The police conducted the search operation based on a tip-off. (Representational)\r\nNew Delhi: With an aim to widen the preventive strategy, the police conducted search operations in the Yamuna Khadar … [+929 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Watch: Amitabh Bachchan's Question On GPS In Rs 2,000 Note Is A Throwback", "description": "The 2016 rumour about Rs 2,000 notes being embedded with GPS trackers has become the focal point in a promotional video for the new season of the popular gameshow Kaun Banega Crorepati.", "url": "https://www.ndtv.com/india-news/watch-amitabh-bachchans-question-on-gps-in-rs-2-000-note-is-a-throwback-3059756", "urlToImage": "https://c.ndtvimg.com/2022-06/ajcljac8_amitabh-bachchan_625x300_12_June_22.jpg", "publishedAt": "2022-06-12T05:00:58Z", "content": "Amitabh Bachchan is the host of the gameshow Kaun Banega Crorepati.\r\nThe 2016 rumour about Rs 2,000 notes being embedded with GPS trackers has become the focal point in a promotional video for the ne… [+2736 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Fuel Tax Cut Likely Eased Inflation In May, But Price Pressures Elevated", "description": "Surging retail inflation likely eased in May on lower fuel costs, but price pressures remain elevated, and the rate was expected to have held above the Reserve Bank of India's upper tolerance level of its 2-6 per cent target band for the fifth month in a row.", "url": "https://www.ndtv.com/business/fuel-tax-cut-likely-eased-inflation-in-may-but-price-pressures-elevated-3059753", "urlToImage": "https://c.ndtvimg.com/2021-12/37mj08fo_retail-inflation_625x300_09_December_21.jpg", "publishedAt": "2022-06-12T04:59:23Z", "content": "Retail inflation likely eased in May on fuel tax cut, but above RBI's target band\r\nSurging retail inflation likely eased in May on lower fuel costs, but price pressures remain elevated, and the rate … [+2644 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ink Attack In Delhi On Woman Who Accused Rajasthan Minister's Son Of Rape", "description": "A 23-year-old woman who levelled rape allegations against the son of Rajasthan minister was attacked with ink on a road in Delhi on Saturday, police officials told NDTV.", "url": "https://www.ndtv.com/delhi-news/ink-attack-in-delhi-on-woman-who-accused-rajasthan-minister-mahesh-joshis-son-of-rape-3059744", "urlToImage": "https://c.ndtvimg.com/2022-06/bqiglup8_ink-thrown-at-woman-who-accused-rajasthan-minister-of-rape-_625x300_12_June_22.jpg", "publishedAt": "2022-06-12T04:51:29Z", "content": "The woman was taken to AIIMS Trauma Center and thoroughly examined, the police officials said.\r\nNew Delhi: A 23-year-old woman who levelled rape allegations against the son of Rajasthan minister was … [+1512 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Siddhant's Latest Post Leaves Fans Guessing If He Is Talking About Navya", "description": "Siddhant Chaturvedi And Navya Nanda have a \"noodle\" connection", "url": "https://www.ndtv.com/entertainment/siddhant-chaturvedi-and-navya-nanda-s-insta-posts-spark-dating-rumours-heres-why-3059722", "urlToImage": "https://c.ndtvimg.com/2022-06/s7juh4u_siddhant_625x300_12_June_22.jpg", "publishedAt": "2022-06-12T04:29:29Z", "content": "Siddhant Chaturvedi shared a post. (courtesy: siddhantchaturvedi)\r\nBollywood actor Siddhant Chaturvedi has been the talk of the town ever since his debut in Gully Boy. Over the years, as the actor co… [+2447 chars]"}]}