{"status": "ok", "totalResults": 283, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Four European Gas Buyers Made Ruble Payments to Russia: Report", "description": "Four European gas buyers have already paid for supplies in rubles as President Vladimir Putin demanded, according to a person close to Russian gas giant Gazprom PJSC.", "url": "https://www.ndtv.com/world-news/four-european-gas-buyers-made-ruble-payments-to-russia-report-2927174", "urlToImage": "https://c.ndtvimg.com/2022-04/c9stai7g_russia-gas-exportbloomberg_625x300_28_April_22.jpg", "publishedAt": "2022-04-28T02:29:04Z", "content": "Russia supplies gas via pipelines to 23 European countries.\r\nFour European gas buyers have already paid for supplies in rubles as President Vladimir Putin demanded, according to a person close to Rus… [+1042 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Donald Trump Testifies That He Feared Being Hit By \"Very Dangerous\" Fruit", "description": "Ex-president Donald Trump testified under oath that he feared protesters would pelt him with \"very dangerous\" fruit like pineapples, tomatoes, and bananas saying: \"You can get killed with those things.\"", "url": "https://www.ndtv.com/world-news/donald-trump-testifies-that-he-feared-being-hit-by-very-dangerous-fruit-2927158", "urlToImage": "https://c.ndtvimg.com/2022-02/kr9u49fk_donald-trump-reuters_625x300_20_February_22.jpg", "publishedAt": "2022-04-28T01:51:03Z", "content": "\"Tomatoes are bad, by the way\" but \"some fruit is a lot worse,\" said Donald Trump.\r\nNew York: Ex-president Donald Trump testified under oath that he feared protesters would pelt him with \"very danger… [+2747 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Joe Biden To Meet PM Modi At Quad Summit In Japan Next Month: White House", "description": "US President Joe Biden will travel to South Korea and Japan next month and attend the QUAD summit in Tokyo, during which he will also meet India's Prime Minister Narendra Modi, the White House has said.", "url": "https://www.ndtv.com/india-news/us-president-joe-biden-to-meet-pm-modi-at-quad-summit-in-japan-next-month-white-house-2927155", "urlToImage": "https://c.ndtvimg.com/2022-03/hoptpbvo_narendra-modi-joe-biden-modi-biden-afp-file-photo_625x300_08_March_22.jpg", "publishedAt": "2022-04-28T01:44:06Z", "content": "Biden's trip to South Korea and Japan has been scheduled for May 20 to 24. (File)\r\nNew Delhi: US President Joe Biden will travel to South Korea and Japan next month and attend the QUAD summit in Toky… [+967 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US's Religious Freedom Report \"Indophobic, Hinduphobic\": Hindu Council", "description": "A Hindu body in Washington called the USCIRF report on religious freedom a work of a \"Hinduphobic\" commission while Muslim and Christian groups hailed the observations in it, demanding that the US declare India as a \"country of particular concern\".", "url": "https://www.ndtv.com/india-news/uss-religious-freedom-report-indophobic-hinduphobic-hindu-council-2927153", "urlToImage": "https://c.ndtvimg.com/2018-12/4mbce198_us-capitol-pixabay_625x300_22_December_18.jpg", "publishedAt": "2022-04-28T01:43:03Z", "content": "USCIRF religious freedom report recommended designating India as \"country of particular concern\"\r\nWashington: A Hindu body in Washington has called the USCIRF report on religious freedom a work of \"H… [+3688 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Judge Rejects Elon Musk's Bid To End Supervision Of 2018 Tesla Tweets", "description": "Twitter's new buyer Elon Musk still must have his tweets about his electric car company Tesla pre-approved after a US judge on Wednesday rejected an appeal to free him from oversight.", "url": "https://www.ndtv.com/world-news/us-judge-rejects-elon-musks-bid-to-end-supervision-of-2018-tesla-tweets-2927144", "urlToImage": "https://c.ndtvimg.com/2022-04/pg7khrag_elon-musk_650x400_26_April_22.jpg", "publishedAt": "2022-04-28T01:27:46Z", "content": "Elon Musk said he was forced to agree to the deal, and denies lying to shareholders.\r\nNew York: Twitter's new buyer Elon Musk still must have his tweets about his electric car company Tesla pre-appro… [+2694 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "PM Modi To Visit Assam Today To Launch Several Development Projects", "description": "Prime Minister Narendra Modi will be visiting Assam today where he will lay the foundation stone for several projects.", "url": "https://www.ndtv.com/india-news/pm-modi-to-visit-assam-today-to-launch-several-development-projects-2927129", "urlToImage": "https://c.ndtvimg.com/2022-04/66ppvnf_pm-modi-ani-650_625x300_10_April_22.jpg", "publishedAt": "2022-04-28T01:12:59Z", "content": "PM Modi will also lay the foundation stone of various projects in the education sector in Assam today.\r\nNew Delhi: Prime Minister Narendra Modi will be visiting Assam today where he will lay the foun… [+2650 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Crude Oil Nudges Slightly Lower On China COVID Worries", "description": "Oil prices edged lower in early Asian trade on Thursday as concerns about rising coronavirus cases in China, the world's biggest oil importer, weighed on futures markets.", "url": "https://www.ndtv.com/business/oil-edges-lower-as-mass-covid-testing-begins-in-china-2927118", "urlToImage": "https://c.ndtvimg.com/2022-03/us4sio3g_crude-oil_625x300_02_March_22.jpg", "publishedAt": "2022-04-28T00:55:41Z", "content": "Oil Prices Today: Crude edges lower as mass COVID testing begins in China\r\nOil prices edged lower in early Asian trade on Thursday as concerns about rising coronavirus cases in China, the world's big… [+1389 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "White House Says Biden To Travel To South Korea, Japan Next Month", "description": "US President Joe Biden will travel to South Korea and Japan in May, the White House announced Wednesday, paying a visit to two of Washington's main Asian allies amid tensions with rival China and regional foe North Korea.", "url": "https://www.ndtv.com/world-news/white-house-says-biden-to-travel-to-south-korea-japan-in-may-2927109", "urlToImage": "https://c.ndtvimg.com/2022-02/jf0i0mi4_joe-biden_625x300_25_February_22.jpg", "publishedAt": "2022-04-28T00:44:29Z", "content": "Biden's visit will come after a US-ASEAN special summit of South Asian leaders from May 12-13.\r\nWashington: US President Joe Biden will travel to South Korea and Japan in May, the White House announc… [+1758 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine War-Led Higher Inflation To Knock Down Global Economy: Report", "description": "The global economy will expand more slowly than predicted three months ago, according to Reuters polls of over 500 economists, who said higher commodity prices and an escalation in the Russia-Ukraine war could prompt another downgrade.", "url": "https://www.ndtv.com/business/global-growth-to-slow-as-inflation-bites-reuters-poll-2927095", "urlToImage": "https://c.ndtvimg.com/2022-03/p7v2ev64_russia-strikes-ukraine-russia-ukraine-war-reuters_625x300_03_March_22.jpg", "publishedAt": "2022-04-28T00:18:27Z", "content": "Global growth to slow as inflation bites, a Reuters of 500 economists showed: Report\r\nBENGALURU: The global economy will expand more slowly than predicted three months ago, according to Reuters polls… [+4346 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE: India Records Nearly 3,000 New Covid Cases In 24 Hours", "description": "India reported at least 2,927 new coronavirus cases in the last 24 hours, taking the total number of infections to 4,30,65,496. According to the Union Health Ministry, the active cases increased to 16,279,", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-april-28-2927092", "urlToImage": "https://c.ndtvimg.com/2022-04/iptdjlsg_coronavirus-india-pti-pic_650x400_20_April_22.jpg", "publishedAt": "2022-04-28T00:15:06Z", "content": "India COVID-19 Live: India reported 32 deaths on Wednesday.\r\nIndia reported at least 2,927 new coronavirus cases in the last 24 hours, taking the total number of infections to 4,30,65,496. According … [+441 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "India Developed Ties With Russia As US Couldn't Do It Earlier: Blinken", "description": "Asserting that now there is a growing strategic convergence between the United States and India, Secretary of State Antony Blinken said New Delhi built its partnership with Moscow out of necessity as the US was not in a position to do that earlier.", "url": "https://www.ndtv.com/world-news/india-developed-ties-with-russia-as-us-couldnt-do-it-earlier-antony-blinken-2927089", "urlToImage": "https://c.ndtvimg.com/2022-04/j1j3oje_antony-blinken-afp_625x300_12_April_22.jpg", "publishedAt": "2022-04-28T00:02:33Z", "content": "Blinken said US President Biden has spent a lot of time directly engaging with PM Modi.\r\nWashington: Asserting that now there is a growing strategic convergence between the United States and India, S… [+2110 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Goa Urges Citizens To Continue Wearing Masks As Covid Cases Rise", "description": "In wake of rising cases of COVID-19, the Goa government on Wednesday advised citizens to continue wearing masks and follow Covid appropriate behaviour.", "url": "https://www.ndtv.com/india-news/goa-urges-citizens-to-continue-wearing-masks-as-covid-cases-rise-2927082", "urlToImage": "https://c.ndtvimg.com/2022-01/t7hsfnbo_covid-masks_625x300_06_January_22.jpg", "publishedAt": "2022-04-27T23:46:45Z", "content": "Goa COVID-19: So far 3,832 people have died due to coronaviru in Goa.\r\nPanaji: In wake of rising cases of COVID-19, the Goa government on Wednesday advised citizens to continue wearing masks and foll… [+1759 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Congress Leader Seeks Clear Definition Of Uniform Civil Code From Centre", "description": "Amid the debate over Uniform Civil Code (UCC) in the country, Senior Congress leader and former union minister Salman Khurshid on Wednesday said the government should clearly give the definition of UCC.", "url": "https://www.ndtv.com/india-news/congress-leader-salman-khurshid-seeks-clear-definition-of-uniform-civil-code-from-centre-2927063", "urlToImage": "https://c.ndtvimg.com/2019-06/pfkj2d6_salman-khurshid-pti_625x300_03_June_19.jpg", "publishedAt": "2022-04-27T23:16:33Z", "content": "\"They should tell what is the definition of Uniform Civil Code then only we can react,\" Mr Khurshid said.\r\nNew Delhi: Amid the debate over Uniform Civil Code (UCC) in the country, Senior Congress lea… [+3018 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia's Invasion In Ukraine Is \"Genocide\", Canada's Parliament Votes", "description": "Canadian lawmakers voted unanimously on Wednesday to call Russia's attacks in Ukraine a \"genocide\", with members of parliament saying there was \"ample evidence of systemic and massive war crimes against humanity\" being committed by Moscow.", "url": "https://www.ndtv.com/world-news/russias-invasion-in-ukraine-is-genocide-canadas-parliament-votes-2927058", "urlToImage": "https://c.ndtvimg.com/2020-05/n7dooq1_canada-parliament-goes-virtual_625x300_17_May_20.jpg", "publishedAt": "2022-04-27T22:44:28Z", "content": "Earlier this month, Canadian PM Trudeau termed Russian assault in Ukraine a \"Genocide.\"\r\nOttawa: Canadian lawmakers voted unanimously on Wednesday to call Russia's attacks in Ukraine a \"genocide\", wi… [+1780 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Central African Republic Adopts Bitcoin As An Official Currency", "description": "Central African Republic has adopted bitcoin as an official currency, the presidency said on Wednesday, becoming the first country in Africa and only the second in the world to do so.", "url": "https://www.ndtv.com/world-news/central-african-republic-adopts-bitcoin-as-an-official-currency-2927051", "urlToImage": "https://c.ndtvimg.com/2022-04/gh7c2if_bitcoin_625x300_19_April_22.jpg", "publishedAt": "2022-04-27T22:20:26Z", "content": "A bill governing the use of cryptocurrency was adopted unanimously by parliament last week.\r\nBangui: Central African Republic has adopted bitcoin as an official currency, the presidency said on Wedne… [+2071 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Scrap Cess So We Can Give Petrol At Rs 70: Telangana Minister To Centre", "description": "Lashing out at the Centre for asking the States to reduce VAT (value-added tax) on fuel, Telangana Industry and Commerce Minister KT Rama Rao on Wednesday demanded the central government to scrap the Cess on petrol and diesel across the country.", "url": "https://www.ndtv.com/india-news/scrap-cess-so-we-can-give-petrol-at-rs-70-telangana-minister-kt-rama-rao-to-centre-2927044", "urlToImage": "https://c.ndtvimg.com/2020-04/fvsfsat_kt-rama-rao_650x400_07_April_20.jpg", "publishedAt": "2022-04-27T21:59:40Z", "content": "Fuel prices have shot up because of NPA (non-performing asset) Central government, said Telangana's KTR.\r\nHyderabad: Lashing out at the Centre for asking the States to reduce VAT (value-added tax) on… [+2452 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Launched Hundreds Of Cyberattacks Against Ukraine, Microsoft Claims", "description": "A handful of hacker groups aligned with the Russian government have carried out hundreds of cyberattacks against Ukraine since Moscow invaded, US tech giant Microsoft said in a report Wednesday.", "url": "https://www.ndtv.com/world-news/russia-launched-hundreds-of-cyberattacks-against-ukraine-microsoft-says-2927043", "urlToImage": "https://c.ndtvimg.com/2021-03/e3bu6b4_microsoft-650_625x300_23_March_21.jpeg", "publishedAt": "2022-04-27T21:35:24Z", "content": "Microsoft's report says that Russia often matches cyberattacks with military assaults on the battlefield.\r\nWashington: A handful of hacker groups aligned with the Russian government have carried out … [+2355 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Zelensky Welcomes EU Plans To Suspend Import Duties On Ukrainian Exports", "description": "Ukrainian President Volodymyr Zelensky on Wednesday welcomed EU plans to suspend import duties on Ukrainian goods, saying the move will help \"maintain\" Kyiv's economy, hard-hit by Russia's devastating invasion.", "url": "https://www.ndtv.com/world-news/russia-ukraine-crisis-volodymyr-zelensky-welcomes-eu-plans-to-suspend-import-duties-on-ukrainian-exports-2927030", "urlToImage": "https://c.ndtvimg.com/2022-04/o6tn4et4_ukrainian-president-volodymyr-zelensky_625x300_02_April_22.jpg", "publishedAt": "2022-04-27T21:15:03Z", "content": "The Ukrainian leader said he expected more countries to liberalise Ukrainian exports \"soon\".\r\nKyiv: Ukrainian President Volodymyr Zelensky on Wednesday welcomed EU plans to suspend import duties on U… [+1541 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Israeli Forces Kill Palestinian In Latest West Bank Raid", "description": "Israeli forces killed a Palestinian man in the West Bank flashpoint city of Jenin Wednesday, in what the army called its latest \"counterterrorism\" raid following a series of attacks in Israel since late March.", "url": "https://www.ndtv.com/world-news/israeli-forces-kill-palestinian-in-latest-west-bank-raid-2927027", "urlToImage": "https://i.ndtvimg.com/i/2017-12/west-bank-afp_650x400_81512735889.jpg", "publishedAt": "2022-04-27T20:57:28Z", "content": "The Israeli army said 12 people were arrested in the overnight raids at several West Bank locations.\r\nJenin, Palestine: Israeli forces killed a Palestinian man in the West Bank flashpoint city of Jen… [+4401 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Centre Earned Rs 26 Lakh Crore From Excise Duty In 8 Years: Ashok Gehlot", "description": "As PM Narendra Modi flagged higher fuel prices in many opposition-ruled states including Rajasthan, CM Ashok Gehlot said the PM \"by mistake instead of saying Bhopal, mentioned Jaipur\" as petrol and diesel cost more in BJP-ruled Madhya Pradesh.", "url": "https://www.ndtv.com/india-news/fuel-prices-centre-earned-about-26-lakh-crore-by-taxing-petrol-diesel-ashok-gehlot-2927018", "urlToImage": "https://c.ndtvimg.com/2019-07/p3aujdu8_ashok-gehlot-pti_625x300_10_July_19.jpg", "publishedAt": "2022-04-27T20:40:04Z", "content": "Ashok Gehlot claimed the Centre has earned about Rs 26 lakh crore from excise duty in 8 years.\r\nJaipur: As Prime Minister Narendra Modi flagged higher fuel prices in many opposition-ruled states incl… [+4089 chars]"}]}