{"status": "ok", "totalResults": 535, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Biden Not In Mood To Remove Iran's Revolutionary Guards From Terror List", "description": "US President Joe Biden seems increasingly determined to keep the \"terrorist\" designation on Iran's Revolutionary Guards, which Tehran is demanding be removed before it returns to a deal on curbing its nuclear program.", "url": "https://www.ndtv.com/world-news/us-president-joe-biden-reluctant-to-remove-irans-revolutionary-guards-from-terror-list-2902617", "urlToImage": "https://c.ndtvimg.com/4gds63j_iran-revolutionary-guards-reuters_625x300_02_August_18.jpg", "publishedAt": "2022-04-20T02:08:42Z", "content": "Biden wants Iran to return to the agreement, provided that Iran resumes those commitments. (File)\r\nWashington: US President Joe Biden seems increasingly determined to keep the \"terrorist\" designation… [+4363 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "China Signs Pact With Solomon Islands Despite US Warning", "description": "China and the Solomon Islands have signed a framework agreement on security cooperation, Chinese Foreign Ministry Spokesman Wang Wenbin said on Tuesday.", "url": "https://www.ndtv.com/world-news/china-signs-controversial-security-agreement-with-solomon-islands-despite-us-warning-2902605", "urlToImage": "https://c.ndtvimg.com/2022-04/el1s2shg_solomon-islands-pm-manasseh-sogavare-and-chinese-premier-li-keqiangreuters_625x300_01_April_22.jpg", "publishedAt": "2022-04-20T01:37:20Z", "content": "Earlier, the US had raised concerns over a draft China-Solomon Islands security accord. (File)\r\nBeijing: China and the Solomon Islands have signed a framework agreement on security cooperation, Chine… [+1965 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Sets New Deadline For Ukraine Army To Surrender In Mariupol", "description": "Russia told Ukrainian fighters still holding out in Mariupol to give up on Wednesday as it pushed for a decisive victory in its new eastern offensive, prompting Western governments to pledge more military help to Kyiv.", "url": "https://www.ndtv.com/world-news/russia-sets-new-deadline-for-ukraine-army-to-surrender-in-mariupol-2902576", "urlToImage": "https://i.ndtvimg.com/i/2015-02/mariupol-town-ukraine_650x400_61424954519.jpg", "publishedAt": "2022-04-20T00:56:05Z", "content": "Russian Foreign Minister Sergei Lavrov confirmed that \"another stage of this operation is beginning\".\r\nKyiv: Russia told Ukrainian fighters still holding out in Mariupol to give up on Wednesday as it… [+5773 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE: India Reports 1,247 New Covid Cases In 24 Hours", "description": "India on Tuesday reported 1,247 new Covid cases - a 43 per cent decline from yesterday. According to the Union Ministry of Health and Family Welfare, the country's active caseload stood at 11,860.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-april-20-2902559", "urlToImage": "https://c.ndtvimg.com/2021-04/q6bsvdss_covid-india-afp_625x300_24_April_21.jpg", "publishedAt": "2022-04-20T00:16:40Z", "content": "India COVID-19 Live Updates: 928 Covid patients recovered from the disease in the last 24 hours.\r\nNew Delhi: India on Tuesday reported 1,247 new Covid cases - a 43 per cent decline from yesterday. Ac… [+511 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Mosques Must Take Permission For Loudspeakers: Muslim Body In Maharashtra", "description": "Amid a row over the use of loudspeakers near mosques, the Jamiat-Ulama-i-Hind unit in Maharashtra appealed to all mosques in the state to take permission from the state government in this regard.", "url": "https://www.ndtv.com/india-news/maharashtra-mosque-loudspeakers-row-top-muslim-body-urges-mosques-to-take-permission-for-using-loudspeakers-2902550", "urlToImage": "https://c.ndtvimg.com/loudspeakers-generic-pixabay-650_625x300_1527530964626.jpg", "publishedAt": "2022-04-19T23:59:44Z", "content": "\"The police in the state is very cooperative,\" Mr Azami.\r\nMumbai: Amid a row over the use of loudspeakers near mosques, the Jamiat-Ulama-i-Hind unit in Maharashtra appealed to all mosques in the stat… [+1437 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Court Asks Bengal Government To Submit Status Reports In 5 Rape Cases", "description": "The Calcutta High Court on Tuesday directed the West Bengal government to produce before it progress reports and case diaries of five recent cases of rape, gang rape and attempts to rape in different parts of the state.", "url": "https://www.ndtv.com/india-news/calcutta-high-court-asks-bengal-government-to-submit-status-report-in-5-rape-cases-2902539", "urlToImage": "https://i.ndtvimg.com/i/2016-04/calcutta-high-court_650x400_61461086401.jpg", "publishedAt": "2022-04-19T23:20:27Z", "content": "The court also asked the government to provide security to the complainants and their families.\r\nKolkata: The Calcutta High Court on Tuesday directed the West Bengal government to produce before it p… [+1747 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Biden To Announce Another Large Military Aid Package For Ukraine: Report", "description": "U.S. President Joe Biden is expected to announce within the coming days another military aid package for Ukraine about the same size as the $800 million one announced last week, multiple sources familiar with the matter said on Tuesday.", "url": "https://www.ndtv.com/world-news/biden-to-announce-another-large-military-aid-package-for-ukraine-report-2902534", "urlToImage": "https://c.ndtvimg.com/2022-02/0la501l_us-president-joe-biden-650-afp_650x400_23_February_22.jpg", "publishedAt": "2022-04-19T23:06:01Z", "content": "The Biden administration last week announced $800 million in additional military aid to Ukraine.\r\nWashington: U.S. President Joe Biden is expected to announce within the coming days another military … [+932 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "European Countries Call For Immediate End To Jerusalem Unrest At UN", "description": "Five European countries called Tuesday for an end to clashes in Jerusalem following a weekend of violence surrounding a holy site, in a joint statement issued after an emergency closed-door UN Security Council session.", "url": "https://www.ndtv.com/world-news/european-countries-call-for-immediate-end-to-jerusalem-unrest-at-un-2902533", "urlToImage": "https://c.ndtvimg.com/2022-04/qnlmka0g_alaqsa-mosque-clash-jerusalem-israel-afp-650_625x300_15_April_22.jpg", "publishedAt": "2022-04-19T22:54:49Z", "content": "\"Violence needs to stop immediately,\" the five European countries said in a statement.\r\nUnited Nations: Five European countries called Tuesday for an end to clashes in Jerusalem following a weekend o… [+1417 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Urges Israel, Palestine To \"End Cycle Of Violence\"", "description": "US Secretary of State Antony Blinken urged Israeli and Palestinian leaders Tuesday to \"end the cycle of violence\" after a sharp escalation in tensions between the two sides in recent days.", "url": "https://www.ndtv.com/world-news/us-secretary-of-state-antony-blinken-urges-israel-palestine-to-end-cycle-of-violence-2902526", "urlToImage": "https://c.ndtvimg.com/2021-09/smc741gk_antony-blinken-afp_625x300_24_September_21.jpg", "publishedAt": "2022-04-19T22:43:03Z", "content": "Earlier, Israel on Tuesday carried out strikes in the Gaza Strip after a rocket was fired by Hamas.\r\nWashington: US Secretary of State Antony Blinken urged Israeli and Palestinian leaders Tuesday to … [+533 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Netflix Loses 200,000 Subscribers In Less Than 100 Days. Here's Why", "description": "Netflix shares lost a quarter of their value Tuesday after the company revealed its ranks of subscribers shrank in the first quarter of this year.", "url": "https://www.ndtv.com/world-news/netflix-loses-200-000-subscribers-in-less-than-100-days-heres-why-2902525", "urlToImage": "https://c.ndtvimg.com/2020-09/n00a8ep_netflix-generic-tv-generic_625x300_09_September_20.jpg", "publishedAt": "2022-04-19T22:30:06Z", "content": "\"We're not growing revenue as fast as we'd like,\" Netflix said in an earnings letter.\r\nSan Francisco: Netflix shares lost a quarter of their value Tuesday after the company revealed its ranks of subs… [+2240 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "3 Killed, 19 Injured In Bar Attack In Nigeria: Police", "description": "An explosive device went off in a bar in Nigeria's northeastern Taraba state on Tuesday, killing three people and injuring 19, police told AFP.", "url": "https://www.ndtv.com/world-news/3-killed-19-injured-in-bar-attack-in-nigeria-police-2902516", "urlToImage": "https://i.ndtvimg.com/i/2018-03/police-generic-international-afp_650x400_41520126059.jpg", "publishedAt": "2022-04-19T22:00:05Z", "content": "Authorities blamed jihadists and bandits for the bar attack. (Representational)\r\nKano, Nigeria: An explosive device went off in a bar in Nigeria's northeastern Taraba state on Tuesday, killing three … [+1596 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Biden Says He Does Not Know If He Will Visit Ukraine Amid War", "description": "U.S. President Joe Biden said on Tuesday that he does not know if he will travel to Kyiv after Ukraine's wartime leader called on him to visit.", "url": "https://www.ndtv.com/world-news/us-president-joe-biden-says-he-does-not-know-if-he-will-visit-ukraine-amid-war-2902511", "urlToImage": "https://c.ndtvimg.com/2021-11/o825fakg_biden-afp_625x300_01_November_21.jpg", "publishedAt": "2022-04-19T21:52:36Z", "content": "Earlier, the White House had said that Biden has \"no plans\" to visit Ukraine.\r\nWashington: U.S. President Joe Biden said on Tuesday that he does not know if he will travel to Kyiv after Ukraine's war… [+1314 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine Gets Fighter Planes From US As Russia Intensifies Attack", "description": "Ukraine's military has received additional aircraft as well parts for repairs to get damaged aircraft flying again, the Pentagon said on Tuesday.", "url": "https://www.ndtv.com/world-news/ukraine-gets-fighter-planes-from-us-as-russia-intensifies-attack-2902510", "urlToImage": "https://c.ndtvimg.com/2022-04/mindrbs8_ukraine-war_625x300_08_April_22.jpg", "publishedAt": "2022-04-19T21:42:18Z", "content": "Pentagon said that Ukraine had now more operable fighter aircraft than it had two weeks ago.\r\nWashington: Ukraine's military has received additional aircraft as well parts for repairs to get damaged … [+1563 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US, Allies Vow More Russian Sanctions As Ukraine War Enters New Phase", "description": "The United States and allies agreed to impose more sanctions on Moscow on Tuesday as Russia pushed ahead with its new offensive targeting eastern Ukraine in the latest phase of the bloody invasion.", "url": "https://www.ndtv.com/world-news/us-allies-vow-more-russian-sanctions-as-ukraine-war-enters-new-phase-2902499", "urlToImage": "https://c.ndtvimg.com/2022-04/b4tkgko8_ukraine-war_625x300_19_April_22.jpg", "publishedAt": "2022-04-19T21:24:14Z", "content": "\"We will further tighten our sanctions against Russia,\" European Commission chief said.\r\nKramatorsk, Ukraine: The United States and allies agreed to impose more sanctions on Moscow on Tuesday as Russ… [+5066 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Bans Anti-Satellite Missile Tests To Cut \"Dangerous\" Space Debris", "description": "The United States announced a commitment to stop testing anti-satellite missiles that generate dangerous debris in space, a measure described Tuesday as \"an important step\" by the head of NASA.", "url": "https://www.ndtv.com/world-news/us-bans-anti-satellite-missile-tests-to-cut-dangerous-space-debris-2902484", "urlToImage": "https://c.ndtvimg.com/2018-11/gfivqjc8_international-space-station-afp_625x300_01_November_18.jpg", "publishedAt": "2022-04-19T21:08:55Z", "content": "The United States has become first country to make such a pledge. (File)\r\nWashington: The United States announced a commitment to stop testing anti-satellite missiles that generate dangerous debris i… [+1831 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "In Tit-For-Tat Move, Russia Expelling Over 30 European Diplomats", "description": "Russia said Tuesday it was expelling 31 diplomats from three European countries in a tit-for-tat move sparked by its military operation in Ukraine.", "url": "https://www.ndtv.com/world-news/russia-expelling-over-30-european-diplomats-amid-ukraine-war-2902476", "urlToImage": "https://c.ndtvimg.com/2022-04/dltv7e5_vladimir-putin-afp-photo_625x300_19_April_22.jpg", "publishedAt": "2022-04-19T20:32:01Z", "content": "Moscow also gave four Austrian diplomats until Sunday to leave.\r\nMoscow: Russia said Tuesday it was expelling 31 diplomats from three European countries in a tit-for-tat move sparked by its military … [+1926 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Fake Fuel Plant Busted In Haryana, 2 Arrested", "description": "Haryana Police busted a fake fuel manufacturing unit in Sirsa district and arrested two persons on Tuesday.", "url": "https://www.ndtv.com/india-news/fake-diesel-plant-busted-in-haryanas-sirsa-2-arrested-2902452", "urlToImage": "https://i.ndtvimg.com/i/2016-05/arrest-generic_650x400_71463458726.jpg", "publishedAt": "2022-04-19T20:15:55Z", "content": "Police seized around 75,500 litres of fake diesel from the site. (Representational)\r\nSirsa, Haryana: Haryana Police busted a fake fuel manufacturing unit in Sirsa district and arrested two persons on… [+824 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "7 Killed, 21 Injured In Russian Shelling In Ukraine's Kharkiv", "description": "At least three people were killed and 21 were injured in new Russian shelling on Ukraine's second city of Kharkiv Tuesday, local authorities said.", "url": "https://www.ndtv.com/world-news/7-killed-21-injured-in-russian-shelling-in-ukraines-kharkiv-2902424", "urlToImage": "https://c.ndtvimg.com/2022-03/2sgul3vo_ukraine-war-kharkiv-afp-650_625x300_06_March_22.jpg", "publishedAt": "2022-04-19T19:46:58Z", "content": "The intensity of the shelling of Kharkiv has increased, the local authorities said.\r\nKyiv: At least three people were killed and 21 were injured in new Russian shelling on Ukraine's second city of Kh… [+1285 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sri Lanka: Curfew Imposed in Rambukkana As Police Clash With Protesters", "description": "Sri Lanka police imposed a curfew in the Rambukkana Police Division until further notice following unrest in the country with the clash between protesters and police in the city.", "url": "https://www.ndtv.com/world-news/sri-lanka-economic-crisis-curfew-imposed-in-rambukkana-as-police-clash-with-protesters-2902417", "urlToImage": "https://c.ndtvimg.com/2022-04/dlbq6jo8_sri-lanka-police_625x300_19_April_22.jpg", "publishedAt": "2022-04-19T19:29:56Z", "content": "Sri Lanka: Earlier, 1 person died by the gunshot after clash with police in Rambukkana. (File)\r\nColombo: Sri Lanka police imposed a curfew in the Rambukkana Police Division until further notice follo… [+1797 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Biden Says US Will Send More Artillery To Ukraine To Fight Against Russia", "description": "The United States will send more artillery to Ukraine, U.S. President Joe Biden told reporters on Tuesday, following his call earlier with allied leaders over Russia's invasion.", "url": "https://www.ndtv.com/world-news/us-president-joe-biden-says-us-will-send-more-artillery-to-ukraine-to-fight-against-russia-2902387", "urlToImage": "https://c.ndtvimg.com/2022-03/6dp1afqo_joe-biden-in-warsaw-afp-650_625x300_26_March_22.jpg", "publishedAt": "2022-04-19T19:03:24Z", "content": "Last week, Biden had announced $800 million in new military aid to Ukraine.\r\nWashington: The United States will send more artillery to Ukraine, U.S. President Joe Biden told reporters on Tuesday, fol… [+460 chars]"}]}