{"status": "ok", "totalResults": 543, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Setting Record Straight: Russian Opera Star Tunes Out Row Over Putin Ties", "description": "Russian superstar soprano Anna Netrebko on Wednesday condemned the war in Ukraine and said she would return to the stage after canceling concerts in the wake of criticism that she was close to the Kremlin.", "url": "https://www.ndtv.com/world-news/russian-soprano-anna-netrebko-setting-record-straight-russian-opera-star-tunes-out-row-over-putin-ties-2853633", "urlToImage": "https://c.ndtvimg.com/2022-03/9u8i0s1g_anna-netrebko_625x300_31_March_22.jpg", "publishedAt": "2022-03-31T02:07:40Z", "content": "Russia-Ukraine War: Russian superstar soprano Anna Netrebko condemned war in Ukraine.\r\nVienna, Austria: Russian superstar soprano Anna Netrebko on Wednesday condemned the war in Ukraine and said she … [+2726 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Looking At Options For More Sanctions On Russia: White House", "description": "The United States is looking at options to expand sanctions to impose on Russia over its invasion of Ukraine and will have more to say about it in the coming days, White House spokesperson Kate Bedingfield said on Wednesday.", "url": "https://www.ndtv.com/world-news/us-looking-at-options-for-more-sanctions-on-russia-over-ukraine-white-house-2853632", "urlToImage": "https://c.ndtvimg.com/2022-03/r2rjcr2_ukraine-war-reuters_625x300_26_March_22.jpg", "publishedAt": "2022-03-31T02:07:34Z", "content": "Biden has imposed a wide variety of economic penalties aimed at punishing Russia.\r\nWashington: The United States is looking at options to expand sanctions to impose on Russia over its invasion of Ukr… [+497 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "2 Killed In Shooting At McDonald's Restaurant In Netherlands", "description": "Two people were killed after a gunman opened fire in a McDonald's restaurant in the northern Dutch city of Zwolle on Wednesday, police and local media said.", "url": "https://www.ndtv.com/world-news/2-killed-in-shooting-at-mcdonalds-restaurant-in-netherlands-zwolle-city-2853629", "urlToImage": "https://i.ndtvimg.com/i/2018-03/police-generic-international-afp_650x400_41520126059.jpg", "publishedAt": "2022-03-31T01:56:30Z", "content": "Police said they were looking for witnesses and the search for the gunman continued. (Representational)\r\nThe Hague, Netherlands: Two people were killed after a gunman opened fire in a McDonald's rest… [+1317 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Repositioning Forces Around Ukraine's Capital But...: US' Warning", "description": "Russia has started to reposition under 20% of the forces arrayed around Ukraine's capital Kyiv, the Pentagon said on Wednesday, but cautioned Russia was expected to refit and resupply them for redeployment, and not bring the forces home.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-russia-repositioning-forces-around-ukraines-capital-but-us-warning-2853491", "urlToImage": "https://c.ndtvimg.com/2022-03/rlgbtin_kyiv-ukraine-reuters_625x300_22_March_22.jpg", "publishedAt": "2022-03-31T01:56:07Z", "content": "Russia-Ukraine War: US said some Russian forces may have already moved into Belarus.\r\nWashington: Russia has started to reposition under 20% of the forces arrayed around Ukraine's capital Kyiv, the P… [+441 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Ukraine War Live Updates: Russia-Ukraine Will Resume Talks On Thursday", "description": "Russia's invasion of its neighbour, now in its fifth week, has driven around a quarter of Ukrainians from their homes and brought Russian-Western tensions to their worst point since the Cold War.", "url": "https://www.ndtv.com/world-news/ukraine-war-live-updates-russia-ukraine-will-resume-peace-talks-on-thursday-2853611", "urlToImage": "https://c.ndtvimg.com/2022-03/84ldh8vg_ukraine-war_625x300_31_March_22.jpg", "publishedAt": "2022-03-31T01:10:34Z", "content": "Tough resistance by Ukrainian forces has prevented Russia from capturing any major city,\r\nNew Delhi: Russia's invasion of its neighbour, now in its fifth week, has driven around a quarter of Ukrainia… [+995 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Petrol, Diesel Prices Hiked By Nearly A Rupee, 9th Rise In 10 Days", "description": "Petrol and diesel prices were today hiked by 80 paise a litre each, taking the total increase in rates in the last ten days to Rs 6.40 per litre.", "url": "https://www.ndtv.com/india-news/petrol-diesel-prices-hiked-by-nearly-a-rupee-a-litre-each-9th-increase-in-10-days-2853608", "urlToImage": "https://c.ndtvimg.com/2022-03/b6vv2n7g_petrol-prices_625x300_23_March_22.jpg", "publishedAt": "2022-03-31T00:53:57Z", "content": "Petrol Diesel Rates: Rates have been increased across the country and vary from state to state.\r\nNew Delhi: Petrol and diesel prices were today hiked by 80 paise a litre each, taking the total increa… [+659 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE: India Records Over 1,200 New COVID-19 Cases In 24 Hours", "description": "India on Wednesday reported 1,233 new COVID-19 cases, bringing the total number of infections to 4,30,23,215. The country also reported 31 Covid-related deaths in the last 24 hours, taking the death count to 5,21,070.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-31-march-2022-2853604", "urlToImage": "https://c.ndtvimg.com/2021-12/poj0l18_delhi-covid-testing-pti-650_650x400_31_December_21.jpg", "publishedAt": "2022-03-31T00:33:53Z", "content": "New Delhi: India on Wednesday reported 1,233 new COVID-19 cases, bringing the total number of infections to 4,30,23,215. The country also reported 31 Covid-related deaths in the last 24 hours, taking… [+428 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine Preparing For New Russian Offensive In Donbas: Volodymyr Zelensky", "description": "Ukrainian forces are preparing for new Russian attacks in the east of the country as Moscow builds up its troops there after suffering setbacks near the capital Kyiv, President Volodymyr Zelenskiy said on Thursday.", "url": "https://www.ndtv.com/world-news/ukraine-preparing-for-new-russian-offensive-in-donbas-volodymyr-zelensky-2853601", "urlToImage": "https://c.ndtvimg.com/2022-03/cum1c3oo_ukraine-war-afp_625x300_22_March_22.jpg", "publishedAt": "2022-03-31T00:21:32Z", "content": "Russian forces have taken half of the strategic port city, an adviser to Zelensky said.\r\nKyiv: Ukrainian forces are preparing for new Russian attacks in the east of the country as Moscow builds up it… [+5053 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Biden Says US \"Stands Firmly\" With Israel After Series Of Terror Attacks", "description": "President Joe Biden told Israeli Prime Minister Naftali Bennet Wednesday that the United States \"stands firmly and resolutely with Israel\" following a recent spate of attacks that has seen 11 people die in one week.", "url": "https://www.ndtv.com/world-news/president-joe-biden-says-us-stands-firmly-with-israel-after-series-of-terror-attacks-2853593", "urlToImage": "https://c.ndtvimg.com/2022-03/6dp1afqo_joe-biden-in-warsaw-afp-650_625x300_26_March_22.jpg", "publishedAt": "2022-03-30T23:56:21Z", "content": "A recent spate of attacks that has seen 11 people die in one week.\r\nWashington: President Joe Biden told Israeli Prime Minister Naftali Bennet Wednesday that the United States \"stands firmly and reso… [+493 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Goa Chief Minister Allocates Funds For Free LPG Cylinders", "description": "Newly-elected Goa Chief Minister Pramod Sawant on Wednesday presented the state Budget for 2022-23 in the legislative assembly and allocated an amount of Rs 40 crore for providing three LPG cylinders free of cost to the people of the state.", "url": "https://www.ndtv.com/india-news/goa-chief-minister-pramod-sawant-allocates-funds-for-free-lpg-cylinders-2853588", "urlToImage": "https://c.ndtvimg.com/2022-03/4eughla8_pramod-sawant_625x300_10_March_22.jpg", "publishedAt": "2022-03-30T23:38:25Z", "content": "Mr Sawant said that the Budget was for the development and prosperity of the state and its people.\r\nPanaji: Newly-elected Goa Chief Minister Pramod Sawant on Wednesday presented the state Budget for … [+760 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Astronaut Returns To Earth On Russian Spacecraft Amid Ukraine Tensions", "description": "In a rare sign of cooperation between the U.S. and Russia, astronauts from both countries parachute-landed in Kazakhstan on Wednesday after a trip back to Earth from the International Space Station (ISS).", "url": "https://www.ndtv.com/world-news/american-astronaut-returns-to-earth-on-russian-spacecraft-amid-ukraine-tensions-2853579", "urlToImage": "https://c.ndtvimg.com/2022-03/8fm7njeg_iss-astronauts-reuters-650_625x300_16_March_22.jpg", "publishedAt": "2022-03-30T23:19:45Z", "content": "For US astronaut Vande Hei, it ended a US record-breaking stay in space.\r\nWashington:  In a rare sign of cooperation between the U.S. and Russia, astronauts from both countries parachute-landed in Ka… [+2019 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Nearly Half Of Ukraine \"Polluted' By Russian Explosives: Kyiv", "description": "Nearly half of Ukraine's territory has been contaminated by explosives as part of Russia's war against its neighbour, a senior Kyiv official said Wednesday, according to a local media report.", "url": "https://www.ndtv.com/world-news/nearly-half-of-ukraine-polluted-by-russian-explosives-kyiv-2853571", "urlToImage": "https://c.ndtvimg.com/2022-03/7rpnml0g_ukraine-war-afp_625x300_26_March_22.jpg", "publishedAt": "2022-03-30T22:51:08Z", "content": "Minister said that Ukrainian specialists have demined 300 explosive devices since the war started.\r\nKyiv: Nearly half of Ukraine's territory has been contaminated by explosives as part of Russia's wa… [+666 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"We Will Fight For Every Meter Of Our Territory\": Ukraine's Zelensky", "description": "Ukrainian President Volodymyr Zelensky on Wednesday dismissed Russia's vows to de-escalate fighting against its neighbour, saying his army was getting ready for further fighting in the east.", "url": "https://www.ndtv.com/world-news/ukraine-president-volodymyr-zelensky-dismisses-russias-scaleback-claim-2853565", "urlToImage": "https://c.ndtvimg.com/2022-03/bh3l1t3g_zelensky-on-streets-afp_650x400_24_March_22.jpg", "publishedAt": "2022-03-30T22:40:00Z", "content": "\"We will not give anything away. We will fight for every meter of our territory,\" Zelensky said.\r\nKyiv: Ukrainian President Volodymyr Zelensky on Wednesday dismissed Russia's vows to de-escalate figh… [+1600 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Putin \"Misled\" By His Own Army On Ukraine War: US", "description": "Fighting raged Wednesday in Ukraine despite Russia's indication that it planned to deescalate, and US intelligence claimed Kremlin leader Vladimir Putin is angry after being misled by his own military.", "url": "https://www.ndtv.com/world-news/russian-president-vladimir-putin-misled-by-his-own-army-on-ukraine-war-us-2853562", "urlToImage": "https://c.ndtvimg.com/2022-03/uoilpns_vladimir-putin-afp-pic_650x400_02_March_22.jpg", "publishedAt": "2022-03-30T22:24:01Z", "content": "US officials said Wednesday that Putin is angry after being shielded from the truth.\r\nKyiv: Fighting raged Wednesday in Ukraine despite Russia's indication that it planned to deescalate, and US intel… [+6192 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Top UK, Russian Officials To Visit India Today Amid Ukraine War", "description": "British foreign minister Liz Truss will visit India on Thursday as part of a \"wider diplomatic push\" on the war in Ukraine, her office said, a trip which coincides with her Russian counterpart Sergei Lavrov travelling to the country.", "url": "https://www.ndtv.com/world-news/uk-foreign-minister-liz-truss-russian-foreign-minister-sergey-lavrov-to-visit-india-today-amid-ukraine-crisis-2853559", "urlToImage": "https://c.ndtvimg.com/2022-03/inkdihco_ukraine-war-afp-650_625x300_24_March_22.jpg", "publishedAt": "2022-03-30T22:05:15Z", "content": "Russian Foreign Minister will also visit India on Thursday.\r\nLondon: British foreign minister Liz Truss will visit India on Thursday as part of a \"wider diplomatic push\" on the war in Ukraine, her of… [+1875 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Top UK, Russian Officials To Visit India Today Amid Ukraine War", "description": "British foreign minister Liz Truss will visit India on Thursday as part of a \"wider diplomatic push\" on the war in Ukraine, her office said, a trip which coincides with her Russian counterpart Sergei Lavrov travelling to the country.", "url": "https://www.ndtv.com/india-news/uk-foreign-minister-liz-truss-russian-foreign-minister-sergey-lavrov-to-visit-india-today-amid-ukraine-crisis-2853559", "urlToImage": "https://c.ndtvimg.com/2022-03/inkdihco_ukraine-war-afp-650_625x300_24_March_22.jpg", "publishedAt": "2022-03-30T22:05:15Z", "content": "Russian Foreign Minister will also visit India on Thursday.\r\nNew Delhi: British foreign minister Liz Truss will visit India on Thursday as part of a \"wider diplomatic push\" on the war in Ukraine, her… [+1878 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Announces Mariupol Ceasefire To Evacuate Civilians Today", "description": "The Russian defence ministry announced a local ceasefire Thursday to allow civilians to be evacuated from Ukraine's besieged port city of Mariupol.", "url": "https://www.ndtv.com/world-news/ukraine-crisis-russia-announces-ceasefire-for-evacuation-of-civilians-from-mariupol-today-2853552", "urlToImage": "https://c.ndtvimg.com/2022-03/m62t0bo4_mariupol-ukraine-reuters_625x300_21_March_22.jpg", "publishedAt": "2022-03-30T21:30:52Z", "content": "The ministry also said it had agreed to a proposal from Kyiv to open in the last 24 hours.\r\nMoscow: The Russian defence ministry announced a local ceasefire Thursday to allow civilians to be evacuate… [+1024 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "BJP MP Demands Arvind Kejriwal's Apology Over \"The Kashmir Files\" Remarks", "description": "Tejasvi Surya, BJP Yuva Morcha president, demanded an 'unconditional apology' from Delhi CM Arvind Kejriwal over his remarks on 'The Kashmir Files' and Kashmiri pandits and added that their protests will continue until he issues it.", "url": "https://www.ndtv.com/india-news/bjp-mp-tejasvi-surya-demands-arvind-kejriwals-apology-over-the-kashmir-files-remarks-2853547", "urlToImage": "https://c.ndtvimg.com/2022-03/2tii2aq4_tejasvi-surya-650_625x300_30_March_22.jpg", "publishedAt": "2022-03-30T21:17:51Z", "content": "\"Arvind Kejriwal and the AAP have always been adopting anti-Hindu policies,\" said Tejasvi Surya.\r\nNew Delhi: Tejasvi Surya, BJP Yuva Morcha president and MP from Bengaluru, on Wednesday demanded an '… [+1992 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russian Forces Have Begun To Pull Out Of Chernobyl Nuclear Site, Says US", "description": "Russian forces have begun to pull out of the defunct Chernobyl nuclear power site after seizing control of the facility on February 24, a senior US defense official said Wednesday.", "url": "https://www.ndtv.com/world-news/russian-forces-have-begun-to-pull-out-of-chernobyl-nuclear-site-says-us-2853545", "urlToImage": "https://c.ndtvimg.com/2022-03/e5aalhh8_chernobyl-nuclear-plant-afp-650_625x300_09_March_22.jpg", "publishedAt": "2022-03-30T20:57:48Z", "content": "Last week, Ukraine claimed that Russian army took control of town where staff working at Chernobyl site.\r\nWashington: Russian forces have begun to pull out of the defunct Chernobyl nuclear power site… [+470 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "S Jaishankar, US Secretary Of State Discuss Ukraine Crisis Over Phone", "description": "US Secretary of State Tony Blinken on Wednesday spoke with External Affairs Minister S Jaishankar to review regional priorities, worsening humanitarian situation in Ukraine and to promote free and open Indo-Pacific, his spokesperson said.", "url": "https://www.ndtv.com/world-news/s-jaishankar-us-secretary-of-state-antony-blinken-discuss-ukraine-crisis-over-phone-2853511", "urlToImage": "https://c.ndtvimg.com/2021-10/9p9gti18_s-jaishankar-antony-blinken_625x300_31_October_21.jpeg", "publishedAt": "2022-03-30T20:07:20Z", "content": "Blinken has wrapped up a three-nation tour of the Middle East and North Africa on Wednesday.\r\nWashington: US Secretary of State Tony Blinken on Wednesday spoke with External Affairs Minister S Jaisha… [+1066 chars]"}]}