{"status": "ok", "totalResults": 453, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine Ballet Star Artyom Datsishin Dies From Russian Shelling Injuries", "description": "Ukrainian ballet star Artyom Datsishin has lost his life amid Russia's ongoing military operation in the Eastern European country.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-ukraine-ballet-star-artyom-datsishin-dies-from-russian-shelling-injuries-2830842", "urlToImage": "https://c.ndtvimg.com/2022-03/pcmu7kf_ukraine-ballet-star-artyom-datsishin-_625x300_19_March_22.jpg", "publishedAt": "2022-03-19T02:04:37Z", "content": "Russia-Ukraine War: Ukrainian ballet star Artyom Datsishin has lost his life.\r\nKyiv: Ukrainian ballet star Artyom Datsishin has lost his life amid Russia's ongoing military operation in the Eastern E… [+949 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Edited by NDTV News Desk", "title": "Ukraine-Russia War Live: Talks To Continue As Attacks Intensify", "description": "Ukrainian President Volodymyr Zelensky called again for talks with Moscow today, saying they were the \"only chance for Russia to minimise the damage done with their own mistakes\" after invading.", "url": "https://www.ndtv.com/world-news/ukraine-russia-war-live-updates-ukraine-russia-signal-progress-in-talks-as-attacks-continue-2830840", "urlToImage": "https://c.ndtvimg.com/2022-03/hp6sq2f_ukraine-war_625x300_19_March_22.jpg", "publishedAt": "2022-03-19T01:59:25Z", "content": "The two sides are currently holding negotiations remotely\r\nUkrainian President Volodymyr Zelensky called again for talks with Moscow today, saying they were the \"only chance for Russia to minimise th… [+825 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "China's New Laser Weapon That Could Destroy Satellites In Space: Report", "description": "Researchers in China have developed a microwave machine \"Relativistic Klystron Amplifier (RKA)\", that could jam or destroy satellites in space.", "url": "https://www.ndtv.com/world-news/chinas-new-laser-weapon-that-could-destroy-satellites-in-space-report-2830838", "urlToImage": "https://i.ndtvimg.com/i/2017-04/laser-weapons-generic_650x400_41491635099.jpg", "publishedAt": "2022-03-19T01:47:04Z", "content": "Space is becoming an increasingly hotly contested geopolitical arena. (Representational)\r\nTaipei: Researchers in China have developed a microwave machine \"Relativistic Klystron Amplifier (RKA)\", that… [+2187 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Time To Restore Justice\", Ukraine President On Talks With Russia", "description": "Kyiv has accused Moscow of committing war crimes by deliberately shelling residential areas as more than 3.25 million refugees have fled Ukraine since the Russian invasion", "url": "https://www.ndtv.com/world-news/ukraine-russia-war-time-to-restore-justice-ukraine-president-on-talks-with-russia-2830832", "urlToImage": "https://c.ndtvimg.com/2022-03/b8ibbr48_ukraine-war-toys-soaked-in-blood-afp-650_625x300_15_March_22.jpg", "publishedAt": "2022-03-19T01:37:28Z", "content": "<li>Ukrainian President Volodymyr Zelensky called for comprehensive peace talks with Moscow, saying Russia would otherwise need generations to recover from losses suffered during the war. \"The time h… [+2169 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "It's Time For Meaningful Talks With Russia, Says Ukraine President", "description": "Ukrainian President Volodymyr Zelenskiy on Saturday called for comprehensive peace talks with Moscow, saying Russia would otherwise need generations to recover from losses suffered during the war.", "url": "https://www.ndtv.com/world-news/its-time-for-meaningful-talks-with-russia-says-ukraine-president-volodymyr-zelensky-2830820", "urlToImage": "https://c.ndtvimg.com/2022-03/n0jpugl_ukraine-president-volodymyr-zelensky-_625x300_11_March_22.jpg", "publishedAt": "2022-03-19T00:48:03Z", "content": "The two sides have been involved in talks for weeks with no sign of a breakthrough.\r\nKyiv: Ukrainian President Volodymyr Zelenskiy on Saturday called for comprehensive peace talks with Moscow, saying… [+1240 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "LIVE Updates: India Logs 2,528 Fresh COVID-19 Cases In 24 Hours", "description": "India reported a total of 2,528 new COVID-19 cases in the last 24 hours, taking the total number of infections to 4,30,04,005. While death count rose to 5,16,281 with 149 fresh Covid-related fatalities on Thursday.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-india-latest-news-india-coronavirus-cases-today-19-march-2022-2830812", "urlToImage": "https://c.ndtvimg.com/2021-12/hqvfis3_mumbai-covid-testing-pti-650-_650x400_29_December_21.jpg", "publishedAt": "2022-03-19T00:25:43Z", "content": "The recovery rate in India has increased to 98.72 per cent.\r\nNew Delhi: India reported a total of 2,528 new COVID-19 cases in the last 24 hours, taking the total number of infections to 4,30,04,005. … [+455 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Indian-American Puneet Talwar Appointed New US Ambassador To Morocco", "description": "US President Joe Biden on Friday announced Indian American Puneet Talwar for Ambassador of Morocco as part of some key nominations for his administration, a White House press release said.", "url": "https://www.ndtv.com/world-news/indian-american-puneet-talwar-appointed-new-us-ambassador-to-morocco-2830809", "urlToImage": "https://i.ndtvimg.com/i/2015-04/puneet-talwar_650x400_71428049421.jpg", "publishedAt": "2022-03-19T00:05:40Z", "content": "Washington: US President Joe Biden on Friday announced Indian American Puneet Talwar for Ambassador of Morocco as part of some key nominations for his administration, a White House press release said… [+1575 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia To Start Its Own Mars Mission After Europe Suspends Joint Project", "description": "Russia will start work on its own Mars mission given that the European Space Agency (ESA) has suspended a joint project in the wake of the Ukraine invasion, Interfax news agency quoted a top official as saying on Friday.", "url": "https://www.ndtv.com/world-news/russia-to-start-its-own-mars-mission-after-europe-suspends-joint-project-2830799", "urlToImage": "https://i.ndtvimg.com/i/2017-12/mars-generic-pixabay-650_650x400_71514600798.jpg", "publishedAt": "2022-03-18T23:34:02Z", "content": "\"In the very near future we will start working on the implementation of a mission to Mars,\" said Russia.\r\nMoscow: Russia will start work on its own Mars mission given that the European Space Agency (… [+1233 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Boy, 17, Dies After Slipping Into Pond While Taking Selfie In UP: Police", "description": "A 17-year-old boy, who was trying to take a selfie along with his friends by standing at the edge of a 25-feet deep pond on the occasion of Holi, died after falling into the water body on Friday, police said.", "url": "https://www.ndtv.com/india-news/17-year-old-boy-dies-after-slipping-into-pond-while-taking-selfie-in-up-2830793", "urlToImage": "https://c.ndtvimg.com/5evuq9is_dead-body-generic_625x300_28_August_18.jpg", "publishedAt": "2022-03-18T23:08:44Z", "content": "Police said that boy's desire to click a \"perfect selfie\" on Holi cost him his life.\r\nGurugram: A 17-year-old boy, who was trying to take a selfie along with his friends by standing at the edge of a … [+808 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Brazil's Top Court Bans Telegram Ahead Of Presidential Election", "description": "A Supreme Court judge in Brazil ruled to block popular messaging application Telegram nationwide, barring one of far-right President Jair Bolsonaro's favorite communication channels, in a decision published Friday.", "url": "https://www.ndtv.com/world-news/brazils-top-court-bans-telegram-ahead-of-presidential-election-2830790", "urlToImage": "https://i.ndtvimg.com/i/2015-11/telegram_650x400_81447900995.jpg", "publishedAt": "2022-03-18T22:43:25Z", "content": "Telegram is one of favorite communication channels of President Jair Bolsonaro.\r\nBraslia: A Supreme Court judge in Brazil ruled to block popular messaging application Telegram nationwide, barring one… [+4143 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Your Conduct Was Inappropriate\": Pak Court To Imran Khan On Rally Speech", "description": "The Islamabad High Court on Friday called Pakistan Prime Minister Imran Khan's conduct during his rally in Lower Dir on March 11 as \"inappropriate\" and rejected his and Planning and Development Minister Asad Umar's plea.", "url": "https://www.ndtv.com/world-news/pakistan-news-imran-khan-your-conduct-was-inappropriate-pak-court-to-imran-khan-on-rally-speech-2830787", "urlToImage": "https://c.ndtvimg.com/2019-08/hm5aoub_imran-khan-afp_625x300_23_August_19.jpg", "publishedAt": "2022-03-18T22:37:59Z", "content": "Pakistan: Imran Khan launched a scathing attack on the troika of opposition figures.\r\nIslamabad: The Islamabad High Court on Friday called Pakistan Prime Minister Imran Khan's conduct during his rall… [+2188 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Military Aircraft With 4 Onboard Crashes In Norway", "description": "A U.S. military aircraft with four people onboard has crashed in northern Norway, the country's Joint Rescue Coordination Centres (JRCC) told Reuters on Friday.", "url": "https://www.ndtv.com/world-news/us-military-aircraft-with-4-onboard-crashes-in-norway-during-nato-military-exercise-2830784", "urlToImage": "https://i.ndtvimg.com/i/2017-06/us-helicopter-generic_650x400_41497517217.jpg", "publishedAt": "2022-03-18T22:24:33Z", "content": "The aircraft was taking part in a NATO military exercise, the official said in statement. (File)\r\nOslo: A U.S. military aircraft with four people onboard has crashed in northern Norway, the country's… [+676 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Will Donate Son's Body For Research: Father Of Student Killed In Ukraine", "description": "The parents of the Indian student Naveen Shekarappa Gyanagoudar who was killed in the Ukrainian city of Kharkiv have decided to donate their son's body for medical research, the father of the medical student informed on Saturday.", "url": "https://www.ndtv.com/india-news/will-donate-sons-body-for-research-father-of-student-naveen-shekarappa-gyanagoudar-killed-in-ukraine-2830783", "urlToImage": "https://c.ndtvimg.com/2022-03/6k8i0ipo_naveen-ukraine_625x300_01_March_22.jpg", "publishedAt": "2022-03-18T22:08:40Z", "content": "Naveen Shekharappa Gyanagoudar, an MBBS student, was a resident of Karnataka's Haveri district.\r\nNew Delhi: The parents of the Indian student Naveen Shekarappa Gyanagoudar who was killed in the Ukrai… [+1867 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Afghanistan: 3 Journalists Detained By Taliban Released Over Media Ban", "description": "The Taliban has released the three Tolo News journalists who were detained amidst an ongoing crackdown against dissenting voices and minorities in the country.", "url": "https://www.ndtv.com/world-news/afghanistan-3-journalists-detained-by-taliban-released-over-media-ban-2830777", "urlToImage": "https://c.ndtvimg.com/2021-11/7rgmpp38_taliban-afghanistan-kabul-hospital_625x300_03_November_21.jpeg", "publishedAt": "2022-03-18T21:31:21Z", "content": "The arrests triggered large scale condemnation from international agencies.\r\nKabul: The Taliban has released the three Tolo News journalists who were detained amidst an ongoing crackdown against diss… [+3068 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Syrian President Assad Visits Dubai, First Trip To Arab State Since War", "description": "Syrian President Bashar Al-Assad met Dubai's ruler Sheikh Mohammed bin Rashid al-Maktoum in Dubai, the Syrian presidency said in a statement on Friday, his first visit to an Arab state since the Syrian war began in 2011.", "url": "https://www.ndtv.com/world-news/syrian-president-bashar-al-assad-visits-dubai-first-trip-to-arab-state-since-war-2830770", "urlToImage": "https://i.ndtvimg.com/i/2016-04/bashar-al-assad_650x400_81460811731.jpg", "publishedAt": "2022-03-18T20:54:24Z", "content": "This is Bashar Al-Assad's first visit to an Arab state since the Syrian war began in 2011.\r\nDubai: Syrian President Bashar Al-Assad met Dubai's ruler Sheikh Mohammed bin Rashid al-Maktoum in Dubai, t… [+859 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Army Man Booked For Attempting To Rape His colleague's Wife In Rajasthan", "description": "An Army man has been booked on charges of attempting to rape a colleague's wife while four officers have been named in the FIR for allegedly trying to threaten the couple and hush up the matter.", "url": "https://www.ndtv.com/india-news/army-man-booked-for-attempting-to-rape-his-colleagues-wife-in-rajasthans-jodhpur-2830755", "urlToImage": "https://c.ndtvimg.com/2018-10/dcnmvtno_rape-generic_625x300_21_October_18.jpg", "publishedAt": "2022-03-18T20:29:42Z", "content": "The victim also alleged Army Police forced her to give a wrong statement in order to protect the accused.\r\nJodhpur: An Army man has been booked on charges of attempting to rape a colleague's wife whi… [+2019 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "In Call With Xi, Biden Lays Out \"Consequences\" If China Aids Russian Invasion", "description": "US President Joe Biden laid out to his Chinese counterpart Xi Jinping the \"consequences\" of any support for Russia in its war against neighboring Ukraine, the White House said Friday.", "url": "https://www.ndtv.com/world-news/in-call-with-xi-biden-lays-out-consequences-if-china-aids-russian-invasion-2830746", "urlToImage": "https://c.ndtvimg.com/2022-03/r0pib8h8_joe-biden-afp-650_625x300_17_March_22.jpg", "publishedAt": "2022-03-18T20:01:58Z", "content": "Washington: US President Joe Biden laid out to Chinese leader Xi Jinping on Friday the \"consequences\" of any backing for Russia in its war against Ukraine, the White House said, as Beijing showed no … [+4142 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Claims Progress In Talks With Kyiv On Neutral Ukraine", "description": "Russia's top negotiator at talks with Ukraine said Friday that Moscow and Kyiv had brought their positions \"as close as possible\" on a proposal for Ukraine to become a neutral state.", "url": "https://www.ndtv.com/world-news/russia-claims-progress-in-talks-with-kyiv-on-neutral-ukraine-2830733", "urlToImage": "https://c.ndtvimg.com/2022-03/k5qrmecg_ukraine-kyivukraine-soldier-kyivafp-650_625x300_10_March_22.jpg", "publishedAt": "2022-03-18T19:33:24Z", "content": "Russia has requested that its neighbour never join the Western NATO military alliance.\r\nMoscow: Russia's top negotiator at talks with Ukraine said Friday that Moscow and Kyiv had brought their positi… [+1667 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Pak Lawmaker Gets Death Threats Ahead Of No-Trust Vote Against PM: Report", "description": "Dissident lawmaker of Imran Khan's party Noor Alam Khan has said that he has received death threats, ahead of a no-confidence motion against the Prime Minister.", "url": "https://www.ndtv.com/world-news/pakistan-lawmaker-noor-alam-khan-gets-death-threats-ahead-of-no-trust-vote-against-pm-imran-khan-report-2830690", "urlToImage": "https://c.ndtvimg.com/2022-03/2m1esu0o_pakistan-lawmaker-noor-alam-khan-650_625x300_18_March_22.jpg", "publishedAt": "2022-03-18T18:18:37Z", "content": "Dissident Pakistan lawmaker Noor Alam Khan has said that he has received death threats\r\nIslamabad: Dissident lawmaker of Imran Khan's party Noor Alam Khan has said that he has received death threats,… [+1419 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Putin Accuses Ukraine Of \"War Crimes\" In Call With French President Macron", "description": "Russian President Vladimir Putin on Friday accused Kyiv of \"war crimes\" in a call with his French counterpart, saying that Moscow was doing \"everything possible\" to avoid civilian deaths in Ukraine.", "url": "https://www.ndtv.com/world-news/putin-accuses-ukraine-of-war-crimes-in-call-with-french-president-emmanuel-macron-2830686", "urlToImage": "https://c.ndtvimg.com/2022-03/8hc899n_russia-ukraine-crisis_625x300_10_March_22.jpg", "publishedAt": "2022-03-18T18:09:55Z", "content": "Putin said the Russian army was \"doing everything possible to safeguard the lives of peaceful civilians.\"\r\nMoscow: Russian President Vladimir Putin on Friday accused Kyiv of \"war crimes\" in a call wi… [+1640 chars]"}]}