{"status": "ok", "totalResults": 305, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Canada Man Seen With Rifle Shot Dead By Cops, Days After US Massacre", "description": "Police in Canada's largest city Toronto on Thursday fatally shot a man armed with a rifle, local media reported, in an incident that forced several schools into lockdown just two days after a deadly assault on a US primary school.", "url": "https://www.ndtv.com/world-news/toronto-canada-man-seen-with-rifle-shot-dead-by-police-days-after-us-texas-massacre-3013437", "urlToImage": "https://c.ndtvimg.com/2020-11/k9fsv1r8_canada-policeafp_625x300_02_November_20.jpg", "publishedAt": "2022-05-27T02:21:46Z", "content": "Canada: It was not clear if the man was holding the weapon when police shot him. (Representational)\r\nMontreal: Police in Canada's largest city Toronto on Thursday fatally shot a man armed with a rifl… [+1456 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Government Land Worth Rs 100 Crore Freed Of Encroachment In Noida", "description": "Four illegal colonies in Uttar Pradesh's Greater Noida were demolished and land measuring around 50,000 square metres, and estimated to be worth Rs 100 crore, freed of encroachment, officials said on Thursday.", "url": "https://www.ndtv.com/india-news/government-land-worth-rs-100-crore-freed-of-encroachment-in-noida-3013424", "urlToImage": "https://c.ndtvimg.com/2022-04/83dvg1fk_jcb-generic-excavator-generic_625x300_26_April_22.jpg", "publishedAt": "2022-05-27T01:56:35Z", "content": "The official also warned of strict action against encroachment on government land. (Representational)\r\nNoida:  Four illegal colonies in Uttar Pradesh's Greater Noida were demolished and land measurin… [+1345 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Lok Sabha Secretariat To Evict Bhagwant Mann From MP's Flat In Delhi", "description": "The Lok Sabha Secretariat has asked the Directorate of Estates to initiate eviction proceedings against Punjab CM Bhagwant Mann for \"unauthorised\" occupation of a Central government accommodation which was allotted to him as a member of parliament.", "url": "https://www.ndtv.com/india-news/lok-sabha-secretariat-to-evict-bhagwant-mann-from-mps-flat-in-delhi-3013421", "urlToImage": "https://c.ndtvimg.com/2022-01/dts1seng_bhagwant-mann-to-ndtv-_625x300_18_January_22.jpg", "publishedAt": "2022-05-27T01:47:45Z", "content": "Mr Mann had resigned as Sangrur MP in March to become Punjab's chief minister.\r\nNew Delhi: The Lok Sabha Secretariat has asked the Directorate of Estates to initiate eviction proceedings against AAP … [+1850 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "2 Lashkar Terrorists, Involved In Kashmir TV Artiste Murder, Killed: Cops", "description": "The Jammu and Kashmir police on Friday morning said that two Lashkar-e-Taiba (LeT) terrorists, involved in the killing of Kashmiri TV actress Amreen Bhat, have been neutralised in Kashmir's Awantipora.", "url": "https://www.ndtv.com/india-news/2-lashkar-e-taiba-terrorists-involved-in-kashmir-tv-artistes-murder-killed-police-3013407", "urlToImage": "https://c.ndtvimg.com/2022-05/k9q6slf8_kashmir-woman-shot-dead-650_650x400_25_May_22.jpg", "publishedAt": "2022-05-27T01:23:31Z", "content": "Kashmiri TV actress Amreen Bhat was killed by terrorists in Budgam two days earlier. (File)\r\nSrinagar: The Jammu and Kashmir police on Friday morning said that two Lashkar-e-Taiba (LeT) terrorists, i… [+1536 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE: India Sees Over 2,500 New COVID-19 Cases In 24 Hours", "description": "India on Thursday recorded at least 2,628 new COVID-19 cases, taking the total tally of coronavirus cases to 4,31,44,820, while the active cases increased to 15,414, according to the Union Health Ministry.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-27-may-3013392", "urlToImage": "https://c.ndtvimg.com/2021-08/imokvbr_coronavirus-india-reuters-2021_650x400_18_August_21.jpg", "publishedAt": "2022-05-27T00:28:43Z", "content": "India Covid Live: India also recorded 18 new deaths due to coronavirus on Thursday.\r\nNew Delhi: India on Thursday recorded at least 2,628 new COVID-19 cases, taking the total tally of coronavirus cas… [+391 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Wife, Lover Arrested For Killing Husband In Delhi: Police", "description": "A 40-year-old woman was arrested along with her \"lover\" and another man allegedly for killing her husband in central Delhi's Daryaganj area, police said on Thursday.", "url": "https://www.ndtv.com/india-news/wife-lover-arrested-for-killing-husband-in-delhi-police-3013389", "urlToImage": "https://i.ndtvimg.com/i/2017-03/police-generic_650x400_71490246814.jpg", "publishedAt": "2022-05-27T00:11:54Z", "content": "Police said that woman was not happy with her husband and wanted to marry someone else.(Representational)\r\nNew Delhi:  A 40-year-old woman was arrested along with her \"lover\" and another man allegedl… [+2499 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Assam Floods: Death Count Reaches 30, Over 5.61 Lakh People Affected", "description": "The flood situation in Assam remained critical on Thursday with two more persons, including a child, losing their lives and over 5.61 lakh people still suffering in the deluge across seven districts, as per an official bulletin.", "url": "https://www.ndtv.com/india-news/assam-floods-death-count-reaches-30-over-5-61-lakh-people-affected-3013384", "urlToImage": "https://c.ndtvimg.com/2022-05/dsfogkok_assam-floods-650_625x300_19_May_22.jpg", "publishedAt": "2022-05-26T23:55:35Z", "content": "Assam Floods: A total of 1,88,698 domestic animals have been affected due to floods, the official said.\r\nGuwahati: The flood situation in Assam remained critical on Thursday with two more persons, in… [+2438 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Imran Khan Slams Pak Government Over Fuel Price Hike, Praises India Again", "description": "Former Pakistan Prime Minister Imran Khan yet again slammed the Shehbaz Sharif government after the federal government hiked the petrol and diesel prices by PKR 30 per litre.", "url": "https://www.ndtv.com/world-news/imran-khan-slams-pakistan-government-over-fuel-price-hike-praises-india-3013377", "urlToImage": "https://c.ndtvimg.com/2022-04/rpb3e0d4_imran-khan_625x300_02_April_22.jpg", "publishedAt": "2022-05-26T23:37:22Z", "content": "Imran Khan said Pakistan will suffer massive dose of inflation at the hands of this \"cabal of crooks\".\r\nIslamabad: While invoking the name of India, former Pakistan Prime Minister Imran Khan yet agai… [+2695 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine's Zelensky Accuses Russia Of \"Genocide\" In Donbas Region", "description": "Ukraine's President Volodymyr Zelensky on Thursday accused Russia of carrying out \"an obvious policy of genocide\" in his country's eastern Donbas region.", "url": "https://www.ndtv.com/world-news/ukraines-zelensky-accuses-russia-of-genocide-in-donbas-region-3013367", "urlToImage": "https://c.ndtvimg.com/2022-05/8qk8rkg8_reuters-donbas-_625x300_16_May_22.jpg", "publishedAt": "2022-05-26T23:14:50Z", "content": "Tens of thousands of Ukrainians and Russians have died since Russia invaded Ukraine in February.\r\nKyiv: Ukraine's President Volodymyr Zelensky on Thursday accused Russia of carrying out \"an obvious p… [+1014 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Geetanjali Shree Wins International Booker Prize For First Hindi Novel", "description": "Author Geetanjali Shree's Hindi novel 'Tomb of Sand' has become the first book in any Indian language to win the prestigious International Booker Prize.", "url": "https://www.ndtv.com/india-news/geetanjali-shree-wins-international-booker-prize-for-first-hindi-novel-3013360", "urlToImage": "https://c.ndtvimg.com/2022-05/0ncl1s0k_geetanjali-shree_625x300_27_May_22.jpg", "publishedAt": "2022-05-26T22:57:47Z", "content": "Geetanjali Shree's 'Tomb of Sand' was originally published in Hindi (Ret Samadhi) in 2018.\r\nLondon: Author Geetanjali Shree's Hindi novel 'Tomb of Sand' has become the first book in any Indian langua… [+4050 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine Says Russia Commits \"All Its Forces\" To Capture Lugansk", "description": "Russia on Thursday made an all-out effort to capture the rest of Ukraine's industrial region of Lugansk, officials said, as the war in the east of the country escalated to its fiercest level yet.", "url": "https://www.ndtv.com/world-news/ukraine-says-russia-commits-all-its-forces-to-capture-lugansk-3013357", "urlToImage": "https://c.ndtvimg.com/2022-04/8ctb1l3o_ukraine-war-afp-650_625x300_24_April_22.jpg", "publishedAt": "2022-05-26T22:29:35Z", "content": "Ukraine also accusing allies of dragging their feet on arms deliveries amid war against Russia.\r\nKyiv: Russia on Thursday made an all-out effort to capture the rest of Ukraine's industrial region of … [+5707 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Palestinian Probe Finds Al Jazeera Reporter \"Murdered\" By Israeli Forces", "description": "An Al Jazeera journalist shot dead in the occupied West Bank earlier this month was murdered by an Israeli soldier in a \"war crime\", the official Palestinian investigation concluded Thursday.", "url": "https://www.ndtv.com/world-news/palestinian-probe-finds-al-jazeera-reporter-murdered-by-israeli-forces-in-west-bank-3013350", "urlToImage": "https://c.ndtvimg.com/2022-05/ishs654_al-jazeera-journalist-shireen-abu-aqleh650_625x300_11_May_22.jpg", "publishedAt": "2022-05-26T22:05:37Z", "content": "The Palestinian-American journalist from Al Jazeera was killed on May 11 in West Bank.\r\nRamallah: An Al Jazeera journalist shot dead in the occupied West Bank earlier this month was murdered by an Is… [+2982 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Elon Musk Sued By Twitter Shareholders For Stock Price Manipulation", "description": "Elon Musk faces a lawsuit accusing him of pushing down Twitter's stock price in order to either give himself an escape hatch from his $44 billion buyout bid, or room to negotiate a discount.", "url": "https://www.ndtv.com/world-news/elon-musk-sued-by-twitter-shareholders-for-stock-price-manipulation-3013344", "urlToImage": "https://c.ndtvimg.com/2022-04/eld58jbk_elon-musk-reuters_650x400_26_April_22.jpg", "publishedAt": "2022-05-26T21:45:56Z", "content": "The suit alleges that Elon Musk made statements intended to create doubt about the Twitter deal.\r\nSan Francisco: Elon Musk faces a lawsuit accusing him of pushing down Twitter's stock price in order … [+2524 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Debika Chakraborty", "title": "ISC Semester 2 Political Science Exam Today; Guidelines To Follow", "description": "The CISCE will commence the ISC semester 2 Political Science exam at 2:00 pm today.", "url": "https://www.ndtv.com/education/isc-semester-2-political-science-exam-today-guidelines-to-follow", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/5/27/shutterstock_1496189669.jpg", "publishedAt": "2022-05-26T21:31:31Z", "content": "New Delhi:CISCE ISC Exam 2022: The Council for the Indian School Certificate Examinations, or CISCE, will conduct the Indian School Certificate (ISC) Political Science exam today, May 27, 2022. The C… [+2139 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "At UN, China, Russia Block US Bid To Sanction North Korea Over Missile", "description": "China and Russia vetoed on Thursday a U.S.-led push to impose more UN sanctions on North Korea over its renewed ballistic missile launches, publicly splitting the U.N. Security Council for the first time since it started punishing Pyongyang in 2006.", "url": "https://www.ndtv.com/world-news/at-un-china-russia-block-us-bid-to-sanction-north-korea-over-missile-3013331", "urlToImage": "https://i.ndtvimg.com/i/2016-02/un-security-council_650x400_71456453064.jpg", "publishedAt": "2022-05-26T21:24:08Z", "content": "The UN vote to sanction against North Korea came after Pyongyang fired 3 back-back-missile on Wednesday.\r\nUnited Nations: China and Russia vetoed on Thursday a U.S.-led push to impose more United Nat… [+2695 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Biden To Visit Texas On Sunday After Deadly School Shooting: White House", "description": "US President Joe Biden and his wife Jill will head to Texas on Sunday to offer condolences to the loved ones of victims of the deadly shooting at Robb Elementary School, the White House said Thursday.", "url": "https://www.ndtv.com/world-news/us-president-joe-biden-to-visit-texas-on-sunday-in-wake-of-deadly-school-shooting-3013319", "urlToImage": "https://c.ndtvimg.com/2022-05/gb9u61u8_biden-afp_625x300_23_May_22.jpg", "publishedAt": "2022-05-26T20:58:05Z", "content": "Texas Shooting: Biden on Tuesday called for Americans to stand up against the country's pro-gun lobby.\r\nWashington: US President Joe Biden and his wife Jill will head to Texas on Sunday to offer cond… [+421 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Ready To Help Overcome Global Food Crisis If...: Putin", "description": "Moscow is ready to make a \"significant contribution\" to averting a looming food crisis if the West lifts sanctions imposed on Russia over Ukraine, President Vladimir Putin said in a telephone call with Italy's Prime Minister Mario Draghi.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-vladimir-putin-says-russia-ready-to-help-overcome-global-food-crisis-if-west-lifts-sanctions-3013316", "urlToImage": "https://c.ndtvimg.com/2022-05/6s30js9g_vladimir-putin-health-afp-650_625x300_18_May_22.jpg", "publishedAt": "2022-05-26T20:38:44Z", "content": "Ukraine War: Russia was slapped with sanctions after Putin ordered troops to invade Ukraine in February.\r\nMoscow: Moscow is ready to make a \"significant contribution\" to averting a looming food crisi… [+2020 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Spain Passes Bill Qualifying All Non-Consensual Sex As Rape", "description": "Spain's lower house of parliament on Thursday passed a bill that qualifies all non-consensual sex as rape in response to social outrage after the so-called Wolf Pack case gave momentum to the women's rights movement in the country four years ago.", "url": "https://www.ndtv.com/world-news/spain-passes-bill-qualifying-all-non-consensual-sex-as-rape-3013293", "urlToImage": "https://i.ndtvimg.com/i/2016-12/rape-generic-istock_650x400_61481882950.jpg", "publishedAt": "2022-05-26T20:24:14Z", "content": "Recently, two cases of rape of teenagers have shocked Spanish society again. (Representational)\r\nMadrid: Spain's lower house of parliament on Thursday passed a bill that qualifies all non-consensual … [+1963 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Finland Says Trust In Russia Lost For \"Generations\" Over Ukraine War", "description": "Finnish Prime Minister Sanna Marin said Thursday during a trip to Kyiv that it would take Russia decades to repair its standing in the world after invading Ukraine.", "url": "https://www.ndtv.com/world-news/finland-says-trust-in-russia-lost-for-generations-over-ukraine-war-3013276", "urlToImage": "https://c.ndtvimg.com/2022-05/eu8ad0i8_russia-ukraine-war_625x300_18_May_22.jpg", "publishedAt": "2022-05-26T19:44:41Z", "content": "Ukriane War: Finish PM Sanna Marin also met Ukrainian President Volodymyr Zelensky during her Kyiv visit.\r\nKyiv: Finnish Prime Minister Sanna Marin said Thursday during a trip to Kyiv that it would t… [+1131 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Texas Shooting: Meghan Markle Visits Uvalde To Pay Tribute To Victims", "description": "Meghan Markle, the wife of Britain's Prince Harry, on Thursday made an unannounced visit to the Texas town of Uvalde to pay her respects to the victims of a shooting at an elementary school that left 19 children and two teachers dead.", "url": "https://www.ndtv.com/world-news/texas-shooting-meghan-markle-visits-uvalde-to-pay-tribute-to-victims-3013247", "urlToImage": "https://c.ndtvimg.com/2018-12/l9neppeo_meghan-markle-reuters_625x300_17_December_18.jpg", "publishedAt": "2022-05-26T19:14:07Z", "content": "Texas Shooting: At least 19 students were killed at a Texas elementary school on Tuesday. (File)\r\nUvalde, United States: Meghan Markle, the wife of Britain's Prince Harry, on Thursday made an unannou… [+720 chars]"}]}