{"status": "ok", "totalResults": 667, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Video: Cargo Plane Splits In 2 After Crash Landing At Costa Rica Airport", "description": "A cargo airplane broke up during an emergency landing in Costa Rica on Thursday, in an accident that provoked the temporary closure of the international airport in San Jose.", "url": "https://www.ndtv.com/world-news/costa-rica-cargo-plane-cargo-plane-splits-in-two-after-crash-landing-at-costa-rica-airport-2869880", "urlToImage": "https://c.ndtvimg.com/2022-04/h4r0css8_costa-rica-cargo-plane_625x300_08_April_22.jpg", "publishedAt": "2022-04-08T01:55:39Z", "content": "Costa Rica Cargo Plane: The crew apparently had alerted local authorities to a hydraulic problem.\r\nSan Jose: A cargo airplane broke up during an emergency landing in Costa Rica on Thursday, in an acc… [+1253 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "2 Suspected Pak Spies Try To Lure US President's Secret Service, Caught", "description": "The United States on Thursday busted an alleged cell of Pakistan's spy agency ISI trying to intrude into the American intelligence and security apparatus including its high profile Secret Service which is in charge of the security of the President.", "url": "https://www.ndtv.com/world-news/2-suspected-isi-agents-try-to-lure-us-presidents-secret-service-caught-2869855", "urlToImage": "https://c.ndtvimg.com/2022-04/0c7j96hg_us-secret-service-white-house-file-photo_625x300_08_April_22.jpg", "publishedAt": "2022-04-08T01:52:12Z", "content": "US busted an alleged ISI cell trying to lure the US President's security staff (Representational)\r\nWashington: The United States on Thursday busted an alleged cell of Pakistan's spy agency ISI trying… [+3393 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Pink Floyd's First Song Since 1994 \"Hey, Hey, Rise-Up!\" Is For Ukraine", "description": "Pink Floyd have written their first new song in almost 30 years to support Ukrainians, the band announced on Thursday.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-pink-floyds-first-song-since-1994-hey-hey-rise-up-is-for-ukraine-2869877", "urlToImage": "https://c.ndtvimg.com/2022-03/84ldh8vg_ukraine-war_625x300_31_March_22.jpg", "publishedAt": "2022-04-08T01:48:22Z", "content": "Russia-Ukraine War: The song samples Andriy Khlyvnyuk from one of Ukraine's biggest bands BoomBox.\r\nParis: Pink Floyd have written their first new song in almost 30 years to support Ukrainians, the b… [+2014 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Newsdesk", "title": "LIVE Updates: UN General Assembly Suspends Russia From Human Rights Body", "description": "The UN General Assembly voted to suspend Russia from the UN Human Rights Council as punishment for the invasion of Ukraine.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-live-updates-un-general-assembly-suspends-russia-from-rights-body-2869874", "urlToImage": "https://c.ndtvimg.com/2022-04/nu23iemo_ukraine-war_625x300_07_April_22.jpg", "publishedAt": "2022-04-08T01:37:18Z", "content": "Russia-Ukraine War LIVE Updates: The war between Russia and Ukraine has entered day 44.\r\nNew Delhi: The UN General Assembly voted to suspend Russia from the UN Human Rights Council as punishment for … [+1139 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"You Will Be Held Responsible For...\": Punjab's Bhagwant Mann To Top Cops", "description": "Facing opposition flak over recent incidents of violence in Punjab, Chief Minister Bhagwant Mann on Thursday told commissioners of police and district police chiefs that they will be held responsible for any breach of law and order in their jurisdict", "url": "https://www.ndtv.com/india-news/you-will-be-held-responsible-for-for-breaching-law-and-order-punjab-chief-minister-bhagwant-mann-to-top-cops-2869868", "urlToImage": "https://c.ndtvimg.com/2022-01/dts1seng_bhagwant-mann-to-ndtv-_625x300_18_January_22.jpg", "publishedAt": "2022-04-08T01:27:44Z", "content": "He also announced the constitution of an anti-gangster task force in the state.\r\nChandigarh: Facing opposition flak over recent incidents of violence in Punjab, Chief Minister Bhagwant Mann on Thursd… [+3444 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Pakistan Crisis Live: PM Khan Says Faces Trust Vote After Supreme Court Order", "description": "Pakistani Prime Minister Imran Khan said he will continue to fight as he faces a vote to oust him on Saturday. Imran Khan's coalition lost its majority in the national assembly last week.", "url": "https://www.ndtv.com/world-news/pakistan-crisis-live-updates-imran-khan-says-he-will-continue-to-fight-as-he-faces-trust-vote-2869864", "urlToImage": "https://c.ndtvimg.com/2022-04/e6pj6mag_imran-khan-placard-afp-650_625x300_04_April_22.jpg", "publishedAt": "2022-04-08T01:16:23Z", "content": "He will address the nation on Friday.\r\nIslamabad: Pakistani Prime Minister Imran Khan said he will continue to fight as he faces a vote to oust him on Saturday. He will address the nation today.\r\nThe… [+889 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Delhi Government Offers Rs 5,500 Subsidy To First 10,000 E-Cycle Buyers", "description": "Delhi government will provide a subsidy of Rs 5,500 each for first 10,000 buyers of e-cycles in the city, Delhi transport minister Kailash Gahlot said on Thursday.", "url": "https://www.ndtv.com/india-news/delhi-government-offers-rs-5-500-subsidy-to-first-10-000-e-cycle-buyers-2869861", "urlToImage": "https://c.ndtvimg.com/2022-01/7ie4f294_nexzu-bazinga-ecycle_625x300_21_January_22.jpg", "publishedAt": "2022-04-08T00:58:10Z", "content": "The residents of Delhi only will be eligible for the subsidy scheme, Mr Gahlot said. (File)\r\nNew Delhi: Delhi government will provide a subsidy of Rs 5,500 each for first 10,000 buyers of e-cycles in… [+988 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE: India Logs 1,033 New COVID-19 Cases In 24 Hours", "description": "India on Thursday recorded 1,033 new Covid cases, taking the coronavirus tally to 4,30,31,958. According to the Union Health Ministry data, country's active cases currently stand at over 11,000 cases.", "url": "https://www.ndtv.com/india-news/coronavirus-india-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-8-april-2022-2869851", "urlToImage": "https://c.ndtvimg.com/2020-11/vv9vf048_coronavirus-delhi-november-2020-pti-650_650x400_23_November_20.jpg", "publishedAt": "2022-04-08T00:19:17Z", "content": "The number of people who have recuperated from the disease surged to 4,24,97,567.\r\nNew Delhi: India on Thursday recorded 1,033 new Covid cases, taking the coronavirus tally to 4,30,31,958. According … [+577 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Trump Faces Contempt of Court Claim In New York Civil Fraud Probe", "description": "New York state Attorney General Letitia James on Thursday asked a judge to hold former president Donald Trump in contempt for failing to turn over documents related to her investigation of possible fraud in the Trump family's business dealings.", "url": "https://www.ndtv.com/world-news/donald-trump-faces-contempt-of-court-claim-in-new-york-civil-fraud-probe-2869842", "urlToImage": "https://c.ndtvimg.com/2022-02/kr9u49fk_donald-trump-reuters_625x300_20_February_22.jpg", "publishedAt": "2022-04-08T00:01:44Z", "content": "Donald Trump's trial is due to begin in the middle of this year.\r\nWashington: New York state Attorney General Letitia James on Thursday asked a judge to hold former president Donald Trump in contempt… [+2897 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Anil Deshmukh Not In Good Health, CBI Should Question Him In Mumbai: NCP", "description": "The CBI should question former Maharashtra Home Minister Anil Deshmukh, arrested in a corruption case, in Mumbai and not in New Delhi given his health condition, the NCP said on Thursday.", "url": "https://www.ndtv.com/india-news/anil-deshmukh-not-in-good-health-cbi-should-question-him-in-mumbai-ncp-2869841", "urlToImage": "https://c.ndtvimg.com/2020-05/l0v5hn4g_maharashtra-home-minister-anil-deshmukh_625x300_23_May_20.jpg", "publishedAt": "2022-04-07T23:39:05Z", "content": "Mr Deshmukh (71) underwent treatment at state-run J J Hospital after he complained of shoulder pain.\r\nMumbai: The CBI should question former Maharashtra Home Minister Anil Deshmukh, arrested in a cor… [+2340 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "EU Proposes 500 Million Euros More For Arms To Ukraine", "description": "European Council chief Charles Michel on Thursday backed a proposal to release an additional 500 million euros ($540 million) to provide arms for Ukraine.", "url": "https://www.ndtv.com/world-news/eu-proposes-500-million-euros-more-for-arms-to-ukraine-2869835", "urlToImage": "https://c.ndtvimg.com/2022-02/3f3rjmt8_ukraine-army-afp-650_625x300_26_February_22.jpg", "publishedAt": "2022-04-07T23:19:09Z", "content": "The proposal was agreed on Thursday by the 27 EU nations at ambassador level.\r\nBrussels: European Council chief Charles Michel on Thursday backed a proposal to release an additional 500 million euros… [+1456 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Pentagon Says 4 US Troops Injured In Rocket Attack On Syria Base", "description": "Four US troops were injured Thursday after rockets were fired at a base housing American forces in eastern Syria, US Central Command said.", "url": "https://www.ndtv.com/world-news/pentagon-says-4-us-troops-injured-in-rocket-attack-on-syria-base-2869832", "urlToImage": "https://c.ndtvimg.com/us-troops-in-syria-(reuters)_625x300_1529047966012.jpg", "publishedAt": "2022-04-07T23:06:50Z", "content": "Earlier in January the base was also shelled in an attack blamed on Iran-backed groups. (File)\r\nWashington: Four US troops were injured Thursday after rockets were fired at a base housing American fo… [+889 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "WHO Reports Over 100 Attacks On Healthcare In Ukraine Since War Began", "description": "The World Health Organization (WHO) on Thursday said it had confirmed over 100 attacks on health services in Ukraine, as it called for humanitarian access to the besieged city of Mariupol.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-who-reports-over-100-attacks-on-healthcare-in-ukraine-since-war-began-2869830", "urlToImage": "https://c.ndtvimg.com/2022-03/1fu20ed_ukraine-war_625x300_19_March_22.jpg", "publishedAt": "2022-04-07T22:48:06Z", "content": "\"We are outraged that attacks on health care are continuing,\" the WHO chief said.\r\nLviv: The World Health Organization (WHO) on Thursday said it had confirmed over 100 attacks on health services in U… [+2202 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Omicron Lasts 3 Days Less Than Delta For Boosted: Study", "description": "People who are vaccinated and have had a booster shot against Covid-19 recover from symptoms from the Omicron variant more than three days earlier than those with the Delta variant, a study said Friday.", "url": "https://www.ndtv.com/world-news/omicron-varaint-of-covid-lasts-3-days-less-than-delta-for-boosted-study-2869823", "urlToImage": "https://c.ndtvimg.com/2021-12/8qoaoopk_coronavirus-generic-web-_625x300_15_December_21.jpg", "publishedAt": "2022-04-07T22:15:40Z", "content": "The study also found that Omicron patients were 25% less likely to be admitted to hospital.\r\nParis: People who are vaccinated and have had a booster shot against Covid-19 recover from symptoms from t… [+2005 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Nobel Prize-Winning Journalist Attacked In Russia Over Ukraine Coverage", "description": "The Russian co-winner of last year's Nobel Peace Prize, Dmitry Muratov, was attacked on a train with red paint on Thursday, he said, in an apparent protest at his newspaper's coverage of Russia's invasion of Ukraine.", "url": "https://www.ndtv.com/world-news/russian-nobel-peace-laureate-journalist-dmitry-muratov-attacked-on-train-over-ukraine-coverage-2869819", "urlToImage": "https://c.ndtvimg.com/2021-10/3u3hdid_dmitry-muratov-nobel-peace-prize-afp-650_625x300_08_October_21.jpg", "publishedAt": "2022-04-07T22:02:34Z", "content": "Dmitry Muratov is a chief editor of Russia's leading independent newspaper Novaya Gazeta.\r\nMoscow: The Russian co-winner of last year's Nobel Peace Prize, Dmitry Muratov, was attacked on a train with… [+1709 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Joe Biden Calls Signs Of Ukraine Atrocities An \"Outrage\" To Humanity", "description": "US President Joe Biden on Thursday called the images emerging as Russian troops withdraw from parts of Ukraine an \"outrage\" to humanity, as he hailed Moscow's expulsion from the UN Human Rights Council.", "url": "https://www.ndtv.com/world-news/us-president-joe-biden-calls-signs-of-ukraine-atrocities-an-outrage-to-humanity-2869812", "urlToImage": "https://c.ndtvimg.com/2022-03/97mfb244_joe-biden-afp_625x300_31_March_22.jpg", "publishedAt": "2022-04-07T21:35:13Z", "content": "Earlier, Joe Biden said the Bucha discovery was \"outrageous.\"\r\nWashington: US President Joe Biden on Thursday called the images emerging as Russian troops withdraw from parts of Ukraine an \"outrage\" … [+454 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "EU Approves Ban On Russian Coal In New Round Of Sanctions: Report", "description": "The European Union on Thursday said it had approved an embargo on Russian coal as well as the closing of the bloc's ports to Russian vessels over the Ukraine war.", "url": "https://www.ndtv.com/world-news/eu-approves-ban-on-russian-coal-in-new-round-of-sanctions-over-ukraine-report-2869803", "urlToImage": "https://c.ndtvimg.com/2021-11/37vqsnko_crude-oil-reuters_625x300_23_November_21.jpg", "publishedAt": "2022-04-07T21:08:43Z", "content": "The EU nations import 45% of their coal from Russia, worth 4 billion euros a year.\r\nBrussels: The European Union on Thursday said it had approved an embargo on Russian coal as well as the closing of … [+1696 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Destruction In Borodianka \"Much More Horrific\" Than Bucha: Zelensky", "description": "The destruction left by Russian troops in the town of Borodianka outside of Kyiv is \"much more horrific\" than the situation uncovered in the nearby town of Bucha, Ukrainian President Volodymyr Zelensky said on Thursday.", "url": "https://www.ndtv.com/world-news/destruction-in-borodianka-much-more-horrific-than-bucha-ukraines-zelensky-2869799", "urlToImage": "https://c.ndtvimg.com/2022-03/n0jpugl_ukraine-president-volodymyr-zelensky-_625x300_11_March_22.jpg", "publishedAt": "2022-04-07T20:55:57Z", "content": "According to Zelensky, there are even more victims of Russian occupiers in Borodianka.\r\nKyiv: The destruction left by Russian troops in the town of Borodianka outside of Kyiv is \"much more horrific\" … [+422 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Bans Australian, New Zealand Prime Ministers From Entering", "description": "Moscow on Thursday announced entry bans on the leaders of Australia and New Zealand in tit-for-tat measures after Canberra and Wellington imposed sanctions on Russia over its war in Ukraine.", "url": "https://www.ndtv.com/world-news/russia-bans-australian-pm-scott-morrison-new-zealand-prime-minister-jacinda-ardern-from-entering-2869794", "urlToImage": "https://c.ndtvimg.com/2022-03/d0f39u9_putin-afp_625x300_10_March_22.jpg", "publishedAt": "2022-04-07T20:41:36Z", "content": "The Russian Foreign Ministry accused Australia and New Zealand of \"hostile actions\" towards Russia.\r\nMoscow: Moscow on Thursday announced entry bans on the leaders of Australia and New Zealand in tit… [+1157 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine Says 26 Bodies Found In 2 Destroyed Buildings Near Kyiv", "description": "Ukraine on Thursday said it had recovered 26 bodies from underneath two destroyed apartment buildings in the town of Borodianka, north-west of Kyiv, again accusing Moscow of targeting civilian areas.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-ukraine-says-26-bodies-found-in-2-destroyed-buildings-near-kyiv-2869755", "urlToImage": "https://c.ndtvimg.com/2022-03/dcp8sqro_ukraine-war-afp-650_625x300_30_March_22.jpg", "publishedAt": "2022-04-07T20:18:38Z", "content": "Ukraine's Prosecutor General accused Russian forces of engaging in \"killings and torture\" of civilians.\r\nKyiv: Ukraine on Thursday said it had recovered 26 bodies from underneath two destroyed apartm… [+1215 chars]"}]}