{"status": "ok", "totalResults": 264, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Beijing Reports Highest Number Of Cases In 3 Weeks", "description": "Beijing reported the highest number of daily Covid-19 cases in three weeks, with the capital moving to re-impose some restrictions just days after starting to ease them and appearing to avoid a broad lockdown like Shanghai.", "url": "https://www.ndtv.com/world-news/beijing-covid-19-cases-beijing-reports-highest-number-of-cases-in-3-weeks-3064641", "urlToImage": "https://c.ndtvimg.com/2022-05/63rcmdak_beijing-lockdown_625x300_30_May_22.jpg", "publishedAt": "2022-06-14T02:11:47Z", "content": "Most schools in Beijing delayed a reopening that was planned for Monday.\r\nBeijing reported the highest number of daily Covid-19 cases in three weeks, with the capital moving to re-impose some restric… [+2450 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"A Kangaroo Court\": Trump Slams US Congress Probe Into Capitol Hill Riots", "description": "Former US president Donald Trump on Monday decried the congressional probe into the riot by his supporters last year at the US Capitol as a \"mockery of justice\".", "url": "https://www.ndtv.com/world-news/a-kangaroo-court-trump-slams-us-congress-probe-into-capitol-hill-riots-3064640", "urlToImage": "https://c.ndtvimg.com/2022-02/kr9u49fk_donald-trump-reuters_625x300_20_February_22.jpg", "publishedAt": "2022-06-14T02:11:12Z", "content": "Americans showed up in Washington on January 6, 2021, to hold elected officials accountable, Trump said\r\nFormer US president Donald Trump on Monday decried the congressional probe into the riot by hi… [+622 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"They Bomb And They Bomb\": Civilians In Ukraine Frontline City In Despair", "description": "Ukrainian artillery uses its high ground to exchange fire with Russian forces fighting for control of Severodonetsk, just across the river.", "url": "https://www.ndtv.com/world-news/they-bomb-and-they-bomb-civilians-in-ukraine-frontline-city-in-despair-3064635", "urlToImage": "https://c.ndtvimg.com/2022-06/qumda79g_lysychansk-afp_625x300_14_June_22.jpg", "publishedAt": "2022-06-14T02:04:46Z", "content": "At the entrance to the city, the roadside had craters from shelling.\r\nLysychansk: Maksym Katerin was red-eyed Monday as he showed the fresh graves of his mother and stepfather, scattered with rose pe… [+3791 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Edited by NDTV News Desk", "title": "Rahul Gandhi's Questioning Live Updates: Congress Leader Summoned Again Today", "description": "Congress leader Rahul Gandhi was questioned for over 10 hours by the Enforcement Directorate (ED) in a money-laundering probe linked to the National Herald newspaper on Monday and was called to depose again on Tuesday.", "url": "https://www.ndtv.com/india-news/rahul-gandhis-questioning-live-updates-congress-leader-to-depose-before-enforcement-directorate-again-3064629", "urlToImage": "https://c.ndtvimg.com/2022-06/81kd6hn_rahul-gandhi-pti_625x300_13_June_22.jpg", "publishedAt": "2022-06-14T01:55:03Z", "content": "He left the ED office around 11.10 pm after questioning on Tuesday (File)\r\nNew Delhi: Congress leader Rahul Gandhi was questioned for over 10 hours by the Enforcement Directorate (ED) in a money-laun… [+619 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE: Over 8,000 New Covid Cases, 10 Deaths In 24 Hours", "description": "India on Monday reported at least 8,084 new coronavirus cases, bringing the COVID-19 tally to 4,32,30,101.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-14-june-3064606", "urlToImage": "https://c.ndtvimg.com/2021-08/imokvbr_coronavirus-india-reuters-2021_650x400_18_August_21.jpg", "publishedAt": "2022-06-14T01:20:49Z", "content": "India Covid: The active cases stand at 47,995, comprising 0.1 per cent of the cumulative cases in India.\r\nNew Delhi: India on Monday reported at least 8,084 new coronavirus cases, bringing the COVID-… [+431 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Musk To Address Twitter Staff This Week For First Time Since Deal: Report", "description": "Elon Musk will speak to Twitter Inc employees this week for the first time since launching his $44 billion bid in April, a source said on Monday, citing an email from Twitter Chief Executive Parag Agrawal to staff.", "url": "https://www.ndtv.com/world-news/elon-musk-to-address-twitter-staff-this-week-for-first-time-since-deal-report-3064589", "urlToImage": "https://c.ndtvimg.com/2022-05/j9q7c708_elon-musk_625x300_04_May_22.jpg", "publishedAt": "2022-06-14T00:50:10Z", "content": "A Twitter spokesperson confirmed that Musk would attend the company all-hands meeting this week. (File)\r\nSan Francisco: Elon Musk will speak to Twitter Inc employees this week for the first time sinc… [+1000 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Shakti Kapoor's Son, Siddhanth, Released On Bail In Drugs Case", "description": "Bollywood actor Shraddha Kapoor's brother Siddhanth Kapoor has now been released on bail after he was arrested on Monday when his medical reports confirmed his consumption of drugs.", "url": "https://www.ndtv.com/india-news/shakti-kapoors-son-siddhanth-kapoor-released-on-bail-in-drugs-case-3064580", "urlToImage": "https://c.ndtvimg.com/2022-06/7ad2ti2_siddhanth-kapoor_625x300_13_June_22.jpg", "publishedAt": "2022-06-14T00:33:16Z", "content": "Bengaluru police confirmed that Siddhanth Kapoor's medical shows he had consumed drugs. (File)\r\nBengaluru: Bollywood actor Shraddha Kapoor's brother Siddhanth Kapoor has now been released on bail aft… [+1748 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "2 Killed, 4 Injured As Temple Chariot Capsizes In Tamil Nadu: Police", "description": "Two men were killed and four others sustained injuries when a huge chariot of a popular temple in Papparapatti here capsized on Monday, police said.", "url": "https://www.ndtv.com/india-news/2-killed-4-injured-as-temple-chariot-capsizes-in-tamil-nadus-dharmapuri-police-3064576", "urlToImage": "https://i.ndtvimg.com/i/2017-03/police-generic_650x400_71490246814.jpg", "publishedAt": "2022-06-14T00:16:37Z", "content": "Tamil Nadu CM announced a cash relief of Rs 5 lakh each to the families of the deceased.\r\nDharmapuri, West Bengal: Two men were killed and four others sustained injuries when a huge chariot of a popu… [+1380 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Fresh Protests Erupt In West Bengal Over Prophet Row", "description": "Locals in Birbhum on Monday staged a protest against the controversial remarks by suspended BJP spokesperson Nupur Sharma.", "url": "https://www.ndtv.com/india-news/fresh-protests-erupt-in-west-bengals-birbhum-over-prophet-row-3064571", "urlToImage": "https://c.ndtvimg.com/2022-06/m0l5djag_west-bengal-protest_625x300_14_June_22.jpg", "publishedAt": "2022-06-14T00:01:15Z", "content": "Prophet Row: Hundreds gathered to join the protest march against suspended BJP leader Nupur Sharma.\r\nBirbhum, West Bengal: Locals in Birbhum on Monday staged a protest against the controversial remar… [+931 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "National Herald Case: Questioning \"Someone\" Till 12 Midnight Wrong, Says Ashok Gehlot", "description": "Rajasthan Chief Minister Ashok Gehlot on Tuesday condemned the questioning of Congress leader Rahul Gandhi which went on till midnight by the Enforcement Directorate in the National Herald case.", "url": "https://www.ndtv.com/india-news/national-herald-case-questioning-someone-till-12-midnight-wrong-says-ashok-gehlot-3064560", "urlToImage": "https://c.ndtvimg.com/2020-08/d7gsgih8_ashok-gehlot-august-11-ndtv_625x300_11_August_20.jpg", "publishedAt": "2022-06-13T23:40:03Z", "content": "Ashok Gehlot also asked the Prime Minister Modi to address other issues in the country. (File)\r\nNew Delhi: Rajasthan Chief Minister Ashok Gehlot on Tuesday condemned the questioning of Congress leade… [+3560 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Congress MPs Detained For Hours, Released After Rahul Gandhi Left Enforcement Directorate Office", "description": "Top Congress leaders detained on Monday during the party's protest in solidarity with Rahul Gandhi, who was grilled by the ED in a money-laundering probe linked to the National Herald newspaper, were released from various police stations.", "url": "https://www.ndtv.com/india-news/congress-mps-detained-for-hours-released-after-rahul-gandhi-left-enforcement-directorate-office-3064544", "urlToImage": "https://c.ndtvimg.com/2022-06/7p06qq8o_priyanka-gandhi-vadra-with-congress-leaders-at-delhi-police-station_625x300_13_June_22.jpg", "publishedAt": "2022-06-13T23:01:48Z", "content": "Congress alleged that some of its leaders were manhandled by the police during protest.\r\nNew Delhi: Top Congress leaders detained on Monday during the party's protest in solidarity with Rahul Gandhi,… [+2743 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Says Its Key Goal To Protect People In Ukraine's Separatist Regions", "description": "Russia's main goal of its military operation in Ukraine is to protect the Donetsk and Luhansk people's republics, the Kremlin said on Monday, after the leader of one of the separatist regions asked for additional forces from Moscow.", "url": "https://www.ndtv.com/world-news/russia-says-its-key-goal-to-protect-people-in-ukraines-separatist-regions-3064536", "urlToImage": "https://c.ndtvimg.com/2022-04/ofrrlk7k_ukraines-luhansk_625x300_09_April_22.jpg", "publishedAt": "2022-06-13T22:19:17Z", "content": "Protection of the separatist is the main goal of the special military operation, Russia said.\r\nMoscow: Russia's main goal of its military operation in Ukraine is to protect the Donetsk and Luhansk pe… [+1622 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Bengal's Advisory To Cable Operators On Content With \"Communal Tone\"", "description": "The West Bengal government on Monday issued an advisory for all multiple-system operators (MSOs) and cable operators in the state.", "url": "https://www.ndtv.com/india-news/refrain-from-airing-communal-content-bengal-to-tv-network-providers-3064525", "urlToImage": "https://c.ndtvimg.com/2022-03/r8l7mgf_mamata-banerjee-presser-650_625x300_17_March_22.jpg", "publishedAt": "2022-06-13T21:47:08Z", "content": "West Bengal government advised the TV network providers to refrain from Communal content in news debate.\r\nKolkata: The West Bengal government on Monday issued an advisory for all multiple-system oper… [+803 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "2 Lashkar Terrorists Killed In Srinagar Encounter In Jammu And Kashmir", "description": "Two terrorists were killed in an encounter that broke out in the Bemina area of Srinagar, informed the police on Tuesday.", "url": "https://www.ndtv.com/india-news/2-lashkar-terrorists-killed-in-srinagar-encounter-in-jammu-and-kashmir-3064516", "urlToImage": "https://c.ndtvimg.com/2022-01/52iv7a4s_jammu-and-kashmir-encounter-pti_625x300_22_January_22.jpg", "publishedAt": "2022-06-13T21:11:19Z", "content": "The police called the Srinagar encounter 'a big success.' (Representational)\r\nSrinagar: Two terrorists were killed in an encounter that broke out in the Bemina area of Srinagar, informed the police o… [+1566 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Property Rights Can't Be Denied To Son Of Couple Who Lived Together: Supreme Court", "description": "The Supreme Court Monday said the \"law presumes in favour of marriage and against concubinage\" if a man and woman cohabited for a long period and their son cannot be denied the shares in the ancestral properties.", "url": "https://www.ndtv.com/india-news/property-rights-cant-be-denied-to-son-of-couple-who-lived-together-supreme-court-3064505", "urlToImage": "https://c.ndtvimg.com/2022-02/a1ooga8_supreme-court-of-india_650x400_14_February_22.jpg", "publishedAt": "2022-06-13T20:35:15Z", "content": "Court said law presumes marriage if couple lived together and property rights cant be denied to son.\r\nNew Delhi: The Supreme Court Monday said the \"law presumes in favour of marriage and against conc… [+4090 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UN Urges WTO Not To Impose Food Export Restrictions Amid Crisis", "description": "The United Nations on Monday begged world trade ministers meeting at the WTO not to impose export restrictions on food for humanitarian purposes, amid a food security crisis.", "url": "https://www.ndtv.com/world-news/un-urges-wto-not-to-impose-food-export-restrictions-amid-crisis-3064470", "urlToImage": "https://c.ndtvimg.com/2021-03/kfme0828_un-high-commissioner-for-human-rights-michelle-bachelet_625x300_23_March_21.jpg", "publishedAt": "2022-06-13T20:13:29Z", "content": "Ukraine war increasing the risk of hunger for tens of millions of people, UN human rights chief said.\r\nGeneva: The United Nations on Monday begged world trade ministers meeting at the WTO not to impo… [+2649 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Trump Knew Election Fraud Claims Were False, His Aides Say", "description": "Donald Trump ignored repeated warnings from top aides against claiming the 2020 election was stolen, according to testimony unveiled Monday by the congressional panel probing the 2021 assault on the US Capitol.", "url": "https://www.ndtv.com/world-news/former-us-president-donald-trump-knew-election-fraud-claims-were-false-his-aides-say-3064447", "urlToImage": "https://c.ndtvimg.com/2022-02/kr9u49fk_donald-trump-reuters_625x300_20_February_22.jpg", "publishedAt": "2022-06-13T19:45:49Z", "content": "Trump's campaign manager advised him not to declare victory on election night because he hadn't won.\r\nWashington: Donald Trump ignored repeated warnings from top aides against claiming the 2020 elect… [+4312 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Online \"Hate And Vitriol\" During Depp Trial Not \"Fair\": Amber Heard", "description": "Amber Heard said the \"hate and vitriol\" she suffered on social media during her libel trial against Johnny Depp was not \"fair,\" but insisted in an interview released Monday she did not blame the jury for largely siding with her ex-husband.", "url": "https://www.ndtv.com/world-news/online-hate-and-vitriol-during-johnny-depp-trial-not-fair-amber-heard-3064425", "urlToImage": "https://c.ndtvimg.com/2022-06/29bg858o_amber-heard_625x300_02_June_22.jpg", "publishedAt": "2022-06-13T19:22:52Z", "content": "Amber Heard breaks silence on \"hate\" shes receiving for trial against Johnny Depp in defamation case.\r\nWashington: Amber Heard said the \"hate and vitriol\" she suffered on social media during her libe… [+2240 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US, Allies Would Respond \"Quickly\" To North Korea If...: Blinken Warns", "description": "Secretary of State Antony Blinken promised Monday that the United States would respond swiftly with its allies and was ready to adjust its military posture if North Korea goes ahead with a nuclear test.", "url": "https://www.ndtv.com/world-news/us-allies-would-respond-quickly-to-north-korea-nuclear-test-antony-blinken-warns-3064388", "urlToImage": "https://c.ndtvimg.com/2022-06/r8i3iksg_blinken-afp_625x300_01_June_22.jpg", "publishedAt": "2022-06-13T18:51:13Z", "content": "Antony Blinken said that US will act swiftly with its allies if North Korea tests nukes. (File)\r\nWashington: Secretary of State Antony Blinken promised Monday that the United States would respondAand… [+523 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Not In the Race To Become India's Next President, Says Nitish Kumar", "description": "Presidential Elections 2022: Bihar Chief Minister Nitish Kumar on Monday categorically said he is not in the race in the July presidential election. \"I repeat I am not in the race to become the country's next President,\" Nitish Kumar said.", "url": "https://www.ndtv.com/india-news/presidential-elections-2022-not-in-the-race-to-become-indias-next-president-says-bihar-chief-minister-nitish-kumar-3064381", "urlToImage": "https://c.ndtvimg.com/2022-04/gg85flog_nitish-kumar_625x300_21_April_22.png", "publishedAt": "2022-06-13T18:39:27Z", "content": "The election for India's President will be held on July 18, counting on July 21. (File)\r\nPatna: Bihar Chief Minister Nitish Kumar on Monday categorically said he is not in the race in the July presid… [+1873 chars]"}]}