{"status": "ok", "totalResults": 520, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Japan Hosts Quad Summit Seeking Unity On Countering China", "description": "The leaders of Japan, India, Australia and the United States meet in Tokyo on Tuesday seeking common ground on countering China's growing regional economic and military clout.", "url": "https://www.ndtv.com/world-news/japan-hosts-quad-summit-seeking-unity-on-countering-china-3003129", "urlToImage": "https://c.ndtvimg.com/2022-05/h5j2af3g_quad-meet_625x300_23_May_22.jpg", "publishedAt": "2022-05-23T22:34:10Z", "content": "Biden warned China it was \"flirting with danger\" as it steps up military activity around Taiwan.\r\nTokyo: The leaders of Japan, India, Australia and the United States meet in Tokyo on Tuesday seeking … [+3629 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Climate Change Made India's 2022 Heatwave 30 Times More Likely: Report", "description": "The punishing heatwave that scorched India and Pakistan in March and April was made 30 times more likely by climate change, experts in quantifying the impact of global warming on extreme weather events said in a rapid-response report Monday.", "url": "https://www.ndtv.com/india-news/climate-change-made-indias-2022-heatwave-30-times-more-likely-report-3003122", "urlToImage": "https://c.ndtvimg.com/2022-04/tu47hgps_delhi-heat-wave_625x300_29_April_22.jpg", "publishedAt": "2022-05-23T22:06:55Z", "content": "The March-April period was the hottest on record for that time of year in Pakistan and India.\r\nParis: The punishing heatwave that scorched India and Pakistan in March and April was made 30 times more… [+4305 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Uyghurs Urge UN Rights Chief To Ask Hard Questions In Xinjiang", "description": "Uyghurs have urged UN human rights chief Michelle Bachelet to avoid falling victim to a public relations stunt as her trip to China enters a delicate new phase on Tuesday with a visit to the remote Xinjiang region.", "url": "https://www.ndtv.com/world-news/ask-hard-questions-in-xinjiang-uyghurs-to-un-rights-chief-michelle-bachelet-3003115", "urlToImage": "https://c.ndtvimg.com/2021-06/u73jhvjk_un-human-rights-chief-michelle-bachelet-reuters-650_625x300_11_June_21.jpg", "publishedAt": "2022-05-23T21:45:10Z", "content": "Bachelet is expected to visit the Xinjiang cities Urumqi and Kashgar on Tuesday.\r\nBeijing: Uyghurs have urged UN human rights chief Michelle Bachelet to avoid falling victim to a public relations stu… [+3932 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Willing To Meet Vladimir Putin To End War: Ukraine's Zelensky In Davos", "description": "Ukrainian President Volodymyr Zelenskiy said on Monday that President Vladimir Putin was the only Russian official he was willing to meet with to discuss how to end the war.", "url": "https://www.ndtv.com/world-news/willing-to-meet-vladimir-putin-to-end-war-ukraine-president-volodymyr-zelensky-in-davos-3003106", "urlToImage": "https://c.ndtvimg.com/2022-05/bca7ka1s_ukraine-president-volodymyr-zelensky_625x300_21_May_22.jpg", "publishedAt": "2022-05-23T21:18:46Z", "content": "Ukraine's Zelensky was addressing by video link an audience at the World Economic Forum in Davos.\r\nDavos: Ukrainian President Volodymyr Zelenskiy said on Monday that President Vladimir Putin was the … [+1988 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Climate Action On CO2 Emissions Alone Won't Prevent Extreme Warming: Study", "description": "To control climate change, the world must go beyond cutting carbon dioxide emissions and curb lesser-known pollutants such as nitrous oxide playing a key role in warming the planet, new research suggests.", "url": "https://www.ndtv.com/world-news/global-warming-climate-action-on-co2-emissions-alone-wont-prevent-extreme-warming-study-3003099", "urlToImage": "https://i.ndtvimg.com/i/2018-04/pollution-climate-change-pixabay_650x400_81524926252.jpg", "publishedAt": "2022-05-23T20:51:04Z", "content": "The common goal of reaching \"net-zero\" emissions refers most often to CO2 emissions alone.\r\nWashington: To control climate change, the world must go beyond cutting carbon dioxide emissions and curb l… [+2524 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Turkey's Erdogan Says He Will No Longer Talk To Greek PM", "description": "Turkish President Tayyip Erdogan said on Monday that Greek Prime Minister Kyriakos Mitsotakis \"no longer exists\" for him, accusing the Greek leader of trying to block sales of F-16 fighter jets to Turkey during a visit to the United States.", "url": "https://www.ndtv.com/world-news/turkey-president-recep-tayyip-erdogan-says-he-will-no-longer-talk-to-greek-pm-kyriakos-mitsotakis-3003078", "urlToImage": "https://c.ndtvimg.com/recep-tayyip-erdogan_afp_650_625x300_1530704449785.jpg", "publishedAt": "2022-05-23T20:30:25Z", "content": "\"He no longer exists for me. I will never agree to meet with him,\" Turkey's Erdogan said.\r\nAnkara:  Turkish President Recep Tayyip Erdogan said on Monday that Greek Prime Minister Kyriakos Mitsotakis… [+1408 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukrainian Filmmaker Plans To Make Documentary On Russian Invasion", "description": "Ukrainian filmmaker Sergei Loznitsa plans to make a documentary about the war in his country, he said on Monday at the Cannes Film Festival, where he showed his film \"The Natural History of Destruction.\"", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-ukrainian-filmmaker-sergei-loznitsa-plans-to-make-documentary-on-russian-invasion-3003069", "urlToImage": "https://c.ndtvimg.com/2022-04/kst6mvp8_russia-ukraine-war-reuters_625x300_17_April_22.jpeg", "publishedAt": "2022-05-23T20:10:00Z", "content": "Ukrainian filmmaker Sergei Loznitsa said he will make a documentary about Russian atrocities in Ukraine.\r\nCannes, France: Ukrainian filmmaker Sergei Loznitsa plans to make a documentary about the war… [+1904 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Telangana Attracts Huge Investments On Day 1 Of World Economic Forum", "description": "On the first day of the World Economic Forum (WEF) Summit in Davos, Switzerland, many companies have come forward to invest in Telangana with Lulu Group announcing to invest Rs 500 crore.", "url": "https://www.ndtv.com/india-news/telangana-attracts-huge-investments-on-day-1-of-world-economic-forum-3002998", "urlToImage": "https://c.ndtvimg.com/2022-05/ehp4erl8_ktr-davos-650_625x300_24_May_22.jpg", "publishedAt": "2022-05-23T18:43:55Z", "content": "KTR welcomed Swiss Re also for establishing its unit in Hyderabad.\r\nHyderabad: On the first day of the World Economic Forum (WEF) Summit in Davos, Switzerland, many companies have come forward to inv… [+4066 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "POP THAI Delivers Great Food That Pops Out Bags Of Flavours", "description": "Drawing inspiration from 1970s Bangkok, the deconstructed POP THAI menu presents authentic Thai flavours in a pop avatar", "url": "https://food.ndtv.com/reviews/pop-thai-delivers-great-food-that-pops-out-bags-of-flavours-3002993", "urlToImage": "https://c.ndtvimg.com/2022-05/c74embig_pop-thai_625x300_24_May_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-23T18:41:40Z", "content": "It's rare that when I sit down to pen down a review I start remembering and craving for the food that I ate. POP THAI  is one of the very few places that won my heart with great food. Drawing inspira… [+1780 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Shameless Hypocrisy\": Tamil Nadu Minister Challenges Nirmala Sitharaman", "description": "Tamil Nadu Finance Minister Palanivel Thiagarajan's fiery takedown came two days after Nirmala Sitharaman announced a series of tax cuts on fuel.", "url": "https://www.ndtv.com/tamil-nadu-news/tamil-nadu-minister-challenges-nirmala-sitharaman-on-fuel-tax-cuts-3002990", "urlToImage": "https://c.ndtvimg.com/2022-05/cjojdhgk_palanivel-thiagarajan-ndtv_625x300_24_May_22.jpg", "publishedAt": "2022-05-23T18:40:59Z", "content": "Tamil Nadu Finance Minister Palanivel Thiagarajan hit out Nirmala Sitharaman on Monday.\r\nNew Delhi: Tamil Nadu Finance Minister Palanivel Thiagarajan pulled no punches as he took on Union Finance Min… [+2531 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Overcharged For Water Consumption, Couple Dies By Suicide In Maharashtra", "description": "A couple allegedly died by suicide after being overcharged for water consumption by their landlord in Kalamna area of Nagpur.", "url": "https://www.ndtv.com/nagpur-news/overcharged-for-water-consumption-couple-dies-by-suicide-maharashtra-cops-3002974", "urlToImage": "https://c.ndtvimg.com/2022-05/204ao7pg_maharashtra-police_625x300_12_May_22.jpg", "publishedAt": "2022-05-23T18:26:27Z", "content": "A suicide note was recovered from the spot, the police said. (Representational)\r\nNagpur: A couple allegedly died by suicide after being overcharged for water consumption by their landlord in Kalamna … [+668 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "At Geneva Meet, India Says Disappointed Over WHO Excess Mortality Report", "description": "India on Monday expressed dismay and concern over the WHO's recent report on all-cause excess mortality estimates, saying authentic data published by the statutory authority has not been taken into account.", "url": "https://www.ndtv.com/india-news/at-geneva-meet-india-says-disappointed-over-whos-excess-mortality-report-3002957", "urlToImage": "https://c.ndtvimg.com/2022-05/bs788nl_mansukh-mandaviya-geneva-ani-650-_625x300_23_May_22.jpg", "publishedAt": "2022-05-23T18:18:27Z", "content": "According to the report, there were 4.7 million Covid deaths in India - 10 times the official figure\r\nNew Delhi: India on Monday expressed dismay and concern over the WHO's recent report on all-cause… [+2174 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Delhi Civic Bodies Unified, Now Pay Pending Salaries: AAP To Centre", "description": "The Aam Aadmi Party demanded the BJP-led Central government \"immediately\" pay the pending salaries of the civic body's employees.", "url": "https://www.ndtv.com/delhi-news/delhi-civic-bodies-unified-now-pay-pending-salaries-aap-to-centre-3002943", "urlToImage": "https://i.ndtvimg.com/i/2017-04/mcd-civic-centre_650x400_61492442731.jpg", "publishedAt": "2022-05-23T18:12:32Z", "content": "The unified Municipal Corporation of Delhi (MCD) formally came into being on Sunday.\r\nNew Delhi: With a unified Municipal Corporation of Delhi (MCD) formally coming into existence, the Aam Aadmi Part… [+1855 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Coin In Bitcoin Name Doesn't Make It Money: IMF Chief", "description": "IMF chief Kristalina Georgieva on Monday said anything not backed by a sovereign guarantee can be an asset class but not a currency, as she asserted that Bitcoin cannot be 'money' just because it has got 'coin' in its name.", "url": "https://www.ndtv.com/world-news/coin-in-bitcoin-name-doesnt-make-it-money-imf-chief-3002923", "urlToImage": "https://c.ndtvimg.com/2021-02/vs2s9epg_imf-chief-kristalina-georgieva-650_625x300_06_February_21.jpg", "publishedAt": "2022-05-23T18:06:28Z", "content": "I always speak of crypto as assets and not as currencies, said the IMF chief. (FILE)\r\nDavos: IMF chief Kristalina Georgieva on Monday cautioned against confusing crypto products with currencies and s… [+2465 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "China Says US \"Playing With Fire\" On Taiwan: Report", "description": "The United States is \"playing with fire,\" the Chinese State Council's Taiwan Affairs Office said Monday, after President Joe Biden vowed to defend the self-ruled island in the event Beijing attempts to take control, state media reported.", "url": "https://www.ndtv.com/world-news/china-says-us-playing-with-fire-on-taiwan-report-3002919", "urlToImage": "https://c.ndtvimg.com/2021-11/0g8u2n7g_us-taiwan-flags-reuters_625x300_25_November_21.jpg", "publishedAt": "2022-05-23T18:05:15Z", "content": "The United States is using the Taiwan card to contain China, a Chinese council member said. (File)\r\nBeijing: The United States is \"playing with fire,\" the Chinese State Council's Taiwan Affairs Offic… [+1289 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Vastrakar Stars As Supernovas Beat Trailblazers In Women's T20 Challenge", "description": "The 22-year-old Vastrakar claimed the wickets of Trailblazers' captain Smriti Mandhana (34), her opening partner Hayley Matthews (18), No. 4 Sophia Dunkley (1) and Salma Khatun (0)", "url": "https://sports.ndtv.com/cricket/pooja-vastrakar-stars-as-supernovas-defeat-trailblazers-by-49-runs-in-womens-t20-challenge-opener-3002915", "urlToImage": "https://c.ndtvimg.com/2022-05/m7ffq138_pooja-vastrakar-bcci_625x300_23_May_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-23T18:03:08Z", "content": "Pooja Vastrakar picked up four wickets for just 12 runs in a brilliant pace-bowling display as Supernovas notched up an easy 49-run win over Trailblazers in a record-breaking opening match of the Wom… [+3447 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Tamil Nadu Government Issues Directives To Monitor Monkeypox Cases", "description": "Tamil Nadu government today directed the district Collectors and Commissioners of Corporations to monitor and identify suspected cases of monkeypox, if any, and isolate them at healthcare facilities for appropriate treatment.", "url": "https://www.ndtv.com/tamil-nadu-news/monkeypox-cases-monitor-monkeypox-cases-isolated-suspected-cases-tamil-nadu-government-3002906", "urlToImage": "https://c.ndtvimg.com/2019-05/3a4q3q6g_monkeypox_625x300_10_May_19.jpg", "publishedAt": "2022-05-23T17:56:34Z", "content": "Monkeypox is usually a self-limited disease with the symptoms lasting from two to four weeks.\r\nChennai: Tamil Nadu government today directed the district Collectors and Commissioners of Corporations … [+2002 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Heavy Rain Along With Thunder And Lightning In Parts Of Delhi Again", "description": "Heavy rain, along with thunderstorm, hit Delhi again on Monday evening after the first bout early morning gave residents much-needed respite from the scorching heat and brought down the mercury to its...", "url": "https://www.ndtv.com/india-news/heavy-rain-along-with-thunder-and-lightning-in-parts-of-delhi-again-3002888", "urlToImage": "https://c.ndtvimg.com/2022-05/slqaf0tk_delhi-rain-650_625x300_23_May_22.jpg", "publishedAt": "2022-05-23T17:48:20Z", "content": "Heavy rain, along with thunderstorm, hit Delhi again on Monday evening after the first bout early this morning. The late evening showers have delayed several flights, while some have been diverted fo… [+871 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Pak-Origin UK Ex-MP Jailed For Sexual Assault Of 15-Year-Old", "description": "A Pakistani-origin Conservative Party former member of Parliament from northern England, who was found guilty of sexually assaulting a 15-year-old at a house over 13 years ago, has been sentenced to 18 months imprisonment by a court in London.", "url": "https://www.ndtv.com/world-news/pak-origin-uk-ex-mp-jailed-for-sexual-assault-of-15-year-old-3002883", "urlToImage": "https://c.ndtvimg.com/2022-05/q7jo4s1g_uk-mp-jailed_625x300_23_May_22.jpg", "publishedAt": "2022-05-23T17:47:14Z", "content": "Imran Ahmad Khan denied sexual assault and claimed he only touched the Catholic teenager's elbow. (PTI)\r\nLondon: A Pakistani-origin Conservative Party former member of Parliament from northern Englan… [+2221 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "India Should Consider Boycotting CWG For Dropping Shooting: Manu Bhaker", "description": "In a big jolt to India, shooting as well as wrestling and archery were dropped from the initial list of sports for 2026 Commonwealth Games in Australia", "url": "https://sports.ndtv.com/othersports/indian-team-should-consider-boycotting-commonwealth-games-for-dropping-shooting-manu-bhaker-3002882", "urlToImage": "https://c.ndtvimg.com/2021-07/nd0ao9t_manu-bhaker-afp_650x400_25_July_21.jpg", "publishedAt": "2022-05-23T17:47:06Z", "content": "Pistol ace Manu Bhaker on Monday said that the Indian team should consider boycotting the Commonwealth Games in protest against the dropping of shooting from the roster. In a big jolt to India, shoot… [+1359 chars]"}]}