{"status": "ok", "totalResults": 480, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "IPL Live: Lucknow Super Giants Face Gujarat In Top-Of-The-Table Clash", "description": "IPL 2022, Lucknow Super Giants vs Gujarat Titans Live IPL Score Updates: LSG face GT in their Indian Premier League match, at the Maharashtra Cricket Association Stadium in Pune.", "url": "https://sports.ndtv.com/ipl-2022/live-ipl-score-lsg-vs-gt-live-cricket-score-lucknow-super-giants-vs-gujarat-titans-live-scoreboard-and-updates-2963018", "urlToImage": "https://c.ndtvimg.com/2022-05/g3hepeb_hardik-pandya-bcci-ipl_625x300_10_May_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-10T12:32:37Z", "content": "In a top-of-the-table clash, table toppers Lucknow Super Giants (LSG) take on second-placed Gujarat Titans (GT) in Match 57 of the Maharashtra Cricket Association Stadium in Pune, on Tuesday. Lucknow… [+569 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Lucknow Prof Manhandled Over Comments On Varanasi Temple-Mosque Issue", "description": "An associate professor of Hindi at Lucknow University, Ravi Kant Chandan, was heckled today by members of the Rashtriya Swayamsevak Sangh's student wing ABVP over his comments on the Kashi Vishwanath temple-Gyanvapi mosque controversy.", "url": "https://www.ndtv.com/india-news/lucknow-professor-ravi-kant-chandan-manhandled-over-comments-on-varanasi-temple-mosque-issue-2963016", "urlToImage": "https://c.ndtvimg.com/2022-05/p86moqm8_ravi-kant-chandan_625x300_10_May_22.jpg", "publishedAt": "2022-05-10T12:31:55Z", "content": "Ravi Kant Chandan (circled) of Lucknow University was heckled today by ABVP members\r\nLucknow: An associate professor of Hindi at Lucknow University was heckled today by members of the Rashtriya Swaya… [+3241 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Viral Video: Man's 'Unnecessary Invention' Called 'The Food Funnel' Has Attracted Foodies", "description": "This foodie invention has gone viral with the video garnering 19.2 million views and around 698k likes!", "url": "https://food.ndtv.com/food-drinks/viral-video-mans-unnecessary-invention-called-the-food-funnel-has-attracted-foodies-2963000", "urlToImage": "https://c.ndtvimg.com/2022-05/a1k6ufg_food-funnel_625x300_10_May_22.jpeg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-10T12:28:55Z", "content": "An 'unnecessary invention' has caught the eyes of foodies all around the world! One man on the internet has created a unique invention called the 'food funnel'. His design is focused on saving food b… [+1757 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Apocalypse?\" Blood Red Sky Over Chinese City Stumps Internet", "description": "In a strange incident, residents in China's eastern port city of Zhoushan were left stunned as the skies turned red briefly over the weekend. Meteorological experts scrambled to figure out what was causing the scary-looking red sky.", "url": "https://www.ndtv.com/world-news/apocalypse-sky-over-chinese-port-city-turns-blood-red-internet-stumped-2962983", "urlToImage": "https://c.ndtvimg.com/2022-05/5dnrju98_china-red-sky-650_625x300_10_May_22.jpg", "publishedAt": "2022-05-10T12:24:35Z", "content": "Experts confirmed that no fire was reported around the time skies turned red.\r\nIn a strange incident, residents in China's eastern port city of Zhoushan were left stunned as the skies turned red brie… [+2291 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Raw Mango Dal With Aloo Chokha: Bengal's Summer-Special Lunch Combination You Must Try", "description": "Referred to as tok dal or aam dal, raw mango dal makes for a classic meal during the hot afternoons in Bengal. It tastes best when paired with rice and aloo chokha.", "url": "https://food.ndtv.com/how-to/raw-mango-dal-with-aloo-chokha-bengals-summer-special-lunch-combination-you-must-try-2962945", "urlToImage": "https://c.ndtvimg.com/2022-05/s2h2gdv8_tok-dal_625x300_10_May_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-10T12:12:57Z", "content": "Bengal is known for its culinary history that goes back to more than thousand years. In fact, Bengal's gastronomy is a melting pot of many influences, making it unique and diversified (as its culture… [+3436 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Ex-England Batter Graham Thorpe \"Seriously Ill\" In Hospital", "description": "A stylish left-handed batsman, Graham Thorpe played 100 Test matches for England, scoring 6,744 runs at an average of 44.66 and hitting 16 centuries. He also played 82 one-day internationals.", "url": "https://sports.ndtv.com/cricket/ex-england-batter-graham-thorpe-seriously-ill-in-hospital-2962918", "urlToImage": "https://c.ndtvimg.com/2022-02/rmgueckg_graham-thorpe_625x300_04_February_22.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-10T12:08:47Z", "content": "Former England batsman and assistant coach Graham Thorpe is \"seriously ill\" in hospital, the Professional Cricketers' Association said on Tuesday. Thorpe, 52, had accepted the job of Afghanistan head… [+1144 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "No Talks On Cabinet Expansion: Karnataka Chief Minister On Delhi Visit", "description": "With his visit to the national capital raising hopes among ministerial aspirants about the expansion or rejig of Karnataka Cabinet, Chief Minister Basavaraj Bommai on Tuesday said he will not be holding discussion in this connection with BJP leaders.", "url": "https://www.ndtv.com/india-news/karnataka-cabinet-expansion-karnataka-chief-minister-basavaraj-bommai-no-talks-on-cabinet-expansion-karnataka-chief-minister-on-delhi-visit-2962812", "urlToImage": "https://c.ndtvimg.com/2021-09/mbojk3gc_basavaraj-bommai_625x300_15_September_21.jpg", "publishedAt": "2022-05-10T12:07:24Z", "content": "Karnataka Cabinet Expansion: Karnataka Chief Minister Basavaraj Bommai is under pressure.\r\nNew Delhi/Bengaluru: With his visit to the national capital raising hopes among ministerial aspirants about … [+2225 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Maharashtra Announces State Funeral For Santoor Maestro Shivkumar Sharma", "description": "Pt Shivkumar Sharma will be accorded a state funeral, Chief Minister Uddhav Thackeray's office said in a statement on Tuesday as he and Governor Bhagat Singh Koshyari led other leaders in condoling the death of the Santoor maestro.", "url": "https://www.ndtv.com/india-news/maharashtra-announces-state-funeral-for-santoor-maestro-shivkumar-sharma-2962904", "urlToImage": "https://c.ndtvimg.com/2022-05/mp0mer4_pandit-shivkumar-sharma-shiv-kumar-sharma-ndtv-file-photo_625x300_10_May_22.jpg", "publishedAt": "2022-05-10T12:05:41Z", "content": "Pt Shivkumar Sharma died in Mumbai on Tuesday following a heart attack. He was 84.\r\nMumbai: Pt Shivkumar Sharma will be accorded a state funeral, Chief Minister Uddhav Thackeray's office said in a st… [+1858 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "HC Says Maha Govt To Give Orphan Certificate To 2 Students Taking NEET", "description": "The Bombay High Court has directed the Maharashtra government to forthwith issue an 'orphan certificate' to two students, residing in a home for abandoned and orphaned girls in the city, so that they can appear for the NEET-2022 examination.", "url": "https://www.ndtv.com/education/high-court-directs-maharashtra-govt-issue-orphan-certificate-2-students-who-wish-appear-for-neet", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/5/10/court-featured-image.jpg", "publishedAt": "2022-05-10T12:01:30Z", "content": "Mumbai:The Bombay High Court has directed the Maharashtra government to forthwith issue an 'orphan certificate' to two students, residing in a home for abandoned and orphaned girls in the city, so th… [+1624 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "India Will Need 1 Lakh Drone Pilots In Coming Years: Aviation Minister", "description": "A total of 12 central ministries are trying to boost the indigenous demand for drone services and India will need approximately one lakh drone pilots in the coming years, Aviation Minister Jyotiraditya Scindia said on Tuesday.", "url": "https://www.ndtv.com/india-news/aviation-minister-jyotiraditya-scindia-india-will-need-1-lakh-drone-pilots-in-coming-years-aviation-minister-2962453", "urlToImage": "https://c.ndtvimg.com/2022-03/vu4qoi1g_union-civil-aviation-minister-jyotiraditya-scindiawings-india-2022ani_625x300_25_March_22.jpg", "publishedAt": "2022-05-10T12:01:19Z", "content": "Aviation Minister Jyotiraditya Scindia said third wheel is to create indigenous demand.\r\nNew Delhi: A total of 12 central ministries are trying to boost the indigenous demand for drone services and I… [+1758 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "7 Easy Diet Tips You Should Follow For Healthy Skin In Summer", "description": "Summer Skin Care: Here are some easy-to-follow diet tips that can help you attain flawless skin all through the summer season.", "url": "https://food.ndtv.com/summer-care/skin-care-7-easy-diet-tips-you-should-follow-for-healthy-skin-in-summer-2962887", "urlToImage": "https://c.ndtvimg.com/2022-05/qknk8t48_orange-in-skin-care_625x300_09_May_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-10T12:01:11Z", "content": "As soon as summer breaks, our skin also breaks out. Excessive sweat in this sweltering heat leads to acne, redness, inflammation and other skin problems. Those with oily skin usually face this proble… [+3682 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Terrorists Deliberately Fired At J&K Civilians In Escape Bid, Says Army", "description": "The security forces are searching for two terrorists who fired at civilians in an escape bid after they were cornered near Jammu and Kashmir's Shopian district, a defence spokesperson has said.", "url": "https://www.ndtv.com/india-news/terrorists-deliberately-fired-at-j-k-civilians-in-escape-bid-says-army-2962886", "urlToImage": "https://c.ndtvimg.com/2021-12/0hm1f7uo_indian-army-generic_625x300_11_December_21.jpg", "publishedAt": "2022-05-10T12:01:02Z", "content": "Security Forces have intensified search operations, a defence spokesperson said (File)\r\nSrinagar: The security forces are searching for two terrorists who fired at civilians in an escape bid after th… [+1551 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Black Hole Hunters Cast Gaze At Center Of The Milky Way Galaxy", "description": "Residing at the center of our spiral-shaped Milky Way galaxy is a beast - a supermassive black hole possessing 4 million times the mass of our sun and consuming any material including gas, dust and stars straying within its immense gravitational pull", "url": "https://www.ndtv.com/world-news/black-hole-hunters-cast-gaze-at-center-of-the-milky-way-galaxy-2962856", "urlToImage": "https://c.ndtvimg.com/2022-05/bfbnovcg_black-hole-reuters_625x300_10_May_22.jpg", "publishedAt": "2022-05-10T11:59:43Z", "content": "This artist's concept released October 30, 2017 shows a black hole with an accretion disk.\r\nWashington: Residing at the center of our spiral-shaped Milky Way galaxy is a beast - a supermassive black … [+4035 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Prince Charles Delivers Queen's Speech For The First Time", "description": "Britain's heir-to-the-throne Prince Charles and Prince William took centre stage at the opening of parliament on Tuesday, replacing the 96-year-old Queen Elizabeth who missed the grand set-piece event for the first time in almost six decades.", "url": "https://www.ndtv.com/world-news/prince-charles-delivers-queens-speech-for-the-first-time-2962704", "urlToImage": "https://c.ndtvimg.com/2022-05/e1v5s2eg_prince-charles-reuters_625x300_10_May_22.jpg", "publishedAt": "2022-05-10T11:55:18Z", "content": "Prince Charles started reading out each bill by saying: \"Her majesty's government will...\".\r\nLondon: Britain's heir-to-the-throne Prince Charles and Prince William took centre stage at the opening of… [+1590 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "In Business End Of IPL, Hardik Needs To Improve This Aspect Of His Game", "description": "IPL 2022, LSG vs GT:  The likes of David Miller,Rahul Tewatia and Rashid Khan have rescued Gujarat several times in big chases but that might change anytime and this is the reason why Hardik should try and get his act together and provide a big foundation to …", "url": "https://sports.ndtv.com/ipl-2022/hardik-pandya-needs-to-improve-this-aspect-of-his-game-for-gujarat-titans-to-do-well-in-business-end-of-ipl-2022-2962861", "urlToImage": "https://c.ndtvimg.com/2022-05/4jbviic4_hardik-pandya_625x300_06_May_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-10T11:54:42Z", "content": "Hardik Pandya's Gujarat Titans have been the team to beat all season in IPL 2022, but two back-to-back losses have meant that Gujarat Titans are now 2nd on the points table after a long time and fell… [+1218 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "DoctorNDTV", "title": "10 Tips To Fight Migraine Triggers", "description": "Migraines can be tough to deal with. In this article, we discuss tips through which you can avoid migraine triggers.", "url": "https://doctor.ndtv.com/living-healthy/10-tips-to-fight-migraine-triggers-2948616", "urlToImage": "https://c.ndtvimg.com/2021-06/vdoaef7_headache_625x300_08_June_21.jpg", "publishedAt": "2022-05-10T11:54:01Z", "content": "Migraines can be painful and unbearable. Furthermore, it can be irritating trying to figure out what may be causing these migraines. It is important to identify your triggers in order to avoid them. … [+4009 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Equity Mutual Funds Attract Rs 15,890 Crore In April, Despite Volatility", "description": "Sustaining positive momentum for the 14th straight month, equity mutual funds attracted a net sum of Rs 15,890 crore in April amid heightened volatility in stock market and consistent selling by foreign portfolio investors.", "url": "https://www.ndtv.com/business/equity-mfs-see-rs-15-890-crore-inflow-in-april-amid-volatile-stock-market-2962836", "urlToImage": "https://i.ndtvimg.com/i/2016-06/mutual-funds_650x400_71465817108.jpg", "publishedAt": "2022-05-10T11:50:06Z", "content": "Equity mutual funds sustain positive momentum for the 14th straight month in April\r\nNew Delhi: Sustaining positive momentum for the 14th straight month, equity mutual funds attracted a net sum of Rs … [+3250 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "LIC Leads Life Insurer's New Business Premium Growth Of 84% In April", "description": "Life insurance companies logged 84 per cent growth in their cumulative new business premium at Rs 17,940 crore in April 2022, primarily helped by LIC, IRDAI data showed.", "url": "https://www.ndtv.com/business/life-insurers-log-new-business-premium-growth-of-84-pc-in-april-led-by-lic-2962833", "urlToImage": "https://c.ndtvimg.com/insurance_625x300_1528708812376.jpg", "publishedAt": "2022-05-10T11:50:01Z", "content": "Life insurers log new business premium growth of 84 pc in April, led by LIC\r\nNew Delhi: Life insurance companies logged 84 per cent growth in their cumulative new business premium at Rs 17,940 crore … [+1158 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "India Fully Supportive Of Sri Lanka's Democracy, Stability: Centre", "description": "India on Tuesday said it is \"fully supportive\" of Sri Lanka's democracy, stability and economic recovery, a day after the island nation's Prime Minister Mahinda Rajapaksa quit amid massive protests in the country.", "url": "https://www.ndtv.com/india-news/sri-lanka-economic-crisis-india-fully-supportive-of-sri-lankas-democracy-stability-centre-2962360", "urlToImage": "https://c.ndtvimg.com/2022-05/p5vc9cm8_sri-lanka-afp_625x300_10_May_22.jpg", "publishedAt": "2022-05-10T11:49:36Z", "content": "Sri Lanka Economic Crisis: Sri Lanka is facing its worst economic crisis since gaining independence.\r\nNew Delhi: India on Tuesday said it is \"fully supportive\" of Sri Lanka's democracy, stability and… [+1629 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Jennifer Garner Bakes Yummy Dessert With Her Mom, Here's How You Can Too", "description": "Hollywood actress Jennifer Garner recently took to Instagram to share a video of herself baking a yummy dessert with her mom.", "url": "https://food.ndtv.com/news/jennifer-garner-bakes-yummy-dessert-with-her-mom-heres-how-you-can-too-2962830", "urlToImage": "https://c.ndtvimg.com/2022-05/587h0mbg_jennifer-garner-bakes_625x300_10_May_22.jpg", "publishedAt": "2022-05-10T11:49:31Z", "content": "Baking has become an immensely popular pastime thanks to the pandemic. People found that they can easily make delicious desserts in the comfort of their homes with a few simple ingredients that are r… [+3273 chars]"}]}