{"status": "ok", "totalResults": 250, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Watch: Paul Scholes' Shocking Statement On Man United Dressing Room", "description": "Paul Scholes claimed his former club were in disarray behind the scenes having spoken with Manchester United midfielder Jesse Lingard.", "url": "https://sports.ndtv.com/english-premier-league/watch-paul-scholes-shocking-statement-on-state-of-affairs-in-manchester-united-dressing-room-2915192", "urlToImage": "https://c.ndtvimg.com/2022-02/5j6id0kg_manchester-united-sad-afp_625x300_05_February_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-04-24T08:03:58Z", "content": "Manchester United's hopes of finishing in the Premier League top four were left in tatters after the team lost 1-3 to Arsenal on Saturday. The Red Devils are six points adrift of fourth-placed Arsena… [+1471 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "IPL 2022: CSK And PBKS Look To Get Their Campaign On Track", "description": "IPL 2022: Chennai Super Kings and Punjab Kings will square off on Monday at Wankhede Stadium.", "url": "https://sports.ndtv.com/ipl-2022/ipl-2022-csk-and-pbks-look-to-get-their-campaign-on-track-2915191", "urlToImage": "https://c.ndtvimg.com/2022-04/tpjfrv8_csk-bcciipl_625x300_12_April_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-04-24T08:02:25Z", "content": "Chennai Super Kings would look for inspiration from the talismanic Mahendra Singh Dhoni once again while eyeing improvement on multiple fronts when they take on Punjab Kings in the IPL on Sunday. CSK… [+3586 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "These Veg Puff Recipes Are A Must-Have On Your Home Menu", "description": "Vegetable puffs are light on the stomach and surprisingly easy to cook. Read on for a list of five such recipes", "url": "https://food.ndtv.com/food-drinks/5-veg-puff-recipes-you-need-to-have-on-your-home-menu-2915186", "urlToImage": "https://c.ndtvimg.com/2022-04/8kg1d7to_egg-puff_625x300_21_April_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-04-24T07:59:34Z", "content": "It is always a good time for a snack, isn't it? When you are not in the mood for a big meal or simply do not have the time, snacks can always come to the rescue. And depending on which part of the wo… [+1671 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Power Crisis Due To Sharp Fall In Production, Not Coal Shortage: Report", "description": "The current power crisis is mainly on account of sharp decline in electricity generation from different fuel sources and not due to non-availability of domestic coal, a top official said on Sunday.", "url": "https://www.ndtv.com/business/current-power-crisis-due-to-sharp-fall-in-generation-not-due-to-non-availability-of-domestic-coal-2915167", "urlToImage": "https://c.ndtvimg.com/2021-10/4rmpi4j_power-crisis_640x480_10_October_21.jpg", "publishedAt": "2022-04-24T07:52:12Z", "content": "Power crisis due to sharp fall in generation; and not because of coal shortage: Report\r\nNew Delhi: The current power crisis is mainly on account of sharp decline in electricity generation from differ… [+3796 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "25 Injured After Bus Carrying Pilgrims Overturns In Odisha's Puri", "description": "A bus carrying pilgrims from Odisha's Puri met with an accident leaving 25 people injured, informed the officials on Sunday.", "url": "https://www.ndtv.com/india-news/odisha-bus-carrying-50-passengers-overturns-in-puri-25-injured-2915129", "urlToImage": "https://i.ndtvimg.com/i/2016-08/accident-generic_650x400_61471695567.jpg", "publishedAt": "2022-04-24T07:36:26Z", "content": "A project of highway widening is underway near the accident spot (Representational)\r\nGanjam: A bus carrying pilgrims from Odisha's Puri met with an accident leaving 25 people injured, informed the of… [+502 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Debika Chakraborty", "title": "NEET MDS 2022 Admit Card To Be Released Tomorrow; How To Download", "description": "Candidates must check the official website natboard.edu.in for admit cards and other important details related to the NEET MDS 2022.", "url": "https://www.ndtv.com/education/neet-mds-2022-admit-card-be-released-tomorrow-check-how-download-exam-schemes", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/4/23/online-featured-image_2.jpg", "publishedAt": "2022-04-24T07:31:40Z", "content": "New Delhi:The admit card for the National Eligibility cum Entrance Test-Master of Dental Surgery, or NEET MDS 2022, will be released tomorrow, April 24, 2022 by the National Board of Examinations in … [+2122 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Ex- Aus Keeper Ryan Campbell Stable, Out Of Sedation After Heart Attack", "description": "Campbell's family released a statement via the Australian Cricketers' Association, updating his condition after he suffered a heart attack last Saturday in \"Stoke-on-Trent\"", "url": "https://sports.ndtv.com/cricket/ex-australia-wicketkeeper-ryan-campbell-stable-and-out-of-sedation-after-heart-attack-2915110", "urlToImage": "https://c.ndtvimg.com/2022-04/2t72drk_ryan-campbell-twitter_625x300_19_April_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-04-24T07:27:01Z", "content": "Netherlands men's team head coach and former Australia wicketkeeper Ryan Campbell is in a stable condition and is out of sedation just over a week after suffering a heart attack, his family said on S… [+1275 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "\"Pace Is Important But It's Not Everything\": McGrath On Umran Malik", "description": "While talking about SunRisers Hyderabad pacer Umran Malik, former Australia bowler Glenn McGrath said \"pace is not everything\".", "url": "https://sports.ndtv.com/ipl-2022/pace-is-important-but-its-not-everything-glenn-mcgrath-on-umran-maliks-rise-in-ipl-2022-2915109", "urlToImage": "https://c.ndtvimg.com/2022-04/u6j97b8_umran-malik-bcciipl_625x300_17_April_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-04-24T07:24:30Z", "content": "Australian pace legend Glenn McGrath on Friday said the way fast-rising Prasidh Krishna bowled a penultimate over in an IPL game showed he could handle pressure. McGrath also expects India pacer Jasp… [+3419 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Pralhad Joshi Tweets On Coal Supply Efforts To Power Plants", "description": "Coal companies are dispatching almost 2.0 million tonnes (MT) of coal every day to the power sector through various modes, such as railways, roadways and RCR-mode, said Coal Minister Pralhad Joshi in a tweet.", "url": "https://www.ndtv.com/business/pralhad-joshi-tweets-on-coal-supply-efforts-to-power-plants-2915072", "urlToImage": "https://c.ndtvimg.com/2022-04/330pnet_coal-mine-generic_625x300_21_April_22.jpg", "publishedAt": "2022-04-24T07:02:00Z", "content": "Coal Minister Pralhad Joshi Tweets: Coal companies are dispatching 2.0 MT every day to power sector\r\nCoal companies are dispatching almost 2.0 million tonnes (MT) of coal every day to the power secto… [+1153 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Vishesh Roy", "title": "Watch: Ronaldo Pays Tribute To Late Son After Goal Against Arsenal", "description": "Premier League: Manchester United striker Cristiano Ronaldo paid tribute to his late son after scoring against Arsenal.", "url": "https://sports.ndtv.com/football/watch-cristiano-ronaldo-pays-tribute-to-late-son-after-goal-against-arsenal-2915068", "urlToImage": "https://c.ndtvimg.com/2022-04/i838aqrg_ronaldo-afp_625x300_24_April_22.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-04-24T06:58:03Z", "content": "Manchester United striker Cristiano Ronaldo got on the scoresheet against Arsenal and dedicated the goal to his late son, who passed away earlier this week. The past week has been a turbulent one for… [+1452 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Video: Construction Crew Praised For Rescuing Dog From Canal", "description": "A construction worker has set an example for humanity by rescuing a dog from a canal with the help of a bulldozer. The video has touched the hearts of netizens as it shows the construction worker saving the dog with great skill and wisdom.", "url": "https://www.ndtv.com/offbeat/video-construction-crew-in-ecuador-praised-for-rescuing-dog-from-irrigation-canal-2915056", "urlToImage": "https://c.ndtvimg.com/2022-04/kmuf1l6o_dog-650_625x300_24_April_22.jpg", "publishedAt": "2022-04-24T06:51:51Z", "content": "The video has been viewed over 8 million times.\r\nA construction worker in Ecuador has set an example for humanity by rescuing a dog from a canal with the help of an excavator. The video shared by Vir… [+1833 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Prashant Kishor's Sleepover At KCR's Ahead Of Congress Decision", "description": "Poll strategist Prashant Kishor met Telangana Chief Minister K Chandrashekar Rao in Hyderabad today, setting off a new round of speculation a day before a crucial meeting in Congress on whether he will join the party's attempt to bounce back", "url": "https://www.ndtv.com/india-news/prashant-kishors-sleepover-at-kcrs-ahead-of-congress-decision-2915050", "urlToImage": "https://c.ndtvimg.com/2019-08/ipp2qbro_prashant-kishor-pti_625x300_19_August_19.jpg", "publishedAt": "2022-04-24T06:48:58Z", "content": "Discussions between Prashant Kishor and KCR are expected to continue today. File\r\nHyderabad/New Delhi: Poll strategist Prashant Kishor is camping at Telangana Chief Minister K Chandrashekar Rao's off… [+3453 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ashram Underpass Inaugurated In Delhi After Missing 8 Deadlines", "description": "Deputy Chief Minister Manish Sisodia on Sunday inaugurated the much-awaited Ashram underpass on Mathura Road in south Delhi, and said the facility will benefit lakhs of commuters travelling through the stretch", "url": "https://www.ndtv.com/delhi-news/ashram-underpass-inaugurated-2915042", "urlToImage": "https://c.ndtvimg.com/2022-04/3ha64dkg_ashram-underpass_625x300_24_April_22.jpg", "publishedAt": "2022-04-24T06:42:39Z", "content": "The underpass connects Bhogal with New Friends Colony\r\nNew Delhi: Deputy Chief Minister Manish Sisodia on Sunday inaugurated the much-awaited Ashram underpass on Mathura Road in south Delhi, and said… [+2301 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Over 17 Lakh Indians Tested HIV+ In last 10 Years By Unprotected Sex: RTI", "description": "Over 17 lakh people contracted HIV in the country in the last 10 years due to unprotected intercourse, according to the data provided by National AIDS Control Organization in response to an RTI query.", "url": "https://www.ndtv.com/india-news/over-17-lakh-people-contracted-hiv-in-india-in-last-10-yrs-by-unprotected-sex-rti-reply-2915035", "urlToImage": "https://c.ndtvimg.com/2021-11/2qb9mj38_hiv-generic_625x300_23_November_21.jpg", "publishedAt": "2022-04-24T06:38:06Z", "content": "A consistent decline in cases of transmission of HIV was seen, the data said. (Representational)\r\nNew Delhi: Over 17 lakh people contracted HIV in the country in the last 10 years due to unprotected … [+3231 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Police Dog Steals The Show During Football Match, Delights Internet", "description": "A video is going viral on the internet from Brazils The Campeonato Pernambucano de Futebol in which a police dog suddenly invades the field during an ongoing match between two local teams - Nautico and Retro.", "url": "https://www.ndtv.com/world-news/police-dog-steals-the-show-during-football-match-delights-internet-2915025", "urlToImage": "https://c.ndtvimg.com/2022-04/9st84on8_german-shepherd-240_625x300_24_April_22.jpg", "publishedAt": "2022-04-24T06:28:09Z", "content": "A police dog suddenly invades the field during an ongoing match.\r\nA video is going viral on the internet from Brazil's The Campeonato Pernambucano de Futebol' in which a police dog suddenly invades t… [+1448 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Janhvi On Arjun And Anshula's Presence In Her Life: \"I Feel Wholesome\"", "description": "In recent times, Janhvi Kapoor and Khushi Kapoor share a strong bond with her half-siblings Arjun Kapoor and Anshula Kapoor", "url": "https://www.ndtv.com/entertainment/janhvi-kapoor-says-arjun-kapoor-and-anshulas-presence-in-her-and-khushis-life-has-made-them-secure-and-stronger-2915016", "urlToImage": "https://c.ndtvimg.com/2022-04/4re9enb_janhvi-kapoor_625x300_24_April_22.jpg", "publishedAt": "2022-04-24T06:24:36Z", "content": "Janhvi, Arjun, Anshula and Khushi (courtesy: janhvikapoor)\r\nJanhvi Kapoor recently revealed how Arjun Kapoor and Anshula Kapoor brought change into her life. Arjun and Anshula are Boney Kapoor's elde… [+1849 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Delhi Makes Last Ditch Attempt To Save \"Extinct\" Water Bodies. Here's How", "description": "The Delhi government is making one last effort to salvage the water bodies which have gone extinct over the years due to large-scale encroachment and negligence.", "url": "https://www.ndtv.com/delhi-news/delhi-makes-last-ditch-attempt-to-save-extinct-water-bodies-2915004", "urlToImage": "https://c.ndtvimg.com/2022-04/3dlv3ep8_delhi-lakes_625x300_24_April_22.jpg", "publishedAt": "2022-04-24T06:18:31Z", "content": "There are 1,043 water bodies in the national capital\r\nNew Delhi: The Delhi government is making one last effort to salvage the water bodies which have gone extinct over the years due to large-scale e… [+2913 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Small Online Payments Helping Build Big Digital Economy\", Says PM Modi", "description": "Prime Minister Narendra Modi on Sunday said digital transactions worth Rs 20,000 crore are now taking place daily in the country and asserted that this is not only increasing facilities but also encouraging an environment of honesty.", "url": "https://www.ndtv.com/india-news/mann-ki-baat-small-online-payments-helping-build-big-digital-economy-says-pm-modi-2915002", "urlToImage": "https://c.ndtvimg.com/2022-02/k74t4epc_narendra-modi-mann-ki-baat-twitter_625x300_27_February_22.jpg", "publishedAt": "2022-04-24T06:16:55Z", "content": "He also urged people to visit a local museum during holidays\r\nPrime Minister Narendra Modi on Sunday said digital transactions worth Rs 20,000 crore are now taking place daily in the country and asse… [+1620 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine Says Russia Deploys Missile Launchers Near Ukraine Border", "description": "Russia has deployed Iskander-M mobile battlefield missile launchers within 60 km (40 miles) of the Ukrainian border, General Staff of Ukraine's Armed Forces said on Sunday.", "url": "https://www.ndtv.com/world-news/ukraine-says-russia-deploys-iskander-m-launchers-near-border-2914986", "urlToImage": "https://c.ndtvimg.com/2022-04/riv01tuo_iskanderm-reuters_625x300_24_April_22.jpg", "publishedAt": "2022-04-24T06:13:20Z", "content": "The Iskander is a mobile ballistic missile system codenamed SS-26 Stone by NATO. (FILE)\r\nRussia has deployed Iskander-M mobile battlefield missile launchers within 60 km (40 miles) of the Ukrainian b… [+1263 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Foreign Investors Sell Indian Shares Worth Rs 12,300 Crore In April", "description": "Fears of an aggressive rate hike by the US Fed continue to dent investor sentiments with foreign investors pulling out nearly Rs 12,300 crore from the Indian equity market so far this month.", "url": "https://www.ndtv.com/business/fpis-withdraw-rs-12-300-cr-from-equities-in-apr-on-us-fed-rate-hike-fears-2914984", "urlToImage": "https://c.ndtvimg.com/2021-02/hd824m9o_money-generic-rupees-generic_625x300_25_February_21.jpg", "publishedAt": "2022-04-24T06:12:12Z", "content": "FPIs withdraw Rs 12,300 cr from equities in Apr on US Fed rate hike fears\r\nNew Delhi: Fears of an aggressive rate hike by the US Fed continue to dent investor sentiments with foreign investors pullin… [+3140 chars]"}]}