{"status": "ok", "totalResults": 311, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Money Laundering Case Filed Against Raj Kundra In Porn Racket Case", "description": "The ED has launched an anti-money-laundering investigation into an alleged pornographic films case in which businessman Raj Kundra and others were arrested by the Mumbai Police crime branch in 2021, officials said on Thursday.", "url": "https://www.ndtv.com/india-news/ed-files-money-laundering-case-against-raj-kundra-in-porn-racket-case-2992317", "urlToImage": "https://c.ndtvimg.com/2021-07/5pfdkgmg_raj-kundra-instagram_625x300_20_July_21.jpg", "publishedAt": "2022-05-20T00:29:58Z", "content": "Last year, police filed FIRs against Raj Kundra on the basis of complaints received from 2 women. (File)\r\nNew Delhi: The ED has launched an anti-money-laundering investigation into an alleged pornogr… [+2919 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Bharat Jodo Yatra: Congress To Reach Out To Like-Minded Groups For March", "description": "The Congress will reach out to civil society members and like-minded political groups for the 'Bharat Jodo' yatra from October 2 for rallying support to combat polarisation and protect Constitution and democracy senior party leader said.", "url": "https://www.ndtv.com/india-news/bharat-jodo-yatra-congress-to-reach-out-to-like-minded-groups-for-march-2992310", "urlToImage": "https://c.ndtvimg.com/2020-01/dqh52igg_congress-generic_625x300_21_January_20.jpg", "publishedAt": "2022-05-19T23:55:06Z", "content": "Congress' Bharat Jodo Yatra will begin from Kanyakumari on October 2. (File)\r\nNew Delhi: The Congress will reach out to civil society members and like-minded political groups for the 'Bharat Jodo' ya… [+4152 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Johnny Depp Was Jealous, Frequently Drunk, Says His Ex-Girlfriend", "description": "Johnny Depp was jealous, controlling and frequently drunk, and once threw a wine bottle in his hotel room in Las Vegas, his former girlfriend, the actress Ellen Barkin, said in pre-recorded testimony Thursday.", "url": "https://www.ndtv.com/world-news/johnny-depp-was-jealous-controlling-frequently-drunk-says-his-ex-girlfriend-ellen-barkin-2992295", "urlToImage": "https://i.ndtvimg.com/i/2014-10/johnny-depp-630-new_625x300_61412599748.jpg", "publishedAt": "2022-05-19T23:13:28Z", "content": "Johnny Depp was a \"red wine drinker,\" said her ex-girlfriend and actress Ellen Barkin.\r\nWashington: Johnny Depp was jealous, controlling and frequently drunk, and once threw a wine bottle in his hote… [+4249 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Musk's Twitter Deal Will Not Renegotiate, Proceeding As Expected: Report", "description": "Twitter Inc executives told staff that Tesla Inc Chief Executive Elon Musk's $44-billion deal was proceeding as expected and would not renegotiate the offer price, Bloomberg News reporter tweeted on Thursday.", "url": "https://www.ndtv.com/world-news/musks-twitter-deal-will-not-renegotiate-proceeding-as-expected-report-2992282", "urlToImage": "https://c.ndtvimg.com/2022-05/tepddd6_elon-musk-twitter-reuters_625x300_17_May_22.jpg", "publishedAt": "2022-05-19T22:45:11Z", "content": "Elon Musk Twitter Deal: Elon Musk agreed to buy Twitter Inc for $44 billion cash last month in April.\r\nNew York: Twitter Inc executives told staff that Tesla Inc Chief Executive Elon Musk's $44-billi… [+315 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine's Zelensky Says Russia Has \"Completely Destroyed\" Donbas Region", "description": "Ukrainian President Volodymyr Zelenskiy on Thursday said Russian forces had \"completely destroyed\" the industrial Donbas region and accused Moscow of carrying out senseless bombardments as it intensified its offensive.", "url": "https://www.ndtv.com/world-news/ukraines-zelenskiy-says-donbas-region-has-been-completely-destroyed-2992269", "urlToImage": "https://c.ndtvimg.com/2022-03/k27u67s8_ukraine-president-volodymyr-zelensky-650_625x300_12_March_22.jpg", "publishedAt": "2022-05-19T21:54:32Z", "content": "Ukraine War: \"It is hell there - and that is not an exaggeration,\" Zelensky said on Thursday.\r\nKyiv: Ukrainian President Volodymyr Zelenskiy on Thursday said Russian forces had \"completely destroyed\"… [+1137 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Twitter To Tackle Ukraine Conflict Misinformation With Warning Labels", "description": "Twitter Inc will begin placing warning notices in front of some misleading content regarding the conflict in Ukraine and limit the spread of claims debunked by humanitarian groups or other credible sources, the social media company said on Thursday.", "url": "https://www.ndtv.com/world-news/twitter-to-tackle-ukraine-conflict-misinformation-with-warning-labels-2992268", "urlToImage": "https://c.ndtvimg.com/2022-03/48be8em_ukraine-capital-kyiv-afp_625x300_03_March_22.jpg", "publishedAt": "2022-05-19T21:49:49Z", "content": "The new warning notices will alert users that a tweet has violated Twitter's rules over Ukraine war.\r\nNew York:  Twitter Inc will begin placing warning notices in front of some misleading content reg… [+1874 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Blinken Accuses Russia Of Blocking Exports Of Ukrainian Grain Amid Crisis", "description": "U.S. Secretary of State Antony Blinken accused Russia on Thursday of using food as a weapon in Ukraine by holding \"hostage\" the food supply for not just millions of Ukrainians, but also millions around the world who rely on Ukrainian exports.", "url": "https://www.ndtv.com/world-news/antony-blinken-accuses-russia-of-blocking-exports-of-ukrainian-grain-amid-global-food-crisis-2992261", "urlToImage": "https://c.ndtvimg.com/2021-09/fo4ievhg_antony-blinken-afp-650_625x300_14_September_21.jpg", "publishedAt": "2022-05-19T21:29:14Z", "content": "Blinken rejected Russian accusations that Western sanctions on Moscow fueling the food crisis.\r\nUnited Nations: U.S. Secretary of State Antony Blinken accused Russia on Thursday of using food as a we… [+2004 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "G7 Countries Commit $18.4 Billion Aid Package For Ukraine", "description": "The Group of Seven (G7) industrialised nations have committed $18.4 billion in transfers and loans to help Ukraine meet its immediate financing needs, according to a draft communique seen by Reuters on Thursday.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-g7-countries-commit-18-4-billion-aid-package-for-ukraine-2992252", "urlToImage": "https://c.ndtvimg.com/2022-04/uqnsrqv_russia-ukraine-war-_625x300_09_April_22.jpg", "publishedAt": "2022-05-19T21:04:05Z", "content": "Earlier, US congress approved a new $40 billion aid package for Ukraine on Thursday.\r\nKnigswinter, Germany: The Group of Seven (G7) industrialised nations have committed $18.4 billion in transfers an… [+585 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Confident\": German Chancellor's Support For Finland, Sweden NATO Bid", "description": "German Chancellor Olaf Scholz said on Thursday he was confident that Sweden and Finland would succeed in joining the NATO defence alliance and that Germany was doing everything possible to make that happen.", "url": "https://www.ndtv.com/world-news/german-chancellor-olaf-scholzs-support-for-finland-sweden-nato-bid-2992243", "urlToImage": "https://c.ndtvimg.com/2022-05/9urenit4_olaf-scholz-afp_625x300_19_May_22.jpg", "publishedAt": "2022-05-19T20:39:21Z", "content": "German Chancellor Scholz reiterated that Germany welcomed the Nordic countries' bids to join NATO.\r\nThe Hague: German Chancellor Olaf Scholz said on Thursday he was confident that Sweden and Finland … [+635 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Johnny Depp's Career Was Dimming Because Of \"Unprofessional Behaviour\": Ex-Agent", "description": "Johnny Depp's career and finances were already in serious trouble before his then-wife Amber Heard accused him of domestic violence in 2016, his former agent and business manager testified on Thursday.", "url": "https://www.ndtv.com/world-news/johnny-depps-career-was-dimming-because-of-unprofessional-behavior-says-actors-ex-agent-2992195", "urlToImage": "https://c.ndtvimg.com/2020-11/07eljdeg_johnny-depp650_625x300_02_November_20.jpg", "publishedAt": "2022-05-19T20:00:45Z", "content": "Johnny Depp denied ever striking Amber Heard and claimed that she was the one who was frequently violent.\r\nWashington: Johnny Depp's career and finances were already in serious trouble before his the… [+3986 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine War Could Continue For Long Time Despite...: US Warns", "description": "A senior Pentagon official said Thursday that the Ukraine war could continue for a long time despite Kyiv's forces recapturing the Kharkiv region and their use of substantial US artillery supplies.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-pentagon-warns-war-will-stretch-out-despite-ukraine-successes-2992150", "urlToImage": "https://c.ndtvimg.com/2022-03/u10q85a_antitank-constructions-kyivukrainereuters_625x300_07_March_22.jpg", "publishedAt": "2022-05-19T19:13:37Z", "content": "The Pentagon official said Russian forces face continuing issues in sustaining their invasion.\r\nWashington: A senior Pentagon official said Thursday that the Ukraine war could continue for a long tim… [+2925 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "1 Killed, 6 Injured In Fire At Delhi Factory", "description": "A 42-year-old man was killed and six others were injured when a fire broke out at an electric goods factory in northeast Delhi's Mustafabad area on Thursday.", "url": "https://www.ndtv.com/india-news/delhi-fire-delhi-fire-news-delhi-news-1-killed-6-injured-in-fire-at-delhi-factory-2991785", "urlToImage": "https://c.ndtvimg.com/2021-05/ig04slno_fire-generic_625x300_12_May_21.jpg", "publishedAt": "2022-05-19T18:49:41Z", "content": "Delhi: The blaze was brought under control at 1 pm, fire officials said. (Representational)\r\nNew Delhi: A 42-year-old man was killed and six others were injured when a fire broke out at an electric g… [+2703 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Hand Can Be Considered A Weapon If...: Supreme Court", "description": "The Supreme Court on Thursday said that 'hand can also be a weapon when a cricketer or extremely physically fit person inflicts the same' and remarked that a disproportionately light punishment humiliates and frustrates a victim of crime.", "url": "https://www.ndtv.com/india-news/hand-can-be-considered-a-weapon-if-supreme-court-2991058", "urlToImage": "https://c.ndtvimg.com/2020-03/voni7s98_supreme-court-new_650x400_12_March_20.jpg", "publishedAt": "2022-05-19T18:44:16Z", "content": "Supreme Court also quoted an ancient quote saying that it reflects aspects of sentencing.\r\nNew Delhi: The Supreme Court on Thursday said that 'hand can also be a weapon when a cricketer or extremely … [+4497 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Centre To Give 2,000 More Paramilitary Personnel To Punjab: Bhagwant Mann", "description": "About 2,000 additional paramilitary personnel will be deployed in Punjab to enhance security as there have been regular inputs that some elements are trying to create unrest in the state, Punjab Chief Minister Bhagwant Mann said on Wednesday.", "url": "https://www.ndtv.com/india-news/centre-to-give-2-000-more-paramilitary-personnel-to-punjab-bhagwant-mann-2991656", "urlToImage": "https://c.ndtvimg.com/2022-05/our0hpqk_punjab-chief-minister-bhagwant-mann-_625x300_20_May_22.jpg", "publishedAt": "2022-05-19T18:40:59Z", "content": "Punjab Chief Minister Bhagwant Mann met Union Home Minister Amit Shah.\r\nNew Delhi: About 2,000 additional paramilitary personnel will be deployed in Punjab to enhance security as there have been regu… [+3407 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Chandimal, Dickwella Cling On As Sri Lanka Draw Bangladesh Test", "description": "On the fifth and final day the two teams settled on a draw 45 minutes before the scheduled close of play with Sri Lanka on 260-6 in their second innings.", "url": "https://sports.ndtv.com/cricket/dinesh-chandimal-niroshan-dickwella-cling-on-as-sri-lanka-draw-bangladesh-test-2992112", "urlToImage": "https://c.ndtvimg.com/2022-05/kq1hrvh8_dickwella-chandimal-afp_625x300_20_May_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-19T18:36:33Z", "content": "Bangladesh and Sri Lanka drew the first Test in Chittagong on Thursday after Dinesh Chandimal and Niroshan Dickwella hung on for the visitors in a vital seventh-wicket stand. On the fifth and final d… [+1639 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "GST Council's Recommendation Not Binding On Union, States: Supreme Court", "description": "In a significant verdict, the Supreme Court Thursday ruled that the recommendations of Goods and Services Tax (GST) Council are not binding on the Union and the states and only have a persuasive value.", "url": "https://www.ndtv.com/india-news/gst-councils-counsel-not-binding-on-union-states-supreme-court-says-2992106", "urlToImage": "https://c.ndtvimg.com/2022-02/a1ooga8_supreme-court-of-india_650x400_14_February_22.jpg", "publishedAt": "2022-05-19T18:31:53Z", "content": "The Supreme Court said the GST Council is also a major focal point to promote federalism.(File)\r\nNew Delhi: In a significant verdict, the Supreme Court Thursday ruled that the recommendations of Good… [+4920 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Supreme Court To Hear Plea On Probe Against Jharkhand Chief Minister", "description": "The Supreme Court agreed to hear on Friday a plea related to probes by CBI and the Enforcement Directorate into the mining lease allegedly granted to Jharkhand Chief Minister Hemant Soren.", "url": "https://www.ndtv.com/india-news/supreme-court-to-hear-plea-on-probe-against-jharkhand-chief-minister-2990679", "urlToImage": "https://c.ndtvimg.com/2020-03/voni7s98_supreme-court-new_650x400_12_March_20.jpg", "publishedAt": "2022-05-19T18:23:28Z", "content": "The PIL filed by one Arun Dubey has led to an ED probe in the alleged MNREGA scam.\r\nNew Delhi: The Supreme Court agreed to hear on Friday a plea related to probes by CBI and the Enforcement Directora… [+1577 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Spain's Exiled Ex-King Returns Home After Two Years, Attracts Backlash", "description": "Juan Carlos I: Spain's former king made his first trip home on Thursday after nearly two years in exile following a string of financial scandals, sparking widespread criticism.", "url": "https://www.ndtv.com/world-news/juan-carlos-i-spains-exiled-ex-king-returns-home-after-nearly-two-years-attracts-backlash-2992069", "urlToImage": "https://c.ndtvimg.com/2022-05/b055nlq_juan-carlos-i_625x300_19_May_22.jpg", "publishedAt": "2022-05-19T18:14:04Z", "content": "Juan Carlos I: The former monarch arrived by private jet in Vigo, Spain.\r\nVigo, Spain: Spain's former king made his first trip home on Thursday after nearly two years in exile following a string of f… [+4437 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "\"Am I Trending\" Elated Nikhat Zareen Asks After Winning World Boxing Gold", "description": "Nikhat Zareen defeated Thailand's Jitpong Jutamas in the 52kg category to win gold at Women's World Boxing Championships", "url": "https://sports.ndtv.com/boxing/am-i-trending-on-twitter-elated-nikhat-zareen-asks-after-winning-womens-world-boxing-championships-gold-medal-2992064", "urlToImage": "https://c.ndtvimg.com/2022-05/934t0dog_nikhat-zareen-bfi_625x300_19_May_22.jpeg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-19T18:13:18Z", "content": "Nikhat Zareen became the fifth Indian boxer on Thursday to win a gold medal at the Women's World Boxing Championships when she defeated Thailand's Jitpong Jutamas in Istanbul, Turkey. Living up to th… [+1843 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Aishwarya Wears A Desi Designer On Cannes Red Carpet. It's Not Sabyasachi", "description": "Cannes 2022: Aishwarya Rai Bachchan wore a pleated, architectural gown by Gaurav Gupta", "url": "https://www.ndtv.com/entertainment/cannes-2022-aishwarya-rai-bachchan-wore-a-desi-designer-on-the-red-carpet-and-its-not-sabyasachi-2992055", "urlToImage": "https://c.ndtvimg.com/2022-05/idvaslqg_aishwaryaredcarpet650_625x300_19_May_22.jpg", "publishedAt": "2022-05-19T18:09:16Z", "content": "Cannes 2022: Aishwarya Rai Bachchan on the red carpet (Image Credit: AFP)\r\nAishwarya Rai Bachchan made her second red carpet appearance at the Cannes Film Festival on Thursday and it was almost as ey… [+1777 chars]"}]}