{"status": "ok", "totalResults": 495, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Saudi Arabia To Allow One Million Hajj Pilgrims This Year", "description": "Saudi Arabia said Saturday it would permit one million Muslims from inside and outside the country to participate in this year's hajj, a sharp increase after pandemic restrictions forced two years of drastically pared-down pilgrimages.", "url": "https://www.ndtv.com/world-news/saudi-arabia-to-allow-one-million-hajj-pilgrims-this-year-2874777", "urlToImage": "https://c.ndtvimg.com/2020-07/voomvi8o_hajj-coronavirus-650_625x300_31_July_20.jpg", "publishedAt": "2022-04-10T00:52:50Z", "content": "This year the Saudi hajj ministry \"has authorised one million pilgrims. (FILE)\r\nRiyadh: Saudi Arabia said Saturday it would permit one million Muslims from inside and outside the country to participa… [+3807 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Live Updates: India Reports 1,150 New Cases, 83 Deaths", "description": "India reported a single-day rise of 1,150 new COVID-19 cases, taking the infection tally in the country to 4,30,34,217, while the count of active cases fell to 11,365, according to the Union Health Ministry on Saturday.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-covid-cases-today-2874776", "urlToImage": "https://c.ndtvimg.com/2022-01/nr0feopo_coronavirus-india-afp-january_650x400_11_January_22.jpg", "publishedAt": "2022-04-10T00:36:36Z", "content": "A reduction of 127 cases has been recorded in the active COVID-19 caseload in a span of 24 hours\r\nNew Delhi: India reported a single-day rise of 1,150 new COVID-19 cases, taking the infection tally i… [+1476 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "LIVE Updates: Imran Khan Dismissed As Pak PM After Losing No-Trust Vote", "description": "Imran Khan was dismissed Sunday as Pakistan's Prime Minister after losing a no-confidence vote in parliament following weeks of political turmoil.", "url": "https://www.ndtv.com/world-news/pakistan-political-crisis-live-updates-imran-khan-dismissed-as-pak-pm-after-losing-no-trust-vote-2874773", "urlToImage": "https://c.ndtvimg.com/2022-04/3kfhu4qo_pakistan-prime-minister-imran-khan-reuters_625x300_05_April_22.jpg", "publishedAt": "2022-04-10T00:22:57Z", "content": "No PM has ever served a full term in Pakistan, but Khan is the first to lose office this way.(FILE)\r\nNew Delhi: Imran Khan was dismissed Sunday as Pakistan's Prime Minister after losing a no-confiden… [+1671 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "NATO Plans Permanent Military Presence At Border Over Russia: Report", "description": "NATO is working on plans for a permanent military presence on its border in an effort to battle future Russian aggression, The Telegraph reported, citing NATO Secretary-General Jens Stoltenberg.", "url": "https://www.ndtv.com/world-news/nato-plans-permanent-military-presence-at-border-over-russia-report-2874768", "urlToImage": "https://c.ndtvimg.com/2022-01/r0t4auhk_nato-forces_625x300_24_January_22.jpg", "publishedAt": "2022-04-09T23:36:16Z", "content": "What we see now is a new reality, a new normal for European security, said its chief.\r\nNATO is working on plans for a permanent military presence on its border in an effort to battle future Russian a… [+1004 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Pak National Assembly Adjourned, To Meet Again On Monday To Elect New PM", "description": "The Pakistan National Assembly proceedings were adjourned in the early hours of Sunday and the House will meet again on April 11 at 2 pm to elect the new premier after Imran Khan was removed from office through a no-confidence vote.", "url": "https://www.ndtv.com/world-news/pak-national-assembly-adjourned-to-meet-again-on-monday-to-elect-new-pm-2874763", "urlToImage": "https://i.ndtvimg.com/i/2017-02/pakistan-national-assembly_650x400_41487418000.jpg", "publishedAt": "2022-04-09T22:26:02Z", "content": "The removal of Imran Khan has set in motion the process to elect the new leader of the house.(FILE)\r\nIslamabad: The Pakistan National Assembly proceedings were adjourned in the early hours of Sunday … [+2036 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Searching For The Missing In The Ruins Of Town Near Kyiv", "description": "In the small town of Borodyanka, not far from Kyiv, diggers sort through the rubble of houses destroyed by Russian bombardments, looking for the missing.", "url": "https://www.ndtv.com/world-news/searching-for-the-missing-in-the-ruins-of-town-near-kyiv-2874752", "urlToImage": "https://c.ndtvimg.com/2022-04/hto66ovk_ukraine-borodyanka-afp_625x300_10_April_22.jpg", "publishedAt": "2022-04-09T21:13:35Z", "content": "Ukrainian firefighters search for bodies in the rubble of a collapsed building in the town of Borodianka\r\nBorodyanka: In the small town of Borodyanka, not far from Kyiv, diggers sort through the rubb… [+4256 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russian Forces Continue To Use IEDs In Ukraine: UK Intelligence", "description": "Russian forces continue to use improvised explosive devices (IEDs) to inflict casualties, lower morale, and restrict Ukrainian freedom of movement, according to British military intelligence on Saturday.", "url": "https://www.ndtv.com/world-news/russian-forces-continue-to-use-ieds-in-ukraine-uk-intelligence-2874748", "urlToImage": "https://c.ndtvimg.com/2022-04/hsijrbks_ukraine-afp_625x300_03_April_22.jpg", "publishedAt": "2022-04-09T21:03:09Z", "content": "Russia has denied targeting civilians in what it calls a \"special operation\"\r\nRussian forces continue to use improvised explosive devices (IEDs) to inflict casualties, lower morale, and restrict Ukra… [+618 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Plotting From The Wings: Key Players Behind Imran Khan's Ouster", "description": "Imran Khan was removed from office as Pakistan prime minister Sunday after losing a no-confidence vote in the national assembly.", "url": "https://www.ndtv.com/world-news/plotting-from-the-wings-key-players-behind-imran-khans-ouster-2874745", "urlToImage": "https://c.ndtvimg.com/2022-04/cabc34k_imran-khan_650x400_07_April_22.jpg", "publishedAt": "2022-04-09T20:48:42Z", "content": "Imran Khan lost the no-confidence vote on Sunday.(FILE)\r\nIslamabad: Imran Khan was removed from office as Pakistan prime minister Sunday after losing a no-confidence vote in the national assembly.\r\nT… [+2984 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Imran Khan's Cricketing Career Overshadowed His Political Journey", "description": "Pakistan's cricketer-turned politician Imran Khan, who turned his shaky team into champions in the 1992 Cricket World Cup, failed to repeat the same charisma in politics where he was run out by a determined Opposition.", "url": "https://www.ndtv.com/world-news/imran-khan-a-leader-whose-cricketing-career-overshadowed-his-political-journey-2874712", "urlToImage": "https://c.ndtvimg.com/2022-04/3kfhu4qo_pakistan-prime-minister-imran-khan-reuters_625x300_05_April_22.jpg", "publishedAt": "2022-04-09T20:12:41Z", "content": "Imran Khan was ousted as the Pakistan Prime Minister on Sunday.\r\nIslamabad: Pakistan's cricketer-turned politician Imran Khan, who turned his shaky team into champions in the 1992 Cricket World Cup, … [+5575 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Imran Khan Vacates Pak PM Residence Minutes Before He Lost No-Trust Vote", "description": "Imran Khan has vacated the Prime Minister's official residence minutes before he lost a crucial no-confidence vote in the National Assembly, a senior leader from his Pakistan Tehreek-e-Insaf party said on Sunday.", "url": "https://www.ndtv.com/world-news/imran-khan-vacates-pak-pms-official-home-minutes-before-he-lost-no-trust-vote-2874707", "urlToImage": "https://c.ndtvimg.com/2022-04/tjmcctcg_imran-khan-reuters_625x300_10_April_22.jpg", "publishedAt": "2022-04-09T20:08:59Z", "content": "A PTI Senator tweeted that he saw off Imran Khan from his official residence. (FILE)\r\nIslamabad: Imran Khan has vacated the Prime Minister's official residence minutes before he lost a crucial no-con… [+1190 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Imran Khan Loses Midnight No-Trust Vote, Removed As Pakistan PM", "description": "Local news reports showed extraordinary scenes of political turmoil in Islamabad as the no-confidence vote was underway after a dragged out, dramatic assembly session.", "url": "https://www.ndtv.com/world-news/imran-khan-loses-midnight-no-trust-vote-removed-as-pakistan-pm-2874696", "urlToImage": "https://c.ndtvimg.com/2022-04/hc0il6m_imran-khan_650x400_09_April_22.jpg", "publishedAt": "2022-04-09T20:00:14Z", "content": "<li>Pakistan Prime Minister Imran Khan has become the first PM of the country to be removed by a no-confidence vote as the National Assembly voted him out after a marathon 14-hour session. The joint … [+3815 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Bengal Killings: CBI Files Case Against 10 In Trinamool Leader's Murder", "description": "The CBIon Saturday registered an FIR against 10 people in connection with the murder of Trinamool Congress leader Bhadu Shiekh, which apparently led to the killing of nine people in West Bengal's Birbhum district, a senior official said.", "url": "https://www.ndtv.com/india-news/bengal-killings-birbhum-killings-cbi-files-case-against-10-in-trinamool-leaders-murder-2874610", "urlToImage": "https://c.ndtvimg.com/2022-03/e785rkl8_birbhum-violence_625x300_24_March_22.jpg", "publishedAt": "2022-04-09T19:01:49Z", "content": "Birbhum killings case: The CBI visited Rampurhat police station during the day, an official said. (File)\r\nRampurhat (West Bengal): The Central Bureau of Investigation (CBI) on Saturday registered an … [+1287 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Nagpur Man Cheated Of Rs 21 Lakh With MBBS Admission Promise: Police", "description": "A Nagpur resident was allegedly cheated of Rs 21 lakh by four persons by offering to secure admission to medical college for his daughter, police said on Saturday.", "url": "https://www.ndtv.com/nagpur-news/nagpur-man-cheated-of-rs-21-lakh-with-mbbs-admission-promise-police-2874563", "urlToImage": "https://c.ndtvimg.com/2021-08/l0b8i664_nagpur-police-generic-650_625x300_09_August_21.jpg", "publishedAt": "2022-04-09T18:49:45Z", "content": "Nagpur: Police said they have registered a case of cheating. (Representational)\r\nNagpur: A Nagpur resident was allegedly cheated of Rs 21 lakh by four persons by offering to secure admission to medic… [+750 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "SA vs BAN: Wiaan Mulder's Three-Wicket Blast Sends Bangladesh Tumbling", "description": "SA vs BAN: All-rounder Wiaan Mulder took three wickets in quick succession to put South Africa on top on the second day of the second Test against Bangladesh at St George's Park in Gqeberha on Saturday", "url": "https://sports.ndtv.com/cricket/south-africa-vs-bangladesh-2nd-test-day-2-report-wiaan-mulders-three-wicket-blast-sends-bangladesh-tumbling-against-south-africa-2874653", "urlToImage": "https://c.ndtvimg.com/2022-04/acnmnsmg_south-africa-afp_625x300_10_April_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-04-09T18:44:09Z", "content": "All-rounder Wiaan Mulder took three wickets in quick succession to put South Africa on top on the second day of the second Test against Bangladesh at St George's Park in Gqeberha on Saturday. Banglad… [+2218 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Covid XE Variant Not Lethal, Says Maharashtra Minister", "description": "Maharashtra Health Minister Rajesh Tope on Saturday said that Omicron sub-variant XE is not lethal and the only case detected in the state of an elderly man is asymptomatic.", "url": "https://www.ndtv.com/india-news/covid-xe-variant-not-lethal-infected-man-asymptomatic-maharashtra-minister-2874403", "urlToImage": "https://c.ndtvimg.com/2021-04/jqbftn1_rajesh-tope-650_625x300_23_April_21.jpg", "publishedAt": "2022-04-09T18:33:05Z", "content": "Rajesh Tope said there is no worry about the new Covid XE variant. (File)\r\nJalna: Maharashtra Health Minister Rajesh Tope on Saturday said that Omicron sub-variant XE is not lethal and the only case … [+1954 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "IPL 2022: Anuj Rawat, Bowlers Shine As RCB Thrash MI By 7 Wickets", "description": "IPL 2022: Suryakumar Yadav hit an unbeaten 68 but his Mumbai Indians team fell to their fourth successive loss of this season's IPL as they went down to Royal Challengers Bangalore on Saturday.", "url": "https://sports.ndtv.com/ipl-2022/indian-premier-league-rcb-vs-mi-match-report-anuj-rawat-bowlers-shine-as-rcb-thrash-mumbai-indians-by-7-wickets-2874633", "urlToImage": "https://c.ndtvimg.com/2022-04/i9i5bc88_anuj-rawat-ipl-bcci_625x300_09_April_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-04-09T18:25:40Z", "content": "Suryakumar Yadav hit an unbeaten 68 but his Mumbai Indians team fell to their fourth successive loss of this season's IPL as they went down to Royal Challengers Bangalore on Saturday. The swashbuckli… [+1819 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Imran Khan Rejects Reports Claiming He Dismissed Pak Army Chief", "description": "Pakistan's embattled Prime Minister Imran Khan on Saturday night rejected reports that he had dismissed Army chief General Qamar Javed Bajwa, amidst the raging political and constitutional crisis in the country over a no-confidence motion against him", "url": "https://www.ndtv.com/world-news/imran-khan-rejects-reports-claiming-he-dismissed-pak-army-chief-2874631", "urlToImage": "https://c.ndtvimg.com/2022-04/3kfhu4qo_pakistan-prime-minister-imran-khan-reuters_625x300_05_April_22.jpg", "publishedAt": "2022-04-09T18:25:39Z", "content": "No Pakistani prime minister has ever completed a full five-year term in office. (FILE)\r\nIslamabad: Pakistan's embattled Prime Minister Imran Khan on Saturday night rejected reports that he had dismis… [+2114 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Ramiz Raja To Pitch 4-Nation Tournament Featuring India, Pak In ICC Meet", "description": "Pakistan Cricket Board chairman Ramiz Raja is set to table a proposal for a four-nation tournament in the ICC board meeting on Sunday.", "url": "https://sports.ndtv.com/cricket/ramiz-raja-to-pitch-4-nation-tournament-featuring-india-pakistan-in-icc-board-meet-2874615", "urlToImage": "https://c.ndtvimg.com/2021-11/mhp13ovg_ramiz-raja-afp_625x300_16_November_21.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-04-09T18:04:21Z", "content": "The all-powerful ICC board will conclude its two-day meeting on Sunday with the process of nominating/renominating the chairman along with the ambitious four-nation proposal pitched by PCB chairman R… [+2233 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Homeopathy Could Become 1st Choice Of Medical Education: Minister", "description": "AYUSH Minister Sarbananda Sonowal inaugurated a two-day scientific convention on 'Homoeopathy: People's Choice for Wellness' on the World Homoeopathy Day (WHD).", "url": "https://www.ndtv.com/education/homeopathy-could-become-first-choice-for-students-seeking-medical-education-ayush-minister", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/4/9/sarbananda-sonowal-minister-featured-image.jpg", "publishedAt": "2022-04-09T17:52:55Z", "content": "New Delhi:Public acceptance of homeopathy is high and it could become the first choice for students seeking medical education, AYUSH Minister Sarbananda Sonowal said on Saturday. Mr Sonowal inaugurat… [+1810 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTVSports", "title": "Royal Challengers Bangalore vs Mumbai Indians Live Score Ball by Ball, IPL 2022 Live Cricket Score Of Today's Match on NDTV Sports", "description": "Live Updates of Today Match between Royal Challengers Bangalore vs Mumbai Indians from Maharashtra Cricket Association Stadium, Pune. Check commentary and full scoreboard of the match.", "url": "https://sports.ndtv.com/ipl-2022/royal-challengers-bangalore-vs-mumbai-indians-live-score-over-match-18-t20-16-20-updates-2874566", "urlToImage": "https://edata.ndtv.com/twittergft/sport_automated_story/big_637851433329641939.png", "publishedAt": "2022-04-09T17:39:41Z", "content": "Follow the Indian Premier League 2022 live cricket score on Sports.NDTV.com. After 18.3 overs, Royal Challengers Bangalore, chasing a target of 152, are 152/3. Get live score, ball by ball commentary… [+5842 chars]"}]}