{"status": "ok", "totalResults": 409, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Inch Closer To Kyiv, Ukraine Says Fleeing Civilians Killed: 10 Facts", "description": "Russian forces have advanced closer to Ukraine capital Kyiv from the north, west and northeast. Ukraine President Volodymyr Zelensky also said Russia was sending new forces after suffering what he said were its biggest losses in decades.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-battle-near-kyiv-mariupol-civilians-targetted-volodymyr-zelensky-2819776", "urlToImage": "https://c.ndtvimg.com/2022-03/03bjbih_russia-ukraine-reuters_625x300_13_March_22.jpg", "publishedAt": "2022-03-13T01:58:05Z", "content": "<li>Ukraine says Russian troops shot at a group of women and children evacuees leaving a village near Kyiv, killing seven, one of them a child.\r\n</li><li>Around 13,000 people were evacuated from a nu… [+1508 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Edited by NDTV News Desk", "title": "LIVE: India's Covid Tally Rises To 4.29 Crore, Active Cases Dip To 40,559", "description": "India Saturday recorded its lowest single-day rise in Covid infections since May 12, 2020 as 3,614 fresh cases pushed the overall tally to 4,29,87,875 infections, even as the number of active cases dipped to 40,559, the Union Health Ministry said.", "url": "https://www.ndtv.com/india-news/coronavirus-live-updates-coronavirus-latest-news-today-coronavirus-india-cases-13-march-2022-2819757", "urlToImage": "https://c.ndtvimg.com/2022-02/657cucb_coronavirus-testing-india-pti-pic_650x400_23_February_22.jpg", "publishedAt": "2022-03-12T23:47:55Z", "content": "COVID-19 Cases In India: The daily positivity rate was recorded at 0.44 per cent (File)\r\nNew Delhi: India Saturday recorded its lowest single-day rise in Covid infections since May 12, 2020 as 3,614 … [+2692 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Two Injured In Stabbing At New York's Museum Of Modern Art", "description": "Two people were stabbed at New York's prestigious Museum of Modern Art on Saturday, police said, causing the museum to be evacuated.", "url": "https://www.ndtv.com/world-news/two-injured-in-stabbing-at-new-yorks-museum-of-modern-art-2819751", "urlToImage": "https://c.ndtvimg.com/2022-03/nt21ku9o_new-yorks-museum-of-modern-art-afp-650_625x300_13_March_22.jpg", "publishedAt": "2022-03-12T23:31:42Z", "content": "US media, however, reported that police have identified a suspect.\r\nNew York: Two people were stabbed at New York's prestigious Museum of Modern Art on Saturday, police said, causing the museum to be… [+917 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "German Ex-Chancellor Speaks To Putin In A Bid To End Ukraine War: Report", "description": "Former German Chancellor Gerhard Schroeder met Russian President Vladimir Putin for several hours on Thursday evening in a bid to end the war in Ukraine, Germany's Bild am Sonntag (BamS) reported, although it was unclear what was achieved.", "url": "https://www.ndtv.com/world-news/ukraine-russia-crisis-german-ex-chancellor-gerhard-schroeder-speaks-to-russian-president-vladimir-putin-in-a-bid-to-end-ukraine-war-report-2819750", "urlToImage": "https://c.ndtvimg.com/2022-03/kd4mav68_ukraine-war-afp-650_625x300_12_March_22.jpg", "publishedAt": "2022-03-12T23:22:42Z", "content": "Russian forces have made advancements in Melitopol and have captured its mayor. (File)\r\nBerlin: Former German Chancellor Gerhard Schroeder met Russian President Vladimir Putin for several hours on Th… [+1936 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Authorises $200 Million In Additional Military Aid To Ukraine", "description": "US President Joe Biden authorized $200 million in additional military equipment for Ukraine Saturday, as Russia widens its bombardment and pummels civilian areas.", "url": "https://www.ndtv.com/world-news/ukraine-russia-crisis-us-authorises-200-million-in-additional-military-aid-to-ukraine-2819748", "urlToImage": "https://c.ndtvimg.com/2022-03/kj4ou2b4_russia-ukraine-afp_625x300_12_March_22.jpg", "publishedAt": "2022-03-12T23:14:53Z", "content": "Russia said Saturday its troops could target supplies of Western weapons in Ukraine (File)\r\nWashington: US President Joe Biden authorized $200 million in additional military equipment for Ukraine Sat… [+1724 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "France Offers Covid Vaccine Fourth Dose To People Over 80s", "description": "France is offering a fourth dose of a coronavirus vaccine to people older than 80 who had their booster more than three months ago, the prime minister said Saturday.", "url": "https://www.ndtv.com/world-news/france-offers-covid-19-vaccine-fourth-dose-to-people-over-80s-2819747", "urlToImage": "https://c.ndtvimg.com/2021-12/kfol2qbc_france-coronavirus-reuters_625x300_31_December_21.jpg", "publishedAt": "2022-03-12T23:00:32Z", "content": "France has recorded more than 23 million cases of COVID-19 on its soil (File)\r\nParis: France is offering a fourth dose of a coronavirus vaccine to people older than 80 who had their booster more than… [+1076 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ex Tamil Nadu Minister Out From Jail Accuses DMK Of Political Vendetta", "description": "AIADMK Senior leader D Jayakumar, arrested in connection with three cases including one on land-grab, was released from the Central prison in Chennai on Saturday after being granted conditional bail by the Madras High Court.", "url": "https://www.ndtv.com/tamil-nadu-news/ex-tamil-nadu-minister-d-jayakumar-released-from-jail-accuses-dmk-of-political-vendetta-2819720", "urlToImage": "https://c.ndtvimg.com/2019-03/90goh0g_d-jayakumar_625x300_29_March_19.jpg", "publishedAt": "2022-03-12T20:43:01Z", "content": "D Jayakumar stepped out of the prison to a rousing reception by AIADMK leaders and cadres.\r\nChennai: Senior leader of the AIADMK and former Fisheries Minister of Tamil Nadu D Jayakumar, arrested in c… [+1749 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Satellite Pics Show Fires, Damage To Buildings In Ukraine's Mariupol", "description": "Satellite images taken on Saturday morning showed extensive damage to civilian infrastructure and residential buildings throughout the southern Ukrainian city of Mariupol, a private U.S. company said.", "url": "https://www.ndtv.com/world-news/ukraine-russia-crisis-satellite-pics-show-fires-severe-damage-to-residential-buildings-in-ukraines-mariupol-2819718", "urlToImage": "https://c.ndtvimg.com/2022-03/sapt4hq_ukraine-mariupol-reuters-650_625x300_13_March_22.jpg", "publishedAt": "2022-03-12T20:34:01Z", "content": "A satellite image shows a multispectral view of fires in an industrial area, in Mariupol\r\nSatellite images taken on Saturday morning showed extensive damage to civilian infrastructure and residential… [+1333 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Delayed Relief Turns Meaningless, Says Allahabad High Court Chief Justice", "description": "Chief Justice Rajesh Bindal of Allahabad High Court in Mathura on Saturday sought to drive home the malady of delayed justice, recalling an incident in which a man refused to take the compensation 25 years after death of his son in a road accident.", "url": "https://www.ndtv.com/india-news/delayed-relief-turns-meaningless-says-allahabad-high-court-chief-justice-rajesh-bindal-2819703", "urlToImage": "https://c.ndtvimg.com/2021-01/7eom9oh8_allahabad-high-court-ndtv_625x300_07_January_21.jpg", "publishedAt": "2022-03-12T20:13:42Z", "content": "The high court's chief justice narrated the incident in presence of Justice Rajeev Joshi (File)\r\nMathura: Chief Justice Rajesh Bindal of the Allahabad High Court in Mathura on Saturday sought to driv… [+1653 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Ronaldo Sets All-time Scoring Record With Hat-trick Against Tottenham", "description": "Cristiano Ronaldo had scored just once in his previous 10 games, but three fantastic finishes took him clear as the highest scorer in professional men's football history according to FIFA's records with 807 goals for club and country.", "url": "https://sports.ndtv.com/football/cristiano-ronaldo-sets-all-time-scoring-record-with-hat-trick-against-tottenham-in-big-win-for-manchester-united-2819701", "urlToImage": "https://c.ndtvimg.com/2022-03/4o7kns5g_cristiano-ronaldo-manchester-united_625x300_13_March_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-03-12T20:05:44Z", "content": "Cristiano Ronaldo set another goalscoring record in a return to form with a hat-trick to keep Manchester United's chances of playing in the Champions League next season alive with a 3-2 win over Tott… [+2985 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Co-Pilot Killed In Army Chopper Crash In North Kashmir Cremated In Jaipur", "description": "The body of Major Sankalp Yadav, who was killed in an Army helicopter crash in north Kashmir, were consigned to flames with full military honours in Jaipur on Saturday.", "url": "https://www.ndtv.com/india-news/co-pilot-major-sankalp-yadav-killed-in-army-chopper-crash-in-north-kashmir-cremated-in-jaipur-2819691", "urlToImage": "https://c.ndtvimg.com/2022-03/clguca5g_chopper-crash_625x300_11_March_22.jpg", "publishedAt": "2022-03-12T19:43:26Z", "content": "Major Sankalp Yadav's body arrived at the Jaipur airport on Saturday. (File)\r\nJaipur: The body of Major Sankalp Yadav, who was killed in an Army helicopter crash in north Kashmir, were consigned to f… [+1079 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Humanitarian Situation In Some Ukraine Cities \"Catastrophic\": Russia", "description": "The humanitarian situation in Ukraine is deteriorating quickly and has become catastrophic in a number of cities, the Russian military said on Saturday, speaking on the 17th day of what Moscow has termed a \"special military operation\".", "url": "https://www.ndtv.com/world-news/ukraine-russia-crisis-humanitarian-situation-in-some-ukraine-cities-catastrophic-russian-military-2819689", "urlToImage": "https://c.ndtvimg.com/2022-03/57h64q2_ukraine-refugees-reuters-650_625x300_09_March_22.jpg", "publishedAt": "2022-03-12T19:30:29Z", "content": "Russia also accused Ukraine's military of holding hostage nearly 7,000 people from 16 foreign countries\r\nMoscow: The humanitarian situation in Ukraine is deteriorating quickly and has become catastro… [+1163 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Woman Raped Inside Bus In Madhya Pradesh, Two Arrested: Police", "description": "A woman was allegedly raped in a bus in Madhya Pradesh's Dhar district. Dhar police have arrested two people on Saturday in connection with the case while the third accused is absconding.", "url": "https://www.ndtv.com/cities/woman-raped-inside-bus-in-madhya-pradeshs-dhar-two-arrested-police-2819683", "urlToImage": "https://c.ndtvimg.com/2019-08/lgkv91gc_rape-generic-rape-protest_625x300_22_August_19.jpg", "publishedAt": "2022-03-12T19:22:35Z", "content": "The Manawar police station registered a case under sections of gang rape. (Representational)\r\nDhar: A woman was allegedly raped in a bus in Madhya Pradesh's Dhar district. Dhar police have arrested t… [+1419 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russian Forces Kill Seven Civilians Near Kyiv, Says Ukraine", "description": "Russian troops shot at a group of women and children evacuees leaving a village near Kyiv, killing seven, one of them a child, Ukraine's military intelligence service said Saturday, stating this happened on Friday.", "url": "https://www.ndtv.com/world-news/ukraine-russia-crisis-russian-forces-kill-seven-civilians-near-kyiv-says-ukraine-2819679", "urlToImage": "https://c.ndtvimg.com/2022-03/4an2fkao_ukraine-kyiv-reuters-650_625x300_13_March_22.jpg", "publishedAt": "2022-03-12T19:00:23Z", "content": "he result of this brutal act was seven dead. One of them is a child: Ukraine\r\nKyiv: Russian troops shot at a group of women and children evacuees leaving a village near Kyiv, killing seven, one of th… [+529 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Pochettino Finding It \"Hard To Sleep\" Since PSG's Collapse vs Real Madrid", "description": "Paris Saint-Germain coach Mauricio Pochettino said on Saturday that he is finding it \"hard to sleep at night\" after his side's dramatic Champions League capitulation against Real Madrid, but that he wants his team to take out their \"rage\" on their Ligue 1 opp…", "url": "https://sports.ndtv.com/football/mauricio-pochettino-finding-it-hard-to-sleep-since-psgs-collapse-vs-real-madrid-2819665", "urlToImage": "https://c.ndtvimg.com/2022-03/gmp0nf0o_mauricio-pochettino-afp_625x300_12_March_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-03-12T18:22:18Z", "content": "Paris Saint-Germain coach Mauricio Pochettino said on Saturday that he is finding it \"hard to sleep at night\" after his side's dramatic Champions League capitulation against Real Madrid, but that he … [+1757 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Refugee Arrivals Dip But Ukraine's Neighbours Struggle To Provide Shelter", "description": "Ukraine's neighbours reported a dip in numbers of refugees on Saturday as governments and volunteers struggled to find shelter for the nearly 2.6 million mostly women and children who have fled since Russia's invasion two weeks ago.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-refugee-arrivals-dip-but-ukraines-neighbours-struggle-to-provide-shelter-2819185", "urlToImage": "https://c.ndtvimg.com/2022-03/2h3p1b8_ukraine-refugees-reuters_625x300_12_March_22.jpg", "publishedAt": "2022-03-12T18:05:10Z", "content": "Refugees have aimed for cities with established Ukrainian communities.\r\nPoland: Ukraine's neighbours reported a dip in numbers of refugees on Saturday as governments and volunteers struggled to find … [+3367 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Chhattisgarh Teacher Comes To School Drunk, Suspended: Official", "description": "A school teacher in Chhattisgarh's Jashpur was suspended after he reached school in a drunken state and beat the students with a cricket bat, the district collector informed on Saturday.", "url": "https://www.ndtv.com/india-news/teacher-in-chhattisgarhs-jashpur-suspended-after-he-reaches-school-in-drunken-state-2819641", "urlToImage": "https://c.ndtvimg.com/s4qvni58_classroom-generic-pixababy-650_625x300_13_August_18.jpg", "publishedAt": "2022-03-12T17:47:53Z", "content": "Chhattisgarh Teacher Comes To School Drunk, Suspended: Official (Representational)\r\nJashpur (Chhattisgarh): A school teacher in Chhattisgarh's Jashpur was suspended after he reached school drunk and … [+554 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "'Bouncer' Hired By Pune School Accused Of Manhandling Parents", "description": "Police have registered a non-cognizable (NC) offence against a woman bouncer' working for a school in the city for allegedly roughing up two parents.", "url": "https://www.ndtv.com/india-news/bouncer-hired-by-pune-school-accused-of-manhandling-parents-2819637", "urlToImage": "https://c.ndtvimg.com/2021-05/9peonr88_pune-police-generic-twitter-650_625x300_17_May_21.jpg", "publishedAt": "2022-03-12T17:42:10Z", "content": "The lady bouncer allegedly abused and hit them, said cops\r\nPune: Police have registered a non-cognizable (NC) offence against a woman `bouncer' working for a school in the city for allegedly roughing… [+972 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Yogi Adityanath In Delhi Tomorrow To Discuss New Cabinet With PM", "description": "Days after the BJP retained power for the second consecutive term in Uttar Pradesh, Chief Minister Yogi Adityanath is scheduled to visit Delhi on Sunday to discuss the new cabinet with Prime Minister Narendra Modi.", "url": "https://www.ndtv.com/india-news/yogi-adityanath-delhi-visit-uttar-pradesh-elections-yogi-adityanath-in-delhi-tomorrow-to-discuss-new-cabinet-with-pm-2819578", "urlToImage": "https://c.ndtvimg.com/2022-02/1e362nig_yogi-adityanath-pti-650_650x400_11_February_22.jpg", "publishedAt": "2022-03-12T17:36:25Z", "content": "The swearing-in ceremony date will also be discussed during the meeting. (File)\r\nLucknow: Days after the BJP retained power for the second consecutive term in Uttar Pradesh, Chief Minister Yogi Adity… [+4174 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Women's World Cup, New Zealand vs Australia: Live Score, Live Updates", "description": "ICC Women's Cricket World Cup, New Zealand Women vs Australia Women: New Zealand face Australia in their upcoming League Stage fixture at the Basin Reserve in Wellington.", "url": "https://sports.ndtv.com/icc-women-s-world-cup-2022/icc-womens-cricket-world-cup-new-zealand-women-vs-australia-women-live-cricket-score-live-updates-basin-reserve-wellington-2819624", "urlToImage": "https://c.ndtvimg.com/2022-03/u1agn08_new-zealand-afp_625x300_12_March_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-03-12T17:33:07Z", "content": "The 2022 Women's World Cup is swiftly underway and the points table is starting to take shape. In match number 11, the hosts New Zealand Women take on Australia Women to reignite the Trans-Tasmanian … [+1322 chars]"}]}