{"status": "ok", "totalResults": 386, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Amul Hikes Milk Prices By Rs 2 Per Litre", "description": "Cooperative GCMMF, which markets milk and milk products under the Amul brand, has increased milk prices by Rs 2 per litre with effect from Tuesday due to rise in input cost.", "url": "https://www.ndtv.com/india-news/amul-hikes-milk-prices-by-rs-2-per-litre-2795145", "urlToImage": "https://c.ndtvimg.com/lp65n6so_amul---company-website_625x300_24_July_18.jpg", "publishedAt": "2022-02-28T14:02:31Z", "content": "This price hike is being done due to rise in costs of energy, packaging, logistics and cattle feed (File)\r\nNew Delhi: Cooperative GCMMF, which markets milk and milk products under the Amul brand, has… [+1487 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Bans Airlines From 36 Countries Including Britain And Germany", "description": "Russia has announced it is banning flights by airlines from 36 countries including Britain and Germany in response to a slew of bans on its planes.", "url": "https://www.ndtv.com/world-news/ukraine-russia-crisis-russia-bans-airlines-from-36-countries-including-britain-and-germany-2795144", "urlToImage": "https://c.ndtvimg.com/2021-11/6kiklnac_airport-plane-generic_625x300_23_November_21.jpg", "publishedAt": "2022-02-28T14:02:31Z", "content": "Airlines will only be able to enter Russian airspace with a special permit (Representational photo)\r\nMoscow: Russia has announced it is banning flights by airlines from 36 countries including Britain… [+957 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Putin's Photo With Hitler Moustache, Nazi Symbol As Time Cover Is Fake", "description": "Many users on social media are sharing Time Magazine's cover showing Russian President as Adolf Hitler.", "url": "https://www.ndtv.com/world-news/putins-photo-with-hitler-moustache-nazi-symbol-as-time-cover-is-fake-2795132", "urlToImage": "https://c.ndtvimg.com/2022-02/vali9i6_putin-time-cover-650_625x300_28_February_22.jpg", "publishedAt": "2022-02-28T13:58:39Z", "content": "Russia-Ukraine war: The Time Magazine cover is being widely circulated on social media.\r\nTwo images circulating on social media featuring Russian President Vladimir Putin as German dictator Adolf Hit… [+2857 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Former Australian Wicketkeeper Rodney Marsh In Induced Coma", "description": "Australian cricket great Rodney Marsh was \"in the fight of his life\" Monday after being placed in an induced coma following a major heart attack last week, his family said.", "url": "https://sports.ndtv.com/cricket/former-australian-wicketkeeper-rodney-marsh-in-induced-coma-2795124", "urlToImage": "https://c.ndtvimg.com/2022-02/ohlhbg2g_2786504_625x300_28_February_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-02-28T13:55:19Z", "content": "Australian cricket great Rodney Marsh was \"in the fight of his life\" Monday after being placed in an induced coma following a major heart attack last week, his family said. The 74-year-old wicketkeep… [+733 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "3rd ODI Report: Gurbaz, Rashid Shine In Afghanistan's Win Over Bangladesh", "description": "Rahmanullah Gurbaz and Rashid Khan starred as Afghanistan defeated Bangladesh by seven wickets in the third one-day international to avoid a whitewash in the three-match series on Monday.", "url": "https://sports.ndtv.com/cricket/bangladesh-vs-afghanistan-3rd-odi-report-rahmanullah-gurbaz-rashid-khan-shine-in-afghanistans-win-over-bangladesh-2795119", "urlToImage": "https://c.ndtvimg.com/2022-02/piiv23h8_rahmanullah-gurbaz-afp_625x300_28_February_22.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-02-28T13:54:46Z", "content": "Rahmanullah Gurbaz and Rashid Khan starred as Afghanistan defeated Bangladesh by seven wickets in the third one-day international to avoid a whitewash in the three-match series on Monday. Gurbaz hit … [+2189 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "ANI", "title": "Karnataka Students' Satellite Project Named After Puneeth Rajkumar", "description": "The 'satellite design and launching project' by the government school students, on Monday, was renamed as 'Puneeth Rajkumar Student Satellite Project' after Kannada actor Puneeth Rajkumar who died a few months back, and will be launched by September 2022.", "url": "https://www.ndtv.com/education/karnataka-government-school-students-satellite-project-named-after-kannada-actor-puneeth-rajkumar", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/2/28/class-admission-application-online-featured-image.jpg", "publishedAt": "2022-02-28T13:54:26Z", "content": "Bengaluru:The 'satellite design and launching project' by the government school students, on Monday, was renamed as 'Puneeth Rajkumar Student Satellite Project' after Kannada actor Puneeth Rajkumar w… [+2704 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Targets Russia's Central Bank In Latest Sanctions Action", "description": "United States on Monday blocked Americans from engaging in any transactions involving Russia's central bank, National Wealth Fund and finance ministry", "url": "https://www.ndtv.com/business/u-s-targets-russias-central-bank-in-latest-sanctions-action-2795043", "urlToImage": "https://c.ndtvimg.com/2022-02/7lcq4ku8_ukraine-war-scene-reuters-650_625x300_28_February_22.jpg", "publishedAt": "2022-02-28T13:53:12Z", "content": "United States has blocked Americans from engaging in any transactions involving Russia's central bank\r\nWASHINGTON: The United States on Monday blocked Americans from engaging in any transactions invo… [+2526 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Telangana's KCR Signs Up Prashant Kishor Ahead Of State Polls: Sources", "description": "Election strategist Prashant Kishor reportedly met K Chandrasekhar Rao at his farm house outside Hyderabad over the weekend, setting off speculation amid the Telangana Chief Minister's efforts to cobble a front against the BJP ahead of 2024", "url": "https://www.ndtv.com/india-news/telanganas-kcr-signs-up-prashant-kishor-ahead-of-state-polls-sources-2795096", "urlToImage": "https://c.ndtvimg.com/2022-02/4128kneo_prashant-kishor-ndtv_625x300_11_February_22.jpg", "publishedAt": "2022-02-28T13:46:53Z", "content": "Sources said Prashant Kishor's political consultancy team IPAC is working for KCR\r\nElection strategist Prashant Kishor reportedly met K Chandrasekhar Rao at his farm house outside Hyderabad over the … [+2196 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Italy Great Gianluigi Buffon Extends Parma Deal Until 2024", "description": "Gianluigi Buffon signed a new deal with Parma on Monday that will keep the veteran former Italy captain at the Serie B club until 2024", "url": "https://sports.ndtv.com/football/italy-great-gianluigi-buffon-extends-parma-deal-until-2024-2795082", "urlToImage": "https://c.ndtvimg.com/2022-02/30gt10k_gianluigi-buffon-parma-twitter_625x300_28_February_22.jpg", "publishedAt": "2022-02-28T13:44:12Z", "content": "Gianluigi Buffon signed a new deal with Parma on Monday that will keep the veteran former Italy captain at the Serie B club until 2024. The one-year extension to his deal means Buffon, who is Parma's… [+1608 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Mridusmita Deka", "title": "49 School Teachers Conferred With National ICT Awards", "description": "These ICT awardees are also encouraged to function as ICT ambassadors in widening the outreach of ICT in education through their continuous efforts by mentoring other teachers and also develop entrepreneurial skills among the students in order to develop a sk…", "url": "https://www.ndtv.com/education/minister-of-state-for-education-annpurna-devi-confers-49-school-teachers-national-ict-awards", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/2/28/teacher-award-featured-image.jpg", "publishedAt": "2022-02-28T13:35:00Z", "content": "New Delhi:Union Minister of State for Education Annpurna Devi today presented the National ICT Awards to 49 teachers across the country. Recognition given in the form of National Award for school tea… [+2632 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "PM To Hold Third High-Level Meeting On Ukraine Crisis In 24 Hours: Sources", "description": "Prime Minister Narendra Modi will soon chair a meeting to discuss the situation in war-torn Ukraine -- the third in 24 hours. Sources said top ministers and officials will attend the meet.", "url": "https://www.ndtv.com/india-news/pm-to-hold-third-high-level-meeting-on-ukraine-crisis-in-24-hours-sources-2795057", "urlToImage": "https://c.ndtvimg.com/2022-02/tvpkfh_russia-ukraine-crisis-afp-650_625x300_27_February_22.jpg", "publishedAt": "2022-02-28T13:34:43Z", "content": "Prime Minister Narendra Modi will soon chair a meeting to discuss the situation in war-torn Ukraine -- the third in 24 hours. Sources said top ministers and officials will attend the meet. Sources al… [+1548 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Human Trafficking Racket Busted, 3 Bangladeshis Among 4 Arrested: Police", "description": "Four people have been arrested in connection with a human trafficking racket in which Bangladeshi nationals were being brought into India illegally, a Maharashtra Anti Terrorism Squad official said on Monday.", "url": "https://www.ndtv.com/india-news/human-trafficking-racket-busted-by-maharashtra-ats-3-bangladeshis-among-4-arrested-police-2795009", "urlToImage": "https://i.ndtvimg.com/i/2016-04/arrest-generic-istock_650x400_71461678057.jpg", "publishedAt": "2022-02-28T13:32:57Z", "content": "There was a minor girl among the three Bangladeshis arrested, said an official. (Representational)\r\nMumbai: Four people have been arrested in connection with a human trafficking racket in which Bangl… [+1743 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Pietersen Shares Update On \"Immediate Family\" Who Have Escaped Ukraine", "description": "Kevin Pietersen in his post spoke about the love that fleeing Ukrainians are getting from neighbouring Poland, where a lot of Ukrainians have been moving to since the Russian invasion of the country began.", "url": "https://sports.ndtv.com/cricket/kevin-pietersen-shares-update-about-his-immediate-family-that-have-just-escaped-from-ukraine-to-poland-2795049", "urlToImage": "https://c.ndtvimg.com/2022-01/qnhmi0s8_kevin-pietersen-afp_625x300_28_January_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-02-28T13:32:44Z", "content": "Former England captain Kevin Pietersen took to Twitter on Monday to share an update about his \"immediate family\", who have escaped from Ukraine due to the ongoing Russian invasion. Pietersen in his p… [+1244 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Amid Ukraine War, Russian Tycoon Says Time To End \"State Capitalism\"", "description": "Russian tycoon Oleg Deripaska on Monday said it was time to put an end \"all this state capitalism\" and change policies as the country's economy reeled from the effects of Western sanctions over Moscow's assault on Ukraine.", "url": "https://www.ndtv.com/world-news/amid-ukraine-war-russian-tycoon-oleg-deripaska-says-time-to-end-state-capitalism-2795034", "urlToImage": "https://i.ndtvimg.com/i/2018-04/oleg-deripaska-reuters_650x400_81523062740.jpg", "publishedAt": "2022-02-28T13:28:39Z", "content": "Russian tycoon Oleg Deripaska said it is necessary to change the economic policy.\r\nMoscow: Russian tycoon Oleg Deripaska on Monday said it was time to put an end \"all this state capitalism\" and chang… [+478 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Samajwadi Party, BSP Worked On Caste Lines, BJP Worked For UP: Amit Shah", "description": "Union Home Minister Amit Shah on Monday accused the Samajwadi Party and the Bahujan Samaj Party of working on caste lines when in power in Uttar Pradesh, and said his BJP has worked for all communities in the state since 2017.", "url": "https://www.ndtv.com/india-news/up-assembly-elections-2022-samajwadi-party-bsp-worked-on-caste-lines-bjp-worked-for-all-in-up-amit-shah-2795014", "urlToImage": "https://c.ndtvimg.com/2022-02/e4qcbuk8_amit-shah-in-kushinagar-650_625x300_28_February_22.jpg", "publishedAt": "2022-02-28T13:22:59Z", "content": "Amit Shah also lauded the Centre for giving Rs 6,000 per annum directly to farmers.\r\nKushinagar: Union Home Minister Amit Shah on Monday accused the Samajwadi Party and the Bahujan Samaj Party of wor… [+4285 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "European Union Plans To Grant Ukrainians Right To Stay For Up To 3 Years", "description": "The European Union is preparing to grant Ukrainians who flee the war the right to stay and work in the 27-nation bloc for up to three years, senior EU and French officials said, thanking volunteers at the borders for helping those who arrive.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-european-union-plans-to-grant-ukrainians-right-to-stay-for-up-to-3-years-2794992", "urlToImage": "https://c.ndtvimg.com/2022-02/cfic0js_ukraine-refugees-reuters-650_625x300_28_February_22.jpg", "publishedAt": "2022-02-28T13:16:51Z", "content": "Ukraine War: EU ministers will meet again on Thursday to agree on the details.\r\nWashington: The European Union is preparing to grant Ukrainians who flee the war the right to stay and work in the 27-n… [+2470 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Thrown Out Of Train, Beaten With Sticks: Student to NDTV From Kyiv Station", "description": "One of the many Indian students stranded in Ukraine's Kyiv sent a video to NDTV today, saying they were \"thrown out of trains\" when they went to a station for evacuation under the instructions of the Indian embassy. Currently, 350 students from two m", "url": "https://www.ndtv.com/india-news/thrown-out-of-train-beaten-with-sticks-indian-student-to-ndtv-from-kyiv-station-2794983", "urlToImage": "https://c.ndtvimg.com/2022-02/dla9onqg_kyiv-students-_625x300_28_February_22.jpg", "publishedAt": "2022-02-28T13:13:40Z", "content": "Thiruvananthapuram: One of the many Indian students stranded in Ukraine's Kyiv sent a video to NDTV today, saying they were being \"thrown out of trains\" when they went to a station for evacuation und… [+2088 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "5 Reasons Why India Is Treading Cautiously On Ukraine", "description": "India abstained on a UN resolution linked to Russia's Ukraine invasion for the second time in a week. On Sunday, India abstained on a UN Security Council resolution to call for a rare special emergency session of the UNGA on Russia's aggression", "url": "https://www.ndtv.com/india-news/5-reasons-why-india-is-treading-cautiously-on-ukraine-2794962", "urlToImage": "https://c.ndtvimg.com/2022-02/gd19n528_un-general-assemblyafp_625x300_28_February_22.jpg", "publishedAt": "2022-02-28T13:08:33Z", "content": "So far, India has stopped short of outright condemnation of the Russian invasion.\r\nNew Delhi: India abstained on a UN resolution linked to Russia's Ukraine invasion for the second time in a week. On … [+2111 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russian Strategic Missile Forces Put On Enhanced Combat Duty: Report", "description": "Russia's defence ministry on Monday said its strategic missile forces and Northern and Pacific fleets had been placed on enhanced combat duty, the Interfax news agency reported, in line with an order from President Vladimir Putin.", "url": "https://www.ndtv.com/world-news/russia-ukraine-crisis-russia-puts-strategic-missile-forces-on-enhanced-combat-duty-2794961", "urlToImage": "https://c.ndtvimg.com/2022-02/n00i5gh_russia-artillery-afp-650_625x300_28_February_22.jpg", "publishedAt": "2022-02-28T13:08:30Z", "content": "Russia's defence ministry on Monday said its strategic missile forces and Northern and Pacific fleets had been placed on enhanced combat duty, the Interfax news agency reported, in line with an order… [+430 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Uses Controversial Cluster Bombs In Ukraine, Hits School: Amnesty", "description": "Rights groups have called on Russia to stop using cluster munitions in Ukraine, saying fatal strikes using the indiscriminate weapons on a hospital and a school could constitute war crimes.", "url": "https://www.ndtv.com/world-news/russia-uses-controversial-cluster-bombs-in-ukraine-hits-school-amnesty-2794956", "urlToImage": "https://c.ndtvimg.com/2022-02/6701bmvo_ukraine-afp_625x300_28_February_22.jpg", "publishedAt": "2022-02-28T13:06:40Z", "content": "Ukraine war: Russian forces allegedly used cluster munitions in a civilian area\r\nLondon: Rights groups have called on Russia to stop using cluster munitions in Ukraine, saying fatal strikes using the… [+2715 chars]"}]}