{"status": "ok", "totalResults": 299, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE: India Sees Over 2,500 New COVID-19 Cases In 24 Hours", "description": "India on Thursday recorded at least 2,628 new COVID-19 cases, taking the total tally of coronavirus cases to 4,31,44,820, while the active cases increased to 15,414, according to the Union Health Ministry.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-27-may-3013392", "urlToImage": "https://c.ndtvimg.com/2021-08/imokvbr_coronavirus-india-reuters-2021_650x400_18_August_21.jpg", "publishedAt": "2022-05-27T00:28:43Z", "content": "India Covid Live: India also recorded 18 new deaths due to coronavirus on Thursday.\r\nNew Delhi: India on Thursday recorded at least 2,628 new COVID-19 cases, taking the total tally of coronavirus cas… [+391 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Wife, Lover Arrested For Killing Husband In Delhi: Police", "description": "A 40-year-old woman was arrested along with her \"lover\" and another man allegedly for killing her husband in central Delhi's Daryaganj area, police said on Thursday.", "url": "https://www.ndtv.com/india-news/wife-lover-arrested-for-killing-husband-in-delhi-police-3013389", "urlToImage": "https://i.ndtvimg.com/i/2017-03/police-generic_650x400_71490246814.jpg", "publishedAt": "2022-05-27T00:11:54Z", "content": "Police said that woman was not happy with her husband and wanted to marry someone else.(Representational)\r\nNew Delhi:  A 40-year-old woman was arrested along with her \"lover\" and another man allegedl… [+2499 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Assam Floods: Death Count Reaches 30, Over 5.61 Lakh People Affected", "description": "The flood situation in Assam remained critical on Thursday with two more persons, including a child, losing their lives and over 5.61 lakh people still suffering in the deluge across seven districts, as per an official bulletin.", "url": "https://www.ndtv.com/india-news/assam-floods-death-count-reaches-30-over-5-61-lakh-people-affected-3013384", "urlToImage": "https://c.ndtvimg.com/2022-05/dsfogkok_assam-floods-650_625x300_19_May_22.jpg", "publishedAt": "2022-05-26T23:55:35Z", "content": "Assam Floods: A total of 1,88,698 domestic animals have been affected due to floods, the official said.\r\nGuwahati: The flood situation in Assam remained critical on Thursday with two more persons, in… [+2438 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Imran Khan Slams Pak Government Over Fuel Price Hike, Praises India Again", "description": "Former Pakistan Prime Minister Imran Khan yet again slammed the Shehbaz Sharif government after the federal government hiked the petrol and diesel prices by PKR 30 per litre.", "url": "https://www.ndtv.com/world-news/imran-khan-slams-pakistan-government-over-fuel-price-hike-praises-india-3013377", "urlToImage": "https://c.ndtvimg.com/2022-04/rpb3e0d4_imran-khan_625x300_02_April_22.jpg", "publishedAt": "2022-05-26T23:37:22Z", "content": "Imran Khan said Pakistan will suffer massive dose of inflation at the hands of this \"cabal of crooks\".\r\nIslamabad: While invoking the name of India, former Pakistan Prime Minister Imran Khan yet agai… [+2695 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine's Zelensky Accuses Russia Of \"Genocide\" In Donbas Region", "description": "Ukraine's President Volodymyr Zelensky on Thursday accused Russia of carrying out \"an obvious policy of genocide\" in his country's eastern Donbas region.", "url": "https://www.ndtv.com/world-news/ukraines-zelensky-accuses-russia-of-genocide-in-donbas-region-3013367", "urlToImage": "https://c.ndtvimg.com/2022-05/8qk8rkg8_reuters-donbas-_625x300_16_May_22.jpg", "publishedAt": "2022-05-26T23:14:50Z", "content": "Tens of thousands of Ukrainians and Russians have died since Russia invaded Ukraine in February.\r\nKyiv: Ukraine's President Volodymyr Zelensky on Thursday accused Russia of carrying out \"an obvious p… [+1014 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine Says Russia Commits \"All Its Forces\" To Capture Lugansk", "description": "Russia on Thursday made an all-out effort to capture the rest of Ukraine's industrial region of Lugansk, officials said, as the war in the east of the country escalated to its fiercest level yet.", "url": "https://www.ndtv.com/world-news/ukraine-says-russia-commits-all-its-forces-to-capture-lugansk-3013357", "urlToImage": "https://c.ndtvimg.com/2022-04/8ctb1l3o_ukraine-war-afp-650_625x300_24_April_22.jpg", "publishedAt": "2022-05-26T22:29:35Z", "content": "Ukraine also accusing allies of dragging their feet on arms deliveries amid war against Russia.\r\nKyiv: Russia on Thursday made an all-out effort to capture the rest of Ukraine's industrial region of … [+5707 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Palestinian Probe Finds Al Jazeera Reporter \"Murdered\" By Israeli Forces", "description": "An Al Jazeera journalist shot dead in the occupied West Bank earlier this month was murdered by an Israeli soldier in a \"war crime\", the official Palestinian investigation concluded Thursday.", "url": "https://www.ndtv.com/world-news/palestinian-probe-finds-al-jazeera-reporter-murdered-by-israeli-forces-in-west-bank-3013350", "urlToImage": "https://c.ndtvimg.com/2022-05/ishs654_al-jazeera-journalist-shireen-abu-aqleh650_625x300_11_May_22.jpg", "publishedAt": "2022-05-26T22:05:37Z", "content": "The Palestinian-American journalist from Al Jazeera was killed on May 11 in West Bank.\r\nRamallah: An Al Jazeera journalist shot dead in the occupied West Bank earlier this month was murdered by an Is… [+2982 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Elon Musk Sued By Twitter Shareholders For Stock Price Manipulation", "description": "Elon Musk faces a lawsuit accusing him of pushing down Twitter's stock price in order to either give himself an escape hatch from his $44 billion buyout bid, or room to negotiate a discount.", "url": "https://www.ndtv.com/world-news/elon-musk-sued-by-twitter-shareholders-for-stock-price-manipulation-3013344", "urlToImage": "https://c.ndtvimg.com/2022-04/eld58jbk_elon-musk-reuters_650x400_26_April_22.jpg", "publishedAt": "2022-05-26T21:45:56Z", "content": "The suit alleges that Elon Musk made statements intended to create doubt about the Twitter deal.\r\nSan Francisco: Elon Musk faces a lawsuit accusing him of pushing down Twitter's stock price in order … [+2524 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "At UN, China, Russia Block US Bid To Sanction North Korea Over Missile", "description": "China and Russia vetoed on Thursday a U.S.-led push to impose more UN sanctions on North Korea over its renewed ballistic missile launches, publicly splitting the U.N. Security Council for the first time since it started punishing Pyongyang in 2006.", "url": "https://www.ndtv.com/world-news/at-un-china-russia-block-us-bid-to-sanction-north-korea-over-missile-3013331", "urlToImage": "https://i.ndtvimg.com/i/2016-02/un-security-council_650x400_71456453064.jpg", "publishedAt": "2022-05-26T21:24:08Z", "content": "The UN vote to sanction against North Korea came after Pyongyang fired 3 back-back-missile on Wednesday.\r\nUnited Nations: China and Russia vetoed on Thursday a U.S.-led push to impose more United Nat… [+2695 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Biden To Visit Texas On Sunday After Deadly School Shooting: White House", "description": "US President Joe Biden and his wife Jill will head to Texas on Sunday to offer condolences to the loved ones of victims of the deadly shooting at Robb Elementary School, the White House said Thursday.", "url": "https://www.ndtv.com/world-news/us-president-joe-biden-to-visit-texas-on-sunday-in-wake-of-deadly-school-shooting-3013319", "urlToImage": "https://c.ndtvimg.com/2022-05/gb9u61u8_biden-afp_625x300_23_May_22.jpg", "publishedAt": "2022-05-26T20:58:05Z", "content": "Texas Shooting: Biden on Tuesday called for Americans to stand up against the country's pro-gun lobby.\r\nWashington: US President Joe Biden and his wife Jill will head to Texas on Sunday to offer cond… [+421 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Ready To Help Overcome Global Food Crisis If...: Putin", "description": "Moscow is ready to make a \"significant contribution\" to averting a looming food crisis if the West lifts sanctions imposed on Russia over Ukraine, President Vladimir Putin said in a telephone call with Italy's Prime Minister Mario Draghi.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-vladimir-putin-says-russia-ready-to-help-overcome-global-food-crisis-if-west-lifts-sanctions-3013316", "urlToImage": "https://c.ndtvimg.com/2022-05/6s30js9g_vladimir-putin-health-afp-650_625x300_18_May_22.jpg", "publishedAt": "2022-05-26T20:38:44Z", "content": "Ukraine War: Russia was slapped with sanctions after Putin ordered troops to invade Ukraine in February.\r\nMoscow: Moscow is ready to make a \"significant contribution\" to averting a looming food crisi… [+2020 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Spain Passes Bill Qualifying All Non-Consensual Sex As Rape", "description": "Spain's lower house of parliament on Thursday passed a bill that qualifies all non-consensual sex as rape in response to social outrage after the so-called Wolf Pack case gave momentum to the women's rights movement in the country four years ago.", "url": "https://www.ndtv.com/world-news/spain-passes-bill-qualifying-all-non-consensual-sex-as-rape-3013293", "urlToImage": "https://i.ndtvimg.com/i/2016-12/rape-generic-istock_650x400_61481882950.jpg", "publishedAt": "2022-05-26T20:24:14Z", "content": "Recently, two cases of rape of teenagers have shocked Spanish society again. (Representational)\r\nMadrid: Spain's lower house of parliament on Thursday passed a bill that qualifies all non-consensual … [+1963 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Finland Says Trust In Russia Lost For \"Generations\" Over Ukraine War", "description": "Finnish Prime Minister Sanna Marin said Thursday during a trip to Kyiv that it would take Russia decades to repair its standing in the world after invading Ukraine.", "url": "https://www.ndtv.com/world-news/finland-says-trust-in-russia-lost-for-generations-over-ukraine-war-3013276", "urlToImage": "https://c.ndtvimg.com/2022-05/eu8ad0i8_russia-ukraine-war_625x300_18_May_22.jpg", "publishedAt": "2022-05-26T19:44:41Z", "content": "Ukriane War: Finish PM Sanna Marin also met Ukrainian President Volodymyr Zelensky during her Kyiv visit.\r\nKyiv: Finnish Prime Minister Sanna Marin said Thursday during a trip to Kyiv that it would t… [+1131 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Texas Shooting: Meghan Markle Visits Uvalde To Pay Tribute To Victims", "description": "Meghan Markle, the wife of Britain's Prince Harry, on Thursday made an unannounced visit to the Texas town of Uvalde to pay her respects to the victims of a shooting at an elementary school that left 19 children and two teachers dead.", "url": "https://www.ndtv.com/world-news/texas-shooting-meghan-markle-visits-uvalde-to-pay-tribute-to-victims-3013247", "urlToImage": "https://c.ndtvimg.com/2018-12/l9neppeo_meghan-markle-reuters_625x300_17_December_18.jpg", "publishedAt": "2022-05-26T19:14:07Z", "content": "Texas Shooting: At least 19 students were killed at a Texas elementary school on Tuesday. (File)\r\nUvalde, United States: Meghan Markle, the wife of Britain's Prince Harry, on Thursday made an unannou… [+720 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Actor Vijay Babu Rape Case: Court To Hear Anticipatory Bail Plea Today", "description": "Kerala High Court posted the anticipatory bail plea of actor-cum-producer Vijay Babu in the sexual assault case against him tomorrow.", "url": "https://www.ndtv.com/india-news/kerala-high-court-vijay-babu-actor-vijay-babu-rape-case-drags-on-court-to-hear-bail-plea-today-3013224", "urlToImage": "https://c.ndtvimg.com/2022-05/4k2n28h8_vijaya-babu_625x300_27_May_22.jpg", "publishedAt": "2022-05-26T18:56:31Z", "content": "Kerala High Court posted bail plea of Vijay Babu tomorrow.\r\nKochi: Kerala High Court posted the anticipatory bail plea of actor-cum-producer Vijay Babu in the sexual assault case against him  tomorro… [+1060 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "On Drug Offenders, Supreme Court's \"Within Time\" Order To Punjab", "description": "The Supreme Court while observing that there are over 2000 NDPS offenders/accused persons in Punjab, has asked the state government to put in place appropriate provisions to ensure that the individuals are brought to book.", "url": "https://www.ndtv.com/india-news/on-drug-offenders-supreme-courts-within-time-order-to-punjab-3012797", "urlToImage": "https://c.ndtvimg.com/2019-08/5ubbk398_supreme-court-pti_650x400_01_August_19.jpg", "publishedAt": "2022-05-26T18:43:40Z", "content": "The Supreme court was hearing a matter relating to Narcotic Drugs and Psychotropic Substances.\r\nNew Delhi: The Supreme Court while observing that there are over 2000 NDPS offenders/accused persons in… [+1763 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Delhi Court To Pronounce Sentence For OP Chautala In Assets Case Tomorrow", "description": "A Delhi court will pronounce its order Friday on the quantum of sentence to be awarded to former Haryana Chief Minister Om Prakash Chautala in a disproportionate assets (DA) case.", "url": "https://www.ndtv.com/india-news/om-prakash-chautala-disproportionate-assets-case-delhi-court-to-sentence-ex-haryana-cm-om-prakash-chautala-tomorrow-3013207", "urlToImage": "https://c.ndtvimg.com/2022-05/4t8ec3d_om-prakash-chautala-_625x300_27_May_22.jpg", "publishedAt": "2022-05-26T18:39:02Z", "content": "Om Prakash Chautala urged the court to grant him minimum punishment, citing old age.\r\nNew Delhi: A Delhi court will pronounce its order Friday on the quantum of sentence to be awarded to former Harya… [+1668 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "IPS Officers \"Get Everything\" But Bengal Officers...: Mamata Banerjee", "description": "West Bengal Chief Minister Mamata Banerjee on Thursday said there is \"discrimination\" in the state between IPS and West Bengal Police Service (WBPS) officers and equality must be ensured between them.", "url": "https://www.ndtv.com/india-news/mamata-banerjee-ips-officers-get-everything-but-bengal-officers-mamata-banerjee-3012923", "urlToImage": "https://c.ndtvimg.com/2022-05/cfp8g48g_mamata-banerjee-pti_625x300_03_May_22.jpg", "publishedAt": "2022-05-26T18:33:59Z", "content": "Mamata Banerjee stressed on the need for having more women in the state police force.\r\nKolkata: West Bengal Chief Minister Mamata Banerjee on Thursday said there is \"discrimination\" in the state betw… [+1351 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Odisha School Sets Up Archive To Celebrate Alumni Contribution", "description": "The alumni association of Ravenshaw Collegiate School, Cuttack, has established a 'Revolutionary Archive' for sourcing and sharing information on some of the institute's illustrious former students, who contributed in the freedom movement.", "url": "https://www.ndtv.com/education/odisha-school-sets-up-archive-celebrate-contributions-of-alumni-in-freedom-movement", "urlToImage": "https://cache.careers360.mobi/media/presets/860X430/article_images/2022/5/26/shutterstock_460401409.jpg", "publishedAt": "2022-05-26T18:27:49Z", "content": "Bhubaneswar:Joining the country in observing 'Azadi ka Amrit Mahostav, on the occasion of the country's 75 years of Independence, the alumni association of Ravenshaw Collegiate School, Cuttack, has e… [+1932 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Import Of Paper To Be Brought Under Compulsory Registration From Oct 2022", "description": "The import policy of major paper products has been amended from 'free' to 'free subject to compulsory registration under Paper Import Monitoring System', the Union Ministry of Commerce & Industry said on Thursday.", "url": "https://www.ndtv.com/india-news/import-of-paper-to-be-brought-under-compulsory-registration-from-oct-2022-3013192", "urlToImage": "https://c.ndtvimg.com/2018-10/j8cr3qqo_newspaper-generic-pixabay_625x300_10_October_18.jpg", "publishedAt": "2022-05-26T18:25:38Z", "content": "All imports arriving on or after 1 October 2022 shall be governed by this policy, it said.\r\nNew Delhi: The import policy of major paper products has been amended from 'free' to 'free subject to compu… [+1929 chars]"}]}