{"status": "ok", "totalResults": 550, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "AAP Move To Keep Punjab Promise, 300 Units Free Power For Homes From July", "description": "The Bhagwant Mann-led AAP government in Punjab todayannounced 300 units of free power for households with effect from July 1.", "url": "https://www.ndtv.com/india-news/aaps-government-in-punjab-announces-300-units-of-free-power-for-households-from-july-1-2892363", "urlToImage": "https://c.ndtvimg.com/2022-03/nkbqu2us_bhagwant-mann_625x300_16_March_22.jpg", "publishedAt": "2022-04-16T02:01:02Z", "content": "The Chief Minister rolled out a doorstep ration delivery scheme in the state last month\r\nMohali: The AAM Aadmi Party (AAP) government in Punjab today announced 300 units of free power for households … [+745 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus Live: India Reports 949 New Covid Cases, 6 Deaths In 24 Hours", "description": "India on Friday recorded at least 949 new COVID-19 cases, bringing the total number of coronavirus infections to 4,30,39,974. The country also reported 6 Covid-related deaths in the last 24 hours, taking the total number fatalities to 5,21,742.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-16-april-2022-2892330", "urlToImage": "https://c.ndtvimg.com/2021-05/1at2vlig_india-covid-generic_625x300_09_May_21.jpg", "publishedAt": "2022-04-16T00:25:09Z", "content": "India COVID-19 Live: The number of active cases of COVID-19 currently stands at 11,191.\r\nNew Delhi: India on Friday recorded at least 949 new COVID-19 cases, bringing the total number of coronavirus … [+603 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine's PM, Finance Officials To Visit US Next Week Amid War", "description": "Ukrainian Prime Minister Denys Shmyhal and top Ukrainian finance officials will visit Washington next week during the spring meetings of the International Monetary Fund and World Bank, sources familiar with the plans said on Friday.", "url": "https://www.ndtv.com/world-news/ukraines-pm-finance-officials-to-visit-us-next-week-amid-war-against-russia-2892326", "urlToImage": "https://c.ndtvimg.com/2022-03/cc0apmgk_ukraine-war_625x300_24_March_22.jpg", "publishedAt": "2022-04-16T00:05:59Z", "content": "World Bank told this week that the bank was preparing a $1.5 billion support package for Ukraine.\r\nKyiv: Ukrainian Prime Minister Denys Shmyhal and top Ukrainian finance officials will visit Washingt… [+2880 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "More Than 150 Injured In Violence At Jerusalem Holy Site", "description": "More than 150 people were wounded Friday in clashes between Palestinian demonstrators and Israeli police in Jerusalem's Al-Aqsa mosque compound, the first face-off at the flashpoint holy site since the start of Ramadan.", "url": "https://www.ndtv.com/world-news/more-than-150-injured-in-violence-at-jerusalem-holy-site-al-maqsa-mosque-2892321", "urlToImage": "https://c.ndtvimg.com/2022-04/qnlmka0g_alaqsa-mosque-clash-jerusalem-israel-afp-650_625x300_15_April_22.jpg", "publishedAt": "2022-04-15T23:45:30Z", "content": "Around 400 people were arrested, the Palestinian Prisoner's Club said.\r\nJerusalem: More than 150 people were wounded Friday in clashes between Palestinian demonstrators and Israeli police in Jerusale… [+5054 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "BJP Fumes Over Its Bihar Ally Manjhi's Lord Ram \"Not God\" Remark", "description": "The BJP was on Friday up in arms against former Bihar Chief Minister Jitan Ram Manjhi, its ally in the state, for asserting that Lord Ram was a mythical character and \"not a god\".", "url": "https://www.ndtv.com/india-news/bjp-fumes-over-its-bihar-ally-jitan-ram-manjhis-lord-ram-not-god-remark-2892318", "urlToImage": "https://i.ndtvimg.com/i/2015-02/jitan-ram-manjhi-close_650x400_61423390202.jpg", "publishedAt": "2022-04-15T23:32:40Z", "content": "BJP came out with angry rebuttals, questioning Mr Manjhi's faith following his remark on lord Ram.\r\nPatna: The BJP was on Friday up in arms against former Bihar Chief Minister Jitan Ram Manjhi, its a… [+2561 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "With Ukraine In Mind, Thousands Join Pope For Good Friday Service In Rome", "description": "Thousands of faithful attended the \"Way of the Cross\" prayer service, presided over by Pope Francis at Rome's Colosseum on Friday, a ceremony overtaken by the war in Ukraine.", "url": "https://www.ndtv.com/world-news/with-ukraine-in-mind-thousands-join-pope-francis-for-good-friday-service-in-rome-2892313", "urlToImage": "https://c.ndtvimg.com/2022-04/r7dmc7o8_pope-in-rome-good-friday_625x300_16_April_22.jpg", "publishedAt": "2022-04-15T23:11:25Z", "content": "Most of those attending welcomed the Vatican's Russia-Ukraine initiative.\r\nRome: Thousands of faithful attended the \"Way of the Cross\" prayer service, presided over by Pope Francis at Rome's Colosseu… [+3491 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Says \"Deeply Concerned\" Over Violence At Jerusalem Mosque", "description": "The United States said Friday it was \"deeply concerned\" after more than 150 people were wounded in clashes between Palestinian demonstrators and Israeli police in Jerusalem's Al-Aqsa mosque compound.", "url": "https://www.ndtv.com/world-news/us-says-deeply-concerned-over-violence-at-jerusalem-al-aqsa-mosque-2892306", "urlToImage": "https://c.ndtvimg.com/2022-04/qnlmka0g_alaqsa-mosque-clash-jerusalem-israel-afp-650_625x300_15_April_22.jpg", "publishedAt": "2022-04-15T22:47:44Z", "content": "US urges Palestinian and Israeli officials to work cooperatively to lower tensions.\r\nWashington: The United States said Friday it was \"deeply concerned\" after more than 150 people were wounded in cla… [+1011 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UK's Harry, Meghan Make First Public Appearance In Europe Since Royal Exit", "description": "Britain's Prince Harry and his wife Meghan on Friday made their first joint public appearance on this side of the Atlantic since quitting royal life and moving to North America two years ago.", "url": "https://www.ndtv.com/world-news/prince-harry-wife-meghan-markle-make-first-public-appearance-in-europe-since-royal-exit-2892303", "urlToImage": "https://c.ndtvimg.com/2022-04/d7hobb1o_prince-harry-markel-in-europe_625x300_16_April_22.jpg", "publishedAt": "2022-04-15T22:37:11Z", "content": "The couple had not visited the UK together since their decision to step aside from the royal family.\r\nThe Hague, Netherlands: Britain's Prince Harry and his wife Meghan on Friday made their first joi… [+2652 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Germany To Provide Over 1 Billion Euros' Military Aid To Ukraine", "description": "The German government on Friday said it plans to release more than a billion euros in military aid for Ukraine, amid complaints by Kyiv it is not receiving heavy weapons from Berlin.", "url": "https://www.ndtv.com/world-news/germany-to-provide-over-1-billion-euros-military-aid-to-ukraine-2892302", "urlToImage": "https://c.ndtvimg.com/2022-03/k83gj7go_ukraine-war-afp_625x300_22_March_22.jpg", "publishedAt": "2022-04-15T22:22:11Z", "content": "The funds will feature in a supplementary budget for this year.\r\nBerlin: The German government on Friday said it plans to release more than a billion euros in military aid for Ukraine, amid complaint… [+2177 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Govt-Sponsored Producer\": Congress' Jab At The Kashmir Files Filmmaker", "description": "Following the announcement by The Kashmir Files' director Vivek Agnihotri of making his next film on the 1984 riots, Congress spokesperson Gourav Vallabh on Friday said that Mr Agnihotri is a government-sponsored producer who makes films over files.", "url": "https://www.ndtv.com/india-news/congress-asks-vivek-agnihotri-to-make-a-film-on-gujarat-files-2892299", "urlToImage": "https://c.ndtvimg.com/2018-09/fi5h5h98_vivek-agnihotri_625x300_10_September_18.jpg", "publishedAt": "2022-04-15T22:07:47Z", "content": "Mr Agnihotri on Saturday shared that he will soon start working on his next project 'The Delhi Files'.\r\nNew Delhi: Following the announcement by The Kashmir Files' director Vivek Agnihotri of making … [+2767 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Imran Khan Seeks Help From Overseas Pakistanis To Topple New Government", "description": "Ousted Prime Minister of Pakistan, Imran Khan on Friday appealed to the overseas Pakistanis to donate money to his Pakistan Tehreek-e-Insaf (PTI) party in order to topple the \"foreign-backed\" government of Shehbaz Sharif.", "url": "https://www.ndtv.com/world-news/imran-khan-seeks-donation-from-overseas-pakistanis-to-topple-new-government-2892292", "urlToImage": "https://c.ndtvimg.com/2022-04/57egtro8_imran-khan_650x400_10_April_22.jpg", "publishedAt": "2022-04-15T21:46:33Z", "content": "Khan said that it was the right of Pakistan's citizens to decide on who would rule their country.\r\nIslamabad: Ousted Prime Minister of Pakistan, Imran Khan on Friday appealed to the overseas Pakistan… [+2101 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Arrests Siberian Journalist Over Ukraine Report", "description": "A Russian court on Friday ordered the pre-trial detention of a Siberian news editor for alleging that 11 riot police members had refused to join Moscow's military campaign in Ukraine.", "url": "https://www.ndtv.com/world-news/russia-arrests-siberian-journalist-mikhail-afanasyev-over-ukraine-report-2892289", "urlToImage": "https://c.ndtvimg.com/2022-04/7fp0ibf_russia-ukraine-war_625x300_12_April_22.jpg", "publishedAt": "2022-04-15T21:27:38Z", "content": "If convicted, the journalist faces up to 10 years in prison, investigators said.\r\nMoscow: A Russian court on Friday ordered the pre-trial detention of a Siberian news editor for alleging that 11 riot… [+2556 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Claims It Destroyed Ukraine's Rocket Factory In Missile Strikes", "description": "Russia pounded a Ukrainian rocket factory after losing an iconic warship in the Black Sea, as the Pentagon on Friday backed Kyiv's claim to have sunk the Moskva with cruise missiles.", "url": "https://www.ndtv.com/world-news/russia-claims-it-destroyed-ukraines-rocket-factory-in-missile-strikes-near-kyiv-2892284", "urlToImage": "https://c.ndtvimg.com/2022-03/bec609dg_ukraine-war_625x300_29_March_22.jpg", "publishedAt": "2022-04-15T21:12:45Z", "content": "Russia said it had used sea-based long-range missiles to hit the factory. (Representational)\r\nKyiv: Russia pounded a Ukrainian rocket factory after losing an iconic warship in the Black Sea, as the P… [+5157 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Putin Ally Beaten Up After Arrest In Ukraine, His Wife Claims", "description": "The wife of one of Russian President Vladimir Putin's top allies in Ukraine said on Friday that he has been beaten by the Ukrainian security service while being interrogated in detention.", "url": "https://www.ndtv.com/world-news/putin-ally-viktor-medvedchuk-arrested-in-ukraine-beaten-up-by-kyiv-authorities-his-wife-claims-2892279", "urlToImage": "https://c.ndtvimg.com/2022-04/leavum6_putin-ally-arrested-in-ukraine-beaten-up-by-kyiv-authorities_625x300_16_April_22.jpg", "publishedAt": "2022-04-15T20:48:50Z", "content": "Medvedchuk's wife claimed that her husband was beaten up during interrogation by Ukrainian authorities.\r\nMoscow: The wife of one of Russian President Vladimir Putin's top allies in Ukraine said on Fr… [+2612 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russians Pay Tribute To Its Powerful Warship After Sinking In Black Sea", "description": "Dozens of people gathered in the Crimean city of Sevastopol on Friday to mourn the sinking of the flagship of Russia's Black Sea Fleet, a symbol, the crowd heard, of hope, revival and power until its demise.", "url": "https://www.ndtv.com/world-news/russians-pay-tribute-to-its-powerful-warship-moskva-after-sinking-in-black-sea-2892255", "urlToImage": "https://c.ndtvimg.com/2022-04/g2utmnsk_russian-warship-in-black-sea_625x300_14_April_22.jpg", "publishedAt": "2022-04-15T20:16:13Z", "content": "Ukraine said one of its missiles had caused it to sink.\r\nMoscow: Dozens of people gathered in the Crimean city of Sevastopol on Friday to mourn the sinking of the flagship of Russia's Black Sea Fleet… [+1499 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Warns US, Allies Against Providing Weapons To Ukraine: Reports", "description": "Russia has warned the United States that there will be \"unpredictable consequences\" if Washington keeps arming Ukraine, The Washington Post reported on Friday.", "url": "https://www.ndtv.com/world-news/russia-warns-us-against-providing-weapons-to-ukraine-reports-2892251", "urlToImage": "https://c.ndtvimg.com/2022-02/o8v2unj4_ukraine-army_625x300_24_February_22.jpg", "publishedAt": "2022-04-15T19:59:39Z", "content": "Moscow warned that the move will be \"unpredictable consequences.\" (File)\r\nMoscow: Russia has warned the United States that there will be \"unpredictable consequences\" if Washington keeps arming Ukrain… [+635 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "North Korea Celebrates Founding Father's Birthday", "description": "North Korea celebrated the birthday of its founding leader on Friday, state media reported, but mystery surrounded when a military parade -- at which the regime may unveil new weapons -- might happen.", "url": "https://www.ndtv.com/world-news/north-korea-celebrates-founding-leader-kim-il-sung-birthday-2892246", "urlToImage": "https://c.ndtvimg.com/2020-04/16vkfo3g_kim-il-sung-birth-anniversary-afp_625x300_15_April_20.jpg", "publishedAt": "2022-04-15T19:45:17Z", "content": "April 15 birthday of the late Kim Il Sung is one of the most important dates in Pyongyang. (File)\r\nSeol: North Korea celebrated the birthday of its founding leader on Friday, state media reported, bu… [+3176 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Riots In Sweden After Anti-Islam Activities, 9 Police Officers Injured", "description": "Counter-protesters demonstrating against a far-right group's intention to burn a Koran in Orebro in central Sweden clashed with police on Friday, leaving four police officers injured, authorities said.", "url": "https://www.ndtv.com/world-news/riots-in-swedens-orebro-after-anti-islam-activities-4-policemen-injured-2892239", "urlToImage": "https://c.ndtvimg.com/2022-04/fu1c1md_sweden-riots_625x300_16_April_22.jpg", "publishedAt": "2022-04-15T19:27:44Z", "content": "Police sad 3 police officers had to be taken to hospital after a riot broke out in the city.\r\nStockholm: Counter-protesters demonstrating against a far-right group's intention to burn a Koran in Oreb… [+1787 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "More Than 5 Million People Flee War In Ukraine: UN", "description": "More than five million people have fled Ukraine since the Russian invasion, UN figures showed on Friday, in Europe's fastest-growing refugee crisis since World War II.", "url": "https://www.ndtv.com/world-news/more-than-5-million-people-flee-war-in-ukraine-un-2892224", "urlToImage": "https://c.ndtvimg.com/2022-03/57h64q2_ukraine-refugees-reuters-650_625x300_09_March_22.jpg", "publishedAt": "2022-04-15T19:05:59Z", "content": "Nearly 6 out of 10 Ukrainian refugees have crossed into Poland, according to the UN.\r\nGeneva: More than five million people have fled Ukraine since the Russian invasion, UN figures showed on Friday, … [+3760 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Nemanja Matic To Quit Manchester United At End Of Season", "description": "Veteran Serbian midfielder Nemanja Matic announced on Friday that he will end his five-year stay at Manchester United at the end of the season", "url": "https://sports.ndtv.com/football/veteran-midfielder-nemanja-matic-to-quit-manchester-united-at-end-of-season-2892196", "urlToImage": "https://c.ndtvimg.com/2022-04/psbs83ho_nemanja-matic-afp_625x300_16_April_22.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-04-15T18:32:22Z", "content": "Veteran Serbian midfielder Nemanja Matic announced on Friday that he will end his five-year stay at Manchester United at the end of the season. The 33-year-old, who was signed by Jose Mourinho from C… [+802 chars]"}]}