{"status": "ok", "totalResults": 270, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Punjab Chief Minister Calls Farmers Protest \"Unwarranted\"", "description": "Punjab Chief Minister Bhagwant Mann on Tuesday called the agitation by state farmers as unwarranted and undesirable but said he is ready for talks.", "url": "https://www.ndtv.com/india-news/punjab-chief-minister-bhagwant-mann-calls-farmers-protest-unwarranted-2985500", "urlToImage": "https://c.ndtvimg.com/2022-04/57fcqk3_bhagwant-mann_625x300_16_April_22.jpg", "publishedAt": "2022-05-17T23:44:42Z", "content": "Punjab CM Bhawant Mann said the government held talks with farmers on Tuesday. (File)\r\nChandigarh: Punjab Chief Minister Bhagwant Mann on Tuesday called the agitation by state farmers as unwarranted … [+1855 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Court To Hear Activist Sharjeel Imam's Bail Plea On May 26", "description": "The Delhi High Court said it will hear on May 26 a plea by JNU student Sharjeel Imam, who has been arrested in a case related to alleged inflammatory speeches made by him during the protests against the CAA and NRC, seeking interim bail.", "url": "https://www.ndtv.com/india-news/court-to-hear-activist-sharjeel-imams-bail-plea-on-may-26-2985493", "urlToImage": "https://c.ndtvimg.com/2020-01/hpteji0g_sharjeel-imam_625x300_28_January_20.jpg", "publishedAt": "2022-05-17T23:31:05Z", "content": "JNU student Sharjeel Imam has filed an application seeking interim bail in his already pending bail plea.\r\nNew Delhi: The Delhi High Court on Tuesday said it will hear on May 26 a plea by JNU student… [+5374 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Pollution Killed 9 Million People Globally In 2019: Report", "description": "Pollution caused some 9 million people to die prematurely in 2019, according to a new global report published Wednesday, with experts raising alarm over increasing deaths from breathing outside air and the \"horrifying\" toll of lead poisoning.", "url": "https://www.ndtv.com/world-news/pollution-killed-9-million-people-globally-in-2019-report-2985488", "urlToImage": "https://c.ndtvimg.com/2018-11/53o5jkj8_air-pollution-generic-pixabay-650_625x300_28_November_18.jpg", "publishedAt": "2022-05-17T23:18:08Z", "content": "Global Pollution Death Report: Low- and middle-income countries are by far the most affected region.\r\nParis: Pollution caused some 9 million people to die prematurely in 2019, according to a new glob… [+4817 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Immature\": Kim Jong Un Slams Officials As Outbreak Surges In North Korea", "description": "North Korean leader Kim Jong Un slammed his country's response to its first officially confirmed COVID-19 outbreak as \"immature,\" accusing government officials of inadequacies and inertia as fever cases swept the country, state media reported on Wedn", "url": "https://www.ndtv.com/world-news/immature-kim-jong-un-slams-officials-as-covid-19-outbreak-surges-in-north-korea-2985479", "urlToImage": "https://c.ndtvimg.com/2022-05/qk4qiqe_north-korea-covid_625x300_13_May_22.jpg", "publishedAt": "2022-05-17T22:53:41Z", "content": "North Korea Covid: Kim Jong Un said \"immaturity\" has increased the complexity in order to curb COVID-19.\r\nSeoul: North Korean leader Kim Jong Un slammed his country's response to its first officially… [+1373 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Pentagon Finds No Wrongdoing In 2019 Syria Strike That Killed Civilians", "description": "An investigation into a 2019 strike by US forces in Syria that killed numerous civilians found no violations of policy or wanton negligence, the Pentagon said Tuesday.", "url": "https://www.ndtv.com/world-news/pentagon-finds-no-wrongdoing-in-2019-syria-strike-that-killed-civilians-2985476", "urlToImage": "https://c.ndtvimg.com/2019-02/tuk8h3ig_usarmysyriareuters650_625x300_22_February_19.jpg", "publishedAt": "2022-05-17T22:32:43Z", "content": "The Times report said that 70 people had been killed in the US strike in Syria in March 2019.\r\nWashington: An investigation into a 2019 strike by US forces in Syria that killed numerous civilians fou… [+2359 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Tata Motors In Court Against Disqualification From Mumbai E-Buses Tender", "description": "Tata Motors on Tuesday moved the Bombay High Court challenging its disqualification from the tender process for 1,400 electric buses for the Brihanmumbai Electric Supply and Transport (BEST) Undertaking.", "url": "https://www.ndtv.com/india-news/tata-motors-in-court-against-disqualification-from-mumbai-e-buses-tender-2985465", "urlToImage": "https://c.ndtvimg.com/2021-04/b2jsh8t_tata-motors-650_650x400_20_April_21.jpg", "publishedAt": "2022-05-17T22:06:52Z", "content": "The high court will hear the Tata Motors' case further on May 23.\r\nMumbai: Tata Motors on Tuesday moved the Bombay High Court challenging its disqualification from the tender process for 1,400 electr… [+1306 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UP Loot Accused Surrenders With \"Don't-Shoot-Me\" Placard: Cops", "description": "With a \"don't shoot me\" placard hung around his neck, an alleged robber surrendered to police here on Tuesday in the district, an official said.", "url": "https://www.ndtv.com/india-news/up-loot-accused-surrenders-with-dont-shoot-me-placard-cops-2985463", "urlToImage": "https://c.ndtvimg.com/gvui22eg_paschim-bengal_625x300_28_July_18.jpg", "publishedAt": "2022-05-17T21:58:01Z", "content": "A sum of Rs 25,000 of the looted amount too was recovered from Fukran, police said. (Representational)\r\nBudaun, UP: With a \"don't shoot me\" placard hung around his neck, an alleged robber surrendered… [+858 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sweden, Finland To Submit NATO Membership Bid Today", "description": "Finland and Sweden announced they will submit their bids to join NATO together Wednesday, despite Turkey's threat to block the military alliance's expansion.", "url": "https://www.ndtv.com/world-news/sweden-finland-to-submit-nato-membership-bid-today-2985457", "urlToImage": "https://c.ndtvimg.com/2022-01/ohk1stfg_nato-reuters_625x300_24_January_22.jpg", "publishedAt": "2022-05-17T21:42:18Z", "content": "Any membership bid must be unanimously approved by NATO's 30 members.\r\nStockholm: Finland and Sweden announced they will submit their bids to join NATO together Wednesday, despite Turkey's threat to … [+4488 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Hope Supreme Court Will Do Justice: Asaduddin Owaisi On Gyanvapi Case", "description": "AIMIM president Asaduddin Owaisi on Tuesday said he is hopeful that the Supreme Court will stay the order of the lower court on the Gyanvapi issue during the next hearing and do \"complete justice\".", "url": "https://www.ndtv.com/india-news/hope-supreme-court-will-do-justice-asaduddin-owaisi-on-gyanvapi-case-2985449", "urlToImage": "https://c.ndtvimg.com/2019-11/2b9b20cg_asaduddin-owaisi-pti-_625x300_10_November_19.jpg", "publishedAt": "2022-05-17T21:17:28Z", "content": "Gyanvapi mosque: Asaduddin Owaisi said \"grave procedural unfairness happened\" in Gyanvapi verdict.\r\nHyderabad: AIMIM president Asaduddin Owaisi on Tuesday said he is hopeful that the Supreme Court wi… [+1097 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Canada Introduces Bill To Ban Putin, Officials From Entering Country", "description": "Canada introduced a bill in the Senate that will ban Russian President Vladimir Putin and some 1,000 other members of his government and military from entering the country as it continues to ratchet up sanctions after the invasion of Ukraine.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-canada-introduces-bill-to-ban-vladimir-putin-officials-from-entering-country-over-ukraine-2985441", "urlToImage": "https://c.ndtvimg.com/2022-05/g3imj89s_putin-afp_625x300_10_May_22.jpg", "publishedAt": "2022-05-17T20:50:28Z", "content": "Canadian PM Justin Trudeau had earlier said that Putin is responsible for \"war crimes\" in Ukraine.\r\nOttawa: Canada on Tuesday introduced a bill in the Senate that will ban Russian President Vladimir … [+569 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"We Need A New Charlie Chaplin To Prove...\": Ukraine's Zelensky At Cannes", "description": "Ukraine's President Volodymyr Zelensky made a surprise video address at the opening ceremony of the Cannes Film Festival on Tuesday.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-ukraine-president-volodymyr-zelensky-addresses-cannes-film-festival-amid-war-with-russia-2985434", "urlToImage": "https://c.ndtvimg.com/2022-04/o6tn4et4_ukrainian-president-volodymyr-zelensky_625x300_02_April_22.jpg", "publishedAt": "2022-05-17T20:33:54Z", "content": "\"Will cinema keep quiet, or will it speak up?\", Zelensky said at Cannes Film Festival on Tuesday.\r\nCannes, France: Ukraine's President Volodymyr Zelensky made a surprise video address at the opening … [+1968 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Hundreds Of Ukrainian Troops Surrender In Mariupol Steel Plant: Russia", "description": "Russia said Tuesday that 265 Ukrainian soldiers had surrendered after staging a last stand at the besieged Azovstal steelworks in Mariupol, prompting Kyiv to call for a prisoner exchange.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-hundreds-of-ukrainian-troops-surrender-in-mariupol-steel-plant-russia-2985400", "urlToImage": "https://c.ndtvimg.com/2022-04/idav4s8_azovstal-plant-mariupolreuters_625x300_15_April_22.jpg", "publishedAt": "2022-05-17T19:51:25Z", "content": "Ukraine war: Moscow claimed control of strategic port city Mariupol last month after a weeks-long siege.\r\nKyiv: Russia said Tuesday that 265 Ukrainian soldiers had surrendered after staging a last st… [+6499 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russians Line Up For Final Big Mac Burger Ahead Of McDonald's Exit", "description": "Russians lined up in a Moscow train station on Tuesday for what may be their last Big Mac from one of the few McDonald's restaurants still open in the country.", "url": "https://www.ndtv.com/world-news/russians-line-up-for-final-big-mac-burger-ahead-of-mcdonalds-exit-2985351", "urlToImage": "https://c.ndtvimg.com/2022-05/d5oo9b8_mcdonalds-generic-650_625x300_16_May_22.jpg", "publishedAt": "2022-05-17T18:54:34Z", "content": "The world's largest burger chain is rolling down the shutters in Russia after more than 30 years.\r\nMoscow:  Russians lined up in a Moscow train station on Tuesday for what may be their last Big Mac f… [+3411 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rats Attack 30-Year-Old Paralysed Woman's Eyelids In Rajasthan Hospital", "description": "Rats gnawed eyelids of paralysed 30-year-old Roopwati who is undergoing treatment at the Stroke Unit of Kota's MB Hospital for the last 45 days. The hospital authority set up a three-member panel of doctors to probe into the incident.", "url": "https://www.ndtv.com/cities/rats-attack-paralysed-womans-eyelids-in-rajasthan-hospital-2985321", "urlToImage": "https://c.ndtvimg.com/2019-08/sj8nqggg_rats-generic-mice-generic_625x300_08_August_19.jpg", "publishedAt": "2022-05-17T18:28:41Z", "content": "The woman's husband said she was taken off the ventilator two days ago. (Representational)\r\nKota, Rajasthan: Rats gnawed at an eyelid of a paralysed woman undergoing treatment in an ICU of a governme… [+2390 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Shooter Planned Attack For Months, Visited Site 3 Times", "description": "The white teen accused of murdering 10 Black people at a New York grocery store planned the shooting for months -- and scoped out the location ahead of time, social media posts attributed to the suspect show.", "url": "https://www.ndtv.com/world-news/us-shooter-planned-attack-for-months-visited-site-3-times-2985315", "urlToImage": "https://c.ndtvimg.com/2022-05/2jc3rsa_us-shooting_625x300_16_May_22.jpg", "publishedAt": "2022-05-17T18:26:20Z", "content": "Payton Gendron, 18, visited the Tops Friendly Market in Buffalo three times on March 8\r\nBuffalo: The white teen accused of murdering 10 Black people at a New York grocery store planned the shooting f… [+1939 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "On Rajiv Gandhi Assassination Convict's Release Plea, Final Call Today", "description": "The Supreme Court of India will pass orders today on a plea seeking the release of AG Perarivalan, one of the life convicts in the Rajiv Gandhi assassination case, who has been behind bars for 31 years.", "url": "https://www.ndtv.com/india-news/on-rajiv-gandhi-assassination-convicts-release-plea-final-call-today-2985308", "urlToImage": "https://c.ndtvimg.com/2021-05/s3efmuoo_rajiv-gandhi_625x300_21_May_21.jpg", "publishedAt": "2022-05-17T18:24:52Z", "content": "Former Prime Minister Rajiv Gandhi was assassinated on May 21, 1991 at Tamil Nadu's Sriperumbudur.\r\nChennai: The Supreme Court of India will pass orders today on a plea seeking the release of AG Pera… [+3097 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "IPL 2022: SRH Keep Slim Playoff Hopes Alive With 3-Run Win vs MI", "description": "IPL 2022: A three-wicket haul by Umran Malik helped SRH defeat MI by three runs at the Wankhede Stadium in Mumbai on Tuesday.", "url": "https://sports.ndtv.com/ipl-2022/ipl-2022-srh-keep-slim-playoff-hopes-alive-with-3-run-win-vs-mi-2985305", "urlToImage": "https://c.ndtvimg.com/2022-05/tjdn59l_umran-malik-bcci-ipl_625x300_17_May_22.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-17T18:22:28Z", "content": "Rahul Tripathi batted like a man on a mission before Umran Malik sizzled with his pace as Sunrisers Hyderabad kept their slim IPL playoff hopes alive with a three-run win over Mumbai Indians on Tuesd… [+3632 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Asian News International", "title": "Should Play With True Spirit: Dahiya On Satender Assaulting Referee", "description": "Ravi Dahiya got selected for Commonwealth Games 2022 in the 57 kg weight category and is eyeing a gold medal at the quadrennial event.", "url": "https://sports.ndtv.com/cricket/everyone-should-play-with-true-spirit-wrestler-ravi-dahiya-on-satender-assaulting-referee-during-cwg-trials-2985296", "urlToImage": "https://c.ndtvimg.com/2021-08/55sskca8_ravi-dahiya_625x300_05_August_21.jpg", "publishedAt": "2022-05-17T18:17:13Z", "content": "Indian Olympic silver medallist wrestler Ravi Dahiya was busy playing his own bout when wrestler Satender Malik assaulted referee Jagbir Singh in the KD Jadhav Hall in New Delhi at the IGI stadium. T… [+1446 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Biden Attacks White Supremacist 'Poison' After Racist Shooting", "description": "President Joe Biden on Tuesday called out what he branded the \"poison\" of white supremacist ideology behind a deadly mass shooting in Buffalo, New York, and said that racism is being stoked for political gain.", "url": "https://www.ndtv.com/world-news/us-president-joe-biden-attacks-white-supremacist-poison-after-racist-shooting-2985293", "urlToImage": "https://c.ndtvimg.com/2022-05/2jc3rsa_us-shooting_625x300_16_May_22.jpg", "publishedAt": "2022-05-17T18:15:52Z", "content": "Biden said: \"What happened here is simple and straightforward terrorism. Domestic terrorism\"\r\nBuffalo: President Joe Biden on Tuesday called out what he branded the \"poison\" of white supremacist ideo… [+3689 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "North Delhi Civic Body Suspends Three For Laxity In Duty After Delhi Fire", "description": "The North Delhi Municipal Corporation suspended 3 officials for laxity in duty after the massive fire in Delhi's Mundka. The road on which the building was situated was of neither commercial nor mixed land use category.", "url": "https://www.ndtv.com/delhi-news/delhi-mundka-fire-north-delhi-civic-body-suspends-three-officers-for-laxity-in-duty-after-delhi-fire-2985272", "urlToImage": "https://c.ndtvimg.com/2022-05/po8ge1fk_delhi-mundka-fire_625x300_14_May_22.jpg", "publishedAt": "2022-05-17T18:09:47Z", "content": "North Delhi Civic Body said the building was used for industrial purposes which is not allowed.\r\nNew Delhi: The North Delhi Municipal Corporation today suspended three officials in the Narenla Zone f… [+3533 chars]"}]}