{"status": "ok", "totalResults": 569, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "'Need Talented People': Boris Johnson Signals Visa Flexibility With India", "description": "British Prime Minister Boris Johnson indicated he was ready to offer more visas to India in return for this year clinching a free-trade deal that could boost annual bilateral trade by billions of pounds.", "url": "https://www.ndtv.com/india-news/boris-johnson-signals-visa-flexibility-with-india-need-talented-people-2905806", "urlToImage": "https://c.ndtvimg.com/2022-04/8u5imoe8_london-generic_650x400_21_April_22.jpg", "publishedAt": "2022-04-21T02:08:32Z", "content": "Boris Johnson signalled he was ready to be more accommodating on an issue that could have stalled talks.\r\nAhmedabad: British Prime Minister Boris Johnson indicated he was ready to offer more visas to… [+1755 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Sorry, Promise To Be Extremely Mindful\": Akshay Kumar On Gutka Ad", "description": "Actor Akshay Kumar has apologised to fans and well-wishers after people on social media trolled him for appearing in an ad for Vimal Elaichi.", "url": "https://www.ndtv.com/india-news/vimal-elaichi-sorry-promise-to-be-extremely-mindful-akshay-kumar-on-gutkha-ad-2905793", "urlToImage": "https://c.ndtvimg.com/2022-04/giqjnkl8_akshay-kumar_625x300_21_April_22.jpg", "publishedAt": "2022-04-21T01:51:59Z", "content": "Akshay Kumar, Shah Rukh Khan and Ajay Devgn share screen space in the Vimal Elaichi ad.\r\nNew Delhi: Actor Akshay Kumar has apologised to fans and well-wishers after people on social media trolled him… [+1576 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "We Will Not Challenge Julian Assange Extradition: Australia", "description": "Australia will not challenge Wikileaks founder Julian Assange's extradition to the United States and has confidence in the British judicial system, a senior government minister said Thursday.", "url": "https://www.ndtv.com/world-news/australia-says-will-not-challenge-julian-assange-extradition-2905792", "urlToImage": "https://c.ndtvimg.com/2022-02/angj81s8_julian-assange_625x300_10_February_22.jpg", "publishedAt": "2022-04-21T01:49:33Z", "content": "Julian Assange, if convicted, could face up to 175 years in prison.\r\nSydney, Australia: Australia will not challenge Wikileaks founder Julian Assange's extradition to the United States and has confid… [+1860 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Jignesh Mevani, Dalit Leader And Gujarat MLA, Arrested By Assam Police", "description": "Gujarat MLA Jignesh Mevani, who had extended support to the Congress in September 2021, was arrested by Assam Police from a Circuit House in Gujarat's Palanpur late last night. He was taken to Ahmedabad last night and shall be taken to Assam today", "url": "https://www.ndtv.com/india-news/gujarat-mla-jignesh-mevani-arrested-by-assam-police-to-be-taken-to-guwahati-2905791", "urlToImage": "https://c.ndtvimg.com/2022-04/rjlmlst8_gujarat-mla-jignesh-mevani-arrested_625x300_21_April_22.jpg", "publishedAt": "2022-04-21T01:47:34Z", "content": "Gujarat MLA Jignesh Mevani was arrested by Assam Police from a Circuit House in Palanpur last night.\r\nAhmedabad: Gujarat MLA Jignesh Mevani, who had extended support to the Congress in September 2021… [+1170 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "IMF Says India's High Growth Rate Positive For World", "description": "A high growth rate for India, as projected in the latest World Economic Outlook, is not only healthy for the country but also positive news for the world, Managing Director of the International Monetary Fund Kristalina Georgieva has said.", "url": "https://www.ndtv.com/india-news/imf-says-indias-high-growth-rate-positive-for-world-2905783", "urlToImage": "https://i.ndtvimg.com/i/2015-07/imf_650x400_41438297537.jpg", "publishedAt": "2022-04-21T01:27:15Z", "content": "IMF believes that India is one of the economies that are growing at a high rate.\r\nNew Delhi: A high growth rate for India, as projected in the latest World Economic Outlook, is not only healthy for t… [+1866 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "This Country Plans Law For Chemical Castration Of Paedophile Rapists", "description": "Peru's government will present a bill to allow for chemical castration as a penalty for raping a minor, Cabinet members told reporters on Wednesday, following national outrage over the rape of a 3-year-old girl.", "url": "https://www.ndtv.com/world-news/peru-plans-law-for-chemical-castration-of-paedophile-rapists-2905776", "urlToImage": "https://c.ndtvimg.com/2022-02/8v8pgitg_peruvian-president-pedro-castillo_625x300_05_February_22.jpg", "publishedAt": "2022-04-21T01:18:29Z", "content": "Peruvian President Pedro Castillo has been supportive of the bill.\r\nPeru's government will present a bill to allow for chemical castration as a penalty for raping a minor, Cabinet members told report… [+1869 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Bengal Means Blood\": BJP Leader Counters Business Summit's Theme", "description": "BJP leader Suvendu Adhikari on Wednesday equated West Bengal with \"blood\", referring to the incidents of post-poll violence in the state, and said that it is not a Bengal for business, as the Bengal global business summit intends to showcase.", "url": "https://www.ndtv.com/india-news/bengal-means-blood-bjp-leader-suvendu-adhikari-slams-west-bengal-chief-minister-mamata-banerjee-over-business-summit-2905775", "urlToImage": "https://c.ndtvimg.com/2021-05/7m97k4e8_suvendu-adhikari-facebook_625x300_20_May_21.jpg", "publishedAt": "2022-04-21T01:17:56Z", "content": "Slamming CM Mamata Banerjee, BJP leader said that \"syndicate raj\" prevails in the West Bengal. (File)\r\nBirbhum, West Bengal:  BJP leader Suvendu Adhikari on Wednesday equated West Bengal with \"blood\"… [+2092 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE: India Logs Over 2,000 New Covid Cases In 24 Hours", "description": "India on Wednesday recorded at least 2,067 new Covid cases - a 65 per cent jump from yesterday. According to the Union Ministry of Health and Family Welfare, the country's active caseload stood at 12,340.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-april-21-2905752", "urlToImage": "https://c.ndtvimg.com/2021-04/skl9a748_covid-india_625x300_30_April_21.jpg", "publishedAt": "2022-04-21T00:25:28Z", "content": "India COVID-19 Live: 1,547 Covid patients recovered from the disease in the last 24 hours.\r\nNew Delhi: India on Wednesday recorded at least 2,067 new Covid cases - a 65 per cent jump from yesterday. … [+662 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Britain's Queen Elizabeth Gets Her Own Barbie Doll For Platinum Jubilee", "description": "Britain's Queen Elizabeth is being honoured with a Barbie doll in her likeness to mark her Platinum Jubilee this year.", "url": "https://www.ndtv.com/world-news/britains-queen-elizabeth-gets-her-own-barbie-doll-for-platinum-jubilee-2905739", "urlToImage": "https://c.ndtvimg.com/2022-02/2c39iaf8_queen-elizabeth-ii-reuters_625x300_06_February_22.jpg", "publishedAt": "2022-04-21T00:02:35Z", "content": "Britain's Queen Elizabeth is the longest-ruling monarch in British history.\r\nLondon: Britain's Queen Elizabeth is being honoured with a Barbie doll in her likeness to mark her Platinum Jubilee this y… [+725 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Putin Ally Predicts Ukraine's Mariupol Victory Today", "description": "Russian forces said they will seize the Mariupol steel plant that is the last main stronghold of resistance in the besieged city on Thursday after Ukraine proposed talks on evacuating troops and civilians there.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-putin-ally-predicts-ukraines-mariupol-victory-today-2905724", "urlToImage": "https://i.ndtvimg.com/i/2015-02/mariupol-town-ukraine_650x400_61424954519.jpg", "publishedAt": "2022-04-20T23:44:35Z", "content": "Mariupol would be the biggest city to be seized by Russia since invading Ukraine eight weeks ago.\r\nKyiv: Russian forces said they will seize the Mariupol steel plant that is the last main stronghold … [+5469 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Police Order US Capitol Evacuation Over Aircraft Threat, Then Say \"All Clear\"", "description": "Police at the United States Capitol ordered the complex be evacuated Wednesday, saying it was \"tracking an aircraft that poses a probable threat.\"", "url": "https://www.ndtv.com/world-news/police-order-us-capitol-evacuation-over-aircraft-threat-then-say-all-clear-2905715", "urlToImage": "https://i.ndtvimg.com/i/2018-01/us-capitol-afp_650x400_71516663503.jpg", "publishedAt": "2022-04-20T23:24:07Z", "content": "US Capitol: Police said there is \"no threat at the Capitol,\" and issued an all-clear after evacuation.\r\nWashington: Police at the United States Capitol ordered the complex be evacuated Wednesday, say… [+832 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "French Election: Emmanuel Macron Attacks His Rival Le Pen Over \"Russia Links\"", "description": "French President Emmanuel Macron attacked his far-right rival Marine Le Pen for her links to Russia during a televised presidential debate on Wednesday, accusing her of being \"dependent\" on the Kremlin.", "url": "https://www.ndtv.com/world-news/french-election-emmanuel-macron-attacks-his-rival-le-pen-over-russia-links-2905698", "urlToImage": "https://c.ndtvimg.com/2022-04/9i8mh2ps_macron-vs-le-pen-reuters_625x300_11_April_22.jpg", "publishedAt": "2022-04-20T22:58:27Z", "content": "\"You are dependent on the Russian government,\" Macron attacked Le Pen in a heated debate.\r\nParis: French President Emmanuel Macron attacked his far-right rival Marine Le Pen for her links to Russia d… [+1548 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Shanghai Cautiously Eases Lockdown As Covid Deaths Rise", "description": "Shanghai further eased its weeks-long Covid-19 lockdown on Wednesday despite mounting deaths and tens of thousands of new cases -- but some residents are furious that uneven enforcement is still leaving them trapped at home.", "url": "https://www.ndtv.com/world-news/shanghai-cautiously-eases-lockdown-as-covid-deaths-rise-2905695", "urlToImage": "https://c.ndtvimg.com/2022-01/p1u1g2fg_china-covid-shanghai-covid-reuters-650_625x300_11_January_22.jpg", "publishedAt": "2022-04-20T22:33:49Z", "content": "Shanghai has confirmed just 17 official Covid deaths in its current outbreak.\r\nShanghai: Shanghai further eased its weeks-long Covid-19 lockdown on Wednesday despite mounting deaths and tens of thous… [+4309 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Negotiating With Putin Like Dealing With Crocodile: UK PM Boris Johnson", "description": "British Prime Minister Boris compared negotiating with Russian President Vladimir Putin to dealing with a crocodile as he warned Ukraine it will be hard to negotiate a peace deal with a leader who is so unreliable.", "url": "https://www.ndtv.com/world-news/negotiating-with-putin-like-dealing-with-crocodile-uk-pm-boris-johnson-2905692", "urlToImage": "https://c.ndtvimg.com/2022-03/8246og6s_boris-johnson-afp_625x300_04_March_22.jpg", "publishedAt": "2022-04-20T22:20:28Z", "content": "UK PM said Putin has made it clear that he wants to take more Ukrainian territory.\r\nLondon: British Prime Minister Boris compared negotiating with Russian President Vladimir Putin to dealing with a c… [+667 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russian Military \"Advisor\" In Mali Killed By Road Bomb", "description": "A Russian national operating alongside Malian soldiers was killed by a roadside bomb in the centre of the conflict-torn Sahel state, an army document and officials said on Wednesday.", "url": "https://www.ndtv.com/world-news/russian-military-advisor-in-mali-killed-by-road-bomb-2905687", "urlToImage": "https://i.ndtvimg.com/i/2015-11/mali-attack-afp_650x400_61448023471.jpg", "publishedAt": "2022-04-20T22:10:12Z", "content": "The Russian died after being airlifted to the central town of Sevare, the army said. (Representational)\r\nDakar, Senegal: A Russian national operating alongside Malian soldiers was killed by a roadsid… [+2728 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UK PM Boris Johnson Heads To India For Hard Sell On Anti-Russia Action", "description": "UK Prime Minister Boris Johnson headed to India Wednesday touting job-creating investment but facing long odds to get his reluctant counterpart Narendra Modi to back Western action against Russia.", "url": "https://www.ndtv.com/world-news/uk-pm-boris-johnson-heads-to-india-for-hard-sell-on-anti-russia-action-2905685", "urlToImage": "https://c.ndtvimg.com/2021-08/hub64dag_boris-johnson_625x300_20_August_21.jpg", "publishedAt": "2022-04-20T21:58:07Z", "content": "The visit will deepen the strategic trade and defence ties between India and UK, said Boris Johnson.\r\nLondon: UK Prime Minister Boris Johnson headed to India Wednesday touting job-creating investment… [+3234 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Class 3 Student Dies After His Head Hits Pole While Peeping Out Of Bus", "description": "A 10-year-old Class 3 student died on Wednesday after his head allegedly hit an electricity pole while peeping out of a window of his school bus, police said.", "url": "https://www.ndtv.com/india-news/student-10-dies-after-his-head-hits-pole-while-peeping-out-of-bus-in-up-2905680", "urlToImage": "https://c.ndtvimg.com/2019-04/vdlveboo_school-bus_625x300_13_April_19.jpg", "publishedAt": "2022-04-20T21:47:46Z", "content": "The Uttar Pradesh chief minister's office has asked for a report about the incident. (Representational)\r\nGhaziabad: A 10-year-old Class 3 student died on Wednesday after his head allegedly hit an ele… [+1477 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine Offers Talks With Russia \"Without Any Conditions\" In Mariupol", "description": "Ukraine on Wednesday proposed to hold a \"special round\" of negotiations with Russia in the besieged city of Mariupol, a top Kyiv official said.", "url": "https://www.ndtv.com/world-news/ukraine-ready-to-hold-special-talks-with-russia-in-mariupol-2905670", "urlToImage": "https://c.ndtvimg.com/2022-03/m62t0bo4_mariupol-ukraine-reuters_625x300_21_March_22.jpg", "publishedAt": "2022-04-20T21:20:44Z", "content": "There was no immediate reaction from Moscow to the proposal by Ukraine.\r\nKyiv: Ukraine on Wednesday proposed to hold a \"special round\" of negotiations with Russia in the besieged city of Mariupol, a … [+2058 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rocket Fired From Gaza Into Israel Amid Tensions In Jerusalem", "description": "Palestinian militants in Gaza fired a rocket into Israel on Wednesday, the army said, as tensions soared with police in Jerusalem blocking Jewish ultra-nationalist protesters from approaching the Old City's Muslim quarter.", "url": "https://www.ndtv.com/world-news/rocket-fired-from-gaza-into-israel-amid-tensions-in-jerusalem-2905656", "urlToImage": "https://c.ndtvimg.com/gaza-strip-attack-afp_625x300_1529468152493.jpg", "publishedAt": "2022-04-20T20:56:43Z", "content": "Earlier, Israel carried out air strikes on Gaza in months in response to a rocket fired. (File)\r\nJerusalem: Palestinian militants in Gaza fired a rocket into Israel on Wednesday, the army said, as te… [+4141 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Targets Russian Bank, Oligarchs In New Round Of Sanctions Over Ukraine", "description": "The US Treasury announced fresh punitive measures Wednesday against Russia's Transkapitalbank as well as a sprawling network around oligarch Konstantin Malofeyev which was allegedly used to evade sanctions.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-us-targets-russian-bank-oligarchs-in-new-round-of-sanctions-over-ukraine-2905635", "urlToImage": "https://c.ndtvimg.com/2022-02/9i0om10g_putin-biden_625x300_23_February_22.jpg", "publishedAt": "2022-04-20T20:30:06Z", "content": "US State Department also placed visa bans on more than 650 Russians for human rights abuse in Ukraine.\r\nWashington: The US Treasury announced fresh punitive measures Wednesday against Russia's Transk… [+2086 chars]"}]}