{"status": "ok", "totalResults": 491, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Fuel Prices Rise 80 Paise/Litre In Delhi, First Revision Since December 1", "description": "The retail price of petrol and diesel increased by 80 paise each in Delhi from 6 am on Monday, marking the first revision since December 1 2021.", "url": "https://www.ndtv.com/business/fuel-prices-rise-by-80-paise-a-litre-in-delhi-first-revision-since-december-1-2835433", "urlToImage": "https://c.ndtvimg.com/2021-11/msuj4q58_petrol-pump-pti-650_650x400_03_November_21.jpg", "publishedAt": "2022-03-22T02:15:27Z", "content": "Fuel prices rise by 80 paise a litre in Delhi, first revision since December 1\r\nThe retail price of petrol and diesel increased by 80 paise each in Delhi from 6 am on Monday, marking the first revisi… [+2453 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russian Billionaire's Superyacht Docks In Turkey Following EU Sanctions", "description": "A luxury superyacht owned by Russian billionaire Roman Abramovich has docked in Turkey, which has not joined European sanctions against Moscow that have also targeted the Chelsea Football Club owner and other oligarchs.", "url": "https://www.ndtv.com/world-news/russian-billionaires-luxury-superyacht-docks-in-turkey-following-eu-sanctions-2835427", "urlToImage": "https://c.ndtvimg.com/2022-03/82l46qhg_ukraine-war_625x300_22_March_22.jpg", "publishedAt": "2022-03-22T02:02:33Z", "content": "Yachts owned by Russia's richest have been seized by various nations\r\nMoscow: A luxury superyacht owned by Russian billionaire Roman Abramovich has docked in Turkey, which has not joined European san… [+1620 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Pak PM Imran Khan To Trumpet Islamic Credentials As Home Fires Burn", "description": "Foreign ministers of Muslim nations gather in Pakistan as the country's leader trumpets his achievement of getting Islamophobia recognised at the United Nations while at the same time battling the most serious challenge to his rule in four years.", "url": "https://www.ndtv.com/world-news/pakistan-pm-imran-khan-to-trumpet-islamic-credentials-as-home-fires-burn-2835424", "urlToImage": "https://c.ndtvimg.com/2022-03/toipf60o_imran-khan-file-photo_625x300_12_March_22.jpg", "publishedAt": "2022-03-22T01:56:08Z", "content": "Imran Khan has called for a million of his supporters to rally in the capital next week.\r\nIslamabad, Pakistan: Foreign ministers of Muslim nations gather in Pakistan Tuesday as the country's leader t… [+4137 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine's Zelensky Rules Out Surrender, Presses Putin For Talks: Updates", "description": "Ukrainian leader Volodymyr Zelensky on Monday said his country would be \"destroyed\" before it surrenders its cities to invading Russian forces, as he doubled down on a call for direct talks with Vladimir Putin as the key to ending the war.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-live-updates-ukraine-president-volodymyr-zelensky-rules-out-surrender-presses-vladimir-putin-for-talks-2835416", "urlToImage": "https://c.ndtvimg.com/2022-03/k83gj7go_ukraine-war-afp_625x300_22_March_22.jpg", "publishedAt": "2022-03-22T01:41:50Z", "content": "Ukraine Crisis: Russia launched its full-scale invasion on February 24.\r\nNew Delhi: Ukrainian leader Volodymyr Zelensky on Monday said his country would be \"destroyed\" before it surrenders its cities… [+678 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "2 Killed In Knife Attack At Swedish School, Student Arrested: Police", "description": "Two women died after being stabbed at a high school in southern Sweden on Monday, police said, adding that an 18-year-old student had been arrested.", "url": "https://www.ndtv.com/world-news/sweden-school-attack-2-killed-in-knife-attack-at-swedish-school-student-arrested-police-2835411", "urlToImage": "https://i.ndtvimg.com/i/2018-03/police-generic-international-afp_650x400_41520126059.jpg", "publishedAt": "2022-03-22T01:28:17Z", "content": "He was armed with a knife and an axe, according to several Swedish media. (Representational)\r\nMalmo, Sweden: Two women died after being stabbed at a high school in southern Sweden on Monday, police s… [+2686 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "British Royal Couple Visit Ancient Maya Ruins, Climb Pyramids In Belize", "description": "Britain's Prince William and his wife Kate on Monday visited ancient Maya ruins at Caracol in central Belize, climbing pyramids and exploring the archaeological site before going on to meet British soldiers at a jungle camp.", "url": "https://www.ndtv.com/world-news/british-royals-prince-william-kate-middleton-visit-ancient-maya-ruins-climb-pyramids-in-belize-2835407", "urlToImage": "https://c.ndtvimg.com/2022-03/ua6jav4c_prince-william-kate-middleton-visit-maya-ruins_625x300_22_March_22.jpg", "publishedAt": "2022-03-22T01:24:41Z", "content": "Britain's Prince William and his wife Kate on Monday visited ancient Maya ruins at Caracol\r\nCaracol, Belize: Britain's Prince William and his wife Kate on Monday visited ancient Maya ruins at Caracol… [+2807 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine's President Asks Nation To Fight On, Calls For Talks With Putin", "description": "Ukrainian leader Volodymyr Zelensky said his country would be \"destroyed\" before it surrenders its cities to invading Russian forces, as he doubled down on a call for direct talks with Vladimir Putin as the key to ending the war.", "url": "https://www.ndtv.com/world-news/ukraines-president-volodymyr-zelensky-asks-nation-to-fight-on-calls-for-talks-with-vladimir-putin-2835406", "urlToImage": "https://c.ndtvimg.com/2022-03/cum1c3oo_ukraine-war-afp_625x300_22_March_22.jpg", "publishedAt": "2022-03-22T01:24:18Z", "content": "<li>As Russia defended overnight strikes that reduced a Kyiv shopping mall to rubble, killing eight, US President Joe Biden held a call with European leaders to address the increasingly \"brutal tacti… [+2423 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE: India Records 1,549 New COVID-19 Cases In 24 Hours", "description": "India reported a total of 1,549 fresh coronavirus cases in the last 24 hours, taking the COVID-19 tally to 4,30,09,390. According to Union health ministry data, the active cases declined further to 25,106 on Monday.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-india-latest-news-india-coronavirus-cases-today-22-march-2835391", "urlToImage": "https://c.ndtvimg.com/2020-11/mls1442o_covid-testingdelhinoidaborderpti_625x300_18_November_20.jpg", "publishedAt": "2022-03-22T00:52:01Z", "content": "India COVID-19 Cases: With 31 new Covid-related fatalities, the death count climbed to 5,16,510.\r\nNew Delhi: India reported a total of 1,549 fresh coronavirus cases in the last 24 hours, taking the C… [+578 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Muslim Family Donates Land To Build World's Largest Temple In Bihar", "description": "A Muslim family in Bihar has donated land worth Rs.2.5 crore for construction of the world's largest Hindu temple--Virat Ramayan Mandirin the Kaithwalia area of East Champaran district in the state.", "url": "https://www.ndtv.com/india-news/muslim-family-donates-its-land-worth-rs-2-5-crore-to-build-worlds-largest-hindu-temple-in-bihar-2835383", "urlToImage": "https://i.ndtvimg.com/i/2018-04/temple-generic-istock_650x400_41525075611.jpg", "publishedAt": "2022-03-22T00:15:53Z", "content": "The trust has so far obtained 125 acres of land for construction of this temple. (Representational)\r\nPatna: Setting an example of communal harmony in the country, a Muslim family in Bihar has donated… [+1665 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Joe Biden Calls India \"Shaky\" In Russia Confrontation Over Ukraine War", "description": "US President Joe Biden said Monday that India was an exception among Washington's allies with its \"shaky\" response to the Russian invasion of Ukraine.", "url": "https://www.ndtv.com/world-news/us-president-joe-biden-calls-india-shaky-in-russia-confrontation-over-ukraine-war-2835375", "urlToImage": "https://c.ndtvimg.com/2022-03/r0pib8h8_joe-biden-afp-650_625x300_17_March_22.jpg", "publishedAt": "2022-03-21T23:41:42Z", "content": "Biden said there had been \"a united front throughout NATO and in the Pacific.\"\r\nWashington: US President Joe Biden said Monday that India was an exception among Washington's allies with its \"shaky\" r… [+1859 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Putin Is Weighing Use Of Chemical Weapons In Ukraine, Says Biden", "description": "Russian accusations that Kyiv has biological and chemical weapons are false and illustrate that Russian President Vladimir Putin is considering using them himself in his war against Ukraine, U.S. President Joe Biden said on Monday.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-putin-is-weighing-use-of-chemical-weapons-in-ukraine-says-us-president-joe-biden-2835369", "urlToImage": "https://c.ndtvimg.com/2022-02/ijf447dg_joe-biden_625x300_11_February_22.jpg", "publishedAt": "2022-03-21T23:23:09Z", "content": "Earlier, Biden had warned of potential Russian cyberattacks on US businesses.\r\nWashington:  Russian accusations that Kyiv has biological and chemical weapons are false and illustrate that Russian Pre… [+545 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Salman Khan's Blackbuck Poaching Case Transferred To Rajasthan High Court", "description": "The Rajasthan High Court on Monday granted the permission to transfer two petitions to it from the Jodhpur District and Sessions court in the 1998 blackbuck poaching case in which actor Salman Khan is an accused.", "url": "https://www.ndtv.com/india-news/salman-khans-blackbuck-poaching-case-transferred-to-rajasthan-high-court-2835366", "urlToImage": "https://c.ndtvimg.com/2021-12/rvor3mdo_salman-khan_625x300_26_December_21.jpg", "publishedAt": "2022-03-21T23:03:31Z", "content": "After a brief hearing, the court granted permission to transfer the two petitions to the high court.\r\nJodhpur: The Rajasthan High Court on Monday granted the permission to transfer two petitions to i… [+1941 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russian Troops Kidnapped 3 Israelis In Occupied Melitopol, Claims Ukraine", "description": "The Ukraine government accused Russian troops of kidnapping three Israelis in the southeastern town of Melitopol, which they have occupied.", "url": "https://www.ndtv.com/world-news/russian-troops-kidnapped-3-israelis-in-occupied-melitopol-claims-ukraine-2835357", "urlToImage": "https://c.ndtvimg.com/2022-03/ec71sdp_ukraine-war-kyiv-afp-650_625x300_06_March_22.jpg", "publishedAt": "2022-03-21T22:39:18Z", "content": "Mikhail Kumok was described as a \"publisher\" and company owner, according to Ukrainian Deputy PM.\r\nKyiv: The Ukraine government accused Russian troops of kidnapping three Israelis in the southeastern… [+489 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Says Ready To Make \"Difficult Decisions\" To Restore Iran Nuke Deal", "description": "Price told journalists he could not discuss the specifics of the final remaining issues in the 11 month-old negotiations over restoring the 2015 JCPOA, which aims at preventing Tehran from acquiring nuclear weapons.", "url": "https://www.ndtv.com/world-news/us-says-ready-to-make-difficult-decisions-to-restore-iran-nuke-deal-2835351", "urlToImage": "https://c.ndtvimg.com/2019-10/a1r42eko_iran-us-flags_625x300_16_October_19.jpg", "publishedAt": "2022-03-21T22:16:43Z", "content": "US official, however, said that a deal to restore pact limiting Iran's nuclear program is not imminent.\r\nWashington: A deal to restore the pact limiting Iran's nuclear program is not imminent, but Wa… [+1716 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine's Zelensky Insists On Need For \"Meeting\" With Putin To End War", "description": "President Volodymyr Zelensky said Monday that a meeting with Russian counterpart Vladimir Putin \"in any format\" is needed to stop the war in Ukraine.", "url": "https://www.ndtv.com/world-news/ukraines-president-volodymyr-zelensky-insists-on-need-for-meeting-with-russias-vladimir-putin-to-end-war-2835347", "urlToImage": "https://c.ndtvimg.com/2022-03/djvkmrso_volodymyr-zelensky-netflix-show-servant-of-the-people-650_625x300_16_March_22.jpg", "publishedAt": "2022-03-21T21:59:35Z", "content": "Earlier, Zelensky said that any compromises with Russia will require a referendum in Ukraine.\r\nKyiv: President Volodymyr Zelensky said Monday that a meeting with Russian counterpart Vladimir Putin \"i… [+369 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Brutal Tactics\": Biden, EU Leaders Slam Russian Offensive In Ukraine", "description": "President Joe Biden and European allies discussed Russia's \"brutal\" war in Ukraine on Monday, kicking off a crucial week in the Western standoff with Moscow that will see Biden visit Poland after attending NATO and EU summits.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-joe-biden-european-leaders-discuss-russias-brutal-war-in-key-week-for-western-unity-2835345", "urlToImage": "https://c.ndtvimg.com/2022-03/ghc4vk08_ukraine-war-afp_625x300_20_March_22.jpg", "publishedAt": "2022-03-21T21:43:26Z", "content": "Leaders underscored their continued support for Ukraine, including by providing security assistance.\r\nWashington: President Joe Biden and European allies discussed Russia's \"brutal\" war in Ukraine on… [+4722 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Chinese Envoy Thanks PM Modi For His Prayers After Plane Crashes In China", "description": "Chinese Ambassador to India, Sun Weidong thanked Prime Minister Narendra Modi for offering prayers and sympathy over the passenger plane crash in China's Guangxi on Monday.", "url": "https://www.ndtv.com/india-news/chinese-envoy-sun-weidong-thanks-pm-modi-for-his-prayers-after-plane-crashes-in-china-2835336", "urlToImage": "https://c.ndtvimg.com/2020-08/t0s0jtqo_chinese-ambassador-to-india-sun-weidong_625x300_15_August_20.jpg", "publishedAt": "2022-03-21T21:09:23Z", "content": "New Delhi: Chinese Ambassador to India, Sun Weidong thanked Prime Minister Narendra Modi for offering prayers and sympathy over the passenger plane crash in China's Guangxi on Monday.\r\nTaking to Twit… [+1010 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine War: EU Split Over Banning Russian Energy Imports", "description": "EU nations remained split Monday over banning Russian energy imports, as a top official from the bloc decried \"a massive war crime\" being carried out by Moscow in Ukrainian city Mariupol.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-eu-divided-over-russia-oil-sanctions-amid-ukraine-war-2835329", "urlToImage": "https://i.ndtvimg.com/i/2016-04/european-union_650x400_41459963280.jpg", "publishedAt": "2022-03-21T20:47:25Z", "content": "The move is part of a broad Western push to help Ukraine keep up its ferocious resistance.\r\nBrussels: EU nations remained split Monday over banning Russian energy imports, as a top official from the … [+2688 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Any Compromises With Russia Will Need Referendum In Ukraine: Zelensky", "description": "Any deal agreed in peace negotiations with Russia will be submitted to a referendum in Ukraine, President Volodymyr Zelensky told a regional Ukrainian public media outlet Monday.", "url": "https://www.ndtv.com/world-news/any-compromises-with-russia-will-need-referendum-in-ukraine-says-president-volodymyr-zelensky-2835298", "urlToImage": "https://c.ndtvimg.com/2022-03/jljtqj8o_ukraine-president-volodymyr-zelensky-afp-650_625x300_15_March_22.jpg", "publishedAt": "2022-03-21T20:19:49Z", "content": "Moscow insists on a guarantee that Ukraine never be admitted to NATO.\r\nKyiv: Any deal agreed in peace negotiations with Russia will be submitted to a referendum in Ukraine, President Volodymyr Zelens… [+1414 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Joe Biden Warns Of Russian Cyberattacks On US Businesses", "description": "President Joe Biden on Monday warned US businesses to \"immediately\" prepare defenses against potential Russian cyberattacks.", "url": "https://www.ndtv.com/world-news/harden-cyber-defenses-us-president-biden-warns-of-russian-cyberattacks-on-us-businesses-2835260", "urlToImage": "https://c.ndtvimg.com/2022-02/mcdtq7so_joe-biden-afp_625x300_23_February_22.jpg", "publishedAt": "2022-03-21T19:08:56Z", "content": "Russian government is exploring options for potential cyberattacks, Biden said.\r\nWashington: President Joe Biden on Monday warned of intelligence pointing to a growing Russian cyber threat and he urg… [+2092 chars]"}]}