{"status": "ok", "totalResults": 266, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Akshaya Tritiya 2022: History, Significance, Rituals, And Celebrations", "description": "People celebrate Akshaya Tritiya to bring good luck to their lives. As per common belief, buying gold and properties on this day brings prosperity and wealth in the future.", "url": "https://www.ndtv.com/india-news/akshaya-tritiya-2022-date-history-significance-rituals-and-celebrations-2927657", "urlToImage": "https://c.ndtvimg.com/2022-05/0t6r35fg_akshaya-tritiya_625x300_02_May_22.jpg", "publishedAt": "2022-05-03T02:30:03Z", "content": "Akshaya Tritiya: Many individuals buy gold, silver, properties and other valuable things on this day.\r\nThe festival of Akshaya Tritiya is celebrated by Hindus and Jains around the world. Also known a… [+1843 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "PM Modi's Dig At Congress On Rajiv Gandhi's \"15 Paise In 1 Rupee\" Remark", "description": "Prime Minister Narendra Modi said on Monday that a new resurgent India had made up its mind to move forward with determination and urged the Indian diaspora to help the country take big strides globally.", "url": "https://www.ndtv.com/india-news/pm-modis-dig-at-congress-on-rajiv-gandhis-15-paise-in-1-rupee-remark-2941137", "urlToImage": "https://c.ndtvimg.com/2022-05/7ddmqu9o_modi_625x300_03_May_22.jpg", "publishedAt": "2022-05-03T02:17:15Z", "content": "PM Modi said India is making rapid strides in every sector\r\nBerlin: Prime Minister Narendra Modi said on Monday that a new resurgent India had made up its mind to move forward with determination and … [+2165 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Leaked Draft Shows US Court Set To Strike Down Abortion Rights: Report", "description": "The Supreme Court may be poised to strike down the right to abortion in the United States, US media reported Monday, citing a leaked draft of a majority opinion that would represent a staggering blow to women's rights.", "url": "https://www.ndtv.com/world-news/leaked-draft-shows-us-court-set-to-strike-down-abortion-rights-report-2941122", "urlToImage": "https://i.ndtvimg.com/i/2016-01/us-abortion-protest_650x400_81453750411.jpg", "publishedAt": "2022-05-03T01:51:32Z", "content": "US abortion rights: The report said the document it obtained is a draft and opinions could change. (File)\r\nWashington: The Supreme Court may be poised to strike down the right to abortion in the Unit… [+1767 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Met Gala: Blake Lively-Ryan Reynolds And Others Sparkle On The Red Carpet", "description": "Met Gala 2022: Blake Lively wore a beaded Versace gown with an oversized satin bow", "url": "https://www.ndtv.com/entertainment/met-gala-2022-blake-lively-ryan-reynolds-billie-eilish-and-other-stars-sparkle-on-the-red-carpet-2941121", "urlToImage": "https://c.ndtvimg.com/2022-05/pqqglcm_blake-_625x300_03_May_22.jpg", "publishedAt": "2022-05-03T01:47:05Z", "content": "Met Gala 2022: Billie Eilish (L), Blake Lively and Ryan Reynolds (R). (Image courtesy: AFP)\r\nA-listers dressed to the theme of \"gilded glamour\" sparkled on the red carpet as the annual Met Gala extra… [+3569 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Akshaya Tritiya 2022: Here's Why People Buy Gold, Silver On This Occasion", "description": "The Hindu calendar considers Akshaya Tritiya to be one of the most auspicious days of the year. The day is also considered to be highly favourable for gold and silver purchases.", "url": "https://www.ndtv.com/india-news/akshaya-tritiya-2022-heres-why-people-buy-gold-silver-on-akshaya-tritiya-2928090", "urlToImage": "https://c.ndtvimg.com/2019-06/5kmmep7o_gold-prices-gold-gold-jewellery-gold-rates_625x300_07_June_19.jpg", "publishedAt": "2022-05-03T01:39:32Z", "content": "Akshaya Tritiya: This year, Akshaya Tritiya will be observed across India on May 3. (File)\r\nThis year, Akshaya Tritiya will be observed across India on May 3. The festival falls on the Shukla Paksha … [+1683 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Teenage Boy Killed In Russian Missile Strike On Ukraine's Odessa", "description": "A teenage boy was killed in a fresh Russian strike on Ukraine's Black Sea port of Odessa Monday, the southern city's council said on social media.", "url": "https://www.ndtv.com/world-news/teenage-boy-killed-in-russian-missile-strike-on-ukraines-odessa-2941118", "urlToImage": "https://c.ndtvimg.com/2022-04/8ctb1l3o_ukraine-war-afp-650_625x300_24_April_22.jpg", "publishedAt": "2022-05-03T01:38:46Z", "content": "Odessa has seen increased attacks by Moscow in recent weeks.\r\nKyiv: A teenage boy was killed in a fresh Russian strike on Ukraine's Black Sea port of Odessa Monday, the southern city's council said o… [+1007 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Eid-ul-Fitr 2022: Eid Mubarak Wishes For Family, Friends, And Loved Ones", "description": "Muslims across the world celebrate Eid-ul-Fitr with zeal and grandeur. The festival marks the end of the fasting month of Ramzan.", "url": "https://www.ndtv.com/india-news/happy-eid-ul-fitr-2022-eid-mubarak-wishes-2022-for-family-friends-and-loved-ones-2930696", "urlToImage": "https://i.ndtvimg.com/i/2015-07/eid-ul-fitr_650x400_71437213199.jpg", "publishedAt": "2022-05-03T01:35:10Z", "content": "Eid-ul-Fitr marks the end of the fasting month of Ramzan.\r\nMuslims across the world celebrate Eid-ul-Fitr with zeal and grandeur. The festival marks the end of the fasting month of Ramzan. During thi… [+1886 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Met Gala: Natasha Poonawalla's \"Gilded Glamour\" In A Sabyasachi Saree", "description": "Met Gala 2022: Natasha Poonawalla wore a Sabyasachi saree to fashion's biggest night", "url": "https://www.ndtv.com/entertainment/met-gala-2022-natasha-poonawallas-gilded-glamour-in-a-sabyasachi-saree-2941093", "urlToImage": "https://c.ndtvimg.com/2022-05/r8l8j9so_natasha_625x300_03_May_22.jpg", "publishedAt": "2022-05-03T01:10:52Z", "content": "Met Gala 2022: Natasha Poonawalla wore this. (courtesy: sabyasachi)\r\nNew Delhi: Entrepreneur Natasha Poonawalla checked into fashion's biggest night - Met Gala 2022, in a golden Sabyasachi saree. The… [+2036 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Putin To Undergo Cancer Treatment, Handover Power, Claims US Media Report", "description": "Russian President Vladimir Putin might undergo cancer surgery while temporarily handing over power to the secretary of the country's Security Council Nikolai Patrushev, an unverified report by US's New York Post has claimed.", "url": "https://www.ndtv.com/world-news/vladimir-putin-may-undergo-cancer-treatment-handover-power-claims-uss-new-york-post-2941085", "urlToImage": "https://c.ndtvimg.com/2022-03/uoilpns_vladimir-putin-afp-pic_650x400_02_March_22.jpg", "publishedAt": "2022-05-03T00:42:17Z", "content": "A New York Post report claimed Russian President Valdimir Putin may get cancer treatment (File)\r\nMoscow: Russian President Vladimir Putin might undergo cancer surgery while temporarily handing over p… [+3287 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE: India Records Over 3,000 New COVID-19 Cases In 24 Hours", "description": "India reported at least 3,157 new COVID-19 cases in the last 24 hours, taking the coronavirus tally to 4,30,82,345. The country also recorded 26 new covid-related fatalies, bring the total number of deaths to 523,869.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-may-3-2941077", "urlToImage": "https://c.ndtvimg.com/2020-11/mls1442o_covid-testingdelhinoidaborderpti_625x300_18_November_20.jpg", "publishedAt": "2022-05-03T00:25:45Z", "content": "India COVID-19 Live: India also recorded 26 deaths in the last 24 hours.\r\nNew Delhi: India reported at least 3,157 new COVID-19 cases in the last 24 hours, taking the coronavirus tally to 4,30,82,345… [+390 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sacrilege Case: Court Allows Dera Chief To Appear Via Video Conferencing", "description": "The Punjab and Haryana High Court on Monday allowed the plea of Dera Sacha Sauda head Gurmeet Ram Rahim seeking relief from physical appearance and permission to appear via video conferencing before the court in matters related to sacrilege case.", "url": "https://www.ndtv.com/india-news/court-allows-dera-chief-to-appear-via-video-conferencing-in-2015-sacrilege-case-2941061", "urlToImage": "https://i.ndtvimg.com/i/2017-08/dera-sacha-sauda-chief-gurmeet-ram-rahim-singh_650x400_81503912100.jpg", "publishedAt": "2022-05-03T00:00:37Z", "content": "Currently, Dera Chief Gurmeet Ram Rahim is serving his sentence in rape and murder cases.\r\nChandigarh: The Punjab and Haryana High Court on Monday allowed the plea of Dera Sacha Sauda head Gurmeet Ra… [+1295 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "India's Position On Ukraine Based On Principles, Interests: Foreign Secretary", "description": "Addressing a press briefing at the conclusion of the first leg of PM Narendra Modi's Europe visit on Monday, Foreign Secretary Vinay Kwatra said that India's position on Ukraine war \"amply takes care of our principles as also our interests\".", "url": "https://www.ndtv.com/india-news/indias-position-on-ukraine-crisis-based-on-own-principles-interests-foreign-secretary-vinay-kwatra-2941054", "urlToImage": "https://c.ndtvimg.com/2022-04/bes8e8b8_ukraine-war-afp-650_625x300_11_April_22.jpg", "publishedAt": "2022-05-02T23:45:44Z", "content": "Foreign Secretary Vinay Kwatra was summarising PM Modi's Germany visit on Monday.\r\nBerlin: Addressing a press briefing at the conclusion of the first leg of Prime Minister Narendra Modi's Europe visi… [+3371 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Hitler Was Jewish\": An Old Conspiracy Theory", "description": "The suggestion by Russia's foreign minister that Adolf Hitler had Jewish blood is just the latest version of a conspiracy theory exploiting a gap in the dictator's ancestry.", "url": "https://www.ndtv.com/world-news/hitler-was-jewish-an-old-conspiracy-theory-2941047", "urlToImage": "https://i.ndtvimg.com/i/2016-10/adolf-hitler_650x400_81476716851.jpg", "publishedAt": "2022-05-02T23:23:09Z", "content": "Hitler's father, Alois, was an illegitimate child whose own father was unknown, Austrian historian said.\r\nVienna: The suggestion by Russia's foreign minister that Adolf Hitler had Jewish blood is jus… [+3208 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "New India Takes Risks, It Innovates: PM Modi To Indian Community In Berlin", "description": "Prime Minister Narendra Modi on Monday said the New India doesn't think only of a secure future alone but takes risks.", "url": "https://www.ndtv.com/india-news/new-india-takes-risks-it-innovates-pm-modi-to-indian-community-in-berlin-2941040", "urlToImage": "https://c.ndtvimg.com/2022-05/cggat548_pm-modi-berlin-ndtv_625x300_02_May_22.jpg", "publishedAt": "2022-05-02T23:06:35Z", "content": "India has more than 68,000 startups, PM Modi told Indian Community In Berlin.\r\nBerlin: Prime Minister Narendra Modi on Monday said the New India doesn't think only of a secure future alone but takes … [+2601 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "40% Of Global Real-Time Payments Took Place In India In 2021: PM Modi", "description": "Addressing the Indian community in Berlin, Prime Minister Narendra Modi on Monday said that of the total real-time digital payments that took place throughout the world in 2021, 40 per cent took place in India.", "url": "https://www.ndtv.com/india-news/40-of-global-real-time-payments-took-place-in-india-in-2021-pm-modi-in-berlin-2941037", "urlToImage": "https://c.ndtvimg.com/2022-05/cggat548_pm-modi-berlin-ndtv_625x300_02_May_22.jpg", "publishedAt": "2022-05-02T22:47:29Z", "content": "PM Modi also talked about the \"record number of airports being built in the country.\"\r\nBerlin: Addressing the Indian community in Berlin, Prime Minister Narendra Modi on Monday said that of the total… [+3270 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Cops To Move Gauhati High Court Against Bail To Jignesh Mevani", "description": "Assam Advocate General Debojit Saikia said that the Investigating Officer of Barpeta Road Police Station will file a separate petition through the public prosecutor before the Gauhati High Court against the bail granted to Gujarat MLA Jignesh Mevani.", "url": "https://www.ndtv.com/india-news/cops-to-move-gauhati-high-court-against-bail-to-gujarat-mla-jignesh-mevani-2941036", "urlToImage": "https://i.ndtvimg.com/i/2018-01/jignesh-mewani_650x400_51515139431.jpg", "publishedAt": "2022-05-02T22:28:02Z", "content": "Jignesh Mevani was arrested on 20 April by Assam police over his offensive tweet against PM Modi.\r\nGuwahati: Assam Advocate General Debojit Saikia on Monday said that the Investigating Officer of Bar… [+2768 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "1 Arrested, 5 Charged For Child Marriage In Rajasthan", "description": "One person was arrested and five others were booked in case of alleged child marriage in Jhalawar district of Rajasthan last week, police said on Monday.", "url": "https://www.ndtv.com/india-news/1-arrested-5-charged-for-child-marriage-in-rajasthans-jhalawar-2941031", "urlToImage": "https://i.ndtvimg.com/i/2016-05/arrest-generic_650x400_71463458726.jpg", "publishedAt": "2022-05-02T22:07:27Z", "content": "Jhalawar child marriage: The marriage took place in the Gurjar community, police said. (Representational)\r\nKota: One person was arrested and five others were booked in case of alleged child marriage … [+1316 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UK PM To Announce New Military Aid In Address To Ukrainian Parliament", "description": "British Prime Minister Boris Johnson will announce Tuesday another £300 million ($376 mn, 358 mn euros) in military aid for Ukraine in a remote address to its parliament, his office said Monday.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-uk-pm-boris-johnson-to-announce-376-million-more-military-aid-to-ukraine-in-address-to-ukrainian-parliament-2941027", "urlToImage": "https://c.ndtvimg.com/2022-04/lhrqh2_boris-johnson-650_625x300_22_April_22.jpg", "publishedAt": "2022-05-02T21:55:38Z", "content": "Russia-Ukraine war: On the diplomatic front, Britain is also reopening its embassy in Kyiv.\r\nLondon: British Prime Minister Boris Johnson will announce Tuesday another £300 million ($376 mn, 358 mn e… [+2520 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine's Zelensky Says Russia Forgot World War II Lessons", "description": "Ukraine's President Volodymyr Zelenskiy said on Monday that Russian Foreign Minister Sergei Lavrov's suggestion that Nazi leader Adolf Hitler had Jewish origins showed that Moscow has forgotten, or never learned, the lessons of World War Two.", "url": "https://www.ndtv.com/world-news/ukraine-president-volodymyr-zelensky-says-russia-forgot-world-war-ii-lessons-2941017", "urlToImage": "https://c.ndtvimg.com/2022-03/bh3l1t3g_zelensky-on-streets-afp_650x400_24_March_22.jpg", "publishedAt": "2022-05-02T21:30:04Z", "content": "Zelensky reacted after Russia's foreign minister claimed that Adolf Hitler \"had Jewish blood\".\r\nKyiv:  Ukraine's President Volodymyr Zelenskiy said on Monday that Russian Foreign Minister Sergei Lavr… [+578 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Palestine's Hamas Claims Responsibility For Deadly West Bank Shooting", "description": "The Islamist movement Hamas that rules the Gaza Strip said Monday they were behind a recent attack that killed an Israeli in the West Bank, linking it to tensions in Jerusalem.", "url": "https://www.ndtv.com/world-news/palestines-hamas-claims-responsibility-for-deadly-west-bank-shooting-2941009", "urlToImage": "https://c.ndtvimg.com/2022-04/e0ei6018_jerusalem-al-aqsa-mosque-afp-650_625x300_29_April_22.jpg", "publishedAt": "2022-05-02T21:07:50Z", "content": "Hamas said the Friday shooting was in response to the \"brutal aggression of against Al-Aqsa mosque.(File)\r\nGaza City, Palestinian: The Islamist movement Hamas that rules the Gaza Strip said Monday th… [+2001 chars]"}]}