{"status": "ok", "totalResults": 363, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Court Asks Man Accused Of \"Disturbing Communal Harmony\" To Serve Sherbet", "description": "The Allahabad High Court has directed a man to serve drinking water and sherbet (sweet drink) for one week in order to create goodwill and amity while granting bail to an accused of disturbing communal harmony.", "url": "https://www.ndtv.com/india-news/court-asks-man-accused-of-disturbing-communal-harmony-to-serve-sherbet-3006949", "urlToImage": "https://c.ndtvimg.com/2020-10/j4jnv9fo_allahabad-high-court_625x300_26_October_20.jpg", "publishedAt": "2022-05-25T04:30:25Z", "content": "The court said Ganga Jamuni Tehzeeb is a soul force to be harnessed in conduct (File)\r\nAllahabad: The Allahabad High Court has directed a man to serve drinking water and sherbet (sweet drink) for one… [+2828 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Despite Market Crash, Crypto Crowd Dominate Davos' Main Street", "description": "A free bitcoin pizza stall and a \"Liquidity Lounge\" were among the treats on offer for attendees at this year's meeting in Davos, where blockchain and cryptocurrency firms have taken over its main street, despite a recent crash in digital coin values.", "url": "https://www.ndtv.com/business/despite-market-crash-crypto-crowd-dominate-davos-main-street-3006938", "urlToImage": "https://c.ndtvimg.com/2022-05/5ut1btso_reuters-image_625x300_25_May_22.jpg", "publishedAt": "2022-05-25T04:26:22Z", "content": "Crypto crowd dominate Davos main street despite price crash\r\nA free bitcoin pizza stall and a \"Liquidity Lounge\" were among the treats on offer for attendees at this year's meeting in Davos, where bl… [+3053 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Watch: Riyan Parag Left Fuming After Run-Out Due To Mix-Up With Ashwin", "description": "IPL 2022, Qualifier 1: Riyan Parag and Ravichandran Ashwin had a mix-up, leading to the former being run out.", "url": "https://sports.ndtv.com/ipl-2022/gt-vs-rr-qualifier-1-riyan-parag-left-fuming-after-run-out-due-to-mix-up-with-ravichandran-ashwin-watch-3006928", "urlToImage": "https://c.ndtvimg.com/2022-05/cpcg3fmg_riyan-parag-ravichandran-ashwin-twitter_625x300_25_May_22.jpg", "publishedAt": "2022-05-25T04:23:15Z", "content": "During the final over of Rajasthan Royals' innings against Gujarat Titans in Indian Premier League (IPL) 2022 Qualifier 1 on Tuesday, there was high drama after a mix-up saw Riyan Parag run-out at th… [+1859 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Rashi Hardaha", "title": "NEET 2022 Application Correction Window: Here's What You Can Edit", "description": "NEET 2022 Application: Candidates who have submitted the NEET 2022 forms and now want to make changes in the application form will be allowed to do so till May 27 (up to 9 pm).", "url": "https://www.ndtv.com/education/neet-2022-application-correction-window-heres-what-you-can-edit-neet-nta-nic-in", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/5/25/shutterstock_1555297910.jpg", "publishedAt": "2022-05-25T04:22:05Z", "content": "New Delhi:The application correction window for the National Eligibility cum Entrance Test- Undergraduate (NEET-UG) 2022 has been opened. The online application correction window is available on the … [+4022 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "United Arab Emirates Reports First Known Monkeypox Case", "description": "The United Arab Emirates became the first Gulf country to announce a case of monkeypox on Tuesday, insisting it was \"fully prepared\" to handle any outbreak.", "url": "https://www.ndtv.com/world-news/united-arab-emirates-reports-first-known-monkeypox-case-3006904", "urlToImage": "https://c.ndtvimg.com/2022-05/rkjst6a_monkeypox-disease-650_625x300_10_May_22.jpg", "publishedAt": "2022-05-25T04:09:53Z", "content": "The monkeypox case was found in a 29-year-old woman arriving from West Africa. (File)\r\nDubai: The United Arab Emirates became the first Gulf country to announce a case of monkeypox on Tuesday, insist… [+1505 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Condemns North Korea Missile Test, Holds Talks With South Korea", "description": "The United States condemned North Korea for what it said were three ballistic missile launches and called on Pyongyang instead to choose dialogue.", "url": "https://www.ndtv.com/world-news/north-korea-nuclear-missiles-kim-jong-un-us-north-korea-missile-row-us-condemns-north-korea-missile-test-holds-talks-with-south-korea-3006891", "urlToImage": "https://c.ndtvimg.com/2022-04/bu5uhu5o_north-korea-missilereuters_625x300_15_April_22.jpg", "publishedAt": "2022-05-25T04:00:55Z", "content": "South Korea and the US condemned the ballistic missiles tests. (File)\r\nSeoul: The United States condemned North Korea for what it said were three ballistic missile launches and called on Pyongyang in… [+1961 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sensex Rises Over 250 Points In Early Trade, Nifty Above 16,200", "description": "Indian equity benchmarks on Wednesday traded higher in opening deals led by gains in banking and financial stocks.", "url": "https://www.ndtv.com/business/stock-market-india-sensex-rises-over-250-points-in-early-trade-nifty-above-16-200-3006879", "urlToImage": "https://c.ndtvimg.com/2022-02/f09d5t7o_bse-sensex-news_625x300_14_February_22.jpg", "publishedAt": "2022-05-25T03:47:56Z", "content": "Sensex and Nifty started on a higher note today.\r\nNew Delhi: Indian equity benchmarks on Wednesday traded higher in opening deals led by gains in banking and financial stocks.\r\nTrends on the Nifty Fu… [+1712 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Adani Ports' Profit Falls Over A Fifth To Rs 1,033 Crore In March Quarter", "description": "Adani Ports and Special Economic Zone Limited (APSEZ) has reported a 21.78 per cent decline in consolidated net profit to Rs 1,033 crore for the fourth quarter ended March 2022.", "url": "https://www.ndtv.com/business/apsez-quarterly-profit-falls-22-pc-to-rs-1-033-crore-3006874", "urlToImage": "https://c.ndtvimg.com/2021-11/p8pgb3s_adani-ports-gujarat-mundra-port-gujarat_625x300_20_November_21.jpg", "publishedAt": "2022-05-25T03:45:46Z", "content": "Adani Ports (APSEZ) quarterly profit falls 22 pc to Rs 1,033 crore\r\nNew Delhi: Adani Ports and Special Economic Zone Limited (APSEZ) has reported a 21.78 per cent decline in consolidated net profit t… [+931 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Summer Special: Keventers Launches Three New Flavours Of Ice Cream", "description": "Keventers has launched three new flavours of ice cream - Tutti Frutti, Tiramisu, and Cookies & Cream.", "url": "https://food.ndtv.com/news/summer-special-keventers-launches-three-new-flavours-of-ice-cream-3006873", "urlToImage": "https://c.ndtvimg.com/2021-05/kn7fiiq_mango-lassi-ice-cream_625x300_21_May_21.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-25T03:45:13Z", "content": "Summer is here and so is the time to indulge in all things cool and comforting - ice cream being a popular choice for all. Ice cream is all about nostalgia. It instantly takes us back to the childhoo… [+1367 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Watch: How To Make Onion Chutney: A Lip-Smacking Recipe That Will Fire Up Your Meals", "description": "The onion chutney is all things flavourful and has a taste that you have never had before. It is comforting, spicy, and makes for a perfect side dish.", "url": "https://food.ndtv.com/how-to/watch-how-to-make-onion-chutney-a-lip-smacking-recipe-that-will-fire-up-your-meals-3006862", "urlToImage": "https://c.ndtvimg.com/2020-02/mo7kr5ho_capsicum-chutney_625x300_20_February_20.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-25T03:32:45Z", "content": "Indian meals consist of a variety of items. Be it dal, roti, rice, sabzi, salad, achar and even chutneys. All these things complete our thalis and leave us drooling. However, many people conceive of … [+2359 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "\"Would Love To Return...\": AB de Villiers Says This On IPL Comeback", "description": "Former Royal Challengers Bangalore batter AB de Villiers has said that he will definitely be around the IPL next year.", "url": "https://sports.ndtv.com/ipl-2022/would-love-to-return-ab-de-villiers-makes-big-announcement-regarding-indian-premier-league-comeback-3006861", "urlToImage": "https://c.ndtvimg.com/2020-10/d0467p58_ab-de-villiers-bcci-ipl_625x300_17_October_20.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-25T03:31:27Z", "content": "AB de Villiers is one cricketer who enjoys a great fan following in cricket and whenever someone talks about Royal Challengers Bangalore, the former Proteas batter always comes to mind. Now, the form… [+1592 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "India Caps Sugar Exports At 10 Million Tonnes For First Time In 6 Years", "description": "India has imposed restrictions on sugar exports for the first time in six years by capping this season's exports at 10 million tonnes, a government order said, to prevent a surge in domestic prices after mills sold a record volume on the world market.", "url": "https://www.ndtv.com/business/india-caps-sugar-exports-at-10-million-tonnes-for-first-time-in-6-years-3006854", "urlToImage": "https://c.ndtvimg.com/2022-05/7a2bsn_sugar-exports_625x300_25_May_22.jpg", "publishedAt": "2022-05-25T03:25:55Z", "content": "India is the world's biggest sugar producer and the second biggest exporter behind Brazil.\r\nMumbai: India has imposed restrictions on sugar exports for the first time in six years by capping this sea… [+1732 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "2 Years After George Floyd's Death, Biden To Sign Order On Police Reform", "description": "Two years after African-American George Floyd was murdered by a white police officer in a Minneapolis street, President Joe Biden will on Wednesday sign an executive order further regulating federal law enforcement.", "url": "https://www.ndtv.com/world-news/2-years-after-george-floyds-death-biden-to-sign-order-on-police-reform-3006853", "urlToImage": "https://c.ndtvimg.com/2021-05/iq4ntre_george-floyd-_625x300_13_May_21.jpg", "publishedAt": "2022-05-25T03:25:22Z", "content": "George Floyd died of asphyxiation after a white police officer pressed his knee into his neck. (File)\r\nWashington: Two years after African-American George Floyd was murdered by a white police officer… [+2273 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Watch: Miller Hits 3 Straight 6s In Last Over To Take GT Into IPL Final", "description": "IPL 2022: With 16 needed off the final over, David Miller smashed Prasidh Krishna for three straight sixes to send Gujarat Titans into the final.", "url": "https://sports.ndtv.com/ipl-2022/gt-vs-rr-indian-premier-league-2022-david-miller-hits-three-straight-sixes-in-last-over-to-take-gujarat-titans-into-final-watch-3006847", "urlToImage": "https://c.ndtvimg.com/2022-05/mk7gmn7o_david-miller-bcciipl_625x300_25_May_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-25T03:19:28Z", "content": "David Miller aced the finisher's role yet again as the South African helped Gujarat Titans defeat Rajasthan Royals in the Indian Premier League (IPL) 2022 Qualifier 1 on Tuesday. His unbeaten 68 off … [+1414 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Indian Stocks May See First Annual Decline In 7 Years: Report", "description": "India's equity markets will mark their first annual decline in seven years in 2022 as higher interest rates and weakening growth prospects reduce the chances of a quick rebound from this year's already sharp drop, a Reuters poll showed.", "url": "https://www.ndtv.com/business/indian-stocks-may-see-first-annual-decline-in-7-years-report-3006833", "urlToImage": "https://c.ndtvimg.com/2022-05/e4nbnspg_nse-nifty_625x300_25_May_22.jpg", "publishedAt": "2022-05-25T03:18:31Z", "content": "Most analysts warned the negative outlook was largely due to rising interest rates.\r\nBENGALURU: India's equity markets will mark their first annual decline in seven years in 2022 as higher interest r… [+2667 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "8th US Mass Shooting This Year Provokes Another Gun Control Debate", "description": "A mass shooting that left 18 schoolchildren dead in the deeply pro-gun state of Texas on Tuesday increased pressure on US politicians to take action over the ubiquity of firearms -- but also brought the grim expectation of little or no change.", "url": "https://www.ndtv.com/world-news/8th-us-mass-shooting-this-year-provokes-another-gun-control-debate-3006845", "urlToImage": "https://c.ndtvimg.com/2022-05/istlqvmo_texas-school-shooting_625x300_25_May_22.jpg", "publishedAt": "2022-05-25T03:18:03Z", "content": "Guns of all kinds are cheaper and more widely available than ever across the United States.\r\nWashington: A mass shooting that left 18 schoolchildren dead in the deeply pro-gun state of Texas on Tuesd… [+4512 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "On Bihar Caste Census, BJP To Be At Nitish Kumar's June 1 All-Party Meet", "description": "An all-party meeting on the statewide caste census will be held on June 1, said Bihar Parliamentary Affairs Minister Vijay Kumar Chaudhary. Mr Chaudhary said that the BJP, which was earlier opposed to the idea, will also attend the meeting", "url": "https://www.ndtv.com/india-news/nitish-kumar-on-bihar-caste-census-bjp-to-be-at-nitish-kumars-june-1-all-party-meet-3006836", "urlToImage": "https://c.ndtvimg.com/2022-05/d4rgk1u8_nitish-kumar-650_625x300_24_May_22.jpg", "publishedAt": "2022-05-25T03:12:40Z", "content": "Nitish Kumar's Janata Dal (United) (JDU) and the BJP are alliance partners in Bihar. (File)\r\nPatna: An all-party meeting on the statewide caste census will be held on June 1, said Bihar Parliamentary… [+1769 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "India Allows Duty-Free Imports Of Crude Soybean, Sunflower Oil", "description": "India has allowed duty-free imports of 2 million tonnes each of crude soyoil and crude sunflower oil for the current and the next fiscal year to March 2024, a government order said on Tuesday, as part of efforts to keep a lid on local prices.", "url": "https://www.ndtv.com/business/india-allows-duty-free-imports-of-crude-soybean-sunflower-oil-3006811", "urlToImage": "https://c.ndtvimg.com/2022-05/is8m4jmg_sunflower-crude_625x300_25_May_22.jpg", "publishedAt": "2022-05-25T03:06:15Z", "content": "Traders need to seek their import quota from the government.\r\nNew Delhi: India has allowed duty-free imports of 2 million tonnes each of crude soyoil and crude sunflower oil for the current and the n… [+1715 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Future Group Firms' Q4 Results To Be Delayed", "description": "Four listed firms of the Kishore Biyani-led Future Group on Tuesday expressed their inability to convene a board meeting before May 30 to approve their financial results for the quarter and year ended March 31 on account of vacant positions on their respectiv…", "url": "https://www.ndtv.com/business/future-group-firms-q4-results-to-be-delayed-3006277", "urlToImage": "https://c.ndtvimg.com/2021-03/cq4gg1e_future-retail-650_650x400_18_March_21.jpg", "publishedAt": "2022-05-25T03:01:50Z", "content": "The companies are -- Future Retail, Future Lifestyle, Future Supply Chain and Future Enterprises.\r\nNew Delhi: Four listed firms of the Kishore Biyani-led Future Group on Tuesday expressed their inabi… [+2381 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "\"All 23 Players Are Different Characters\": Hardik On What Makes GT Tick", "description": "IPL 2022: Hardik Pandya said he is staying \"neutral\" after Gujarat Titans became the first team to reach this year's final.", "url": "https://sports.ndtv.com/ipl-2022/all-23-players-are-different-characters-hardik-pandya-after-leading-gt-to-ipl-final-3006826", "urlToImage": "https://c.ndtvimg.com/2022-05/mfjs9qig_hardik-pandya-bcciipl_625x300_25_May_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-05-25T03:01:10Z", "content": "A very different Hardik Pandya has come to the fore during this season of IPL and the Gujarat Titans skipper feels he has finally learnt to strike a balance on and off the field. Under Pandya, Gujara… [+3557 chars]"}]}