{"status": "ok", "totalResults": 343, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"How Much More Carnage...\": Biden Urges Ban On Assault Weapons", "description": "US President Joe Biden on Thursday urged lawmakers to ban privately owned assault weapons and high capacity magazines in order to curb the mass shootings plaguing the country.", "url": "https://www.ndtv.com/world-news/joe-biden-urges-ban-on-assault-weapons-in-speech-on-gun-violence-after-mass-shootings-3034132", "urlToImage": "https://c.ndtvimg.com/2022-05/uq1a5epo_joe-biden_625x300_21_May_22.jpg", "publishedAt": "2022-06-03T00:23:14Z", "content": "Joe Biden also called Republican senators' refusal to enact gun laws 'unconscionable'.\r\nWashington: US President Joe Biden on Thursday urged lawmakers to ban privately owned assault weapons and high … [+386 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Adds 71 Russian Companies To Economic Blacklist Over Ukraine War", "description": "The US added 71 Russian and Belarusian entities to its trade blacklist including several aircraft factories and shipbuilding and research institutes in its latest effort to deprive the Russian military of U.S. technology and other items.", "url": "https://www.ndtv.com/world-news/us-adds-71-russian-companies-to-economic-blacklist-over-ukraine-war-3034121", "urlToImage": "https://c.ndtvimg.com/2022-04/t2javoik_us-sanctions-on-russia_625x300_02_April_22.jpg", "publishedAt": "2022-06-02T23:47:50Z", "content": "US added a total of 322 entities to its blacklist for support of Russia's military since invasion.\r\nWashington: The United States on Thursday added 71 Russian and Belarusian entities to its trade bla… [+1819 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Kerala Chief Minister Says Will Not Implement Citizenship Act In State", "description": "Kerala Chief Minister Pinarayi Vijayan on Thursday asserted that his government would not implement the controversial Citizenship (Amendment) Act (CAA).", "url": "https://www.ndtv.com/india-news/kerala-chief-minister-pinarayi-vijayan-says-will-not-implement-citizenship-amendment-act-in-state-3034117", "urlToImage": "https://c.ndtvimg.com/2021-02/ehoka8sc_pinarayi-vijayan-pti_625x300_25_February_21.jpg", "publishedAt": "2022-06-02T23:29:43Z", "content": "Kerala CM Pinarayi Vijayan said that nowadays, attempts are being made to destroy secularism. (File)\r\nThiruvananthapuram: Kerala Chief Minister Pinarayi Vijayan on Thursday asserted that his governme… [+2333 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Zelensky Wants More Weapons From Allies As Battle For Ukraine's East Rages", "description": "Ukraine expects to receive more weapons from allies after a fresh U.S. pledge, President Volodymyr Zelenskiy said, as the battle for Ukraine's east raged 100 days into Russia's invasion.", "url": "https://www.ndtv.com/world-news/volodymyr-zelensky-wants-more-weapons-from-allies-as-battle-for-ukraines-east-rages-3034110", "urlToImage": "https://c.ndtvimg.com/2022-05/sqnvioa_russiaukraine_625x300_27_May_22.jpg", "publishedAt": "2022-06-02T23:06:29Z", "content": "Moscow's forces now occupy about 20% of Ukraine's territory, according to Zelensky.\r\nKyiv: Ukraine expects to receive more weapons from allies after a fresh U.S. pledge, President Volodymyr Zelenskiy… [+4520 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "2 Members Of Lawrence Bishnoi Gang Arrested In Rajasthan: Police", "description": "Two wanted associates of notorious Lawrence Bishnoi gang were arrested in Dholpur district of Rajasthan, police said on Thursday.", "url": "https://www.ndtv.com/india-news/2-members-of-lawrence-bishnoi-gang-arrested-in-rajasthans-dholpur-police-3034103", "urlToImage": "https://c.ndtvimg.com/2020-02/dpt9q2q8_arrest-generic-istock-650_625x300_23_February_20.jpg", "publishedAt": "2022-06-02T22:53:26Z", "content": "Two illegal firearms were also recovered from their possession, police said. (Representational)\r\nDholpur, Rajasthan: Two wanted associates of notorious Lawrence Bishnoi gang were arrested in Dholpur … [+927 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Tamil Nadu To Celebrate Karunanidhi Birth Anniversary In A Grand Manner", "description": "The ruling DMK in Tamil Nadu has planned to celebrate the 98th birth anniversary of former Chief Minister and Dravidian stalwart M Karunanidhi in a grand manner in the state on Friday.", "url": "https://www.ndtv.com/india-news/tamil-nadu-to-celebrate-karunanidhi-birth-anniversary-in-a-grand-manner-3034098", "urlToImage": "https://c.ndtvimg.com/a97cl3h8_karunanidhi-650_650x400_07_August_18.jpg", "publishedAt": "2022-06-02T22:30:43Z", "content": "Tamil Nadu CM M K Stalin will lead the celebration in the state by paying floral tributes. (File)\r\nChennai: The ruling DMK in Tamil Nadu has planned to celebrate the 98th birth anniversary of former … [+1329 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Man Arrested For Printing Fake Currency At Home In West Bengal: Police", "description": "A 59-year-old man was arrested in West Bengal's Bankura district after fake currency notes and a printer were found at his house, police said on Thursday.", "url": "https://www.ndtv.com/india-news/man-arrested-for-printing-fake-notes-at-home-in-west-bengals-bankura-police-3034089", "urlToImage": "https://i.ndtvimg.com/i/2016-05/arrest-generic_650x400_71463458726.jpg", "publishedAt": "2022-06-02T22:10:39Z", "content": "The Police said that the man has been arrested and investigation is underway. (Representational)\r\nBankura, West Bengal: A 59-year-old man was arrested in West Bengal's Bankura district after fake cur… [+758 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Multiple People Injured In Shooting During Funeral In US: Police", "description": "A shooter wounded multiple people during a funeral in the US state of Wisconsin on Thursday, police and local media said.", "url": "https://www.ndtv.com/world-news/multiple-people-injured-in-shooting-during-funeral-in-us-wisconsin-police-3034082", "urlToImage": "https://c.ndtvimg.com/2018-09/hms9qqjc_us-police-generic_625x300_14_September_18.jpg", "publishedAt": "2022-06-02T21:56:56Z", "content": "Wisconsin Shooting: Local media reported that five people were wounded at the funeral. (Representational)\r\nWashington: A shooter wounded multiple people during a funeral in the US state of Wisconsin … [+725 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Karnataka Health Minister Tests Positive For COVID-19", "description": "Karnataka Health Minister K Sudhakar has tested positive for COVID-19. Confirming the news in a tweet on Thursday evening, Mr Sudhakar wrote, \"I have tested positive for COVID-19, after being uninfected through three waves of the pandemic\".", "url": "https://www.ndtv.com/india-news/karnataka-health-minister-k-sudhakar-tests-positive-for-covid-19-3034075", "urlToImage": "https://c.ndtvimg.com/2021-03/vg62n6hg_k-sudhakar-twitter_625x300_25_March_21.jpg", "publishedAt": "2022-06-02T21:28:46Z", "content": "Karnataka Health Minister said that he has moderate symptoms of coronavirus.\r\nBengaluru: Karnataka Health Minister K Sudhakar has tested positive for COVID-19. Confirming the news in a tweet on Thurs… [+1532 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Joe Biden Likely To Visit Saudi Arabia This Month: Reports", "description": "US President Joe Biden will visit Saudi Arabia this month, reports said Thursday, a stark reversal for a leader who once called for the kingdom to be made a pariah.", "url": "https://www.ndtv.com/world-news/us-president-joe-biden-likely-to-visit-saudi-arabia-this-month-reports-3034072", "urlToImage": "https://c.ndtvimg.com/2022-05/q9qq32jc_joe-biden-at-quad-meet_625x300_24_May_22.jpg", "publishedAt": "2022-06-02T21:17:08Z", "content": "The report says that Biden would go ahead with the long-rumored Saudi stop on an upcoming trip.\r\nWashington: US President Joe Biden will visit Saudi Arabia this month, reports said Thursday, a stark … [+2243 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UN Aid Chief In Russia To Discuss Ukraine Grain Exports", "description": "U.N. aid chief Martin Griffiths is in Moscow on Thursday and Friday to discuss clearing the way for exports of grain and other food from Ukraine's Black Sea ports, a U.N. spokesperson said.", "url": "https://www.ndtv.com/world-news/un-aid-chief-martin-griffiths-arrives-in-russia-to-discuss-ukraine-grain-exports-3034063", "urlToImage": "https://c.ndtvimg.com/2018-12/o7iantu8_unenvoy-martin-griffiths_240_625x300_16_December_18.jpg", "publishedAt": "2022-06-02T21:00:30Z", "content": "UN aid chief will meet Russian officials to discuss clearing the way for exports of grain. (File)\r\nMoscow: U.N. aid chief Martin Griffiths is in Moscow on Thursday and Friday to discuss clearing the … [+2104 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Mask Mandate May Return In Maharashtra If Covid Cases Continue To Rise: Minister", "description": "Expressing concern over the rise in COVID-19 cases in Maharashtra, state Deputy Chief Minister Ajit Pawar on Thursday said the use of face masks will have to be made mandatory if the spike continues.", "url": "https://www.ndtv.com/india-news/mask-mandate-may-return-in-maharashtra-if-covid-cases-rise-deputy-chief-minister-ajit-pawar-3034057", "urlToImage": "https://c.ndtvimg.com/2021-12/jt10gtl_mumbai-covid-pti-650-_650x400_30_December_21.jpg", "publishedAt": "2022-06-02T20:40:25Z", "content": "Maharashtra COVID-19: Maharashtra on Wednesday recorded 1,081 cases of Covid cases.\r\nPune: Expressing concern over the rise in COVID-19 cases in Maharashtra, state Deputy Chief Minister Ajit Pawar on… [+2260 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Delhi Man Dies By Suicide Over Strained Relationship With Wife: Police", "description": "A 41-year-old man allegedly committed suicide as he was depressed due to strained relationship with his wife, police said on Thursday.", "url": "https://www.ndtv.com/india-news/delhi-man-dies-by-suicide-over-strained-relationship-with-wife-police-3034040", "urlToImage": "https://i.ndtvimg.com/i/2016-01/police-generic_650x400_61452839851.jpg", "publishedAt": "2022-06-02T20:08:50Z", "content": "The man took the extreme step on May 30, police said citing the suicide note.\r\nNew Delhi: A 41-year-old man allegedly committed suicide as he was depressed due to strained relationship with his wife,… [+744 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Why Ghulam Azad Still Staying In Government Bungalow? Minister's Response", "description": "Union Housing and Urban Affairs Minister Hardeep Singh Puri on Thursday said government bungalows are allowed to be retained by those who get \"another job\".", "url": "https://www.ndtv.com/india-news/why-ghulam-azad-still-staying-in-government-bungalow-ministers-response-3033237", "urlToImage": "https://c.ndtvimg.com/2020-10/8qn67mko_civil-aviation-minister-hardeep-puri-pti-photo_625x300_09_October_20.jpg", "publishedAt": "2022-06-02T20:02:19Z", "content": "Union Minister Hardeep Singh Puri also said a pilot project is being planned for city buses.\r\nNew Delhi: Union Housing and Urban Affairs Minister Hardeep Singh Puri on Thursday said government bungal… [+882 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Pre-Arrest Bail To Imran Khan For 15 Days In 14 Cases Against Him", "description": "In a recent decision, the Peshawar High Court (PHC) on Thursday granted Pakistan Tehreek-e-Insaf (PTI) chief Imran Khan pre-arrest bail for 15 days in the 14 cases registered against him.", "url": "https://www.ndtv.com/world-news/pre-arrest-bail-to-imran-khan-for-15-days-in-14-cases-against-him-3033249", "urlToImage": "https://c.ndtvimg.com/2022-05/2gqs37gg_imran-khan-pakistan-afp-650_625x300_26_May_22.jpg", "publishedAt": "2022-06-02T19:56:51Z", "content": "Pakistan: Court granted PTI leader Imran Khan bail till June 25.\r\nPeshawar: In a recent decision, the Peshawar High Court (PHC) on Thursday granted Pakistan Tehreek-e-Insaf (PTI) chief Imran Khan pre… [+3204 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Follow Covid-Appropriate Behaviour Or...: What Uddhav Thackeray Said", "description": "Maharashtra Chief Minister Uddhav Thackeray on Thursday said people should use face masks, vaccinate themselves and follow discipline if they don't wish to experience COVID-19 restrictions again.", "url": "https://www.ndtv.com/india-news/follow-covid-appropriate-behaviour-if-you-dont-want-to-face-restrictions-again-maha-cm-to-people-3033369", "urlToImage": "https://c.ndtvimg.com/2019-12/m05m8fos_uddhav-thackeray-pti_625x300_17_December_19.jpg", "publishedAt": "2022-06-02T19:53:37Z", "content": "Covid In Maharashtra: Mumbai reported 739 fresh COVID-19 cases on Thursday.\r\nMumbai: Maharashtra Chief Minister Uddhav Thackeray on Thursday said people should use face masks, vaccinate themselves an… [+2288 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "35-Year-Old Man Shot At In East Delhi: Police", "description": "A 35-year-old man was shot at by two unidentified persons on early Thursday in east Delhi's Pandav Nagar area, police said.", "url": "https://www.ndtv.com/delhi-news/35-year-old-man-shot-at-in-east-delhi-police-3033388", "urlToImage": "https://c.ndtvimg.com/2020-08/4hfi3k_delhi-police-generic_625x300_22_August_20.jpg", "publishedAt": "2022-06-02T19:51:18Z", "content": "Delhi: Efforts are being made to find the culprits, police said. (Representational)\r\nNew Delhi: A 35-year-old man was shot at by two unidentified persons on early Thursday in east Delhi's Pandav Naga… [+623 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Congress To Set Up State, District-Level Committees In Maharashtra", "description": "The Maharashtra Congress on Thursday passed a resolution stating that it will form state and district-level committees to take stock of political situation to forge alliances with like-minded parties for future elections in the state.", "url": "https://www.ndtv.com/india-news/congress-to-set-up-state-district-level-committees-in-maharashtra-3033416", "urlToImage": "https://c.ndtvimg.com/2018-11/ceef17g8_congress-flag-generic-afp_625x300_06_November_18.jpg", "publishedAt": "2022-06-02T19:48:57Z", "content": "The party will take appropriate steps as part of timely election preparedness, Congress said.\r\nMumbai: The Maharashtra Congress on Thursday passed a resolution stating that it will form state and dis… [+1283 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "China's $2.3 Billion Refinancing Pakistan Plan Amid Forex Crisis: Report", "description": "China on Thursday agreed to refinance Pakistan with USD 2.3 billion worth of funds amid the dwindling foreign exchange reserves of the country.", "url": "https://www.ndtv.com/world-news/chinas-2-3-billion-refinancing-pakistan-plan-amid-forex-crisis-report-3033450", "urlToImage": "https://c.ndtvimg.com/2021-06/b6t3g4kg_china-flag-reuters_625x300_13_June_21.jpg", "publishedAt": "2022-06-02T19:45:33Z", "content": "China-Pakistan Relations: China agreed to refinance Pakistan with USD 2.3 billion worth of funds\r\nIslamabad: China on Thursday agreed to refinance Pakistan with USD 2.3 billion worth of funds amid th… [+2358 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Urges Turkey To \"Refrain\" From Military Action In Syria", "description": "Russia hopes Turkey will \"refrain\" from launching an offensive in northern Syria, a diplomatic spokesperson said Thursday, after Turkish President Recep Tayyip Erdogan renewed threats of a military campaign targeting Kurdish \"terrorists\".", "url": "https://www.ndtv.com/world-news/russia-urges-turkey-to-refrain-from-military-action-in-syria-3034029", "urlToImage": "https://i.ndtvimg.com/i/2018-01/turkey-syria-reuters_650x400_61516533141.jpg", "publishedAt": "2022-06-02T19:45:13Z", "content": "Turkey's Erdogan on Wednesday renewed threats of a military offensive in northern Syria. (File)\r\nMoscow: Russia hopes Turkey will \"refrain\" from launching an offensive in northern Syria, a diplomatic… [+1913 chars]"}]}