{"status": "ok", "totalResults": 273, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Jeff Bezos Questions China's Leverage After Elon Musk Buys Twitter", "description": "Amazon founder Jeff Bezos today responded to billionaire Elon Musk's whopping $44 billion deal to buy Twitter, questioning the leverage the Chinese government may or may not gain now, following Musk's hostile takeover of the social media platform.", "url": "https://www.ndtv.com/world-news/musk-twitter-takeover-jeff-bezos-questions-chinas-leverage-after-elon-musk-buys-twitter-2920137", "urlToImage": "https://c.ndtvimg.com/2021-09/1ekbe9og_jeff-bezos_625x300_11_September_21.png", "publishedAt": "2022-04-26T02:24:26Z", "content": "Jeff Bezos retweeted a New York Times reporter's post about Elon Musk and China. (File)\r\nNew Delhi: Amazon founder Jeff Bezos today responded to billionaire Elon Musk's whopping $44 billion deal to b… [+2356 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "A Timeline Of Elon Musk's Takeover Of Twitter", "description": "Twitter users woke up April 4 and found the words \"Elon\" and \"Elon Musk\" trending on the site - not because the world's richest businessman had caused a stir with his futuristic companies, but because he'd disclosed a major stake in Twitter Inc.", "url": "https://www.ndtv.com/world-news/a-timeline-of-elon-musks-takeover-of-twitter-2920133", "urlToImage": "https://c.ndtvimg.com/2022-03/s2ku2tf8_elon-musk-reuters_625x300_25_March_22.jpg", "publishedAt": "2022-04-26T02:09:08Z", "content": "Elon Musk said he will prioritize free speech on the site and add new features.\r\nTwitter users woke up April 4 and found the words \"Elon\" and \"Elon Musk\" trending on the site - not because the world'… [+8428 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "RBI To Hike Rates In June, With A Faster Tightening Path Likely: Report", "description": "The Reserve Bank of India will raise its repo rate in June and hike at a faster pace than predicted just a few weeks ago as a surge in inflation puts pressure on the central bank to act quicker, a Reuters poll showed.", "url": "https://www.ndtv.com/business/rbi-to-hike-repo-rate-in-june-earlier-than-previously-thought-reuters-poll-2920131", "urlToImage": "https://c.ndtvimg.com/2018-11/atghbodo_rbi,-reserve-bank-of-india_625x300_19_November_18.jpg", "publishedAt": "2022-04-26T02:08:25Z", "content": "RBI to hike repo rate in June, earlier than previously thought: Reuters poll\r\nBENGALURU: The Reserve Bank of India will raise its repo rate in June and hike at a faster pace than predicted just a few… [+2607 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Jignesh Mevani's Second Case: Assault, Molestation Charges By Woman Cop", "description": "Gujarat's Independent MLA Jignesh Mevani has been accused of assault and molestation by a woman police constable who was part of the team that brought him from Guwahati airport to Kokrajhar.", "url": "https://www.ndtv.com/india-news/jignesh-mevanis-second-case-assault-molestation-charges-by-woman-cop-2920123", "urlToImage": "https://c.ndtvimg.com/2022-04/5t408jh_jignesh-mevani_625x300_24_April_22.jpg", "publishedAt": "2022-04-26T01:42:47Z", "content": "The case was filed at the Barpeta road police station on April 21\r\nKokrajhar: Gujarat's Independent MLA Jignesh Mevani has been accused of assault and molestation by a woman police constable who was … [+2054 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Says Ukraine Bombed Its Village, Injured Civilians", "description": "The governor of a Russian region bordering Ukraine on Monday accused Kyiv of bombing one of its villages, injuring two civilians and damaging several houses.", "url": "https://www.ndtv.com/world-news/russia-says-ukraine-bombed-its-village-injured-civilians-2920116", "urlToImage": "https://c.ndtvimg.com/2022-03/0iqsv944_ukraine-war-afp_625x300_26_March_22.jpg", "publishedAt": "2022-04-26T01:29:30Z", "content": "Earlier, Ukraine said that Russian forces had shot down its two drones on Monday.\r\nThe governor of a Russian region bordering Ukraine on Monday accused Kyiv of bombing one of its villages, injuring t… [+836 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Dollar Climbs To Near Two-Year Highs On Economic Growth Worries", "description": "The dollar climbed to around a two-year high against the euro and an 18-month high versus the pound as fears about the economic impact of China's COVID-19 lockdowns and an aggressive pace of U.S. rate hikes sent investors scrambling for safety.", "url": "https://www.ndtv.com/business/dollar-ascends-on-china-covid-fears-fed-rate-hike-pace-2920105", "urlToImage": "https://c.ndtvimg.com/2020-01/72ond4t8_dollar-reuters_625x300_20_January_20.jpg", "publishedAt": "2022-04-26T01:20:10Z", "content": "Dollar ascends on China COVID fears, Fed rate hike pace\r\nHONG KONG: The dollar climbed to around a two-year high against the euro and an 18-month high versus the pound as fears about the economic imp… [+2855 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sri Lanka Must Raise Rates, And Taxes To Sort Its Debt, Says IMF: Report", "description": "Sri Lanka must tighten monetary policy, raise tax and adopt flexible exchange rates to address its debt crisis, a senior International Monetary Fund (IMF) official said on Tuesday.", "url": "https://www.ndtv.com/business/imf-urges-sri-lanka-to-tighten-monetary-policy-raise-tax-to-address-debt-woes-2920091", "urlToImage": "https://c.ndtvimg.com/2022-03/ldaui2c4_sri-lanka-economic-crisis_625x300_31_March_22.jpg", "publishedAt": "2022-04-26T00:51:26Z", "content": "IMF urges Sri Lanka to tighten monetary policy, raise tax to address debt woes\r\nSri Lanka must tighten monetary policy, raise tax and adopt flexible exchange rates to address its debt crisis, a senio… [+1434 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Crude Prices Recover To Trade In A Narrow Range, After A Sharp Drop", "description": "Oil prices opened slightly higher on Tuesday, after falling sharply the prior session on worries that continued COVID-19 lockdowns in China would eat into demand and as the U.S. dollar rose to a two-year high.", "url": "https://www.ndtv.com/business/oil-prices-rebound-from-sharp-drop-on-china-demand-concerns-2920089", "urlToImage": "https://c.ndtvimg.com/2022-03/us4sio3g_crude-oil_625x300_02_March_22.jpg", "publishedAt": "2022-04-26T00:45:52Z", "content": "Oil prices rebound from sharp drop on China demand concerns\r\nOil prices opened slightly higher on Tuesday after falling sharply the prior session on worries that continued COVID: Oil prices opened sl… [+1311 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE: India Records 2,541 New Covid Cases In 24 Hours", "description": "India on Monday reported at least 2,541 new COVID-19 Cases, bringing the total number of coronavirus cases to 4,30,60,08. According to the Union Health Ministry, the active cases increased to 16,522,", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-april-26-2920088", "urlToImage": "https://c.ndtvimg.com/2022-01/fdhokfoo_-bengaluru-covid-testing-pti-650_650x400_03_January_22.jpg", "publishedAt": "2022-04-26T00:43:08Z", "content": "India COVID-19 Live: India saw 30 Covid-related deaths on Monday.\r\nNew Delhi: India on Monday reported at least 2,541 new COVID-19 Cases, bringing the total number of coronavirus cases to 4,30,60,08.… [+457 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rights Groups Raise Hate Speech Concerns After Elon Musk's Twitter Deal", "description": "Human rights groups raised concerns about hate speech on Twitter and the power that its takeover by Elon Musk would give the billionaire after the self-described \"free speech absolutist\" clinched a deal to take the social media platform private.", "url": "https://www.ndtv.com/world-news/human-rights-groups-raise-hate-speech-concerns-after-elon-musks-twitter-deal-2920073", "urlToImage": "https://c.ndtvimg.com/2022-04/ittfqdv_elon-musk-ted-talks-afp-650_625x300_15_April_22.jpg", "publishedAt": "2022-04-26T00:17:36Z", "content": "The White House also expressed concerns after Elon Musk Elon Musk's Twitter deal.\r\nWashington: Human rights groups on Monday raised concerns about hate speech on Twitter and the power that its takeov… [+2230 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Elon Musk: Tech Visionary Turns Social Media King", "description": "Sometimes it feels like it's Elon Musk's world and we just live in it. The endlessly innovative, endlessly eccentric billionaire has struck a deal to buy Twitter -- giving him control of the social media network on which the world debates, mobilizes", "url": "https://www.ndtv.com/world-news/elon-musk-tech-visionary-turns-social-media-king-2920062", "urlToImage": "https://c.ndtvimg.com/2022-03/9ckja9fg_elon-musk_625x300_05_March_22.jpg", "publishedAt": "2022-04-25T23:58:47Z", "content": "Forbes estimates Elon Musk's current net worth at $266 billion.\r\nSan Francisco: Sometimes it feels like it's Elon Musk's world and we just live in it.\r\nThe endlessly innovative, endlessly eccentric b… [+4640 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine Crisis: Russian Minister Says NATO Is In \"Proxy\" War With Moscow", "description": "Deliveries of Western weaponry to Ukraine mean that the NATO alliance is \"in essence engaged in war with Russia\" and Moscow views these weapons as legitimate targets, Russian Foreign Minister Sergei Lavrov said in an interview aired on Monday.", "url": "https://www.ndtv.com/world-news/ukraine-crisis-russian-foreign-minister-sergei-lavrov-says-nato-is-in-proxy-war-with-moscow-2920057", "urlToImage": "https://c.ndtvimg.com/2022-04/mfdercb_donetsk-ukraine-war-afp-650_625x300_15_April_22.jpg", "publishedAt": "2022-04-25T23:43:37Z", "content": "NATO is engaged in a war with Russia through a proxy, said Russian Foreign Minister Sergei Lavrov.\r\nMoscow: Deliveries of Western weaponry to Ukraine mean that the NATO alliance is \"in essence engage… [+714 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "White House Expresses Concerns After Elon Musk's Twitter Deal", "description": "The White House declined to comment on billionaire Elon Musk's deal on Monday to buy Twitter Inc, but said that President Joe Biden has long been concerned about the power of social media platforms.", "url": "https://www.ndtv.com/world-news/white-house-expresses-concerns-after-elon-musks-twitter-deal-2920056", "urlToImage": "https://c.ndtvimg.com/2022-04/feg10lkk_elon-musk-twitter-reuters-photo_625x300_16_April_22.jpg", "publishedAt": "2022-04-25T23:21:04Z", "content": "Billionaire Elon Musk has sealed his $44 billion acquisition of Twitter in less than two weeks.\r\nWashington: The White House declined to comment on billionaire Elon Musk's deal on Monday to buy Twitt… [+1123 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Twitter Is In \"Dark\" Over Future Under Elon Musk: Company CEO To Staff", "description": "Twitter Chief Executive Parag Agrawal told employees on Monday that the future of the social media firm is uncertain after the deal to be taken private under billionaire Elon Musk closes.", "url": "https://www.ndtv.com/world-news/twitter-is-in-dark-over-future-under-elon-musk-company-ceo-parag-agrawal-to-staff-2920055", "urlToImage": "https://c.ndtvimg.com/2021-11/ii6862r_parag-agrawal_625x300_29_November_21.jpg", "publishedAt": "2022-04-25T23:02:15Z", "content": "Elon Musk will join Twitter staff for a question-and-answer session, company told.\r\nNew York: Twitter Chief Executive Parag Agrawal told employees on Monday that the future of the social media firm i… [+461 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Finland, Sweden To Begin NATO Application In May: Reports", "description": "Finland and Sweden will together express their wish to join NATO in May, tabloid newspapers Iltalehti in Finland and Expressen in Sweden reported on Monday, citing sources close to the matter.", "url": "https://www.ndtv.com/world-news/finland-sweden-to-begin-nato-application-in-may-reports-2920046", "urlToImage": "https://c.ndtvimg.com/2019-11/t015ele8_nato-flags_625x300_27_November_19.jpg", "publishedAt": "2022-04-25T22:45:39Z", "content": "Earlier, Russia had warned Sweden and Finland against joining NATO membership. (Representative)\r\nHelsinki: Finland and Sweden will together express their wish to join NATO in May, tabloid newspapers … [+1814 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Massive Fire In Gurugram's Manesar, 35 Fire Tenders on Spot", "description": "A massive fire broke out in a pile of garbage in Manesar in Gurugram on late Monday night.", "url": "https://www.ndtv.com/india-news/massive-fire-in-gurugrams-manesar-35-fire-tenders-on-spot-2920045", "urlToImage": "https://c.ndtvimg.com/49tl1ulc_fire-generic_625x300_06_September_18.jpg", "publishedAt": "2022-04-25T22:13:29Z", "content": "The incident took place near sector-6 of Manesar area in Gurugram. (Representative)\r\nManesar: A massive fire broke out in a pile of garbage in Manesar in Gurugram on late Monday night.\r\nThe incident … [+493 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Twitter Users Greet The New Owner In His Own Language: Memes", "description": "The memes are rolling in now that it has been announced that Elon Musk will be buying Twitter.", "url": "https://www.ndtv.com/world-news/twitter-users-greet-the-new-owner-elon-musk-in-his-own-language-memes-2920030", "urlToImage": "https://c.ndtvimg.com/2022-04/jadtg2pg_elon-musk-bloomberg_625x300_15_April_22.jpg", "publishedAt": "2022-04-25T21:53:18Z", "content": "Twitter on Monday has agreed to a $44bn takeover offer from the billionaire Elon Musk.\r\nThe memes are rolling in now that it has been announced that Elon Musk will be buying Twitter.\r\n.@elonmusk let … [+3614 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russian Foreign Minister Warns Of \"Real\" Danger Of World War III", "description": "Russian Foreign Minister Sergei Lavrov said Monday that peace talks with Ukraine would continue, while warning there was a \"real\" danger of a World War III.", "url": "https://www.ndtv.com/world-news/ukraine-crisis-russian-foreign-minister-sergei-lavrov-warns-of-real-danger-of-world-war-iii-2920010", "urlToImage": "https://c.ndtvimg.com/2022-03/f2a0km0o_russia-foreign-minister-sergei-lavrovbloomberg-_625x300_31_March_22.jpg", "publishedAt": "2022-04-25T21:13:53Z", "content": "Ukraine crisis: \"The danger is real, you can't underestimate it,\" Lavrov said amid tension with Ukraine.\r\nMoscow: Russian Foreign Minister Sergei Lavrov said Monday that peace talks with Ukraine woul… [+1220 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Twitter CEO Set To Receive $42 Million If Terminated After Musk's Deal", "description": "Twitter Inc CEO Parag Agrawal would get an estimated $42 million if he were terminated within 12 months of a change in control at the social media company, according to research firm Equilar.", "url": "https://www.ndtv.com/world-news/twitter-ceo-parag-agrawal-set-to-receive-42-million-if-terminated-after-elon-musk-deal-2919993", "urlToImage": "https://c.ndtvimg.com/2021-11/sjhfnh4_parag-agrawal-afp_625x300_30_November_21.jpg", "publishedAt": "2022-04-25T20:37:56Z", "content": "Elon Musk Buys Twitter: Parag Agrawal was named CEO of Twitter last year November.\r\nNew York: Twitter Inc CEO Parag Agrawal would get an estimated $42 million if he were terminated within 12 months o… [+934 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Won't Return Even If Account Reinstated: Trump After Musk-Twitter Deal", "description": "Former U.S. President Donald Trump said on Monday that he will not return to social media platform Twitter even if his account is reinstated following the platform's purchase by billionaire Elon Musk.", "url": "https://www.ndtv.com/world-news/donald-trump-says-he-wont-return-to-twitter-if-account-reinstated-after-elon-musk-takeover-2919940", "urlToImage": "https://c.ndtvimg.com/2022-02/kr9u49fk_donald-trump-reuters_625x300_20_February_22.jpg", "publishedAt": "2022-04-25T19:57:51Z", "content": "\"I am not going on Twitter, I am going to stay on Truth,\" Donald Trump told.\r\nWashington: Former U.S. President Donald Trump said on Monday that he will not return to social media platform Twitter ev… [+533 chars]"}]}