{"status": "ok", "totalResults": 291, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Setback\": Amber Heard On What Defamation Ruling Means For Other Women", "description": "Actor Amber Heard said she was disappointed \"beyond words\" by the US jury's verdict in the defamation case her ex husband and actor Johnny Depp filed against her.", "url": "https://www.ndtv.com/world-news/setback-amber-heard-on-what-defamation-verdict-means-for-other-women-3030956", "urlToImage": "https://c.ndtvimg.com/2022-06/29bg858o_amber-heard_625x300_02_June_22.jpg", "publishedAt": "2022-06-02T02:06:49Z", "content": "\"The disappointment I feel today is beyond words,\" Amber Heard said in a statement.\r\nFairfax: Actor Amber Heard said she was disappointed \"beyond words\" by the US jury's verdict in the defamation cas… [+2562 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rahul Gandhi Abroad, Seeks Time To Appear In National Herald Case", "description": "A day after Sonia Gandhi and Rahul Gandhi were asked to appear before Enforcement Directorate for questioning in a money laundering case linked to National Herald newspaper, sources have now learned that Rahul Gandhi is currently on a foreign tour.", "url": "https://www.ndtv.com/india-news/rahul-gandhi-abroad-seeks-time-after-june-5-on-enforcement-directorate-notice-in-national-herald-case-3030940", "urlToImage": "https://c.ndtvimg.com/2019-08/1qv74k6c_rahul-gandhi-pti-_625x300_23_August_19.jpg", "publishedAt": "2022-06-02T02:05:03Z", "content": "Rahul Gandhi is expected to be back home by June 5, party sources said. (File)\r\nNew Delhi: A day after Congress president Sonia Gandhi and senior leader Rahul Gandhi were asked to appear before the E… [+2986 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rs 9,000 Per Month Salary Is \"Exploitation\", Court Tells Odisha To Reconsider Home Guards Wages", "description": "The Supreme Court has expressed displeasure over low salary of home guards in Odisha and directed the state government to reconsider its decision of paying Rs 9,000 per month.", "url": "https://www.ndtv.com/india-news/rs-9-000-per-month-salary-is-exploitation-court-tells-odisha-to-reconsider-home-guards-wages-3030950", "urlToImage": "https://c.ndtvimg.com/2022-02/a1ooga8_supreme-court-of-india_650x400_14_February_22.jpg", "publishedAt": "2022-06-02T01:49:16Z", "content": "Paying Rs 9,000 per month is nothing but an exploitation, Supreme Court said.\r\nNew Delhi: The Supreme Court has expressed displeasure over low salary of home guards in Odisha and directed the state g… [+1371 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "K Chandrashekhar Rao Greets People On Telangana Formation Day", "description": "On the eve of Telangana Formation Day, Telangana Chief Minister K Chandrashekhar Rao on Wednesday extended greetings to the people of Telangana.", "url": "https://www.ndtv.com/telangana-news/telangana-formation-day-telangana-chief-minister-k-chandrashekhar-rao-greets-people-on-telangana-formation-day-3030927", "urlToImage": "https://c.ndtvimg.com/2022-02/eri0ljug_-k-chandrashekhar-rao-ani-650-_650x400_02_February_22.jpg", "publishedAt": "2022-06-02T01:36:13Z", "content": "K Chandrashekhar Rao said it is a proud moment for every Telangana citizen.\r\nHyderabad (Telangana): On the eve of Telangana Formation Day, Telangana Chief Minister K Chandrashekhar Rao on Wednesday e… [+2078 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rajasthan Congress Leaders Resign In Compliance With One Party, One Post Decision", "description": "In compliance with the one person, one post decision taken during a Chintan Shivir last month, several Rajasthan Congress leaders resigned from party positions on Wednesday.", "url": "https://www.ndtv.com/india-news/rajasthan-congress-leaders-resign-in-compliance-with-one-party-one-post-decision-3030942", "urlToImage": "https://c.ndtvimg.com/2020-01/dqh52igg_congress-generic_625x300_21_January_20.jpg", "publishedAt": "2022-06-02T01:23:49Z", "content": "The resignations came amid a two-day party workshop that started on Wednesday. (Representational)\r\nJaipur: In compliance with the one person, one post decision taken during a Chintan Shivir last mont… [+718 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE: India Reports 2,745 New Covid Cases In 24 Hours", "description": "India recorded 2,745 new coronavirus infections in the last 24 hours, bringing the total number of COVID-19 cases to 4,31,60,832. The active cases also increased to 18,386, according to the Union Health Ministry data.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-2-june-3030910", "urlToImage": "https://c.ndtvimg.com/2022-04/iptdjlsg_coronavirus-india-pti-pic_650x400_20_April_22.jpg", "publishedAt": "2022-06-02T00:24:31Z", "content": "India COVID-19 Live: The country also reported 6 covid deaths in the last 24 hours.\r\nNew Delhi: India recorded 2,745 new coronavirus infections in the last 24 hours, bringing the total number of COVI… [+593 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "At Least 3 Killed In Shooting At Hospital Campus In US' Oklahoma: Police", "description": "At least three people were killed by a gunman at a hospital campus in Tulsa, Oklahoma, on Wednesday, police said, as Americans still grappled with grief and anger over the shooting at a Texas school just over a week ago.", "url": "https://www.ndtv.com/world-news/at-least-3-killed-in-shooting-at-hospital-campus-in-us-oklahoma-police-3030909", "urlToImage": "https://c.ndtvimg.com/2018-09/hms9qqjc_us-police-generic_625x300_14_September_18.jpg", "publishedAt": "2022-06-02T00:11:45Z", "content": "Oklahoma Shooting: Police said the gunman also killed in the incident. (Representational)\r\nWashington: At least three people were killed by a gunman at a hospital campus in Tulsa, Oklahoma, on Wednes… [+2198 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Fake Case\": AAP's Sanjay Singh Slams BJP Over Satyendra Jain's Arrest", "description": "Aam Aadmi Party MP Sanjay Singh on Wednesday slammed Bharatiya Janata Party for the arrest of Delhi Health Minister Satyendra Jain by ED in a money laundering case and said it was a \"false, baseless case.\"", "url": "https://www.ndtv.com/india-news/fake-case-aaps-sanjay-singh-slams-bjp-over-minister-satyendra-jains-arrest-3030900", "urlToImage": "https://c.ndtvimg.com/2020-09/vd9grjfc_aap-leader-sanjay-singh-pti_625x300_19_September_20.jpg", "publishedAt": "2022-06-01T23:45:52Z", "content": "The AAP MP expressed confidence that Satyendra Jain will come out of the case.\r\nNew Delhi: Aam Aadmi Party MP Sanjay Singh on Wednesday slammed Bharatiya Janata Party for the arrest of Delhi Health M… [+2595 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Biden To Meet NATO Chief At White House Today Amid Ukraine War", "description": "U.S. President Joe Biden and his national security adviser, Jake Sullivan,will meet with NATO Secretary-General Jens Stoltenberg at the White House on Thursday, White House press secretary Karine Jean-Pierre said.", "url": "https://www.ndtv.com/world-news/biden-to-meet-nato-chief-jens-stoltenberg-at-white-house-today-amid-ukraine-war-3030889", "urlToImage": "https://c.ndtvimg.com/2022-06/if4b5gp_biden-nato-chief_625x300_02_June_22.jpg", "publishedAt": "2022-06-01T23:19:45Z", "content": "NATO chief Jens Stoltenberg will meet Biden today as Russia intensifies attack on Ukraine.\r\nWashington: U.S. President Joe Biden and his national security adviser, Jake Sullivan,will meet with NATO S… [+532 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Unjustifiable\": Football Legend Pele Tells Putin To Stop Ukraine War", "description": "Brazilian soccer legend Pele made a public plea on Wednesday to Russian President Vladimir Putin to end his \"wicked\" and \"unjustifiable\" invasion of Ukraine, minutes before Ukraine's national team played in a World Cup qualifying game.", "url": "https://www.ndtv.com/world-news/football-legend-pele-tells-russia-president-vladimir-putin-to-stop-ukraine-war-3030884", "urlToImage": "https://c.ndtvimg.com/2021-09/9c48f9b8_pele-afp_625x300_18_September_21.jpg", "publishedAt": "2022-06-01T22:52:22Z", "content": "The Ukraine conflict brings nothing but pain, fear, terror and anguish, Pele said.\r\nSao Paulo: Brazilian soccer legend Pele made a public plea on Wednesday to Russian President Vladimir Putin to end … [+1151 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Covid Situation \"Getting Worse, Not Better\" In North Korea, Says WHO", "description": "The World Health Organization lamented Wednesday that it had no access to data about North Korea's Covid-19 outbreak, but assumed the crisis was deepening, contrary to Pyongyang's reports of \"progress\".", "url": "https://www.ndtv.com/world-news/covid-situation-getting-worse-not-better-in-north-korea-says-who-3030879", "urlToImage": "https://c.ndtvimg.com/2022-05/qk4qiqe_north-korea-covid_625x300_13_May_22.jpg", "publishedAt": "2022-06-01T22:33:15Z", "content": "North Korea says a total of 3.8 million Covid cases reported since late April.\r\nGeneva: The World Health Organization lamented Wednesday that it had no access to data about North Korea's Covid-19 out… [+2778 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Intensifies Attack In East As US Boosts Weapons To Ukraine", "description": "Russian forces edged closer Wednesday to taking the key eastern Ukraine city of Severodonetsk but Kyiv's hopes of holding off their invaders were boosted by a US pledge of more advanced rocket systems to help their defence.", "url": "https://www.ndtv.com/world-news/russia-intensifies-attack-in-east-as-us-boosts-weapons-to-ukraine-3030874", "urlToImage": "https://c.ndtvimg.com/2022-05/6boe0isg_severodonetsk-russia-ukraine-war-afp_625x300_19_May_22.jpg", "publishedAt": "2022-06-01T22:13:28Z", "content": "Ukraine War: Biden confirmed that longer-range weapons will send to Ukraine to hit Russian targets.\r\nSoledar, Ukraine: Russian forces edged closer Wednesday to taking the key eastern Ukraine city of … [+5950 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine Losing Up To 100 Soldiers Everyday In War Against Russia: Zelensky", "description": "Between 60 and 100 Ukrainian soldiers are dying on the battlefield every day, and another 500 wounded, Ukraine's President Volodymyr Zelensky told US newsgroup Newsmax in an interview released Wednesday.", "url": "https://www.ndtv.com/world-news/ukraine-losing-up-to-100-soldiers-everyday-in-war-against-russia-volodymyr-zelensky-3030870", "urlToImage": "https://c.ndtvimg.com/2022-05/fc0jpgg_russia-ukraine-war-afp_625x300_31_May_22.jpg", "publishedAt": "2022-06-01T22:01:51Z", "content": "Ukraine War: \"The situation in the east is very difficult,\" Zelensky said in his statement.\r\nKyiv: Between 60 and 100 Ukrainian soldiers are dying on the battlefield every day, and another 500 wounde… [+1104 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Denmark Votes 'Yes' To Joining EU Defence Policy Amid Ukraine Tensions", "description": "An overwhelming majority of Danes, almost 67 percent, voted Wednesday in favour of joining the EU's common defence policy 30 years after opting out, results showed with 99 percent of ballots counted.", "url": "https://www.ndtv.com/world-news/denmark-votes-yes-to-joining-eu-joint-defence-policy-amid-ukraine-war-3030861", "urlToImage": "https://c.ndtvimg.com/2022-06/sjfaijro_denmark-joins-eu-defence-_625x300_02_June_22.jpg", "publishedAt": "2022-06-01T21:39:54Z", "content": "Expert believe that Ukraine was the major reason for calling the referendum to join EU defence policy.\r\nCopenhagen: An overwhelming majority of Danes, almost 67 percent, voted Wednesday in favour of … [+4150 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Jury Hears US Comedian Bill Cosby Sexual Assault Claims", "description": "Bill Cosby faced sexual assault allegations at a new civil trial in California Wednesday, where opening statements began to address an alleged attack on a teenage girl at the Playboy Mansion almost 50 years ago.", "url": "https://www.ndtv.com/world-news/jury-hears-us-comedian-bill-cosby-sexual-assault-claims-3030849", "urlToImage": "https://c.ndtvimg.com/2019-06/58qvhhv8_bill-cosby-reuters_625x300_17_June_19.jpg", "publishedAt": "2022-06-01T21:16:46Z", "content": "Bill Cosby civil trial: Judy Huth alleges actor molested her as a teenager at Playboy Mansion.\r\nSanta Monica, United States: Bill Cosby faced sexual assault allegations at a new civil trial in Califo… [+2910 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Jury Gave Me My Life Back\": Johnny Depp After Defamation Verdict", "description": "Johnny Depp on Wednesday welcomed the verdict from a six-week defamation case over bitterly contested allegations of domestic abuse between him and his ex-wide Amber Heard.", "url": "https://www.ndtv.com/world-news/jury-gave-me-my-life-back-johnny-depp-after-defamation-verdict-3030841", "urlToImage": "https://c.ndtvimg.com/2022-06/6dkqkfdg_johnny-depp_625x300_02_June_22.jpg", "publishedAt": "2022-06-01T20:45:49Z", "content": "\"From the very beginning, the goal of bringing this case was to reveal the truth,\" Johnny Depp said.\r\nWashington: Johnny Depp on Wednesday welcomed the verdict from a six-week defamation case over bi… [+479 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Facebook Key Executive Sheryl Sandberg Says Leaving Company", "description": "Meta's second most powerful executive Sheryl Sandberg said Wednesday that she will leave the tech giant, 14 years after being hired by Facebook co-founder Mark Zuckerberg.", "url": "https://www.ndtv.com/world-news/facebook-key-executive-sheryl-sandberg-says-leaving-company-3030805", "urlToImage": "https://c.ndtvimg.com/2020-03/me9bmuko_facebook-coo-sheryl-sandberg-_625x300_18_March_20.jpg", "publishedAt": "2022-06-01T20:10:57Z", "content": "Meta's chief operating officer Sheryl Sandberg said she is stepping down.\r\nSan Francisco: Meta's second most powerful executive Sheryl Sandberg said Wednesday that she will leave the tech giant, 14 y… [+312 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Jury Finds Johnny Depp, Amber Heard Both Liable For Defamation", "description": "A US jury on Wednesday found both Johnny Depp and his ex-wife Amber Heard liable for defamation following an intense trial riding on bitterly contested allegations of domestic abuse.", "url": "https://www.ndtv.com/world-news/jury-finds-johnny-depp-amber-heard-both-liable-for-defamation-3030801", "urlToImage": "https://c.ndtvimg.com/2022-06/vo0lansg_johnny-depp-amber-heard_625x300_02_June_22.jpg", "publishedAt": "2022-06-01T20:04:17Z", "content": "The jury also awarded Johnny Depp $15 million in damages and Heard $2 million.\r\nWashington: A US jury on Wednesday found both Johnny Depp and his ex-wife Amber Heard liable for defamation following a… [+570 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Amber Heard Disappointed \"Beyond Words\" After Defamation Verdict", "description": "US actress Amber Heard said she was disappointed \"beyond words\" Wednesday after a jury found she had made defamatory claims of abuse against her ex-husband Johnny Depp, calling it a \"setback\" for women.", "url": "https://www.ndtv.com/world-news/amber-heard-disappointed-beyond-words-after-defamation-verdict-3030791", "urlToImage": "https://c.ndtvimg.com/2022-05/j0sg3jtk_amber-heard-afp_625x300_05_May_22.jpg", "publishedAt": "2022-06-01T19:51:26Z", "content": "\"I'm even more disappointed with what this verdict means for other women,\" Amber Heard said.\r\nWashington: US actress Amber Heard said she was disappointed \"beyond words\" Wednesday after a jury found … [+686 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Liquor Shops Around Shri Krishna Janmabhoomi Banned In UP's Mathura", "description": "The sale of liquor and cannabis in shops falling within a 10km radius of Shri Krishna Janmbhoomi here has been banned, officials said on Wednesday.", "url": "https://www.ndtv.com/india-news/liquor-shops-around-shri-krishna-janmabhoomi-banned-in-ups-mathura-3030762", "urlToImage": "https://c.ndtvimg.com/2022-05/nn1m4r7o_krishna-janmabhoomi-shahi-idgah-mosque-case-mathura-pti_625x300_07_May_22.jpg", "publishedAt": "2022-06-01T19:25:55Z", "content": "The action was taken after the excise department received a government order.\r\nMathura (Uttar Pradesh): The sale of liquor and cannabis in shops falling within a 10km radius of Shri Krishna Janmabhoo… [+1419 chars]"}]}