{"status": "ok", "totalResults": 589, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Social Media Team Of Imran Khan's Party Arrested For Criticising Army Chief", "description": "Eight social media activists of Imran Khan's Pakistan Tehreek-i-Insaf have been arrested for allegedly running a vilification campaign against Pakistan Army Chief Gen Qamar Javed Bajwa.", "url": "https://www.ndtv.com/world-news/social-media-team-of-imran-khans-party-arrested-for-criticising-pak-army-chief-gen-qamar-javed-bajwa-2883710", "urlToImage": "https://i.ndtvimg.com/i/2017-07/qamar-javed-bajwa_650x400_41501019584.jpg", "publishedAt": "2022-04-13T02:08:20Z", "content": "Many people believe that Army chief and top court's judges were responsible for ouster of Khan.\r\nIslamabad:  Eight social media activists of Imran Khan's Pakistan Tehreek-i-Insaf have been arrested f… [+2081 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "62-Year-Old \"Person Of Interest\" In New York Shooting: 10 Developments", "description": "New York Police have launched a manhunt for a \"person of interest\" in the Brooklyn shooting incident that left over 20 people injured. It is not yet certain if he was the attacker, they said.", "url": "https://www.ndtv.com/world-news/62-year-old-person-of-interest-in-new-york-shooting-10-developments-2883689", "urlToImage": "https://c.ndtvimg.com/2022-04/5p4ci2m_us-shooting_625x300_13_April_22.jpg", "publishedAt": "2022-04-13T01:26:42Z", "content": "<li>Frank R James, 62, was named a \"person of interest\" in the shooting incident. He was wearing a neon-orange vest and a grey-coloured sweatshirt and had rented a van, keys to which were found at th… [+1944 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus Live: India Reports 796 COVID-19 Cases, 19 Deaths In 24 Hours", "description": "India recorded a total of 796 new COVID-19 cases in the last 24 hours, taking the coronavirus tally to 4,30,36,928. The country also reported at least 19 Covid-related deaths, bringing the total number of fatalities to 5,21,710.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-13-april-2022-2883665", "urlToImage": "https://c.ndtvimg.com/2021-11/iulm91gs_covid-testing_625x300_11_November_21.jpg", "publishedAt": "2022-04-13T00:50:40Z", "content": "India COVID-19 Live: A reduction of 74 cases was recorded in the active caseload in a span of 24 hours.\r\nNew Delhi: India recorded a total of 796 new COVID-19 cases in the last 24 hours, taking the c… [+779 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Massive Manhunt Underway For Suspect Who Opened Fire At Brooklyn Station", "description": "A massive manhunt was underway Tuesday in New York for a man who shot 10 people on a packed subway train, donning a gas mask before setting off two smoke bombs and opening fire on terrified commuters.", "url": "https://www.ndtv.com/world-news/massive-manhunt-underway-for-suspect-who-opened-fire-at-new-yorks-brooklyn-subway-station-2883658", "urlToImage": "https://c.ndtvimg.com/2022-04/sdg9eueg_brooklyn-shooting-police-afp_625x300_12_April_22.jpg", "publishedAt": "2022-04-13T00:25:06Z", "content": "Brooklyn Shooting: Police said the incident was not being investigated as an act of terrorism.\r\nBrooklyn, New York: A massive manhunt was underway Tuesday in New York for a man who shot 10 people on … [+4920 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine's Zelensky Mocks Putin For Saying War Is Going To \"Plan\"", "description": "Ukrainian President Volodymyr Zelenskiy on Wednesday mocked Moscow's insistence that the war against his nation was going well, asking how President Vladimir Putin could have approved a plan that involved so many Russians dying.", "url": "https://www.ndtv.com/world-news/ukraine-president-volodymyr-zelensky-mocks-russian-president-vladimir-putin-for-saying-war-is-going-to-plan-against-ukraine-2883645", "urlToImage": "https://c.ndtvimg.com/2022-02/3n4vdap8_ukraine-president-volodymyr-zelenskyy-afp_625x300_25_February_22.jpg", "publishedAt": "2022-04-13T00:04:46Z", "content": "Ukraine claims that more than 20,000 Russian soldiers killed since war began.\r\nKyiv: Ukrainian President Volodymyr Zelenskiy on Wednesday mocked Moscow's insistence that the war against his nation wa… [+1724 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Return Our Prisoners If You Want Your Top Ally Back: Zelensky To Russia", "description": "Ukraine told Russia to release prisoners of war if it wants the Kremlin's most high-profile ally in the country freed as the United States is expected to send more weapons after Russia's strongest signal yet the war will grind on.", "url": "https://www.ndtv.com/world-news/return-our-prisoners-if-you-want-your-top-ally-viktor-medvedchuk-back-ukraine-president-volodymyr-zelensky-to-russia-2883632", "urlToImage": "https://c.ndtvimg.com/2022-03/40akrt6o_ukraine-president-zelensky-afp-650_625x300_01_March_22.jpg", "publishedAt": "2022-04-12T23:33:33Z", "content": "Ukraine announced on Tuesday that Putin's top ally fugitive Viktor Medvedchuk arrested.\r\nKyiv: Ukraine told Russia to release prisoners of war if it wants the Kremlin's most high-profile ally in the … [+5309 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Elon Musk Sued Over Delay In Disclosing Twitter Stake", "description": "Elon Musk was sued on Tuesday by former Twitter Inc shareholders who claim they missed out on the recent run-up in its stock price because he waited too long to disclose a 9.2% stake in the social media company.", "url": "https://www.ndtv.com/world-news/elon-musk-sued-over-delay-in-disclosing-twitter-stake-2883620", "urlToImage": "https://c.ndtvimg.com/2022-03/s2ku2tf8_elon-musk-reuters_625x300_25_March_22.jpg", "publishedAt": "2022-04-12T23:11:00Z", "content": "The lawsuit seeks unspecified compensatory and punitive damages.\r\nNew York: Elon Musk was sued on Tuesday by former Twitter Inc shareholders who claim they missed out on the recent run-up in its stoc… [+1851 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Can't Say For Sure If Russia Used Chemical Weapons: Ukraine's Zelensky", "description": "Ukrainian President Volodymyr Zelenskiy on Wednesday said it was not possible to draw 100% firm conclusions about whether Russian forces had used chemical weapons in Mariupol, noting it was not possible to conduct a proper probe in the besieged city.", "url": "https://www.ndtv.com/world-news/cant-say-for-sure-if-russia-used-chemical-weapons-ukraine-president-volodymyr-zelensky-2883610", "urlToImage": "https://c.ndtvimg.com/2022-04/o6tn4et4_ukrainian-president-volodymyr-zelensky_625x300_02_April_22.jpg", "publishedAt": "2022-04-12T22:49:37Z", "content": "Earlier, US claimed that it has \"credible evidence\" of Russian \"chemical weapons\" in Ukraine.\r\nLviv: Ukrainian President Volodymyr Zelenskiy on Wednesday said it was not possible to draw 100% firm co… [+411 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Odisha Man Gets 10 Years In Jail For Raping Minor", "description": "A local court on Tuesday awarded 10 years' rigorous imprisonment (RI) to a man after finding him guilty of raping a minor girl some eight years ago.", "url": "https://www.ndtv.com/india-news/odisha-man-gets-10-years-in-jail-for-raping-minor-girl-2883597", "urlToImage": "https://i.ndtvimg.com/i/2017-12/justice-generic-court-generic_650x400_61513069872.jpg", "publishedAt": "2022-04-12T22:34:54Z", "content": "The court also slapped a fine of Rs 9,000 on the convict. (Representational)\r\nBaripada, Odisha: A local court on Tuesday awarded 10 years' rigorous imprisonment (RI) to a man after finding him guilty… [+851 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Says Russia May Use \"Chemical Agents\" In Ukraine", "description": "The United States has \"credible information\" that Russia \"may use... chemical agents\" in its offensive to take the besieged Ukrainian city of Mariupol, US Secretary of State Antony Blinken said Tuesday.", "url": "https://www.ndtv.com/world-news/has-credible-information-us-says-russia-may-use-chemical-agents-in-ukraine-2883588", "urlToImage": "https://c.ndtvimg.com/2022-03/a3lqejes_ukraine-afp_625x300_29_March_22.jpg", "publishedAt": "2022-04-12T22:11:46Z", "content": "The force claimed people were experiencing respiratory failure and neurological problems.\r\nWashington: The United States has \"credible information\" that Russia \"may use... chemical agents\" in its off… [+1615 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UK Opposition Party Demands Boris Johnson's Resignation Over 'Partygate'", "description": "British Prime Minister Boris Johnson and finance minister Rishi Sunak should resign after police told them they would be fined for COVID-19 breaches at gatherings in Downing Street, opposition Labour Party leader Keir Starmer said on Tuesday.", "url": "https://www.ndtv.com/world-news/uk-opposition-party-demands-boris-johnsons-resignation-over-partygate-2883579", "urlToImage": "https://c.ndtvimg.com/2021-11/e2lfuai4_boris-johnson-reuters_625x300_22_November_21.jpg", "publishedAt": "2022-04-12T21:54:41Z", "content": "\"The Conservatives are totally unfit to govern. Britain deserves better,\" the opposition leader said.\r\nLondon: British Prime Minister Boris Johnson and finance minister Rishi Sunak should resign afte… [+490 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US To Announce $750 Million More Military Aid To Ukraine Amid War", "description": "U.S. President Joe Biden's administration is expected to announce as soon as Wednesday another $750 million in military assistance for Ukraine for its fight against Russian forces, two U.S. officials familiar with the matter told Reuters.", "url": "https://www.ndtv.com/world-news/us-to-announce-750-million-more-military-aid-to-ukraine-to-fight-against-russia-2883572", "urlToImage": "https://c.ndtvimg.com/2022-02/3f3rjmt8_ukraine-army-afp-650_625x300_26_February_22.jpg", "publishedAt": "2022-04-12T21:37:14Z", "content": "One of the officials said final determinations were still being made about the mix of equipment.\r\nWashington: U.S. President Joe Biden's administration is expected to announce as soon as Wednesday an… [+733 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Biden Accuses Putin Of \"Genocide\" in Ukraine", "description": "US President Joe Biden appeared to accuse Russian leader Vladimir Putin of genocide on Tuesday during a speech about gasoline prices.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-us-president-joe-biden-accuses-vladimir-putin-of-genocide-in-ukraine-2883562", "urlToImage": "https://c.ndtvimg.com/2022-03/utvlj49k_-joe-biden-state-of-union_625x300_02_March_22.jpg", "publishedAt": "2022-04-12T21:22:43Z", "content": "Earlier, Biden had said that this guy (Putin) is brutal and what's happening in Bucha is outrageous.\r\nWashington: US President Joe Biden appeared to accuse Russian leader Vladimir Putin of genocide o… [+1218 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russia Closes On Mariupol As US Warns Of Chemical Threat", "description": "Russian troops intensified their campaign to take the port city of Mariupol on Tuesday as part of an anticipated massive onslaught across eastern Ukraine that the United States warned might include the use of chemical weapons.", "url": "https://www.ndtv.com/world-news/russia-closes-on-mariupol-as-us-warns-of-chemical-threat-2883557", "urlToImage": "https://c.ndtvimg.com/2022-04/rsij7lvo_mariupol-ukraine-war-reuters-650_625x300_11_April_22.jpg", "publishedAt": "2022-04-12T21:10:28Z", "content": "More than 4.6 million Ukrainian refugees have now fled the country, the UN refugee agency said.\r\nKramatorsk, Ukraine: Russian troops intensified their campaign to take the port city of Mariupol on Tu… [+5677 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "YouTube Down For Thousands Of Users: Report", "description": "Alphabet Inc's YouTube was down for thousands of users on Tuesday, according to outage tracking website Downdetector.com.", "url": "https://www.ndtv.com/world-news/youtube-down-for-thousands-of-users-report-2883547", "urlToImage": "https://c.ndtvimg.com/2021-09/0o8jdg68_youtube-generic_625x300_27_September_21.jpg", "publishedAt": "2022-04-12T20:40:55Z", "content": "Users also reported issues with accessing live television platform YouTube TV.\r\nSan Bruno, California: Alphabet Inc's YouTube was down for thousands of users on Tuesday, according to outage tracking … [+494 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UP Rape Convict Who Jumped Parole Arrested After 33 Years From Delhi", "description": "A rape convict from Uttar Pradesh's Hathras district who had jumped parole has been arrested after 33 years from Delhi, where he was living under a fake identity, police said on Tuesday.", "url": "https://www.ndtv.com/india-news/up-rape-convict-who-jumped-parole-arrested-after-33-years-from-delhi-2883513", "urlToImage": "https://c.ndtvimg.com/s8b97mrg_up-police-generic-twitter-650_625x300_28_August_18.jpg", "publishedAt": "2022-04-12T20:23:58Z", "content": "In 1986, the FIR in the rape case was lodged against him. (Representational)\r\nNoida: A rape convict from Uttar Pradesh's Hathras district who had jumped parole has been arrested after 33 years from D… [+2274 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Netherlands Targets 20 Yachts Over Ukraine War Sanctions", "description": "Dutch customs authorities said Tuesday they had impounded a total of 20 yachts at shipyards in the Netherlands targeted by sanctions against Russia and Belarus over the Ukraine conflict.", "url": "https://www.ndtv.com/world-news/netherlands-targets-20-yachts-over-ukraine-war-sanctions-2883505", "urlToImage": "https://c.ndtvimg.com/2022-04/1mnsct3s_-russia-ukraine-war_625x300_12_April_22.jpg", "publishedAt": "2022-04-12T20:10:32Z", "content": "Dutch customs authorities said Wednesday they had detained 14 yachts built for \"Russian beneficiaries\".\r\nThe Hague, Netherlands: Dutch customs authorities said Tuesday they had impounded a total of 2… [+1136 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Civilians Escape East Ukraine Cities As Russian Attacks Intensify", "description": "By bus and train, residents keep streaming out of east Ukraine's Kramatorsk and Sloviansk as fears grow the cities will be key targets of a major new Russian offensive.", "url": "https://www.ndtv.com/world-news/civilians-escape-east-ukraine-cities-as-russian-attacks-intensify-2883499", "urlToImage": "https://c.ndtvimg.com/2022-03/rjck5pv8_ukraine-refugees-reuters_625x300_01_March_22.jpg", "publishedAt": "2022-04-12T20:01:43Z", "content": "On Sunday, 2,700 people were evacuated, and 1,100 on Monday, according to officials. (File)\r\nSloviansk, Ukraine: By bus and train, residents keep streaming out of east Ukraine's Kramatorsk and Slovia… [+4490 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine Captures Top Putin Ally Viktor Medvedchuk", "description": "Ukrainian authorities on Tuesday announced they had captured a prominent pro-Kremlin tycoon who escaped from house arrest after Russia's invasion.", "url": "https://www.ndtv.com/world-news/ukraine-captures-key-fugitive-vladimir-putin-ally-viktor-medvedchuk-2883492", "urlToImage": "https://c.ndtvimg.com/2022-04/d9s9ndqo_viktor-medvedchuk_625x300_13_April_22.jpg", "publishedAt": "2022-04-12T19:47:39Z", "content": "Medvedchuk is a hugely controversial figure for his close ties to Moscow.\r\nKyiv: Ukrainian authorities on Tuesday announced they had captured a prominent pro-Kremlin tycoon who escaped from house arr… [+1774 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Chemical Weapons Watchdog \"Concerned\" By Ukraine's Mariupol Reports", "description": "The world's chemical weapons watchdog said on Tuesday that it was \"concerned\" over reports of the use of chemical weapons in the besieged Ukrainian port of Mariupol.", "url": "https://www.ndtv.com/world-news/chemical-weapons-watchdog-concerned-by-ukraines-mariupol-reports-2883471", "urlToImage": "https://c.ndtvimg.com/2022-03/ejjfvb0g_russia-ukraine-war-mariupol-attack_625x300_14_March_22.jpeg", "publishedAt": "2022-04-12T19:18:40Z", "content": "All 193 OPCW Member States, Including Russia, are parties to the Chemical Weapons Convention.\r\nThe Hague, Netherlands: The world's chemical weapons watchdog said on Tuesday that it was \"concerned\" ov… [+1692 chars]"}]}