{"status": "ok", "totalResults": 286, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Canada Is Lifting Covid Vaccine Mandate For Domestic, Overseas Travel", "description": "Canada's Covid-19 vaccination requirement for domestic and outbound travelers, as well as federal bureaucrats and transportation workers, will be suspended starting next week, officials said Tuesday.", "url": "https://www.ndtv.com/world-news/canada-is-lifting-covid-vaccine-mandate-for-domestic-overseas-travel-3067883", "urlToImage": "https://c.ndtvimg.com/2020-04/3lp335v_canada-coronavirus-afp_625x300_01_April_20.jpg", "publishedAt": "2022-06-14T22:34:57Z", "content": "The mandatory vaccine policy for travellers was rolled out last October in Canada. (File)\r\nOttawa: Canada's Covid-19 vaccination requirement for domestic and outbound travelers, as well as federal bu… [+2071 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Gujarat: AAP To Launch Agitation Demanding Free Electricity From Today", "description": "The Aam Aadmi Party (AAP) will launch a state-wide campaign demanding free electricity for people in Gujarat from Wednesday, a party leader said here.", "url": "https://www.ndtv.com/india-news/gujarat-aap-to-launch-agitation-demanding-free-electricity-from-today-3067878", "urlToImage": "https://c.ndtvimg.com/2022-05/p2qsq4ok_aap-flags-650_625x300_02_May_22.jpg", "publishedAt": "2022-06-14T22:12:11Z", "content": "AAP will organise protests demanding free electricity ahead of Gujarat assembly polls. (Representational)\r\nAhmedabad: The Aam Aadmi Party (AAP) will launch a state-wide campaign demanding free electr… [+1017 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Political Vendetta\": MK Stalin Slams Probe Agency Action Against Gandhis", "description": "Tamil Nadu CM M K Stalin on Tuesday lashed out at the Enforcement Directorate action against Congress leaders Sonia Gandhi and Rahul Gandhi and dubbed it as an \"outrageous act of political vendetta\" against the national party by the ruling BJP.", "url": "https://www.ndtv.com/india-news/political-vendetta-tamil-nadu-chief-minister-mk-stalin-slams-ed-action-against-rahul-gandhi-sonia-gandhi-3067873", "urlToImage": "https://c.ndtvimg.com/2020-11/52dcnqh_mk-stalin-650_625x300_15_November_20.jpg", "publishedAt": "2022-06-14T21:55:11Z", "content": "Tamil Nadu CM MK Stalin said the political opponents should be fought politically.\r\nChennai: Tamil Nadu Chief Minister and DMK President M K Stalin on Tuesday lashed out at the Enforcement Directorat… [+1366 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "2 Lashkar Terrorists Killed In Shopian Encounter In Jammu And Kashmir", "description": "Two terrorists linked with proscribed terror outfit Lashkar-e-Taiba killed in Shopian encounter on Tuesday, said the Kashmir zone police.", "url": "https://www.ndtv.com/india-news/2-lashkar-terrorists-killed-in-shopian-encounter-in-jammu-and-kashmir-3067857", "urlToImage": "https://c.ndtvimg.com/2021-04/uocrshfo_shopian-encounter_625x300_09_April_21.jpg", "publishedAt": "2022-06-14T20:51:35Z", "content": "Jammu and Kashmir police and security forces had been jointly conducting the operation.(Representational)\r\nShopian: Two terrorists linked with proscribed terror outfit Lashkar-e-Taiba killed in Shopi… [+1039 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "China's Attack Would Hit Global Trade More Than Ukraine War: Taiwan", "description": "Any Chinese military attack on Taiwan would have a greater impact on global trade flows than the Ukraine war, Taipei's top trade negotiator told Reuters on Tuesday, saying it would lead to a shortage of semiconductor chips.", "url": "https://www.ndtv.com/world-news/chinas-attack-would-hit-global-trade-more-than-ukraine-war-taiwan-3067851", "urlToImage": "https://c.ndtvimg.com/2022-06/o36b5u7_china-taiwan_625x300_12_June_22.jpg", "publishedAt": "2022-06-14T20:34:40Z", "content": "Taiwan said that there would be a worldwide shortage of supply if China attacked.\r\nGeneva:  Any Chinese military attack on Taiwan would have a greater impact on global trade flows than the Ukraine wa… [+2465 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Tihar Jail Authorities To Deploy Dog Squad To Curb Drug Smuggling", "description": "In view of a rise in smuggling of drugs into the high-security Tihar jail in Delhi, the prison authorities plan to deploy a dog squad to curb the menace.", "url": "https://www.ndtv.com/india-news/tihar-jail-authorities-to-deploy-dog-squad-to-curb-drug-smuggling-3067805", "urlToImage": "https://c.ndtvimg.com/2020-01/f7au5fj_tihar-jail_625x300_13_January_20.jpg", "publishedAt": "2022-06-14T20:20:23Z", "content": "The Tihar jail is planning to deploy a dog squad to curb the menace in prison. (File)\r\nNew Delhi: In view of a rise in smuggling of drugs into the high-security Tihar jail in Delhi, the prison author… [+2166 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Jailed Putin Critic Navalny Transferred to \"Strict-Regime\" Penal Colony: Report", "description": "Jailed Kremlin critic Alexei Navalny has been transferred to a strict-regime penal colony, his allies said on Tuesday, expressing concern about his safety.", "url": "https://www.ndtv.com/world-news/jailed-valdimir-putin-critic-alexei-navalny-transferred-to-strict-regime-penal-colony-3067767", "urlToImage": "https://c.ndtvimg.com/2021-04/uqp2dhpk_alexei-navalny-reuters_625x300_17_April_21.jpeg", "publishedAt": "2022-06-14T19:44:34Z", "content": "Navalny was arrested last year on his return from treatment in Germany. (File)\r\nMoscow: Jailed Kremlin critic Alexei Navalny has been transferred to a strict-regime penal colony, his allies said on T… [+2447 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Chhattisgarh: Boy, 11, Rescued From Borewell After 104 Hours", "description": "Rahul Sahu, an 11-year-old boy who had fallen into a borewell in Chhattisgarh's Janjgir Champa district, was rescued after a 104-hour-long operation on Tuesday night, officials said.", "url": "https://www.ndtv.com/india-news/chhattisgarh-boy-rahul-sahu-11-rescued-from-borewell-after-104-hours-3067754", "urlToImage": "https://c.ndtvimg.com/2020-04/pi1ri3i4_well-generic-istock_625x300_21_April_20.jpg", "publishedAt": "2022-06-14T19:27:27Z", "content": "The massive rescue operation was underway to rescue Rahul Sahu since Friday. (Representational)\r\nJanjgir Champa, Chhattisgarh: Rahul Sahu, an 11-year-old boy who had fallen into a borewell in Chhatti… [+1311 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "CBI Court Orders Release Of Lalu Yadav's Passport For Renewal", "description": "A special CBI court Tuesday ordered the release of RJD supremo Lalu Prasad's passport for renewal, his counsel said.", "url": "https://www.ndtv.com/india-news/special-cbi-court-orders-release-of-lalu-prasad-yadavs-passport-for-renewal-3067721", "urlToImage": "https://c.ndtvimg.com/2021-10/1jelobi8_lalu-prasad_625x300_24_October_21.jpg", "publishedAt": "2022-06-14T18:52:50Z", "content": "On April 22 Lalu Yadav was granted bail by the Jharkhand High Court in the Doranda treasury case. (File)\r\nRanchi: A special CBI court Tuesday ordered the release of RJD supremo Lalu Prasad's passport… [+965 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Mobile Phones Won't Be Allowed In Schools, Says Tamil Nadu Minister", "description": "Tamil Nadu School Education Minister Anbil Mahesh Poyyamozhi on Tuesday warned students against carrying mobile phones to classes and said the gadgets, if brought, would be confiscated.", "url": "https://www.ndtv.com/india-news/mobile-phones-wont-be-allowed-in-schools-says-tamil-nadu-minister-3067715", "urlToImage": "https://c.ndtvimg.com/2020-01/k5e0dcg4_mobile-phone-generic-pixabay_625x300_04_January_20.jpg", "publishedAt": "2022-06-14T18:49:06Z", "content": "The Minister's warning comes a day after the schools re--opened on Monday. (Representational)\r\nTiruchirappalli, Tamil Nadu: Tamil Nadu School Education Minister Anbil Mahesh Poyyamozhi on Tuesday war… [+1431 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Joe Biden Signals US-Saudi Thaw With Crown Prince Meeting On Mideast Trip", "description": "US President Joe Biden will meet with Saudi Arabian Crown Prince Mohammed bin Salman next month, abandoning efforts to ostracize the kingdom's de facto leader over the horrific murder of a dissident.", "url": "https://www.ndtv.com/world-news/joe-biden-signals-us-saudi-thaw-with-crown-prince-mohammed-bin-salman-meeting-on-mideast-trip-3067709", "urlToImage": "https://c.ndtvimg.com/2022-05/592rr60g_joe-biden-potus_625x300_30_May_22.jpg", "publishedAt": "2022-06-14T18:44:43Z", "content": "Joe Biden will meet with Saudi Crown Prince Mohammed bin Salman next month\r\nWashington: US President Joe Biden will meet with Saudi Arabian Crown Prince Mohammed bin Salman next month, abandoning eff… [+4813 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Bordeaux Handed Further Relegation After Financial Review", "description": "Bordeaux were relegated for the second time in less than a month when they were demoted to the French third tier for financial irregularities on Tuesday", "url": "https://sports.ndtv.com/football/bordeaux-handed-further-relegation-after-financial-review-3067706", "urlToImage": "https://c.ndtvimg.com/2022-06/7ml909u8_bordeaux-806_625x300_15_June_22.jpg", "publishedAt": "2022-06-14T18:43:13Z", "content": "Bordeaux were relegated for the second time in less than a month when they were demoted to the French third tier for financial irregularities on Tuesday. The six-time French champions finished bottom… [+1006 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Liverpool Complete Signing Of Darwin Nunez From Benfica", "description": "Liverpool secured the signing of Uruguayan striker Darwin Nunez from Benfica on Tuesday for a fee that could rise to a club record 100 million euros", "url": "https://sports.ndtv.com/football/liverpool-complete-signing-of-darwin-nunez-from-benfica-3067681", "urlToImage": "https://c.ndtvimg.com/2022-06/m2skcv8o_darwin-nunez-806_625x300_14_June_22.jpg", "publishedAt": "2022-06-14T18:30:27Z", "content": "Darwin Nunez vowed to write himself into Liverpool's history after securing a move from Benfica on Tuesday for a fee that could rise to a club record 100 million euros (85 million pounds, $105 millio… [+2676 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"I Seek Forgiveness For This\": Kiran Bedi Amid Row Over Joke On Sikhs", "description": "The Aam Aadmi Party on Tuesday accused former Puducherry Lieutenant Governor Kiran Bedi of hurting the sentiments of Sikhs at a book launch event in Chennai.", "url": "https://www.ndtv.com/india-news/i-seek-forgiveness-for-this-tweets-kiran-bedi-amid-row-over-joke-on-sikhs-3067668", "urlToImage": "https://c.ndtvimg.com/5ai14lfo_kiran-bedi_625x300_16_July_18.jpg", "publishedAt": "2022-06-14T18:21:12Z", "content": "Kiran Bedi asked people not to misread her comments\r\nNew Delhi: The Aam Aadmi Party on Tuesday accused former Puducherry Lieutenant Governor Kiran Bedi of hurting the sentiments of Sikhs at a book la… [+2142 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Agnipath Scheme Will Not Impact Operational Capabilities Says Army Chief", "description": "Agnipath Scheme: Chief of Army Staff General Manoj Pande said that the implementation of the 'Agnipath' scheme will in no way impact the Army's operational capabilities and preparedness along the borders with China and Pakistan.", "url": "https://www.ndtv.com/india-news/agnipath-scheme-will-not-impact-operational-capabilities-says-army-chief-general-manoj-pande-3067657", "urlToImage": "https://c.ndtvimg.com/2022-05/032s4s7_army-chief-general-manoj-pande_625x300_09_May_22.jpg", "publishedAt": "2022-06-14T18:16:04Z", "content": "General Manoj Pande said the Agnipath Scheme is a transformational reform for the Army. (File)\r\nNew Delhi: Army Chief General Manoj Pande on Tuesday said that the implementation of the 'Agnipath' sch… [+3485 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Have Enough Ammunition, But Need Long Range Weapons: Volodymyr Zelenskyy", "description": "Russia-Ukraine War: Ukrainian President said Volodymyr Zelenskyy said Ukraine's military has enough ammunition and weapons, but needs more long-range weapons.", "url": "https://www.ndtv.com/world-news/have-enough-ammunition-but-need-long-range-weapons-says-volodymyr-zelenskyy-3067645", "urlToImage": "https://c.ndtvimg.com/2022-05/bca7ka1s_ukraine-president-volodymyr-zelensky_625x300_21_May_22.jpg", "publishedAt": "2022-06-14T18:10:25Z", "content": "Volodymyr Zelenskyy made the statement at an online press briefing. (File)\r\nCopenhagen: Ukraine's military has enough ammunition and weapons, but needs more long-range weapons, Ukrainian President Vo… [+439 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Neeraj Chopra Sets New National Record With 89.30 Metre Javelin Throw", "description": "Neeraj Chopra improved upon his own record of 87.58 metres, which he had achieved during the Tokyo Olympics.", "url": "https://sports.ndtv.com/athletics/neeraj-chopra-sets-new-national-record-with-89-3-metre-javelin-throw-3067633", "urlToImage": "https://c.ndtvimg.com/2021-12/av933es_neeraj-chopra_650x400_09_December_21.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-14T18:01:52Z", "content": "India's ace javelin thrower Neeraj Chopra set a new national record as he threw 89.30 metres at the Paavo Nurmi Games in Finland. Neeraj improved upon his own record of 87.58 metres, which he had ach… [+1421 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "By-polls To Begin End Of BJP In Tripura: Trinamool's Abhishek Banerjee", "description": "The June 23 by-polls to four assembly seats will begin the end of BJP governance in Tripura and the end will be the assembly polls due next year, Trinamool Congress National General Secretary Abhishek Banerjee said on Tuesday.", "url": "https://www.ndtv.com/india-news/by-polls-to-begin-end-of-bjp-in-tripura-trinamools-abhishek-banerjee-3067624", "urlToImage": "https://c.ndtvimg.com/2022-03/rbf1cgtk_abhishek-banerjee-650_625x300_21_March_22.jpg", "publishedAt": "2022-06-14T17:56:15Z", "content": "Abhishek Banerjee said, \"We came to Tripura to defeat the BJP like in Bengal\".\r\nGuwahati: The June 23 by-polls to four assembly seats will begin the end of BJP governance in Tripura and the end will … [+2018 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "In Situations Right Of Private Defence Is Defensive Right: Supreme Court", "description": "The Supreme Court said that the right of private defence is necessarily a defensive right that is available only when the circumstances so justify it. The Supreme Court said that the act of private defence should have been done without malice.", "url": "https://www.ndtv.com/india-news/in-situations-right-of-private-defence-is-defensive-right-says-supreme-court-3067621", "urlToImage": "https://c.ndtvimg.com/2022-04/0ql59cnk_supreme-court-ani-twitter_625x300_08_April_22.jpg", "publishedAt": "2022-06-14T17:53:30Z", "content": "The instinct of self-preservation is embedded in the DNA of every person, Supreme Court said. (File)\r\nNew Delhi: The Supreme Court Tuesday said that the right of private defence is necessarily a defe… [+5351 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "US Open Tennis To Allow Russia, Belarus Players Under Neutral Flag", "description": "Players from Russia and Belarus will be allowed to compete in the 2022 US Open, but only under a neutral flag, the US Tennis Association announced Tuesday.", "url": "https://sports.ndtv.com/tennis/us-open-tennis-to-allow-russia-belarus-players-under-neutral-flag-3067616", "urlToImage": "https://c.ndtvimg.com/2022-01/si3qdo9o_daniil-medvedev-afp_625x300_20_January_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-14T17:49:03Z", "content": "Players from Russia and Belarus will be allowed to compete in the 2022 US Open, but only under a neutral flag, the US Tennis Association announced Tuesday. The move comes after the Grand Slams, the I… [+1160 chars]"}]}