{"status": "ok", "totalResults": 282, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Japan Prepares To Bid Farewell To Shinzo Abe, Its Longest-Serving PM", "description": "Japan on Tuesday prepared to bid farewell to Shinzo Abe, a polarising figure who dominated Japanese politics for decades as the country's longest-serving premier,", "url": "https://www.ndtv.com/world-news/japan-readies-sombre-farewell-to-slain-abe-its-longest-serving-premier-3149157", "urlToImage": "https://c.ndtvimg.com/2022-07/vpk52oeo_shinzo-abe_625x300_12_July_22.jpg", "publishedAt": "2022-07-12T01:54:48Z", "content": "Tributes have poured in for Shinzo Abe from international leaders\r\nTokyo: Japan on Tuesday prepared to bid farewell to Shinzo Abe, a polarising figure who dominated Japanese politics for decades as t… [+2214 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Delhi Government Collaborates With UN Body For Job Scheme For Students", "description": "The Kejriwal government Monday announced a new pilot project with UNICEF to enable access to employment opportunities for students of the Delhi Skill and Entrepreneurship University (DSEU).", "url": "https://www.ndtv.com/india-news/delhi-government-collaborates-with-un-body-for-job-scheme-for-students-3149129", "urlToImage": "https://c.ndtvimg.com/2022-07/kn0q717_arvind-kejriwal_625x300_06_July_22.jpg", "publishedAt": "2022-07-12T01:18:47Z", "content": "Delhi announced a pilot project with UNICEF for employment opportunities for students, Mr Kejriwal said.\r\nNew Delhi: The Kejriwal government Monday announced a new pilot project with the UNICEF to en… [+977 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE Updates: India Reports 16,678 New Covid Cases In 24 Hours", "description": "India on Monday reported at least 16,678 new COVID-19 cases, taking the total number of coronavirus to 4,36,22,651. While the death count climbed to 5,25,428 with 42 new fatalities in the last 24 hours.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-covid-cases-india-july-12-3149107", "urlToImage": "https://c.ndtvimg.com/2022-06/lfkrncuo_coronavirus-testing-india-reuters-pic_650x400_24_June_22.jpg", "publishedAt": "2022-07-12T00:34:34Z", "content": "India COVID-19 Live: India Records 42 Covid-related deaths in the last 24 hours.\r\nNew Delhi: India on Monday reported at least 16,678 new COVID-19 cases, taking the total number of coronavirus to 4,3… [+441 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Italy To Begin Administering 2nd Covid Booster Dose To Over-60s", "description": "Italy will soon start its campaign to administer a second COVID-19 booster to everyone aged over 60, the health minister said on Monday, after receiving a green light from European Union health agencies.", "url": "https://www.ndtv.com/world-news/italy-to-begin-administering-2nd-covid-booster-dose-to-over-60s-3149098", "urlToImage": "https://c.ndtvimg.com/2022-01/sctrkucc_covid-in-italy-reuters_625x300_06_January_22.jpg", "publishedAt": "2022-07-12T00:18:37Z", "content": "Italy COVID-19: Italy saw coronavirus cases rise in July.\r\nRome: Italy will soon start its campaign to administer a second COVID-19 booster to everyone aged over 60, the health minister said on Monda… [+1011 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Biden To Hold 4-Way Virtual Summit With Israel, UAE, India This Week", "description": "President Joe Biden will participate in a four-way virtual summit with the leaders of Israel, the United Arab Emirates and India during his Middle East trip this week, U.S. national security adviser Jake Sullivan said on Monday.", "url": "https://www.ndtv.com/world-news/biden-to-hold-4-way-virtual-summit-with-israel-uae-india-this-week-3149093", "urlToImage": "https://c.ndtvimg.com/2022-06/hut5m454_biden-afp_625x300_10_June_22.jpg", "publishedAt": "2022-07-11T23:59:52Z", "content": "US official told reporters that the summit will focus on food security.\r\nWashington: President Joe Biden will participate in a four-way virtual summit with the leaders of Israel, the United Arab Emir… [+297 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine Warns Russia Will Step Up Donbass Fight", "description": "Ukraine warned Monday that Russian forces were preparing to intensify their fight for key cities in the Donbas, as President Volodymyr Zelensky bitterly accused Canada of undermining sanctions against Moscow.", "url": "https://www.ndtv.com/world-news/ukraine-warns-russia-will-step-up-donbass-fight-3149092", "urlToImage": "https://c.ndtvimg.com/2022-05/tgcpfmd8_donbas_625x300_28_May_22.jpg", "publishedAt": "2022-07-11T23:51:49Z", "content": "The latest attacks in Ukraine came as Europe braced for deeper cuts in gas supplies from Russia.\r\nKyiv: Ukraine warned Monday that Russian forces were preparing to intensify their fight for key citie… [+4890 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "BJP Must Clarify On Alleged Links With Udaipur Murder Accused: Ashok Gehlot", "description": "Rajasthan Chief Minister Ashok Gehlot on Monday made serious allegations against the Bharatiya Janata Party of having links with the accused involved in the gruesome murder of Kanhaiya Lal Teli in Udaipur and asserted that the BJP should issue a clar", "url": "https://www.ndtv.com/india-news/bjp-must-clarify-on-alleged-links-with-udaipur-tailor-murder-accused-rajasthan-chief-minister-ashok-gehlot-3149079", "urlToImage": "https://c.ndtvimg.com/2022-06/io52snko_ashok-gehlot_650x400_15_June_22.jpg", "publishedAt": "2022-07-11T23:29:46Z", "content": "Ashok Gehlot asked BJP to issue a clarification on the \"connection\" of the accused with the party.\r\nJaipur: Rajasthan Chief Minister Ashok Gehlot on Monday made serious allegations against the Bharat… [+2778 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "NASA's Webb Telescope Reveals Deepest Infrared Image Of Early Universe", "description": "The James Webb Space Telescope, the most powerful observatory to be placed in orbit, has revealed the \"deepest and sharpest infrared image of the early universe\" ever taken, going back 13 billion years, NASA said Monday.", "url": "https://www.ndtv.com/world-news/nasas-webb-telescope-reveals-deepest-infrared-image-of-early-universe-3149078", "urlToImage": "https://c.ndtvimg.com/2022-07/i2nmki6_web-telescope_625x300_12_July_22.jpg", "publishedAt": "2022-07-11T23:11:04Z", "content": "\"This telescope is one of humanity's great engineering achievements,\" Biden said.\r\nWashington: The James Webb Space Telescope, the most powerful observatory to be placed in orbit, has revealed the \"d… [+3614 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Twitter Shares Sink 11.3% After Musk Withdraws Takeover Bid", "description": "Twitter shares plunged Monday after Elon Musk announced the withdrawal of his $44 billion takeover bid, setting the stage for a potential legal brawl.", "url": "https://www.ndtv.com/world-news/twitter-shares-sink-11-3-after-musk-withdraws-takeover-bid-3149073", "urlToImage": "https://c.ndtvimg.com/2022-06/r7ut3nt_elon-musk_625x300_21_June_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675?ver-20220701.02", "publishedAt": "2022-07-11T22:55:19Z", "content": "Elon Musk posted a pair of mocking tweets after the company said it would sue him.(File)\r\nNew York: Twitter shares plunged Monday after Elon Musk announced the withdrawal of his $44 billion takeover … [+462 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "World's Most Powerful Telescope's 1st Snapshot Of Our Universe: 5 Points", "description": "US President Joe Biden released the first full-color image being made public by NASA from the James Webb Space Telescope today.", "url": "https://www.ndtv.com/world-news/james-webb-space-telescope-images-worlds-most-powerful-telescopes-1st-snapshots-of-our-universe-5-points-3149071", "urlToImage": "https://c.ndtvimg.com/2022-07/b17red3s_james-webb-space-telescope_625x300_12_July_22.jpg", "publishedAt": "2022-07-11T22:42:48Z", "content": "<li>The James Webb Space Telescope-  world's largest and most powerful space telescope - was constructed by aerospace giant Northrop Grumman Corp and was launched to space for NASA and its European a… [+834 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "First Pic Of Earliest Galaxies Formed After Big Bang By Webb Telescope", "description": "US President Joe Biden and Vice President Kamala Harris previewed the first image taken by world's largest and most powerful space telescope- the James Webb Telescope- at the White House today.", "url": "https://www.ndtv.com/world-news/first-pic-of-earliest-galaxies-formed-after-big-bang-by-worlds-most-powerful-space-telescope-3149068", "urlToImage": "https://c.ndtvimg.com/2022-07/iepbber4_james-webb-space-telescope-first-image_625x300_12_July_22.jpg", "publishedAt": "2022-07-11T22:31:15Z", "content": "James Webb Space Telescope Image: US President Joe Biden previewed the first image\r\nWashington: US President Joe Biden and Vice President Kamala Harris previewed the first image taken by world's larg… [+2395 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Iran To Send Armed Drones To Russia Amid Ukraine War: White House", "description": "Iran is planning to supply hundreds of drones with combat weapon capabilities to Russia for use in Ukraine, a top US official said Monday.", "url": "https://www.ndtv.com/world-news/iran-to-send-armed-drones-to-russia-amid-ukraine-war-white-house-3149067", "urlToImage": "https://c.ndtvimg.com/2021-06/lqnk4u28_jake-sullivan-650_625x300_08_June_21.jpeg", "publishedAt": "2022-07-11T22:28:16Z", "content": "US said Russian army is facing challenges sustaining its weaponry after significant losses in Ukraine.\r\nWashington: Iran is planning to supply hundreds of drones with combat weapon capabilities to Ru… [+1622 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine Summons Canada Envoy Over \"Unacceptable\" Turbine Return", "description": "President Volodymyr Zelensky said Monday that Ukraine summoned its Canadian ambassador over Ottawa's decision to return to Germany gas turbines needed to maintain the Nord Stream 1 pipeline, despite sanctions in place against Russia .", "url": "https://www.ndtv.com/world-news/ukraine-summons-canada-envoy-over-unacceptable-turbine-return-3149062", "urlToImage": "https://c.ndtvimg.com/2022-06/ah6js3os_zelensky-reuters_625x300_01_June_22.jpg", "publishedAt": "2022-07-11T22:04:34Z", "content": "Zelensky said Ukraine summoned its Canadian envoy over Ottawa's decision to return to Germany turbines.\r\nKyiv: President Volodymyr Zelensky said Monday that Ukraine summoned its Canadian ambassador o… [+1261 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rishi Sunak Vows To Tackle Inflation In Pitch To Be UK PM", "description": "Former finance minister Rishi Sunak will set out his stall to be Britain's next prime minister on Tuesday, vowing to tackle soaring inflation before joining his Conservative Party rivals in promising tax cuts.", "url": "https://www.ndtv.com/world-news/rishi-sunak-vows-to-tackle-inflation-in-pitch-to-be-uk-pm-3149049", "urlToImage": "https://c.ndtvimg.com/2022-07/fqgo53qc_rishi-sunak_625x300_08_July_22.jpg", "publishedAt": "2022-07-11T21:36:04Z", "content": "Rishi Sunak is one of favourites to replace Johnson and has the largest support among Conservatives.\r\nLondon: Former finance minister Rishi Sunak will set out his stall to be Britain's next prime min… [+2155 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Twitter Slams Musk Merger Withdrawal As 'Invalid And Wrongful'", "description": "Twitter demanded Monday that Elon Musk complete a proposed $44 takeover of the social media company, slamming the Tesla chief's withdrawal of his offer as \"invalid and wrongful.\"", "url": "https://www.ndtv.com/world-news/twitter-slams-musk-merger-withdrawal-as-invalid-and-wrongful-3149048", "urlToImage": "https://c.ndtvimg.com/2022-06/i2dfddv_elon-musk-reuters_625x300_03_June_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675?ver-20220701.02", "publishedAt": "2022-07-11T21:30:38Z", "content": "Twitter slammed Elon Musk's withdrawal of the offer as \"invalid and wrongful.\"(File)\r\nNew York: Twitter demanded Monday that Elon Musk complete a proposed $44 takeover of the social media company, sl… [+636 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Big Blow To Congress In Uttarakhand As 3 Senior Leaders Join AAP", "description": "Three senior Congress leaders from Uttarakhand on Monday resigned from the party and joined the Aam Aadmi Party in Delhi.", "url": "https://www.ndtv.com/india-news/3-senior-congress-leaders-in-uttarakhand-join-aap-3149038", "urlToImage": "https://c.ndtvimg.com/2022-05/p2qsq4ok_aap-flags-650_625x300_02_May_22.jpg", "publishedAt": "2022-07-11T21:14:12Z", "content": "Delhi Deputy CM Manish Sisodia said their entry will strengthen AAP in Uttarakhand. (Representational)\r\nDehradun: Three senior Congress leaders from Uttarakhand on Monday resigned from the party and … [+1009 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Webb Telescope To Reveal Earliest Galaxies After Big Bang", "description": "NASA's James Webb Space Telescope is poised to reveal some of the earliest galaxies that formed after the Big Bang, the White House said Monday, as anticipation builds for the powerful observatory's first images.", "url": "https://www.ndtv.com/world-news/webb-telescope-to-reveal-earliest-galaxies-after-big-bang-3149029", "urlToImage": "https://c.ndtvimg.com/2022-07/sk19hj7c_web-telescope_625x300_12_July_22.jpg", "publishedAt": "2022-07-11T21:03:55Z", "content": "President Joe Biden will unveil the images during a livestreamed event starting at 5:00 pm (2100 GMT).\r\nWashington: NASA's James Webb Space Telescope is poised to reveal some of the earliest galaxies… [+3853 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Biden To Release 1st Image From NASA's New Space Telescope", "description": "US President Joe Biden will Monday release one of the first images taken by the James Webb Space Telescope, the most powerful observatory ever sent into orbit and a leap forward in uncovering the secrets of the distant universe.", "url": "https://www.ndtv.com/world-news/joe-biden-to-release-1st-image-from-nasas-new-space-telescope-3149004", "urlToImage": "https://c.ndtvimg.com/2022-06/9ae571to_nasa-james-webb-telescope-small_120x90_14_June_22.jpg", "publishedAt": "2022-07-11T20:29:40Z", "content": "The rest of the first wave of images are set to be released by NASA on Tuesday.\r\nWashington: US President Joe Biden will Monday release one of the first images taken by the James Webb Space Telescope… [+4727 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Delhi BJP Spokeswoman Alleges Sexual Harassment, Case Filed", "description": "An FIR has been registered against unknown persons for allegedly sexually harassing a female spokesperson of Delhi BJP after a video defaming her was posted on social media platforms, police said.", "url": "https://www.ndtv.com/india-news/delhi-bjp-spokeswoman-alleges-sexual-harassment-case-filed-3148989", "urlToImage": "https://c.ndtvimg.com/2019-05/fkcrjpmg_delhi-police-generic_625x300_27_May_19.jpg", "publishedAt": "2022-07-11T20:05:14Z", "content": "The matter came to the fore after a complaint was made by the Delhi unit of the BJP.\r\nNew Delhi: An FIR has been registered against unknown persons for allegedly sexually harassing a female spokesper… [+1361 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Binance Posts A Picture To Celebrate 5th Anniversary Amid Crypto Meltdown", "description": "The world's largest crypto exchange, Binance, celebrated its 5th anniversary by posting a picture on instagram, in which the firm wrote, \"its too pretty, not sure if I want to eat or display these.\"", "url": "https://www.ndtv.com/business/binance-posts-a-pic-to-celebrate-5th-anniversary-amid-crypto-meltdown-3148974", "urlToImage": "https://c.ndtvimg.com/2022-07/f5evmt0o_image_625x300_12_July_22.jpg", "publishedAt": "2022-07-11T19:45:48Z", "content": "Binance posts a pic to celebrate 5th anniversary amid crypto meltdown\r\nThe world's largest crypto exchange, Binance, celebrated its 5th anniversary by posting a picture on Instagram, in which the fir… [+847 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Electric Vehicle Maker Rivian Plans Hundreds Of Job Cuts: Report", "description": "Electric vehicle maker Rivian Automotive plans to cut hundreds of jobs, possibly around 5 per cent of its total work force, Bloomberg News reported on Monday, citing people familiar with the matter.", "url": "https://www.ndtv.com/business/electric-vehicle-maker-rivian-plans-hundreds-of-job-cuts-report-3148966", "urlToImage": "https://c.ndtvimg.com/2022-07/2vr0vvfg_image_625x300_12_July_22.jpg", "publishedAt": "2022-07-11T19:30:01Z", "content": "EV maker Rivian plans to cut hundreds of jobs: Report\r\nElectric vehicle maker Rivian Automotive plans to cut hundreds of jobs, possibly around 5 per cent of its total work force, Bloomberg News repor… [+829 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "New UK PM To Be Announced On September 5", "description": "The Conservative Party said the postal ballot of party members would be a choice between two candidates to be selected under an expedited process to whittle down the field from the 11 candidates who have declared so far.", "url": "https://www.ndtv.com/world-news/new-uk-pm-to-be-announced-on-september-5-3148957", "urlToImage": "https://c.ndtvimg.com/2022-07/nco246h_boris-johnson-afp-650_650x400_07_July_22.jpg", "publishedAt": "2022-07-11T19:15:27Z", "content": "The Conservative Party will announce the replacement for British PM Boris Johnson on September 5.\r\nLondon:  The Conservative Party will announce the replacement for British Prime Minister Boris Johns… [+440 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Elon Musk's Tesla Stock Sale Windfall Dwarfs Twitter Deal Loss", "description": "Elon Musk's attempt to scrap his purchase of Twitter Inc may leave the world's wealthiest person in a stronger financial position than before he unveiled the $44 billion deal, with billions of dollars in cash from selling Tesla shares now sitting in the bank.", "url": "https://www.ndtv.com/business/musks-tesla-stock-sale-windfall-dwarfs-twitter-loss-3148941", "urlToImage": "https://c.ndtvimg.com/2022-07/hcg4iv4_image_625x300_12_July_22.jpg", "publishedAt": "2022-07-11T18:52:28Z", "content": "Elon Musk's Tesla stock sale windfall dwarfs Twitter loss\r\nElon Musk's attempt to scrap his purchase of Twitter Inc may leave the world's wealthiest person in a stronger financial position than befor… [+2763 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "5 Major Monuments To Be Illuminated In Tricolour Theme In Delhi: Minister", "description": "Delhi government on Monday said five major monuments in the city would be illuminated in a tricolour theme to mark the 75th year of Independence.", "url": "https://www.ndtv.com/india-news/5-major-monuments-to-be-illuminated-in-tricolour-theme-in-delhi-for-75th-year-of-independence-manish-sisodia-3148924", "urlToImage": "https://c.ndtvimg.com/2022-04/aif5ke3o_manish-sisodia_625x300_18_April_22.jpg", "publishedAt": "2022-07-11T18:37:28Z", "content": "Delhi government is working on restoration of monuments under its jurisdiction. (File)\r\nNew Delhi: Delhi government on Monday said five major monuments in the city would be illuminated in a tricolour… [+1463 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sena Workers Commit Loyalty To Uddhav Thackeray On Bond Papers: Report", "description": "Shiv Sena workers and office-bearers in Maharashtra's Aurangabad have started committing their loyalty to party president Uddhav Thackeray by signing bond papers and getting them notarized.", "url": "https://www.ndtv.com/india-news/shiv-sena-workers-commit-loyalty-to-uddhav-thackeray-on-notarized-bond-papers-report-3148918", "urlToImage": "https://c.ndtvimg.com/2022-07/j5r8tuh_uddhav-thackeray-650_625x300_01_July_22.jpg", "publishedAt": "2022-07-11T18:30:33Z", "content": "\"We have prepared more than 100 notarised bond papers\", a Shiv Sena leader said.\r\nAurangabad: Shiv Sena workers and office-bearers in Aurangabad have started committing their loyalty to party preside… [+1230 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"No Time To Lose\": EU's Nod To 2nd Covid Booster Jab For People Over 60", "description": "The EU's health and medicine agencies said Monday they were recommending a second booster shot of a Covid vaccine for people over 60 years old, as infections rise again.", "url": "https://www.ndtv.com/world-news/coronavirus-no-time-to-lose-eus-nod-to-2nd-covid-booster-jab-for-people-over-60-3148894", "urlToImage": "https://c.ndtvimg.com/2022-07/d3eoeoms_europe-covid-booster-shot_625x300_11_July_22.jpg", "publishedAt": "2022-07-11T18:15:38Z", "content": "EU's health and medicine agencies said they were recommending a second booster shot.\r\nStockholm: The EU's health and medicine agencies said Monday they were recommending a second booster shot of a Co… [+1836 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "RBI Penalises 3 Cooperative Banks In Maharashtra For Non-Compliance", "description": "The Reserve Bank in a statement said it has imposed penalty on three cooperatives banks for deficiencies in regulatory compliance. The three cooperative banks include, The Maharashtra State Co-operative Bank; The Nasik Merchant's Co-operative Bank;", "url": "https://www.ndtv.com/india-news/rbi-imposes-penalties-on-3-cooperative-banks-over-non-compliance-in-maharashtra-the-maharashtra-state-co-operative-bank-the-nasik-merchants-co-operati-3148885", "urlToImage": "https://c.ndtvimg.com/2022-06/cj2e9ss8_reserve-bank-of-india-650x319_650x400_08_June_22.jpg", "publishedAt": "2022-07-11T18:11:25Z", "content": "Rs 50 lakh fine has been imposed against The Nasik Merchant's Co-operative Bank.\r\nMumbai: The Reserve Bank on Monday said it has imposed penalty on three cooperatives banks, including Maharashtra-bas… [+1106 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Fraudsters Pose As Assam Power Minister On Whatsapp, Case Registered", "description": "Assam power minister Bimal Borah filed a police case against fraudsters involved in opening a fake Whatsapp account using his name.", "url": "https://www.ndtv.com/india-news/assam-power-minister-bimal-borah-fraudsters-pose-as-assam-power-minister-on-whatsapp-case-registered-3148880", "urlToImage": "https://c.ndtvimg.com/2022-07/g6tq0jtg_assam-power-minister-bimal-borah-_625x300_11_July_22.jpg", "publishedAt": "2022-07-11T18:08:55Z", "content": "Assam: Further investigation is already being conducted in the case, police said.\r\nGuwahati: Assam power minister Bimal Borah filed a police case against fraudsters involved in opening a fake Whatsap… [+664 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Do Hear Us Out: Shiv Sena To Election Body On Party Symbol", "description": "In a pre-emptive move, Uddhav Thackeray-led Shiv Sena has moved the Election Commission, asking it to hear it out before taking a view on any demands made by the faction led by Eknath Shinde on the party symbol, sources said on Monday.", "url": "https://www.ndtv.com/india-news/do-hear-us-out-shiv-sena-to-election-body-on-party-symbol-3148319", "urlToImage": "https://c.ndtvimg.com/2019-05/1jlsbnq8_election-commission_625x300_23_May_19.jpg", "publishedAt": "2022-07-11T18:03:52Z", "content": "Eknath Shinde had led a rebellion in the Shiv Sena late last month.\r\nNew Delhi: In a pre-emptive move, Uddhav Thackeray-led Shiv Sena has moved the Election Commission, asking it to hear it out befor… [+2179 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Rashi Hardaha", "title": "CUET UG 2022 Exam City Intimation Slip Released; How To Download", "description": "CUET 2022: The exam city intimation slip of CUET UG 2022 is available on the official website-- cuet.samarth.ac.in. To download the CUET 2022 city allotment slip, the candidates will need to enter their application number and date of birth.", "url": "https://www.ndtv.com/education/cuet-ug-2022-exam-city-intimation-slip-released-how-to-download-at-cuet-samarth-ac-in", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/11/cuet_2022_exam_city_slip.jpg", "publishedAt": "2022-07-11T18:00:47Z", "content": "CUET 2022: The National Testing Agency (NTA) has issued advanced intimation slips of examination city for the Common University Entrance Test-Undergraduate (CUET UG) 2022 today, July 11. The exam cit… [+2154 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Delhi Man, 59, Arrested For Raping 2 Minor Girls: Police", "description": "Two minor girls were allegedly raped by their 59-year-old neighbour who lured them by giving money to buy toffees and toys, police said on Monday.", "url": "https://www.ndtv.com/india-news/delhi-delhi-man-59-arrested-for-raping-2-minor-girls-police-3148328", "urlToImage": "https://i.ndtvimg.com/i/2016-05/arrest-generic_650x400_71463458726.jpg", "publishedAt": "2022-07-11T17:58:05Z", "content": "Delhi: The accused, who is a vegetable vendor, was arrested on Saturday, police said. (Representational)\r\nNew Delhi: Two minor girls were allegedly raped by their 59-year-old neighbour who lured them… [+1527 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Nothing To Do With It\": What BJP Said On Goa Congress Unrest", "description": "The ruling Bharatiya Janata Party (BJP) in Goa on Monday said it has nothing to do with the latest unrest in the opposition Congress, which has been hit by defection talks just four months after the Assembly polls.", "url": "https://www.ndtv.com/india-news/congress-in-goa-nothing-to-do-with-it-what-bjp-said-on-goa-congress-unrest-3148163", "urlToImage": "https://i.ndtvimg.com/i/2018-03/bjp-flag-generic_650x400_51520152255.jpg", "publishedAt": "2022-07-11T17:55:50Z", "content": "Congress In Goa: On Sunday, out of the 11 Congress MLAs in the state, five had gone incommunicado.\r\nPanaji: The ruling Bharatiya Janata Party (BJP) in Goa on Monday said it has nothing to do with the… [+1341 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "IndiGo's Salary Change Plan For Technicians After Mass Sick Leaves", "description": "IndiGo said it will \"rationalize\" the salaries of its aircraft maintenance technicians and remove \"anomalies cause by the pandemic\", according to an email accessed by Press Trust of India send by IndiGo's Senior Vice President (Engineering).", "url": "https://www.ndtv.com/india-news/indigos-salary-change-plan-for-technicians-after-mass-sick-leaves-3148832", "urlToImage": "https://c.ndtvimg.com/2022-03/99rtpnd8_indigo_625x300_31_March_22.jpg", "publishedAt": "2022-07-11T17:45:37Z", "content": "On July 2, around 55 per cent of IndiGo's domestic flights were delayed.\r\nNew Delhi: IndiGo on Monday said it will \"rationalize\" the salaries of its aircraft maintenance technicians and remove \"anoma… [+2032 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Rashi Hardaha", "title": "CUET 2022 Admit Card To Be Issued Tomorrow; Confirms NTA", "description": "CUET Admit Card 2022: The CUET admit card link will be activated at 6 PM on the official websites--cuet.samarth.ac.in and nta.ac.in. Candidates registered for CUET UG 2022 can check and download their admit card by using their application number and date of b…", "url": "https://www.ndtv.com/education/cuet-2022-admit-card-to-be-issued-tomorrow-confirms-nta", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/11/cuet_2022_admit_card.jpg", "publishedAt": "2022-07-11T17:41:26Z", "content": "CUET Admit Card 2022: The National Testing Agency (NTA) will issue the admit card for the Common University Entrance Test-Undergraduate (CUET UG) 2022 tomorrow, July 12. The CUET admit card link will… [+1876 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Blown Out Of Proportion\": Goa's Sacked Congress Leader Of Opposition", "description": "Ten of the 11 Congress MLAs in Goa attended a meeting today to discuss the events of Sunday when six of them went missing. The Congress has said the BJP was attempting to engineer defections and claimed two of its own leaders were involved.", "url": "https://www.ndtv.com/india-news/blown-out-of-proportion-goas-sacked-congress-leader-of-opposition-3148825", "urlToImage": "https://c.ndtvimg.com/2022-01/gghb42q8_michael-lobo-delilah-lobo-650_625x300_27_January_22.jpg", "publishedAt": "2022-07-11T17:40:08Z", "content": "<li>Michael Lobo, the sacked Leader of Opposition and his wife Delilah Lobo, who is also a Congress MLA, told NDTV that the events have been \"blown out of proportion\".\r\n</li><li>Mr Lobo has been accu… [+1791 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Ex-F1 Chief Ecclestone Facing Fraud Claim Over Pound 400m Foreign Assets", "description": "Bernie Ecclestone is facing a claim of fraud over an alleged failure to declare Pound  400 million ($477 million, 473 million euros) of overseas assets to the British government, prosecutors said on Monday", "url": "https://sports.ndtv.com/formula-1/ex-f1-chief-bernie-ecclestone-facing-fraud-claim-over-pound-400m-foreign-assets-3148805", "urlToImage": "https://c.ndtvimg.com/2020-04/4uijq8lo_bernie-ecclestone-afp_625x300_05_April_20.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-11T17:31:22Z", "content": "Former Formula One supremo Bernie Ecclestone is facing a claim of fraud over an alleged failure to declare £400 million ($477 million, 473 million euros) of overseas assets to the British government,… [+2668 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Government Planning Electric Highway From Delhi To Mumbai: Nitin Gadkari", "description": "Union Minister Nitin Gadkari on Monday said the government is planning to construct an electric highway between Delhi and Mumbai. He also said the government is constructing tunnels worth Rs 2.5 lakh crore.", "url": "https://www.ndtv.com/india-news/government-planning-electric-highway-between-delhi-mumbai-union-minister-nitin-gadkari-3148796", "urlToImage": "https://c.ndtvimg.com/2021-12/ch9482jg_nitin-gadkaripti_625x300_17_December_21.jpg", "publishedAt": "2022-07-11T17:28:01Z", "content": "Nitin Gadkari said heavy vehicle owners should use alternative fuel like ethanol, methanol. (File)\r\nNew Delhi: Union Minister Nitin Gadkari on Monday said the government is planning to construct an e… [+1613 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Gujarat HC Issues Notice On Introducing Bhagavad Gita In Schools", "description": "The Gujarat High Court issued a notice to the state government on a petition challenging a resolution introducing the Bhagavad Gita in schools.", "url": "https://www.ndtv.com/education/gujarat-high-court-issues-notice-to-government-on-introducing-bhagavad-gita-in-schools", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/11/shutterstock_720482629.jpg", "publishedAt": "2022-07-11T17:21:58Z", "content": "Ahmedabad:The Gujarat High Court on Monday issued a notice to the state government on a petition challenging a resolution introducing the Bhagavad Gita in schools as a prayer program and verse recita… [+3744 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Amarnath Tragedy: 72 Hours On, No Clear Data On Number Of Missing", "description": "It has been more than 72 hours since a flash flood near the Amarnath shrine swept away dozens of pilgrims, killing at least 15.", "url": "https://www.ndtv.com/india-news/amarnath-tragedy-72-hours-on-no-clear-data-on-number-of-missing-3148769", "urlToImage": "https://c.ndtvimg.com/2022-07/iccd2t98_amarnath_625x300_09_July_22.jpg", "publishedAt": "2022-07-11T17:20:47Z", "content": "Official sources say chances of finding any survivors now are bleak.\r\nSrinagar: It has been more than 72 hours since a flash flood near the Amarnath shrine swept away dozens of pilgrims, killing at l… [+3483 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Each Amarnath Pilgrim Had Radio Track Device, Many Still Missing", "description": "The pilgrims had a radio frequency identification device (RFID)-based tracking system on them yet several of them are missing and authorities are unable to locate them three days after the flash floods near the holy cave shrine of Amarnath.", "url": "https://www.ndtv.com/india-news/each-amarnath-pilgrim-had-radio-track-device-many-still-missing-3148766", "urlToImage": "https://c.ndtvimg.com/2022-07/6660mu8g_amarnath-yatra_625x300_10_July_22.jpg", "publishedAt": "2022-07-11T17:19:13Z", "content": "The Army is using specialised mountain and avalanche rescue teams to find missing pilgrims\r\nNew Delhi: The pilgrims had a radio frequency identification device (RFID)-based tracking system on them ye… [+2354 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "12 Shiv Sena MPs In Touch With Eknath Shinde-Side, Claims Minister", "description": "Union minister and Bharatiya Janata Party leader Raosaheb Danve on Monday claimed 12 MPs of Uddhav Thackeray-led Shiv Sena are in touch with Chief Minister Eknath Shinde faction and are ready to cross over.", "url": "https://www.ndtv.com/india-news/12-shiv-sena-mps-in-touch-with-eknath-shinde-side-claims-union-minister-raosaheb-danve-3148765", "urlToImage": "https://c.ndtvimg.com/2019-08/rsgk4cl4_raosaheb-danve_625x300_29_August_19.jpg", "publishedAt": "2022-07-11T17:18:42Z", "content": "Minister Raosaheb Danve said Shiv Sena might support Droupadi Murmu in presidential elections. (File)\r\nJalna, Maharashtra: Union minister and Bharatiya Janata Party leader Raosaheb Danve on Monday cl… [+1952 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Boris Johnson Steers Clear Of Endorsing Successor", "description": "Boris Johnson on Monday refused to give his backing to any candidate vying to replace him as British prime minister, in his first public appearance since being forced to quit.", "url": "https://www.ndtv.com/world-news/united-kingdoms-prime-minister-race-boris-johnson-steers-clear-of-endorsing-successor-3148724", "urlToImage": "https://c.ndtvimg.com/2022-07/ruj7o2ho_boris-johnson-reuters_625x300_06_July_22.jpg", "publishedAt": "2022-07-11T17:09:52Z", "content": "So far, 11 hopefuls have declared their intention to stand in the internal leadership contest. (File)\r\nLondon: Boris Johnson on Monday refused to give his backing to any candidate vying to replace hi… [+2453 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Uddhav Thackeray's Letter To MLAs Who Backed Him: \"You Didn't Fall Prey\"", "description": "Shiv Sena president Uddhav Thackeray has written a letter to 15 MLAs who continue to back him despite a rebellion in the party, lauding them for their \"loyalty\" towards the 56-year-old organisation.", "url": "https://www.ndtv.com/india-news/maharashtra-political-crisis-uddhav-thackerays-letter-to-mlas-who-backed-him-you-didnt-fall-prey-3148030", "urlToImage": "https://c.ndtvimg.com/2022-07/j5r8tuh_uddhav-thackeray-650_625x300_01_July_22.jpg", "publishedAt": "2022-07-11T17:03:56Z", "content": "Maharashtra Political Crisis: Fifteen MLAs have remained loyal to Uddhav Thackeray.\r\nMumbai: Shiv Sena president Uddhav Thackeray has written a letter to 15 MLAs who continue to back him despite a re… [+1113 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "James Bond Theme Composer Monty Norman Dies At 94", "description": "British composer Monty Norman, best known for writing the iconic theme music for the James Bond films, died on Monday at the age of 94, his official website announced.", "url": "https://www.ndtv.com/world-news/james-bond-theme-composer-monty-norman-dies-at-94-3148703", "urlToImage": "https://c.ndtvimg.com/2022-07/n5tbreu_monty-norman_625x300_11_July_22.jpg", "publishedAt": "2022-07-11T17:02:38Z", "content": "Monty Norman's best-known work came when he was asked to score the first James Bond film.\r\nLondon, United Kingdom: British composer Monty Norman, best known for writing the iconic theme music for the… [+977 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Shinzo Abe Mourned At Wake As Party Secures Sombre Japan Poll Win", "description": "Family and friends of Japan's assassinated former prime minister Shinzo Abe paid their respects Monday at a wake in Tokyo as Washington's top diplomat hailed the ex-premier as a \"man of vision\".", "url": "https://www.ndtv.com/world-news/shinzo-abe-mourned-at-wake-as-party-secures-sombre-japan-poll-win-3148699", "urlToImage": "https://c.ndtvimg.com/2022-07/96camd5o_shinzo-abe-memorial_625x300_11_July_22.jpg", "publishedAt": "2022-07-11T17:01:46Z", "content": "Public memorials for Shinzo Abe are expected at a later date, with no immediate plans set.\r\nTokyo: Family and friends of Japan's assassinated former prime minister Shinzo Abe paid their respects Mond… [+4231 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "PM Modi To Inaugurate International Airport in Jharkhand's Deoghar", "description": "Prime Minister Narendra Modi will inaugurate an international airport and an In-Patient Department (IPD) and Operation Theatre services at AIIMS in Jharkhand's Deoghar on Tuesday.", "url": "https://www.ndtv.com/india-news/pm-narendra-modi-to-inaugurate-international-airport-in-jharkhands-deoghar-3148695", "urlToImage": "https://c.ndtvimg.com/2022-07/dccf74ns_deoghar-airport-650_625x300_11_July_22.jpg", "publishedAt": "2022-07-11T17:00:25Z", "content": "Deoghar airport will be the second international airport in Jharkhand after Ranchi.\r\nNew Delhi: Prime Minister Narendra Modi will unveil developmental projects of more than Rs 16,800 crores in Deogha… [+4651 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "4 Arrested In MP For Beating Man, Inserting Petrol In His Private Parts", "description": "Four persons were arrested on Monday on charges of attempt to murder and other offences for allegedly assaulting a 21-year-old tribal man in Indore in Madhya Pradesh, a police official said.", "url": "https://www.ndtv.com/india-news/madhya-pradesh-4-arrested-in-mp-for-beating-man-inserting-petrol-in-his-private-parts-3147826", "urlToImage": "https://i.ndtvimg.com/i/2016-05/arrest-generic_650x400_71463458726.jpg", "publishedAt": "2022-07-11T16:50:26Z", "content": "Four were arrested on charges of attempt to murder and other offences. (Representational)\r\nIndore: Four persons were arrested on Monday on charges of attempt to murder and other offences for allegedl… [+1211 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Harmanpreet Kaur To Lead Indian Women's Cricket Team At CWG, Jemimah Back", "description": "This will be the first time that Womens T20 International will be featured in the prestigious multi-sport event", "url": "https://sports.ndtv.com/cricket/indian-womens-cricket-team-squad-for-commonwealth-games-announced-3148662", "urlToImage": "https://c.ndtvimg.com/2022-06/qs0912g8_smriti-mandhana-and-harmanpreet-kaur-_625x300_25_June_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-11T16:48:34Z", "content": "India's squad for women's cricket competition was announced by the BCCI on Monday. \"The All-India Women's Selection Committee met on Monday to pick the squad for the forthcoming 2022 Commonwealth Gam… [+838 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Gujarat High Court's Move On Mandatory Bhagavad Gita Teaching In Schools", "description": "The Gujarat High Court on Monday issued a notice to the state government on a petition challenging a resolution introducing the Bhagavad Gita in schools as a prayer program and verse recitation among other activities.", "url": "https://www.ndtv.com/india-news/gujarat-high-courts-move-on-mandatory-bhagavad-gita-teaching-in-schools-3147984", "urlToImage": "https://c.ndtvimg.com/2021-08/bvrpc218_gujarat-high-court_625x300_19_August_21.jpg", "publishedAt": "2022-07-11T16:44:48Z", "content": "Gujarat High Court issued a notice to the state government on the petition.\r\nAhmedabad: The Gujarat High Court on Monday issued a notice to the state government on a petition challenging a resolution… [+3570 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Australia Take \"Lot Of Lessons Out Of\" Loss To SL for India Tour: Cummins", "description": "Australia went down to Sri Lanka by an innings and 39 runs on day four of the second Test in Galle after being bundled out for 151 in just over a session", "url": "https://sports.ndtv.com/cricket/australia-to-take-lot-of-lessons-out-of-loss-to-sri-lanka-for-india-tour-pat-cummins-3148646", "urlToImage": "https://c.ndtvimg.com/2022-07/2njtv45_travis-head_625x300_11_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-11T16:43:47Z", "content": "Australia skipper Pat Cummins on Monday said the experience of playing Tests on two vastly different pitches in Sri Lanka would be vital to their preparations for touring India next year. The tourist… [+2568 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Kashmir Man Arrested Over Threats To Mumbai Girl Over Social Media Post", "description": "A man from Jammu and Kashmir's Badgam was arrested for allegedly giving death threats to a 15-year-old girl in Mumbai after she posted a video on social media on the killing of tailor Kanhaiya Lal in Rajasthan's Udaipur, Mumbai Police said.", "url": "https://www.ndtv.com/india-news/jammu-and-kashmir-man-arrested-over-threats-to-mumbai-girl-over-social-media-post-3148631", "urlToImage": "https://c.ndtvimg.com/2022-06/ars722ac_police-generic_625x300_14_June_22.jpg", "publishedAt": "2022-07-11T16:39:15Z", "content": "He has been remanded in police custody for three days and further probe was underway. (Representational)\r\nNew Delhi: A man was arrested from Jammu and Kashmir for allegedly issuing death and sexual t… [+1104 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "BJP Had Flight Ready For Goa MLAs, Paid 15 Crores, Claim Congress Sources", "description": "A day after firefighting in Goa to keep its flock together, leaders of the Congress, off the record, described the \"Operation Lotus\" the ruling BJP allegedly attempted.", "url": "https://www.ndtv.com/india-news/bjp-had-flight-ready-for-goa-mlas-paid-them-15-crore-congress-sources-3148538", "urlToImage": "https://c.ndtvimg.com/2022-07/q092477c_goa-congress-generic-twitter_625x300_10_July_22.jpg", "publishedAt": "2022-07-11T16:08:17Z", "content": "A top BJP leader, sources in the Congress said, was personally in touch with Congress MLAs\r\nMumbai: A day after firefighting in Goa to keep its flock together, leaders of the Congress, off the record… [+2607 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Video: Woman Slips, Gets Dragged By Train, Saved By Alert Cop", "description": "A railway security personnel, standing at the gate of a moving train, doggedly held on to a woman's hand as she was dragged for a few metres after she slipped in the gap between the platform and the rail coach at the Varanasi Cantonment station.", "url": "https://www.ndtv.com/india-news/video-woman-slips-gets-dragged-by-train-saved-by-alert-cop-3148520", "urlToImage": "https://c.ndtvimg.com/2022-07/p0u78l8o_railway-accident-varanasi_625x300_11_July_22.jpg", "publishedAt": "2022-07-11T16:02:16Z", "content": "Parvati Devi slipped while trying to board Lichchavi Express as it was pulling out of the station.\r\nVaranasi: A railway security personnel, standing at the gate of a moving train, doggedly held on to… [+630 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Viral Video: Snake Found Curled Up In Shoe Rescued By Trained Personnel", "description": "A snake was recently found curled up inside a shoe and a scary video of the rescue mission has surfaced on social media.", "url": "https://www.ndtv.com/offbeat/viral-video-snake-found-curled-up-in-shoe-rescued-by-trained-personnel-3148495", "urlToImage": "https://c.ndtvimg.com/2022-07/fnu2ci5g_snake-in-shoe_625x300_11_July_22.jpg", "publishedAt": "2022-07-11T15:56:20Z", "content": "The video has garnered more than 101,000 views and more than 3,400 likes.\r\nA snake was recently found curled up inside a shoe and a scary video of the rescue mission has surfaced on social media. \r\nI… [+1912 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rs 22-Crore Worth Cash, Jewellery Seized From Bengaluru, Hyderabad Realty Groups", "description": "The Income Tax Department has seized cash and jewellery worth Rs 22 crore after it recently raided two \"leading\" real estate groups based in Bengaluru and Hyderabad, the CBDT said on Monday.", "url": "https://www.ndtv.com/india-news/income-tax-department-seizes-rs-22-crore-worth-cash-jewellery-after-raids-at-bengaluru-hyderabad-realty-groups-3148494", "urlToImage": "https://c.ndtvimg.com/2019-01/qgajmuuo_indian-rupee-generic_625x300_15_January_19.jpg", "publishedAt": "2022-07-11T15:56:03Z", "content": "A total of 40 premises were covered during the undated raids.\r\nNew Delhi: The Income Tax Department has seized cash and jewellery worth Rs 22 crore after it recently raided two \"leading\" real estate … [+2313 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "On CCTV, Speeding Car's Dramatic Crash Into Pick-Up Van In Himachal", "description": "In a chilling rash driving accident on Sunday morning, caught on camera, a speeding car hit a lorry in the Dharamshala-Palampur road in Himachal Pradesh.", "url": "https://www.ndtv.com/india-news/dharamshala-accident-on-cctv-speeding-cars-dramatic-crash-into-lorry-in-dharamshala-3148463", "urlToImage": "https://c.ndtvimg.com/2022-07/eck49fno_dharamshala-accident_625x300_11_July_22.jpg", "publishedAt": "2022-07-11T15:45:57Z", "content": "Dharamshala Accident: The accident is reported to have taken place near Badol village.\r\nDharamshala: In a chilling rash driving accident on Sunday morning, caught on camera, a speeding car hit a pick… [+359 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UK Issues Extreme Heat Warning As Temperatures Soar", "description": "Britain on Monday issued an extreme heat warning, with temperatures predicted to hit more than 30 degrees Celsius (86 Fahrenheit) across large parts of England and Wales.", "url": "https://www.ndtv.com/world-news/uk-issues-extreme-heat-warning-as-temperatures-soar-3148448", "urlToImage": "https://c.ndtvimg.com/2022-07/lqlctkeo_uk-summer-generic-afp_625x300_11_July_22.jpg", "publishedAt": "2022-07-11T15:41:34Z", "content": "Britain on Monday issued an extreme heat warning.\r\nLondon, United Kingdom: Britain on Monday issued an extreme heat warning, with temperatures predicted to hit more than 30 degrees Celsius (86 Fahren… [+1576 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Delhi Government Launches Chatbot To Answer Queries On Electric Vehicles", "description": "Delhi Government launched a new WhatsApp chatbot to answer queries related to electric vehicles. From how to procure e-vehicles to their price range and incentives, the chatbot will answer all possible queries.", "url": "https://www.ndtv.com/delhi-news/delhi-government-launches-whatsapp-chatbot-to-answer-queries-on-electric-vehicles-3148403", "urlToImage": "https://c.ndtvimg.com/2022-06/525fobro_electric-car-battery_625x300_24_June_22.jpg", "publishedAt": "2022-07-11T15:29:44Z", "content": "Send a 'hello' at 98103 36008 for queries, Delhi Transport Commissioner said. (Representational)\r\nNew Delhi: From how to procure e-vehicles to their price range and incentives, the Delhi government's… [+2177 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "London Train Tracks Burst Into Flames Amid Soaring Temperatures In UK", "description": "Train tracks caught fire on a bridge in London on July 11 after a spark ignited timber beams amid soaring temperatures in the city. The incident occurred on the track between Wandsworth Road and London Victoria.", "url": "https://www.ndtv.com/world-news/london-train-tracks-burst-into-flames-amid-soaring-temperatures-in-uk-3148365", "urlToImage": "https://c.ndtvimg.com/2022-07/3qmc5um_fire-on-train-track_625x300_11_July_22.jpg", "publishedAt": "2022-07-11T15:19:08Z", "content": "The fire has since been extinguished.\r\nTrain tracks caught fire on a bridge in London on July 11 after a spark ignited timber beams amid soaring temperatures in the city. \r\nAccording to the Express, … [+2140 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Mridusmita Deka", "title": "IIT Delhi Inaugurates New Census Data Workstation", "description": "The new census data workstation at IIT Delhi seeks to facilitate access to census microdata for academicians and researchers. It will also help spread further awareness about the vast amount of data collected during the Census operations.", "url": "https://www.ndtv.com/education/iit-delhi-inaugurates-new-census-data-workstation-help-academics-researchers-access-census-microdata", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/11/iit-delhi-humanities-department-census-workstation-featured-image.jpg", "publishedAt": "2022-07-11T15:18:14Z", "content": "New Delhi:The Indian Institute of Technology (IIT) Delhi has inaugurated a new census workstation at the Economics Lab of Department of Humanities and Social Sciences. The Registrar General and Censu… [+1171 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Consider Framing Act: Supreme Court To Centre On Bail Pleas", "description": "The Supreme Court Monday directed the Centre to consider framing a \"Bail Act\" to streamline the grant of bail, a recommendation that assumes significance given the pendency of bail pleas.", "url": "https://www.ndtv.com/india-news/consider-framing-act-supreme-court-to-centre-on-bail-pleas-bail-act-supreme-court-on-bail-pleas-3148352", "urlToImage": "https://c.ndtvimg.com/2022-02/a1ooga8_supreme-court-of-india_650x400_14_February_22.jpg", "publishedAt": "2022-07-11T15:15:28Z", "content": "The Supreme Court directed all state governments, UTs, high courts to file status report in 4 months.\r\nNew Delhi: The Supreme Court Monday directed the Centre to consider framing a \"Bail Act\" to stre… [+1433 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "UK's Sajid Javid Sets Out Tax-Cutting Plan In Pitch To Be PM", "description": "Sajid Javid, a contender to replace Boris Johnson as Britain's prime minister, said on Monday he would cut a slew of taxes and hold an emergency budget to increase help for households hit by the rising cost of living if he was chosen as leader.", "url": "https://www.ndtv.com/world-news/uks-sajid-javid-sets-out-tax-cutting-plan-in-pitch-to-be-pm-3148229", "urlToImage": "https://c.ndtvimg.com/2019-07/0enksgag_sajid-javid-reuters_625x300_25_July_19.jpg", "publishedAt": "2022-07-11T15:13:05Z", "content": "Sajid Javid said he would bring forward an income tax cut, halt a corporation tax rise.\r\nLondon: Sajid Javid, a contender to replace Boris Johnson as Britain's prime minister, said on Monday he would… [+1839 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Customs Department Seizes Gold Worth Rs 1.38 Crore At Chennai Airport", "description": "Gold weighing over three kilograms worth Rs 1.38 crore was seized at the international airport in Chennai and two passengers were arrested in this connection, the customs department said.", "url": "https://www.ndtv.com/tamil-nadu-news/customs-department-seizes-gold-worth-rs-1-38-crore-at-chennai-airport-3148327", "urlToImage": "https://c.ndtvimg.com/2022-07/sifv308o_chennai-customs-650_625x300_11_July_22.jpg", "publishedAt": "2022-07-11T15:07:52Z", "content": "The customs department was acting on specific inputs regarding 2 passengers.\r\nChennai: Gold weighing over three kilograms worth Rs 1.38 crore was seized at the international airport in Chennai and tw… [+587 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Parameswaran Iyer, Swachh Bharat Mission Lead, Is NITI's New Aayog CEO", "description": "Parameswaran Iyer, who had spearheaded the implementation of the flagship USD 20 billion Swachh Bharat Mission, on Monday took charge as the CEO of NITI Aayog.", "url": "https://www.ndtv.com/india-news/parameswaran-iyer-niti-aayog-ceo-parameswaran-iyer-swachh-bharat-mission-lead-is-nitis-new-aayog-ceo-3148314", "urlToImage": "https://c.ndtvimg.com/2022-07/fb5n8q18_parameswaran-iyer_625x300_11_July_22.jpg", "publishedAt": "2022-07-11T15:02:06Z", "content": "Parameswaran Iyer spearheaded the implementation of the Swachh Bharat Mission.\r\nNew Delhi: Parameswaran Iyer, who had spearheaded the implementation of the flagship USD 20 billion Swachh Bharat Missi… [+1229 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "India's June Oil Imports From Russia Surge To Record High: Report", "description": "India's oil imports from Russia surged to a record of around 950,000 barrels per day (bpd) in June, accounting for nearly a fifth of overall imports by the world's third largest oil consumer, data provided by trade sources showed.", "url": "https://www.ndtv.com/india-news/india-oil-import-from-russia-indias-june-oil-imports-from-russia-surges-to-record-high-report-3148276", "urlToImage": "https://c.ndtvimg.com/2022-07/6n69ej24_india-oil-import-from-russia_625x300_11_July_22.jpg", "publishedAt": "2022-07-11T14:49:17Z", "content": "India Oil Import From Russia: India's oil imports from Russia surged to a record.\r\nNew Delhi: India's oil imports from Russia surged to a record of around 950,000 barrels per day (bpd) in June, accou… [+2358 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Virat Kohli Sustains Groin Strain, Likely To Miss 1st England ODI: Report", "description": "It has been learnt that Kohli didn't travel from Nottingham to London in the team bus and the reason could be a stopover to get a medical check-up done to assess his condition.", "url": "https://sports.ndtv.com/england-vs-india-2022/virat-kohli-sustains-groin-strain-likely-to-miss-1st-england-odi-report-3148275", "urlToImage": "https://c.ndtvimg.com/2022-07/42t9p1r8_virat-kohli-dejected-afp_625x300_11_July_22.jpeg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-11T14:49:03Z", "content": "Virat Kohli is likely to miss the first ODI against England at the Oval on Tuesday after sustaining a groin strain during the third T20 International. The extent of Kohli's niggle is still not known,… [+1783 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Severe Flooding, Damage In Pakistan's Karachi Amid Record Monsoon Rains", "description": "Torrential rains caused widespread flooding and damage in Pakistan's financial capital Karachi on Monday, even inundating the business district, officials said.", "url": "https://www.ndtv.com/world-news/pakistan-heavy-rainfall-severe-flooding-damage-in-pakistans-karachi-amid-record-monsoon-rains-3148106", "urlToImage": "https://c.ndtvimg.com/2022-07/bd26i4f_pakistan-heavy-rainfall-reuters_625x300_11_July_22.jpg", "publishedAt": "2022-07-11T14:48:10Z", "content": "Pakistan Heavy Rainfall: The metrological office has forecast more rains in coming days.\r\nKarachi: Torrential rains caused widespread flooding and damage in Pakistan's financial capital Karachi on Mo… [+1660 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Parliament To Elect New Sri Lankan President On July 20, Says Speaker", "description": "Sri Lanka Crisis: The Sri Lankan Parliament will elect the new president to succeed Gotabaya Rajapaksa on July 20, Speaker Mahinda Yapa Abeywardena announced on Monday.", "url": "https://www.ndtv.com/world-news/sri-lanka-crisis-parliament-to-elect-new-sri-lankan-president-on-july-20-says-speaker-3148245", "urlToImage": "https://c.ndtvimg.com/2022-07/jcdikd6_sri-lanka-protest_625x300_10_July_22.jpg", "publishedAt": "2022-07-11T14:40:54Z", "content": "A parliamentary ballot will be held on July 20 to elect the new president, the speaker said.\r\nColombo: The Sri Lankan Parliament will elect the new president to succeed Gotabaya Rajapaksa on July 20,… [+2767 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "\"You Don't Take Rest During IPL...\": Sunil Gavaskar Slams India Players", "description": "While saying that the Test matches take a toll on a player's mind and body, Gavaskar stressed that players shouldn't skip limited-overs cricket, especially the T20Is.", "url": "https://sports.ndtv.com/cricket/you-dont-take-rest-during-ipl-sunil-gavaskar-slams-india-players-3148227", "urlToImage": "https://c.ndtvimg.com/2022-03/4b24gmpo_sunil-gavaskar_625x300_08_March_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-11T14:36:37Z", "content": "Former India batting legend Sunil Gavaskar is not happy with the fact that some senior players get rested during the Indian cricket team's international calendar. Gavaskar in an interview slammed sen… [+1327 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Rashi Hardaha", "title": "IIT Gandhinagar Student Bags Cargill Global Scholarship For 2021-22", "description": "Progyan Das will receive a significant scholarship award for two years and will get to attend leadership development conferences/seminars, networking events, case study presentations, and one-on-one mentoring programmes organised by Cargill in India and abroa…", "url": "https://www.ndtv.com/education/iit-gandhinagar-student-bags-cargill-global-scholarship-for-2021-22", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/11/Progyan_Das_HZqzgqP.jpg", "publishedAt": "2022-07-11T14:24:06Z", "content": "New Delhi:Progyan Das, a Bachelor of Technology (BTech) student at the Indian Institute of Technology (IIT) Gandhinagar, has been awarded Cargill Global Scholarship for the year 2021-22. Mr Das is a … [+1229 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Byju's Struggles To Raise Latest $800 Million Funding As Investors Resist", "description": "Indian online education provider Byju's is struggling to close a funding round of $800 million as a global technology rout weighs on valuations.", "url": "https://www.ndtv.com/business/byjus-struggles-to-raise-latest-800-million-funding-as-investors-resist-puts-2-2-billion-valuation-under-risk-3148170", "urlToImage": "https://c.ndtvimg.com/2022-07/4eqofh6o_bloomberg-image_625x300_11_July_22.jpg", "publishedAt": "2022-07-11T14:21:42Z", "content": "Byjus Struggles to Close $800 Million Funding as Investors Balk\r\nIndian online education provider Byju's is struggling to close a funding round of $800 million as a global technology rout weighs on v… [+1739 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Population Imbalance\" Shouldn't Be Allowed To Happen: Yogi Adityanath", "description": "Uttar Pradesh Chief Minister Yogi Adityanath on Monday said population control programme must go ahead successfully but at the same time \"population imbalance\" should not be allowed to happen.", "url": "https://www.ndtv.com/india-news/uttar-pradesh-chief-minister-yogi-adityanath-population-imbalance-should-not-be-allowed-to-happen-3147179", "urlToImage": "https://c.ndtvimg.com/2022-05/bljp2eqg_yogi-adityanath_625x300_05_May_22.jpg", "publishedAt": "2022-07-11T14:18:57Z", "content": "Yogi Adityanath said population control programme must go ahead successfully. (File)\r\nLucknow: Uttar Pradesh Chief Minister Yogi Adityanath on Monday said population control programme must go ahead s… [+1427 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Adarsh Srivastava", "title": "NEET UG 2022 Exam On July 17: Paper Pattern; Marking Scheme Explain", "description": "The National Eligibility cum Entrance Test Undergraduate (NEET UG) 2022 for admission to various undergraduate medical courses is set to be held on Sunday, July 17, 2022.", "url": "https://www.ndtv.com/education/neet-ug-2022-exam-on-july-17-paper-pattern-marking-scheme-explained", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/11/NEET-UG-2022-Admit-Card-Soon.jpg", "publishedAt": "2022-07-11T14:18:13Z", "content": "New Delhi:NEET UG 2022: The National Eligibility cum Entrance Test Undergraduate (NEET UG) 2022 for admission to various undergraduate medical courses is set to be held on Sunday, July 17, 2022. The … [+2417 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Trinamool Pitches \"Bengal Model\" To Tripura, Sets Up Office In Agartala", "description": "Mamata Banerjee's party recently set up headquarters in 2 other north-eastern states, Assam and Meghalaya; ambition in Tripura tied to linguistics too", "url": "https://www.ndtv.com/india-news/trinamool-pitches-bengal-model-to-tripura-sets-up-office-in-agartala-10-months-before-polls-3148153", "urlToImage": "https://c.ndtvimg.com/2022-03/socaa9ug_mamata-banerjee-ani-240_625x300_09_March_22.jpeg", "publishedAt": "2022-07-11T14:16:58Z", "content": "Agartala\r\nThe \"Bengal model of governance\" will be Trinamool Congress's (TMC) pitch in Tripura elections due next year as Mamata Banerjee's party seeks to expand its base outside West Bengal. The par… [+1700 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Adarsh Srivastava", "title": "JKBOSE 10th Jammu Division Result 2022: Expected Date, Website", "description": "The Jammu and Kashmir  Board of School Education (JKBOSE) is likely to announce the Jammu Division Class 10 result 2022 soon. JKBOSE 10th result 2022 for Jammu summer division will be declared on the official website.", "url": "https://www.ndtv.com/education/jkbose-10th-jammu-division-result-2022-expected-date-website-check", "urlToImage": "https://cache.careers360.mobi/media/presets/860X430/article_images/2022/7/11/JKBOSE-Jammu-Division-10th-Result-2022-Soon.jpg", "publishedAt": "2022-07-11T14:11:59Z", "content": "New Delhi:JKBOSE Jammu Division 10th Result 2022: The Jammu and Kashmir Board of School Education (JKBOSE) is likely to announce the Jammu Division Class 10 result 2022 soon. JKBOSE 10th result 2022 … [+1603 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russian Parliament Gets Proposal For Putin To Be Called \"Ruler\": Report", "description": "Loyalists to Russian leader Vladimir Putin have said that he should be referred to as the country's \"ruler\" rather than \"president\" in order to move away from terms derived from Western language.", "url": "https://www.ndtv.com/world-news/russian-parliament-gets-proposal-for-vladimir-putin-to-be-called-ruler-instead-of-president-report-3148097", "urlToImage": "https://c.ndtvimg.com/2022-04/ig4aoe6o_vladimir-putin_625x300_28_April_22.jpg", "publishedAt": "2022-07-11T14:07:26Z", "content": "LDPR suggested two options: either a ruler or a head of state. (File)\r\nLoyalists to Russian leader Vladimir Putin have said that he should be referred to as the country's ruler rather than president … [+1846 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Opposition In Bihar To Support Yashwant Sinha In Presidential Polls", "description": "The Rashtriya Janata Dal-led opposition parties of Bihar, including its estranged ally Congress and the Left on Monday reaffirmed their support for Yashwant Sinha for the upcoming presidential polls.", "url": "https://www.ndtv.com/india-news/bihar-opposition-parties-to-support-yashwant-sinha-in-presidential-polls-3148089", "urlToImage": "https://c.ndtvimg.com/2022-07/spa461l_yashwant-sinha_625x300_08_July_22.jpg", "publishedAt": "2022-07-11T14:02:02Z", "content": "The Rashtriya Janata Dal, Congress and the Left together have 115 MLAs in Bihar Assembly. (File)\r\nPatna: The Rashtriya Janata Dal-led opposition parties of Bihar, including its estranged ally Congres… [+1341 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Court Restrains Man From Proceeding With Divorce Case In Canadian Court", "description": "Delhi High Court has restrained a man from proceeding with his divorce suit filed before Canadian court while taking a serious view of fact that he has \"deliberately avoided\" divorce proceedings pending in India and continued to pursue case abroad.", "url": "https://www.ndtv.com/india-news/delhi-high-court-restrains-man-from-proceeding-with-divorce-case-in-canadian-court-3148048", "urlToImage": "https://c.ndtvimg.com/2019-07/att9hsso_court-generic_625x300_27_July_19.jpg", "publishedAt": "2022-07-11T13:54:04Z", "content": "The high court said it was clear that the man has deliberately avoided service in the divorce petition.\r\nNew Delhi: The Delhi High Court has restrained a man from proceeding with his divorce suit fil… [+3640 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Hitler-Like Mindset\" Torch Buildings: Lankan PM Reacts To Arson Attack", "description": "Sri Lankan Prime Minister Ranil Wickremesinghe gave his first public reaction after his private residence was set on fire and said only people with a \"Hitler-like mindset\" torch buildings.", "url": "https://www.ndtv.com/world-news/hitler-like-mindsets-torch-buidling-sri-lankan-pm-reacts-to-arson-attack-on-house-3148041", "urlToImage": "https://c.ndtvimg.com/2022-06/a8ou5sgo_sri-lanka-pm-reuters_625x300_07_June_22.jpg", "publishedAt": "2022-07-11T13:51:43Z", "content": "Sri Lankan Prime Minister said \"there were over 200-year-old valuable paintings in the house\". (File)\r\nColombo: Reacting publicly for the first time after his private house was set on fire by anti-go… [+3738 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Mridusmita Deka", "title": "CUET 2022 Exam From July 15: Check Preparation Tips To Ace", "description": "CUET UG 2022: As per the CUET 2022 entrance exam pattern, the CUET UG question paper will have four sections. The CUET 2022 question paper will include a compulsory language test, two domain-specific tests, and a general test.", "url": "https://www.ndtv.com/education/cuet-ug-2022-exam-from-july-15-check-preparation-tips-ace-common-university-entrance-test", "urlToImage": "https://cache.careers360.mobi/media/presets/1280X853/article_images/2022/7/11/exam-tips-featured-image.jpg", "publishedAt": "2022-07-11T13:51:27Z", "content": "New Delhi:The Common Universities Entrance Test Undergraduate (CUET UG) will be held from July 15. As per the CUET 2022 entrance exam pattern, the CUET UG question paper will have four sections. The … [+2670 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Fact-Checker Mohammed Zubair Moves Delhi Court For Bail In 2018 Tweet Case", "description": "Alt News co-founder Mohammed Zubair on Monday moved a bail petition in Sessions Court seeking bail in the Delhi FIR registered against him in a case related to an alleged objectionable tweet.", "url": "https://www.ndtv.com/india-news/fact-checker-mohammed-zubair-moves-delhi-court-for-bail-in-2018-tweet-case-3147944", "urlToImage": "https://c.ndtvimg.com/2022-07/55pi6i5_mohammad-zubair-ani-650_650x400_07_July_22.jpg", "publishedAt": "2022-07-11T13:41:19Z", "content": "Delhi Police said that Mohammed Zubair was evasive during questioning.\r\nNew Delhi: Alt News co-founder Mohammed Zubair on Monday moved a bail petition in Sessions Court seeking bail in the Delhi FIR … [+3248 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Binance Served Crypto Traders In Iran For Years Despite Sanctions: Report", "description": "The world's largest crypto exchange, Binance, continued to process trades by clients in Iran despite US sanctions and a company ban on doing business there, a Reuters investigation has found.", "url": "https://www.ndtv.com/business/binance-served-crypto-traders-in-iran-for-years-despite-sanctions-report-3147995", "urlToImage": "https://c.ndtvimg.com/2022-07/9a8eqqao_image_625x300_11_July_22.jpg", "publishedAt": "2022-07-11T13:34:03Z", "content": "Binance served crypto traders in Iran for years despite US sanctions: Report\r\nThe world's largest crypto exchange, Binance, continued to process trades by clients in Iran despite US sanctions and a c… [+11676 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "CBI Files Chargesheet In Foreign Fund Case; Home Ministry Officials Named", "description": "The CBI has filed a charge sheet against Home Ministry officials and others arrested over alleged bribery involved in facilitating clearances of global donations to NGOs in violation of India's foreign exchange law, officials said Monday.", "url": "https://www.ndtv.com/india-news/foreign-contribution-regulation-act-bribery-case-cbi-files-chargesheet-in-foreign-fund-case-home-ministry-officials-named-3147870", "urlToImage": "https://c.ndtvimg.com/2021-08/fo97nvac_cbi-building-facebook_625x300_25_August_21.jpeg", "publishedAt": "2022-07-11T13:31:31Z", "content": "Foreign Contribution Regulation Act Bribery Case: CBI filed charge sheet against Home Ministry officials.\r\nNew Delhi: The CBI has filed a charge sheet against Home Ministry officials and others arres… [+1021 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Rashi Hardaha", "title": "AILET 2022: Second Merit List For BA LLB Programme Released", "description": "AILET 2022: The law aspirants can check the AILET 2022 BA LLB merit list by visiting the official website-- nationallawuniversitydelhi.in. The candidates who appear in the provisional merit list of selected candidates for the BA LLB programme have to pay thei…", "url": "https://www.ndtv.com/education/ailet-2022-second-merit-list-for-ba-llb-programme-released-direct-link-here", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/7/11/shutterstock_1606120426.jpg", "publishedAt": "2022-07-11T13:31:30Z", "content": "AILET 2022: The National Law University (NLU), Delhi has released the second merit list for the All India Law Entrance Test (AILET) 2022 BA LLB programme. The law aspirants can check the AILET 2022 B… [+1890 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "TikTok Warned About Alleged Breach Of Privacy Rules: Italy's Watchdog", "description": "Italy's data protection authority has formally warned Chinese-owned short video-sharing app TikTok about an alleged breach of existing EU rules to safeguard users' privacy, the watchdog said on Monday.", "url": "https://www.ndtv.com/business/tiktok-warned-about-alleged-breach-of-privacy-rules-italys-watchdog-3147964", "urlToImage": "https://c.ndtvimg.com/2022-07/bnkd822o_image_625x300_11_July_22.jpg", "publishedAt": "2022-07-11T13:24:44Z", "content": "Italy's watchdog warns TikTok about alleged breach of EU privacy rules\r\nItaly's data protection authority has formally warned Chinese-owned short video-sharing app TikTok about an alleged breach of e… [+601 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Sports Desk", "title": "Prabath Jayasuriya Enters Elite Club With 12 wickets On Test Debut For SL", "description": "In scalping 12/177 in his debut Test, Prabath Jayasuriya entered an elite club", "url": "https://sports.ndtv.com/cricket/prabath-jayasuriya-enters-elite-club-with-12-wickets-on-test-debut-for-sri-lanka-against-australia-3147962", "urlToImage": "https://c.ndtvimg.com/2022-07/tsu52b7g_prabath-jayasuriya_625x300_11_July_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-07-11T13:24:13Z", "content": "Not often does one hear about a player making international debut at the age of 30. Prabath Jayasuriya is one such case. Less than six months shy of turning 31, the left-arm spinner was handed his de… [+2984 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Do They Have Faith In The Army's Statement On China: BJP Slams Congress", "description": "The BJP slammed Congress over its criticism of the government on the alleged \"Chinese infiltration\". BJP spokesperson Sudhanshu Trivedi said, \"I want to ask the Congress if it has trust in the Indian Army or not.\"", "url": "https://www.ndtv.com/india-news/do-they-have-faith-in-the-indian-armys-statement-bjp-slams-congress-on-china-3147960", "urlToImage": "https://c.ndtvimg.com/2022-07/3snhaa2_sudhanshu-trivedi-650_625x300_11_July_22.jpg", "publishedAt": "2022-07-11T13:24:10Z", "content": "BJP's Sudhanshu Trivedi attacked Congress on the National Hearld case.\r\nNew Delhi: The BJP took a swipe at the Congress on Monday over its criticism of the government on the alleged Chinese infiltrat… [+2682 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "3 Trees Cut Every Hour In Delhi In Past Three Years, Delhi High Court Told", "description": "Three trees were cut every hour in the past three years in the national capital and the estimate does not include instances of illegal felling, the Delhi High Court was told on Monday.", "url": "https://www.ndtv.com/india-news/3-years-cut-every-hour-in-delhi-in-past-three-years-delhi-high-court-told-3147750", "urlToImage": "https://c.ndtvimg.com/2022-05/t72t3c1g_delhi-high-court-650_625x300_11_May_22.jpg", "publishedAt": "2022-07-11T13:22:58Z", "content": "Delhi: Three trees were cut every hour in the past three years, Delhi High Court was told.\r\nNew Delhi: Three trees were cut every hour in the past three years in the national capital and the estimate… [+3356 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Vladimir Putin Fast-Tracks Russian Citizenship For Ukrainians By Decree", "description": "Russian President Vladimir Putin on Monday issued a decree to fast-track citizenship for all Ukrainians, more than four months into Moscow's military offensive in Ukraine.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-vladimir-putin-fast-tracks-russian-citizenship-for-ukrainians-by-decree-3147931", "urlToImage": "https://c.ndtvimg.com/2022-04/dltv7e5_vladimir-putin-afp-photo_625x300_19_April_22.jpg", "publishedAt": "2022-07-11T13:19:24Z", "content": "Vladimir Putin had already fast-tracked citizenship for residents of two regions of Ukraine.(File)\r\nMoscow: Russian President Vladimir Putin on Monday issued a decree to fast-track citizenship for al… [+927 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Jammu Man Arrested For Posting Cow Slaughter Photo On Social Media: Cops", "description": "A man was arrested in Jammu and Kashmir's Rajouri district on Monday for allegedly hurting the religious sentiments of a community by deliberately circulating a photograph of cow slaughter on social media, police said.", "url": "https://www.ndtv.com/india-news/jammu-kashmir-news-jammu-man-arrested-for-posting-cow-slaughter-photo-on-social-media-cops-3147266", "urlToImage": "https://i.ndtvimg.com/i/2016-05/arrest-generic_650x400_71463458726.jpg", "publishedAt": "2022-07-11T13:12:16Z", "content": "Jammu-Kashmir: The accused deliberately circulated the photograph of animal slaughter.\r\nJammu: A man was arrested in Jammu and Kashmir's Rajouri district on Monday for allegedly hurting the religious… [+912 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Fake IPL Set Up To Dupe Russian Punters Busted In Gujarat, 4 arrested", "description": "In a bizarre incident, a gang in Gujarat almost pulled off an elaborate con by creating a fake Indian Premier League (IPL) tournament and duping Russian punters who bet money on such cricket matches.", "url": "https://www.ndtv.com/offbeat/mimicking-commentators-to-crowd-noise-effects-this-is-how-fake-ipl-set-up-in-gujarat-duped-russian-betters-3147882", "urlToImage": "https://c.ndtvimg.com/2021-11/p0m0bcqg_cricket-generic_625x300_08_November_21.jpg", "publishedAt": "2022-07-11T13:09:02Z", "content": "Gujarat police has arrested four gang members. (Representative Photo)\r\nIn a bizarre incident, a gang in Gujarat almost pulled off an elaborate con by creating a fake Indian Premier League (IPL) tourn… [+2389 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Class 12 Student Arrested Over Facebook Post Against Yogi Adityanath", "description": "Police arrested a Class 12 student for allegedly posting an objectionable photograph of Uttar Pradesh Chief Minister Yogi Adityanath on Facebook, police said on Monday.", "url": "https://www.ndtv.com/india-news/uttar-pradesh-class-12-student-arrested-over-facebook-post-against-yogi-adityanath-3147308", "urlToImage": "https://i.ndtvimg.com/i/2016-05/arrest-generic_650x400_71463458726.jpg", "publishedAt": "2022-07-11T13:07:56Z", "content": "Police arrested a student for posting an objectionable photograph of Yogi Adityanath. (Representational)\r\nKannauj: Police arrested a Class 12 student for allegedly posting an objectionable photograph… [+475 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ranveer-Deepika's New Rs 119 Crore Home Is In This Mumbai Building", "description": "The quadruplex is likely to serve as the primary home", "url": "https://www.ndtv.com/entertainment/ranveer-singh-and-deepika-padukones-new-rs-119-crore-property-is-4-floors-in-this-mumbai-apartment-complex-3147868", "urlToImage": "https://c.ndtvimg.com/2022-07/skg0clo_deepika_625x300_11_July_22.jpg", "publishedAt": "2022-07-11T13:04:40Z", "content": "anveer Singh and Deepika Padukone pictured at airport\r\nIn one of the biggest residential apartment deals in the country, Bollywood actor Ranveer Singh has bought a sea-facing quadruplex in suburban B… [+2039 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "How Will Import Duty Cut On Edible Oil Boost Supply, Asks Government", "description": "Amid demands for reducing import duty on oil varieties, the government has asked edible oil associations to explain how will that help boost domestic availability.", "url": "https://www.ndtv.com/business/explain-how-import-duty-cut-on-two-edible-oil-varieties-will-help-boost-supply-govt-to-industry-bodies-3147866", "urlToImage": "https://i.ndtvimg.com/i/2015-06/edible-oil-650_650x488_61434033194.jpg", "publishedAt": "2022-07-11T13:03:32Z", "content": "Explain how import duty cut on edible oil will boost supply, asks government\r\nNew Delhi: Amid demands for reducing import duty on rice bran oil and olive pomace oil, the government has asked edible o… [+2130 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Anand Mahindra Replies To Question On Tata Motors, Wins Internet", "description": "Last week, Anand Mahindra was trending on Twitter for his response to a user's question if he is an NRI.", "url": "https://www.ndtv.com/offbeat/anand-mahindra-replies-to-question-on-tata-motors-with-competition-spurs-innovation-tweet-wins-internet-3147862", "urlToImage": "https://c.ndtvimg.com/2022-01/cratntlo_anand-mahindra-pti_625x300_25_January_22.jpg", "publishedAt": "2022-07-11T13:01:29Z", "content": "Anand Mahindra often interacts with his followers on Twitter.\r\nIndustrialist Anand Mahindra often shares interesting posts on Twitter about business culture in India, life goals and vial content. The… [+2357 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sri Lanka President Flown To Airbase As Exile Rumours Spread: Report", "description": "Sri Lanka's embattled president was flown to an airbase near the main international airport Monday, officials said, raising speculation he will flee into exile abroad.", "url": "https://www.ndtv.com/world-news/gotabaya-rajapaksa-sri-lanka-president-flown-to-airbase-as-exile-rumours-spread-says-report-3147850", "urlToImage": "https://c.ndtvimg.com/2022-07/su76htcg_sri-lanka-predient-old-images_625x300_11_July_22.jpg", "publishedAt": "2022-07-11T12:59:29Z", "content": "Several local media reports speculated the president was set to leave for Dubai later today.(File)\r\nColombo: Sri Lanka's embattled president was flown to an airbase near the main international airpor… [+4300 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Liger Song Akdi Pakdi: Ananya And Vijay Deverakonda Rule The Dance Floor", "description": "Liger will release on August 25", "url": "https://www.ndtv.com/entertainment/liger-song-akdi-pakdi-ananya-panday-and-vijay-deverakonda-rule-the-dance-floor-3147786", "urlToImage": "https://c.ndtvimg.com/2022-07/3jd4ie6_ananya-panday_625x300_11_July_22.jpg", "publishedAt": "2022-07-11T12:40:47Z", "content": "A still from song. (courtesy: Sony Music India)\r\nThe makers of Liger, starring Ananya Panday and Vijay Deverakonda, have released the much-awaited song Akdi Pakdi. It's an upbeat track with impressiv… [+1530 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "RBI Unveils Rupee Settlement System For International Trade", "description": "The Reserve Bank of India unveiled a rupee settlement system for international trade, according to a notification on Monday.", "url": "https://www.ndtv.com/business/rbi-unveils-rupee-settlement-system-for-international-trade-3147752", "urlToImage": "https://c.ndtvimg.com/2022-07/9dtbkr3_image_625x300_11_July_22.jpg", "publishedAt": "2022-07-11T12:32:04Z", "content": "RBI notification on international trade settlement in Indian rupees\r\nThe Reserve Bank of India unveiled a rupee settlement system for international trade, according to a notification on Monday. \r\nUnd… [+852 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "At 25 Years And 10 Months, Royal Bengal Tiger \"Raja\" Dies", "description": "The oldest Royal Bengal Tiger in captivity in West Bengal has died at his shelter in Jaldapara forest of Alipurduar district, officials said on Monday.", "url": "https://www.ndtv.com/india-news/at-25-years-and-10-months-royal-bengal-tiger-raja-dies-3147736", "urlToImage": "https://c.ndtvimg.com/2022-07/ijalnu3s_raja-royal-bengal-tiger_625x300_11_July_22.jpg", "publishedAt": "2022-07-11T12:28:35Z", "content": "The carnivore died late on Sunday at the age 25 years and 10 months.\r\nKolkata: The oldest Royal Bengal Tiger in captivity in West Bengal has died at his shelter in Jaldapara forest of Alipurduar dist… [+1408 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Bengaluru To Become Free Of Stray Dogs Soon, Says Karnataka Minister", "description": "Karnataka Animal Husbandry Minister Prabhu Chauhan on Monday said that the animal husbandry department is keenly looking at making Bengaluru free of stray dogs.", "url": "https://www.ndtv.com/bangalore-news/karnataka-minister-prabhu-chauhan-says-bengaluru-to-become-free-of-stray-dogs-soon-3147731", "urlToImage": "https://c.ndtvimg.com/stray-dogs_625x300_1530522904654.jpg", "publishedAt": "2022-07-11T12:27:36Z", "content": "BBMP officials involved in the programme admitted that dog-catching is a big challenge.\r\nBengaluru (Karnataka): Karnataka Animal Husbandry Minister Prabhu Chauhan on Monday said that the animal husba… [+1656 chars]"}]}