{"status": "ok", "totalResults": 219, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": "Mridusmita Deka", "title": "RBSE 10th Result 2022 Live: Rajasthan Board Class 10 Result Today", "description": "BSER Result 2022: The 10th RBSE result 2022 Rajasthan board will be declared today at 3 pm for over 10 lakh students. Keep following this blog for latest updates on 10th Class result 2022 RBSE time, official website and direct link to download scorecard.", "url": "https://www.ndtv.com/education/rbse-class-10th-result-2022-live-updates-bser-rajasthan-board-results-declared-rajeduboard-rajasthan-gov-in-link-latest-news", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/6/12/rajasthan-rbse-class-10-result-2022-featured-image_Q5czm8n.jpg", "publishedAt": "2022-06-13T02:29:28Z", "content": "RBSE Result 2022: The Board of Secondary Education Rajasthan (BSER) will declare the Class 10 results for the 2022 board exams today, June 13. The Education Minister Bulaki Das Kalla will announce th… [+984 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Netflix Confirms \"Squid Game\" Season 2, Drops Brief Teaser", "description": "Officially confirming the return of Netflix's hit drama series 'Squid Game' for a second season, a brief teaser has been dropped by the streaming platform on Sunday.", "url": "https://www.ndtv.com/world-news/netflix-confirms-squid-game-season-2-drops-brief-teaser-3061568", "urlToImage": "https://c.ndtvimg.com/2021-12/ooo3k87o_squid-game_625x300_30_December_21.jpg", "publishedAt": "2022-06-13T02:22:19Z", "content": "Previously, in January, Netflix co-CEO Ted Sarandos officially confirmed more episodes were on the way.\r\nWashington: Officially confirming the return of Netflix's hit drama series 'Squid Game' for a … [+1589 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"UP CM Has Become...\": Asaduddin Owaisi Slams Prayagraj Demolition", "description": "AIMIM chief Asaduddin Owaisi on Sunday hit out at Uttar Pradesh Chief Minister Yogi Adityanath over demolition of the house of the main accused in Prayagraj violence, asserting that he was behaving like the Chief Justice of the Allahabad High Court.", "url": "https://www.ndtv.com/india-news/up-cm-has-become-asaduddin-owaisi-slams-prayagraj-demolition-3061567", "urlToImage": "https://c.ndtvimg.com/2021-11/gqe1gbu_owaisi_625x300_12_November_21.jpg", "publishedAt": "2022-06-13T02:21:34Z", "content": "Police said the accused had illegal weapons and objectionable posters at his home. (File)\r\nKutch: AIMIM chief Asaduddin Owaisi on Sunday hit out at Uttar Pradesh Chief Minister Yogi Adityanath over d… [+2654 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Mridusmita Deka", "title": "Rajasthan Class 10 Result For Over 10 Lakh Students Today", "description": "BSER Result 2022: Education Minister Bulaki Das Kalla will declare the Rajasthan Class 10 Result 2022 today at 3 pm. The RBSE 10th result 2022 can thereafter be downloaded from the BSER result websites -- rajeduboard.rajasthan.gov.in.", "url": "https://www.ndtv.com/education/rajasthan-class-10-result-2022-rbse-for-over-10-lakh-students-today-rajeduboard-rajasthan-gov-in", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/6/12/result-bser-class-10-today-2022-exam-featured-image.jpg", "publishedAt": "2022-06-13T02:15:09Z", "content": "New Delhi:The Board of Secondary Education Rajasthan (BSER) is set to announce the Class 10 exam result today, June 13. Education Minister Bulaki Das Kalla will declare the Rajasthan Class 10 Result … [+1920 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"My Apartment Vibrates\": New Yorkers On Noisy Helicopters In The City", "description": "After a period of blissful silence overhead due to the Covid-19 pandemic, New Yorkers are dealing again with a familiar problem: noisy helicopters.", "url": "https://www.ndtv.com/world-news/my-apartment-vibrates-new-yorkers-on-noisy-helicopters-in-the-city-3061560", "urlToImage": "https://c.ndtvimg.com/2020-08/c4qfcckk_new-york-generic_625x300_13_August_20.jpg", "publishedAt": "2022-06-13T02:00:14Z", "content": "Last year, New York received 25,821 calls to its hotline complaining about helicopter noise.\r\nNew York: After a period of blissful silence overhead due to the Covid-19 pandemic, New Yorkers are deali… [+3387 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Bride In Camouflage Trousers At War Wedding As Life Goes On In Ukraine", "description": "Air raid sirens wailed and one of the brides wore camouflage trousers as the Ukrainian army took a break from frontline fighting in the east to hold a double wedding Sunday.", "url": "https://www.ndtv.com/world-news/bride-in-camouflage-trousers-at-war-wedding-as-life-goes-on-in-ukraine-3061545", "urlToImage": "https://c.ndtvimg.com/2022-06/e0fp2o4o_ukraine-war-wedding-afp-650_625x300_13_June_22.jpg", "publishedAt": "2022-06-13T01:37:01Z", "content": "Ukraine war wedding: The couples went through traditional rituals.\r\nDruzhkivka, Ukraine: Air raid sirens wailed and one of the brides wore camouflage trousers as the Ukrainian army took a break from … [+3815 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russian Forces Blow Up Bridge Over Ukrainian River, Cut Escape Route", "description": "Russian forces have blown up a bridge linking the embattled Ukrainian city of Severodonetsk to another city across the river, cutting off a possible evacuation route for civilians, local officials said on Sunday.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-russian-forces-blow-up-bridge-over-ukrainian-river-cut-escape-route-3061538", "urlToImage": "https://c.ndtvimg.com/2022-06/q3e28c68_russia-ukraine-reuters_625x300_13_June_22.jpg", "publishedAt": "2022-06-13T01:33:09Z", "content": "Severodonetsk has become the epicenter of the battle for control over Ukraine's eastern Donbas region.\r\nKyiv: Russian forces have blown up a bridge linking the embattled Ukrainian city of Severodonet… [+4913 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "NASA Loses 2 Hurricane Monitoring Satellites On Launch", "description": "Two small NASA satellites that were meant to study hurricane development failed to enter orbit Sunday when their Astra rocket shut off before reaching the necessary altitude, the US space agency said.", "url": "https://www.ndtv.com/world-news/nasa-loses-2-hurricane-monitoring-satellites-on-launch-3061503", "urlToImage": "https://c.ndtvimg.com/2022-06/nbuqjnho_nasa-tropics-satellites-650_625x300_13_June_22.jpg", "publishedAt": "2022-06-13T01:19:19Z", "content": "NASA had described the TROPICS CubeSats as a constellation of six \"shoe-box sized\" satellites.\r\nWashington: Two small NASA satellites that were meant to study hurricane development failed to enter or… [+1586 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Clothes, Backpack Of Local Expert Missing With British Journalist Found", "description": "Search teams in Brazil's Amazon rainforest on Sunday said they had found clothing belonging to missing indigenous expert Bruno Pereira, who was traveling with British journalist Dom Phillips, and a backpack with a laptop.", "url": "https://www.ndtv.com/world-news/clothes-backpack-of-local-expert-missing-with-british-journalist-found-3061528", "urlToImage": "https://c.ndtvimg.com/2022-06/7a1vl5ms_british-journalist_625x300_13_June_22.jpg", "publishedAt": "2022-06-13T01:17:38Z", "content": "News of the pair's disappearance has resonated globally.\r\nAtalaia Do Norte (Brazil): Search teams in Brazil's Amazon rainforest on Sunday said they had found clothing belonging to missing indigenous … [+2984 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Protest At JNU As Ex-Student's House Razed Over Prayagraj Violence", "description": "The Jawaharlal Nehru University Students' Union (JNUSU) on Sunday staged a demonstration on the JNU campus against the demolition of the house of activist and former JNU student Afreen Fatima in Uttar Pradesh's Prayagraj.", "url": "https://www.ndtv.com/india-news/protest-at-jnu-as-ex-student-afreen-fatimas-house-razed-over-prayagraj-violence-3061404", "urlToImage": "https://c.ndtvimg.com/2022-06/prcc4oog_jnu-protest-for-afreen-fatima-650_625x300_13_June_22.jpg", "publishedAt": "2022-06-13T01:16:54Z", "content": "JNUSU members raised slogans against what they termed \"bulldozer raj\" in UP.\r\nNew Delhi: The Jawaharlal Nehru University Students' Union (JNUSU) on Sunday staged a demonstration on the JNU campus aga… [+1477 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Blast In Pune House During Washing Machine Repairing", "description": "An explosion was reported in a flat of a housing society in the Bhawani Peth area of Pune, informed police on Sunday.", "url": "https://www.ndtv.com/pune-news/blast-in-pune-house-during-washing-machine-repairing-3061442", "urlToImage": "https://c.ndtvimg.com/2022-06/6hd4q2so_washing-machine-blast-650_625x300_13_June_22.jpg", "publishedAt": "2022-06-13T01:15:15Z", "content": "Pune: The intensity of the explosion during washing machine repairing was low.\r\nPune: An explosion was reported in a flat of a housing society in the Bhawani Peth area of Pune, informed police on Sun… [+658 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Britain To Defy European Union By Scrapping Northern Ireland Trade Rules", "description": "Britain will propose overriding the rules that govern post-Brexit trade with Northern Ireland on Monday in a move that will inflame tensions with the European Union that have simmered since the protocol came into force in 2021.", "url": "https://www.ndtv.com/world-news/britain-to-defy-european-union-by-scrapping-northern-ireland-trade-rules-3061501", "urlToImage": "https://c.ndtvimg.com/2022-06/atbqrg54_boris-johnson-reuters_625x300_06_June_22.jpg", "publishedAt": "2022-06-13T00:56:08Z", "content": "Post-Brexit trade: EU believes any unilateral change could breach international law. (File)\r\nLondon: Britain will propose overriding the rules that govern post-Brexit trade with Northern Ireland on M… [+2519 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE: India Reported 8,582 New Covid Cases On Yesterday", "description": "India reported 8,582 new coronavirus cases on Sunday, while four more virus-related deaths increased the country's death count to 5,24,761, according to the health ministry.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-13-june-3061520", "urlToImage": "https://c.ndtvimg.com/2022-06/p7ulk0n8_india-covid-pti-_120x90_13_June_22.jpg?im=FaceCrop,algorithm=dnn,width=650,height=400", "publishedAt": "2022-06-13T00:28:17Z", "content": "India coronavirus live: The active cases stand at 44,513. (File)\r\nNew Delhi: India reported 8,582 new coronavirus cases on Sunday, while four more virus-related deaths increased the country's death c… [+325 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Must Address Mandated Issues To Rebuild Trust: India To World Trade Body", "description": "India on Sunday said that to rebuild trust and credibility of the World Trade Organisation (WTO), member countries must first address mandated issues, like the permanent solution to public stockholding, which was agreed nearly a decade ago.", "url": "https://www.ndtv.com/india-news/must-address-mandated-issues-to-rebuild-trust-india-to-world-trade-body-3061513", "urlToImage": "https://c.ndtvimg.com/2022-06/97qqoe9_piyush-goyal-in-geneva-ani-_120x90_13_June_22.jpg?im=FeatureCrop,algorithm=dnn,width=650,height=400", "publishedAt": "2022-06-13T00:05:25Z", "content": "Piyush Goyal said the current global food crisis is a reminder that the world must act now.\r\nGeneva: India on Sunday said that to rebuild trust and credibility of the World Trade Organisation (WTO), … [+1741 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "5 Killed In Multiple Shootings In Chicago Over Weekend: Report", "description": "While the US is discussing tough measures on gun violence, Chicago on Saturdaywitnessed multiple incidents of shootouts resulting in the death of five persons.", "url": "https://www.ndtv.com/world-news/us-gun-violence-us-shootings-5-killed-in-multiple-shootings-in-chicago-over-weekend-report-3061493", "urlToImage": "https://c.ndtvimg.com/2020-08/24en71ao_chicago-police-reuters_625x300_10_August_20.jpg", "publishedAt": "2022-06-12T23:51:38Z", "content": "In the most recent Chicago shooting, a man was killed and three others were injured. (File)\r\nChicago: While the US is discussing tough measures on gun violence, Chicago on Saturday witnessed multiple… [+2574 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Global Nuclear Arsenal To Grow For First Time Since Cold War: Think-Tank", "description": "The global nuclear arsenal is expected to grow in the coming years for the first time since the Cold War while the risk of such weapons being used is the greatest in decades, a leading conflict and armaments think-tank said on Monday.", "url": "https://www.ndtv.com/world-news/global-nuclear-arsenal-to-grow-for-first-time-since-cold-war-think-tank-3061504", "urlToImage": "https://i.ndtvimg.com/mt/2014-11/nuclear_missile_thinkstock_650.jpg", "publishedAt": "2022-06-12T23:41:18Z", "content": "Russia has the world's biggest nuclear arsenal with a total of 5,977 warheads. (Representational)\r\nStockholm: The global nuclear arsenal is expected to grow in the coming years for the first time sin… [+2252 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "France's Macron's Majority In Doubt After First Round Of Parliament Vote", "description": "French President Emmanuel Macron's centrist alliance was in danger of falling short of a majority after a first round of parliamentary elections on Sunday that saw a surge in support for a new leftwing coalition.", "url": "https://www.ndtv.com/world-news/frances-emmanuel-macrons-majority-in-doubt-after-first-round-of-parliament-vote-3061496", "urlToImage": "https://c.ndtvimg.com/2022-06/vc3059t4_macron-afp_625x300_04_June_22.jpg", "publishedAt": "2022-06-12T23:18:20Z", "content": "France: Sunday's vote followed presidential elections in April in which Macron secured second term (File)\r\nParis: French President Emmanuel Macron's centrist alliance was in danger of falling short o… [+4798 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Canada Probing Possible Bomb Threat To Its Parliament: Report", "description": "Canadian police are investigating a possible risk to national security that forced parliament to lock down for several hours on Saturday after border agents warned of a bomb threat, a government source said on Sunday.", "url": "https://www.ndtv.com/world-news/canada-probing-possible-bomb-threat-to-its-parliament-report-3061488", "urlToImage": "https://c.ndtvimg.com/2020-11/k9fsv1r8_canada-policeafp_625x300_02_November_20.jpg", "publishedAt": "2022-06-12T22:41:31Z", "content": "Canada: Police, without elaborating, said they have located \"two persons of interest\". (Representational)\r\nOttawa: Canadian police are investigating a possible risk to national security that forced p… [+1739 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Russian Universities To Accept Indian Students Leaving Ukraine: Envoy", "description": "Indian students who had to leave studies midway as they fled the Russia-Ukraine conflict will be offered admission in Russian universities without them losing out on their previous academic years, a Russian envoy said on Sunday.", "url": "https://www.ndtv.com/india-news/russian-universities-to-accept-indian-students-leaving-ukraine-envoy-3060728", "urlToImage": "https://c.ndtvimg.com/2022-03/29945mdg_indian-students-in-ukraine-afp-650_625x300_01_March_22.jpg", "publishedAt": "2022-06-12T21:50:35Z", "content": "The Russian envoy's statement came in response to queries by reporters. (File)\r\nThiruvananthapuram: Indian students who had to leave studies midway as they fled the Russia-Ukraine conflict will be of… [+2096 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "North Korea Fires Multiple Artillery Shots: South Korea", "description": "North Korea on Sunday fired multiple artillery shots between 8:07 a.m. and 11:03 a.m. local time, South Korea's military said.", "url": "https://www.ndtv.com/world-news/north-korea-fires-multiple-artillery-shots-south-korea-3061473", "urlToImage": "https://c.ndtvimg.com/2019-12/fclm347_north-korea-flag-reuters_625x300_21_December_19.jpg", "publishedAt": "2022-06-12T21:35:49Z", "content": "North Korea fired artillery shots between 8:07-11:03 a.m. local time, said South Korea (Representational)\r\nSeoul: North Korea on Sunday fired multiple artillery shots between 8:07 a.m. and 11:03 a.m.… [+750 chars]"}]}