{"status": "ok", "totalResults": 334, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Severe Poverty In Country Declined Under Modi Government: BJP Chief", "description": "Underlining that poverty has reduced during the last eight years under the BJP government, party president J P Nadda on Friday said PM Modi has started a new culture of development politics in the country.", "url": "https://www.ndtv.com/india-news/severe-poverty-in-country-declined-under-modi-government-bjp-chief-jp-nadda-2995693", "urlToImage": "https://c.ndtvimg.com/2022-03/1gdaq7hg_jp-nadda-ndtv-650_650x400_10_March_22.jpg", "publishedAt": "2022-05-21T01:55:51Z", "content": "BJP says it will celebrate the Modi government's 8th anniversary from May 30 to June 15.\r\nJaipur: Underlining that poverty has reduced during the last eight years under the BJP government, party pres… [+1673 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Mridusmita Deka", "title": "NEET PG 2022 LIVE: Postgraduate Medical Entrance Test Today", "description": "NEET PG 2022: NEET PG will be conducted as an online test for applicants seeking admission to MD, MS or Postgraduate Diploma programmes. NBE NEET PG 2022 exam timing is 9 am to 12:30 pm. Follow this blog for latest updates on NEET PG 2022 exam, reporting time…", "url": "https://www.ndtv.com/education/neet-pg-2022-live-updates-exam-analysis-answer-key-question-papers-cut-off-nbe-edu-in-latest-news", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/5/20/neet-featured-image.jpg", "publishedAt": "2022-05-21T01:10:52Z", "content": "NBE NEET PG 2022: The National Eligibility cum Entrance Test Postgraduate (NEET PG) will be held today, May 21. NEET PG 2022 will be conducted as an online test for applicants seeking admission to MD… [+1630 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV News Desk", "title": "Coronavirus LIVE: India Records 2,259 New COVID-19 Cases In 24 Hours", "description": "India recorded 2,259 new Covid cases in the last 24 hours, taking the total number of infections to 4,31,31,822. According to the Union Health Ministry, the active cases dipped to 15,044 on Friday.", "url": "https://www.ndtv.com/india-news/coronavirus-india-live-updates-coronavirus-cases-today-covid-19-cases-in-india-omicron-covid-cases-india-covid-cases-may-21-2995672", "urlToImage": "https://c.ndtvimg.com/2022-04/iptdjlsg_coronavirus-india-pti-pic_650x400_20_April_22.jpg", "publishedAt": "2022-05-21T00:57:27Z", "content": "India Covid Live Update: India also recorded 20 deaths due to coronavirus on Friday.\r\nNew Delhi: India recorded 2,259 new Covid cases in the last 24 hours, taking the total number of infections to 4,… [+455 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Trump Pays $110,000 Fine For Blocking New York State Tax Probe", "description": "Former US President Donald Trump has paid a $110,000 fine for obstructing a major tax evasion investigation led since 2019 by New York state authorities, a spokesperson announced Friday.", "url": "https://www.ndtv.com/world-news/trump-pays-110-000-fine-for-blocking-new-york-state-tax-probe-says-attorney-general-letitia-james-2995660", "urlToImage": "https://c.ndtvimg.com/2022-02/kr9u49fk_donald-trump-reuters_625x300_20_February_22.jpg", "publishedAt": "2022-05-21T00:43:30Z", "content": "Attorney General office said that Trump has paid $110,000 on May 19 in contempt of court.\r\nWashington: Former US President Donald Trump has paid a $110,000 fine for obstructing a major tax evasion in… [+2327 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Pakistan Says Will Eliminate Terrorism Threat In Country", "description": "Pakistan on Friday vowed to eliminate the terrorism threat and bring complete peace in the country, according to a statement issued by the Foreign Office (FO). Addressing a media briefing here, FO spokesperson Asif Iftikhar said that terrorism was a", "url": "https://www.ndtv.com/world-news/pakistan-says-will-eliminate-terrorism-threat-bring-peace-in-country-2995649", "urlToImage": "https://c.ndtvimg.com/2022-04/kuv3ucng_shehbaz-sharif_625x300_11_April_22.jpg", "publishedAt": "2022-05-21T00:00:17Z", "content": "Pakistan's Foreign Office said that terrorism was a common threat for the entire region.\r\nIslamabad:  Pakistan on Friday vowed to eliminate the terrorism threat and bring complete peace in the countr… [+1145 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Telangana Increases Upper Age Limit For Police, Fire Service Recruitments", "description": "The Telangana government which is in the process of recruiting over 17,000 posts in uniformed departments, including police and fire services, increased the age limit by two years giving opportunity to several aspirants.", "url": "https://www.ndtv.com/india-news/telangana-increases-upper-age-limit-for-police-fire-service-recruitments-2995648", "urlToImage": "https://i.ndtvimg.com/i/2015-07/police-generic_650x400_71436243731.jpg", "publishedAt": "2022-05-20T23:44:41Z", "content": "Earlier, the upper age limit for police constables in Telangana was 18-25 years. (Representational)\r\nHyderabad: The Telangana government which is in the process of recruiting over 17,000 posts in uni… [+978 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Court To Hear Umar Khalid's Bail Plea On Daily Basis From May 23", "description": "The Delhi High Court on Friday decided to hear the bail plea of Umar Khalid on a daily basis from Monday onward in order to complete the hearing before the summer vacations begin.", "url": "https://www.ndtv.com/india-news/court-to-hear-umar-khalids-bail-plea-on-daily-basis-from-may-23-2995645", "urlToImage": "https://c.ndtvimg.com/2020-09/fa3f5ans_umar-khalid-former-jnu-student-ani-twitter_625x300_24_September_20.jpg", "publishedAt": "2022-05-20T23:24:44Z", "content": "Former JNU student Umar Khalid's bail plea will be heard by Delhi Court bench from next week.\r\nNew Delhi: The Delhi High Court on Friday decided to hear the bail plea of Umar Khalid on a daily basis … [+2592 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Polls Open In Australian Election As Scott Morrison Hopes For 2nd Term", "description": "Polls opened in Australia's federal election Saturday, with Prime Minister Scott Morrison fighting for another three-year term that would extend a decade of conservative rule.", "url": "https://www.ndtv.com/world-news/polls-open-in-australian-election-as-scott-morrison-hoping-for-2nd-term-2995637", "urlToImage": "https://c.ndtvimg.com/2022-04/sb4dlnj8_scott-morrison-afp_625x300_10_April_22.jpg", "publishedAt": "2022-05-20T22:58:36Z", "content": "Australia Elections: More than seven million people have already cast early or postal ballots.\r\nCanberra: Polls opened in Australia's federal election Saturday, with Prime Minister Scott Morrison fig… [+1367 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Delhi Professor Arrested Over Facebook Post On Varanasi's Gyanvapi", "description": "Associate professor of Delhi University's Hindu College Ratan Lal was arrested on Friday night for his objectionable social media post referring to claims about a 'Shivling' found inside Varanasi's Gyanvapi mosque complex, police said.", "url": "https://www.ndtv.com/india-news/delhi-university-professor-ratan-lal-arrested-over-facebook-post-on-varanasis-gyanvapi-2995631", "urlToImage": "https://c.ndtvimg.com/2022-05/1pru2sfc_gyanvapi-masjid-pti_625x300_19_May_22.jpg", "publishedAt": "2022-05-20T22:33:20Z", "content": "Defending his view, DU professor Ratan Lal said he has made several observations as a historian.\r\nNew Delhi: Associate professor of Delhi University's Hindu College Ratan Lal was arrested on Friday n… [+1502 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Several Injured In Russian Strike On Ukraine Culture Centre: Zelensky", "description": "At least eight people, including a child, were wounded when a powerful Russian missile strike gutted a newly repaired cultural centre in eastern Ukraine, the authorities said on Friday.", "url": "https://www.ndtv.com/world-news/several-injured-in-russian-strike-on-kharkiv-culture-centre-ukraine-president-volodymyr-zelensky-2995624", "urlToImage": "https://c.ndtvimg.com/2022-04/4m1qbmfk_ukraine-kharkiv-afp_625x300_17_April_22.jpg", "publishedAt": "2022-05-20T22:11:35Z", "content": "Ukraine War: Ukrainian President Zelensky described Russian attack as \"absolute evil.\"\r\nKyiv: At least eight people, including a child, were wounded when a powerful Russian missile strike gutted a ne… [+2130 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine War: Russia Claims Mariupol Steelworks \"Totally Liberated\"", "description": "The Russian army on Friday said it had \"totally liberated\" the Azovstal steelworks in the strategic port city of Mariupol in southeast Ukraine after the last Ukrainian soldiers inside surrendered.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-russia-claims-mariupol-steelworks-totally-liberated-2995622", "urlToImage": "https://c.ndtvimg.com/2022-04/idav4s8_azovstal-plant-mariupolreuters_625x300_15_April_22.jpg", "publishedAt": "2022-05-20T21:55:13Z", "content": "Ukraine war: Russia claims more than 500 Ukrainian soldiers surrendered on May 20.\r\nMoscow: The Russian army on Friday said it had \"totally liberated\" the Azovstal steelworks in the strategic port ci… [+1164 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Debika Chakraborty", "title": "NEET PG 2022 To Be Conducted Today At 9; Check Exam Guidelines", "description": "Students who are appearing for the NEET PG 2022 today have received their NEET PG admit card 2022 from the official websites- natboard.edu.in and nbe.edu.in.", "url": "https://www.ndtv.com/education/neet-pg-2022-to-be-conducted-today-exam-guidelines-reporting-time-nbe-edu-in", "urlToImage": "https://cache.careers360.mobi/media/presets/860X430/article_images/2022/5/20/exam-featured-image_2.jpg", "publishedAt": "2022-05-20T21:30:06Z", "content": "New Delhi:The National Eligibility cum Entrance Test for Postgraduate, or NEET PG 2022, will be held today, May 21, 2022. The National Board Of Examinations In Medical Sciences (NBEMS) will conduct t… [+2685 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "India Calls For Urgent Reform Of UN Security Council", "description": "President Ram Nath Kovind has called for an urgent reform of global institutions, with the UN Security Council at its core, to reflect the contemporary global reality.", "url": "https://www.ndtv.com/india-news/india-calls-for-urgent-reform-of-global-institutions-to-reflect-contemporary-global-reality-2995613", "urlToImage": "https://c.ndtvimg.com/2021-08/gg6u123_india-at-un-security-council-un-security-council-un-security-council-president_625x300_01_August_21.jpg", "publishedAt": "2022-05-20T21:28:25Z", "content": "The five permanent members are Russia, the UK, China, France and the United States. (File)\r\nKingstown: President Ram Nath Kovind has called for an urgent reform of global institutions, with the UN Se… [+2782 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Syria Intercepts Israeli Missile Attack Near Damascus: Report", "description": "Syrian air defences intercepted Israeli missile strikes near Damascus, state media reported on Friday.", "url": "https://www.ndtv.com/world-news/syria-intercepts-israeli-missile-attack-near-damascus-report-2995610", "urlToImage": "https://c.ndtvimg.com/2021-10/6e8i71v_missile-generic_650x400_17_October_21.jpg", "publishedAt": "2022-05-20T21:14:39Z", "content": "Syrian air defences intercepted Israeli missile strikes near Damascus on Friday.\r\nDamascus: Syrian air defences intercepted Israeli missile strikes near Damascus, state media reported on Friday.\r\n\"Ou… [+1319 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Lawmakers Seek FBI Investigation Into Killing of Al Jazeera Journalist", "description": "More than 50 US lawmakers on Friday called on the FBI to investigate the killing in the West Bank of Al Jazeera reporter Shireen Abu Akleh, despite Israeli promises of a probe.", "url": "https://www.ndtv.com/world-news/us-lawmakers-seek-fbi-investigation-into-killing-of-al-jazeera-journalist-shireen-abu-akleh-2995599", "urlToImage": "https://c.ndtvimg.com/2022-05/4rp7tll8_al-jazeera-journalist-shireen-abu-aqleh-650_625x300_11_May_22.jpg", "publishedAt": "2022-05-20T20:51:32Z", "content": "Al Jazeera reporter Shireen Abu Akleh died in a gun battle in the West Bank on May 11. (File)\r\nWashington: More than 50 US lawmakers on Friday called on the FBI to investigate the killing in the West… [+1846 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Elon Musk Meets Brazil President, Discuss Free Speech, Deforestation", "description": "Billionaire Elon Musk jetted into Brazil Friday to meet far-right President Jair Bolsonaro and unveil a project to link thousands of Amazonian schools to the internet and expand satellite monitoring of the rainforest.", "url": "https://www.ndtv.com/world-news/elon-musk-meets-with-brazil-president-jair-bolsonaro-discuss-free-speech-deforestation-2995596", "urlToImage": "https://c.ndtvimg.com/2022-05/10eg80ck_elon-musk-and-jair-bolsonaro_625x300_21_May_22.jpg", "publishedAt": "2022-05-20T20:37:49Z", "content": "Elon Musk-Jair Bolsonaro meeting: Journalists were kept at a distance from the meeting venue.\r\nPorto Feliz, Brazil: Billionaire Elon Musk jetted into Brazil Friday to meet far-right President Jair Bo… [+3771 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"Deeply Concerned\": US Criticises UN Rights Chief Over China Trip", "description": "The UN rights chief came under fire Friday for announcing a visit next week to China's Xinjiang, with the United States saying she was failing to stand up for the region's Uyghur community.", "url": "https://www.ndtv.com/world-news/us-criticises-un-rights-chief-michelle-bachelet-over-china-trip-2995550", "urlToImage": "https://c.ndtvimg.com/2021-03/kfme0828_un-high-commissioner-for-human-rights-michelle-bachelet_625x300_23_March_21.jpg", "publishedAt": "2022-05-20T19:56:19Z", "content": "US also voiced alarm that Bachelet has not released a long-anticipated report on Xinjiang's Uyghurs.\r\nWashington: The UN rights chief came under fire Friday for announcing a visit next week to China'… [+4279 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Rajnath Singh's Flight Diverted To Agra After Bad Weather", "description": "Defence Minister Rajnath Singh's flight was among 11 flights which have been diverted to Agra due to bad weather in the national capital on Friday, Sources said.", "url": "https://www.ndtv.com/india-news/rajnath-singhs-flight-diverted-to-agra-after-bad-weather-2995542", "urlToImage": "https://c.ndtvimg.com/2022-04/1fgrfhu4_rajnath-singh-650_625x300_22_April_22.jpg", "publishedAt": "2022-05-20T19:38:47Z", "content": "Rajnath Singh's flight scheduled to land in Delhi's Indira Gandhi International Airport. (File)\r\nNew Delhi: Defence Minister Rajnath Singh's flight was among 11 flights which have been diverted to Ag… [+783 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Canada Bans Luxury Goods Trade With Russia, Punishes More Oligarchs", "description": "Canada announced Friday a ban on trade in luxury goods with Russia, and added 14 more Russian oligarchs and other associates of President Vladimir Putin to its sanctions list imposed over the invasion of Ukraine.", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-canada-bans-luxury-goods-trade-with-russia-punishes-more-oligarchs-2995467", "urlToImage": "https://c.ndtvimg.com/2022-04/7fp0ibf_russia-ukraine-war_625x300_12_April_22.jpg", "publishedAt": "2022-05-20T18:36:37Z", "content": "Ukraine War: Canada also announced sanctions against Russian oligarchs and their family members.\r\nOttawa: Canada announced Friday a ban on trade in luxury goods with Russia, and added 14 more Russian… [+1242 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Assam Citizens' Register NRC Coordinator Files Case Against Former Official", "description": "The Assam National Register of Citizens (NRC) authority has filed a police case against former NRC coordinator in the state, Prateek Hajela.", "url": "https://www.ndtv.com/india-news/assam-citizens-register-nrc-coordinator-files-case-against-former-official-2995453", "urlToImage": "https://c.ndtvimg.com/2018-09/r15g3lpo_prateek-hajela-nrc-coordinator-650_625x300_09_September_18.jpg", "publishedAt": "2022-05-20T18:29:01Z", "content": "In September 2019, the Assam Police had registered two cases against Prateek Hajela\r\nGuwahati: The Assam National Register of Citizens (NRC) authority has filed a police case against former NRC coord… [+1828 chars]"}]}