{"status": "ok", "totalResults": 283, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Probe Agency Against Bail To Maharashtra Leaders For Rajya Sabha Polls", "description": "The Enforcement Directorate opposed the pleas of former Maharashtra home minister Anil Deshmukh and minister Nawab Malik seeking one-day bail to vote in the June 10 Rajya Sabha polls.", "url": "https://www.ndtv.com/india-news/probe-agency-against-bail-to-maharashtra-leaders-for-rajya-sabha-polls-3047546", "urlToImage": "https://c.ndtvimg.com/2020-06/pv53n708_anil-deshmukh_625x300_26_June_20.jpg", "publishedAt": "2022-06-07T22:20:31Z", "content": "The probe agency said the special court that Mr Deshmukh is the main accused in money laundering case.\r\nMumbai: The Enforcement Directorate on Tuesday opposed the pleas of former Maharashtra home min… [+2073 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Amazon's Notice To Future Group Promoters To Stop Transaction With Reliance", "description": "E-commerce major Amazon has sent a notice to Future Group promoters asking them to refrain from entering into any kind of transaction with Reliance Industries group either directly or indirectly, source aware of the development said on Tuesday.", "url": "https://www.ndtv.com/india-news/amazons-notice-to-future-group-promoters-to-stop-transaction-with-reliance-3047538", "urlToImage": "https://c.ndtvimg.com/2020-04/dtm96sek_amazon-generic-reuters_625x300_02_April_20.jpg", "publishedAt": "2022-06-07T21:59:50Z", "content": "Amazon said that actions are contrary to statements made before courts through pleadings or otherwise.\r\nNew Delhi:  E-commerce major Amazon has sent a notice to Future Group promoters asking them to … [+3734 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Delhi Man, 30, Consumes Acid After Attacking Woman With Knife: Police", "description": "A 30-year-old man allegedly stabbed his woman friend with a knife and later consumed acid in west Delhi's Ranhola area, police said on Tuesday.", "url": "https://www.ndtv.com/india-news/delhi-man-30-consumes-acid-after-attacking-woman-with-knife-police-3047534", "urlToImage": "https://i.ndtvimg.com/i/2017-03/police-generic_650x400_71490246814.jpg", "publishedAt": "2022-06-07T21:43:00Z", "content": "The accused was looking for an opportunity to attack the woman for ignoring him, police said.\r\nNew Delhi: A 30-year-old man allegedly stabbed his woman friend with a knife and later consumed acid in … [+1810 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Iran Hangs 12 Baluchi Prisoners In One Day: Report", "description": "Iran has carried out a mass execution of 12 inmates at a prison in its southeast, an NGO said on Tuesday, as concern grows over the rising number of executions in the Islamic republic.", "url": "https://www.ndtv.com/world-news/iran-hangs-12-baluchi-prisoners-in-one-day-report-3047526", "urlToImage": "https://i.ndtvimg.com/i/2018-03/death-penalty-generic_650x400_51521527403.jpg", "publishedAt": "2022-06-07T21:27:22Z", "content": "Iran Executions: They were all members of the Baluch ethnic minority. (Representational)\r\nParis: Iran has carried out a mass execution of 12 inmates at a prison in its southeast, an NGO said on Tuesd… [+2340 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Experts Recommend Novavax COVID-19 Vaccine", "description": "A panel of experts convened by the US drug regulator on Tuesday recommended the Novavax Covid-19 shot, a late runner in the fight against the virus that could nonetheless play a role in overcoming vaccine hesitancy.", "url": "https://www.ndtv.com/world-news/us-experts-recommend-novavax-covid-19-vaccine-3047517", "urlToImage": "https://c.ndtvimg.com/2021-06/bcbk91d_novavax-covovax-reuters_625x300_17_June_21.jpg", "publishedAt": "2022-06-07T21:07:53Z", "content": "Novavax's vaccine was found to be more than 90% effective against symptomatic cases of the disease.\r\nWashington: A panel of experts convened by the US drug regulator on Tuesday recommended the Novava… [+3410 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Fire Breaks Out At Home Ministry In North Block, No Causality Reported", "description": "A fire broke out in the Ministry of Home Affairs in the North block post-Tuesday midnight.", "url": "https://www.ndtv.com/india-news/fire-breaks-out-at-home-ministry-in-north-block-no-causality-reported-3047509", "urlToImage": "https://i.ndtvimg.com/i/2017-07/fire-generic-istock_650x400_51500191995.jpg", "publishedAt": "2022-06-07T20:50:37Z", "content": "Seven fire tenders were rushed to the spot to douse the blaze. (Representational)\r\nNew Delhi: A fire broke out in the Ministry of Home Affairs in the North block post-Tuesday midnight.\r\nA fire broke … [+890 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Satellite Images Show Russian Artillery Damage, 40-Metre Crater In Ukraine", "description": "With a fierce battle underway in Ukraine's eastern Donbas, latest satellite images show the extent of destruction caused by continuous and relentless Russian artillery.", "url": "https://www.ndtv.com/world-news/satellite-images-show-russian-artillery-damage-40-metre-crater-in-ukraine-3047508", "urlToImage": "https://c.ndtvimg.com/2022-06/8f2bfd5g_b4maxar_625x300_08_June_22.jpg", "publishedAt": "2022-06-07T20:44:10Z", "content": "Satellite images showing destruction of buildings in Rubizhne (high res: here)\r\nWith a fierce battle underway in Ukraine's eastern Donbas, latest satellite images show the extent of destruction cause… [+2590 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Centre Must Do \"Something\" To Improve Situation In J&K: Omar Abdullah", "description": "People in Jammu and Kashmir are in distress as there is hardly a day without any violent incident, National Conference (NC) vice-president Omar Abdullah said on Tuesday, asserting that the government should take steps to improve the situation.", "url": "https://www.ndtv.com/india-news/centre-must-do-something-to-improve-situation-in-j-k-omar-abdullah-3047502", "urlToImage": "https://c.ndtvimg.com/2022-06/7hdv1ca8_omar-abdullah-picture-facebook_625x300_05_June_22.jpg", "publishedAt": "2022-06-07T20:33:01Z", "content": "Omar Abdullah said that the government should take steps to improve the situation in Jammu and Kashmir.\r\nSrinagar: People in Jammu and Kashmir are in distress as there is hardly a day without any vio… [+1113 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "US Blames Iran's Sanctions Demands For Failure To Restore Nuke Deal", "description": "The United States on Tuesday blamed Iran for both sides' failure so far to reach an agreement on reviving the 2015 Iran nuclear deal, saying Iran's demands on sanctions-lifting were preventing progress.", "url": "https://www.ndtv.com/world-news/us-blames-irans-sanctions-demands-for-failure-to-restore-nuke-deal-3047471", "urlToImage": "https://c.ndtvimg.com/2019-05/6c7epapg_iran-flag-reuters-650_625x300_20_May_19.jpg", "publishedAt": "2022-06-07T20:06:01Z", "content": "Iran demanded that its Islamic Revolutionary Guard Corps be removed from the US' blacklist.\r\nVienna: The United States on Tuesday blamed Iran for both sides' failure so far to reach an agreement on r… [+586 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine's Zelensky Says Stalemate With Russia \"Not An Option\"", "description": "A stalemate with Russia is \"not an option\", Ukrainian President Volodymyr Zelensky told Britain's Financial Times newspaper on Tuesday, reiterating a plea for foreign help in the war.", "url": "https://www.ndtv.com/world-news/ukraine-president-volodymyr-zelensky-says-stalemate-with-russia-not-an-option-3047452", "urlToImage": "https://c.ndtvimg.com/2022-06/ah6js3os_zelensky-reuters_625x300_01_June_22.jpg", "publishedAt": "2022-06-07T19:32:12Z", "content": "Ukraine War: President Zelensky said that war should be ended at the negotiating table. (File)\r\nKyiv: A stalemate with Russia is \"not an option\", Ukrainian President Volodymyr Zelensky told Britain's… [+1423 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Food Shortages Are Next Global Health Crisis: Expert", "description": "Growing food shortages may represent the same health threat to the world as the COVID-19 pandemic, a leading global health figure has warned.", "url": "https://www.ndtv.com/world-news/food-shortages-are-next-global-health-crisis-expert-3047446", "urlToImage": "https://c.ndtvimg.com/2022-05/1a3b11qk_wheat-generic_625x300_20_May_22.jpg", "publishedAt": "2022-06-07T19:20:38Z", "content": "Food shortages may represent the same health threat to the world as the Covid, the expert said.\r\nLondon: Growing food shortages may represent the same health threat to the world as the COVID-19 pande… [+1519 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Punjab Restores Security Of 424 VVIPs Days After Sidhu Moose Wala Murder", "description": "The security cover of 424 VVIPs in Punjab was restored, days after singer Sidhu Moose Wala - whose security cover was curtailed - was shot dead.", "url": "https://www.ndtv.com/india-news/punjab-restores-security-of-424-vvips-days-after-sidhu-moose-wala-murder-3047434", "urlToImage": "https://i.ndtvimg.com/i/2018-04/punjab-police-generic-afp-650_650x400_71522596621.jpg", "publishedAt": "2022-06-07T18:59:54Z", "content": "The Punjab government had curtailed the security cover in the wake of \"Ghallughara week\"\r\nNew Delhi: The security cover of 424 VVIPs in Punjab was restored, days after singer Sidhu Moose Wala - whose… [+968 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Tiger Woods Says He Will Miss US Open Next Week", "description": "The 46-year-old made a surprise return at the Masters in April, after needing surgery to repair his right leg following the car crash in February 2021.", "url": "https://sports.ndtv.com/golf/tiger-woods-says-he-will-miss-us-open-next-week-3047414", "urlToImage": "https://c.ndtvimg.com/2022-04/j4g5lq9_tiger-woods-masters-afp_625x300_10_April_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-07T18:39:51Z", "content": "Tiger Woods announced on Tuesday that he will not play next week's US Open at Brookline to continue his recovery from severe leg injuries sustained in a car accident last year. The 15-time major cham… [+1449 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Sri Lanka Gives 40-Year Tax Relief To Chinese-Built Port City: Report", "description": "Crisis-hit Sri Lanka has decided to give special 40-year tax relief for Chinese-built Colombo Port city to attract potential investors as Sri Lanka's foreign direct investment failed to attract investments.", "url": "https://www.ndtv.com/world-news/crisis-hit-sri-lanka-gives-40-year-tax-relief-chinese-built-colombo-port-city-to-attact-investors-3047411", "urlToImage": "https://c.ndtvimg.com/2019-05/0r2vdluc_colombo-port-city-reuters_625x300_24_May_19.jpg", "publishedAt": "2022-06-07T18:38:16Z", "content": "Sri Lanka defaulted on $51 billion foreign debt with most of its foreign reserves drained out. (File)\r\nColombo: Crisis-hit Sri Lanka has decided to give special 40-year tax relief for Chinese-built C… [+2410 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Openers Power Australia To Thumping Win Over Sri Lanka In First T20I", "description": "The visitors eased to 134-0 in 14 overs, chasing just 129 for victory, after a penetrative Josh Hazlewood spell restricted the hosts to 128 all out in 19.3 overs.", "url": "https://sports.ndtv.com/cricket/openers-power-australia-to-thumping-win-over-sri-lanka-in-first-t20i-3047403", "urlToImage": "https://c.ndtvimg.com/2022-06/535408fo_david-warner-aaron-finch-afp_625x300_08_June_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-07T18:32:31Z", "content": "Australian openers David Warner and Aaron Finch smashed half-centuries in an impressive 10-wicket win against Sri Lanka in the first T20 international in Colombo on Tuesday. The visitors eased to 134… [+1902 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "'Hyper-Sensitive' Airports To Install Intrusion Detection System By 2023", "description": "All \"hyper-sensitive\" airports in the country will have to install a perimeter intrusion detection system by December next year, the Bureau of Civil Aviation Security said in a circular.", "url": "https://www.ndtv.com/india-news/hyper-sensitive-airports-to-install-intrusion-detection-system-by-2023-3047399", "urlToImage": "https://c.ndtvimg.com/2019-05/soicn89g_airport-generic_625x300_10_May_19.jpg", "publishedAt": "2022-06-07T18:29:07Z", "content": "Greenfield airports that are not part of government's Regional Connectivity Scheme will also install PIDS\r\nMumbai: All \"hyper-sensitive\" airports in the country will have to install a perimeter intru… [+1386 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "BJP Will Work For Ending Dynastic Misrule In Telangana: PM Modi", "description": "Prime Minister Narendra Modi met BJP corporators from the Greater Hyderabad Municipal Corporation on Tuesday and expressed confidence that the party will work for good governance and ending the \"dynastic misrule\" in Telangana.", "url": "https://www.ndtv.com/telangana-news/bjp-will-work-for-ending-dynastic-misrule-in-telangana-pm-modi-3047382", "urlToImage": "https://c.ndtvimg.com/2022-05/1k70mjag_pm-modi-in-rajkot-pti_625x300_28_May_22.jpg", "publishedAt": "2022-06-07T18:23:37Z", "content": "The BJP is also holding its national executive meeting in Hyderabad next month.\r\nNew Delhi: Prime Minister Narendra Modi met BJP corporators from the Greater Hyderabad Municipal Corporation on Tuesda… [+1239 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "English Football Fans Arrested In Munich For Nazi Salutes", "description": "Munich's fire service was called out to a city centre hotel after an England fan lit a flare out of a window, which spread smoke through the building, triggering the smoke alarm.", "url": "https://sports.ndtv.com/football/english-football-fans-arrested-in-munich-for-nazi-salutes-ahead-of-nations-league-tie-3047381", "urlToImage": "https://c.ndtvimg.com/2022-06/bv6bpvn_germany-fans_625x300_07_June_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-06-07T18:23:18Z", "content": "England football fans were arrested for making Nazi salutes in Munich ahead of Tuesday's Nations League tie away to Germany, according to local reports. On the eve of the game, two England fans were … [+850 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Kerala Gold Smuggling Case: Accused Claims Pinarayi Vijayan's Involvement", "description": "Swapna Suresh, the prime accused in the Kerala Gold Smuggling Case, on Tuesday revealed that she has declared in court about the involvement of Kerala Chief Minister Pinarayi Vijayan, his wife and daughter in the matter.", "url": "https://www.ndtv.com/india-news/kerala-gold-smuggling-case-prime-accused-swapna-suresh-claims-kerala-chief-minister-pinarayi-vijayans-involvement-3047356", "urlToImage": "https://c.ndtvimg.com/2021-04/16eucm18_pinarayi-vijayan_625x300_03_April_21.jpg", "publishedAt": "2022-06-07T18:13:49Z", "content": "Prime Accused Swapna Suresh was in jail for 16 months, she was released in November last year. (File)\r\nKochi: Swapna Suresh, the prime accused in the Kerala Gold Smuggling Case, on Tuesday revealed t… [+3532 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Congress Counterclaim After Rajya Sabha Candidate's Crossvote Shocker", "description": "The Congress has made a counterclaim that two MLAs of the Bhartiya Tribal Party or BTP have offered to support them. The claim came hours after BJP-backed Independent candidate Subhash Chandra claimed eight Congress MLAs will crossvote in his favour.", "url": "https://www.ndtv.com/india-news/congress-counterclaim-after-rajya-sabha-candidates-crossvote-shocker-3047346", "urlToImage": "https://c.ndtvimg.com/2018-11/ceef17g8_congress-flag-generic-afp_625x300_06_November_18.jpg", "publishedAt": "2022-06-07T18:05:09Z", "content": "Sources said the BTP MLAs said they'll support the Congress in Rajya Sabha polls. (Representational)\r\nNew Delhi: The Congress has made a counterclaim that two MLAs of the Bhartiya Tribal Party or BTP… [+1661 chars]"}]}