{"status": "ok", "totalResults": 477, "articles": [{"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Why Imran Khan Is Facing A No-Trust Vote On Friday: 5-Point Explainer", "description": "In what is shaping up to be his toughest test since coming to power in 2018 and could usher fresh political tumult in the nuclear-armed country, Pakistan PM Imran Khan will face a no-confidence motion in the lower house of parliament on Friday.", "url": "https://www.ndtv.com/world-news/why-imran-khan-is-facing-a-no-trust-vote-on-friday-5-point-explainer-2836857", "urlToImage": "https://c.ndtvimg.com/2022-03/toipf60o_imran-khan-file-photo_625x300_12_March_22.jpg", "publishedAt": "2022-03-22T13:55:38Z", "content": "<li>An alliance of opposition parties in Pakistan submitted the no-trust motion in the National Assembly secretariat on March 8, saying Imran Khan had lost his parliamentary majority after over a doz… [+1027 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "Netherlands Coach Louis Van Gaal Tests Positive For Covid", "description": "Netherlands coach Louis van Gaal has tested positive for Covid after experiencing symptoms, the Dutch football association (KNVB) said on Tuesday", "url": "https://sports.ndtv.com/football/netherlands-coach-louis-van-gaal-tests-positive-for-covid-2836820", "urlToImage": "https://c.ndtvimg.com/2022-03/mqdlah3g_louis-van-gaal-afp_625x300_22_March_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-03-22T13:41:57Z", "content": "Netherlands coach Louis van Gaal has tested positive for Covid after experiencing symptoms, the Dutch football association (KNVB) said on Tuesday. The KNVB did not say if the 70-year-old would be abl… [+587 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Explained: How Javelin Missiles Help Ukrainians Destroy Russian Tanks", "description": "The missiles have been named Javelin because they take the path of the spears thrown in track and field events to attack the enemy.", "url": "https://www.ndtv.com/world-news/explained-how-javelin-missiles-help-ukrainians-destroy-russian-tanks-2836819", "urlToImage": "https://c.ndtvimg.com/2022-03/8b8tmfdo_javelin-missile-in-ukraine-650_625x300_22_March_22.jpg", "publishedAt": "2022-03-22T13:41:41Z", "content": "Russia-Ukraine war: The Javelin missiles being used by Ukrainian soldiers.\r\nAs Russian military move towards Ukrainian capital Kyiv, US-made Javelin anti-tank missiles are in the spotlight. These wea… [+3488 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "\"File An RTI\": Court-Appointed Panel Member On Gap In Farm Law Report", "description": "Farmer leader Anil Ghanwat -- one of the three members of the Supreme Court appointed committee on farm laws who made their final report public yesterday -- has brushed off the criticism that they had interviewed farmers in favour of farm laws.", "url": "https://www.ndtv.com/india-news/file-an-rti-court-appointed-panel-member-on-gap-in-farm-law-report-2836802", "urlToImage": "https://c.ndtvimg.com/2021-11/nmh2r2o_farmer-protest_625x300_22_November_21.jpg", "publishedAt": "2022-03-22T13:38:30Z", "content": "The farm laws were withdrawn last year after months of face-off between the farmers and the government.\r\nNew Delhi: Farmer leader Anil Ghanwat -- one of the three members of the Supreme Court appoint… [+3452 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Mridusmita Deka", "title": "JEE Main 2022: NIT Cut-Offs For BTech In CSE From Last Year", "description": "The NITs grant admission on the basis of the Joint Entrance Examination (JEE) Main conducted by the National Testing Agency (NTA). This year, the undergraduate engineering entrance exam will be held in two sessions.", "url": "https://www.ndtv.com/education/jee-main-2022-nit-cut-offs-for-btech-in-computer-science-and-engineering-from-last-year", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/3/22/cut-off-result-featured-image.jpg", "publishedAt": "2022-03-22T13:36:15Z", "content": "New Delhi:The highest JEE Main rank at which a National Institute of Technology (NIT) has closed admission to open category seats for BTech in Computer Science and Engineering in the last year was 71… [+2601 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Agence France-Presse", "title": "3rd Test, Day 2: Pakistan Steady After Naseem, Shaheen Halt Australia", "description": "Pakistan vs Australia: Pace spearheads Naseem Shah and Shaheen Shah Afridi knocked over eight wickets and restricted Australia to 391 before Pakistan ended day two of the deciding Test at 90-1 in Lahore on Tuesday", "url": "https://sports.ndtv.com/cricket/pakistan-vs-australia-3rd-test-day-2-report-pakistan-steady-after-naseem-shah-shaheen-afridi-halt-australia-2836784", "urlToImage": "https://c.ndtvimg.com/2022-03/akr6jbf_abdullah-shafique-azhar-ali-afp_625x300_22_March_22.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-03-22T13:34:06Z", "content": "Pace spearheads Naseem Shah and Shaheen Shah Afridi knocked over eight wickets and restricted Australia to 391 before Pakistan ended day two of the deciding Test at 90-1 in Lahore on Tuesday. The duo… [+2246 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Signs Of Ukraine Forces Going After Russians, Pushing Them Out: Pentagon", "description": "Ukraine, despite being under heavy bombardment by Russia now for more than three weeks, has begun to shift the battlefield momentum in some areas to reclaim ground from invading forces, a Pentagon spokesman said Tuesday.", "url": "https://www.ndtv.com/world-news/signs-of-ukraine-forces-going-after-russians-pushing-them-out-pentagon-2836757", "urlToImage": "https://c.ndtvimg.com/2022-02/urfqqvdo_ukraine-troop-afp_625x300_21_February_22.jpg", "publishedAt": "2022-03-22T13:24:22Z", "content": "Many analysts still see no clear path out of the conflict.\r\nWashington: Ukraine, despite being under heavy bombardment by Russia now for more than three weeks, has begun to shift the battlefield mome… [+1932 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Assam Man Gets 10 Years In Jail For Raping Minor Girl", "description": "A person accused of raping a six-year old minor girl was sentenced to 10 years of imprisonment by a special judge of the Nagaon district court on Tuesday.", "url": "https://www.ndtv.com/cities/assam-man-gets-10-years-in-jail-for-raping-minor-girl-2836740", "urlToImage": "https://i.ndtvimg.com/i/2017-12/justice-generic-court-generic_650x400_61513069872.jpg", "publishedAt": "2022-03-22T13:17:23Z", "content": "The accused was subsequently arrested and remanded to judicial custody. (Representational)\r\nNagaon: A person accused of raping a six-year old minor girl was sentenced to 10 years of imprisonment by a… [+568 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Uddhav Thackeray's Brother-In-Law Raided, Rs 6.45 Crore Frozen", "description": "Maharashtra Chief Minister Uddhav Thackeray's brother-in-law found himself raided by the Enforcement Directorate with the agency freezing Rs 6.45 crore in his assets in a money laundering case, officials said on Tuesday.", "url": "https://www.ndtv.com/india-news/uddhav-thackerays-brother-in-law-raided-rs-6-45-crore-frozen-2836729", "urlToImage": "https://c.ndtvimg.com/2019-12/m05m8fos_uddhav-thackeray-pti_625x300_17_December_19.jpg", "publishedAt": "2022-03-22T13:13:24Z", "content": "Mumbai: Maharashtra Chief Minister Uddhav Thackeray's brother-in-law found himself raided by the Enforcement Directorate with the agency freezing Rs 6.45 crore in his assets in a money laundering cas… [+1552 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Mere Breach Of Contract Not Criminal Offence, Says Supreme Court", "description": "Mere breach of contract is not in itself a criminal offence and gives rise to the civil liability of damages, the Supreme Court said on Tuesday.", "url": "https://www.ndtv.com/india-news/mere-breach-of-contract-not-criminal-offence-says-supreme-court-2836705", "urlToImage": "https://c.ndtvimg.com/2020-03/voni7s98_supreme-court-new_650x400_12_March_20.jpg", "publishedAt": "2022-03-22T13:05:37Z", "content": "Mere breach of contract is not in itself a criminal offence, the Supreme Court said. (File)\r\nNew Delhi: Mere breach of contract is not in itself a criminal offence and gives rise to the civil liabili… [+2673 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Vishesh Roy", "title": "\"Huge For Me\": Rashid Khan Recalls Training Session With Shane Warne", "description": "Gujarat Titans all-rounder Rashid Khan on Tuesday condoled the death of legendary spinner Shane Warne, saying it is a huge loss for cricketing world.", "url": "https://sports.ndtv.com/cricket/rashid-khan-recalls-15-minute-training-session-with-shane-warne-2836696", "urlToImage": "https://c.ndtvimg.com/2022-03/8jlkvks8_shane-warne-afp_625x300_10_March_22.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-03-22T13:01:43Z", "content": "The cricket fraternity is still reeling from the huge loss of legendary spinner Shane Warne and everyone is dealing with the grief in their own way. Afghanistan spinner Rashid Khan has always been ou… [+2059 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Easy Cooking Tips: How To Make Fresh Besan Flour In 5 Easy Steps", "description": "Homemade besan recipe: All you need is a good quantity of chana dal, and you can get started to make your own healthy, clean and fresh besan at home.", "url": "https://food.ndtv.com/food-drinks/easy-cooking-tips-how-to-make-fresh-besan-flour-in-5-easy-steps-2836681", "urlToImage": "https://c.ndtvimg.com/h7i01fdo_besan_625x300_09_August_18.jpg?im=FaceCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-03-22T12:57:13Z", "content": "Besan (gram flour) is one of the most commonly used flours in Indian cuisine (right after atta and maida, of course). Its distinct nutty flavour and coarse texture work their way up to put some delec… [+2240 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "IndiGo Logged Best On-Time Performance At Metro Airports In February", "description": "IndiGo had the best on-time performance of 95.4 per cent at four metro airports in February", "url": "https://www.ndtv.com/business/indigo-logged-best-on-time-performance-at-metro-airports-in-february-2836674", "urlToImage": "https://c.ndtvimg.com/2022-02/ulepag3g_indigobloomberg_625x300_04_February_22.jpg", "publishedAt": "2022-03-22T12:52:29Z", "content": "IndiGo logged best on-time performance at four metro airports during February 2022\r\nIndiGo had the best on-time performance (OTP) of 95.4 per cent at four metro airports in February, while Go First s… [+1601 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Man Beaten Up, His Car, Phone, Cash Robbed At Gunpoint: Gurgaon Police", "description": "A man was allegedly beaten up and his car, mobile phone and Rs 10,000 cash were snatched at gunpoint near Jamal village in Gurgaon, police said on Tuesday.", "url": "https://www.ndtv.com/gurgaon-news/man-robbed-at-gun-point-in-gurugram-2836658", "urlToImage": "https://c.ndtvimg.com/2019-12/pasi7rqs_gurgaon-police-generic_625x300_19_December_19.jpg", "publishedAt": "2022-03-22T12:48:10Z", "content": "The men snatched his car keys at gunpoint and drove away, police said. (Representational)\r\nGurgaon: A man was allegedly beaten up and his car, mobile phone and Rs 10,000 cash were snatched at gunpoin… [+1039 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "Press Trust of India", "title": "Number Of UG Medical Seats Has Increased By 75%, PG By 93% Since 2014", "description": "UG, PG Medical Seats: Steps have been taken to increase the number of seats including a centrally sponsored scheme for establishment of new medical colleges.", "url": "https://www.ndtv.com/education/number-of-under-graduate-medical-seats-has-increased-75-post-g-93-2014-government", "urlToImage": "https://cache.careers360.mobi/media/article_images/2022/3/22/students-Medical-featured-image.jpg.jpg", "publishedAt": "2022-03-22T12:47:56Z", "content": "New Delhi:The number of undergraduate medical seats has gone up from 51,348 before 2014 to 89,875 now, an increase of 75 per cent, and that of post-graduate seats has risen by 93 per cent during the … [+1866 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Cop Killed In Gunfight With Terrorists In Srinagar", "description": "A constable was killed in a brief shoot-out between police and terrorists in the Soura area of Srinagar on Tuesday, officials said.", "url": "https://www.ndtv.com/india-news/cop-killed-in-gunfight-with-terrorists-in-srinagar-2836628", "urlToImage": "https://c.ndtvimg.com/2019-10/h0qapm6o_jammu-and-kashmir-police-generic-pti_625x300_11_October_19.jpg", "publishedAt": "2022-03-22T12:39:07Z", "content": "The area has been cordoned off, and the search is going on, the official said. (Representational)\r\nSrinagar: A constable was killed in a brief shoot-out between police and terrorists in the Soura are… [+786 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "A US Company Continues To Pay Staffers Who Joined Ukrainian Army", "description": "Grammarly Inc is continuing to pay full salaries and benefits to its employees based in Ukraine who have joined the country's army to fight against the Russian invasion, its chief executive officer said.", "url": "https://www.ndtv.com/world-news/a-us-company-continues-to-pay-staffers-who-joined-ukrainian-army-2836615", "urlToImage": "https://c.ndtvimg.com/2022-03/jdgbl4q8_ukrainerussia-war_625x300_22_March_22.jpg", "publishedAt": "2022-03-22T12:33:53Z", "content": "The company declined to specify how many of his employees had joined Ukraine's defense effortrt.\r\nGrammarly Inc., one of the most valuable tech startups in the US, is continuing to pay full salaries … [+2014 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Bob Iger, Ex Disney Chief, Enters Metaverse Through Genies' Investment", "description": "Former Disney chairman Bob Iger is investing and joining the board of metaverse startup Genies, the company said on Monday, in the executive's first such move since leaving the entertainment giant at the end of 2021.", "url": "https://www.ndtv.com/business/bob-iger-former-disney-chief-enters-metaverse-through-startup-genies-investment-2836614", "urlToImage": "https://c.ndtvimg.com/2022-03/osr95jp8_reuters-image_625x300_22_March_22.jpg", "publishedAt": "2022-03-22T12:33:07Z", "content": "Former Disney chief Bob Iger enters metaverse through investment in Genies\r\nFormer Disney chairman Bob Iger is investing and joining the board of metaverse startup Genies, the company said on Monday,… [+948 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Credit, Debit Cards In Circulation Breach 1 Billion Mark In India: Report", "description": "October and December were the months with highest number of transactions in volume and value owing to the festive quarter and relaxations in COVID-19 restrictions", "url": "https://www.ndtv.com/business/credit-debit-cards-in-circulation-breach-1-billion-mark-in-india-report-2836611", "urlToImage": "https://i.ndtvimg.com/i/2016-08/credit-card_650x400_61471681828.jpg", "publishedAt": "2022-03-22T12:31:26Z", "content": "In 2021, credit card volume stood at 2.15 billion respectively, according to Worldline India.\r\nAs digital payments rise in India, the total number of credit and debit cards in circulation breached th… [+2004 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Ukraine President Calls On Pope To Mediate In Conflict With Russia", "description": "Ukrainian President Volodymyr Zelensky called Tuesday on Pope Francis to mediate in his country's conflict with Russia to help alleviate human suffering, nearly one month into Moscow's invasion.", "url": "https://www.ndtv.com/world-news/ukraine-president-calls-on-pope-to-mediate-in-conflict-with-russia-2836599", "urlToImage": "https://c.ndtvimg.com/2022-03/3j6a5ij8_russiaukrainewar_650x400_21_March_22.jpg", "publishedAt": "2022-03-22T12:24:45Z", "content": "Pope Francis has called for an end to the conflict on more than one occasion\r\nKyiv: Ukrainian President Volodymyr Zelensky called Tuesday on Pope Francis to mediate in his country's conflict with Rus… [+1132 chars]"}]}