{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Anisha Kohli", "title": "U.K. Braces for Heatwave as National Emergency Is Declared", "description": "The U.K. has declared a national emergency as it braces for a heatwave after the United Kingdom’s National Severe Weather Warning Service issued its first ever “red” warning for extreme heat on July 15. Much of England is expected to experience record high he…", "url": "https://time.com/6198132/uk-heatwave/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/UK.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-16T21:02:14Z", "content": "The U.K. has declared a national emergency as it braces for a heatwave after the United Kingdom’s National Severe Weather Warning Service issued its first ever “red” warning for extreme heat. Much of… [+3189 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "MARK GILLISPIE / AP", "title": "Tennessee Judge Temporarily Bars U.S. Agencies From Enforcing LGBTQ Guidance", "description": "A judge in Tennessee has temporarily barred two federal agencies from enforcing directives issued by President Joe Biden's administration that extended protections for LGBTQ people in schools and workplaces.", "url": "https://time.com/6198123/judge-temporarily-bars-u-s-agencies-enforcing-lgbtq-guidance/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/LGBTQ.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-16T19:42:51Z", "content": "A judge in Tennessee has temporarily barred two federal agencies from enforcing directives issued by President Joe Biden’s administration that extended protections for LGBTQ people in schools and wor… [+3259 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "STEFANIE DAZIO / AP", "title": "6 People Die After Dust Storm Causes Montana Highway Pileup", "description": "Six people have died after a dust storm fueled by wind gusts topping 60 mph caused a pileup on Interstate 90 in Montana, authorities said. Twenty-one vehicles crashed Friday evening and Montana Highway Patrol Sgt. Jay Nelson said authorities believe the weath…", "url": "https://time.com/6198116/montana-highway-dust-storm-pileup/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/Montana-.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-16T17:53:21Z", "content": "Six people have died after a dust storm fueled by wind gusts topping 60 mph caused a pileup on Interstate 90 in Montana, authorities said.\r\nTwenty-one vehicles crashed Friday evening and Montana High… [+2970 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "FARNOUSH AMIRI and MARY CLARE JALONICK / AP", "title": "Jan. 6 Panel Subpoenas Secret Service for Erased Texts", "description": "The House committee investigating the Capitol riot has subpoenaed the Secret Service for text messages agents reportedly deleted around Jan. 6, 2021, as the panel probes Donald Trump's actions at the time of the deadly siege.", "url": "https://time.com/6198109/jan-6-panel-subpoenas-secret-service-erased-texts/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/SS.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-16T15:55:22Z", "content": "WASHINGTON — The House committee investigating the Capitol riot has subpoenaed the Secret Service for text messages agents reportedly deleted around Jan. 6, 2021, as the panel probes Donald Trump’s a… [+5549 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Rapper Kodak Black Is Arrested on Drug Charges in Florida", "description": "The rapper, whose legal name is Bill Kapri, was booked Friday into jail in Fort Lauderdale, Florida, where he awaits a bond hearing", "url": "https://time.com/6198103/rapper-kodak-black/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/kodak-black.jpg?quality=85&w=818&h=628&crop=1", "publishedAt": "2022-07-16T15:29:43Z", "content": "MIAMI — Rapper Kodak Black was arrested in South Florida on charges of trafficking in oxycodone and possession of a controlled substance.\r\nThe rapper, whose legal name is Bill Kapri, was booked Frida… [+1163 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eloise Barry/London", "title": "Mo Farah’s Child Trafficking Highlights the U.K.’s Troubling Migrant Policies", "description": "British Olympian Mo Farah shocked the world this week when he revealed in a BBC documentary that he was trafficked to the U.K. as a child.", "url": "https://time.com/6197791/mo-farah-trafficking-immigration-home-office/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-1305048552.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-16T13:00:33Z", "content": "British athlete and four-time Olympic gold medalist Mo Farah shocked the world this week when he revealed in a BBC documentary that he was trafficked to the U.K. as a child and forced into domestic l… [+7830 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Alice Park", "title": "There’s a New Number to Call for Mental-Health Crises: 988", "description": "The 988 Suicide and Crisis Lifeline will dramatically expand the capacity of call centers to answer calls.", "url": "https://time.com/6197997/988-mental-health-crisis-hotline/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/mental-health-help-hotline.jpg?quality=85&crop=89px%2C232px%2C2236px%2C1170px&resize=1200%2C628&strip", "publishedAt": "2022-07-16T11:00:15Z", "content": "For as long as she could remember, Tonja Myles had thoughts of suicide. After a childhood of sexual abuse, Myles turned to drugs and prostitution to “mask the pain,” and twice she overdosed on prescr… [+24821 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Amy Gajda", "title": "The Founding Fathers Were Very Interested in the Right to Privacy—for Men", "description": "Back in 1789, John Adams and others forming the new United States recognized a head-scratching potential issue with the yet-to-be-ratified First Amendment and other state constitutional provisions like it: If language promised broad press and speech freedoms,…", "url": "https://time.com/6196495/privacy-rights-abortion-men-women/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/men-privacy-history-roe-wade.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-16T11:00:01Z", "content": "Back in 1789, John Adams and others forming the new United States recognized a head-scratching potential issue with the yet-to-be-ratified First Amendment and other state constitutional provisions li… [+6705 chars]"}]}