{"status": "ok", "totalResults": 29, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "KRISHAN FRANCIS / AP", "title": "Sri Lankan Prime Minister Agrees to Quit After Protesters Stormed President’s Residence", "description": "Sri Lanka’s prime minister agreed to resign on Saturday after party leaders in Parliament demanded both he and the embattled president step down on the day protesters stormed the president's residence and office in a fury over a worsening economic crisis.", "url": "https://time.com/6195292/srilanka-prime-minister-quits/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/Sri-Lanka.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-09T14:41:51Z", "content": "COLOMBO, Sri Lanka— Sri Lanka’s prime minister agreed to resign on Saturday after party leaders in Parliament demanded both he and the embattled president step down on the day protesters stormed the … [+5039 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "BARBARA ORTUTAY, TOM KRISHER and MATT O'BRIEN/AP", "title": "Elon Musk Says He’s Terminating Twitter Deal, Board to Fight", "description": "Elon Musk announced he will walk away from his tumultuous $44 billion offer to buy Twitter, leaving the deal on he verge of collapse. The Tesla CEO sent a letter to Twitter’s board Friday saying he is terminating the acquisition. But Twitter isn’t accepting M…", "url": "https://time.com/6195270/elon-terminating-twitter-deal/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/Elon-Musk-Waving-1.jpg?quality=85&crop=0px%2C0px%2C1024px%2C536px&resize=1200%2C628&strip", "publishedAt": "2022-07-08T23:01:15Z", "content": "Elon Musk announced he will walk away from his tumultuous $44 billion offer to buy Twitter, leaving the deal on he verge of collapse. The Tesla CEO sent a letter to Twitter’s board Friday saying he i… [+5358 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Nik Popli", "title": "Abenomics Explained: How Shinzo Abe’s Contentious Economic Plan Transformed Japan", "description": "Few leaders leave a legacy like Shinzo Abe. The longest-serving prime minister in Japan’s history led an ambitious domestic reform agenda and redefined the country’s status in geopolitical affairs. Following his assassination Friday, he will perhaps be most r…", "url": "https://time.com/6195263/abenomics-shinzo-abe-japan/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/Shinzo-Abe-Assassinated.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-08T22:32:43Z", "content": "Few leaders leave a legacy like Shinzo Abe. The longest-serving prime minister in Japan’s history led an ambitious domestic reform agenda and redefined the country’s status in geopolitical affairs. F… [+6337 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Shannon Carlin", "title": "How to Build a Sex Room Host Melanie Rose Has 4 Tips for Designing Intimate Spaces", "description": "Each episode of Netflix’s new design series How to Build a Sex Room begins with interior designer and host Melanie Rose sitting down with her clients to discuss their deepest sexual desires. She often gets the conversation started by digging into her little b…", "url": "https://time.com/6195234/how-to-build-a-sex-room-melanie-rose-design-tips/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/netflix-melanie-rose.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-08T21:02:17Z", "content": "Each episode of Netflix’s new design series How to Build a Sex Room begins with interior designer and host Melanie Rose sitting down with her clients to discuss their deepest sexual desires. She ofte… [+6535 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jeffrey Kluger", "title": "Russia Angers the World With Space Station War Propaganda", "description": "Three Russian cosmonauts waved the flag of stolen Ukrainian regions—and NASA is having none of it.", "url": "https://time.com/6195149/russian-space-station-propagand-nasa/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/Russian-cosmonauts-Luhansk.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-08T20:20:42Z", "content": "It was only eight years ago that German space station astronaut Alexander Gerst threatened, as he put it, to kick his crewmate’s butt. The butt in question belonged to American astronaut Reid Wiseman… [+3501 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Olivia B. Waxman", "title": "Looking Back at TIME’s Coverage of Shinzo Abe: ‘I Am a Patriot.’", "description": "Former Japanese Prime Minister Shinzo Abe, who was assassinated on Friday, appeared on TIME's cover three times.", "url": "https://time.com/6195201/shinzo-abe-time-magazine-covers/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/TIME-cover-abe-2014.webp?w=839&h=628&crop=1", "publishedAt": "2022-07-08T20:00:26Z", "content": "Shinzo Abe, Japan’s longest-serving prime minister, was assassinated Friday while giving a campaign speech in Nara. He was 67. A 41-year-old male suspect is now in custody. \r\nAbe appeared on the cove… [+3313 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Tara Law", "title": "Losing a Loved One Can Be Life-Threatening", "description": "A new study adds to the evidence that losing a loved one isn’t just painful: it can also be life-threatening.", "url": "https://time.com/6195183/losing-loved-one-heart-risk/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/Grief-Holding-Hands.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-08T19:28:46Z", "content": "Grief can exact a heavy toll on a person’s health. People are more likely to die when they’re in mourning than in ordinary times, a phenomenon that’s so well known it has its own name in scientific l… [+4517 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Judy Berman", "title": "HBO’s Anarchapulco Doc The Anarchists Is a Messy But Fascinating Account of a Failed Experiment", "description": "The HBO docuseries chronicles the meteoric rise and tragedy-stricken fall of the libertarian community that grew up around Anarchapulco", "url": "https://time.com/6195159/anarchists-review-hbo/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/acapulco-mexico.jpg?quality=85&w=640&h=318&crop=1", "publishedAt": "2022-07-08T19:06:27Z", "content": "Anarchy has a bad reputation. But if you’ve taken a look at the state of the world recently—from the rise of authoritarianism and the acceleration of climate change to the devolution of the Supreme C… [+6832 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Stephanie Zacharek", "title": "The Carnal Complexity of Juliette Binoche in Both Sides of the Blade Is All too Rare in Film—And It’s Glorious", "description": "Claire Denis and Juliette Binoche, who have now made three films together, are a match made in a gloriously idiosyncratic heaven. Denis is one of our finest, most fascinating living filmmakers, and Binoche is one of our most rapturous and expressive actors—sh…", "url": "https://time.com/6195091/both-sides-of-the-blade-review/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/both-sides-of-the-blade-e1657305384513.jpeg?quality=85&w=718&h=465&crop=1", "publishedAt": "2022-07-08T18:58:48Z", "content": "Claire Denis and Juliette Binoche, who have now made three films together, are a match made in a gloriously idiosyncratic heaven. Denis is one of our finest, most fascinating living filmmakers, and B… [+4507 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Ian Bremmer", "title": "Shinzo Abe’s Formidable Legacy in Japan and the World", "description": "On July 8, the world learned that Shinzo Abe, Japan’s former prime minister, had been murdered during a public appearance in the Japanese city of Nara. Though Abe had no current formal role in Japan’s government, he was campaigning on behalf of a local parlia…", "url": "https://time.com/6195116/shinzo-abe-legacy-japan-world/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/shinzo-abe-japan-01.jpg?quality=85&crop=0px%2C26px%2C2400px%2C1256px&resize=1200%2C628&strip", "publishedAt": "2022-07-08T16:34:13Z", "content": "On July 8, the world learned that Shinzo Abe, Japan’s former prime minister, had been murdered during a public appearance in the Japanese city of Nara. Though Abe had no current formal role in Japan’… [+4501 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "FABIANO MAISONNAVE/AP", "title": "Human Activity is Pushing Vital Species Towards Extinction, U.N. Warns in Call for Sustainability", "description": "U.N. report warns without more sustainable behavior, species that billions of people rely on for food, medicine, and energy are at risk.", "url": "https://time.com/6195102/one-million-species-risk-extinction-un/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/biodiversity-sustainability-species-food-humanity.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-08T16:17:18Z", "content": "(RIO DE JANEIRO, Brazil)—Every day billions of people depend on wild flora and fauna to obtain food, medicine, and energy. But a new United Nations-backed report says that overexploitation, climate c… [+3759 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Barry Hatton / AP", "title": "Former Angolan President José Eduardo Dos Santos Dies At 79", "description": "Dos Santos died at a clinic in Barcelona, Spain, following a long illness, the Angolan government said in an announcement on Facebook.", "url": "https://time.com/6195095/former-angolan-president-jose-eduardo-dos-santos-obituary/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/former-angolan-president-jose-eduardo-dos-santos-obituary.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-08T15:42:47Z", "content": "LISBON, Portugal — José Eduardo dos Santos, once one of Africa’s longest-serving rulers who during almost four decades as president of Angola fought the continent’s longest civil war and turned his c… [+8970 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Matthew Lee / AP", "title": "G-20 Diplomats Fail on Unity Over Ukraine, War’s Impact", "description": "The group failed to find common ground over Russia’s war in Ukraine and its global impacts, raising question-marks about ongoing cooperation", "url": "https://time.com/6195093/g20-fails-unity-over-ukraine/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-1241769710.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-08T15:39:31Z", "content": "Deeply divided top diplomats from the world’s richest and largest developing nations failed to find common ground Friday over Russia’s war in Ukraine and how to deal with its global impacts, leaving … [+7002 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Philip Elliott", "title": "The Jan. 6 Committee Has Succeeded Far Beyond What Anyone Imagined", "description": "The Jan. 6 committee has won if the goal was to find information that disqualifies Trump from running again.", "url": "https://time.com/6195074/jan-6-committee-unexpected-success/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-1241592925.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-08T14:43:28Z", "content": "This article is part of The D.C. Brief, TIME’s politics newsletter. Sign up here to get stories like this sent to your inbox.\r\nShotgun marriages are tricky.\r\nThey are, by their very nature, rooted in… [+6563 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Alice Park", "title": "Scientists Have a New Tool for Tracking COVID-19 Variants: Human Waste", "description": "Wastewater analysis has become a useful way to monitor COVID-19 surges in specific areas, and researchers can now use it to track variants.", "url": "https://time.com/6194539/wastewater-covid-19-variants/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-1324976482.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-08T14:02:37Z", "content": "PCR and rapid tests aren’t the only places where evidence of SARS-CoV-2 shows up. The virus that causes COVID-19 also turns up in a city’s wastewater, which has become a powerful tool during the pand… [+5268 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Reade Pickert / Bloomberg", "title": "The U.S. Unemployment Rate Held Steady in June Amid Robust Job Market", "description": "U.S. employers added more jobs in June than forecast and the unemployment rate held near a five-decade low", "url": "https://time.com/6195031/us-unemployment-jobs/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-1241076383.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-08T13:01:24Z", "content": "U.S. employers added more jobs in June than forecast and the unemployment rate held near a five-decade low, suggesting hiring needs are so far eclipsing concerns about the economic outlook.\r\nNonfarm … [+2634 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Tara Patel and William Wilkes / Bloomberg", "title": "Two of Europe’s Biggest Airlines Announce New Cancellations", "description": "The Dutch arm of Air France-KLM and Deutsche Lufthansa announced another round of cancellations, adding to summer travel chaos", "url": "https://time.com/6195016/lufthansa-klm-flight-cancellations/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-1241563607.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-08T12:42:15Z", "content": "Two of Europe’s biggest airlines announced another round of cancellations, adding to the disruption turning the travel sector’s pandemic recovery summer into a nightmare.\r\nThe Dutch arm of Air France… [+2239 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Seung Min Kim and Zeke Miller / AP", "title": "Biden To Take Executive Action Amid Pressure to Protect Access to Abortion", "description": "President Joe Biden will take executive action Friday to protect access to abortion, according to three people familiar with the matter.", "url": "https://time.com/6194979/biden-protect-abortion-executive-order/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/abortion-rally.jpeg?quality=85&crop=0px%2C387px%2C6000px%2C3140px&resize=1200%2C628&strip", "publishedAt": "2022-07-08T12:13:27Z", "content": "WASHINGTON — President Joe Biden will take executive action Friday to protect access to abortion, according to three people familiar with the matter, as he faces mounting pressure from fellow Democra… [+2292 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Amy Gunia", "title": "Shinzo Abe Rewrote Japan’s Place in the World. And Remained a Power Broker Until the Very End", "description": "Abe died after being shot on Friday while making a speech during a campaign event. The former PM held an outsized role in Japan’s politics", "url": "https://time.com/6194956/shinzo-abe-dies-assassination-obituary/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-630590200.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-08T11:40:57Z", "content": "When Shinzo Abe, Japan’s longest-serving prime minister, stepped down in 2020, he hadn’t quite achieved what he’d set out to. He resigned due to poor health with dire approval ratings over his govern… [+5730 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Chad de Guzman", "title": "How the World Is Reacting to Shinzo Abe’s Death", "description": "Shinzo Abe died Friday after he was shot during a campaign event. World leaders paid tribute to the former Japanese Prime Minister.", "url": "https://time.com/6194948/shinzo-abe-death-world-leaders-reactions/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/shinzo-abe-assassination-japan.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-08T11:38:23Z", "content": "World leaders paid tribute to former Japanese Prime Minister Shinzo Abe, after he was fatally shot while campaigning for his political allies Friday morning.\r\nRead More: Former Japanese Prime Ministe… [+2823 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Rachel Fleishman", "title": "I’m a Doctor Who Cares for Newborns. I’m Nervous After the End of Roe", "description": "In the wake of the Supreme Court overturning Roe v. Wade, I feel an ominous cloud of governmental reach looming over my work as a neonatologist. Supporting families whose fetuses and babies have severe congenital disabilities—America’s leading cause of infant…", "url": "https://time.com/6194718/newborn-care-after-roe-essay/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/post-roe-neonatalist.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-08T11:30:35Z", "content": "In the wake of the Supreme Court overturning Roe v. Wade, I feel an ominous cloud of governmental reach looming over my work as a neonatologist. Supporting families whose fetuses and babies have seve… [+9096 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Vera Bergengruen", "title": "Armed Demonstrators and Far-Right Groups Are Escalating Tensions at Abortion Protests", "description": "Armed demonstrators and extremist groups have increasingly gathered at abortion-related protests in the aftermath of the Supreme Court’s overturning of Roe v. Wade, causing analysts to warn of a rising threat of violence. Eight abortion-related demonstrations…", "url": "https://time.com/6194085/abortion-protests-guns-violence-extremists/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/abortion-protests-armed-militia-04.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-08T11:00:08Z", "content": "Armed demonstrators and extremist groups have increasingly gathered at abortion-related protests in the aftermath of the Supreme Court’s overturning of Roe v. Wade, causing analysts to warn of a risi… [+8070 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eliana Dockterman", "title": "Why Marvel Movies Are Obsessed With Parent-Child Relationships", "description": "This story contains spoilers for all Marvel movies and television series Marvel movies have become obsessed with parent-child relationships. Recent Marvel Cinematic Universe projects have seen just about every adult superhero step into the role of a mentor or…", "url": "https://time.com/6193759/marvel-young-avengers-parents-kids/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/marvel-movies-partents-kids.jpg?quality=85&crop=0px%2C7px%2C2400px%2C1256px&resize=1200%2C628&strip", "publishedAt": "2022-07-08T10:22:42Z", "content": "This story contains spoilers for all Marvel movies and television series\r\nMarvel movies have become obsessed with parent-child relationships. Recent Marvel Cinematic Universe projects have seen just … [+12914 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eliana Dockterman", "title": "Thor: Love and Thunder Is Proof That the Marvel Cinematic Universe Doesn’t Make Sense Anymore", "description": "After years of successfully, interconnected stories, the Marvel Cinematic Universe feels bloated and aimless. What should Marvel do next?", "url": "https://time.com/6193966/thor-love-and-thunder-marvel-cinematic-universe-future/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/marvel-thor-doctor-strange-black-panther-moon-knight.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-08T10:20:34Z", "content": "The genius of Marvel Studios, at least in the beginning, was that each movie felt like a puzzle piece. Meticulously designed with the next step in mind, each chapter in the Marvel Cinematic Universe … [+16656 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eliana Dockterman", "title": "All the Cameos in Thor: Love and Thunder", "description": "This story contains spoilers for all Marvel movies and television series Thor: Love and Thunder is chock-full of cameos. The movie, helmed by Thor: Ragnarok director Taika Waititi, already stars a number of A-listers, including Chris Hemsworth as Thor, Tessa …", "url": "https://time.com/6193989/thor-love-and-thunder-cameos/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/g_disneyplus_thorloveandthunder_stills_12_07224acb.webp?w=1200&h=628&crop=1", "publishedAt": "2022-07-08T10:04:59Z", "content": "This story contains spoilers for all Marvel movies and television series\r\nThor: Love and Thunder is chock-full of cameos. The movie, helmed by Thor: Ragnarok director Taika Waititi, already stars a n… [+6138 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eliana Dockterman", "title": "The Thor Comics Can Help Us Understand What Happens to Jane After Thor: Love and Thunder", "description": "A closer look at recent Marvel comics give may offer a hint about Jane Foster's fate after the events of Thor: Love and Thunder.", "url": "https://time.com/6193713/jane-foster-thor-love-and-thunder-ending-comics/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/natalie-portman-thor.webp?w=1200&h=628&crop=1", "publishedAt": "2022-07-08T10:02:35Z", "content": "The post contains spoilers for Thor: Love and Thunder\r\nThor Odinson thought his old hammer Mjölnir had been lost forever. In Thor: Ragnarok, the God of Thunder (Chris Hemsworth) fought his evil siste… [+5364 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eliana Dockterman", "title": "Here’s What the Thor: Love and Thunder End-Credits Scenes Mean for the Future of the MCU", "description": "The Marvel movie stingers used to set up the plot for the very next film in the franchise. The end-credits scene for Iron Man gave us our first glimpse at Thor’s hammer before the first Thor movie debuted. The stinger at the end of Captain America featured Ni…", "url": "https://time.com/6193860/thor-love-and-thunder-end-credits-scenes/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/g_disneyplus_thorloveandthunder_stills_5_a25f2c75.webp?w=1200&h=628&crop=1", "publishedAt": "2022-07-08T10:00:18Z", "content": "The Marvel movie stingers used to set up the plot for the very next film in the franchise. The end-credits scene for Iron Man gave us our first glimpse at Thor’s hammer before the first Thor movie de… [+6756 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Amy Gunia and Chad de Guzman", "title": "Former Japanese Prime Minister Shinzo Abe Shot During Campaign Stop. Here’s What We Know So Far", "description": "Former Japanese Prime Minister Shinzo Abe was rushed to the hospital after he was shot on Friday. Here’s what we know so far.", "url": "https://time.com/6194882/shinzo-abe-shot-japan/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/shinzo-abe-japan-prime-minister.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-08T04:04:15Z", "content": "Former Japanese Prime Minister Shinzo Abe was shot on Friday in the city of Nara in western Japan, according to local media. Abe, who was rushed to the hospital, is showing no vital signs, the local … [+1676 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Darlene Superville / AP", "title": "President Biden Awards Medal of Freedom to Simone Biles, John McCain and 15 Others", "description": "Biden awarded the Presidential Medal of Freedom to 17 people, including Simone Biles, the late John McCain, Megan Rapinoe and Denzel Washington.", "url": "https://time.com/6194873/biden-medal-of-freedom-biles-mccain/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/biden-simone-biles-medal-freedom.jpeg?quality=85&crop=0px%2C43px%2C5494px%2C2876px&resize=1200%2C628&strip", "publishedAt": "2022-07-08T01:42:00Z", "content": "WASHINGTON — President Joe Biden on Thursday presented the nation’s highest civilian honor, the Presidential Medal of Freedom, to 17 people, including gymnast Simone Biles, the late John McCain, the … [+6471 chars]"}]}