{"status": "ok", "totalResults": 24, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Susan Wojcicki", "title": "Let’s Use the Work Lessons of the Pandemic to Help New Parents", "description": "More than 20 years ago, I was the first woman to take maternity leave at Google. But I almost didn’t come back to work after my first baby was born. It felt like too much to spend the workday away from my newborn while juggling the demands of my job and paren…", "url": "https://time.com/6183698/parental-leave-work-susan-wojcicki/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1207515909.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-03T11:00:06Z", "content": "More than 20 years ago, I was the first woman to take maternity leave at Google.\r\nBut I almost didn’t come back to work after my first baby was born. It felt like too much to spend the workday away f… [+3812 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Katie Reilly", "title": "‘None of Us Go Into Education to Be Human Shields.’ Teachers Who Survived Past School Shootings Are Furious After Uvalde", "description": "In the wake of the shooting in Uvalde, many educators who survived mass shootings feel like they’ve been left to deal with the problem on their own.", "url": "https://time.com/6183799/teachers-reactions-uvalde-school-shooting/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/texas-teachers-uvalde-shooting.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-02T22:16:40Z", "content": "Sarah Lerner is painfully familiar with how teachers in Uvalde, Texas must have felt as a gunman attacked their elementary school and fatally shot 21 people on May 24. In 2018, Lerner kept 15 student… [+6842 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eliana Dockterman", "title": "The Depp-Heard Trial Perpetuates the Myth of the Perfect Victim", "description": "Victim advocates hoped that, five years after #MeToo went viral, our culture would have developed a nuanced understanding of harassment and assault. Domestic abuse, in particular, is messy and complicated. The victim often stays with the perpetrator fearing e…", "url": "https://time.com/6183505/amber-heard-perfect-victim-myth-johnny-depp/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/amber-heard-20.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-02T21:21:41Z", "content": "Victim advocates hoped that, five years after #MeToo went viral, our culture would have developed a nuanced understanding of harassment and assault. Domestic abuse, in particular, is messy and compli… [+12404 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eric Cortellessa", "title": "In Nevada’s Critical Senate Race, an Insurgent Candidate Is Catching Up to Trump’s Pick", "description": "Sam Brown, whose face bears the scars of an IED ambush, has made the primary competitive as early voting begins.", "url": "https://time.com/6183602/nevada-primary-sam-brown-adam-laxalt-trump/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/Nevada-senate-race-04.jpg?quality=85&crop=0px%2C307px%2C2400px%2C1256px&resize=1200%2C628&strip", "publishedAt": "2022-06-02T20:13:47Z", "content": "Last August, Donald Trump made a seemingly low-risk bet in the gambling capital of America.\r\nHe endorsed Adam Laxalt in Nevada’s primary for a competitive U.S. Senate seat. In many ways, Laxalt was a… [+10949 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Alice Park", "title": "Here’s What to Know About COVID-19 Booster Shots for Kids", "description": "Here's what doctors say about COVID-19 booster shots for children ages five years and older.", "url": "https://time.com/6183609/kids-covid-19-boosters-when-to-get/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1238754398.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-02T19:46:10Z", "content": "Children were always going to be the toughest group to vaccinate against COVID-19, so it’s no coincidence that they were the last group to receive authorization for the shot; manufacturers and govern… [+6046 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jay Reeves and Jake Bleiberg / AP", "title": "Chief Didn’t Know About Students’ 911 Calls During Uvalde Shooting, State Senator Says", "description": "Sen. Roland Gutierrez called it a “system failure” that calls help from people inside Robb Elementary School on May 24 did not make their way to school district police Chief Pete Arredondo.", "url": "https://time.com/6183720/uvalde-shooting-911-calls/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/uvalde-shooting-chief-students-senator.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-02T19:42:15Z", "content": "UVALDE, Texas — The commander at the scene of a shooting at an elementary school in Uvalde, Texas, was not informed of panicked 911 calls coming from students trapped inside the building as the massa… [+3750 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Philip Dray", "title": "A Lynching in New York 130 Years Ago Shows That The North Isn’t Immune to Racial Hatred", "description": "On June 2nd a gathering in Port Jervis, New York will witness the unveiling of a plaque memorializing the lynching 130 years ago, on June 2, 1892, of Robert Lewis, a local Black citizen. Though scantly remembered for most of the 20th century, the horrific inc…", "url": "https://time.com/6183379/port-jervis-lynching-racial-violence/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/009.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-02T19:30:19Z", "content": "On June 2nd a gathering in Port Jervis, New York will witness the unveiling of a plaque memorializing the lynching 130 years ago, on June 2, 1892, of Robert Lewis, a local Black citizen. Though scant… [+10405 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Danica Kirka and Jill Lawless / AP", "title": "Queen Elizabeth II Will Skip Friday Jubilee Event Due to ‘Discomfort’", "description": "The palace says that with “great reluctance” the 96-year-old monarch has decided to skip Friday’s service at St. Paul’s Cathedral.", "url": "https://time.com/6183705/queen-elizabeth-ii-skip-jubilee-discomfort/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/queen-elizabeth-jubilee.jpeg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-02T19:24:02Z", "content": "LONDON (AP) — Queen Elizabeth II stepped gingerly onto the Buckingham Palace balcony Thursday, drawing wild cheers from the tens of thousands who came to join her at the start of four days of celebra… [+6493 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Sanya Mansoor", "title": "Justin Trudeau Cited U.S. Mass Shootings in Canada’s New Gun Bill. But Crime Is Surging There, Too", "description": "“We need only look south of the border to know that if we do not take action, firmly and rapidly, it gets worse and worse and more difficult to counter,” Trudeau said", "url": "https://time.com/6183659/canada-gun-control-buyback/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/trudeau.jpg?quality=85&crop=0px%2C19px%2C3843px%2C2011px&resize=1200%2C628&strip", "publishedAt": "2022-06-02T18:46:20Z", "content": "Following two horrific mass shootings, the government announced new legislation that would dramatically restrict the sale of handguns, and start a program to buy back semi-automatic assault rifles. B… [+7289 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Roger McNamee", "title": "Sheryl Sandberg Made Facebook Into a Giant—But At a Cost to the World", "description": "As the person who helped Mark Zuckerberg recruit Sheryl Sandberg to Facebook, I take no joy in the news that Sandberg is leaving her post as chief operating officer. I first encountered Sheryl Sandberg when she was chief of staff to Treasury Secretary Larry S…", "url": "https://time.com/6183520/sheryl-sandberg-facebook-legacy/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1327685550.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-02T16:37:26Z", "content": "As the person who helped Mark Zuckerberg recruit Sheryl Sandberg to Facebook, I take no joy in the news that Sandberg is leaving her post as chief operating officer.\r\nI first encountered Sheryl Sandb… [+5043 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Nicole Bedera", "title": "Depp v. Heard Reminds Us That the Legal System Is Still Stacked Against Survivors", "description": "After nearly seven weeks in the courtroom, a jury has reached a verdict in Johnny Depp’s defamation lawsuit against Amber Heard. He won. Online, his supporters are rejoicing, insisting that his victory vindicates all men “falsely” accused and serves as proof …", "url": "https://time.com/6183484/johnny-depp-amber-heard-survivors-metoo/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/depp-heard-trial.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-02T16:18:02Z", "content": "After nearly seven weeks in the courtroom, a jury has reached a verdict in Johnny Depp’s defamation lawsuit against Amber Heard. He won. Online, his supporters are rejoicing, insisting that his victo… [+6064 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Olivia B. Waxman", "title": "As Queen Elizabeth II Marks Her Platinum Jubilee, Who Is the Longest Reigning Monarch?", "description": "Queen Elizabeth is the world’s third longest ruling monarch. She is two years away from becoming the longest reigning monarch in Europe.", "url": "https://time.com/6183569/longest-reigning-monarchs-queen-elizabeth-platinum-jubilee/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/queen-elizabeth-II.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-02T16:12:11Z", "content": "This week, the U.K. is celebrating Queen Elizabeth II’s Platinum Jubilee, marking 70 years on the throne. She rose to the throne in 1952 at the age of 25 upon the death of her father King George VI. … [+4275 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Annabel Gutterman", "title": "The Best Books of 2022 So Far", "description": "In a time that continues to be marked by uncertainty and devastation, books can provide solace and, perhaps, some answers to the biggest questions that arise when living through crises. The best books of the year so far pick apart what it means to grieve, how…", "url": "https://time.com/6178674/best-books-2022-so-far/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/featured-image-best-of-2022.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-02T15:57:35Z", "content": "In a time that continues to be marked by uncertainty and devastation, books can provide solace and, perhaps, some answers to the biggest questions that arise when living through crises. The best book… [+9858 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Emily Barone", "title": "U.S. Landfills Are Getting a Second Life as Solar Farms", "description": "When landfills get capped and grassed over, they have the appearance of lush, rolling hills. Despite their green appearance, however, these sites are known as “brownfields”—a term for an environmentally hazardous site without a promising future. Indeed, landf…", "url": "https://time.com/6183376/landfills-becoming-solar-farms/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1262816621.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-02T15:45:34Z", "content": "When landfills get capped and grassed over, they have the appearance of lush, rolling hills. Despite their green appearance, however, these sites are known as “brownfields”—a term for an environmenta… [+3553 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "MICHAEL R. SISAK / AP", "title": "Harvey Weinstein’s Rape Conviction Upheld by Appeals Court", "description": "NEW YORK — A New York appellate court has upheld Harvey Weinstein’s rape conviction, rejecting the disgraced movie mogul’s claims that the judge at the landmark #MeToo trial prejudiced him by allowing women to testify about allegations that weren’t part of th…", "url": "https://time.com/6183580/harvey-weinstein-rape-conviction-upheld-appeals-court/", "urlToImage": "https://api.time.com/wp-content/uploads/2020/03/Harvey-Weinstein-Court.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-02T15:42:22Z", "content": "NEW YORK — A New York appellate court has upheld Harvey Weinstein’s rape conviction, rejecting the disgraced movie mogul’s claims that the judge at the landmark #MeToo trial prejudiced him by allowin… [+1073 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "DENISE LAVOIE / AP", "title": "Johnny Depp and Amber Heard Face Uncertain Career Prospects After Trial", "description": "FAIRFAX, Va. — A jury’s finding that both Johnny Depp and Amber Heard were defamed during their long-running public dispute capped a lurid six-week trial that also raised questions about whether the two actors can overcome tarnished reputations. The verdict h…", "url": "https://time.com/6183547/johnny-depp-amber-heard-career-prospects/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1240924244.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-02T14:41:10Z", "content": "FAIRFAX, Va. — A jury’s finding that both Johnny Depp and Amber Heard were defamed during their long-running public dispute capped a lurid six-week trial that also raised questions about whether the … [+5400 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Alana Semuels / STEAMBOAT SPRINGS, COLO.", "title": "America Needs to End Its Love Affair With Single-Family Homes. One Town Is Discovering It’s a Tough Sell", "description": "The housing development Brown Ranch aims to provide affordable housing to a community that desperately needs it. Its road ahead is filled with challenges.", "url": "https://time.com/6183044/affordable-housing-single-family-homes-steamboat-springs/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/steamboat-springs-housing-04.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-02T14:06:50Z", "content": "The question came, as it always did, just as Jason Peasley finished making his case for Brown Ranch, a development that would grow the size of his city by one-third and finally provide some affordabl… [+18325 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Alejandro de la Garza", "title": "This Year’s Hurricane Season Threatens One of the U.S.’s Biggest Economies", "description": "Florida's insurance industry must grapple with climate change as experts predict an intense hurricane season this year.", "url": "https://time.com/6183489/hurricane-season-florida-insurance-industry/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/hurricane-florida-climate-change-insurance.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-02T13:32:26Z", "content": "As the June 1 start of hurricane season approached last week, Florida lawmakers raced to address a crucial gap in the state’s coastal defenses: property insurance. Insurance markets in the state are … [+5430 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jade Le Deley/AP", "title": "‘Needle Spiking’: Spate of Mystery Attacks at Nightclubs Across Europe", "description": "Club owners and police are trying to raise awareness about the risk of surprise needle attacks.", "url": "https://time.com/6183433/needle-attacks-spiking/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/n2.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-02T10:41:02Z", "content": "PARIS — Across France, more than 300 people have reported being pricked out of the blue with needles at nightclubs or concerts in recent months. Doctors and multiple prosecutors are on the case, but … [+5884 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Ben Nuckols/AP", "title": "Competitors Stung by a Multiple Choice Round as the Scripps National Spelling Bee Turns Into the SAT", "description": "For many competitors, the multiple-choice vocabulary questions made redundant the contest skills honed over years of study.", "url": "https://time.com/6183409/scripps-spelling-bee/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/b1.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-02T09:27:08Z", "content": "OXON HILL (MARYLAND) — The Scripps National Spelling Bee was rolling smoothly through the second day of its first fully in-person competition in three years. Then it transformed into the SAT.\r\nAn ons… [+4856 chars]"}]}