{"status": "ok", "totalResults": 17, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "HUIZHONG WU / AP", "title": "Some Shanghai Businesses to Reopen Monday, Officials Say", "description": "Supermarkets, malls and restaurants in Shanghai will be allowed to open in a limited capacity starting Monday, officials said, even while it remained unclear whether residents would be let out from their homes.", "url": "https://time.com/6176953/some-shanghai-businesses-reopen/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Shanghai.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-15T18:12:41Z", "content": "TAIPEI, Taiwan — Supermarkets, malls and restaurants in Shanghai will be allowed to open in a limited capacity starting Monday, officials said, even while it remained unclear whether residents would … [+1267 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "CAROLYN THOMPSON and MICHAEL BALSAMO / AP", "title": "Supermarket Shooter Sought Black Neighborhood, Official Says", "description": "The white 18-year-old gunman who shot and killed 10 people at a Buffalo supermarket had researched the local demographics while looking for places with a high concentration of Black residents, arriving there at least a day in advance to conduct reconnaissance…", "url": "https://time.com/6176941/supermarket-shooter-new-york/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/buffalo.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-15T16:55:44Z", "content": "BUFFALO, N.Y. — The white 18-year-old gunman who shot and killed 10 people at a Buffalo supermarket had researched the local demographics while looking for places with a high concentration of Black r… [+5279 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "COLLEEN BARRY and PAOLO SANTALUCIA / AP", "title": "Ukrainian Band Kalush Orchestra Wins Eurovision Amid War", "description": "Ukrainian band Kalush Orchestra won the Eurovision Song Contest, a clear show of popular support for the group's war-ravaged nation that went beyond music.", "url": "https://time.com/6176935/ukraine-wins-eurovision/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Ukraine-Win.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-15T13:55:10Z", "content": "TURIN, Italy — Ukrainian band Kalush Orchestra won the Eurovision Song Contest, a clear show of popular support for the group’s war-ravaged nation that went beyond music.\r\nThe band and its song “Stef… [+6666 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Time", "title": "Finland Announces It Wants to Join NATO", "description": "Finland declared Sunday that it wants to join NATO, as a senior official with the western military alliance expressed hope that — with Russia's military advance appearing to falter — Ukraine can win the war.", "url": "https://time.com/6176929/finland-wants-to-join-nato/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Finland.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-15T13:29:32Z", "content": "BERLIN — Finland declared Sunday that it wants to join NATO, as a senior official with the western military alliance expressed hope that — with Russia’s military advance appearing to falter — Ukraine… [+4279 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "By CAROLYN THOMPSON, JOHN WAWROW, MICHAEL BALSAMO and DAVE COLLINS / AP", "title": "Ten Dead in Buffalo Supermarket Attack Police Call a Hate Crime", "description": "A white 18-year-old wearing military gear and livestreaming with a helmet camera opened fire with a rifle at a supermarket in Buffalo, killing 10 people and wounding three others Saturday in what authorities described as “racially motivated violent extremism.”", "url": "https://time.com/6176907/buffalo-shooting-hate-crime/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/shooting.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-15T12:34:50Z", "content": "BUFFALO, N.Y. — A white 18-year-old wearing military gear and livestreaming with a helmet camera opened fire with a rifle at a supermarket in Buffalo, killing 10 people and wounding three others Satu… [+5878 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Sean Gregory", "title": "‘An Absolutely Unimaginable Situation.’ WNBA Commissioner Cathy Engelbert Addresses Brittney Griner Arrest", "description": "With Brittney Griner still detained in Russia, Commissioner Cathy Engelbert Leads the WNBA into tumultuous season opener.", "url": "https://time.com/6175832/wnba-cathy-engelbert-commissioner-interview/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1395839343.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-15T11:00:30Z", "content": "(To receive weekly emails of conversations with the world’s top CEOs and business decisionmakers, clickhere.)\r\nMomentous disruptions—and some impressive wins—have marked the tenure of WNBA commission… [+15615 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "ASHRAF KHALIL and DAVID SHARP / AP", "title": "Abortion Rights Supporters Rally Nationwide", "description": "Supporters of abortion rights took to the streets across America on Saturday to make clear their anger at the prospect that the Supreme Court will soon strike down the constitutional right to abortion", "url": "https://time.com/6176897/abortion-rights-supporters-rally-nationwide/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Protests.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-14T18:45:16Z", "content": "WASHINGTON — Supporters of abortion rights took to the streets across America on Saturday to make clear their anger at the prospect that the Supreme Court will soon strike down the constitutional rig… [+4680 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Mitch McConnell and GOP Senators Meet President Zelensky in Surprise Kyiv Stop", "description": "Senate Republican leader Mitch McConnell and a delegation of GOP senators met with Ukrainian President Volodymyr Zelensky in Kyiv during an unannounced visit Saturday, delivering the latest show of American solidarity with the country at war with Russia.", "url": "https://time.com/6176888/mitch-mcconnell-zelensky-ukraine-kyiv/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Mc.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-14T18:01:27Z", "content": "WASHINGTON — Senate Republican leader Mitch McConnell and a delegation of GOP senators met with Ukrainian President Volodymyr Zelensky in Kyiv during an unannounced visit Saturday, delivering the lat… [+1743 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "JON GAMBRELL / AP", "title": "Sheikh Mohammed bin Zayed Becomes U.A.E.’s President", "description": "Rulers in the United Arab Emirates on Saturday unanimously appointed Abu Dhabi's Sheikh Mohammed bin Zayed Al Nahyan as the autocratic nation's president, signaling both unity and stability in this key energy-rich country that hosts Western militaries.", "url": "https://time.com/6176883/uae-president-mohammed-bin-zayed/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/UAE.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-14T17:44:22Z", "content": "DUBAI, United Arab Emirates — Rulers in the United Arab Emirates on Saturday unanimously appointed Abu Dhabi’s Sheikh Mohammed bin Zayed Al Nahyan as the autocratic nation’s president, signaling both… [+6361 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Philip Elliott", "title": "The Back Booth: An ‘Orgy of Oppo’ on Madison Cawthorn and an Unprecedented Subpoena", "description": "\"It's like an orgy of oppo that they're dropping on him and I have no idea if he'll get over the hump,\" says a Democratic consultant, in our weekly conversation about this week in D.C.", "url": "https://time.com/6176681/the-back-booth-an-orgy-of-oppo-on-madison-cawthorn-an-unquestioned-aid-package-and-an-unprecedented-subpoena/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/madison-Cawthron-republicans.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-14T17:00:44Z", "content": "Welcome to The Back Booth, a weekend edition of The D.C. Brief. Here each Saturday, TIME’s politics newsletter will host a conversation between political professionals on the right and the left, pull… [+8723 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "JOSEF FEDERMAN / AP", "title": "Israel Police to Investigate Conduct at Shireen Abu Akleh’s Funeral", "description": "Israeli police decided on Saturday to investigate the conduct of their officers who attacked the funeral of a slain Al Jazeera journalist, causing mourners to briefly drop the casket during the ceremony in Jerusalem.", "url": "https://time.com/6176875/israel-police-journalist-funeral/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/funeral.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-14T16:55:32Z", "content": "JERUSALEM — Israeli police decided on Saturday to investigate the conduct of their officers who attacked the funeral of a slain Al Jazeera journalist, causing mourners to briefly drop the casket duri… [+3648 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "KIM CHANDLER / AP", "title": "Transgender Medication Law in Alabama Blocked by Judge", "description": "A federal judge on Friday blocked part of an Alabama law that made it a felony to prescribe gender-affirming puberty blockers and hormones to transgender minors.", "url": "https://time.com/6176870/alabama-transgeder-medication-law/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GOV-1.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-14T16:33:57Z", "content": "MONTGOMERY, Ala. — A federal judge on Friday blocked part of an Alabama law that made it a felony to prescribe gender-affirming puberty blockers and hormones to transgender minors.\r\nU.S. District Jud… [+4879 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "JESSICA GRESKO / AP", "title": "Justice Clarence Thomas Says Abortion Leak Has Changed Supreme Court", "description": "The opinion suggests the court is poised to overturn the right to an abortion recognized nearly 50 years ago in Roe v. Wade", "url": "https://time.com/6176864/clarence-thomas-supreme-court-leak/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/justice.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-14T16:01:28Z", "content": "WASHINGTON — Justice Clarence Thomas says the Supreme Court has been changed by the shocking leak of a draft opinion earlier this month. The opinion suggests the court is poised to overturn the right… [+4265 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Raisa Bruner", "title": "At Eurovision, Ukraine Aims for the Prize as War Continues at Home", "description": "The Ukrainian entrant in the 2022 Eurovision Song Contest, Kalush Orchestra, is favored to win. But their experience has been colored by the war at home.", "url": "https://time.com/6176755/eurovision-ukraine-kalush-orhcestra/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/eurovision-ukraine.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-14T14:46:36Z", "content": "No matter what happens on Saturday night at the Grand Final of the 2022 Eurovision Song Contest in Turin, Italy, Kalush Orchestra’s Oleh Psiuk won’t be celebrating much. Instead, he—and the four band… [+6230 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "KIM TONG-HYUNG / AP", "title": "North Korea Confirms 21 New Deaths Amid COVID-19 Outbreak", "description": "North Korea on Saturday reported 21 new deaths and 174,440 more people with fever symptoms as the country scrambles to slow the spread of COVID-19 across its unvaccinated population.", "url": "https://time.com/6176848/north-korea-covid-outbreak/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/N.-Korea.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-14T13:49:23Z", "content": "SEOUL, South Korea — North Korea on Saturday reported 21 new deaths and 174,440 more people with fever symptoms as the country scrambles to slow the spread of COVID-19 across its unvaccinated populat… [+7388 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "MARC LEVY / AP", "title": "Trump Endorses Doug Mastriano in Pennsylvania GOP Governor Primary", "description": "Donald Trump on Saturday endorsed Doug Mastriano in Pennsylvania's Republican primary for governor, siding with a far-right candidate who was outside the U.S. Capitol during the Jan. 6 insurrection and has worked with determination to overturn the results of …", "url": "https://time.com/6176842/trump-endorses-doug-mastriano/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/doug.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-14T13:35:25Z", "content": "HARRISBURG, Pa. — Donald Trump on Saturday endorsed Doug Mastriano in Pennsylvania’s Republican primary for governor, siding with a far-right candidate who was outside the U.S. Capitol during the Jan… [+2029 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Suriya Jayanti", "title": "Ukraine Is in Worse Shape than You Think", "description": "It has been said that, given how massively Ukrainian troops were believed be outmatched early in Russia’s invasion, not losing the war is itself a form of victory for Ukraine. The difference between expectations and the surprising resilience of Ukraine’s mili…", "url": "https://time.com/6176748/ukraine-war-economy/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1240638770.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-14T11:00:10Z", "content": "It has been said that, given how massively Ukrainian troops were believed be outmatched early in Russia’s invasion, not losing the war is itself a form of victory for Ukraine. The difference between … [+8743 chars]"}]}