{"status": "ok", "totalResults": 45, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "ANDREW DALTON / AP", "title": "No Felony Charge for Man Who Tackled Dave Chappelle on Stage", "description": "LOS ANGELES — The man arrested on suspicion of tackling comedian Dave Chappelle during a performance at the Hollywood Bowl will not be charged with any felonies, the district attorney’s office said Thursday. Isaiah Lee, 23, was arrested for assault with a dea…", "url": "https://time.com/6174095/dave-chappelle-attack-no-felony-charges/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1366083479.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-05T21:07:08Z", "content": "LOS ANGELES — The man arrested on suspicion of tackling comedian Dave Chappelle during a performance at the Hollywood Bowl will not be charged with any felonies, the district attorney’s office said T… [+1945 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "AJ Jacobs", "title": "Doing Puzzles Can Help Solve Your Other Problems, Too", "description": "Puzzles saved my sanity during the pandemic—and I believe they can save the world. Perhaps that sounds like a rationalization from a puzzle addict trying to justify the thousands of hours I’ve spent wrestling with crosswords, logic problems, jigsaws and other…", "url": "https://time.com/6173867/puzzles-solve-other-problems/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1318798899.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-05T20:14:07Z", "content": "Puzzles saved my sanity during the pandemic—and I believe they can save the world.\r\nPerhaps that sounds like a rationalization from a puzzle addict trying to justify the thousands of hours I’ve spent… [+6574 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jamie Ducharme", "title": "What to Know About BA.2.12.1, the New Variant Spreading in the U.S.", "description": "It’s only been about six months since the Omicron variant emerged and changed the landscape of the pandemic, sending case-counts soaring and causing breakthrough infections even among those who were fully vaccinated and boosted. The virus continues to keep sc…", "url": "https://time.com/6174005/ba-2-12-1-variant-covid-19/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/covid-cases-rising.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-05T20:03:05Z", "content": "It’s only been about six months since the Omicron variant emerged and changed the landscape of the pandemic, sending case-counts soaring and causing breakthrough infections even among those who were … [+2240 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Karine Jean-Pierre to Be Next White House Press Secretary", "description": "Jean-Pierre will be the first black woman and the first openly LGBTQ+ person to serve as the White House Press Secretary", "url": "https://time.com/6174074/karine-jean-pierre-press-secretary/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Jean-Pierre-press-secretary.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-05T20:02:43Z", "content": "WASHINGTON — President Joe Biden on Thursday named Karine Jean-Pierre to be the next White House press secretary, with incumbent Jen Psaki set to leave the role next week.\r\nBiden is also bringing bac… [+1039 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "MATTHEW DALY / AP", "title": "Biden to Hold Industrial Polluters Accountable for Harming Poor, Minority Communities", "description": "The new strategy includes launching an Office of Environmental Justice within the Justice Department to focus on “fenceline communities\"", "url": "https://time.com/6174034/biden-environmental-justice-strategy-industrial-pollution/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/biden-industrial-pollution-environmental-justice.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-05T19:40:47Z", "content": "Following through on a campaign promise, the Biden administration on Thursday announced a wide-ranging enforcement strategy aimed at holding industrial polluters accountable for damage done to poor a… [+5407 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eric Cortellessa", "title": "In Wisconsin, an 1849 Abortion Ban Could Make for a Chaotic Post-Roe Landscape", "description": "The prospects of the law being restored have upended the swing state, where a divided government means it could be enforced inconsistently.", "url": "https://time.com/6173931/wisconsin-abortion-roe-supreme-court/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/wisconsin-abortion-supreme-court.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-05T19:11:17Z", "content": "More than two dozen states are poised to ban abortions if the Supreme Court overturns Roe v. Wade. Then there’s Wisconsin, where a politically divided government, a hotly contested election season, a… [+6503 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Chad de Guzman / Manila", "title": "A Dictator’s Son Rewrites History on TikTok in His Bid to Become the Philippines’ Next President", "description": "Decades after Ferdinand Marcos’ dictatorship ended, his son is leading the polls to become the next president of the Philippines—thanks in part to misinformation spreading on TikTok.", "url": "https://time.com/6173757/bongbong-marcos-tiktok-philippines-election/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/03/Bongbong-Marcos-TikTok-illo.jpg?quality=85&w=1080&h=628&crop=1", "publishedAt": "2022-05-05T18:02:47Z", "content": "One of the most popular posts on Joey Toledo’s TikTok account is a 13-second clip of Ferdinand “Bongbong” Marcos Jr.’s conversation with Juan Ponce Enrile. In the video, the 94-year-old Enrile—who se… [+11330 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Ciara Nugent/Buenos Aires", "title": "Giant Rodents ‘Invaded’ a Wealthy Gated Community. What Happened Next is a Lesson for Cities in the Climate Change Era", "description": "Gated communities are known for their manicured lawns, swimming pools, and wealthy residents. In Argentina, they’re also known as the home of the world’s largest rodents. On a drizzly afternoon in March 2022, a family of nine capybaras—the larger ones weighin…", "url": "https://time.com/6173837/capybaras-argentina-climate-change/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/CapybaraNordelta6.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-05T17:28:44Z", "content": "Gated communities are known for their manicured lawns, swimming pools, and wealthy residents. In Argentina, they’re also known as the home of the world’s largest rodents.\r\nOn a drizzly afternoon in M… [+11245 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Charlie Campbell", "title": "South Korea’s Intelligence Agency Has Joined NATO’s Cyber Defense Unit. China Isn’t Happy", "description": "South Korea’s intelligence agency became the first in Asia to join NATO’s Cyber Defense Group, in a move that risks inflaming tensions with China.", "url": "https://time.com/6173812/south-korea-cyber-nato-china/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/south-korea-nato-cyber-defense-01.jpg?quality=85&crop=0px%2C478px%2C2400px%2C1256px&resize=1200%2C628&strip", "publishedAt": "2022-05-05T17:22:00Z", "content": "On Thursday, South Korea’s spy agency became the first in Asia to join NATO’s Cyber Defense Group in a move that risks inflaming tensions with regional superpower China.\r\nIn a statement, South Korea’… [+2907 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Katie Reilly", "title": "What Actually Changes After a University Like Harvard Investigates Its Ties to Slavery", "description": "More universities are acknowledging their historical connections to slavery. But in many cases, they're stopping short of what students want", "url": "https://time.com/6173667/harvard-slavery-reparations/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/harvard-slavery-reparations.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-05T17:12:54Z", "content": "Nile Blass remembers hearing about Georgetown University’s 2016 report on its historical connections to slavery before she even applied to the school. The report, which detailed how the university pr… [+9077 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Melissa Locker", "title": "Amber Heard Testifies That Johnny Depp Broke Her Nose After 2014 Met Gala", "description": "Amber Heard is expected to continue testifying today in the ongoing defamation suit brought against her by ex-husband Johnny Depp in March 2019. The high-profile trial, which is being held in Fairfax County, Virginia, is in its fourth week. On Tuesday, Depp’s…", "url": "https://time.com/6173940/amber-heard-testifies-johnny-depp-broke-nose/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1240462713.jpg?quality=85&w=1024&h=608&crop=1", "publishedAt": "2022-05-05T16:12:43Z", "content": "Amber Heard is expected to continue testifying today in the ongoing defamation suit brought against her by ex-husband Johnny Depp in March 2019. The high-profile trial, which is being held in Fairfax… [+2740 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jeffrey Kluger", "title": "Routine Childhood Vaccination Rates Fell as Misinformation About the COVID-19 Shot Rose", "description": "COVID-19 vaccine misinformation may have played a role in falling rates of routine childhood vaccinations like MMR, DTaP, and chickenpox.", "url": "https://time.com/6172678/childhood-vaccinations-fall-covid-19/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Child-being-vaccinated.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-05T16:11:23Z", "content": "Anti-vaccine sentiments have been simmering in the U.S. since at least 1998, when the Lancet, a prestigious medical journal, published—and later retracted—a fraudulent paper falsely linking childhood… [+7344 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Charlotte Alter", "title": "‘It’s an Apathy Remover.’ The End of Roe Could Galvanize Democrats’ Burned-Out Base", "description": "The mood among Democratic organizers has been bleak for a while. Four years of Donald Trump has left the base exhausted, two-plus years of COVID-19 has left activists burned-out, and stalled progress during the Biden Administration on issues like voting right…", "url": "https://time.com/6173552/democratic-party-grassroots-abortion/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/democrat-base-roe.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-05T15:58:04Z", "content": "The mood among Democratic organizers has been bleak for a while. Four years of Donald Trump has left the base exhausted, two-plus years of COVID-19 has left activists burned-out, and stalled progress… [+4136 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Alejandro de la Garza", "title": "Big Oil Sold the World on a Plastics Recycling Myth. It May be Too Late to Undo the Damage", "description": "Oil companies convinced the world that plastic recycling would work. Now it may be too late to undo the damage", "url": "https://time.com/6173859/plastic-recycling-big-oil-damage/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/plastic-waste-beach.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-05T15:34:34Z", "content": "A few weeks ago, my friend Brett Pogostin showed me a photograph of his girlfriend, Angie, taken on Padre Island National Seashore on the Texas Gulf Coast. They had driven 200 miles from Houston to v… [+5541 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Some TurboTax Customers Will Get Paid After $141 Million Settlement Over Tax Filing Fees", "description": "NEW YORK (AP) — The company behind the TurboTax tax-filing program will pay $141 million to customers across the United States who were deceived by misleading promises of free tax-filing services, New York’s attorney general announced Wednesday. Under the ter…", "url": "https://time.com/6173895/turbotax-settlement/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/ap-turbo-tax-consumer-refund.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-05T15:33:48Z", "content": "NEW YORK (AP) — The company behind the TurboTax tax-filing program will pay $141 million to customers across the United States who were deceived by misleading promises of free tax-filing services, Ne… [+3273 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jeffrey Kluger", "title": "A Mysterious Hepatitis Outbreak Among Children Is Baffling Doctors", "description": "Doctors around the world are struggling to understand sudden clusters of hepatitis in children.", "url": "https://time.com/6173477/mysterious-hepatitis-outbreak-children/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/children-hepatitis-outbreak.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-05T15:11:39Z", "content": "Since last autumn, doctors at the Children’s Hospital of Alabama have been wrestling with a mystery. From October 2021 through February of this year, nine children—the youngest 20 months old and the … [+5898 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Maria Cheng / AP", "title": "Nearly 15 Million Deaths Are Linked to COVID-19, World Health Organization Says", "description": "The World Health Organization estimates that nearly 15 million people were killed by COVID-19 or its impact on overwhelmed health systems.", "url": "https://time.com/6173831/who-covid-19-deaths/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/covid-19-test.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-05T13:57:03Z", "content": "(London) — The World Health Organization estimates that nearly 15 million people were killed either by coronavirus or by its impact on overwhelmed health systems in the past two years, more than doub… [+4940 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Annabel Gutterman", "title": "Renée Elise Goldsberry on Playing an ‘Unapologetically Ambitious’ Diva on Girls5eva", "description": "Growing up, the now Tony-award winning actor Renée Elise Goldsberry often wondered how someone got discovered. She recalls being at the grocery store and thinking about whether she could get noticed there. “It was one of those things that crossed my mind and …", "url": "https://time.com/6173529/renee-elise-goldsberry-girls5eva-season-two-interview/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Renee-Elise-Goldsberry.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-05T12:01:02Z", "content": "Growing up, the now Tony-award winning actor Renée Elise Goldsberry often wondered how someone got discovered. She recalls being at the grocery store and thinking about whether she could get noticed … [+6077 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Edwin Chan / Bloomberg", "title": "Elon Musk Secures $7.1 Billion in New Financing for Twitter", "description": "Elon Musk secured about $7.1 billion from investors including Fidelity, Binance and Lawrence J. Ellison Revocable Trust to buy Twitter", "url": "https://time.com/6173799/elon-musk-twitter-investors/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1395167815.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-05T11:21:33Z", "content": "Elon Musk has secured about $7.1 billion of new financing commitments for his proposed $44 billion takeover of Twitter Inc., the company said in a filing Thursday.\r\nThe commitments come as the Tesla … [+1129 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Shoshana Zuboff", "title": "Democracy Can Still End Big Tech’s Dominance Over Our Lives", "description": "Just two decades ago barely 25% of the world’s information was digital. Today, nothing escapes this web. It is our shared fate and privilege to live at the dawn of information civilization. What kind of future will this be? What legacy will we leave to our ch…", "url": "https://time.com/6173639/democracy-big-techs-dominance-shoshana-zuboff/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1239883438.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-05T11:00:44Z", "content": "Just two decades ago barely 25% of the world’s information was digital. Today, nothing escapes this web. It is our shared fate and privilege to live at the dawn of information civilization. What kind… [+9130 chars]"}]}