{"status": "ok", "totalResults": 24, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Anisha Kohli", "title": "What to Know About WNBA Star Brittney Griner’s Detention in Russia", "description": "The criminal trial of 31-year-old WNBA champion and Olympic gold medalist Brittney Griner, who has been detained for more than four months, began in Russia on July 1. She faces up to 10 years in prison for the alleged transportation and smuggling of cannabis …", "url": "https://time.com/6193324/brittney-griner-timeline-russia/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/Griner-1.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-01T21:47:04Z", "content": "The criminal trial of 31-year-old WNBA champion and Olympic gold medalist Brittney Griner, who has been detained for more than four months, began in Russia on July 1. She faces up to 10 years in pris… [+8356 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "James Grebey", "title": "About Those Devastating Deaths in Stranger Things Season 4", "description": "This story contains spoilers for Stranger Things 4 With the release of its final two episodes on July 1, Stranger Things 4 has ended—and a couple of major characters meet their end by the finale, too. Netflix’s flagship sci-fi show has never been afraid to ki…", "url": "https://time.com/6193358/who-died-stranger-things-season-4-volume-2/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/stranger-things-eleven.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-01T21:33:51Z", "content": "This story contains spoilers for Stranger Things 4\r\nWith the release of its final two episodes on July 1, Stranger Things 4 has ended—and a couple of major characters meet their end by the finale, to… [+7625 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Kyla Mandel", "title": "High Gas Prices Are Discouraging Americans From Buying Cars Right Now", "description": "Immediate prices at the pump appear to be influencing car-use behavior in the U.S. more than long-term climate concerns.", "url": "https://time.com/6193412/high-gas-prices-car-buying/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/gas-prices-impacting-behavior-buying-renting-car-united-states.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-01T21:17:47Z", "content": "Few Americans are buying new cars right now, and for nearly half of those who didn’t buy a car this year, high gas prices were a big reason why. That’s according to a survey conducted by the Harris P… [+3021 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Chris Megerian / AP", "title": "Biden Discusses Abortion Access Options With Democratic Governors", "description": "President Joe Biden told Democratic governors Friday that he is “looking at all the alternatives” for protecting abortion access.", "url": "https://time.com/6193413/biden-abortion-access-options-democratic-governors/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/biden-abortion-access-options-democratic-governors.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-01T21:03:57Z", "content": "WASHINGTON — President Joe Biden told Democratic governors Friday that he is “looking at all the alternatives” for protecting abortion access following the Supreme Court decision overturning Roe v. W… [+1772 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Olivia B. Waxman", "title": "Beyond the Founding Fathers: 12 Unsung Figures Who Helped Build America", "description": "From the brain behind the “We the People” clause in the U.S. Constitution, to a woman who risked her life holding loyalist soldiers prisoner during the Revolutionary War", "url": "https://time.com/6193350/forgotten-founders-us-independence-day/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/nancy-hart.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-01T20:19:31Z", "content": "Every year, Americans get the day off and set off fireworks to celebrate Independence Day, the day in 1776 when the Declaration of Independence was printed (though the Continental Congress voted on t… [+20341 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Sanya Mansoor", "title": "‘Hindu Lives Matter’ Emerges as Dangerous Slogan After Horrific Killing in India", "description": "Political experts warn that the Hindu Lives Matter slogan risks amplifying a heinous but isolated crime into an assertion of systemic violence", "url": "https://time.com/6193304/hindu-lives-matter-india-killing/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/rally-hindu.jpg?quality=85&crop=0px%2C19px%2C1024px%2C536px&resize=1200%2C628&strip", "publishedAt": "2022-07-01T19:48:38Z", "content": "The killing of a Hindu tailor by two Muslim men in Rajasthan, India has sparked chilling calls for revenge against the country’s already marginalized Muslim population. \r\nThe gruesome death of Kanhai… [+5356 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Kevin McCarthy, Scott Peters and Bruce Westerman", "title": "We Need to Save America’s Sequoias", "description": "Millions of people from all over the world come to visit our majestic Giant Sequoias every year. No photo can accurately depict the awe-inspiring natural splendor of a Giant Sequoia, towering more than 300 feet into the sky. They are wonders that must be seen…", "url": "https://time.com/6193260/california-sequoias-wildfires-congress/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-1360805241.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-01T17:46:19Z", "content": "Millions of people from all over the world come to visit our majestic Giant Sequoias every year. No photo can accurately depict the awe-inspiring natural splendor of a Giant Sequoia, towering more th… [+4673 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Alice Park", "title": "How Jennifer Doudna’s Life Has Changed Since Discovering CRISPR 10 Years Ago", "description": "CRISPR, the landmark gene-editing technology, allows scientists to edit the DNA of any living thing.", "url": "https://time.com/6192962/crispr-jennifer-doudna-10-year-anniversary/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/crispr-pioneer-jennifer-doudna-lab.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-01T17:43:07Z", "content": "Jennifer Doudna was staring at a computer screen filled with a string of As, Cs, Ts, and Gs—the letters that make up human DNA—and witnessing a debilitating genetic disease being cured right before h… [+23431 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Connie Chang and Juli Fraga", "title": "How Grief Upsets Your Gut Health", "description": "After the death of Caroline Rustigian’s mother earlier this year, her physical health took a tumble. “I stopped eating and couldn’t keep food down,” says Rustigian, a public relations consultant and podcaster in Laguna Beach, Calif. Desperate to feel better, …", "url": "https://time.com/6193214/grief-gut-health/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-149627809.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-01T17:05:34Z", "content": "After the death of Caroline Rustigian’s mother earlier this year, her physical health took a tumble. “I stopped eating and couldn’t keep food down,” says Rustigian, a public relations consultant and … [+11168 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Billy Perrigo", "title": "Facebook Asks Judge to ‘Crack the Whip’ in Attempt to Silence a Black Whistleblower", "description": "A Facebook lawyer called on a judge to \"crack the whip\" against a whistleblower who accuses the company of forced labor and human trafficking", "url": "https://time.com/6193231/facebook-crack-whip-black-whistleblower/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/02/facebook-moderators-african-sweatshop-daniel-whistleblower.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-01T16:57:17Z", "content": "A lawyer representing Facebook’s parent company Meta called on a judge to “crack the whip” against a Black South African whistleblower on Monday, requesting a gagging order to prevent him from speaki… [+5466 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Lauran Neergaard and Matthew Perrone / AP", "title": "Tweaked COVID-19 Boosters In U.S. Must Target Newer Omicron Types", "description": "Regulators told COVID-19 vaccine makers that booster shots tweaked for the fall require added protection against newer omicron relatives.", "url": "https://time.com/6193249/tweaked-covid-19-boosters-in-u-s-must-target-newer-omicron-types/", "urlToImage": "https://api.time.com/wp-content/themes/time2014/img/time-logo-og.png", "publishedAt": "2022-07-01T16:46:07Z", "content": "U.S. regulators told COVID-19 vaccine makers Thursday that any booster shots tweaked for the fall will have to add protection against the newest Omicron relatives.\r\nThe Food and Drug Administration s… [+3100 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Nik Popli and Vera Bergengruen", "title": "Lawmakers Scramble to Reform Digital Privacy After Roe Reversal", "description": "Before Roe v. Wade granted women the constitutional right to abortion in 1973, most abortion procedures were kept hidden, even from close family members. Some women destroyed evidence and traveled in the wee hours of the morning to cover their tracks. But wit…", "url": "https://time.com/6193224/abortion-privacy-data-reform/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/abortion-laws-digital-privacy.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-01T16:44:30Z", "content": "Before Roe v. Wade granted women the constitutional right to abortion in 1973, most abortion procedures were kept hidden, even from close family members. Some women destroyed evidence and traveled in… [+9504 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jason Steinhauer", "title": "The Era of ‘Self-Evident’ Truth Is Over. Today’s America Is Founded on Belief Instead", "description": "\"We hold these truths to be self-evident.\" On Independence Day 2022, these words stand out as starkly anachronistic. What does that mean for America?", "url": "https://time.com/6192894/self-evident-truths/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/declaration.jpg?quality=85&crop=0px%2C210px%2C674px%2C353px&resize=1200%2C628&strip", "publishedAt": "2022-07-01T16:00:20Z", "content": "It’s the most famous sentence in the Declaration of Independence, and perhaps in all of American history: “We hold these truths to be self-evident,” Thomas Jefferson wrote in 1776, “that all men are … [+4645 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Daniel DePetris", "title": "Putin’s War in Ukraine Shows the Limits of Western Sanctions", "description": "Western-led sanctions are not unjust but they will not stop Putin's war in Ukraine.", "url": "https://time.com/6193143/ukraine-russia-sanctions-limits/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-1241259737.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-01T14:33:56Z", "content": "If the goal of this week’s G7 summit in the quaint Bavarian town of Schloss Elmau was to ensure the world’s wealthiest countries remained united on behalf of Ukraine, then it appears to have been a s… [+5663 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Andrew R. Chow", "title": "Fact-Checking 8 Claims About Crypto’s Climate Impact", "description": "Cryptocurrencies are bad for the environment—at least, that’s what most people online seem to believe. Pro-crypto posts on social media are often flooded with angry comments about the industry’s outsized contribution to greenhouse gas emissions. Studies estim…", "url": "https://time.com/6193004/crypto-climate-impact-facts/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/bitcoin-minining-environment-energy.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-01T13:57:31Z", "content": "Cryptocurrencies are bad for the environment—at least, that’s what most people online seem to believe. Pro-crypto posts on social media are often flooded with angry comments about the industry’s outs… [+16915 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Alana Semuels", "title": "The Surprising Thing That Could Help Ease Inflation", "description": "A build-up of inventory spurred by inflation could be just the thing that helps bring the economy out the other side", "url": "https://time.com/6193041/inflation-bullwhip-excess-inventory/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/discount-sneakers.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-01T13:25:54Z", "content": "David Metzner has made a career of getting rid of stuff that customers don’t want. He’s been in the liquidation business since 1990, buying trailers full of unsold goods from importers or manufacture… [+8839 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Lisa Abend/Copenhagen", "title": "Air Travel Is Hell This Summer. And It Won’t Be Fixed Anytime Soon", "description": "One morning in early June, the security line at Copenhagen’s Kastrup airport snaked in long, grumpy arcs away from the scanners, back through the automated boarding pass machines to the end of the departures hall, down the stairs, and all the way back around …", "url": "https://time.com/6192903/why-air-travel-is-bad-now/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/travel-airport-europe-03.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-01T12:57:25Z", "content": "One morning in early June, the security line at Copenhagen’s Kastrup airport snaked in long, grumpy arcs away from the scanners, back through the automated boarding pass machines to the end of the de… [+10535 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "James Grebey", "title": "Let’s Break Down the Ending of Stranger Things 4: Part Two", "description": "This story contains spoilers for Stranger Things 4: Part Two The final two episodes of the fourth season of Netflix’s Stranger Things have arrived. With runtimes of one hour and 25 minutes and two hours and 30 minutes, respectively, the episodes feel more lik…", "url": "https://time.com/6192902/stranger-things-4-part-two-ending/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/stranger-things-3.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-01T12:01:57Z", "content": "This story contains spoilers for Stranger Things 4: Part Two\r\nThe final two episodes of the fourth season of Netflix’s Stranger Things have arrived. With runtimes of one hour and 25 minutes and two h… [+13594 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Stephanie Zacharek", "title": "Minions: The Rise of Gru Sows Just the Right Amount of Chaos", "description": "Though not the best in the franchise, the Steve Carell-starring villain origin story offers just enough rejuvenation to distract from a relentless news cycle.", "url": "https://time.com/6192953/minions-the-rise-of-gru-review/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/2503_FFP_01907.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-01T12:00:32Z", "content": "Nonsense is underrated, particularly as we struggle to make sense of the soul-grinding wheel of torture known as the news cycle. Minions can help—a little. Nonsense is their brand of logic, and to ke… [+4114 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "KELVIN CHAN / AP", "title": "Inflation Hits Record 8.6% for 19 Countries Using the Euro", "description": "Inflation in countries using the euro set another eye-watering record, pushed higher by a huge increase in energy costs fueled partly by Russia’s war in Ukraine. Annual inflation in the eurozone’s 19 countries hit 8.6% in June, surging past the 8.1% recorded …", "url": "https://time.com/6193129/inflation-eurozone-june/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-1241366190.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-01T11:20:03Z", "content": "Inflation in countries using the euro set another eye-watering record, pushed higher by a huge increase in energy costs fueled partly by Russia’s war in Ukraine.\r\nAnnual inflation in the eurozone’s 1… [+3780 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Abigail Abrams", "title": "The Midterms Could Determine Abortion Access in These States", "description": "State-level elections this year in Wisconsin, Michigan, Pennsylvania, Arizona, North Carolina and Kansas could dictate access to abortion.", "url": "https://time.com/6192307/midterms-abortion-access/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/Abortion-Supreme-Court-overturn-Roe-elections.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-01T10:39:11Z", "content": "In Wisconsin, the Supreme Court’s decision last Friday to overturnRoe v. Wade had an almost instantaneous effect: as soon as the Justices issued their opinion, medical providers across the state imme… [+14890 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Kathleen Ronayne / AP", "title": "California Once Pioneered the Way in Renewable Energy. Now It’s Turning To Fossil Fuel To Beat a Heatwave", "description": "A sweeping energy proposal Gov. Newsom puts the state in the business of buying power to ensure there's enough to go around during heat waves.", "url": "https://time.com/6193087/california-fossil-fuels-blackouts/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/california-fossil-fuels.jpeg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-01T09:34:05Z", "content": "SACRAMENTO, Calif. — Looking to avoid power blackouts, California may turn to the one energy source it’s otherwise desperate to get rid of: fossil fuels.\r\nA sweeping energy proposal Gov. Gavin Newsom… [+5134 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "AMY GUNIA / HONG KONG", "title": "‘Reborn From the Ashes.’ Xi Jinping Visits a Changed Hong Kong For Handover Anniversary", "description": "Chinese President Xi Jinping marked the 25th anniversary of Hong Kong's return to Beijing’s control. The trip is his first outside of mainland China since 2020.", "url": "https://time.com/6191470/hong-kong-xi-jinping-25-handover-anniversary/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/xi-jinping-hong-kong.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-01T07:53:03Z", "content": "Neither the headwinds of an incoming typhoon nor a flurry of COVID-19 cases among government officials this week stopped Chinese President Xi Jinping from visiting Hong Kong to mark the 25th annivers… [+6767 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Sonny Barger, Figurehead of Hells Angels, Dies at 83", "description": "Ralph “Sonny” Barger was a founding member of the Oakland, California, chapter of the Hells Angels in 1957 and was present at the notorious Rolling Stones concert at Altamont Speedway.", "url": "https://time.com/6193077/sonny-barger-hells-angels-dies/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/hells-angels-sonny-barger.jpeg?quality=85&crop=0px%2C0px%2C2997px%2C1569px&resize=1200%2C628&strip", "publishedAt": "2022-07-01T04:08:08Z", "content": "LIVERMORE, Calif. — Sonny Barger, the leather-clad fixture of 1960s counterculture and figurehead of the Hells Angels motorcycle club who was at the notorious Rolling Stones concert at Altamont Speed… [+3922 chars]"}]}