{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Joann S. Lublin", "title": "Sonos CEO Patrick Spence Sounds Off About Big Tech Behaving Badly - TIME", "description": "Before its August recess, the U.S. Senate may vote on a bill that seeks to restrain anticompetitive behavior by the likes of Amazon, Google, Meta…", "url": "https://time.com/6199829/sonos-ceo-sounds-off-on-big-tech/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/Sonos-CEO1.png?w=1200&h=628&crop=1", "publishedAt": "2022-07-24T11:00:00Z", "content": "Before its August recess, the U.S. Senate may vote on a bill that seeks to restrain anticompetitive behavior by the likes of Amazon, Google, Meta and other tech giants. Sonos chief executive Patrick … [+10248 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eliana Dockterman", "title": "Dwayne Johnson Says Black Adam is the Future of the DC Universe", "description": "Dwyane Johnson, a.k.a. the Rock, has been trying to get a film about the DC Comics anti-hero Black Adam made for over 10 years. Black Adam, a fan-favorite character, is a onetime slave-turned-god who is reborn into modern times. Unlike most superheroes, he ha…", "url": "https://time.com/6198344/dwayne-johnson-dc-comic-con-black-adam-shazam2/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/dwayne-johnson-black-adam.jpeg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-23T22:10:03Z", "content": "Dwayne Johnson, a.k.a. the Rock, has been trying to get a film about the DC Comics anti-hero Black Adam made for over 10 years. Black Adam, a fan-favorite character, is a onetime slave-turned-god who… [+2569 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eliana Dockterman", "title": "George R.R. Martin Defends the Misogyny in Westeros in House of Dragon Comic-Con Panel", "description": "\"My books are fantasies obviously, but I do follow history a lot. I take elements from history and turn it up to 11,\" said Martin", "url": "https://time.com/6198348/house-of-dragon-game-of-thrones-comic-con/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/emma-d-arcy-rhaenyra-targaryen-house-of-the-dragon.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-23T21:03:17Z", "content": "A Song of Ice and Fire author and Game of Thrones mastermind George R.R. Martin made a rare appearance at the House of Dragon panel at San Diego Comic-Con on Saturday. The writer has been holed up at… [+3422 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Anisha Kohli", "title": "What to Know About the Pope’s Visit to Canada and Apology to Indigenous Communities", "description": "On July 24, Pope Francis will begin a weeklong trip across Canada that he called a “pilgrimage of penance” to meet with Indigenous communities and formally apologize for the rampant abuse and “cultural genocide,” at residential schools—run by the Roman Cathol…", "url": "https://time.com/6199934/pope-canada-indigenous-apology/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/Pope-to-vist.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-23T19:37:36Z", "content": "On July 24, Pope Francis will begin a weeklong trip across Canada that he called a “pilgrimage of penance” to meet with Indigenous communities and formally apologize for the rampant abuse and “cultur… [+9057 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Time", "title": "World Health Organization Declares Monkeypox a Global Emergency", "description": "The World Health Organization said the expanding monkeypox outbreak in more than 70 countries is an “extraordinary” situation that now qualifies as a global emergency, a declaration Saturday that could spur further investment in treating the once-rare disease…", "url": "https://time.com/6199925/who-declares-monkeypox-global-emergency/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/MP@.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-23T14:39:33Z", "content": "LONDON — The World Health Organization said the expanding monkeypox outbreak in more than 70 countries is an “extraordinary” situation that now qualifies as a global emergency, a declaration Saturday… [+5552 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "ANNE D'INNOCENZIO / AP", "title": "T-Mobile Settles to Pay $350 Million to Customers After Personal Data Breach", "description": "T- Mobile has agreed to pay $350 million to customers affected by a class action lawsuit filed after the company disclosed last August that personal data like social security numbers had been stolen in a cyberattack.", "url": "https://time.com/6199921/tmobile-data-breach-settlement/", "urlToImage": "https://api.time.com/wp-content/uploads/2016/10/161013_em_tmobile.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-23T14:25:04Z", "content": "NEW YORK — T- Mobile has agreed to pay $350 million to customers affected by a class action lawsuit filed after the company disclosed last August that personal data like social security numbers had b… [+1209 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Ian Bremmer", "title": "What Italy’s Political Chaos Means for Europe", "description": "Italy is now barreling toward an uncertain political future. Prime Minister Mario Draghi, the former European Central Bank chief who saved the Eurozone almost exactly a decade ago by pledging publicly to do “whatever it takes” to steer Europe through its sove…", "url": "https://time.com/6199642/italy-politics-turmoil/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-1242047183.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-23T11:00:45Z", "content": "Italy is now barreling toward an uncertain political future. Prime Minister Mario Draghi, the former European Central Bank chief who saved the Eurozone almost exactly a decade ago by pledging publicl… [+5227 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Zoe Yu", "title": "I’m a Student in Texas. My Teachers and I Shouldn’t Be Responsible for Stopping a Mass Shooting", "description": "On May 24, 19 students and two teachers were shot and killed at Robb Elementary in Uvalde, Texas—the deadliest mass shooting in our state’s history. I remember staring at my phone as the gut-wrenching headlines rolled in: fourth-grader Miah Cerrillo had cover…", "url": "https://time.com/6199128/school-hardening-gun-violence-student-reaction/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/texas-hardening-schools.jpg?quality=85&crop=0px%2C345px%2C2400px%2C1256px&resize=1200%2C628&strip", "publishedAt": "2022-07-23T11:00:17Z", "content": "On May 24, 19 students and two teachers were shot and killed at Robb Elementary in Uvalde, Texas—the deadliest mass shooting in our state’s history. I remember staring at my phone as the gut-wrenchin… [+5119 chars]"}]}