{"status": "ok", "totalResults": 16, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Erwin Chemerinsky", "title": "Abortion Is About to Dominate American Politics Like Never Before", "description": "In overruling Roe v. Wade, the Supreme Court held that women no longer have a constitutional right to abortion. In Dobb’s v. Jackson Women’s Health Organization, the Court ruled that the issue of abortion is left entirely to the political process. What will t…", "url": "https://time.com/6191444/abortion-dominate-politics/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1241557574.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-27T14:43:24Z", "content": "In overruling Roe v. Wade, the Supreme Court held that women no longer have a constitutional right to abortion. In Dobb’s v. Jackson Women’s Health Organization, the Court ruled that the issue of abo… [+4451 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Maria Cheng / AP", "title": "Monkeypox Is Not a Global Emergency ‘At This Stage,’ WHO Says", "description": "The World Health Organization (WHO) said the escalating monkeypox outbreak does not warrant being declared a global health emergency.", "url": "https://time.com/6191561/monkeypox-global-emergency-who/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/monkeypox-virus.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-27T14:37:49Z", "content": "(London) — The World Health Organization (WHO) said the escalating monkeypox outbreak in more than 50 countries should be closely monitored but does not warrant being declared a global health emergen… [+4777 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Judy Berman", "title": "Only Murders in the Building Season 2 Wisely Sticks to a Winning Formula", "description": "Aside from the fact they’re now trying to clear their own names—and Mabel’s in particular—fans can expect more of the same charming, intergenerational citizen-detective stuff they fell hard for last summer", "url": "https://time.com/6190642/only-murders-in-the-building-season-2-review/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/omitb_202_cb_00054rt.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-27T12:00:42Z", "content": "In the second season of Only Murders in the Building, the investigators become the investigated. Fresh off of cracking the Tim Kono case, the unlikely trio of has-been actor Charles-Haden Savage (co-… [+4404 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "JIM HEINTZ/ AP", "title": "Brittney Griner to Appear in Russian Court Ahead of Trial", "description": "(MOSCOW) — More than four months after she was arrested at a Moscow airport for cannabis possession, American basketball star Brittney Griner is to appear in court Monday for a preliminary hearing ahead of her trial. The Phoenix Mercury star, considered in so…", "url": "https://time.com/6191512/brittney-griner-russia-court/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/brittney-griner-russia.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-27T11:14:00Z", "content": "(MOSCOW) — More than four months after she was arrested at a Moscow airport for cannabis possession, American basketball star Brittney Griner is to appear in court Monday for a preliminary hearing ah… [+2957 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Tommaso Ebhardt / Bloomberg", "title": "Leonardo Del Vecchio, Billionaire Ray-Ban Owner, Dies at 87", "description": "Leonardo Del Vecchio, the Italian entrepreneur and owner of iconic brands like Ray-Ban and Oakley, has died.", "url": "https://time.com/6191505/leonardo-del-vecchio-ray-ban-dies/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1405368322.jpg?quality=85&crop=0px%2C9px%2C681px%2C356px&resize=1200%2C628&strip", "publishedAt": "2022-06-27T11:05:19Z", "content": "Leonardo Del Vecchio, the Italian entrepreneur who started off with a tiny optics workshop in the Dolomite mountains and ended up as the undisputed world leader in eyewear, has died. He was 87.\r\nHis … [+3679 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eloise Barry", "title": "The 2022 NATO Summit Could Be the Most Important in Recent Decades. Here’s Why", "description": "Western leaders will meet in the Spanish capital Madrid from Jun. 28 to Jun. 30 for what many are expecting to be the most important summit of the North Atlantic Treaty Organization (NATO) in recent decades. Just months after the invasion of NATO ally Ukraine…", "url": "https://time.com/6190443/nato-summit-2022/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/jens-stoltenberg-pedro-sanchez.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-27T10:38:14Z", "content": "Western leaders will meet in the Spanish capital Madrid from Jun. 28 to Jun. 30 for what many are expecting to be the most important summit of the North Atlantic Treaty Organization (NATO) in recent … [+8689 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Zeke Miller and Geir Moulson / AP", "title": "G7 Leaders To Commit To Supporting Ukraine as U.S. Prepares to Send Surface-to-Air Missile System", "description": "The war in Ukraine was already at the forefront of the G7 leaders' minds—just as Russian missiles hit the Ukrainian capital of Kyiv for the first time in weeks.", "url": "https://time.com/6191477/g7-summit-ukraine-biden-anti-air-system/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/g7-2022-germany.jpeg?quality=85&crop=0px%2C487px%2C4415px%2C2311px&resize=1200%2C628&strip", "publishedAt": "2022-06-27T06:29:59Z", "content": "ELMAU, Germany — The Group of Seven economic powers are set to commit themselves to supporting Ukraine in the long haul, with the U.S. preparing to announce the purchase of an advanced surface-to-air… [+4616 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jonathan Landrum Jr. / AP", "title": "Stars Use BET Awards Stage to Criticize Roe v. Wade Ruling", "description": "LOS ANGELES — Taraji P. Henson, Janelle Monae and Jazmine Sullivan were some of the big stars using the BET Awards stage to strongly criticize the Supreme Court’s recent decision to strip away women’s constitutional protection for abortion. Henson took the st…", "url": "https://time.com/6191474/bet-awards-roe-v-wade/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/taraji-bet-awards-roe-wade.jpeg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-27T05:45:27Z", "content": "LOS ANGELES — Taraji P. Henson, Janelle Monae and Jazmine Sullivan were some of the big stars using the BET Awards stage to strongly criticize the Supreme Court’s recent decision to strip away women’… [+4370 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "OLEKSANDR STASHEVSKYI / AP", "title": "Russia Strikes Kyiv as Western Leaders Meet at G7 Summit", "description": "Russia shattered weeks of relative calm in the Ukrainian capital with long-range missiles fired toward Kyiv early Sunday, an apparent Kremlin show-of-force as Western leaders meet in Europe to strengthen their military and economic support of Ukraine.", "url": "https://time.com/6191462/russia-strikes-kyiv-western-leaders-meet-europe/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/Kyiv-.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-26T18:17:43Z", "content": "KYIV, Ukraine — Russia shattered weeks of relative calm in the Ukrainian capital with long-range missiles fired toward Kyiv early Sunday, an apparent Kremlin show-of-force as Western leaders meet in … [+4803 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Bloomberg", "title": "Arson Fire Damages Christian Pregnancy Center in Colorado", "description": "Bloomberg — Police in Longmont, Colorado, are investigating a weekend arson fire that damaged a Christian pregnancy center just hours after the US Supreme Court overturned Roe v. Wade. The blaze struck the Life Choices ministry early Saturday, according to a …", "url": "https://time.com/6191456/arson-christian-pregnancy-center-in-colorado/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1291135403.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-26T17:44:05Z", "content": "Bloomberg — Police in Longmont, Colorado, are investigating a weekend arson fire that damaged a Christian pregnancy center just hours after the US Supreme Court overturned Roe v. Wade.\r\nThe blaze str… [+467 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Police Investigate Cause of At Least 20 Deaths in South African Club", "description": "JOHANNESBURG — South African police are investigating the deaths of at least 20 people at a nightclub in the coastal town of East London early Sunday. It is unclear what led to the deaths of the young people, who were reportedly attending a party to celebrate…", "url": "https://time.com/6191451/south-african-20-deaths-club/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/SA.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-26T17:29:39Z", "content": "JOHANNESBURG — South African police are investigating the deaths of at least 20 people at a nightclub in the coastal town of East London early Sunday.\r\nIt is unclear what led to the deaths of the you… [+1019 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Off-Duty Officer Charged With Assault at Abortion Protest in Rhode Island", "description": "Jennifer Rourke, the chair of the progressive Rhode Island Political Cooperative seeking the Democratic nomination for a state Senate seat, said she had been punched in the face at least twice by Jeann Lugo, 35", "url": "https://time.com/6191447/officer-charged-assault-abortion-protest-rrhode-island/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1291135403.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-26T16:57:38Z", "content": "PROVIDENCE, R.I. — A Rhode Island police officer accused of punching a woman at an abortion protest while he was off-duty has now been charged in connection with Friday’s demonstration at the State H… [+2723 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "y BOBBY CAINA CALVAN / AP", "title": "Pride Parades Kick Off Across the U.S. With New Urgency After Roe v. Wade Overturned", "description": "The annual marches in take place just two days after one conservative justice on the Supreme Court signaled, in a ruling on abortion, that the court should reconsider the right to same-sex marriage recognized in 2015", "url": "https://time.com/6191432/pride-parade-lgbtq-roe/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/Pride-1.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-26T15:27:49Z", "content": "NEW YORK — Parades celebrating LGBTQ pride kick off in some of America’s biggest cities Sunday amid new fears about the potential erosion of freedoms won through decades of activism.\r\nThe annual marc… [+4332 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Julie F. Kay", "title": "With Roe Gone, Here’s How to Save Abortion Rights", "description": "The Supreme Court confirmed what was long suspected: Roe v. Wade is dead. No time for mourning, let’s get to work on what we must do to save our fundamental reproductive rights. First, let’s take a moment to unpack the Court’s ruling. An ultra-conservative Su…", "url": "https://time.com/6191376/roe-v-wade-end-abortion-rights/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1241531933.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-26T15:24:15Z", "content": "The Supreme Court confirmed what was long suspected: Roe v. Wade is dead. No time for mourning, let’s get to work on what we must do to save our fundamental reproductive rights.\r\nFirst, let’s take a … [+7256 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Norway Mourns Victims of Oslo Shooting With Memorial Service", "description": "Norway's prime minister and members of the royal family joined mourners at a memorial service in Oslo Cathedral Sunday for the victims of a shooting in the capital's nightlife district.", "url": "https://time.com/6191424/pride-day-shooting-oslo-norway/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/Norway.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-26T15:08:05Z", "content": "OSLO, Norway — Norway’s prime minister and members of the royal family joined mourners at a memorial service in Oslo Cathedral Sunday for the victims of a shooting in the capital’s nightlife district… [+2010 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eben Shapiro", "title": "AT&T’s CEO John Stankey Is Facing the Most Challenging Time of His Career", "description": "Even iconic companies can endure a grueling identity crisis. AT&T has long been one of the most respected names in corporate America. Many Fortune 100 companies rely on the telecom giant for vital communications infrastructure and it is a leading provider of …", "url": "https://time.com/6191372/john-stankey-att-leadership-brief/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/John-Stankey-TIME-Photo.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-26T11:00:57Z", "content": "Even iconic companies can endure a grueling identity crisis. AT&amp;T has long been one of the most respected names in corporate America. Many Fortune 100 companies rely on the telecom giant for vita… [+11315 chars]"}]}