{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Rhode Island Officer Suspended for Off-Duty Actions at Abortion Protest", "description": "A Rhode Island police officer accused of punching a woman at an abortion protest while he was off-duty was suspended from his job with pay Saturday while the Providence Police Department conducts a criminal investigation into his actions", "url": "https://time.com/6191409/officer-suspended-abortion-protest/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1291135403.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-25T19:24:49Z", "content": "PROVIDENCE, R.I. — A Rhode Island police officer accused of punching a woman at an abortion protest while he was off-duty was suspended from his job with pay Saturday while the Providence Police Depa… [+1968 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "David Welch, Danielle Bochove and Natalie Obiko Pearson / Bloomberg", "title": "With Roe v. Wade Overturned, Canada Could Become an Abortion Destination", "description": "The Bloor West Village Women’s Clinic in Toronto has had very few American patients, despite advertising its abortion services internationally. That may be about to change.", "url": "https://time.com/6191400/abortions-canada-roe/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/Canada.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-25T17:13:47Z", "content": "Bloomberg — The Bloor West Village Women’s Clinic in Toronto has had very few American patients, despite advertising its abortion services internationally. That may be about to change.\r\nThe US Suprem… [+5516 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "MARIA SANMINIATELLI AND KARL RITTER / AP", "title": "Pfizer Says Tweaked COVID-19 Vaccines Boost Omicron Protection", "description": "Now with omicron’s even more transmissible relatives spreading widely, the FDA is considering ordering a recipe change for the vaccines made by both Pfizer and rival Moderna in hopes that modified boosters could better protect against another COVID-19 surge e…", "url": "https://time.com/6191395/pfizer-covid19-omicron/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/Pfizer.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-25T15:28:55Z", "content": "Pfizer announced Saturday that tweaking its COVID-19 vaccine to better target the omicron variant is safe and works — just days before regulators debate whether to offer Americans updated booster sho… [+2495 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "MARIA SANMINIATELLI and KARL RITTER / AP", "title": "Gunman Kills 2 During Oslo Pride Festival in Suspected ‘Terror Act’", "description": "A gunman opened fire in Oslo’s nightlife district early Saturday, killing two people and leaving more than 20 wounded in what the Norwegian security service called an \"Islamist terror act\" during the capital’s annual LGBTQ Pride festival.", "url": "https://time.com/6191389/gunman-kills-2-oslo-pride-festival/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/pride.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-25T15:09:16Z", "content": "OSLO, Norway — A gunman opened fire in Oslo’s nightlife district early Saturday, killing two people and leaving more than 20 wounded in what the Norwegian security service called an “Islamist terror … [+5898 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "WILL WEISSERT / AP", "title": "‘Lives Will Be Saved’: President Biden Signs Landmark Gun Measure", "description": "President Joe Biden on Saturday signed the most sweeping gun violence bill in decades, a bipartisan compromise that seemed unimaginable until a recent series of mass shootings, including the massacre of 19 students and two teachers at a Texas elementary schoo…", "url": "https://time.com/6191385/biden-signs-gun-violence-bill/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/Biden-1.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-25T14:51:37Z", "content": "WASHINGTON — President Joe Biden on Saturday signed the most sweeping gun violence bill in decades, a bipartisan compromise that seemed unimaginable until a recent series of mass shootings, including… [+4082 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Phil Klay", "title": "Eric Greitens’ Embarrassing Fantasies of Political Violence", "description": "There’s always been something a little pathetic with how Eric Greitens publicizes himself. After the Osama bin Laden raid, he went on cable show after cable show, hawking his memoir and explaining how SEALs like himself operate, but always forgetting to menti…", "url": "https://time.com/6190779/eric-greitens-ad-political-violence/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1238739918.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-25T11:00:06Z", "content": "There’s always been something a little pathetic with how Eric Greitens publicizes himself. After the Osama bin Laden raid, he went on cable show after cable show, hawking his memoir and explaining ho… [+6323 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eric Cortellessa", "title": "By Overturning Roe v. Wade, Supreme Court Makes Abortion a Top Election Issue", "description": "The issue will be particularly salient in a handful of races where the outcome could determine abortion access in those states.", "url": "https://time.com/6191303/abortion-2022-elections-roe-v-wade/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/supreme-court-abortion-election-03.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-25T03:08:45Z", "content": "The Supreme Court’s decision on Friday to overturn Roe v. Wade immediately thrust an explosive issue into the foreront of midterm races throughout the country, as Democrats vowed to fight to restore … [+8538 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Julia Zorthian", "title": "Merrick Garland’s Mention of the FDA Hints at One Possible Way to Fight Restrictions on Abortion Pills", "description": "On the heels of the Supreme Court decision that struck down the national right to abortion, Attorney General Merrick Garland issued a statement proclaiming that the Justice Department disagrees with the verdict. In addition to vowing to “work tirelessly to pr…", "url": "https://time.com/6191270/abortion-pills-bans-fda-merrick-garland/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/mifepristone-abortion-pills-garland-02.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-25T01:44:27Z", "content": "On the heels of the Supreme Court decision that struck down the national right to abortion, Attorney General Merrick Garland issued a statement proclaiming that the Justice Department disagrees with … [+4317 chars]"}]}