{"status": "ok", "totalResults": 32, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "SETH BORENSTEIN / AP", "title": "Expect More Disasters, U.N. Warns, as Climate Change Worsens Everything From Droughts to Economic Meltdowns", "description": "U.N. report predicts the number of extreme heat waves in 2030 will be three times what it was in 2001 and there will be 30% more droughts", "url": "https://time.com/6170670/un-disasters-climate-change/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/flooding-disaster-climate-change.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-26T13:47:31Z", "content": "A disaster-weary globe will be hit harder in the coming years by even more catastrophes colliding in an interconnected world, a United Nations report issued Monday says.\r\nIf current trends continue t… [+3805 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Zeke Miller / AP", "title": "Biden Administration Is Making the COVID-19 Antiviral Pill Paxlovid Easier to Get", "description": "President Joe Biden's administration is taking steps to expand availability of Paxlovid, which will be distributed directly to pharmacies.", "url": "https://time.com/6170672/covid-19-pill-paxlovid-availability/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/covid-19-antiviral-paxlovid.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-26T13:35:48Z", "content": "(Washington D.C.) — President Joe Biden’s administration is taking steps to expand availability of the life-saving COVID-19 antiviral treatment Paxlovid, as it seeks to reassure doctors that there is… [+2732 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Olivia B. Waxman", "title": "What These 3 Longstanding JFK Myths Reveal About America", "description": "Nearly 60 years after his assassination, myths about John F. Kennedy's time in office persist. The author of a new book on JFK debunks three of the most common", "url": "https://time.com/6165142/jfk-myths/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/jfk.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-26T13:00:54Z", "content": "Nearly six decades after President John F. Kennedy’s assassination on Nov. 22, 1963, myths and misunderstandings persist about the President.The tragic way in which the handsome political leader was … [+7000 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Aubrey Hirsch", "title": "Many Americans Are Celebrating the End of COVID-19. Here’s What It Feels Like When You’re Not", "description": "People across the United States are ditching their masks, resuming their lives, and celebrating the end of COVID-19. But for millions of Americans, the pandemic is far from over. An estimated 40% of U.S. adults have at least two conditions that put them at in…", "url": "https://time.com/6170489/covid-19-pandemic-not-over-feelings/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/IsCovidOverHeader.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-26T12:56:21Z", "content": "People across the United States are ditching their masks, resuming their lives, and celebrating the end of COVID-19. But for millions of Americans, the pandemic is far from over. An estimated 40% of … [+548 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Corinne Redfern and Ali Ahsan", "title": "Tens of Thousands of Boys in Bangladesh Were Forced into Work During the Pandemic. Now School Is Resuming Without Them", "description": "As inflation soars, getting Bangladeshi children out of the workplace and back into schools will take more than outlawing their labor.", "url": "https://time.com/6170432/bangladesh-child-labor-pandemic/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/220509wbangladesh_001.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-26T09:00:34Z", "content": "This story was supported by the Pulitzer Center\r\nBy the time the sun sinks over the Bangladeshi capital of Dhaka, Rekha is struggling to sit still. Twisting her plastic bangles, the 34-year-old mothe… [+13238 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "COLLEEN BARRY / AP", "title": "Female and Gender Nonconforming Artists Dominate the Venice Biennale for the First Time", "description": "For the first time, the world’s most important contemporary art fair features a majority of female and gender non-conforming artists.", "url": "https://time.com/6170628/female-gender-nonconforming-artists-venice-biennale/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/AP22109665824603.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-26T08:06:36Z", "content": "VENICE, Italy — For the first time in the 127-year history of the Venice Biennale, the world’s oldest and most important contemporary art fair features a majority of female and gender non-conforming … [+5194 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Bloomberg", "title": "Beijing Begins Unprecedented COVID-19 Testing of Millions of Residents", "description": "Millions in the Chinese capital will be tested as part of an unprecedented drive to quash Omicron's spread before it spirals out of control.", "url": "https://time.com/6170623/beijing-covid/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/GettyImages-1240241770.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-26T07:46:20Z", "content": "Beijing started mass testing millions of its residents as part of an unprecedented scheme designed to identify and squash omicron’s stealthy spread before it spirals out of control in the Chinese cap… [+2539 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "DAVID KEYTON and JON GAMBRELL / AP", "title": "Russian Foreign Minister Sergei Lavrov Warns Ukraine Against Provoking World War III", "description": "Russian Foreign Minister Sergei Lavrov said that NATO had effectively \"entered into a war with Russia through proxies.”", "url": "https://time.com/6170616/russia-ukraine-world-war/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/GettyImages-1239070145.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-26T07:29:19Z", "content": "KYIV, Ukraine — Russia’s top diplomat warned Ukraine against provoking World War III and said the threat of a nuclear conflict “should not be underestimated” as his country unleashed attacks against … [+7926 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Chad de Guzman", "title": "Jeff Bezos Wonders If China Will Have Leverage Over Twitter Following Elon Musk’s Purchase", "description": "The Amazon founder wonders if Elon Musk's business interests will give China influence over the social media platform after Musk's purchase.", "url": "https://time.com/6170604/jeff-bezos-twitter-china-elon-musk/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/GettyImages-1341554748.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-26T05:19:47Z", "content": "Jeff Bezos has asked if Tesla CEO Elon Musk’s leveraged buyout of Twitter will give China influence over the social media company.\r\nLate Monday, the Amazon founder retweeted an observation from New Y… [+2023 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Brian Bennett", "title": "What Elon Musk’s Purchase of Twitter Could Mean for Donald Trump’s Account", "description": "Hours after Elon Musk bought Twitter, conservative Fox News host Tucker Carlson returned to the platform following a suspension for “hateful conduct” in tweets insisting a transgender senior Administration official was a man. When Twitter reopened Carlson’s a…", "url": "https://time.com/6170560/elon-musk-twitter-trump-future/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/donald-trump-elon-musk-twitter.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-26T03:25:08Z", "content": "Hours after Elon Musk bought Twitter, conservative Fox News host Tucker Carlson returned to the platform following a suspension for “hateful conduct” in tweets insisting a transgender senior Administ… [+5028 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Andrew R. Chow", "title": "Why Elon Musk’s Plans to ‘Fix’ Twitter Will Be Harder to Implement Than He Thinks", "description": "Elon Musk has laid out a series of changes to Twitter after making a deal to buy the social media giant for $44 billion. Here's what he plans—and whether it will work.", "url": "https://time.com/6170494/elon-musk-fix-twitter-plans/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/GettyImages-1238367009.jpg?quality=85&crop=0px%2C856px%2C6048px%2C3166px&resize=1200%2C628&strip", "publishedAt": "2022-04-26T02:39:28Z", "content": "Elon Musk is purchasing Twitter. After months of publicly toying with the idea, the world’s richest man successfully negotiated a deal to buy the social media platform for $44 billion. \r\nOn Monday, M… [+9352 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Amy Odell", "title": "How Anna Wintour Wields Her Power", "description": "On the evening of May 2, Anna Wintour will take her place at the top of the carpeted steps leading into New York City’s Metropolitan Museum of Art. Wintour, now Condé Nast’s global chief content officer as well as the global editorial director of Vogue, has b…", "url": "https://time.com/6170179/anna-wintour-met-gala-amy-odell-book/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/anna-the-biography-anna-wintour-met-gala.jpg?quality=85&crop=0px%2C0px%2C2400px%2C1256px&resize=1200%2C628&strip", "publishedAt": "2022-04-25T22:15:10Z", "content": "On the evening of May 2, Anna Wintour will take her place at the top of the carpeted steps leading into New York City’s Metropolitan Museum of Art. Wintour, now Condé Nast’s global chief content offi… [+16234 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "MATTHEW BARAKAT / AP", "title": "Johnny Depp’s Decision to Sue Amber Heard: ‘Only Time I Was Able to Fight Back’", "description": "FAIRFAX, Va. — Actor Johnny Depp concluded a grueling four days on the witness stand Monday, telling jurors in a calm voice that he filed his libel lawsuit against his ex-wife because it was his best chance to reclaim his reputation, just hours after they hea…", "url": "https://time.com/6170540/johnny-depp-amber-heard-reason-libel-lawsuit/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/GettyImages-1393678923.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-25T21:50:25Z", "content": "FAIRFAX, Va. — Actor Johnny Depp concluded a grueling four days on the witness stand Monday, telling jurors in a calm voice that he filed his libel lawsuit against his ex-wife because it was his best… [+4333 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Josiah Bates", "title": "The True Story Behind HBO’s We Own This City and the Rogue Gun Task Force That Terrorized Baltimore", "description": "We Own This City, an HBO Max miniseries out April 25, about a Baltimore Police Department (BPD) task force unit that went rogue, highlights some of the biggest concerns with modern policing in America. Adapted from former Baltimore Sun reporter Justin Fenton’…", "url": "https://time.com/6168269/we-own-this-city-true-story-hbo-max/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/we-own-this-city-1.jpeg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-25T21:45:46Z", "content": "We Own This City, an HBO Max miniseries out April 25, about a Baltimore Police Department (BPD) task force unit that went rogue, highlights some of the biggest concerns with modern policing in Americ… [+6973 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Kurt Wagner and Ed Ludlow / Bloomberg", "title": "Twitter Locks Down Product Changes After Accepting Musk’s Controversial Offer", "description": "Twitter Inc. locked down changes to its social networking platform, making it harder for employees to make unauthorized changes", "url": "https://time.com/6170501/twitter-lock-down-changes-musk-bid/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/twitter-lock-down-changes-musk-bid.jpg?quality=85&w=896&h=484&crop=1", "publishedAt": "2022-04-25T21:36:02Z", "content": "Twitter Inc. locked down changes to its social networking platform through Friday after accepting a $44 billion bid from billionaire Elon Musk, making it harder for employees to make unauthorized cha… [+1373 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jasmine Aguilera", "title": "100,000 Ukrainians Are Now Welcome to the U.S.—But Without Benefits or a Path to Citizenship", "description": "The U.S. Department of Homeland Security (DHS) launched a new program on Monday, Uniting for Ukraine, designed to quickly resettle up to 100,000 Ukrainians in the U.S. While human rights advocates applauded the new program, they criticized the method through …", "url": "https://time.com/6170334/ukrainian-refugees-biden-program/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/Uniting-For-Ukraine.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-25T20:44:18Z", "content": "The U.S. Department of Homeland Security (DHS) launched a new program on Monday, Uniting for Ukraine, designed to quickly resettle up to 100,000 Ukrainians in the U.S. While human rights advocates ap… [+6895 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Juan A. Lozano / AP", "title": "Melissa Lucio’s Execution for the Death of Her Daughter Delayed by Texas Appeals Court", "description": "Lucio’s attorneys say her capital murder conviction was based on an unreliable and coerced confession", "url": "https://time.com/6170428/melissa-lucio-execution-delayed/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/melissa-lucio-execution-delayed.jpg?quality=85&crop=0px%2C83px%2C881px%2C461px&resize=1200%2C628&strip", "publishedAt": "2022-04-25T19:16:33Z", "content": "HOUSTON (AP) — A Texas appeals court on Monday delayed the execution of a woman amid growing doubts about whether she fatally beat her 2-year-old daughter in a case that has garnered the support of l… [+1532 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Megan McCluskey", "title": "Elon Musk Reaches $44 Billion Deal to Buy Twitter", "description": "Elon Musk secured an agreement to purchase Twitter for $44 billion in one of the biggest-ever leveraged buyouts of a listed company.", "url": "https://time.com/6170319/elon-musk-buys-twitter/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/elon-musk-twitter-2.jpg?quality=85&crop=0px%2C340px%2C2400px%2C1256px&resize=1200%2C628&strip", "publishedAt": "2022-04-25T19:08:25Z", "content": "Elon Musk secured an agreement to purchase Twitter for approximately $44 billion on Monday following a night of negotiations with the social media company’s 11 board members.\r\nThe deal, one of the bi… [+2968 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Philip Elliott", "title": "Why U.S. Diplomats and Their Protectors in Ukraine Are a Key Signal to Russia", "description": "This article is part of The D.C. Brief, TIME’s politics newsletter. Sign up here to get stories like this sent to your inbox. Two competing versions of Ukraine are consuming Washington right now, about whether Russia is on its back foot or as dangerous as eve…", "url": "https://time.com/6170406/diplomats-marines-ukraine-russia/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/diplomats-ukraine-blinken.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-25T18:25:22Z", "content": "This article is part of The D.C. Brief, TIME’s politics newsletter. Sign up here to get stories like this sent to your inbox.\r\nTwo competing versions of Ukraine are consuming Washington right now, ab… [+6083 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Charlie Campbell / London", "title": "Tina Brown Breaks Down the Biggest Royal Family Revelations From Her New Book", "description": "It’s the world’s most famous and, some might argue, dysfunctional family: Britain’s House of Windsor exudes wealth, glamor and a remarkable penchant for backstabbing that has beguiled us regular folk for decades. From the acrimonious split between Charles and…", "url": "https://time.com/6170275/tina-brown-royal-family-revelations-interview/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/royal-family-prince-andrew-queen-elizabeth.jpg?quality=85&crop=0px%2C28px%2C2400px%2C1256px&resize=1200%2C628&strip", "publishedAt": "2022-04-25T18:09:36Z", "content": "It’s the world’s most famous and, some might argue, dysfunctional family: Britain’s House of Windsor exudes wealth, glamor and a remarkable penchant for backstabbing that has beguiled us regular folk… [+11854 chars]"}]}