{"status": "ok", "totalResults": 14, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "New Doctor Who Star Is Sex Education Actor Ncuti Gatwa", "description": "Ncuti Gatwa will take the mantle from Jodie Whittaker on “Doctor Who,” the BBC announced Sunday, ending speculation over the iconic Time Lord's next regeneration.", "url": "https://time.com/6174803/doctor-who-ncuti-gwata/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1396247031.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-09T13:56:35Z", "content": "LONDON — Ncuti Gatwa will take the mantle from Jodie Whittaker on “Doctor Who,” the BBC announced Sunday, ending speculation over the iconic Time Lord’s next regeneration.\r\n“Sometimes talent walks th… [+2264 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "MARK KENNEDY / AP", "title": "A Strange Loop Earns a Leading 11 Tony Award Nominations", "description": "NEW YORK — “A Strange Loop,” Michael R. Jackson’s critically cheered theater meta-journey, earned a leading 11 Tony Award nominations Monday as Broadway joined the national discussion of race by embracing an envelope-pushing Black-written and Black-led musica…", "url": "https://time.com/6174792/tony-awards-nominees/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/astrangeloop.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-09T13:42:20Z", "content": "NEW YORK — “A Strange Loop,” Michael R. Jackson’s critically cheered theater meta-journey, earned a leading 11 Tony Award nominations Monday as Broadway joined the national discussion of race by embr… [+5284 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Cady Lang and Video by Diane Tsai", "title": "How an Asian American Opera Singer Found Her Voice Amid a Reckoning with Race", "description": "Amid a reckoning with anti-Asian racism, Nina Yoshida Nelsen is speaking out against racism and calling for better representation in opera.", "url": "https://time.com/6174438/nina-yoshida-nelsen-opera-racism-representation/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Nina-Yoshida-Nelsen.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-09T12:00:10Z", "content": "For the mezzo-soprano opera singer Nina Yoshida Nelsen, a reckoning has been long overdue. Following the March 2021 Atlanta spa shootings, Nelsen, a fourth-generation Japanese American, had a moment … [+6940 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Asantha Sirimanne / Bloomberg", "title": "Sri Lanka Imposes Curfew as Government Backers, Protesters Clash", "description": "Sri Lanka has imposed a nationwide curfew as clashes erupted between government supporters and citizen protesters demanding the premier and his brother, the president, resign in recognition of the nation’s worst economic crisis since independence. Local news …", "url": "https://time.com/6174743/sri-lanka-curfew-protests/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1240557028.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-09T10:06:01Z", "content": "Sri Lanka has imposed a nationwide curfew as clashes erupted between government supporters and citizen protesters demanding the premier and his brother, the president, resign in recognition of the na… [+2269 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Frederick W. Kagan", "title": "Ukraine Shows the Strength of a Free People", "description": "The Russian invasion of Ukraine is a confrontation of a dictatorship against a free people. The free people are winning in no small part because they are free. Ukraine and Russia both emerged from the ruin of the Soviet Union with the burden of generations of…", "url": "https://time.com/6174713/ukraine-war-free-people/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1240540124.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-09T10:00:12Z", "content": "The Russian invasion of Ukraine is a confrontation of a dictatorship against a free people. The free people are winning in no small part because they are free.\r\nUkraine and Russia both emerged from t… [+8388 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eric Cortellessa", "title": "Exclusive: U.S. Congressman’s Campaign May Violate State Election Law", "description": "Rep. Anthony Brown, Democrat of Maryland, wants to be the state’s top law enforcement officer, but his own campaign’s spending may violate state election law, according to campaign finance experts. The three-term congressman announced on Oct. 25 that he would…", "url": "https://time.com/6174374/anthony-brown-maryland-campaign-finance-violations-exclusive/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/anthony-brown-maryland.jpg?quality=85&crop=0px%2C148px%2C2400px%2C1256px&resize=1200%2C628&strip", "publishedAt": "2022-05-09T10:00:03Z", "content": "Rep. Anthony Brown, Democrat of Maryland, wants to be the state’s top law enforcement officer, but his own campaign’s spending may violate state election law, according to campaign finance experts.\r\n… [+11362 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Bloomberg", "title": "Shanghai Tightens COVID Restrictions Even as Cases Drop to a Six-Week Low", "description": "Case numbers have fallen to a six-week low, but officials are stepping up efforts to quarantine contacts of people testing positive.", "url": "https://time.com/6174728/shanghai-covid-lockdown/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1240499750.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-09T02:27:26Z", "content": "Shanghai reported its fewest Covid-19 cases in more than six weeks, though a tightening of curbs indicates the lockdown that has confined millions of residents to their homes for more than a month wo… [+1685 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Anto Antony / Bloomberg", "title": "The Third Most Watched Sports Franchise in the World Is Planning a Women’s League", "description": "Organizers are chalking out ways to make the world's third most-watched sporting event bigger, more profitable and more diverse.", "url": "https://time.com/6174722/indian-premier-league-cricket-ipl-women/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1239538934.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-09T02:10:30Z", "content": "Indian Premier League, called the Super Bowl of cricket, is gearing up to roll out a women-only version of the game as organizers chalk out ways to make the third most-watched sporting event bigger, … [+4836 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "LINDSEY BAHR / AP", "title": "‘Doctor Strange 2’ Conjures Up Biggest Opening of 2022", "description": "The summer movie season is off to a blockbuster start thanks to “ Doctor Strange and the Multiverse of Madness.” The superhero extravaganza grossed an estimated $185 million in ticket sales in its first weekend in U.S. and Canadian theaters, the Walt Disney C…", "url": "https://time.com/6174706/doctor-strange-2022-box-office/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Dr-strange.jpg?quality=85&w=1024&h=429&crop=1", "publishedAt": "2022-05-08T17:39:37Z", "content": "The summer movie season is off to a blockbuster start thanks to “ Doctor Strange and the Multiverse of Madness.” The superhero extravaganza grossed an estimated $185 million in ticket sales in its fi… [+3617 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "ANDREA RODRÍGUEZ / AP", "title": "Havana Hotel Death Toll Rises to 30 as Dogs Search for Survivors", "description": "Search crews with dogs hunted through the ruins of a luxury hotel in Cuba's capital Sunday for survivors of an apparent gas explosion and officials raised the number of known dead to 30.", "url": "https://time.com/6174699/cuba-hotel-explosion-survivor-search/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/cuba-explosion.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-08T16:43:15Z", "content": "HAVANA — Search crews with dogs hunted through the ruins of a luxury hotel in Cuba’s capital Sunday for survivors of an apparent gas explosion and officials raised the number of known dead to 30.\r\nTh… [+2600 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "BOBBY CAINA CALVAN / AP", "title": "As New Yorkers Emerge From Pandemic, So Do Rodents", "description": "They crawled to the surface as the coronavirus pandemic roiled New York City, scurrying out of subterranean nests into the open air, feasting on a smorgasbord of scraps in streets, parks and mounds of curbside garbage. As diners shunned the indoors for outdoo…", "url": "https://time.com/6174693/rat-sightings-new-york-city/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/rats.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-08T16:21:18Z", "content": "NEW YORK — They crawled to the surface as the coronavirus pandemic roiled New York City, scurrying out of subterranean nests into the open air, feasting on a smorgasbord of scraps in streets, parks a… [+5157 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "DARLENE SUPERVILLE / AP", "title": "Jill Biden Makes Unannounced Visit to Ukraine on Mother’s Day", "description": "Jill Biden made an unannounced visit to western Ukraine on Sunday, holding a surprise Mother’s Day meeting with first lady Olena Zelenska to show U.S. support for the embattled nation as Russia presses its punishing war in the eastern regions.", "url": "https://time.com/6174685/jill-biden-visits-ukraine/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Jill-Biden.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-08T14:35:15Z", "content": "UZHHOROD, Ukraine — Jill Biden made an unannounced visit to western Ukraine on Sunday, holding a surprise Mother’s Day meeting with first lady Olena Zelenska to show U.S. support for the embattled na… [+6120 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "ELENA BECATOROS and JON GAMBRELL / AP", "title": "Dozens Feared Dead After Russian Bomb Levels Ukraine School", "description": "Dozens of Ukrainians were feared dead Sunday after a Russian bomb flattened a school sheltering about 90 people in its basement, while Ukrainian troops refused to surrender at a besieged steel plant that Moscow's invading forces sped to seize before Russia's …", "url": "https://time.com/6174679/russian-bomb-ukraine-school/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Ukraine-1.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-08T13:32:46Z", "content": "ZAPORIZHZHIA, Ukraine — Dozens of Ukrainians were feared dead Sunday after a Russian bomb flattened a school sheltering about 90 people in its basement, while Ukrainian troops refused to surrender at… [+7285 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Belinda Luscombe", "title": "‘The Office As We Know It Is Over,’ Says Airbnb CEO Brian Chesky", "description": "(To receive weekly emails of conversations with the world’s top CEOs and business decisionmakers, click here.) Airbnb CEO Brian Chesky recently announced that the company’s employees will be able to work from anywhere, including (for up to three months) overs…", "url": "https://time.com/6174653/airbnb-ceo-brian-chesky-interview/", "urlToImage": "https://api.time.com/wp-content/uploads/2016/06/brian-chesky-airbnb.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-08T11:00:20Z", "content": "(To receive weekly emails of conversations with the world’s top CEOs and business decisionmakers, clickhere.)\r\nAirbnb CEO Brian Chesky recently announced that the company’s employees will be able to … [+11779 chars]"}]}