{"status": "ok", "totalResults": 20, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Eric Cortellessa", "title": "Democrats Want Biden to Do More on Abortion, But He Faces Tricky Legal Challenges", "description": "The White House says the President faces tricky legal challenges in trying to expand access in states where abortion is now illegal.", "url": "https://time.com/6191737/abortion-biden-democrats-legal/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1403119248.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-28T00:06:21Z", "content": "Three days after the Supreme Court overturned Roe v. Wade, Republican-controlled states are moving fast to outlaw abortion, and frustration is growing among Democrats in Congress that the Biden admin… [+7135 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Lane Clarke", "title": "My Mom Gave Birth to Me After She Was Assaulted. Don’t Use My Story as an Anti-Abortion Talking Point", "description": "It’s June 27. I’m 29. It’s my birthday. And I wish it weren’t. I didn’t always hate my birthday. I distinctly remember turning 5 in my backyard with a small pony my grandma had found and the Hot Wheel cars my first-grade crush came to play with. I remember re…", "url": "https://time.com/6191663/abortion-sexual-assault-essay/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/abortion-assault-pregnancy.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-27T21:12:10Z", "content": "It’s June 27. I’m 29. It’s my birthday. And I wish it weren’t.\r\nI didn’t always hate my birthday. I distinctly remember turning 5 in my backyard with a small pony my grandma had found and the Hot Whe… [+5074 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Amtrak Train Carrying 243 People Derails in Missouri: Injuries Reported", "description": "Three passengers were taken from the scene to University Hospital in Columbia, hospital spokesman Eric Maze said. He did not have information on their conditions.", "url": "https://time.com/6191700/amtrak-train-derails-missouri/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/amtrak-train-derails-missouri.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-27T20:57:27Z", "content": "(MENDON, Mo.) — A passenger train traveling from Los Angeles to Chicago derailed in Missouri on Monday afternoon and initial reports indicate that some people aboard were injured, Amtrak said.\r\nThe S… [+714 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Simmone Shah", "title": "What Abortion Safe Haven States Can Do", "description": "The Supreme Court’s decision to overturn Roe v. Wade on June 24th triggered immediate bans on abortion in several states, which had put in place laws primed to shutter abortion clinics within their borders in anticipation of the ruling. The new law of the lan…", "url": "https://time.com/6191581/abortion-safe-haven-states/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/abortion-safe-haven-states.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-27T20:45:27Z", "content": "The Supreme Court’s decision to overturn Roe v. Wade on June 24th triggered immediate bans on abortion in several states, which had put in place laws primed to shutter abortion clinics within their b… [+2962 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Shannon Carlin", "title": "Why Martin Short Loves To Play the Self-Absorbed Narcissist", "description": "With its first season, Hulu’s hit series Only Murders in the Building satirized true-crime podcasts and their obsessive fans. In season 2, premiering June 28, the comedy starring Steve Martin, Selena Gomez, and Martin Short pokes fun at how hard it is to foll…", "url": "https://time.com/6191622/martin-short-interview-only-murders/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/omitb_202_bn_01949rt.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-27T20:02:03Z", "content": "With its first season, Hulu’s hit series Only Murders in the Building satirized true-crime podcasts and their obsessive fans. In season 2, premiering June 28, the comedy starring Steve Martin, Selena… [+5834 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Shannon Carlin", "title": "The Real Life Inspiration Behind the Horror Film The Black Phone", "description": "How do you turn a short story about a sadistic child murderer into a horrifying, but hopeful coming-of-age film? If you’re director Scott Derrickson, you use your own traumatic childhood as inspiration. Derrickson’s latest film, The Black Phone, based on Joe …", "url": "https://time.com/6191651/the-black-phone-horror-trauma/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/2540_TP_00025-e1656359204132.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-27T19:59:46Z", "content": "How do you turn a short story about a sadistic child murderer into a horrifying, but hopeful coming-of-age film? If you’re director Scott Derrickson, you use your own traumatic childhood as inspirati… [+6125 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Philip Elliott", "title": "The Fall of Roe May Save Democrats in the Midterms, at Least in the Suburbs", "description": "College-educated women in the suburbs, a group that often decides elections, were particularly galvanized by Friday's ruling.", "url": "https://time.com/6191636/abortion-midterms-democrats-suburban-white-women/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1405422072.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-27T19:46:40Z", "content": "This article is part of The D.C. Brief, TIME’s politics newsletter. Sign up here to get stories like this sent to your inbox.\r\nFor decades, while conservatives were patiently waiting for the Supreme … [+6445 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Megan L. Ranney", "title": "6 Proven Ways to Reduce Gun Violence", "description": "Last week, we saw the passage of the first package of new federal firearm-injury-related policies in a generation. We heard that funds for firearm injury prevention are likely to be reallocated. And we learned that—with the stroke of a Supreme Court decision—…", "url": "https://time.com/6191609/6-ways-to-reduce-gun-violence/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1241284587.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-27T19:33:24Z", "content": "Last week, we saw the passage of the first package of new federal firearm-injury-related policies in a generation. We heard that funds for firearm injury prevention are likely to be reallocated. And … [+6362 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Company Buying Trump’s Social Media App Faces Subpoenas", "description": "The company planning to buy Donald Trump’s Truth Social has disclosed a federal grand jury investigation that could impede the deal", "url": "https://time.com/6191586/truth-social-digital-world-subpoenas/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/company-trump-social-media-app-subpoenas.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-27T19:01:23Z", "content": "The company planning to buy Donald Trump’s new social media business has disclosed a federal grand jury investigation that it says could impede or even prevent its acquisition of the Truth Social app… [+2963 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jamie Ducharme", "title": "It’s Too Simple to Call the Juul Ban a Public Health Triumph", "description": "After the U.S. Food and Drug Administration (FDA) announced last week that it would order e-cigarette giant Juul Labs to stop selling its products in the U.S., my inbox flooded with emails from public-health groups applauding the decision. The CEO of the Amer…", "url": "https://time.com/6191593/juul-fda-ban-public-health-impact/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/juul-e-cigarette.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-27T17:34:34Z", "content": "After the U.S. Food and Drug Administration (FDA) announced last week that it would order e-cigarette giant Juul Labs to stop selling its products in the U.S., my inbox flooded with emails from publi… [+7811 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jessica Gresko / AP", "title": "Supreme Court Sides With High School Football Coach Who Sought to Pray on the Field After Games", "description": "The Supreme Court on Monday sided with a football coach from Washington state who sought to kneel and pray on the field after games.", "url": "https://time.com/6191591/supreme-court-sides-with-coach/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/supreme-court-sides-with-coach.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-27T15:51:13Z", "content": "WASHINGTON — The Supreme Court on Monday sided with a football coach from Washington state who sought to kneel and pray on the field after games.\r\nThe court ruled 6-3 for the coach with the court’s c… [+3066 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Giulia Morpurgo and Libby Cherry / Bloomberg", "title": "Russia Defaults on Foreign Debt for First Time Since 1918", "description": "It’s a grim marker in the country’s rapid transformation into an economic, financial and political outcast", "url": "https://time.com/6191532/russia-debt-default/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1239782895.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-27T15:06:27Z", "content": "Russia defaulted on its foreign-currency sovereign debt for the first time in a century, the culmination of ever-tougher Western sanctions that shut down payment routes to overseas creditors.\r\nFor mo… [+5552 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Erwin Chemerinsky", "title": "Abortion Is About to Dominate American Politics Like Never Before", "description": "In overruling Roe v. Wade, the Supreme Court held that women no longer have a constitutional right to abortion. In Dobb’s v. Jackson Women’s Health Organization, the Court ruled that the issue of abortion is left entirely to the political process. What will t…", "url": "https://time.com/6191444/abortion-dominate-politics/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1241557574.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-27T14:43:24Z", "content": "In overruling Roe v. Wade, the Supreme Court held that women no longer have a constitutional right to abortion. In Dobb’s v. Jackson Women’s Health Organization, the Court ruled that the issue of abo… [+4451 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Maria Cheng / AP", "title": "Monkeypox Is Not a Global Emergency ‘At This Stage,’ WHO Says", "description": "The World Health Organization (WHO) said the escalating monkeypox outbreak does not warrant being declared a global health emergency.", "url": "https://time.com/6191561/monkeypox-global-emergency-who/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/monkeypox-virus.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-27T14:37:49Z", "content": "(London) — The World Health Organization (WHO) said the escalating monkeypox outbreak in more than 50 countries should be closely monitored but does not warrant being declared a global health emergen… [+4777 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Judy Berman", "title": "Only Murders in the Building Season 2 Wisely Sticks to a Winning Formula", "description": "Aside from the fact they’re now trying to clear their own names—and Mabel’s in particular—fans can expect more of the same charming, intergenerational citizen-detective stuff they fell hard for last summer", "url": "https://time.com/6190642/only-murders-in-the-building-season-2-review/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/omitb_202_cb_00054rt.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-27T12:00:42Z", "content": "In the second season of Only Murders in the Building, the investigators become the investigated. Fresh off of cracking the Tim Kono case, the unlikely trio of has-been actor Charles-Haden Savage (co-… [+4404 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "JIM HEINTZ/ AP", "title": "Brittney Griner to Appear in Russian Court Ahead of Trial", "description": "(MOSCOW) — More than four months after she was arrested at a Moscow airport for cannabis possession, American basketball star Brittney Griner is to appear in court Monday for a preliminary hearing ahead of her trial. The Phoenix Mercury star, considered in so…", "url": "https://time.com/6191512/brittney-griner-russia-court/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/brittney-griner-russia.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-27T11:14:00Z", "content": "(MOSCOW) — More than four months after she was arrested at a Moscow airport for cannabis possession, American basketball star Brittney Griner is to appear in court Monday for a preliminary hearing ah… [+2957 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Tommaso Ebhardt / Bloomberg", "title": "Leonardo Del Vecchio, Billionaire Ray-Ban Owner, Dies at 87", "description": "Leonardo Del Vecchio, the Italian entrepreneur and owner of iconic brands like Ray-Ban and Oakley, has died.", "url": "https://time.com/6191505/leonardo-del-vecchio-ray-ban-dies/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1405368322.jpg?quality=85&crop=0px%2C9px%2C681px%2C356px&resize=1200%2C628&strip", "publishedAt": "2022-06-27T11:05:19Z", "content": "Leonardo Del Vecchio, the Italian entrepreneur who started off with a tiny optics workshop in the Dolomite mountains and ended up as the undisputed world leader in eyewear, has died. He was 87.\r\nHis … [+3679 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eloise Barry", "title": "The 2022 NATO Summit Could Be the Most Important in Recent Decades. Here’s Why", "description": "Western leaders will meet in the Spanish capital Madrid from Jun. 28 to Jun. 30 for what many are expecting to be the most important summit of the North Atlantic Treaty Organization (NATO) in recent decades. Just months after the invasion of NATO ally Ukraine…", "url": "https://time.com/6190443/nato-summit-2022/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/jens-stoltenberg-pedro-sanchez.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-27T10:38:14Z", "content": "Western leaders will meet in the Spanish capital Madrid from Jun. 28 to Jun. 30 for what many are expecting to be the most important summit of the North Atlantic Treaty Organization (NATO) in recent … [+8689 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Zeke Miller and Geir Moulson / AP", "title": "G7 Leaders To Commit To Supporting Ukraine as U.S. Prepares to Send Surface-to-Air Missile System", "description": "The war in Ukraine was already at the forefront of the G7 leaders' minds—just as Russian missiles hit the Ukrainian capital of Kyiv for the first time in weeks.", "url": "https://time.com/6191477/g7-summit-ukraine-biden-anti-air-system/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/g7-2022-germany.jpeg?quality=85&crop=0px%2C487px%2C4415px%2C2311px&resize=1200%2C628&strip", "publishedAt": "2022-06-27T06:29:59Z", "content": "ELMAU, Germany — The Group of Seven economic powers are set to commit themselves to supporting Ukraine in the long haul, with the U.S. preparing to announce the purchase of an advanced surface-to-air… [+4616 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jonathan Landrum Jr. / AP", "title": "Stars Use BET Awards Stage to Criticize Roe v. Wade Ruling", "description": "LOS ANGELES — Taraji P. Henson, Janelle Monae and Jazmine Sullivan were some of the big stars using the BET Awards stage to strongly criticize the Supreme Court’s recent decision to strip away women’s constitutional protection for abortion. Henson took the st…", "url": "https://time.com/6191474/bet-awards-roe-v-wade/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/taraji-bet-awards-roe-wade.jpeg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-27T05:45:27Z", "content": "LOS ANGELES — Taraji P. Henson, Janelle Monae and Jazmine Sullivan were some of the big stars using the BET Awards stage to strongly criticize the Supreme Court’s recent decision to strip away women’… [+4370 chars]"}]}