{"status": "ok", "totalResults": 24, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Andy Warhol’s ‘Shot Sage Blue Marilyn’ Becomes the Most Expensive Work By a U.S. Artist Sold at Auction", "description": "An iconic Warhol portrait of Marilyn Monroe has gone for $195 million, making it the most expensive work by a U.S. artist sold at auction.", "url": "https://time.com/6175110/andy-warhol-marilyn-monroe-auction/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/marilyn-monro-andy-warhol-1.jpeg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-10T08:26:41Z", "content": "NEW YORK — Andy Warhol’s “Shot Sage Blue Marilyn” sold for a cool $195 million on Monday, making the iconic portrait of Marilyn Monroe the most expensive work by a U.S. artist ever sold at auction.\r\n… [+1299 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Asantha Sirimanne / Bloomberg", "title": "Protesters Have Set Fire to the Home of Sri Lanka’s President Gotabaya Rajapaksa", "description": "The ancestral home of the Rajapaksa family was set on fire, and police were forced to use tear gas to disperse protesters.", "url": "https://time.com/6175067/sri-lanka-violence-rajapaksa/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/sri-lanka-protests.jpeg?quality=85&crop=0px%2C26px%2C1024px%2C536px&resize=1200%2C628&strip", "publishedAt": "2022-05-10T07:51:22Z", "content": "Violence erupted in Sri Lanka on Monday evening after the brother of President Gotabaya Rajapaksa resigned as prime minister, with local reports saying protesters targeted the homes and properties of… [+3544 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Judy Berman", "title": "Hulu’s Conversations With Friends Breathes Fresh Life Into Sally Rooney’s Best Novel", "description": "Normal People disappointed, but the streamer's latest adaptation of the Irish author is surprisingly great.", "url": "https://time.com/6173737/conversations-with-friends-hulu-review/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/cwf_110_eb_00429rt.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-10T07:30:37Z", "content": "So much has been said about Sally Rooney, in the mainstream press as well as in literary circles, that it can feel as though she’s been part of the discussion forever. Whether you consider the 31-yea… [+6100 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Billy Perrigo", "title": "Facebook Faces New Lawsuit Alleging Human Trafficking and Union-Busting in Kenya", "description": "Facebook’s parent company, Meta Platforms, and its largest outsourcing partner in Africa are facing new allegations of forced labor, human trafficking, and union busting in Kenya. Daniel Motaung, a former outsourced Facebook content moderator, filed a lawsuit…", "url": "https://time.com/6175026/facebook-sama-kenya-lawsuit/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/meta-daniel-motaung.jpg?quality=85", "publishedAt": "2022-05-10T06:00:29Z", "content": "Facebook’s parent company, Meta Platforms, and its largest outsourcing partner in Africa are facing new allegations of forced labor, human trafficking, and union busting in Kenya.\r\nDaniel Motaung, a … [+8111 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Kim Chandler and Mike Balsamo / AP", "title": "Ex-Jail Officer Dies and Fugitive Inmate Captured After Manhunt, Officials Say", "description": "Officials said Vicky White, a former jail official on the run with a murder suspect she was accused of helping escape, has killed herself.", "url": "https://time.com/6175070/vicky-white-jail-officer-dies-convict-manhunt/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/alabama-jail-official-vicki-white.jpeg?quality=85&crop=0px%2C59px%2C3166px%2C1657px&resize=1200%2C628&strip", "publishedAt": "2022-05-10T05:37:02Z", "content": "A former Alabama jail official on the run with a murder suspect she was accused of helping escape shot and killed herself Monday as authorities caught up with the pair after more than a week of searc… [+4922 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Kyla Mandel", "title": "Here’s What You Need to Know About Paxlovid", "description": "Here's what to know about the drug, its efficacy, and who can get it.", "url": "https://time.com/6175031/paxlovid-covid-19-treatment/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/paxlovid-covid-19-treatment.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-09T22:10:06Z", "content": "Prescriptions for Pfizer’s COVID-19 antiviral medication Paxlovid—the first such pill to be authorized by the U.S. Food and Drug Administration (FDA)—have increased tenfold in the past two months. Be… [+7534 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Linda Lew / Bloomberg", "title": "G7 Expresses ‘Grave Concern’ Over Hong Kong Leader’s Election", "description": "The foreign ministers of the Group of Seven most industrialized nations expressed “grave concern” over the process by which Hong Kong selected its next Chief Executive, calling it an assault on the fundamental freedoms of the former British colony that return…", "url": "https://time.com/6174800/g7-hong-kong-leaders-election/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/john-lee-hong-kong.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-09T20:33:43Z", "content": "The foreign ministers of the Group of Seven most industrialized nations expressed “grave concern” over the process by which Hong Kong selected its next Chief Executive, calling it an assault on the f… [+3249 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Asantha Sirimanne / Bloomberg", "title": "Sri Lanka Leader’s Brother Quits as Prime Minister in Escalating Crisis", "description": "Premier Mahinda Rajapaksa, the brother of Sri Lankan President Gotabaya Rajapaksa resigned as premier, as weekslong protests over Asia’s fastest inflation turned violent", "url": "https://time.com/6174788/sri-lanka-prime-minister-rajapaksa-resigns/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/sri-lanka-protests.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-09T20:21:44Z", "content": "The brother of Sri Lankan President Gotabaya Rajapaksa resigned as premier on Monday as weekslong protests over Asia’s fastest inflation turned violent, prompting the government to impose a curfew an… [+5560 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Aamer Madhani / AP", "title": "Biden Starts Program to Provide Discounted Internet Service", "description": "Internet companies have agreed to provide discounted service to people with low incomes through the Affordable Connectivity Program program", "url": "https://time.com/6174911/biden-program-internet/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/biden-program-internet.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-09T19:51:10Z", "content": "WILMINGTON, Del. — The Biden administration announced on Monday that 20 internet companies have agreed to provide discounted service to people with low incomes, a program that could effectively make … [+2714 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Lindsay Hunter", "title": "I Had an Unplanned Pregnancy, and a Choice", "description": "First, some caveats. As every woman who writes something on the internet knows, I must insert the appropriate number of “I love my kids!” “My kids are my life!” in anything that may be construed as complaining, lest the trolls start assembling. It’s true. I l…", "url": "https://time.com/6174417/unplanned-pregnancy-choice-abortion/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/pregnancy-test.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-09T17:21:32Z", "content": "First, some caveats. As every woman who writes something on the internet knows, I must insert the appropriate number of “I love my kids!” “My kids are my life!” in anything that may be construed as c… [+8783 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Chad de Guzman / Manila", "title": "Ferdinand ‘Bongbong’ Marcos Jr., a Dictator’s Son, Takes Huge Lead in Philippine Presidential Election", "description": "Ferdinand “Bongbong” Marcos Jr., the 64-year-old son of a kleptocratic dictator, could become the Philippines’ next president.", "url": "https://time.com/6174767/bongbong-marcos-election-philippines-result/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1395951600.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-09T16:56:33Z", "content": "Ferdinand “Bongbong” Marcos Jr., the 64-year-old son of a kleptocratic dictator, has a huge lead in race to become the next president of the Philippines’ following the election Monday.\r\nWith more tha… [+4671 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Tricia C. Bruce", "title": "We Asked Hundreds of Americans About Abortion. Their Feelings Were Complicated", "description": "Headlines broadcasting the pending Supreme Court ruling on abortion commonly pit one “side” against another. “Pro-life” versus “pro-choice.” Abortion rights or abortion opposition. “Healthcare” or “Murder.” It’s seems there’s little room for ambivalence when …", "url": "https://time.com/6174825/americans-views-abortion/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1396173639.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-09T15:55:46Z", "content": "Headlines broadcasting the pending Supreme Court ruling on abortion commonly pit one “side” against another. “Pro-life” versus “pro-choice.” Abortion rights or abortion opposition. “Healthcare” or “M… [+7457 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jamie Friedlander Serrano", "title": "Experts Can’t Agree on How Much Screen Time Is Too Much for Adults", "description": "The latest research shows screen time negatively impacts both mental and physical health.", "url": "https://time.com/6174510/how-much-screen-time-is-too-much/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/adult-screen-time.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-09T15:49:34Z", "content": "The COVID-19 pandemic shifted our lives in myriad ways, including the amount of time we spent glued to our devices. Research published in 2021 found that Americans in their early twenties used their … [+8497 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Wisconsin Anti-Abortion Group’s Office Targeted in Arson Attack", "description": "Vandals struck an anti-abortion group's office in Wisconsin, apparently setting a fire after a Molotov cocktail thrown into the building failed to ignite, authorities said.", "url": "https://time.com/6174841/anti-abortion-group-arson-wisconsin/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/anti-abortion-targeted-wisconsin-1.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-09T15:38:48Z", "content": "MADISON, Wis. — Vandals struck an anti-abortion group’s office in Wisconsin, apparently setting a fire after a Molotov cocktail thrown into the building failed to ignite, authorities said.\r\nFlames we… [+1962 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": null, "title": "I Went Against These 3 Pieces of Advice and Built a $250,000 Business From Scratch During the Pandemic - NextAdvisor", "description": "In January 2020, I set out to launch a live speaking business. What could go wrong? Well, lots. Here’s what I learned from bad luck and my own mistakes.", "url": "https://time.com/nextadvisor/financial-independence/how-i-built-six-figure-business-during-pandemic/", "urlToImage": "https://time.com/nextadvisor/wp-content/uploads/2022/05/4-I-went-against-these-3-pieces-of-advice-and-built-a-six-figure-business-from-scratch-during-the-pandemic-1000x630.jpg", "publishedAt": "2022-05-09T14:58:55Z", "content": "Editorial IndependenceWe want to help you make more informed decisions. Some links on this page clearly marked may take you to a partner website and may result in us earning a referral commission. Fo… [+8873 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": null, "title": "How This 31-Year-Old Makes Over $10,000 a Month Sharing Money Advice with His 141,000 Instagram Followers - NextAdvisor", "description": "As a financial services professional who grew up in foster care, BetterWallet’s Marc Russell knows what it takes to build sustainable wealth from nothing.", "url": "https://time.com/nextadvisor/financial-independence/business-success-story-marc-russell/", "urlToImage": "https://time.com/nextadvisor/wp-content/uploads/2022/05/May-Business-Owner-Marc-Russell-BetterWallet-1000x630.jpg", "publishedAt": "2022-05-09T14:51:06Z", "content": "Editorial IndependenceWe want to help you make more informed decisions. Some links on this page clearly marked may take you to a partner website and may result in us earning a referral commission. Fo… [+6500 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "New Doctor Who Star Is Sex Education Actor Ncuti Gatwa", "description": "Ncuti Gatwa will take the mantle from Jodie Whittaker on “Doctor Who,” the BBC announced Sunday, ending speculation over the iconic Time Lord's next regeneration.", "url": "https://time.com/6174803/doctor-who-ncuti-gwata/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1396247031.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-09T13:56:35Z", "content": "LONDON — Ncuti Gatwa will take the mantle from Jodie Whittaker on “Doctor Who,” the BBC announced Sunday, ending speculation over the iconic Time Lord’s next regeneration.\r\n“Sometimes talent walks th… [+2264 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "MARK KENNEDY / AP", "title": "A Strange Loop Earns a Leading 11 Tony Award Nominations", "description": "NEW YORK — “A Strange Loop,” Michael R. Jackson’s critically cheered theater meta-journey, earned a leading 11 Tony Award nominations Monday as Broadway joined the national discussion of race by embracing an envelope-pushing Black-written and Black-led musica…", "url": "https://time.com/6174792/tony-awards-nominees/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/astrangeloop.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-09T13:42:20Z", "content": "NEW YORK — “A Strange Loop,” Michael R. Jackson’s critically cheered theater meta-journey, earned a leading 11 Tony Award nominations Monday as Broadway joined the national discussion of race by embr… [+5284 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Cady Lang and Video by Diane Tsai", "title": "How an Asian American Opera Singer Found Her Voice Amid a Reckoning with Race", "description": "Amid a reckoning with anti-Asian racism, Nina Yoshida Nelsen is speaking out against racism and calling for better representation in opera.", "url": "https://time.com/6174438/nina-yoshida-nelsen-opera-racism-representation/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Nina-Yoshida-Nelsen.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-09T12:00:10Z", "content": "For the mezzo-soprano opera singer Nina Yoshida Nelsen, a reckoning has been long overdue. Following the March 2021 Atlanta spa shootings, Nelsen, a fourth-generation Japanese American, had a moment … [+6940 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Asantha Sirimanne / Bloomberg", "title": "Sri Lanka Imposes Curfew as Government Backers, Protesters Clash", "description": "Sri Lanka has imposed a nationwide curfew as clashes erupted between government supporters and citizen protesters demanding the premier and his brother, the president, resign in recognition of the nation’s worst economic crisis since independence. Local news …", "url": "https://time.com/6174743/sri-lanka-curfew-protests/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1240557028.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-09T10:06:01Z", "content": "Sri Lanka has imposed a nationwide curfew as clashes erupted between government supporters and citizen protesters demanding the premier and his brother, the president, resign in recognition of the na… [+2269 chars]"}]}