{"status": "ok", "totalResults": 13, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Lyubov Pronina / Bloomberg", "title": "E.U. Mounts Urgent Call for COVID-19 Boosters as Cases Rise Again", "description": "European regulators are urging second booster doses of COVID-19 vaccines for people over 60 years old as cases and hospitalizations are again rising sharply. Recommendations from the European Centre for Disease Prevention and Control and the European Medicine…", "url": "https://time.com/6195505/eu-covid-19-boosters/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-1241477798.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-11T12:10:36Z", "content": "European regulators are urging second booster doses of COVID-19 vaccines for people over 60 years old as cases and hospitalizations are again rising sharply.\r\nRecommendations from the European Centre… [+1316 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Laura Ungar and Aniruddha Ghosal/AP", "title": "A Super Contagious Omicron Mutant Is Worrying Scientists. It’s Called BA.2.75", "description": "The variant may be able to spread rapidly and get around immunity from vaccines and previous infection.", "url": "https://time.com/6195495/covid-omicron-variant-mutant-contagious-ba2-75/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/v1.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-11T10:31:48Z", "content": "The quickly changing coronavirus has spawned yet another super contagious Omicron mutant that’s worrying scientists as it gains ground in India and pops up in numerous other countries, including the … [+3512 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Abigail Abrams", "title": "First Company Applies to Make Birth Control Pill Available Without a Prescription in the U.S.", "description": "Since the Supreme Court overturned Roe v. Wade and set off a cascade of abortion bans around the country, access to contraception has taken on increased importance. To get birth control pills and other hormonal contraceptives in the U.S., patients still need …", "url": "https://time.com/6195124/birth-control-pill-over-the-counter-fda/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/birth-control-pills-over-the-counter.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-11T10:00:40Z", "content": "Since the Supreme Court overturned Roe v. Wade and set off a cascade of abortion bans around the country, access to contraception has taken on increased importance. To get birth control pills and oth… [+6769 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Amy Gunia", "title": "Japan’s Ruling Party Wins Big in Election After Ex-Prime Minister Shinzo Abe’s Killing", "description": "Shinzo Abe's party, the Liberal Democratic Party, swept to victory in parliamentary elections just two days after the former prime minister was assassinated.", "url": "https://time.com/6195449/japan-election-shinzo-abe-death/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/abe-mourners.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-11T08:40:39Z", "content": "The party of former Japanese Prime Minister Shinzo Abe–who was gunned down on July 8–swept to victory in parliamentary elections just two days after his killing sent shockwaves through Japan.\r\nThe co… [+3925 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jef Feeley, Kurt Wagner and Ed Hammond", "title": "Musk and Twitter Are Lawyering up for Court Battle in Delaware", "description": "Twitter will fight in the Delaware Court of Chancery to compel Musk to follow through on his agreement to buy the company.", "url": "https://time.com/6195442/musk-twitter-takeover-court/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/e1.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-11T06:48:18Z", "content": "Now that Elon Musk has decided that he doesn’t want to buy Twitter Inc. after all, he can’t just walk away from the $44 billion contract. The billionaire co-founder of Tesla Inc. will need to make hi… [+7009 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Anisha Kohli", "title": "Shinzo Abe’s Assassination Was Rare in a Country With Strict Gun Laws. Here’s What to Know", "description": "Since the latter half of the 20th century, the Japanese government has created and enforced strong gun control regulation, which for the most part, has been highly effective.", "url": "https://time.com/6195409/japan-gun-contol-regulation/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/gun-violence.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-10T21:22:24Z", "content": "Japan’s former Prime Minister Shinzo Abe, 67, was shot and killed in the Japanese city of Naro with a homemade firearm on July 8 while he was campaigning for the Liberal Democratic Party (LDP) on the… [+9906 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Uber Lobbied Politicians, Used ‘Stealth’ Technology to Block Scrutiny: Report", "description": "(WASHINGTON) — As Uber aggressively pushed into markets around the world, the ride-sharing service lobbied political leaders to relax labor and taxi laws, used a “kill switch” to thwart regulators and law enforcement, channeled money through Bermuda and other…", "url": "https://time.com/6195402/uber-files-leak-lobbying/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/uber-logo.jpeg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-10T19:21:47Z", "content": "(WASHINGTON) — As Uber aggressively pushed into markets around the world, the ride-sharing service lobbied political leaders to relax labor and taxi laws, used a “kill switch” to thwart regulators an… [+2563 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "FARNOUSH AMIRI and HOPE YEN / AP", "title": "Steve Bannon Says He’s Willing to Testify to Jan. 6 Committee Ahead of Contempt Trial", "description": "(WASHINGTON) — The House committee investigating the Jan. 6 riot is returning to prime time with a Thursday evening hearing that will examine the three-hour plus stretch when Donald Trump failed to act as a mob of supporters stormed the Capitol. The committee…", "url": "https://time.com/6195384/steve-bannon-january-6-testimony/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/steve-bannon-jan-6.jpeg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-10T18:59:35Z", "content": "(WASHINGTON) — The House committee investigating the Jan. 6 riot is returning to prime time with a Thursday evening hearing that will examine the three-hour plus stretch when Donald Trump failed to a… [+5556 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Sean Gregory", "title": "Novak Djokovic Beats Nick Kyrgios To Win Wimbledon. Where The Tennis Bad Boys Go From Here", "description": "In a thrilling match, Novak Djokovic prevailed to win his fourth straight Wimbledon and 21st Grand Slam title. Nick Kyrgios lost his cool.", "url": "https://time.com/6195351/novak-djokovic-wimbledon-kyrgios/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/photo.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-10T18:35:02Z", "content": "_As his opponent lost his cool around him all afternoon at Wimbledon, Novak Djokovic just played tennis. Djokovic, the world’s number one player, remained a mechanical hitting machine, slicing drop s… [+4900 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "LINDSEY BAHR / AP", "title": "Thor: Love and Thunder Scores the Best Debut for the Franchise", "description": "“Thor: Love and Thunder ” earned $143 million in its opening weekend in North America, according to studio estimates Sunday", "url": "https://time.com/6195364/thor-love-and-thunder-scores-the-best-debut-for-the-franchise/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/Thor-.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-10T15:45:39Z", "content": "Four movies in, Thor is still bringing the hammer down at the box office.\r\n“Thor: Love and Thunder ” earned $143 million in its opening weekend in North America, according to studio estimates Sunday.… [+2158 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "FRANCESCA EBEL / AP", "title": "Russian Rocket Attack Kills 15 in Ukraine and Leaves Others Trapped", "description": "Dozens of Ukrainian emergency workers labored Sunday to pull people out of the rubble after a Russian rocket attack smashed into apartment buildings in eastern Ukraine. The strike killed at least 15 people and scores were thought to be still trapped a day lat…", "url": "https://time.com/6195359/russian-rocket-attack-kills-15/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/Ukraine-.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-10T15:37:26Z", "content": "CHASIV YAR, Ukraine. — Dozens of Ukrainian emergency workers labored Sunday to pull people out of the rubble after a Russian rocket attack smashed into apartment buildings in eastern Ukraine. The str… [+4292 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "KRISHAN FRANCIS / AP", "title": "Sri Lanka Opposition Meets to Install New Government Amid Political Turmoil", "description": "Sri Lanka’s opposition political parties were meeting Sunday to agree on a new government a day after the country’s president and prime minister offered to resign in the most dramatic day of monthslong political turmoil, with protesters storming both leaders’…", "url": "https://time.com/6195355/sri-lanka-opposition-meets-amid-turmoil/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/protesters.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-10T15:30:19Z", "content": "COLOMBO, Sri Lanka — Sri Lanka’s opposition political parties were meeting Sunday to agree on a new government a day after the country’s president and prime minister offered to resign in the most dra… [+5947 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Joann S. Lublin", "title": "Why Macy’s CEO Jeff Gennette Wants Everyone to Bring Their ‘Authentic Selves’ to Work", "description": "Macy’s Chief Executive Jeff Gennette sees prices of overstocked items falling soon. “Customers are about to get some amazing deals on products that were hot during the pandemic,” says Gennette, who has run the biggest U.S. department-store chain since 2017. M…", "url": "https://time.com/6195340/macys-ceo-jeff-gennette-interview/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/Jeff-Headshot.jpg?quality=85&crop=0px%2C26px%2C4035px%2C2112px&resize=1200%2C628&strip", "publishedAt": "2022-07-10T11:00:51Z", "content": "Macy’s Chief Executive Jeff Gennette sees prices of overstocked items falling soon. “Customers are about to get some amazing deals on products that were hot during the pandemic,” says Gennette, who h… [+11051 chars]"}]}