{"status": "ok", "totalResults": 42, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "LORNE COOK / Associated Press", "title": "Why Finland and Sweden Joining NATO Will Be a Big Deal", "description": "It’s likely to be the quickest NATO enlargement ever and one that would redraw Europe’s security map. Finnish leaders announced Thursday their belief that Finland should join the world’s biggest military organization because of Russia’s war in Ukraine. Sweden…", "url": "https://time.com/6176023/finland-sweden-nato/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1240599372.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-12T11:53:31Z", "content": "It’s likely to be the quickest NATO enlargement ever and one that would redraw Europe’s security map. Finnish leaders announced Thursday their belief that Finland should join the world’s biggest mili… [+4325 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Edward Felsenthal", "title": "How TIME Chose Its 2022 List of Next Generation Leaders", "description": "At TIME, our eyes are on the rising stars poised to shape the future. We first joined forces with Rolex in 2014 to launch Next Generation Leaders, our series elevating young people from across fields and around the globe who are working to build a better worl…", "url": "https://time.com/6175735/next-generation-leaders-2022/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/NGL2022_final.jpg?quality=85&crop=0px%2C103px%2C2400px%2C1256px&resize=1200%2C628&strip", "publishedAt": "2022-05-12T10:21:22Z", "content": "At TIME, our eyes are on the rising stars poised to shape the future. We first joined forces with Rolex in 2014 to launch Next Generation Leaders, our series elevating young people from across fields… [+3922 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Vaclav Smil", "title": "The Modern World Can’t Exist Without These Four Ingredients. They All Require Fossil Fuels", "description": "Modern societies would be impossible without mass-scale production of many man-made materials. We could have an affluent civilization that provides plenty of food, material comforts, and access to good education and health care without any microchips or perso…", "url": "https://time.com/6175734/reliance-on-fossil-fuels/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-906344382.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-12T10:00:35Z", "content": "Modern societies would be impossible without mass-scale production of many man-made materials. We could have an affluent civilization that provides plenty of food, material comforts, and access to go… [+10608 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eric Cortellessa", "title": "Why the Bipartisan Push to Prevent Another Jan. 6 Is Running Out of Time", "description": "The window is closing fast for Congress to overhaul the Electoral Count Act, the law Trump allies tried to use to overturn the election.", "url": "https://time.com/6175720/jan-6-electoral-count-act/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/january-6.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-12T10:00:24Z", "content": "For five months, a bipartisan group in Congress has been working to overhaul the Electoral Count Act, the 1887 law that Donald Trump and his allies tried to exploit on January 6, 2021, to overturn th… [+8952 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Megan Durisin, Kim Chipman, Jen Skerritt and James Poole / Bloomberg", "title": "Wheat Crops Almost Everywhere Are Coming Under Threat From Extreme Weather", "description": "As Russia’s invasion chokes off Ukrainian wheat exports, pushing up food prices, the global harvest faces an added test: extreme weather.", "url": "https://time.com/6175997/wheat-food-weather-climate/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1240580012.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-12T06:41:58Z", "content": "As Russia’s invasion chokes off Ukrainian wheat exports, pushing up bread and noodle prices, the global harvest faces an added test: extreme weather.\r\nDroughts, flooding and heatwaves threaten output… [+5575 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "With the Pilot Down, a Passenger With ‘No Idea How to Fly’ Takes Over and Lands the Plane", "description": "The passenger took over the Cessna 208 after the pilot fell ill and, with help from an air traffic controller, safely landed in Florida.", "url": "https://time.com/6175993/passenger-lands-plane/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/AP22131662107620.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-12T06:13:16Z", "content": "WEST PALM BEACH, Fla. — A passenger with no flying experience radioed an urgent plea for help when the pilot of a small plane suddenly fell ill off Florida’s Atlantic coast, and was able to land the … [+2151 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Raisa Bruner", "title": "How K-Pop Group aespa Is Making the Metaverse Their Home", "description": "Giselle, Karina, Ningning, and Winter should be tired. They just arrived in California after a long-haul flight from Seoul, after all. But the four stars of the K-pop girl group aespa have an important job to do—and they know the stakes. For one of the first …", "url": "https://time.com/6174945/aespa/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/aespa-generation-leaders-2022.jpg?quality=85&crop=0px%2C230px%2C1920px%2C1005px&resize=1200%2C628&strip", "publishedAt": "2022-05-11T22:39:23Z", "content": "Giselle, Karina, Ningning, and Winter should be tired. They just arrived in California after a long-haul flight from Seoul, after all. But the four stars of the K-pop girl group aespa have an importa… [+3068 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Sanya Mansoor", "title": "The Youngest Member of Mongolia’s Government Is Making Space for Women in Tech", "description": "In 2020, when Bolor-Erdene Battsengel would walk into work in Ulan Bator’s national parliament building, security guards would stop her to ask if she was a personal assistant or a janitor. She was neither—she was the youngest member of the Mongolian governmen…", "url": "https://time.com/6174935/bolor-erdene-battsengel/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/bolor-erdene-battsengel-next-generation-leaders-2022.jpg?quality=85&crop=0px%2C495px%2C1920px%2C1005px&resize=1200%2C628&strip", "publishedAt": "2022-05-11T22:33:04Z", "content": "In 2020, when Bolor-Erdene Battsengel would walk into work in Ulan Bator’s national parliament building, security guards would stop her to ask if she was a personal assistant or a janitor. She was ne… [+1552 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Andrew R. Chow", "title": "CKay Is Turning Afrobeats Into a Global Phenomenon—His Way", "description": "Chukwuka Ekweani ran away from his small hometown in the north of Nigeria at age 19 to chase his music dreams in Lagos. Sitting alone on the flight south with his parents’ disapproving words ringing in his ears, Ekweani fretted about his choice: “I was thinki…", "url": "https://time.com/6174943/ckay/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/ckay-generation-leaders-2022.jpg?quality=85&crop=0px%2C858px%2C1920px%2C1006px&resize=1200%2C628&strip", "publishedAt": "2022-05-11T22:33:04Z", "content": "Chukwuka Ekweani ran away from his small hometown in the north of Nigeria at age 19 to chase his music dreams in Lagos. Sitting alone on the flight south with his parents’ disapproving words ringing … [+3010 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Cady Lang", "title": "Salvatore Ferragamo’s New Creative Director Is Designing a More Inclusive Fashion Industry", "description": "For Maximilian Davis, fashion isn’t just a career choice—it’s part of his family legacy. Growing up in Manchester, England, in a close-knit Trinidadian-Jamaican family, his sister and mother modeled, and his father studied fashion design. When he was 6, his g…", "url": "https://time.com/6174901/maximilian-davis/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/maximilian-davis-next-generation-leaders-2022-1.jpg?quality=85&crop=0px%2C155px%2C2400px%2C1256px&resize=1200%2C628&strip", "publishedAt": "2022-05-11T22:33:04Z", "content": "For Maximilian Davis, fashion isn’t just a career choice—it’s part of his family legacy. Growing up in Manchester, England, in a close-knit Trinidadian-Jamaican family, his sister and mother modeled,… [+3002 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eloise Barry", "title": "An Encounter With a Snow Leopard Became a Wake-Up Call for a Nepali Conservationist", "description": "Rinzin Phunjok Lama was 16 when he first saw a Himalayan snow leopard prowling the mountains near his home in northeastern Nepal—an encounter that changed his life. In the folklore of Lama’s Buddhist community, the snow leopard is a manifestation of the god o…", "url": "https://time.com/6174941/rinzin-phunjok-lama/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/rinzin-phunjok-lama-next-generation-leaders-2022.jpg?quality=85&crop=0px%2C595px%2C2400px%2C1257px&resize=1200%2C628&strip", "publishedAt": "2022-05-11T22:33:03Z", "content": "Rinzin Phunjok Lama was 16 when he first saw a Himalayan snow leopard prowling the mountains near his home in northeastern Nepal—an encounter that changed his life. In the folklore of Lama’s Buddhist… [+1820 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Lisa Abend", "title": "Olga Rudenko and the Kyiv Independent Are Giving the World a Window Into a Devastating War", "description": "The Kyiv Independent has quickly become the world’s primary source for reliable, English-language journalism on the war in Ukraine.", "url": "https://time.com/6174883/olga-rudenko-kyiv-independent/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/olga-rudenko-ngl-100.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-11T22:33:03Z", "content": "The staff of the Kyiv Independent knew war was coming. They had spent long days in February reporting on an invasion that high-level sources had told them was imminent. Editor in chief Olga Rudenko a… [+10745 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Sam Lansky", "title": "Bridgerton’s Jonathan Bailey Is Redefining the Hollywood Heartthrob", "description": "After starring in the second season of Bridgerton—the lush period drama that has become Netflix’s most watched English-language series ever—the actor Jonathan Bailey could have done anything. He chose something that he knew would be a challenge. “Cock!” Baile…", "url": "https://time.com/6174899/jonathan-bailey/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/jonathan-bailey-generation-leaders-2022.jpg?quality=85&crop=0px%2C253px%2C1920px%2C1006px&resize=1200%2C628&strip", "publishedAt": "2022-05-11T22:33:03Z", "content": "After starring in the second season of Bridgerton—the lush period drama that has become Netflix’s most watched English-language series ever—the actor Jonathan Bailey could have done anything. He chos… [+4485 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Judy Berman", "title": "Bilal Baig Wants You to Understand That Transition Is a Universal Experience", "description": "Bilal Baig wants to take a pause. In April, they won top honors at the Canadian Screen Awards for Sort Of, a CBC/HBO Max dramedy they co-created and star in about a nonbinary Torontonian of Pakistani descent struggling to fuse the fragments of their compartme…", "url": "https://time.com/6174939/bilal-baig/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/bilal-baig-next-generation-leaders-2022.jpg?quality=85&crop=0px%2C23px%2C1767px%2C926px&resize=1200%2C628&strip", "publishedAt": "2022-05-11T22:33:03Z", "content": "Bilal Baig wants to take a pause. In April, they won top honors at the Canadian Screen Awards for Sort Of, a CBC/HBO Max dramedy they co-created and star in about a nonbinary Torontonian of Pakistani… [+2564 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Abby Vesoulis", "title": "Barista Jaz Brisack Took on Starbucks—and Won", "description": "A Rhodes scholarship to the University of Oxford can open doors to elite worlds—to a life spent in boardrooms and at gilded galas. Bill Clinton, for example, famously smoked (though “didn’t inhale”) marijuana there before becoming President. Pete Buttigieg se…", "url": "https://time.com/6174931/jaz-brisack/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/jaz-brisac-next-generation-leaders-2022.jpg?quality=85&crop=0px%2C316px%2C1920px%2C1006px&resize=1200%2C628&strip", "publishedAt": "2022-05-11T22:33:02Z", "content": "A Rhodes scholarship to the University of Oxford can open doors to elite worlds—to a life spent in boardrooms and at gilded galas. Bill Clinton, for example, famously smoked (though “didn’t inhale”) … [+3238 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Ayesha Javed", "title": "Deepica Mutyala Is a Beauty Influencer for Every Skin Tone", "description": "When Deepica Mutyala partnered her beauty brand with Mattel to launch the first ever South Asian CEO Barbie doll—made in Mutyala’s image—she wanted to make sure it was authentic. Growing up in Sugar Land, Texas, she’d had to navigate both colorism within her …", "url": "https://time.com/6174937/deepica-mutyala/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/deepica-mutyala-next-generation-leaders-2022.jpg?quality=85&crop=0px%2C66px%2C1921px%2C1005px&resize=1200%2C628&strip", "publishedAt": "2022-05-11T22:33:02Z", "content": "When Deepica Mutyala partnered her beauty brand with Mattel to launch the first ever South Asian CEO Barbie doll—made in Mutyala’s image—she wanted to make sure it was authentic. Growing up in Sugar … [+1587 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Lisa Mascaro / AP", "title": "The Senate Fell Short in an Effort To Preserve Roe V. Wade Abortion Access", "description": "Few Republican senators spoke in favor of ending abortion access, but they embraced the filibuster to block the bill from advancing.", "url": "https://time.com/6175921/senate-filibuster-roe-wade-abortion/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/senate-filibuster-roe-wade-abortion.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-11T22:01:19Z", "content": "WASHINGTON — The Senate fell far short Wednesday in a rushed effort toward enshrining Roe v. Wade abortion access as federal law, blocked by a Republican filibuster in a blunt display of the nation’s… [+6866 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Renee Bracey Sherman", "title": "Voting Won’t Save Abortion Rights", "description": "In the wake of the Supreme Court’s leaked draft opinion declaring their decision to overrule Roe v. Wade and allow states to recriminalize abortion, Americans have turned to their pro-choice elected officials looking for a plan. While some local legislators h…", "url": "https://time.com/6175881/abortion-crisis-goes-beyond-voting/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/women-abortion-rights-democrats-voting.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-11T21:22:02Z", "content": "In the wake of the Supreme Court’s leaked draft opinion declaring their decision to overrule Roe v. Wade and allow states to recriminalize abortion, Americans have turned to their pro-choice elected … [+5426 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Max Carter-Oberstone", "title": "America’s Traffic Laws Give Police Way Too Much Power", "description": "There are roughly 20 million traffic stops every year, many for petty infractions—and these stops can quickly turn lethal.", "url": "https://time.com/6175852/pretextual-traffic-stops/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/traffic-stop.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-11T20:45:38Z", "content": "We’ll never know what Philando Castile was feeling when the police lights first flashed across his rearview mirror on a balmy night in the summer of 2016. But we can be reasonably certain of what he … [+6254 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jeffrey Kluger", "title": "Why So Many Young Adults with Depression Don’t Get Treatment", "description": "More than half of adults ages 18 to 25 who are suffering from depression don't get treatment. One major barrier, they say, is cost.", "url": "https://time.com/6175288/depression-untreated-young-adults/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/young-adult-depression.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-11T19:35:08Z", "content": "Depression affects more young adults than any other adult age group. Each year, 7.5% of U.S. adults suffer from at least one major depressive episode: characterized by persistent sadness, diminished … [+5412 chars]"}]}