{"status": "ok", "totalResults": 37, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Jordan Fabian and Volodymyr Verbyany / Bloomberg", "title": "Zelensky Says Blinken and Austin to Visit Ukraine Sunday", "description": "Ukrainian President Volodymyr Zelensky said that U.S. Secretary of State Antony Blinken and Defense Secretary Lloyd Austin would visit Kyiv on Sunday, in what would be a risky show of support for Ukraine’s defense against Russia’s invasion.", "url": "https://time.com/6170106/austin-blinken-visit-ukraine/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/Zelensky.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-23T19:39:09Z", "content": "Bloomberg — Ukrainian President Volodymyr Zelensky said that U.S. Secretary of State Antony Blinken and Defense Secretary Lloyd Austin would visit Kyiv on Sunday, in what would be a risky show of sup… [+4140 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Josh Eidelson / Bloomberg", "title": "Starbucks Sued by U.S. Labor Board Over Retaliation Claims", "description": "U.S. labor officials are asking a federal court to force Starbucks Corp. to reinstate a group of activists, escalating the legal battle over the company’s response to the union campaign sweeping through its stores.", "url": "https://time.com/6170100/starbucks-sued-labor-baord/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/starbucks.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-23T18:24:59Z", "content": "Bloomberg — U.S. labor officials are asking a federal court to force Starbucks Corp. to reinstate a group of activists, escalating the legal battle over the company’s response to the union campaign s… [+3538 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "MICHAEL BALSAMO and CAROLE FELDMAN / AP", "title": "Man Dies After Setting Himself on Fire Outside Supreme Court", "description": "At least four people, including a 12-year-old girl, were shot when a gunman unleashed a flurry of bullets in the nation's capital, leading to lockdowns at several schools on Friday. The injured were expected to recover and the suspect was found dead hours lat…", "url": "https://time.com/6170095/supreme-court-man-sets-himself-on-fire/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/SC.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-23T17:33:05Z", "content": "WASHINGTON — At least four people, including a 12-year-old girl, were shot when a gunman unleashed a flurry of bullets in the nation’s capital, leading to lockdowns at several schools on Friday. The … [+1836 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Mary Schlangenstein / Bloomberg", "title": "Airlines Substitute Buses for Planes as Pilot Shortage Persists", "description": "U.S. airlines are facing a pilot shortage that’s complicating efforts to ramp up flights, forcing them to step up training programs, recruit foreign pilots and even replace planes with buses.", "url": "https://time.com/6170090/pilot-shortages-persist/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/airlines.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-23T17:09:54Z", "content": "Bloomberg — U.S. airlines are facing a pilot shortage that’s complicating efforts to ramp up flights, forcing them to step up training programs, recruit foreign pilots and even replace planes with bu… [+4212 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Philip Elliott", "title": "Don’t Discount the Political Power of a Sinking Russian War Ship", "description": "Welcome to The Back Booth, a weekend edition of The D.C. Brief. Here each Saturday, TIME’s politics newsletter will host a conversation between political professionals on the right and the left, pulling back the curtain on the conversations taking place in Wa…", "url": "https://time.com/6169969/ukraine-jan-6-mccarthy-conversation/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/Zelenskyy-ukraine-russia.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-23T17:00:11Z", "content": "Welcome to The Back Booth, a weekend edition of The D.C. Brief. Here each Saturday, TIME’s politics newsletter will host a conversation between political professionals on the right and the left, pull… [+7280 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Antony Sguazzin / Bloomberg", "title": "Congo Declares New Ebola Outbreak After Man Dies, WHO Says", "description": "The outbreak is the third in the province since 2018 and Congo’s 14th since 1976", "url": "https://time.com/6170085/congo-ebola-outbreak-who/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/Congo.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-23T16:58:22Z", "content": "Bloomberg — The Democratic Republic of Congo has declared an Ebola outbreak after a 31-year-old man in Mbandaka in the north western province of Equateur who died was found to be infected.\r\nThe man b… [+558 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Time", "title": "Israel Closes Crossing to Gaza Workers After Rockets Fired", "description": "Israel said Saturday that it would close its border crossing to thousands of Gaza workers after a series of rockets were fired from the territory ruled by the militant Hamas group in recent days.", "url": "https://time.com/6170080/israel-closes-gaza-border/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/Israel.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-23T15:41:58Z", "content": "JERUSALEM — Israel said Saturday that it would close its border crossing to thousands of Gaza workers after a series of rockets were fired from the territory ruled by the militant Hamas group in rece… [+3809 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Janell Ross/Grand Rapids, Mich.", "title": "As Patrick Lyoya’s Family Mourns, African-American and Immigrant Communities Cry Out for Justice Together", "description": "At a funeral for the 26-year-old killed by a police officer, a gap was bridged between Grand Rapids' Black American and immigrant communities", "url": "https://time.com/6169842/patrick-lyoya-funeral-immigrant-activists/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/crump.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-23T14:00:33Z", "content": "GRAND RAPIDS, MI – In America, always listen for the we.\r\nNot the pluralis majestati, the “royal we” that signifies the power of the elevated person. Not the “we” of American politics, used—or some m… [+14017 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Time", "title": "Twitter Bans Ads That Contradict Science on Climate Change", "description": "Twitter says it will no longer allow advertisers on its site who deny the scientific consensus on climate change, echoing a policy already in place at Google.", "url": "https://time.com/6170072/twitter-climate-change-ads/", "urlToImage": "https://api.time.com/wp-content/uploads/2021/09/twitter-class-action-lawsuit.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-23T13:58:40Z", "content": "BERLIN — Twitter says it will no longer allow advertisers on its site who deny the scientific consensus on climate change, echoing a policy already in place at Google.\r\n“Ads shouldn’t detract from im… [+1257 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Myriam Francois", "title": "How the Far Right Already Won in France", "description": "The results from the first round of the French elections make clear the future of France no matter who wins the presidency on April 24. The now customary face-off between the incumbent, Emmanuel Macron, and the far-right leader, Marine Le Pen, is set to repea…", "url": "https://time.com/6170043/french-election-far-right-already-won/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/GettyImages-1393123474.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-23T13:48:02Z", "content": "The results from the first round of the French elections make clear the future of France no matter who wins the presidency on April 24. The now customary face-off between the incumbent, Emmanuel Macr… [+8610 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Sanya Mansoor", "title": "‘It’s Not Going to Be the Same.’ This Easter, Ukrainians Are Wrestling With Trauma", "description": "Vita Olevych, a Ukrainian American in Chicago, is in no mood to celebrate Easter on Sunday. “We don’t feel like we’re in the right headspace to celebrate anything,” Olevych says. “It’s been such a traumatizing and difficult couple of weeks.” Normally, Olevych…", "url": "https://time.com/6169929/ukraine-orthodox-easter/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/ukraine-easter-01.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-23T13:15:13Z", "content": "Vita Olevych, a Ukrainian American in Chicago, is in no mood to celebrate Easter on Sunday. “We don’t feel like we’re in the right headspace to celebrate anything,” Olevych says. “It’s been such a tr… [+5665 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Ian Bremmer", "title": "Finland and Sweden Seem Likely to Join NATO. What That Means for Europe", "description": "One of the many justifications Vladimir Putin has offered for Russia’s invasion of Ukraine is that NATO’s post-Cold War eastward advance threatens Russia’s national security. But if he hoped his assault on Ukraine would push the transatlantic alliance onto th…", "url": "https://time.com/6169708/finland-sweden-nato-expansion/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/GettyImages-1239952085.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-23T11:00:29Z", "content": "One of the many justifications Vladimir Putin has offered for Russia’s invasion of Ukraine is that NATO’s post-Cold War eastward advance threatens Russia’s national security. But if he hoped his assa… [+5816 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Shannon Carlin", "title": "Alexander Skarsgård Wants to Teach You All About The Vikings With The Northman", "description": "Alexander Skarsgård is worried he’s already said too much. “I feel the less people know when they go in to see the movie, the better,” the actor tells TIME about his latest film The Northman, a brutal Viking epic, out April 22. Yet his passion for the project…", "url": "https://time.com/6169996/alexander-skarsgard-the-northman-interview/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/GettyImages-1392257645.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-22T22:46:11Z", "content": "Alexander Skarsgård is worried he’s already said too much. “I feel the less people know when they go in to see the movie, the better,” the actor tells TIME about his latest film The Northman, a bruta… [+8368 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Katie Reilly", "title": "Florida’s Governor Just Signed the ‘Stop Woke Act.’ Here’s What It Means for Schools and Businesses", "description": "Florida Gov. Ron DeSantis signed legislation on Friday that aims to regulate how schools and businesses address race and gender, the state’s latest effort to restrict education about those topics. The law, which has become known as the “Stop WOKE Act,” prohib…", "url": "https://time.com/6168753/florida-stop-woke-law/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/ron-desantis-woke-bill.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-22T22:04:34Z", "content": "Florida Gov. Ron DeSantis signed legislation on Friday that aims to regulate how schools and businesses address race and gender, the state’s latest effort to restrict education about those topics.\r\nT… [+8162 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Shannon Carlin", "title": "11 Movies Where Actors Play Fictionalized Versions of Themselves", "description": "If imitation is the sincerest form of flattery, then Nicolas Cage playing Nicolas Cage in The Unbearable Weight of Massive Talent is a form of self-care. In the action-comedy, in theaters April 22, Cage plays an even more over-the-top version of himself, who,…", "url": "https://time.com/6169922/nicolas-cage-actors-play-themselves/", "urlToImage": "https://api.time.com/wp-content/uploads/2021/12/nicolas-cage-uwmt.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-22T21:34:02Z", "content": "If imitation is the sincerest form of flattery, then Nicolas Cage playing Nicolas Cage in The Unbearable Weight of Massive Talent is a form of self-care. In the action-comedy, in theaters April 22, C… [+5252 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Sean Gregory", "title": "Heavyweight Champ Tyson Fury Faces His Last Fight—But Skips the Tough Questions", "description": "Tyson Fury, the heavyweight champion from Great Britain, enters what could be his last fight facing uncomfortable questions", "url": "https://time.com/6169270/tyson-fury-whyte-fight-boxing/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/tyson-fury-whyte.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-22T21:26:35Z", "content": "Undefeated world heavyweight champion Tyson Fury, who will defend his title against fellow British heavyweight Dillian Whyte on Saturday at Wembley Stadium in London, insists this will be his last bo… [+8746 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Javier Córdoba and Christopher Sherman / AP", "title": "Cyberattack Causes Chaos in Costa Rica’s Government Systems", "description": "The Russian-speaking Conti gang claimed responsibility for the attack, but the Costa Rican government had not confirmed its origin", "url": "https://time.com/6169890/cyber-attack-chaos-costa-rica/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/cyber-attack-chaos-costa-rica.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-22T19:53:21Z", "content": "SAN JOSE, Costa Rica — Nearly a week into a ransomware attack that has crippled Costa Rican government computer systems, the country refused to pay a ransom as it struggled to implement workarounds a… [+4808 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Philip Elliott", "title": "How New Revelations Complicate Kevin McCarthy’s Bid for House Speaker", "description": "This article is part of The D.C. Brief, TIME’s politics newsletter. Sign up here to get stories like this sent to your inbox. Here’s the thing about absolute denials: you can make them, but only once. The follow-up denial, usually offered as a caveat, a nuanc…", "url": "https://time.com/6169887/kevin-mccarthy-trump-call-recording/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/kevin-mccarthy.jpg?quality=85&crop=0px%2C87px%2C2400px%2C1256px&resize=1200%2C628&strip", "publishedAt": "2022-04-22T19:50:53Z", "content": "This article is part of The D.C. Brief, TIME’s politics newsletter. Sign up here to get stories like this sent to your inbox.\r\nHere’s the thing about absolute denials: you can make them, but only onc… [+6215 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Judy Berman", "title": "There’s an Ingenious Method in Shining Girls‘ Mind-Bending Madness", "description": "I’ve never lost my mind, at least as far as I know. But if my grasp on reality ever started to slip, I imagine it would feel much like the experience of watching Apple’s cerebral sci-fi crime drama Shining Girls. When we meet our protagonist Kirby Mazrachi (E…", "url": "https://time.com/6169879/shining-girls-review-apple/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/Shining_Girls_Photo_010204.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-22T19:47:28Z", "content": "I’ve never lost my mind, at least as far as I know. But if my grasp on reality ever started to slip, I imagine it would feel much like the experience of watching Apple’s cerebral sci-fi crime drama S… [+3719 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Kevin Crowley / Bloomberg", "title": "Exxon Bans LGBTQ Pride and BLM Flags, Triggering Employee Backlash", "description": "Exxon updated company guidance on what flags can be displayed outside its offices, banning “external position flags” such as PRIDE and BLM", "url": "https://time.com/6169876/exxon-ban-lgbtq-pride-flag/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/exxon-ban-lgbtq-flag.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-22T19:27:09Z", "content": "Exxon Mobil Corp. plans to prohibit the LGBTQ-rights flag from being flown outside its offices during Pride month in June, prompting backlash from Houston-based employees.\r\nExxon updated company guid… [+3879 chars]"}]}