{"status": "ok", "totalResults": 31, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Simon Shuster/Kyiv", "title": "Ukraine’s First Lady Olena Zelenska Takes On the Trauma Of War", "description": "Olena Zelenska, the First Lady of Ukraine, got to bed late on the eve of the Russian invasion. Her kids were long asleep in the presidential residence south of Kyiv, a vast mansion of yellow stone that the family had always found a bit too grand, bordering on…", "url": "https://time.com/6194177/olena-zelenska-ukraine-first-lady-interview/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/olena-zelenska-time-interview-06-.jpg?quality=85&crop=0px%2C375px%2C1800px%2C942px&resize=1200%2C628&strip", "publishedAt": "2022-07-07T09:00:42Z", "content": "Olena Zelenska, the First Lady of Ukraine, got to bed late on the eve of the Russian invasion. Her kids were long asleep in the presidential residence south of Kyiv, a vast mansion of yellow stone th… [+13965 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "SYLVIA HUI and DANICA KIRKA / AP", "title": "Embattled U.K. Prime Minister Boris Johnson Agrees to Resign", "description": "U.K. Prime Minister Boris Johnson has agreed to resign, his office said, ending an unprecedented political crisis over his future.", "url": "https://time.com/6194315/boris-johnson-agrees-to-resign/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-1241730267-1.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-07T08:46:54Z", "content": "U.K. Prime Minister Boris Johnson has agreed to resign, his office said Thursday, ending an unprecedented political crisis over his future that has paralyzed Britain’s government.\r\nAn official in Joh… [+3627 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Emily Wagster Pettus / AP", "title": "Scramble as Last Mississippi Abortion Clinic Shuts Its Doors", "description": "Physicians at Jackson Women’s Health Organization have been trying to see as many patients as possible before Thursday, when Mississippi will enact a law to ban most abortions.", "url": "https://time.com/6194299/mississippi-abortion-clinic-pink-house-closes/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/mississippi-abortion-clinic.jpeg?quality=85&crop=0px%2C106px%2C3281px%2C1717px&resize=1200%2C628&strip", "publishedAt": "2022-07-07T08:20:26Z", "content": "JACKSON, Miss. — Mississippi’s only abortion clinic has been buzzing with activity in the chaotic days since the U.S. Supreme Court upended abortion rights nationwide — a case that originated in this… [+5954 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Aya Batrawy/AP", "title": "Inflation After Ukraine War Pushes 71 Million More Into Poverty in 3 Months", "description": "Soaring food and energy prices climbed in the weeks following Russia's invasion of Ukraine, the United Nations Development Program said.", "url": "https://time.com/6194295/ukraine-war-inflation-pandemic-poverty/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/i1.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-07T08:18:24Z", "content": "DUBAI, United Arab Emirates — A staggering 71 million more people around the world are experiencing poverty as a result of soaring food and energy prices that climbed in the weeks following Russia’s … [+3492 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Bloomberg", "title": "Musk Reportedly Fathered Twins With a Neuralink Executive Last Year", "description": "The two babies would bring Musk’s total known children to nine. He has advocated for increasing the population as part of his vision for colonizing other planets.", "url": "https://time.com/6194287/musk-twins-neuralink-executive/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/musk-twins-neuralink.jpeg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-07T05:24:40Z", "content": "Billionaire Elon Musk is the father of eight-month-old twins born to a senior executive at his artificial intelligence startup Neuralink, Insider reported, citing a court document.\r\nMusk and the exec… [+607 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Paul J. Weber and Jake Bleiberg / AP", "title": "Uvalde Officer Had Chance to Shoot Gunman Before He Entered School, Report Finds", "description": "When the officer turned back toward the gunman, he already gone inside “unabated,” according to the report.", "url": "https://time.com/6194220/uvalde-school-shooting-report/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/uvalde-officer-gunman-report.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-06T22:07:16Z", "content": "AUSTIN, Texas — A police officer armed with a rifle watched the gunman in the Uvalde elementary school massacre walk toward the campus but did not fire while waiting for permission from a supervisor … [+6256 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Matthew Perrone and Tom Murphy / AP", "title": "Pharmacists Can Now Prescribe Paxlovid, Pfizer’s COVID-19 Pill", "description": "Pharmacists can prescribe Paxlovid, Pfizer's COVID-19 pill, directly to patients under a new U.S. policy intended to expand use of the drug.", "url": "https://time.com/6194257/pharmacists-prescribe-paxlovid-covid-19/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/paxlovid.pharmacists-prescribe.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-06T22:01:27Z", "content": "(Washington D.C.) — Pharmacists can prescribe the leading COVID-19 pill directly to patients under a new U.S. policy announced Wednesday that’s intended to expand use of Pfizer’s drug Paxlovid.\r\nThe … [+3709 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Elizabeth Garone", "title": "Why California Could Be the Last State to Offer Inflation Relief Checks", "description": "California lawmakers reached a budget deal last week, which includes $9.5 billion in direct payments to taxpayers", "url": "https://time.com/6194223/california-inflation-relief-states/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-1241207075.jpg?quality=85&w=1024&h=603&crop=1", "publishedAt": "2022-07-06T21:49:27Z", "content": "Whether it’s at the gas pump or in the checkout line at the grocery store, the one constant these days is higher prices for American consumers. This can be felt most acutely in California, where gas … [+4325 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jamie Ducharme", "title": "Abortion Restrictions May Be Making It Harder for Patients to Get a Cancer and Arthritis Drug", "description": "Abortion restrictions may be making some prescription drugs that can be used to induce abortions, like methotrexate, harder to get.", "url": "https://time.com/6194179/abortion-restrictions-methotrexate-cancer-arthritis/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/methotrexate.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-06T21:48:36Z", "content": "Soon after she started taking the drug methotrexate in February, Jennifer Crow noticed a significant improvement in her inflammatory arthritis pain. Since then, she’s taken the drug weekly. So her st… [+5065 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "and", "title": "Here’s How Depictions of Abortion in Movies and TV Shows Have Changed Over the Years", "description": "Sociologist Gretchen Sisson traces the history of abortions on screen back to the 1916 silent film Where Are My Children?, about a woman who has been rendered infertile after having multiple abortions", "url": "https://time.com/6193797/abortion-movies-tv-depictions/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/unpregnant.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-06T21:38:07Z", "content": "States across the country are working to restrict access to abortion and, critics say, drive it underground, after the Supreme Court overturned Roe v. Wade. But, in movies and TV shows, depictions of… [+1579 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Cady Lang", "title": "Nicole Kidman Gives the People What We Want", "description": "Nicole Kidman always delivers a memorable moment, whether she's walking the runway at Balenciaga or heading to an AMC theatre for magic.", "url": "https://time.com/6194113/nicole-kidman-memes-balenciaga-amc/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/nicole-kidman-balenciaga.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-06T21:28:29Z", "content": "When it comes to viral moments, Nicole Kidman does not disappoint.\r\nOn Wednesday, the Oscar-winning actor walked in Balenciaga‘s haute couture show in Paris, donning a one-shoulder silver gown with a… [+2367 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Annabel Gutterman", "title": "Blake Crouch No Longer Believes in Science Fiction", "description": "In 2019, Blake Crouch published Recursion, a sci-fi thriller about a neurological disease that inflicts memories upon people of lives that are not their own. Before that, he introduced readers to a physics professor who is kidnapped and then catapulted into a…", "url": "https://time.com/6189737/blake-crouch-interview-upgrade/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/blake-crouch.jpg?quality=85&crop=0px%2C375px%2C1600px%2C836px&resize=1200%2C628&strip", "publishedAt": "2022-07-06T19:30:04Z", "content": "In 2019, Blake Crouch published Recursion, a sci-fi thriller about a neurological disease that inflicts memories upon people of lives that are not their own. Before that, he introduced readers to a p… [+6798 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Darlene Superville / AP", "title": "President Biden Tells Brittney Griner’s Wife He’s Working to Free WNBA Star From Russian Jail", "description": "Biden's conversation with Cherelle Griner followed Brittney Griner's personal appeal to the president in a handwritten letter", "url": "https://time.com/6194122/president-biden-brittney-griner-wife/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/president-biden-brittney-griner-wife.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-06T19:15:13Z", "content": "WASHINGTON — President Joe Biden spoke Wednesday with the wife of detained WNBA player Brittney Griner, who is on trial in Russia, to reassure her that he is working to win Griner’s freedom as soon a… [+3366 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Philip Elliott", "title": "Trump Blew Up Republicans’ Faith in the Presidency. We May Never Get it Back.", "description": "Just 23% of Americans have faith in the presidency—the office, not the officeholder. The striking shift is almost entirely from Republicans.", "url": "https://time.com/6194142/trump-republicans-presidency-trust-institution/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/oval-office-donald-trump.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-06T19:13:05Z", "content": "This article is part of The D.C. Brief, TIME’s politics newsletter. Sign up here to get stories like this sent to your inbox.\r\nGallup began polling Americans on their faith in the presidency in 1975.… [+6183 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eloise Barry / London", "title": "Who Could Replace Boris Johnson As U.K. Prime Minister?", "description": "Bookmakers are already speculating over who could replace Johnson in the event of his departure. Here are his likely successors.", "url": "https://time.com/6194073/who-could-replace-boris-johnson/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-1241730376.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-06T17:46:04Z", "content": "British Prime Minister Boris Johnson’s premiership continues to hang in the balance after Health Secretary Sajid Javid and Chancellor of the Exchequer Rishi Sunak resigned on Tuesday—joined by at lea… [+8314 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Megan McCluskey", "title": "Inside the War on Fake Consumer Reviews", "description": "When Kay Dean turned her keen detective’s eye on the reviews for a Toronto dental clinic, she quickly discovered something alarming. The reviewers behind the clinic’s glowing testimonials had also reviewed an array of obscure small businesses across North Ame…", "url": "https://time.com/6192933/fake-reviews-regulation/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/LeonardoSantamaria_Time_FakeReviews_v01_lg.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-06T16:57:09Z", "content": "When Kay Dean turned her keen detective’s eye on the reviews for a Toronto dental clinic, she quickly discovered something alarming. The reviewers behind the clinic’s glowing testimonials had also re… [+15706 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Billy Perrigo / London", "title": "Boris Johnson’s Premiership Is Teetering on the Edge", "description": "The embattled prime minister is teetering on the edge after more than 30 members of his government resigned in protest.", "url": "https://time.com/6194087/boris-johnson-future-ministers-resign/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-1241730598.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-06T16:37:09Z", "content": "Boris Johnson’s position as prime minister of the United Kingdom was teetering on the edge on Wednesday, after more than 30 members of his government resigned in protest against a series of ethics sc… [+3118 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Abigail Abrams", "title": "Governor Gretchen Whitmer on Her Fight for Abortion Access in Michigan", "description": "As states scramble to adjust their abortion policies in the wake of the Supreme Court’s decision overturning Roe v. Wade, Michigan has emerged as one of the most hotly contested battlegrounds. And Michigan Governor Gretchen Whitmer is at the center of that fi…", "url": "https://time.com/6193886/gretchen-whitmer-michigan-abortion-interview/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-1241573050.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-06T15:06:51Z", "content": "As states scramble to adjust their abortion policies in the wake of the Supreme Court’s decision overturningRoe v. Wade, Michigan has emerged as one of the most hotly contested battlegrounds. And Mic… [+8714 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Grant Smith and Salma El Wardany / Bloomberg", "title": "Mohammad Barkindo, OPEC Secretary-General, Dies at 63", "description": "Barkindo steered OPEC through the creation of the OPEC+ alliance", "url": "https://time.com/6194050/mohammad-barkindo-obituary/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/mohammad-barkindo-obituary.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-06T14:59:15Z", "content": "OPEC Secretary-General Mohammad Barkindo, an oil industry veteran who steered the group through the creation of the OPEC+ alliance, has died in his native Nigeria. He was 63.\r\nBarkindo was in the fin… [+3579 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Tik Root", "title": "The Safest Sunscreens to Buy—and Which Ingredients to Avoid", "description": "Chemical and physical sunscreens both come with pros and cons. Here’s what experts say is the healthiest and safest approach to sun protection.", "url": "https://time.com/6193896/safest-sunscreen-to-buy/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/is-sunscreen-safe.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-06T14:58:36Z", "content": "Sunscreen is a summertime must. It protects against ultraviolet light exposure that has been linked to skin cancers, as well as changes commonly associated with aging. Because of these proven benefit… [+7211 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Kirsten Grieshaber / AP", "title": "Germany Eases Path to Permanent Residency for Migrants", "description": "Tens of thousands of migrants will be eligible for permanent residency after a new bill was approved Wednesday.", "url": "https://time.com/6194014/germany-permanent-residency-migrants/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-1241730751.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-06T14:14:01Z", "content": "Tens of thousands of migrants, who have been living in Germany for years without long-lasting permission to remain in the country, will be eligible for permanent residency after the government approv… [+2423 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Loretta Ross", "title": "I Refuse to Give Up Hope After Roe", "description": "Lily Tomlin famously quipped, “No matter how cynical you become, it’s never enough to keep up.” I was reminded of this quote when I saw how those Republican-appointed Supreme Court Justices lied during their confirmation hearings about respecting precedent an…", "url": "https://time.com/6193895/hope-after-roe-v-wade-overturned/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/roe-versus-wade-hope.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-06T13:40:58Z", "content": "Lily Tomlin famously quipped, “No matter how cynical you become, it’s never enough to keep up.” I was reminded of this quote when I saw how those Republican-appointed Supreme Court Justices lied duri… [+5852 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "FDA Temporarily Suspends Order Banning Juul E-Cigarettes", "description": "The FDA issued an administrative stay on the order it issued last month for vaping company Juul to pull its e-cigarettes from the market.", "url": "https://time.com/6194012/fda-suspends-juul-ban/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/fda-suspends-juul-ban.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-06T13:38:38Z", "content": "(Washington) — The Food and Drug Administration issued an administrative stay Tuesday on the order it issued last month for vaping company Juul to pull its electronic cigarettes from the market.\r\nThe… [+1464 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "CDC Links Florida Ice Cream to a Listeria Outbreak", "description": "Big Olaf Creamery, a Florida ice cream company, is the possible source of a multistate listeria outbreak, CDC health officials say.", "url": "https://time.com/6194004/florida-ice-cream-listeria/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/ice-cream-listeria-outbreak.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-06T13:28:39Z", "content": "(Miami) — The estate of an Illinois woman who died earlier this year from a listeria infection filed a federal lawsuit Tuesday against a Florida ice cream company that health officials have connected… [+2185 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "SAMUEL PETREQUIN and RAF CASERT/AP", "title": "EU Lawmakers Officially Label Gas and Nuclear Energy as Sustainable", "description": "The decision could tarnish the bloc's image and question the region's commitment to reaching climate neutrality by 2050.", "url": "https://time.com/6193991/eu-label-gas-nuclear-green/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/europe-gas-nuclear-green-climate.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-06T12:08:58Z", "content": "(BRUSSELS, Belgium)—European Union lawmakers voted Wednesday to include natural gas and nuclear in the bloc’s list of sustainable activities, backing a controversial proposal from the EU’s executive … [+4612 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Bloomberg", "title": "Beijing Rolls Out China’s First Ever COVID-19 Vaccine Mandate", "description": "The move comes as the city rushes to quash a new outbreak caused by a more infectious Omicron subvariant.", "url": "https://time.com/6193981/china-covid-vaccine-mandate/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-1239950294.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-06T11:23:05Z", "content": "Beijing residents wanting to enter a raft of public places will need to show proof of vaccination from Monday, the first time China has deployed a vaccine mandate, as the city rushes to quash a new o… [+1845 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "E.U. Chief Warns of Danger of Complete Cut-off of Russian Gas", "description": "Ursula von der Leyen said the E.U. needs to prepare for a complete cut-off of Russian gas in the wake of Kremlin's war in Ukraine.", "url": "https://time.com/6193972/eu-russia-gas-supply-cut-off/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/eu-russia-gas.jpeg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-06T10:22:15Z", "content": "BRUSSELS — European Commission chief Ursula von der Leyen said Wednesday that the 27-nation European Union needs to make emergency plans to prepare for a complete cut-off of Russian gas in the wake o… [+3364 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Shanghai, Beijing Order New Round of Mass COVID-19 Testing", "description": "Residents of parts of Shanghai and Beijing have been ordered to undergo further rounds of COVID-19 testing following the discovery of new cases.", "url": "https://time.com/6193957/china-covid-mass-testing-beijing-shanghai/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/beijing-covid-mass-testing.jpeg?quality=85&crop=0px%2C597px%2C5664px%2C2965px&resize=1200%2C628&strip", "publishedAt": "2022-07-06T09:21:10Z", "content": "BEIJING — Residents of parts of Shanghai and Beijing have been ordered to undergo further rounds of COVID-19 testing following the discovery of new cases in the two cities, while tight restrictions r… [+4829 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Sylvia Hui/AP", "title": "The Two Men Behind Boris Johnson’s New Political Crisis", "description": "Boris Johnson's government faced a new crisis Tuesday after two of his most senior Cabinet ministers resigned within minutes of each other.", "url": "https://time.com/6193946/boris-johnson-rishi-sunak-sajid-javid/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/b2.jpg?quality=85&crop=0px%2C0px%2C3500px%2C1832px&resize=1200%2C628&strip", "publishedAt": "2022-07-06T06:52:06Z", "content": "LONDON — British Prime Minister Boris Johnson’s government faced a new crisis Tuesday after two of his most senior Cabinet ministers resigned within minutes of each other.\r\nTreasury chief Rishi Sunak… [+3483 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Kitty Donaldson, Joe Mayes and Ellen Milligan/Bloomberg", "title": "Boris Johnson Fights Back After Shock Resignations Rock British Politics", "description": "Prime minister appoints a new chancellor of the exchequer and health secretary", "url": "https://time.com/6193931/boris-johnson-resignation-sunak-javed-british/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/b1.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-06T04:41:25Z", "content": "LONDON — Boris Johnson is digging in as U.K. prime minister, after the resignation of two of the most senior members of his government brought his premiership to the brink on another febrile day in W… [+5583 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Nik Popli", "title": "A Highland Park Doctor Who Helped Save Shooting Victims Asks: How Can We Keep Letting This Happen?", "description": "Dr. David Baum helped save victims of the Highland Park shooting. Now he wonders wonder how the U.S. can continue to let mass shootings happen.", "url": "https://time.com/6193916/highland-park-shooting-doctor/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/Highland-Park-shooting-1.jpg?quality=85&crop=0px%2C140px%2C1024px%2C536px&resize=1200%2C628&strip", "publishedAt": "2022-07-06T01:26:56Z", "content": "As almost everyone else fled, Dr. David Baum ran to help. The obstetrician from Highland Park, Ill., waited until the gunfire at his home city’s beloved Fourth of July parade stopped and then he went… [+3119 chars]"}]}