{"status": "ok", "totalResults": 47, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Jasmine Aguilera", "title": "‘Short Term Band-Aid.’ Afghans in the U.S. Can Now Apply for Temporary Protection", "description": "The Biden Administration will now allow Afghans in the U.S. to apply for Temporary Protected Status (TPS), a designation that would protect them from deportation for 18 months, grant them a work permit, and give them authorization to travel. The Department of…", "url": "https://time.com/6179185/afghans-temporary-protected-status/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Afghan-TPS.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-20T22:26:52Z", "content": "The Biden Administration will now allow Afghans in the U.S. to apply for Temporary Protected Status (TPS), a designation that would protect them from deportation for 18 months, grant them a work perm… [+5232 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jasmine Aguilera and Madeleine Carlisle", "title": "Federal Judge Blocks Biden From Ending Controversial Border Policy, Title 42", "description": "The controversial, Trump-era border policy will now likely remain in place for the foreseeable future, exacerbating border policy confusion.", "url": "https://time.com/6176711/title-42-biden-judge-blocked/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1395555073-1.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-20T21:43:01Z", "content": "A district judge ruled Friday that the Biden Administration must continue to expel migrants under Title 42, a COVID-19-related health measure first implemented under President Donald Trump. The decis… [+8213 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Shannon Carlin", "title": "The 46 Most Anticipated Movies of Summer 2022", "description": "As the weather gets hotter, the movies always seem to get a little cooler. This summer’s list of most anticipated movies include existential superheroes, killer animals, unsettling horror, family comedies, weird arthouse fare, inspiring documentaries, strange…", "url": "https://time.com/6179490/summer-movies-2022/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Summer-Preview_Movies2022_final.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-20T20:01:00Z", "content": "As the weather gets hotter, the movies always seem to get a little cooler. This summer’s list of most anticipated movies include existential superheroes, killer animals, unsettling horror, family com… [+13403 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Josiah Bates", "title": "Bill Cosby Is Facing Another Trial. Here’s What to Know About the Judy Huth Case", "description": "Judy Huth, the plaintiff in the case, alleges that Cosby groped her while at the Playboy Mansion in Los Angeles 50 years ago.", "url": "https://time.com/6178298/bill-cosby-trial-judy-huth/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Cosby-civil-trial-5-19-22.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-20T19:00:25Z", "content": "Jury selection begins Monday in a new trial against Bill Cosby—a trial that could be one of the last legal proceedings the once beloved comedian faces.\r\nJudy Huth, the plaintiff in the case, alleges … [+2604 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Stephanie Zacharek", "title": "In the Film Men a Woman Tries—Unsuccessfully—To Be Left Alone", "description": "Depending on whom you ask, modern men are either suffering a crisis of masculinity or they wield more power than ever. In his tricky psycho-sexual horror film Men, writer-director Alex Garland explores both angles, suggesting that men don’t know who they are …", "url": "https://time.com/6179437/men-review-alex-garland/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/jessie-buckley-men-2.jpeg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-20T18:00:57Z", "content": "Depending on whom you ask, modern men are either suffering a crisis of masculinity or they wield more power than ever. In his tricky psycho-sexual horror film Men, writer-director Alex Garland explor… [+3653 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "JAKE COYLE / AP", "title": "A Protestor Stripped Off Her Clothes to Reveal an Anti-Rape Message on the Cannes Red Carpet", "description": "CANNES, France — A woman who stripped off her clothes to reveal a message against rape written on her body crashed the Cannes Film Festival red carpet premiere of George Miller’s “Three Thousand Years of Longing” on Friday. The unidentified woman tore off her…", "url": "https://time.com/6179446/protester-cannes-george-miller/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/cannes-protestor.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-20T17:57:05Z", "content": "CANNES, France — A woman who stripped off her clothes to reveal a message against rape written on her body crashed the Cannes Film Festival red carpet premiere of George Miller’s “Three Thousand Year… [+804 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Andrew R. Chow", "title": "Russian DJ Nina Kraviz Has Been Removed From Three Music Festivals Following Criticism", "description": "The Russian DJ has expressed tacit support for Putin in the past, and is no longer playing at three festivals following calls for her removal from them.", "url": "https://time.com/6179208/nina-kraviz-backlash-russia-ukraine/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1339546613.jpg?quality=85&crop=0px%2C488px%2C5000px%2C2617px&resize=1200%2C628&strip", "publishedAt": "2022-05-20T17:37:47Z", "content": "The Russian DJ Nina Kraviz is no longer playing at three music festivals this summer following criticism over her political history and recent rhetoric about Russia’s invasion of Ukraine. \r\nKraviz, o… [+3095 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Stephanie Zacharek", "title": "James Gray’s Armageddon Time Is a Reminder of What Happens When We Fail to Act Against White Privilege", "description": "It’s conveniently noble to think that human beings are shaped by their actions, that decisiveness is what makes us who we are. Yet the times we failed to act are often what we remember most vividly. There’s the merest synapse leap between wanting to do the ri…", "url": "https://time.com/6179174/armageddon-time-review-cannes/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Armageddon-Time.jpg?quality=85&w=741&h=493&crop=1", "publishedAt": "2022-05-20T17:24:15Z", "content": "It’s conveniently noble to think that human beings are shaped by their actions, that decisiveness is what makes us who we are. Yet the times we failed to act are often what we remember most vividly. … [+7635 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Musk Denies Sexual Misconduct Allegation by Flight Attendant", "description": "A report said SpaceX paid the woman $250,000 in severance in 2018 in exchange for her agreeing not to file a lawsuit over her claim.", "url": "https://time.com/6179426/musk-denies-misconduct/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/musk-denies-misconduct.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-20T17:23:31Z", "content": "NEW YORK — Tesla and SpaceX CEO Elon Musk has denied a claim of sexual misconduct by a flight attendant contracted by SpaceX who worked on his private jet in 2016.\r\nA report by Business Insider said … [+2868 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Shannon Carlin", "title": "The 51 Most Anticipated TV Shows of the Summer", "description": "Planning to spend this summer at home? Don’t worry: There’s more than enough TV to keep you busy through Labor Day. In fact, it might be too much TV for one person to keep track of, so we’ve compiled a guide to help you sort through all the new shows, as well…", "url": "https://time.com/6179175/summer-tv-shows-2022/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Summer-Preview_TV_2022_final.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-20T16:23:23Z", "content": "Planning to spend this summer at home? Don’t worry: There’s more than enough TV to keep you busy through Labor Day. In fact, it might be too much TV for one person to keep track of, so we’ve compiled… [+16933 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Richard Stengel", "title": "Putin May Be Winning the Information War Outside of the U.S. and Europe", "description": "Is Vladimir Putin losing the information war with Ukraine? Well, it depends on who you ask. It’s never easy to measure such things, but here are a few numbers. While 141 countries in the UN voted to condemn Russia’s aggression, the number of African, Middle E…", "url": "https://time.com/6179221/putin-information-war-column/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1240706866.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-20T16:17:12Z", "content": "Is Vladimir Putin losing the information war with Ukraine?\r\nWell, it depends on who you ask.\r\nIt’s never easy to measure such things, but here are a few numbers.\r\nWhile 141 countries in the UN voted … [+11207 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Maria Cheng / AP", "title": "Monkeypox Spreads in West, Baffling African Scientists", "description": "Britain, Spain, Portugal, Italy, U.S., Sweden and Canada all reported infections, mostly in young men who hadn’t traveled to Africa.", "url": "https://time.com/6179237/monkeypox-spread-scientists/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/monkeypox-spread-scientists.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-20T15:07:28Z", "content": "Scientists who have monitored numerous outbreaks of monkeypox in Africa say they are baffled by the disease’s recent spread in Europe and North America.\r\nCases of the smallpox-related disease have pr… [+4785 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "LAURAN NEERGAARD / AP", "title": "CDC Urges Pfizer Booster for Children Ages 5 to 11", "description": "The hope is that an extra shot will shore up protection for kids ages 5 to 11 as infections once again are on the rise.", "url": "https://time.com/6179189/cdc-pfizer-booster-children/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/cdc-pfizer-booster-children.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-20T14:03:57Z", "content": "Kids ages 5 to 11 should get a booster dose of Pfizer’s COVID-19 vaccine, advisers to the U.S. government said Thursday.\r\nThe Center for Disease Control and Prevention quickly adopted the panel’s rec… [+4123 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Angela Haupt and Cady Lang", "title": "27 New Books You Need to Read This Summer", "description": "There’s plenty to look forward to this summer, including a new crop of books that will transport you far away, regardless of your vacation plans. The best books arriving over the next few months take place in coastal Maine, an isolated part of Alaska, East Af…", "url": "https://time.com/6178938/best-books-summer-2022/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/featured-image-summer-preview-2022.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-20T13:55:46Z", "content": "There’s plenty to look forward to this summer, including a new crop of books that will transport you far away, regardless of your vacation plans. The best books arriving over the next few months take… [+15833 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eliana Dockterman", "title": "A Spoiler-Filled Breakdown of Downton Abbey: A New Era", "description": "This story contains spoilers for Downton Abbey: A New Era Julian Fellowes, the creator of Downton Abbey, has clearly been preparing for Maggie Smith’s departure from the series for quite some time. Smith has portrayed the dowager countess, Violet Crawley, a c…", "url": "https://time.com/6160970/downton-abbey-a-new-era-ending/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/03/downton-abbey-a-new-era-maggie-smith.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-20T13:01:21Z", "content": "This story contains spoilers for Downton Abbey: A New Era\r\nJulian Fellowes, the creator of Downton Abbey, has clearly been preparing for Maggie Smith’s departure from the series for quite some time. … [+4495 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Billy Perrigo/Geneva", "title": "How Breaking Up Big Tech Could Save Global Democracy, According to Proton Founder Andy Yen", "description": "This story first appeared in TIME’s Leadership Brief newsletter on May 1. To receive weekly emails of conversations with the world’s top CEOs and business decisionmakers, click here. Andy Yen is the founder and CEO of Proton, the company behind the encrypted …", "url": "https://time.com/6179164/andy-yen-interview-transcript/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Andy-Photo-Ses-April-2021-2-large.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-20T12:39:24Z", "content": "This story first appeared in TIME’s Leadership Brief newsletter on May 1. To receive weekly emails of conversations with the world’s top CEOs and business decisionmakers, clickhere.\r\nAndy Yen is the … [+8094 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eliana Dockterman", "title": "It’s Time to Forgive Hayden Christensen for the Star Wars Prequels", "description": "Obi-Wan Kenobi arrives on Disney+ on May 27, and with it another wave of Star Wars prequel nostalgia. When LucasFilm announced that Hayden Christensen would don the Darth Vader suit to reprise his role as Anakin Skywalker opposite Ewan McGregor’s Obi-Wan Keno…", "url": "https://time.com/6177355/hayden-christensen-obi-wan-kenobi-star-wars-prequels/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/skywalker-attack-of-the-clones.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-20T11:01:05Z", "content": "Obi-Wan Kenobi arrives on Disney+ on May 27, and with it another wave of Star Wars prequel nostalgia. When LucasFilm announced that Hayden Christensen would don the Darth Vader suit to reprise his ro… [+7365 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "AMY GUNIA / LAUNCESTON, AUSTRALIA", "title": "Racism Against Chinese Australians Is Being Made Worse by Anti-China Election Rhetoric", "description": "Asian Australians say discrimination is being exacerbated by the anti-China tone of campaigning in the country's general election.", "url": "https://time.com/6176970/australia-election-china/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1353988426.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-20T10:49:28Z", "content": "Politics can be cutthroat, but Australian businessman Jason Yat-sen Li wasn’t expecting to have his loyalty to his country questioned when he ran for a seat in the New South Wales legislative assembl… [+6712 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "W.J. Hennigan and Vera Bergengruen", "title": "Biden Pledged to Combat Domestic Terror. Buffalo Shows The Government Is Falling Short", "description": "“The Buffalo shooting was fundamentally preventable,” says Elizabeth Neumann, who until 2020 led the DHS office that oversees responses to violent extremism.", "url": "https://time.com/6177847/biden-pledged-to-defeat-domestic-terror-buffalo-why-thats-not-enough/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/biden-buffalo-shooting.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-20T10:00:57Z", "content": "Payton Gendron, the 18-year-old accused of killing 10 people in Buffalo on May 14, was first questioned by police last May. It was the end of Gendron’s senior year of high school, a time marked by pa… [+10738 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eric Cortellessa/Buffalo", "title": "‘I’m Sorry. I’ve Got Your Sister.’ A Family Grieves After the Buffalo Shooting", "description": "Katherine Massey had a list. She needed to get meat, fruit, paper towels. The 72-year-old Buffalo native usually went to the grocery store every two weeks, and when she did, she stocked up. On Saturday, May 14, she asked her brother, Warren, to drive her. The…", "url": "https://time.com/6178803/buffalo-shooting-victim-katherine-massey/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Katherine-Massey-Buffalo-02.jpg?quality=85&crop=0px%2C260px%2C2400px%2C1256px&resize=1200%2C628&strip", "publishedAt": "2022-05-20T10:00:49Z", "content": "Katherine Massey had a list. She needed to get meat, fruit, paper towels. The 72-year-old Buffalo native usually went to the grocery store every two weeks, and when she did, she stocked up. On Saturd… [+7953 chars]"}]}