{"status": "ok", "totalResults": 17, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Cady Lang", "title": "The Best (and Most Outrageous) Fashion Moments From the 2022 Met Gala", "description": "From Blake Lively's NYC-inspired Atelier Versace gown to Anna Wintour in a tiara, here's a look at the best looks from the 2022 Met Gala.", "url": "https://time.com/6172286/met-gala-red-carpet-2022/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Billie-Eilish-Met-Gala-2022.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-03T02:23:42Z", "content": "On the first Monday in May, art and fashion enthusiasts alike ascended the Metropolitan Museum of Art’s stairs to celebrate fashion’s biggest night, the Met Gala. This year’s gala theme, Gilded Glamo… [+1629 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Melissa Locker", "title": "Johnny Depp’s Agent Claims Amber Heard’s Op-ed Was ‘Catastrophic’ for Pirates Actor’s Career", "description": "Johnny Depp's agent testified on Monday that the actor would have received $22.5 million to star in the sixth 'Pirates of the Caribbean' film.", "url": "https://time.com/6172789/johnny-depp-agent-testimony-trial/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/johnny-depp-jack-whigham-trial-amber-heard.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-02T22:36:13Z", "content": "The high-profile trial involving actors Johnny Depp, 58, and his ex-wife Amber Heard, 36, entered its third week today, after kicking off April 12 in Fairfax County, Va.\r\nThe trial, which has ignited… [+3289 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Alabama Jailer Helped Murder Suspect Escape and Fled With Him, Authorities Say", "description": "“We know she participated, whether she did that willingly or if she was coerced, threatened somehow to participate in the case, not really sure. We know for sure she did participate,” Lauderdale County Sheriff Rick Singleton said.", "url": "https://time.com/6172756/alabama-jail-official-helped-murder-suspect-escape/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/alabama-jailer-murder-suspect-escape.jpg?quality=85&crop=628px%2C126px%2C1494px%2C782px&resize=1200%2C628&strip", "publishedAt": "2022-05-02T20:56:12Z", "content": "FLORENCE, Ala. — Authorities issued an arrest warrant Monday for a jail official who they say helped an inmate awaiting trial on a murder charge to escape from an Alabama jail. A search was on for th… [+4100 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Chris Stokel-Walker", "title": "Inflation, Passwords and TikTok: The Real Threats to the Future of Netflix and Streaming", "description": "The pandemic sparked a boom for video streaming services like Netflix, Disney+, and Peacock. In 2020 and 2021, Netflix added 54.6 million subscribers, many of them in the frightening, isolating six months after the world locked down and people sought entertai…", "url": "https://time.com/6172680/netflix-streaming-future/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/streaming-services.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-02T20:32:05Z", "content": "The pandemic sparked a boom for video streaming services like Netflix, Disney+, and Peacock. In 2020 and 2021, Netflix added 54.6 million subscribers, many of them in the frightening, isolating six m… [+5872 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Haleluya Hadero / AP", "title": "Amazon Workers in NYC Reject a Union Bid, Despite Grassroots Efforts", "description": "The rejection was a blow to Amazon Labor Union organizers who pulled off the first successful U.S. organizing effort in Amazon's history.", "url": "https://time.com/6172710/amazon-reject-union-bid/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/amazon-reject-union-bid.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-02T19:57:33Z", "content": "Amazon warehouse workers overwhelmingly rejected a union bid on Monday, dealing a blow to organizers who last month pulled off the first successful U.S. organizing effort in the retail giant’s histor… [+3282 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Roger McNamee", "title": "Twitter Is Brilliant. The Damage It’s Done Is Undeniable", "description": "The debate over Elon Musk’s acquisition of Twitter is fierce because journalists and politicians depend on the platform to share their ideas and build their brands. Twitter is less than one-tenth the size of Facebook, and has been only intermittently profitab…", "url": "https://time.com/6172636/twitter-policy-failures-elon-musk/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/twitter-elon-musk.jpg?quality=85&crop=0px%2C14px%2C2400px%2C1256px&resize=1200%2C628&strip", "publishedAt": "2022-05-02T19:56:38Z", "content": "The debate over Elon Musk’s acquisition of Twitter is fierce because journalists and politicians depend on the platform to share their ideas and build their brands. Twitter is less than one-tenth the… [+6382 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Shannon Carlin", "title": "A Spoiler-Filled Chat With Julia Garner About Her Ozark Character’s Fate", "description": "Julia Garner talks about her 'Ozark' character's fate, as well as her starring role in 'Inventing Anna.'", "url": "https://time.com/6172614/julia-garner-ozark-final-season-interview/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/OZARK_414_Unit_00937R.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-02T19:04:12Z", "content": "Warning: Major spoilers ahead for the final season of Ozark\r\nJulia Garner apologizes for talking in the third person, but she swears it’s the only way she can tell the story of how she learned her ch… [+8172 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Fired Philadelphia Cop Charged With Murder in Shooting of 12-Year-Old Boy", "description": "New details of the shooting were revealed in the unsealed grand jury documents Monday, including that Siderio had thrown a gun down about 40 feet before he was shot and that the youth had dropped to the ground, either tripping or obeying a command to get down.", "url": "https://time.com/6172626/philadelphia-cop-charged-murder-12-year-old/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/former-officer-shooting-12-year-old.jpeg?quality=85&w=1000&h=628&crop=1", "publishedAt": "2022-05-02T16:46:01Z", "content": "PHILADELPHIA — A fired Philadelphia police officer has been charged with murder in the shooting of a fleeing 12-year-old boy, who prosecutors said Monday was on the ground and unarmed when the office… [+1460 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Ruth Millington", "title": "Dora Maar’s Anti-Fascist Worldview Influenced Picasso’s Art", "description": "The story of the first encounter between Pablo Picasso and his muse, Dora Maar, has been much mythologised. It is said that Maar, aged 29 at the time, was seated alone at the popular cultural hotspot, Les Deux Magots, playing a game in which she stabbed a sma…", "url": "https://time.com/6172547/picasso-dora-maar-anti-fascist-influence-art/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Picasso-The-Weeping-Woman-Dora-Maar.jpg?quality=85&crop=330px%2C232px%2C621px%2C325px&resize=1200%2C628&strip", "publishedAt": "2022-05-02T16:27:16Z", "content": "The story of the first encounter between Pablo Picasso and his muse, Dora Maar, has been much mythologised. It is said that Maar, aged 29 at the time, was seated alone at the popular cultural hotspot… [+10349 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "AMY GUNIA / KOROR, PALAU", "title": "One Island Nation’s Controversial Plan To Take Climate Justice Into Its Own Hands", "description": "Palau’s waters contain some of the world’s richest marine biodiversity. Critically endangered hawksbill turtles and endangered Napoleon wrasse, which can grow up to six feet long and are known for the distinctive bulge on their foreheads, cruise through reefs…", "url": "https://time.com/6171610/palau-marine-protected-area-climate-justice/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/palau_fish.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-02T15:59:46Z", "content": "Palau’s waters contain some of the world’s richest marine biodiversity. Critically endangeredhawksbill turtles and endangered Napoleon wrasse, which can grow up to six feet long and are known for the… [+10397 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Scott McFetridge", "title": "Greyhound Racing Is Nearing Its End in the U.S.", "description": "Increased concerns about how the dogs are treated along with an explosion of gambling options have nearly killed a sport that gained widespread appeal about a century ago.", "url": "https://time.com/6172581/greyhound-dog-racing-end/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/greyhound-dog-racing-end.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-02T14:23:44Z", "content": "DUBUQUE, Iowa — Vera Rasnake laughed as she led a trio of barking, jostling dogs into the Iowa Greyhound Park, but her smile faded when she acknowledged that after 41 years of being around the sleek … [+5690 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Abbigail Nguyen Rosewood", "title": "I Moved to America for a Better Life. Here’s Why I’m Leaving", "description": "In a panicked state, I pack my bag for my trip to Ho Chi Minh City. I’d received the news of my grandmother’s ill health, her doctor’s warning of her imminent passing. Amid the anxiety about my grandmother’s rapidly deteriorating condition, rising COVID-19 ca…", "url": "https://time.com/6164750/leaving-america-vietnam/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/leaving-america-Abbigail-Nguyen-Rosewood.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-02T13:03:50Z", "content": "In a panicked state, I pack my bag for my trip to Ho Chi Minh City. I’d received the news of my grandmother’s ill health, her doctor’s warning of her imminent passing. Amid the anxiety about my grand… [+8634 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Bloomberg", "title": "Amid Shanghai’s COVID-19 Surge, a Nursing Home Resident Was Sent to the Morgue While Still Alive", "description": "The error has triggered widespread anger and condemnation in the city, which is struggling through its fifth week of lockdown.", "url": "https://time.com/6172535/shanghai-covid-morgue-lockdown/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1240121118.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-02T08:48:25Z", "content": "A Shanghai nursing home resident was mistakenly taken to the morgue while still alive, state media reported, as the city’s Covid-19 outbreak and prolonged lockdown stretch aged-care and medical facil… [+2088 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "LEANNE ITALIE / AP", "title": "The Met Gala Returns to Its Traditional Spot on the First Monday in May", "description": "The year's biggest night in fashion, the Met Gala, returns to its usual berth on the social calendar this year after pandemic upheaval.", "url": "https://time.com/6172517/met-gala-2022-preview/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1147654590.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-02T08:07:45Z", "content": "NEW YORK (AP) — Well, hello first Monday in May.\r\nThe year’s biggest night in fashion, the Met Gala, returns to its usual berth on the social calendar this year after pandemic upheaval. And if it fee… [+2875 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Angelina Jolie Makes a Surprise Visit to Ukraine, Meeting Children", "description": "Angelina Jolie visited Lviv, Ukraine, the Lviv regional governor said on Telegram. She spoke with displaced people including children.", "url": "https://time.com/6172507/angelina-jolie-ukraine-children/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/angelina-jolie-ukraine-children.jpeg?quality=85&crop=0px%2C109px%2C2000px%2C1047px&resize=1200%2C628&strip", "publishedAt": "2022-05-02T05:51:41Z", "content": "LVIV, Ukraine — Hollywood actress and U.N. humanitarian Angelina Jolie made a surprise visit to the western Ukrainian city of Lviv on Saturday, the Lviv regional governor said on Telegram.\r\nAccording… [+1258 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "WILLIAM J. KOLE / AP", "title": "‘What a Journey.’ Endurance Runner Adds Two More to Her Unofficial Record for Consecutive Marathons", "description": "Jacky Hunt-Broersma, 46, beat her unofficial women's record of 102, set on April 28, by adding two more runs to finish on a total of 104.", "url": "https://time.com/6172488/women-consecutive-marathons-record/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/AP22118860714490.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-02T02:45:23Z", "content": "When amputee athlete Jacky Hunt-Broersma says her mantra is, “I can do hard things,” she’s not kidding — the amputee athlete has run 104 marathons in as many days, all using a carbon-fiber prosthesis… [+1899 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Germany Says It Can Wean Itself off Russian Crude Oil by the Summer", "description": "Germany's economy and climate minister says Berlin expects to be fully independent of Russian crude oil imports by late summer.", "url": "https://time.com/6172484/germany-russia-energy-gas/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/AP22121560427491.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-02T01:59:14Z", "content": "BERLIN — Germany says it’s making progress on weaning itself off Russian fossil fuels and expects to be fully independent of Russian crude oil imports by late summer.\r\nEconomy and Climate Minister Ro… [+2391 chars]"}]}