{"status": "ok", "totalResults": 29, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Lorne Cook and Samuel Petrequin / AP", "title": "E.U. Leader Calls for a Russian Oil Ban in a New Set of Sanctions", "description": "The European Union's top official on Wednesday called on the 27-nation bloc to ban oil imports from Russia in a sixth package of sanctions.", "url": "https://time.com/6173405/eu-russia-oil-ban-sanctions/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/eu-russia-oil.jpeg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-04T08:06:02Z", "content": "BRUSSELS — The European Union’s top official on Wednesday called on the 27-nation bloc to ban oil imports from Russia in a sixth package of sanctions targeting Moscow for its war in Ukraine.\r\nEuropea… [+3405 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "LINDSEY TANNER / AP", "title": "Early Transgender Identity Tends to Endure, a New Study Suggests", "description": "The new study is one of the largest to look into the issue of childhood transgender identity and its longevity, involving 317 youngsters.", "url": "https://time.com/6173398/transgender-identity-childhood/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1385208037.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-04T06:24:11Z", "content": "Children who begin identifying as transgender at a young age tend to retain that identity at least for several years, a study published Wednesday suggests.\r\nThe research involved 317 youngsters who w… [+3031 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Sebastian Tong and Kurt Wagner / Bloomberg", "title": "Elon Musk Suggests a ‘Slight Cost’ for Twitter’s Commercial Users", "description": "Government and commercial users may see a “slight cost” to stay on the social media platform, Elon Musk said in a tweet Tuesday.", "url": "https://time.com/6173391/twitter-commercial-business-users-cost/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1239416791.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-04T04:20:35Z", "content": "Twitter will always remain free for “casual users” but government and commercial users may see a “slight cost” to stay on the social media platform, the company’s would-be owner Elon Musk said in a t… [+1316 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Abigail Abrams", "title": "These States Are Set to Ban Abortion if Roe v. Wade is Overturned", "description": "There is no federal law protecting abortion, so rolling back Roe would create a starker patchwork of legality and access across the country", "url": "https://time.com/6173196/abortion-trigger-laws-bans-roe-v-wade/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/TIME_abortion_map.png?w=1200&h=628&crop=1", "publishedAt": "2022-05-03T23:11:33Z", "content": "If the Supreme Court overturns Roe v. Wade, the 1973 ruling that established a constitutional right to abortion in America, it would reshape women’s reproductive rights across the country.\r\nA leaked … [+4620 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jill Filipovic", "title": "The World’s Most ‘Pro-Life’ Nations Offer a Grim Preview of America’s Future", "description": "A few years ago, in a small home off an uneven road in Honduras, I got a little peek into what life is like when abortion is illegal. There, I met a woman in her early 20s, who for privacy I’ll call Alma. She lived with her family and a smattering of extremel…", "url": "https://time.com/6173258/pro-life-countries-roe-v-wade-future/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/pro-life-nations-01.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-03T21:24:04Z", "content": "A few years ago, in a small home off an uneven road in Honduras, I got a little peek into what life is like when abortion is illegal.\r\nThere, I met a woman in her early 20s, who for privacy I’ll call… [+6699 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Nik Popli", "title": "High Gas Prices Are Pushing Electric Car Sales to a Tipping Point", "description": "When Eric Dirksen received his first electric car in December—a new Tesla Model Y—he didn’t know gas prices would spike a few months after. But with fuel costing about $4.19 per gallon on average this week, he’s happy with the decision. “Very fortunate at the…", "url": "https://time.com/6173178/high-gas-prices-electric-vehicles/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1358240190.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-03T21:02:48Z", "content": "When Eric Dirksen received his first electric car in December—a new Tesla Model Y—he didn’t know gas prices would spike a few months after. But with fuel costing about $4.20 per gallon on average thi… [+4693 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eloise Barry", "title": "The State of Abortion Rights Around the World", "description": "The rollback of abortion rights in the U.S. has been mirrored in many other nations, but in others, women's rights activists have succeeded in broadening abortion access.", "url": "https://time.com/6173229/countries-abortion-illegal-restrictions/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/abortion-rights-argentina.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-03T20:59:53Z", "content": "The Supreme Court is reportedly considering overturning the landmark Roe v. Wade ruling on abortion rights, according to a leaked draft opinion. If carried out, abortion will no longer be considered … [+6028 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Olivia B. Waxman", "title": "Inside the Original Roe v. Wade Supreme Court Leak, 49 Years Before the Alito Bombshell", "description": "In 1973, TIME got a scoop on the news of the Roe v. Wade decision. Here's what the reporter behind the story, David C. Beckwith, remembers.", "url": "https://time.com/6173058/supreme-court-leak-history-david-beckwith/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/roe.v.wade_.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-03T20:57:50Z", "content": "The leak to Politico on Monday of a draft of an opinion by a majority of U.S. Supreme Court Justices that would overturn Roe v. Wade has been called “unprecedented” in the modern history of the Court… [+5275 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Philip Elliott", "title": "A Leaked Supreme Court Draft Threatens to Make Every Race About Abortion", "description": "This article is part of The D.C. Brief, TIME’s politics newsletter. Sign up here to get stories like this sent to your inbox. Bombshell is a word that gets thrown around Washington a lot, but the report published Monday evening by Politico merits its use. The…", "url": "https://time.com/6173203/supreme-court-roe-midterms/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/roe.v.wade_.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-03T19:24:50Z", "content": "This article is part of The D.C. Brief, TIME’s politics newsletter. Sign up here to get stories like this sent to your inbox.\r\nBombshell is a word that gets thrown around Washington a lot, but the re… [+7637 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Abigail Abrams", "title": "Draft Decision Ending Roe v. Wade Emboldens Activists on Both Sides of the Abortion Debate", "description": "Both pro-abortion rights and anti-abortion activists spent most of Tuesday scrambling to respond to a leaked draft of a Supreme Court decision that would overturn Roe v. Wade. While the draft, first reported by Politico, is neither final nor legally binding, …", "url": "https://time.com/6172995/supreme-court-roe-v-wade-abortion-activists/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/abortion-roe-v-wade-supreme-court-05.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-03T19:23:31Z", "content": "Both pro-abortion rights and anti-abortion activists spent most of Tuesday scrambling to respond to a leaked draft of a Supreme Court decision that would overturn Roe v. Wade. \r\nWhile the draft, firs… [+6485 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Abby Vesoulis and Eric Cortellessa", "title": "Democrats Vow to Protect Reproductive Rights But Can’t Actually Do Much", "description": "Democrats in Congress were in a fighting mood on Tuesday. Just hours after Politico published a draft opinion by a Supreme Court majority that would strike down Roe v. Wade, senators issued fiery promises about what Congress must do next to safeguard legal ac…", "url": "https://time.com/6173091/democrats-roe-v-wade-codify-abortion-unlikely/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/democrats-abortion-roe-v-wade-supreme-court.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-03T19:04:30Z", "content": "Democrats in Congress were in a fighting mood on Tuesday. Just hours after Politico published a draft opinion by a Supreme Court majority that would strike down Roe v. Wade, senators issued fiery pro… [+4029 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jamie Ducharme", "title": "The FDA Is Moving Forward with a Menthol Cigarette Ban. Here’s What the Science Says", "description": "The U.S. FDA is moving toward a menthol cigarette ban. Here's what the science says about other menthol tobacco bans in Canada and the U.K.", "url": "https://time.com/6173070/menthol-cigarette-ban-studies/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/menthol-cigarette-ban.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-03T18:07:17Z", "content": "The U.S. Food and Drug Administration (FDA) is moving forward with plans to ban menthol cigarettes and all flavored cigars—policies that agency officials say could help prevent some of the roughly 50… [+6463 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Melissa Locker", "title": "Forensic Accountant Says Johnny Depp May Have Lost $40 Million in Earnings", "description": "Johnny Depp’s counsel rested its case today in the ongoing defamation suit the actor brought against his ex-wife Amber Heard.", "url": "https://time.com/6173134/johnny-depp-accountant-lost-money-trial/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1240421454.jpg?quality=85&w=1024&h=577&crop=1", "publishedAt": "2022-05-03T17:49:39Z", "content": "Johnny Depp’s counsel today rested its case in the ongoing defamation suit the actor brought against his ex-wife Amber Heard in March 2019. This is the second lawsuit stemming from the former relatio… [+2308 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Belinda Luscombe", "title": "Why Phoenix—of All Places—Has the Fastest Growing Home Prices in the U.S.", "description": "For 33 months now, Phoenix, Arizona, has led the nation in home price increases. In the last year alone, the cost of the median house in the area has risen by a third. Over the course of two years, it’s up 57%, yanking rental prices with it. Unfortunately for…", "url": "https://time.com/6170497/phoenix-fastest-growing-home-prices/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/GettyImages-1292752655.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-03T17:30:18Z", "content": "For 33 months now, Phoenix, Arizona, has led the nation in home price increases. In the last year alone, the cost of the median house in the area has risen by a third. Over the course of two years, i… [+11890 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Josiah Bates", "title": "A Small Tennessee Town Is at the Center of a Big Lawsuit Involving Race, Power and Money", "description": "A Black town in Tennessee is in the middle of a legal battle against the state comptroller over its very right to exist.", "url": "https://time.com/6172481/mason-tennessee-ford-naacp-lawsuit/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Time-Mason-lawsuit-5-2-22.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-03T17:20:48Z", "content": "In 2021, the small town of Mason, Tenn., got what seemed like good news: a new multibillion-dollar Ford Motor Company plant would open there in 2025.\r\nThe plant, part of Ford’s plan to lean in on ele… [+7185 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Charlie Campbell", "title": "Russia’s Conspiracy-Laden Claims that Israel Is Supporting Neo-Nazis Could Change Tel Aviv’s Stance on the War in Ukraine", "description": "Moscow's top diplomat, Sergei Lavrov, has doubled down on comments about Hitler's 'Jewish blood' and said Israel supports the 'neo-Nazi' regime in Kyiv.", "url": "https://time.com/6172946/sergei-lavrov-hitler-israel-ukraine/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/sergei-lavrov-1.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-03T16:25:37Z", "content": "For a lesson in defending the indefensible, Sergei Lavrov is your man. Russia’s Foreign Minister’s comments broadcast Sunday that Hitler had “Jewish blood” and the “most rabid antisemites tend to be … [+5144 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Brian Bennett", "title": "After Leaked Supreme Court Draft Opinion, Biden Says Access to Abortion Is a ‘Fundamental’ Right", "description": "President Joe Biden issued a forceful defense of access to abortion on Tuesday, saying a woman’s right to choose is “fundamental” and that “basic fairness” demands that Supreme Court not overturn five decades of precedent in an upcoming decision. Biden was re…", "url": "https://time.com/6173002/joe-biden-abortion-fundamental-right/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1395009149.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-03T16:22:08Z", "content": "President Joe Biden issued a forceful defense of access to abortion on Tuesday, saying a woman’s right to choose is “fundamental” and that “basic fairness” demands that Supreme Court not overturn fiv… [+3689 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Nik Popli", "title": "What to Know About the Leaked Roe v. Wade Supreme Court Draft Opinion", "description": "The Supreme Court is preparing to overturn the landmark Roe v. Wade decision that protects the right to an abortion, according to a draft opinion obtained by Politico. The decision could still change before the final decision is released, likely by the end of…", "url": "https://time.com/6173019/supreme-court-leak-roe-v-wade-abortion/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/abortion-roe-v-wade-supreme-court-02.jpg?quality=85&crop=0px%2C213px%2C2400px%2C1257px&resize=1200%2C628&strip", "publishedAt": "2022-05-03T15:35:24Z", "content": "The Supreme Court is preparing to overturn the landmark Roe v. Wade decision that protects the right to an abortion, according to a draft opinion obtained by Politico. \r\nThe decision could still chan… [+5876 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Michael Balsamo / AP", "title": "Trump Settles Suit With DC Over Payments to Hotel for 2017 Inauguration", "description": "The lawsuit alleged Trump’s inaugural committee overpaid for events at the Trump International Hotel to enrich the former president’s family", "url": "https://time.com/6173022/trump-settles-hotel-inauguration/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/trump-settles-hotel-inauguration-3.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-03T15:28:43Z", "content": "WASHINGTON — The District of Columbia attorney general said Tuesday that his office had reached a $750,000 settlement to resolve a lawsuit that alleged former President Donald Trump’s inaugural commi… [+2296 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Michael Tobin / Bloomberg", "title": "Grindr to Cover Gender Affirmation Surgery Costs for Employees", "description": "Grindr will work with healthcare providers to offer the surgery without needing several letters from a psychiatrist", "url": "https://time.com/6173005/grindr-gender-surgery-employees/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/grindr-gender-surgery-employees.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-03T15:23:01Z", "content": "Grindr LLC, the dating app that specializes in connections for the LGBTQ+ community, is rolling out new benefits to support employees seeking gender affirmation surgery, joining other companies that … [+2864 chars]"}]}