{"status": "ok", "totalResults": 29, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Maria Cheng / AP", "title": "Nearly 15 Million Deaths Are Linked to COVID-19, World Health Organization Says", "description": "The World Health Organization estimates that nearly 15 million people were killed by COVID-19 or its impact on overwhelmed health systems.", "url": "https://time.com/6173831/who-covid-19-deaths/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/covid-19-test.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-05T13:57:03Z", "content": "(London) — The World Health Organization estimates that nearly 15 million people were killed either by coronavirus or by its impact on overwhelmed health systems in the past two years, more than doub… [+4940 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Annabel Gutterman", "title": "Renée Elise Goldsberry on Playing an ‘Unapologetically Ambitious’ Diva on Girls5eva", "description": "Growing up, the now Tony-award winning actor Renée Elise Goldsberry often wondered how someone got discovered. She recalls being at the grocery store and thinking about whether she could get noticed there. “It was one of those things that crossed my mind and …", "url": "https://time.com/6173529/renee-elise-goldsberry-girls5eva-season-two-interview/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Renee-Elise-Goldsberry.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-05T12:01:02Z", "content": "Growing up, the now Tony-award winning actor Renée Elise Goldsberry often wondered how someone got discovered. She recalls being at the grocery store and thinking about whether she could get noticed … [+6077 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Edwin Chan / Bloomberg", "title": "Elon Musk Secures $7.1 Billion in New Financing for Twitter", "description": "Elon Musk secured about $7.1 billion from investors including Fidelity, Binance and Lawrence J. Ellison Revocable Trust to buy Twitter", "url": "https://time.com/6173799/elon-musk-twitter-investors/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1395167815.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-05T11:21:33Z", "content": "Elon Musk has secured about $7.1 billion of new financing commitments for his proposed $44 billion takeover of Twitter Inc., the company said in a filing Thursday.\r\nThe commitments come as the Tesla … [+1129 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Shoshana Zuboff", "title": "Democracy Can Still End Big Tech’s Dominance Over Our Lives", "description": "Just two decades ago barely 25% of the world’s information was digital. Today, nothing escapes this web. It is our shared fate and privilege to live at the dawn of information civilization. What kind of future will this be? What legacy will we leave to our ch…", "url": "https://time.com/6173639/democracy-big-techs-dominance-shoshana-zuboff/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1239883438.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-05T11:00:44Z", "content": "Just two decades ago barely 25% of the world’s information was digital. Today, nothing escapes this web. It is our shared fate and privilege to live at the dawn of information civilization. What kind… [+9130 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Nadja Halilbegovich", "title": "The Memories That Sustain Me on Mother’s Day", "description": "I keep replaying my favorite memory of my mother: I was 11 and we were vacationing on the Adriatic coast of Croatia, about a four-hour drive from our hometown of Sarajevo, Bosnia. After spending all day at the beach—swimming, playing cards, and snacking on sy…", "url": "https://time.com/6172363/memories-mom-mothers-day/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/NADJA-HALILBEGOVICH.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-05T11:00:10Z", "content": "I keep replaying my favorite memory of my mother: I was 11 and we were vacationing on the Adriatic coast of Croatia, about a four-hour drive from our hometown of Sarajevo, Bosnia. After spending all … [+5969 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": null, "title": "“Went to Final Exams In the Morning and Gave Birth That Night”: How This Jamaican Lawyer Beat the Odds and Built a Thriving Law Firm - NextAdvisor", "description": "By raising her rates 300%, Jamaican immigrant entrepreneur Dionnie Wynter Pfunde was able to better serve her clients and build a successful business.", "url": "https://time.com/nextadvisor/financial-independence/business-success-story-dionnie-wynter-pfunde/", "urlToImage": "https://time.com/nextadvisor/wp-content/uploads/2022/05/May-Business-Owner-Feature-1-1000x630.jpg", "publishedAt": "2022-05-05T10:30:00Z", "content": "Editorial IndependenceWe want to help you make more informed decisions. Some links on this page clearly marked may take you to a partner website and may result in us earning a referral commission. Fo… [+5810 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Vera Bergengruen", "title": "After Trevor Reed’s Release, Families of American Hostages Demand Biden Meeting", "description": "Alexandra Forseth has made eight pilgrimages to Washington during the past four years. The 30-year-old once again made the trip this week from her home in San Diego to push the White House to secure the release of her father and uncle, who have been imprisone…", "url": "https://time.com/6173655/american-hostages-joe-biden/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/american-hostage-families-01.jpg?quality=85&crop=0px%2C260px%2C2400px%2C1256px&resize=1200%2C628&strip", "publishedAt": "2022-05-05T10:00:14Z", "content": "Alexandra Forseth has made eight pilgrimages to Washington during the past four years. The 30-year-old once again made the trip this week from her home in San Diego to push the White House to secure … [+9796 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Rajesh Kumar Singh / Bloomberg", "title": "India Is Braced for Months of Power Outages Amid a Blistering Heatwave", "description": "A power crisis in India that’s delivering hours-long blackouts, halting manufacturing and triggering protests is set to continue for months.", "url": "https://time.com/6173769/india-heatwave-climate-change-coal/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1240394446.jpg?quality=85&crop=0px%2C0px%2C1024px%2C536px&resize=1200%2C628&strip", "publishedAt": "2022-05-05T06:21:35Z", "content": "A power crisis in India that’s delivering hours-long blackouts, halting manufacturing lines and triggering street protests is forecast to continue for months, adding pressure on the nation’s economic… [+5347 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Sanya Mansoor", "title": "‘When Childhood Is Shattered.’ Samira Ahmed on Writing Fiction Based on Real Incidents of Racism Against Kids", "description": "As editor of her high school newspaper in Batavia, Ill.—a small town about an hour west of Chicago—Samira Ahmed got used to asking tough questions. The paper was where she first thought deeply about flawed notions of objectivity. And it’s part of what influen…", "url": "https://time.com/6173564/samira-ahmed-hollow-fires-interview/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Samira-Ahmed-1.jpg?quality=85&crop=16px%2C136px%2C2384px%2C1247px&resize=1200%2C628&strip", "publishedAt": "2022-05-04T22:00:13Z", "content": "As editor of her high school newspaper in Batavia, Ill.—a small town about an hour west of Chicago—Samira Ahmed got used to asking tough questions. The paper was where she first thought deeply about … [+8255 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Andrew R. Chow", "title": "Bitcoin Is Coming to Your 401(k). But Your Employer Probably Won’t Let You Invest in It", "description": "Fidelity opened the door for a future of crypto retirement savings. But the decision has been met with pushback, including from the U.S. Department of Labor.", "url": "https://time.com/6173458/bitcoin-401k-reitrement/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1146657942.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-04T21:47:39Z", "content": "A version of this article was published in TIME’s newsletter Into the Metaverse. Subscribe for a weekly guide to the future of the Internet.You can find past issues of the newsletter here.\r\nFidelity,… [+4729 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jasmine Aguilera", "title": "Why Judges Are Basically in Charge of U.S. Immigration Policy Now", "description": "When Texas Attorney General Ken Paxton filed a new lawsuit against the Biden Administration last week challenging the allegedly “unlawful” move to grant asylum officers authority to decide some asylum cases, no one was surprised. It’s the 11th immigration-rel…", "url": "https://time.com/6172684/judges-us-immigration-policy/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1393846534.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-04T21:26:49Z", "content": "When Texas Attorney General Ken Paxton filed a new lawsuit against the Biden Administration last week challenging the allegedly “unlawful” move to grant asylum officers authority to decide some asylu… [+9068 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Philip Elliott", "title": "In Ohio, J.D. Vance Thanked Trump for His Win. Maybe Mike DeWine Should Too.", "description": "This article is part of The D.C. Brief, TIME’s politics newsletter. Sign up here to get stories like this sent to your inbox. When J.D. Vance took the stage Tuesday evening in Cincinnati to declare victory in his Senate primary, the best-selling author and fo…", "url": "https://time.com/6173662/jd-vance-trump-ohio-win/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/jd-vance-ohio.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-04T20:47:22Z", "content": "This article is part of The D.C. Brief, TIME’s politics newsletter. Sign up here to get stories like this sent to your inbox.\r\nWhen J.D. Vance took the stage Tuesday evening in Cincinnati to declare … [+7523 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Lev Menand", "title": "The Fed Can’t Fix Our Broken Banking System", "description": "On May 4, 2022, the Federal Reserve announced a plan to reduce the size of its balance sheet. $9 trillion large, and ten times bigger than it was before the 2008 financial crisis, the Fed’s accumulation of assets has helped to lower borrowing costs across the…", "url": "https://time.com/6173486/federal-reserve-broken-banking-system/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1240445157.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-04T20:37:55Z", "content": "On May 4, 2022, the Federal Reserve announced a plan to reduce the size of its balance sheet. $9 trillion large, and ten times bigger than it was before the 2008 financial crisis, the Fed’s accumulat… [+6857 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Olivia B. Waxman", "title": "The History Behind Victory Day in Russia", "description": "The holiday marks the Soviet victory over Nazi Germany in WW II. Now, as Russia's war on Ukraine continues, the day takes on new meaning.", "url": "https://time.com/6173515/russia-victory-day-history/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/victory-day-russia.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-04T19:53:57Z", "content": "Victory Day is always a big holiday in Russia: It marks the Soviet Union’s victory over Nazi Germany in World War II, a conflict during which more than 8 million Soviet soldiers died.\r\nBut this year,… [+4436 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Sean Gregory", "title": "‘Things Are Gonna Get a Lot Worse.’ Female Sports Reporters Are Worried About Elon Musk and Twitter", "description": "Female sports reporters receive high levels of online abuse. With Elon Musk promising more \"free speech\" on Twitter, many are concerned.", "url": "https://time.com/6173205/elon-musk-twitter-female-sports-reporters/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-693210820.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-04T18:21:03Z", "content": "Elon Musk’s $44 billion takeover of Twitter, announced last week, has raised alarms for many marginalized groups often subject to online harassment. Musk has called himself a “free speech absolutioni… [+5718 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eloise Barry", "title": "Russia’s War on Ukraine Is a Threat to Press Freedom, Report Says", "description": "“Journalists and independent media all over the world are at risk right now,” says Zahra Joya, an Afghan journalist who leads an independent platform in the country.", "url": "https://time.com/6173543/world-press-freedom-index-2022/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1240424448.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-04T18:16:07Z", "content": "Journalism is coming under increasingly intense pressure in Ukraine, exacerbated by the war, as press freedom remains restricted in well over two thirds of the world, according to Reporters Without B… [+6712 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Melissa Locker", "title": "Amber Heard Expected to Testify Against Johnny Depp Today", "description": "Amber Heard is expected to take the stand today in her defense in the ongoing defamation suit brought against her by her ex-husband Johnny Depp in March 2019. The high-profile trial, which is being held in Fairfax County, Virginia, is in its fourth week. This…", "url": "https://time.com/6173585/amber-heard-testimony-scheduled-johnny-depp-trial/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1240440853.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-04T17:24:25Z", "content": "Amber Heard is expected to take the stand today in her defense in the ongoing defamation suit brought against her by her ex-husband Johnny Depp in March 2019. The high-profile trial, which is being h… [+1806 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Emily Barone", "title": "If You Want to Know a Country’s Economic Future, Check How Far It Is From the Equator", "description": "It’s no secret that global climate change hurts the economy. With more frequent and more severe storms, flooding, drought, and fires, countries around the world are already taking economic hits. And as long-term events like rising sea levels and temperature p…", "url": "https://time.com/6173536/economic-risk-climate-geography/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1030488208.jpg?quality=85&w=678&h=628&crop=1", "publishedAt": "2022-05-04T17:13:30Z", "content": "It’s no secret that global climate change hurts the economy. With more frequent and more severe storms, flooding, drought, and fires, countries around the world are already taking economic hits. And … [+4461 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "David Miliband", "title": "The Afghan and Ukraine Crises Showed How the U.S. Can Rebuild Its Refugee System", "description": "The historic evacuation of more than 76,000 Afghans from Kabul to safety in the United States beginning last August was one of the few bright spots of the American military withdrawal from Afghanistan. A month on since most of the U.S. government sites housin…", "url": "https://time.com/6171357/us-refugee-system/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/ukraine-refugees-mexico.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-04T14:28:40Z", "content": "The historic evacuation of more than 76,000 Afghans from Kabul to safety in the United States beginning last August was one of the few bright spots of the American military withdrawal from Afghanista… [+5549 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "MARK KENNEDY / AP", "title": "Dolly Parton, Eminem, Lionel Richie Get Into Rock Hall of Fame", "description": "Eminem, Lionel Richie, Carly Simon, Eurythmics, Duran Duran, and Pat Benatar have been inducted into the Rock and Roll Hall of Fame, a list that also includes Dolly Parton, who initially resisted the honor.", "url": "https://time.com/6173516/rock-hall-of-fame-dolly-parton-eminem-lionel-richie/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1386472122.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-04T14:22:36Z", "content": "Eminem, Lionel Richie, Carly Simon, Eurythmics, Duran Duran, and Pat Benatar have been inducted into the Rock &amp; Roll Hall of Fame, a list that also includes Dolly Parton, who initially resisted t… [+1890 chars]"}]}