{"status": "ok", "totalResults": 29, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Melissa Locker", "title": "Kate Moss Expected to Testify in the Defamation Trial Between Johnny Depp and Amber Heard", "description": "Amber Heard’s legal team continued their defense on Monday in the ongoing defamation suit brought by her ex-husband, Johnny Depp. Depp sued Heard for $50 million in 2019, alleging that she defamed him by describing herself as a “public figure representing dom…", "url": "https://time.com/6180467/johnny-depp-amber-heard-experts-testify/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/amber-heard-may-23.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-23T22:33:14Z", "content": "Amber Heard’s legal team continued their defense on Monday in the ongoing defamation suit brought by her ex-husband, Johnny Depp. \r\nDepp sued Heard for $50 million in 2019, alleging that she defamed … [+3676 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Curt Anderson / AP", "title": "Florida Law Regulating Social Media Content Moderation Violates 1st Amendment, Appeals Court Says", "description": "As enacted, the law would give Florida’s attorney general authority to sue companies under the state’s Deceptive and Unfair Trade Practices Act. It would also allow individual Floridians to sue social media companies for up to $100,000 if they feel they’ve be…", "url": "https://time.com/6180435/florida-social-media-law-unconstitutional/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/court-florida-law-social-media.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-23T21:32:11Z", "content": "ST. PETERSBURG, Fla. — A Florida law intended to punish social media platforms like Facebook and Twitter is an unconstitutional violation of the First Amendment, a federal appeals court ruled Monday,… [+4198 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Alice Park", "title": "There’s Already a Monkeypox Vaccine. But Not Everyone May Need It", "description": "Immunizing people against monkeypox likely won’t involve a mass campaign. Instead, experts advocate for a \"ring strategy.\"", "url": "https://time.com/6179429/monkeypox-vaccine/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1209160062.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-23T21:03:31Z", "content": "Case counts of monkeypox continue to grow worldwide, raising concerns about how people can protect themselves. So far, the World Health Organization reports that in 12 countries, 92 cases have been c… [+9869 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Andrew R. Chow", "title": "Halsey Is the Latest Artist Complaining About the Music Industry’s Reliance on TikTok", "description": "The pop star said their label wouldn't let them release a song without creating a \"fake a viral moment on TikTok” first.", "url": "https://time.com/6180377/halsey-tiktok-label/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1389414505.jpg?quality=85&crop=0px%2C16px%2C3984px%2C2085px&resize=1200%2C628&strip", "publishedAt": "2022-05-23T20:42:52Z", "content": "The pop star Halsey lambasted the role of TikTok in modern pop music on Sunday, saying that their label wouldn’t let them release a new song without an accompanying campaign to make it go viral. \r\n“E… [+6403 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jerome Karabel", "title": "The U.S. Failed Miserably on COVID-19. Canada Shows It Didn’t Have to Be That Way", "description": "646,970 lives. This is the number of Americans who would be alive today if the United States had the same per capita death rate from COVID-19 as our northern neighbor, Canada. Reflect for a moment on the sheer magnitude of the lives lost. 646,970 is more than…", "url": "https://time.com/6180309/covid-19-us-canada-differences/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1240756661.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-23T19:34:15Z", "content": "646,970 lives.\r\nThis is the number of Americans who would be alive today if the United States had the same per capita death rate from COVID-19 as our northern neighbor, Canada.\r\nReflect for a moment … [+6977 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Tara Law", "title": "A New Study Explores Why the Gym Can Be a COVID-19 Spreading Hotspot", "description": "COVID-19 has been frustrating for gym rats. Even before scientists knew much about this particular virus, it was pretty clear that breathing heavily in a confined space with lots of other people around doing the same was an easy way to catch a respiratory ill…", "url": "https://time.com/6180385/gym-covid-19-risk-tips/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Exercise-COVID-19.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-23T19:00:30Z", "content": "COVID-19 has been frustrating for gym rats. Even before scientists knew much about this particular virus, it was pretty clear that breathing heavily in a confined space with lots of other people arou… [+4703 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Charlie Campbell", "title": "President Biden’s Vow To Defend Taiwan Is Bold but Incredibly Risky", "description": "Official U.S. policy has always been 'strategic ambiguity' over whether to intervene if China tried to take Taiwan by force.", "url": "https://time.com/6180272/biden-defend-taiwan/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1398764217.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-23T17:06:09Z", "content": "If you want to know when a President goes off-message, look at his aides. And Joe Biden’s national security advisers were all fidgets and carpet-stares when their boss stated Monday that his governme… [+7075 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Clyde W. Ford", "title": "How White Violence Crushed the Progressive Change Formerly Enslaved People Won During Reconstruction", "description": "On Feb. 18, 1868, in Charleston, S.C., Radical Republican Solomon George Washington Dill, known as S.G.W. Dill, rose at South Carolina’s Second Constitutional Convention to offer a resolution that would protect sharecroppers and tenant farmers, including form…", "url": "https://time.com/6171019/reconstruction-black-economic-progress-history/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/reconstruction-black-economic-power-history.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-23T15:28:16Z", "content": "On Feb. 18, 1868, in Charleston, S.C., Radical Republican Solomon George Washington Dill, known as S.G.W. Dill, rose at South Carolina’s Second Constitutional Convention to offer a resolution that wo… [+6468 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Deepa Bharath, Holly Meyer, and David Crary / AP", "title": "Southern Baptist Leaders Stonewalled and Denigrated Sexual Abuse Survivors, Report Finds", "description": "Leaders of the Southern Baptist Convention stonewalled and denigrated survivors of clergy sex abuse to protect their own reputations, according to an investigative report.", "url": "https://time.com/6180269/southern-baptist-convention-sexual-abuse/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Southern-Baptist-Convention-Sexual-Abuse-Report.jpg?quality=85&crop=0px%2C569px%2C4896px%2C2563px&resize=1200%2C628&strip", "publishedAt": "2022-05-23T14:02:21Z", "content": "Leaders of the Southern Baptist Convention, America’s largest Protestant denomination, stonewalled and denigrated survivors of clergy sex abuse over almost two decades while seeking to protect their … [+7608 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Lauran Neergaard / AP", "title": "Pfizer Says 3 COVID-19 Shots Protect Children Under 5", "description": "Three doses of Pfizer’s COVID-19 vaccine offer strong protection for children younger than 5, the company announced.", "url": "https://time.com/6180251/pfizer-covid-19-vaccine-under-5-years/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/vaccine-kids.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-23T13:47:35Z", "content": "Three doses of Pfizer’s COVID-19 vaccine offer strong protection for children younger than 5, the company announced Monday. Pfizer plans to give the data to U.S. regulators later this week in a step … [+3683 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jamey Keaten / Associated Press", "title": "Zelensky Urges ‘Maximum’ Sanctions on Russia in Davos Talk", "description": "President Zelensky called for “maximum” sanctions against Russia during a virtual speech to attendees of the World Economic Forum meeting", "url": "https://time.com/6180213/zelensky-russia-sanctions-davos/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/zelensky-davos.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-23T13:34:38Z", "content": "Ukrainian President Volodymyr Zelensky called for “maximum” sanctions against Russia during a virtual speech Monday to corporate executives, government officials and other elites on the first day of … [+5143 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Some Jif Peanut Butter Products Linked to Salmonella Cases", "description": "Consumers should double-check their jars of Jif peanut butter amid a recall because of potential salmonella contamination.", "url": "https://time.com/6180233/jif-peanut-butter-recall-salmonella/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/peanut-butter.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-23T13:28:51Z", "content": "(Washington D.C.) — Consumers should double-check their jars of Jif peanut butter amid a recall, the Food and Drug Administration and the Centers for Disease Control and Prevention say.\r\nJif’s creamy… [+731 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Raisa Bruner", "title": "N.Y. Will Soon Require Businesses to Post Salaries in Job Listings. Here’s What Happened When Colorado Did It", "description": "Colorado's Equal Pay for Equal Work Act instituted pay transparency standards with wide-ranging effects. New York City plans to follow.", "url": "https://time.com/6179485/pay-transparency-law/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/pay-transparency-laws.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-23T13:00:47Z", "content": "Job hunting can be exhausting and full of unknowns. Over the past year, Alaina, a 31-year-old biotech sales associate in Denver, Colo., started looking at job listings online, but she was able to scr… [+8339 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jamie Ducharme", "title": "Vasectomies Are Going Viral After the Roe v. Wade Leak, But They Aren’t a Solution to Abortion Bans", "description": "For Trevor, a 35-year-old musician in Arizona, the decision to get a vasectomy was easy. He and his wife have long known that they didn’t want children, so the procedure has always been in the back of his mind. But after learning about the U.S. Supreme Court’…", "url": "https://time.com/6178287/vasectomy-sterilization-roe-v-wade/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/vasectomies.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-23T13:00:06Z", "content": "For Trevor, a 35-year-old musician in Arizona, the decision to get a vasectomy was easy. He and his wife have long known that they didn’t want children, so the procedure has always been in the back o… [+10914 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Simmone Shah and Nadia Suleman", "title": "9 Leaders on the 2022 TIME100 Share What Gives Them Hope", "description": "Jeremy Strong, Quinta Brunson, and more leaders from the 2022 TIME100 share what makes them hopeful.", "url": "https://time.com/6179370/leaders-time100-2022-hope/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/T100quotesfeaturedfinal.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-23T11:43:24Z", "content": "It might feel difficult to muster up visions of an optimistic future as the world endures another year marked by crises—from Russia’s invasion of Ukraine to the continuation of the global COVID-19 pa… [+2867 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Simmone Shah", "title": "Mary J. Blige and Miranda Lambert to Perform at the 2022 TIME100 Gala", "description": "Mary J. Blige and Miranda Lambert will perform at the TIME100 gala on June 8, 2022, a celebration of the world's most influential people.", "url": "https://time.com/6179663/time100-gala-mary-j-blige-miranda-lambert/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/MaryJ.Blige-Miranda-Lambert-time100-2022.jpg?quality=85&crop=0px%2C28px%2C2400px%2C1256px&resize=1200%2C628&strip", "publishedAt": "2022-05-23T11:41:29Z", "content": "Mary J. Blige and Miranda Lambert will perform at the 2022 TIME100 gala on Wednesday, June 8, 2022, a celebration of TIME’s annual list of the world’s 100 most influential people.\r\nAfter making a nam… [+1160 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Edward Felsenthal", "title": "How We Chose the 2022 TIME100", "description": "\"Our hope is that the TIME100 list is not simply a recognition of influence but a study in how influence can be wielded,\" writes Edward Felsenthal", "url": "https://time.com/6179626/how-we-chose-time100-2022/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/eddesk-covers-time100-2022.jpg?quality=85", "publishedAt": "2022-05-23T11:41:27Z", "content": "When our team gets together to choose the TIME100, we have one barometer: influence. Who shaped the year? Who stood up? Who stood out? Influence, of course, may be for good or for ill—a dichotomy nev… [+4083 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Josh Boak, Aamer Madhani and Zeke Miller / AP", "title": "Biden Says The U.S. Will Defend Taiwan Militarily If China Attacks", "description": "The U.S. has traditionally avoided making such explicit security guarantees to Taiwan, with which it no longer has a mutual defense treaty.", "url": "https://time.com/6179956/biden-us-defend-taiwan-china/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/bi1.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-23T10:39:07Z", "content": "TOKYO — President Joe Biden said Monday that the U.S. would intervene militarily if China were to invade Taiwan, saying the burden to protect Taiwan is “even stronger” after Russia’s invasion of Ukra… [+4835 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Robert P. Jones", "title": "It’s Time to Stop Giving Christianity a Pass on White Supremacy and Violence", "description": "In the wake of the massacre in Buffalo, we have all, naturally, tried to understand what could have caused someone to commit such a horrific act of violence. This young white man linked his motivations to fears about demographic and cultural changes in the U.…", "url": "https://time.com/6179886/christianity-white-supremacy-buffalo/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1398002674.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-23T10:00:17Z", "content": "In the wake of the massacre in Buffalo, we have all, naturally, tried to understand what could have caused someone to commit such a horrific act of violence. This young white man linked his motivatio… [+6956 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "JOSH BOAK and AAMER MADHANI / AP", "title": "What to Know About the New IPEF Trade Bloc Biden Is Touting In Asia", "description": "The Indo-Pacific Economic Framework (IPEF) is being seen as a way for the U.S. to signal its commitment to remain a leading force in Asia.", "url": "https://time.com/6179936/indo-pacific-economic-framework-ipef/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/b1.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-23T07:52:13Z", "content": "TOKYO — President Joe Biden faced a dilemma on trade in Asia: He couldn’t just rejoin the Trans-Pacific Partnership that his predecessor had pulled the U.S. out of in 2017. Many related trade deals, … [+3870 chars]"}]}