{"status": "ok", "totalResults": 14, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "HOPE YEN / AP", "title": "Arkansas Governor Asa Hutchinson Says 2024 Presidential Bid ‘On the Table’", "description": "Arkansas Gov. Asa Hutchinson said Sunday he is weighing a presidential run in 2024 and his decision won't be affected by whether former President Donald Trump decides to join the race.", "url": "https://time.com/6172475/hutchinson-possible-presidential-bid/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Gov.-.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-01T18:59:30Z", "content": "WASHINGTON — Arkansas Gov. Asa Hutchinson said Sunday he is weighing a presidential run in 2024 and his decision won’t be affected by whether former President Donald Trump decides to join the race.\r\n… [+1938 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "U.S Marshals Offer Reward for Information On Missing Officer and Escaped Inmate", "description": "The U.S. Marshals Service said Sunday that it is offering up to $10,000 for information about an escaped inmate and a “missing and endangered” correctional officer who disappeared Friday after the two left a jail in north Alabama.", "url": "https://time.com/6172471/escaped-inmate-missing-officer/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Wanted.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-01T18:41:46Z", "content": "FLORENCE, Ala. — The U.S. Marshals Service said Sunday that it is offering up to $10,000 for information about an escaped inmate and a “missing and endangered” correctional officer who disappeared Fr… [+2777 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "The Judds and Ray Charles To Be Inducted Into Country Hall of Fame", "description": "The Country Music Hall of Fame will induct Ray Charles and The Judds into its ranks on Sunday night, though the death of Naomi Judd a day earlier will undoubtedly alter the normally celebratory ceremony.", "url": "https://time.com/6172466/the-judds-ray-charles-country-hall-of-fame/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/The-Judds.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-01T17:06:38Z", "content": "NASHVILLE, Tenn. — The Country Music Hall of Fame will induct Ray Charles and The Judds into its ranks on Sunday night, though the death of Naomi Judd a day earlier will undoubtedly alter the normall… [+2598 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Evacuations Underway at Steel Plant in Mariupol", "description": "A long-awaited effort to evacuate people from a steel plant in the Ukrainian city of Mariupol was underway Sunday, the United Nations said, while U.S. House Speaker Nancy Pelosi revealed she visited Ukraine's president to show unflinching American support for…", "url": "https://time.com/6172461/mariupol-steel-plant-evacuation/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/steel-plant.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-01T16:41:16Z", "content": "ZAPORIZHZHIA, Ukraine — A long-awaited effort to evacuate people from a steel plant in the Ukrainian city of Mariupol was underway Sunday, the United Nations said, while U.S. House Speaker Nancy Pelo… [+7642 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Ros Krasny / Bloomberg", "title": "Speaker Nancy Pelosi Meets With Ukraine’s Zelensky in Kyiv", "description": "U.S. House Speaker Nancy Pelosi met Ukraine’s president on Saturday in a previously unannounced visit to Kyiv, telling him that “your fight is a fight for everyone.”", "url": "https://time.com/6172456/pelosi-meets-zelensky-in-ukraine/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Ukraine.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-01T15:10:01Z", "content": "Bloomberg — U.S. House Speaker Nancy Pelosi met Ukraine’s president on Saturday in a previously unannounced visit to Kyiv, telling him that “your fight is a fight for everyone.”\r\nPelosi, second in li… [+2421 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "ELAINE GANLEY / AP", "title": "May Day Rallies in Europe Honor Workers, Protest Governments", "description": "Citizens and trade unions in cities around Europe were taking to the streets on Sunday for May Day marches, and to put out protest messages to their governments, notably in France where the holiday to honor workers was being used as a rallying cry against new…", "url": "https://time.com/6172451/may-day-rallies-europe/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/may-day.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-01T14:34:09Z", "content": "PARIS — Citizens and trade unions in cities around Europe were taking to the streets on Sunday for May Day marches, and to put out protest messages to their governments, notably in France where the h… [+2882 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "KRISTIN M. HALL / AP", "title": "Naomi Judd, of Grammy-winning Duo The Judds, Dies at 76", "description": "Naomi Judd, whose family harmonies with daughter Wynonna turned them into the Grammy-winning country stars The Judds, has died. She was 76.", "url": "https://time.com/6172445/naomi-judd-dies-at-76/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Naomi-Judd.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-01T13:17:20Z", "content": "NASHVILLE, Tenn. — Naomi Judd, whose family harmonies with daughter Wynonna turned them into the Grammy-winning country stars The Judds, has died. She was 76.\r\nHer daughters, Wynonna and Ashley, anno… [+5674 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Ukrainians Plead for Mariupol Rescue as Russian Advance Crawls", "description": "Ukrainian forces fought village by village Saturday to hold back a Russian advance through the country’s east, while the United Nations worked to broker a civilian evacuation from the last defensive stronghold in the bombed-out ruins of the port city of Mariu…", "url": "https://time.com/6172430/ukranians-in-mariupol-rescue-plea/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/Ukraine-2.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-30T19:43:52Z", "content": "KHARKIV, Ukraine — Ukrainian forces fought village by village Saturday to hold back a Russian advance through the country’s east, while the United Nations worked to broker a civilian evacuation from … [+7272 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Bloomberg", "title": "Shanghai’s Covid Measures to Remain Even as Spread Slows", "description": "Shanghai’s measures to stem community spread of Covid will remain in place, even as infections drop and the city reported no new cases outside quarantined areas on Friday for the first time since the recent outbreak started.", "url": "https://time.com/6172424/shanghai-covid-measures/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/Shanghai-2.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-30T17:46:48Z", "content": "Bloomberg — Shanghai’s measures to stem community spread of Covid will remain in place, even as infections drop and the city reported no new cases outside quarantined areas on Friday for the first ti… [+3403 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Philip Elliott", "title": "The Back Booth: A Pandemic, a War Zone, and a Nerd Prom", "description": "Welcome to The Back Booth, a weekend edition of The D.C. Brief. Here each Saturday, TIME’s politics newsletter will host a conversation between political professionals on the right and the left, pulling back the curtain on the conversations taking place in Wa…", "url": "https://time.com/6172391/back-booth-ukraine-correspondents-populism/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/ukraine-refugees-1.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-30T17:00:16Z", "content": "Welcome to The Back Booth, a weekend edition of The D.C. Brief. Here each Saturday, TIME’s politics newsletter will host a conversation between political professionals on the right and the left, pull… [+13693 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Alabama Prison Official Missing After Escorting Inmate", "description": "Assistant Director of Corrections Vicki White disappeared while escorting an inmate being held on capital murder charges", "url": "https://time.com/6172418/alabama-prison-official-missing/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/missing.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-30T16:21:39Z", "content": "A prison official from Alabama is missing after escorting an inmate to a courthouse for a hearing.\r\nThe Lauderdale County Sheriff’s Office said in a Facebook post Saturday that Assistant Director of … [+456 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Suspected Tornado Rips Through Kansas and Causes Severe Damage", "description": "A suspected tornado that barreled through parts of Kansas damaged multiple buildings, injured several people and left more than 6,500 people without power, officials said Saturday.", "url": "https://time.com/6172413/suspected-tornado-rips-through-kansas-and-causes-severe-damage/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/tornado.jpg?quality=85&w=1024&h=547&crop=1", "publishedAt": "2022-04-30T15:20:33Z", "content": "WICHITA, Kan. — A suspected tornado that barreled through parts of Kansas damaged multiple buildings, injured several people and left more than 6,500 people without power, officials said Saturday.\r\nO… [+1512 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "DAVID BRANDT / AP", "title": "Dodgers’ Pitcher Trevor Bauer Suspended for Two Seasons Over Alleged Sexual Assault", "description": "Los Angeles Dodgers pitcher Trevor Bauer was given an unprecedented two-season suspension without pay Friday by Major League Baseball for violating the league's domestic violence and sexual assault policy, a charge he denied.", "url": "https://time.com/6172407/trevor-bauer-alleged-sexual-assault/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/Trevor-Bauer.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-30T14:31:52Z", "content": "Los Angeles Dodgers pitcher Trevor Bauer was given an unprecedented two-season suspension without pay Friday by Major League Baseball for violating the league’s domestic violence and sexual assault p… [+5049 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "By Emma Kinery and Alex Tanzi / Bloomberg", "title": "Biden’s $1.75 Trillion Student Debt Problem by the Numbers", "description": "President Joe Biden is considering forgiving at least $10,000 in student loans per borrower, a promise he made on the campaign trail, through executive action.", "url": "https://time.com/6172402/biden-student-debt-problem/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/debt.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-30T14:14:13Z", "content": "Bloomberg — President Joe Biden is considering forgiving at least $10,000 in student loans per borrower, a promise he made on the campaign trail, through executive action.Here are key data points:\r\n<… [+4526 chars]"}]}