{"status": "ok", "totalResults": 25, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "ANDREW DALTON and JEFF TURNER / AP", "title": "Britney Spears’ Ex, Jason Alexander, Is Being Charged With Stalking", "description": "Once briefly married to Britney Spears, Alexander showed up uninvited at the pop star's wedding to longtime boyfriend Sam Asghari.", "url": "https://time.com/6187360/britney-spears-sam-asghari-jason-alexander-wedding/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1291135403.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-14T10:04:58Z", "content": "VENTURA, Calif. — A man once briefly married to Britney Spears who showed up uninvited at the pop star’s wedding to longtime boyfriend Sam Asghari was charged Monday with felony stalking.\r\nJason Alex… [+2524 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Molly Ball", "title": "How the ‘MAGA Squad’ Is Building Power to Control the Next Congress", "description": "On a Tuesday afternoon in late April, Representative Marjorie Taylor Greene walks into the seventh-floor congressional office belonging to Representative Matt Gaetz, settles into a high-backed black leather chair, and fits a pair of headphones over her blonde…", "url": "https://time.com/6186037/matt-gaetz-marjorie-taylor-greene-maga-house-republicans/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/maga-caucus-greene-gaetz-01.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-14T10:00:43Z", "content": "On a Tuesday afternoon in late April, Representative Marjorie Taylor Greene walks into the seventh-floor congressional office belonging to Representative Matt Gaetz, settles into a high-backed black … [+31636 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Molly Ball", "title": "On the Campaign Trail With Marjorie Taylor Greene", "description": "SOMEWHERE BETWEEN ROME AND TRION, GEORGIA “Well, first of all, it wasn’t my idea,” Marjorie Taylor Greene says brightly to the group of reporters. The polarizing Georgia congresswoman is perched on a seat near the front of a 15-seat minibus packed with the ha…", "url": "https://time.com/6186463/marjorie-taylor-greene-interview-georgia/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/marjorie-taylor-greene-time-01.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-14T10:00:04Z", "content": "SOMEWHERE BETWEEN ROME AND TRION, GEORGIA\r\n“Well, first of all, it wasn’t my idea,” Marjorie Taylor Greene says brightly to the group of reporters. The polarizing Georgia congresswoman is perched on … [+36467 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Kripa Jayaram, Chris Kay and Dan Murtaugh / Bloomberg", "title": "China’s Clean Air Campaign Is Bringing Down Global Pollution", "description": "China reduced air pollution nearly as much in seven years as the US did in thirty, bringing down average global smog levels in the process.", "url": "https://time.com/6187349/china-air-pollution/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1237392669.jpg?quality=85&w=1024&h=603&crop=1", "publishedAt": "2022-06-14T08:12:15Z", "content": "China has reduced air pollution nearly as much in seven years as the US did in three decades, helping to bring down average global smog levels in the process.\r\nThe amount of harmful particulates in t… [+2992 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Lu Wang and Jessica Menton / Bloomberg", "title": "Federal Reserve Terminates the Influencer-Approved Bull Market", "description": "The S&P 500 finished Monday more than 20% below its last record close, ending a two-year bull run among the most powerful ever recorded.", "url": "https://time.com/6187272/federal-reserve-bear-market/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/federal-reserve-terminates-bull-market.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-13T22:16:22Z", "content": "For years, the adage “Don’t fight the Fed” meant only one thing: buy stocks. Now, legions of newbie investors who’ve never had to face inflation before are learning it can mean something else, too.\r\n… [+6532 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eric Cortellessa", "title": "Trump’s Attacks on Mail Voting Bolstered ‘Big Lie,’ Jan. 6 Panel Says", "description": "Despite the pandemic, Trump encouraged his supporters to vote in person, which led to big swings in the reporting of some election results.", "url": "https://time.com/6187273/jan-6-hearing-mail-voting-trump/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/january-6th-hearing-02.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-13T21:46:23Z", "content": "As the Jan. 6 committee held its second public hearing Monday, it focused much of its presentation not on the deadly Capitol attack or former President Donald Trump’s statements that allegedly stirre… [+6863 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Stephanie Zacharek", "title": "Pixar’s Lightyear Offers an Overcomplicated Meta-Backstory for the Manliest Man in the Toybox", "description": "There are a million origin stories in the naked city, and in the toybox too. Now, whether we care or not, we get the backstory of Buzz Lightyear, the disarmingly full of himself he-man space explorer of Pixar’s Toy Story movies, one of the favorite toys of a …", "url": "https://time.com/6187254/lightyear-review/", "urlToImage": "https://api.time.com/wp-content/themes/time2014/img/time-logo-og.png", "publishedAt": "2022-06-13T21:44:02Z", "content": "There are a million origin stories in the naked city, and in the toybox too. Now, whether we care or not, we get the backstory of Buzz Lightyear, the disarmingly full of himself he-man space explorer… [+5458 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Andrew Welsh-huggins And Mark Gillispie/AP", "title": "Ohio Governor Signs Bill Allowing Armed School Employees", "description": "The law, as enacted, requires up to 24 hours of training before an employee can go armed, and up to eight hours of annual training.", "url": "https://time.com/6187227/ohio-governor-bill-armed-school-employees/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/ohio-governor-bill-armed-school-employees.jpg?quality=85&crop=543px%2C303px%2C3489px%2C1827px&resize=1200%2C628&strip", "publishedAt": "2022-06-13T20:04:55Z", "content": "COLUMBUS, Ohio — Ohio school districts could begin arming employees as soon as this fall under a bill signed into law Monday by GOP Gov. Mike DeWine.\r\nThe law, as enacted, requires up to 24 hours of … [+2501 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Brian Bennett", "title": "‘The Mayor Was Definitely Intoxicated’: Jan. 6 Panel Highlights Giuliani Role in Trump’s Election Lie", "description": "In its second hearing, the Jan. 6 Committee worked to show that Trump ignored any advisers telling him what he didn't want to hear.", "url": "https://time.com/6187199/jan-6-hearing-recap-day-two/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/january-6th-hearing.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-13T19:56:50Z", "content": "It was election night at the White House, and Rudy Giuliani was drunk and wanted to talk to the President, according to testimony from Donald Trump’s aides. Giuliani had served as Trump’s personal la… [+5045 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jake Coyle/AP", "title": "Philip Baker Hall, of Hard Eight, Seinfeld, Dies at 90", "description": "The prolific character actor who starred in Paul Thomas Anderson's first movies and who memorably hunted down an overdue library book in “Seinfeld” has died at 90.", "url": "https://time.com/6187221/philip-baker-hall-obituary/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/philip-baker-hall-obituary.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-13T19:36:05Z", "content": "NEW YORK — Philip Baker Hall, the prolific character actor of film and theater who starred in Paul Thomas Anderson’s first movies and who memorably hunted down a long-overdue library book inSeinfeld,… [+4145 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Madeleine Carlisle and Jasmine Aguilera", "title": "Supreme Court Rules Thousands of Immigrants Can Be Detained Indefinitely", "description": "The U.S. Supreme Court ruled on Monday that immigrants detained in the United States are not entitled to a bond hearing, a decision that means that the thousands of people with open immigration cases who are currently in federal holding facilities can continu…", "url": "https://time.com/6187133/supreme-court-immigrants-bond-hearings/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1228648141.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-13T18:03:19Z", "content": "The U.S. Supreme Court ruled on Monday that immigrants detained in the United States are not entitled to a bond hearing, a decision that means that the thousands of people with open immigration cases… [+6270 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jason Reynolds", "title": "Peter Parker Showed Me What an Imperfect Hero Could Be", "description": "When I think of my childhood, I think of all the trappings of the late 1980s and early ’90s—beatable video games, quick-melting Popsicles, dares and double-dares and double-dog-dares. But what was just as present as all these were the color-splashed covers of…", "url": "https://time.com/6186597/spider-man-brother-jason-reynolds/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/spider-man-brother-jason-reynolds.png?w=1200&h=628&crop=1", "publishedAt": "2022-06-13T17:34:00Z", "content": "When I think of my childhood, I think of all the trappings of the late 1980s and early ’90s—beatable video games, quick-melting Popsicles, dares and double-dares and double-dog-dares. But what was ju… [+4686 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Simmone Shah and Photographs and interviews by Andrea Ellen Reed", "title": "Hit Hard By COVID-19, Black Americans Share Their Grief", "description": "Here are the stories of individuals who are trying to move forward without spouses, parents, grandparents, siblings, and children.", "url": "https://time.com/6185064/black-americans-grief-covid-19/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/black-americans-grief-covid-19.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-13T17:09:10Z", "content": "At the start of the COVID-19 pandemic, as hospitals facilitated goodbyes over iPads and funeral homes buried dead without services, families were left with a uniquely isolating grief, devoid of the r… [+13472 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Philip Elliott", "title": "Why the Bipartisan Gun Deal Could Still Fall Apart", "description": "A lot of Washington took a break from their Sunday plans to at least glance at the breaking-news alerts reporting that negotiators in the Senate had seemingly reached a bipartisan deal to combat gun violence. The savvy ones read between the lines—or, in some …", "url": "https://time.com/6187044/gun-deal-democrats-republicans-what-happens-next/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1241163532.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-13T16:56:43Z", "content": "A lot of Washington took a break from their Sunday plans to at least glance at the breaking-news alerts reporting that negotiators in the Senate had seemingly reached a bipartisan deal to combat gun … [+6568 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Simmone Shah", "title": "Amber Heard Speaks for the First Time About the Johnny Depp Verdict", "description": "In her first interview following the verdict of the high-profile defamation trial between Amber Heard and her ex-husband Johnny Depp, Heard called out the social-media frenzy that surrounded the case and said she understood why the jury sided with Depp. “I do…", "url": "https://time.com/6187104/amber-heard-speaks-out-johnny-depp-verdict/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1241042120.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-13T16:31:37Z", "content": "In her first interview following the verdict of the high-profile defamation trial between Amber Heard and her ex-husband Johnny Depp, Heard called out the social-media frenzy that surrounded the case… [+2284 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Ken Sweet/AP", "title": "Bitcoin Plunges As Major Crypto Lender Halts Operations", "description": "Bitcoin and other cryptocurrencies were collapsing in price Monday, after a major crypto lender halted all withdrawals citing “extreme market conditions.”", "url": "https://time.com/6187094/bitcoin-plunges-crypto-operations/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/bitcoin-plunges-crypto-operations.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-13T16:28:48Z", "content": "NEW YORK — Bitcoin and other cryptocurrencies were collapsing in price Monday, after a major crypto lender halted all withdrawals citing “extreme market conditions.”\r\nIt is the second collapse of a p… [+1649 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Matthew Perrone/AP", "title": "Many Baby Formula Plants Weren’t Inspected Because of COVID", "description": "The gap in baby formula plant inspections, brought on by the COVID-19 pandemic, is getting scrutiny from Congress and government watchdogs.", "url": "https://time.com/6187086/baby-formula-inspections-covid/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/baby-formula-inspections-covid.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-13T16:17:42Z", "content": "WASHINGTON — U.S. regulators have historically inspected baby formula plants at least once a year, but they did not inspect any of the three biggest manufacturers in 2020, according to federal record… [+6016 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Rob Gillies / Associated Press", "title": "Canadian PM Trudeau Tests Positive for COVID a Second Time", "description": "Justin Trudeau has tested positive for COVID-19 for the second time and just days after he met in person with U.S. President Joe Biden.", "url": "https://time.com/6187092/trudeau-positive-covid/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1241220917.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-13T16:02:45Z", "content": "Canadian Prime Minister Justin Trudeau has tested positive for COVID-19 for the second time and just days after he met in person with U.S. President Joe Biden.\r\nThe announcement came in a tweet Monda… [+681 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jamie Ducharme", "title": "A New Test Can Help Reveal If You’re Immune to COVID-19", "description": "T-cell testing, along with antibody testing, could help define immunity to COVID-19 and SARS-CoV-2, researchers say.", "url": "https://time.com/6186459/t-cell-testing-covid-19/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/blood-test.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-13T15:20:44Z", "content": "How much protection do you currently have against COVID-19? The answer depends on so much: whether you’ve already had COVID-19 (and if so, how long ago); whether you’ve been vaccinated (and if so, ho… [+3692 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jamie Ducharme", "title": "Why So Many Long COVID Patients Are Reporting Suicidal Thoughts", "description": "Suicide and mental health issues are growing problems among Long COVID patients, and the medical system isn't well equipped to fix them.", "url": "https://time.com/6186429/suicide-long-covid/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/long-covid-mental-health.jpg?quality=85&crop=0px%2C108px%2C2400px%2C1256px&resize=1200%2C628&strip", "publishedAt": "2022-06-13T14:44:04Z", "content": "Last year, Diana Berrent—the founder of Survivor Corps, a Long COVID support group—asked the group’s members if they’d ever had thoughts of suicide since developing Long COVID. About 18% of people wh… [+10806 chars]"}]}