{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Jasmine Aguilera/Uvalde, Texas", "title": "‘There Is an Emptiness.’ Uvalde Shooting Victim Lexi Rubio’s Great-Grandfather Remembers Her 10 Years of Life", "description": "Julian Moreno was in his front yard watering his plants when he heard rapid, loud booms on the morning of May 24. At first, he thought it was noise from nearby construction. But people began screaming and running toward Robb Elementary School, a block away fr…", "url": "https://time.com/6182473/lexi-rubio-uvalde-shooting-victim/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Julian-Moreno-Uvalde-Texas.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-28T22:19:14Z", "content": "Julian Moreno was in his front yard watering his plants when he heard rapid, loud booms on the morning of May 24. At first, he thought it was noise from nearby construction. But people began screamin… [+4570 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "ANNE D'INNOCENZIO / AP", "title": "Air Travelers Face Cancellations Over Memorial Day Weekend", "description": "Airline travelers are not only facing sticker shock this Memorial Day weekend, the kickoff to the summer travel season. They're also dealing with a pileup of flight cancellations.", "url": "https://time.com/6182468/air-travelers-memorial-day-weekend/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/memorial-day.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-28T18:45:25Z", "content": "NEW YORK — Airline travelers are not only facing sticker shock this Memorial Day weekend, the kickoff to the summer travel season. They’re also dealing with a pileup of flight cancellations.\r\nMore th… [+2189 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Russia Fires Its Latest Hypersonic Zircon Missile", "description": "The Russian navy on Saturday conducted another test of a prospective hypersonic missile, a demonstration of the military's long-range strike capability amid the fighting in Ukraine.", "url": "https://time.com/6182463/russia-hypersonic-missiile/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/missile-1.jpg?quality=85&w=1024&h=626&crop=1", "publishedAt": "2022-05-28T18:10:25Z", "content": "MOSCOW — The Russian navy on Saturday conducted another test of a prospective hypersonic missile, a demonstration of the military’s long-range strike capability amid the fighting in Ukraine.\r\nThe Def… [+1238 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Three Women Die in Early Heat Wave in Chicago, Raising Questions and Fears", "description": "Temperatures barely climbed into the 90s and only for a couple of days. But the discovery of the bodies of three women inside a Chicago senior housing facility this month left the city looking for answers to questions that were supposed to be addressed after …", "url": "https://time.com/6182458/chicago-heat-wave-deaths-raise-questions-and-fear/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/heat-wave.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-28T17:43:24Z", "content": "CHICAGO — Temperatures barely climbed into the 90s and only for a couple of days. But the discovery of the bodies of three women inside a Chicago senior housing facility this month left the city look… [+5040 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "CURT ANDERSON / AP", "title": "Judge Gives Initial Approval to $1B Settlement in Florida Condo Collapse That Killed 98", "description": "A Florida judge on Saturday gave initial approval to a settlement of more than $1 billion to families who lost loved ones in the collapse last year of a Florida beachfront condominium building in which 98 people died.", "url": "https://time.com/6182450/florida-condo-collapse-settlement/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Condo-Collapse.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-28T17:09:51Z", "content": "A Florida judge on Saturday gave initial approval to a settlement of more than $1 billion to families who lost loved ones in the collapse last year of a Florida beachfront condominium building in whi… [+2975 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Sean Gregory", "title": "San Francisco Giants Manager Gabe Kapler Won’t Participate In the National Anthem After Uvalde Shooting", "description": "San Franciso Giants manager Gabe Kapler will stay away from the field during the nationa anthem, in protest of the Uvalde school shooting.", "url": "https://time.com/6182419/giants-manager-gabe-kaple-skips-national-anthem/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1399749639.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-28T15:49:37Z", "content": "After the May 24 mass shooting at Robb Elementary School in Uvalde, Texas that killed 19 children and two teachers, the sports world has reacted with indignation. San Francisco Giants manager Gabe Ka… [+3323 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Bloomberg", "title": "Beijing Says COVID-19 Outbreak Under Control as City Eases Curbs", "description": "China’s capital Beijing will loosen mobility curbs in several districts from Sunday after authorities said its outbreak is under control, while total case numbers in the financial hub of Shanghai continued to decline.", "url": "https://time.com/6182437/beijing-covid-outbreak-under-control/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/beijing.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-28T14:24:53Z", "content": "China’s capital Beijing will loosen mobility curbs in several districts from Sunday after authorities said its outbreak is under control, while total case numbers in the financial hub of Shanghai con… [+3239 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Tropical Storm Forms Off Mexico’s Pacific Coast", "description": "Agatha, the first tropical storm of the 2022 hurricane season in the Pacific, formed Saturday off Mexico’s southern coast.", "url": "https://time.com/6182429/tropical-storm-mexico-agatha/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Screen-Shot-2022-05-28-at-10.13.23-AM.png?w=660&h=498&crop=1", "publishedAt": "2022-05-28T14:16:00Z", "content": "MEXICO CITY — Agatha, the first tropical storm of the 2022 hurricane season in the Pacific, formed Saturday off Mexico’s southern coast.\r\nThe U.S. National Hurricane Center said Agatha is expected to… [+859 chars]"}]}