{"status": "ok", "totalResults": 18, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Zahra Nader", "title": "‘We Have to Fight Back.’ Afghan Women Are Losing Their Hard-Won Right to Work Under the Taliban", "description": "'Everybody knows that the Taliban are against women working. We go to work with fear, and we come back home with fear,' one woman tells TIME", "url": "https://time.com/6177133/afghan-women-workforce-challenges-taliban/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/working-afghan-women-02.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-17T10:00:04Z", "content": "Published in partnership with The Fuller Project, a global nonprofit newsroom reporting on issues that affect women.\r\nAfghan teacher Masuma is used to having her clothing scrutinized. The girls’ scho… [+7861 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "NICOLE WINFIELD / AP", "title": "The Vatican Foreign Minister’s Visit to Ukraine Highlights the Delicate Position of the Catholic Church", "description": "The Holy See is caught between maintaining improved ties with the Russian Orthodox Church and offering support to the Ukrainian faithful.", "url": "https://time.com/6177448/vatican-ukraine-catholic-church-war/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1240046030.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-17T09:19:32Z", "content": "VATICAN CITY — The Vatican’s foreign minister, Archbishop Paul Gallagher, is heading to Kyiv this week as the Holy See seeks to balance its concern for Ukrainians with its efforts to keep open a chan… [+3246 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Kim Tong-hyung / AP", "title": "North Korea Reports Another Surge in Fevers Amid COVID-19 Crisis", "description": "North Korea reported another large jump in illnesses believed to be COVID-19 as a mass outbreak spreads through its unvaccinated population.", "url": "https://time.com/6177396/north-korea-covid/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/north-korea-covid.jpeg?quality=85&crop=0px%2C0px%2C5000px%2C2617px&resize=1200%2C628&strip", "publishedAt": "2022-05-17T04:29:15Z", "content": "SEOUL, South Korea — North Korea on Tuesday reported another large jump in illnesses believed to be COVID-19 as a mass outbreak spreads through its unvaccinated population and military medical office… [+4277 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Oleksandr Stashevskyi and Ciaran McQuillan / AP", "title": "Ukraine Says Mission at Mariupol Steel Plant Is Complete", "description": "More than 260 fighters, including some badly wounded, were evacuated and taken to areas under Russia’s control, Ukrainian officials said.", "url": "https://time.com/6177391/ukraine-mariupol-steel-plant/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/mariupol-steel-plant.jpeg?quality=85&w=1024&h=576&crop=1", "publishedAt": "2022-05-17T04:20:43Z", "content": "KYIV, Ukraine — The regiment that doggedly defended a steel mill as Ukraine’s last stronghold in the port city of Mariupol completed its mission Monday after more than 260 fighters, including some ba… [+7910 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Charlotte Alter", "title": "Kathy Barnette Is the Trumpiest Candidate Who Wasn’t Endorsed by Trump", "description": "A few weeks ago, before Kathy Barnette became a true contender to win the Pennsylvania Republican Senate primary, Jackie Kulback, the GOP party chair in Cambria County, had a quick question for the candidate. “I said, ‘Hey, Kathy, somebody’s here and asking m…", "url": "https://time.com/6177232/kathy-barnette-pennsylvania-senate-republican-primary/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Kathy-Barnette-Senate-02.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-17T01:22:00Z", "content": "A few weeks ago, before Kathy Barnette became a true contender to win the Pennsylvania Republican Senate primary, Jackie Kulback, the GOP party chair in Cambria County, had a quick question for the c… [+5549 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Vera Bergengruen", "title": "‘There’s No Such Thing As a Lone Wolf.’ The Online Movement That Spawned the Buffalo Shooting", "description": "The gunman accused of murdering 10 people in a Buffalo supermarket seemed to fit a familiar pattern. Isolated and bored during the pandemic, he had become increasingly radicalized by consuming white-supremacist content online. He had previously threatened a s…", "url": "https://time.com/6177260/buffalo-shooting-online-extremism/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/bufalo-shooting-tops-02.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-17T00:11:38Z", "content": "The gunman accused of murdering 10 people in a Buffalo supermarket seemed to fit a familiar pattern. Isolated and bored during the pandemic, he had become increasingly radicalized by consuming white-… [+5601 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Nik Popli", "title": "How the ‘Great Replacement Theory’ Has Fueled Racist Violence", "description": "The man who opened fire in a Buffalo grocery store on Saturday, killing 10 people, appears to have been motivated by a white nationalist ideology known on dark corners of the web as the “great replacement theory.” The ideology, centered on the baseless belief…", "url": "https://time.com/6177282/great-replacement-theory-buffalo-racist-attacks/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/replacement-theory-charlottesville.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-16T22:44:13Z", "content": "The man who opened fire in a Buffalo grocery store on Saturday, killing 10 people, appears to have been motivated by a white nationalist ideology known on dark corners of the web as the “great replac… [+7307 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eric Cortellessa/Buffalo", "title": "The Buffalo Shooter Targeted a City Haunted by Segregation", "description": "The Tops supermarket on Buffalo’s Jefferson Avenue is surrounded by streets lined with dilapidated houses. Around the corner is a small strip with two barbershops, a nail salon, and a heavily guarded M&T Bank. On most days, this part of town sees little foot …", "url": "https://time.com/6177193/buffalo-mass-shooting-racism-segregation/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/buffalo-history-racism-1.jpg?quality=85&crop=0px%2C143px%2C2400px%2C1256px&resize=1200%2C628&strip", "publishedAt": "2022-05-16T21:50:48Z", "content": "The Tops supermarket on Buffalo’s Jefferson Avenue is surrounded by streets lined with dilapidated houses. Around the corner is a small strip with two barbershops, a nail salon, and a heavily guarded… [+5280 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Sanya Mansoor", "title": "The Lives Lost in a Buffalo Supermarket", "description": "A brave security guard. A breast cancer survivor. A church deacon who drove locals to and from the grocery store. A community advocate who wrote the local newspaper about the need for stronger gun control. These were among the 10 people killed in the racist a…", "url": "https://time.com/6177142/buffalo-shooting-victims/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/buffalo-shooting-victims.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-16T18:59:04Z", "content": "A brave security guard. A breast cancer survivor. A church deacon who drove locals to and from the grocery store. A community advocate who wrote the local newspaper about the need for stronger gun co… [+5383 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Philip Elliott", "title": "News of Fetterman’s Stroke Brought Out the Best in his Senate Rivals. Will it last?", "description": "John Fetterman’s rivals running for a Pennsylvania Senate seat wished him a fast recovery. Such civility in politics is not always the case.", "url": "https://time.com/6177148/john-fetterman-stroke-pennsylvania-primary/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/john-fetterman-senate.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-16T18:52:20Z", "content": "Politics can be a nasty business. Every utterance from a candidate is fair game, even dating back to their teen years. Ask Rep. Alexandria Ocasio-Cortez about the critics who tried to weaponize a vid… [+6457 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Melissa Locker", "title": "As Trial Resumes, Amber Heard Testifies She Knew She Wouldn’t ‘Survive’ If She Didn’t Divorce Johnny Depp", "description": "Jurors in the high-profile trial between Johnny Depp and his ex-wife Amber Heard saw a photo of Heard today with what appear to be bruises on her face. Heard, who is is being sued by her ex-husband Johnny Depp for defamation, returned to the stand after a wee…", "url": "https://time.com/6177143/amber-heard-testimony-survive-johnny-depp/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1240711772.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-16T18:16:47Z", "content": "Jurors in the high-profile trial between Johnny Depp and his ex-wife Amber Heard saw a photo of Heard today with what appear to be bruises on her face. Heard, who is is being sued by her ex-husband J… [+1888 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Kermit Roosevelt III", "title": "The Supreme Court Has Been Engaged in a Rollback of Rights. Abortion Would Just Be the Latest", "description": "The leaked draft of a Supreme Court opinion overruling Roe v. Wade was a shock, but the content of the draft should not have been a surprise. Overruling Roe has been a stated goal of the Republican party, repeated in its presidential platforms in every electi…", "url": "https://time.com/6176168/supreme-court-overturned-rights-history/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1397560961.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-16T18:05:07Z", "content": "The leaked draft of a Supreme Court opinion overruling Roe v. Wade was a shock, but the content of the draft should not have been a surprise. Overruling Roe has been a stated goal of the Republican p… [+7026 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Brian Bennett", "title": "Buffalo Shooting Adds Pressure on Joe Biden to Push for Gun Control Measures", "description": "Joe Biden campaigned on a pledge to “end” America’s gun violence epidemic. The racially-motivated shooting that killed 10 people and injured three at a grocery store in Buffalo, New York on Saturday highlights how far he and the country are from fulfilling th…", "url": "https://time.com/6177079/buffalo-shooting-biden-gun-control/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/biden-buffalo-shooting.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-16T16:48:13Z", "content": "Joe Biden campaigned on a pledge to “end” America’s gun violence epidemic. The racially-motivated shooting that killed 10 people and injured three at a grocery store in Buffalo, New York on Saturday … [+4427 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Ciara Nugent", "title": "Western Architecture is Making India’s Heatwaves Worse", "description": "In the face of climate change, architects are looking to the past to design more resilient buildings", "url": "https://time.com/6176998/india-heatwaves-western-architecture/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/india-traditional-architecture-climate-design.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-16T16:14:26Z", "content": "Benny Kuriakose remembers when his father built the first house in his village in the southern Indian state of Kerala with a concrete roof. It was 1968, and the family was proud to use the material, … [+10794 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "JESSICA GRESKO / AP", "title": "Supreme Court Rules for Ted Cruz in Campaign Finance Case", "description": "(Washington, D.C.) — The Supreme Court’s conservative majority on Monday sided with Republican Sen. Ted Cruz of Texas in his challenge to a provision of federal campaign finance law, in a ruling that a dissenting justice said runs the risk of causing “further…", "url": "https://time.com/6177063/supreme-court-ted-cruz-case/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1396939671.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-16T15:04:22Z", "content": "(Washington, D.C.) — The Supreme Court’s conservative majority on Monday sided with Republican Sen. Ted Cruz of Texas in his challenge to a provision of federal campaign finance law, in a ruling that… [+2299 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Madeleine Carlisle", "title": "Inside the Right-Wing Movement to Ban Trans Youth From Sports", "description": "In the spring of 2020, Idaho became the first state in the United States to ban transgender girls and women from participating in women’s sports. Two years later, fifteen states have enacted similar laws. Trans athletes—particularly trans girls—are now direct…", "url": "https://time.com/6176799/trans-sports-bans-conservative-movement/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/trans-sports-rights.jpg?quality=85&crop=0px%2C138px%2C2400px%2C1257px&resize=1200%2C628&strip", "publishedAt": "2022-05-16T14:57:00Z", "content": "In the spring of 2020, Idaho became the first state in the United States to ban transgender girls and women from participating in women’s sports. Two years later, fifteen states have enacted similar … [+16220 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "KARL RITTER / Associated Press", "title": "Swedish Lawmakers Debate Joining NATO as Attitudes Change", "description": "Sweden's Prime Minister said she sees “a historic change in our country’s security policy line” as the country eyes NATO membership.", "url": "https://time.com/6177005/sweden-nato/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1240704299.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-16T11:36:37Z", "content": "STOCKHOLM — Swedish Prime Minister Magdalena Andersson on Monday told her country’s parliament that she sees “a historic change in our country’s security policy line” as the country prepares to seek … [+2666 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "David Koenig / Associated Press", "title": "McDonald’s to Sell Its Russian Business", "description": "The fast food giant said that holding on to its business in Russia “is no longer tenable, nor is it consistent with McDonald’s values.”", "url": "https://time.com/6177001/mcdonalds-sell-russia-ukraine/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/mcdonalds-moscow-russia.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-16T11:10:37Z", "content": "McDonald’s said Monday that it has started the process of selling its Russian business, which includes 850 restaurants that employ 62,000 people, making it the latest major Western corporation to exi… [+2690 chars]"}]}