{"status": "ok", "totalResults": 35, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Amy Gunia", "title": "The World Braces for Shortages and Higher Prices as Export Giant China Doubles Down on Its Zero-COVID Strategy", "description": "The ongoing lockdowns of Shanghai and other Chinese trading hubs has experts warning of consumer shortages and higher prices.", "url": "https://time.com/6168543/china-zero-covid-shanghai-lockdown-economy-impact/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/GettyImages-1386210247.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-22T10:23:36Z", "content": "Two and a half weeks after extending a partial lockdown into a shutdown of the entire city, Shanghai shows few signs of easing its COVID-19 controls.\r\nOn April 20, nearly half of the 25 million resid… [+4922 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Michael Rubinkam/AP", "title": "Philadelphia Abandons New Indoor Mask Mandate After Backlash", "description": "The city reversed course just days after residents had to start wearing masks again amid a sharp increase in infections.", "url": "https://time.com/6169611/philadelphia-abandons-mask-mandate/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/mask-mandate-philadelphia.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-22T04:30:07Z", "content": "Philadelphia is ending its indoor mask mandate, city health officials said Thursday night, abruptly reversing course just days after people in the city had to start wearing masks again amid a sharp i… [+3706 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Adam Schreck/AP", "title": "Satellite Images Show Possible Mass Graves Near Mariupol", "description": "Mariupol officials accused Russia of burying up to 9,000 Ukrainian civilians there in an effort to conceal the slaughter taking place in the siege of the port city.", "url": "https://time.com/6169602/mariupol-ukraine-mass-graves/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/Mariupol-destruction.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-22T02:40:30Z", "content": "(KYIV, Ukraine) — Satellite images released Thursday showed what appeared to be mass graves near Mariupol, and local officials accused Russia of burying up to 9,000 Ukrainian civilians there in an ef… [+7872 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Nik Popli", "title": "One of Marjorie Taylor Greene’s Primary Challengers is Raking in Republican Cash", "description": "It’s no secret that Georgia Rep. Marjorie Taylor Greene has a rocky relationship with her own party. In February, she earned the ire of Senate Minority Leader Mitch McConnell after she participated in a conference organized by a white nationalist, and in Octo…", "url": "https://time.com/6169563/marjorie-taylor-greene-primary-challenger/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/GettyImages-1239536230.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-21T23:21:27Z", "content": "It’s no secret that Georgia Rep. Marjorie Taylor Greene has a rocky relationship with her own party. In February, she earned the ire of Senate Minority Leader Mitch McConnell after she participated i… [+5467 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jeffrey Kluger", "title": "The Hunt for Life On Jupiter’s Moon Europa Just Got a Little Easier", "description": "Watery pools in Greenland mirror formations on distant Europa, meaning the hunt for life there just got a little easier.", "url": "https://time.com/6169316/europa-life-study/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/Europa.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-21T21:32:04Z", "content": "It’s hard not to love Europa. It is far and away the most promising of Jupiter’s 79 moons, covered in a rind of water ice perhaps 30 km (18 mi.) thick. Beneath the ice lies a salty, globe-girdling oc… [+3078 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Brian Bennett", "title": "Why Joe Biden Launched an Infrastructure Roadshow", "description": "Standing inside the cinder-block walls of the New Hampshire Port Authority in Portsmouth on Tuesday, Joe Biden had just praised the state’s politicians for helping pass last year’s infrastructure bill. He was about to launch into how the bipartisan law invest…", "url": "https://time.com/6169526/joe-biden-infrastructure-polling/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/GettyImages-1239941897.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-21T21:30:49Z", "content": "Standing inside the cinder-block walls of the New Hampshire Port Authority in Portsmouth on Tuesday, Joe Biden had just praised the state’s politicians for helping pass last year’s infrastructure bil… [+4563 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Yvonne Yue Li / Bloomberg", "title": "Elon Musk Wants Lithium For Electric Vehicles, But It’s Hard to Get", "description": "For now, only a handful of countries can supply the material key to the electrification of transportation", "url": "https://time.com/6169475/elon-wants-more-materials-evs/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/elon-wants-more-lithium-evs-2.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-21T20:54:29Z", "content": "Elon Musk wants more lithium, but only a handful of countries can supply the material key to the electrification of transportation, at least for now.\r\nThe Tesla Inc. chief made a public appeal for mo… [+1523 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eliana Dockterman", "title": "9 Podcasts That Were Turned Into TV Shows", "description": "As streaming services proliferate and thousands of new series flood our queues, it’s become increasingly difficult for TV shows to break through the noise. Maybe that’s why television creators have increasingly turned to books, comics, and articles for inspir…", "url": "https://time.com/6168849/podcast-tv-shows/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/gaslit.jpeg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-21T20:46:03Z", "content": "As streaming services proliferate and thousands of new series flood our queues, it’s become increasingly difficult for TV shows to break through the noise. Maybe that’s why television creators have i… [+7726 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Janell Ross/Grand Rapids, Mich.", "title": "‘We Knew It Was Coming.’ Police-Reform Advocates in Grand Rapids, Mich., Had Been Bracing for a Death Like Patrick Lyoya’s", "description": "Some officials find themselves exactly where they long suspected Grand Rapids was headed: in the spotlight after a fatal police shooting.", "url": "https://time.com/6169354/patrick-lyoya-grand-rapids-police-reform/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/grpd.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-21T20:24:34Z", "content": "Brandon Davis occupies what can only be described as a difficult position in Grand Rapids, Mich. He is in charge of a still new office, created in 2019, that is supposed to use its limited powers to … [+13934 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Angela Haupt", "title": "14 Book-to-Screen Adaptations to Catch in 2022", "description": "Book-to-screen adaptations are big this year, giving plenty of fodder to anyone who loves to debate which was better: the book or the movie. From adaptions like, Netflix’s recent Anatomy of a Scandal, based on Sarah Vaughan’s best-selling novel to an upcoming…", "url": "https://time.com/6166698/book-to-screen-adaptations/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/crawdads-e1650570113686.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-21T19:42:38Z", "content": "Book-to-screen adaptations are big this year, giving plenty of fodder to anyone who loves to debate which was better: the book or the movie. From adaptions like Netflix’s recent Anatomy of a Scandal,… [+7503 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Mike Catalini", "title": "Recreational Marijuana Sales Just Started in New Jersey, And Buyers Are Excited", "description": "Dozens of people lined up before dawn for opening day of recreational marijuana sales in New Jersey on Thursday", "url": "https://time.com/6169371/marijuana-sales-nj-excited-buyers/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/cannabis-sales-nj-bring-excited-buyers-2.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-21T19:22:15Z", "content": "BLOOMFIELD, N.J. — Michael Barrows wore his Grateful Dead T-shirt and Jerry Garcia face mask for opening day of recreational marijuana sales in New Jersey on Thursday, one of dozens of people who lin… [+5857 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Nell McShane Wulfhart", "title": "Delta Is the Only Major U.S. Airline Without a Flight Attendant’s Union. That May Soon Change", "description": "When Sara Nelson, president of the Association of Flight Attendants, started to emerge as the most dynamic labor leader in years, issuing calls to arms for workers all over the country, it was newsworthy. The new face of the labor movement was…a flight attend…", "url": "https://time.com/6167848/delta-flight-attendants-union-fight/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/SarahNelson-Flight-Attendants-Labor.jpg?quality=85&crop=350px%2C342px%2C7109px%2C3723px&resize=1200%2C628&strip", "publishedAt": "2022-04-21T17:53:12Z", "content": "When Sara Nelson, president of the Association of Flight Attendants, started to emerge as the most dynamic labor leader in years, issuing calls to arms for workers all over the country, it was newswo… [+5964 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Megan McCluskey", "title": "What It’s Like to Use BeReal, an Instagram Rival That Lets You Post Only Once a Day", "description": "BeReal's bid to boost more genuine and less frequent posting seems to particularly resonate among younger generations.", "url": "https://time.com/6167952/how-be-real-app-works/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/bereal-app-photo-moment.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-21T17:52:12Z", "content": "If you’ve ever wondered what your friends are up to in the middle of a random Tuesday afternoon, then you may want to make an account on BeReal. Known for its once-a-day photo policy, BeReal is an al… [+6436 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Katie Reilly", "title": "Why Michelle Obama’s Brother Is Suing His Kids’ Former School", "description": "Former First Lady Michelle Obama’s brother is suing a Milwaukee private school that his children attended, accusing the school of racial bias and insensitivity toward students of color. Craig Robinson and his wife Kelly say their two sons, aged 9 and 11, were…", "url": "https://time.com/6169105/michelle-obama-brother-milwaukee-lawsuit/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/craig-kelly-robinson-lawsuit.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-21T17:42:21Z", "content": "Former First Lady Michelle Obama’s brother is suing a Milwaukee private school that his children attended, accusing the school of racial bias and insensitivity toward students of color.\r\nCraig Robins… [+3689 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eliza Thompson", "title": "13 Remarkable Sports Documentaries to Stream Right Now", "description": "Even if you’re not an avid sports fan, the appeal of a sports movie is undeniable. Humans achieving remarkable feats of greatness under vast amounts of pressure, usually with an ending that’s at least inspiring if not totally happy—it’s the perfect recipe for…", "url": "https://time.com/6169095/sports-documentaries-to-stream/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/Documentaries1.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-21T17:19:48Z", "content": "Even if you’re not an avid sports fan, the appeal of a sports movie is undeniable. Humans achieving remarkable feats of greatness under vast amounts of pressure, usually with an ending that’s at leas… [+8637 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eloise Barry", "title": "Florida Republicans Want to Punish Disney for Opposing the ‘Don’t Say Gay Law.’ Here’s What That Means for the Company", "description": "Having benefited from limited red tape and exemptions from certain taxes for 55 years within the special taxing district, Disney—and quite possibly local taxpayers—could lose out from the district’s dissolution.", "url": "https://time.com/6169111/disney-district-florida-desantis/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/disney-world-florida.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-21T17:18:23Z", "content": "Florida’s Senate passed a bill this week that would effectively punish Disney for its opposition to the state’s new “Don’t Say Gay” law. The measure proposes to strip the company of protections withi… [+4773 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "CNN+ Shutting Down Only a Month After Launch", "description": "CNN’s brand-new streaming service, CNN+, is shutting down only a month after launch. In a Thursday memo, incoming CNN chief executive Chris Licht said the service would shut down at the end of April. CNN+ launched when its parent was still part of AT&T. It co…", "url": "https://time.com/6169286/cnn-plus-shutting-down/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/GettyImages-1388287539.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-21T16:35:34Z", "content": "CNN’s brand-new streaming service, CNN+, is shutting down only a month after launch.\r\nIn a Thursday memo, incoming CNN chief executive Chris Licht said the service would shut down at the end of April… [+1192 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "BEN FINLEY / AP", "title": "Amber Heard’s Lawyer Focuses on Johnny Depp’s Texts: ‘Let’s Burn Amber’", "description": "Attorneys for actor Amber Heard resumed their cross-examination of her ex-husband Johnny Depp in a Virginia courtroom on Thursday, taking aim at his alcohol and drug use as well as texts he sent to a friend about wanting to kill and defile his then-wife. Hear…", "url": "https://time.com/6169277/amber-heard-johnny-depp-texts-trial/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/GettyImages-1240110101.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-21T16:26:37Z", "content": "Attorneys for actor Amber Heard resumed their cross-examination of her ex-husband Johnny Depp in a Virginia courtroom on Thursday, taking aim at his alcohol and drug use as well as texts he sent to a… [+3766 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Josiah Bates", "title": "David Simon and George Pelecanos on How America Changed Between The Wire and Their New Police Show We Own This City", "description": "Two of the most famous names behind The Wire are back with another story examining the underbelly of law enforcement in Baltimore. David Simon and George Pelecanos, who worked together on the acclaimed 2002–2008 HBO drama, have teamed up for the new HBO Max m…", "url": "https://time.com/6169177/we-own-this-city-david-simon-george-pelecanos-interview/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/crime-tv-evolution-from-the-wire-to-we-one-this-city.jpg?quality=85&crop=0px%2C816px%2C1920px%2C1006px&resize=1200%2C628&strip", "publishedAt": "2022-04-21T16:23:15Z", "content": "Two of the most famous names behind The Wire are back with another story examining the underbelly of law enforcement in Baltimore. David Simon and George Pelecanos, who worked together on the acclaim… [+8156 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Nick Hanauer", "title": "America Gave Up on Overtime—and It’s Costing Workers $35,451 a Year", "description": "If it feels like you’re working longer hours for less money than your parents or grandparents did, it’s because you probably are. Adjusted for inflation, average hourly wages have actually fallen since the early 1970s, while average hours worked have steadily…", "url": "https://time.com/6168310/overtime-pay-history/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/TIME-OVERTIME-FINAL-1.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-21T15:55:56Z", "content": "If it feels like you’re working longer hours for less money than your parents or grandparents did, it’s because you probably are. Adjusted for inflation, average hourly wages have actually fallen sin… [+14048 chars]"}]}