{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "MORGAN LEE and CHRIS MEGERIAN / AP", "title": "Residents’ Fury Over Wildfire Facing President Biden in New Mexico Visit", "description": "SANTA FE, N.M. (AP) — President Joe Biden is focusing on his administration’s efforts to tackle wildfires during Saturday’s visit to New Mexico, where residents are enraged that federal officials allowed planned burns to spread out of control, leading to the …", "url": "https://time.com/6186831/joe-biden-new-mexico-wildfires/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/joe-biden-new-mexico.jpeg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-11T18:31:29Z", "content": "SANTA FE, N.M. (AP) — President Joe Biden is focusing on his administration’s efforts to tackle wildfires during Saturday’s visit to New Mexico, where residents are enraged that federal officials all… [+4197 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jay Reeves / AP", "title": "New York Fund Apologizes for Role in Tuskegee Syphilis Study", "description": "BIRMINGHAM, Ala. (AP) — For almost 40 years starting in the 1930s, as government researchers purposely let hundreds of Black men die of syphilis in Alabama so they could study the disease, a foundation in New York covered funeral expenses for the deceased. Th…", "url": "https://time.com/6186823/milbank-memorial-fund-tuskegee-syphilis-study-apology/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/tuskegee-syphilis-study-new-york-fund.jpeg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-11T18:05:10Z", "content": "BIRMINGHAM, Ala. (AP) — For almost 40 years starting in the 1930s, as government researchers purposely let hundreds of Black men die of syphilis in Alabama so they could study the disease, a foundati… [+6552 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Philip Elliott", "title": "The Back Booth: Even the Republicans Skipping the Jan. 6 Hearings Are Invested in the Outcome", "description": "Welcome to The Back Booth, a weekend edition of The D.C. Brief where we host a conversation between political professionals on the right and the left.", "url": "https://time.com/6186720/jan-6-republicans-trump/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1402027564.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-11T17:00:18Z", "content": "Welcome to The Back Booth, a weekend edition of The D.C. Brief. Here each Saturday, TIME’s politics newsletter will host a conversation between political professionals on the right and the left, pull… [+5549 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Nicole Winfield / AP", "title": "Seven People Killed in Helicopter Crash in Italy", "description": "ROME (AP) — Italian rescuers on Saturday located the bodies of seven people, including four Turkish and two Lebanese businessmen, who died when their helicopter crashed in a heavily forested, mountainous area in north-central Italy during a storm, authorities…", "url": "https://time.com/6186807/italy-helicopter-crash/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/italy-helicopter-crash.jpeg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-11T16:13:52Z", "content": "ROME (AP) — Italian rescuers on Saturday located the bodies of seven people, including four Turkish and two Lebanese businessmen, who died when their helicopter crashed in a heavily forested, mountai… [+2456 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Syawalludin Zain and David Rising / AP", "title": "U.S. Defense Secretary Says China’s Military Activity Around Taiwan Threatens Region", "description": "SINGAPORE (AP) — U.S. Secretary of Defense Lloyd Austin stressed American support for Taiwan on Saturday, suggesting at Asia’s premier defense forum that recent Chinese military activity around the self-governing island threatens to change the status quo. Spe…", "url": "https://time.com/6186796/china-taiwan-lloyd-austin/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/lloyd-austin-china-taiwan.jpeg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-11T15:33:57Z", "content": "SINGAPORE (AP) — U.S. Secretary of Defense Lloyd Austin stressed American support for Taiwan on Saturday, suggesting at Asia’s premier defense forum that recent Chinese military activity around the s… [+5395 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Justin Bieber Says Ramsay Hunt Syndrome Paralyzed Half His Face", "description": "LOS ANGELES (AP) — Justin Bieber says a rare disorder that paralyzed half of the superstar performer’s face is the reason behind his tour postponement. The multi-Grammy winner is suffering from Ramsay Hunt syndrome, he said in video he posted Friday on Instag…", "url": "https://time.com/6186774/justin-bieber-ramsay-hunt-syndrome/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/justin-bieber-ramsay-hunt-syndrome.jpeg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-11T14:05:40Z", "content": "LOS ANGELES (AP) — Justin Bieber says a rare disorder that paralyzed half of the superstar performer’s face is the reason behind his tour postponement.\r\nThe multi-Grammy winner is suffering from Rams… [+978 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Ashraf Khalil / AP", "title": "Thousands Expected to Rally for Gun Reform After Surge in Mass Shootings", "description": "WASHINGTON (AP) — Thousands of protestors are expected to rally in Washington, D.C., Saturday and in separate demonstrations around the country as part of a renewed push for nationwide gun control. Motivated by a fresh surge in mass shootings, from Uvalde, Te…", "url": "https://time.com/6186756/march-for-our-lives-gun-reform/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/march-for-our-lives-gun-reform.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-11T13:04:36Z", "content": "WASHINGTON (AP) — Thousands of protestors are expected to rally in Washington, D.C., Saturday and in separate demonstrations around the country as part of a renewed push for nationwide gun control. M… [+3662 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Average U.S. Gas Price Hits $5 Per Gallon for First Time", "description": "NEW YORK (AP) — The nationwide average price for a gallon of gasoline has topped $5 for the first time ever. Auto club AAA said the average price on Saturday was $5.00. Motorists in some parts of the country, especially California, are paying far above that. …", "url": "https://time.com/6186750/gas-prices-average-us/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/us-gas-prices-top-5-dollars.jpeg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-11T12:45:55Z", "content": "NEW YORK (AP) — The nationwide average price for a gallon of gasoline has topped $5 for the first time ever.\r\nAuto club AAA said the average price on Saturday was $5.00. Motorists in some parts of th… [+1057 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "David S. Brown", "title": "How Andrew Jackson Lost a Presidential Election and Wound up in the White House", "description": "Charges of stolen presidential elections are rare in American history. Only three candidates—Andrew Jackson, Richard Nixon, and Donald Trump—have been associated with such claims. In Nixon’s case, rumors of voting irregularities in the 1960 race against John …", "url": "https://time.com/6186541/andrew-jackson-lost-a-presidential-election-and-and-wound-up-in-the-white-house/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-163274470.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-11T11:05:37Z", "content": "Charges of stolen presidential elections are rare in American history. Only three candidates—Andrew Jackson, Richard Nixon, and Donald Trump—have been associated with such claims. In Nixon’s case, ru… [+4366 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Aubrey Hirsch", "title": "Coming Out to My Kid Helped Me Come Out to Myself", "description": "The first time I said it out loud was to my son. He’d been watching TV and a little cartoon girl was hiding from a little cartoon boy she had a crush on. He asked me, “Mom, when you were a teenager, were you boy-crazy?” He was 6 years old, too young to unders…", "url": "https://time.com/6186255/coming-out-bisexual-essay/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/aubrey-hirsch-featured.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-11T11:00:08Z", "content": "The first time I said it out loud was to my son. He’d been watching TV and a little cartoon girl was hiding from a little cartoon boy she had a crush on. He asked me, “Mom, when you were a teenager, … [+3858 chars]"}]}