{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Philip Elliott", "title": "The Jan. 6 Committee Has Succeeded Far Beyond What Anyone Imagined", "description": "The Jan. 6 committee has won if the goal was to find information that disqualifies Trump from running again.", "url": "https://time.com/6195074/jan-6-committee-unexpected-success/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-1241592925.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-08T14:43:28Z", "content": "This article is part of The D.C. Brief, TIME’s politics newsletter. Sign up here to get stories like this sent to your inbox.\r\nShotgun marriages are tricky.\r\nThey are, by their very nature, rooted in… [+6563 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Alice Park", "title": "Scientists Have a New Tool for Tracking COVID-19 Variants: Human Waste", "description": "Wastewater analysis has become a useful way to monitor COVID-19 surges in specific areas, and researchers can now use it to track variants.", "url": "https://time.com/6194539/wastewater-covid-19-variants/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-1324976482.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-08T14:02:37Z", "content": "PCR and rapid tests aren’t the only places where evidence of SARS-CoV-2 shows up. The virus that causes COVID-19 also turns up in a city’s wastewater, which has become a powerful tool during the pand… [+5268 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Reade Pickert / Bloomberg", "title": "The U.S. Unemployment Rate Held Steady in June Amid Robust Job Market", "description": "U.S. employers added more jobs in June than forecast and the unemployment rate held near a five-decade low", "url": "https://time.com/6195031/us-unemployment-jobs/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-1241076383.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-08T13:01:24Z", "content": "U.S. employers added more jobs in June than forecast and the unemployment rate held near a five-decade low, suggesting hiring needs are so far eclipsing concerns about the economic outlook.\r\nNonfarm … [+2634 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Tara Patel and William Wilkes / Bloomberg", "title": "Two of Europe’s Biggest Airlines Announce New Cancellations", "description": "The Dutch arm of Air France-KLM and Deutsche Lufthansa announced another round of cancellations, adding to summer travel chaos", "url": "https://time.com/6195016/lufthansa-klm-flight-cancellations/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-1241563607.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-08T12:42:15Z", "content": "Two of Europe’s biggest airlines announced another round of cancellations, adding to the disruption turning the travel sector’s pandemic recovery summer into a nightmare.\r\nThe Dutch arm of Air France… [+2239 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Seung Min Kim and Zeke Miller / AP", "title": "Biden To Take Executive Action Amid Pressure to Protect Access to Abortion", "description": "President Joe Biden will take executive action Friday to protect access to abortion, according to three people familiar with the matter.", "url": "https://time.com/6194979/biden-protect-abortion-executive-order/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/abortion-rally.jpeg?quality=85&crop=0px%2C387px%2C6000px%2C3140px&resize=1200%2C628&strip", "publishedAt": "2022-07-08T12:13:27Z", "content": "WASHINGTON — President Joe Biden will take executive action Friday to protect access to abortion, according to three people familiar with the matter, as he faces mounting pressure from fellow Democra… [+2292 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Amy Gunia", "title": "Shinzo Abe Rewrote Japan’s Place in the World. And Remained a Power Broker Until the Very End", "description": "Abe died after being shot on Friday while making a speech during a campaign event. The former PM held an outsized role in Japan’s politics", "url": "https://time.com/6194956/shinzo-abe-dies-assassination-obituary/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-630590200.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-08T11:40:57Z", "content": "When Shinzo Abe, Japan’s longest-serving prime minister, stepped down in 2020, he hadn’t quite achieved what he’d set out to. He resigned due to poor health with dire approval ratings over his govern… [+5730 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Chad de Guzman", "title": "How the World Is Reacting to Shinzo Abe’s Death", "description": "Shinzo Abe died Friday after he was shot during a campaign event. World leaders paid tribute to the former Japanese Prime Minister.", "url": "https://time.com/6194948/shinzo-abe-death-world-leaders-reactions/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/shinzo-abe-assassination-japan.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-08T11:38:23Z", "content": "World leaders paid tribute to former Japanese Prime Minister Shinzo Abe, after he was fatally shot while campaigning for his political allies Friday morning.\r\nRead More: Former Japanese Prime Ministe… [+2823 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Rachel Fleishman", "title": "I’m a Doctor Who Cares for Newborns. I’m Nervous After the End of Roe", "description": "In the wake of the Supreme Court overturning Roe v. Wade, I feel an ominous cloud of governmental reach looming over my work as a neonatologist. Supporting families whose fetuses and babies have severe congenital disabilities—America’s leading cause of infant…", "url": "https://time.com/6194718/newborn-care-after-roe-essay/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/post-roe-neonatalist.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-08T11:30:35Z", "content": "In the wake of the Supreme Court overturning Roe v. Wade, I feel an ominous cloud of governmental reach looming over my work as a neonatologist. Supporting families whose fetuses and babies have seve… [+9096 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Vera Bergengruen", "title": "Armed Demonstrators and Far-Right Groups Are Escalating Tensions at Abortion Protests", "description": "Armed demonstrators and extremist groups have increasingly gathered at abortion-related protests in the aftermath of the Supreme Court’s overturning of Roe v. Wade, causing analysts to warn of a rising threat of violence. Eight abortion-related demonstrations…", "url": "https://time.com/6194085/abortion-protests-guns-violence-extremists/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/abortion-protests-armed-militia-04.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-08T11:00:08Z", "content": "Armed demonstrators and extremist groups have increasingly gathered at abortion-related protests in the aftermath of the Supreme Court’s overturning of Roe v. Wade, causing analysts to warn of a risi… [+8070 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eliana Dockterman", "title": "Why Marvel Movies Are Obsessed With Parent-Child Relationships", "description": "This story contains spoilers for all Marvel movies and television series Marvel movies have become obsessed with parent-child relationships. Recent Marvel Cinematic Universe projects have seen just about every adult superhero step into the role of a mentor or…", "url": "https://time.com/6193759/marvel-young-avengers-parents-kids/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/marvel-movies-partents-kids.jpg?quality=85&crop=0px%2C7px%2C2400px%2C1256px&resize=1200%2C628&strip", "publishedAt": "2022-07-08T10:22:42Z", "content": "This story contains spoilers for all Marvel movies and television series\r\nMarvel movies have become obsessed with parent-child relationships. Recent Marvel Cinematic Universe projects have seen just … [+12914 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eliana Dockterman", "title": "Thor: Love and Thunder Is Proof That the Marvel Cinematic Universe Doesn’t Make Sense Anymore", "description": "After years of successfully, interconnected stories, the Marvel Cinematic Universe feels bloated and aimless. What should Marvel do next?", "url": "https://time.com/6193966/thor-love-and-thunder-marvel-cinematic-universe-future/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/marvel-thor-doctor-strange-black-panther-moon-knight.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-08T10:20:34Z", "content": "The genius of Marvel Studios, at least in the beginning, was that each movie felt like a puzzle piece. Meticulously designed with the next step in mind, each chapter in the Marvel Cinematic Universe … [+16656 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eliana Dockterman", "title": "All the Cameos in Thor: Love and Thunder", "description": "This story contains spoilers for all Marvel movies and television series Thor: Love and Thunder is chock-full of cameos. The movie, helmed by Thor: Ragnarok director Taika Waititi, already stars a number of A-listers, including Chris Hemsworth as Thor, Tessa …", "url": "https://time.com/6193989/thor-love-and-thunder-cameos/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/g_disneyplus_thorloveandthunder_stills_12_07224acb.webp?w=1200&h=628&crop=1", "publishedAt": "2022-07-08T10:04:59Z", "content": "This story contains spoilers for all Marvel movies and television series\r\nThor: Love and Thunder is chock-full of cameos. The movie, helmed by Thor: Ragnarok director Taika Waititi, already stars a n… [+6138 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eliana Dockterman", "title": "The Thor Comics Can Help Us Understand What Happens to Jane After Thor: Love and Thunder", "description": "A closer look at recent Marvel comics give may offer a hint about Jane Foster's fate after the events of Thor: Love and Thunder.", "url": "https://time.com/6193713/jane-foster-thor-love-and-thunder-ending-comics/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/natalie-portman-thor.webp?w=1200&h=628&crop=1", "publishedAt": "2022-07-08T10:02:35Z", "content": "The post contains spoilers for Thor: Love and Thunder\r\nThor Odinson thought his old hammer Mjölnir had been lost forever. In Thor: Ragnarok, the God of Thunder (Chris Hemsworth) fought his evil siste… [+5364 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eliana Dockterman", "title": "Here’s What the Thor: Love and Thunder End-Credits Scenes Mean for the Future of the MCU", "description": "The Marvel movie stingers used to set up the plot for the very next film in the franchise. The end-credits scene for Iron Man gave us our first glimpse at Thor’s hammer before the first Thor movie debuted. The stinger at the end of Captain America featured Ni…", "url": "https://time.com/6193860/thor-love-and-thunder-end-credits-scenes/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/g_disneyplus_thorloveandthunder_stills_5_a25f2c75.webp?w=1200&h=628&crop=1", "publishedAt": "2022-07-08T10:00:18Z", "content": "The Marvel movie stingers used to set up the plot for the very next film in the franchise. The end-credits scene for Iron Man gave us our first glimpse at Thor’s hammer before the first Thor movie de… [+6756 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Amy Gunia and Chad de Guzman", "title": "Former Japanese Prime Minister Shinzo Abe Shot During Campaign Stop. Here’s What We Know So Far", "description": "Former Japanese Prime Minister Shinzo Abe was rushed to the hospital after he was shot on Friday. Here’s what we know so far.", "url": "https://time.com/6194882/shinzo-abe-shot-japan/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/shinzo-abe-japan-prime-minister.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-08T04:04:15Z", "content": "Former Japanese Prime Minister Shinzo Abe was shot on Friday in the city of Nara in western Japan, according to local media. Abe, who was rushed to the hospital, is showing no vital signs, the local … [+1676 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Darlene Superville / AP", "title": "President Biden Awards Medal of Freedom to Simone Biles, John McCain and 15 Others", "description": "Biden awarded the Presidential Medal of Freedom to 17 people, including Simone Biles, the late John McCain, Megan Rapinoe and Denzel Washington.", "url": "https://time.com/6194873/biden-medal-of-freedom-biles-mccain/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/biden-simone-biles-medal-freedom.jpeg?quality=85&crop=0px%2C43px%2C5494px%2C2876px&resize=1200%2C628&strip", "publishedAt": "2022-07-08T01:42:00Z", "content": "WASHINGTON — President Joe Biden on Thursday presented the nation’s highest civilian honor, the Presidential Medal of Freedom, to 17 people, including gymnast Simone Biles, the late John McCain, the … [+6471 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Madeleine Carlisle and Abigail Abrams", "title": "Does Religious Freedom Protect a Right to an Abortion? One Rabbi’s Mission to Find Out", "description": "When Florida passed a law this spring that bans most abortions after 15 weeks of pregnancy, Rabbi Barry Silver was furious. And when it looked like the Supreme Court was likely to overturn Roe v. Wade, which would allow such bans to take effect, he decided he…", "url": "https://time.com/6194804/abortion-religious-freedom-judaism-florida/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/abortion-religious-freedom-Judaism-florida-1.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-07T22:51:53Z", "content": "When Florida passed a law this spring that bans most abortions after 15 weeks of pregnancy, Rabbi Barry Silver was furious. And when it looked like the Supreme Court was likely to overturn Roe v. Wad… [+9743 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jeffrey Kluger", "title": "Americans Still Disagree on Practically Everything About COVID-19", "description": "Since COVID-19 first began spreading in the U.S., Americans have disagreed about the national pandemic response, arguing over everything from vaccines to masks, home schooling to quarantining. Now, a new survey by the Pew Research Center suggests that little …", "url": "https://time.com/6194568/americans-divided-covid-19-vaccines-masks-survey/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/Flag-and-masks.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-07T21:18:04Z", "content": "Since COVID-19 first began spreading in the U.S., Americans have disagreed about the national pandemic response, arguing over everything from vaccines to masks, home schooling to quarantining. Now, a… [+4542 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eric Cortellessa", "title": "How a First-Time British Director Scored Unprecedented Access to the End of Trump’s Presidency", "description": "Holder's documentary 'Unprecedented' has drawn interest over the last month, after the Jan. 6 committee interviewed him and subpoenaed him for all of his Trump footage.", "url": "https://time.com/6194550/alex-holder-trump-unprecedented-interview/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/alex-holder-trump-unprecedented-interview.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-07T20:56:46Z", "content": "On Dec. 7, 2020, Alex Holder found himself face-to-face with President Donald Trump at a watershed moment in U.S. history. Trump had clearly lost his bid for re-election; dozens of lawsuits challengi… [+10321 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Joel Rosenblatt / AP", "title": "Theranos Ex-President Balwani Found Guilty of Fraud", "description": "Ramesh “Sunny” Balwani, the former president of Theranos and ex-boyfriend of its founder Elizabeth Holmes, was found guilty of fraud.", "url": "https://time.com/6194731/theranos-sunny-balwani-guilty-fraud/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/Theranos-ex-president-balwani-guilty-fraud.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-07T20:55:01Z", "content": "Ramesh “Sunny” Balwani, the former president of Theranos Inc. and ex-boyfriend of its founder Elizabeth Holmes, was found guilty of fraud for his role in the collapse of the $9 billion blood-testing … [+3963 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Steve Karnowski / AP", "title": "Derek Chauvin Gets 21 Years in Federal Prison for George Floyd Civil Rights Charges", "description": "A federal judge on Thursday told the former Minneapolis police officer that what he did was “simply wrong” and “offensive.”", "url": "https://time.com/6194760/derek-chauvin-federal-charges-george-floyd/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/chauvin-civil-rights-george-floyd.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-07T20:54:40Z", "content": "ST. PAUL, Minn. — A federal judge on Thursday sentenced Derek Chauvin to 21 years in prison for violating George Floyd’s civil rights, telling the former Minneapolis police officer that what he did w… [+2019 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Lindsey Bahr / AP", "title": "James Caan, Oscar Nominee For The Godfather Dies at 82", "description": "James Caan's manager Matt DelPiano said he died on Wednesday. No cause was given.", "url": "https://time.com/6194657/james-caan-obituary/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/james-caan-obituary.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-07T18:58:25Z", "content": "James Caan, the curly-haired tough guy known to movie fans as the hotheaded Sonny Corleone of “The Godfather” and to television audiences as both the dying football player in the classic weeper “Bria… [+2993 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Sandra Lindsay", "title": "I Was the First Person in America to Get a COVID-19 Vaccine. It Taught Me a Powerful Lesson", "description": "I was always ready to say yes to the COVID-19 vaccine. I’d been following its development from the very beginning of the pandemic and said, again and again, that I’d happily get vaccinated. Working in critical care during the first deadly wave of the virus, m…", "url": "https://time.com/6194500/first-person-covid-19-vaccine-us-essay/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/sandra-lindsay-first-covid-vaccine-oped.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-07T18:22:06Z", "content": "I was always ready to say yes to the COVID-19 vaccine. I’d been following its development from the very beginning of the pandemic and said, again and again, that I’d happily get vaccinated. Working i… [+2912 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eloise Barry / London", "title": "Here’s How a New U.K. Prime Minister Will Be Selected", "description": "Here's what happens when Boris Johnson departs and how his successor will be chosen.", "url": "https://time.com/6194432/uk-prime-minister-selection-process/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-1241757326.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-07T17:13:18Z", "content": "British Prime Minister Boris Johnson’s premiership is coming to an end, he announced Thursday, as a wave of resignations in his cabinet left his position as leader untenable. \r\nSexual misconduct alle… [+5385 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Sean Gregory", "title": "Where Brittney Griner’s Case Goes From Here, and What It Will Take to Bring Her Home", "description": "WNBA star Brittney Griner pleaded guilty to drug charges in a Russian court. A prisoner swap with a Russian arms dealer could be her best chance at coming home.", "url": "https://time.com/6193885/brittney-griner-prisoner-swap-biden-russia/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-1241752988-2.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-07T17:06:00Z", "content": "Brittney Griner and her family have ratcheted up the pressure on the U.S. government to free her from wrongful detention in Russia. And though the WNBA star has pleaded guilty to drug charges in a Mo… [+9923 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Justin Worland", "title": "Everything You’re Hearing About Gas Prices is Wrong", "description": "Who’s responsible for the high gas prices that have taken hold across the U.S.? Common explanations are often half truths.", "url": "https://time.com/6194505/gas-prices-biden-republicans/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/us-gas-prices-top-5-dollars.jpeg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-07T16:51:29Z", "content": "Who’s responsible for the high gas prices that have taken hold across the U.S.? If you listen to your average Republican, you’ll hear blame placed on the energy and climate policies of the Biden Admi… [+6592 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Julia Fine", "title": "What a 4-Year-Old Saw at the Highland Park Mass Shooting", "description": "At school on Friday, July 1, 4 1/2-year-old Liora drew four white crayon figures on black paper, smiling beneath a neon firework display. This was a picture of her family—Liora, her mother, her father, and her 2-year-old brother—at the Highland Park July 4th …", "url": "https://time.com/6194405/highland-park-shooting-witness-four-year-old-essay/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/highland-park-mass-shooting-witness-four-year-old.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-07T16:51:07Z", "content": "At school on Friday, July 1, 4 1/2-year-old Liora drew four white crayon figures on black paper, smiling beneath a neon firework display. This was a picture of her family—Liora, her mother, her fathe… [+4610 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jamie Ducharme and Tara Law", "title": "Doctors in Anti-Abortion States Now Have No Idea When They’re Allowed to Save a Pregnant Person’s Life", "description": "In states that allow abortion only when the mother's life is at risk, doctors face difficult choices about when to provide abortion care.", "url": "https://time.com/6194397/abortions-lifesaving-ectopic-pregnancy/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/sonogram.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-07T15:03:30Z", "content": "One of the first patients emergency medicine physician Dr. Taylor Nichols ever treated on his own was a woman who had an ectopic pregnancy—a dangerous condition in which a fertilized egg grows outsid… [+9837 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Judy Berman", "title": "Moonhaven Is the Smart, If Slightly Silly, Sci-Fi Thriller You’ve Been Waiting For", "description": "The new AMC+ thriller takes place in a utopian moon colony tasked with saving humans on a blighted Earth", "url": "https://time.com/6194202/moonhaven-review-amc-plus/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/MH_104_SL_1310_0052_RT.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-07T14:30:54Z", "content": "Why would a person ever willingly leave utopia? For the citizens of Moonhaven, a verdant, peaceful community nestled in 500 square miles of the moon, the answer is: in order to save the world. The ye… [+6145 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jim Heintz / AP", "title": "Brittney Griner Pleads Guilty in Drug Trial, Russian Media Reports", "description": "News reports quoted Griner as pleading guilty to the charges at Thursday’s court hearing. They said that Griner said she had acted unintentionally because she was packing in haste.", "url": "https://time.com/6194411/brittney-griner-pleads-guilty-russia/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/brittney-griner-pleads-guilty-russia.jpg?quality=85&crop=0px%2C0px%2C1024px%2C536px&resize=1200%2C628&strip", "publishedAt": "2022-07-07T14:30:14Z", "content": "MOSCOW — Russian news agencies say jailed American basketball star Brittney Griner has pleaded guilty to drug possession and smuggling charges during her trial in Moscow.\r\nThe reports quoted Griner a… [+5460 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Isabel Debre / AP", "title": "U.K. Warship Seizes Advanced Iranian Missiles Bound for Yemen", "description": "A British Royal Navy vessel seized a sophisticated shipment of Iranian missiles in the Gulf of Oman earlier this year, officials said.", "url": "https://time.com/6194378/iran-missiles-yemen/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-1241361271.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-07T13:00:43Z", "content": "A British Royal Navy vessel seized a sophisticated shipment of Iranian missiles in the Gulf of Oman earlier this year, officials said Thursday, pointing to the interdiction as proof of Tehran’s suppo… [+3257 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Maria Grazia Murru and Oleksandr Stashevskyi / AP", "title": "Russia Taking ‘Operational Pause’ in Ukraine, Analysts Say", "description": "Foreign analysts say Russia may be temporarily easing its offensive in Ukraine.", "url": "https://time.com/6194371/russia-operational-pause-ukraine/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-1241732177.jpg?quality=85&w=1024&h=576&crop=1", "publishedAt": "2022-07-07T12:38:28Z", "content": "Foreign analysts say Russia may be temporarily easing its offensive in Ukraine as the Russian military attempts to reassemble its forces for a renewed assault.\r\nOn Wednesday, Russian forces made no c… [+5475 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Amy Gunia", "title": "Biden Is Reportedly Considering Lifting Trump-Era Tariffs on Chinese Goods. Could That Help Tame U.S. Inflation?", "description": "The White House appears to be split on whether or not to list Trump-era tariffs on Chinese goods. Could lifting tariffs help tame inflation?", "url": "https://time.com/6193925/us-china-tariffs-inflation/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/biden-inflation.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-07T11:14:05Z", "content": "American consumers are feeling the pinch, with prices of everything from gas to eggs to cars on the rise. There are myriad reasons for the inflation—which hit a 40-year high in June—and President Joe… [+5554 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Simon Shuster/Kyiv", "title": "Ukraine’s First Lady Olena Zelenska Takes On the Trauma Of War", "description": "Olena Zelenska, the First Lady of Ukraine, got to bed late on the eve of the Russian invasion. Her kids were long asleep in the presidential residence south of Kyiv, a vast mansion of yellow stone that the family had always found a bit too grand, bordering on…", "url": "https://time.com/6194177/olena-zelenska-ukraine-first-lady-interview/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/olena-zelenska-time-interview-06-.jpg?quality=85&crop=0px%2C375px%2C1800px%2C942px&resize=1200%2C628&strip", "publishedAt": "2022-07-07T09:00:42Z", "content": "Olena Zelenska, the First Lady of Ukraine, got to bed late on the eve of the Russian invasion. Her kids were long asleep in the presidential residence south of Kyiv, a vast mansion of yellow stone th… [+13965 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "SYLVIA HUI and DANICA KIRKA / AP", "title": "Embattled U.K. Prime Minister Boris Johnson Agrees to Resign", "description": "U.K. Prime Minister Boris Johnson has agreed to resign, his office said, ending an unprecedented political crisis over his future.", "url": "https://time.com/6194315/boris-johnson-agrees-to-resign/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-1241730267-1.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-07T08:46:54Z", "content": "U.K. Prime Minister Boris Johnson has agreed to resign, his office said Thursday, ending an unprecedented political crisis over his future that has paralyzed Britain’s government.\r\nAn official in Joh… [+3627 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Emily Wagster Pettus / AP", "title": "Scramble as Last Mississippi Abortion Clinic Shuts Its Doors", "description": "Physicians at Jackson Women’s Health Organization have been trying to see as many patients as possible before Thursday, when Mississippi will enact a law to ban most abortions.", "url": "https://time.com/6194299/mississippi-abortion-clinic-pink-house-closes/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/mississippi-abortion-clinic.jpeg?quality=85&crop=0px%2C106px%2C3281px%2C1717px&resize=1200%2C628&strip", "publishedAt": "2022-07-07T08:20:26Z", "content": "JACKSON, Miss. — Mississippi’s only abortion clinic has been buzzing with activity in the chaotic days since the U.S. Supreme Court upended abortion rights nationwide — a case that originated in this… [+5954 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Aya Batrawy/AP", "title": "Inflation After Ukraine War Pushes 71 Million More Into Poverty in 3 Months", "description": "Soaring food and energy prices climbed in the weeks following Russia's invasion of Ukraine, the United Nations Development Program said.", "url": "https://time.com/6194295/ukraine-war-inflation-pandemic-poverty/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/i1.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-07T08:18:24Z", "content": "DUBAI, United Arab Emirates — A staggering 71 million more people around the world are experiencing poverty as a result of soaring food and energy prices that climbed in the weeks following Russia’s … [+3492 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Bloomberg", "title": "Musk Reportedly Fathered Twins With a Neuralink Executive Last Year", "description": "The two babies would bring Musk’s total known children to nine. He has advocated for increasing the population as part of his vision for colonizing other planets.", "url": "https://time.com/6194287/musk-twins-neuralink-executive/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/musk-twins-neuralink.jpeg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-07T05:24:40Z", "content": "Billionaire Elon Musk is the father of eight-month-old twins born to a senior executive at his artificial intelligence startup Neuralink, Insider reported, citing a court document.\r\nMusk and the exec… [+607 chars]"}]}