{"status": "ok", "totalResults": 9, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "BHARATHA MALLAWARACHI / AP", "title": "Amid Protests, Sri Lanka’s Acting President Declares a State of Emergency", "description": "Ranil Wickremesinghe’s move comes as protests demanding his resignation have erupted in most parts of the country.", "url": "https://time.com/6198241/sri-lanka-state-of-emergency/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-1241930129.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-18T05:11:06Z", "content": "COLOMBO, Sri Lanka — Sri Lanka’s acting president on Monday declared a state of emergency giving him broad authority amid growing protests demanding his resignation two days before the country’s lawm… [+2584 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "3 Dead in Another Mall Shooting, This Time in Indiana. Witness Kills Gunman", "description": "Three people were fatally shot and two were injured Sunday evening at an Indiana mall after a man with a rifle opened fire in a food court.", "url": "https://time.com/6198231/indiana-mall-shooting-greenwood-gunman/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/s1-1.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-18T03:51:20Z", "content": "GREENWOOD, Indiana — Three people were fatally shot and two were injured Sunday evening at an Indiana mall after a man with a rifle opened fire in a food court and an armed civilian shot and killed h… [+2052 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Jennifer Lopez and Ben Affleck Have Been Married in a Las Vegas Drive-Through Wedding", "description": "The two were wed Saturday in a late-night Las Vegas drive-through chapel, culminating a relationship that stretched over two decades.", "url": "https://time.com/6198224/jennifer-lopez-ben-affleck-married/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/AP22198691066884.jpg?quality=85&crop=0px%2C0px%2C4288px%2C2245px&resize=1200%2C628&strip", "publishedAt": "2022-07-18T01:48:06Z", "content": "NEW YORK — Jennifer Lopez and Ben Affleck were wed Saturday in a late-night Las Vegas drive-through chapel, culminating a relationship that stretched over two decades in two separate romances and hea… [+1918 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "HANNA ARHIROVA and CARA ANNA / AP", "title": "Ukraine’s Zelensky Fires Top Security Chief and Prosecutor", "description": "As Russia's military pressed its efforts to expand into Ukraine's east, Ukrainian President Volodymyr Zelensky fired the head of the country’s security service and its prosecutor general on Sunday, citing hundreds of criminal proceedings into treason and coll…", "url": "https://time.com/6198213/zelensky-fires-top-security-chief-and-prosecutor/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/crater-1.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-17T21:28:46Z", "content": "VINNYTSIA, Ukraine — As Russia’s military pressed its efforts to expand into Ukraine’s east, Ukrainian President Volodymyr Zelensky fired the head of the country’s security service and its prosecutor… [+6214 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "4 Dead After Sheriff’s Office Helicopter Crash in New Mexico", "description": "Four people have been killed in a crash of a Bernalillo County Sheriff’s Office helicopter that was headed back to Albuquerque after assisting firefighters in another New Mexico city, authorities said Sunday.", "url": "https://time.com/6198191/helicopter-crash-new-mexico-sheriff/", "urlToImage": "https://api.time.com/wp-content/uploads/2020/08/chicago-shootings-august-july-2020.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-17T19:09:09Z", "content": "LAS VEGAS, N.M. — Four people have been killed in a crash of a Bernalillo County Sheriff’s Office helicopter that was headed back to Albuquerque after assisting firefighters in another New Mexico cit… [+1588 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Bloomberg", "title": "Europe Counts Cost of Wildfires as Thousands Have to Evacuate", "description": "Thousands of people have been forced to flee their homes across Europe as deadly wildfires sparked by soaring temperatures burn down swathes of woodland and threaten to destroy homes.", "url": "https://time.com/6198180/europe-wildfires-evacuation/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/France.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-17T18:04:24Z", "content": "Bloomberg — Thousands of people have been forced to flee their homes across Europe as deadly wildfires sparked by soaring temperatures burn down swathes of woodland and threaten to destroy homes.\r\nFi… [+4433 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Time", "title": "Uvalde Families to Receive New Report on Police Failures", "description": "Uvalde families awaited a new report Sunday that was expected to outline police failures in the May school shooting that left 19 children and two teachers dead, after weeks of conflicting and inaccurate statements from authorities surrounding why law enforcem…", "url": "https://time.com/6198172/uvalde-families-to-receive-new-report-on-police-failures/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/Uvalde-1.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-17T16:50:51Z", "content": "UVALDE, Texas — Uvalde families awaited a new report Sunday that was expected to outline police failures in the May school shooting that left 19 children and two teachers dead, after weeks of conflic… [+2255 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "ARLEIGH RODGERS / Associated Press", "title": "Indiana Doctor’s Lawyer Sends Cease and Desist Letter to State’s Attorney General", "description": "A lawyer on Friday emailed the Indiana state's attorney general asking him to stop spreading false or misleading information about an Indianapolis doctor who performed an abortion in June on a 10-year-old rape victim from Ohio.", "url": "https://time.com/6198158/doctors-lawyer-sends-cease-and-desist-letter-attorney-general/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/CB.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-17T14:39:01Z", "content": "INDIANAPOLIS — A lawyer on Friday emailed the Indiana state’s attorney general asking him to stop spreading false or misleading information about an Indianapolis doctor who performed an abortion in J… [+2711 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Abigail Abrams", "title": "Planned Parenthood CEO Discusses The Post-Roe Fight For Abortion Access–And The “Opportunity To Reimagine… Something Better”", "description": "When the Supreme Court released its decision overturning Roe v. Wade on June 24, Alexis McGill Johnson was ready. As president and CEO of Planned Parenthood, she had been warning of this outcome long before a leaked draft of the Court’s opinion was published …", "url": "https://time.com/6197987/planned-parenthood-ceo-discusses-the-post-roe-fight-for-abortion-access-and-the-opportunity-to-reimagine-something-better/", "urlToImage": "https://api.time.com/wp-content/uploads/2020/12/Alexis-McGill-Johnson-planned-parenthood.jpg?quality=85&crop=4px%2C76px%2C3872px%2C2026px&resize=1200%2C628&strip", "publishedAt": "2022-07-17T11:00:19Z", "content": "When the Supreme Court released its decision overturning Roe v. Wade on June 24, Alexis McGill Johnson was ready. As president and CEO of Planned Parenthood, she had been warning of this outcome long… [+16978 chars]"}]}