{"status": "ok", "totalResults": 35, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Andrew R. Chow", "title": "Here’s Why Bitcoin and Other Cryptocurrencies Keep Crashing", "description": "The current slide of Bitcoin and other cryptocurrencies is being caused by a combination of short-term and long-term factors.", "url": "https://time.com/6175370/why-bitcoin-crashing/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1326414122.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-10T21:55:28Z", "content": "Bitcoin took a brutal fall on Monday, briefly dipping below $30,000 for the first time since July 2021. The world’s largest cryptocurrency is now worth less than half of what it was in the fall. Othe… [+6106 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Abby Vesoulis", "title": "How a Digital Abortion Footprint Could Lead to Criminal Charges—And What Congress Can Do About It", "description": "Getting away with breaking the law in the digital age is tricky. Almost everything one does—whether it’s making a Google search for “how to clean up a crime scene,” purchasing suspicious items on Amazon, or merely having been in the proximity of a crime scene…", "url": "https://time.com/6175194/digital-data-abortion-congress/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1238295954.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-10T20:20:56Z", "content": "Getting away with breaking the law in the digital age is tricky. Almost everything one does—whether it’s making a Google search for “how to clean up a crime scene,” purchasing suspicious items on Ama… [+9039 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eloise Barry", "title": "Why It’s So Hard to Find Baby Formula in the U.S. Right Now", "description": "A nationwide shortage has left parents scouring social media or crossing states to get hold of baby formula.", "url": "https://time.com/6175211/baby-formula-shortage/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/baby-formula-shortage.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-10T20:08:41Z", "content": "Parents across the U.S. have been scouring social media or crossing states to get hold of baby formula amid a national shortage driven by ongoing pressure on supply chains. \r\nThe crisis has worsened … [+4873 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Philip Marcelo / AP", "title": "Celebrity Chef Mario Batali Acquitted of Sexual Misconduct Charges by Judge", "description": "Batali’s accuser recounted in court how the former Food Network personality aggressively kissed and groped her. But, a judge agreed with defense claims that she had credibility problems.", "url": "https://time.com/6175357/mario-batali-acquitted-sexual-misconduct/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/celebrity-chef-batali-acquitted.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-10T19:00:41Z", "content": "BOSTON — Mario Batali was found not guilty of indecent assault and battery on Tuesday, following a swift trial in which the celebrity chef waived his right to have a jury decide his fate.\r\nBatali, wh… [+2816 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Matt O'Brien and Kelvin Chan / AP", "title": "Musk Says He Would Reverse Twitter’s Ban of Donald Trump", "description": "Elon Musk said Twitter’s Trump ban was a “morally bad decision” and “foolish in the extreme.”", "url": "https://time.com/6175320/musk-reverse-trump-twitter-ban/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/musk-reverse-trump-twitter-ban.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-10T18:49:08Z", "content": "LONDON — Elon Musk said he will reverse Twitter’s permanent ban of former President Donald Trump if the Tesla CEO follows through with his plan to buy the social media company.\r\nMusk, speaking virtua… [+1520 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Philip Elliott", "title": "Pennsylvania’s Senate Primary Shows How Republicans’ Abortion Rhetoric Could Backfire", "description": "This article is part of The D.C. Brief, TIME’s politics newsletter. Sign up here to get stories like this sent to your inbox. The rowdy primary for the Republican Senate nomination in Pennsylvania is quickly becoming a referendum on abortion. The contenders s…", "url": "https://time.com/6175300/pennsylvania-senate-primary-abortion/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Pennsylvania-Mehmet-Oz-senate-abortion.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-10T17:39:20Z", "content": "This article is part of The D.C. Brief, TIME’s politics newsletter. Sign up here to get stories like this sent to your inbox.\r\nThe rowdy primary for the Republican Senate nomination in Pennsylvania i… [+7164 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Shannon Carlin", "title": "Vanessa Bayer on Channeling Her Childhood Cancer Experience in Showtime’s I Love That for You", "description": "Vanessa Bayer watched so much QVC growing up that she admits it’s become “like a foreign language I can speak.” Her new series I Love That for You allows her to show off her fluency in the lingo that home-shopping hosts use to sell cashmere throws, genuine le…", "url": "https://time.com/6175255/vanessa-bayer-i-love-that-for-you-interview/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/ILTFY_101_3519_R.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-10T17:08:27Z", "content": "Vanessa Bayer watched so much QVC growing up that she admits it’s become “like a foreign language I can speak.” Her new series I Love That for You allows her to show off her fluency in the lingo that… [+5309 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jonathan Corpus Ong", "title": "The World Should Be Worried About a Dictator’s Son’s Apparent Win in the Philippines", "description": "Authoritarian rulers and exiles around the world have watched the Philippine election with interest and been given a powerful lesson.", "url": "https://time.com/6174739/bongbong-marcos-election-philippines/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1395951506.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-10T16:49:27Z", "content": "After a maddening campaign season, which saw a polarized electorate disagree on everything from the methodology of opinion polls to the moral significance of showing up for public debates, voters in … [+7048 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Olivia B. Waxman", "title": "Bongbong Marcos Looks Set to Be the Next Philippine President. A Short History of His Family’s Rise, Fall, and Rise Again", "description": "Ferdinand “Bongbong” Marcos Jr. looks set to win the Philippines presidential election, according to the Associated Press. A win would mark the return of the Marcos family to power, more than three decades after being forced to flee the country amid a popular…", "url": "https://time.com/6174469/bongbong-marcos-philippines-election-family-history/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/marcos-time-cover.jpeg?quality=85&crop=0px%2C181px%2C400px%2C209px&resize=1200%2C628&strip", "publishedAt": "2022-05-10T16:05:06Z", "content": "Ferdinand “Bongbong” Marcos Jr. looks set to win the Philippines presidential election, according to the Associated Press. A win would mark the return of the Marcos family to power, more than three d… [+4382 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "SETH BORENSTEIN / AP", "title": "Earth has a 50% Chance of Hitting Key 1.5°C Warming Threshold in the Next 5 Years", "description": "“We’re going to see continued warming in line with what is expected with climate change,” said a UK Met Office senior scientist.", "url": "https://time.com/6175135/climate-warming-threshold/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/climate-change-key-threshold.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-10T13:33:20Z", "content": "The world is creeping closer to the warming threshold international agreements are trying to prevent, with nearly a 50-50 chance that Earth will temporarily hit that temperature mark within the next … [+4752 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Kimiko Matsuda-Lawrence", "title": "On Being Black and Asian in America", "description": "Checking the Box First grade. I am 6 years old, taking my first standardized test at Shepherd Elementary School in Washington, D.C. Next to “Race,” I check “Black.” At 6, I already know what they think about me. What they think about us. I see the white schoo…", "url": "https://time.com/6172685/being-black-asian-america-essay/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/black-asian-in-america.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-10T11:00:41Z", "content": "Checking the Box\r\nFirst grade. I am 6 years old, taking my first standardized test at Shepherd Elementary School in Washington, D.C. Next to “Race,” I check “Black.” At 6, I already know what they th… [+14910 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Andy Warhol’s ‘Shot Sage Blue Marilyn’ Becomes the Most Expensive Work By a U.S. Artist Sold at Auction", "description": "An iconic Warhol portrait of Marilyn Monroe has gone for $195 million, making it the most expensive work by a U.S. artist sold at auction.", "url": "https://time.com/6175110/andy-warhol-marilyn-monroe-auction/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/marilyn-monro-andy-warhol-1.jpeg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-10T08:26:41Z", "content": "NEW YORK — Andy Warhol’s “Shot Sage Blue Marilyn” sold for a cool $195 million on Monday, making the iconic portrait of Marilyn Monroe the most expensive work by a U.S. artist ever sold at auction.\r\n… [+1299 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Asantha Sirimanne / Bloomberg", "title": "Protesters Have Set Fire to the Home of Sri Lanka’s President Gotabaya Rajapaksa", "description": "The ancestral home of the Rajapaksa family was set on fire, and police were forced to use tear gas to disperse protesters.", "url": "https://time.com/6175067/sri-lanka-violence-rajapaksa/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/sri-lanka-protests.jpeg?quality=85&crop=0px%2C26px%2C1024px%2C536px&resize=1200%2C628&strip", "publishedAt": "2022-05-10T07:51:22Z", "content": "Violence erupted in Sri Lanka on Monday evening after the brother of President Gotabaya Rajapaksa resigned as prime minister, with local reports saying protesters targeted the homes and properties of… [+3544 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Judy Berman", "title": "Hulu’s Conversations With Friends Breathes Fresh Life Into Sally Rooney’s Best Novel", "description": "Normal People disappointed, but the streamer's latest adaptation of the Irish author is surprisingly great.", "url": "https://time.com/6173737/conversations-with-friends-hulu-review/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/cwf_110_eb_00429rt.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-10T07:30:37Z", "content": "So much has been said about Sally Rooney, in the mainstream press as well as in literary circles, that it can feel as though she’s been part of the discussion forever. Whether you consider the 31-yea… [+6100 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Billy Perrigo", "title": "Facebook Faces New Lawsuit Alleging Human Trafficking and Union-Busting in Kenya", "description": "Facebook’s parent company, Meta Platforms, and its largest outsourcing partner in Africa are facing new allegations of forced labor, human trafficking, and union busting in Kenya. Daniel Motaung, a former outsourced Facebook content moderator, filed a lawsuit…", "url": "https://time.com/6175026/facebook-sama-kenya-lawsuit/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/meta-daniel-motaung.jpg?quality=85", "publishedAt": "2022-05-10T06:00:29Z", "content": "Facebook’s parent company, Meta Platforms, and its largest outsourcing partner in Africa are facing new allegations of forced labor, human trafficking, and union busting in Kenya.\r\nDaniel Motaung, a … [+8111 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Kim Chandler and Mike Balsamo / AP", "title": "Ex-Jail Officer Dies and Fugitive Inmate Captured After Manhunt, Officials Say", "description": "Officials said Vicky White, a former jail official on the run with a murder suspect she was accused of helping escape, has killed herself.", "url": "https://time.com/6175070/vicky-white-jail-officer-dies-convict-manhunt/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/alabama-jail-official-vicki-white.jpeg?quality=85&crop=0px%2C59px%2C3166px%2C1657px&resize=1200%2C628&strip", "publishedAt": "2022-05-10T05:37:02Z", "content": "A former Alabama jail official on the run with a murder suspect she was accused of helping escape shot and killed herself Monday as authorities caught up with the pair after more than a week of searc… [+4922 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Kyla Mandel", "title": "Here’s What You Need to Know About Paxlovid", "description": "Here's what to know about the drug, its efficacy, and who can get it.", "url": "https://time.com/6175031/paxlovid-covid-19-treatment/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/paxlovid-covid-19-treatment.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-09T22:10:06Z", "content": "Prescriptions for Pfizer’s COVID-19 antiviral medication Paxlovid—the first such pill to be authorized by the U.S. Food and Drug Administration (FDA)—have increased tenfold in the past two months. Be… [+7534 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Linda Lew / Bloomberg", "title": "G7 Expresses ‘Grave Concern’ Over Hong Kong Leader’s Election", "description": "The foreign ministers of the Group of Seven most industrialized nations expressed “grave concern” over the process by which Hong Kong selected its next Chief Executive, calling it an assault on the fundamental freedoms of the former British colony that return…", "url": "https://time.com/6174800/g7-hong-kong-leaders-election/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/john-lee-hong-kong.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-09T20:33:43Z", "content": "The foreign ministers of the Group of Seven most industrialized nations expressed “grave concern” over the process by which Hong Kong selected its next Chief Executive, calling it an assault on the f… [+3249 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Asantha Sirimanne / Bloomberg", "title": "Sri Lanka Leader’s Brother Quits as Prime Minister in Escalating Crisis", "description": "Premier Mahinda Rajapaksa, the brother of Sri Lankan President Gotabaya Rajapaksa resigned as premier, as weekslong protests over Asia’s fastest inflation turned violent", "url": "https://time.com/6174788/sri-lanka-prime-minister-rajapaksa-resigns/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/sri-lanka-protests.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-09T20:21:44Z", "content": "The brother of Sri Lankan President Gotabaya Rajapaksa resigned as premier on Monday as weekslong protests over Asia’s fastest inflation turned violent, prompting the government to impose a curfew an… [+5560 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Aamer Madhani / AP", "title": "Biden Starts Program to Provide Discounted Internet Service", "description": "Internet companies have agreed to provide discounted service to people with low incomes through the Affordable Connectivity Program program", "url": "https://time.com/6174911/biden-program-internet/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/biden-program-internet.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-09T19:51:10Z", "content": "WILMINGTON, Del. — The Biden administration announced on Monday that 20 internet companies have agreed to provide discounted service to people with low incomes, a program that could effectively make … [+2714 chars]"}]}