{"status": "ok", "totalResults": 28, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Susan Montoya Bryan and Morgan Lee / AP", "title": "New Mexico Counties Draw Screams and Threats Amid Efforts to Certify Election Results", "description": "Conspiracy theories about the security of voting machines led to heated, angry and at times threatening outbursts in New Mexico counties.", "url": "https://time.com/6188922/new-mexico-election-conspiracy-theories/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1211509102.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-17T22:38:26Z", "content": "(ALBUQUERQUE, N.M.) — Deep-seated conspiracy theories about the security of voting machines erupted into heated, angry and at times threatening outbursts Friday as New Mexico counties decided whether… [+5430 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Stephanie Zacharek", "title": "Good Luck To You, Leo Grande Is the Perfect Movie For Anyone Who Feels Invisible", "description": "Older women’s bodies, not to mention their sexuality, are something no one wants to think or talk about, least of all older women themselves. What everyone tells you when you’re young eventually becomes true: at a certain age—maybe 50, maybe 60—you become inv…", "url": "https://time.com/6188914/good-luck-to-you-leo-grande-review/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/00_excl_07_2175-_good_luck_to_you_leo_grande_-_photo_nick_wall_1.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-17T21:28:02Z", "content": "Older women’s bodies, not to mention their sexuality, are something no one wants to think or talk about, least of all older women themselves. What everyone tells you when you’re young eventually beco… [+5721 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Mariah Espada", "title": "Everything We Know About Beyoncé’s New Album, Renaissance", "description": "Beyoncé has announced her newest album will arrive this summer. Titled Renaissance: Act 1, the work marks the singer’s seventh solo studio album and will be released on July 29. The announcement comes after Beyoncé was featured on the July 2022 cover of Briti…", "url": "https://time.com/6188905/beyonce-renaissance-abum/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1231723262.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-17T20:57:07Z", "content": "Beyoncé has announced her newest album will arrive this summer. Titled Renaissance: Act 1, the work marks the singer’s seventh solo studio album and will be released on July 29. \r\nThe announcement co… [+2619 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jeffrey Kluger", "title": "NASA Insists All Is Well as the Webb Telescope’s Mirror Gets Dinged", "description": "A micrometeoroid damages a mirror segment, but NASA says all is well.", "url": "https://time.com/6188507/webb-telescope-mirror-damage-nasa/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/WebbTelescope.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-17T20:23:48Z", "content": "In some ways, the last place you’d want to put the James Webb Space Telescope is, well, in space. If you owned a $10 billion car, you wouldn’t leave it out in a hail storm, and while there’s no hail … [+3096 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eric Cortellessa", "title": "Multiple Trump Allies Allegedly Sought Pardons After Jan. 6. Could Trump Have Issued Them?", "description": "The lawyer who advised former President Donald Trump on how to overturn the 2020 election requested a pardon from him in the days after Jan. 6, the committee investigating the Capitol attack revealed on Thursday. At the committee’s third public hearing on Jun…", "url": "https://time.com/6188793/trump-pardons-jan-6-explainer/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/trump-january-6-pardons-01.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-17T20:02:06Z", "content": "The lawyer who advised former President Donald Trump on how to overturn the 2020 election requested a pardon from him in the days after Jan. 6, the committee investigating the Capitol attack revealed… [+10035 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Ryan O'Connell", "title": "Why I Will Never Stop Writing Gay Sex Scenes for TV", "description": "Gay sex has either been heavily eroticized in TV and film or removed entirely. Showing it realistically is radical and important.", "url": "https://time.com/6187868/gay-sex-tv-representation/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/ryan-oconnell-special-queer-as-folk.jpg?quality=85&crop=0px%2C558px%2C1920px%2C1006px&resize=1200%2C628&strip", "publishedAt": "2022-06-17T19:41:36Z", "content": "“Why do I do this to myself?” is something I mutter every time I’m standing naked while a makeup artist paints over the zits on my butt. After writing and starring in my autobiographical Netflix show… [+6486 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Simmone Shah", "title": "The Surprisingly Progressive Promises of General Order No. 3, Which Ended Slavery in Texas", "description": "The language of Order No. 3 also promised a lot that couldn’t be delivered, advising freedmen to “remain quietly at their present homes” and “work for wages” without any way to guarantee either", "url": "https://time.com/6188864/general-order-3-juneteenth/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/General-Order-3-Juneteenth.jpg?quality=85&crop=0px%2C74px%2C1024px%2C536px&resize=1200%2C628&strip", "publishedAt": "2022-06-17T19:35:59Z", "content": "This year, as the nation celebrates Juneteenth as the newest federal holiday, many Black Americans will be taking part in a long-honored tradition—public readings of General Order No. 3. \r\nThe order,… [+3503 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Stephanie Zacharek", "title": "Penélope Cruz Dazzles in the Sharp Showbiz Satire Official Competition", "description": "Penélope Cruz is a marvelous dramatic actor, but we don’t get enough chances to bask in the glow of her lustrous comic timing. She never clamps down on a line; her rhythms have the whirring lightness of a hummingbird wing. That’s what makes the sharp, witty S…", "url": "https://time.com/6188346/official-competition-review/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/OFFICIAL-COMPETITION-Still-3.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-17T18:09:58Z", "content": "Penélope Cruz is a marvelous dramatic actor, but we don’t get enough chances to bask in the glow of her lustrous comic timing. She never clamps down on a line; her rhythms have the whirring lightness… [+1871 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Lindsay Lee Wallace", "title": "The True Story Behind Hulu’s Boy Scouts Documentary Leave No Trace", "description": "For more than a century, the Boy Scouts were a bastion of archetypal American iconography and values. “It’s apple pie, it’s baseball, it’s mom, it’s Fourth of July, it’s the American flag, it’s Norman Rockwell, it’s everything” says journalist and former scou…", "url": "https://time.com/6188750/leave-no-trace-true-story-hulu/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/L8wllLmdbqW76prJTUX0_YObKAXa0mLk1HFfyNCXdUwJENRWNqT1bJGh2wmH__ovoSrmn6ka4Cp9ac46cPpBr1yPdPKQTDjsnxFFQ8y7PXcIgT2Rg_fZZFLMEgM9HTteTB7xL5q0eC59kpltw.png?w=1200&h=612&crop=1", "publishedAt": "2022-06-17T17:59:31Z", "content": "For more than a century, the Boy Scouts were a bastion of archetypal American iconography and values. “It’s apple pie, it’s baseball, it’s mom, it’s Fourth of July, it’s the American flag, it’s Norma… [+8062 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Cydney Hurston Dupree", "title": "How Stereotypes Shape the Language People Use", "description": "As the United States celebrates its the second year with Juneteenth as a federal holiday, many articles will be written about race relations. But I’d like to broach one topic that often falls under the radar: stereotypes. From the first instant our eyes aligh…", "url": "https://time.com/6188528/stereotypes-shape-the-language-people-use/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-758308587.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-17T17:43:12Z", "content": "As the United States celebrates its the second year with Juneteenth as a federal holiday, many articles will be written about race relations. But I’d like to broach one topic that often falls under t… [+5045 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eloise Barry", "title": "What You Need To Know About Colombia’s Election", "description": "Whichever candidate wins, the election result will mark a significant departure from the status quo in the traditionally conservative, U.S.-allied country", "url": "https://time.com/6188361/colombia-presidential-election-gustavo-petro-rodolfo-hernandez/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/gustavo-petro-colombia.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-17T17:18:34Z", "content": "Colombians will select their next president on Sunday in a race that has seemingly defied expectations at every turn, and is one of the most consequential ones for the country in decades. Polls put t… [+10384 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Stephanie Zacharek", "title": "A New Father of the Bride Proves There’s Life Left in an Old Concept", "description": "Our ideas about marriage and marital roles have changed radically in the past 50 years, especially now that women are major players in the work force. What’s changed less is the notion of the wedding: sure, there are always those couples who prefer to celebra…", "url": "https://time.com/6188754/father-of-the-bride-review-hbo-max/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/rev-1-FOTB-FP-0001_High_Res_JPEG.jpeg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-17T17:17:00Z", "content": "Our ideas about marriage and marital roles have changed radically in the past 50 years, especially now that women are major players in the work force. What’s changed less is the notion of the wedding… [+4724 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Dana Hull and Richard Clough / Bloomberg", "title": "SpaceX Fires Employees Over Letter Critical of CEO Musk", "description": "The unusual clash hints at growing discord over the billionaire’s controversial comments.", "url": "https://time.com/6188810/spacex-fires-employees-elon-musk/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/spacex-fires-employees-elon-musk.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-17T17:15:32Z", "content": "SpaceX has fired “a number of employees” responsible for an open letter critical of the behavior of Chief Executive Officer Elon Musk, according to an internal memo, an unusual clash hinting at growi… [+2140 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Tara Law", "title": "How Climate Change and Air Pollution Affect Kids’ Health", "description": "A review article published in the New England Journal of Medicine shows how dangerous climate-related threats are to children’s health.", "url": "https://time.com/6188760/climate-change-air-pollution-kids-health/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/Respiratory-disease-baby.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-17T16:38:19Z", "content": "Climate change affects everyone, but especially children. Their small bodies—and the fact that they grow so rapidly, starting from the time they’re in utero—make them more vulnerable to toxins, pollu… [+5817 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eloise Barry / London", "title": "Here’s What’s Next After the U.K. Approved Julian Assange’s Extradition to the U.S.", "description": "Rights groups have condemned the extradition, arguing that Assange is at risk of torture and is being silenced for public service journalism.", "url": "https://time.com/6188714/uk-approves-assange-extradition-what-next/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1240728352.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-17T15:46:28Z", "content": "The British government approved Friday the extradition of WikiLeaks founder Julian Assange to the U.S., where he is wanted on charges under the Espionage Act. He has 14 days to appeal and WikiLeaks s… [+9532 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Ian Bremmer", "title": "Colombians Want Change. They’ll Get It No Matter Who Wins the Presidential Election", "description": "There’s nothing new about populist outsiders who challenge for national power. Donald Trump, India’s Narendra Modi, Brazil’s Jair Bolsonaro, the Philippines’ Rodrigo Duterte and other political novices break through by channeling deep public anger at a well-e…", "url": "https://time.com/6188717/colombia-presidential-election/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1241353584.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-17T14:54:18Z", "content": "There’s nothing new about populist outsiders who challenge for national power. Donald Trump, India’s Narendra Modi, Brazil’s Jair Bolsonaro, the Philippines’ Rodrigo Duterte and other political novic… [+6457 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jay Reeves / AP", "title": "2 People Killed and 1 Wounded in Shooting at Alabama Church Potluck", "description": "A gunman opened fire at a church potluck dinner, killing two members and wounding a third before being taken into custody, authorities said.", "url": "https://time.com/6188726/alabama-church-shooting/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/2-killed-1-wounded-alabama-church-shooting.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-17T14:51:52Z", "content": "VESTAVIA HILLS, Ala. — A gunman opened fire at a potluck dinner inside a suburban Alabama church, killing two members and wounding a third before being taken into custody, authorities said.\r\nEmergenc… [+4152 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Kyle Hightower / AP", "title": "Warriors Beat Celtics 103-90 to Win 4th NBA Title in 8 Years", "description": "“We found a way to just get it done,” Stephen Curry said after the Warriors accepted the championship trophy and celebrated on the court.", "url": "https://time.com/6188716/warriors-beat-celtics-nba/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/warriors-beat-celtics-nba.jpg?quality=85&crop=0px%2C61px%2C4180px%2C2188px&resize=1200%2C628&strip", "publishedAt": "2022-06-17T14:47:23Z", "content": "BOSTON — The Golden State Warriors are NBA champions once again, topping the Boston Celtics 103-90 on Thursday night for their fourth title in the last eight seasons.\r\nStephen Curry scored 34 points … [+5968 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "LAURA MILLAN LOMBRANA AND JOHN AINGER/BLOOMBERG", "title": "Rich Countries Decide To Keep Discussion of Who Pays For Climate Impacts Off the COP27 Agenda", "description": "The issue of who should pay for \"loss and damages\" from climate change is expected to take center stage at COP27 in Egypt this year.", "url": "https://time.com/6188699/loss-damages-blocked-from-cop27-agenda/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/loss-damage-cop27-climate-negotations.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-17T14:02:32Z", "content": "Negotiators representing dozens of developing nations left Germany empty-handed as rich countries blocked their attempts to secure compensation for the damage caused by climate change.\r\nThe talks tha… [+4495 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Lindsey Tanner / AP", "title": "FDA Authorizes First COVID-19 Vaccines for Infants and Preschoolers", "description": "U.S. regulators on Friday authorized the first COVID-19 shots for infants and preschoolers, paving the way for vaccinations to begin soon.", "url": "https://time.com/6188685/fda-authorization-covid-19-vaccine-infants/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/covid-19-vaccine-kids-bandages.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-17T13:41:34Z", "content": "U.S. regulators on Friday authorized the first COVID-19 shots for infants and preschoolers, paving the way for vaccinations to begin next week.\r\nThe Food and Drug Administration’s action follows its … [+3057 chars]"}]}