{"status": "ok", "totalResults": 10, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Bloomberg", "title": "After Being Locked Down for Two Months, Shanghai Takes Its Biggest Steps Toward Reopening", "description": "The easing comes as China’s worst flare up since the 2020 Wuhan outbreak wanes, with just 31 COVID cases reported in Shanghai for Monday.", "url": "https://time.com/6182736/shanghai-covid-reopening/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1399186101.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-31T08:10:59Z", "content": "Shanghai will let people in areas deemed low risk for Covid-19 move around the city freely and resume road and public transportation from Wednesday, in a major step forward in its efforts to dismantl… [+3153 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "MARIA CHENG / AP", "title": "Monkeypox Won’t Turn Into a Pandemic, the WHO Says, but There Are Many Unknowns", "description": "A WHO expert says she doesn’t expect a pandemic, but there are still many unknowns about the disease, including how exactly it spreads.", "url": "https://time.com/6182726/monkeypox-pandemic-who/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1053131738.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-31T04:35:26Z", "content": "LONDON — The World Health Organization’s top monkeypox expert said she doesn’t expect the hundreds of cases reported to date to turn into another pandemic, but acknowledged there are still many unkno… [+4587 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "SAMUEL PETREQUIN and LORNE COOK / AP", "title": "E.U. Leaders Agree to Ban 90% of Russian Oil by the End of the Year", "description": "The move is part of new sanctions on Moscow worked out at a summit focused on helping Ukraine with a new package of financial support.", "url": "https://time.com/6182719/eu-russian-oil/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1229695308.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-31T04:11:06Z", "content": "BRUSSELS — European Union leaders agreed Monday to embargo most Russian oil imports into the bloc by year-end as part of new sanctions on Moscow worked out at a summit focused on helping Ukraine with… [+4984 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Alana Semuels", "title": "Sara Menker, CEO of Gro Intelligence, Warns the Fallout of Rising Food Insecurity Will Be Wide-Reaching", "description": "Menker talked to TIME shortly after briefing the U.N. Security Council", "url": "https://time.com/6182686/sara-menker-food-insecurity/", "urlToImage": "https://api.time.com/wp-content/uploads/2021/02/JG5A5256.jpg?quality=85&crop=0px%2C876px%2C5040px%2C2635px&resize=1200%2C628&strip", "publishedAt": "2022-05-30T21:44:28Z", "content": "Sara Menker runs a private company, Gro Intelligence, that uses data and AI to make predictions about climate change and food security, but when she appeared before the U.N. Security Council on May 1… [+10281 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Josef Federman / Associated Press", "title": "Israeli Nationalists Chant Racist Slogans in Jerusalem March", "description": "Israel said it deployed thousands of police and security forces for the event, and violent scuffles between Jewish and Palestinian groups erupted before the parade began.", "url": "https://time.com/6182675/israeli-nationalists-march-jerusalem/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/jerusalem-day.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-30T11:33:26Z", "content": "Thousands of Israeli nationalists, some of them chanting “Death to Arabs,” paraded through the heart of the main Palestinian thoroughfare in Jerusalem’s Old City on Sunday, in a show of force that ri… [+7400 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "AILEEN TORRES-BENNETT and NICK PERRY / AP", "title": "China Falls Short on a Big Pacific Deal but Finds Smaller Wins", "description": "China fell short Monday on a bold plan to have 10 Pacific nations endorse a sweeping new pact but has signed several bilateral deals.", "url": "https://time.com/6182650/china-wang-yi-pacific-trip/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/AP22149564407400.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-30T09:51:25Z", "content": "SUVA, Fiji — China fell short Monday on a bold plan to have 10 Pacific nations endorse a sweeping new agreement covering everything from security to fisheries as some in the region expressed deep con… [+6835 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Hillel Italie/AP", "title": "American Rock Star Ronnie Hawkins, Who Found Fame in Canada and Mentored the Band, Dies at 87", "description": "The rockabilly star from Arkansas, famed for recruiting a handful of Canadian musicians later known as the Band, has died.", "url": "https://time.com/6182629/ronnie-hawkins/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/AP22149730101466.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-30T09:06:35Z", "content": "(AP) — Ronnie Hawkins, a brash rockabilly star from Arkansas who became a patron of the Canadian music scene after moving north and recruiting a handful of local musicians later known as the Band, ha… [+4774 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Astrid Suarez and Regina Garcia Cano/AP", "title": "Leftist Former Rebel Surges Ahead of Populist Tycoon in Colombia’s Presidential Race", "description": "Colombian voters have chosen a leftist former rebel and a populist businessman to advance to a runoff election in June.", "url": "https://time.com/6182616/colombia-election-president-runoff/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/AP22150076967169.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-30T06:59:40Z", "content": "BOGOTA — Colombian voters opted for a dramatic change in presidential politics, choosing a leftist former rebel and an outsider populist businessman to advance to a runoff election in June amid hopes… [+6261 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Elena Becatoros and Ricardo Mazalan/AP", "title": "Zelensky Visits Front Lines as Russia Closes in on Ukraine’s Industrial Donbas Region", "description": "Fierce combat took place Sunday as Russian forces attempted to storm Sievierodonetsk in a push to take eastern Ukraine.", "url": "https://time.com/6182603/zelensky-russia-ukraine-donbas-kharkiv/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/AP22149639379291.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-30T06:00:59Z", "content": "POKROVSK, Ukraine — Russian and Ukrainian troops traded blows in fierce close-quarter combat Sunday in an eastern Ukrainian city as Moscow’s soldiers, supported by intense shelling, attempted to gain… [+5123 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Hasan Ali", "title": "The U.S. Is Losing a Strategic, Nuclear-Armed Ally to China", "description": "Political unrest is roiling Pakistan, but the consensus on all sides is that Washington has no part in its future, argues Hasan Ali.", "url": "https://time.com/6182411/us-pakistan-china-imran-khan/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1239661458.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-30T03:23:17Z", "content": "In a rousing speech delivered on May 26, Pakistan’s recently ousted Prime Minister, Imran Khan, gave the ruling coalition until June 1 to hold fresh elections, which were originally scheduled for Oct… [+6653 chars]"}]}