{"status": "ok", "totalResults": 30, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "KATHLEEN RONAYNE / AP", "title": "California Climate Plan Calls for All-Electric New Homes to Hit Carbon-Neutral Goal", "description": "The proposal also calls for the state cut the use of oil and gas by 91% by 2045.", "url": "https://time.com/6175644/california-climate-plan-electric-homes/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/california-fossil-fuels-climate-neutral-target.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-11T14:12:11Z", "content": "(SACRAMENTO, Calif.) — New homes built in California starting in 2026 need to be powered by all-electric furnaces, stoves and other appliances if California is to meet its ambitious climate change go… [+5172 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "WANJOHI KABUKURU / AP", "title": "Climate Change Will Make Droughts Longer, More Common, Says UN", "description": "While no region is be spared from drought, Africa is the hardest hit continent, with the Americas, India, and Australia also impacted", "url": "https://time.com/6175622/climate-change-worse-droughts/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/drought-climate-change-california.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-11T13:49:47Z", "content": "The frequency and duration of droughts will continue to increase due to human-caused climate change, with water scarcity already affecting billions of people across the world, the United Nations warn… [+2894 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Monica R. McLemore", "title": "I’m Still Wearing My N95 Mask Because I Care About Society’s Most Vulnerable", "description": "We have reduced the pandemic to individual behaviors and choices, but it's a collective problem. We're all in this together.", "url": "https://time.com/6174014/still-wearing-n95-mask/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/n95-mask.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-11T13:09:37Z", "content": "It doesn’t exactly feel cool to wear my N95 mask right now. Everywhere I go, Americans seem to have given up on essential and basic public-health strategies proven to reduce the risk of COVID-19—and … [+3450 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Justin Worland", "title": "This Is How We Quit Big Oil", "description": "At the end of the first quarter of 2021, as the CEOs of the three biggest U.S. oil and gas companies presented their firms’ earnings, investors fired off a range of questions about how they were addressing climate change. The market had already come to view f…", "url": "https://time.com/6175206/black-gold-fossil-fuel-industry/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/220523_BLACKGOLD_001.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-11T13:00:22Z", "content": "At the end of the first quarter of 2021, as the CEOs of the three biggest U.S. oil and gas companies presented their firms’ earnings, investors fired off a range of questions about how they were addr… [+12046 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Ilana Kaplan", "title": "How Paul W. Downs and Lucia Aniello Kept the Momentum Going With Season 2 of Hacks", "description": "The breakout success of the HBO hit comedy Hacks has more than proven that Paul W. Downs and Lucia Aniello are anything but. After earning 15 Emmy nominations (including three wins) and ushering in the Jean Smart-issance, the creative partners—along with show…", "url": "https://time.com/6175423/paul-downs-lucia-aniello-hacks-season-2-interview/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/LW_TIME_PAULLUCIA_WEBSIZE.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-11T12:45:17Z", "content": "The breakout success of the HBO hit comedy Hacks has more than proven that Paul W. Downs and Lucia Aniello are anything but. After earning 15 Emmy nominations (including three wins) and ushering in t… [+12925 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Emily Barone", "title": "Oil Companies Posted Huge Profits. Here’s Where The Cash Will Go (Hint: Not Climate)", "description": "As consumers grapple with high fuel prices and politicians scramble to knock them down, oil companies are not making any sudden moves. That’s because, after years of low fuel prices, they are now enjoying a financial upswing, as demonstrated by lucrative firs…", "url": "https://time.com/6175400/oil-company-profits/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1240313279.jpg?quality=85&crop=0px%2C0px%2C1024px%2C536px&resize=1200%2C628&strip", "publishedAt": "2022-05-11T12:18:21Z", "content": "As consumers grapple with high fuel prices and politicians scramble to knock them down, oil companies are not making any sudden moves. That’s because, after years of low fuel prices, they are now enj… [+7391 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "JOSEPH KRAUSS and FARES AKRAM / Associated Press", "title": "Al Jazeera Reporter Killed During Israeli Raid in West Bank", "description": "JERUSALEM — A female journalist for Al Jazeera was shot and killed while covering an Israeli raid in the occupied West Bank town of Jenin early Wednesday. The broadcaster and a reporter who was wounded in the incident blamed Israeli forces, while Israel claim…", "url": "https://time.com/6175571/journalist-killed-israeli-raid-west-bank/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1240594168.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-11T12:02:50Z", "content": "JERUSALEM — A female journalist for Al Jazeera was shot and killed while covering an Israeli raid in the occupied West Bank town of Jenin early Wednesday. The broadcaster and a reporter who was wound… [+7765 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Katie Reilly", "title": "What We Know So Far About President Biden’s Plan to Forgive Student Loans", "description": "President Biden is under pressure to cancel student loan debt. But it's clear that whatever he does will be short of the $50,000 loan forgiveness championed by Sen. Elizabeth Warren and other activists.", "url": "https://time.com/6175456/student-loan-forgiveness-biden/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/student-loan-forgiveness-biden.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-11T12:01:57Z", "content": "President Joe Biden campaigned on a plan to forgive at least some of the $1.6 trillion in federal student loan debt by over 44 million U.S borrowers. “Young people and other student debt holders bore… [+6036 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Aryn Baker/Nome, Alaska", "title": "Polar Paradox: The Melting Arctic Could Destroy Indigenous Ways of Life While Making Some Alaskans Rich", "description": "The city of Nome, on Alaska’s Bering Sea coast, has long been the home of adventurers, chancers, and the fiercely independent who would rather live off the land than do their shopping at Walmart. Originally a native Inupiat settlement that was taken over by m…", "url": "https://time.com/6174947/melting-arctic-indigenous-communities-alaska/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/climate-change-nome-alaska-8.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-11T11:00:32Z", "content": "The city of Nome, on Alaska’s Bering Sea coast, has long been the home of adventurers, chancers, and the fiercely independent who would rather live off the land than do their shopping at Walmart.\r\nOr… [+21813 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Aryn Baker", "title": "After Visiting Both Ends of the Earth, I Realized How Much Trouble We’re In", "description": "Nothing on earth compares to the icy sweeps of the planet’s polar extremes. It’s why, perhaps, explorers and scientists who have been there often seek more distant analogies, describing the poles’ austere swaths of frozen terrain in lunar terms, unworldly wit…", "url": "https://time.com/6174966/north-south-pole-melting-climate-change/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/220523_WPOLAR_ESSAY_002.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-11T11:00:12Z", "content": "Nothing on earth compares to the icy sweeps of the planet’s polar extremes. It’s why, perhaps, explorers and scientists who have been there often seek more distant analogies, describing the poles’ au… [+8712 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Abby Vesoulis", "title": "Why Utah Democrats Decided to Back Evan McMullin Over One of Their Own", "description": "Democrats think a former Republican running as an independent has a better shot of defeating Sen. Mike Lee than one of their own.", "url": "https://time.com/6174574/evan-mcmullin-mike-lee-utah-democrats/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-621863762.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-11T11:00:01Z", "content": "The crowd at Cottonwood High School in Murray, Utah, last month was tense. Amid raucous booing and grating insults, Democrats hotly debated who to nominate to challenge U.S. Senator Mike Lee, whose f… [+8433 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Charlie Campbell", "title": "As the City’s COVID-19 Lockdown Tightens Again, Shanghai Residents Have Been Pushed to Breaking Point", "description": "China doubles down on its unpopular zero-COVID approach, seeking to avoid a \"tsunami\" of cases if Omicron is allowed to spread unchecked.", "url": "https://time.com/6175179/shanghai-covid-lockdown-residents/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1394950638.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-11T10:28:07Z", "content": "The lockdown in Shanghai is now in its sixth week and residents have been flooding social media with disgruntled posts. Some document their confinement in quarantine centers without beds or blankets.… [+7273 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Belinda Luscombe", "title": "Airbnb Aims To Solve ‘Overtourism’. Are Tweaks To Its App Enough?", "description": "The problem with Airbnb, according to its CEO Brian Chesky, is the search box. When users open the platform, they are asked a question: Where do you want to go? This, Chesky has come to realize, is the wrong way to approach travel. Chesky wants Airbnb to meet…", "url": "https://time.com/6175183/airbnb-aims-to-solve-overtourism-are-tweaks-to-its-app-enough/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Screen-Shot-2022-05-10-at-5.00.16-PM.png?w=1200&h=628&crop=1", "publishedAt": "2022-05-11T10:08:30Z", "content": "The problem with Airbnb, according to its CEO Brian Chesky, is the search box. When users open the platform, they are asked a question: Where do you want to go? This, Chesky has come to realize, is t… [+7368 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Karl Vick", "title": "Europe Is Saving Democracy From Big Tech, Says the Author of Surveillance Capitalism", "description": "When Shoshana Zuboff’s The Age of Surveillance Capitalism was published in 2019, public unease with the power of Big Tech found its Rosetta Stone, an opus that simultaneously described, confirmed and named the transformation of democracy’s public spaces into …", "url": "https://time.com/6174614/shoshana-zuboff-twitter-surveillance-capitalism/", "urlToImage": "https://api.time.com/wp-content/themes/time2014/img/time-logo-og.png", "publishedAt": "2022-05-11T10:00:05Z", "content": "When Shoshana Zuboff’s The Age of Surveillance Capitalism was published in 2019, public unease with the power of Big Tech found its Rosetta Stone, an opus that simultaneously described, confirmed and… [+12281 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Andrew R. Chow", "title": "Here’s Why Bitcoin and Other Cryptocurrencies Keep Crashing", "description": "The current slide of Bitcoin and other cryptocurrencies is being caused by a combination of short-term and long-term factors.", "url": "https://time.com/6175370/why-bitcoin-crashing/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1326414122.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-10T21:55:28Z", "content": "Bitcoin took a brutal fall on Monday, briefly dipping below $30,000 for the first time since July 2021. The world’s largest cryptocurrency is now worth less than half of what it was in the fall. Othe… [+6106 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Abby Vesoulis", "title": "How a Digital Abortion Footprint Could Lead to Criminal Charges—And What Congress Can Do About It", "description": "Getting away with breaking the law in the digital age is tricky. Almost everything one does—whether it’s making a Google search for “how to clean up a crime scene,” purchasing suspicious items on Amazon, or merely having been in the proximity of a crime scene…", "url": "https://time.com/6175194/digital-data-abortion-congress/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1238295954.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-10T20:20:56Z", "content": "Getting away with breaking the law in the digital age is tricky. Almost everything one does—whether it’s making a Google search for “how to clean up a crime scene,” purchasing suspicious items on Ama… [+9039 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eloise Barry", "title": "Why It’s So Hard to Find Baby Formula in the U.S. Right Now", "description": "A nationwide shortage has left parents scouring social media or crossing states to get hold of baby formula.", "url": "https://time.com/6175211/baby-formula-shortage/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/baby-formula-shortage.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-10T20:08:41Z", "content": "Parents across the U.S. have been scouring social media or crossing states to get hold of baby formula amid a national shortage driven by ongoing pressure on supply chains. \r\nThe crisis has worsened … [+4873 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Philip Marcelo / AP", "title": "Celebrity Chef Mario Batali Acquitted of Sexual Misconduct Charges by Judge", "description": "Batali’s accuser recounted in court how the former Food Network personality aggressively kissed and groped her. But, a judge agreed with defense claims that she had credibility problems.", "url": "https://time.com/6175357/mario-batali-acquitted-sexual-misconduct/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/celebrity-chef-batali-acquitted.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-10T19:00:41Z", "content": "BOSTON — Mario Batali was found not guilty of indecent assault and battery on Tuesday, following a swift trial in which the celebrity chef waived his right to have a jury decide his fate.\r\nBatali, wh… [+2816 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Matt O'Brien and Kelvin Chan / AP", "title": "Musk Says He Would Reverse Twitter’s Ban of Donald Trump", "description": "Elon Musk said Twitter’s Trump ban was a “morally bad decision” and “foolish in the extreme.”", "url": "https://time.com/6175320/musk-reverse-trump-twitter-ban/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/musk-reverse-trump-twitter-ban.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-10T18:49:08Z", "content": "LONDON — Elon Musk said he will reverse Twitter’s permanent ban of former President Donald Trump if the Tesla CEO follows through with his plan to buy the social media company.\r\nMusk, speaking virtua… [+1520 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Philip Elliott", "title": "Pennsylvania’s Senate Primary Shows How Republicans’ Abortion Rhetoric Could Backfire", "description": "This article is part of The D.C. Brief, TIME’s politics newsletter. Sign up here to get stories like this sent to your inbox. The rowdy primary for the Republican Senate nomination in Pennsylvania is quickly becoming a referendum on abortion. The contenders s…", "url": "https://time.com/6175300/pennsylvania-senate-primary-abortion/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Pennsylvania-Mehmet-Oz-senate-abortion.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-10T17:39:20Z", "content": "This article is part of The D.C. Brief, TIME’s politics newsletter. Sign up here to get stories like this sent to your inbox.\r\nThe rowdy primary for the Republican Senate nomination in Pennsylvania i… [+7164 chars]"}]}