{"status": "ok", "totalResults": 26, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "AMY GUNIA / LAUNCESTON, AUSTRALIA", "title": "Anthony Albanese Has a Shot at Becoming the Next Leader of Australia. Here’s What to Know About Him", "description": "The leader of Australia's center-left Labor Party has a shot at becoming prime minister in elections scheduled for May 21.", "url": "https://time.com/6176983/australia-election-anthony-albanese/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/australia-anthony-albanese.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-20T03:24:39Z", "content": "More than 17 million voters will head to the polls on May 21 to decide who Australia’s next prime minister will be: incumbent Scott Morrison of the center-right Liberal Party or Anthony Albanese, lea… [+4537 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Oleksandr Stashevskyi and Ciaran McQuillan / AP", "title": "Ukrainian Troops Surrendering at Mariupol Registered as POWs", "description": "KYIV, Ukraine — The fate of hundreds of Ukrainian fighters who surrendered after holding out against punishing attacks on Mariupol’s steel factory hung in the balance Thursday, amid international fears that the Russians may take reprisals against the prisoner…", "url": "https://time.com/6179109/ukraine-troops-pow/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/mariupol-ukraine-pow.jpeg?quality=85&w=1024&h=576&crop=1", "publishedAt": "2022-05-20T03:09:40Z", "content": "KYIV, Ukraine — The fate of hundreds of Ukrainian fighters who surrendered after holding out against punishing attacks on Mariupol’s steel factory hung in the balance Thursday, amid international fea… [+6931 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Martine Paris / Bloomberg", "title": "U.S. Leisure Travel Is Back at Pre-Pandemic Levels for the First Time", "description": "People are heading off on vacation, despite a surge in cases and average airfares jumping 18% globally since the start of the year.", "url": "https://time.com/6179098/us-leisure-travel-tourism-covid/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/387470068.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-20T01:02:13Z", "content": "US consumers are spending less on products and more on experiences — a trend that could ease supply snags and inflationary pressures, and help the travel industry this summer.\r\nFor the first time sin… [+1677 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Madeleine Carlisle", "title": "‘I’m Just Waiting for Someone to Knock on the Door.’ Parents of Trans Kids in Texas Fear Family Protective Services Will Target Them", "description": "Parents of transgender youth in Texas are stuck in limbo after a new statement issued by the Department of Family and Protective Services (DFPS) on Thursday suggested the Department will continue investigating parents who may have provided gender-affirming ca…", "url": "https://time.com/6178947/trans-kids-texas-familes-fear-child-abuse-investigations/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/texas-transgender-youth.jpg?quality=85&crop=0px%2C298px%2C2400px%2C1256px&resize=1200%2C628&strip", "publishedAt": "2022-05-19T22:24:09Z", "content": "Parents of transgender youth in Texas are stuck in limbo after a new statement issued by the Department of Family and Protective Services (DFPS) on Thursday suggested the Department will continue inv… [+6241 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Alan Murray", "title": "Where ‘Woke’ CEOs Are Falling Short", "description": "Can CEOs run the world? And will the world allow them to? That has become a central question of our times, as leaders of big business step up to address some of society’s most pressing problems. Consider: • A majority of Fortune 500 CEOs, according to Fortune…", "url": "https://time.com/6178970/activist-ceos-falling-short/", "urlToImage": "https://api.time.com/wp-content/uploads/2020/02/bob-iger-disney-ceo-bob-chapek.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-19T21:28:38Z", "content": "Can CEOs run the world? And will the world allow them to?\r\nThat has become a central question of our times, as leaders of big business step up to address some of society’s most pressing problems. Con… [+13278 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Olivia B. Waxman", "title": "How Celebrity Cases Like the Johnny Depp-Amber Heard Trial Have Shaped the National Conversation About Abuse", "description": "The defamation case involving Johnny Depp and Amber Heard isn't the first time a high-profile case has shaped awareness of domestic violence.", "url": "https://time.com/6178870/johnny-depp-amber-heard-domestic-violence/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/depp-heard.jpg?quality=85&w=1024&h=626&crop=1", "publishedAt": "2022-05-19T20:15:26Z", "content": "As a defamation trial between actor Johnny Depp and his ex-wife actor Amber Heard continues in Fairfax, Va., the headline-making case is raising awareness of domestic violence, as the two accuse one … [+9235 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Philip Elliott", "title": "The House Passed a Resolution Condemning Anti-Semitism. It Wasn’t Unanimous.", "description": "Rep. Thomas Massie’s rigid libertarianism often puts him far afield from his fellow Republicans.", "url": "https://time.com/6178902/thomas-massie-anti-semitism-libertarian/", "urlToImage": "https://api.time.com/wp-content/uploads/2020/03/thomas-massie-stalls-coronavirus-relief-vote.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-19T20:09:43Z", "content": "Not even the idea that anti-Semitism is bad can bring Washington together in unanimity.\r\nThe House voted 420-to-1 on Wednesday on a symbolic, seven-page resolution that calls on the government to do … [+5098 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "SEAN MURPHY / AP", "title": "Oklahoma Approves the Nation’s Most Restrictive Abortion Ban", "description": "The bill is one of at least three anti-abortion bills sent this year to Oklahoma Gov. Kevin Stitt, who has indicated he'll sign it.", "url": "https://time.com/6178881/oklahoma-restrictive-abortion-ban/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/oklahoma-restrictive-abortion-ban.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-19T20:09:34Z", "content": "OKLAHOMA CITY — Oklahoma’s Legislature gave final approval Thursday to another Texas-style anti-abortion bill that providers say will be the most restrictive in the nation once the governor signs it.… [+2622 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Melissa Locker", "title": "Johnny Depp’s Former Associates Testify About His ‘Unprofessional’ Behavior and Jealous Streak", "description": "Several former friends and employees of Johnny Depp testified on Thursday in the ongoing $50 million defamation trial against Depp’s ex-wife, Amber Heard. The high-profile trial, which is being held in Fairfax County, Va., is in its fifth week. Depp’s team re…", "url": "https://time.com/6178832/johnny-depp-former-friends-agent-testify/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1240771479.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-19T19:55:59Z", "content": "Several former friends and employees of Johnny Depp testified on Thursday in the ongoing $50 million defamation trial against Depp’s ex-wife, Amber Heard. The high-profile trial, which is being held … [+4011 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Brian Bennett", "title": "Biden’s Moves on NATO Come Amid Fear Russian War Will Expand Past Ukraine", "description": "Since Russia began its invasion in February, the U.S. has gotten progressively bolder in its efforts to support Ukraine’s military and bolster NATO.", "url": "https://time.com/6178877/bidens-moves-on-nato-come-amid-fear-russian-war-will-expand-past-ukraine/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/biden-finland-sweden.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-19T19:35:58Z", "content": "Vladimir Putin’s name barely came up as Joe Biden stood with the leaders of Finland and Sweden on Thursday under a bright May sun and praised their newfound interest in joining the North Atlantic Tre… [+4516 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jessica Stern and Megan K McBride", "title": "Three Factors Drive Rightwing Violence. We Can’t Solve the Problem Without Addressing All of Them", "description": "By some counts, the horrific attack at a Buffalo supermarket was the second terrorist attack, and the 202nd mass shooting, that happened in the United States this year. Given Americans’ easy access to weapons, growing political divisions, racism, and rates of…", "url": "https://time.com/6178689/violence-extremism-how-to-stop/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1240744838.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-19T19:24:49Z", "content": "By some counts, the horrific attack at a Buffalo supermarket was the second terrorist attack, and the 202nd mass shooting, that happened in the United States this year. Given Americans’ easy access t… [+8813 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Megan McCluskey", "title": "Millennials and Gen Z Invested When It Was Fun. Now They’re Riding Out a Crash", "description": "“Being open to crypto astrology might literally change your life,” says Maren Altman. She’s a 23-year-old astrology influencer with over 1.2 million TikTok followers, and she believes the study of celestial bodies can be a valuable tool for making sense of cr…", "url": "https://time.com/6152208/crypto-investing-millennials-gen-z/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/investing-game-crypto.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-19T19:15:14Z", "content": "“Being open to crypto astrology might literally change your life,” says Maren Altman. \r\nShe’s a 23-year-old astrology influencer with over 1.2 million TikTok followers, and she believes the study of … [+9396 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Justin Worland", "title": "High Gas Prices are Oil Companies’ Fault says Ro Khanna, and Democrats Should Go After Them", "description": "Inflation is rankling voters, and the conventional wisdom in Washington is that sky high gas prices are a big liability for Congressional Democrats, who are already expected to lose seats in the fast-approaching midterm elections. Republicans have tried to pl…", "url": "https://time.com/6178546/ro-khanna-oil-gas-prices-democrats/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1326116776.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-19T18:51:17Z", "content": "Inflation is rankling voters, and the conventional wisdom in Washington is that sky high gas prices are a big liability for Congressional Democrats, who are already expected to lose seats in the fast… [+5731 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Tara Law", "title": "Residents Already Need to Travel for Abortion Training. Experts Fear Roe’s End Will Make It Even Harder", "description": "Abortion training for medical residents is already a logistical nightmare in the U.S. It could get even worse.", "url": "https://time.com/6178686/abortion-training-medical-residents-difficulties/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Doctors-protest-for-abortion.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-19T17:09:00Z", "content": "In 2021, Dr. Mallika Govindan, a family medicine resident at Mount Sinai Health System, got disappointing news. Even though she had pursued a career in medicine in order to become an abortion provide… [+8325 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Emily Barone", "title": "U.S. Plastic Recycling Rates Are Even Worse Than We Thought", "description": "It’s well established that the state of U.S. plastics recycling is dismal. But plastic waste experts, who have long cautioned that the Environmental Protection Agency’s (EPA) purported recycling rate was overestimated, now say that the country is poised for a…", "url": "https://time.com/6178386/plastic-recycling-rates-overestimated/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Plastics.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-19T16:58:51Z", "content": "It’s well established that the state of U.S. plastics recycling is dismal. But plastic waste experts, who have long cautioned that the Environmental Protection Agency’s (EPA) purported recycling rate… [+3405 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Justin Worland", "title": "The Small, Local Election With Potentially Major Climate Change Significance", "description": "Next week’s primary election in Georgia has made national news as a potential bellwether of how voters view former President Donald Trump and his false claims that the 2020 presidential election in the state, which he lost, was stolen. Far from the national n…", "url": "https://time.com/6178647/2022-primary-elections-climate-change/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/georgia-power-coal-plant-e1652977067982.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-19T16:29:07Z", "content": "Next week’s primary election in Georgia has made national news as a potential bellwether of how voters view former President Donald Trump and his false claims that the 2020 presidential election in t… [+5307 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jeffrey Kluger", "title": "Alcohol-Related Deaths Have Soared During the COVID-19 Pandemic", "description": "Stress, isolation, and the closing of essential services all played a role in increased drinking. Young adults were the hardest-hit group.", "url": "https://time.com/6178578/alcohol-death-covid-19-pandemic/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/AlcoholUse.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-19T16:06:54Z", "content": "The pandemic and its attendant anxiety, boredom, and loneliness have not been good for people who struggle with alcohol use. According to a new study published in JAMA Network Open, alcohol-related d… [+2923 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "ZEKE MILLER and MIKE STOBBE / AP", "title": "A Third of U.S. Should Be Considering Masks, Officials Say", "description": "Right now, about a third of the U.S. population lives in areas that are considered at higher risk — mostly in the Northeast and Midwest.", "url": "https://time.com/6178598/us-consider-masking-covid/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/us-consider-masking-covid.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-19T15:25:04Z", "content": "WASHINGTON — COVID-19 cases are increasing in the United States — and could get even worse over the coming months, federal health officials warned Wednesday in urging areas hardest hit to consider re… [+5083 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Alana Semuels", "title": "Signs Are Pointing to a Slowdown in the Housing Market—At Last", "description": "The U.S. may be at a crucial juncture, at which a lot of properties are coming onto the market just as demand slows, analysts say", "url": "https://time.com/6178366/house-prices-us/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/open-house.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-19T14:36:42Z", "content": "Just about everyone agrees that the reason home prices have shot up 34% in the last two years is that there is a lot of demand for housing, but not enough supply.\r\nBut the U.S. may be at a crucial ju… [+8670 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Damian Shepherd and Alex Millson / Bloomberg", "title": "What Is Monkeypox and Should You Be Worried?", "description": "A case of monkeypox has been confirmed in the U.S., with two news cases appearing in the U.K., bringing the total number there to nine.", "url": "https://time.com/6178541/what-is-monkeypox-and-should-you-be-worried/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-151054421.jpg?quality=85&w=791&h=628&crop=1", "publishedAt": "2022-05-19T13:24:09Z", "content": "A case of the rare and potentially dangerous monkeypox has been confirmed in the U.S., with two news cases appearing in the U.K., bringing the total number there to nine.\r\nThe infected Massachusetts … [+3026 chars]"}]}