{"status": "ok", "totalResults": 17, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Stephanie Zacharek", "title": "The Downton Abbey Crew Exits the Roaring 20s With a Flourish", "description": "Though the Downton Abbey TV series had legions of fans during its six-season run, you don’t have to be one of them to enjoy Downton Abbey: A New Era, the second film to spin off from the show. Set in the waning days of the 1920s, A New Era finds the Crawley f…", "url": "https://time.com/6178380/downton-abbey-a-new-era-review/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/03/downton-abbey-a-new-era.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-18T21:28:50Z", "content": "Though the Downton Abbey TV series had legions of fans during its six-season run, you don’t have to be one of them to enjoy Downton Abbey: A New Era, the second film to spin off from the show. Set in… [+1726 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Sean Gregory", "title": "$255 Million in Prize Money. Phil Mickelson’s Implosion. Saudi Arabia’s Influence on Golf Raises Concerns", "description": "Phil Mickelson won't defend his PGA Championship title, after speaking out about LIV Golf, a Saudi-backed breakaway tour.", "url": "https://time.com/6177593/pga-championship-phil-mickelson-saudi-tour/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/mickelson-saudi-golf.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-18T20:57:35Z", "content": "Golf, that genteel game, rarely finds itself swept up by the geopolitical flares of its day. But on the eve of this year’s PGA Championship, which tees off in Tulsa, Okla., on May 19, America’s insti… [+7714 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Melissa Locker", "title": "Amber Heard’s Former Best Friend Testifies: ‘I Was Worried for Her Physical Safety’", "description": "“I was scared for Amber,” Raquel Pennington said in a video deposition played for the jury today in the ongoing defamation suit between Amber Heard and Johnny Depp. Pennington, who is Heard’s former best friend, is one of the witnesses called by Heard’s team …", "url": "https://time.com/6178257/amber-heard-raquel-pennington-josh-drew-testimony/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1240745789.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-18T19:41:38Z", "content": "“I was scared for Amber,” Raquel Pennington said in a video deposition played for the jury today in the ongoing defamation suit between Amber Heard and Johnny Depp. Pennington, who is Heard’s former … [+2919 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Time", "title": "Pennsylvania Republicans Nominated an Election Truther for Governor, Putting the Swing State on Shaky Ground for 2024", "description": "In Pennsylvania, Republicans handily nominated state Sen. Doug Mastriano in the open race for governor. Mastriano attended the Jan. 6, 2021 Stop the Steal rally.", "url": "https://time.com/6178183/pennsylvania-republicans-swing-state-2024/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Doug-Mastriano-Pennsylvania-Governor.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-18T19:02:13Z", "content": "This article is part of The D.C. Brief, TIME’s politics newsletter. Sign up here to get stories like this sent to your inbox.\r\nThe Big Lie has legs.\r\nWith his wins in Pennsylvania and North Carolina … [+4491 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Abby Vesoulis", "title": "Why Madison Cawthorn Lost His Race", "description": "About 95% of members of the U.S. House get re-elected for subsequent terms. North Carolina Congressman Madison Cawthorn, a 26-year-old scandal-ridden Republican, became a rare exception when he lost his primary race on Tuesday. In one of the most high-profile…", "url": "https://time.com/6178176/madison-cawthorn-lost-north-carolina/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1240434654.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-18T17:48:06Z", "content": "About 95% of members of the U.S. House get re-elected for subsequent terms. North Carolina Congressman Madison Cawthorn, a 26-year-old scandal-ridden Republican, became a rare exception when he lost … [+4937 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Time", "title": "TIME Announces Editorial New Hires and Promotions", "description": "TIME Editor-in-Chief and CEO Edward Felsenthal sent the following note to staff on Wednesday:   Team TIME, Please join me in congratulating our colleagues on the 18 promotions below and in welcoming 11 new editorial staffers. You may have met some of these ne…", "url": "https://time.com/6178229/time-announces-hires-and-promotions/", "urlToImage": "https://api.time.com/wp-content/uploads/2018/11/squaretimelogo.png?w=1200&h=628&crop=1", "publishedAt": "2022-05-18T17:31:34Z", "content": "TIME Editor-in-Chief and CEO Edward Felsenthal sent the following note to staff on Wednesday:\r\nTeam TIME,\r\nPlease join me in congratulating our colleagues on the 18 promotions below and in welcoming … [+12493 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jamie Ducharme", "title": "As the Virus Evolves, COVID-19 Reinfections Are Going to Keep Happening", "description": "After the Omicron variant caused massive numbers of infections this past winter, lots of people looked on the bright side, hoping it would be “a free shot for the country,” says Eli Rosenberg, deputy director for science at the New York State Department of He…", "url": "https://time.com/6177192/covid-19-reinfection-how-often/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/covid-testing.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-18T15:15:46Z", "content": "After the Omicron variant caused massive numbers of infections this past winter, lots of people looked on the bright side, hoping it would be “a free shot for the country,” says Eli Rosenberg, deputy… [+5675 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Sara Herchenroether", "title": "I Thought I Had to Breastfeed My Babies. Then I Lost My Breasts", "description": "I clutched the swaddled newborn in the crook of my arm. Only a few hours old, she was asleep, for which I was thankful. I knew when she woke, she would want to feed. A young doctor stood at the foot of my bed. I had a question but didn’t know if I could get…", "url": "https://time.com/6177980/breastfeeding-formula-cancer/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/how-to-feed-your-baby.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-18T14:55:33Z", "content": "I clutched the swaddled newborn in the crook of my arm. Only a few hours old, she was asleep, for which I was thankful. I knew when she woke, she would want to feed. A young doctor stood at the foot … [+5660 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Josiah Bates", "title": "What the Buffalo Shooting Says About Black America’s Fraught Relationship With Guns", "description": "The Buffalo community in upstate New York is still mourning the senseless massacre that occurred on May 15, when a gunman entered a local grocery store and killed 10 people in a racially motivated attack. On Tuesday, President Joe Biden traveled to the city a…", "url": "https://time.com/6177628/buffalo-shooting-black-americans-guns/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/buffalo-shooting-second-amendment-5-17-22.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-18T14:39:13Z", "content": "The Buffalo community in upstate New York is still mourning the senseless massacre that occurred on May 15, when a gunman entered a local grocery store and killed 10 people in a racially motivated at… [+7709 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Stephanie Zacharek", "title": "‘The Hate of Men Will Pass.’ Volodymyr Zelensky Makes an Emotional Appeal to the Power of Cinema at Cannes", "description": "The opening ceremony of the Cannes Film Festival is generally, not to put too fine a point on it, a snooze. A highly polished actor or entertainer steps out to host. This year—the festival’s 75th edition—it was Virginie Efira, the Belgian-French actress who p…", "url": "https://time.com/6177976/cannes-zelensky-speech/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1397767261.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-18T14:26:30Z", "content": "The opening ceremony of the Cannes Film Festival is generally, not to put too fine a point on it, a snooze. A highly polished actor or entertainer steps out to host. This year—the festival’s 75th edi… [+4434 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jamie Ducharme", "title": "One Million Americans Have Died From COVID-19", "description": "Some groups have suffered disproportionately throughout the pandemic. TIME spoke with three people who lost family members to COVID-19.", "url": "https://time.com/6167025/one-millon-deaths-covid-19-stories/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/covid-memorials3.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-18T14:01:48Z", "content": "One million people have died of COVID-19 in the U.S. Each death was more than a number: It was a lost parent, child, partner, or other loved one.\r\nThe pandemic has affected us all, but certain groups… [+12876 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "ANNE M. PETERSON and RONALD BLUM / AP", "title": "U.S. Soccer to Pay Women’s and Men’s Teams Equally in Milestone Agreement", "description": "U.S. women have been successful on the international stage but took home far less than the men's winners", "url": "https://time.com/6178059/us-soccer-equal-pay/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1239948330.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-18T12:31:25Z", "content": "The U.S. Soccer Federation reached milestone agreements to pay its men’s and women’s teams equally, making the American national governing body the first in the sport to promise both sexes matching m… [+6072 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Sydney Maki and Amelia Pollard / Bloomberg", "title": "Sri Lanka Default Hints at Trouble Ahead for Developing Nations", "description": "Sri Lanka’s impending default is flashing a warning sign that surging inflation is set to take a painful toll in other developing nations", "url": "https://time.com/6178046/sri-lanka-default-developing-nations/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1240724327.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-18T11:44:28Z", "content": "Sri Lanka’s impending default on $12.6 billion of overseas bonds is flashing a warning sign to investors in other developing nations that surging inflation is set to take a painful toll.\r\nThe South A… [+5329 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Judy Berman", "title": "Welcome to the Era of Unapologetic Bad Taste", "description": "In 2022, pop culture is doing the most. ­Consider some of the most memorable images to come out of the entertainment industry recently: Mr. Big campily keeling over on his Peloton in And Just Like That… Nicole Kidman baring an impossible 3 feet of midriff on …", "url": "https://time.com/6176272/bad-taste-pop-culture-summer-2022/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/an-era-of-bad-taste.jpg?quality=85&crop=0px%2C382px%2C1920px%2C1006px&resize=1200%2C628&strip", "publishedAt": "2022-05-18T11:00:46Z", "content": "In 2022, pop culture is doing the most. ­Consider some of the most memorable images to come out of the entertainment industry recently: Mr. Big campily keeling over on his Peloton in And Just Like Th… [+13118 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jazzmin Jiwa", "title": "A New York Mosque Becomes a Refuge for Afghan Teens Who Fled Without Their Families", "description": "As Afghan teens fleeing the Taliban in the U.S. have found themselves in an asylum system that isn't built for them, the local Afghan community has stepped in.", "url": "https://time.com/6175274/afghan-teens-new-york-mosque/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/new-york-mosque-afghan-teens-01.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-18T11:00:02Z", "content": "The mood at the first Afghan mosque in New York was bittersweet on a recent Friday afternoon. Eyes glistening, a group of children listened intently as Imam Mohammed Sherzad talked about hope for the… [+9472 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "James Stavridis", "title": "Finland and Sweden Joining NATO Is the Latest Example of Putin Miscalculating the Ukraine War", "description": "That distant boom you heard last week was Vladimir Putin’s head exploding as he heard the news of a formal request from both Finland and Sweden to join NATO. These are two highly capable and professional militaries, whose nations have scrupulously maintained …", "url": "https://time.com/6177971/nato-finland-sweden-russia/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1240730774.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-18T09:00:51Z", "content": "That distant boom you heard last week was Vladimir Putin’s head exploding as he heard the news of a formal request from both Finland and Sweden to join NATO. These are two highly capable and professi… [+4805 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Charlie Campbell", "title": "Here’s What to Know About Joe Biden’s First Trip to Asia as U.S. President", "description": "The U.S. president is making a point of shoring up alliances with visits to Seoul and Tokyo and a summit of the Quad alliance,", "url": "https://time.com/6177458/biden-asia-trip/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1240135928.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-18T07:37:09Z", "content": "On May 20, Joe Biden embarks on his first trip to Asia as U.S. President against a tumultuous backdrop. Among other issues, his administration has been dealing with China’s refusal to condemn Russia’… [+6984 chars]"}]}