{"status": "ok", "totalResults": 38, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Tassanee Vejpongsa and Grant Peck/AP", "title": "Thailand Becomes the First Asian Country to Legalize Marijuana, But Only for Medical Use", "description": "Marijuana is being decriminalized but only for therapeutic use, as the country seeks to tap into the lucrative market for medical cannabis.", "url": "https://time.com/6185904/thailand-marijuana-cannabis-medical/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/m1.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-09T05:54:20Z", "content": "BANGKOK — Marijuana cultivation and possession in Thailand was decriminalized Thursday, like a dream come true for an aging generation of pot smokers who recall the kick the legendary Thai Stick vari… [+2219 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Raisa Bruner", "title": "These Are the Best Moments of the 2022 TIME100 Gala", "description": "The Gala brought together notable names, including Zendaya, Andrew Garfield, and Simu Liu", "url": "https://time.com/6185569/time100-gala-best-moments/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/time-100-gala-2022-best-moments.jpg?quality=85&crop=0px%2C0px%2C2400px%2C1256px&resize=1200%2C628&strip", "publishedAt": "2022-06-09T05:00:03Z", "content": "Has Bill Gates ever tried boba tea?\r\nThat was the question posed to the billionaire tech mogul and philanthropist on Tuesday night at New York City’s Jazz at Lincoln Center by actor Simu Liu. Liu, th… [+5530 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Nik Popli", "title": "Sevgil Musaieva Explains How Simple Words Can Provide Comfort During War", "description": "\"I want to raise this toast to the simple and most important news we receive every day: 'I am alive.' 'Everything is fine with children.' 'Parents are healthy.' 'I love you.'\"", "url": "https://time.com/6185624/sevgil-musaieva-time100-gala/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/time-100-gala-sevgil-musaieva.jpeg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-09T04:02:28Z", "content": "During times of war, sometimes the simplest of words—”I love you” or “I miss you”—can mean so much. 2022 TIME100 member Sevgil Musaieva knows this better than most. She paid tribute to these simple m… [+4496 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Raisa Bruner", "title": "Mary J. Blige Brings TIME100 Gala Guests to Their Feet", "description": "Mary J. Blige knows how to get a party started, and how to end one with a bang. The singer, songwriter, and actor—and 2022 TIME100 honoree—closed out the TIME100 Gala.", "url": "https://time.com/6184758/mary-j-blige-time100-gala/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/time-100-gala-2022-mary-j-blige-02.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-09T03:56:10Z", "content": "Mary J. Blige knows how to get a party started, and how to end one with a bang. The singer, songwriter, and actor—and 2022 TIME100 honoree—closed out the TIME100 Gala on Wednesday night in New York C… [+2715 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Julia Zorthian", "title": "Andrew Garfield Wants to Solve the World’s ‘Epidemic of Meaningless’", "description": "\"There might be an epidemic of meaninglessness,\" he posited at the TIME100 Gala", "url": "https://time.com/6185583/andrew-garfield-time100-gala/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/20220608_TIME100_0906.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-09T03:28:42Z", "content": "“There might be an epidemic of artlessness and meaninglessness we have to address. \r\nI think there’s been a movement psychologically away from soul. We have one of our great soul artists down there, … [+727 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Simmone Shah", "title": "Questlove Pays Tribute to Wordle at the TIME100 Gala", "description": "Ahmir \"Questlove\" Thompson spoke about finding joy through Wordle in a toast at the 2022 TIME100 Gala in New York .", "url": "https://time.com/6185617/questlove-wordle-time100-gala/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/20220608_TIME100_0669.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-09T03:04:00Z", "content": "Ahmir “Questlove” Thompson spoke about finding joy through Wordle in a toast at the 2022 TIME100 Gala in New York on Wednesday evening. \r\n“No one has been the same since 2020,” said the 2022 TIME100 … [+2126 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Megan McCluskey", "title": "See the Best Photos From the 2022 TIME100 Gala", "description": "Ahead of the show, nine-time-Grammy-winning musician Mary J. Blige arrived for her performance looking fabulous in a flowing turquoise heart dress.", "url": "https://time.com/6185482/time-100-gala-2022-photos/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/time-100-gala-2022-best-of-01.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-09T02:46:24Z", "content": "The TIME100 Gala brought together some of the most influential people in the world Wednesday to celebrate the annual TIME100 list.\r\nFrom Emmy-winning actress Zendaya to NBA champion Dwayne Wade to Am… [+1518 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Nik Popli", "title": "Indian Lawyer Karuna Nundy Warns Patriarchy Is ‘Coming Back Like a Cancer and Metastasizing in Court Judgements’", "description": "Karuna Nundy warned Wednesday that laws designed to restrict the rights of women continue to do harm, thanks to patriarchal courts. Speaking at the TIME100 Gala in front of a room full of some of the world’s most influential people, Nundy told an emotional st…", "url": "https://time.com/6185622/karuna-nundy-india-time100-gala/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/time-100-gala-karuna-nundy.jpeg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-09T02:36:46Z", "content": "Karuna Nundy warned Wednesday that laws designed to restrict the rights of women continue to do harm, thanks to patriarchal courts.\r\nSpeaking at the TIME100 Gala in front of a room full of some of th… [+2317 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Julia Zorthian", "title": "Quinta Brunson at the TIME100 Gala: Teachers Deserve to Be Paid More", "description": "The writer, producer, comedian and actor behind the breakout hit Abbott Elementary called for higher salaries for teachers at the TIME100 Gala.", "url": "https://time.com/6185632/quinta-brunson-pay-teachers-more-time100-gala/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/time-100-gala-quinta-brunson.jpeg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-09T02:29:51Z", "content": "Quinta Brunson—the writer, producer, comedian and actor behind the breakout hit Abbott Elementary—called for higher salaries for teachers to applause at the TIME100 Gala Wednesday evening. “I play a … [+6029 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Volodymyr Zelensky", "title": "Zelensky: The World’s Most Influential People Should Be Using Their Influence to Defend Freedom", "description": "The President of Ukraine made a video address to the TIME 100 Gala in New York City on June 8. Here are his remarks in full.", "url": "https://time.com/6185347/volodymyr-zelensky-time100-gala/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/zelensky-speech.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-09T02:17:55Z", "content": "Editor’s note: Volodymyr Zelensky, the President of Ukraine, made a video address to the TIME100 Gala on Wednesday in New York City. The video will air on TIME100: The World’s Most Influential People… [+7819 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Raisa Bruner", "title": "Miranda Lambert Kick Off the 2022 TIME100 Gala With Her Signature Heartfelt Style", "description": "Miranda Lambert touched down in New York City to offer a taste of Nashville to the attendees of the 2022 TIME100 Gala at Jazz at Lincoln Center.", "url": "https://time.com/6184752/miranda-lambert-time100-gala-2022/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/time-100-gala-miranda-lambert-02.jpeg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-09T01:31:05Z", "content": "Fresh off the release of her eighth studio album Palomino—and ahead of her fall Las Vegas residency—beloved country star Miranda Lambert touched down in New York City to offer a taste of Nashville to… [+2941 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Julia Zorthian", "title": "Eileen Gu Hopes She Can Bring the World Together With the Olympics", "description": "The Olympic freestyle skiing champion, who grew up in the U.S. and now skis for China, appeared on the red carpet at the TIME100 Gala.", "url": "https://time.com/6185577/eileen-gu-olympics-time100-gala/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/time-100-gala-2022-eileen-gu.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-09T01:20:37Z", "content": "﻿Eileen Gu believes sports can help bring together people and countries across the world. And she wants to be a part of that work.\r\n“I have always said that sports are this unique avenue to global co… [+2903 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Simmone Shah", "title": "‘You Do Belong.’ Ariana DeBose’s Powerful Message to the LGBTQ Community at the TIME100 Gala", "description": "Ariana DeBose spoke about the importance of celebrating the LGBTQ community amid political turmoil in a toast at the 2022 TIME100 Gala.", "url": "https://time.com/6185611/ariana-debose-time100-gala/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/time-100-gala-2022-ariana-debose.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-09T00:45:54Z", "content": "Ariana DeBose spoke about the importance of celebrating the LGBTQ community amid political turmoil in a toast at the 2022 TIME100 Gala in New York on Wednesday evening in New York City.\r\n“I’m so incr… [+5221 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Stephanie Zacharek", "title": "Jurassic World Dominion‘s Overstuffed Plot Leaves No Room For Its Main Draw—the Dinos", "description": "The point of entertainment is not to wear you down, but you’d never know it from watching Jurassic World Dominion, directed by Colin Trevorrow. This is the sixth Jurassic Park movie overall and the third to hit, with its mighty, gnarled toes, since the franch…", "url": "https://time.com/6185553/jurassic-world-dominion-review/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/2512_D091_00175R.jpeg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-08T20:22:25Z", "content": "The point of entertainment is not to wear you down, but you’d never know it from watching Jurassic World Dominion, directed by Colin Trevorrow. This is the sixth Jurassic Park movie overall and the t… [+5313 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Stephanie Zacharek", "title": "You Might Predict Every Move in Hustle, But That Doesn’t Make It Any Less Enjoyable", "description": "There’s a certain type of movie you could swear you’ve seen a million times before, one that hits so many familiar beats you can pretty much predict the next one, and the one after that. The basketball drama Hustle, starring Adam Sandler as a longtime scout w…", "url": "https://time.com/6185184/hustle-review-adam-sandler/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/HUSTLE_UNIT_033_19649.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-08T19:24:46Z", "content": "There’s a certain type of movie you could swear you’ve seen a million times before, one that hits so many familiar beats you can pretty much predict the next one, and the one after that. The basketba… [+4924 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Philip Elliott", "title": "California Democrats Were in a NIMBY Mood on Tuesday", "description": "Efforts to remake the justice system in the wake of the Black Lives Matter movement collided with fears of surging crime and lawlessness.", "url": "https://time.com/6185537/democrats-california-crime-elections/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1240630308.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-08T18:55:21Z", "content": "This article is part of The D.C. Brief, TIME’s politics newsletter. Sign up here to get stories like this sent to your inbox.\r\nTuesday’s results in California could have hardly been more unambiguous.… [+4923 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Shannon Carlin", "title": "Laura Dern on Jurassic Park and the Pressure of Reviving an Iconic Character", "description": "It’s been nearly 30 years since Laura Dern starred in Jurassic Park, but to many fans, she’ll always be paleobotanist Dr. Ellie Satler. It’s why she felt a little nervous to step back into the role for Jurassic World: Dominion, in theaters June 10. She knew h…", "url": "https://time.com/6184911/laura-dern-jurassic-world-dominion-interview/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/LauraDern_10q.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-08T18:20:59Z", "content": "It’s been nearly 30 years since Laura Dern starred in Jurassic Park, but to many fans, she’ll always be paleobotanist Dr. Ellie Satler. It’s why she felt a little nervous to step back into the role f… [+8969 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "AJ Dellinger", "title": "8 Underrated Streaming Services to Satiate Your Viewing Appetite", "description": "Netflix, Hulu, Amazon Prime Video, Disney+: these are the streaming services that everyone knows. They’re like the modern-day equivalent of basic cable channels—they reach the biggest audience and have the most-watched shows. But just like basic cable channel…", "url": "https://time.com/6185488/underrated-streaming-services/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/UnderratedStreaming-platforms.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-08T17:30:57Z", "content": "Netflix, Hulu, Amazon Prime Video, Disney+: these are the streaming services that everyone knows. They’re like the modern-day equivalent of basic cable channels—they reach the biggest audience and ha… [+5576 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Viktor Mayer-Schönberger and Thomas Ramge", "title": "Big Tech Is Hoarding the Data that Humanity Needs to Thrive", "description": "In September 1983, a Korean commercial airliner with 269 souls on board strayed off course and into Soviet airspace. It was intercepted by a Soviet fighter jet, then shot down with a deadly air-to-air missile. Everyone on board perished. To prevent such trage…", "url": "https://time.com/6185433/big-tech-hoarding-data-humanity-needs/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/data-big-tech-possibility.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-08T16:14:41Z", "content": "In September 1983, a Korean commercial airliner with 269 souls on board strayed off course and into Soviet airspace. It was intercepted by a Soviet fighter jet, then shot down with a deadly air-to-ai… [+4970 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Judy Berman", "title": "HBO’s The Janes Is Essential Viewing for a Post-Roe America", "description": "The timeliness of the film is crushing but crucial. With many states poised to outlaw abortion as soon as this summer, every American needs to understand what drove the Janes to take action.", "url": "https://time.com/6185173/the-janes-review-hbo/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/Members-of-The-Jane.jpg?quality=85&w=640&h=222&crop=1", "publishedAt": "2022-06-08T15:09:54Z", "content": "For those of us who weren’t around to remember what it was like before the Supreme Court upheld Americans’ right to safe, legal abortion, the imagery we associate with the pre-Roe-v.-Wadeera is carto… [+6672 chars]"}]}