{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Akron Police Release Video Showing Officers Chasing and Shooting Jayland Walker", "description": "Akron police released video of the shooting of Jayland Walker who was killed June 27 in a pursuit that had started with an attempted traffic stop", "url": "https://time.com/6193571/jayland-walker-akron-police-shooting-video/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/jayland-walker-shooting-akron.jpeg?quality=85&crop=0px%2C0px%2C2400px%2C1256px&resize=1200%2C628&strip", "publishedAt": "2022-07-04T02:45:41Z", "content": "AKRON, Ohio — A Black man was unarmed when Akron police chased him on foot and killed him in a hail of gunfire, but officers believed he had shot at them earlier from a vehicle and feared he was prep… [+4751 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "DARLENE SUPERVILLE / AP", "title": "President Biden to Award Medal of Freedom to Simone Biles, John McCain and 15 Others", "description": "President Joe Biden will present the nation’s highest civilian honor, the Presidential Medal of Freedom, to 17 people, including actor Denzel Washington, gymnast Simone Biles and the late John McCain, the Arizona Republican with whom Biden served in the U.S. …", "url": "https://time.com/6193564/president-biden-to-award-medal-of-freedom-biles-mccain/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/biles.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-03T20:14:58Z", "content": "WASHINGTON — President Joe Biden will present the nation’s highest civilian honor, the Presidential Medal of Freedom, to 17 people, including actor Denzel Washington, gymnast Simone Biles and the lat… [+5505 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Several People Shot at Copenhagen Shopping Mall: Authorities", "description": "Copenhagen police said that one person has been arrested in connection with the shooting at the Field’s shopping mall, which is close to the city's airport", "url": "https://time.com/6193556/copenhagen-mall-shooting/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/Copenhagen.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-03T18:43:24Z", "content": "COPENHAGEN, Denmark — Danish police said Sunday that several people were shot at a Copenhagen shopping mall, one of the largest in Scandinavia.\r\nCopenhagen police said that one person has been arrest… [+2112 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "OLEKSANDR STASHEVSKYI and FRANCESCA EBEL / AP", "title": "Russia Claims Control Over Last Ukrainian Stronghold in Luhansk Region", "description": "Ukraine's General Staff of the military reported that its forces had withdrawn from Lysychansk in Luhansk province, but the president said the fight for the city was ongoing", "url": "https://time.com/6193547/russia-claims-last-ukrainian-stronghold-luhansk-region/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/Ukraine.jpg?quality=85&w=1024&h=588&crop=1", "publishedAt": "2022-07-03T17:51:52Z", "content": "KYIV, Ukraine — Russia claimed control Sunday over the last Ukrainian stronghold in an eastern province that is key to achieving a major goal of its grinding war.\r\nUkraine’s General Staff of the mili… [+3752 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Time", "title": "‘Minions: The Rise of Gru’ Sets Box Office on Fire With $108.5 Million Debut", "description": "Families went bananas for Minions this weekend at the movie theater. “ Minions: The Rise of Gru ” brought in an estimated $108.5 million in ticket sales from 4,391 screens in North America, Universal Pictures said Sunday. By the end of the Monday’s July Fourt…", "url": "https://time.com/6193541/minions-debut-box-office/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/minions.jpg?quality=85&w=1024&h=524&crop=1", "publishedAt": "2022-07-03T17:28:01Z", "content": "Families went bananas for Minions this weekend at the movie theater. “Minions: The Rise of Gru” brought in an estimated $108.5 million in ticket sales from 4,391 screens in North America, Universal P… [+4491 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Texas Gunman Kills 2, and Wounds 3 Police Officers", "description": "A gunman killed two people and wounded four others, including three police officers, before taking his own life in a home in the Dallas-Fort Worth area, police said Sunday.", "url": "https://time.com/6193531/texas-shooter-kills-2-wounds-officers/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1291135403.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-03T16:02:11Z", "content": "HALTOM CITY, Texas — A gunman killed two people and wounded four others, including three police officers, before taking his own life in a home in the Dallas-Fort Worth area, police said Sunday.\r\nHalt… [+1747 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Four Killed After Alpine Glacier Chunk Strikes Hikers", "description": "A large chunk of Alpine glacier broke loose Sunday afternoon and slid down a mountainside, slamming into more than a dozen hikers on a popular trail on the peak. At least four people were killed, Italy's state television said, and seven others were injured.", "url": "https://time.com/6193527/four-killed-alpine-glacier-strikes-hikers/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/italy.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-03T15:45:17Z", "content": "ROME — A large chunk of Alpine glacier broke loose Sunday afternoon and slid down a mountainside in Italy, sending ice, snow and rock slamming into hikers on a popular trail on the peak killing at le… [+1902 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Belinda Luscombe", "title": "Henry Kissinger: The Internet Does Not Make Great Leaders", "description": "In his new book Kissinger examines six world leaders who inherited difficult geopolitical situations, and in his view, overcame and improved them", "url": "https://time.com/6193035/henry-kissinger-leaders/", "urlToImage": "https://api.time.com/wp-content/uploads/2021/11/henry-kissinger-eric-schmidt.jpg?quality=85&crop=0px%2C345px%2C2400px%2C1256px&resize=1200%2C628&strip", "publishedAt": "2022-07-03T11:00:36Z", "content": "Henry Kissinger, the 98-year-old, Nobel-Peace-Prize-winning, Monty Python-inspiring, former U.S. Secretary of State, believes that, perhaps more than any time since the Age of Enlightenment, the worl… [+14688 chars]"}]}