{"status": "ok", "totalResults": 28, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "ANDREA RODRÍGUEZ / AP", "title": "Rescuers Search for Victims at Cuba Hotel After Blast Kills 25", "description": "Rescuers in Cuba’s capital searched Saturday to find survivors of an explosion that killed at least 25 people and devastated a luxury hotel that once hosted dignitaries and celebrities, including Beyoncé and Jay-Z.", "url": "https://time.com/6174589/havana-blast-cuba/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/explosion.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-07T13:16:08Z", "content": "HAVANA — Rescuers in Cuba’s capital searched Saturday to find survivors of an explosion that killed at least 25 people and devastated a luxury hotel that once hosted dignitaries and celebrities, incl… [+4890 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Emily Galvin-Almanza", "title": "The Critical Role of Public Defenders in a Post-Roe v. Wade World", "description": "The debate over fetal rights is an old one, and at least 38 states already have some form of fetal-harm laws in place that make it a crime to hurt a fetus. Under Roe v. Wade, these laws are required to exempt abortion from punishment. But if Roe is overturned…", "url": "https://time.com/6174185/abortion-criminalization-public-defenders/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/post-roe-public-defenders.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-07T13:00:06Z", "content": "The debate over fetal rights is an old one, and at least 38 states already have some form of fetal-harm laws in place that make it a crime to hurt a fetus. Under Roe v. Wade, these laws are required … [+8274 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eliza Berman", "title": "On Losing a Mom, Then Becoming One", "description": "I was binging yet another of Netflix’s dime-a-dozen puzzle-box mystery shows recently when I felt a pang in my gut. One character was revealed to be a grown-up version of a seemingly distinct character, seeking an arguably unethical vengeance for a decades-ol…", "url": "https://time.com/6173530/mothers-day-losing-mom/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/motherhood.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-07T12:00:12Z", "content": "I was binging yet another of Netflix’s dime-a-dozen puzzle-box mystery shows recently when I felt a pang in my gut. One character was revealed to be a grown-up version of a seemingly distinct charact… [+5771 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eric Holder and Sam Koppelman", "title": "The Supreme Court Was Broken Long Before the Leak", "description": "The NAACP Legal Defense and Educational Fund (LDF) is responsible for winning some of the most important cases in the history of the United States—but one of the most impressive testaments to the organization’s strength is the fact that it survived the “Summe…", "url": "https://time.com/6174465/eric-holder-supreme-court-broke/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1395625554.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-07T11:00:16Z", "content": "The NAACP Legal Defense and Educational Fund (LDF) is responsible for winning some of the most important cases in the history of the United States—but one of the most impressive testaments to the org… [+14308 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Amie Ferris-Rotman", "title": "‘I Can’t Say No to Mothers in Need.’ The Foreign Women Joining Ukraine’s Fight Against Russia", "description": "Scores of foreign women have gone to Ukraine to fight. 'Putin is insane and unstable,' says one British mother of two, headed to the front lines.", "url": "https://time.com/6174161/foreign-women-fighters-ukraine-volunteers/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/hannah-jarvis_01.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-07T11:00:11Z", "content": "Sandra Anderson Eira doesn’t go short of appreciation. Fighting on the front line in Ukraine, the 35-year-old says locals have given her chocolate, roses, and even pairs of socks.\r\n“There have also b… [+7155 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Tomris Laffly", "title": "The Director Behind Happening on Making a ‘Vital’ Film About a Woman Seeking an Illegal Abortion", "description": "Winner of the 2021 Golden Lion award at the Venice Film Festival, writer-director Audrey Diwan’s unflinching and suspense-ridden Happening follows its young female protagonist, Anne (Anamaria Vartolomei), a helpless middle-class college student who desperatel…", "url": "https://time.com/6174169/happening-audrey-diwan-interview/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/happening-audrey-diwan.jpg?quality=85&w=800&h=533&crop=1", "publishedAt": "2022-05-06T22:01:32Z", "content": "Winner of the 2021 Golden Lion award at the Venice Film Festival, writer-director Audrey Diwan’s unflinching and suspense-ridden Happening follows its young female protagonist, Anne (Anamaria Vartolo… [+5547 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jasmine Aguilera", "title": "Border Patrol Agents Will No Longer Be Able to Investigate Themselves", "description": "United States Customs and Border Protection (CBP) issued a memo Friday ending a controversial Border Patrol oversight team charged with investigating incidents involving border enforcement personnel. Instead, investigations will be turned over to the Office o…", "url": "https://time.com/6174485/border-patrol-accountability/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Border-Parol-Agent-Calexico.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-06T21:42:19Z", "content": "United States Customs and Border Protection (CBP) issued a memo Friday ending a controversial Border Patrol oversight team charged with investigating incidents involving border enforcement personnel.… [+3363 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Sean Gregory", "title": "$125,000 Hotel Rooms. $23,000 Tickets. Formula 1 Makes Its American Arrival", "description": "This weekend Formula 1 will make its Miami debut, replete with South Beach excess. The $2 billion racing circuit, which holds events all over the globe, is booming in America, as evidenced by seats to the May 8 Miami Grand Prix—sponsored by Crypto.com—going f…", "url": "https://time.com/6174064/formula-1-miami-grand-prix/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/miami-formula1.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-06T20:41:40Z", "content": "This weekend Formula 1 will make its Miami debut, replete with South Beach excess. The $2 billion racing circuit, which holds events all over the globe, is booming in America, as evidenced by seats t… [+5316 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Stephanie Zacharek", "title": "Two Former Mr. Darcys Delight in Netflix Espionage Caper Operation Mincemeat", "description": "Even the most imaginative spy novelist couldn’t have made it up: In 1943 a motley group of British operatives created an elaborate false identity for a corpse, which they then sent awash on a beach in Spain, with the aim of throwing the Nazis off the trail of…", "url": "https://time.com/6174411/operation-mincemeat-review-netflix/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/OM_GK_13032020_05202.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-06T20:18:42Z", "content": "Even the most imaginative spy novelist couldn’t have made it up: In 1943 a motley group of British operatives created an elaborate false identity for a corpse, which they then sent awash on a beach i… [+3235 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Andrea Rodríguez / AP", "title": "Powerful Blast at Havana Hotel Kills at Least 8, Injures 40", "description": "The explosion apparently caused by a natural gas leak blew away outer walls from a five-star hotel in the heart of Cuba’s capital.", "url": "https://time.com/6174473/havana-hotel-blast/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/havana-hotel-blast-1.jpg?quality=85&crop=0px%2C371px%2C8640px%2C4523px&resize=1200%2C628&strip", "publishedAt": "2022-05-06T20:15:35Z", "content": "HAVANA — A powerful explosion apparently caused by a natural gas leak Friday killed at least eight people and injured 40 when it blew away outer walls from a five-star hotel in the heart of Cuba’s ca… [+3291 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Ailbhe Smyth", "title": "How One of Ireland’s Leading Abortion Rights Activists Sees the Future of Roe", "description": "Like many people I was not surprised at the publication of a leaked document suggesting that a majority of the U.S. Supreme Court is on the brink of overturning Roe v. Wade. Although I think the extent to which Justice Alito absolutely wrote off Roe v. Wade e…", "url": "https://time.com/6174249/ireland-abortion-rights-roe-v-wade/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Ailbhe-Smyth-Ireland-Repeal.jpg?quality=85&w=1024&h=623&crop=1", "publishedAt": "2022-05-06T20:01:43Z", "content": "Like many people I was not surprised at the publication of a leaked document suggesting that a majority of the U.S. Supreme Court is on the brink of overturning Roe v. Wade. Although I think the exte… [+4879 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jeffrey Kluger", "title": "More Cosmic Saber-Rattling From Russia’s Space Boss", "description": "Dmitry Rogozin, head of Roscosmos, says his country will dissolve its partnership in space with the U.S. over Western sanctions.", "url": "https://time.com/6174331/rogozin-threatens-space-station/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Rogozin-and-Putin.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-06T19:07:11Z", "content": "The Russian invasion of Ukraine continues to extend its reach—not just around the world, but into space. For that we have Dmitry Rogozin—an intemperate man in what demands to be a temperate business—… [+3335 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Abigail Abrams", "title": "After Supreme Court Leak, Republican-led States Ready Legislation to Ban or Criminalize Abortion", "description": "Less than 48 hours after a leaked draft decision showing the Supreme Court set to overturn Roe v. Wade, Republicans in the Louisiana House of Representatives advanced a bill classifying abortion as homicide from “the moment of fertilization” and allowing pros…", "url": "https://time.com/6174148/republican-states-abortion-bans-roe-v-wade/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/conservative-roe-v-wade-1.jpg?quality=85&crop=0px%2C258px%2C2400px%2C1256px&resize=1200%2C628&strip", "publishedAt": "2022-05-06T18:27:46Z", "content": "Less than 48 hours after a leaked draft decision showing the Supreme Court set to overturn Roe v. Wade, Republicans in the Louisiana House of Representatives advanced a bill classifying abortion as h… [+10630 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eloise Barry", "title": "The True Story Behind Operation Mincemeat", "description": "Starring Colin Firth and Matthew Macfadyen, the movie dramatizes the British secret services' fantastical plot to deceive the Nazis in WWII.", "url": "https://time.com/6174289/operation-mincemeat-netflix-true-story/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/operation-mincemeat-netflix.jpg?quality=85&crop=0px%2C0px%2C2400px%2C1256px&resize=1200%2C628&strip", "publishedAt": "2022-05-06T17:44:32Z", "content": "Operation Mincemeat—a historical drama chronicling an audacious World War II plot by the British intelligence services to dupe the Nazis—drops on Netflix May 11. Starring Colin Firth and Succession’s… [+6066 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Indiana Man Charged With Wife’s Murder Prevails in Local GOP Primary", "description": "Andrew Wilhoite has been held in jail without bond since his arrest in late March in the death of 41-year-old Elizabeth “Nikki” Wilhoite.", "url": "https://time.com/6174389/indiana-murder-gop-primary/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/indiana-murder-gop-primary.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-06T17:42:14Z", "content": "LEBANON, Ind. — A central Indiana man charged with murder in connection with the March death of his wife is one of three candidates who advanced in a primary election this week for a township board.\r… [+1627 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Britain Pushes Tough Tech Rules Under New Digital Watchdog", "description": "Big tech companies would have to comply with tough rules under a new digital watchdog aimed at giving consumers more choice online", "url": "https://time.com/6174373/britain-tech-digital-watchdog/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/britain-tech-digital-watchdog.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-06T17:33:01Z", "content": "LONDON — Big tech companies like Google and Facebook parent Meta would have to comply with tough British rules under a new digital watchdog aimed at giving consumers more choice online — or face the … [+2136 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jeremi Suri", "title": "Our Nation Is Still Divided Along the Battle Lines of the Civil War", "description": "Worries about a new civil war in the United States are misplaced because the Civil War never fully ended. That is essential knowledge for understanding current political divisions, especially the recriminations surrounding the leaked draft Supreme Court Roe d…", "url": "https://time.com/6174297/america-divided-civil-war/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1230505137.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-06T16:52:33Z", "content": "Worries about a new civil war in the United States are misplaced because the Civil War never fully ended. That is essential knowledge for understanding current political divisions, especially the rec… [+7001 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Ciara Nugent", "title": "India’s Unbearably Hot Schools Show We Must Climate-Proof Education", "description": "A heat wave has forced schools in Northern India to close again after two years of disruption by COVID-19.", "url": "https://time.com/6174322/india-schools-heat-climate-change/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/india-heat-schools.jpg?quality=85&crop=0px%2C127px%2C2400px%2C1256px&resize=1200%2C628&strip", "publishedAt": "2022-05-06T16:49:34Z", "content": "School’s about to be out for the summer in India—weeks earlier than planned. The sweltering spring heatwave that has built across the subcontinent since March has in recent days forced several north … [+5687 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Philip Elliott", "title": "‘I Have Earned Where I Am Right Now.’ Symone Sanders Talks to TIME Ahead of the Launch of Her MSNBC Show", "description": "Symone Sanders talks with TIME ahead of the debut of her MSNBC show. \"Hillary Clinton was more qualified than all these em-effers.\"", "url": "https://time.com/6174321/symone-sanders-msnbc-kamala-harris/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Symone-Sanders.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-06T16:48:05Z", "content": "This article is part of The D.C. Brief, TIME’s politics newsletter. Sign up here to get stories like this sent to your inbox.\r\nIf ever there were doubts that Symone Sanders doesn’t phone anything in,… [+11604 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Olivia B. Waxman", "title": "She Lost Her Family in the Holocaust. She Finally Knows the Name Her Parents Gave Her", "description": "Decades after the end of World War II, a Florida Holocaust museum tracked down a Holocaust survivor's birth name. Here's how.", "url": "https://time.com/6172605/holocaust-survivor-birth-name/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Mary-Wygodski-DiT-2021.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-06T16:00:18Z", "content": "More than 75 years since V-E Day—the May 8, 1945, celebrations marking the end of World War II in Europe and the surrender of Nazi Germany—Holocaust survivors are still recording their stories for fu… [+4211 chars]"}]}