{"status": "ok", "totalResults": 27, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Charlie Campbell", "title": "Japan and South Korea’s Attendance at the Upcoming NATO Summit Could Worsen Global Tensions", "description": "From June 28-30, Tokyo and Seoul will attend a NATO summit, as observers, for the first time. The move risks worsening global tensions.", "url": "https://time.com/6188414/japan-south-korea-nato-summit/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1238522379.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-17T03:12:36Z", "content": "As the military conflict in Ukraine bogs down on a slice of the embattled nation’s eastern and southern periphery, the geopolitical shift sparked by Russia’s Feb. 24 invasion keeps gaining new ground… [+6123 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Brian Bennett", "title": "From Taunts and Lies to an Angry Mob: Jan. 6 Panel Details Trump’s Pressure Campaign Against Pence", "description": "The Jan. 6 committee said Trump recklessly endangered Mike Pence’s life and that the mob got within 40 feet of him.", "url": "https://time.com/6188551/pence-pressure-jan-6-trump/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1403310551.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-17T00:17:29Z", "content": "On the morning of Jan. 6, 2021, Mike Pence was praying with his staff inside the Vice Presidential residence at the Naval Observatory compound in Washington. They knew it was going to be a difficult … [+5672 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Nik Popli", "title": "Why It Could Be a Long Time Before Gas Prices Come Down", "description": "Gas prices just topped $5 a gallon. The global factors pushing up oil prices are unlikely to ease anytime soon.", "url": "https://time.com/6188569/gas-prices-oil/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1402425621.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-16T22:11:04Z", "content": "Gasoline prices hit $5 a gallon on average for the first time in U.S. history this week, and there’s little sign that relief is coming soon.\r\nThe pain can be felt at pumps across the country, but dri… [+6391 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Sean Gregory", "title": "Saudi Arabia’s Influence on Golf Is the Talk of the U.S. Open. It Might Be Here to Stay", "description": "At the U.S. Open, Saudi Arabia's influence in golf is center stage. TIME talks to the reporter who brought it to light", "url": "https://time.com/6188284/us-open-phil-mickelson-alan-shipnuck/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1403126302.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-16T22:09:26Z", "content": "In late November of last year, while driving up I-5 north of Los Angeles, golf journalist Alan Shipnuck received the phone call that would shake up the sport in 2022. Phil Mickelson, the six-time maj… [+14539 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Lindsay Lee Wallace", "title": "How Queer as Folk Became the Defining Gay TV Show of a Generation—Twice", "description": "In an era of increasingly frequent—if often imperfect—queer representation in media, it might be difficult for the young target audience of Peacock’s new reboot of the classic Queer as Folk to imagine that a show following a group of gay men in Pittsburgh liv…", "url": "https://time.com/6188510/queer-as-folk-gay-television/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/queer-as-folk-3.jpeg?quality=85&w=800&h=600&crop=1", "publishedAt": "2022-06-16T21:31:55Z", "content": "In an era of increasingly frequent—if often imperfect—queer representation in media, it might be difficult for the young target audience of Peacock’s new reboot of the classic Queer as Folk to imagin… [+7455 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eric Cortellessa", "title": "Eastman Told Trump That Pence Plan for Jan. 6 Was Illegal", "description": "John Eastman also requested a pardon from Trump in the days after the Capitol riot, the Jan. 6 Committee revealed.", "url": "https://time.com/6188491/john-eastman-jan-6-testimony-trump/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1403312373.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-16T20:34:59Z", "content": "The House committee investigating the Jan. 6, 2021, attack on the U.S. Capitol dedicated a crucial portion of its third hearing Thursday to demonstrating that former President Donald Trump’s plan to … [+3870 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Kurt Wagner, Ed Ludlow and Maxwell Adler/Bloomberg", "title": "Elon Musk Addresses Twitter Staff For First Time Since Bid to Buy Platform", "description": "Musk says people should be allowed to say “pretty outrageous things” but that the platform doesn’t have to give those posts reach.", "url": "https://time.com/6188425/elon-musk-staff-twitter-tweets/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/elon-musk-staff-twitter-tweets.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-16T20:22:20Z", "content": "Elon Musk discussed his stance on what types of content should be allowed on Twitter Inc.’s social network, saying that people should be allowed to say “pretty outrageous things” but that the platfor… [+3759 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Sanya Mansoor", "title": "Here’s All the World Leaders Who Have Visited Ukraine", "description": "A running tally after the Germany's Olaf Scholz, France's Emmanuel Macron, and Italy's Mario Draghi arrived in Kyiv today.", "url": "https://time.com/6188365/scholz-macron-draghi-visit-ukraine/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1241345828.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-16T17:58:09Z", "content": "Four European leaders became the latest heads of state to visit Ukraine Thursday as it continues to fend off Russian forces that have recently made significant advances in the country’s southern and … [+4283 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Markham Heid", "title": "The Truth About Fasting and Type 2 Diabetes", "description": "Most fad diets don’t live up to the hype, let alone serious scientific scrutiny. But intermittent fasting seems to be an exception. These plans involve going without caloric foods or drinks for an extended period of time—anywhere from 16 hours to several days…", "url": "https://time.com/6188405/type-2-diabetes-intermittent-fasting/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1334385759.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-16T17:26:31Z", "content": "Most fad diets don’t live up to the hype, let alone serious scientific scrutiny. But intermittent fasting seems to be an exception. These plans involve going without caloric foods or drinks for an ex… [+11320 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Megan McCluskey", "title": "Trump’s Social Platform Is Still Floundering Despite Boost from Jan. 6 Hearings", "description": "Downloads of Donald Trump’s TRUTH Social app spiked after the former president made an appearance on the struggling platform with a series of tirades in protest of the January 6 hearings. But the pace of TRUTH’s growth—and its impact—could depend on whether T…", "url": "https://time.com/6186566/trump-truth-social-jan-6-hearings/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/january-6th-hearing.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-16T17:15:25Z", "content": "Downloads of Donald Trump’s TRUTH Social app spiked after the former president made an appearance on the struggling platform with a series of tirades in protest of the January 6 hearings. But the pac… [+4621 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eswar Prasad", "title": "Will the Crypto Crash Beget a Better Crypto Future?", "description": "The cryptocurrency winter, with prices of most crypto assets tumbling in recent months, has shone a harsh light on the fragility of Bitcoin and other crypto assets as stores of value. The notion that, unlike other risky assets, they will prove immune to chang…", "url": "https://time.com/6188396/crypto-crash-future/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1241318832.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-16T16:58:28Z", "content": "The cryptocurrency winter, with prices of most crypto assets tumbling in recent months, has shone a harsh light on the fragility of Bitcoin and other crypto assets as stores of value. The notion that… [+6977 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Ciara Nugent", "title": "Homes Made from Straw or Fungi Can Now Get You a Cheaper Mortgage in the Netherlands", "description": "A Netherlands-based bank is offering lower interest rates for mortgages on homes made from plant-based materials to fight climate change.", "url": "https://time.com/6188368/plant-based-construction-netherlands/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/Bio-based-materials.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-16T16:36:53Z", "content": "Lots of things can affect the interest rate you pay on your mortgage: your deposit amount, the state of the economy, your credit score. Now, there’s a new factor for Dutch homebuyers: what your home … [+5362 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "COVID-19 Deaths Rise, Reversing a 5-Week Decline, WHO Says", "description": "After five weeks of declining coronavirus deaths, the number of fatalities reported globally increased by 4% last week.", "url": "https://time.com/6188352/covid-deaths-rise-5-week-decline/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/covid-deaths-rise-5-week-decline.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-16T16:32:42Z", "content": "GENEVA — After five weeks of declining coronavirus deaths, the number of fatalities reported globally increased by 4% last week, according to the World Health Organization.\r\nIn its weekly assessment … [+2366 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Madison Muller / Bloomberg", "title": "Monkeypox Testing Shows the U.S. Learned Little from the COVID-19 Pandemic", "description": "U.S. testing for monkeypox is insufficient to determine how widespread the virus is and where new cases are, infectious disease experts say.", "url": "https://time.com/6188327/monkeypox-testing-covid-19-pandemic/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/monkeypox-testing.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-16T14:26:08Z", "content": "U.S. testing for monkeypox is insufficient to determine how widespread the virus is and where new cases are cropping up, according to infectious disease experts and advocates concerned about a sluggi… [+7666 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jeffrey Kluger", "title": "8-Month-Old Babies Recognize Wrongdoers and Seek to Punish Them", "description": "A new study finds that babies may understand morality and will seek to punish a wrongdoer—suggesting that morality is innate.", "url": "https://time.com/6187834/is-morality-innate/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/Baby-pointing.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-16T13:48:45Z", "content": "Human beings may be a savage species when we want to be, but we’re also an exceedingly moral one, with a highly evolved sense of right and wrong, good and bad, crime and consequences. Few things illu… [+4365 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Tom Murphy / AP", "title": "Abbott Baby Formula Factory Halts Production Again After Being Hit by Severe Storms", "description": "Abbott says it needs to assess damage and re-sanitize the Sturgis, Mich. factory after severe thunderstorms and heavy rains swept through southwestern Michigan.", "url": "https://time.com/6188298/abbott-baby-formula-factory-halts-production/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/abbott-baby-formula-factory.jpg?quality=85&crop=0px%2C129px%2C2401px%2C1257px&resize=1200%2C628&strip", "publishedAt": "2022-06-16T13:27:49Z", "content": "Severe weather has forced Abbott Nutrition to pause production at a Michigan baby formula factory that had just restarted after being closed for several months, contributing to a national shortage.\r\n… [+2818 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eliana Dockterman", "title": "The Big Business of Being a Peloton Instructor", "description": "During halftime at a Brooklyn Nets game in December, a cluster of 20- and 30-something women made a beeline for the court. John Legend and Chrissy Teigen were there, sitting in prime seats, but the couple wasn’t their target. These women were hoping to take a…", "url": "https://time.com/6187968/peloton-instructors-money-famous/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/peloton-trainer-time-final-02.jpg?quality=85&crop=0px%2C410px%2C1600px%2C836px&resize=1200%2C628&strip", "publishedAt": "2022-06-16T13:00:42Z", "content": "During halftime at a Brooklyn Nets game in December, a cluster of 20- and 30-something women made a beeline for the court. John Legend and Chrissy Teigen were there, sitting in prime seats, but the c… [+16379 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Billy Perrigo/London", "title": "Frances Haugen Calls for ‘Solidarity’ With Facebook Content Moderators in Conversation with Whistleblower Daniel Motaung", "description": "Facebook whistleblowers Frances Haugen and Daniel Motaung came from very different parts of the social media platform’s ecosystem, but when they met for the first time in front of an audience in London Tuesday, they shared a message for anyone who has witness…", "url": "https://time.com/6188272/frances-haugen-daniel-motaung-facebook-whistleblowers/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/C1423.00_55_37_21.Still001.png?w=1200&h=628&crop=1", "publishedAt": "2022-06-16T11:36:05Z", "content": "Facebook whistleblowers Frances Haugen and Daniel Motaung came from very different parts of the social media platform’s ecosystem, but when they met for the first time in front of an audience in Lond… [+4917 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Randi Weingarten", "title": "It’s Not Rich Kids Who Take Out Student Loans. Forgiving Debt Will Boost the Middle Class", "description": "This summer President Joe Biden has the rare opportunity to take a single meaningful action that would rebuild the American middle class, help close the racial wealth gap, and restore trust in both the federal government and in higher education: canceling stu…", "url": "https://time.com/6187629/cancel-student-debt-middle-class-biden-column/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/cancel-student-debt-biden.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-16T11:00:26Z", "content": "This summer President Joe Biden has the rare opportunity to take a single meaningful action that would rebuild the American middle class, help close the racial wealth gap, and restore trust in both t… [+3983 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Madeleine Carlisle", "title": "Right-Wing Groups Target Pride Events Amid Rising Anti-LGBTQ Rhetoric", "description": "Panda Dulce was just about to begin her Drag Queen Story Hour on Saturday in San Lorenzo, Calif., when a group of eight to 10 men marched into the library yelling homophobic and transphobic slurs. When the men arrived—including one wearing a shirt with an ima…", "url": "https://time.com/6188059/pride-lgbtq-protests-threats-violence/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/pride-events-harassment-02.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-16T11:00:13Z", "content": "Panda Dulce was just about to begin her Drag Queen Story Hour on Saturday in San Lorenzo, Calif., when a group of eight to 10 men marched into the library yelling homophobic and transphobic slurs. Wh… [+8076 chars]"}]}