{"status": "ok", "totalResults": 28, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Megan Durisin, Kim Chipman, Jen Skerritt and James Poole / Bloomberg", "title": "Wheat Crops Almost Everywhere Are Coming Under Threat From Extreme Weather", "description": "As Russia’s invasion chokes off Ukrainian wheat exports, pushing up food prices, the global harvest faces an added test: extreme weather.", "url": "https://time.com/6175997/wheat-food-weather-climate/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1240580012.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-12T06:41:58Z", "content": "As Russia’s invasion chokes off Ukrainian wheat exports, pushing up bread and noodle prices, the global harvest faces an added test: extreme weather.\r\nDroughts, flooding and heatwaves threaten output… [+5575 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "With the Pilot Down, a Passenger With ‘No Idea How to Fly’ Takes Over and Lands the Plane", "description": "The passenger took over the Cessna 208 after the pilot fell ill and, with help from an air traffic controller, safely landed in Florida.", "url": "https://time.com/6175993/passenger-lands-plane/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/AP22131662107620.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-12T06:13:16Z", "content": "WEST PALM BEACH, Fla. — A passenger with no flying experience radioed an urgent plea for help when the pilot of a small plane suddenly fell ill off Florida’s Atlantic coast, and was able to land the … [+2151 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Lisa Mascaro / AP", "title": "The Senate Fell Short in an Effort To Preserve Roe V. Wade Abortion Access", "description": "Few Republican senators spoke in favor of ending abortion access, but they embraced the filibuster to block the bill from advancing.", "url": "https://time.com/6175921/senate-filibuster-roe-wade-abortion/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/senate-filibuster-roe-wade-abortion.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-11T22:01:19Z", "content": "WASHINGTON — The Senate fell far short Wednesday in a rushed effort toward enshrining Roe v. Wade abortion access as federal law, blocked by a Republican filibuster in a blunt display of the nation’s… [+6866 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Renee Bracey Sherman", "title": "Voting Won’t Save Abortion Rights", "description": "In the wake of the Supreme Court’s leaked draft opinion declaring their decision to overrule Roe v. Wade and allow states to recriminalize abortion, Americans have turned to their pro-choice elected officials looking for a plan. While some local legislators h…", "url": "https://time.com/6175881/abortion-crisis-goes-beyond-voting/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/women-abortion-rights-democrats-voting.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-11T21:22:02Z", "content": "In the wake of the Supreme Court’s leaked draft opinion declaring their decision to overrule Roe v. Wade and allow states to recriminalize abortion, Americans have turned to their pro-choice elected … [+5426 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Max Carter-Oberstone", "title": "America’s Traffic Laws Give Police Way Too Much Power", "description": "There are roughly 20 million traffic stops every year, many for petty infractions—and these stops can quickly turn lethal.", "url": "https://time.com/6175852/pretextual-traffic-stops/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/traffic-stop.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-11T20:45:38Z", "content": "We’ll never know what Philando Castile was feeling when the police lights first flashed across his rearview mirror on a balmy night in the summer of 2016. But we can be reasonably certain of what he … [+6254 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jeffrey Kluger", "title": "Why So Many Young Adults with Depression Don’t Get Treatment", "description": "More than half of adults ages 18 to 25 who are suffering from depression don't get treatment. One major barrier, they say, is cost.", "url": "https://time.com/6175288/depression-untreated-young-adults/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/young-adult-depression.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-11T19:35:08Z", "content": "Depression affects more young adults than any other adult age group. Each year, 7.5% of U.S. adults suffer from at least one major depressive episode: characterized by persistent sadness, diminished … [+5412 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Megan Mccluskey", "title": "How to Remove Personal Information From Google Search", "description": "Google recently started allowing users to remove personal information like their phone number and email address from search results.", "url": "https://time.com/6173811/remove-personal-information-google-search/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Google-Search-Personal-Information.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-11T19:13:19Z", "content": "Google recently started allowing users to remove their personal information from search results, including their phone number, email, and home address. On Wednesday, the company announced at its annu… [+3168 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Charlotte Alter/Easton, Pa.", "title": "‘Our Blue-Collar Tough Guy.’ John Fetterman Charts a New Path for Democrats", "description": "John Fetterman walks into a brewery in Easton, Pa., with his arms outstretched like a wrestler. The state’s lieutenant governor—6 ft. 8 in., bald and goateed, wearing his trademark Carhartt sweatshirt and athletic shorts—doesn’t bother with his stump speech r…", "url": "https://time.com/6175747/john-fetterman-pennsylvania-senate-primary/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/fetterman-time-with.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-11T18:55:23Z", "content": "John Fetterman walks into a brewery in Easton, Pa., with his arms outstretched like a wrestler. The state’s lieutenant governor—6 ft. 8 in., bald and goateed, wearing his trademark Carhartt sweatshir… [+6468 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Nik Popli", "title": "Why So Many Tech Stocks Are Falling", "description": "Technology companies thrived when the pandemic began more than two years ago. But now, as much of the population returns to work and spends less time at home, the tech sector is suffering deep losses as investors fear that companies boosted by the pandemic ar…", "url": "https://time.com/6175464/why-tech-stocks-are-down/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/tech-stocks.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-11T18:34:40Z", "content": "Technology companies thrived when the pandemic began more than two years ago. But now, as much of the population returns to work and spends less time at home, the tech sector is suffering deep losses… [+7765 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Roman Catholic Cardinal and Pop Star Arrested by Hong Kong National Security Police", "description": "Cardinal Joseph Zen, singer-actress Denise Ho, lawyer Margaret Ng, and scholar Hui Po-keung were detained by Hong Kong’s National Security Police, the U.K.-based human rights group Hong Kong Watch said.", "url": "https://time.com/6175754/hong-kong-arrest-catholic-cardinal-national-security/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/hong-kong-arrest-cardinal.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-11T17:46:13Z", "content": "HONG KONG — Hong Kong authorities arrested a Roman Catholic cardinal, a singer and at least two others on Wednesday on suspicion of colluding with foreign forces to endanger China’s national security… [+3164 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Philip Elliott", "title": "Nebraska Proves Trump’s Blessing Alone Isn’t Always Enough", "description": "Trump's preferred candidate for Nebraska governor fell short on Tuesday in the wake of a groping scandal that even Trump couldn't wave away.", "url": "https://time.com/6175753/trump-nebraska-herbster-endorsements/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/trump-nebraska.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-11T17:32:25Z", "content": "This article is part of The D.C. Brief, TIME’s politics newsletter. Sign up here to get stories like this sent to your inbox.\r\nAt long last, there is a sign that Donald Trump’s showmanship alone isn’… [+4718 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Felicia Fonseca / AP", "title": "U.S. Identifies More Than 500 Deaths at Boarding Schools That Sought to Assimilate Native American Children", "description": "A study of Native American boarding schools that for over a century sought to assimilate Indigenous children into white society has identified more than 400 such schools and more than 50 associated burial sites.", "url": "https://time.com/6175738/native-american-boarding-school-deaths/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/native-american-schools-identified-us.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-11T17:30:22Z", "content": "FLAGSTAFF, Ariz. — A first-of-its-kind federal study of Native American boarding schools that for over a century sought to assimilate Indigenous children into white society has identified more than 4… [+4781 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Judy Berman", "title": "HBO Max’s The Time Traveler’s Wife Is a Multiverse of Badness", "description": "It’s not hard to see why this particular adaptation might’ve sounded like a good idea. But many of those on-paper pros have, in practice, turned out to be cons.", "url": "https://time.com/6174988/time-travelers-wife-review-hbo-max/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/theo-james-rose-leslie.jpg?quality=85&w=640&h=427&crop=1", "publishedAt": "2022-05-11T16:00:56Z", "content": "One day at work, a 28-year-old librarian meets the 20-year-old woman who will become his wife. The thing is, she already knows him—knows that they will fall in love, marry, spend many happy years tog… [+6152 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Krishan Francis / Associated Press", "title": "Sri Lanka Deploys Troops in Capital After Violence, Protests", "description": "A strict nationwide curfew has been in place since Monday, when pro-government mobs attacked peaceful protesters, triggering a wave of violence across the country.", "url": "https://time.com/6175658/sri-lanka-army-protests/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/sri-lanka-army.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-11T15:02:20Z", "content": "Sri Lankan authorities deployed armored vehicles and troops in the streets of the capital on Wednesday, two days after pro-government mobs attacked peaceful protesters, triggering a wave of violence … [+5163 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "KATHLEEN RONAYNE / AP", "title": "California Climate Plan Calls for All-Electric New Homes to Hit Carbon-Neutral Goal", "description": "The proposal also calls for the state cut the use of oil and gas by 91% by 2045.", "url": "https://time.com/6175644/california-climate-plan-electric-homes/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/california-fossil-fuels-climate-neutral-target.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-11T14:12:11Z", "content": "(SACRAMENTO, Calif.) — New homes built in California starting in 2026 need to be powered by all-electric furnaces, stoves and other appliances if California is to meet its ambitious climate change go… [+5172 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "WANJOHI KABUKURU / AP", "title": "Climate Change Will Make Droughts Longer, More Common, Says UN", "description": "While no region is be spared from drought, Africa is the hardest hit continent, with the Americas, India, and Australia also impacted", "url": "https://time.com/6175622/climate-change-worse-droughts/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/drought-climate-change-california.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-11T13:49:47Z", "content": "The frequency and duration of droughts will continue to increase due to human-caused climate change, with water scarcity already affecting billions of people across the world, the United Nations warn… [+2894 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Monica R. McLemore", "title": "I’m Still Wearing My N95 Mask Because I Care About Society’s Most Vulnerable", "description": "We have reduced the pandemic to individual behaviors and choices, but it's a collective problem. We're all in this together.", "url": "https://time.com/6174014/still-wearing-n95-mask/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/n95-mask.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-11T13:09:37Z", "content": "It doesn’t exactly feel cool to wear my N95 mask right now. Everywhere I go, Americans seem to have given up on essential and basic public-health strategies proven to reduce the risk of COVID-19—and … [+3450 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Justin Worland", "title": "This Is How We Quit Big Oil", "description": "At the end of the first quarter of 2021, as the CEOs of the three biggest U.S. oil and gas companies presented their firms’ earnings, investors fired off a range of questions about how they were addressing climate change. The market had already come to view f…", "url": "https://time.com/6175206/black-gold-fossil-fuel-industry/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/220523_BLACKGOLD_001.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-11T13:00:22Z", "content": "At the end of the first quarter of 2021, as the CEOs of the three biggest U.S. oil and gas companies presented their firms’ earnings, investors fired off a range of questions about how they were addr… [+12046 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Ilana Kaplan", "title": "How Paul W. Downs and Lucia Aniello Kept the Momentum Going With Season 2 of Hacks", "description": "The breakout success of the HBO hit comedy Hacks has more than proven that Paul W. Downs and Lucia Aniello are anything but. After earning 15 Emmy nominations (including three wins) and ushering in the Jean Smart-issance, the creative partners—along with show…", "url": "https://time.com/6175423/paul-downs-lucia-aniello-hacks-season-2-interview/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/LW_TIME_PAULLUCIA_WEBSIZE.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-11T12:45:17Z", "content": "The breakout success of the HBO hit comedy Hacks has more than proven that Paul W. Downs and Lucia Aniello are anything but. After earning 15 Emmy nominations (including three wins) and ushering in t… [+12925 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Emily Barone", "title": "Oil Companies Posted Huge Profits. Here’s Where The Cash Will Go (Hint: Not Climate)", "description": "As consumers grapple with high fuel prices and politicians scramble to knock them down, oil companies are not making any sudden moves. That’s because, after years of low fuel prices, they are now enjoying a financial upswing, as demonstrated by lucrative firs…", "url": "https://time.com/6175400/oil-company-profits/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1240313279.jpg?quality=85&crop=0px%2C0px%2C1024px%2C536px&resize=1200%2C628&strip", "publishedAt": "2022-05-11T12:18:21Z", "content": "As consumers grapple with high fuel prices and politicians scramble to knock them down, oil companies are not making any sudden moves. That’s because, after years of low fuel prices, they are now enj… [+7391 chars]"}]}