{"status": "ok", "totalResults": 8, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Vivienne Walt", "title": "Tony Estanguet, President of Paris 2024, Wants to Redefine the Legacy of the Olympic Games", "description": "Tony Estanguet, president of the Paris Olympics 2024 spoke to TIME about his plans for the summer Olympic Games.", "url": "https://time.com/6184178/tony-estanguet-paris-2024-olympics/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Tony-Estanguet-Paris-Olympics.jpg?quality=85&crop=0px%2C70px%2C2400px%2C1257px&resize=1200%2C628&strip", "publishedAt": "2022-06-05T11:00:37Z", "content": "Editor’s note:TIME is now accepting submissions for its annual Best Inventions list, which recognizes products, software and services that are solving compelling problems in creative ways. Submit you… [+13293 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "President Biden Evacuated After Plane Entered Airspace Near Delaware Beach Home", "description": "A small private airplane mistakenly entered restricted airspace near President Joe Biden's Delaware vacation home Saturday, prompting the brief evacuation of the president and first lady, the White House and the Secret Service said.", "url": "https://time.com/6184228/biden-evcuated/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/biden.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-04T18:53:31Z", "content": "REHOBOTH BEACH, Del. — A small private airplane mistakenly entered restricted airspace near President Joe Biden’s Delaware vacation home Saturday, prompting the brief evacuation of the president and … [+1598 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Fifth Victim Found in Train Wreckage in Germany", "description": "Police said Saturday the body of a fifth victim has been been found beneath a train that derailed Friday in the Alps in southern Germany.", "url": "https://time.com/6184223/germany-train-crash/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/germany.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-04T17:53:54Z", "content": "FRANKFURT, Germany — Police said Saturday the body of a fifth victim has been been found beneath a train that derailed Friday in the Alps in southern Germany.\r\nThe man’s body was uncovered after init… [+710 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Original Gerber Baby Ann Turner Cook Dies at 95", "description": "Ann Turner Cook, whose cherubic baby face was known the world over as the original Gerber baby, has died. She was 95.", "url": "https://time.com/6184217/original-gerber-baby-ann-turner-cook-dies/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/Gerber.jpg?quality=85&w=702&h=628&crop=1", "publishedAt": "2022-06-04T17:19:24Z", "content": "TAMPA, Fla. — Ann Turner Cook, whose cherubic baby face was known the world over as the original Gerber baby, has died. She was 95.\r\nGerber announced Cook’s passing in an Instagram post on Friday.\r\n“… [+1298 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "MATTHEW PERRONE / AP", "title": "Abbott Restarts Baby Formula Plant Linked to Contamination", "description": "Abbott Nutrition has restarted production at the Michigan baby formula factory that has been closed for months due to contamination, the company said Saturday, taking a step toward easing a nationwide supply shortage expected to persist into the summer.", "url": "https://time.com/6184212/abbott-restarts-baby-formula-plant-contamination/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/abbott.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-04T16:48:53Z", "content": "WASHINGTON — Abbott Nutrition has restarted production at the Michigan baby formula factory that has been closed for months due to contamination, the company said Saturday, taking a step toward easin… [+2946 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "ZEN SOO / AP", "title": "Police Patrol Hong Kong Park to Enforce Tiananmen Vigil Ban", "description": "The ban is seen as part of a move to snuff out political dissent and a sign that Hong Kong is losing its freedoms", "url": "https://time.com/6184207/hongkong-tiananmen-vigil-ban/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/patrol-.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-04T15:54:32Z", "content": "HONG KONG — Heavy police force patrolled Hong Kong’s Victoria Park on Saturday after authorities for a third consecutive year banned public commemoration of the anniversary of the deadly Tiananmen Sq… [+6325 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "HOWARD FENDRICH / AP", "title": "Iga Swiatek Beats Coco Gauff for Second French Open Title", "description": "Top-ranked Iga Swiatek beat 18-year-old American Coco Gauff 6-1, 6-3 in the French Open women’s final Saturday to collect her second title at Roland Garros and stretch her winning streak to 35 matches.", "url": "https://time.com/6184202/swiatek-beats-gauff-french-open/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/Iga.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-04T14:31:12Z", "content": "PARIS — Top-ranked Iga Swiatek beat 18-year-old American Coco Gauff 6-1, 6-3 in the French Open women’s final Saturday to collect her second title at Roland Garros and stretch her winning streak to 3… [+923 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Ian Bremmer", "title": "What the Crisis in Sri Lanka Means for the World", "description": "Many middle-income and developing countries are now suffering from a combination of internal political dysfunction and external economic shocks generated mainly by COVID-19 and the war in Ukraine. Sri Lanka provides a powerful example and a warning for countr…", "url": "https://time.com/6184189/sri-lanka-crisis/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1240982423.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-04T13:12:48Z", "content": "Many middle-income and developing countries are now suffering from a combination of internal political dysfunction and external economic shocks generated mainly by COVID-19 and the war in Ukraine. Sr… [+5418 chars]"}]}