{"status": "ok", "totalResults": 15, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Charlotte Alter/New York City", "title": "He Came Out of Nowhere and Humbled Amazon. Is Chris Smalls the Future of Labor?", "description": "Inside the ground-level Staten Island apartment that serves as the operational headquarters of the Amazon Labor Union, Chris Smalls is spitballing about real estate. Wearing immaculate Air Jordans and boxy sunglasses, surrounded by half-empty pasta boxes and …", "url": "https://time.com/6169185/chris-smalls-amazon-labor-union/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/chris-smalls-amazon-union-01.jpg?quality=85&crop=0px%2C553px%2C1598px%2C836px&resize=1200%2C628&strip", "publishedAt": "2022-04-25T11:00:39Z", "content": "Inside the ground-level Staten Island apartment that serves as the operational headquarters of the Amazon Labor Union, Chris Smalls is spitballing about real estate. Wearing immaculate Air Jordans an… [+12725 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Abigail Abrams", "title": "Why It’s So Hard to the Get Birth Control You Want Covered by Insurance", "description": "The Affordable Care Act required birth control to be covered, but Big Insurance is battling Big Pharma over who bears that significant cost.", "url": "https://time.com/6168840/birth-control-insurance-coverage/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/birth-control-coverage-iud.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-25T11:00:38Z", "content": "When the Affordable Care Act passed a decade ago, many women rejoiced: the law required most insurers to fully cover birth control, with no out-of-pocket costs whatsoever. But a decade later, the pro… [+13961 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Madeleine Carlisle", "title": "The Battle Over ‘Remain in Mexico’ Shows How U.S. Immigration Policy Has Reached ‘Peak Confusion’", "description": "On April 26, the Biden Administration will argue before the U.S. Supreme Court that it has the authority to end a controversial Trump-era policy that requires migrants seeking asylum in the United States to wait in Mexico while their claims are reviewed—even …", "url": "https://time.com/6169724/remain-in-mexico-battle-supreme-court/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/title-42-mexico-us-border-migrants-3.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-25T11:00:36Z", "content": "On April 26, the Biden Administration will argue before the U.S. Supreme Court that it has the authority to end a controversial Trump-era policy that requires migrants seeking asylum in the United St… [+8315 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "MATTHEW LEE / AP", "title": "Blinken and Austin Emphasize U.S. Commitment to Ukraine on a Visit to Kyiv", "description": "The trip by Secretary of State Blinken and Defense Secretary Austin was the highest-level U.S. visit to Kyiv since Russia invaded.", "url": "https://time.com/6170256/blinken-austin-visit-kyiv-ukraine/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/AP22115240236962.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-25T08:57:19Z", "content": "NEAR THE POLISH-UKRAINIAN BORDER — American Secretary of State Antony Blinken and Defense Secretary Lloyd Austin said Monday after a secrecy-shrouded visit to Kyiv that Ukrainian President Volodomyr … [+5363 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Bloomberg", "title": "China’s Spreading COVID-19 Outbreak Stokes Fear of a Beijing Lockdown", "description": "China’s coronavirus outbreak has worsened, with rising cases in Beijing sparking jitters about an unprecedented lockdown of the capital", "url": "https://time.com/6170240/china-covid-beijing-lockdown/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/GettyImages-1240218988.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-25T06:27:43Z", "content": "China’s coronavirus outbreak worsened as rising cases in Beijing sparked jitters about an unprecedented lockdown of the capital, with policy makers racing to avert a Shanghai-style crisis that’s alre… [+4372 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Air Force Maj. Gen. William Cooley Has Been Court-Martialed for Abusive Sexual Contact in an Unprecedented Case", "description": "The verdict marks the first court-martial trial and conviction of a general officer in the U.S. Air Force’s 75-year history.", "url": "https://time.com/6170213/air-force-general-william-cooley-court-martial/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/AP22113670397742.jpg?quality=85&crop=0px%2C130px%2C3600px%2C1884px&resize=1200%2C628&strip", "publishedAt": "2022-04-25T04:29:34Z", "content": "WRIGHT-PATTERSON AIR FORCE BASE, Ohio — An Air Force major general in Ohio has been convicted by a military judge of one of three specifications of abusive sexual contact in the first-ever military t… [+1852 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Vivienne Walt/Paris", "title": "French President Emmanuel Macron Wins Re-Election, Surviving a Far-Right Challenge From Marine Le Pen", "description": "One could almost hear the sighs of relief, from Paris to Brussels, and all the way to Washington, as French leader Emmanuel Macron clinched another five-year term in the Elysée Palace. Though polls narrowed during some points leading up to Sunday’s runoff, Ma…", "url": "https://time.com/6170037/emmanuel-macron-wins-french-elections/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/macron-election-win.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-24T18:06:03Z", "content": "One could almost hear the sighs of relief, from Paris to Brussels, and all the way to Washington, as French leader Emmanuel Macron clinched another five-year term in the Elysée Palace. Though polls n… [+7944 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "HUIZHONG WU / AP", "title": "Shanghai Erects Metal Barriers in Fight Against COVID-19", "description": "Volunteers and government workers in Shanghai erected metal barriers in multiple districts to block off small streets and entrances to apartment complexes, as China hardens its strict “zero-COVID” approach in its largest city despite growing complaints from r…", "url": "https://time.com/6170154/shanghai-covid-19-metal-barriers/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/Shanghai-1.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-24T18:03:07Z", "content": "TAIPEI, Taiwan — Volunteers and government workers in Shanghai erected metal barriers in multiple districts to block off small streets and entrances to apartment complexes, as China hardens its stric… [+3887 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Tennessee County Gets Permission to Remove Confederate Flag", "description": "The Williamson County Commission voted in 2020 to request permission from the Tennessee Historical Commission to remove the flag", "url": "https://time.com/6170144/tennesee-county-confederate-flag/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/Tenneseee-1.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-24T17:37:22Z", "content": "FRANKLIN, Tenn. — Two years after voting to remove the Confederate flag from its seal, a Tennessee county finally has the go-ahead to do so.\r\nThe Williamson County Commission voted in 2020 to request… [+1111 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "LINDSAY WHITEHURST / AP", "title": "Longest-Serving Republican U.S. Senator Orrin Hatch Dies at Age 88", "description": "SALT LAKE CITY — Orrin G. Hatch, the longest-serving Republican senator in history who was a fixture in Utah politics for more than four decades, has died at age 88. His death Saturday was announced in a statement from his foundation, which did not specify a …", "url": "https://time.com/6170139/senator-orrin-hatch-dies/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/Senator.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-24T16:58:21Z", "content": "SALT LAKE CITY — Orrin G. Hatch, the longest-serving Republican senator in history who was a fixture in Utah politics for more than four decades, has died at age 88.\r\nHis death Saturday was announced… [+6911 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Mississippi Set to Become Final State With Equal Pay Law", "description": "Mississippi will become the final state with a law requiring equal pay for equal work by women and men.", "url": "https://time.com/6170134/mississippi-equal-pay-law/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/Equal-Pay.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-24T15:53:19Z", "content": "JACKSON, Miss. — Mississippi will become the final state with a law requiring equal pay for equal work by women and men.\r\nRepublican Gov. Tate Reeves signed House Bill 770 on Wednesday, and it will b… [+1682 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "William Horobin / Bloomberg", "title": "France Votes on Macron and Le Pen’s Different Visions", "description": "French voters are heading to the polls for the second time in two weeks to conclude a presidential election in which incumbent centrist Emmanuel Macron has the advantage in surveys over nationalist Marine Le Pen.", "url": "https://time.com/6170128/french-election-macron-le-pen/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/France-Election.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-24T15:28:22Z", "content": "Bloomberg — French voters are heading to the polls for the second time in two weeks to conclude a presidential election in which incumbent centrist Emmanuel Macron has the advantage in surveys over n… [+3803 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "CHINEDU ASADU / AP", "title": "Manhunt on For Suspects as 100 Die in Nigeria Refinery Blast", "description": "At least 100 people may have died in a refinery explosion in southeast Nigeria, an official said Sunday as the search intensified for bodies at the site and for two people suspected of being involved in the blast.", "url": "https://time.com/6170124/nigeria-refinery-blast/", "urlToImage": "https://api.time.com/wp-content/uploads/2017/06/nigeria-map.png?w=1200&h=628&crop=1", "publishedAt": "2022-04-24T14:36:58Z", "content": "ABUJA, Nigeria — At least 100 people may have died in a refinery explosion in southeast Nigeria, an official said Sunday as the search intensified for bodies at the site and for two people suspected … [+3030 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Judy Berman", "title": "April Is Packed With Prestige Dramas. Watch The Baby Instead", "description": "The Baby isn’t subtle. It isn’t polite. It’s sometimes extremely silly. But if you can live with that, it’s more than just fun—it’s also a whole lot smarter than most shows sucking up attention this month.", "url": "https://time.com/6169712/baby-hbo-review/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/michelle-de-swarte_2.jpg?quality=85&w=640&h=427&crop=1", "publishedAt": "2022-04-24T12:01:13Z", "content": "If you’ve been overwhelmed by the deluge of important-sounding new shows this past month, take heart—it isn’t just you. The deadline for Emmy submissions is May 12, and with so many platforms vying f… [+4725 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Emma Barker", "title": "To Keep Workers in Today’s Economy, Flexibility Is More Important Than Money", "description": "(To receive weekly emails of conversations with the world’s top CEOs and business decisionmakers, click here.) CEOs know they have a tough road ahead. Many issues they’ve faced over the past two years—remote work, supply chain backups, product shortages, infl…", "url": "https://time.com/6169927/marcus-buckingham-adp-love-work-book-interview/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/MB-Headshot.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-24T11:00:10Z", "content": "(To receive weekly emails of conversations with the world’s top CEOs and business decisionmakers, clickhere.)\r\nCEOs know they have a tough road ahead. Many issues they’ve faced over the past two year… [+15449 chars]"}]}