{"status": "ok", "totalResults": 19, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "JOSEF FEDERMAN / Associated Press", "title": "Israeli Police Beat Pallbearers at Journalist Shireen Abu Akleh’s Funeral", "description": "JERUSALEM — Israeli riot police on Friday pushed and beat pallbearers at the funeral for slain Al Jazeera journalist Shireen Abu Akleh, causing them to briefly drop the casket in a shocking start to a procession that turned into perhaps the largest display of…", "url": "https://time.com/6176811/israeli-police-pallbearers-funeral-shireen-abu-akleh/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1240644239.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-13T21:17:42Z", "content": "JERUSALEM — Israeli riot police on Friday pushed and beat pallbearers at the funeral for slain Al Jazeera journalist Shireen Abu Akleh, causing them to briefly drop the casket in a shocking start to … [+8644 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Madeleine Carlisle", "title": "You’ll Soon Be Able to Look Up Supreme Court Justices’ Wall Street Investments", "description": "President Joe Biden just signed a new law that will increase financial disclosure requirements for Supreme Court justices.", "url": "https://time.com/6176657/supreme-court-justices-ethics-rules/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1235399231.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-13T19:44:26Z", "content": "President Joe Biden signed a law Friday that will increase financial disclosure requirements for federal judges and Supreme Court justices, a move legal experts describe as a small but meaningful ste… [+6666 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Shannon Carlin", "title": "11 Shows to Watch After Finishing Ozark’s Final Season", "description": "Saying goodbye to Ozark after four thrilling seasons won’t be easy. (Just ask Ruth Langmore herself, Julia Garner.) But it’s possible to fill that Ozark-shaped hole in your heart with other TV shows that are similar to the Jason Bateman-led Netflix series abo…", "url": "https://time.com/6176709/shows-like-ozark/", "urlToImage": "https://api.time.com/wp-content/uploads/2018/12/disappointing-tv-shows-2018-02.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-13T19:06:16Z", "content": "Saying goodbye to Ozark after four thrilling seasons won’t be easy. (Just ask Ruth Langmore herself, Julia Garner.) But it’s possible to fill that Ozark-shaped hole in your heart with other TV shows … [+4461 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Bruce Horovitz", "title": "Employers Take Note: Young Workers Are Seeking Jobs with a Higher Purpose", "description": "Liz Paquette felt clueless when she walked into her college advisor’s office two years ago seeking his help to find an internship. She told him she had just one requirement: The company had to treat its people, its customers, and the planet well. Paquette did…", "url": "https://time.com/6176169/what-young-workers-want-in-jobs/", "urlToImage": "https://api.time.com/wp-content/themes/time2014/img/time-logo-og.png", "publishedAt": "2022-05-13T18:28:45Z", "content": "Liz Paquette felt clueless when she walked into her college advisor’s office two years ago seeking his help to find an internship. She told him she had just one requirement: The company had to treat … [+9228 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Zachary Karabell", "title": "Inflation May Already Have Peaked. Overreacting Brings Its Own Risks", "description": "Whether you are an “average” American, a central banker, a CEO or a parking attendant, inflation is now the primary economic concern for most Americans. Polling bears that out: for the first time in decades, a notable portion of Americans say inflation is the…", "url": "https://time.com/6176658/inflation-fear-economy/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1395399360.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-13T17:21:31Z", "content": "Whether you are an “average” American, a central banker, a CEO or a parking attendant, inflation is now the primary economic concern for most Americans. Polling bears that out: for the first time in … [+7148 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Andrew R. Chow", "title": "A Russian DJ’s Silence About Ukraine Is Dividing the Electronic Music Scene", "description": "The Russian DJ has expressed support for Putin in the past, and music festivals are receiving calls to remove her from their lineups.", "url": "https://time.com/6176595/nina-kraviz-russia-ukraine-war/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1138239611.jpg?quality=85&crop=0px%2C126px%2C4978px%2C2606px&resize=1200%2C628&strip", "publishedAt": "2022-05-13T16:34:13Z", "content": "Ever since the Russian army invaded Ukraine, a cultural boycott of Russian artists has spread across the West. Eurovision banned Russian artists; the Cannes Film Festival announced it would not welco… [+12358 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "PAUL J. WEBER / AP", "title": "Mixed Texas Ruling Allows Trans Youth Parent Investigations", "description": "AUSTIN, Texas — The Texas Supreme Court on Friday allowed the state to investigate parents of transgender youth for child abuse while also ruling in favor of one family that was among the first contacted by child welfare officials following an order by Republ…", "url": "https://time.com/6176660/texas-trans-youth-parent-investigations/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/gov.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-13T16:31:20Z", "content": "AUSTIN, Texas — The Texas Supreme Court on Friday allowed the state to investigate parents of transgender youth for child abuse while also ruling in favor of one family that was among the first conta… [+2915 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Madison Dapcevich", "title": "The Best Stove for Your Health and the Environment", "description": "Gas and electric stoves are popular. But should households move to potentially safer, and more efficient, electric induction stoves?", "url": "https://time.com/6176129/best-stove-for-health-environment-natural-gas-electric/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/induction-efficient-electric-stove.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-13T15:13:44Z", "content": "Gas stoves are associated with a certain allure: an image of prestigious chefs cooking in sought-after, high-end kitchens over an open flame. At the same time, electric stoves and their dated coils h… [+11019 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Andrew R. Chow", "title": "Jerrod Carmichael Revealed His Secrets in Rothaniel. Now He’s Tackling New Ground", "description": "The comedian talks about coming out, suicide jokes, and sulking like Jackie Kennedy.", "url": "https://time.com/6175659/jerrod-carmichael-interview-rothaniel/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1239717873.jpg?quality=85&crop=0px%2C0px%2C3000px%2C1570px&resize=1200%2C628&strip", "publishedAt": "2022-05-13T14:52:45Z", "content": "Last month, the comedian Jerrod Carmichael released one of the best stand-up specials of the year: Rothaniel, in which he delved deeply into his family’s history of secret-keeping before revealing a … [+9330 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eliana Dockterman", "title": "5 Parents on the Stress on Trying to Feed Their Babies Amid a Nationwide Formula Shortage", "description": "As if parenting during a pandemic weren’t already difficult enough, parents of infants are now facing a baby-formula shortage across the U.S. Supply-chain issues that have affected various industries made baby formula scarce. But the situation grew dire when …", "url": "https://time.com/6175755/parents-baby-formula-shortage-stress/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/baby-formula-shortage-01.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-13T14:45:13Z", "content": "As if parenting during a pandemic weren’t already difficult enough, parents of infants are now facing a baby-formula shortage across the U.S. Supply-chain issues that have affected various industries… [+13832 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Brittney Griner’s Detention in Moscow Extended for One Month", "description": "The lawyer for WNBA star Brittney Griner said Friday her pre-trial detention in Russia has been extended by one month.", "url": "https://time.com/6176597/brittney-griner-court-hearing/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Griner.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-13T14:13:34Z", "content": "MOSCOW — The lawyer for WNBA star Brittney Griner said Friday her pre-trial detention in Russia has been extended by one month.\r\nAlexander Boykov told The Associated Press he believed the relatively … [+2700 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Brian Bennett", "title": "Biden’s Abortion Stance and Catholic Faith Have Never Been More at Odds", "description": "Should the Supreme Court repeal Roe v. Wade, Biden will find himself in unfamiliar territory as a Democrat and a Catholic.", "url": "https://time.com/6176375/bidens-abortion-catholic-democrats/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/biden-catholic-church-abortion.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-13T13:43:43Z", "content": "It’s a side of Joe Biden the public rarely sees. Friends who’ve endured lengthy car rides with him or joined in his impromptu huddles after mass know that chewing over the ins and outs of religious t… [+4715 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Giles Turner / Bloomberg", "title": "Elon Musk Declares $44 Billion Twitter Takeover ‘On Hold’", "description": "Elon Musk tweeted that his $44 billion takeover of Twitter is “temporarily on hold” as he awaits data on its proportion of fake accounts.", "url": "https://time.com/6176553/musk-twitter-takeover-on-hold/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/elon-musk-texas.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-13T10:42:42Z", "content": "Elon Musk tweeted that his $44 billion takeover of Twitter Inc. is “temporarily on hold” as he awaits data on its proportion of fake accounts, sending the social media giant into a tailspin.\r\nTwitter… [+2211 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Chad de Guzman / Manila", "title": "The West Will Work With the Philippines’ Next President, Even If He Is a Dictator’s Son", "description": "The ascent of “Bongbong” Marcos Jr. to power in Philippines is a turning point for a country trying to balance between the U.S. and China.", "url": "https://time.com/6176471/marcos-philippines-geopolitics-us-china/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Bongbong1.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-13T10:20:33Z", "content": "The ascent of Philippine dictator’s son Ferdinand “Bongbong” Marcos Jr. to power marks an important turning point for the Southeast Asian country as it tries to find a balance in its relationship wit… [+4731 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Ian Bremmer", "title": "These Three Global Crises Will Transform Our World—Depending on How We Respond to Them", "description": "Where is the peace that the United Nations was created to guarantee?” That’s the pointed question Ukraine’s President Volodymyr Zelensky asked the U.N. Security Council during a video speech on April 5 in response to Russia’s war on his country. “Where is the…", "url": "https://time.com/6176274/global-crises-will-transform-world/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/ukraine-russia-war.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-13T10:00:03Z", "content": "Where is the peace that the United Nations was created to guarantee?” That’s the pointed question Ukraine’s President Volodymyr Zelensky asked the U.N. Security Council during a video speech on April… [+16738 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Chad de Guzman", "title": "COVID-19’s Final Frontier: What to Know About North Korea’s ‘Explosive’ Outbreak", "description": "North Korea has gone public with its first COVID-19 outbreak, reporting six fatalities and raising concern about its pandemic defenses.", "url": "https://time.com/6176459/covid-19-north-korea-outbreak/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-nk.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-13T09:15:29Z", "content": "North Korea on Friday went public with its first “explosive” COVID-19 outbreak, reporting six fatalities and raising concerns about the hermit state’s defenses against the coronavirus after two years… [+4168 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Chad de Guzman / Manila", "title": "Ferdinand Marcos Jr.’s Vague Approach to the Philippine Economy Is Making Investors Nervous", "description": "Investors need to see concrete proposals before having confidence in Ferdinand “Bongbong” Marcos Jr.'s economic stewardship.", "url": "https://time.com/6176006/marcos-philippines-economy/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1240591177.jpg?quality=85&crop=0px%2C142px%2C1024px%2C536px&resize=1200%2C628&strip", "publishedAt": "2022-05-13T06:21:30Z", "content": "Ferdinand “Bongbong” Marcos Jr. is poised to become the Philippines’ next president after taking a massive lead in the May 9 election. Voters, many too young remember, were partly seduced by the 64-y… [+4581 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Zeke Miller", "title": "‘The Window is Closing’: White House Warns U.S. Faces New COVID-19 Risk Without More Shots", "description": "White House COVID-19 coordinator issues dire warning that the U.S. will be vulnerable to the coronavirus if Congress doesn't swiftly approve new funding for more vaccines.", "url": "https://time.com/6176390/covid-white-house-us-vaccine-biden/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1215794017-1.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-13T05:32:44Z", "content": "WASHINGTON (AP) — White House COVID-19 coordinator Dr. Ashish Jha issued a dire warning Thursday that the U.S. will be increasingly vulnerable to the coronavirus this fall and winter if Congress does… [+5061 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Orly Halpern/Jerusalem", "title": "The Problems With Israel’s Version of the Killing of Reporter Shireen Abu Akleh", "description": "Within a half hour of Shireen Abu Akleh’s killing, the Israeli state PR machine went straight to work to choose its deflection strategy.", "url": "https://time.com/6176045/israel-response-shireen-abu-akleh-killing/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/shireen-abu-akleh-death-01.jpg?quality=85&crop=0px%2C321px%2C2400px%2C1256px&resize=1200%2C628&strip", "publishedAt": "2022-05-13T04:03:09Z", "content": "When word got out on Wednesday that esteemed Palestinian-American journalist Shireen Abu Akleh was killed in the West Bank city of Jenin, where Israeli forces has been making military arrest raids, I… [+10488 chars]"}]}