{"status": "ok", "totalResults": 33, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Brittney Griner’s Detention in Moscow Extended for One Month", "description": "The lawyer for WNBA star Brittney Griner said Friday her pre-trial detention in Russia has been extended by one month.", "url": "https://time.com/6176597/brittney-griner-court-hearing/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Griner.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-13T14:13:34Z", "content": "MOSCOW — The lawyer for WNBA star Brittney Griner said Friday her pre-trial detention in Russia has been extended by one month.\r\nAlexander Boykov told The Associated Press he believed the relatively … [+2700 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Brian Bennett", "title": "Biden’s Abortion Stance and Catholic Faith Have Never Been More at Odds", "description": "Should the Supreme Court repeal Roe v. Wade, Biden will find himself in unfamiliar territory as a Democrat and a Catholic.", "url": "https://time.com/6176375/bidens-abortion-catholic-democrats/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/biden-catholic-church-abortion.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-13T13:43:43Z", "content": "It’s a side of Joe Biden the public rarely sees. Friends who’ve endured lengthy car rides with him or joined in his impromptu huddles after mass know that chewing over the ins and outs of religious t… [+4715 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Giles Turner / Bloomberg", "title": "Elon Musk Declares $44 Billion Twitter Takeover ‘On Hold’", "description": "Elon Musk tweeted that his $44 billion takeover of Twitter is “temporarily on hold” as he awaits data on its proportion of fake accounts.", "url": "https://time.com/6176553/musk-twitter-takeover-on-hold/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/elon-musk-texas.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-13T10:42:42Z", "content": "Elon Musk tweeted that his $44 billion takeover of Twitter Inc. is “temporarily on hold” as he awaits data on its proportion of fake accounts, sending the social media giant into a tailspin.\r\nTwitter… [+2211 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Chad de Guzman / Manila", "title": "The West Will Work With the Philippines’ Next President, Even If He Is a Dictator’s Son", "description": "The ascent of “Bongbong” Marcos Jr. to power in Philippines is a turning point for a country trying to balance between the U.S. and China.", "url": "https://time.com/6176471/marcos-philippines-geopolitics-us-china/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Bongbong1.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-13T10:20:33Z", "content": "The ascent of Philippine dictator’s son Ferdinand “Bongbong” Marcos Jr. to power marks an important turning point for the Southeast Asian country as it tries to find a balance in its relationship wit… [+4731 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Ian Bremmer", "title": "These Three Global Crises Will Transform Our World—Depending on How We Respond to Them", "description": "Where is the peace that the United Nations was created to guarantee?” That’s the pointed question Ukraine’s President Volodymyr Zelensky asked the U.N. Security Council during a video speech on April 5 in response to Russia’s war on his country. “Where is the…", "url": "https://time.com/6176274/global-crises-will-transform-world/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/ukraine-russia-war.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-13T10:00:03Z", "content": "Where is the peace that the United Nations was created to guarantee?” That’s the pointed question Ukraine’s President Volodymyr Zelensky asked the U.N. Security Council during a video speech on April… [+16738 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Chad de Guzman", "title": "COVID-19’s Final Frontier: What to Know About North Korea’s ‘Explosive’ Outbreak", "description": "North Korea has gone public with its first COVID-19 outbreak, reporting six fatalities and raising concern about its pandemic defenses.", "url": "https://time.com/6176459/covid-19-north-korea-outbreak/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-nk.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-13T09:15:29Z", "content": "North Korea on Friday went public with its first “explosive” COVID-19 outbreak, reporting six fatalities and raising concerns about the hermit state’s defenses against the coronavirus after two years… [+4168 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Chad de Guzman / Manila", "title": "Ferdinand Marcos Jr.’s Vague Approach to the Philippine Economy Is Making Investors Nervous", "description": "Investors need to see concrete proposals before having confidence in Ferdinand “Bongbong” Marcos Jr.'s economic stewardship.", "url": "https://time.com/6176006/marcos-philippines-economy/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1240591177.jpg?quality=85&crop=0px%2C142px%2C1024px%2C536px&resize=1200%2C628&strip", "publishedAt": "2022-05-13T06:21:30Z", "content": "Ferdinand “Bongbong” Marcos Jr. is poised to become the Philippines’ next president after taking a massive lead in the May 9 election. Voters, many too young remember, were partly seduced by the 64-y… [+4581 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Zeke Miller", "title": "‘The Window is Closing’: White House Warns U.S. Faces New COVID-19 Risk Without More Shots", "description": "White House COVID-19 coordinator issues dire warning that the U.S. will be vulnerable to the coronavirus if Congress doesn't swiftly approve new funding for more vaccines.", "url": "https://time.com/6176390/covid-white-house-us-vaccine-biden/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1215794017-1.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-13T05:32:44Z", "content": "WASHINGTON (AP) — White House COVID-19 coordinator Dr. Ashish Jha issued a dire warning Thursday that the U.S. will be increasingly vulnerable to the coronavirus this fall and winter if Congress does… [+5061 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Orly Halpern/Jerusalem", "title": "The Problems With Israel’s Version of the Killing of Reporter Shireen Abu Akleh", "description": "Within a half hour of Shireen Abu Akleh’s killing, the Israeli state PR machine went straight to work to choose its deflection strategy.", "url": "https://time.com/6176045/israel-response-shireen-abu-akleh-killing/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/shireen-abu-akleh-death-01.jpg?quality=85&crop=0px%2C321px%2C2400px%2C1256px&resize=1200%2C628&strip", "publishedAt": "2022-05-13T04:03:09Z", "content": "When word got out on Wednesday that esteemed Palestinian-American journalist Shireen Abu Akleh was killed in the West Bank city of Jenin, where Israeli forces has been making military arrest raids, I… [+10488 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Lindsay Lee Wallace", "title": "Netflix’s Our Father Tells The True Story of a Fertility Doctor Who Used His Own Sperm on Patients", "description": "During the 1970s and ‘80s, a fertility specialist in Indiana named Dr. Donald Cline inseminated dozens of patients with his own sperm, without their knowledge or consent. The stories of some of these women and the (at least) 94 biological children of Cline ar…", "url": "https://time.com/6176310/our-father-true-story-netflix/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/our-father-1-netflix.jpeg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-12T21:54:43Z", "content": "During the 1970s and ‘80s, a fertility specialist in Indiana named Dr. Donald Cline inseminated dozens of patients with his own sperm, without their knowledge or consent. The stories of some of these… [+7243 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Josiah Bates", "title": "An Alabama Correctional Officer Helped a Murder Suspect Escape. The Jailbreak Highlights a Bigger Problem", "description": "The seemingly made-for-TV story of the Alabama murder suspect who escaped from jail with the help of a female correctional officer after the two possibly became \"romantically involved\" ended in tragedy", "url": "https://time.com/6176355/alabama-inmate-escape-highlights-problems/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Vicky-White-Alabama-Jailbreak.jpg?quality=85&crop=49px%2C53px%2C3046px%2C1592px&resize=1200%2C628&strip", "publishedAt": "2022-05-12T21:37:03Z", "content": "The seemingly made-for-TV story of the Alabama murder suspect who escaped from jail with the help of a female correctional officer after the two possibly became “romantically involved” ended in trage… [+6664 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Philip Elliott", "title": "To Save Roe’s Protections, Democrats Pour More Money Into Flipping Statehouses", "description": "Some Democratic strategists plan to spend millions to find and register likely Democrats in parts of key states they had previously ignored.", "url": "https://time.com/6176327/democrats-abortion-roe-statehouses-midterms/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/democrats-dc-brief.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-12T21:10:06Z", "content": "This article is part of The D.C. Brief, TIME’s politics newsletter. Sign up here to get stories like this sent to your inbox.\r\nThe numbers are comically small, rounding errors in tallies with far few… [+5464 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jasmine Aguilera", "title": "Overturning Roe Could Lead to Restrictions on Birth Control", "description": "Experts say that such arguments opposing birth control—or other liberties for that matter, like same sex marriage—may have legal traction in a post-Roe legal landscape.", "url": "https://time.com/6175213/birth-control-after-roe-v-wade/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/abortion-emergency-contraception-lawmakers-2.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-12T20:22:39Z", "content": "In the wake of a leaked Supreme Court draft opinion overturning Roe v Wade, a handful of state and local Republican politicians appeared to support proposals restricting access to birth control.\r\nIn … [+8254 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Annabel Gutterman", "title": "Author Maggie Shipstead Knows Why We’re Drawn to Celebrity Characters", "description": "Last May, Maggie Shipstead released Great Circle, a sweeping, 600-page epic that flips between the lives of a 20th-century pilot who goes missing and a present-day actor playing the pilot in a major biopic. One year later, Shipstead returns with more reflecti…", "url": "https://time.com/6175825/maggie-shipstead-interview-you-have-a-friend-in-10a/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/you-have-a-friend-in-10a.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-12T20:18:32Z", "content": "Last May, Maggie Shipstead released Great Circle, a sweeping, 600-page epic that flips between the lives of a 20th-century pilot who goes missing and a present-day actor playing the pilot in a major … [+4166 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Omar G. Encarnación", "title": "Florida’s ‘Don’t Say Gay’ Bill Is Part of the State’s Long, Shameful History", "description": "Florida’s “Parental Rights in Education Bill” has made the sunshine state ground zero in America’s culture wars. Signed into law last month by Republican Gov. Ron DeSantis, the bill prohibits discussion of sexual orientation and gender identity in the state’s…", "url": "https://time.com/6176224/florida-dont-say-gay-history-lgbtq-rights/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1239533032.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-12T19:51:51Z", "content": "Florida’s “Parental Rights in Education Bill” has made the sunshine state ground zero in America’s culture wars. Signed into law last month by Republican Gov. Ron DeSantis, the bill prohibits discuss… [+10140 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Abigail Abrams", "title": "How Overturning Roe v. Wade Could Affect Every American", "description": "In the 49 years since the U.S. Supreme Court established a constitutional right to abortion, the experience of being a woman in this country has transformed. Birth control access has expanded, and more women have entered the workforce, pursued higher educatio…", "url": "https://time.com/6176180/overturn-roe-transform-america/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/roe-v-wade-scotus-decision-01.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-12T19:50:42Z", "content": "In the 49 years since the U.S. Supreme Court established a constitutional right to abortion, the experience of being a woman in this country has transformed.\r\nBirth control access has expanded, and m… [+7676 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Fatima Hussein / AP", "title": "Crypto Meltdown Prompts Treasury Secretary to Call for New Regulation", "description": "“We really need a regulatory framework to guard against the risks,” the Treasury Secretary said of cryptocurrencies called stable coins", "url": "https://time.com/6176254/crypto-meltdown-treasury-secretary/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/crypto-meltdown-treasury-secretary.jpg?quality=85&crop=52px%2C22px%2C7554px%2C3952px&resize=1200%2C628&strip", "publishedAt": "2022-05-12T19:46:32Z", "content": "WASHINGTON — Treasury Secretary Janet Yellen, responding to the recent sharp decline in the value of cryptocurrencies, said Thursday that additional federal regulation was needed to respond to the wa… [+1881 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Emily Barone", "title": "Americans Don’t Trust One of the Best Methods to Control Wildfires", "description": "When prescribed burns get out of control, the public becomes wary. But experts say they are a critical tool to combat worsening wildfires.", "url": "https://time.com/6176165/us-controlled-burns-climate-change/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1292987376.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-12T19:41:02Z", "content": "Last month in New Mexico, two separate wildfires in the same vicinity combined, resulting in a massive conflagration that is still ripping through the state. As of May 12, the Calf Canyon-Hermits Pea… [+5127 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Billy Perrigo/Geneva", "title": "Proton’s CEO Wanted to Fight Dictatorships. Now He’s Fighting Big Tech Too", "description": "Andy Yen stands at a panoramic window in his headquarters in Switzerland, surveying what on a clearer day would be a beautiful view. Ahead on the horizon, the Alps are shrouded in gray rain clouds. So Yen points down instead, at Proton’s neighbors in this non…", "url": "https://time.com/6176214/proton-ceo-andy-yen-profile/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Andy-Photo-Ses-April-2021-2-large.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-12T18:58:47Z", "content": "Andy Yen stands at a panoramic window in his headquarters in Switzerland, surveying what on a clearer day would be a beautiful view. Ahead on the horizon, the Alps are shrouded in gray rain clouds. S… [+11296 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Ian Morris", "title": "Central Asia Could Be the Key to Driving a Wedge Between Russian and China", "description": "“War is the realm of chance,” said Carl von Clausewitz, who knew more about the matter than most of us. “No other human activity is so continuously or universally bound up with it.” Even with Russia’s offensive in Ukraine bogging down to the point that a Pent…", "url": "https://time.com/6176087/russia-china-central-asia/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1240563628.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-12T18:28:44Z", "content": "“War is the realm of chance,” said Carl von Clausewitz, who knew more about the matter than most of us. “No other human activity is so continuously or universally bound up with it.” Even with Russia’… [+12200 chars]"}]}