{"status": "ok", "totalResults": 6, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Bill Russell, NBA Great and Celtics Legend, Dies at 88", "description": "Bill Russell, the NBA great who anchored a Boston Celtics dynasty that won 11 championships in 13 years — the last two as the first Black head coach in any major U.S. sport — and marched for civil rights with Martin Luther King Jr., died Sunday. He was 88.", "url": "https://time.com/6202408/bill-russell-nba-celtics-legend-dies/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/BR.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-31T17:47:53Z", "content": "BOSTON — Bill Russell, the NBA great who anchored a Boston Celtics dynasty that won 11 championships in 13 years — the last two as the first Black head coach in any major U.S. sport — and marched for… [+2786 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Nancy Pelosi Confirms Trip to Asia—But Makes No Mention of Taiwan", "description": "The speaker of the U.S. House of Representatives, Nancy Pelosi, confirmed Sunday she will visit four Asian countries this week but made no mention of a possible stop in Taiwan that has fueled tension with Beijing, which claims the island democracy as its own …", "url": "https://time.com/6202402/nancy-pelosi-asia-taiwan/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/Pelosi.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-31T16:29:45Z", "content": "BEIJNG — The speaker of the U.S. House of Representatives, Nancy Pelosi, confirmed Sunday she will visit four Asian countries this week but made no mention of a possible stop in Taiwan that has fuele… [+4587 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "BRUCE SCHREINER / AP", "title": "Death Toll in Kentucky Hits 26 Amid Renewed Flood Threat", "description": "The number of deaths from massive flooding in Kentucky climbed to 26 on Sunday and several dozen people remained missing amid a renewed threat of more heavy rain.", "url": "https://time.com/6202395/kentucky-floods-renewed-threat/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/TIME-.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-31T16:08:19Z", "content": "HINDMAN, Ky — The number of deaths from massive flooding in Kentucky climbed to 26 on Sunday and several dozen people remained missing amid a renewed threat of more heavy rain.\r\nKentucky Gov. Andy Be… [+3356 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Drone Explosion Hits Russia’s Black Sea Fleet Headquarters", "description": "The explosion at the headquarters in the city of Sevastopol on the Crimean peninsula that Russia annexed from Ukraine in 2014 caused cancellation of observances of Russia's Navy Day holiday", "url": "https://time.com/6202390/drone-explosion-russias-black-sea-fleet-headquarters/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/Russia-.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-31T14:59:39Z", "content": "KYIV, Ukraine — A drone-borne explosive device detonated Sunday at the headquarters of Russia’s Black Sea Fleet, injuring six people, officials said.\r\nThe explosion at the headquarters in the city of… [+2002 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Shubham Saharan / Bloomberg", "title": "Banks Used to Provide Relief From Inflation. Now They Profit Big", "description": "The last time inflation burned hot, consumers could put money in the bank and watch it grow like the prices on store shelves, easing much of the pain.", "url": "https://time.com/6202385/inflation-banks-profit/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/Inflation.jpg?quality=85&w=763&h=458&crop=1", "publishedAt": "2022-07-31T14:34:19Z", "content": "Bloomberg — The last time inflation burned hot, consumers could put money in the bank and watch it grow like the prices on store shelves, easing much of the pain.\r\nNot this time — and that’s stoking … [+3954 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Raisa Bruner", "title": "OnlyFans CEO Ami Gan Wants to Dispel Misconceptions About the Company", "description": "When Amrapali “Ami” Gan became CEO of OnlyFans in December 2021, she wasn’t just stepping into a bigger job than her previous position as chief marketing and communications officer. She was taking the helm of one of the pandemic’s buzziest companies, a creato…", "url": "https://time.com/6202306/onlyfans-ceo-ami-gan-interview/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/0L2A8292_Rs-a-copy.jpg?quality=85&crop=0px%2C388px%2C2085px%2C1090px&resize=1200%2C628&strip", "publishedAt": "2022-07-31T11:00:39Z", "content": "When Amrapali “Ami” Gan became CEO of OnlyFans in December 2021, she wasn’t just stepping into a bigger job than her previous position as chief marketing and communications officer. She was taking th… [+11769 chars]"}]}