{"status": "ok", "totalResults": 62, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Sanya Mansoor", "title": "A Texas Court Halted Melissa Lucio’s Execution. Here’s What to Know About Her Case", "description": "The highest criminal court in Texas on Monday halted the execution of Melissa Lucio—a mother whose murder conviction in the death of her 2-year-old daughter has come under increasing scrutiny amid doubts about her guilt. Lucio, 53, was sentenced to be execute…", "url": "https://time.com/6171393/melissa-lucio-execution-texas/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/melissa-lucio-execution.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-28T21:23:44Z", "content": "The highest criminal court in Texas on Monday halted the execution of Melissa Lucio—a mother whose murder conviction in the death of her 2-year-old daughter has come under increasing scrutiny amid do… [+6140 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "MATTHEW BARAKAT / AP", "title": "Amber Heard’s Lawyers Revised Article Johnny Depp Sued Over", "description": "FALLS CHURCH, Va. — Amber Heard pushed to have details of her marriage with fellow actor Johnny Depp included in an op-ed piece that she wrote about domestic violence, even though her lawyers wanted those passages removed from the article, which is now the su…", "url": "https://time.com/6172062/amber-heard-laywers-revised-article-defamation-trial/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/GettyImages-1239942586.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-28T21:21:28Z", "content": "FALLS CHURCH, Va. — Amber Heard pushed to have details of her marriage with fellow actor Johnny Depp included in an op-ed piece that she wrote about domestic violence, even though her lawyers wanted … [+4451 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Sean Gregory", "title": "‘What if This Was Kyrie Irving?’ Trevor Reed’s Release From Russia Renews Questions About Brittney Griner’s Detention", "description": "Brittney Griner, the WNBA star, remains detained in Russia after ex-U.S. marine Trevor Reed was freed from Russia in prisoner swap.", "url": "https://time.com/6171697/brittney-griner-russia-wnba/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/brittney-griner-russia.jpg?quality=85&crop=0px%2C0px%2C1024px%2C536px&resize=1200%2C628&strip", "publishedAt": "2022-04-28T21:03:00Z", "content": "Where is Brittney Griner?\r\nNow that Trevor Reed, a U.S. citizen and former Marine held in Russian detention since 2019 on specious charges for endangering the “life and health” of Russian police offi… [+5323 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Philip Elliott", "title": "Will Republicans Forgive Kevin McCarthy? His Speakership Depends on It", "description": "This article is part of The D.C. Brief, TIME’s politics newsletter. Sign up here to get stories like this sent to your inbox. Clean-up, aisle GOP. Republican Leader Kevin McCarthy may have ridden the last hellish week as best as he could have hoped. First, he…", "url": "https://time.com/6172022/kevin-mccarthy-tapes-speaker/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/kevin-mccarthy-republicans.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-28T20:52:27Z", "content": "This article is part of The D.C. Brief, TIME’s politics newsletter. Sign up here to get stories like this sent to your inbox.\r\nClean-up, aisle GOP.\r\nRepublican Leader Kevin McCarthy may have ridden t… [+4442 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "John Simons and Lon Tweeten", "title": "The Numbers That May Have Convinced Elon Musk That Twitter Was Worth $44 Billion", "description": "Elon Musk is anything but conventional. Typically, when companies (or multi-billionaires) spend boatloads of money on acquisitions, they take their time reviewing internal documents and financial statements that aren’t available to the public—before making th…", "url": "https://time.com/6171871/why-elon-musk-wanted-twitter-in-numbers/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/twitter-elon-musk-numbers.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-28T20:34:01Z", "content": "Elon Musk is anything but conventional. Typically, when companies (or multi-billionaires) spend boatloads of money on acquisitions, they take their time reviewing internal documents and financial sta… [+1007 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "John Abramson", "title": "Big Pharma Is Hijacking the Information Doctors Need Most", "description": "Back in 1982, when I first began my career as a family practitioner in a small town of Boston, I was confident that the care I’d provide would be as effective as the care patients receive anywhere in the world. At the time, the death rate for Americans was lo…", "url": "https://time.com/6171999/big-pharma-clinical-data-doctors/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/GettyImages-1392347486.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-28T20:10:02Z", "content": "Back in 1982, when I first began my career as a family practitioner in a small town of Boston, I was confident that the care I’d provide would be as effective as the care patients receive anywhere in… [+8064 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Megan McCluskey", "title": "Elon Musk Wants to Rid Twitter of ‘Spam Bots.’ Nearly Half His Followers Are Fake", "description": "Spam bots on Twitter are automated accounts that mimic the activity of real people on the site, but are programmed to engage in malicious activity", "url": "https://time.com/6171726/elon-musk-fake-followers/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/Elon-Musk-Fake-Followers.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-28T19:29:15Z", "content": "One of Elon Musk’s top priorities for Twitter following his $44 billion deal to buy the social media company is cracking down on so-called “spam bots.” One problem with that plan: It would cut his ow… [+3318 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eleanor Cummins", "title": "How Hypnosis Works, According to Science", "description": "Hypnosis has a surprisingly robust scientific framework. Research has shown that it can help relieve pain and anxiety and aid smoking cessation, weight loss, and sleep.", "url": "https://time.com/6171844/how-hypnosis-works/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/woman-on-beach.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-28T18:37:27Z", "content": "When you think about hypnosis, what do you visualize? For many, it’s a clock-swinging magician or a comedy act that forces an unwitting volunteer to make embarrassing public admissions on stage.\r\nBut… [+6782 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jeffrey Kluger", "title": "Physicist and Author Carlo Rovelli Would Like to Explain the Universe to You", "description": "It’s a very good thing Carlo Rovelli did not get eaten by a bear in 1976—though even he admits it would have been his own fault. Camping alone in western Canada, he decided to save the money it would have cost him to pitch his tent in a designated area, and p…", "url": "https://time.com/6171839/carlo-rovelli-book/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/carlo-rovelli.jpg?quality=85&crop=0px%2C281px%2C2106px%2C1101px&resize=1200%2C628&strip", "publishedAt": "2022-04-28T18:28:05Z", "content": "It’s a very good thing Carlo Rovelli did not get eaten by a bear in 1976—though even he admits it would have been his own fault. Camping alone in western Canada, he decided to save the money it would… [+7184 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Abby Vesoulis", "title": "Why This Bipartisan Group of Senators Has Beef with the ‘Big Meat’ Industry", "description": "Fourth-generation North Dakota cattle rancher Shelly Ziesch needed to offload some of her cattle a few weeks back. It was getting too expensive to continue feeding cows that had already reached the weights necessary to sell them to feed lots. Only a couple bu…", "url": "https://time.com/6171326/meat-beef-industry-congress/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/GettyImages-466526630.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-28T17:51:17Z", "content": "Fourth-generation North Dakota cattle rancher Shelly Ziesch needed to offload some of her cattle a few weeks back. It was getting too expensive to continue feeding cows that had already reached the w… [+10209 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Ciara Nugent", "title": "California Sunshine Could be Key to Combating Drought", "description": "Meet the engineer calling for solar panels to be installed over canals to save billions of gallons of water a year.", "url": "https://time.com/6171838/solar-panels-canals-california/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/Project-Nexus-Main-Canal-Rendering.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-28T17:46:40Z", "content": "Some ideas are so satisfying that you wonder how they haven’t been done before. Solar canals, which will get their first U.S. pilot later this year in California, fit that mold. Western states are cr… [+7025 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Angela Haupt", "title": "Here Are the 14 New Books You Should Read in May", "description": "No matter how well you think you know yourself, there’s somehow always something more to discover. That’s evident in the most exciting new books coming in May. In Cleyvis Natera’s debut novel, Neruda on the Park, a family reckons with what “home” means to the…", "url": "https://time.com/6171513/best-books-may-2022/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/what-to-read-in-may-2022-featured-image.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-28T17:36:43Z", "content": "No matter how well you think you know yourself, there’s somehow always something more to discover. That’s evident in the most exciting new books coming in May. In Cleyvis Natera’s debut novel, Neruda… [+8800 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Shannon Carlin", "title": "The True Story Behind Hulu’s Under the Banner of Heaven", "description": "Hulu’s new limited series 'Under the Banner of Heaven,' streaming April 28, is an adaptation of Jon Krakauer’s 2003 true-crime bestseller of the same name.", "url": "https://time.com/6171741/under-the-banner-of-heaven-true-story/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/under-the-banner-of-heaven.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-28T16:48:28Z", "content": "Hulu’s new limited series Under the Banner of Heaven, streaming April 28, is an adaptation of Jon Krakauer’s 2003 true-crime bestseller of the same name about the gruesome killings of Brenda Wright L… [+7658 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Matthew Perrone / AP", "title": "The FDA Plans to Issue a Ban on Menthol in Cigarettes and Cigars", "description": "The U.S. government on Thursday will lay out its long-awaited plan to ban menthol cigarettes and flavored cigars", "url": "https://time.com/6171821/fda-plans-ban-menthol/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/fda-plans-ban-menthol.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-28T16:15:25Z", "content": "(Washington D.C.) — The U.S. government on Thursday will lay out its long-awaited plan to ban menthol cigarettes and flavored cigars, which have taken a disproportionate toll on Black smokers and oth… [+3878 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Alan Fram, Zeke Miller and Aamer Madhani / AP", "title": "Joe Biden Asks Congress For $33 Billion More In Aid to Ukraine", "description": "WASHINGTON — President Joe Biden asked Congress on Thursday for an additional $33 billion to help Ukraine fend off Russia’s invasion, a signal that the U.S. is prepared to mount a robust, long-term campaign to bolster Kyiv and weaken Moscow as the bloody war …", "url": "https://time.com/6171813/biden-congress-billions-aid-ukraine/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/biden-congress-billions-aid-ukraine.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-28T16:11:27Z", "content": "WASHINGTON — President Joe Biden asked Congress on Thursday for an additional $33 billion to help Ukraine fend off Russia’s invasion, a signal that the U.S. is prepared to mount a robust, long-term c… [+5055 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Olivia B. Waxman", "title": "30 Years After the Rodney King Verdict, Why Advocates Believe ‘Reforms Didn’t Go Far Enough’", "description": "Thirty years after the acquittal of four cops in the beating of Rodney King sparked a rebellion in L.A., experts reflect on police reforms.", "url": "https://time.com/6169564/rodney-king-riots-beating-anniversary/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/la-riots.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-28T16:00:04Z", "content": "When a jury announced on April 29, 1992, that four Los Angeles police officers had been acquitted of assault with a deadly weapon in the beating of an unarmed Black man named Rodney King, America was… [+5811 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Alice Park", "title": "U.S. Is Getting Closer to Having COVID-19 Vaccines for Children Under Six Years Old", "description": "Moderna requested FDA authorization for its COVID-19 vaccine to be used in the children under six years old, based on promising new data.", "url": "https://time.com/6171455/moderna-vaccine-children-under-six/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/GettyImages-1240236597.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-28T14:45:17Z", "content": "On April 28, Moderna submitted a request to the U.S. Food and Drug Administration (FDA) for emergency use authorization for its COVID-19 vaccine in children between six months and six years old.\r\nThe… [+3597 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Kayti Burt", "title": "9 Must-Watch Episodes of the South Korean Variety Show Run BTS", "description": "When the web series Run BTS launched on Korean streaming service V Live in 2015, the seven members of the South Korean pop band made lofty promises about what fans could expect from the variety show. “It’s going to be hilarious,” J-Hope pledges in the series’…", "url": "https://time.com/6171158/run-bts-best-episodes/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/run-bts.jpg?quality=85&crop=0px%2C0px%2C2400px%2C1256px&resize=1200%2C628&strip", "publishedAt": "2022-04-28T14:19:53Z", "content": "When the web series Run BTS launched on Korean streaming service V Live in 2015, the seven members of the South Korean pop band made lofty promises about what fans could expect from the variety show.… [+10933 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Kurt Wagner / Bloomberg", "title": "Twitter Sales Miss Estimates as Elon Musk Poised to Take Control", "description": "Twitter Inc., in one of its last earnings reports before Elon Musk takes the company private, reported revenue that missed analysts’ estimates, reflecting a slowdown in advertising. Revenue rose to $1.2 billion in the first quarter, the social media company s…", "url": "https://time.com/6171700/twitter-revenue-elon-musk/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/GettyImages-1240263336.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-28T13:59:38Z", "content": "Twitter Inc., in one of its last earnings reports before Elon Musk takes the company private, reported revenue that missed analysts’ estimates, reflecting a slowdown in advertising.\r\nRevenue rose to … [+4097 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Sandeep Ravindran", "title": "What the Science Says About the Health Benefits of Vitamins and Supplements", "description": "Vitamins, dietary supplements, and botanicals are increasingly popular, but scant evidence supports their use for most people.", "url": "https://time.com/6171584/are-vitamins-supplements-healthy/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/vitamins-nutrition-supplements.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-28T13:42:24Z", "content": "From multivitamins and melatonin to fiber and fish oil, Americans who are trying to boost their health and immunity have a plethora of supplements to choose from. An estimated 58% of U.S. adults ages… [+10431 chars]"}]}