{"status": "ok", "totalResults": 28, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Madeleine Carlisle", "title": "South Carolina’s Planned Firing Squad Executions Raise Complicated Questions About the Future of the Death Penalty", "description": "On March 18, the South Carolina Department of Corrections announced that the $53,600 renovation of its death chamber was complete. For prisoners on death row who choose to face the firing squad, the state installed a metal chair with restraints for the ankles…", "url": "https://time.com/6170814/south-carolina-firing-squad-richard-moore-death-penalty/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/FiringSquadFINAL.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-26T21:38:20Z", "content": "On March 18, the South Carolina Department of Corrections announced that the $53,600 renovation of its death chamber was complete. \r\nFor prisoners on death row who choose to face the firing squad, th… [+11200 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Philip Elliott", "title": "Bernie Sanders’ Allies Are Laying the Groundwork for a 2024 Campaign. Why That’s Actually Good for Biden", "description": "This article is part of The D.C. Brief, TIME’s politics newsletter. Sign up here to get stories like this sent to your inbox. Last week, a lot of pragmatic Democrats in Washington let out a groan at the news that Sen. Bernie Sanders’ inner circle was laying t…", "url": "https://time.com/6170931/bernie-sanders-joe-biden-2024/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/GettyImages-1240209879.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-26T19:39:07Z", "content": "This article is part of The D.C. Brief, TIME’s politics newsletter. Sign up here to get stories like this sent to your inbox.\r\nLast week, a lot of pragmatic Democrats in Washington let out a groan at… [+5041 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Nadja Halilbegovich", "title": "You Never Stop Being a Child of War", "description": "Imagine you are 12 and suddenly catapulted out of sleep by explosions that make the whole building quiver. Your mother screams and swoops you out of bed, and seconds later, you are stumbling down a long, dark stairwell teeming with panicked neighbors and cryi…", "url": "https://time.com/6170787/children-war-ukraine-personal-story/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/child-of-war-ukraine.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-26T19:19:20Z", "content": "Imagine you are 12 and suddenly catapulted out of sleep by explosions that make the whole building quiver. Your mother screams and swoops you out of bed, and seconds later, you are stumbling down a l… [+5800 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Stephanie Zacharek", "title": "Viola Davis’ Finding Me Is a Story of a Woman Who Has Always Fought for More", "description": "Viola Davis has always been a great actress. She was great before she won an Oscar (for her supporting role in Denzel Washington’s 2016 film version of August Wilson’s Fences), and even before her earlier nominations (for John Patrick Shanley’s 2008 Doubt and…", "url": "https://time.com/6169850/viola-davis-finding-me-review/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/viola-davis-finding-me.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-26T19:00:58Z", "content": "Viola Davis has always been a great actress. She was great before she won an Oscar (for her supporting role in Denzel Washington’s 2016 film version of August Wilson’s Fences), and even before her ea… [+7901 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jamie Ducharme", "title": "Almost 60% of Americans Have Had COVID-19, CDC Says", "description": "Almost 60% of the U.S. population—and 75% of U.S. children—have evidence in their blood suggesting a past infection with the virus that causes COVID-19, according to new research from scientists at the U.S. Centers for Disease Control and Prevention (CDC) tha…", "url": "https://time.com/6170735/how-many-people-have-had-covid-19/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/positive-covid-test.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-26T18:35:30Z", "content": "Almost 60% of the U.S. population—and 75% of U.S. children—have evidence in their blood suggesting a past infection with the virus that causes COVID-19, according to new research from scientists at t… [+3726 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Elizabeth Held", "title": "10 Books to Help You Get Over a Reading Slump", "description": "Even the most avid readers sometimes find themselves in a slump where no book feels quite right. Especially in times of uncertainty, it can be challenging to find a book capable of getting you to put down your phone and stop doomscrolling. If you’re in a slum…", "url": "https://time.com/6170414/books-to-break-reading-slump/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/books-to-break-reading-slump-featured-image.png?w=1200&h=628&crop=1", "publishedAt": "2022-04-26T18:31:54Z", "content": "Even the most avid readers sometimes find themselves in a slump where no book feels quite right. Especially in times of uncertainty, it can be challenging to find a book capable of getting you to put… [+7725 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "MATTHEW BARAKAT / AP", "title": "Psychologist Hired by Johnny Depp Testifies About Amber Heard’s Mental Health", "description": "FALLS CHURCH, Va. — A forensic psychologist testified Tuesday that actor Amber Heard suffers from borderline personality disorder and histrionic personality disorder, as the civil lawsuit between her and ex-husband Johnny Depp continues to wallow in the coupl…", "url": "https://time.com/6170866/johnny-depp-amber-heard-trial-borderline-personality-disorder/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/GettyImages-1240227889.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-26T17:58:51Z", "content": "FALLS CHURCH, Va. — A forensic psychologist testified Tuesday that actor Amber Heard suffers from borderline personality disorder and histrionic personality disorder, as the civil lawsuit between her… [+2616 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Shannon Carlin", "title": "The True Story Behind Starz’s Watergate Series Gaslit", "description": "Robbie Pickering, the creator of the political docudrama Gaslit, airing Sundays on Starz, has been a “Richard Nixon geek” ever since he saw his mom weeping as she watched the former president’s 1994 funeral on TV. At age 11, all Pickering knew about Nixon was…", "url": "https://time.com/6170831/gaslit-true-story-starz/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/gaslit.jpg?quality=85&w=400&h=267&crop=1", "publishedAt": "2022-04-26T17:46:46Z", "content": "Robbie Pickering, the creator of the political docudrama Gaslit, airing Sundays on Starz, has been a “Richard Nixon geek” ever since he saw his mom weeping as she watched the former president’s 1994 … [+9359 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Rob Chilton", "title": "Blending New Flavors in an Ancient Cup", "description": "Dubai may not immediately come to mind as one of the world’s foremost coffee capitals. But over the past five years, the local coffee scene has developed to the point where the city should be considered right up there with global coffee meccas like Melbourne,…", "url": "https://time.com/6170292/karim-hassan-seven-fortunes-destination-dubai/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/NN_TIME_KarimHassan_015.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-26T17:24:27Z", "content": "Dubai may not immediately come to mind as one of the world’s foremost coffee capitals. But over the past five years, the local coffee scene has developed to the point where the city should be conside… [+3301 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Joan DeJean", "title": "Deported From France as Convicts, These Women Helped Build New Orleans", "description": "On Dec. 12, 1719, a ship named “La Mutine,” the Mutinous Woman, left the French port of Le Havre. The frigate was bound for the vast territory in what is now the United States that the French called “Louisiana” in honor of King Louis XIV. The vessel transport…", "url": "https://time.com/6167919/new-orleans-history-french-women/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/new-orleans-louisiana-history-france-women-crop.jpg?quality=85", "publishedAt": "2022-04-26T17:20:56Z", "content": "On Dec. 12, 1719, a ship named “La Mutine,” the Mutinous Woman, left the French port of Le Havre. The frigate was bound for the vast territory in what is now the United States that the French called … [+8315 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eloise Barry", "title": "What Elon Musk’s Twitter Takeover Means for CEO Parag Agrawal", "description": "As owner of the company, Musk will have the power to transform the board and fire key individuals who don’t align with his vision for the platform.", "url": "https://time.com/6170799/parag-agrawal-twitter-elon-musk/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/Parag-Agrawal.jpg?quality=85&crop=0px%2C518px%2C1600px%2C836px&resize=1200%2C628&strip", "publishedAt": "2022-04-26T17:18:14Z", "content": "Following a tumultuous 12 days of negotiations, billionaire Elon Musk reached an agreement with Twitter’s board, including former CEO Jack Dorsey and current CEO Parag Agrawal, on April 25 to purchas… [+8110 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Zeke Miller / AP", "title": "Kamala Harris Tests Positive for Covid-19, Biden Not ‘Close Contact’", "description": "The White House said neither President Joe Biden nor first lady Jill Biden were considered a “close contact\" of Harris in recent days.", "url": "https://time.com/6170812/harris-positive-covid19/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/harris-positive-covid19.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-26T17:02:15Z", "content": "WASHINGTON — Vice President Kamala Harris tested positive for COVID-19 on Tuesday, the White House announced, underscoring the persistence of the highly contagious virus even as the U.S. eases restri… [+1023 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Billy Perrigo", "title": "Twitter Employees Have Spent Years Trying to Make the Platform Safer. Elon Musk Could Undermine All That", "description": "Twitter employees told TIME that the billionaire's record bodes poorly for the company's anti-harassment efforts.", "url": "https://time.com/6170647/elon-musk-twitter-harassment-employees/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/twitter-employees-elon-musk-02.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-26T16:41:04Z", "content": "There’s an old joke among Twitter employees that being on the platform is like playing a huge online multiplayer game where every day there’s a different main character—meaning a person who’s critiqu… [+10993 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Molly Ball", "title": "What Elon Musk Really Believes", "description": "In trying to read his motivations, both left and right seem to be getting Musk wrong.", "url": "https://time.com/6170696/elon-musk-politics-twitter/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/Musk.Cover_.Final_.jpg?quality=85&crop=0px%2C157px%2C2363px%2C1237px&resize=1200%2C628&strip", "publishedAt": "2022-04-26T16:36:30Z", "content": "“We have democracy?” Elon Musk interjected, with an impish smile. He’d just been asked how worried he was about the state of the American system of government. “We have a sort of democracy, I guess,”… [+11036 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Scott A. Rivkees", "title": "COVID-19 Is Now Preventable, Treatable, and Controllable. What Happens Next Is Up to Us", "description": "On April 13, 2020 I spoke at a press conference stating that COVID-19 social mitigation measures would be our “new normal” until we had vaccines. By the end of December 2020, safe and effective COVID-19 vaccines became available in the U.S. in limited supply.…", "url": "https://time.com/6170320/covid-19-new-normal-up-to-us/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/GettyImages-1240137780.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-26T15:58:04Z", "content": "On April 13, 2020 I spoke at a press conference stating that COVID-19 social mitigation measures would be our “new normal” until we had vaccines. By the end of December 2020, safe and effective COVID… [+7081 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Stan Choe / AP", "title": "Fidelity Will Let Workers Put Some of Their 401(K) Savings Directly Into Bitcoin", "description": "Retirement giant Fidelity said Tuesday that it’s launched a way for workers to put some of their 401(k) savings and contributions directly in bitcoin", "url": "https://time.com/6170756/fidelity-retirement-bitcoin/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/fidelity-retirement-bitcoin.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-26T15:53:23Z", "content": "NEW YORK — More workers may soon be able to stake some of their 401(k) retirement savings to bitcoin, as cryptocurrencies crack even deeper into the mainstream.\r\nRetirement giant Fidelity said Tuesda… [+4255 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Aryn Baker and Video By Joey Lautrup", "title": "Warmer Winters Are Erasing Alaskan Native Traditions in the Arctic", "description": "To Laureli Ivanoff, climate change is far from an abstract idea. As an Iñupiat writer living in the remote Alaskan town of Unalakleet, she’s seen firsthand the warming planet’s tangible impact on her culture’s food traditions, some of the only practices to su…", "url": "https://time.com/6170359/climate-change-alaska-native-traditions/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/REPORTS.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-26T15:30:01Z", "content": "To Laureli Ivanoff, climate change is far from an abstract idea. As an Iñupiat writer living in the remote Alaskan town of Unalakleet, she’s seen firsthand the warming planet’s tangible impact on her… [+763 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "SETH BORENSTEIN / AP", "title": "Expect More Disasters, U.N. Warns, as Climate Change Worsens Everything From Droughts to Economic Meltdowns", "description": "U.N. report predicts the number of extreme heat waves in 2030 will be three times what it was in 2001 and there will be 30% more droughts", "url": "https://time.com/6170670/un-disasters-climate-change/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/flooding-disaster-climate-change.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-26T13:47:31Z", "content": "A disaster-weary globe will be hit harder in the coming years by even more catastrophes colliding in an interconnected world, a United Nations report issued Monday says.\r\nIf current trends continue t… [+3805 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Zeke Miller / AP", "title": "Biden Administration Is Making the COVID-19 Antiviral Pill Paxlovid Easier to Get", "description": "President Joe Biden's administration is taking steps to expand availability of Paxlovid, which will be distributed directly to pharmacies.", "url": "https://time.com/6170672/covid-19-pill-paxlovid-availability/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/covid-19-antiviral-paxlovid.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-26T13:35:48Z", "content": "(Washington D.C.) — President Joe Biden’s administration is taking steps to expand availability of the life-saving COVID-19 antiviral treatment Paxlovid, as it seeks to reassure doctors that there is… [+2732 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Olivia B. Waxman", "title": "What These 3 Longstanding JFK Myths Reveal About America", "description": "Nearly 60 years after his assassination, myths about John F. Kennedy's time in office persist. The author of a new book on JFK debunks three of the most common", "url": "https://time.com/6165142/jfk-myths/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/jfk.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-26T13:00:54Z", "content": "Nearly six decades after President John F. Kennedy’s assassination on Nov. 22, 1963, myths and misunderstandings persist about the President.The tragic way in which the handsome political leader was … [+7000 chars]"}]}