{"status": "ok", "totalResults": 24, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Ismat Ara / New Delhi, India", "title": "This Is What a Radical Plastic Ban Looks Like", "description": "As India finally takes the plunge in the war against plastic, the confusion, panic and uncertainty it faces mirror the global struggle to transition away from plastic-dependence.", "url": "https://time.com/6192165/india-plastic-ban/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/g6.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-30T08:17:39Z", "content": "As dawn breaks out over New Delhi, 15-year-old Alamgir Munna picks up his thela (cart) and heads out for work, such that it is.\r\nAt an age when he should be in school, the young ragpicker sifts throu… [+9578 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "AMY GUNIA / HONG KONG", "title": "John Lee Will Be Hong Kong’s New Leader. Here’s What to Know", "description": "He is the first chief executive since anti-government protests roiled the city in 2019.", "url": "https://time.com/6191472/john-lee-hong-kong-new-chief-executive/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/john-lee-hong-kong.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-30T07:00:26Z", "content": "John Lee will become Hong Kong’s new leader on July 1, when he’s expected to be sworn in by Chinese President Xi Jinping.\r\nLee is the first chief executive to be installed since anti-government prote… [+4952 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Brian Wong", "title": "As Hong Kong Marks 25 Years of British Handover, Its ‘Cage Homes’ Remain a Stark Reminder of Its Inequities", "description": "Over 220,000 people live in so-called ‘subdivided flats’, a euphemism for their 4 by 4 by 6 ft shoeboxes, writes Brian Wong.", "url": "https://time.com/6191786/hong-kong-china-handover-cage-homes/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/h3.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-30T06:35:05Z", "content": "A long, meandering corridor guarded by stale pipes and wires lining the walls separate the 10 cubicles stacked on either side. Their occupants—their faces covered in white masks amid the stifling hea… [+8186 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Chad de Guzman", "title": "Bongbong Marcos Takes Over as Philippine President. To Change His Family’s Brutal Legacy, He Has to Save the Economy", "description": "New leader inherits a poorly performing economy in a climate of global financial uncertainties.", "url": "https://time.com/6192543/bongbong-marcos-philippines-new-president/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/m4-1.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-30T06:00:24Z", "content": "After a landslide victory in one of the Philippines’ most polarizing elections, Ferdinand “Bongbong” Marcos Jr.—a former senator and the son of a late dictator—was sworn in as the Philippines’ presid… [+6000 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eric Cortellessa and Vera Bergengruen", "title": "What Trump Knew: How the Jan. 6 Committee Is Building a Case Against a Former President", "description": "\"I think he has gone into a whole different category of potential criminal liability,” says one legal expert, citing Cassidy Hutchinson's hearing.", "url": "https://time.com/6192383/donald-trump-knew-jan-6-hearings/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/january-6-donald-trump-01.jpg?quality=85&crop=0px%2C45px%2C2400px%2C1256px&resize=1200%2C628&strip", "publishedAt": "2022-06-29T21:47:08Z", "content": "On the night of Jan. 2, 2021, Cassidy Hutchinson escorted President Donald Trump’s personal lawyer, Rudy Giuliani, out of the West Wing to a car waiting to drive him off the White House grounds. The … [+14730 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Charlie Campbell", "title": "A More Powerful NATO Is Emerging. That Might Not Be a Good Thing", "description": "With Russia already calling the expansion deal “destabilizing,” a more powerful NATO could risk cleaving the world into antagonistic factions.", "url": "https://time.com/6192390/nato-expansion-risks-russia-china/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/nato-expanding-good-bad-01.jpg?quality=85&crop=0px%2C38px%2C2391px%2C1251px&resize=1200%2C628&strip", "publishedAt": "2022-06-29T21:29:03Z", "content": "When, in 2019, French President Emmanuel Macron warned NATO risked becoming “braindead,” objections were pro forma rather than passionate. President Donald Trump had just pulled American forces out o… [+13399 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Cady Lang", "title": "What to Know About Young Thug’s Indictment and the Controversial Use of Rap Lyrics in Criminal Cases", "description": "When the Grammy Award-winning rapper Young Thug, real name Jeffery Lamar Williams, was arrested May 9 on conspiracy and street gang activity charges, the indictment heavily cited his lyrics, music videos, and social media posts—and reignited a controversial d…", "url": "https://time.com/6192371/young-thug-rap-lyrics-evidence-court/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/young-thug-rap-lyrics.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-29T20:57:47Z", "content": "When the Grammy Award-winning rapper Young Thug, real name Jeffery Lamar Williams, was arrested May 9 on conspiracy and street gang activity charges, the indictment heavily cited his lyrics, music vi… [+9846 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Katie Reilly", "title": "New Corporate Policies on Abortion Travel Spark Worries About Employees’ Privacy", "description": "More than 25 companies, including Disney, Meta and Dick's Sporting Goods, announced that they would cover employees who need to travel to receive abortion care", "url": "https://time.com/6192361/companies-abortion-travel-paying-privacy/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/company-abortion-policies-Roe.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-29T20:42:43Z", "content": "In the hours after the Supreme Court overturned Roe v. Wade on Friday, eliminating the constitutional right to an abortion, several major U.S. corporations announced they would cover travel expenses … [+9105 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Katie Gutierrez", "title": "Why I Stay in Texas, Even Though It’s Breaking My Heart", "description": "My home office in San Antonio is honeyed with summer light. Outside, a fledgling roadrunner races through the hot dirt and buffelgrass of the empty lot next door. The sun is already high, another scorcher, as my parents always called these days in Laredo, whe…", "url": "https://time.com/6192285/not-leaving-texas-after-roe-v-wade-overturned/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/not-leaving-texas-after-roe-v-wade-overturned.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-29T20:39:07Z", "content": "My home office in San Antonio is honeyed with summer light. Outside, a fledgling roadrunner races through the hot dirt and buffelgrass of the empty lot next door. The sun is already high, another sco… [+10012 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Tom Hays and Bobby Caina Calvan / AP", "title": "R. Kelly Sentenced To 30 Years In Sex Trafficking Case", "description": "R. Kelly was sentenced to 30 years in prison for using his superstardom to subject young fans — some children — to systematic sexual abuse.", "url": "https://time.com/6192377/r-kelly-sentenced-sex-trafficking/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/r-kelly-sentenced-sex-trafficking.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-29T20:15:13Z", "content": "NEW YORK — R&amp;B star R. Kelly was sentenced to 30 years in prison Wednesday for using his superstardom to subject young fans — some just children — to systematic sexual abuse.\r\nThe singer and song… [+4670 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Charlotte Alter", "title": "Young Voters are Down on Biden. That Doesn’t Mean They’ll Bail on Democrats in the Midterms", "description": "President Joe Biden and young voters have always had a marriage of convenience. While they turned out in record numbers to vote against Donald Trump in 2020, the youngest generations have soured on Biden and lost faith in his agenda. Biden’s approval rating w…", "url": "https://time.com/6191899/joe-biden-midterms-young-voters/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/young-democrat-voters.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-29T20:13:08Z", "content": "President Joe Biden and young voters have always had a marriage of convenience. While they turned out in record numbers to vote against Donald Trump in 2020, the youngest generations have soured on B… [+3511 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Philip Elliott", "title": "Trump Would Love the Reality-Show Flair of the Jan. 6 Hearings if He Weren’t the Target", "description": "Tuesday's episode of D.C.’s favorite show demonstrated how lawmakers are using Trump's Apprentice-honed tactics to keep viewers hooked.", "url": "https://time.com/6192327/trump-jan-6-hearings-reality-show/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1241593173.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-29T17:54:27Z", "content": "This article is part of The D.C. Brief, TIME’s politics newsletter. Sign up here to get stories like this sent to your inbox.\r\nNo one can accuse Tuesday’s episode of D.C.’s favorite show of being an … [+6188 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Rain Pryor", "title": "The Night That Changed Richard Pryor", "description": "Daughter Rain Pryor writes about her father walking off stage mid-set. His subsequent journey led him to become the Richard Pryor we know.", "url": "https://time.com/6192236/richard-pryor-black-comedy/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/Richard-Pryor-01.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-29T16:31:02Z", "content": "The biggest misconception about my father, Richard Pryor, is that he knew he was “big time.” Today, celebrities know where they stand. We have social media, which only emerged as my father’s health w… [+3991 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Susie Alegre", "title": "We’re Dangerously Close to Giving Big Tech Control Of Our Thoughts", "description": "Elon Musk has proclaimed himself to be a “free speech absolutist” though reports of the way employees of his companies have been treated when exercising their free speech rights to criticise him might indicate that his commitment to free speech has its limits…", "url": "https://time.com/6191973/big-tech-freedom-of-thought/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1397785239.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-29T16:19:22Z", "content": "Elon Musk has proclaimed himself to be a “free speech absolutist” though reports of the way employees of his companies have been treated when exercising their free speech rights to criticise him migh… [+9147 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Elizabeth Millard", "title": "How Changing Your Diet Could Have a Major Impact on Managing Lupus Symptoms", "description": "There isn’t one single “lupus diet” that’s recommended for those who have the condition, but food can have a major impact on symptoms like fatigue and stiff joints.", "url": "https://time.com/6192201/lupus-diet-treatment/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1056627840.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-29T15:51:30Z", "content": "After Jewell Singletary was diagnosed with lupus, she developed rheumatoid arthritis as well—a common pairing, since both are autoimmune conditions—and had to use a cane to navigate her college campu… [+10774 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Angela Haupt", "title": "Here Are the 9 New Books You Should Read in July", "description": "Exactly what constitutes a beach read has inspired much debate—but perhaps the answer is no more complicated than whether a book is easy to get lost in. Under that definition, the best new books coming in July are ideal for the beach (or the couch, the airpla…", "url": "https://time.com/6191971/best-books-july-2022/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/best-of-july2-1.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-29T14:51:29Z", "content": "Exactly what constitutes a beach read has inspired much debate—but perhaps the answer is no more complicated than whether a book is easy to get lost in. Under that definition, the best new books comi… [+6301 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Paul Wiseman / AP", "title": "U.S. Economy Shrank 1.6% at the Start of 2022—Though Recession Is Not Imminent, Economists Say", "description": "The U.S. economy shrank at a 1.6% annual pace in the first three months of the year. It was the first drop in gross domestic product since the depths of the COVID-19 recession.", "url": "https://time.com/6192230/us-economy-shrank-2022/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/us-economy-shrank-recession-not-imminent.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-29T14:50:39Z", "content": "WASHINGTON — The U.S. economy shrank at a 1.6% annual pace in the first three months of the year, the government reported Wednesday in a slight downgrade from its previous estimate for January-March … [+2546 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Amy Gunia", "title": "Meet the Siblings Making Hydropower That Actually Protects Rivers and Fish", "description": "Hydropower company Natel Energy has a unique blade design that allows fish to pass more safely through the turbines.", "url": "https://time.com/6192153/natel-energy-green-hydropower/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/Natel-turbine.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-29T14:38:57Z", "content": "Hydropower is the world’s biggest source of renewable energy, generating about 16% of the global electricity supply. And it will continue to play a key role as the world looks to meet net-zero target… [+7774 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "E.U. Proposes Ban on Flavored Heated Tobacco Products", "description": "The E.U.’s executive branch proposed Wednesday a ban on the sale of flavored heated tobacco products as part of its plan to fight cancer", "url": "https://time.com/6192192/eu-ban-flavored-heated-tobacco/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1240900271.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-29T12:21:11Z", "content": "The European Union’s executive branch proposed Wednesday a ban on the sale of flavored heated tobacco products, including some vaping items, as part of its plan to fight cancer.\r\nThe European Commiss… [+1388 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Airbnb Permanently Bans Parties At Its Rental Locations", "description": "Airbnb is making permanent its ban on parties at homes listed on the site for short-term rentals.", "url": "https://time.com/6192047/airbnb-permanently-bans-parties/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/airbnb-permanently-bans-parties.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-29T11:27:13Z", "content": "SAN FRANCISCO —Airbnb is making permanent its ban on parties at homes listed on the site for short-term rentals.\r\nThe San Francisco company believes the ban has worked, saying Tuesday that reports of… [+877 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Marc Levin", "title": "We Need to Talk About Animal Cruelty and Mass Shooters", "description": "Amid arguments over whether the recent massacres in Uvalde, Texas and Buffalo, New York should lead policymakers to focus more on gun control or mental illness, there is an elephant in the room. One trait the alleged perpetrators in both cases share in common…", "url": "https://time.com/6191947/mass-shootings-animal-cruelty/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/mass-shootings-animal-cruelty.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-29T11:00:25Z", "content": "Amid arguments over whether the recent massacres in Uvalde, Texas and Buffalo, New York should lead policymakers to focus more on gun control or mental illness, there is an elephant in the room. One … [+5216 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Kim Tong-hyung / AP", "title": "South Korea Approves First Domestically Developed COVID-19 Vaccine", "description": "The shots were designed for the original version of the coronavirus, not the more transmissible Omicron variant that wreaked havoc in the country earlier this year", "url": "https://time.com/6192159/south-korea-covid-vaccine/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/south-korea-covid-vaccine.jpeg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-29T08:20:33Z", "content": "SEOUL, South Korea — Health officials in South Korea on Wednesday approved the country’s first domestically developed COVID-19 vaccine for people 18 years or older, adding another public health tool … [+2285 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Chad de Guzman", "title": "Nobel Laureate Ressa Vows to Fight on as Philippines Orders News Outlet Rappler to Shut Down", "description": "The media outlet had invited the wrath of President Rodrigo Duterte for its reports on his notorious 'drug war,' which led to some 7,000 deaths.", "url": "https://time.com/6192142/rappler-maria-ressa-shutdown-philippines/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/m1-2.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-29T07:46:30Z", "content": "Philippine authorities on Tuesday affirmed a 2018 order to shut down Rappler, the news website co-founded by Nobel Peace Prize laureate Maria Ressa.\r\nThe media outlet had invited the wrath of Preside… [+2907 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Michelle L. Price / AP", "title": "Kathy Hochul Easily Wins Democratic Primary in New York", "description": "NEW YORK — Nine months after she stepped into the job of New York governor as a relative unknown, Democrat Kathy Hochul easily locked up her party’s nomination Tuesday, setting her on an expected glide path to win the office in November. Hochul was serving as…", "url": "https://time.com/6192132/hochul-zeldin-new-york-primary/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/hochul-new-york-governor.jpeg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-29T04:38:09Z", "content": "NEW YORK — Nine months after she stepped into the job of New York governor as a relative unknown, Democrat Kathy Hochul easily locked up her party’s nomination Tuesday, setting her on an expected gli… [+6029 chars]"}]}