{"status": "ok", "totalResults": 31, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Cady Lang and Chad de Guzman", "title": "Britney Spears Marries Partner Sam Asghari in Intimate Ceremony—But Not Without Ex-Husband Drama", "description": "Earlier in the afternoon, Britney Spears' ex-husband Jason Alexander crashed the wedding venue before authorities were called. He was later arrested.", "url": "https://time.com/6186027/britney-spears-wedding-sam-asghari/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/Britney-Spears-wedding-Sam-Asghari.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-10T04:56:19Z", "content": "Britney Spears married longtime boyfriend Sam Asghari in an intimate ceremony Thursday, according to multiple media reports including People and the BBC. The day, however, was not spared from drama.\r… [+2787 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eric Cortellessa", "title": "At First Hearing, Jan. 6 Panel Uses Trump’s Allies to Lay Out Case Against Him", "description": "The House Select Committee investigating the Jan. 6 attack on the U.S. Capitol began making their case for Donald Trump’s culpability for the deadly riot Thursday night, using testimony from members of his own administration to prove that the former President…", "url": "https://time.com/6186333/jan-6-hearing-recap-day-one/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1241207627.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-10T02:39:33Z", "content": "The House Select Committee investigating the Jan. 6 attack on the U.S. Capitol began making their case for Donald Trump’s culpability for the deadly riot Thursday night, using testimony from members … [+3730 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Madeleine Carlisle", "title": "Here’s How Much the Supreme Court Justices Made Last Year", "description": "New financial-disclosure reports released Thursday reveal how much the U.S. Supreme Court Justices made last year—and show that some of them were able to add six figures to their salaries through lucrative book deals. Amy Coney Barrett, the Supreme Court’s ne…", "url": "https://time.com/6186294/supreme-court-salary-book-deals/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1232480766.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-09T21:47:21Z", "content": "New financial-disclosure reports released Thursday reveal how much the U.S. Supreme Court Justices made last year—and show that some of them were able to add six figures to their salaries through luc… [+3208 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jamie Ducharme", "title": "New Abortion Clinics Are Opening Near Borders and Airports to Stretch Access as Far as It Will Go", "description": "With Roe v. Wade likely to be overturned, new abortion clinics are opening near airports and state borders to improve access for travelers.", "url": "https://time.com/6185519/abortion-clinics-travel-state-borders/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/border-abortion-clinics-05.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-09T19:31:32Z", "content": "After more than five years working together in reproductive health clinics in the Washington, D.C., area, nurse-midwife Morgan Nuzzo and ob-gyn Dr. Diane Horvath realized they could do it better. The… [+11069 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Lawrence Haddad", "title": "The Ukraine Crisis Shows How Fragile Our Food Systems Are", "description": "The world’s food systems are being battered on 3 fronts: suffocated by climate change, shaken by the COVID-19 earthquake, and suffering from the cyclone of war. June’s food price index from the UN Food and Agriculture Organization has risen a staggering 50% i…", "url": "https://time.com/6186174/global-food-system-diversify/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1241121716.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-09T19:22:49Z", "content": "The world’s food systems are being battered on 3 fronts: suffocated by climate change, shaken by the COVID-19 earthquake, and suffering from the cyclone of war.\r\nJune’s food price index from the UN F… [+4293 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Nik Popli", "title": "Investors Are Finally Pushing Back on Massive CEO Pay Hikes", "description": "Workers are speaking out against big CEO pay raises, while investors have rejected some generous executive-pay packages", "url": "https://time.com/6184355/ceo-pay-investors-workers/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1240893182.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-09T19:06:56Z", "content": "Excessive CEO pay is coming under threat. Workers at large companies are speaking out against big CEO pay raises while investors at roughly two dozen major U.S. companies have rejected generous execu… [+6287 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Shannon Carlin", "title": "The 11 Best NBA Players Turned Big-Screen Actors", "description": "Many NBA players have made the move from the basketball court to the big screen—and in honor of Adam Sandler’s new Netflix basketball drama Hustle, we’ve compiled a list of some of the best basketball players turned actors. This isn’t about who is the G.O.A.T…", "url": "https://time.com/6186051/nba-actors-hustle-netflix/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/HUSTLE_UNIT_098_11354.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-09T18:59:31Z", "content": "Many NBA players have made the move from the basketball court to the big screen—and in honor of Adam Sandler’s new Netflix basketball drama Hustle, we’ve compiled a list of some of the best basketbal… [+5987 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "TOM KRISHER/AP", "title": "Teslas with Autopilot Move Closer to Being Recalled", "description": "Teslas with partially automated driving systems are closer to being recalled after the U.S. elevated its investigation into collisions", "url": "https://time.com/6186229/teslas-autopilot-recall/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/tesla-recall-ap.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-09T18:52:14Z", "content": "DETROIT — Teslas with partially automated driving systems are a step closer to being recalled after the U.S. elevated its investigation into a series of collisions with parked emergency vehicles or t… [+6240 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Brian Bennett", "title": "Biden to Kimmel: Voters Can Make Midterms About Gun Control", "description": "Kimmel pressed Biden on why he hasn’t done more to curb access to semi-automatic weapons in the wake of multiple mass shootings.", "url": "https://time.com/6186207/biden-kimmel-guns-abortion-midterms/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1241190220.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-09T18:23:03Z", "content": "Jimmy Kimmel had trouble hiding his frustration on Wednesday as he spoke with the most powerful man in the free world about why he couldn’t get anything done on guns.\r\nThe comedian and late-night hos… [+5752 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "James Stavridis", "title": "The Ukraine War is Becoming Putin’s Vietnam", "description": "As the war in Ukraine drags into its fourth month with no end in sight, a number of observers are beginning to ask, “Will the West grow tired of supporting Ukraine?” Some commentators have opined that “time is on Putin’s side,” and that the fierce response of…", "url": "https://time.com/6186033/ukraine-war-becoming-putins-vietnam/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1401762124.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-09T16:39:32Z", "content": "As the war in Ukraine drags into its fourth month with no end in sight, a number of observers are beginning to ask, “Will the West grow tired of supporting Ukraine?” Some commentators have opined tha… [+5022 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "FBI Arrests Ryan Kelley, Candidate for Michigan Governor, For Role in Jan. 6 Capitol Riot", "description": "In a court document, federal investigators filed photos of Kelley trying to rally the pro-Donald Trump crowd.", "url": "https://time.com/6186128/michigan-ryan-kelley-jan-6/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1232905870.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-09T15:41:14Z", "content": "(Grand Rapids, Mich.) — Ryan Kelley, one of five Republican candidates for Michigan governor, was charged with a misdemeanor Thursday for his role in the 2021 postelection riot at the U.S. Capitol.\r\n… [+552 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Mike Stobbe / AP", "title": "U.S. Orders Millions of COVID-19 Vaccines for Youngest Children", "description": "The orders for Pfizer and Moderna vaccines for kids ages 6 months and up comes before possible federal authorization in June.", "url": "https://time.com/6186110/covid-19-vaccine-youngest-children/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/pfizer-pediatric-vaccine.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-09T15:19:29Z", "content": "(New York) — Millions of COVID-19 vaccine doses have been ordered for small children in anticipation of possible federal authorization next week, White House officials say.\r\nThe government allowed ph… [+2194 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Shannon Carlin", "title": "25 NBA Stars Who Appear in Adam Sandler’s Netflix Movie Hustle", "description": "The cast of Adam Sandler’s latest Netflix film, Hustle, streaming now, is a real who’s who of NBA stars. In the drama, big-time basketball fan Sandler plays Stanley Sugerman, a down on his luck Philadelphia 76ers talent scout, who finds himself fighting to sa…", "url": "https://time.com/6185638/adam-sandler-hustle-nba-stars/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/HUSTLE_UNIT_045_00326-1.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-09T14:36:21Z", "content": "The cast of Adam Sandler’s latest Netflix film, Hustle, streaming now, is a real who’s who of NBA stars. In the drama, big-time basketball fan Sandler plays Stanley Sugerman, a down on his luck Phila… [+11004 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Debasish Roy Chowdhury", "title": "The Islamic World’s Outrage Against India Won’t Protect the Country’s Muslims", "description": "Delhi has tried to mend fences after BJP officials angered Islamic countries with Islamophobic remarks. It won't help India's Muslims.", "url": "https://time.com/6185355/india-bjp-muslim-world-prophet/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1241159995.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-09T13:31:38Z", "content": "It’s not every day that the Taliban, Iran or Saudi Arabia get to lecture others on religious tolerance—but Indian Prime Minister Narendra Modi’s Hindu supremacist Bharatiya Janata Party (BJP) has ena… [+7423 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Tik Root", "title": "The Unsettled—and Unsettling—Science of Lawn Chemicals", "description": "Here’s what experts say people should do to keep their grass, and themselves, healthy—including which chemicals to avoid, like glyphosate.", "url": "https://time.com/6184986/are-lawn-fertilizer-chemicals-bad-for-you/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/green-lawn.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-09T13:21:35Z", "content": "For people with yards, keeping grass lush can often feel like a full-time job: planting, treating, mowing, bug-killing, watering—and repeating. Because of the many products and services this entails,… [+10989 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Kim Tong-Hyung/AP", "title": "North Korea Could Be Moving Closer to Another Nuclear Test", "description": "Kim Jong Un has called a top-level political conference after a record spate of missile launches in a climate of nuclear brinkmanship.", "url": "https://time.com/6185962/north-korea-nuclear-test/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/k2.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-09T10:12:00Z", "content": "SEOUL, South Korea — North Korean leader Kim Jong Un has convened a political conference where he’s expected to review state affairs, including a COVID-19 outbreak, and possibly address relations wit… [+6153 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Robert Leonard", "title": "Rural America’s Revival Depends on Immigrants", "description": "At the Iowa State Capitol during the legislative session in early March, shortly after Russia invaded Ukraine, I encountered a group of teenage girls from other countries on a State Department sponsored tour. I asked them where they were from, and when one gi…", "url": "https://time.com/6185152/rural-america-immigrants/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/rural-america-immigrant-workers.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-09T10:00:34Z", "content": "At the Iowa State Capitol during the legislative session in early March, shortly after Russia invaded Ukraine, I encountered a group of teenage girls from other countries on a State Department sponso… [+10358 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Naina Bajekal/Davos, Switzerland", "title": "Inside the Mind of the Most Powerful Woman in Europe", "description": "President of the European Commission Ursula von der Leyen tells TIME that she is determined to lead the E.U. through yet another crisis.", "url": "https://time.com/6185490/ursula-von-der-leyen-interview/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/Ursula-von-der-Leyen-TIME-interview-9999.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-09T09:00:00Z", "content": "This winter, as the E.U.’s top official worked around the clock in Brussels, she hoped for something unusual: that it would all be for nothing. It had been just over two years since Ursula von der Le… [+18050 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Tassanee Vejpongsa and Grant Peck/AP", "title": "Thailand Becomes the First Asian Country to Legalize Marijuana, But Only for Medical Use", "description": "Marijuana is being decriminalized but only for therapeutic use, as the country seeks to tap into the lucrative market for medical cannabis.", "url": "https://time.com/6185904/thailand-marijuana-cannabis-medical/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/m1.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-09T05:54:20Z", "content": "BANGKOK — Marijuana cultivation and possession in Thailand was decriminalized Thursday, like a dream come true for an aging generation of pot smokers who recall the kick the legendary Thai Stick vari… [+2219 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Raisa Bruner", "title": "These Are the Best Moments of the 2022 TIME100 Gala", "description": "The Gala brought together notable names, including Zendaya, Andrew Garfield, and Simu Liu", "url": "https://time.com/6185569/time100-gala-best-moments/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/time-100-gala-2022-best-moments.jpg?quality=85&crop=0px%2C0px%2C2400px%2C1256px&resize=1200%2C628&strip", "publishedAt": "2022-06-09T05:00:03Z", "content": "Has Bill Gates ever tried boba tea?\r\nThat was the question posed to the billionaire tech mogul and philanthropist on Tuesday night at New York City’s Jazz at Lincoln Center by actor Simu Liu. Liu, th… [+5530 chars]"}]}