{"status": "ok", "totalResults": 24, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Time", "title": "Doctors with Disabilities Push for Change as Long COVID Affects Their Workforce", "description": "As the third year of the pandemic continues, doctors with disabilities are pushing the medical field to improve its treatment of disabled health professionals. An increasing number of people have Long Covid and need accommodations at work, and in the health c…", "url": "https://time.com/6200640/doctors-disabilities-long-covid/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/doctors-with-disabilities-long-covid.jpg?quality=85&crop=0px%2C38px%2C2400px%2C1256px&resize=1200%2C628&strip", "publishedAt": "2022-07-27T11:00:52Z", "content": "As the third year of the pandemic continues, doctors with disabilities are pushing the medical field to improve its treatment of disabled health professionals. An increasing number of people have Lon… [+9496 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Belinda Luscombe", "title": "Joy Behar Won’t Shut Up", "description": "People have many issues with Joy Behar, but here is one that has gotten scandalously slight attention. Joy Behar is a bad driver. A person sitting in the back of her SUV to, say, drive a short distance on flat roads, will get nauseated, which will significant…", "url": "https://time.com/6200608/joy-behar-the-view-interview/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/joy-behar.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-27T11:00:47Z", "content": "People have many issues with Joy Behar, but here is one that has gotten scandalously slight attention. Joy Behar is a bad driver. A person sitting in the back of her SUV to, say, drive a short distan… [+17415 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Gregg Gonsalves", "title": "America Is All Too Happy to Let People Die", "description": "Last week, we were told the President of the United States has COVID-19, but it wasn’t a big deal, as White House press secretary Karine Jean-Pierre told the media: “We knew this was going to happen. At some point, everyone is going to get COVID.” Leana Wen, …", "url": "https://time.com/6200588/america-is-all-too-happy-to-let-people-die/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-1396548182.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-27T11:00:05Z", "content": "Last week, we were told the President of the United States has COVID-19, but it wasn’t a big deal, as White House press secretary Karine Jean-Pierre told the media: “We knew this was going to happen.… [+4992 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Nurin Sofia/Bloomberg", "title": "Malaysia May Join New Zealand in a ‘Generational Endgame’ for Tobacco", "description": "Malaysia is considering a ban on the sale of all tobacco products to people born after 2007, in a similar move to New Zealand's.", "url": "https://time.com/6200879/generational-endgame-nz-malaysia-tobacco/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-1184311149.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-27T10:17:38Z", "content": "Malaysia is considering a ban on smoking and the sale of all tobacco products, including e-cigarettes, to people born after 2007, joining New Zealand lawmakers in a once-unheard of move against one o… [+1658 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Mike Corder/AP", "title": "Dutch Farmers Resume Protests Against Green Reforms, Dumping Manure, Garbage on Roads", "description": "The protests are over government plans to reduce nitrogen emissions that farmers say could harm their businesses.", "url": "https://time.com/6200872/dutch-farmers-protests-dump-manure-roads/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-1242137669.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-27T09:43:20Z", "content": "THE HAGUE, Netherlands — Dutch farmers resumed protests at government plans to reduce nitrogen emissions Wednesday by dumping manure and garbage on highways and setting fires alongside roads.\r\nTraffi… [+2526 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Fresh, Nationwide U.K. Rail Strike Brings Train Services to a Crawl", "description": "Most trains ground to a halt on Wednesday after 40,000 workers striked over jobs, pay and conditions.", "url": "https://time.com/6200867/uk-rail-strike-disruptions/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-1242137579.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-27T09:24:50Z", "content": "LONDON — Britain’s railway network ground to a crawl on Wednesday after 40,000 staff walked off the job in a dispute over jobs, pay and working conditions. Train companies said only about a fifth of … [+2017 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Madeleine Carlisle/Overland Park, KS and Abigail Abrams", "title": "Kansas Abortion Vote Offers First Test of New Post-Roe Battleground: State Constitutions", "description": "Kansas' ballot measure marks the first time voters will decide on abortion post-Roe. The fight over the state's constitution also represents a new front in the abortion battle", "url": "https://time.com/6200726/kansas-abortion-constitution-amendment-ballot-measure/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/kansas-abortion-roe-canvas-09.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-27T09:00:15Z", "content": "As the heat index topped 100 degrees in Johnson County on Saturday, dozens of canvassers fanned out over affluent suburbs to knock on strangers’ doors and talk about an emotional, fraught, and, in ma… [+14652 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Bruce Einhorn and Shirley Zhao/Bloomberg", "title": "Debris From a Chinese Space Rocket Is Crashing Toward Earth", "description": "Debris from a Long March 5B rocket launched on July 24 will make an uncontrolled reentry around July 31. Beijing has dismissed concerns.", "url": "https://time.com/6200859/debris-long-march-rocket-china/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-1232586990.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-27T08:27:02Z", "content": "Debris from a Chinese rocket is set to crash to Earth some time over the next few days, with the potential for wreckage to land across a wide swathe of the globe.\r\nPart of a Long March 5B rocket Chin… [+2782 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Judy Berman", "title": "Netflix’s Uncoupled Is a Gay Rom-Com Stuck in the Sex and the City Era", "description": "Not even Neil Patrick Harris can save this badly dated Netflix series from SATC creator Darren Star", "url": "https://time.com/6200349/uncoupled-review-netflix/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/UNCOUPLED_101_Unit_01321RC.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-27T07:01:45Z", "content": "One of the oldestcriticisms of the Sex and City franchise is that it isn’t really about women. Some viewers, citing the four central characters’ promiscuity and frank talk about their casual hookups,… [+2947 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jenny Leonard/Bloomberg", "title": "Joe Biden Will Speak With Xi Jinping on Thursday as U.S.-China Ties Worsen", "description": "The first conversation between the two presidents since March will take place at a particularly difficult juncture for U.S.-China ties.", "url": "https://time.com/6200844/biden-xi-us-china-relations-taiwan/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/389658665.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-27T04:34:48Z", "content": "President Joe Biden will speak with Chinese leader Xi Jinping on Thursday amid fresh tensions over Taiwan, according to people familiar with the matter.\r\nThe first conversation between the two presid… [+5296 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Brian Bennett", "title": "Trump Calls for Moving Homeless to ‘Tent Cities’ in First D.C. Speech Since Leaving Office", "description": "In his first speech in Washington since leaving the White House, Trump offered autocratic ideas, lied about the 2020 election, and all but confirmed he wants to run again in 2024.", "url": "https://time.com/6200821/trump-homeless-tent-cities-2024/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-1242129298.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-27T00:28:18Z", "content": "In his first speech back in Washington since losing a second term as President, Donald Trump let some big, autocratic ideas spill out for how to run America. Riffing off his written remarks, Trump sa… [+4910 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Angela Haupt", "title": "Why Online Shopping Makes You So Happy", "description": "Experts explain the psychology behind online shopping—along with tips on how to show restraint if your virtual cart is overflowing.", "url": "https://time.com/6200717/online-shopping-psychology-explained/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-1327127856.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-26T20:22:49Z", "content": "Online shopping is more than a hobby for those who get a thrill out of traversing the biggest mall in the world: the internet. It’s also a sport.\r\nHow else to explain Monica Corcoran Harel’s reaction… [+9621 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jill Lawless", "title": "The Booker Prize Just Announced the Youngest Author to Ever Make the Longlist", "description": "13 authors are in the running for the prestigious Booker Prize for fiction. A six-book shortlist will be announced Sept. 6.", "url": "https://time.com/6200586/booker-prize-2022-leila-mottley-longlist/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/leila-mottley-author.jpg?quality=85&crop=110px%2C78px%2C892px%2C467px&resize=1200%2C628&strip", "publishedAt": "2022-07-26T19:41:46Z", "content": "LONDON — Best-selling American writers Karen Joy Fowler, Elizabeth Strout, and Leila Mottley are among 13 authors in the running for the prestigious Booker Prize for fiction.\r\nFowler’s novel about Ab… [+2258 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Tara Law", "title": "21% of Women Reported Switching Their Birth Control Method Post-Roe", "description": "Now that abortion is either no longer an option or under threat in half of U.S. states, many people are taking steps to make sure they don’t get pregnant.", "url": "https://time.com/6200542/women-birth-control-switching-methods-abortion/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/birth-control-roe-iud.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-26T19:39:31Z", "content": "Lauren Robinson has no desire to have an unplanned pregnancy. So after learning that the Supreme Court overturnedRoe v. Wade in June—and reading Justice Clarence Thomas’ concurring opinion suggesting… [+7461 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Amazon to Raise Prime Fees in Europe, Cites Rising Costs", "description": "The new charges will take effect on September 15 for those who sign-up for Prime or renew their membership.", "url": "https://time.com/6200678/amazon-raises-prime-fees-europe/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/amazon-raises-prime-fees-europe.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-26T18:32:43Z", "content": "Amazon is raising its Prime fees in Europe, the company told customers on Tuesday, days ahead of its second-quarter earnings report.\r\nAmong other places, the price of a monthly Prime membership will … [+2162 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Cady Lang", "title": "The Last White Man Interrogates a World Obsessed With Whiteness", "description": "The opening of Mohsin Hamid’s The Last White Man, arriving Aug. 2, invokes Franz Kafka’s Gregor Samsa—but with a metamorphosis fitting for the racially charged era in which we live. “One morning,” Hamid writes, “Anders, a white man, woke up to find he had tur…", "url": "https://time.com/6200448/mohsin-hamid-the-last-white-man-review/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/the-last-white-man.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-26T17:48:38Z", "content": "The opening of Mohsin Hamid’s The LastWhite Man, arriving Aug. 2, invokes Franz Kafka’s Gregor Samsa—but with a metamorphosis fitting for the racially charged era in which we live. “One morning,” Ham… [+3578 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Ciara Nugent//ANTOFAGASTA DE LA SIERRA, ARGENTINA", "title": "New Lithium Mining Technology Could Give Argentina a Sustainable Gold Rush", "description": "Mining for clean energy minerals is surprisingly dirty. New technology may reduce its impact on ecosystems and local communities.", "url": "https://time.com/6200372/lithium-mining-technology-argentina-gold/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/argentina-lithium-mining-1.jpg?quality=85&crop=0px%2C220px%2C2400px%2C1257px&resize=1200%2C628&strip", "publishedAt": "2022-07-26T16:45:07Z", "content": "The Vasquez brothers aren’t used to visitors. Their farm lies in the Puna, a vast plateau region in the Andes Mountains, some 12,500 ft above sea level and a full day’s drive to the nearest city. The… [+23475 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jean-Yves Kamale/AP", "title": "At Least 5 Killed, 50 Injured in Anti-U.N. Protests in Congo’s East", "description": "Demonstrators set fires and forced entry into the U.N. mission offices in Goma, accusing the forces of failing to protect civilians.", "url": "https://time.com/6200570/anti-un-protests-congo/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/Anti-un-protests-congo.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-26T15:41:35Z", "content": "KINSHASA, Congo — At least five people have been killed and about 50 others injured on the second day of demonstrations in Congo’s eastern city of Goma against the United Nations mission in the count… [+2015 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Simran Jeet Singh", "title": "The Sikh Idea of Seva Is an Antidote to Our Current Malaise", "description": "I remember how dishonest I felt in high school volunteering at a soup kitchen, just so I could mention it in my college applications. Decades later, the memory still gnaws at me. All of us know such insincerity because we say things without any intention of f…", "url": "https://time.com/6200562/sikh-seva-antidote-to-our-current-malaise/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-1301079871.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-26T15:24:11Z", "content": "I remember how dishonest I felt in high school volunteering at a soup kitchen, just so I could mention it in my college applications. Decades later, the memory still gnaws at me. All of us know such … [+8020 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Judy Berman", "title": "The Resort Is a Fun Vacation Thriller With a Twist Around Every Corner", "description": "Cristin Milioti and William Jackson Harper star in Peacock's series about tourists in Mexico who stumble upon a mystery.", "url": "https://time.com/6200285/the-resort-review-peacock/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/bmnDtPks.jpeg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-26T15:00:10Z", "content": "Emma and Noah come to Mexico for the same boring reasons that most longtime couples take vacations: to relax, to make memories (whatever that really means), and most of all to reconnect with each oth… [+4997 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eloise Barry", "title": "Europe Relies on Russian Gas. A Tough Winter Lies Ahead Amid Fears of a Cut-Off", "description": "The Kremlin said it would further reduce gas supplies to the E.U. from Wednesday, fueling ongoing concerns about rationing.", "url": "https://time.com/6200523/europe-russia-gas-future/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/nord-stream-1.jpg?quality=85&w=1024&h=604&crop=1", "publishedAt": "2022-07-26T14:40:13Z", "content": "European leaders’ relief over last week’s resumption of natural gas flows from Russia’s Nord Stream 1 pipeline was short-lived, after the Kremlin announced on Monday that it would reduce supply to th… [+7317 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Vladimir Isachenkov/AP", "title": "Russia to Drop Out of International Space Station After 2024", "description": "Russia will pull out of the International Space Station after 2024 and focus on building its own orbiting outpost.", "url": "https://time.com/6200567/russia-to-drop-out-of-international-space-station/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/russia-to-drop-out-of-international-space-station.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-26T14:37:26Z", "content": "(MOSCOW, Russia) — Russia will pull out of the International Space Station after 2024 and focus on building its own orbiting outpost, the country’s new space chief said Tuesday amid high tensions bet… [+3540 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Sarah Rose Etter", "title": "The Reversal of Roe Sealed My Decision to Leave Texas", "description": "In the grocery store, in H-E-B, a strange, angry paranoia overtook me. Suddenly, I couldn’t look at any of the faces that passed me without my heart clenching. The produce blurred fluorescent around me, the piles of apples and pears looked so fake as to be pl…", "url": "https://time.com/6200241/leaving-texas-after-roe-v-wade-overturned/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/austin-texas-roe-verus-wade.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-26T11:30:56Z", "content": "In the grocery store, in H-E-B, a strange, angry paranoia overtook me. Suddenly, I couldn’t look at any of the faces that passed me without my heart clenching. The produce blurred fluorescent around … [+11770 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eliana Dockterman", "title": "Emily Oster Still Thinks Data Can Help Ease (Some) Parental Anxiety", "description": "Emily Oster does not offer parenting advice. She is rather insistent on this point. A Brown University economist who specializes in health data, Oster prefers to analyze numbers that help parents think through a decision. “When there isn’t any data, you can a…", "url": "https://time.com/6200259/emily-oster-interview-parental-anxiety/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/emily-oster.jpg?quality=85&crop=100px%2C331px%2C1999px%2C1047px&resize=1200%2C628&strip", "publishedAt": "2022-07-26T11:00:11Z", "content": "Emily Oster does not offer parenting advice. She is rather insistent on this point. A Brown University economist who specializes in health data, Oster prefers to analyze numbers that help parents thi… [+6875 chars]"}]}