{"status": "ok", "totalResults": 39, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "ERIC TUCKER and MATTHEW LEE / AP", "title": "Russia Releases U.S. Marine Vet as Part of Prisoner Exchange", "description": "(Washington, D.C.) — Russia and the United States have carried out a dramatic prisoner exchange, trading a Marine veteran jailed in Moscow for a convicted Russian drug trafficker serving a long prison sentence in America, both countries announced Wednesday. T…", "url": "https://time.com/6171145/russia-trevor-reed-prisoner-exchange/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/russia-releases-us-marine-vet.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-27T13:58:12Z", "content": "(Washington, D.C.) — Russia and the United States have carried out a dramatic prisoner exchange, trading a Marine veteran jailed in Moscow for a convicted Russian drug trafficker serving a long priso… [+4681 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eliana Dockterman", "title": "MoviePass Co-Founder Stacy Spikes Is Trying to Stage a Comeback–and Save Movie Theaters in the Process", "description": "Any resemblance to Steve Jobs was unintentional, or so Stacy Spikes claims. Back in February, minutes before Spikes was set to take the stage at Lincoln Center in New York City to announce the resurrection of his old company, MoviePass, he realized he was swe…", "url": "https://time.com/6171018/moviepass-stacy-spikes-comeback/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/stacey-spikes.jpg?quality=85&crop=225px%2C490px%2C1514px%2C792px&resize=1200%2C628&strip", "publishedAt": "2022-04-27T13:00:02Z", "content": "Any resemblance to Steve Jobs was unintentional, or so Stacy Spikes claims. Back in February, minutes before Spikes was set to take the stage at Lincoln Center in New York City to announce the resurr… [+22665 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Simmone Shah", "title": "What to Know About Johnny Depp and Amber Heard’s Defamation Trial", "description": "A high-profile trial involving actors Johnny Depp, 58, and his ex-wife Amber Heard, 36, began April 12 in Fairfax, Va. The trial revolves around a defamation lawsuit Depp filed against Heard in 2019 about an op-ed she wrote about domestic abuse in 2018. Depp …", "url": "https://time.com/6171006/johnny-depp-amber-heard-trial/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/johnny-depp-amber-heard.jpg?quality=85&crop=0px%2C0px%2C2400px%2C1256px&resize=1200%2C628&strip", "publishedAt": "2022-04-27T12:51:11Z", "content": "A high-profile trial involving actors Johnny Depp, 58, and his ex-wife Amber Heard, 36, began April 12 in Fairfax, Va. The trial revolves around a defamation lawsuit Depp filed against Heard in 2019 … [+7062 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Mary Gelman and Tara Law", "title": "‘Hope Gives You the Strength to Act.’ Portraits of Russians Risking Everything to Support Ukraine", "description": "Photographer Mary Gelman made portraits of Russians protesting the war in Ukraine despite facing beatings, jail, and losing their livelihoods.", "url": "https://time.com/6170850/russians-supporting-ukraine-portraits/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/portraits-russians-support-ukraine-02.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-27T11:00:49Z", "content": "When words are so closely controlled that it’s a crime to call a war a war, what drives someone to speak out?\r\nThe Russian protesters seen here cite a variety of things. One is a sense of moral respo… [+1921 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Don Winslow", "title": "Don Winslow: The Complicated Ethics of Writing Violence in Fiction", "description": "There are some hard ethical questions in the writing of crime fiction. For me, the most difficult one is how to portray violence. For one thing, should you depict it all? And if so, how do you do it with some sense of morality? I wrestle with this issue all t…", "url": "https://time.com/6170479/don-winslow-writing-violence-fiction/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/the-complicated-ethics-of-writing-violence-in-fiction.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-27T11:00:08Z", "content": "There are some hard ethical questions in the writing of crime fiction.\r\nFor me, the most difficult one is how to portray violence.\r\nFor one thing, should you depict it all?\r\nAnd if so, how do you do … [+7971 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Lisa Abend/Berlin", "title": "Chancellor Olaf Scholz Wants to Transform Germany’s Place in the World. He’d Just Rather Not Talk About It", "description": "After decades of embracing pacifism to atone for two world wars, Germany stands to emerge under the new Chancellor as a true global power—with a military to match.", "url": "https://time.com/6170974/olaf-scholz-germany-interview/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/scholz-germany-ukraine-time-interview-08.jpg?quality=85&crop=0px%2C525px%2C1920px%2C1006px&resize=1200%2C628&strip", "publishedAt": "2022-04-27T09:00:46Z", "content": "Three days after Russia ordered troops into Ukraine, German Chancellor Olaf Scholz stood before the Bundestag, the federal Parliament in Berlin, and addressed the lawmakers in a special Sunday sessio… [+19710 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "MORGAN LEE / AP", "title": "Videos Show Alec Baldwin’s Reactions and the Aftermath of the Shooting on the Set of Rust", "description": "Video and other evidence has been made public in response to media requests for records and as an effort toward investigation transparency.", "url": "https://time.com/6171107/video-alec-baldwin-rust-film-shooting/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/AP22116765299718.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-27T08:15:16Z", "content": "SANTA FE, N.M. — The New Mexico sheriff investigating the fatal film-set shooting of a cinematographer by actor Alec Baldwin described complacency, disorganization and neglected safety measures in th… [+4634 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "ZEN SOO and EILEEN NG / AP", "title": "Singapore Executes a Mentally Disabled Man in Spite of International Appeals", "description": "The city-state defied an international campaign for clemency for Nagaenthran K. Dharmalingam, convicted in 2010 on drugs charges.", "url": "https://time.com/6171100/singapore-execution-dharmalingam/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/AP22116509639643.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-27T07:38:58Z", "content": "SINGAPORE — Singapore on Wednesday executed a mentally disabled Malaysian man condemned for a drug offense after a court dismissed a last-minute challenge from his mother and international pleas to s… [+2642 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "GRANT PECK / AP", "title": "A Court in Myanmar Has Sentenced Aung San Suu Kyi to Five Years for Corruption", "description": "The onetime democracy icon has already been sentenced to six years imprisonment in other cases and faces ten more corruption charges.", "url": "https://time.com/6171088/myanmar-aung-san-suu-kyi-jail/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/AP22117156704886.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-27T07:13:15Z", "content": "BANGKOK — A court in military-ruled Myanmar convicted the country’s former leader Aung San Suu Kyi of corruption and sentenced her to five years in prison Wednesday in the first of several corruption… [+4020 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Judy Berman", "title": "HBO Max’s The Staircase Is So Much More Than a Rehash of the Classic True-Crime Docuseries", "description": "At first, it looks as though we’re in for yet another redundant docudrama that fictionalizes events that will already be familiar to most viewers. There turns out to be a lot more than that happening here.", "url": "https://time.com/6170722/the-staircase-review-hbo-max/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/colin-firth-toni-collette.jpg?quality=85&w=640&h=427&crop=1", "publishedAt": "2022-04-27T07:01:16Z", "content": "Don’t come to The Staircase expecting certainty. French filmmaker Jean-Xavier de Lestrade’s Peabody-winning documentary series, which originally aired in 2004, with updates added in 2013 and 2018, is… [+7230 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Hasan Ali", "title": "Popular Opinion May Prevent Pakistan’s New Government From Mending Ties With the U.S.", "description": "Those looking to Pakistan's new coalition government for a reset of the country's fractious relations with Washington may be disappointed.", "url": "https://time.com/6171042/pakistan-us-relations/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/GettyImages-1239661458.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-27T06:09:28Z", "content": "Less than a month after taking office, Pakistan’s new coalition government is already having to navigate a foreign policy quagmire. On the one hand, it would like to restore cordial ties with the Uni… [+4902 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Madeleine Carlisle", "title": "South Carolina’s Planned Firing Squad Executions Raise Complicated Questions About the Future of the Death Penalty", "description": "On March 18, the South Carolina Department of Corrections announced that the $53,600 renovation of its death chamber was complete. For prisoners on death row who choose to face the firing squad, the state installed a metal chair with restraints for the ankles…", "url": "https://time.com/6170814/south-carolina-firing-squad-richard-moore-death-penalty/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/FiringSquadFINAL.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-26T21:38:20Z", "content": "On March 18, the South Carolina Department of Corrections announced that the $53,600 renovation of its death chamber was complete. \r\nFor prisoners on death row who choose to face the firing squad, th… [+11200 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Philip Elliott", "title": "Bernie Sanders’ Allies Are Laying the Groundwork for a 2024 Campaign. Why That’s Actually Good for Biden", "description": "This article is part of The D.C. Brief, TIME’s politics newsletter. Sign up here to get stories like this sent to your inbox. Last week, a lot of pragmatic Democrats in Washington let out a groan at the news that Sen. Bernie Sanders’ inner circle was laying t…", "url": "https://time.com/6170931/bernie-sanders-joe-biden-2024/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/GettyImages-1240209879.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-26T19:39:07Z", "content": "This article is part of The D.C. Brief, TIME’s politics newsletter. Sign up here to get stories like this sent to your inbox.\r\nLast week, a lot of pragmatic Democrats in Washington let out a groan at… [+5041 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Nadja Halilbegovich", "title": "You Never Stop Being a Child of War", "description": "Imagine you are 12 and suddenly catapulted out of sleep by explosions that make the whole building quiver. Your mother screams and swoops you out of bed, and seconds later, you are stumbling down a long, dark stairwell teeming with panicked neighbors and cryi…", "url": "https://time.com/6170787/children-war-ukraine-personal-story/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/child-of-war-ukraine.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-26T19:19:20Z", "content": "Imagine you are 12 and suddenly catapulted out of sleep by explosions that make the whole building quiver. Your mother screams and swoops you out of bed, and seconds later, you are stumbling down a l… [+5800 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Stephanie Zacharek", "title": "Viola Davis’ Finding Me Is a Story of a Woman Who Has Always Fought for More", "description": "Viola Davis has always been a great actress. She was great before she won an Oscar (for her supporting role in Denzel Washington’s 2016 film version of August Wilson’s Fences), and even before her earlier nominations (for John Patrick Shanley’s 2008 Doubt and…", "url": "https://time.com/6169850/viola-davis-finding-me-review/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/viola-davis-finding-me.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-26T19:00:58Z", "content": "Viola Davis has always been a great actress. She was great before she won an Oscar (for her supporting role in Denzel Washington’s 2016 film version of August Wilson’s Fences), and even before her ea… [+7901 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jamie Ducharme", "title": "Almost 60% of Americans Have Had COVID-19, CDC Says", "description": "Almost 60% of the U.S. population—and 75% of U.S. children—have evidence in their blood suggesting a past infection with the virus that causes COVID-19, according to new research from scientists at the U.S. Centers for Disease Control and Prevention (CDC) tha…", "url": "https://time.com/6170735/how-many-people-have-had-covid-19/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/positive-covid-test.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-26T18:35:30Z", "content": "Almost 60% of the U.S. population—and 75% of U.S. children—have evidence in their blood suggesting a past infection with the virus that causes COVID-19, according to new research from scientists at t… [+3726 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Elizabeth Held", "title": "10 Books to Help You Get Over a Reading Slump", "description": "Even the most avid readers sometimes find themselves in a slump where no book feels quite right. Especially in times of uncertainty, it can be challenging to find a book capable of getting you to put down your phone and stop doomscrolling. If you’re in a slum…", "url": "https://time.com/6170414/books-to-break-reading-slump/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/books-to-break-reading-slump-featured-image.png?w=1200&h=628&crop=1", "publishedAt": "2022-04-26T18:31:54Z", "content": "Even the most avid readers sometimes find themselves in a slump where no book feels quite right. Especially in times of uncertainty, it can be challenging to find a book capable of getting you to put… [+7725 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "MATTHEW BARAKAT / AP", "title": "Psychologist Hired by Johnny Depp Testifies About Amber Heard’s Mental Health", "description": "FALLS CHURCH, Va. — A forensic psychologist testified Tuesday that actor Amber Heard suffers from borderline personality disorder and histrionic personality disorder, as the civil lawsuit between her and ex-husband Johnny Depp continues to wallow in the coupl…", "url": "https://time.com/6170866/johnny-depp-amber-heard-trial-borderline-personality-disorder/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/GettyImages-1240227889.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-04-26T17:58:51Z", "content": "FALLS CHURCH, Va. — A forensic psychologist testified Tuesday that actor Amber Heard suffers from borderline personality disorder and histrionic personality disorder, as the civil lawsuit between her… [+2616 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Shannon Carlin", "title": "The True Story Behind Starz’s Watergate Series Gaslit", "description": "Robbie Pickering, the creator of the political docudrama Gaslit, airing Sundays on Starz, has been a “Richard Nixon geek” ever since he saw his mom weeping as she watched the former president’s 1994 funeral on TV. At age 11, all Pickering knew about Nixon was…", "url": "https://time.com/6170831/gaslit-true-story-starz/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/gaslit.jpg?quality=85&w=400&h=267&crop=1", "publishedAt": "2022-04-26T17:46:46Z", "content": "Robbie Pickering, the creator of the political docudrama Gaslit, airing Sundays on Starz, has been a “Richard Nixon geek” ever since he saw his mom weeping as she watched the former president’s 1994 … [+9359 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Rob Chilton", "title": "Blending New Flavors in an Ancient Cup", "description": "Dubai may not immediately come to mind as one of the world’s foremost coffee capitals. But over the past five years, the local coffee scene has developed to the point where the city should be considered right up there with global coffee meccas like Melbourne,…", "url": "https://time.com/6170292/karim-hassan-seven-fortunes-destination-dubai/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/04/NN_TIME_KarimHassan_015.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-04-26T17:24:27Z", "content": "Dubai may not immediately come to mind as one of the world’s foremost coffee capitals. But over the past five years, the local coffee scene has developed to the point where the city should be conside… [+3301 chars]"}]}