{"status": "ok", "totalResults": 18, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Sylvia Hui/AP", "title": "The Two Men Behind Boris Johnson’s New Political Crisis", "description": "Boris Johnson's government faced a new crisis Tuesday after two of his most senior Cabinet ministers resigned within minutes of each other.", "url": "https://time.com/6193946/boris-johnson-rishi-sunak-sajid-javid/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/b2.jpg?quality=85&crop=0px%2C0px%2C3500px%2C1832px&resize=1200%2C628&strip", "publishedAt": "2022-07-06T06:52:06Z", "content": "LONDON — British Prime Minister Boris Johnson’s government faced a new crisis Tuesday after two of his most senior Cabinet ministers resigned within minutes of each other.\r\nTreasury chief Rishi Sunak… [+3483 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Kitty Donaldson, Joe Mayes and Ellen Milligan/Bloomberg", "title": "Boris Johnson Fights Back After Shock Resignations Rock British Politics", "description": "Prime minister appoints a new chancellor of the exchequer and health secretary", "url": "https://time.com/6193931/boris-johnson-resignation-sunak-javed-british/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/b1.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-06T04:41:25Z", "content": "LONDON — Boris Johnson is digging in as U.K. prime minister, after the resignation of two of the most senior members of his government brought his premiership to the brink on another febrile day in W… [+5583 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Nik Popli", "title": "A Highland Park Doctor Who Helped Save Shooting Victims Asks: How Can We Keep Letting This Happen?", "description": "Dr. David Baum helped save victims of the Highland Park shooting. Now he wonders wonder how the U.S. can continue to let mass shootings happen.", "url": "https://time.com/6193916/highland-park-shooting-doctor/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/Highland-Park-shooting-1.jpg?quality=85&crop=0px%2C140px%2C1024px%2C536px&resize=1200%2C628&strip", "publishedAt": "2022-07-06T01:26:56Z", "content": "As almost everyone else fled, Dr. David Baum ran to help. The obstetrician from Highland Park, Ill., waited until the gunfire at his home city’s beloved Fourth of July parade stopped and then he went… [+3119 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "James Grebey", "title": "How the Stranger Things Season 4 Finale Sets Up the End of the Series", "description": "The final episode of Stranger Things’ fourth season turned the whole world of the show upside-down, literally: the Upside Down has officially come to Hawkins. Although Netflix is planning on making spinoffs, the series will come to an end with the upcoming fi…", "url": "https://time.com/6193891/stranger-things-season-4-series-end/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/stranger-things-crew.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-05T21:42:22Z", "content": "The final episode of Stranger Things’ fourth season turned the whole world of the show upside-down, literally: the Upside Down has officially come to Hawkins. Although Netflix is planning on making s… [+9876 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Kyla Mandel", "title": "Now That BA.5 Is Dominant, Stopping It Will Be Difficult", "description": "The power of BA.5 is its ability to infect, and reinfect, almost anyone. It can evade people’s built-up immunity, whether from vaccination or previous infection.", "url": "https://time.com/6193890/ba-5-omicron-dominant/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/omicron-ba4-ba5-covid-variant-new-wave.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-05T21:16:43Z", "content": "Around the world, the latest Omicron subvariant, BA.5, is quickly becoming the dominant strain of the SARS-CoV-2 virus. It just took the top spot in the U.S.: As of the last week of June, BA.5 made u… [+3309 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Tara Law", "title": "Only 7% of Americans Have Optimal Heart Health, Study Says", "description": "A new study finds that very few U.S. adults have optimal heart and metabolic health—and risk isn’t equally distributed across the population.", "url": "https://time.com/6193848/heart-health-risk-factors/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/Nurse-and-Patient.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-05T20:23:03Z", "content": "Peak heart health is rare in the U.S.—and increasingly uncommon. A new study published in the Journal of the American College of Cardiology finds that fewer than 7% of all American adults have optima… [+3315 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Emily Barone", "title": "$5 Gas Won’t Stop the American Road Trip", "description": "An analysis of gas demand and fuel prices since 2000 shows that Americans don't significantly change their driving habits when prices spike.", "url": "https://time.com/6193830/high-gas-prices-summer-travel/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-1241216287.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-05T19:28:35Z", "content": "Coming off the July 4th holiday weekend, the average national price for a gallon of regular gasoline stands at $4.80, according to AAA. But that’s unlikely to keep Americans from hitting the open roa… [+4234 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Alice Park", "title": "5 Good Reasons to Get Your Young Kid Vaccinated Against COVID-19", "description": "There are many reasons why parents are still worried about getting their youngest kids vaccinated. Here’s the latest data on what we know and don’t know about the shots.", "url": "https://time.com/6192941/young-kids-covid-19-vaccine/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/covid-19-vaccine-toddler.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-05T17:56:56Z", "content": "Everyone in the U.S. 6 months or older is now eligible to get a COVID-19 vaccine, after the U.S. Food and Drug Administration (FDA) and Centers for Disease Control and Prevention (CDC) authorized the… [+6610 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Simmone Shah and Nik Popli", "title": "Highland Park Shooting Suspect’s Rifle Was Legally Purchased. What We Know So Far", "description": "Suspect Robert “Bobby” Crimo III allegedly dressed in women's clothing to sneak away from the crime scene, police said. Here's the latest.", "url": "https://time.com/6193790/highland-park-shooting-updates/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/highland-park-shooting.jpg?quality=85&crop=0px%2C321px%2C2400px%2C1256px&resize=1200%2C628&strip", "publishedAt": "2022-07-05T17:09:22Z", "content": "The suspected gunman who allegedly opened fire on a Fourth of July parade in the Chicago suburb of Highland Park, Ill., obtained the “high powered” rifle he used legally, authorities said Tuesday. \r\n… [+6813 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Annabel Gutterman", "title": "The Crane Wife Author CJ Hauser Is an Open Book", "description": "CJ Hauser has one of those faces. She just looks like someone you could talk to—and strangers tend to do exactly that, stopping her on the street or unloading their life stories on her on airplanes. It only adds to the phenomenon when, the day we meet in Broo…", "url": "https://time.com/6193243/cj-hauser-the-crane-wife-interview/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/cj-hauser.jpg?quality=85&crop=23px%2C596px%2C1456px%2C762px&resize=1200%2C628&strip", "publishedAt": "2022-07-05T16:54:22Z", "content": "CJ Hauser has one of those faces. She just looks like someone you could talk to—and strangers tend to do exactly that, stopping her on the street or unloading their life stories on her on airplanes. … [+8086 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Francesca Ebel / AP", "title": "Ukraine’s Sloviansk Hit by ‘Massive’ Russian Shelling, Says Mayor", "description": "The bombardment comes a day after Russian President Vladimir Putin declared victory in seizing Ukraine's eastern province of Luhansk.", "url": "https://time.com/6193768/ukraine-sloviansk-russian-shelling/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-1241718631.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-05T15:57:42Z", "content": "A day after Russian President Vladimir Putin declared victory in seizing an eastern Ukraine province essential to his wartime aims, a city in the path of Moscow’s offensive came under sustained bomba… [+4054 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eloise Barry", "title": "Chile Is Trying To Shed the Last Remnants of Its Pinochet-Era Dictatorship", "description": "If approved by voters in a Sept. 4 referendum, the new text will replace the constitution designed by military dictator Augusto Pinochet in 1980.", "url": "https://time.com/6193719/chile-constitution-reform-boric/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/elisa-loncon-constitution-chile-1.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-05T15:32:03Z", "content": "After a year-long, turbulent drafting process, Chile’s proposed new constitution was submitted to President Gabriel Boric on Monday, bringing the country one step closer to abandoning the legacy of A… [+9706 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Stephanie Zacharek", "title": "Thor: Love and Thunder Is a Snooze", "description": "Taika Waititi's latest installment in the Marvel Cinematic Universe may please kids, but despite its many jokes, gags and cameos, it's a snore for grown-ups.", "url": "https://time.com/6193270/thor-love-and-thunder-review/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/g_disneyplus_thorloveandthunder_stills_5_a25f2c75.webp?w=1200&h=628&crop=1", "publishedAt": "2022-07-05T13:00:37Z", "content": "In the early days of the modern superhero film—let’s say roughly 2008, around the time of Christopher Nolan’s Dark Knight—it was heresy to suggest that characters adapted from comic books were kids’ … [+4748 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Afreen Fatima", "title": "Bulldozers Have Razed My Home, and Broken the Back of India’s Muslims. Does the World Care?", "description": "Afreen Fatima, a Muslim student activist who's paying the price for being vocal against the Indian government, has a message for the world.", "url": "https://time.com/6193648/modi-india-bulldozer-justice-muslims/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/d4.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-05T11:03:01Z", "content": "Ever wondered what is it like to be a Muslim in the undeclared Hindu state that is India? To be constantly humiliated, demeaned, and brutalized? To have your soul destroyed by the state? And sometime… [+9585 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Kermit Roosevelt III", "title": "The Supreme Court Is Dooming America to Repeat History", "description": "Those who do not learn from history, George Santayana famously wrote, are doomed to repeat it. But today’s Supreme Court majority seems to have a different idea of the lessons of the past. Increasingly, they are saying that we must learn history because the C…", "url": "https://time.com/6193496/supreme-court-dooming-america/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-1241678713.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-05T10:30:10Z", "content": "Those who do not learn from history, George Santayana famously wrote, are doomed to repeat it. But today’s Supreme Court majority seems to have a different idea of the lessons of the past. Increasing… [+6890 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Raf Casert / AP", "title": "NATO Nations Sign Accession Protocols for Sweden, Finland", "description": "NATO's 30 member states signed off on the accession protocols for Sweden and Finland on Tuesday.", "url": "https://time.com/6193688/nato-accession-protocols-sweden-finland/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-1241712631.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-05T10:01:58Z", "content": "The 30 NATO allies signed off on the accession protocols for Sweden and Finland on Tuesday, sending the membership bids of the two nations to the alliance capitals for legislative approvals.\r\nThe mov… [+2457 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Rod McGuirk and Mark Baker / AP", "title": "Sydney Floods Burden 50,000 Around Australia’s Largest City", "description": "Hundreds of homes have been inundated in and around Australia’s largest city in a flood emergency that was causing trouble for 50,000 people.", "url": "https://time.com/6193671/australia-flooding-sydney/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/australia-flooding.jpeg?quality=85&crop=0px%2C262px%2C4465px%2C2337px&resize=1200%2C628&strip", "publishedAt": "2022-07-05T08:34:54Z", "content": "RICHMOND, Australia — Hundreds of homes have been inundated in and around Australia’s largest city in a flood emergency that was causing trouble for 50,000 people, officials said Tuesday.\r\nEmergency … [+4001 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Doug Feinberg / AP", "title": "Brittney Griner Sends Letter to President Biden Pleading for His Help", "description": "Griner wrote saying she feared she might never return home and asked Biden to not \"forget about me and the other American Detainees.\"", "url": "https://time.com/6193654/brittney-griner-white-house-biden/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/brittney-griner-letter-white-house.jpeg?quality=85&crop=0px%2C12px%2C6204px%2C3248px&resize=1200%2C628&strip", "publishedAt": "2022-07-05T06:55:46Z", "content": "Brittney Griner has made an appeal to President Joe Biden in a letter passed to the White House through her representatives saying she feared she might never return home and asking that he not “forge… [+3540 chars]"}]}