{"status": "ok", "totalResults": 12, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "ELENA BECATOROS and JON GAMBRELL / AP", "title": "Ukraine Evacuates Civilians From Steel Mill", "description": "Russian forces fired cruise missiles at the southern Ukrainian city of Odesa on Saturday and bombarded a besieged steel mill in Mariupol, hoping to complete their conquest of the port in time for Victory Day celebrations.", "url": "https://time.com/6174643/ukraine-evacuates-steel-mill/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Steel-plant-1.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-07T18:41:32Z", "content": "ZAPORIZHZHIA, Ukraine — Russian forces fired cruise missiles at the southern Ukrainian city of Odesa on Saturday and bombarded a besieged steel mill in Mariupol, hoping to complete their conquest of … [+7431 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Time", "title": "Sinn Fein Hails ‘New Era’ as It Wins Northern Ireland Vote", "description": "The Irish nationalist party Sinn Fein has won the largest number of seats in the Northern Ireland Assembly for the first time.", "url": "https://time.com/6174635/sinn-fein-northern-ireland-vote/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Sinn-Fein.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-07T18:25:33Z", "content": "BELFAST, Northern Ireland — The Irish nationalist party Sinn Fein, which seeks unification with Ireland, hailed a “new era” Saturday for Northern Ireland as it captured the largest number of seats in… [+4429 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Philip Elliott", "title": "The Back Booth: How a Supreme Court Leak Consumed D.C.", "description": "Welcome to The Back Booth, a weekend edition of The D.C. Brief. Here each Saturday, TIME’s politics newsletter will host a conversation between political professionals on the right and the left, pulling back the curtain on the conversations taking place in Wa…", "url": "https://time.com/6174425/supreme-court-roe-leaker-ukraine/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/supreme-court-roe-v-wade-abortion.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-07T17:00:19Z", "content": "Welcome to The Back Booth, a weekend edition of The D.C. Brief. Here each Saturday, TIME’s politics newsletter will host a conversation between political professionals on the right and the left, pull… [+10583 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Afghanistan’s Taliban Order Women to Cover Up Head to Toe", "description": "Afghanistan’s Taliban rulers on Saturday ordered all Afghan women to wear head-to-toe clothing in public — a sharp, hard-line pivot that confirmed the worst fears of rights activists and was bound to further complicate Taliban dealings with an already distrus…", "url": "https://time.com/6174619/afghanistan-taliban-women-covering/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Afghanistan.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-07T16:06:05Z", "content": "KABUL, Afghanistan — Afghanistan’s Taliban rulers on Saturday ordered all Afghan women to wear head-to-toe clothing in public — a sharp, hard-line pivot that confirmed the worst fears of rights activ… [+3339 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "ELENA BECATOROS and JON GAMBRELL / AP", "title": "Ukraine Braces for Escalated Attacks Ahead of Russia’s V-Day", "description": "The war in Ukraine wracked the country’s southern coast Saturday as Russian forces fired cruise missiles at the city of Odesa and bombarded a steel mill housing Ukrainian civilians and fighters, hoping to complete their conquest of the port of Mariupol in tim…", "url": "https://time.com/6174612/ukraine-braces-russia-attacks/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Russia.jpg?quality=85&w=1024&h=576&crop=1", "publishedAt": "2022-05-07T15:52:54Z", "content": "ZAPORIZHZHIA, Ukraine — The war in Ukraine wracked the country’s southern coast Saturday as Russian forces fired cruise missiles at the city of Odesa and bombarded a steel mill housing Ukrainian civi… [+8417 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "KIM TONG-HYUNG / AP", "title": "North Korea Test-Fired Missile From Submarine: South Korea", "description": "North Korea flight-tested a ballistic missile that was likely fired from a submarine on Saturday, South Korea’s military said, continuing a provocative streak in weapons demonstrations that may culminate with a nuclear test in the coming weeks or months.", "url": "https://time.com/6174601/north-korea-fires-missile-submarine/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Missile.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-07T13:40:56Z", "content": "SEOUL, South Korea — North Korea flight-tested a ballistic missile that was likely fired from a submarine on Saturday, South Korea’s military said, continuing a provocative streak in weapons demonstr… [+5780 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "SYLVIE CORBET / AP", "title": "France President Macron Inaugurated for Second Five-Year Term", "description": "President Emmanuel Macron was inaugurated for a second term on Saturday, vowing to first take action to avoid any further escalation of Russia’s war in Ukraine before going on to focus on promoting France and Europe on the world stage.", "url": "https://time.com/6174596/president-macron-inaugurated-france/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/France.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-07T13:26:36Z", "content": "PARIS — President Emmanuel Macron was inaugurated for a second term on Saturday, vowing to first take action to avoid any further escalation of Russia’s war in Ukraine before going on to focus on pro… [+2915 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "ANDREA RODRÍGUEZ / AP", "title": "Rescuers Search for Victims at Cuba Hotel After Blast Kills 25", "description": "Rescuers in Cuba’s capital searched Saturday to find survivors of an explosion that killed at least 25 people and devastated a luxury hotel that once hosted dignitaries and celebrities, including Beyoncé and Jay-Z.", "url": "https://time.com/6174589/havana-blast-cuba/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/explosion.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-07T13:16:08Z", "content": "HAVANA — Rescuers in Cuba’s capital searched Saturday to find survivors of an explosion that killed at least 25 people and devastated a luxury hotel that once hosted dignitaries and celebrities, incl… [+4890 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Emily Galvin-Almanza", "title": "The Critical Role of Public Defenders in a Post-Roe v. Wade World", "description": "The debate over fetal rights is an old one, and at least 38 states already have some form of fetal-harm laws in place that make it a crime to hurt a fetus. Under Roe v. Wade, these laws are required to exempt abortion from punishment. But if Roe is overturned…", "url": "https://time.com/6174185/abortion-criminalization-public-defenders/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/post-roe-public-defenders.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-07T13:00:06Z", "content": "The debate over fetal rights is an old one, and at least 38 states already have some form of fetal-harm laws in place that make it a crime to hurt a fetus. Under Roe v. Wade, these laws are required … [+8274 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eliza Berman", "title": "On Losing a Mom, Then Becoming One", "description": "I was binging yet another of Netflix’s dime-a-dozen puzzle-box mystery shows recently when I felt a pang in my gut. One character was revealed to be a grown-up version of a seemingly distinct character, seeking an arguably unethical vengeance for a decades-ol…", "url": "https://time.com/6173530/mothers-day-losing-mom/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/motherhood.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-07T12:00:12Z", "content": "I was binging yet another of Netflix’s dime-a-dozen puzzle-box mystery shows recently when I felt a pang in my gut. One character was revealed to be a grown-up version of a seemingly distinct charact… [+5771 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eric Holder and Sam Koppelman", "title": "The Supreme Court Was Broken Long Before the Leak", "description": "The NAACP Legal Defense and Educational Fund (LDF) is responsible for winning some of the most important cases in the history of the United States—but one of the most impressive testaments to the organization’s strength is the fact that it survived the “Summe…", "url": "https://time.com/6174465/eric-holder-supreme-court-broke/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1395625554.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-07T11:00:16Z", "content": "The NAACP Legal Defense and Educational Fund (LDF) is responsible for winning some of the most important cases in the history of the United States—but one of the most impressive testaments to the org… [+14308 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Amie Ferris-Rotman", "title": "‘I Can’t Say No to Mothers in Need.’ The Foreign Women Joining Ukraine’s Fight Against Russia", "description": "Scores of foreign women have gone to Ukraine to fight. 'Putin is insane and unstable,' says one British mother of two, headed to the front lines.", "url": "https://time.com/6174161/foreign-women-fighters-ukraine-volunteers/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/hannah-jarvis_01.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-07T11:00:11Z", "content": "Sandra Anderson Eira doesn’t go short of appreciation. Fighting on the front line in Ukraine, the 35-year-old says locals have given her chocolate, roses, and even pairs of socks.\r\n“There have also b… [+7155 chars]"}]}