{"status": "ok", "totalResults": 31, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Bloomberg", "title": "Shanghai Reopens as China Hails Another Victory Over COVID-19", "description": "China has declared victory over Shanghai’s coronavirus outbreak as the nation reported its fewest new cases in more than three months.", "url": "https://time.com/6183422/shanghai-china-covid-zero/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1400358018.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-02T07:59:49Z", "content": "China declared victory over Shanghai’s coronavirus outbreak as the nation reported its fewest new cases in more than three months, vindicating Covid Zero in the eyes of Beijing despite the policy’s r… [+5830 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Sean Murphy and Terry Wallace/AP", "title": "Mass Shooting by Lone Gunman at Tulsa Hospital Leaves 4 Dead", "description": "It is the latest incident in a series of deadly mass shootings across the country in recent weeks.", "url": "https://time.com/6183394/shooting-tulsa-hospital-gunman/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/tulsa4.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-02T06:04:48Z", "content": "TULSA (OKLAHOMA) — A gunman carrying a rifle and a handgun killed four people Wednesday at a Tulsa medical building on a hospital campus, police said, the latest in a series of deadly mass shootings … [+4432 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Sean Gregory", "title": "The Finals Are Happening. But NBA Twitter Can’t Get Past the Curry-Durant Drama", "description": "In the run-up to the Golden State Warriors-Boston Celtics matchup, fans debate the legacies of Stephen Curry and Kevin Durant. Enough.", "url": "https://time.com/6183103/warriors-celtics-nba-finals-curry-durant/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1399607639.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-02T00:25:56Z", "content": "These 2022 NBA Finals between the Golden State Warriors and Boston Celtics, which tip off Thursday night in San Francisco, offer no shortage of basketball intrigue. Two dynastic franchises going head… [+6214 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "W.J. Hennigan", "title": "U.S.-Russia Tensions Rise Amid Biden Decision To Send Rockets To Ukraine", "description": "President Joe Biden’s decision Wednesday to provide Ukraine with advanced rocket systems that can strike targets from dozens of miles away gives Kyiv a new, much-needed advantage in their hard-fought war with Russia. After months imploring the U.S. to send lo…", "url": "https://time.com/6183291/russia-tensions-rise-rockets-ukraine/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/AP22151780796821.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-02T00:04:33Z", "content": "President Joe Biden’s decision Wednesday to provide Ukraine with advanced rocket systems that can strike targets from dozens of miles away gives Kyiv a new, much-needed advantage in their hard-fought… [+7618 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Charlie Campbell / London", "title": "Denmark Just Reversed 30 Years of Euroskeptic Defense Policy—Thanks to Russia", "description": "Danes voted in a referendum to overturn the country's opt-out of the E.U.’s common defense policy, following Russia's invasion of Ukraine.", "url": "https://time.com/6183159/denmark-referendum-defense-eu-russia/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1241029449.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-01T21:29:15Z", "content": "Denmark on Wednesday voted to overturn its opt-out of the E.U.’s common defense policy, reversing three decades of Euroskepticism regarding security matters. The move is the latest sign of the West c… [+5283 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Olivia B. Waxman", "title": "America’s ‘African Founders’: The Black Thinkers Who Shaped the U.S.", "description": "African Founders: How Enslaved People Expanded American Ideals, is an encyclopedia of enslaved people’s experiences in the United States from the 17th century to the 19th century", "url": "https://time.com/6183265/americas-african-founders-history/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/african-founders.jpg?quality=85&crop=0px%2C323px%2C1903px%2C996px&resize=1200%2C628&strip", "publishedAt": "2022-06-01T20:42:16Z", "content": "Historian David Hackett Fischer, author of the Pulitzer Prize-winning Washington’s Crossing, has been writing history books since 1965, and his latest, African Founders: How Enslaved People Expanded … [+7623 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Kurt Wagner and Emily Chang / Bloomberg", "title": "Sheryl Sandberg Is Stepping Down as Meta’s COO After 14 Years", "description": "Sandberg will remain on the board of Meta, the parent company of Facebook, Instagram and WhatsApp.", "url": "https://time.com/6183328/meta-coo-sheryl-sandberg-steps-down/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/meta-coo-sheryl-sandberg-steps-down-1-1.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-01T20:20:46Z", "content": "Meta Platforms Inc.’s Sheryl Sandberg, who became one of the most recognized figures in global business after helping Facebook transform from a startup into a multibillion-dollar advertising powerhou… [+1337 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Simmone Shah", "title": "Jury Finds Amber Heard Defamed Johnny Depp, But Both Awarded Millions in Damages", "description": "After weeks of testimonies from dozens of witnesses, the high-profile defamation case between actors Johnny Depp and Amber Heard has finally reached an end. The verdict Following a six-week trial and less than three days of deliberation, the jury in the defam…", "url": "https://time.com/6183255/johnny-depp-amber-heard-verdict/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/GettyImages-1241039283.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-01T19:51:06Z", "content": "After weeks of testimonies from dozens of witnesses, the high-profile defamation case between actors Johnny Depp and Amber Heard has finally reached an end.\r\nThe verdict\r\nFollowing a six-week trial a… [+2703 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Carolyn Thompson / AP", "title": "Buffalo Mass Shooting Suspect Indicted for Murder, Terrorism, and Hate Crimes", "description": "A grand jury charged Payton Gendron with domestic terrorism motivated by hate and 10 counts of first-degree murder for the attack that killed 10 Black people at a Buffalo super market.", "url": "https://time.com/6183278/buffalo-shooting-suspect-indicted/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/buffalo-shooting-suspect-indicted-1.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-01T19:42:11Z", "content": "BUFFALO, N.Y. — A grand jury on Wednesday charged the white 18-year-old accused of fatally shooting 10 Black people at a Buffalo supermarket with domestic terrorism motivated by hate and 10 counts of… [+1285 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Belinda Luscombe", "title": "‘Like Shooting a Moving Target.’ This Company Is Trying to Withdraw from Russia. It’s Getting Complicated", "description": "In February, CEO Mark Weil announced that TMF Group be wrapping up any work with Russian clients. It's been more complicated than he thought", "url": "https://time.com/6179726/russia-company-exit-tmf/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1240194385.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-06-01T19:13:00Z", "content": "In the early weeks of the war on Ukraine, an unprecedented number of firms announced they would cease operations in Russia as an act of protest against the invasion. But announcing a departure and ac… [+11104 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Brian Castner", "title": "The White Power Mercenaries Fighting For The Lost Cause Around the World", "description": "Russian mercenaries are the all-too-real bogeymen of the war in Ukraine. Most belong to the company known colloquially as Wagner, a quasi-corporate paramilitary group connected to the Kremlin that serves as a violent tool of Putin’s foreign policy around the …", "url": "https://time.com/6180611/white-power-mercenaries-fighting-the-lost-cause/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/01/White-Power-Mercenaries-07-copy.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-01T18:54:18Z", "content": "Russian mercenaries are the all-too-real bogeymen of the war in Ukraine. Most belong to the company known colloquially as Wagner, a quasi-corporate paramilitary group connected to the Kremlin that se… [+19836 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jeffrey Kluger", "title": "A Growing Number of Young People Are Attempting Suicide by Self-Poisoning", "description": "Suicides among young people have been on the rise for a long time. Among 10 to 24 year olds, overall rates of deaths by suicide in the U.S. increased 57% from 2000 to 2018, according to federal data. Now, a new study published in the journal Clinical Toxicolo…", "url": "https://time.com/6183226/suicide-poisoning-young-people/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/prescription-bottles-on-shelf.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-01T18:36:36Z", "content": "Suicides among young people have been on the rise for a long time. Among 10 to 24 year olds, overall rates of deaths by suicide in the U.S. increased 57% from 2000 to 2018, according to federal data.… [+3303 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Mat Nashed", "title": "The UAE and Israel Have High Hopes for Their Historic Trade Deal. Experts Are Skeptical", "description": "Experts sees the trade deal as part of a wider Emirati strategy to deepen ties with Israel to hedge against Iran, a shared strategic foe of both countries", "url": "https://time.com/6183180/israel-uae-trade-deal/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/israel-uae-agreement.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-01T17:30:24Z", "content": "Israel and the United Arab Emirates deepened ties on Tuesday with a historic free trade agreement—the first of its kind between Israel and an Arab country—at a time of growing criticism of Israel’s t… [+8267 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Lindsay Lee Wallace", "title": "16 LGBTQ Movies to Watch This Pride Month", "description": "Already watched 'Fire Island' and want to know what’s next? Here are 16 suggestions for your Pride Month watch list.", "url": "https://time.com/6183107/lgbtq-movies-pride-month/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Best-LGBTQ-movies-final1.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-01T17:07:30Z", "content": "Pride is upon us once again, and that means it’s time for rainbow flags (and rainbow ads), flings, flounces, firm reminders that the first Pride was a riot and that the fight for queer liberation con… [+10253 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "LYNN ELBER / AP", "title": "Jada Pinkett Smith Talks Hair-Loss ‘Shame,’ Outcome of Oscar Night Slap", "description": "LOS ANGELES — Jada Pinkett Smith turned her husband’s Oscar-night blowup into a teachable moment about alopecia areata, the hair-loss disorder affecting her and millions of others that, in some cases, can impact a person’s sense of identity. “Considering what…", "url": "https://time.com/6183207/jada-pinkett-smith-hair-loss-oscar-slap/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/03/Will-Smith-Jada-Pinkett-Smith-Oscars-2022.jpg?quality=85&crop=1px%2C0px%2C1024px%2C536px&resize=1200%2C628&strip", "publishedAt": "2022-06-01T17:03:33Z", "content": "LOS ANGELES — Jada Pinkett Smith turned her husband’s Oscar-night blowup into a teachable moment about alopecia areata, the hair-loss disorder affecting her and millions of others that, in some cases… [+3125 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Reade Pickert / Bloomberg", "title": "U.S. Job Openings Decline From Record While Remaining Elevated", "description": "The decrease in job openings reflected drops in health care and social assistance, retail trade and accommodation and food services.", "url": "https://time.com/6183135/job-openings-decline-april/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/job-openings-decline-remain-elevated.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-01T16:11:20Z", "content": "U.S. job openings fell in April from a record in the prior month though remained historically elevated, suggesting little relief for employers struggling to attract and retain workers.\r\nThe number of… [+2450 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Rachel Fleishman", "title": "I’m a Pediatrician Caring for Families in Poverty. Here’s What’s Been Happening at My Hospital Since the Child Tax Credit Expired", "description": "When it’s my turn to be the pediatrician in the well-baby nursery at my hospital, my job is to counsel new parents about healthy newborn behaviors and assure them their babies are capable of basic survival. Breathing. Eating. Pooping. The rhythm and routine o…", "url": "https://time.com/6183137/child-tax-credit-expiration-babies-infants/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/child-tax-credit.jpg?quality=85&crop=0px%2C75px%2C2400px%2C1256px&resize=1200%2C628&strip", "publishedAt": "2022-06-01T15:32:58Z", "content": "When it’s my turn to be the pediatrician in the well-baby nursery at my hospital, my job is to counsel new parents about healthy newborn behaviors and assure them their babies are capable of basic su… [+6438 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Tara Law", "title": "Loneliness Is a Public Health Emergency. Here’s What Helps, According to Experts", "description": "When the pandemic first began, many experts feared that even people who managed to avoid the virus would suffer from unprecedented levels of loneliness. What would happen when millions of people were told to stay at home and distance themselves from friends a…", "url": "https://time.com/6183058/loneliness-health-effects-what-to-do/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/Loneliness.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-01T15:13:35Z", "content": "When the pandemic first began, many experts feared that even people who managed to avoid the virus would suffer from unprecedented levels of loneliness. What would happen when millions of people were… [+7712 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "JIM MORRIS and ROB GILLIES / AP", "title": "British Columbia Is Decriminalizing Small Amounts of Drugs to Curb Overdose Deaths", "description": "Canada's regional three-year experiment in drug decriminalization will include opioids, cocaine, meth, and MDMA.", "url": "https://time.com/6183084/canada-british-columbia-drug-decriminalization/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/canada-british-columbia-drug-decriminalization.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-01T15:12:28Z", "content": "(Vancouver, British Columbia) — Canada’s government said Tuesday it will allow British Columbia to try a three-year experiment in decriminalizing possession of small amounts of drugs, seeking to stem… [+4456 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Brooklyn Subway Shooting Victim Sues Glock, Maker of Pistol Gunman Used", "description": "The lawsuit was filed as the nation reels from last week's massacre of 19 children and two teachers at an elementary school in Uvalde, Texas.", "url": "https://time.com/6183105/brooklyn-subway-victim-sues-glock/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/06/brooklyn-subway-victim-sues-glock-.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-06-01T14:47:48Z", "content": "NEW YORK — A woman wounded in last month’s mass shooting on a New York City subway filed a lawsuit Tuesday against the maker of the handgun allegedly used in the attack and its parent company, accusi… [+1780 chars]"}]}