{"status": "ok", "totalResults": 35, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Youngest of 10 Buffalo Shooting Victims Laid to Rest", "description": "Roberta Drury, a 32-year-old woman who was the youngest of the 10 Black people killed at a Buffalo supermarket, was remembered at her funeral Saturday for her love for family and friends, tenacity “and most of all, that smile that could light up a room.”", "url": "https://time.com/6179810/buffalo-shooting-younges-victim/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/buffalo-1.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-21T18:29:06Z", "content": "SYRACUSE, N.Y. — Roberta Drury, a 32-year-old woman who was the youngest of the 10 Black people killed at a Buffalo supermarket, was remembered at her funeral Saturday for her love for family and fri… [+2139 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Nearly 8,000-Year-Old Skull Found in the Minnesota River", "description": "A partial skull that was discovered last summer by two kayakers in Minnesota will be returned to Native American officials after investigations determined it was about 8,000 years old.", "url": "https://time.com/6179803/8000-year-old-skull-minnesota-river/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/river.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-21T17:47:01Z", "content": "REDWOOD FALLS, Minn. — A partial skull that was discovered last summer by two kayakers in Minnesota will be returned to Native American officials after investigations determined it was about 8,000 ye… [+2232 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Philip Elliott", "title": "The Back Booth: ‘Republicans Can Take a Homeless Guy Off the Street and He Will Easily Win the Race’", "description": "Welcome to The Back Booth, a weekend edition of The D.C. Brief. Here each Saturday, TIME’s politics newsletter will host a conversation between political professionals on the right and the left, pulling back the curtain on the conversations taking place in Wa…", "url": "https://time.com/6179494/fetterman-pennsylvania-democrats-new-york/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/john-fetterman-senate.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-21T17:00:41Z", "content": "Welcome to The Back Booth, a weekend edition of The D.C. Brief. Here each Saturday, TIME’s politics newsletter will host a conversation between political professionals on the right and the left, pull… [+5833 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "ROD McGUIRK / AP", "title": "Australian Labor Topples Conservatives After Nine Years in Power", "description": "Australia’s center-left opposition party toppled the conservative government after almost a decade in power, and Prime Minister-elect Anthony Albanese in his Saturday election victory speech promised sharper reductions in greenhouse gas emissions while he fac…", "url": "https://time.com/6179796/australian-labor-topples-conservatives/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/australia-.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-21T16:38:57Z", "content": "CANBERRA, Australia — Australia’s center-left opposition party toppled the conservative government after almost a decade in power, and Prime Minister-elect Anthony Albanese in his Saturday election v… [+4224 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Stephanie Zacharek", "title": "George Miller’s Three Thousand Years of Longing Sings Sweetly, But Leaves Much to Be Desired", "description": "This is ultimately a story about the romance of companionship, but the highest purpose of movies is to give us more than what we think we want", "url": "https://time.com/6179756/three-thousand-years-of-longing-review/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/idris.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-21T15:31:21Z", "content": "In the world of romantic desire, there’s no such thing as close enough for jazz; you either hit the note or you don’t. George Miller’s Three Thousand Years of Longing—playing out of competition here … [+5435 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Police Report Two Deaths From Tornado in Northern Michigan", "description": "A second person died in a rare tornado that hit a small community in northern Michigan, state police said Saturday.", "url": "https://time.com/6179783/michigan-tornado/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Michigan.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-21T14:32:05Z", "content": "GAYLORD, Mich. — A second person died in a rare tornado that hit a small community in northern Michigan, state police said Saturday.\r\nThe person was in their 70s and lived in a mobile home park, Lt. … [+836 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Katie Reilly", "title": "How Buffalo Schools Are Grappling With the Racist Attack in Their Community", "description": "Fatima Morrell, the associate superintendent for culturally and linguistically responsive initiatives in Buffalo public schools, says it’s important for schools to play a role in teaching students to combat racism, while offering social-emotional support for …", "url": "https://time.com/6179734/buffalo-schools-grapple-with-shooting/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Buffalo-shooting-schools.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-21T13:46:38Z", "content": "After 10 people were killed in a racist shooting at a Buffalo supermarket last week, Fatima Morrell knew the city’s educators could not avoid discussing the tragedy with students. \r\n“We can’t shy awa… [+8313 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Time", "title": "President Biden Signs $40 Billion Ukraine Aid Package During Asia Trip", "description": "President Biden on Saturday signed legislation to support Ukraine with an additional $40 billion in U.S. assistance as the Russian invasion approaches its fourth month.", "url": "https://time.com/6179763/biden-signs-40-billion-ukrain-assistance/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/biden.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-21T13:11:38Z", "content": "SEOUL, South Korea — President Biden on Saturday signed legislation to support Ukraine with an additional $40 billion in U.S. assistance as the Russian invasion approaches its fourth month.\r\nThe legi… [+1745 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jasmine Aguilera and Abigail Abrams", "title": "What the Buffalo Tragedy Has to do With the Effort to Overturn Roe", "description": "In the week since a gunman killed 10 people in a grocery store in Buffalo, N.Y., countless articles and television spots have unpacked the racist conspiracy he shared in a hate-filled manifesto before his shooting spree. The conspiracy—the so-called great rep…", "url": "https://time.com/6178135/buffalo-shooting-abortion-replacement-theory/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/abortion-pro-life.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-21T12:00:31Z", "content": "In the week since a gunman killed 10 people in a grocery store in Buffalo, N.Y., countless articles and television spots have unpacked the racist conspiracy he shared in a hate-filled manifesto befor… [+10070 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Katie Gutierrez", "title": "How I Lost Myself to Motherhood", "description": "It’s impossible to gauge the depth of a hole you’re in until you begin to climb out. I’ve felt this way in the most challenging times of my life, usually when suffering loss: death, divorce. I remember the worst moments in discordant flashes—sobbing in a clos…", "url": "https://time.com/6177113/motherhood-sacrifice-roe-v-wade/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/high-res-color.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-21T11:53:05Z", "content": "It’s impossible to gauge the depth of a hole you’re in until you begin to climb out. I’ve felt this way in the most challenging times of my life, usually when suffering loss: death, divorce. I rememb… [+6674 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Robert Baer", "title": "How the CIA’s Hunt for a Russian Mole Blinded It To Putin’s Rise", "description": "War, by nature, tends to have winners and losers. The war in Ukraine, a universal disaster, seems to have more losers than winners, though. But before this conflict, few might have expected one of its few winners to be a much tarnished organization thousands …", "url": "https://time.com/6179607/cia-mole-russia-putin-rise/", "urlToImage": "https://api.time.com/wp-content/themes/time2014/img/time-logo-og.png", "publishedAt": "2022-05-21T10:30:00Z", "content": "War, by nature, tends to have winners and losers. The war in Ukraine, a universal disaster, seems to have more losers than winners, though. But before this conflict, few might have expected one of it… [+6906 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jasmine Aguilera", "title": "‘Short Term Band-Aid.’ Afghans in the U.S. Can Now Apply for Temporary Protection", "description": "The Biden Administration will now allow Afghans in the U.S. to apply for Temporary Protected Status (TPS), a designation that would protect them from deportation for 18 months, grant them a work permit, and give them authorization to travel. The Department of…", "url": "https://time.com/6179185/afghans-temporary-protected-status/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Afghan-TPS.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-20T22:26:52Z", "content": "The Biden Administration will now allow Afghans in the U.S. to apply for Temporary Protected Status (TPS), a designation that would protect them from deportation for 18 months, grant them a work perm… [+5232 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jasmine Aguilera and Madeleine Carlisle", "title": "Federal Judge Blocks Biden From Ending Controversial Border Policy, Title 42", "description": "The controversial, Trump-era border policy will now likely remain in place for the foreseeable future, exacerbating border policy confusion.", "url": "https://time.com/6176711/title-42-biden-judge-blocked/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1395555073-1.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-20T21:43:01Z", "content": "A district judge ruled Friday that the Biden Administration must continue to expel migrants under Title 42, a COVID-19-related health measure first implemented under President Donald Trump. The decis… [+8213 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Shannon Carlin", "title": "The 46 Most Anticipated Movies of Summer 2022", "description": "As the weather gets hotter, the movies always seem to get a little cooler. This summer’s list of most anticipated movies include existential superheroes, killer animals, unsettling horror, family comedies, weird arthouse fare, inspiring documentaries, strange…", "url": "https://time.com/6179490/summer-movies-2022/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Summer-Preview_Movies2022_final.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-20T20:01:00Z", "content": "As the weather gets hotter, the movies always seem to get a little cooler. This summer’s list of most anticipated movies include existential superheroes, killer animals, unsettling horror, family com… [+13403 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Josiah Bates", "title": "Bill Cosby Is Facing Another Trial. Here’s What to Know About the Judy Huth Case", "description": "Judy Huth, the plaintiff in the case, alleges that Cosby groped her while at the Playboy Mansion in Los Angeles 50 years ago.", "url": "https://time.com/6178298/bill-cosby-trial-judy-huth/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Cosby-civil-trial-5-19-22.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-20T19:00:25Z", "content": "Jury selection begins Monday in a new trial against Bill Cosby—a trial that could be one of the last legal proceedings the once beloved comedian faces.\r\nJudy Huth, the plaintiff in the case, alleges … [+2604 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Stephanie Zacharek", "title": "In the Film Men a Woman Tries—Unsuccessfully—To Be Left Alone", "description": "Depending on whom you ask, modern men are either suffering a crisis of masculinity or they wield more power than ever. In his tricky psycho-sexual horror film Men, writer-director Alex Garland explores both angles, suggesting that men don’t know who they are …", "url": "https://time.com/6179437/men-review-alex-garland/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/jessie-buckley-men-2.jpeg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-20T18:00:57Z", "content": "Depending on whom you ask, modern men are either suffering a crisis of masculinity or they wield more power than ever. In his tricky psycho-sexual horror film Men, writer-director Alex Garland explor… [+3653 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "JAKE COYLE / AP", "title": "A Protestor Stripped Off Her Clothes to Reveal an Anti-Rape Message on the Cannes Red Carpet", "description": "CANNES, France — A woman who stripped off her clothes to reveal a message against rape written on her body crashed the Cannes Film Festival red carpet premiere of George Miller’s “Three Thousand Years of Longing” on Friday. The unidentified woman tore off her…", "url": "https://time.com/6179446/protester-cannes-george-miller/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/cannes-protestor.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-20T17:57:05Z", "content": "CANNES, France — A woman who stripped off her clothes to reveal a message against rape written on her body crashed the Cannes Film Festival red carpet premiere of George Miller’s “Three Thousand Year… [+804 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Andrew R. Chow", "title": "Russian DJ Nina Kraviz Has Been Removed From Three Music Festivals Following Criticism", "description": "The Russian DJ has expressed tacit support for Putin in the past, and is no longer playing at three festivals following calls for her removal from them.", "url": "https://time.com/6179208/nina-kraviz-backlash-russia-ukraine/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1339546613.jpg?quality=85&crop=0px%2C488px%2C5000px%2C2617px&resize=1200%2C628&strip", "publishedAt": "2022-05-20T17:37:47Z", "content": "The Russian DJ Nina Kraviz is no longer playing at three music festivals this summer following criticism over her political history and recent rhetoric about Russia’s invasion of Ukraine. \r\nKraviz, o… [+3095 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Stephanie Zacharek", "title": "James Gray’s Armageddon Time Is a Reminder of What Happens When We Fail to Act Against White Privilege", "description": "It’s conveniently noble to think that human beings are shaped by their actions, that decisiveness is what makes us who we are. Yet the times we failed to act are often what we remember most vividly. There’s the merest synapse leap between wanting to do the ri…", "url": "https://time.com/6179174/armageddon-time-review-cannes/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Armageddon-Time.jpg?quality=85&w=741&h=493&crop=1", "publishedAt": "2022-05-20T17:24:15Z", "content": "It’s conveniently noble to think that human beings are shaped by their actions, that decisiveness is what makes us who we are. Yet the times we failed to act are often what we remember most vividly. … [+7635 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Musk Denies Sexual Misconduct Allegation by Flight Attendant", "description": "A report said SpaceX paid the woman $250,000 in severance in 2018 in exchange for her agreeing not to file a lawsuit over her claim.", "url": "https://time.com/6179426/musk-denies-misconduct/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/musk-denies-misconduct.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-20T17:23:31Z", "content": "NEW YORK — Tesla and SpaceX CEO Elon Musk has denied a claim of sexual misconduct by a flight attendant contracted by SpaceX who worked on his private jet in 2016.\r\nA report by Business Insider said … [+2868 chars]"}]}