{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Belinda Luscombe", "title": "Henry Kissinger: The Internet Does Not Make Great Leaders", "description": "In his new book Kissinger examines six world leaders who inherited difficult geopolitical situations, and in his view, overcame and improved them", "url": "https://time.com/6193035/henry-kissinger-leaders/", "urlToImage": "https://api.time.com/wp-content/uploads/2021/11/henry-kissinger-eric-schmidt.jpg?quality=85&crop=0px%2C345px%2C2400px%2C1256px&resize=1200%2C628&strip", "publishedAt": "2022-07-03T11:00:36Z", "content": "Henry Kissinger, the 98-year-old, Nobel-Peace-Prize-winning, Monty Python-inspiring, former U.S. Secretary of State, believes that, perhaps more than any time since the Age of Enlightenment, the worl… [+14688 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": null, "title": "Google to Delete Users Location Data at Abortion Clinics", "description": "Google will automatically purge information about users who visit abortion clinics or other places that could trigger legal problems now that the U.S. Supreme Court has opened the door for states to ban the termination of pregnancies.", "url": "https://time.com/6193517/google-location-information-abortion-clnics/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/search.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-02T19:17:37Z", "content": "MOUNTAIN VIEW, Calif. — Google will automatically purge information about users who visit abortion clinics or other places that could trigger legal problems now that the U.S. Supreme Court has opened… [+1916 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Ian Fisher / Bloomberg", "title": "Supreme Court Marshal Demands End to Protests in Front of Justices’ Homes", "description": "The chief security officer for the US Supreme Court demanded that Maryland officials enforce laws against picketing in front of private houses, saying that “threatening activity” has increased in recent weeks.", "url": "https://time.com/6193512/maryland-antipicketing-laws-supreme-court/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/justice.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-02T19:03:09Z", "content": "Bloomberg — The chief security officer for the US Supreme Court demanded that Maryland officials enforce laws against picketing in front of private houses, saying that “threatening activity” has incr… [+1615 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Flash Flood Warning Issued as Tropical Storm Colin Hits the Carolinas", "description": "Tropical Storm Colin formed along the South Carolina coast on Saturday, bringing the threat of rain and high winds for a day or two during the holiday weekend before improving for Monday's July Fourth celebrations.", "url": "https://time.com/6193508/tropical-storrm-colin-south-carolina/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/storm.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-02T18:46:48Z", "content": "MIAMI — Tropical Storm Colin formed along the South Carolina coast on Saturday, bringing the threat of rain and high winds for a day or two during the holiday weekend before improving for Monday’s Ju… [+3088 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "Uvalde School District’s Police Chief Resigns From City Council", "description": "The Uvalde school district’s police chief has stepped down from his position in the City Council just weeks after being sworn in following allegations that he erred in his response to the mass shooting at Robb Elementary School that left 19 students and two t…", "url": "https://time.com/6193502/uvalde-school-district-police-chief-resigns-texas/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/Uvalde.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-02T18:01:30Z", "content": "UVALDE, Texas — The Uvalde school district’s police chief has stepped down from his position in the City Council just weeks after being sworn in following allegations that he erred in his response to… [+2914 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Associated Press", "title": "The Bodies of Two of Three Missing Children Found in Minnesota Lake", "description": "The bodies of two young children have been recovered from a Minnesota lake, and searchers are still looking for a third they fear may have been intentionally drowned.", "url": "https://time.com/6193495/missing-children-bodies-found-minnesota/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/Family.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-02T16:38:02Z", "content": "VADNAIS HEIGHTS, Minn. — The bodies of two young children have been recovered from a Minnesota lake, and searchers are still looking for a third they fear may have been intentionally drowned.\r\nMeanwh… [+990 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "PAUL WEBER, ANTHONY IZAGUIRRE and STEPHEN GROVES / AP", "title": "Texas Supreme Court Blocks Order That Resumed Abortions Up to Six Weeks of Pregnancy", "description": "The Texas Supreme Court has blocked a lower court order that had allowed clinics in the state to continue performing abortions even after the U.S. Supreme Court overturned it's landmark 1973 ruling that confirmed a constitutional right to abortion.", "url": "https://time.com/6193480/texas-supreme-court-abortions-roe/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/abortion.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-02T14:56:34Z", "content": "AUSTIN, Texas — The Texas Supreme Court has blocked a lower court order that had allowed clinics in the state to continue performing abortions even after the U.S. Supreme Court overturned it’s landma… [+6097 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "MIKE FULLER / AP", "title": "London Celebrates 50th Anniversary of Pride", "description": "After two years of cancellations because of the coronavirus pandemic, the parade came a half-century after London’s first march to celebrate Pride in 1972", "url": "https://time.com/6193474/pride-50th-anniversary-london/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/Parade.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-02T14:45:53Z", "content": "LONDON — The streets of London were filled with color on Saturday as the U.K. capital marked 50 years of Pride.\r\nA vibrant crowd of hundreds of thousands turned out to either take part in or watch th… [+2014 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Manish Bapna", "title": "The Supreme Court’s Climate Decision Strikes at the Government’s Ability to Protect Its People", "description": "One of the most urgent challenges we face, as a nation, is to confront the mounting costs and existential dangers of climate change. It’s a daunting task the Supreme Court just made harder. In a ruling Thursday, the Court set new constraints on what the U.S. …", "url": "https://time.com/6193347/climate-supreme-court-decision-damage/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/supreme-court-climate-ruling.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-02T13:45:45Z", "content": "One of the most urgent challenges we face, as a nation, is to confront the mounting costs and existential dangers of climate change. It’s a daunting task the Supreme Court just made harder.\r\nIn a rul… [+5235 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Taylor Harris", "title": "America Insists It Is Great. It Should Work on Being Decent", "description": "For as long as I can remember, I’ve felt a stifling expectation, an understood command to believe that America is great. If I could not see this nation as great, then I must be a disgruntled traitor. If I could not see America’s remarkable progress—how it eve…", "url": "https://time.com/6190395/american-exceptionalism-guns-essay/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/ID4.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-07-02T11:00:55Z", "content": "For as long as I can remember, I’ve felt a stifling expectation, an understood command to believe that America is great. If I could not see this nation as great, then I must be a disgruntled traitor.… [+6993 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Tara Sonenshine", "title": "Europe’s Refugee Crisis Is Going to Get Worse", "description": "Exhausted and depleted, Ukraine’s refugees have endured hell since the Russian invasion of their country in February 2022. According to the United Nations, at least 12 million people have fled their homes since the war began—over 5 million having gone to othe…", "url": "https://time.com/6192422/europe-ukrainian-refugees/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/07/GettyImages-1241545195.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-07-02T10:00:52Z", "content": "Exhausted and depleted, Ukraine’s refugees have endured hell since the Russian invasion of their country in February 2022.\r\nAccording to the United Nations, at least 12 million people have fled their… [+7056 chars]"}]}