{"status": "ok", "totalResults": 60, "articles": [{"source": {"id": "time", "name": "Time"}, "author": "Lindsay Lee Wallace", "title": "Netflix’s Our Father Tells The True Story of a Fertility Doctor Who Used His Own Sperm on Patients", "description": "During the 1970s and ‘80s, a fertility specialist in Indiana named Dr. Donald Cline inseminated dozens of patients with his own sperm, without their knowledge or consent. The stories of some of these women and the (at least) 94 biological children of Cline ar…", "url": "https://time.com/6176310/our-father-true-story-netflix/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/our-father-1-netflix.jpeg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-12T21:54:43Z", "content": "During the 1970s and ‘80s, a fertility specialist in Indiana named Dr. Donald Cline inseminated dozens of patients with his own sperm, without their knowledge or consent. The stories of some of these… [+7243 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Josiah Bates", "title": "An Alabama Correctional Officer Helped a Murder Suspect Escape. The Jailbreak Highlights a Bigger Problem", "description": "The seemingly made-for-TV story of the Alabama murder suspect who escaped from jail with the help of a female correctional officer after the two possibly became \"romantically involved\" ended in tragedy", "url": "https://time.com/6176355/alabama-inmate-escape-highlights-problems/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Vicky-White-Alabama-Jailbreak.jpg?quality=85&crop=49px%2C53px%2C3046px%2C1592px&resize=1200%2C628&strip", "publishedAt": "2022-05-12T21:37:03Z", "content": "The seemingly made-for-TV story of the Alabama murder suspect who escaped from jail with the help of a female correctional officer after the two possibly became “romantically involved” ended in trage… [+6664 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Philip Elliott", "title": "To Save Roe’s Protections, Democrats Pour More Money Into Flipping Statehouses", "description": "Some Democratic strategists plan to spend millions to find and register likely Democrats in parts of key states they had previously ignored.", "url": "https://time.com/6176327/democrats-abortion-roe-statehouses-midterms/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/democrats-dc-brief.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-12T21:10:06Z", "content": "This article is part of The D.C. Brief, TIME’s politics newsletter. Sign up here to get stories like this sent to your inbox.\r\nThe numbers are comically small, rounding errors in tallies with far few… [+5464 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jasmine Aguilera", "title": "Overturning Roe Could Lead to Restrictions on Birth Control", "description": "Experts say that such arguments opposing birth control—or other liberties for that matter, like same sex marriage—may have legal traction in a post-Roe legal landscape.", "url": "https://time.com/6175213/birth-control-after-roe-v-wade/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/abortion-emergency-contraception-lawmakers-2.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-12T20:22:39Z", "content": "In the wake of a leaked Supreme Court draft opinion overturning Roe v Wade, a handful of state and local Republican politicians appeared to support proposals restricting access to birth control.\r\nIn … [+8254 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Annabel Gutterman", "title": "Author Maggie Shipstead Knows Why We’re Drawn to Celebrity Characters", "description": "Last May, Maggie Shipstead released Great Circle, a sweeping, 600-page epic that flips between the lives of a 20th-century pilot who goes missing and a present-day actor playing the pilot in a major biopic. One year later, Shipstead returns with more reflecti…", "url": "https://time.com/6175825/maggie-shipstead-interview-you-have-a-friend-in-10a/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/you-have-a-friend-in-10a.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-12T20:18:32Z", "content": "Last May, Maggie Shipstead released Great Circle, a sweeping, 600-page epic that flips between the lives of a 20th-century pilot who goes missing and a present-day actor playing the pilot in a major … [+4166 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Omar G. Encarnación", "title": "Florida’s ‘Don’t Say Gay’ Bill Is Part of the State’s Long, Shameful History", "description": "Florida’s “Parental Rights in Education Bill” has made the sunshine state ground zero in America’s culture wars. Signed into law last month by Republican Gov. Ron DeSantis, the bill prohibits discussion of sexual orientation and gender identity in the state’s…", "url": "https://time.com/6176224/florida-dont-say-gay-history-lgbtq-rights/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1239533032.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-12T19:51:51Z", "content": "Florida’s “Parental Rights in Education Bill” has made the sunshine state ground zero in America’s culture wars. Signed into law last month by Republican Gov. Ron DeSantis, the bill prohibits discuss… [+10140 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Abigail Abrams", "title": "How Overturning Roe v. Wade Could Affect Every American", "description": "In the 49 years since the U.S. Supreme Court established a constitutional right to abortion, the experience of being a woman in this country has transformed. Birth control access has expanded, and more women have entered the workforce, pursued higher educatio…", "url": "https://time.com/6176180/overturn-roe-transform-america/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/roe-v-wade-scotus-decision-01.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-12T19:50:42Z", "content": "In the 49 years since the U.S. Supreme Court established a constitutional right to abortion, the experience of being a woman in this country has transformed.\r\nBirth control access has expanded, and m… [+7676 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Fatima Hussein / AP", "title": "Crypto Meltdown Prompts Treasury Secretary to Call for New Regulation", "description": "“We really need a regulatory framework to guard against the risks,” the Treasury Secretary said of cryptocurrencies called stable coins", "url": "https://time.com/6176254/crypto-meltdown-treasury-secretary/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/crypto-meltdown-treasury-secretary.jpg?quality=85&crop=52px%2C22px%2C7554px%2C3952px&resize=1200%2C628&strip", "publishedAt": "2022-05-12T19:46:32Z", "content": "WASHINGTON — Treasury Secretary Janet Yellen, responding to the recent sharp decline in the value of cryptocurrencies, said Thursday that additional federal regulation was needed to respond to the wa… [+1881 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Emily Barone", "title": "Americans Don’t Trust One of the Best Methods to Control Wildfires", "description": "When prescribed burns get out of control, the public becomes wary. But experts say they are a critical tool to combat worsening wildfires.", "url": "https://time.com/6176165/us-controlled-burns-climate-change/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1292987376.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-12T19:41:02Z", "content": "Last month in New Mexico, two separate wildfires in the same vicinity combined, resulting in a massive conflagration that is still ripping through the state. As of May 12, the Calf Canyon-Hermits Pea… [+5127 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Billy Perrigo/Geneva", "title": "Proton’s CEO Wanted to Fight Dictatorships. Now He’s Fighting Big Tech Too", "description": "Andy Yen stands at a panoramic window in his headquarters in Switzerland, surveying what on a clearer day would be a beautiful view. Ahead on the horizon, the Alps are shrouded in gray rain clouds. So Yen points down instead, at Proton’s neighbors in this non…", "url": "https://time.com/6176214/proton-ceo-andy-yen-profile/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Andy-Photo-Ses-April-2021-2-large.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-12T18:58:47Z", "content": "Andy Yen stands at a panoramic window in his headquarters in Switzerland, surveying what on a clearer day would be a beautiful view. Ahead on the horizon, the Alps are shrouded in gray rain clouds. S… [+11296 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Ian Morris", "title": "Central Asia Could Be the Key to Driving a Wedge Between Russian and China", "description": "“War is the realm of chance,” said Carl von Clausewitz, who knew more about the matter than most of us. “No other human activity is so continuously or universally bound up with it.” Even with Russia’s offensive in Ukraine bogging down to the point that a Pent…", "url": "https://time.com/6176087/russia-china-central-asia/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1240563628.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-12T18:28:44Z", "content": "“War is the realm of chance,” said Carl von Clausewitz, who knew more about the matter than most of us. “No other human activity is so continuously or universally bound up with it.” Even with Russia’… [+12200 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Kurt Wagner and Sarah Frier / Bloomberg", "title": "Twitter to Freeze Hiring, Rescind Offers Ahead of Musk Deal", "description": "The hiring freeze is a reflection of the company’s state of uncertainty while it awaits Elon Musk’s $44 billion takeover.", "url": "https://time.com/6176202/twitter-freeze-hiring-musk/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/twitter-hiring-freeze-musk.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-12T18:09:40Z", "content": "Twitter Inc. Chief Executive Officer Parag Agrawal announced a hiring freeze and other cost-cutting efforts on Thursday, a reflection of the company’s state of uncertainty while it awaits Elon Musk’s… [+2577 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Eloise Barry", "title": "What We Know So Far About the Killing of Al Jazeera Journalist Shireen Abu Akleh", "description": "The killing of the journalist has triggered global condemnation and grief at a time of increasing tensions in the West Bank and escalating violence.", "url": "https://time.com/6176154/shireen-abu-akleh-killing/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/shireen-abu-akleh-death-03.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-12T17:43:46Z", "content": "News broadcaster Al Jazeera accused Israel of “blatent murder” following the killing of one of its veteran journalists in the West Bank on Wednesday. Shireen Abu Akleh, a 51-year-old Palestinian-Amer… [+7783 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jeffrey Kluger", "title": "Astronomers Capture First Image of Supermassive Black Hole at the Center of our Galaxy", "description": "Astronomers using a necklace of radio telescopes around the world captured a picture of the supermassive Sagittarius A*.", "url": "https://time.com/6176127/supermassive-black-hole-in-milky-way/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/black-hole.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-12T15:59:16Z", "content": "You’d think it would be hard to overlook an object with a mass four million times greater than the sun. But when that object is a supermassive black hole like Sagittarius A*, the giant object astrono… [+4377 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jamie Ducharme", "title": "Long-Lasting Birth Control Is Already Hard to Get. Advocates Worry It May Only Get Worse", "description": "The possible overturning of Roe v. Wade has advocates worried about birth control access. Long-lasting contraception is already hard to get.", "url": "https://time.com/6176062/future-birth-control-access-long-lasting-contraceptives/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/IUD.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-12T15:21:20Z", "content": "When Rachel, a 35-year-old from Colorado, learned four years ago that she was pregnant despite taking birth control pills, she wanted to make sure it didn’t happen again. The stakes were high: in add… [+10966 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Jeffrey Kluger", "title": "Scientists Grow Plants in Soil from the Moon. Lunar Farming Could Be Next.", "description": "A breakthrough experiment could open the way to lunar farming", "url": "https://time.com/6175820/plants-grow-in-lunar-soil/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/The-Moon-e1652305012472.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-12T15:00:53Z", "content": "The Apollo astronauts faced a lot of challenges in their time on the moon, but having enough to eat was not among them. The longest any of the crews spent on the surface was the three days logged by … [+7369 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Stephanie Zacharek", "title": "The New Top Gun Is So Much Better Than the First One", "description": "It no longer matters whether you like or dislike Tom Cruise: no matter how good he looks in his ultra-moisturized, deal-with-the-devil skin, his ship has sailed not just into the waters of middle age, but beyond them. Always a performer desperate to be liked,…", "url": "https://time.com/6176032/top-gun-maverick-review/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/top-gun-maverick-01-e1652367121359.jpg?quality=85&w=1200&h=628&crop=1", "publishedAt": "2022-05-12T14:53:27Z", "content": "It no longer matters whether you like or dislike Tom Cruise: no matter how good he looks in his ultra-moisturized, deal-with-the-devil skin, his ship has sailed not just into the waters of middle age… [+7439 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Tara Law", "title": "State Laws Are Treating Fentanyl Like the New Crack—And Making the Same Mistakes of the 80s and 90s", "description": "Since the U.S. drug war was declared in 1971, various drugs have been identified as public enemy number one—from crack cocaine, in the 1980s, to prescription opioids in the early 2000s. Today, the primary villain is fentanyl, a synthetic opioid about 50 times…", "url": "https://time.com/6175676/fentanyl-overdose-deaths-colorado/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/Harm-Reduction-Action-Center-Denver.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-12T13:44:48Z", "content": "Since the U.S. drug war was declared in 1971, various drugs have been identified as public enemy number one—from crack cocaine, in the 1980s, to prescription opioids in the early 2000s. Today, the pr… [+9207 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "LORNE COOK / Associated Press", "title": "Why Finland and Sweden Joining NATO Will Be a Big Deal", "description": "It’s likely to be the quickest NATO enlargement ever and one that would redraw Europe’s security map. Finnish leaders announced Thursday their belief that Finland should join the world’s biggest military organization because of Russia’s war in Ukraine. Sweden…", "url": "https://time.com/6176023/finland-sweden-nato/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/GettyImages-1240599372.jpg?quality=85&w=1024&h=628&crop=1", "publishedAt": "2022-05-12T11:53:31Z", "content": "It’s likely to be the quickest NATO enlargement ever and one that would redraw Europe’s security map. Finnish leaders announced Thursday their belief that Finland should join the world’s biggest mili… [+4325 chars]"}, {"source": {"id": "time", "name": "Time"}, "author": "Edward Felsenthal", "title": "How TIME Chose Its 2022 List of Next Generation Leaders", "description": "At TIME, our eyes are on the rising stars poised to shape the future. We first joined forces with Rolex in 2014 to launch Next Generation Leaders, our series elevating young people from across fields and around the globe who are working to build a better worl…", "url": "https://time.com/6175735/next-generation-leaders-2022/", "urlToImage": "https://api.time.com/wp-content/uploads/2022/05/NGL2022_final.jpg?quality=85&crop=0px%2C103px%2C2400px%2C1256px&resize=1200%2C628&strip", "publishedAt": "2022-05-12T10:21:22Z", "content": "At TIME, our eyes are on the rising stars poised to shape the future. We first joined forces with Rolex in 2014 to launch Next Generation Leaders, our series elevating young people from across fields… [+3922 chars]"}]}