{"status": "ok", "totalResults": 11, "articles": [{"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Katherine Sayre", "title": "Tesla Is Set for Settlement Talks Over Musk Tweets About Taking Company Private", "description": "The court-ordered settlement talks in a shareholder lawsuit over CEO Elon Musk’s 2018 tweets will take place in October, the same month as two other trials involving Twitter and Tesla.", "url": "https://www.wsj.com/articles/tesla-is-set-for-settlement-talks-over-musk-tweets-about-taking-company-private-11658610181", "urlToImage": "https://images.wsj.net/im-589722/social", "publishedAt": "2022-07-23T21:03:00Z", "content": "Tesla is scheduled for court-ordered settlement talks in a shareholder lawsuit over Chief Executive Officer \r\nElon Musks 2018 tweets suggesting he had funding to take the company private.In a court f… [+325 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Christopher Mims", "title": "Your Home Address and Other Personal Info Are a Search Away. Here’s What to Do About It.", "description": "Data that personally identifies you can pop up on Google and other sites. With some basic steps and a little persistence, you can hide or remove a lot of it.", "url": "https://www.wsj.com/articles/how-to-remove-home-address-google-whitepages-11658514379", "urlToImage": "https://images.wsj.net/im-588566/social", "publishedAt": "2022-07-23T14:21:57Z", "content": "When you type your name into a search engine, you typically expect to see links to your social-media profiles or personal websites. But you might also find your home address, email, phone number, the… [+464 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "wsj", "title": "Inside Saudi Plan to Build Skyscraper That Stretches for 75 Miles...", "description": "Saudi Crown Prince Mohammed bin Salman demanded something as ambitious as Egypt’s pyramids. What urban planners came up with in response are plans for the world’s largest structure.", "url": "https://www.wsj.com/articles/inside-saudi-arabias-plan-to-build-a-skyscraper-that-stretches-for-75-miles-11658581201", "urlToImage": "https://images.wsj.net/im-586495/social", "publishedAt": "2022-07-23T14:00:04Z", "content": "Inside Saudi Arabia’s Plan to Build a Skyscraper That Stretches for 75 Miles\nListen to article\n(2 minutes)\nWhen Saudi Crown Prince Mohammed bin Salman directed authorities to develop land in the king… [+991 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "wsj", "title": "Scorcher Hits Farms, Stressing Crops and Herds...", "description": "Intense heat and dry conditions are threatening corn, soybeans and other crops, as well as cattle herds, just as some commodity prices have eased amid concerns about global food supplies.", "url": "https://www.wsj.com/articles/heat-wave-hits-u-s-farms-stressing-crops-and-ranchers-herds-11658568602", "urlToImage": "https://images.wsj.net/im-588627/social", "publishedAt": "2022-07-23T14:00:04Z", "content": "Heat Wave Hits U.S. Farms, Stressing Crops and Ranchers’ Herds \nListen to article\n(2 minutes)\nIntense heat and dry conditions are stressing U.S. agriculture, threatening corn, soybeans and other crop… [+883 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "wsj", "title": "Wartime Crackdown Widens as Kremlin Demands Full Loyalty...", "description": "The detentions of a physicist, an economist and a professional hockey player suggest that Russia’s security services are targeting those who fail to demonstrate loyalty to President Vladimir Putin.", "url": "https://www.wsj.com/articles/russias-wartime-crackdown-widens-as-kremlin-demands-full-loyalty-11658577601", "urlToImage": "https://images.wsj.net/im-583919/social", "publishedAt": "2022-07-23T14:00:04Z", "content": "Russia’s Wartime Crackdown Widens as Kremlin Demands Full Loyalty\nListen to article\n(2 minutes)\nIn late June, Russian security agents took physicist Dmitry Kolker from his hospital bed in the Siberia… [+798 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "The Editorial Board", "title": "Opinion | The President Who Stood Still on Jan. 6", "description": "No matter your views of the Jan. 6 special committee, the facts it is laying out in hearings are sobering. The most horrifying to date came Thursday in a hearing on President Trump's conduct as the riot raged and he sat watching TV, posting inflammatory tweet…", "url": "https://www.wsj.com/articles/the-president-who-stood-still-donald-trump-jan-6-committee-mike-pence-capitol-riot-11658528548", "urlToImage": "https://images.wsj.net/im-589529/social", "publishedAt": "2022-07-23T13:25:02Z", "content": "No matter your views of the Jan. 6 special committee, the facts it is laying out in hearings are sobering. The most horrifying to date came Thursday in a hearing on President Trumps conduct as the ri… [+355 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Christopher Mims", "title": "More Shoppers Buy Store Brands, Eating Into Big Food Companies’ Sales", "description": "Tightening consumer budgets amid rapid inflation are intensifying competition in grocery aisles.", "url": "https://www.wsj.com/articles/more-shoppers-buy-store-brands-eating-into-big-food-companies-sales-11658581202", "urlToImage": "https://images.wsj.net/im-589506/social", "publishedAt": "2022-07-23T13:19:20Z", "content": "Cost-conscious consumers are buying more store brands at the supermarket, raising pressure on big food companies that are dealing with their own rising costs.\r\nLower-cost oatmeal, pickles, granola ba… [+221 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Matthew Luxmoore, Bojan Pancevski and Jared Malsin", "title": "Russia Strikes Odessa Port After Signing Deal to Unblock Ukrainian Grain Exports", "description": "KYIV, Ukraine-Russia launched a missile attack on Ukraine's key grain-exporting port of Odessa hours after signing an international agreement to lift its blockade of the Black Sea coastline and allow for the transport of grain and other foodstuffs necessary t…", "url": "https://www.wsj.com/articles/russian-hits-military-airport-and-railway-station-in-fresh-ukraine-attack-11658571374", "urlToImage": "https://images.wsj.net/im-589669/social", "publishedAt": "2022-07-23T12:25:01Z", "content": "KYIV, UkraineRussia launched a missile attack on Ukraines key grain-exporting port of Odessa, officials said, hours after signing an international agreement to ease its blockade of the Black Sea coas… [+640 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Suzanne Kapner", "title": "Bed Bath & Beyond Followed a Winning Playbook—and Lost", "description": "The retailer’s emphasis on creating private-label items, rather than modernizing its technology, meant it was caught flat-footed when the pandemic struck. And it turned out shoppers actually preferred the stores’ old treasure-hunt feel. “Where is Mikasa?”", "url": "https://www.wsj.com/articles/bed-bath-beyond-ceo-private-label-brands-11658547084", "urlToImage": "https://images.wsj.net/im-589265/social", "publishedAt": "2022-07-23T04:49:13Z", "content": "Mark Tritton arrived at Bed Bath &amp; Beyond in 2019 with a plan to revive the home-goods retailer and ward off competition from Amazon.com Inc., Target Corp. and other large chains: sell what nobod… [+224 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Christopher Mims", "title": "How to Build AI That Actually Works for Your Business", "description": "The biggest, fanciest, most “intelligent”-seeming artificial intelligence gets all the attention, but tried-and-true algorithms, applied to narrowly defined problems, are far more useful today.", "url": "https://www.wsj.com/articles/how-to-build-ai-that-actually-works-for-your-business-11658548830", "urlToImage": "https://images.wsj.net/im-589120/social", "publishedAt": "2022-07-23T04:18:16Z", "content": "Artificial intelligence might one day be used to power genuinely humanlike cyborgs or other figments of humanitys fertile imagination. For now, Ingo Stork is using the technology to help restaurant c… [+304 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": "Christopher Mims", "title": "Google Parts With Engineer Who Claimed Its AI System Is Sentient", "description": "Tech company had suspended Blake Lemoine and dismisses his claims about its LaMDA artificial-intelligence chatbot technology.", "url": "https://www.wsj.com/articles/google-parts-with-engineer-who-claimed-its-ai-system-is-sentient-11658538296", "urlToImage": "https://images.wsj.net/im-576950/social", "publishedAt": "2022-07-23T01:06:48Z", "content": "Google fired an engineer who contended that \r\nan artificial-intelligence chatbot the company developed had become sentient, telling him that he had violated the companys data security policies after … [+339 chars]"}]}