{"status": "ok", "totalResults": 63, "articles": [{"source": {"id": null, "name": "The Lancet"}, "author": null, "title": "Global burden of bacterial antimicrobial resistance in 2019: a systematic analysis - The Lancet", "description": "To our knowledge, this study provides the first comprehensive assessment of the global\nburden of AMR, as well as an evaluation of the availability of data. AMR is a leading\ncause of death around the world, with the highest burdens in low-resource settings.\nUn…", "url": "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(21)02724-0/fulltext", "urlToImage": "//els-jbs-prod-cdn.jbs.elsevierhealth.com/cms/asset/43efc4bc-c3b5-48e7-b25a-ad807b8dedf5/gr1.jpg", "publishedAt": "2022-01-20T00:01:34Z", "content": null}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Pediatric hospital units bracing for MIS-C surge in 4-6 weeks - 10 Tampa Bay", "description": "Pediatric COVID hospitalizations are at record levels across the country, including here in Florida.Throughout the pandemic, health officials have warned abo...", "url": "https://www.youtube.com/watch?v=S5p7_jemRnM", "urlToImage": "https://i.ytimg.com/vi/S5p7_jemRnM/maxresdefault.jpg", "publishedAt": "2022-01-19T23:39:36Z", "content": null}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "When will the COVID-19 pandemic become an endemic? This expert says it could be soon - CTV News", "description": "Infectious disease specialist Dr. Monica Gandhi says the pandemic could begin pivoting to an endemic status by early spring in higher-income countries such a...", "url": "https://www.youtube.com/watch?v=85WDGwQgR2w", "urlToImage": "https://i.ytimg.com/vi/85WDGwQgR2w/hqdefault.jpg", "publishedAt": "2022-01-19T22:26:59Z", "content": null}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Science X staff", "title": "'Decoy' protein works against multiple SARS-CoV-2 variants - Medical Xpress", "description": "A drug treatment that acts as a decoy against SARS-CoV-2 was highly effective at preventing death and lung damage in humanized animal models of severe COVID-19 disease, according to a Nature Chemical Biology study from researchers at the University of Illinoi…", "url": "https://medicalxpress.com/news/2022-01-decoy-protein-multiple-sars-cov-variants.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2020/53-covid19.jpg", "publishedAt": "2022-01-19T20:15:41Z", "content": "A drug treatment that acts as a decoy against SARS-CoV-2 was highly effective at preventing death and lung damage in humanized animal models of severe COVID-19 disease, according to a Nature Chemical… [+5444 chars]"}, {"source": {"id": null, "name": "Newsconcerns.com"}, "author": "Frankie Davies", "title": "Fatty liver disease: Cirrhosis signs on the skin include bruising and jaundice - newsconcerns", "description": "Alcohol-related liver disease is as the name describes; damage caused to the liver due to excessive alcohol consumption. In the early stages it can be treated and overcome. However, when it reaches cirrhosis, it could mean the damage has become irrev", "url": "https://newsconcerns.com/fatty-liver-disease-cirrhosis-signs-on-the-skin-include-bruising-and-jaundice/", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1552767.jpg", "publishedAt": "2022-01-19T19:53:31Z", "content": "Alcohol-related liver disease is as the name describes; damage caused to the liver due to excessive alcohol consumption. In the early stages it can be treated and overcome. However, when it reaches c… [+1769 chars]"}, {"source": {"id": null, "name": "Greater Kashmir"}, "author": "AP", "title": "Omicron wave may cut future severity of COVID-19 disease: Study - Greater Kashmir", "description": null, "url": "https://www.greaterkashmir.com/world/omicron-wave-may-cut-future-severity-of-covid-19-disease-study", "urlToImage": "https://gumlet.assettype.com/greaterkashmir%2F2021-11%2Fc44ee919-238a-4474-a7e5-77b2629686d7%2Fomicorna.jpg?w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-01-19T18:35:28Z", "content": "This indicates that Omicron can re-infect Delta-infected individuals but not vice-versa, giving Omicron an advantage over Delta, they said.\r\n\"The implications of such displacement would depend on whe… [+234 chars]"}, {"source": {"id": null, "name": "OI Canadian"}, "author": "HELEN HERNANDEZ", "title": "the answers to the key doubts of the variant that drives the third wave of Covid - OI Canadian", "description": "Since its identification, at the end of November, the Omicron variant caused an exponential growth in coronavirus cases around the world. Since last week, the third wave shows this reality also in Arg", "url": "https://oicanadian.com/the-answers-to-the-key-doubts-of-the-variant-that-drives-the-third-wave-of-covid/", "urlToImage": "https://www.clarin.com/img/2021/12/23/testeos-de-covid-omicron-impulsa___L949x9rk7_1200x630__1.jpg", "publishedAt": "2022-01-19T17:28:44Z", "content": "Since its identification, at the end of November, the Omicron variant caused an exponential growth in coronavirus cases around the world. Since last week, the third wave shows this reality also in Ar… [+7314 chars]"}, {"source": {"id": null, "name": "LIVESTRONG.COM"}, "author": "Jenn Sinrich", "title": "What Is Flurona, and How Can You Avoid It? - Livestrong", "description": "Flurona is a co-infection of COVID-19 and the flu. Here, doctors explain whether you should be concerned about flurona and how best to protect yourself.", "url": "https://www.livestrong.com/article/13770178-what-is-flurona/", "urlToImage": "https://img.livestrong.com/640/media-storage/contentlab-data/1/18/f7e92d47264747fc8c8964b0f50dfd52.jpg", "publishedAt": "2022-01-19T17:16:33Z", "content": "As if you weren't already worried about possibly contracting COVID-19, there's now a lot of buzz out there about \"flurona,\" which sounds even worse. Don't panic: It's not a new variant or disease. It… [+6898 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Antibodies in blood soon after COVID-19 onset may predict severity, study finds - Science Daily", "description": "A look at antibodies in patients soon after they were infected with the virus that causes COVID-19 showed key differences between those whose cases remained mild and those who later developed severe symptoms.", "url": "https://www.sciencedaily.com/releases/2022/01/220118111359.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-19T16:08:49Z", "content": "Blood drawn from patients shortly after they were infected with SARS-CoV-2, the virus that causes COVID-19, may indicate who is most likely to land in the hospital, a study led by Stanford Medicine i… [+8436 chars]"}, {"source": {"id": null, "name": "World Health Organization"}, "author": null, "title": "Health emergencies - The Omicron variant: sorting fact from myth - WHO/Europe", "description": "Since the B.1.1.529 variant was declared a Variant of Concern and assigned the name Omicron on 26 November 2021, our understanding of this variant has increased considerably, thanks to collaborative global research and the passing of time, allowing us to obse…", "url": "https://www.euro.who.int/en/health-topics/health-emergencies/pages/news/news/2022/01/the-omicron-variant-sorting-fact-from-myth", "urlToImage": "https://www.euro.who.int/__data/assets/image/0005/243581/who-europe-250.png", "publishedAt": "2022-01-19T15:57:06Z", "content": "Since the B.1.1.529 variant was declared a Variant of Concern and assigned the name Omicron on 26 November 2021, our understanding of this variant has increased considerably, thanks to collaborative … [+8363 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": null, "title": "Omicron: Know about most prevalent symptoms, tests and isolation methods to fight COVID-19 - Firstpost", "description": "As per an analysis by a US Centers for Disease Control and Prevention, cough, fatigue, congestion and runny nose are the four most common symptoms of the Omicron variant", "url": "https://www.firstpost.com/world/omicron-know-about-most-prevalent-symptoms-tests-and-isolation-methods-to-fight-covid-19-10301371.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2021/12/11omicron.jpg", "publishedAt": "2022-01-19T15:44:23Z", "content": "As per an analysis by a US Centers for Disease Control and Prevention, cough, fatigue, congestion and runny nose are the four most common symptoms of the Omicron variant\r\n The world has recently been… [+2513 chars]"}, {"source": {"id": null, "name": "Indiaherald.com"}, "author": "S.Venkateshwari", "title": "How long does Covid-19 Vaccine immunity last? - ఏపిహెరాల్ద్.కామ్ - unit of India Herald Group Publishers [P] LIMITED", "description": "health : How long does Covid-19 Vaccine immunity last? \n\nAfter taking the corona vaccine, its effect lasts for only 6 months in about 30 percent. Afte", "url": "https://www.indiaherald.com/Health/Read/994468554/How-long-does-Covid-Vaccine-immunity-last", "urlToImage": "https://www.indiaherald.com/imagestore/images/health/movies_news/how-long-does-covid-vaccine-immunity-last31c6aa93-a417-4f24-a0c4-f03d3537137c-415x250-IndiaHerald.jpg", "publishedAt": "2022-01-19T15:24:05Z", "content": "How long does Covid-19 Vaccine immunity last? \r\nAfter taking the corona vaccine, its effect lasts for only 6 months in about 30 percent. After this, the immunity created by it becomes weak or ends in… [+949 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "New tool assesses evolutionary risks of antibiotics: Researchers developed a mathematical model that can help doctors choose antibiotics that minimize drug resistance - Science Daily", "description": "Countering a rising antibiotic resistance crisis, doctors now prescribe combinations of antibiotics. Yet many risks are involved with such multi-drug combinations. Scientists have developed a way to help doctors evaluate outcomes for different drug pairs and …", "url": "https://www.sciencedaily.com/releases/2022/01/220119090901.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-19T14:30:15Z", "content": "Bacteria have dangerously evolved to thwart many of the medicines that were designed to kill them. As a result, a growing antibiotic resistance crisis is responsible for more than 700,000 deaths each… [+4730 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Control Diabetes During Cancer Treatment With Simple Steps - News18", "description": "Apart from steroids, stress also plays an important factor in inducing diabetes.", "url": "https://www.news18.com/news/lifestyle/control-diabetes-during-cancer-treatment-with-simple-steps-4671956.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/12/cancer-2-163991897916x9.jpg", "publishedAt": "2022-01-19T14:10:25Z", "content": "If you are diabetic and suffering from cancer at the same time, then your body can go through some serious changes. As you carry on with your cancer treatment, your sugar levels can shoot up. Chemoth… [+1788 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Bob Yirka", "title": "Using a bacteriophage to successfully treat a patient infected with a drug-resistant bacteria - Medical Xpress", "description": "A team of doctors and researchers working at Erasmus Hospital in Belgium has successfully treated an adult woman infected with a drug-resistant bacteria using a combination of bacteriophage therapy and antibiotics. In their paper published in the journal Natu…", "url": "https://medicalxpress.com/news/2022-01-bacteriophage-successfully-patient-infected-drug-resistant.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/using-a-bacteriophage.jpg", "publishedAt": "2022-01-19T13:40:02Z", "content": "A team of doctors and researchers working at Erasmus Hospital in Belgium has successfully treated an adult woman infected with a drug-resistant bacteria using a combination of bacteriophage therapy a… [+3094 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Scientific review highlights the impact of coffee on digestive organs - News-Medical.Net", "description": "A new scientific review, published in Nutrients, highlights coffee's effects on digestion and the gut, and its impact on organs involved in digestion.", "url": "https://www.news-medical.net/news/20220119/Scientific-review-highlights-the-impact-of-coffee-on-digestive-organs.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Digestion-620x480.jpg", "publishedAt": "2022-01-19T13:37:00Z", "content": "A new scientific review, published in Nutrients, highlights coffee's effects on digestion and the gut, and its impact on organs involved in digestion. The review, supported by The Institute for Scien… [+3417 chars]"}, {"source": {"id": null, "name": "Contagionlive.com"}, "author": "Jonna Lorenz", "title": "World Health Leaders Discuss Long-Term Strategy for COVID-19 Vaccines and Boosters - Contagionlive.com", "description": "As global health leaders discuss the best long-term strategy for COVID-19 vaccines and boosters, consensus is emerging that repeated boosters of current vaccines within short intervals is not sustainable.", "url": "https://www.contagionlive.com/view/world-health-leaders-discuss-long-term-strategy-for-covid-19-vaccines-and-boosters", "urlToImage": "https://cdn.sanity.io/images/0vv8moc6/contagion/b62ded050f64b10cf51e0c182332ea9bd21d7815-5472x3648.jpg?fit=crop&auto=format", "publishedAt": "2022-01-19T13:32:49Z", "content": "Health officials around the world are grappling with developing a long-term strategy for COVID-19 vaccines and boosters as the COVID-19 pandemic evolves.\r\nIt wouldnt surprise any of us, in fact we ra… [+9946 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Science News | Researchers Pinpoint How Zika Virus Evades Cell's Antiviral Response - LatestLY", "description": "Get latest articles and stories on Science at LatestLY. In a new study of the Zika virus, Northwestern University scientists have discovered a key mechanism used by the virus to evade the antiviral response of the cell it is attacking. This finding contribute…", "url": "https://www.latestly.com/agency-news/science-news-researchers-pinpoint-how-zika-virus-evades-cells-antiviral-response-3271236.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/01/SARS2022011912251120220119131940-588x441.jpg", "publishedAt": "2022-01-19T13:30:26Z", "content": "Evanston (Illinois) [US], January 19 (ANI): In a new study of the Zika virus, Northwestern University scientists have discovered a key mechanism used by the virus to evade the antiviral response of t… [+3777 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Christopher Sharp", "title": "Covid vaccine: When should you take paracetamol – before or after the jab? - Express", "description": "THE UK'S vaccine programme has been one of the successes of the pandemic. At various points the UK has had the highest vaccination rate in Europe. As more and more got their vaccine, people began to wonder whether they should take a painkiller and, if so, whe…", "url": "https://www.express.co.uk/life-style/health/1552547/covid-vaccine-paracetamol-ibuprofen", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1552547.jpg", "publishedAt": "2022-01-19T13:28:28Z", "content": "As with the swine flu pandemic, vaccines have played a major role in reducing transmission, serious illness, hospitalisations, and deaths.\r\nSimilar to other vaccines, there has been debate about thei… [+854 chars]"}, {"source": {"id": null, "name": "Women's Health"}, "author": null, "title": "'How Binge-Watching Love Island Led To My Diagnosis Of Lipedema' - Women's Health", "description": "\"I have an extremely underdiagnosed condition that causes excess fat deposits.\"", "url": "https://www.womenshealthmag.com/health/a38553019/love-island-lipedema/", "urlToImage": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/img-3236-1640199946.jpg?crop=1.00xw:0.377xh;0,0.197xh&resize=1200:*", "publishedAt": "2022-01-19T13:00:55Z", "content": "When I was about 9 years old and in the fourth grade, one of my friends asked me why I had \"cankles.\" I didn't even know what that meant at the time. While I didn’t think too much about it, I kind of… [+8393 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "COVID-19: Mental Health Tips for People in Home Isolation - News18", "description": "The regime that people adopted during the first two waves of the pandemic came back into people’s lives as the Omicron-driven third wave kicked in", "url": "https://www.news18.com/news/lifestyle/covid-19-mental-health-tips-for-people-in-home-isolation-4671656.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/12/2021-12-02t111510z_1_lynxmpehb10h5_rtroptp_4_health-coronavirus-variant-cryptocurrency-163868522216x9.jpg", "publishedAt": "2022-01-19T12:56:11Z", "content": "After grappling with COVID-19 for almost two years, a new variant of the malevolent virus greeted the world as it entered into a new year. The regime that people adopted during the first two waves of… [+2131 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "News18", "title": "30 Pc Individuals Lose Vaccine-acquired Immunity Against Covid-19 After 6 Months: Study - News18", "description": "The study was conducted on 1,636 healthcare workers who were fully vaccinated against COVID19, a press release from AIG Hospitals said.", "url": "https://www.news18.com/news/india/30-pc-individuals-lose-vaccine-acquired-immunity-against-covid-19-after-6-months-study-4675715.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/12/covid-vaccine-4-164059052316x9.jpg", "publishedAt": "2022-01-19T12:30:03Z", "content": "As much as 30 per cent individuals lose vaccine-acquired immunity after six months, according to a study conducted by AIG Hospitals along with the Asian Healthcare Foundation on Vaccine Immunity. The… [+1714 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Are unvaccinated pregnant women at risk of birth-related complications? Study answers - Mint", "description": "The team analysed data relating to all pregnant women in Scotland. It included more than 87,000 women who were pregnant between the start of vaccination uptake in December 2020 and October 2021", "url": "https://www.livemint.com/news/india/are-unvaccinated-pregnant-women-at-risk-of-birth-related-complications-study-answers-11642591865886.html", "urlToImage": "https://images.livemint.com/img/2022/01/19/600x338/unvaccinated_pregnant_women_1642594152588_1642594152799.jpg", "publishedAt": "2022-01-19T12:10:56Z", "content": "Pregnant women unvaccinated against Covid-19 are at a much higher risk of developing birth-related complications, a new study published in the 'Nature Medicine Journal' has revealed. \r\nThe findings s… [+3572 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "COVID: Reinfection risk from Omicron 16 times higher than Delta, ONS data indicates - Sky News", "description": "", "url": "https://news.sky.com/story/reinfection-risk-from-omicron-16-times-higher-than-delta-ons-data-indicates-12519881", "urlToImage": "https://e3.365dm.com/21/10/1600x900/skynews-croydon-town-centre_5535080.jpg?20211004171911", "publishedAt": "2022-01-19T12:06:48Z", "content": "The risk of reinfection from the Omicron COVID variant is 16 times higher than Delta, new figures indicate.\r\nLatest COVID-19 data from the Office for National Statistics shows the rate for all reinfe… [+2890 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Pam Harrison", "title": "Pediatric CAP: Short 5-Day Antibiotic Course Beats 10-Day - Medscape", "description": "Treatment of uncomplicated pediatric community-acquired pneumonia with a short, 5-day course of antibiotics results in a superior clinical response compared to the standard 10-day course.", "url": "https://www.medscape.com/viewarticle/966806", "urlToImage": "https://img.medscape.com/thumbnail_library/Medscape_News.jpg", "publishedAt": "2022-01-19T11:54:13Z", "content": "The evidence is in: Less is more when it comes to treating uncomplicated community-acquired pneumonia (CAP) in young children. Five days of antibiotic therapy resulted in a superior clinical response… [+6754 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Nivedita Mishra", "title": "Diabetes self test kit makes monitoring blood sugar level easy and convenient - Hindustan Times", "description": "Diabetes is a lifestyle disease which needs constant monitoring. In relation to Covid-19, it is also a comorbidity and hence needs a close watch. It is, therefore, wise to keep a diabetes self test kit handy at all times. See here.", "url": "https://www.hindustantimes.com/shop-now/health-and-beauty/diabetes-self-test-kit-makes-monitoring-blood-sugar-level-easy-and-convenient-101642581495142.html", "urlToImage": "https://images.hindustantimes.com/img/2022/01/19/1600x900/Glucose_Sugar_Self_Test_Kit_Diabetes_1642589608151_1642589619552.jpg", "publishedAt": "2022-01-19T11:19:09Z", "content": "In the last couple of years we have seen lifestyle diseases like diabetes become a huge health hazard in a country like India. As per a report in International Diabetes Federation (IDF) in 2021 ahead… [+2925 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Coronavirus: How does COVID's Omicron variant impact the kids? Symptoms to watch out for and ways to treat them - Times of India", "description": "As Omicron cases surge in the country and around the world, parents are highly concerned about the safety of their kids. Although in the past, children have shown a more robust immune response to the SARs-COV-2 virus, recent reports and findings suggest that …", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-omicron-symptoms-in-kids-how-does-covids-omicron-variant-impact-the-kids-symptoms-to-watch-out-for-and-ways-to-treat-them/photostory/88994392.cms", "urlToImage": "https://static.toiimg.com/photo/88994410.cms", "publishedAt": "2022-01-19T10:30:00Z", "content": "While many kids infected with the Omicron are reporting symptoms like cold and cough, along with other cold-like symptoms, Dr. Sheth recommends keeping children hydrated at all times. \"There is a pos… [+780 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Camilo Rocha and Rodrigo Pedroso, CNN", "title": "Brazil's parents want their kids vaccinated against Covid. Bolsonaro has tried to stop it - CNN", "description": "Last June, as Covid-19 cases were surging across Brazil, Camila Basto waited at a São Paulo hospital to find out what was wrong with her 9-year-old daughter, Manuela.", "url": "https://www.cnn.com/2022/01/19/americas/brazil-child-vaccines-bolsonaro-intl-cmd-latam/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220117124500-bolsonaro-0113-super-tease.jpg", "publishedAt": "2022-01-19T10:07:00Z", "content": null}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "‘Nocebo’ effect, not Covid vaccine causing adverse reactions, claims study - WION", "description": "Many mild or adverse side effects that people experience after taking the Covid vaccine are caused by “nocebo effect” – a negative version of the placebo effect – a new study has claimed.", "url": "https://www.wionews.com/world/nocebo-effect-not-covid-vaccine-causing-adverse-reactions-claims-study-445915", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2021/12/22/228331-arnt1.jpg", "publishedAt": "2022-01-19T09:33:36Z", "content": "Many mild or adverse side effects that people experience after taking the Covid vaccine are caused by nocebo effect a negative version of the placebo effect a new study has claimed.\r\nA placebo effect… [+2052 chars]"}, {"source": {"id": null, "name": "World Economic Forum"}, "author": "David Fredrickson", "title": "Is cancer the next pandemic? How to avoid a new health crisis - World Economic Forum", "description": "The global cancer community needs to come together, reprioritize screenings and minimize setbacks to healthcare systems and society.", "url": "https://www.weforum.org/agenda/2022/01/cancer-health-crisis-oncology-astrazeneca/", "urlToImage": "https://assets.weforum.org/article/image/responsive_medium_evPs7CVw7cPT80dA5pUD_wUZcE_FflrvgRkdM6l35M8.jpg", "publishedAt": "2022-01-19T08:07:22Z", "content": "<ul><li>Despite many recent advances in cutting cancer death rates, the global instability from COVID-19 has resulted in disruption to vital cancer screenings and treatment.</li><li>The global cancer… [+7378 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Changes in sleep and biological rhythms from late pregnancy to postpartum linked to depression and anxiety - ANI News", "description": "Hamilton (Ontario) [Canada], January 19 (ANI): A set of parameters including sleep and biological rhythm variables have been closely associated with the severity of depressive and anxiety symptoms, starting in the third trimester of pregnancy to the third pos…", "url": "https://www.aninews.in/news/lifestyle/fitness/changes-in-sleep-and-biological-rhythms-from-late-pregnancy-to-postpartum-linked-to-depression-and-anxiety20220119133741", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/postpartum2022011906505020220119080727-thumbnail-154x87-70.jpg", "publishedAt": "2022-01-19T08:07:00Z", "content": "Hamilton (Ontario) [Canada], January 19 (ANI): A set of parameters including sleep and biological rhythm variables have been closely associated with the severity of depressive and anxiety symptoms, s… [+2528 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Can Omicron cause heart damage? Here's what experts say - Hindustan Times", "description": "In case of previous variants, a large number of Covid patients ended up with heart damage. Can Omicron affect heart? Experts answer. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/can-omicron-cause-heart-damage-here-s-what-experts-say-101642578960349.html", "urlToImage": "https://images.hindustantimes.com/img/2022/01/19/1600x900/heart_health_thumb_1642401107215_1642579198559.jpg", "publishedAt": "2022-01-19T08:04:11Z", "content": "Omicron, first identified in South Africa last year in November is yet to be fully decoded by experts across the world. Relatively mild and much more infectious than previous Covid-19 variants, Omicr… [+2693 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Israel sticks with fourth vaccine shot - The Straits Times", "description": "Israel will continue to offer a fourth Covid-19 vaccine shot despite preliminary findings that it is not enough to prevent Omicron infections, a senior healt...", "url": "https://www.youtube.com/watch?v=cX_e6OHrBKc", "urlToImage": "https://i.ytimg.com/vi/cX_e6OHrBKc/maxresdefault.jpg", "publishedAt": "2022-01-19T07:29:46Z", "content": null}, {"source": {"id": null, "name": "MENAFN.COM"}, "author": "MENAFN", "title": "Qatar - 'You can get Covid booster, flu shots in same appoin... - MENAFN.COM", "description": "<p> A person attending an appointment for the Covid-19 vaccine booster shot at a health centre can also request to have the flu vaccine in the same a", "url": "https://menafn.com/1103560337/Qatar-You-can-get-Covid-booster-flu-shots-in-same-appointment-official", "urlToImage": "https://menafn.com/updates/pr/2022-01/19/GT_b07ceimage_story.jpg", "publishedAt": "2022-01-19T06:13:40Z", "content": "(MENAFN- Gulf Times) \r\n A person attending an appointment for the Covid-19 vaccine booster shot at a health centre can also request to have the flu vaccine in the same appointment, a Primary Health C… [+1866 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Addrew Shawn", "title": "In study, pandemic affected people’s perceptions of what is gross — ScienceDaily - Verve Times", "description": "Theory has it that disgust sensitivity -- how intensely a person is repulsed by images, ideas or situations that could be considered terribly gross or merely unpleasant -- is an evolutionary trait that initially helped humans avoid eating rotten food", "url": "https://vervetimes.com/in-study-pandemic-affected-peoples-perceptions-of-what-is-gross-sciencedaily/", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-19T04:18:37Z", "content": "Theory has it that disgust sensitivity — how intensely a person is repulsed by images, ideas or situations that could be considered terribly gross or merely unpleasant — is an evolutionary trait that… [+5454 chars]"}, {"source": {"id": null, "name": "Galveston County Daily News"}, "author": "DR. SALLY ROBINSON", "title": "Long-haul COVID is real | Health | The Daily News - Galveston County Daily News", "description": "I cannot think of a single person who’s not sick and tired of hearing about COVID-19 — and I mean really sick and tired. However, a recent review by Dr.", "url": "https://www.galvnews.com/health/free/article_51f8d6b3-bea4-5dbc-b5ea-997d976a98c0.html", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/galvnews.com/content/tncms/assets/v3/editorial/2/08/2087dbd1-e782-54fb-9be0-af356c6f1487/5a8c8977151a7.image.jpg?crop=342%2C342%2C0%2C62&resize=200%2C200&order=crop%2Cresize", "publishedAt": "2022-01-19T04:00:00Z", "content": "I cannot think of a single person who’s not sick and tired of hearing about COVID-19 — and I mean really sick and tired. However, a recent review by Dr. Peter Rowe in healthychildren.org is an intere… [+2950 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "Want to lose weight faster? These effective and sustainable diets can help - Times Now", "description": "Read on to know about some diets that can help facilitate the process of weight loss in a healthy, effective, and sustainable way.", "url": "https://www.timesnownews.com/health/article/want-to-lose-weight-faster-these-effective-and-sustainable-diets-can-help/850795", "urlToImage": "https://imgk.timesnownews.com/story/iStock-929029958.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2022-01-19T03:58:39Z", "content": "<ul><li>The process of losing weight can be a hassle if not carried out the appropriate way</li></ul>\r\n<ul><li>An ideal weight loss diet must be sustainable and must possess health benefits that can … [+3047 chars]"}, {"source": {"id": null, "name": "Tittlepress.com"}, "author": "newsdesk", "title": "Timely Cervical Cancer Screening Took a Dive in Recent Years - TittlePress", "description": "More and more U.S. women were behind on guideline-recommended cervical cancer screening in recent years, with lack of", "url": "https://tittlepress.com/health/1461058/", "urlToImage": "https://assets.medpagetoday.net/media/images/96xxx/96733.jpg", "publishedAt": "2022-01-19T03:24:00Z", "content": "More and more U.S. women were behind on guideline-recommended cervical cancer screening in recent years, with lack of knowledge about needing screening cited as the primary reason for not being up to… [+7633 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Scientists find potential diagnostic and therapeutic target for lung cancer - Hindustan Times", "description": "Chinese scientists recently reported the key role of histone acetylation-regulated long noncoding RNA termed as lysosome cell death regulator (LCDR) in tumour survival, providing a potential diagnostic and therapeutic target for lung cancer. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/scientists-find-potential-diagnostic-and-therapeutic-target-for-lung-cancer-101642557179793.html", "urlToImage": "https://images.hindustantimes.com/img/2022/01/19/1600x900/_8834a5f0-f820-11e7-95e6-04e0a17510b6_1642557235300.jpg", "publishedAt": "2022-01-19T01:56:50Z", "content": "Chinese scientists recently reported the key role of histone acetylation-regulated long noncoding RNA termed as lysosome cell death regulator (LCDR) in tumour survival, providing a potential diagnost… [+2146 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Test For Tuberculosis If Cough Persists: New Covid Treatment Guidelines - NDTV", "description": "Doctors should avoid giving steroids to COVID-19 patients and advise tuberculosis tests if their cough persists, the government has said in its revised clinical guidelines for coronavirus treatment, days after its task force chief expressed regret fo", "url": "https://www.ndtv.com/india-news/avoid-steroids-test-if-cough-persists-new-covid-treatment-guidelines-2713985", "urlToImage": "https://c.ndtvimg.com/2020-05/je4nh5tg_reuters-inside-max-delhi-covid-ward-650_625x300_29_May_20.jpg", "publishedAt": "2022-01-19T01:39:00Z", "content": "Drugs like steroids can increase the risk of a secondary infection, the guidelines said.\r\nNew Delhi: Doctors should avoid giving steroids to COVID-19 patients and advise tuberculosis tests if their c… [+3058 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Rare genetic variants may raise risk of fatal arrhythmias in patients with less advanced coronary artery disease - News-Medical.Net", "description": "Advanced coronary artery disease and the cardiac hypertrophy often associated with it is the most common cause of sudden cardiac death.", "url": "https://www.news-medical.net/news/20220118/Rare-genetic-variants-may-raise-risk-of-fatal-arrhythmias-in-patients-with-less-advanced-coronary-artery-disease.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Coronary_Artery_Disease-620x480.jpg", "publishedAt": "2022-01-19T00:52:00Z", "content": "Advanced coronary artery disease and the cardiac hypertrophy often associated with it is the most common cause of sudden cardiac death. However, in some cases, less advanced coronary artery disease a… [+2190 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Cervical Cancer - Naperville Community Television NCTV17", "description": "Cervical cancer is an abnormal growth of cells in the lower part of the uterus.  If found early, it's one of the most treatable cancers.————————————If you en...", "url": "https://www.youtube.com/watch?v=49-4cg0Wb28", "urlToImage": "https://i.ytimg.com/vi/49-4cg0Wb28/maxresdefault.jpg", "publishedAt": "2022-01-18T19:31:05Z", "content": null}, {"source": {"id": null, "name": "Well+Good"}, "author": "Kara Jillian Brown", "title": "Vitamin C Shouldn’t Be in Every Skin-Care Routine—Here’s How To Know if You Should Skip It - Well+Good", "description": "While vitamin C is a great ingredient, it's not suitable for everyone's skin. Learn about niacinamide as a vitamin C alternative.", "url": "https://www.wellandgood.com/vitamin-c-alternative/", "urlToImage": "https://www.wellandgood.com/wp-content/uploads/2022/01/vitc.jpg", "publishedAt": "2022-01-18T18:03:11Z", "content": null}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Long Covid-19 symptoms that no one is talking about; signs to watch out for. Read here - Mint", "description": "We have no data yet on what proportion of infections with Omicron... end up with Long COVID, an expert said", "url": "https://www.livemint.com/science/health/long-covid-19-symptoms-that-no-one-is-talking-about-signs-to-watch-out-for-read-here-11642501670010.html", "urlToImage": "https://images.livemint.com/img/2022/01/18/600x338/FINLAND-CLIMATE-COFFEE-4_1642504971108_1642504990817.jpg", "publishedAt": "2022-01-18T16:12:16Z", "content": "Complications related to COVID-19 infections can continue for months after you have recovered from the disease. This holds true even for patients who have suffered mild to moderate infections.\r\nAnd e… [+2460 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ian Randall", "title": "Health: Experts eliminate HIV in 40 per cent of mice with technique that forces virus out of hiding - Daily Mail", "description": "In laboratory tests on 10 mice the approach was found to eliminate the virus in 40 per cent of cases, the team from the University of California Los Angeles said.", "url": "https://www.dailymail.co.uk/sciencetech/article-10414345/Health-Experts-eliminate-HIV-40-cent-mice-technique-forces-virus-hiding.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/01/18/13/53070281-0-image-a-4_1642513120452.jpg", "publishedAt": "2022-01-18T15:21:33Z", "content": "A 'kick and kill' strategy that forces the human immunodeficiency virus out of cells leaving it vulnerable to injections of natural killer cells offers hope of an HIV cure.\r\nIn laboratory tests on 10… [+6143 chars]"}, {"source": {"id": null, "name": "Health Europa"}, "author": null, "title": "Introducing healthy lifestyle habits in preschool lowers heart disease risk - Health Europa", "description": "Implementing school-based programs aimed at teaching healthy lifestyle habits as early as preschool can achieve lasting lifestyle changes.", "url": "https://www.healtheuropa.eu/introducing-healthy-lifestyle-habits-in-preschool-lowers-heart-disease-risk/112898/", "urlToImage": "https://www.healtheuropa.eu/wp-content/uploads/2022/01/iStockFatCamera-671375670.jpg", "publishedAt": "2022-01-18T13:59:51Z", "content": "Healthy lifestyle habits can include staying active through exercise, eating five portions of fruit and vegetables, and reducing salt intake. A new study found that introducing healthy lifestyle habi… [+5732 chars]"}, {"source": {"id": null, "name": "DNA India"}, "author": null, "title": "Nanotherapy offers ray of hope for the treatment of Type 1 diabetes - DNA India", "description": "Nanotherapy offers ray of hope for the treatment of Type 1 diabetes - A team of researchers at Northwestern University have discovered a technique to help make immunomodulation more effective. The method used nanocarriers to re-engineer the commonly used immu…", "url": "https://www.dnaindia.com/india/video-nanotherapy-offers-ray-of-hope-for-the-treatment-of-type-1-diabetes-2929063", "urlToImage": "https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/01/18/1015362-00000004.jpg", "publishedAt": "2022-01-18T13:40:40Z", "content": null}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "Individuals Who Vape Experience Greater Symptom Burden Post COVID-19 Infection: Study | The Weather Channel - Articles from The Weather Channel | weather.com - The Weather Channel", "description": "People who vaped and smoked tobacco, and tested positive for COVID-19, complained of laboured breathing and had more frequent emergency department visits than those who did not vape. - Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/coronavirus/news/2022-01-18-vaping-makes-covid19-symptoms-increasingly-severe", "urlToImage": "https://s.w-x.co/in-E-cigarettes.jpg", "publishedAt": "2022-01-18T12:42:06Z", "content": "According to new research from Mayo Clinic, people who use electronic cigarettes and test positive for COVID-19 have a higher frequency of experiencing COVID-19 symptoms than people who don't vape.\r\n… [+2378 chars]"}, {"source": {"id": null, "name": "The Weather Channel"}, "author": null, "title": "Omicron Re-infection Highly Possible Due to Its Mutations and Deviation from Original Coronavirus Strain: Experts | The Weather Channel - Articles from The Weather Channel | weather.com - The Weather Channel", "description": "The protection against re-infection by Omicron afforded by past infection may be as low as 19%, say researchers. - Articles from The Weather Channel | weather.com", "url": "https://weather.com/en-IN/india/coronavirus/news/2022-01-18-risk-of-re-infection-with-omicron-variant-5-times-greater-than", "urlToImage": "https://s.w-x.co/in-omicron.jpg", "publishedAt": "2022-01-18T11:38:06Z", "content": "While Omicron is known to cause COVID-19 re-infection, there is no strong evidence yet in favour of a person being affected with the vaccine-dodging strain again, Indian health experts have opined. H… [+3509 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Sleeping with the TV on is bad for your brain - WCNC", "description": "As it turns out, sleeping with the TV on is bad for your sleeping habits. Researchers scanned the brains of people who went to sleep with the TV on and monit...", "url": "https://www.youtube.com/watch?v=5OIx6nv0ZMM", "urlToImage": "https://i.ytimg.com/vi/5OIx6nv0ZMM/maxresdefault.jpg", "publishedAt": "2022-01-18T11:35:26Z", "content": null}, {"source": {"id": null, "name": "Firstpost"}, "author": null, "title": "Crippled by COVID, now Europe faces ‘twindemic’: What this is, why it is worrying health officials - Firstpost", "description": "Influenza has again surfaced across the continent after practically vanishing last year, sparking fears of a long-term ‘twindemic’ with the coronavirus disease", "url": "https://www.firstpost.com/health/crippled-by-covid-now-europe-faces-twindemic-what-this-is-why-it-is-worrying-health-officials-10296581.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2022/01/18flu.jpg", "publishedAt": "2022-01-18T11:33:48Z", "content": "Influenza has again surfaced across the continent after practically vanishing last year, sparking fears of a long-term twindemic with the coronavirus disease\r\n Already crippled by COVID-19, Europe is… [+3309 chars]"}, {"source": {"id": null, "name": "Ahmedabadmirror.com"}, "author": null, "title": "Studies debate over effectiveness of hydroxychloroquine - Ahmedabad Mirror", "description": "Once touted as a cure for Covid, hydroxychloroquine (HCQ), the anti-malaria drug, is renewing interest as a potential treatment for the infectious disease and particularly the new fast spreading Omicron variant.\n\nTwo recent studies, not peer reviewed yet, hav…", "url": "https://ahmedabadmirror.com/studies-debate-over-effectiveness-of-hydroxychloroquine/81818262.html", "urlToImage": "https://ngs-space1.sgp1.digitaloceanspaces.com/am/uploads/mediaGallery/image/1642504078007.jpg-org", "publishedAt": "2022-01-18T11:12:58Z", "content": "Once touted as a cure for Covid, hydroxychloroquine (HCQ), the anti-malaria drug, is renewing interest as a potential treatment for the infectious disease and particularly the new fast spreading Omic… [+1825 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Bhagyashree Recommends Pomegranates For Skin Health And More - NDTV Food", "description": "Pomegranates can also help to deal with post-menopausal problems like night sweats and hot flashes.", "url": "https://food.ndtv.com/food-drinks/bhagyashree-explains-why-pomegranates-are-an-important-part-of-the-daily-diet-2714667", "urlToImage": "https://c.ndtvimg.com/2021-12/od8dnl28_bhagyashree_650x400_18_December_21.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-01-18T09:53:13Z", "content": "We can't stress enough about the importance of fruits in the daily diet. From providing essential micronutrients to cleansing the body with their fibre content, fruits are one of the best food items … [+2570 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Do you have diabetes? This is the best time to have fruits - Hindustan Times", "description": "Is there a right time to eat fruits for people with diabetes? A nutritionist opens up. | Health", "url": "https://www.hindustantimes.com/lifestyle/do-you-have-diabetes-this-is-the-best-time-to-have-fruits-101642497272436.html", "urlToImage": "https://images.hindustantimes.com/img/2022/01/18/1600x900/fruit_1638805011586_1642497314189.jpg", "publishedAt": "2022-01-18T09:20:26Z", "content": "People with diabetes often struggle to make the right food choices. Picking foods that do not play havoc with their blood glucose levels is essential for diabetes management. Foods with low GI (glyca… [+1867 chars]"}, {"source": {"id": null, "name": "Genetic Engineering & Biotechnology News"}, "author": "John Sterling", "title": "How Brain Cell Development Influences Risk of Schizophrenia - Genetic Engineering & Biotechnology News", "description": "Genetic risk factors are known to disrupt brain development in a number of psychiatric disorders, but little is known about which aspects of this process are affected. New research represents the first time that genetic disruption of specific cell processes c…", "url": "https://www.genengnews.com/neurological-disorders/how-brain-cell-development-influences-risk-of-schizophrenia/", "urlToImage": "https://www.genengnews.com/wp-content/uploads/2022/01/GettyImages-1208249944-scaled-e1642193706994.jpg", "publishedAt": "2022-01-18T08:00:23Z", "content": "Researchers from Cardiff University report the discovery of new links between the breakdown in brain cell development and the risk of schizophrenia and other psychiatric disorders.\r\nGenetic risk fact… [+5133 chars]"}, {"source": {"id": null, "name": "EdexLive"}, "author": "Edex Live", "title": "BHU scientists find cure for chronic wounds. Here's how they managed it - EdexLive", "description": "The team led by Prof Gopal Nath of the department of Microbiology said that wounds that took months and years to heal, could now be cured in days or months", "url": "https://www.edexlive.com/news/2022/jan/18/bhu-scientists-find-cure-for-chronic-wounds-heres-how-they-managed-it-26943.html", "urlToImage": "https://images.edexlive.com/uploads/user/imagelibrary/2022/1/18/w600X390/Copy_of_Copy_of_Copy_of_100_cut-off.png", "publishedAt": "2022-01-18T07:40:00Z", "content": "A team of scientists from the Banaras Hindu University (BHU) have found a cure for those suffering from chronic wounds, particularly with diabetic foot ulcers. The team led by Prof Gopal Nath of the … [+3004 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "India.com Lifestyle Staff", "title": "Untreated Thyroid Problems Can Lead to Weight Gain, Menstrual, Skin, Infertility and Heart Problems in Women: - India.com", "description": "The thyroid produces thyroid hormone that controls many activities in the body, including how fast you burn calories and how fast your heartbeats.", "url": "https://www.india.com/health/untreated-thyroid-problems-can-lead-to-weight-gain-menstrual-skin-infertility-and-heart-problems-in-women-warns-doctor-5191510/", "urlToImage": "https://static.india.com/wp-content/uploads/2021/11/Thyroid-Home-Remedies-Basil-is-very-beneficial-for-controlling-thyroid-thyroidsathi-tulshiche-fayde.jpg", "publishedAt": "2022-01-18T06:58:27Z", "content": "The majority of the male and female population suffers from thyroid disorders. Thyroid problems like hypothyroidism and hyperthyroidism cause hormonal imbalances, menstruation, weight, skin, infertil… [+4117 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "PTI", "title": "Time is muscle, do not delay heart failure treatment - Devdiscourse", "description": "With the numbers growing at a fast pace, it is crucial to discuss heart failure.Beat Heart Failure, an initiative by The Times of India in partnership with Novartis is a campaign that aims to spread awareness about heart failure, its causes, prevention, treat…", "url": "https://www.devdiscourse.com/article/health/1887154-time-is-muscle-do-not-delay-heart-failure-treatment", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/24_05_2021_06_29_15_3970784.jpg?width=920&format=jpeg", "publishedAt": "2022-01-18T06:44:09Z", "content": "Our heart is the main organ in the circulatory system which pumps blood to the whole body. Due to various reasons, such as diabetes and hypertension, it becomes weak and unable to function. Heart fai… [+8127 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": null, "title": "Unlikely people will live with masks on forever: Fauci on 'new normal' - EastMojo", "description": "New Delhi/Davos: Warning that the COVID-19 pandemic is far from over and Omicron would not be the last variant, global health experts on Monday said a lot", "url": "https://www.eastmojo.com/news/2022/01/18/unlikely-people-will-live-with-masks-on-forever-fauci-on-new-normal/", "urlToImage": "https://www.eastmojo.com/wp-content/uploads/2021/05/facemask-5059928_1280.jpg", "publishedAt": "2022-01-18T04:45:00Z", "content": "New Delhi/Davos: Warning that the COVID-19 pandemic is far from over and Omicron would not be the last variant, global health experts on Monday said a lot would depend on transmissibility and severit… [+2725 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha", "title": "Is the new variant Deltacron really a cause of concern? Experts say it is probably not real - Medical Dialogues", "description": "New Delhi: A researcher in Cyprus had reportedly discovered a new variant called Deltacron. The new...", "url": "https://medicaldialogues.in/pulmonology/news/is-the-new-variant-deltacron-really-a-cause-of-concern-experts-say-it-is-probably-not-real-87336", "urlToImage": "https://medicaldialogues.in/h-upload/2021/12/30/167123-covid.jpg", "publishedAt": "2022-01-18T04:00:04Z", "content": "New Delhi: A researcher in Cyprus had reportedly discovered a new variant called Deltacron. The new strain of the coronavirus is said to be the result of the genetic fusion of the Delta and Omicron v… [+2099 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Cannabis Compounds Prevented Covid Infection in Lab Study - Bloomberg Quicktake: Now", "description": "Cannabis compounds prevented the virus that causes Covid-19 from penetrating healthy human cells, according to a laboratory study published in the Journal of...", "url": "https://www.youtube.com/watch?v=4eYN5CZXywQ", "urlToImage": "https://i.ytimg.com/vi/4eYN5CZXywQ/hqdefault.jpg", "publishedAt": "2022-01-18T03:04:33Z", "content": null}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "COVID-19: New CORBEVAX vaccine could help immunize low-income countries - Global News", "description": "Poorer nations are still struggling to fully immunize people against COVID-19, as they grapple with expensive vaccine patents and complex production. Accordi...", "url": "https://www.youtube.com/watch?v=XWs14plBOwQ", "urlToImage": "https://i.ytimg.com/vi/XWs14plBOwQ/maxresdefault.jpg", "publishedAt": "2022-01-18T03:00:13Z", "content": null}, {"source": {"id": null, "name": "Chiang Rai Times"}, "author": "Salman Ahmad", "title": "Scientists: Exercise Performed At Different Times Of The Day Has Different Effects - Chiang Rai Times", "description": "The most comprehensive study to date on the effects of exercise at different times of the day has been conducted by an international team of scientists in order to better understand why exercise times produce different effects. Published in Cell Metabolism, a…", "url": "https://www.chiangraitimes.com/health/scientists-exercise-performed-at-different-times-of-the-day-has-different-effects/", "urlToImage": "https://www.chiangraitimes.com/wp-content/uploads/2022/01/benefits-of-outdoor-exercise-pho-1000x600.webp", "publishedAt": "2022-01-18T00:42:20Z", "content": "The most comprehensive study to date on the effects of exercise at different times of the day has been conducted by an international team of scientists in order to better understand why exercise time… [+3097 chars]"}]}