{"status": "ok", "totalResults": 62, "articles": [{"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Research lays the foundation for developing obesity drugs based on enhancing β-AR signaling - News-Medical.Net", "description": "Following up on a 2018 study that identified an epigenetic modifier known as histone deacetylase 11 (HDAC11) as a potential therapeutic target for treating obesity and diabetes, researchers from the University of Colorado School of Medicine have published new…", "url": "https://www.news-medical.net/news/20220214/Research-lays-the-foundation-for-developing-obesity-drugs-based-on-enhancing-ceb2-AR-signaling.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2017/3/Obesity-Jakub_Cejpek_ead0fb8492f0437f96e9fd842630990c-620x480.jpg", "publishedAt": "2022-02-15T00:02:00Z", "content": "Following up on a 2018 study that identified an epigenetic modifier known as histone deacetylase 11 (HDAC11) as a potential therapeutic target for treating obesity and diabetes, researchers from the … [+3150 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Enhanced external counterpulsation therapy benefits long COVID-19 patients - News-Medical.Net", "description": "In a small study of long COVID-19 patients, those with and without coronary artery disease demonstrated improvement of a variety of symptoms, including fatigue, breathing difficulties and chest discomfort, after undergoing 15-35 hours of enhanced external cou…", "url": "https://www.news-medical.net/news/20220214/Enhanced-external-counterpulsation-therapy-benefits-long-COVID-19-patients.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Coronary_Artery_Disease-620x480.jpg", "publishedAt": "2022-02-14T23:51:00Z", "content": "In a small study of long COVID-19 patients, those with and without coronary artery disease demonstrated improvement of a variety of symptoms, including fatigue, breathing difficulties and chest disco… [+3781 chars]"}, {"source": {"id": null, "name": "Nature.com"}, "author": null, "title": "Omicron-targeted vaccines do no better than original jabs in early tests - Nature.com", "description": "Experiments in animals show that boosters customized for the fast-spreading COVID variant offer little advantage over standard jabs.", "url": "https://www.nature.com/articles/d41586-022-00003-y", "urlToImage": "https://media.nature.com/lw1024/magazine-assets/d41586-022-00003-y/d41586-022-00003-y_20124810.jpg", "publishedAt": "2022-02-14T21:41:26Z", "content": "Ambulances queue at a London hospital during a COVID-19 surge driven by the Omicron variant.Credit: Mark Thomas/Shutterstock\r\nAs the Omicron variant of SARS-CoV-2 continues its global rampage, vaccin… [+5048 chars]"}, {"source": {"id": null, "name": "Codelist.biz"}, "author": null, "title": "3 daily habits that are linked to dementia - Code List", "description": "Recent studies have shown that there 3 habits of our daily life that are intimately related to cases of dementiathe news alerts the health organizations of the big cities who see a catastrophic potential between the dementia and the 3 habits that trigger this…", "url": "https://codelist.biz/2022/02/14/3-daily-habits-that-are-linked-to-dementia/", "urlToImage": "https://www.terra.com.mx/u/fotografias/m/2022/2/14/f1280x720-33627_165302_5050.jpg", "publishedAt": "2022-02-14T21:00:23Z", "content": "Recent studies have shown that there 3 habits of our daily life that are intimately related to cases of dementiathe news alerts the health organizations of the big cities who see a catastrophic poten… [+2825 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "With high colon cancer death rate among blacks, a push for more screening - BollyInside", "description": "Each year, the disease claims more than 50,000 lives in the United States as the third-most common form of cancer and second-most common cause of", "url": "https://www.bollyinside.com/news/with-high-colon-cancer-death-rate-among-blacks-a-push-for-more-screening", "urlToImage": null, "publishedAt": "2022-02-14T20:50:24Z", "content": "Each year, the disease claims more than 50,000 lives in the United States as the third-most common form of cancer and second-most common cause of cancer-related death. In the Black community, numbers… [+2783 chars]"}, {"source": {"id": null, "name": "aidsmap"}, "author": null, "title": "Booster vaccine doses protect people with HIV against severe COVID-19 - aidsmap", "description": "Additional and booster vaccine doses have been effective in preventing serious COVID-19 in people with HIV and others with immune dysfunction, a large study from the United States reported this week at the 2022 Conference on Retroviruses and Opportunistic Inf…", "url": "https://www.aidsmap.com/news/feb-2022/booster-vaccine-doses-protect-people-hiv-against-severe-covid-19", "urlToImage": "https://www.aidsmap.com/sites/default/files/styles/aidsmap_social_default/public/2022-02/2000x1300%20aidsmap-homepage-blog_2.png?itok=ugM_N4jy", "publishedAt": "2022-02-14T20:25:33Z", "content": "Additional and booster vaccine doses have been effective in preventing serious COVID-19 in people with HIV and others with immune dysfunction, a large study from the United States reported this week … [+5391 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Samantha Boesch", "title": "The #1 Worst Oil for Cholesterol, Says Science — Eat This Not That - Eat This, Not That", "description": "If you're at risk for high cholesterol, you may want to be careful of what oils you cook with. Here's the worst oil for cholesterol.", "url": "http://www.eatthis.com/worst-oil-for-cholesterol/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/02/Untitled-design-50-17.png", "publishedAt": "2022-02-14T20:25:04Z", "content": "When it comes to matters of the heart, high cholesterol may be one of your biggest threats. This is because when your cholesterol levels get too high, your body develops fatty deposits that can block… [+2419 chars]"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "https://www.facebook.com/neurosciencenews", "title": "Loneliness Has a Different Neural Basis Than Social Anxiety - Neuroscience News", "description": "People with social anxiety have increased amygdala activity during social decision making, and reduced activity in the nucleus accumbens during social feedback. Those who are lonely did not experience the same alterations as those with social anxiety, suggest…", "url": "https://neurosciencenews.com/loneliness-social-anxiety-20065/", "urlToImage": "https://neurosciencenews.com/files/2022/02/loneliness-social-anxiety-neurosicences-.jpg", "publishedAt": "2022-02-14T20:16:36Z", "content": "Summary: People with social anxiety have increased amygdala activity during social decision making, and reduced activity in the nucleus accumbens during social feedback. Those who are lonely did not … [+4888 chars]"}, {"source": {"id": null, "name": "Dailyexcelsior.com"}, "author": "https://www.facebook.com/dailyexcelsior", "title": "New antibody helps block Covid transmission in cells: Study - Jammu Kashmir Latest News | Tourism | Breaking News J&K - Daily Excelsior", "description": "LOS ANGELES, Feb 14: Researchers have engineered a novel antibody that can directly interfere with and block the cell-to-cell transmission ability of SARS-CoV-2, the virus that causes COVID-19. The antibody, FuG1, targets the enzyme furin, which the virus use…", "url": "https://www.dailyexcelsior.com/new-antibody-helps-block-covid-transmission-in-cells-study/", "urlToImage": "https://www.dailyexcelsior.com/wp-content/uploads/2022/02/8-6.jpg", "publishedAt": "2022-02-14T18:30:19Z", "content": "LOS ANGELES, Feb 14: Researchers have engineered a novel antibody that can directly interfere with and block the cell-to-cell transmission ability of SARS-CoV-2, the virus that causes COVID-19.The an… [+3840 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Researchers find trove of proteins possibly influencing cystic fibrosis - ANI News", "description": "Ontario [Canada], February 14 (ANI): A new study by researchers at the University of Toronto has identified hundreds of new proteins that could play a role in cystic fibrosis, and which may shed light on why some patients responded better than others to curre…", "url": "https://www.aninews.in/news/science/researchers-find-trove-of-proteins-possibly-influencing-cystic-fibrosis20220214234801", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/Oxygedddask2022021411531620220214181728-thumbnail-154x87-70.jpg", "publishedAt": "2022-02-14T18:18:00Z", "content": "ANI | Updated: Feb 14, 2022 23:48 IST\r\nOntario [Canada], February 14 (ANI): A new study by researchers at the University of Toronto has identified hundreds of new proteins that could play a role in c… [+4303 chars]"}, {"source": {"id": null, "name": "UPI.com"}, "author": null, "title": "Study: Exercise right after flu or COVID-19 vaccine may boost antibodies - UPI News", "description": "UPI delivers the latest headlines from around the world: Top News, Entertainment, Health, Business, Science and Sports News - United Press International", "url": "https://www.upi.com/", "urlToImage": "//www.upi.com/img/upi-fb.png", "publishedAt": "2022-02-14T18:05:13Z", "content": ""}, {"source": {"id": null, "name": "Good News Network"}, "author": "https://www.facebook.com/Worldatlargenews/", "title": "First Time Someone With Cut Spinal Cord is Able to Walk Freely, Thanks to New Swiss Technology - Good News Network", "description": "Stimulated by electrical signals, the legs and low torso can be commanded to perform certain activities, like running, swimming, or pedaling.", "url": "https://www.goodnewsnetwork.org/implant-allows-someone-with-cut-spinal-cord-is-able-to-walk-freely/", "urlToImage": "https://www.goodnewsnetwork.org/wp-content/uploads/2022/02/man-walks-with-spinal-cord-injury-released.jpg", "publishedAt": "2022-02-14T17:28:49Z", "content": "Michel Roccati was paralyzed in a motorbike accident which completely severed his spinal cord. Unlike some other forms of paralysis, there’s no therapy for him, and absolutely no sensation whatsoever… [+2619 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Researchers identify a powerful combination of antivirals to treat COVID-19 - News-Medical.Net", "description": "Researchers at the University of Maryland School of Medicine and University of Pennsylvania Perelman School of Medicine have identified a powerful combination of antivirals to treat COVID-19.", "url": "https://www.news-medical.net/news/20220214/Researchers-identify-a-powerful-combination-of-antivirals-to-treat-COVID-19.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Microbiology-620x480.jpg", "publishedAt": "2022-02-14T17:12:00Z", "content": "Researchers at the University of Maryland School of Medicine (UMSOM) and University of Pennsylvania Perelman School of Medicine have identified a powerful combination of antivirals to treat COVID-19.… [+4776 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Kirti Pandey", "title": "Study shows Alzheimer's disease connection with late nights, missed sleep, upset Circadian rhythm - Times Now", "description": "Can the onset of Alzheimer's disease be predicted and/or prevented? Is there a trigger or a common causative factor among most patients? New research might explain how sleep disruption might feed into the onset and progression of Alzheimer’s, says a report.", "url": "https://www.timesnownews.com/health/article/alzheimers-disease-study-shows-connection-to-circadian-rhythm-sleep-amyloid-beta-proteins-microglia-dementia/858787", "urlToImage": "https://imgk.timesnownews.com/story/dementia.gif?tr=w-560,h-292,fo-top", "publishedAt": "2022-02-14T16:45:00Z", "content": "<ul><li>Late nights and messed up sleep schedules invite Alzheimer's disease, new study throws more light</li></ul>\r\n<ul><li>A long and detailed study has found that the onset of Alzheimers disease w… [+4592 chars]"}, {"source": {"id": null, "name": "Health-desk.org"}, "author": null, "title": "Can COVID-19 vaccines and boosters cause vaccine-acquired immunodeficiency? - Health Desk", "description": "Feb 14, 2022 by Health Desk – Vaccine-acquired immunodeficiency or VAIDS is not a known medical condition and there is no evidence to prove that COVID-19 vaccines or their booster shots cause immunodeficiency disorders.", "url": "https://health-desk.org/articles/is-there-any-evidence-of-vaccine-acquired-immunodeficiency-in-relation-to-covid-19-vaccines-and-booster-shots", "urlToImage": null, "publishedAt": "2022-02-14T16:32:58Z", "content": "False claims have been circulating that COVID-19 vaccines and boosters cause VAIDS or vaccine-acquired immunodeficiency syndrome. Not only is this information false but there is no known medical cond… [+5540 chars]"}, {"source": {"id": null, "name": "Globalcirculate.com"}, "author": "Annie Luis", "title": "The impact of post-Covid brain fog – and what to do to about it - Global Circulate", "description": "Although more research needs to be done, covid related brain fog is very real – and quite commmon (Picture: Getty)‘I had Covid for the first time in September 2021. And now, four months later, my brain doesn’t feel as sharp as it did before,’ Ho", "url": "https://globalcirculate.com/the-impact-of-post-covid-brain-fog-and-what-to-do-to-about-it/", "urlToImage": "https://metro.co.uk/wp-content/uploads/2022/02/PRC_221060253_1644850581.jpg?quality=90&strip=all&w=1200&h=630&crop=1", "publishedAt": "2022-02-14T16:25:41Z", "content": "Although more research needs to be done, covid related brain fog is very real and quite commmon (Picture: Getty)\r\nI had Covid for the first time in September 2021. And now, four months later, my brai… [+9056 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study explores the gut microbiome of COVID-19 patients - News-Medical.Net", "description": "Researchers investigated the changes in the gut microbiome and the presence of SARS-CoV-2 in stool samples of COVID-19 patients.", "url": "https://www.news-medical.net/news/20220214/Study-explores-the-gut-microbiome-of-COVID-19-patients.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_704408_16448498816569535.jpg", "publishedAt": "2022-02-14T15:16:00Z", "content": "A recent study posted to the medRxiv* pre-print server investigated the changes in the gut microbiome and the presence of severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) in stool samples… [+5265 chars]"}, {"source": {"id": null, "name": "Punjabnewsexpress.com"}, "author": null, "title": "Covid: UK monitoring hybrid 'Deltacron' strain - Punjab News Express", "description": "<p>LONDON: Initially touted as a laboratory error, a hybrid of Omicron and Delta strain called 'Deltacron' may be real.Health officials in the UK have identified a patient diagnosed with both Delta and Omicron at the same time, according to the UK Health Secu…", "url": "https://www.punjabnewsexpress.com/health/news/covid-uk-monitoring-hybrid-deltacron-strain-160077", "urlToImage": "https://www.punjabnewsexpress.com/images/thumb/thumb730.jpg", "publishedAt": "2022-02-14T15:13:49Z", "content": "LONDON: Initially touted as a laboratory error, a hybrid of Omicron and Delta strain called 'Deltacron' may be real.Health officials in the UK have identified a patient diagnosed with both Delta and … [+1633 chars]"}, {"source": {"id": null, "name": "AZoCleantech"}, "author": null, "title": "Water Stored in Reusable Plastic Bottles Contain Hundreds of Chemicals - AZoCleantech", "description": "Chemicals scientists at the University of Copenhagen have discovered several hundred different chemical elements in tap water kept in reusable plastic bottles.", "url": "https://www.azocleantech.com/news.aspx?newsID=31140", "urlToImage": "https://d3hnfqimznafg0.cloudfront.net/images/news/ImageForNews_31140_16448444764561933.jpg", "publishedAt": "2022-02-14T14:47:00Z", "content": "University of Copenhagen Chemicals scientists have discovered several hundred different chemical elements in tap water that are found in reusable plastic bottles.\r\nSelina Tisler in the lab. Image Cre… [+6160 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Explained Desk", "title": "Explained: What is Lassa fever, and what are its symptoms - The Indian Express", "description": "The death rate associated with this disease is low, at around one per cent. But the death rate is higher for certain individuals, such as pregnant women in their third trimester.", "url": "https://indianexpress.com/article/explained/explained-what-is-lassa-fever-and-what-are-its-symptoms-7773656/", "urlToImage": "https://images.indianexpress.com/2022/02/lassa-fever-reuters.png", "publishedAt": "2022-02-14T13:37:53Z", "content": "One of the three persons diagnosed with Lassa fever in the UK has died on February 11. The cases have been linked to travel to west African countries. The Lassa virus is named after a town in Nigeria… [+2559 chars]"}, {"source": {"id": null, "name": "The Siasat Daily"}, "author": "ANI", "title": "Study shows keto diet could enhance pancreatic cancer therapy - The Siasat Daily", "description": "Brussels: A diet high in fat and low in carbohydrates (sugars) that causes the body to break down fat into molecules is called ketones, or 'keto' diet. A recent preclinical study led by Ludwig Cancer Research has demonstrated that a common weight-loss diet co…", "url": "https://www.siasat.com/study-shows-keto-diet-could-enhance-pancreatic-cancer-therapy-2275762/", "urlToImage": "https://cdn.siasat.com/wp-content/uploads/2022/02/pancreatic-cancer_feb14.jpg", "publishedAt": "2022-02-14T13:34:00Z", "content": "Brussels: A diet high in fat and low in carbohydrates (sugars) that causes the body to break down fat into molecules is called ketones, or ‘keto’ diet. A recent preclinical study led by Ludwig Cancer… [+4629 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study explores the social impact of COVID-19 symptoms among female long haulers - News-Medical.Net", "description": "A new study analyzed the impact of long-COVID on women long haulers with respect to various aspects of their social life.", "url": "https://www.news-medical.net/news/20220214/Study-explores-the-social-impact-of-COVID-19-symptoms-among-female-long-haulers.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_704392_16448429936814305.jpg", "publishedAt": "2022-02-14T13:09:00Z", "content": "The coronavirus disease 2019 (COVID-19) pandemic has infected over 404 million people globally. The disease has affected patients physically, mentally, socially, and economically.\r\nThe physical and e… [+6561 chars]"}, {"source": {"id": null, "name": "Biospectrumindia.com"}, "author": null, "title": "Voxtur Bio unveils neutralising antibody test kit for COVID-19 - BSI bureau", "description": "VoxPress COVID-19 is a lateral flow test that detects IgG antibodies to spike protein of the SARS-CoV-2 virus", "url": "https://biospectrumindia.com/news/78/20635/voxtur-bio-unveils-neutralising-antibody-test-kit-for-covid-19.html", "urlToImage": "https://biospectrumindia.com/uploads/articles/photo-20635.png", "publishedAt": "2022-02-14T12:49:32Z", "content": "Mumbai-based in-vitro diagnostics (IVD) company Voxtur Bio has launched an advanced point of care rapid Neutralising antibody test kit VoxPress COVID-19 for detecting neutralising antibodies.\r\nVoxPre… [+588 chars]"}, {"source": {"id": null, "name": "Biospectrumindia.com"}, "author": null, "title": "MFine, Datar Genetics launch cancer screening prog on mobile - BSI bureau", "description": "EasyCheck is a radiation-free, globally recognised simple blood test for early cancer detection", "url": "https://www.biospectrumindia.com/news/79/20625/mfine-datar-genetics-launch-cancer-screening-prog-on-mobile.html", "urlToImage": "https://www.biospectrumindia.com/uploads/articles/health_2_-20625.jpg", "publishedAt": "2022-02-14T12:49:32Z", "content": "Between 30-50% of all cancer cases are preventable and prevention offers the most cost-effective long-term strategy for the control of cancer\r\nMFine in association with Datar Cancer Genetics has anno… [+840 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "COVID-19: 5 Foods that will Help Improve Your Health While Recovering from COVID-19 - News18", "description": "Aligned to the same particularity of this malevolent virus, the journey from testing COVID positive to getting completely cured is longer than you think", "url": "https://www.news18.com/news/lifestyle/covid-19-5-foods-that-will-help-improve-your-health-while-recovering-from-covid-19-4771421.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/02/covid-19-mutation-164437966816x9.png", "publishedAt": "2022-02-14T12:38:55Z", "content": "The fight from COVID-19 is always more protracted than we think. The perception that 2021 will be a COVID-free world was rebutted as soon as we entered the year. Aligned to the same particularity of … [+2522 chars]"}, {"source": {"id": null, "name": "The-sun.com"}, "author": "Terri-Ann Williams", "title": "Diabetes warning: The 5 high fat foods you need to avoid... - The Sun", "description": "", "url": "https://www.the-sun.com/health/4683261/diabetes-warning-high-fat-foods-avoid/", "urlToImage": "https://www.the-sun.com/wp-content/uploads/sites/6/2022/02/NINTCHDBPICT000711934056.jpg?strip=all&quality=100&w=1200&h=800&crop=1", "publishedAt": "2022-02-14T12:34:00Z", "content": "MILLIONS of people across the UK suffer with diabetes and it can be a difficult condition to live with.\r\nNo matter how hard you try, at times it can feel as though you're fighting a losing battle whe… [+4400 chars]"}, {"source": {"id": null, "name": "Medicinematters.com"}, "author": null, "title": "Meta-analysis confirms negative impact of rituximab on COVID-19 vaccine response - medwireNews", "description": "Findings from a systematic review and meta-analysis indicate that patients treated with anti-CD20 therapies have a heterogeneous response to vaccines against SARS-CoV-2, with particularly low seroconversion rates among those with recent B-cell depletion.", "url": "https://rheumatology.medicinematters.com/covid-19/vaccination/meta-analysis-rituximab/20129498", "urlToImage": "https://nemo-assets-live.public.springernature.app/static/version/img/mmrheumatology-favicons/apple-touch-icon.png", "publishedAt": "2022-02-14T12:14:18Z", "content": "medwireNews: Findings from a systematic review and meta-analysis indicate that patients treated with anti-CD20 therapies have a heterogeneous response to vaccines against SARS-CoV-2, with particularl… [+2145 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "News9 Staff", "title": "COVID-19 symptoms affect men and women differently, finds study - News9 LIVE", "description": "COVID fatigue is a prolonged effect of the pandemic.", "url": "https://www.news9live.com/health/covid-symptom-affects-men-and-women-differently-finds-study-153562", "urlToImage": "https://media.news9live.com/h-upload/2022/02/14/240374-covid.jpg", "publishedAt": "2022-02-14T12:04:16Z", "content": "The UK's ZOE study app found that Coronavirus symptoms could affect men and women differently. As per a Web MD poll, which was recorded from December 23, 2021 to January 4, 2022, men and women can be… [+2259 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "What is a Variant? - News-Medical.net", "description": "Viruses can change and alter their genetic make-up. This article looks at what we mean when we refer to a viral variant.", "url": "https://www.news-medical.net/health/What-is-a-Variant.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/Article_Images/ImageForArticle_22112_16448392890973537.jpg", "publishedAt": "2022-02-14T11:35:00Z", "content": "Viruses can change and alter their genetic make-up. When these changes occur, the virus may become more or less of a threat to the human host. Virologists are therefore interested in tracking the evo… [+4954 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Omicron may cause brain complications, inflammations: Russian expert - ETHealthworld.com", "description": "The Omicron strain of the Covid-19 may lead to neurological complications much like other Covid variants, according to a Russian expert.", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/omicron-may-cause-brain-complications-inflammations-russian-expert/89568162", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-89568162,imgsize-61942,width-1200,height-628,overlay-ethealthworld/omicron-may-cause-brain-complications-inflammations-russian-expert.jpg", "publishedAt": "2022-02-14T11:29:00Z", "content": "Moscow, The Omicron strain of the Covid-19 may lead to neurological complications much like other Covid variants, according to a Russian expert.According to founder and chief executive of DNKOM resea… [+2127 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Vitamin D deficiency linked to severity, deaths among COVID-19 patients: Study - Hindustan Times", "description": "A new study has found that vitamin D deficiency is associated with severe cases of COVID-19 as well as mortality. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/vitamin-d-deficiency-linked-to-severity-deaths-among-covid-19-patients-study-101644830780316.html", "urlToImage": "https://images.hindustantimes.com/img/2022/02/14/1600x900/vitamin-d-test_b02cbd26-c999-11e9-9a71-0afbe126130e_1644830824290.jpg", "publishedAt": "2022-02-14T10:46:38Z", "content": "A new study has found that vitamin D deficiency is associated with severe cases of COVID-19 as well as mortality.\r\nThe research has been published in the 'PLOS ONE Journal'.\r\nIn a study, researchers … [+2652 chars]"}, {"source": {"id": null, "name": "Odishabytes.com"}, "author": "OB Bureau", "title": "COVID-19: Pregnant Women Faced More Depression, Anxiety - OdishaBytes", "description": "COVID-19 had an adverse effect on expectant mothers.", "url": "https://odishabytes.com/covid-19-pregnant-women-faced-more-depression-anxiety/", "urlToImage": "https://odishabytes.com/wp-content/uploads/2021/09/Pregnancy.jpeg", "publishedAt": "2022-02-14T09:38:52Z", "content": "New Delhi: COVID-19 had an adverse effect on expectant mothers. A study by the University of Essex, published in ‘BMC Pregnancy and Childbirth’ found that the COVID-19 pandemic caused a spike in depr… [+2721 chars]"}, {"source": {"id": null, "name": "STAT"}, "author": null, "title": "Why Covid-19 vaccines are a freaking miracle - STAT", "description": "The pandemic has been catastrophic. But consider something that may have escaped you: You have witnessed — and you are a beneficiary of — a freaking miracle.", "url": "https://www.statnews.com/2022/02/14/why-covid-19-vaccines-are-a-freaking-miracle/", "urlToImage": "https://www.statnews.com/wp-content/uploads/2022/02/stat_vax_miracle_ink_f1_crop2-1024x576.jpg", "publishedAt": "2022-02-14T09:34:29Z", "content": "Two years into the Covid-19 pandemic, its easy to lament all that has come to pass. The devastating losses. The upending of what we regarded as normal ways of life. The sheer relentlessness of it all… [+17372 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Explained: Why your blood sugar level rises when you are sick? - Times of India", "description": "Over the years it can also open a window for chronic conditions like cardiovascular problems and nerve damage (neuropathy).", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/explained-why-your-blood-sugar-level-rises-when-you-are-sick/photostory/89563855.cms", "urlToImage": "https://static.toiimg.com/photo/89564037.cms", "publishedAt": "2022-02-14T08:55:00Z", "content": "For a diabetic patient, having a healthy and nutritious diet plays a crucial role in managing the blood sugar level. A well-balanced diet helps them to recover faster and also keep their blood sugar … [+1057 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "Mrityunjay Bose", "title": "15-year-old boy with MIS-C successfully treated at Wockhardt Hospital - Deccan Herald", "description": "A 15-year-old boy was successfully treated for multisystem inflammatory syndrome in children (MIS-C), a potentially fatal post-Covid complication that involves multiple organs. Harsh Chauhan a 15-year-old resident of Virar in Palghar district, complained of h…", "url": "https://www.deccanherald.com/national/15-year-old-boy-with-mis-c-successfully-treated-at-wockhardt-hospital-1081343.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/02/14/hospital-istock-2-1072618-1642598687-1081343-1644828202.jpg", "publishedAt": "2022-02-14T08:38:01Z", "content": "A 15-year-old boy was successfully treated for multisystem inflammatory syndrome in children (MIS-C), a potentially fatal post-Covid complication that involves multiple organs.\r\nHarsh Chauhan a 15-ye… [+2268 chars]"}, {"source": {"id": null, "name": "Dtnext.in"}, "author": "DTNextVidya", "title": "Mechanical blood clot removal showed positive results in half of stroke patients: Study - DTNext", "description": "A blood clot is a mass of blood that forms when platelets, proteins, and cells in the blood stick together.", "url": "https://www.dtnext.in/amp/Lifestyle/LifeStyleTopNews/2022/02/14135757/1343638/Mechanical-blood-clot-removal-showed-positive-results-.vpf", "urlToImage": "https://img.dtnext.in/Articles/2022/Feb/202202141357570436_Mechanical-blood-clot-removal-showed-positive-results-in_SECVPF.gif", "publishedAt": "2022-02-14T08:37:25Z", "content": "A blood clot is a mass of blood that forms when platelets, proteins, and cells in the blood stick together.\r\nWashington:According to an international study, mechanical removal of blood clots reduced … [+4968 chars]"}, {"source": {"id": null, "name": "Newstracklive.com"}, "author": "P C Thomas", "title": "Oxford Study finds weight loss shortens risk of colorectal cancer - News Track English", "description": "Oxford A new study has put some insight on the link between weight loss and cancer risk.  Obese and overweight adults who lose weight may have a lower risk of getting colorectal adenoma, a benign growth or polyp in the colon or rectum that can evolve to color…", "url": "https://english.newstracklive.com/news/oxford-study-finds-weight-loss-shortens-risk-of-colorectal-cancer-sc53-nu318-ta318-1211963-1.html", "urlToImage": "https://media.newstrack.in/uploads/lifestyle-health/health-tips/Feb/14/big_thumb/cancer_620a113156c0d.JPG", "publishedAt": "2022-02-14T08:22:23Z", "content": "Oxford A new study has put some insight on the link between weight loss and cancer risk.  Obese and overweight adults who lose weight may have a lower risk of getting colorectal adenoma, a benign gro… [+1377 chars]"}, {"source": {"id": null, "name": "Genetic Engineering & Biotechnology News"}, "author": "Sophia Ktori", "title": "Human Calorie Restriction Trial Identifies Key Factor for Extending Health Span - Genetic Engineering & Biotechnology News", "description": "Study in healthy humans showed that modest calorie reduction, rather than specific diet, rewires metabolic and immune responses to boost lifespan and health span.", "url": "https://www.genengnews.com/aging/human-calorie-restriction-trial-identifies-key-factor-for-extending-health-span/", "urlToImage": "https://www.genengnews.com/wp-content/uploads/2018/10/Apr12_2016_iStock_48166144_Aging.jpg", "publishedAt": "2022-02-14T08:00:12Z", "content": "Results from the first controlled trial to assess calorie restriction in healthy humans have confirmed the health benefits of moderately limiting calorie intake over a period of two years. Headed by … [+11775 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Eric Berger", "title": "How serious is the presence of the Covid virus in deer for humans? - The Guardian", "description": "Scientists think surveillance is urgent as deer could act as large reservoirs for the virus, and serve as a source for new variants", "url": "https://amp.theguardian.com/world/2022/feb/14/covid-virus-in-deer", "urlToImage": null, "publishedAt": "2022-02-14T07:02:00Z", "content": "AnimalsScientists think surveillance is urgent as deer could act as large reservoirs for the virus, and serve as a source for new variants \r\nMon 14 Feb 2022 07.00 GMT\r\nMichael Tonkovich spent the wee… [+5580 chars]"}, {"source": {"id": null, "name": "Dodofinance.com"}, "author": "Phil Schwartz", "title": "Poisonous sea anemone as a basis for medicine - DodoFinance", "description": "In Australia, you will find quite a few animals and plants that could cost you your life, but one of them may prove capable of", "url": "https://dodofinance.com/poisonous-sea-anemone-as-a-basis-for-medicine/", "urlToImage": null, "publishedAt": "2022-02-14T04:42:04Z", "content": "In Australia, you will find quite a few animals and plants that could cost you your life, but one of them may prove capable of doing the exact opposite. \r\nIt is a poisonous sea anemone that can reach… [+1251 chars]"}, {"source": {"id": null, "name": "Rockdale Newton Citizen"}, "author": "Sandee LaMotte, CNN", "title": "Long life comes from eating right, studies say. Here's how to begin - Rockdale Newton Citizen", "description": "Living a longer, healthier life can start with your diet. You could add up to 13 years to your life if you ate few red and processed meats and more", "url": "https://www.rockdalenewtoncitizen.com/features/health_wellness/long-life-comes-from-eating-right-studies-say-heres-how-to-begin/article_56d1bc28-1bc6-5dd6-b4af-3a338b0bf046.html", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/rockdalenewtoncitizen.com/content/tncms/assets/v3/editorial/3/02/302b9dad-e6d4-592c-9c9c-d0d9fd9254c6/62068fbc85642.image.jpg?crop=1920%2C1008%2C0%2C35&resize=1200%2C630&order=crop%2Cresize", "publishedAt": "2022-02-14T04:36:36Z", "content": "Living a longer, healthier life can start with your diet. You could add up to 13 years to your life if you ate few red and processed meats and more fruits and vegetables, legumes, whole grains and nu… [+4202 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "Press Trust of India", "title": "COVID reinfections: are they milder and do they strengthen immunity? - EastMojo", "description": "Norwich (UK): We've known since early on in the pandemic that COVID reinfections could occur. One of the first reinfections reported was in a 33-year-old", "url": "http://www.eastmojo.com/coronavirus-updates/2022/02/14/covid-reinfections-are-they-milder-and-do-they-strengthen-immunity/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2021/12/coronavirus_covid-19_AP_edit_i.jpg?fit=1018%2C795&ssl=1", "publishedAt": "2022-02-14T04:30:00Z", "content": "Norwich (UK): Weve known since early on in the pandemic that COVID reinfections could occur. One of the first reinfections reported was in a 33-year-old man from Hong Kong. His initial infection was … [+6467 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "NDTV Food", "title": "5 High-Protein Foods To Add To Your Diet - NDTV Food", "description": "We all have heard about how adding protein to the diet is an important aspect. But often we don't know what kind of proteins to add. Here we bring you a handpicked list of the foods high in protein you can add to your diet.", "url": "https://food.ndtv.com/photos/5-high-protein-foods-to-add-to-your-diet-101680", "urlToImage": "https://drop.ndtv.com/albums/COOKS/5-high-protein-_637804287781628746/637804287781628746.jpeg", "publishedAt": "2022-02-14T04:20:15Z", "content": "menu\r\narrow-down\r\nreddit\r\nsnapchat\r\ntwitter\r\nfacebook\r\ncomments\r\nemail\r\nprinter\r\nsearch\r\nbell\r\ntop-nav\r\nWe all have heard about how adding protein to the diet is an important aspect. But often we don… [+368 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "Trying to lose weight? Expert says that a simple exercise could be equivalent to running 10 marathons - Times Now", "description": "According to Dr Mosley, by simply standing on the feet, one can burn several calories and slim down effectively. In a podcast, the expert explained how strenuous workouts can be replaced with easier alternatives to shed pounds – and one of the most effective …", "url": "https://www.timesnownews.com/health/article/weight-loss-trick-to-burn-more-calories-standing-up-dr-michael-mosley-running-10-marathons-metabolism/858508", "urlToImage": "https://imgk.timesnownews.com/story/dr_michael_mosley_weight_loss.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2022-02-14T02:45:01Z", "content": "<ul><li>According to nutrition expert Dr Michael Mosley, who brought the 5:2 diet plan to fame, there is a simple trick to burn a plethora of calories, and it is as effective as running 10 marathons.… [+3326 chars]"}, {"source": {"id": null, "name": "Thegoaspotlight.com"}, "author": null, "title": "a study suggests that it could alter your metabolism - The Goa Spotlight", "description": "A study indicates that there is a correlation between charging the mobile next to the bed while you", "url": "https://thegoaspotlight.com/2022/02/13/a-study-suggests-that-it-could-alter-your-metabolism/", "urlToImage": "https://andro4all.com/hero/2022/02/Cargar-movil-dormir.jpg?width=1200&aspect_ratio=1200:631", "publishedAt": "2022-02-13T21:24:05Z", "content": "A study indicates that there is a correlation between charging the mobile next to the bed while you sleep and diabetes and obesity. Let’s see what the explanation is.\r\nIf you are one of those they le… [+2604 chars]"}, {"source": {"id": null, "name": "Lifehacker.com"}, "author": "Elizabeth Yuko", "title": "You Don't Have to Suffer From Winter Eyes - Lifehacker", "description": "How can they possibly be both watery and dry at the same time?", "url": "https://lifehacker.com/you-dont-have-to-suffer-from-winter-eyes-1848520098", "urlToImage": "https://i.kinja-img.com/gawker-media/image/upload/c_fill,f_auto,fl_progressive,g_center,h_675,pg_1,q_80,w_1200/00fe31242ca64f8fc715ebf4621e1ebc.jpg", "publishedAt": "2022-02-13T18:00:00Z", "content": "In addition to our skin and our hair, winter also can take a toll on our eyesand for many of the same reasons. When its cold outside, we want to spend more time inside, where its warm and dry. Unfort… [+1925 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Ways Intermittent fasting can mess with your mental health - Times of India", "description": "Top celebrities swear by it, fitness influencers recommend it, but did you know that intermittent fasting impacts mental health? Despite myriads of benefits it has in offer, intermittent fasting has a major effect on the mental wellness of an individual, expe…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/weight-loss/ways-intermittent-fasting-can-mess-with-your-mental-health/photostory/89504884.cms", "urlToImage": "https://static.toiimg.com/photo/89505109.cms", "publishedAt": "2022-02-13T17:30:00Z", "content": "\"If our cells don’t use it all, we store it in our fat cells as, well, fat. But sugar can only enter our cells with insulin, a hormone made in the pancreas. Insulin brings sugar into the fat cells an… [+741 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Science News | Mosquito Vision Could Help in Hiding from Disease Vectors: Study - LatestLY", "description": "Get latest articles and stories on Science at LatestLY. A new research led by scientists at the University of Washington has indicated that a common mosquito species (after detecting a tell-tale gas that we exhale) flies toward specific colours, including red…", "url": "https://www.latestly.com/agency-news/science-news-mosquito-vision-could-help-in-hiding-from-disease-vectors-study-3361738.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/02/Screenshot_20220213-213726__012022021316090320220213161242-588x441.jpg", "publishedAt": "2022-02-13T16:24:25Z", "content": "Washington [US], February 13 (ANI): A new research led by scientists at the University of Washington has indicated that a common mosquito species (after detecting a tell-tale gas that we exhale) flie… [+5457 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Emily Shiffer", "title": "The #1 Best Supplement for Abdominal Fat, Says Dietitian — Eat This Not That - Eat This, Not That", "description": "While diet and lifestyle changes are the way to go when it comes to losing abdominal fat, taking this supplement can also help.", "url": "http://www.eatthis.com/best-supplement-abdominal-fat/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2021/07/green-tea-supplements.jpg?quality=82&strip=all", "publishedAt": "2022-02-13T13:56:40Z", "content": "One of the most stubborn places to lose weight is in the abdomen. You may notice that the pounds just don't want to come off around your belly, no matter what you try.\r\n\"We store fat all over the bod… [+5113 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Samantha Boesch", "title": "Eating Habits to Lower Your Cholesterol After 50, Say Dietitians — Eat This Not That - Eat This, Not That", "description": "As you get older, your chances for high cholesterol increase. Here are some eating habits to help lower cholesterol and stay healthy.", "url": "http://www.eatthis.com/eating-habits-to-lower-your-cholesterol-after-50/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/02/Untitled-design-50-8.png", "publishedAt": "2022-02-13T12:46:16Z", "content": "Your body undergoes many significant shifts after you turn 50. For example, your heart health changes as the walls of your heart grow thicker and your arteries begin to stiffen more over time. Becaus… [+3509 chars]"}, {"source": {"id": null, "name": "Ahmedabadmirror.com"}, "author": null, "title": "How Covid variants escape cellular immune response - Ahmedabad Mirror", "description": "The T cell response in humans is genetically encoded by HLA molecules -- this means different individuals have different HLAs, programmed to recognise invading pathogens based on different parts, or &quot;epitopes&quot; of the pathogens.\n\nWhile experimental e…", "url": "https://ahmedabadmirror.com/how-covid-variants-escape-cellular-immune-response/81821120.html", "urlToImage": "https://ngs-space1.sgp1.digitaloceanspaces.com/am/uploads/mediaGallery/image/1644751996095.jpg-org", "publishedAt": "2022-02-13T11:52:24Z", "content": "The T cell response in humans is genetically encoded by HLA molecules -- this means different individuals have different HLAs, programmed to recognise invading pathogens based on different parts, or … [+1943 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Monica Lozano", "title": "Vitamin D deficiency symptoms: Signs to spot at home that could signal ‘severe deficiency’ - Verve Times", "description": "Vitamin D is used by the body to regulate the amount of calcium and phosphate in the body in order to keep the bones, teeth, and muscles healthy. During the winter, the body doesn’t make enough of the vitamin from sunlight so supplements which is why", "url": "https://vervetimes.com/vitamin-d-deficiency-symptoms-signs-to-spot-at-home-that-could-signal-severe-deficiency/", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1565247.jpg", "publishedAt": "2022-02-13T10:55:08Z", "content": "Vitamin D is used by the body to regulate the amount of calcium and phosphate in the body in order to keep the bones, teeth, and muscles healthy. During the winter, the body doesnt make enough of the… [+4094 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Christopher Sharp", "title": "High blood pressure: The ‘powerful tool’ you have at home shown to prevent the condition - Express", "description": "HYPERTENSION, otherwise known as high blood pressure, is a common condition that is easily treatable through a number of dietary and lifestyle changes. There can be any number of causes of hypertension ranging those a person can control to those they can't. N…", "url": "https://www.express.co.uk/life-style/health/1565226/high-blood-pressure-prevent-teeth-brushing", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1565226.jpg", "publishedAt": "2022-02-13T09:38:00Z", "content": "In the case of gum disease these complications include receding gums, loose teeth, loss of teeth, damage to the jaw and the tissue that connects the tooth to the socket.\r\nThese can be avoided through… [+375 chars]"}, {"source": {"id": null, "name": "Dtnext.in"}, "author": "VijayaShankar", "title": "For people with meniscal tears, exercise and surgery are equally effective: Study - DTNext", "description": "In this study, the researchers demonstrated that young people with a meniscal tear initially undergoing surgery did not achieve superior outcome compared to young people starting with exercise and education, with the option of later surgery.", "url": "https://www.dtnext.in/amp/Lifestyle/Wellbeing/2022/02/13143257/1343505/For-people-with-meniscal-tears-exercise-and-surgery-.vpf", "urlToImage": "https://img.dtnext.in/Articles/2022/Feb/202202131432574373_For-people-with-meniscal-tears-exercise-and-surgery-are_SECVPF.gif", "publishedAt": "2022-02-13T09:13:27Z", "content": "In this study, the researchers demonstrated that young people with a meniscal tear initially undergoing surgery did not achieve superior outcome compared to young people starting with exercise and ed… [+4214 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "ANI", "title": "Sleep apnea in pregnancy linked with increased post-delivery risk of hypertension: Study - Devdiscourse", "description": "Sleep apnea is a potentially serious sleep disorder in which breathing repeatedly stops and starts. A new study by researchers examined whether sleep disordered breathing (primarily obstructive sleep apnea) during pregnancy and in the years after delivery is …", "url": "https://www.devdiscourse.com/article/health/1920884-sleep-apnea-in-pregnancy-linked-with-increased-post-delivery-risk-of-hypertension-study", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/13_02_2022_07_51_37_9045494.jpg?width=920&format=jpeg", "publishedAt": "2022-02-13T07:51:39Z", "content": "Sleep apnea is a potentially serious sleep disorder in which breathing repeatedly stops and starts. A new study by researchers examined whether sleep disordered breathing (primarily obstructive sleep… [+3942 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medical Dialogues Bureau", "title": "HIV Discoverer Luc Montagnier Dies at 89 - Medical Dialogues", "description": "Paris: French researcher Luc Montagnier, who won a Nobel Prize in 2008 for discovering the HIV virus ...", "url": "https://medicaldialogues.in/news/health/hiv-discoverer-luc-montagnier-dies-at-89-88465", "urlToImage": "https://medicaldialogues.in/h-upload/2022/02/12/170365-luc-montagnier.jpg", "publishedAt": "2022-02-13T07:45:24Z", "content": "Paris: French researcher Luc Montagnier, who won a Nobel Prize in 2008 for discovering the HIV virus has died at age 89, according to local government officials in France.\r\nMontagnier died Tuesday at… [+3168 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "Time to wake up! Experts link an early morning symptom to cancer - Times Now", "description": "According to the World Health Organisation (WHO), cancer is one of the leading causes of death globally – as of data released in February 2022. Across its various forms, cancer is a disease that grows over time, through stages, and then starts to show symptom…", "url": "https://www.timesnownews.com/health/article/cancer-symptoms-early-morning-sign-persistent-cough-sore-throat-tumour-tobacco/858372", "urlToImage": "https://imgk.timesnownews.com/story/cancer_early_morning_symptom_sore_throat.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2022-02-13T07:44:00Z", "content": "<ul><li>Characterised by uncontrolled growth of cells and development of a tumour, cancer can over its stages spread across the body to become metastatic. </li></ul>\r\n<ul><li>As a result, treatment b… [+3107 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "PTI", "title": "Fungal infections cause more AIDs deaths than tuberculosis, here’s what we can do about it - Hindustan Times", "description": "As more and more people are treated for HIV infection, deaths will continue to come down. But the fall is slower than it should be, and the reason for the tardiness of this decrease in deaths is fungal disease. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/fungal-infections-cause-more-aids-deaths-than-tuberculosis-here-s-what-we-can-do-about-it-101644736394535.html", "urlToImage": "https://images.hindustantimes.com/img/2022/02/13/1600x900/AIDS_1638188907776_1644737660909.jpg", "publishedAt": "2022-02-13T07:40:11Z", "content": "Even though annual deaths from AIDs are coming down from a peak of 1.9 million in 2004 to 690,000 in 2020 - thats still way too many. In 2020, 214,000 people with AIDs died of tuberculosis (TB), thou… [+6255 chars]"}, {"source": {"id": null, "name": "SCNow"}, "author": "DR. ANIL OM McLeod Interventional cardiologist", "title": "DR. ANIL OM: Heart disease – not just a man’s world - SCNow", "description": "Heart disease has been historically stereotyped as being a man’s disease, but the reality is it can and does affect women as well. Heart disease and stroke are South Carolina’s", "url": "https://scnow.com/lifestyles/health-med-fit/dr-anil-om-heart-disease-not-just-a-man-s-world/article_f6203f28-8ba8-11ec-9d86-430e479c943e.html", "urlToImage": "https://bloximages.newyork1.vip.townnews.com/scnow.com/content/tncms/assets/v3/editorial/2/a9/2a95450a-8ba9-11ec-8a31-1b290861b508/620717905eca9.image.jpg?crop=1071%2C562%2C0%2C468&resize=1071%2C562&order=crop%2Cresize", "publishedAt": "2022-02-13T05:30:00Z", "content": "Heart disease has been historically stereotyped as being a mans disease, but the reality is it can and does affect women as well. Heart disease and stroke are South Carolinas leading killers for wome… [+1178 chars]"}, {"source": {"id": null, "name": "Vervetimes.com"}, "author": "Monica Lozano", "title": "Stomach cancer: Signs are heartburn, indigestion, changes in appetite, nausea and vomiting - Verve Times", "description": "Indeed, Cancer Research UK notes: “Symptoms of early stomach cancer can be similar to the symptoms of other conditions, such as stomach ulcers.” It says your GP should arrange for you to see a specialist if you have symptoms that could be due to stom", "url": "https://vervetimes.com/stomach-cancer-signs-are-heartburn-indigestion-changes-in-appetite-nausea-and-vomiting/", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1562727.jpg", "publishedAt": "2022-02-13T04:03:09Z", "content": "Indeed, Cancer Research UK notes: Symptoms of early stomach cancer can be similar to the symptoms of other conditions, such as stomach ulcers. It says your GP should arrange for you to see a speciali… [+1652 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study reveals new physiological mechanisms linking chronic pain to disrupted eating behavior - News-Medical.Net", "description": "It has long been known that there is an association between food and pain, as people with chronic pain often struggle with their weight. Researchers at the Del Monte Institute for Neuroscience may have found an explanation in a new study that suggests that ci…", "url": "https://www.news-medical.net/news/20220212/Study-reveals-new-physiological-mechanisms-linking-chronic-pain-to-disrupted-eating-behavior.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2016/3/Artificially_Colored_MRI_Scan_Of_Human_Brain-Daisy_Daisy_a8c5d8bbbf824bc8932308e30187510f-620x480.jpg", "publishedAt": "2022-02-13T03:40:00Z", "content": "It has long been known that there is an association between food and pain, as people with chronic pain often struggle with their weight. Researchers at the Del Monte Institute for Neuroscience may ha… [+2774 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Weight loss: Tricks and tips to feel full on a low-carb diet - Times of India", "description": "For the same reason when people go on a low-carb diet they often feel weak and famished even after having a plate full of food.", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/diet/weight-loss-tricks-and-tips-to-feel-full-on-a-low-carb-diet/photostory/89509657.cms", "urlToImage": "https://static.toiimg.com/photo/89510377.cms", "publishedAt": "2022-02-13T01:30:00Z", "content": null}]}