{"status": "ok", "totalResults": 63, "articles": [{"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Covid-19: When to Meet Your Loved Ones After Recovery? - News18", "description": "Covid-19 is contagious and the only way to prevent the infection from spreading is by wearing a triple-layer mask, maintaining social distance and sanitization.", "url": "https://www.news18.com/news/lifestyle/covid-19-when-to-meet-your-loved-ones-after-recovery-4675853.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/11/hugging-163775377616x9.jpg", "publishedAt": "2022-01-20T04:11:42Z", "content": "Covid-19 cases are increasing rapidly in India. On Wednesday, India reported 2.82 lakh new Covid-19 and 441 deaths. The cases of the Omicron variant are also increasing. To date, 8,961 of omicron has… [+1993 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": null, "title": "How to look after your mental health if you're at home with COVID-19 - EastMojo", "description": "Canberra: For many of us, catching COVID and isolating at home can be a lonely, scary and distressing experience. For those with a pre-existing mental", "url": "https://www.eastmojo.com/health/2022/01/20/how-to-look-after-your-mental-health-if-youre-at-home-with-covid-19/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2021/10/mental-health-g808c192d4_1920.jpg?fit=1920%2C1125&ssl=1", "publishedAt": "2022-01-20T04:10:00Z", "content": "Canberra: For many of us, catching COVID and isolating at home can be a lonely, scary and distressing experience. For those with a pre-existing mental illness, it can be even more difficult.\r\nThe fol… [+3720 chars]"}, {"source": {"id": null, "name": "Telangana Today"}, "author": null, "title": "No evidence of transmitting COVID virus through breastfeeding: Study - Telangana Today", "description": "The authors found that whilst a low proportion of breastmilk contained COVID-19 genetic material, this did not translate into the presence of infectious replicating viral particles or lead to evidence of clinical infection.", "url": "https://telanganatoday.com/no-evidence-of-transmitting-covid-virus-through-breastfeeding-study", "urlToImage": "https://di5qs4dv32t01.cloudfront.net/wp-content/uploads/2022/01/No-evidence-of-transmitting-COVID-virus-through-breastfeeding-Study.jpg", "publishedAt": "2022-01-20T04:02:00Z", "content": "California: There is no evidence of recently infected mothers transmitting infectious SARS-CoV-2 through breastmilk to their baby, according to a new study.\r\nThe study was published in the journal ‘P… [+2262 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "'Decoy' protein works against multiple SARS-CoV-2 variants, researchers report - Science Daily", "description": "A drug treatment that acts as a decoy against SARS-CoV-2 was highly effective at preventing death and lung damage in humanized animal models of severe COVID-19 disease. The study suggests that the drug has the potential to treat COVID-19 patients, including t…", "url": "https://www.sciencedaily.com/releases/2022/01/220119142828.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-20T02:18:36Z", "content": "A drug treatment that acts as a decoy against SARS-CoV-2 was highly effective at preventing death and lung damage in humanized animal models of severe COVID-19 disease, according to a Nature Chemical… [+4982 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuradha Mascarenhas", "title": "Explained: The global toll of bacterial resistance to drugs - The Indian Express", "description": "🔴 The Global Research on Antimicrobial Resistance (GRAM) report used statistical modelling to estimate deaths linked to 23 pathogens and 88 pathogen-drug combinations.", "url": "https://indianexpress.com/article/explained/explained-global-toll-bacterial-resistance-to-drugs-7732479/", "urlToImage": "https://images.indianexpress.com/2022/01/Covid-ward.jpg", "publishedAt": "2022-01-20T02:13:08Z", "content": "Hundreds of thousands of deaths occur today due to previously treatable infections such as lower respiratory and bloodstream infections because the bacteria that cause them have become resistant to t… [+3203 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "AFP", "title": "Is natural immunity more potent than Covid vaccine? What new study says - Mint", "description": "Prior to Delta becoming dominant, vaccination conferred greater immunity than infection. But the relationship shifted when the variant became predominant in late June and July.Protection was highest among those who had both vaccination and prior Covid", "url": "https://www.livemint.com/news/world/is-natural-immunity-more-potent-than-covid-vaccine-what-new-study-says-11642643865386.html", "urlToImage": "https://images.livemint.com/img/2022/01/20/600x338/FILES-US-HEALTH-VIRUS-VACCINES-0_1632322489528_1642644086458.jpg", "publishedAt": "2022-01-20T02:11:33Z", "content": "During America's last surge of the coronavirus driven by the Delta variant, people who were unvaccinated but survived Covid were better protected than those who were vaccinated and not previously inf… [+2891 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New mathematical model can calculate the risk of resistance evolution for drug pairs - News-Medical.net", "description": "Bacteria have dangerously evolved to thwart many of the medicines that were designed to kill them. As a result, a growing antibiotic resistance crisis is responsible for more than 700,000 deaths each year, emerging as one of the world's most pressing health i…", "url": "https://www.news-medical.net/news/20220119/New-mathematical-model-can-calculate-the-risk-of-resistance-evolution-for-drug-pairs.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/pill_antibiotics-620x480.jpg", "publishedAt": "2022-01-20T01:33:00Z", "content": "Bacteria have dangerously evolved to thwart many of the medicines that were designed to kill them. As a result, a growing antibiotic resistance crisis is responsible for more than 700,000 deaths each… [+4926 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anonna Dutt", "title": "Study says: By itself, Omicron does not boost immunity level - The Indian Express", "description": "🔴 However, the pre-print study from the US shows that in vaccinated individuals, an Omicron infection can boost existing immunity, thereby allowing the individual to fight off another infection better.", "url": "https://indianexpress.com/article/india/omicron-covid-19-immunity-study-7732515/", "urlToImage": "https://images.indianexpress.com/2022/01/COVID-CASES-SURGE-1-1.jpg", "publishedAt": "2022-01-20T00:14:22Z", "content": "In what could further underline the importance of vaccination, a new study shows that an infection with the Omicron variant of the Covid virus may not generate broad immunity in unvaccinated individu… [+4549 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Pediatric hospital units bracing for MIS-C surge in 4-6 weeks - 10 Tampa Bay", "description": "Pediatric COVID hospitalizations are at record levels across the country, including here in Florida.Throughout the pandemic, health officials have warned abo...", "url": "https://www.youtube.com/watch?v=S5p7_jemRnM", "urlToImage": "https://i.ytimg.com/vi/S5p7_jemRnM/maxresdefault.jpg", "publishedAt": "2022-01-19T23:39:36Z", "content": null}, {"source": {"id": null, "name": "POPSUGAR"}, "author": "Kate Schweitzer", "title": "COVID, the Flu, Croup, or Strep Throat? How to Understand Your Child’s Symptoms - POPSUGAR", "description": "A family doctor explains the varying crossover symptoms between COVID-19 and other pediatric illnesses like the common cold, flu, strep throat, or croup.", "url": "https://www.popsugar.com/family/covid-flu-strep-throat-or-croup-what-child-symptoms-mean-48686878", "urlToImage": "https://media1.popsugar-assets.com/files/thumbor/PIGXlHGHXh4YWZYqjt6Dp-7FOuw/0x154:6699x3671/fit-in/1200x630/filters:format_auto-!!-:strip_icc-!!-/2022/01/19/977/n/24155406/1df10d0861e8904a29da62.49031222_.jpg", "publishedAt": "2022-01-19T22:49:04Z", "content": "Lately, parents have been trained to have tunnel vision with their children's health. It seems the only diagnosis that matters to keep their kid in daycare or school is COVID-19. Bayo Curry-Winchell,… [+3788 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "When will the COVID-19 pandemic become an endemic? This expert says it could be soon - CTV News", "description": "Infectious disease specialist Dr. Monica Gandhi says the pandemic could begin pivoting to an endemic status by early spring in higher-income countries such a...", "url": "https://www.youtube.com/watch?v=85WDGwQgR2w", "urlToImage": "https://i.ytimg.com/vi/85WDGwQgR2w/hqdefault.jpg", "publishedAt": "2022-01-19T22:26:59Z", "content": null}, {"source": {"id": null, "name": "Dailypioneer.com"}, "author": "The Pioneer", "title": "Omicron wave may cut future severity of COVID disease: S African Study - Daily Pioneer", "description": "The Omicron variant of coronavirus may reduce the incidence of severe COVID-19 disease, and the infection may become less disruptive to individuals and society in future, according to a study conducted by researchers in South Africa.\n\nThe findings of the yet-…", "url": "https://www.dailypioneer.com/2022/world/omicron-wave-may-cut-future-severity-of-covid-disease--s-african-study.html", "urlToImage": "https://www.dailypioneer.com/images/logo.jpg", "publishedAt": "2022-01-19T19:16:16Z", "content": "The Omicron variant of coronavirus may reduce the incidence of severe COVID-19 disease, and the infection may become less disruptive to individuals and society in future, according to a study conduct… [+2611 chars]"}, {"source": {"id": null, "name": "NewsBytes"}, "author": "Pratyush Deep Kotoky", "title": "No evidence to suggest healthy children need booster doses: WHO - NewsBytes", "description": "The World Health Organization's chief scientist Soumya Swaminathan Wednesday said there is \"no evidence at all\" that healthy children and adolescents need booster doses of vaccine against COVID-19.", "url": "https://www.newsbytesapp.com/news/world/who-on-covid-19-booster-doses-to-healthy-children/story", "urlToImage": "https://i.cdn.newsbytesapp.com/images/l241_43401642591332.jpg", "publishedAt": "2022-01-19T18:45:04Z", "content": "No evidence to suggest healthy children need booster doses: WHO\r\nThe World Health Organization (WHO) on Wednesday said there is \"no evidence\" that healthy children and adolescents need booster doses … [+2130 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "Vaping May Worsen COVID-19 Symptoms – Consumer Health News - BollyInside", "description": "What’s more, folks who vaped and smoked tobacco reported higher rates of labored breathing and more emergency department visits when they contracted", "url": "https://www.bollyinside.com/news/vaping-may-worsen-covid-19-symptoms-consumer-health-news", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2021/03/Health-bollyins-ide-24.jpg", "publishedAt": "2022-01-19T18:30:32Z", "content": "Whats more, folks who vaped and smoked tobacco reported higher rates of labored breathing and more emergency department visits when they contracted COVID-19, the new study findings showed. The study … [+3062 chars]"}, {"source": {"id": null, "name": "OI Canadian"}, "author": "HELEN HERNANDEZ", "title": "the answers to the key doubts of the variant that drives the third wave of Covid - OI Canadian", "description": "Since its identification, at the end of November, the Omicron variant caused an exponential growth in coronavirus cases around the world. Since last week, the third wave shows this reality also in Arg", "url": "https://oicanadian.com/the-answers-to-the-key-doubts-of-the-variant-that-drives-the-third-wave-of-covid/", "urlToImage": "https://www.clarin.com/img/2021/12/23/testeos-de-covid-omicron-impulsa___L949x9rk7_1200x630__1.jpg", "publishedAt": "2022-01-19T17:28:44Z", "content": "Since its identification, at the end of November, the Omicron variant caused an exponential growth in coronavirus cases around the world. Since last week, the third wave shows this reality also in Ar… [+7314 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Reuters", "title": "Researchers launch trials for Covid-19 vaccine to be administered via arm patch - Mint", "description": "British company Emergex Vaccines Holding Ltd developed the potential vaccine, while Unisanté medical research centre in Lausanne in collaboration with the city's CHUV hospital will run the trial, which started on Jan. 10", "url": "https://www.livemint.com/news/world/researchers-launch-trials-for-covid-19-vaccine-to-be-administered-via-arm-patch-11642612048335.html", "urlToImage": "https://images.livemint.com/img/2022/01/19/600x338/covid_arm_patch_vaccine_1642612250098_1642612250251.JPG", "publishedAt": "2022-01-19T17:12:05Z", "content": "Swiss medical researchers said on Wednesday they have launched an early-stage study to test a next-generation Covid-19 vaccine candidate which would be administered via an arm patch, the latest to lo… [+2274 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "IANS", "title": "Can you be infected with Omicron twice? Check experts` opinion here! - Zee News", "description": "India on Wednesday (January 19) reported 2,82,970 new cases, which is 18% higher than yesterday s 2.38 lakh daily cases, the health ministry data showed. The country also reported 441 coronavirus related deaths taking the total death count in the country due …", "url": "https://zeenews.india.com/health/can-you-be-infected-with-omicron-twice-check-experts-opinion-here-2429206", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/01/19/1006930-untitled-design-2022-01-19t215011.107.jpg", "publishedAt": "2022-01-19T16:21:47Z", "content": "New Delhi: India on Wednesday (January 19) reported 2,82,970 new cases, which is 18% higher than yesterday's 2.38 lakh daily cases, the health ministry data showed. The country also reported 441 coro… [+3901 chars]"}, {"source": {"id": null, "name": "Science Daily"}, "author": null, "title": "Antibodies in blood soon after COVID-19 onset may predict severity, study finds - Science Daily", "description": "A look at antibodies in patients soon after they were infected with the virus that causes COVID-19 showed key differences between those whose cases remained mild and those who later developed severe symptoms.", "url": "https://www.sciencedaily.com/releases/2022/01/220118111359.htm", "urlToImage": "https://www.sciencedaily.com/images/scidaily-icon.png", "publishedAt": "2022-01-19T16:08:49Z", "content": "Blood drawn from patients shortly after they were infected with SARS-CoV-2, the virus that causes COVID-19, may indicate who is most likely to land in the hospital, a study led by Stanford Medicine i… [+8436 chars]"}, {"source": {"id": null, "name": "World Health Organization"}, "author": null, "title": "Health emergencies - The Omicron variant: sorting fact from myth - WHO/Europe", "description": "Since the B.1.1.529 variant was declared a Variant of Concern and assigned the name Omicron on 26 November 2021, our understanding of this variant has increased considerably, thanks to collaborative global research and the passing of time, allowing us to obse…", "url": "https://www.euro.who.int/en/health-topics/health-emergencies/pages/news/news/2022/01/the-omicron-variant-sorting-fact-from-myth", "urlToImage": "https://www.euro.who.int/__data/assets/image/0005/243581/who-europe-250.png", "publishedAt": "2022-01-19T15:57:06Z", "content": "Since the B.1.1.529 variant was declared a Variant of Concern and assigned the name Omicron on 26 November 2021, our understanding of this variant has increased considerably, thanks to collaborative … [+8363 chars]"}, {"source": {"id": null, "name": "Firstpost"}, "author": null, "title": "Omicron: Know about most prevalent symptoms, tests and isolation methods to fight COVID-19 - Firstpost", "description": "As per an analysis by a US Centers for Disease Control and Prevention, cough, fatigue, congestion and runny nose are the four most common symptoms of the Omicron variant", "url": "https://www.firstpost.com/world/omicron-know-about-most-prevalent-symptoms-tests-and-isolation-methods-to-fight-covid-19-10301371.html", "urlToImage": "https://images.firstpost.com/wp-content/uploads/2021/12/11omicron.jpg", "publishedAt": "2022-01-19T15:44:23Z", "content": "As per an analysis by a US Centers for Disease Control and Prevention, cough, fatigue, congestion and runny nose are the four most common symptoms of the Omicron variant\r\n The world has recently been… [+2513 chars]"}, {"source": {"id": null, "name": "Indiaherald.com"}, "author": "S.Venkateshwari", "title": "How long does Covid-19 Vaccine immunity last? - ఏపిహెరాల్ద్.కామ్ - unit of India Herald Group Publishers [P] LIMITED", "description": "health : How long does Covid-19 Vaccine immunity last? \n\nAfter taking the corona vaccine, its effect lasts for only 6 months in about 30 percent. Afte", "url": "https://www.indiaherald.com/Health/Read/994468554/How-long-does-Covid-Vaccine-immunity-last", "urlToImage": "https://www.indiaherald.com/imagestore/images/health/movies_news/how-long-does-covid-vaccine-immunity-last31c6aa93-a417-4f24-a0c4-f03d3537137c-415x250-IndiaHerald.jpg", "publishedAt": "2022-01-19T15:24:05Z", "content": "How long does Covid-19 Vaccine immunity last? \r\nAfter taking the corona vaccine, its effect lasts for only 6 months in about 30 percent. After this, the immunity created by it becomes weak or ends in… [+949 chars]"}, {"source": {"id": null, "name": "Genetic Engineering & Biotechnology News"}, "author": "Sarah Bender", "title": "Bagging the Culprit: Japanese Researchers Identify BAG5 Mutations as Cause of Dilated Cardiomyopathy - Genetic Engineering & Biotechnology News", "description": "A member of the Osaka University Department of Cardiovascular Medicine, and his colleagues found through whole-genome sequencing that loss-of-function mutations in the gene encoding BAG5 caused DCM with complete penetrance.", "url": "https://www.genengnews.com/topics/omics/bagging-the-culprit-japanese-researchers-identify-mutations-in-the-bag5-gene-as-a-cause-of-dilated-cardiomyopathy/", "urlToImage": "https://www.genengnews.com/wp-content/uploads/2022/01/Wikipedia_IdiopathiCardiomyopathy.jpg", "publishedAt": "2022-01-19T14:41:03Z", "content": "Researchers at Osaka University in Japan have identified specific genetic mutations that can cause dilated cardiomyopathy (DCM).\r\nIn an article published in Science Translational Medicine entitled Lo… [+4400 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Control Diabetes During Cancer Treatment With Simple Steps - News18", "description": "Apart from steroids, stress also plays an important factor in inducing diabetes.", "url": "https://www.news18.com/news/lifestyle/control-diabetes-during-cancer-treatment-with-simple-steps-4671956.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/12/cancer-2-163991897916x9.jpg", "publishedAt": "2022-01-19T14:10:25Z", "content": "If you are diabetic and suffering from cancer at the same time, then your body can go through some serious changes. As you carry on with your cancer treatment, your sugar levels can shoot up. Chemoth… [+1788 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Bob Yirka", "title": "Using a bacteriophage to successfully treat a patient infected with a drug-resistant bacteria - Medical Xpress", "description": "A team of doctors and researchers working at Erasmus Hospital in Belgium has successfully treated an adult woman infected with a drug-resistant bacteria using a combination of bacteriophage therapy and antibiotics. In their paper published in the journal Natu…", "url": "https://medicalxpress.com/news/2022-01-bacteriophage-successfully-patient-infected-drug-resistant.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2022/using-a-bacteriophage.jpg", "publishedAt": "2022-01-19T13:40:02Z", "content": "A team of doctors and researchers working at Erasmus Hospital in Belgium has successfully treated an adult woman infected with a drug-resistant bacteria using a combination of bacteriophage therapy a… [+3094 chars]"}, {"source": {"id": null, "name": "Thenewsmotion.com"}, "author": "Anna Mason", "title": "Covid vaccine: When should you take paracetamol – before or after? - The News Motion", "description": "The first recorded case of COVID-19 in the UK was on the 29th January 2020 at RAF Brize Norton. Less than two months later and the UK, along with the rest of the world, was in lockdown. For a while it had been hoped that it would be relatively short-", "url": "https://thenewsmotion.com/covid-vaccine-when-should-you-take-paracetamol-before-or-after/", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1552547.jpg", "publishedAt": "2022-01-19T13:37:57Z", "content": "The first recorded case of COVID-19 in the UK was on the 29th January 2020 at RAF Brize Norton. Less than two months later and the UK, along with the rest of the world, was in lockdown. For a while i… [+1959 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Scientific review highlights the impact of coffee on digestive organs - News-Medical.Net", "description": "A new scientific review, published in Nutrients, highlights coffee's effects on digestion and the gut, and its impact on organs involved in digestion.", "url": "https://www.news-medical.net/news/20220119/Scientific-review-highlights-the-impact-of-coffee-on-digestive-organs.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Digestion-620x480.jpg", "publishedAt": "2022-01-19T13:37:00Z", "content": "A new scientific review, published in Nutrients, highlights coffee's effects on digestion and the gut, and its impact on organs involved in digestion. The review, supported by The Institute for Scien… [+3417 chars]"}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Science News | Researchers Pinpoint How Zika Virus Evades Cell's Antiviral Response - LatestLY", "description": "Get latest articles and stories on Science at LatestLY. In a new study of the Zika virus, Northwestern University scientists have discovered a key mechanism used by the virus to evade the antiviral response of the cell it is attacking. This finding contribute…", "url": "https://www.latestly.com/agency-news/science-news-researchers-pinpoint-how-zika-virus-evades-cells-antiviral-response-3271236.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/01/SARS2022011912251120220119131940-588x441.jpg", "publishedAt": "2022-01-19T13:30:26Z", "content": "Evanston (Illinois) [US], January 19 (ANI): In a new study of the Zika virus, Northwestern University scientists have discovered a key mechanism used by the virus to evade the antiviral response of t… [+3777 chars]"}, {"source": {"id": null, "name": "Women's Health"}, "author": null, "title": "'How Binge-Watching Love Island Led To My Diagnosis Of Lipedema' - Women's Health", "description": "\"I have an extremely underdiagnosed condition that causes excess fat deposits.\"", "url": "https://www.womenshealthmag.com/health/a38553019/love-island-lipedema/", "urlToImage": "https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/img-3236-1640199946.jpg?crop=1.00xw:0.377xh;0,0.197xh&resize=1200:*", "publishedAt": "2022-01-19T13:00:55Z", "content": "When I was about 9 years old and in the fourth grade, one of my friends asked me why I had \"cankles.\" I didn't even know what that meant at the time. While I didn’t think too much about it, I kind of… [+8393 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Are unvaccinated pregnant women at risk of birth-related complications? Study answers - Mint", "description": "The team analysed data relating to all pregnant women in Scotland. It included more than 87,000 women who were pregnant between the start of vaccination uptake in December 2020 and October 2021", "url": "https://www.livemint.com/news/india/are-unvaccinated-pregnant-women-at-risk-of-birth-related-complications-study-answers-11642591865886.html", "urlToImage": "https://images.livemint.com/img/2022/01/19/600x338/unvaccinated_pregnant_women_1642594152588_1642594152799.jpg", "publishedAt": "2022-01-19T12:10:56Z", "content": "Pregnant women unvaccinated against Covid-19 are at a much higher risk of developing birth-related complications, a new study published in the 'Nature Medicine Journal' has revealed. \r\nThe findings s… [+3572 chars]"}, {"source": {"id": null, "name": "Sky.com"}, "author": "Sky", "title": "COVID: Reinfection risk from Omicron 16 times higher than Delta, ONS data indicates - Sky News", "description": "", "url": "https://news.sky.com/story/reinfection-risk-from-omicron-16-times-higher-than-delta-ons-data-indicates-12519881", "urlToImage": "https://e3.365dm.com/21/10/1600x900/skynews-croydon-town-centre_5535080.jpg?20211004171911", "publishedAt": "2022-01-19T12:06:48Z", "content": "The risk of reinfection from the Omicron COVID variant is 16 times higher than Delta, new figures indicate.\r\nLatest COVID-19 data from the Office for National Statistics shows the rate for all reinfe… [+2890 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Pam Harrison", "title": "Pediatric CAP: Short 5-Day Antibiotic Course Beats 10-Day - Medscape", "description": "Treatment of uncomplicated pediatric community-acquired pneumonia with a short, 5-day course of antibiotics results in a superior clinical response compared to the standard 10-day course.", "url": "https://www.medscape.com/viewarticle/966806", "urlToImage": "https://img.medscape.com/thumbnail_library/Medscape_News.jpg", "publishedAt": "2022-01-19T11:54:13Z", "content": "The evidence is in: Less is more when it comes to treating uncomplicated community-acquired pneumonia (CAP) in young children. Five days of antibiotic therapy resulted in a superior clinical response… [+6754 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Nivedita Mishra", "title": "Diabetes self test kit makes monitoring blood sugar level easy and convenient - Hindustan Times", "description": "Diabetes is a lifestyle disease which needs constant monitoring. In relation to Covid-19, it is also a comorbidity and hence needs a close watch. It is, therefore, wise to keep a diabetes self test kit handy at all times. See here.", "url": "https://www.hindustantimes.com/shop-now/health-and-beauty/diabetes-self-test-kit-makes-monitoring-blood-sugar-level-easy-and-convenient-101642581495142.html", "urlToImage": "https://images.hindustantimes.com/img/2022/01/19/1600x900/Glucose_Sugar_Self_Test_Kit_Diabetes_1642589608151_1642589619552.jpg", "publishedAt": "2022-01-19T11:19:09Z", "content": "In the last couple of years we have seen lifestyle diseases like diabetes become a huge health hazard in a country like India. As per a report in International Diabetes Federation (IDF) in 2021 ahead… [+2925 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Coronavirus: How does COVID's Omicron variant impact the kids? Symptoms to watch out for and ways to treat them - Times of India", "description": "As Omicron cases surge in the country and around the world, parents are highly concerned about the safety of their kids. Although in the past, children have shown a more robust immune response to the SARs-COV-2 virus, recent reports and findings suggest that …", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/coronavirus-omicron-symptoms-in-kids-how-does-covids-omicron-variant-impact-the-kids-symptoms-to-watch-out-for-and-ways-to-treat-them/photostory/88994392.cms", "urlToImage": "https://static.toiimg.com/photo/88994410.cms", "publishedAt": "2022-01-19T10:30:00Z", "content": "While many kids infected with the Omicron are reporting symptoms like cold and cough, along with other cold-like symptoms, Dr. Sheth recommends keeping children hydrated at all times. \"There is a pos… [+780 chars]"}, {"source": {"id": "cnn", "name": "CNN"}, "author": "Camilo Rocha and Rodrigo Pedroso, CNN", "title": "Brazil's parents want their kids vaccinated against Covid. Bolsonaro has tried to stop it - CNN", "description": "Last June, as Covid-19 cases were surging across Brazil, Camila Basto waited at a São Paulo hospital to find out what was wrong with her 9-year-old daughter, Manuela.", "url": "https://www.cnn.com/2022/01/19/americas/brazil-child-vaccines-bolsonaro-intl-cmd-latam/index.html", "urlToImage": "https://cdn.cnn.com/cnnnext/dam/assets/220117124500-bolsonaro-0113-super-tease.jpg", "publishedAt": "2022-01-19T10:07:00Z", "content": null}, {"source": {"id": null, "name": "WION"}, "author": "WION Web Team", "title": "‘Nocebo’ effect, not Covid vaccine causing adverse reactions, claims study - WION", "description": "Many mild or adverse side effects that people experience after taking the Covid vaccine are caused by “nocebo effect” – a negative version of the placebo effect – a new study has claimed.", "url": "https://www.wionews.com/world/nocebo-effect-not-covid-vaccine-causing-adverse-reactions-claims-study-445915", "urlToImage": "https://cdn.wionews.com/sites/default/files/styles/story_page/public/2021/12/22/228331-arnt1.jpg", "publishedAt": "2022-01-19T09:33:36Z", "content": "Many mild or adverse side effects that people experience after taking the Covid vaccine are caused by nocebo effect a negative version of the placebo effect a new study has claimed.\r\nA placebo effect… [+2052 chars]"}, {"source": {"id": null, "name": "World Economic Forum"}, "author": "David Fredrickson", "title": "Is cancer the next pandemic? How to avoid a new health crisis - World Economic Forum", "description": "The global cancer community needs to come together, reprioritize screenings and minimize setbacks to healthcare systems and society.", "url": "https://www.weforum.org/agenda/2022/01/cancer-health-crisis-oncology-astrazeneca/", "urlToImage": "https://assets.weforum.org/article/image/responsive_medium_evPs7CVw7cPT80dA5pUD_wUZcE_FflrvgRkdM6l35M8.jpg", "publishedAt": "2022-01-19T08:07:22Z", "content": "<ul><li>Despite many recent advances in cutting cancer death rates, the global instability from COVID-19 has resulted in disruption to vital cancer screenings and treatment.</li><li>The global cancer… [+7378 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Changes in sleep and biological rhythms from late pregnancy to postpartum linked to depression and anxiety - ANI News", "description": "Hamilton (Ontario) [Canada], January 19 (ANI): A set of parameters including sleep and biological rhythm variables have been closely associated with the severity of depressive and anxiety symptoms, starting in the third trimester of pregnancy to the third pos…", "url": "https://www.aninews.in/news/lifestyle/fitness/changes-in-sleep-and-biological-rhythms-from-late-pregnancy-to-postpartum-linked-to-depression-and-anxiety20220119133741", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/postpartum2022011906505020220119080727-thumbnail-154x87-70.jpg", "publishedAt": "2022-01-19T08:07:00Z", "content": "Hamilton (Ontario) [Canada], January 19 (ANI): A set of parameters including sleep and biological rhythm variables have been closely associated with the severity of depressive and anxiety symptoms, s… [+2528 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Can Omicron cause heart damage? Here's what experts say - Hindustan Times", "description": "In case of previous variants, a large number of Covid patients ended up with heart damage. Can Omicron affect heart? Experts answer. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/can-omicron-cause-heart-damage-here-s-what-experts-say-101642578960349.html", "urlToImage": "https://images.hindustantimes.com/img/2022/01/19/1600x900/heart_health_thumb_1642401107215_1642579198559.jpg", "publishedAt": "2022-01-19T08:04:11Z", "content": "Omicron, first identified in South Africa last year in November is yet to be fully decoded by experts across the world. Relatively mild and much more infectious than previous Covid-19 variants, Omicr… [+2693 chars]"}, {"source": {"id": null, "name": "Thefederal.com"}, "author": null, "title": "Avoid steroids, test for TB if cough persists – Centre updates COVID guidelines - The Federal", "description": "Doctors treating COVID-19 should avoid prescribing steroids and get them tested for tuberculosis if severe cough persists, government says", "url": "https://thefederal.com/news/avoid-steroids-test-for-tb-if-cough-persists-centre-updates-covid-guidelines/", "urlToImage": "https://thefederal.com/file/2021/06/iStock-1319665712.jpg", "publishedAt": "2022-01-19T07:29:46Z", "content": "Doctors treating COVID-19 should avoid prescribing steroids and get them tested for tuberculosis if severe cough persists, the Ministry of Health and Family Welfare has said in an updated set of guid… [+1334 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "Want to lose weight faster? These effective and sustainable diets can help - Times Now", "description": "Read on to know about some diets that can help facilitate the process of weight loss in a healthy, effective, and sustainable way.", "url": "https://www.timesnownews.com/health/article/want-to-lose-weight-faster-these-effective-and-sustainable-diets-can-help/850795", "urlToImage": "https://imgk.timesnownews.com/story/iStock-929029958.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2022-01-19T03:58:39Z", "content": "<ul><li>The process of losing weight can be a hassle if not carried out the appropriate way</li></ul>\r\n<ul><li>An ideal weight loss diet must be sustainable and must possess health benefits that can … [+3047 chars]"}, {"source": {"id": null, "name": "Bollyinside.com"}, "author": null, "title": "The EU faces the threat of a prolonged 'double pandemic' - BollyInside", "description": "Influenza has gotten back to Europe at a quicker than-expected rate this colder time of year after nearly vanishing last year, raising worries about a", "url": "https://www.bollyinside.com/news/the-eu-faces-the-threat-of-a-prolonged-double-pandemic", "urlToImage": "https://www.bollyinside.com/wp-content/uploads/2022/01/The-EU-faces-the-threat-of-a-prolonged-double-pandemic.jpg", "publishedAt": "2022-01-19T03:36:29Z", "content": "Influenza has gotten back to Europe at a quicker than-expected rate this colder time of year after nearly vanishing last year, raising worries about a drawn out twindemic with COVID-19 in the midst o… [+3672 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Nanotherapy offers ray of hope for the treatment of Type 1 diabetes - Hindustan Times", "description": "A team of researchers at Northwestern University have discovered a technique to help make immunomodulation more effective. The method used nanocarriers to re-engineer the commonly used immunosuppressant rapamycin. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/nanotherapy-offers-ray-of-hope-for-the-treatment-of-type-1-diabetes-101642557673215.html", "urlToImage": "https://images.hindustantimes.com/img/2022/01/19/1600x900/Diabetes_1641483701791_1642557728580.jpg", "publishedAt": "2022-01-19T02:14:59Z", "content": "A team of researchers at Northwestern University have discovered a technique to help make immunomodulation more effective. The method used nanocarriers to re-engineer the commonly used immunosuppress… [+7623 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "ANI", "title": "Scientists find potential diagnostic and therapeutic target for lung cancer - Hindustan Times", "description": "Chinese scientists recently reported the key role of histone acetylation-regulated long noncoding RNA termed as lysosome cell death regulator (LCDR) in tumour survival, providing a potential diagnostic and therapeutic target for lung cancer. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/scientists-find-potential-diagnostic-and-therapeutic-target-for-lung-cancer-101642557179793.html", "urlToImage": "https://images.hindustantimes.com/img/2022/01/19/1600x900/_8834a5f0-f820-11e7-95e6-04e0a17510b6_1642557235300.jpg", "publishedAt": "2022-01-19T01:56:50Z", "content": "Chinese scientists recently reported the key role of histone acetylation-regulated long noncoding RNA termed as lysosome cell death regulator (LCDR) in tumour survival, providing a potential diagnost… [+2146 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "New MRI technique could pave the way to quicker assessment of multiple sclerosis - News-Medical.Net", "description": "It is important that multiple sclerosis (MS) is diagnosed and treated as early as possible in order to delay progression of the disease.", "url": "https://www.news-medical.net/news/20220118/New-MRI-technique-could-pave-the-way-to-quicker-assessment-of-multiple-sclerosis.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2014/7/Girl_in_wheelchair-620x480.jpg", "publishedAt": "2022-01-19T00:16:00Z", "content": "It is important that multiple sclerosis (MS) is diagnosed and treated as early as possible in order to delay progression of the disease. The technique of magnetic resonance imaging (MRI) plays a key … [+3537 chars]"}, {"source": {"id": null, "name": "Express"}, "author": "Jessica Knibbs", "title": "Menopause: The three symptoms relating to your head which could indicate the condition - Express", "description": "Menopause remains a taboo subject with a lot of stigma attached. More information and understanding needs to be adhered to regarding the condition including any unusual symptoms to be aware of.", "url": "https://www.express.co.uk/life-style/health/1552230/Menopause-symptoms-headache-difficulty-concentrating-memory-problems", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1552230.jpg", "publishedAt": "2022-01-18T22:32:28Z", "content": null}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Cervical Cancer - Naperville Community Television NCTV17", "description": "Cervical cancer is an abnormal growth of cells in the lower part of the uterus.  If found early, it's one of the most treatable cancers.————————————If you en...", "url": "https://www.youtube.com/watch?v=49-4cg0Wb28", "urlToImage": "https://i.ytimg.com/vi/49-4cg0Wb28/maxresdefault.jpg", "publishedAt": "2022-01-18T19:31:05Z", "content": null}, {"source": {"id": null, "name": "Releasewire.com"}, "author": "Intermountain Healthcare", "title": "Thyroid Disorder Can Lead to Feeling Fatigued or Depressed - Digital Journal", "description": "Thyroid disorders are as common in women as breast cancer, but because many people aren't familiar with the thyroid, and since the symptoms of hypothyroidism are common, subtle and may be attributed to aging, many women don't know they have the condition. But…", "url": "http://www.releasewire.com/press-releases/thyroid-disorder-can-lead-to-feeling-fatigued-or-depressed-1352008.htm", "urlToImage": "http://media.releasewire.com/photos/show/?id=332518", "publishedAt": "2022-01-18T19:09:27Z", "content": "Salt Lake City, UT -- (ReleaseWire) -- 01/18/2022 --Thyroid disorders are as common in women as breast cancer, but because many people aren't familiar with the thyroid, and since the symptoms of hypo… [+4908 chars]"}, {"source": {"id": null, "name": "Well+Good"}, "author": "Kara Jillian Brown", "title": "Vitamin C Shouldn’t Be in Every Skin-Care Routine—Here’s How To Know if You Should Skip It - Well+Good", "description": "While vitamin C is a great ingredient, it's not suitable for everyone's skin. Learn about niacinamide as a vitamin C alternative.", "url": "https://www.wellandgood.com/vitamin-c-alternative/", "urlToImage": "https://www.wellandgood.com/wp-content/uploads/2022/01/vitc.jpg", "publishedAt": "2022-01-18T18:03:11Z", "content": null}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Long Covid-19 symptoms that no one is talking about; signs to watch out for. Read here - Mint", "description": "We have no data yet on what proportion of infections with Omicron... end up with Long COVID, an expert said", "url": "https://www.livemint.com/science/health/long-covid-19-symptoms-that-no-one-is-talking-about-signs-to-watch-out-for-read-here-11642501670010.html", "urlToImage": "https://images.livemint.com/img/2022/01/18/600x338/FINLAND-CLIMATE-COFFEE-4_1642504971108_1642504990817.jpg", "publishedAt": "2022-01-18T16:12:16Z", "content": "Complications related to COVID-19 infections can continue for months after you have recovered from the disease. This holds true even for patients who have suffered mild to moderate infections.\r\nAnd e… [+2460 chars]"}, {"source": {"id": null, "name": "Daily Mail"}, "author": "Ian Randall", "title": "Health: Experts eliminate HIV in 40 per cent of mice with technique that forces virus out of hiding - Daily Mail", "description": "In laboratory tests on 10 mice the approach was found to eliminate the virus in 40 per cent of cases, the team from the University of California Los Angeles said.", "url": "https://www.dailymail.co.uk/sciencetech/article-10414345/Health-Experts-eliminate-HIV-40-cent-mice-technique-forces-virus-hiding.html", "urlToImage": "https://i.dailymail.co.uk/1s/2022/01/18/13/53070281-0-image-a-4_1642513120452.jpg", "publishedAt": "2022-01-18T15:21:33Z", "content": "A 'kick and kill' strategy that forces the human immunodeficiency virus out of cells leaving it vulnerable to injections of natural killer cells offers hope of an HIV cure.\r\nIn laboratory tests on 10… [+6143 chars]"}, {"source": {"id": null, "name": "Influencive"}, "author": "Joshua Heatherington", "title": "Are Clear Aligners Better than Braces? - Influencive", "description": "Whether you are an adult wanting to get your teeth straightened or need an opinion for your child about which type of braces are the best, this article is for you! One of the most", "url": "https://www.influencive.com/are-clear-aligners-better-than-braces/", "urlToImage": "https://www.influencive.com/wp-content/uploads/2022/01/teeth-dentist-white-stockpack-pixabay-scaled.jpg", "publishedAt": "2022-01-18T15:07:32Z", "content": "Whether you are an adult wanting to get your teeth straightened or need an opinion for your child about which type of braces are the best, this article is for you! One of the most common questions th… [+8290 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Sleeping with the TV on is bad for your brain - WCNC", "description": "As it turns out, sleeping with the TV on is bad for your sleeping habits. Researchers scanned the brains of people who went to sleep with the TV on and monit...", "url": "https://www.youtube.com/watch?v=5OIx6nv0ZMM", "urlToImage": "https://i.ytimg.com/vi/5OIx6nv0ZMM/maxresdefault.jpg", "publishedAt": "2022-01-18T11:35:26Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET Online", "title": "Cervical, Other Cancers Can Be Caused Due To HPV Infection. Things To Know - Economic Times", "description": "Human papillomavirus is a group of viruses that are sexually transmitted. The high-risk HPVs can cause cancer.", "url": "https://economictimes.indiatimes.com/magazines/panache/cervical-other-cancers-can-be-caused-due-to-hpv-infection-things-to-know/slideshow/88973205.cms", "urlToImage": "https://img.etimg.com/thumb/msid-88973224,width-900,height-1200,resizemode-6.cms", "publishedAt": "2022-01-18T10:37:59Z", "content": "When the infection with high-risk HPVs stay in certain parts of the body, it can infect cells in that region. Beside cervical, the other HPV-related diseases are oropharyngeal cancer, anal cancer, pe… [+30 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Bhagyashree Recommends Pomegranates For Skin Health And More - NDTV Food", "description": "Pomegranates can also help to deal with post-menopausal problems like night sweats and hot flashes.", "url": "https://food.ndtv.com/food-drinks/bhagyashree-explains-why-pomegranates-are-an-important-part-of-the-daily-diet-2714667", "urlToImage": "https://c.ndtvimg.com/2021-12/od8dnl28_bhagyashree_650x400_18_December_21.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-01-18T09:53:13Z", "content": "We can't stress enough about the importance of fruits in the daily diet. From providing essential micronutrients to cleansing the body with their fibre content, fruits are one of the best food items … [+2570 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Eye Health: Berries May Help Improve Vision - 3 Ways To Include Berries In Your Diet - NDTV Food", "description": "Berries for eye-health: Berries - such as strawberries, raspberries, blueberries etc - are loaded with antioxidants and vitamin C that are known to help our eyes relax.", "url": "https://food.ndtv.com/health/eye-health-berries-may-help-improve-vision-3-ways-to-include-berries-in-your-diet-2714634", "urlToImage": "https://c.ndtvimg.com/2019-05/4t1t12b8_eyes_625x300_16_May_19.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=675", "publishedAt": "2022-01-18T09:41:47Z", "content": "Poor eyesight is a common problem these days. We tend to blame it on the increased usage of mobile phones, computers and other electronic devices. We agree these factors do play a major role in affec… [+3356 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "Studies debate over effectiveness of hydroxychloroquine - Daijiworld.com", "description": "New Delhi, Jan 18 (IANS): Once touted as a cure for Covid, hydroxychloroquine (HCQ), the anti-malaria drug, is renewing interest as a potential treatment for the infectious disease and particularly the new fast spreading Omicron variant.\r\nTwo recent studies, …", "url": "https://www.daijiworld.com/news/newsDisplay?newsID=916584", "urlToImage": "https://daijiworld.ap-south-1.linodeobjects.com/Linode/images3/rayan_180122_Health1.jpg", "publishedAt": "2022-01-18T09:33:50Z", "content": "New Delhi, Jan 18 (IANS): Once touted as a cure for Covid, hydroxychloroquine (HCQ), the anti-malaria drug, is renewing interest as a potential treatment for the infectious disease and particularly t… [+1851 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Do you have diabetes? This is the best time to have fruits - Hindustan Times", "description": "Is there a right time to eat fruits for people with diabetes? A nutritionist opens up. | Health", "url": "https://www.hindustantimes.com/lifestyle/do-you-have-diabetes-this-is-the-best-time-to-have-fruits-101642497272436.html", "urlToImage": "https://images.hindustantimes.com/img/2022/01/18/1600x900/fruit_1638805011586_1642497314189.jpg", "publishedAt": "2022-01-18T09:20:26Z", "content": "People with diabetes often struggle to make the right food choices. Picking foods that do not play havoc with their blood glucose levels is essential for diabetes management. Foods with low GI (glyca… [+1867 chars]"}, {"source": {"id": null, "name": "EdexLive"}, "author": "Edex Live", "title": "BHU scientists find cure for chronic wounds. Here's how they managed it - EdexLive", "description": "The team led by Prof Gopal Nath of the department of Microbiology said that wounds that took months and years to heal, could now be cured in days or months", "url": "https://www.edexlive.com/news/2022/jan/18/bhu-scientists-find-cure-for-chronic-wounds-heres-how-they-managed-it-26943.html", "urlToImage": "https://images.edexlive.com/uploads/user/imagelibrary/2022/1/18/w600X390/Copy_of_Copy_of_Copy_of_100_cut-off.png", "publishedAt": "2022-01-18T07:40:00Z", "content": "A team of scientists from the Banaras Hindu University (BHU) have found a cure for those suffering from chronic wounds, particularly with diabetic foot ulcers. The team led by Prof Gopal Nath of the … [+3004 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "ANI", "title": "Introducing lifestyle interventions in preschool lowers heart disease risk - Devdiscourse", "description": "Implementing school-based programs aimed at teaching healthy cardiovascular health habits as early as preschool can achieve lasting lifestyle changes in children.", "url": "https://www.devdiscourse.com/article/lifestyle/1887157-introducing-lifestyle-interventions-in-preschool-lowers-heart-disease-risk", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/18_01_2022_06_50_45_0444212.jpg?width=920&format=jpeg", "publishedAt": "2022-01-18T06:50:46Z", "content": "Implementing school-based programs aimed at teaching healthy cardiovascular health habits as early as preschool can achieve lasting lifestyle changes in children. The findings of the study were publi… [+5411 chars]"}, {"source": {"id": null, "name": "Devdiscourse"}, "author": "PTI", "title": "Time is muscle, do not delay heart failure treatment - Devdiscourse", "description": "With the numbers growing at a fast pace, it is crucial to discuss heart failure.Beat Heart Failure, an initiative by The Times of India in partnership with Novartis is a campaign that aims to spread awareness about heart failure, its causes, prevention, treat…", "url": "https://www.devdiscourse.com/article/health/1887154-time-is-muscle-do-not-delay-heart-failure-treatment", "urlToImage": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/24_05_2021_06_29_15_3970784.jpg?width=920&format=jpeg", "publishedAt": "2022-01-18T06:44:09Z", "content": "Our heart is the main organ in the circulatory system which pumps blood to the whole body. Due to various reasons, such as diabetes and hypertension, it becomes weak and unable to function. Heart fai… [+8127 chars]"}, {"source": {"id": null, "name": "The Asean Post"}, "author": null, "title": "'Deltacron': Worrying About New Variants Merging - The ASEAN Post", "description": "Getting vaccinated against COVID-19 and influenza is the best way to protect yourself from ‘Flurona’.", "url": "https://theaseanpost.com/article/deltacron-worrying-about-new-variants-merging", "urlToImage": "https://theaseanpost.com/sites/default/files/styles/articles_style_image/public/2022-01/8PM%20TUE%2018012022.jpg?itok=8UOPXfAi", "publishedAt": "2022-01-18T06:09:31Z", "content": "During the past week a new COVID-19 variant had been discovered in Cyprus. Dubbed Deltacron, it was said to be responsible for a series of hospitalisations in the country.\r\nThe thought of a new varia… [+7590 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": null, "title": "Unlikely people will live with masks on forever: Fauci on 'new normal' - EastMojo", "description": "New Delhi/Davos: Warning that the COVID-19 pandemic is far from over and Omicron would not be the last variant, global health experts on Monday said a lot", "url": "https://www.eastmojo.com/news/2022/01/18/unlikely-people-will-live-with-masks-on-forever-fauci-on-new-normal/", "urlToImage": "https://www.eastmojo.com/wp-content/uploads/2021/05/facemask-5059928_1280.jpg", "publishedAt": "2022-01-18T04:45:00Z", "content": "New Delhi/Davos: Warning that the COVID-19 pandemic is far from over and Omicron would not be the last variant, global health experts on Monday said a lot would depend on transmissibility and severit… [+2725 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "COVID-19: New CORBEVAX vaccine could help immunize low-income countries - Global News", "description": "Poorer nations are still struggling to fully immunize people against COVID-19, as they grapple with expensive vaccine patents and complex production. Accordi...", "url": "https://www.youtube.com/watch?v=XWs14plBOwQ", "urlToImage": "https://i.ytimg.com/vi/XWs14plBOwQ/maxresdefault.jpg", "publishedAt": "2022-01-18T03:00:13Z", "content": null}]}