{"status": "ok", "totalResults": 63, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Doctor: Worrisome variants could follow omicron - AP Archive", "description": "(12 Jan 2022) FOR CLEAN VERSION SEE STORY NUMBER: 4361081  Scientists warn that omicron's whirlwind spread across the globe practically ensures it won't be t...", "url": "https://www.youtube.com/watch?v=GlVOsUZ0AfM", "urlToImage": "https://i.ytimg.com/vi/GlVOsUZ0AfM/hqdefault.jpg", "publishedAt": "2022-01-17T22:46:29Z", "content": null}, {"source": {"id": null, "name": "Medscape"}, "author": "Pauline Anderson", "title": "Stroke-Related Restless Legs Syndrome an 'Emerging Entity' - Medscape", "description": "Researchers uncover patterns that could help clinicians diagnose this common neurologic condition after stroke.", "url": "https://www.medscape.com/viewarticle/966725", "urlToImage": "https://img.medscape.com/thumbnail_library/Medscape_News.jpg", "publishedAt": "2022-01-17T21:43:19Z", "content": "More data support the concept of stroke-related restless legs syndrome as an \"emerging entity,\" investigators report in a new study.\r\nNew research has identified the lenticulostriate and ventral brai… [+4418 chars]"}, {"source": {"id": null, "name": "Greater Kashmir"}, "author": "NAZIR GANAIE", "title": "Omicron infects kids with mild symptoms, say doctors - Greater Kashmir", "description": null, "url": "https://www.greaterkashmir.com/todays-paper/front-page/omicron-infects-kids-with-mild-symptoms-say-doctors", "urlToImage": "https://gumlet.assettype.com/greaterkashmir%2F2022-01%2Fb041a78b-e00e-4c9d-ac2d-39e8811cd0cb%2FScreenshot__1165_.png?w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-01-17T20:03:59Z", "content": "Children are not vaccinated hence they are more vulnerable and tend to have more symptoms. Children were less exposed to COVID during previous waves since they have been mostly staying home and now s… [+741 chars]"}, {"source": {"id": null, "name": "Abplive.com"}, "author": "PTI", "title": "Israel study: 4th vaccine shows limited results with omicron - ABP Live", "description": "Jerusalem, Jan 17 (AP): An Israeli hospital on Monday said preliminary research indicates a fourth dose of the coronavirus vaccine provides only limited defence against the omicron variant that is raging around the worl.", "url": "https://news.abplive.com/news/world/israel-study-4th-vaccine-shows-limited-results-with-omicron-1507045", "urlToImage": "https://feeds.abplive.com/onecms/images/uploaded-images/2021/07/02/auto-publish-thumbnail-4.jpg?impolicy=abp_cdn&imwidth=1200&imheight=628", "publishedAt": "2022-01-17T19:45:03Z", "content": "Jerusalem, Jan 17 (AP): An Israeli hospital on Monday said preliminary research indicates a fourth dose of the coronavirus vaccine provides only limited defence against the omicron variant that is ra… [+3034 chars]"}, {"source": {"id": null, "name": "Dailypioneer.com"}, "author": "The Pioneer", "title": "E-cigarette users who test positive are more likely to experience Covid symptoms - Daily Pioneer", "description": "Users of electronic cigarettes who get afflicted with Covid-19 have a higher frequency of experiencing Covid symptoms such as nausea and vomiting, diarrhea, and loss of the sense of smell or taste, compared to non-vapers, according to new research from Mayo C…", "url": "https://www.dailypioneer.com/2022/india/e-cigarette-users-who-test-positive-are-more-likely-to-experience-covid-symptoms.html", "urlToImage": "https://www.dailypioneer.com/images/logo.jpg", "publishedAt": "2022-01-17T19:16:15Z", "content": "Users of electronic cigarettes who get afflicted with Covid-19 have a higher frequency of experiencing Covid symptoms such as nausea and vomiting, diarrhea, and loss of the sense of smell or taste, c… [+2578 chars]"}, {"source": {"id": null, "name": "Dailypioneer.com"}, "author": "The Pioneer", "title": "Docyard | Lung infections can be dangerous - Daily Pioneer", "description": "Lungs play an important role in our body hence it is necessary to prioritize lung health. Very often we tend to take them for granted; however, like other parts of the body, they age with time. They lose their strength and become less flexible which results i…", "url": "https://www.dailypioneer.com/2022/pioneer-health/docyard---lung-infections-can-be-dangerous.html", "urlToImage": "https://www.dailypioneer.com/uploads/2022/story/images/big/docyard---lung-infections-can-be-dangerous-2022-01-18.jpg", "publishedAt": "2022-01-17T19:01:58Z", "content": "Lungs play an important role in our body hence it is necessary to prioritize lung health. Very often we tend to take them for granted; however, like other parts of the body, they age with time. They … [+3474 chars]"}, {"source": {"id": null, "name": "Newsconcerns.com"}, "author": "Frankie Davies", "title": "High blood pressure: Drinking hibiscus tea could lower hypertension - newsconcerns", "description": "Residing in the high blood pressure category puts you at significant risk of heart attacks, strokes, dementia, and aneurysms. You can, however, lower your blood pressure reading and reduce your risk of disease by simply switching on the kettle and si", "url": "https://newsconcerns.com/high-blood-pressure-drinking-hibiscus-tea-could-lower-hypertension/", "urlToImage": "https://cdn.images.express.co.uk/img/dynamic/11/750x445/1551468.jpg", "publishedAt": "2022-01-17T17:57:31Z", "content": "Residing in the high blood pressure category puts you at significant risk of heart attacks, strokes, dementia, and aneurysms. You can, however, lower your blood pressure reading and reduce your risk … [+3043 chars]"}, {"source": {"id": null, "name": "The Conversation Africa"}, "author": "Glen Pyle, Jennifer H Huang", "title": "Myocarditis: COVID-19 is a much bigger risk to the heart than vaccination - The Conversation CA", "description": "Myocarditis following COVID-19 vaccination is rare, and the risk is much smaller than the risks of cardiac injury linked to COVID-19 itself.", "url": "https://theconversation.com/myocarditis-covid-19-is-a-much-bigger-risk-to-the-heart-than-vaccination-174580", "urlToImage": "https://images.theconversation.com/files/440923/original/file-20220114-19-c1e1zo.jpg?ixlib=rb-1.1.0&rect=20%2C1101%2C6785%2C3387&q=45&auto=format&w=1356&h=668&fit=crop", "publishedAt": "2022-01-17T17:34:19Z", "content": "The heart has played a central role in COVID-19 since the beginning. Cardiovascular conditions are among the highest risk factors for hospitalization. A significant number of patients hospitalized wi… [+6655 chars]"}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "PTI", "title": "Unlikely that people will move around with masks on forever: Fauci at Davos Summit - The New Indian Express", "description": "He also said there is a great deal of 'disinformation' around and that is entirely destructive to a comprehensive public health endeavour.", "url": "https://www.newindianexpress.com/world/2022/jan/17/unlikely-that-people-will-move-around-with-masks-on-forever-fauci-at-davos-summit-2407886.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2021/12/6/w600X390/Dr_Anthony_Fauci_AP.jpg", "publishedAt": "2022-01-17T16:52:00Z", "content": "NEW DELHI/DAVOS: Warning that the COVID-19 pandemic is far from over and Omicron would not be the last variant, global health experts on Monday said a lot would depend on transmissibility and severit… [+2541 chars]"}, {"source": {"id": null, "name": "The Guardian"}, "author": "Natalie Parletta", "title": "How to move: with endometriosis - The Guardian", "description": "Regular exercise may help reduce the pain, inflammation and risk of getting endometriosis, say experts. But here are some things to consider", "url": "https://amp.theguardian.com/lifeandstyle/2022/jan/18/how-to-move-with-endometriosis", "urlToImage": null, "publishedAt": "2022-01-17T16:31:00Z", "content": "How to moveRegular exercise may help reduce the pain, inflammation and risk of getting endometriosis, say experts. But here are some things to consider\r\n<ul><li>In the How to move series, experts off… [+4547 chars]"}, {"source": {"id": null, "name": "Dtnext.in"}, "author": "Mirudhula", "title": "Cure for Omicron: Is natural immunity better than vaccine? - DTNext", "description": "As Omicron outbreaks take over, many people are asking: Could the immunity you get from a COVID infection be the best protection against the virus, especially as it continues to mutate? We looked at the latest science", "url": "https://www.dtnext.in/amp/News/World/2022/01/18044518/1339240/Cure-for-Omicron-Is-natural-immunity-better-than-vaccine.vpf", "urlToImage": "https://img.dtnext.in/Articles/2022/Jan/202201180445186217_Cure-for-Omicron-Is-natural-immunity-better-than-vaccine_SECVPF.gif", "publishedAt": "2022-01-17T16:30:00Z", "content": "As Omicron outbreaks take over, many people are asking: Could the immunity you get from a COVID infection be the best protection against the virus, especially as it continues to mutate? We looked at … [+6272 chars]"}, {"source": {"id": "al-jazeera-english", "name": "Al Jazeera English"}, "author": "Al Jazeera", "title": "‘Deltacron’: Should we worry about new COVID-19 variants merging? - Al Jazeera English", "description": "Experts say two variants can cross over to form a recombinant version of both variants but this has not happened yet.", "url": "https://www.aljazeera.com/features/2022/1/17/deltacron-and-flurona-should-we-worry-about-covid-19-variant", "urlToImage": "https://www.aljazeera.com/wp-content/uploads/2022/01/Doctors-note-deltacron.png?resize=1200%2C630", "publishedAt": "2022-01-17T16:13:42Z", "content": "During the past week, my inbox has been flooded with messages telling me a new COVID-19 variant had been discovered in Cyprus. Dubbed Deltacron, it was said to be responsible for a series of hospital… [+7802 chars]"}, {"source": {"id": null, "name": "Medical Xpress"}, "author": "Heather Carlson Kehren", "title": "Lifestyle changes can be critical for kidney transplant patients' long-term survival - Medical Xpress", "description": "Cancer, infections and heart disease pose the greatest risk to kidney transplant recipients ― not organ rejection ― according to a recently published Mayo Clinic study. Researchers discovered that recipient death due to factors other than organ rejection is t…", "url": "https://medicalxpress.com/news/2022-01-lifestyle-critical-kidney-transplant-patients.html", "urlToImage": "https://scx2.b-cdn.net/gfx/news/hires/2021/kidney-1.jpg", "publishedAt": "2022-01-17T16:06:06Z", "content": "Cancer, infections and heart disease pose the greatest risk to kidney transplant recipients not organ rejection according to a recently published Mayo Clinic study. Researchers discovered that recipi… [+3179 chars]"}, {"source": {"id": null, "name": "Ahmedabadmirror.com"}, "author": null, "title": "Phytochemicals in Himalayan plant Buransh can fight Covid virus: Researchers - Ahmedabad Mirror", "description": "The findings of the research team have been recently published in the journal &#39;Biomolecular Structure and Dynamic&#39;s&#39;. The research was led by Dr Shyam Kumar Masakapalli, Associate Professor, BioX Centre, School of Basic Science, IIT Mandi, Dr Ranj…", "url": "https://ahmedabadmirror.com/phytochemicals-in-himalayan-plant-buransh-can-fight-covid-virus-researchers/81818177.html", "urlToImage": "https://ngs-space1.sgp1.digitaloceanspaces.com/am/uploads/mediaGallery/image/1642434780573.jpg-org", "publishedAt": "2022-01-17T16:02:52Z", "content": "The findings of the research team have been recently published in the journal 'Biomolecular Structure and Dynamic's'. The research was led by Dr Shyam Kumar Masakapalli, Associate Professor, BioX Cen… [+3173 chars]"}, {"source": {"id": null, "name": "Codelist.biz"}, "author": null, "title": "Acute, long or chronic Covid, what will be yours? - Code List", "description": "He was driving along the side of Periférico when he realized that he had no idea where he was going, or where he was driving. It’s not that he was lost, he just felt that something in his brain made him feel confused. Survival instinct made him turn on his bl…", "url": "https://codelist.biz/2022/01/17/acute-long-or-chronic-covid-what-will-be-yours/", "urlToImage": "https://www.eluniversal.com.mx/sites/default/files/2022/01/17/preuba-covid.jpg", "publishedAt": "2022-01-17T14:51:49Z", "content": "He was driving along the side of Periférico when he realized that he had no idea where he was going, or where he was driving. It’s not that he was lost, he just felt that something in his brain made … [+10550 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "8 best exercises for women - Times of India", "description": "Best exercises for women: With weight gain and obesity on rise, indulgence in physical activities like exercising seems to be the only way to stop severe complications from happening. Women, especially those who have a 8-9 hours-job, have started feeling the …", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/8-best-exercises-for-women/photostory/88953009.cms", "urlToImage": "https://static.toiimg.com/photo/88953130.cms", "publishedAt": "2022-01-17T14:30:00Z", "content": "With weight gain and obesity on rise, indulgence in physical activities like exercising seems to be the only way to stop severe complications from happening. Women, especially those who have a 8-9 ho… [+723 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Covid-19 Pandemic May Become an Endemic in 2022 - News18", "description": "Experts believe that Covid-19 may follow a seasonal pattern, with cases proliferating during the winters and outbreaks of the disease becoming local.", "url": "https://www.news18.com/news/lifestyle/covid-19-pandemic-may-become-an-endemic-in-2022-4667048.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/01/xian-lockdown-reuters-164198536916x9.jpg", "publishedAt": "2022-01-17T14:24:39Z", "content": "Its been nearly two years since the Covid-19 pandemic hit the world hard. Unfortunately, even after two years, we are still grappling with the evil virus which keeps transforming and antigenically ev… [+2280 chars]"}, {"source": {"id": null, "name": "Deccan Herald"}, "author": "IANS", "title": "Can a person be infected with Omicron variant twice? Here's what experts say - Deccan Herald", "description": "While Omicron is known to cause Covid re-infection, there is no strong evidence yet in the favour of a person being affected with the vaccine dodging strain again, said Indian health experts here on Monday. However, they also did not rule out such a possibili…", "url": "https://www.deccanherald.com/science-and-environment/can-a-person-be-infected-with-omicron-variant-twice-heres-what-experts-say-1072015.html", "urlToImage": "https://www.deccanherald.com/sites/dh/files/articleimages/2022/01/17/covid-19-49612571280-1072015-1642431135.jpg", "publishedAt": "2022-01-17T14:22:35Z", "content": "While Omicron is known to cause Covid re-infection, there is no strong evidence yet in the favour of a person being affected with the vaccine dodging strain again, said Indian health experts here on … [+3652 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Cervical Cancer Awareness Month: Can the virus be transmitted non-sexually? - Hindustan Times", "description": "Cervical cancer is the fourth most common cancer type for women, with the highest incidence and mortality rates. Read on to know all about its causes, treatment and expert opinion on whether it can be transmitted non-sexually | Health", "url": "https://www.hindustantimes.com/lifestyle/health/cervical-cancer-awareness-month-can-the-virus-be-transmitted-nonsexually-101642426298961.html", "urlToImage": "https://images.hindustantimes.com/img/2022/01/17/1600x900/FJEld2_XwAIvH5C_1642428843901_1642428862290.jpg", "publishedAt": "2022-01-17T14:17:34Z", "content": "January is observed as the Cervical Cancer Awareness Month which is represented by a teal coloured ribbon and according to the World Health Organization, cervical cancer is the second most common cau… [+4259 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Europe reports a rising cases of severe flu viruses, concerns over a prolonged 'Twindemic' | WION - WION", "description": "Influenza has returned to Europe raising concerns about a prolonged “twindemic”, that is the prospect of a severe flu season happening alongside an increase ...", "url": "https://www.youtube.com/watch?v=k6S9jJKx8Yg", "urlToImage": "https://i.ytimg.com/vi/k6S9jJKx8Yg/maxresdefault.jpg", "publishedAt": "2022-01-17T14:09:12Z", "content": null}, {"source": {"id": null, "name": "The Times of Israel"}, "author": null, "title": "High-fat diet may restore cognitive function lost in brain injury – Israeli study - The Times of Israel", "description": "More than half of the lost cognitive ability returns after mice are given ketogenic diet for two months, Tel Aviv University scientists report in peer-reviewed research", "url": "https://www.timesofisrael.com/high-fat-diet-may-restore-cognitive-function-lost-in-brain-injury-israeli-study/", "urlToImage": "https://static.timesofisrael.com/www/uploads/2022/01/iStock-1130415473-1024x640.jpg", "publishedAt": "2022-01-17T13:50:34Z", "content": "A high-fat, low-carb nutrition regime known as the ketogenic diet significantly reduces the cognitive effects of brain injury in mice, and may do the same for humans, according to Israeli scientists.… [+1962 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Kirti Pandey", "title": "How to cleanse your lungs: 7 easy, safe, doable detox DIY steps - Times Now", "description": "In Sanskrit \"Prana\" means life itself. And breathing is also called Prana. Oxygen is called Prana-Vayu -- the air vital to living. And breathing exercises are called Pranayam. That should tell you how vital are our lungs that pull off this basic yet most impo…", "url": "https://www.timesnownews.com/health/article/how-to-cleanse-your-lungs-7-easy-safe-doable-detox-diy-steps-breath-respiratory-cough-cold-copd/850298", "urlToImage": "https://imgk.timesnownews.com/story/healthier_lungs_cleanse_detox.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2022-01-17T13:34:00Z", "content": "<ul><li>Breathing s such an important part of our body's functions that any trouble with that is likely to send most of us immediately into panic mode.</li></ul>\r\nThe air we breathe can be contaminat… [+7010 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Stressed With Aging Skin? Here Is How You Can Protect It With These Easy Steps - News18", "description": "Foods, especially those with high anti-inflammatory and antioxidant properties, can improve the elasticity of the skin.", "url": "https://www.news18.com/news/lifestyle/stressed-with-aging-skin-here-is-how-you-can-protect-it-with-these-easy-steps-4667855.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/01/untitled-design-8-13-164242571916x9.png", "publishedAt": "2022-01-17T13:20:00Z", "content": "Aging skin looks thin and pale. The changes in skin are related to many factors such as skin exposure to elements of nature, nutrition, environment-related factors, and many others. The sun-exposed a… [+1969 chars]"}, {"source": {"id": null, "name": "Factly.in"}, "author": "Dilip Kumar Sripada", "title": "No, Bill Gates did not demand the withdrawal of COVID-19 vaccines - Factly", "description": "Bill Gates did not demand the withdrawal of COVID-19 vaccines; the article reporting this information is a satirical one.", "url": "https://factly.in/no-bill-gates-did-not-demand-the-withdrawal-of-covid-19-vaccines/", "urlToImage": "https://factly.in/wp-content/uploads//2022/01/Bill-Gates-demands-withdrawl-of-all-COVID-19-vaccines-Thumbnail.jpg", "publishedAt": "2022-01-17T13:17:28Z", "content": "A news report is being widely shared on social media claiming that Microsoft co-founder Bill Gates had called for the withdrawal of all COVID-19 vaccines. This article reported that in a recent 19-mi… [+2921 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Covid-19 Infection Risk May Increase Due To Stress, Reckons New Study - News18", "description": "This study claims that the severity of the coronavirus infection also reflects the mental state of the patient.", "url": "https://www.news18.com/news/lifestyle/covid-19-infection-risk-may-increase-due-to-stress-reckons-new-study-4667816.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/01/untitled-design-5-29-164242516716x9.png", "publishedAt": "2022-01-17T13:14:41Z", "content": "With the return of spike in COVID-19 infections, lockdowns and restrictions on movement have also regained prominence in our life. Organisations that had started working from offices are back to work… [+2182 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Follow These Tips to Sleep Better at Night - News18", "description": "All this happens due to some habits related to our lifestyle and food habits.", "url": "https://www.news18.com/news/lifestyle/follow-these-tips-to-sleep-better-at-night-4667822.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/01/untitled-design-6-22-164242534016x9.png", "publishedAt": "2022-01-17T13:14:00Z", "content": "Sleep has a direct effect on our health. If we are not able to sleep properly, then apart from health, our heart and mind are also affected badly. Lack of good sleep means we do not feel refreshed ev… [+2040 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "5 Fruits to Control Cholesterol Levels in Your Body - News18", "description": "Fruits are rich in antioxidants and fibre which help in controlling cholesterol levels.", "url": "https://www.news18.com/news/lifestyle/5-fruits-to-control-cholesterol-levels-in-your-body-4667756.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/01/studio_project-13-6-164242442916x9.jpg", "publishedAt": "2022-01-17T13:00:41Z", "content": "High cholesterol levels are said to be a major reason behind heart problems. A change in diet and regular consumption of a few fruits will help in reducing cholesterol levels. This will also improve … [+1485 chars]"}, {"source": {"id": "medical-news-today", "name": "Medical News Today"}, "author": "Debbie Lambert", "title": "Relationship breakdown increases inflammation, but only in men - Medical News Today", "description": "A study investigating middle-aged adults in Denmark found that living alone and relationship breakdowns are linked to higher levels of inflammation in men.", "url": "https://www.medicalnewstoday.com/articles/living-alone-and-divorce-linked-to-inflammation-in-men", "urlToImage": "https://post.medicalnewstoday.com/wp-content/uploads/sites/3/2022/01/man-alone-inflamation-thumb.jpg", "publishedAt": "2022-01-17T12:51:32Z", "content": "<ul><li>Divorce or relationship breakups are associated with poorer health in men.</li><li>A new study looking at middle-aged adults in Denmark found that living alone and experiencing more relations… [+6506 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Can hemp help fight Covid-19? - BusinessLIVE", "description": "Cannabis compounds prevented the virus that causes Covid-19 from penetrating healthy human cells, according to a laboratory study published in the Journal of...", "url": "https://www.youtube.com/watch?v=yMWsOKGeZgA", "urlToImage": "https://i.ytimg.com/vi/yMWsOKGeZgA/hqdefault.jpg", "publishedAt": "2022-01-17T12:27:13Z", "content": null}, {"source": {"id": null, "name": "LatestLY"}, "author": "ANI", "title": "Health News | Study Finds That Gut Can Sense the Difference Between Real Sugar and Artificial Sweetener - LatestLY", "description": "Get latest articles and stories on Health at LatestLY. A new research study, led by Diego Bohorquez, an associate professor of medicine and neurobiology in the Duke University School of Medicine shed light on the cells in one's intestines that could distingui…", "url": "https://www.latestly.com/agency-news/health-news-study-finds-that-gut-can-sense-the-difference-between-real-sugar-and-artificial-sweetener-3264106.html", "urlToImage": "https://st1.latestly.com/wp-content/uploads/2022/01/Untitledsgfdsf1320220117120236-588x441.jpg", "publishedAt": "2022-01-17T12:16:21Z", "content": "Durham (North Carolina) [US], January 17 (ANI): A new research study, led by Diego Bohorquez, an associate professor of medicine and neurobiology in the Duke University School of Medicine shed light … [+4575 chars]"}, {"source": {"id": null, "name": "Well+Good"}, "author": "Kells McPhillips", "title": "Why Does Exercise Improve Brain Health as You Age? Scientists Just Unlocked a Major Key To Finding Out - Well+Good", "description": "Two words: protective proteins.", "url": "https://www.wellandgood.com/exercise-brain-health-protein-study/", "urlToImage": "https://www.wellandgood.com/wp-content/uploads/2022/01/GettyImages-exercise-brain-health-protein-study-tomazl.jpg", "publishedAt": "2022-01-17T12:08:56Z", "content": null}, {"source": {"id": null, "name": "Deseret News"}, "author": "Herb Scribner", "title": "Omicron variant symptoms: The top 14 symptoms in one chart - Deseret News", "description": "What are the top COVID-19 symptoms from the omicron variant of coronavirus? What are the top omicron variant symptoms?", "url": "https://www.deseret.com/coronavirus/2022/1/17/22884046/omicron-variant-symptoms-top-14-symptoms-chart-graphic", "urlToImage": "https://cdn.vox-cdn.com/thumbor/TrW-qpHWrPg4YkOzkJlAtsM0kyY=/0x215:3000x1786/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/23144975/Omicron_6.jpg", "publishedAt": "2022-01-17T12:00:00Z", "content": "The omicron variant has been spreading for more than a month now, which is more than enough time for people to report their omicron variant symptoms.\r\nWhat to know: Business Insider used data from th… [+1414 chars]"}, {"source": {"id": null, "name": "Republic World"}, "author": "Apoorva Kaul", "title": "US: COVID hospitalisation rate for children reaches record highs amid Omicron surge - Republic World", "description": "Hospitalisations among children have witnessed a record rise since the time CDC started tracking the number of hospital admissions in August 2020.", "url": "https://www.republicworld.com/world-news/us-news/us-covid-hospitalisation-rate-for-children-reaches-record-highs-amid-omicron-surge-articleshow.html", "urlToImage": "https://img.republicworld.com/republic-prod/stories/promolarge/xhdpi/6azeu2v5o5es6qdh_1642415826.jpeg", "publishedAt": "2022-01-17T11:14:00Z", "content": "Amid the rise in COVID-19 cases in the United States, hospitalisation among children due to the virus has reached the highest level since the beginning of the pandemic. The new revelation regarding t… [+2493 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Covid-19: How long should women wait before planning pregnancy after recovery? - The Indian Express", "description": "Experts opine that while vaccines are not full-proof prevention, they certainly reduce the possibilities of acquiring the infection, its severity and hence the complications.", "url": "https://indianexpress.com/article/lifestyle/health/when-plan-pregnancy-covid-19-recovery-vaccination-7716314/", "urlToImage": "https://images.indianexpress.com/2021/11/GettyImages-pregnancy-test-1200.jpg", "publishedAt": "2022-01-17T11:00:28Z", "content": "Covid-19 affects every individual in a different way, and is seen to be more severe in people with co-morbidies along with pregnant women. Health authorities, including the Centers for Disease Contro… [+5171 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "How second Covid wave symptoms differ from third wave: Skin rashes, Loss of appetite, and other symptoms - Mint", "description": "The three major symptoms that Covid infected patients exhibited in the past two years were - high temperature, continuous cough, and loss or change of sense of smell or taste.", "url": "https://www.livemint.com/news/india/how-second-covid-wave-symptoms-differ-from-third-wave-skin-rashes-loss-of-appetite-and-other-symptoms-11642414216224.html", "urlToImage": "https://images.livemint.com/img/2022/01/17/600x338/Delhi_Covid-19__1642404789394_1642414254327.jpg", "publishedAt": "2022-01-17T10:41:58Z", "content": "The coronavirus pandemic has resurged globally and newer variants have been detected. People have been thrown back to lockdown like situations and curfew in order to combat the rapid spread of Covid-… [+2973 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "IANS", "title": "Covid: Some people remain infectious even after 10 days - Zee News", "description": "One in 10 people may still be infectious and can potentially spread the Covid virus even after the 10 day quarantine period, according to new research. The study, led by the University of Exeter in the UK, used a newly-adapted test which can detect whether th…", "url": "https://zeenews.india.com/health/covid-some-people-remain-infectious-even-after-10-days-2428561", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/01/17/1006186-covid.png", "publishedAt": "2022-01-17T09:38:48Z", "content": "London: One in 10 people may still be infectious and can potentially spread the Covid virus even after the 10 day quarantine period, according to new research.\r\nThe study, led by the University of Ex… [+1795 chars]"}, {"source": {"id": null, "name": "Mybigplunge.com"}, "author": "Nandika Chand", "title": "SARS-CoV-2 virus can make blood sugar control worse in the short-term. - Plunge Daily", "description": "SARS-CoV-2 virus can make blood sugar control worse in the short-term and can throw people with diabetes into a very dangerous blood sugar state, says Dr Heather Moday, a board-certified allergist, immunologist and functional medicine physician. Doctors acros…", "url": "https://mybigplunge.com/life/health/sugar-is-the-worst-ingredient-for-your-immune-system-during-covid-19-pandemic/", "urlToImage": "https://mybigplunge.com/wp-content/uploads/2022/01/pexels-magda-ehlers-1300972-1000x600.jpg", "publishedAt": "2022-01-17T09:10:50Z", "content": "SARS-CoV-2 virus can make blood sugar control worse in the short-term and can throw people with diabetes into a very dangerous blood sugar state, says Dr Heather Moday, a board-certified allergist, i… [+2403 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Livemint", "title": "Why T cell vaccines could be the key to long-term immunity amid Covid surge - Mint", "description": "Antibodies are just one part of our intricate and intertwined immune system. It's maybe time we focused on T cells.", "url": "https://www.livemint.com/science/news/why-t-cell-vaccines-could-be-the-key-to-long-term-immunity-amid-covid-surge-11642408915175.html", "urlToImage": "https://images.livemint.com/img/2022/01/17/600x338/HEALTH-CORONAVIRUS-INDIA-3_1638755886722_1642409293950.JPG", "publishedAt": "2022-01-17T09:05:24Z", "content": "The world is facing a resurgence of the Covid-19 pandemic fuelled by the new coronavirus variant Omicron. Even though Delta variant that swept the world during the second wave, continues to be domina… [+6224 chars]"}, {"source": {"id": null, "name": "Painnewsnetwork.org"}, "author": "Pat Anson", "title": "Long Covid Linked to Overactive Immune System — Pain News Network - Pain News Network", "description": "By Pat Anson, PNN Editor  People who develop long-haul COVID – even when the initial infection was mild or moderate – have a sustained inflammatory response that appears to be the result of an overactive immune system, according to Australian researchers.  Lo…", "url": "https://www.painnewsnetwork.org/stories/2022/1/17/overactive-immune-system-linked-to-long-covid", "urlToImage": "http://static1.squarespace.com/static/54d50ceee4b05797b34869cf/54de4dcae4b05ae6225b992c/61e4aa20ffebfd582bdac690/1642433963391/onder-ortel-OnELKCfnAmA-unsplash.jpg?format=1500w", "publishedAt": "2022-01-17T08:01:00Z", "content": "By Pat Anson, PNN Editor\r\nPeople who develop long-haul COVID even when the initial infection was mild or moderate have a sustained inflammatory response that appears to be the result of an overactive… [+3711 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Diabetes: How to control blood sugar levels when you have cancer - Hindustan Times", "description": "Chemotherapy during cancer treatment can play havoc with your blood sugar levels and can cause several complications. Here's how to manage diabetes when suffering from cancer. | Health", "url": "https://www.hindustantimes.com/lifestyle/diabetes-how-to-control-blood-sugar-levels-when-you-have-cancer-101642404588496.html", "urlToImage": "https://images.hindustantimes.com/img/2022/01/17/1600x900/diabetes_1641298509892_1642404633900.jpg", "publishedAt": "2022-01-17T07:35:22Z", "content": "Managing diabetes and avoiding its various complications in itself is an arduous job. Getting diagnosed with cancer can multiply these complications and pose a greater mortality risk in diabetes pati… [+2937 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Everyday habits to prevent heart attack in winters - Hindustan Times", "description": "Want to avoid risk of sudden heart attack in winters? Here are some lifestyle changes from indoor exercises, staying hydrated to ensure a good night's sleep suggested by Dr Zakia Khan, Senior Consultant-Interventional Cardiology, Fortis Hospital, Kalyan.", "url": "https://www.hindustantimes.com/photos/lifestyle/everyday-habits-to-prevent-heart-attack-in-winters-101642401067888.html", "urlToImage": "https://images.hindustantimes.com/img/2022/01/17/1600x900/heart_health_thumb_1642401107215_1642401140910.jpg", "publishedAt": "2022-01-17T06:48:26Z", "content": null}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Are you pregnant amid ongoing Omicron wave? Tips to follow - Hindustan Times", "description": "Getting jabbed for Covid-19 can reduce the severity of infection in pregnant women. Here are other tips that pregnant women should follow amid pandemic. | Health", "url": "https://www.hindustantimes.com/lifestyle/are-you-pregnant-amid-ongoing-omicron-wave-tips-to-follow-101642397441211.html", "urlToImage": "https://images.hindustantimes.com/img/2022/01/17/1600x900/8cf191a4-0ce2-11ec-b06b-bc6a184520fc_1630693220819_1642397640847.jpg", "publishedAt": "2022-01-17T05:38:29Z", "content": "Omicron is highly contagious but at the same time it's causing mostly mild symptoms in people. Vulnerable population including pregnant women, however, remains at a greater risk of severity and death… [+2578 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Empowering Indian Healthcare with Clinical Decision Support System - ETHealthworld.com", "description": "Brand Connect Initiative", "url": "https://health.economictimes.indiatimes.com/news/industry/empowering-indian-healthcare-with-clinical-decision-support-system/88943721", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-88943721,imgsize-30722,width-1200,height-628,overlay-ethealthworld/empowering-indian-healthcare-with-clinical-decision-support-system.jpg", "publishedAt": "2022-01-17T04:46:00Z", "content": "Gautam Khanna, CEO, PD Hinduja hospital, Harish Ramachandran, Country Manager, Clinical Effectiveness, Wolters Kluwer India and Dr. Arun N Palaniswami Executive Director, K.M.C.H spoke about how the … [+9899 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "ANI", "title": "Explained: How morning workouts are different from evening exercises - Times Now", "description": "To gain a better understanding of why the timing of exercise produces different effects, an international team of scientists carried out the most comprehensive study to date of exercise performed at different times of the day.", "url": "https://www.timesnownews.com/health/article/explained-how-morning-workouts-are-different-from-evening-exercises/850053", "urlToImage": "https://imgk.timesnownews.com/story/iStock-514717606.jpg?tr=w-560,h-292,fo-top", "publishedAt": "2022-01-17T04:30:00Z", "content": "<ul><li>The findings were recently published in the journal 'Cell Metabolism'.</li></ul>\r\n<ul><li>Their research has shown how different health-promoting signalling molecules are produced by the body… [+4762 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Hina Zahid", "title": "Maternal COVID-19 infection increases risks of preterm birth, low birth weight and stillbirth - Medical Dialogues", "description": "People who contracted COVID-19 while pregnant were more likely to have poor birth outcomes including ...", "url": "https://medicaldialogues.in/obstetrics-gynaecology/news/maternal-covid-19-infection-increases-risks-of-preterm-birth-low-birth-weight-and-stillbirth-87230", "urlToImage": "https://medicaldialogues.in/h-upload/2022/01/15/168387-png202201151615140000.jpg", "publishedAt": "2022-01-17T03:30:15Z", "content": "People who contracted COVID-19 while pregnant were more likely to have poor birth outcomes including preterm birth, small for gestational age, low birth weight, and stillbirth. The poor outcomes of p… [+2554 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "V. Ramana Dhara", "title": "Public Health: Why We Need To Know What Caused the Eluru 'Mystery Illness' - The Wire Science", "description": "In December 2020, the population of Eluru town experienced an epidemic in which 600 people reported multiple neurological problems over two weeks.", "url": "https://science.thewire.in/health/eluru-mystery-illness-pesticide-poisoning-public-health-unanswered-questions/", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2022/01/17074825/Screenshot-2022-01-17-at-7.47.36-AM.png", "publishedAt": "2022-01-17T02:36:25Z", "content": "A woman showing symptoms of epilepsy being taken to a hospital in Eluru town, during the outbreak of the ‘mystery illness’, December 6, 2020. Photo: PTI\r\n<ul><li>In December 2020, the population of E… [+6589 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Dried goji berries may help protect against age-related vision loss - Times of India", "description": "Foods for eyesight | Goji berries for eyes: As per the latest study, dried goji berries may help prevent or delay the development of age-related macular degeneration, or AMD, in healthy middle-aged people. Read to know more about it and much more on Times Of …", "url": "https://timesofindia.indiatimes.com/life-style/food-news/foods-for-eyesight-dried-goji-berries-may-help-protect-against-age-related-vision-loss/photostory/88929900.cms", "urlToImage": "https://static.toiimg.com/photo/88929924.cms", "publishedAt": "2022-01-17T02:30:00Z", "content": "The researchers found that 13 healthy participants aged 45 to 65 who consumed 28 grams (about one ounce, or a handful) of goji berries five times a week for 90 days increased the density of protectiv… [+845 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study provides valuable insight into the developmental origins of schizophrenia - News-Medical.Net", "description": "Scientists from Cardiff University have discovered new links between the breakdown in brain cell development and the risk of schizophrenia and other psychiatric disorders.", "url": "https://www.news-medical.net/news/20220116/Study-provides-valuable-insight-into-the-developmental-origins-of-schizophrenia.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/image-handler/picture/2019/6/3D_illustration_egg_cells_embryo._Embryo_cells_with_red_nucleuses_in_center._Hum_-_Rost9_M1_3c512a7b78a9417e986aa778a4cf4559-620x480.jpg", "publishedAt": "2022-01-17T02:09:00Z", "content": "Scientists from Cardiff University have discovered new links between the breakdown in brain cell development and the risk of schizophrenia and other psychiatric disorders.\r\nGenetic risk factors are k… [+3792 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Study shows Omicron less severe than Delta among COVID-19 hospitalized patients - News-Medical.Net", "description": "New research posted to the medRxiv* preprint server suggests the Omicron variant produces less severe COVID-19 symptoms than earlier severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) variants.", "url": "https://www.news-medical.net/news/20220116/Study-shows-Omicron-less-severe-than-Delta-among-COVID-19-hospitalized-patients.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_701737_16423818487336329.jpg", "publishedAt": "2022-01-17T01:12:00Z", "content": "New research posted to the medRxiv* preprint server suggests the Omicron variant produces less severe COVID-19 symptoms than earlier severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) varia… [+6579 chars]"}, {"source": {"id": null, "name": "Thefederal.com"}, "author": null, "title": "What makes new COVID vaccine from US cheap, easy to make - The Federal", "description": "The Corbevax, being produced by Indian pharma firm Biological E, uses conventional tech, is patent free, and comes out of non-profit funding", "url": "https://thefederal.com/covid-19/what-makes-new-covid-vaccine-from-us-cheap-easy-to-make/", "urlToImage": "https://thefederal.com/file/2022/01/Image-1-3.jpg", "publishedAt": "2022-01-17T01:00:00Z", "content": "At a time when vaccine inequality is being blamed for the outbreak of the Omicron variant of COVID, a team of US researchers has come up with a low-cost, easy-to-produce vaccine that may be universal… [+2997 chars]"}, {"source": {"id": "the-wall-street-journal", "name": "The Wall Street Journal"}, "author": null, "title": "Should You Exercise With Covid-19? - WSJ - The Wall Street Journal", "description": "Asymptomatic carriers may be tempted to keep their fitness resolutions. Medical professionals say that’s a bad idea.", "url": "https://www.wsj.com/story/should-you-exercise-with-covid-19-b3c345ba", "urlToImage": "https://images.wsj.net/im-414983/social", "publishedAt": "2022-01-16T22:49:45Z", "content": "Testing positive for Covid-19 means putting workouts on hold, even if you have zero or mild symptoms. Sports-medicine professionals say you should put exercise on pause, even if you are asymptomatic.… [+37 chars]"}, {"source": {"id": null, "name": "Llu.edu"}, "author": null, "title": "The relationship between food and the signs of aging - Loma Linda University Health", "description": "Physician identifies foods to enhance physical health", "url": "https://news.llu.edu/health-wellness/relationship-between-food-and-signs-of-aging", "urlToImage": "https://news.llu.edu/sites/news.llu.edu/files/styles/large/public/istock-1164678611.jpg?itok=1FlxZb5F", "publishedAt": "2022-01-16T22:45:59Z", "content": "Its no secret that it's important to eat healthy and stay in optimal health. Food contains nutrients that our bodies need to function properly, and those same nutrients can help maintain our youthful… [+1923 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TNN", "title": "Study on protein sheds light on heart disease risk - Times of India", "description": "Thiruvananthapuram: The researchers at the Rajiv Gandhi Centre for Biotechnology (RGCB) here have identified Cyclophilin A, a protein which is a known.", "url": "https://timesofindia.indiatimes.com/city/thiruvananthapuram/study-on-protein-sheds-light-on-heart-disease-risk/articleshow/88938269.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-47529300,width-1070,height-580,imgsize-110164,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2022-01-16T22:36:00Z", "content": "Study on protein sheds light on heart disease risk"}, {"source": {"id": null, "name": "SciTechDaily"}, "author": null, "title": "Why Do We Forget? New Theory Says “Forgetting” Is Actually a Form of Learning - SciTechDaily", "description": "We create countless memories as we live our lives but many of these we forget. Why? Counter to the general assumption that memories simply decay with time, ‘forgetting’ might not be a bad thing – that is according to scientists who believe it may represent a …", "url": "https://scitechdaily.com/why-do-we-forget-new-theory-says-forgetting-is-actually-a-form-of-learning/", "urlToImage": "https://scitechdaily.com/images/Neuroscience.gif", "publishedAt": "2022-01-16T19:41:22Z", "content": "We create countless memories as we live our lives but many of these we forget. Why? Counter to the general assumption that memories simply decay with time, ‘forgetting’ might not be a bad thing – tha… [+3650 chars]"}, {"source": {"id": null, "name": "Tittlepress.com"}, "author": "newsdesk", "title": "Why you gain weight after losing it and how to stop - TittlePress", "description": "Getty Images/kroach You've lost the weight you wanted, but have it all back now that you've stopped dieting.", "url": "https://tittlepress.com/health/1455779/", "urlToImage": "https://www.cnet.com/a/img/C5U9A9aCf0SdymqLwrG2T9pdfis=/1200x630/2021/12/16/cc029ff2-3c7f-41cc-94e1-65326b325714/gettyimages-1042133164.jpg", "publishedAt": "2022-01-16T17:40:37Z", "content": "Getty Images/kroach\r\nYou’ve lost the weight you wanted, but have it all back now that you’ve stopped dieting. Sound familiar? Maybe it happened several times. But you lost weight once, and you know y… [+10147 chars]"}, {"source": {"id": null, "name": "Business Standard"}, "author": "Press Trust of India", "title": "Omicron spread: UK expands Covid booster vaccine rollout to teenagers - Business Standard", "description": "Previously, third doses were only recommended by the UK's Joint Committee on Vaccination and Immunisation (JCVI) to 18 and over", "url": "https://www.business-standard.com/article/pti-stories/uk-expands-covid-booster-vaccine-rollout-to-teenagers-122011600610_1.html", "urlToImage": "https://bsmedia.business-standard.com/_media/bs/img/article/2021-12/14/full/1639474993-7994.jpg", "publishedAt": "2022-01-16T17:02:00Z", "content": "Around 40,000 teenagers in England will be eligible for a top-up booster dose to protect against COVID-19 as Britain's National Health Service (NHS) expands the booking service to 16 and 17 year olds… [+4608 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "India.com Lifestyle Staff", "title": "Diabetic? Include Rajma In Your Diet Today | Here's Why - India.com", "description": "From keeping your heart healthy to weight loss, Rajma has every reason to be a part of your diet.", "url": "https://www.india.com/lifestyle/diabetic-include-rajma-in-your-diet-today-heres-why-5188876/", "urlToImage": "https://static.india.com/wp-content/uploads/2022/01/istockphoto-1328703894-170667a.jpeg", "publishedAt": "2022-01-16T11:38:32Z", "content": "If you have diabetes, it is critical that you make some healthier choices such as maintaining a healthy weight, exercising regularly, and keeping a close eye on your diet and caloric intake. It’s imp… [+2425 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Researchers assert infants with low-risk deliveries should not need antibiotics - ANI News", "description": "Washington [US], January 16 (ANI): A team of international researchers has found that infants born through uncomplicated caesarean delivery, without labour or membrane rupture before delivery and no concern for infection, should not need antibiotics at birth.", "url": "https://www.aninews.in/news/science/researchers-assert-infants-with-low-risk-deliveries-should-not-need-antibiotics20220116151458", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/__sized__/wwwwmhnbddasd2022011609395920220116094421-thumbnail-154x87-70.jpg", "publishedAt": "2022-01-16T09:45:00Z", "content": "ANI | Updated: Jan 16, 2022 15:15 IST\r\nWashington [US], January 16 (ANI): A team of international researchers has found that infants born through uncomplicated caesarean delivery, without labour or m… [+3757 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Brazil begins vaccination of children aged 5-11 against Covid-19 - ETHealthworld.com", "description": "On December 16, Brazil's health regulator Anvisa approved the Pfizer-BioNTech Covid-19 vaccine for use in children aged five to 11, joining a growing list of countries green-lighting vaccination for kids.", "url": "https://health.economictimes.indiatimes.com/news/pharma/brazil-begins-vaccination-of-children-aged-5-11-against-covid-19/88929414", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-88929414,imgsize-29560,width-1200,height-628,overlay-ethealthworld/brazil-begins-vaccination-of-children-aged-5-11-against-covid-19.jpg", "publishedAt": "2022-01-16T07:45:00Z", "content": "BRASILIA: Brazil has launched a vaccination campaign for children aged five to 11, Brazilian broadcaster CNN Brasil reported.According to the broadcaster, the first child to be administered the vacci… [+709 chars]"}, {"source": {"id": null, "name": "Nokiamobilephonenews.co.uk"}, "author": "Alex Silman", "title": "Pooja Makhija, a nutritionist, demonstrates how to eat your meals in the correct order. - Nokia News", "description": "Pooja Makhija, a nutritionist, demonstrates how to eat your meals in the proper order. Pooja Makhija, a nutritionist, shared the proper order to eat your meal in an Instagram post. We've always been told that eating healthy foods is perhaps the most important…", "url": "https://www.nokiamobilephonenews.co.uk/news/pooja-makhija-a-nutritionist-demonstrates-how-to-eat-your-meals-in-the-correct-order/", "urlToImage": null, "publishedAt": "2022-01-16T07:28:06Z", "content": "Pooja Makhija, a nutritionist, demonstrates how to eat your meals in the proper order.\r\nPooja Makhija, a nutritionist, shared the proper order to eat your meal in an Instagram post.\r\nWe’ve always bee… [+2076 chars]"}, {"source": {"id": null, "name": "Thegoaspotlight.com"}, "author": null, "title": "8 tricks to lose weight without diet or exercise, according to science | Life - The Goa Spotlight", "description": "Myth or Reality. Can you really lose kilos without dieting and without joining a gym? It is possible", "url": "https://thegoaspotlight.com/2022/01/16/8-tricks-to-lose-weight-without-diet-or-exercise-according-to-science-life/", "urlToImage": "https://cdn.computerhoy.com/sites/navi.axelspringer.es/public/styles/1200/public/media/image/2022/01/7-trucos-adelgazar-dietas-ni-ejercicio-ciencia-2585547.jpg?itok=UK2g4acw", "publishedAt": "2022-01-16T05:15:36Z", "content": "Myth or Reality. Can you really lose kilos without dieting and without joining a gym? It is possible, and the experts explain how to do it.For lose weight you do not need magic potions. It’s as simpl… [+3395 chars]"}, {"source": {"id": null, "name": "OI Canadian"}, "author": "HELEN HERNANDEZ", "title": "They assure that unlike other variants of coronavirus, the symptoms of Omicron take less time to appear - OI Canadian", "description": "Not only is it the most contagious, but also the symptoms of Omicron take less time to appear according to a study. This differs from other variants whose incubation time was longer. According to what", "url": "https://oicanadian.com/they-assure-that-unlike-other-variants-of-coronavirus-the-symptoms-of-omicron-take-less-time-to-appear/", "urlToImage": "https://static.misionesonline.news/wp-content/uploads/2022/01/istockphoto-1355867968-612x612-1.jpg", "publishedAt": "2022-01-16T01:25:18Z", "content": "Not only is it the most contagious, but also the symptoms of Omicron take less time to appear according to a study. This differs from other variants whose incubation time was longer.\r\nAccording to wh… [+2961 chars]"}, {"source": {"id": null, "name": "Ahmedabadmirror.com"}, "author": null, "title": "Booster doses of current vaccines may not be enough: WHO - Ahmedabad Mirror", "description": "The World Health Organisation (WHO) has said that current Covid-19 vaccines may need to be updated if they are to provide continued protection against emerging variants, including Omicron.\n\nWHO&#39;s Technical Advisory Group on Covid-19 Vaccine Composition (T…", "url": "https://ahmedabadmirror.com/booster-doses-of-current-vaccines-may-not-be-enough-who/81817679.html", "urlToImage": "https://ngs-space1.sgp1.digitaloceanspaces.com/am/uploads/mediaGallery/image/1641965330752.jpg-org", "publishedAt": "2022-01-12T06:01:44Z", "content": "The World Health Organisation (WHO) has said that current Covid-19 vaccines may need to be updated if they are to provide continued protection against emerging variants, including Omicron.\r\nWHO's Tec… [+1085 chars]"}]}