{"status": "ok", "totalResults": 65, "articles": [{"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Iraq Witnesses Outbreak Of Nose-Bleed Fever: Know More About The Deadly Disease - TIMES NOW", "description": "The deadly Nose-Bleed Fever has no vaccine and its onset can be swift, causing severe bleeding both internally and externally and especially from the nose. I...", "url": "https://www.youtube.com/watch?v=1Ot4PGQETqo", "urlToImage": "https://i.ytimg.com/vi/1Ot4PGQETqo/hqdefault.jpg", "publishedAt": "2022-06-02T04:00:01Z", "content": null}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "TIMESOFINDIA.COM", "title": "Most difficult nutrients to get and how you can fix that - Times of India", "description": "To live a wholesome life, you need to eat right! A healthy, balanced diet is key to maintaining your overall health and fitness. However, even a plate full of nutrient-dense foods does not provide your body with all the vitamins and minerals it needs. While y…", "url": "https://timesofindia.indiatimes.com/life-style/health-fitness/health-news/most-difficult-nutrients-to-get-and-how-you-can-fix-that/photostory/91941956.cms", "urlToImage": "https://static.toiimg.com/photo/91942027.cms", "publishedAt": "2022-06-02T03:30:00Z", "content": "To live a wholesome life, you need to eat right! A healthy, balanced diet is key to maintaining your overall health and fitness.\r\nHowever, even a plate full of nutrient-dense foods does not provide y… [+618 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN City Desk", "title": "Delhi govt directs all hospitals to remain alert amid monkeypox cases growing worldwide - Times Now", "description": "This comes after the Union Health Ministry on Tuesday issued specific guidelines to states and Union Territories for the prevention of the monkeypox outbreak in the country.", "url": "https://www.timesnownews.com/delhi/delhi-govt-directs-all-hospitals-to-be-on-alert-amid-monkeypox-cases-growing-worldwide-article-91952360", "urlToImage": "https://static.tnn.in/thumb/msid-91952360,imgsize-100,width-1280,height-720,resizemode-75/91952360.jpg", "publishedAt": "2022-06-02T02:54:45Z", "content": "Home Minister Amit Shah says he 'enjoyed watching' Akshay Kumar's Samrat Prithviraj, reveals going to cinema hall after 13 years"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Explained Desk", "title": "Explained: The key monkeypox symptoms to watch out for - The Indian Express", "description": "Monkeypox: What are the symptoms of the disease, and what is the treatment? How does the disease progress?", "url": "https://indianexpress.com/article/explained/explained-key-monkeypox-symptoms-to-watch-out-for-7947532/", "urlToImage": "https://images.indianexpress.com/2022/05/Monkeypox-2-1.jpg", "publishedAt": "2022-06-02T02:23:11Z", "content": "The Union health ministry Tuesday released guidelines on surveillance, identification and management of monkeypox. So far, 300 suspected or confirmed cases of monkeypox have been detected in non-ende… [+2888 chars]"}, {"source": {"id": null, "name": "Thewire.in"}, "author": "Michael Schulson", "title": "How Do You Calculate the Risk of a Lab Leak? – The Wire Science - The Wire Science", "description": "The odds of a dangerous pathogen escaping a lab are uncertain, and have implications for COVID-19 and more.", "url": "https://science.thewire.in/health/covid19-pandemic-lab-leak-risk/", "urlToImage": "https://cdn.thewire.in/wp-content/uploads/2022/06/01173544/NIAID_Integrated_Research_Facility_-_Positive_Pressure_Personnel_Suit.jpg", "publishedAt": "2022-06-02T01:59:52Z", "content": "Scientists working inside positive pressure personnel suit at a BSL-4 laboratory in Frederick, Maryland. Photo: NIAID\r\nOn a sunny September morning in 2011, at a conference on the Mediterranean islan… [+16573 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Reuters", "title": "Monkeypox worry increases! Health agency in England say there`s community spread - Zee News", "description": "Monkeypox appears to be spreading from person to person in England, the UK Health Security Agency (UKHSA) said on Wednesday (June 1). The usually mild viral disease, which is endemic in west and central Africa, is understood to spread through close contact.", "url": "https://zeenews.india.com/world/monkeypox-worry-increases-health-agencies-in-england-say-theres-community-spread-2469592.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/06/02/1049101-monkeypox1-virus-reuters-pic.jpg", "publishedAt": "2022-06-02T01:46:23Z", "content": "London: Monkeypox appears to be spreading from person to person in England, the UK Health Security Agency (UKHSA) said on Wednesday (June 1). The usually mild viral disease, which is endemic in west … [+2259 chars]"}, {"source": {"id": null, "name": "The Quint"}, "author": "Anoushka Rajesh", "title": "Can Monkeypox Lead to Another COVID Like Pandemic? - The Quint", "description": "Monkeypox has already spread to over 25 countries and counting. What is causing this virus to spread now? is it a cause for concern? are we headed in for another COVID like global pandemic? FIT asks experts.", "url": "https://www.thequint.com/fit/coronavirus/monkeypox-virus-pandemic-covid", "urlToImage": "https://images.thequint.com/thequint%2F2022-06%2Feda0cd2e-b770-4a90-af5e-2c42af3b6df6%2Ffit_hero.jpg?w=1200&auto=format%2Ccompress&ogImage=true", "publishedAt": "2022-06-02T01:30:00Z", "content": "We know how things escalated from there.\r\nSo, are we seeing a similar situation playing out now with monkeypox?\r\nDr JP Muliyil says the two are not comparable at all. \"COVID was an absolutely new dis… [+686 chars]"}, {"source": {"id": null, "name": "YouTube"}, "author": null, "title": "Importance of flu vaccine amid the COVID-19 pandemic | New Day - CNN Philippines", "description": "With the rainy season upon us and the threat of COVID-19 still very much present, medical experts have been stressing the need to get and update our vaccines...", "url": "https://www.youtube.com/watch?v=daJ9aAlvECw", "urlToImage": "https://i.ytimg.com/vi/daJ9aAlvECw/hqdefault.jpg", "publishedAt": "2022-06-02T01:26:31Z", "content": null}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "What Is Monkeypox? - 'Hot Mic' With Nidhi Razdan - NDTV", "description": "Hot Mic with Nidhi Razdan: Monkeypox has been detected in 14 countries now including the US and Britain. The outbreak has taken scientists by surprise since Monkeypox is most common in remote parts of Central and West Africa", "url": "https://www.ndtv.com/world-news/what-is-monkeypox-hot-mic-with-nidhi-razdan-3004732", "urlToImage": "https://c.ndtvimg.com/2022-05/6lfgfj0g_monkey-pox_625x300_24_May_22.jpg", "publishedAt": "2022-06-02T01:22:52Z", "content": "Hi, This is Hot Mic and I'm Nidhi Razdan.\r\nThe COVID pandemic is not over yet. But there is a new virus that's causing concern in several countries. Monkeypox has been detected in 14 countries until … [+5326 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Bangalore Mirror", "title": "Bengalureans, get your daily dose of Vitamin D - Bangalore Mirror", "description": "Bengaluru skies have been cloudy nearly most of the year and with pre-covid normalcy making a comeback, Vitamin D-deficient individuals are finding it hard to follow an active lifestyle.", "url": "https://bangaloremirror.indiatimes.com/bangalore/civic/bengalureans-get-your-daily-dose-of-vitamin-d/articleshow/91948569.cms", "urlToImage": "https://static.toiimg.com/photo/imgsize-289072,msid-91948523/91948523.jpg", "publishedAt": "2022-06-02T00:30:00Z", "content": "By Melvin MathewLack of sunny days causing rise in Vitamin D\r\n deficiency cases; doctors say exposure to sunlight every day mandatory to curb fatigue &amp; brittle bonesSunny days are on the wane and… [+2890 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Times Of India", "title": "Monkeypox screening begins in dists, no case found so far - Times of India", "description": "Acting on the directions of the state health department, several districts have started screening for monkeypox cases in the state.", "url": "https://timesofindia.indiatimes.com/city/ranchi/monkeypox-screening-begins-in-dists-no-case-found-so-far/articleshow/91950099.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-91950098,width-1070,height-580,imgsize-812833,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2022-06-01T21:47:00Z", "content": ""}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "https://www.facebook.com/neurosciencenews", "title": "Engineers Develop Nanoparticles That Cross the Blood-Brain Barrier - Neuroscience News", "description": "Researchers have developed drug-carrying nanoparticles that cross the blood-brain barrier, allowing for more effective delivery to the brain than conventional medications. The nanoparticles can get into tumors and kill glioblastoma brain cancer cells.", "url": "https://neurosciencenews.com/bbb-nanoparticles-glioblastoma-20718/", "urlToImage": "https://neurosciencenews.com/files/2022/06/bbb-nanoparticles-neurosinces-public.jpg", "publishedAt": "2022-06-01T21:34:41Z", "content": "Summary: Researchers have developed drug-carrying nanoparticles that cross the blood-brain barrier, allowing for more effective delivery to the brain than conventional medications. The nanoparticles … [+6811 chars]"}, {"source": {"id": null, "name": "Healthline"}, "author": "Katey Davidson, MScFN, RD, CPT", "title": "21 Heart-Healthy Tips: Diet, Exercise, Mindfulness, and Lifestyle - Healthline", "description": "Having a healthy heart is one of the strongest predictors of a long, healthy life. Here are 21 diet and lifestyle tips for a healthy heart.", "url": "https://www.healthline.com/nutrition/healthy-heart-tips", "urlToImage": "https://assets.healthline.com/content/hl_sharing_v2.jpg", "publishedAt": "2022-06-01T20:10:11Z", "content": "Having a healthy heart is one of the strongest predictors of a long, healthy life.\r\nWhile your doctor may have suggested eating better and exercising as heart-healthy tips, you can do a lot more to p… [+14647 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": "Pam Harrison", "title": "COVID-19 Vaccines Equally Effective in Patients on Dialysis - Medscape", "description": "Two doses of either an mRNA vaccine or the AZ equivalent provide equal and significant protection against severe disease in patients on dialysis who have been infected with COVID-19", "url": "https://www.medscape.com/viewarticle/974896", "urlToImage": "https://img.medscape.com/thumbnail_library/is_201109_pancreas_cancer_800x450.jpg", "publishedAt": "2022-06-01T19:54:35Z", "content": "Editor's note: Find the latest COVID-19 news and guidance in Medscape's Coronavirus Resource Center.\r\nTwo doses of either the Pfizer-BioNTech COVID-19 vaccine or the Oxford AstraZeneca alternative pr… [+6723 chars]"}, {"source": {"id": null, "name": "Dailypioneer.com"}, "author": "The Pioneer", "title": "Africans see inequity in monkeypox response elsewhere - Daily Pioneer", "description": "As health authorities in Europe and elsewhere roll out vaccines and drugs to stamp out the biggest monkeypox outbreak beyond Africa, some doctors acknowledge an ugly reality: The resources to slow the disease's spread have long been available, just not to the…", "url": "https://www.dailypioneer.com/2022/world/africans-see-inequity-in-monkeypox-response-elsewhere.html", "urlToImage": "https://www.dailypioneer.com/images/logo.jpg", "publishedAt": "2022-06-01T18:38:31Z", "content": "As health authorities in Europe and elsewhere roll out vaccines and drugs to stamp out the biggest monkeypox outbreak beyond Africa, some doctors acknowledge an ugly reality: The resources to slow th… [+899 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": null, "title": "Combination anti-HIV antibody infusions suppress virus for long period, says study - ThePrint", "description": "Maryland [US], June 1 (ANI): According to a new study, HIV patients who started antiretroviral medication (ART) early in their infection had a long duration of HIV suppression without ART after getting two broadly neutralising anti-HIV antibodies (bNAbs). The…", "url": "https://theprint.in/science/combination-anti-hiv-antibody-infusions-suppress-virus-for-long-period-says-study/980103/", "urlToImage": null, "publishedAt": "2022-06-01T18:14:16Z", "content": "Maryland [US], June 1 (ANI): According to a new study, HIV patients who started antiretroviral medication (ART) early in their infection had a long duration of HIV suppression without ART after getti… [+3843 chars]"}, {"source": {"id": null, "name": "Livemint"}, "author": "Priyanka Sharma", "title": "SII to launch vaccine to fight cervical cancer by November | Mint - Mint", "description": "Cervical cancer is 4th most common cancer in women after breast, lung & colorectal.The Union health ministry plans to target girls in the 9-14 years age group for vaccination against cervical cancer", "url": "https://www.livemint.com/news/india/sii-to-launch-vaccine-to-fight-cervical-cancer-by-november-11654102756009.html", "urlToImage": "https://images.livemint.com/img/2022/06/01/600x338/SII_1654102898533_1654102898685.jpg", "publishedAt": "2022-06-01T17:54:05Z", "content": "NEW DELHI : Pune-based drugmaker Serum Institute of India (SII) hopes to launch the countrys first indigenous human papillomavirus vaccine (HPV) by November 2022 in Indias biggest push against cervic… [+1853 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Hearing Outcomes of Infants Born to Mothers With Active COVID-19 Infection - Cureus", "description": "Introduction\r\n\r\nCOVID-19, caused by SARS-CoV-2, is a highly contagious respiratory tract infection. A major concern of SARS-CoV-2 infection in pregnant women is vertical maternal-fetal transmission and the ramifications on infant hearing. This retrospective s…", "url": "https://www.cureus.com/articles/99081-hearing-outcomes-of-infants-born-to-mothers-with-active-covid-19-infection", "urlToImage": "https://assets.cureus.com/uploads/figure/file/380347/article_river_b291b230d80d11eca5df6d9ad78e20f8-image.png", "publishedAt": "2022-06-01T17:13:32Z", "content": "Introduction\r\nCOVID-19, caused by SARS-CoV-2, is a highly contagious respiratory tract infection. A major concern of SARS-CoV-2 infection in pregnant women is vertical maternal-fetal transmission and… [+22369 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "Reuters", "title": "WHO warns of future outbreaks of endemic diseases such as monkeypox, lassa fever - Know why - Zee News", "description": "Outbreaks of endemic diseases such as monkeypox and lassa fever are becoming more persistent and frequent, the World Health Organization`s (WHO) emergencies director, Mike Ryan, warned on Wednesday.", "url": "https://zeenews.india.com/world/who-warns-of-future-outbreaks-of-endemic-diseases-such-as-monkeypox-lassa-fever-know-why-2469555.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/06/01/1049063-monkeypox-1.jpg", "publishedAt": "2022-06-01T17:07:53Z", "content": "London: Outbreaks of endemic diseases such as monkeypox and lassa fever are becoming more persistent and frequent, the World Health Organization`s (WHO) emergencies director, Mike Ryan, warned on Wed… [+1098 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "University of Texas at Dallas: Neuroscientist Seeks Origins of Alcoholism at Molecular Level - India Education Diary", "description": "Recovering alcoholics face significant challenges in changing their habits, due in part to the way the brain adapts to the regular presence of alcohol. A University of Texas at Dallas neuroscientist is trying to pinpoint these neurological changes at", "url": "https://indiaeducationdiary.in/university-of-texas-at-dallas-neuroscientist-seeks-origins-of-alcoholism-at-molecular-level/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2022/02/University-of-Texas-at-Dallas.jpg", "publishedAt": "2022-06-01T16:51:08Z", "content": "Recovering alcoholics face significant challenges in changing their habits, due in part to the way the brain adapts to the regular presence of alcohol. A University of Texas at Dallas neuroscientist … [+4496 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Anuradha Mascarenhas", "title": "ICMR : India fully prepared to deal with nose-bleed fever virus - The Indian Express", "description": "Considering that the Crimean Congo Haemorrhagic Fever (CCHF) has been detected here in the past and Iraq is reporting a jump in cases and deaths, the ICMR is geared up, having developed a surveillance protocol over the last decade, Dr Samiran Panda, Addl DG, …", "url": "https://indianexpress.com/article/lifestyle/health/icmr-india-fully-prepared-to-deal-with-nose-bleed-fever-virus-7948117/", "urlToImage": "https://images.indianexpress.com/2022/06/Dr-Samiran-Panda.jpg", "publishedAt": "2022-06-01T16:48:23Z", "content": "Why should a recent outbreak of a nosebleed-causing fever in Iraq worry us back in India? Thats because the Crimean Congo Haemorrhagic Fever (CCHF) has claimed 19 lives, according to the WHO, and it … [+4681 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Research: Diet unlikely to ease osteoarthritis, rheumatoid arthritis progression - ANI News", "description": "Washington [US], June 1 (ANI): A review of the existing scientific evidence has found that diet is unlikely to make any difference in the progression of osteoarthritis and rheumatoid arthritis.", "url": "https://www.aninews.in/news/health/research-diet-unlikely-to-ease-osteoarthritis-rheumatoid-arthritis-progression20220601214649", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/Arthritis_june2022010215540720220601155659.jpg", "publishedAt": "2022-06-01T16:16:00Z", "content": "ANI | Updated: Jun 01, 2022 21:46 IST\r\nWashington [US], June 1 (ANI): A review of the existing scientific evidence has found that diet is unlikely to make any difference in the progression of osteoar… [+3954 chars]"}, {"source": {"id": null, "name": "ANI News"}, "author": null, "title": "Study links rising symptoms of depression among pregnant moms to their kids' behavioural issues - ANI News", "description": "Washington [US], June 1 (ANI): UCLA psychology researchers and colleagues have reported that children whose mothers experience rising levels of depression from the period before pregnancy until the months just after giving birth are at greater risk of develop…", "url": "https://www.aninews.in/news/lifestyle/parenting/study-links-rising-symptoms-of-depression-among-pregnant-moms-to-their-kids-behavioural-issues20220601214539", "urlToImage": "https://aniportalimages.s3.amazonaws.com/media/details/ewftgw4etfrewrfre2022060115474620220601161508.jpg", "publishedAt": "2022-06-01T16:15:00Z", "content": "ANI | Updated: Jun 01, 2022 21:45 IST\r\nWashington [US], June 1 (ANI): UCLA psychology researchers and colleagues have reported that children whose mothers experience rising levels of depression from … [+4574 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "TN Digital", "title": "Type-2 diabetes: Study says THIS masala can lower blood sugar levels by 35 per cent - Times Now", "description": "Ginger – a spice with a strong taste – has been used for centuries for its medicinal properties. Additionally, it gives food a distinct and irresistible taste. And now, several studies reveal that it could work wonders with better management of blood sugar le…", "url": "https://www.timesnownews.com/health/type-2-diabetes-study-says-this-masala-can-lower-blood-sugar-levels-by-35-per-cent-article-91946655", "urlToImage": "https://static.tnn.in/thumb/msid-91946655,imgsize-100,width-1280,height-720,resizemode-75/91946655.jpg", "publishedAt": "2022-06-01T15:35:25Z", "content": "Home Minister Amit Shah says he 'enjoyed watching' Akshay Kumar's Samrat Prithviraj, reveals going to cinema hall after 13 years"}, {"source": {"id": null, "name": "Medscape"}, "author": "Tara Haelle", "title": "Lupus Mutation May Unlock Targeted Drugs for Patient Subset - Medscape", "description": "A new study provides definitive proof of one pathway that contributes to lupus, though it’s unclear how many patients with lupus are affected by this mechanism.", "url": "https://www.medscape.com/viewarticle/974872", "urlToImage": "https://img.medscape.com/thumbnail_library/ht_220601_crick_carola_vinuesa_800x450.jpg", "publishedAt": "2022-06-01T14:47:36Z", "content": "Scientists have confirmed that a receptor long suspected to be linked to lupus is, in fact, a major driver of the autoimmune disease for at least some subset of patients, according to a study recentl… [+8609 chars]"}, {"source": {"id": null, "name": "FoodNavigator.com"}, "author": "foodnavigator.com", "title": "Vitamin D food fortification works better with water and milk than in juice: study - FoodNavigator.com", "description": "By measuring the maximum concentration over time, Danish researchers found bioavailability of vitamin D to be higher in milk and water.", "url": "https://www.foodnavigator.com/Article/2022/06/01/vitamin-d-food-fortification-works-better-with-water-and-milk-than-in-juice-study", "urlToImage": "https://www.foodnavigator.com/var/wrbm_gb_food_pharma/storage/images/publications/food-beverage-nutrition/foodnavigator.com/news/science/vitamin-d-food-fortification-works-better-with-water-and-milk-than-in-juice-study/15464101-2-eng-GB/Vitamin-D-food-fortification-works-better-with-water-and-milk-than-in-juice-study.jpg", "publishedAt": "2022-06-01T14:43:00Z", "content": "Vitamin D insufficiency is a global health problem, linked with multiple health issues, including the immune response to COVID-19. Estimates show that as much as 40% of the European population could … [+1424 chars]"}, {"source": {"id": null, "name": "Medical Dialogues"}, "author": "Medha Baranwal", "title": "Transvaginal mesh not superior to native tissue repair for treating pelvic organ prolapse: Study - Medical Dialogues", "description": "USA: At 36 months, transvaginal mesh repair was not found to be superior to native tissue repair for ...", "url": "https://medicaldialogues.in/obstetrics-gynaecology/news/transvaginal-mesh-not-superior-to-native-tissue-repair-for-treating-pelvic-organ-prolapse-study-93707", "urlToImage": "https://medicaldialogues.in/h-upload/2022/05/27/177319-pelvic-mesh.jpg", "publishedAt": "2022-06-01T14:00:42Z", "content": "USA: At 36 months, transvaginal mesh repair was not found to be superior to native tissue repair for the treatment of anterior and/or apical vaginal prolapse, according to a recent study in Obstetric… [+3324 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Reasons Behind Delayed or Irregular Menstrual Cycle - News18", "description": "The common causes can range from hormonal imbalances to serious medical conditions", "url": "https://www.news18.com/news/lifestyle/reasons-behind-delayed-or-irregular-menstrual-cycle-5277601.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2021/12/periods-163855917716x9.jpg", "publishedAt": "2022-06-01T13:38:22Z", "content": "There are many factors from changes in sleeping cycle to stress which can affect the menstrual cycle. Being pregnant is a possible reason for a missed period but there are also other factors that aff… [+1933 chars]"}, {"source": {"id": null, "name": "India.com"}, "author": "ANI", "title": "Drinking unsweetened or sweetened coffee linked to lower death risk: New Study - Zee News", "description": "A new study has found that in comparison to non-coffee drinkers, adults who drank moderate amounts (1.5 to 3.5 cups per day) of unsweetened coffee or coffee sweetened with sugar were less likely to die during a 7-year follow-up period.", "url": "https://zeenews.india.com/health/drinking-unsweetened-or-sweetened-coffee-linked-to-lower-death-risk-new-study-2469481.html", "urlToImage": "https://english.cdn.zeenews.com/sites/default/files/2022/06/01/1048973-coffee.jpg", "publishedAt": "2022-06-01T13:35:26Z", "content": "Washington: A new study has found that in comparison to non-coffee drinkers, adults who drank moderate amounts (1.5 to 3.5 cups per day) of unsweetened coffee or coffee sweetened with sugar were less… [+2442 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Ayurveda tips to improve metabolism; dos and don'ts you must remember - Hindustan Times", "description": "Having a slow metabolism not only leads to weight gain but a series of health issues from skin troubles, hair loss, chronic fatigue, to unhealthy cravings. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/ayurveda-tips-to-improve-metabolism-dos-and-don-ts-you-must-remember-101654088955078.html", "urlToImage": "https://images.hindustantimes.com/img/2022/06/01/1600x900/metabolism_1654089069171_1654089079489.jpg", "publishedAt": "2022-06-01T13:15:43Z", "content": "Having a good metabolism is important for the healthy functioning of the body. It is the process by which your body converts what you consume into energy. Having a slow metabolism not only leads to w… [+2452 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "ET HealthWorld", "title": "Covid caused collateral damage to global cardiac services: Study - ETHealthWorld", "description": "Disruption to cardiac services during the Covid-19 pandemic has caused a \"global collateral damage\" that may have lasting ramifications, according to a study published on Tuesday.", "url": "https://health.economictimes.indiatimes.com/news/diagnostics/covid-caused-collateral-damage-to-global-cardiac-services-study/91941996", "urlToImage": "https://etimg.etb2bimg.com/thumb/msid-91941996,imgsize-1079511,width-1200,height-628,overlay-ethealthworld/covid-caused-collateral-damage-to-global-cardiac-services-study.jpg", "publishedAt": "2022-06-01T13:00:00Z", "content": "London, Disruption to cardiac services during the Covid-19 pandemic has caused a \"global collateral damage\" that may have lasting ramifications, according to a study published on Tuesday.In the paper… [+3241 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "Twitching can be a Warning Sign of Cancer, Look for These Symptoms - News18", "description": "Cancer is characterised by the uncontrollable growth of abnormal cells that can spread anywhere in the body", "url": "https://www.news18.com/news/lifestyle/twitching-can-be-a-warning-sign-of-cancer-look-for-these-symptoms-5273911.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/03/world-cancer-day-164821611916x9.png", "publishedAt": "2022-06-01T12:58:35Z", "content": "A dreadful disease, cancer can affect any part of the human body including blood, bones, lungs or liver. Cancer is characterised by the uncontrollable growth of abnormal cells that can spread anywher… [+1778 chars]"}, {"source": {"id": null, "name": "News-Medical.Net"}, "author": null, "title": "Tracking the emergence of potential drug-resistant mutations in SARS-CoV-2 proteins - News-Medical.Net", "description": "Researchers hypothesized that the emergence of resistant SARS-CoV-2 variants can be anticipated by identifying possible escape mutations already present in the existing SARS-CoV-2 populations.", "url": "https://www.news-medical.net/news/20220601/Tracking-the-emergence-of-potential-drug-resistant-mutations-in-SARS-CoV-2-proteins.aspx", "urlToImage": "https://d2jx2rerrg6sh3.cloudfront.net/images/news/ImageForNews_715393_16540812677749530.jpg", "publishedAt": "2022-06-01T11:07:00Z", "content": "In a recent study posted to the bioRxiv* preprint server, researchers hypothesized that the emergence of resistant severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) variants can be anticip… [+5423 chars]"}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "How Bowl Method Can Help You Keep Your Calorie Intake In Check - News18", "description": "The bowl method simply involves choosing a small bowl to measure the portions of your food to prevent you from overeating", "url": "https://www.news18.com/news/lifestyle/how-bowl-method-can-help-you-keep-your-calorie-intake-in-check-5290369.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/06/untitled-design-8-165408126916x9.png", "publishedAt": "2022-06-01T11:02:14Z", "content": "Losing weight and going for a lean look is something almost everyone desires. While many of you may be training regularly in the gym and trying to shed those extra kilos, your diet plays an equally i… [+1573 chars]"}, {"source": {"id": null, "name": "India Education Diary"}, "author": "iednewsdesk", "title": "Johns Hopkins University: Common Medical Tool May Delay Treatment of Nonwhite Patients with COVID-19 - India Education Diary", "description": "A retrospective analysis of over 7,000 patients with COVID-19 found that pulse oximeter devices — tools that measure oxygen levels in the blood and that are used in virtually every U.S. hospital — overestimated blood oxygen levels in non-White patien", "url": "https://indiaeducationdiary.in/johns-hopkins-university-common-medical-tool-may-delay-treatment-of-nonwhite-patients-with-covid-19/", "urlToImage": "https://indiaeducationdiary.in/wp-content/uploads/2021/05/Johns-Hopkins-University.jpg", "publishedAt": "2022-06-01T10:50:48Z", "content": "A retrospective analysis of over 7,000 patients with COVID-19 found that pulse oximeter devices tools that measure oxygen levels in the blood and that are used in virtually every U.S. hospital overes… [+4347 chars]"}, {"source": {"id": null, "name": "Citizen Matters"}, "author": "Geeta Lal Sahai", "title": "Mental illness a ticking time bomb, say experts - Citizen Matters", "description": "Sadly, the state offers no help to families of people with mental illness, no medical help, economic security or concession of any sort.", "url": "https://citizenmatters.in/mental-illness-support-care-laws-guardianship-other-issues-30660", "urlToImage": "https://images.citizenmatters.in/wp-content/uploads/sites/2/2022/06/01122447/mental-illness-brain-pixabay-Jun22.jpg", "publishedAt": "2022-06-01T10:42:48Z", "content": "We are sitting on a mental health time bomb, say mental health experts. Our mental health policies need to be revisited.\r\nRepresentational image by Gerd Altmann/Pixabay CC0\r\nI just want to run away; … [+7067 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Mira Rajput consumes this wonder ingredient for her skin: 'No makeup, no skincare, just drinking…' - The Indian Express", "description": "\"If you do this for seven days, all the toxins get accumulated in the digestive system...\" said Dr Dixa Bhavsar, an Ayurvedic expert", "url": "https://indianexpress.com/article/lifestyle/health/mira-rajput-consumes-ghee-ingredient-skin-makeup-skincare-drinking-ghee-7946040/", "urlToImage": "https://images.indianexpress.com/2022/05/Mira-Rajput-1200-1.jpg", "publishedAt": "2022-06-01T10:20:20Z", "content": "Mira Rajput is a fitness and skincare enthusiast who likes to keep things natural and chemical-free.Limited Time Offer | Express Premium with ad-lite for just Rs 2/ day Click here to subscribe\r\nHer s… [+1962 chars]"}, {"source": {"id": null, "name": "ThePrint"}, "author": null, "title": "Science has proof of how bad diet can lead to bad memory - ThePrint", "description": "Campus Voice is an initiative by ThePrint where young Indians get an opportunity to express their opinions on a prevalent issue.", "url": "https://theprint.in/campus-voice/science-has-proof-of-how-bad-diet-can-lead-to-bad-memory/976669/", "urlToImage": "https://static.theprint.in/wp-content/uploads/2019/10/bacon-burger-beef-burger.jpg", "publishedAt": "2022-06-01T09:16:56Z", "content": "Strong immunity building is a drawing-room conversation in every house, especially after Covid. Despite an increased interest in the concept of immunity, most of the time we fail to put a stop to our… [+3836 chars]"}, {"source": {"id": null, "name": "News9live.com"}, "author": "Unnati Gusain", "title": "Zoonosis leads to 60% of all known infectious diseases, 75% emerging illnesses - News9 LIVE", "description": "A zoonosis is an infectious disease that is transmitted between species from animals to humans.", "url": "https://www.news9live.com/health/zoonosis-leads-to-60-of-all-known-infectious-diseases-75-emerging-illnesses-173718", "urlToImage": "https://media.news9live.com/h-upload/2022/06/01/407144-virus-a-member-of-the-virus-family-arenaviridae-is-a-single-stranded-rna-virus-and-is-zoonotic-850x5471.jpg", "publishedAt": "2022-06-01T07:29:20Z", "content": "Just as COVID-19, one of the worst zoonotic diseases was ebbing, monkeypox took over the headlines. According to the World Health Organization, monkeypox is a viral zoonotic disease, caused by monkey… [+5529 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Diabetes: 8 Sweet Snacks Safe For Diabetics - NDTV", "description": "Eating something delicious if you are craving something sweet is not ideal if you have diabetes. Here are sweet snacks completely safe for diabetics.", "url": "https://www.ndtv.com/health/diabetes-8-sweet-snacks-safe-for-diabetics-3026251", "urlToImage": "https://c.ndtvimg.com/2020-05/i3hiuje8_chia-pudding_625x300_08_May_20.jpg", "publishedAt": "2022-06-01T06:43:01Z", "content": "Chia pudding is a healthy and sweet snack for diabetics\r\nDiabetes is caused as a response to resistance to insulin in the cells. Insulin is the hormone that helps regulate the glucose levels in the b… [+3415 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Thyroid: Types of disorders, risk factors, symptoms, tests - Hindustan Times", "description": "Here's all you need to know about thyroid hormones in normal health and disease conditions, the types of disorders due to imbalance in thyroid hormones, their symptoms and protocol for testing of thyroid diseases | Health", "url": "https://www.hindustantimes.com/lifestyle/health/thyroid-types-of-disorders-due-to-imbalance-in-thyroid-hormones-risk-factors-symptoms-protocol-for-testing-of-thyroid-diseases-101654063659006.html", "urlToImage": "https://images.hindustantimes.com/img/2022/06/01/1600x900/FTzTfeQXsAMtjXR_1654064055678_1654064078267.jpg", "publishedAt": "2022-06-01T06:25:51Z", "content": "The thyroid gland, located in the front of the neck, is the main source of thyroid hormones in the body and hypothalamic thyrotropin-releasing hormone (TRH) stimulates thyroid-stimulating hormone (TS… [+6465 chars]"}, {"source": {"id": null, "name": "EastMojo"}, "author": "Press Trust of India", "title": "Acute stress may hamper body’s fight against Covid, influenza: Study - EastMojo", "description": "Washington: Acute stress may impair the body's ability to fight off infections, especially COVID-19, and increase the chance of dying, according to a", "url": "http://www.eastmojo.com/world/2022/06/01/acute-stress-may-hamper-bodys-fight-against-covid-influenza-study/", "urlToImage": "https://i0.wp.com/www.eastmojo.com/wp-content/uploads/2022/05/Untitled-design-8-13.png?fit=1920%2C1080&ssl=1", "publishedAt": "2022-06-01T06:10:00Z", "content": "Washington: Acute stress may impair the bodys ability to fight off infections, especially COVID-19, and increase the chance of dying, according to a study conducted in mice.\r\nThe research, published … [+3621 chars]"}, {"source": {"id": null, "name": "Biospectrumindia.com"}, "author": null, "title": "IIT-D study reveals mechanisms driving SARS-CoV-2 evolution in humans - BSI bureau", "description": "The results lay the necessary groundwork for future studies", "url": "https://www.biospectrumindia.com/news/58/21351/iit-d-study-reveals-mechanisms-driving-sars-cov-2-evolution-in-humans.html", "urlToImage": "https://www.biospectrumindia.com/uploads/articles/shutterstock_281615630-21351.jpg", "publishedAt": "2022-06-01T05:56:28Z", "content": "A team of researchers at the Indian Institute of Technology Delhi (IIT-D) has discovered the existence of temporal variations in selection pressures during SARS-CoV-2 evolution and adaptation to the … [+1222 chars]"}, {"source": {"id": null, "name": "Daijiworld.com"}, "author": null, "title": "1st case of monkeypox confirmed in Hungary - Daijiworld.com", "description": "Budapest, Jun 1 (IANS): Hungarian health authorities have confirmed the country's first case of monkeypox in a 38-year-old man.\r\nThe disease does not spread easily, only through close contact, said the chief medical officer Cecilia Muller in a press conferenc…", "url": "https://www.daijiworld.com/news/newsDisplay?newsID=964185", "urlToImage": "http://daijiworld.com/images/daijiSquareLogo.png", "publishedAt": "2022-06-01T05:02:44Z", "content": "Budapest, Jun 1 (IANS): Hungarian health authorities have confirmed the country's first case of monkeypox in a 38-year-old man.\r\nThe disease does not spread easily, only through close contact, said t… [+933 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": null, "title": "Arthritis: 10 Common Workout Mistakes That Might Be Worsening Your Arthritis - NDTV", "description": "Working out is great if you have arthritis but doing it incorrectly might worsen it. Here are the most common workout mistakes you might be making.", "url": "https://www.ndtv.com/health/arthritis-10-common-workout-mistakes-that-might-be-worsening-your-arthritis-3015212", "urlToImage": "https://c.ndtvimg.com/2020-03/n6ssraqo_stairs-_625x300_09_March_20.jpg", "publishedAt": "2022-06-01T04:39:23Z", "content": "If you have arthritis, taking stairs might worsen your symptoms\r\nArthritis refers to the condition under which, you experience pain, swelling, and stiffness in your joints. Arthritis may be due to gr… [+3820 chars]"}, {"source": {"id": null, "name": "Theswaddle.com"}, "author": "Esha Chainani", "title": "The Issue With Seeing PCOS As Just a 'Period Problem' - The Swaddle", "description": "People think of PCOS as a purely physical problem that occurs a few days a month, as opposed to a chronic condition that reduces the overall quality of life.", "url": "https://theswaddle.com/the-issue-with-seeing-pcos-as-just-a-period-problem/", "urlToImage": "https://swaddle-wkwcb6s.stackpathdns.com/wp-content/uploads/2022/06/PCOS-Editorials-min.png", "publishedAt": "2022-06-01T03:48:00Z", "content": "I constantly feel like Im a fat waste of space. These were the exact words Rekha*, 23 said when asked about her mental health during my consultation with her. \r\nAs a gynecologist in Mumbai specializi… [+8623 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Zarafshan Shiraz", "title": "Eye health tips: Excessive heat can harm your eyes. Here's how to keep them safe - Hindustan Times", "description": "The eyes are one of the most commonly affected body parts during summers as the scorching heat of the sun is extremely harmful for eye health. As a result, extra care and attention to the eyes are required during this time. Follow these guidelines to keep the…", "url": "https://www.hindustantimes.com/lifestyle/health/eye-health-tips-excessive-heat-can-harm-your-eyes-here-s-how-to-keep-them-safe-in-summers-101654052006488.html", "urlToImage": "https://images.hindustantimes.com/img/2022/06/01/1600x900/pexels-engin-akyurt-1552583_1654052488738_1654052509381.jpg", "publishedAt": "2022-06-01T03:12:32Z", "content": "Health experts insist that extra care and attention to the eyes are required during this time as people are battling not only intense heat waves but also the diseases that come with them as the mercu… [+5419 chars]"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": "Abhilash Gaur", "title": "How monkeypox virus escaped from the rainforests of Africa - Times of India", "description": "Rest of World News: In the 1950s the world was getting serious about fighting polio.", "url": "https://timesofindia.indiatimes.com/world/rest-of-world/how-monkeypox-virus-escaped-from-the-rainforests-of-africa/articleshow/91929322.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-47529300,width-1070,height-580,imgsize-110164,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2022-06-01T01:43:00Z", "content": ""}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "Express News Service", "title": "Manage your BP, manage your pregnancy - The New Indian Express", "description": "Blood pressure refers to the force exerted on your blood vessels wall by the flowing blood.", "url": "https://www.newindianexpress.com/cities/chennai/2022/jun/01/manage-your-bp-manage-your-pregnancy-2460252.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2022/4/10/w600X390/Pregnant_Woman_Photo.jpg", "publishedAt": "2022-06-01T01:27:00Z", "content": "CHENNAI: Blood pressure refers to the force exerted on your blood vessels wall by the flowing blood. You are said to have high blood pressure (also called hypertension) when this force of your blood … [+3466 chars]"}, {"source": {"id": null, "name": "Zoom"}, "author": "Times Now Digital", "title": "Does coffee protect against liver cancer, melanomas, oral and pharyngeal cancers OR causes the disease? A doct - Times Now", "description": "Dr Prasad Kasbekar, Consultant Surgical Oncologist, Masina Hospital, Byculla, Mumbai cites that studies suggest that coffee is not associated with cancers in general. A few studies have been associating coffee with the risk of bladder cancer and lung cancer, …", "url": "https://www.timesnownews.com/health/does-coffee-protect-against-liver-cancer-melanomas-oral-and-pharyngeal-cancers-or-causes-the-disease-a-doctor-explains-article-91929025", "urlToImage": "https://static.tnn.in/thumb/msid-91929025,imgsize-100,width-1280,height-720,resizemode-75/91929025.jpg", "publishedAt": "2022-06-01T01:15:45Z", "content": "Stocks to track in trade for June 02, 2022: RIL, Greaves Cotton, NMDC, Yes Bank, Religare, PDS"}, {"source": {"id": null, "name": "Neurosciencenews.com"}, "author": "https://www.facebook.com/neurosciencenews", "title": "When Should I Schedule My Exercise? - Neuroscience News", "description": "Women looking to reduce belly fat and blood pressure should exercise in the morning. Men who exercise in the evening showed improvements in metabolic and heart health, and improved overall emotional wellbeing.", "url": "https://neurosciencenews.com/exercise-time-day-20711/", "urlToImage": "https://neurosciencenews.com/files/2022/05/exercise-schedule-neurosicenes-public.jpg", "publishedAt": "2022-05-31T22:32:40Z", "content": "Summary: Women looking to reduce belly fat and blood pressure should exercise in the morning. Men who exercise in the evening showed improvements in metabolic and heart health, and improved overall e… [+8108 chars]"}, {"source": {"id": null, "name": "Medscape"}, "author": null, "title": "Type 2 Diabetes With Obesity - Medscape", "description": "Experts in endocrinology, psychology, and diet collaborate on a management plan for a patient with type 2 diabetes who has been struggling with glycemic control, weight loss, and mild depression.", "url": "https://www.medscape.com/case-review/t2d-obesity-s01/e01", "urlToImage": "", "publishedAt": "2022-05-31T20:37:43Z", "content": null}, {"source": {"id": null, "name": "The New Indian Express"}, "author": "Shreya Veronica", "title": "The fury of the West Nile Fever - The New Indian Express", "description": "So before the WhatsApp forwards reach you, we speak to doctors in the city who tell us everything about Nile fever.", "url": "https://www.newindianexpress.com/lifestyle/health/2022/jun/01/the-fury-of-the-west-nile-fever-2460264.html", "urlToImage": "https://images.newindianexpress.com/uploads/user/imagelibrary/2019/4/11/w600X390/West-Nile.jpg", "publishedAt": "2022-05-31T19:18:00Z", "content": "If you're one who consumes news regularly, then you probably heard about the West Nile Fever. A 47-year-old man succumbed to the illness in Kerala recently, which has caused widespread fear across th… [+2382 chars]"}, {"source": {"id": null, "name": "Cureus.com"}, "author": null, "title": "Acute Myocardial Infarction After COVID-19 Vaccination: A Case Report - Cureus", "description": "Following the coronavirus disease 2019 (COVID-19) pandemic, nations all over the world started vaccination programs against the SARS-CoV2 virus. With the widespread administration of the vaccine across the globe, various cases were reported with thrombotic ev…", "url": "https://www.cureus.com/articles/94893-acute-myocardial-infarction-after-covid-19-vaccination-a-case-report", "urlToImage": "https://assets.cureus.com/uploads/figure/file/362096/article_river_a05d5a90bc9e11ecb6c169d390228567-Figure-1.png", "publishedAt": "2022-05-31T17:39:04Z", "content": "Following the coronavirus disease 2019 (COVID-19) pandemic, nations all over the world started vaccination programs against the SARS-CoV2 virus. With the widespread administration of the vaccine acro… [+12842 chars]"}, {"source": {"id": "the-washington-post", "name": "The Washington Post"}, "author": "Anna Nordberg", "title": "How to parent a picky eater - The Washington Post", "description": "Picky eating is a typical stage of development for children. Here are expert tips to make sure picky eaters stay healthy.", "url": "https://www.washingtonpost.com/parenting/2022/05/31/picky-eaters-children/", "urlToImage": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/W7LWRZW3U4I6ZPBVVEOQVFESHM.jpg&w=1440", "publishedAt": "2022-05-31T16:30:00Z", "content": "Placeholder while article actions load\r\nPicky eating is one of those challenges thats practically guaranteed to make parents go bananas. Not only is it frustrating to cook a healthy meal, have your c… [+6391 chars]"}, {"source": {"id": null, "name": "The Indian Express"}, "author": "Lifestyle Desk", "title": "Understanding the link between tobacco consumption and infertility in women - The Indian Express", "description": "World No Tobacco Day is observed on May 31 every year, and the theme for this year – “tobacco is killing us and our planet” – highlights how it is not only deteriorating our lives but also altering our future generations", "url": "https://indianexpress.com/article/lifestyle/health/world-no-tobacco-day-consumption-infertility-women-7944371/", "urlToImage": "https://images.indianexpress.com/2022/05/infertility_200_gettu.jpg", "publishedAt": "2022-05-31T14:30:26Z", "content": "The impact of intoxicants, such as tobacco, on both male and female health has been reported widely. Irrespective of the quantity or frequency of consumption, it can affect the lungs, heart, neck and… [+3639 chars]"}, {"source": {"id": null, "name": "Hindustan Times"}, "author": "Parmita Uniyal", "title": "Is your dinner time raising your risk of stroke? Know what an expert has to say - Hindustan Times", "description": "A recent study shows that having meals at irregular times or post 8 pm can increase the risk of haemorrhagic stroke. | Health", "url": "https://www.hindustantimes.com/lifestyle/health/is-your-dinner-time-raising-your-risk-of-stroke-know-what-an-expert-has-to-say-101654006445569.html", "urlToImage": "https://images.hindustantimes.com/img/2022/05/31/1600x900/dinner_thumb_1654006561373_1654006572118.jpg", "publishedAt": "2022-05-31T14:22:24Z", "content": "Your dinner time can impact your overall health in ways that you may not have imagined. Eating late at night can lead to weight trouble. It can also interfere with your sleep as your digestive system… [+2196 chars]"}, {"source": {"id": null, "name": "Eatthis.com"}, "author": "Rebecca Strong", "title": "5 Worst Foods for Blood Circulation, Say Dietitians — Eat This Not That - Eat This, Not That", "description": "The good news is that you have more control over your circulation than you might realize, and it starts with what you eat.", "url": "http://www.eatthis.com/worst-foods-for-blood-circulation/", "urlToImage": "https://www.eatthis.com/wp-content/uploads/sites/4/2022/03/potato-chips.jpg?quality=82&strip=all", "publishedAt": "2022-05-31T14:12:36Z", "content": "Maintaining proper blood circulation may not be at the top of your priorities, but the truth is, it's one of the best things you can do for your overall health.\r\n\"Circulation involves sending blood, … [+6895 chars]"}, {"source": {"id": null, "name": "Down To Earth Magazine"}, "author": null, "title": "Probable cases of acute hepatitis in children cross 600, cause remains unknown - Down To Earth Magazine", "description": "As many as 38 children required transplants and nine died", "url": "https://www.downtoearth.org.in/news/health/probable-cases-of-acute-hepatitis-in-children-cross-600-cause-remains-unknown-83094", "urlToImage": "https://cdn.downtoearth.org.in/library/large/2022-05-31/0.50166800_1653998155_istock-817180340.jpg", "publishedAt": "2022-05-31T12:23:40Z", "content": "The number of probable cases of acute hepatitis in children have climbed to 650 in 33 countries from April 5-May 26, 2022, according to the World Health Organization (WHO). \r\nOn April 5, there were 1… [+3355 chars]"}, {"source": {"id": null, "name": "Moneycontrol"}, "author": "Moneycontrol News", "title": "Food For All Ages | A look at the ideal foods to eat healthily at every stage of life - Moneycontrol", "description": "From the moment we make our kicking-screaming entrance into this world, food is one of only a handful of things that we would perish without. But we can’t just ingest any food at any age, not if we want to have a fighting chance at the madness that is life. A…", "url": "https://www.moneycontrol.com/news/photosworld/food-for-all-ages-a-look-at-the-ideal-foods-to-eat-healthily-at-every-stage-of-life-8614431.html", "urlToImage": "https://images.moneycontrol.com/static-mcnews/2022/05/Eid-food-770x433.jpg", "publishedAt": "2022-05-31T11:52:30Z", "content": null}, {"source": {"id": null, "name": "Zoom"}, "author": "Kirti Pandey", "title": "How COVID-19 infection impacted Multiple Sclerosis patients severely; new findings on treatment, potential cur - Times Now", "description": "People with multiple sclerosis (MS) are a vulnerable group to severe coronavirus disease 2019 (COVID-19), particularly those taking immunosuppressive disease-modifying therapies (DMTs). Here are the latest study findings and the latest research on treatment, …", "url": "https://www.timesnownews.com/health/how-covid-19-infection-impacted-multiple-sclerosis-patients-severely-new-findings-on-treatment-potential-cure-to-ms-article-91916251", "urlToImage": "https://static.tnn.in/thumb/msid-91916251,imgsize-100,width-1280,height-720,resizemode-75/91916251.jpg", "publishedAt": "2022-05-31T11:14:23Z", "content": "Stocks to track in trade for June 02, 2022: RIL, Greaves Cotton, NMDC, Yes Bank, Religare, PDS"}, {"source": {"id": "the-times-of-india", "name": "The Times of India"}, "author": null, "title": "On World No Tobacco Day, Meet Nico- A first of its kind personal user interface by Nicotex to help smoke - Times of India", "description": "Spotlight News: On World No Tobacco Day, Nicotex has launched Nico, a first of its kind personal user interface that will help smokers kick the butt by providing the", "url": "https://timesofindia.indiatimes.com/spotlight/on-world-no-tobacco-day-meet-nico-a-first-of-its-kind-personal-user-interface-by-nicotex-to-help-smokers-during-their-quit-smoking-journey/articleshow/91913742.cms", "urlToImage": "https://static.toiimg.com/thumb/msid-91917219,width-1070,height-580,imgsize-117622,resizemode-6,overlay-toi_sw,pt-32,y_pad-40/photo.jpg", "publishedAt": "2022-05-31T11:03:00Z", "content": null}, {"source": {"id": null, "name": "News18"}, "author": "Lifestyle Desk", "title": "From Boosting Immunity to Preventing Skin Infection, Bael is Perfect Summer Fruit - News18", "description": "Bael juice is a perfect summer drink which rejuvenates, cleanses, and nourishes the body with all the nutrients.", "url": "https://www.news18.com/news/lifestyle/from-boosting-immunity-to-preventing-skin-infection-bael-is-perfect-summer-fruit-5283247.html", "urlToImage": "https://images.news18.com/ibnlive/uploads/2022/05/untitled-design-2-94-165399488116x9.png", "publishedAt": "2022-05-31T11:01:54Z", "content": "Soothing and refreshing beverages go a long way in beating the scorching heat in summers. Aegle Marmelos, commonly known as Bael, is rich in fibre and nutrients like proteins, beta-carotene, fibre, r… [+1804 chars]"}, {"source": {"id": null, "name": "NDTV News"}, "author": "DoctorNDTV", "title": "Wala Or Khus: Nutritionist Rujuta Diwekar Outlines Its Benefits, Especially In Summer - NDTV Doctor", "description": "Nutritionist Rujuta Diwekar shared the benefits of vetiver roots and the different ways in which they can be used", "url": "https://doctor.ndtv.com/living-healthy/rujuta-diwekar-highlights-the-benefits-of-vetiver-roots-or-wala-in-an-instagram-video-3014542", "urlToImage": "https://c.ndtvimg.com/2020-09/h8ff8fdg_shower-gel_625x300_15_September_20.jpg", "publishedAt": "2022-05-31T10:04:30Z", "content": "Some age-old traditions may look simple or old to follow, but they carry several health benefits. One such thing native to India is vetiver, also known as khus or wala. Do you know vetiver works as a… [+2395 chars]"}, {"source": {"id": null, "name": "Theswaddle.com"}, "author": "The Swaddle Team", "title": "Body Matters: How Non-binary Patients Navigate Gynaec Offices - The Swaddle", "description": "\"When you enter a gynaec's office, it doesn't matter whether you're a woman or not -- what matters is that you are a female-bodied person.\"", "url": "https://theswaddle.com/body-matters-how-non-binary-patients-navigate-gynaec-offices/", "urlToImage": "https://swaddle-wkwcb6s.stackpathdns.com/wp-content/uploads/2022/05/Body-Matters-Misgendering-Editorials-min-1.png", "publishedAt": "2022-05-31T09:57:00Z", "content": "In Body Matters, we explore the lived experiences of OB-GYN patients in India who defy stereotypical gender expectations, and challenge what it means to be a body that matters in medicine.\r\nGynecolog… [+7793 chars]"}]}